[
 [
  [
   21995, 
   null, 
   "montalban", 
   "While partaking in these debates it is clear that a few things have emerged\n a) very few if any Muslims are responding to these posts re: religion\n b) there is a wide variety of Christian views out there.\n \n I do believe that Islam is not a progressive religion. the fact that we can have so many Christian viewpoints allows a pluralist/democratic existence. With Islam, it's the word of their god, and their seems little lee-way for interpretation.\n \n And certainly we Christians are a lot more tolerant of criticisms; as even people like Lurch and Crim who constantly barrage Christians don't seem to realise that they are 'free' to do so.", 
   {
    "post_info": {
     "post_title": "Islam"
    }
   }, 
   null, 
   null, 
   1068338520.0
  ], 
  [
   21998, 
   null, 
   "Charchuk", 
   "While partaking in these debates it is clear that a few things have emerged\n a) very few if any Muslims are responding to these posts re: religion\n b) there is a wide variety of Christian views out there.\n \n I do believe that Islam is not a progressive religion. the fact that we can have so many Christian viewpoints allows a pluralist/democratic existence. With Islam, it's the word of their god, and their seems little lee-way for interpretation.\n \n And certainly we Christians are a lot more tolerant of criticisms; as even people like Lurch and Crim who constantly barrage Christians don't seem to realise that they are 'free' to do so.\n\n \n Islam is where Christianity was around 300 or 400 years ago. Give it some time to mature. :)", 
   {}, 
   21995, 
   null, 
   1068339120.0
  ], 
  [
   22001, 
   null, 
   "Parcum", 
   "The difference between christianity 300-400 years ago (although it was a bit earlier than that) and Islam now is that in Christianity what we were doing (Inquisition, slaughtering eachother, et cetera) was wrong. In Islam, their actions are done because of their religion. Christianity is a religion of peace through tolerance, Islam is a religion of peace through discipline.", 
   {}, 
   21998, 
   null, 
   1068339960.0
  ], 
  [
   22009, 
   null, 
   "Charchuk", 
   "The difference between christianity 300-400 years ago (although it was a bit earlier than that) and Islam now is that in Christianity what we were doing (Inquisition, slaughtering eachother, et cetera) was wrong. In Islam, their actions are done because of their religion. Christianity is a religion of peace through tolerance, Islam is a religion of peace through discipline.\n\n \n You actually believe that nonsense? Both believe that they are doing the will of their god. The only difference is that Christianity won and got to spread it to more. Saying that Christianity actually about tolerance is like saying that the the.... You know, I couldn't come up with an example of anything which was more intolerant then Christianity and its followers. :) They mostly just practice peace and tolerence towards their own kind. Anyone which they can't \"save\" is fair game.", 
   {}, 
   22001, 
   null, 
   1068342060.0
  ], 
  [
   22013, 
   null, 
   "Parcum", 
   "The only difference is that Christianity won and got to spread it to more.\n\n \n not really. In fact, Islam used to be bigger than Christianity for about a thousand years. It was only because of the American Missions that we saved more souls. Also the Chinese missions helped a bit (there are around 35-50 million Christians in China).", 
   {}, 
   22009, 
   null, 
   1068343440.0
  ], 
  [
   22016, 
   null, 
   "gilligan8503", 
   "not really. In fact, Islam used to be bigger than Christianity for about a thousand years. It was only because of the American Missions that we saved more souls. Also the Chinese missions helped a bit (there are around 35-50 million Christians in China).\n\n so you are a christian...", 
   {}, 
   22013, 
   null, 
   1068349020.0
  ], 
  [
   22051, 
   null, 
   "Charchuk", 
   "not really. In fact, Islam used to be bigger than Christianity for about a thousand years. It was only because of the American Missions that we saved more souls.\n\n \n Who told you that bit of nonsense? Islam is around 600 years younger than Christian. So, that means that up til the 17th century (A period when the Church was at its greatest power and control) there were more Muslims holding more land in the world? What parts of the new world were Islamic?\n \n Islam is the fastest growing belief system in the world now, though. 1.8 billion (adjusted) Christians to 1.3 billion Muslims. And the gap is quickly closing.\n \n Christianity is growing at a stagnant rate of around 2.3% per year.\n Islam 2.9% (and climbing)\n Whereas the world pop. is growing at around 2.3% per year, though, this rate is on the increase as well. So, even though Christianity is still growing when you compare it to the percentage of people in the would who are Christian it is actually a decline. I estimate that within 50 to 100 years Islam will be the dominant religion on Earth\n \n \nAlso the Chinese missions helped a bit (there are around 35-50 million Christians in China).\n\n \n That is nothing in comparison to those who follow Falun Gong in China, which is around 70 million (Some say 100 million), and it has only been around since 1992. Christianity has had centuries to work there and it is still behind.\n \n http://edition.cnn.com/2002/WORLD/asiapcf/east/07/24/china.fg.overview/index.html", 
   {}, 
   22013, 
   null, 
   1068388440.0
  ], 
  [
   22077, 
   null, 
   "Parcum", 
   "so you are a christian...\n\n \n Never said I wasn't. \n \n \nI estimate that within 50 to 100 years Islam will be the dominant religion on Earth\n\n \n I do too. Why? Because the Muslims are following their beliefs are fruitfully multiplying. They arn't converting anyone.", 
   {}, 
   22051, 
   null, 
   1068417720.0
  ], 
  [
   22083, 
   null, 
   "gilligan8503", 
   "Never said I wasn't.\n\n you seemed quite ashamed of it in previous posts. or maybe, you just thought it would hinder your name-calling in those same posts.\n \n \nI do too. Why? Because the Muslims are following their beliefs are fruitfully multiplying. They arn't converting anyone.\n\n you're right, absolutely no one is converting to muslim...\n \n by the way, your picture description says: \"your god.\"\n lucifer did the same thing... wanting to be god.", 
   {}, 
   22077, 
   null, 
   1068421620.0
  ], 
  [
   22085, 
   null, 
   "Charchuk", 
   "Never said I wasn't. \n \n \n \n I do too. Why? Because the Muslims are following their beliefs are fruitfully multiplying. They arn't converting anyone.\n\n \n Really? I know that you'd like to believe that, but by the looks of it, you are wrong, but then again they aren't using Christianity's favorite method of \"conversion\". Believe or die!\n \n Here is a comparison between Islam and Christianity.\n \n http://www.religioustolerance.org/comp_isl_chr.htm", 
   {}, 
   22077, 
   null, 
   1068422220.0
  ], 
  [
   22125, 
   null, 
   "Parcum", 
   "Actually Islam has mastered in the art of \"conversion or the sword\". I could quote from the Qu'ran, but I'm going to go directly into it's history. In the early stages of Islam they were generally outcasts, and made fun of. There were two major religions in the area where Mohammad was; Paganism and Judaism. The Pagans being the major religion resided in several cities, including Medina. In this town resided the Banu-Kuraiza Jews. The Jews disliked Mohammad and laughed at his interpretations of the bible, but didn't use any violence against them. The Jews would simply spit at the Mohammadans and the like. Whne Mohammad heard of the mild persecution he sent 3000 men into Medina and went to the Banu-Kuraiza Jews and gave them a choice of Islam or death. They chose the latter, and 600 men, women, and children were slaughtered into a mass grave. Shortly afterwards, the Quraish tribe, which was Muslim asked MOhammad to stop wars and have a time of peace. Mohammad agreed, but his soldiers were shocked. He allowed them to kill the Khaibar Jews (Jews who helped Mohammad fight), who tried to defend themselves, but 90 of them died in the process. \n \n These are the beginnings of Islam. We compare it to Christianity, where Christ was spat at, and instead of slaughtering the men who did it, he forgave them. Christianity's motto is \"turn the other cheek\", while Islam's is \"Islam or death\". Christians may have given people a choice of Christianity or death, but it isn't in our faith to do that. It is, however, in Islam's faith to do so.", 
   {}, 
   22085, 
   null, 
   1068446520.0
  ], 
  [
   22134, 
   null, 
   "gilligan8503", 
   "Actually Islam has mastered in the art of \"conversion or the sword\". I could quote from the Qu'ran, but I'm going to go directly into it's history. In the early stages of Islam they were generally outcasts, and made fun of. There were two major religions in the area where Mohammad was; Paganism and Judaism. The Pagans being the major religion resided in several cities, including Medina. In this town resided the Banu-Kuraiza Jews. The Jews disliked Mohammad and laughed at his interpretations of the bible, but didn't use any violence against them. The Jews would simply spit at the Mohammadans and the like. Whne Mohammad heard of the mild persecution he sent 3000 men into Medina and went to the Banu-Kuraiza Jews and gave them a choice of Islam or death. They chose the latter, and 600 men, women, and children were slaughtered into a mass grave. Shortly afterwards, the Quraish tribe, which was Muslim asked MOhammad to stop wars and have a time of peace. Mohammad agreed, but his soldiers were shocked. He allowed them to kill the Khaibar Jews (Jews who helped Mohammad fight), who tried to defend themselves, but 90 of them died in the process. \n \n These are the beginnings of Islam. We compare it to Christianity, where Christ was spat at, and instead of slaughtering the men who did it, he forgave them. Christianity's motto is \"turn the other cheek\", while Islam's is \"Islam or death\". Christians may have given people a choice of Christianity or death, but it isn't in our faith to do that. It is, however, in Islam's faith to do so.\n\n i posted this on another post:\n \n \"2000 years of christian heritiage:\n http://www.geocities.com/iconoclastes.geo/victims.html\"", 
   {}, 
   22125, 
   null, 
   1068448800.0
  ], 
  [
   22139, 
   null, 
   "Parcum", 
   "That sources are not crediable. Look at the sources;\n \n Opus Diaboli, (work of satan)\n Atheism from the Reformation to the Enlightenment (since when are atheists big Christian-fans?\n  The Vatican's Holocaust and  The Yugoslav Auschwitz and the Vatican(oh yeah, really crediable)\n \n (several others)\n \n Anyone can list Islam being just as bad. I'm not claiming that Christianity is a perfect religion- it isn't. In fact, we shouldn't be perfect as satan wants to attack this church more then ever. However, in our earliest stages of faith (according to your source, prior to 315 AD, although I highly doubt the credibility), we preached that it was wrong to do such things. Our doctrine is against those acts. However, Islam's version of Christ, Mohammad, killed thousands of people. Is this a peaceful religion?", 
   {}, 
   22134, 
   null, 
   1068451740.0
  ], 
  [
   22142, 
   null, 
   "gilligan8503", 
   "That sources are not crediable. Look at the sources;\n \n Opus Diaboli, (work of satan)\n Atheism from the Reformation to the Enlightenment (since when are atheists big Christian-fans?\n  The Vatican's Holocaust and  The Yugoslav Auschwitz and the Vatican(oh yeah, really crediable)\n \n (several others)\n \n Anyone can list Islam being just as bad. I'm not claiming that Christianity is a perfect religion- it isn't. In fact, we shouldn't be perfect as satan wants to attack this church more then ever. However, in our earliest stages of faith (according to your source, prior to 315 AD, although I highly doubt the credibility), we preached that it was wrong to do such things. Our doctrine is against those acts. However, Islam's version of Christ, Mohammad, killed thousands of people. Is this a peaceful religion?\n\n funny how he says nothing i said is credible, even with credible evidence. so you say none of this happened?\n \n you really don't like being wrong do you?", 
   {}, 
   22139, 
   null, 
   1068452760.0
  ], 
  [
   22146, 
   null, 
   "Parcum", 
   "Um, that's because the sources aer all from people who aer anti-Christian. They're not crediable. My source is actually from an X-Catholic now atheist, Will Durant, who is a very well-known historian. I got the sources from the book Age of Faith.", 
   {}, 
   22142, 
   null, 
   1068453480.0
  ], 
  [
   22148, 
   null, 
   "montalban", 
   "Really? I know that you'd like to believe that, but by the looks of it, you are wrong, but then again they aren't using Christianity's favorite method of \"conversion\". Believe or die!\n \n Here is a comparison between Islam and Christianity.\n \n http://www.religioustolerance.org/comp_isl_chr.htm\n\n \n Did you know that web-site is Islamic? Why are you openly pushing a Muslim interpretation of Christianity? (I suggest this because they say \"Jesus (pbuh)\" which means 'peace be upon him' which is they way Muslims write about 'prophets'.\n \n Earlier you said that Islam is where Christianity was 300 years or so ago. Do you realise the implications of the logic in this statement? It suggests that Judaism, an older religion should be even more 'liberal' than Christianity, and that Scientology (debateable if it is a religion at all) is even more reactionary than Islam.\n \n Tell me, how has Islam 'progressed' to the point where they are still 300 years behind us... that is, how has the treatment of women changed between when Muhammed first declared that hell was full of them, to now.\n \n I have come across the (small 'l') liberal-educated person before who wishes that there would be peace harmony and understanding betwixt Islam and Christianity. Unfortunately this is projecting the thinkers own liberal idealogies onto the two faiths. Does Islam actually accord itself to liberal ideas?\n \n One of these liberal notions, encouraged by Isalmic people is that Islam is progressive, because it enshrined rights for women. Further, that men and women are equal in Islam. There is a germ of truth in this, but it is such a superficial treatment that it's not worth repeating by liberals.\n \n Are women equal in Islam? \"Men have fear of your Lord, who created you from a single soul. From that soul He created its mate and through them He bestrewed the earth with countless men and women\" (Sura 4:1). This clearly suggests that men and women were created from the same substance. Muslims will point to this as 'proof' that men and women are considered equal in Islam. However, Sura 2:228 states \"Women shall with justice have rights similar to those exercised against them, although men have a status above women.\" However this difference in status runs much deeper. In legal testimony, \"Call in two male witnesses from among you, but if two men cannot be found, then one man and two women whom you judge fit to act as witnesses\" (Sura 2:282), in other words a woman's testimony is worth half of a man's.\n \n Can Muslim women be beaten? \"Good women are obedient. They guard their unseen parts because God has guarded them. As for those from whom you fear disobedience, admonish them and send them to beds apart and beat them\" (Sura 4:34) (though some Islamic scholars claim that this is a symbolic 'beating' only where-by the husband just 'taps' his wife on the arm. Although the wording does not say it should be but a symbolic tap, it should be noted anyway that it still points to male domination over women. (and it is an interpretation that is in the minority)\n \n It is clear that Muhammed 'loved' women, he kept nine wives and numerous concubines. But is this love? What did he invoke his followers to do? \"Omar reported from the Holy Prophet (Muhammed) who said, 'No man shall be questioned for beating his wife.'\" (Al Hadis, Vol. 1, p. 215) \n \"The prophet said: 'When a man calls his wife to bed and she does not come, the husband spends the night being angry with her, and the angels curse her until morning. The one who is in heaven is displeased with her until the husband is pleased with her.'\"(Sahih hadith, chapter 558) \n \n \"The Prophet (Muhammed) said: 'I was shown the Hell-fire and that the majority of its dwellers were women who were ungrateful.' It was asked, 'Do they disbelieve in Allah?' (or are they ungrateful to Allah?) He replied, 'They are ungrateful to their husbands and are ungrateful for the favours and the good (charitable deeds) done to them. If you have always been good (benevolent) to one of them and then she sees something in you (not of her liking), she will say, 'I have never received any good from you.'\" (Hadith, Sahih Bukhari 1:2:28) \n \n \"Abu Sayeed al-Khodri reported that Muhammed was talking to a group of women when he said, '... I see the majority of you will go to Hell.' The women asked why, to which Muhammed responded, 'You often curse and are ungrateful to your companions.' He then told them they had a basic defect in their nature, to which they responded, 'How?' Muhammed answered, 'Is not the attestation (knowledge and witness) of a women only worth half of a man's? And that is on account of her short intelligence.'\"(Al-Hadis, Vol. 3, p. 137)\n \n Okay, so these words of Islam were written years ago. What relevance do they have today? Can I remind you that the Koran is seen as the word of their god. To question it is to commit blasphemy. The Haddiths are the doings of Muhammed. Moslems believe that he was the most perfect of men, that his example should be followed. In Islam, women are clearly inferior to Men.\n The list goes on...\n \n \"Allah's Apostle once said to a group of women : 'I have not seen any one more deficient in intelligence and religion than you. A cautious, sensible man could be led astray by some of you.' The women asked: 'O Allah's Apostle, what is deficient in our intelligence and religion?' He said: 'Is not the evidence of two women equal to the witness of one man?' They replied in the affirmative. He said: 'This is the deficiency of your intelligence' ... 'Isn't it true that a woman can neither pray nor fast during her menses?' The women replied in the affirmative. He said: 'This is the deficiency in your religion.'?Sahih Bukhari, Arabic-English translation, 1 Hadith No. 301. See also vol. 3, Hadith No. 826.\n \"The prophet of Allah said: When a man calls his wife to satisfy his desire, let her come to him though she is occupied at the oven.\"\n Mishkat al-Masabih, English translation, Book I, Section 'Duties of husband and wife', Hadith No. 61\n \n Islam protects children is another claim made. In pre-Islamic Arabia there was the frequent practice of female infanticide; the killing of unwanted female children. Islam stopped this. But how does Islam evoke protection of female children?\n Let?s look at the Haddiths (Volume 7, Book 62, Number 64: Narrated 'Aisha')\n that the Prophet married her when she was six years old and he consummated his marriage when she was nine years old, and then she remained with him for nine years (i.e., till his death).\n Sahih Bukhari Volume 7, Book 62, Number 64, from http://www.quraan.com/Bukhari/62.asp\n \n Thus when the Ayatollah Khemani married a ten year old (he was twenty at the time), he was simply following the example of Muhammed?. Yes there are child-marriages going on in non-Muslim areas of the world, but please remember that\n in Islam it is actually supported by their leader. It is done BECAUSE of their religious beliefs.\n Furthermore, \n \"...[T]he Prophet (Muhammed) said to her (Aisha), 'You have been shown to me twice in my dream. I saw you pictured on a piece of silk and someone said (to me). 'This is your wife.' When I uncovered the picture, I saw that it was yours. I said, 'If this is from Allah, it will be done.'\" (Hadith, Sahih Bukhari 5:58:235). Remember, that she was only a child. He is fantasising about a little girl.\n \n Thus when the Ayatollah Khemani married a ten year old (he was twenty at the time), he was simply following the example of Muhammed?. Yes there are child-marriages going on in non-Muslim areas of the world, but please remember that\n in Islam it is actually supported by their leader. It is done BECAUSE of their religious beliefs.\n Furthermore, \n \"...[T]he Prophet (Muhammed) said to her (Aisha), 'You have been shown to me twice in my dream. I saw you pictured on a piece of silk and someone said (to me). 'This is your wife.' When I uncovered the picture, I saw that it was yours. I said, 'If this is from Allah, it will be done.'\" (Hadith, Sahih Bukhari 5:58:235). Remember, that she was only a child. He is fantasising about a little girl!\n 'Abd ar-Rahman al-Gaziri, al-Fiqh 'ala al-Mazahib al-Arba'a, Dar al-Kutub al- 'Elmeyah, 1990, vol. 4, p. 488.\n \n I must stress again that Islam teaches that Muhammed is the ideal man. He is the most perfect of men? so to follow his example is actually seen by Moslems as a good thing. One counter-argument to this was that because Muhammed only ever had one child, he couldn?t have possibly had sex with all these females. But, remember, the Haddith of Aisha is quite specific, and it is a Haddith that Muslims teach!\n \n For instance it (your web-site) says that racism is not approved by Islam by is practiced by Muslims.\n \n They forget the words of their founder because Muhammed didn?t just loathe women and non-Muslims, but black people as well?\"Abu Darda reported that the Holy Prophet (Muhammed) said: Allah created Adam when he created him. Then He stroke his right shoulder and took out a white race as if they were seeds, and He stroke his left shoulder and took out a black race as if they were coals. Then He said to those who were in his right side: Towards paradise and I don't care. He said to those who were on his left shoulder: Towards Hell and I don't care.\"\n (Hadith, Mishkat ul-Masabih, translated by Karim, v. iii, p. 117)\n \n Muhammed spends much time talking of hate and war and violence.\n \"As for those who are slain in the cause of God, He will not allow their works to perish. ... He will admit them to the Paradise He has made known to them.\" (47:8)\n \n \"Let those who would exchange the life of this world for the hereafter, fight for the cause of God; whether he dies or triumphs, We shall richly reward him. ... The true believers fight for the cause of God, but the infidels fight for the devil. Fight then against the friends of Satan ...\" (4:74,76)\n \"The believers who stay at home??apart from those that suffer a grave impediment??are not the equals of those who fight for the cause of God with their goods and their persons. God has given those that fight with their goods and their persons a higher rank than those who stay at home ...\" (4:95,96)\n \"Slay the idolaters wherever you find them. ... lie in ambush everywhere for them. If they repent and take to prayer and render the alms levy, allow them to go their way ...\" (9:5)\n \"Those that make war against God and His apostle and spread disorder in the land shall be put to death or crucified or have their hands and feet cut off on alternate sides, or be banished from the land. They shall be held up to shame in this world and sternly punished in the hereafter: except those that repent before you reduce them ...\" (5:34,35)\n \"Make war on them until idolatry shall cease and God?s religion shall reign supreme\" (8:39)\n \"Prophet, rouse the faithful to arms. If there are twenty steadfast men among you, they shall vanquish two hundred; and if there are a hundred, they shall rout a thousand unbelievers, for they are devoid of understanding.\" (8:65)\n \"Fight against such of those to whom the Scriptures were given ... and do not embrace the true Faith, until they pay tribute out of hand and are utterly subdued.\" (9:29)\n \"Allah's Apostle (Muhammed) said, 'Know that Paradise is under the shades of swords.'\" \n (Hadith, Sahih Bukhari 4:52:73) \n \"Allah's Apostle (Muhammed) said, 'The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him.'\" \n (Hadith, Sahih Bukhari, Volume 4, Book 52, Number 177) \n \"The Prophet (Muhammed) said: 'When the slave runs away from his master, his prayer is not accepted; he is an infidel.'\" \n (Hadith No. Muslim 32) \n \"The Prophet (Muhammed) said: 'Then go to the persons who do not join the congregational prayer and order their homes to be burnt...'\" \n (Hadith No. Muslim 234) \n \"Narrated 'Abdullah: Allah's Apostle (Muhammed) said, 'The blood of a Muslim who confesses that none has the right to be worshipped but Allah and that I am His Apostle, cannot be shed except in three cases: In Qisas for murder, a married person who commits illegal sexual intercourse and the one who reverts from Islam (apostate) and leaves the Muslims.'\" \n (Hadith, Sahih Bukhari 9:83:17)\n \"The Prophet (Muhammad) said: 'Do not stone the adulteress who is pregnant until she has had her child.' After the birth she was put into a ditch up to her chest and the Prophet commanded them to stone her. Khalid came forward with a stone which he threw at her head, and there spurted blood on the face of Khalid and he cursed her. The gentle Prophet prayed over her and she was buried.\" \n (Hadith No. Muslim 682) \n \"Bani An-Nadir and Bani Quraiza fought, so the Prophet (Muhammad) exiled Bani An-Nadir and allowed Bani Quraiza to remain at their places. He then killed their men and distributed their women, children and property among the Muslims, but some of them came to the Prophet and he granted them safety, and they embraced Islam. He exiled all the Jews from Medina. They were the Jews of Bani Qainuqa', the tribe of 'Abdullah bin Salam and the Jews of Bani Haritha and all the other Jews of Medina.\" \n (Hadith, Sahih Bukhari 5:59:362)\n \"Narrated Anas: 'Some people from the tribe of 'Ukl came to the Prophet (Muhammed) and embraced Islam. The climate of Medina did not suit them, so the Prophet ordered them to go to the camels of charity and to drink, their milk and urine. They did so, and after they had recovered from their ailment (became healthy) they turned renegades (reverted from Islam) and killed the shepherd of the camels and took the camels away. The Prophet sent (some people) in their pursuit and so they were (caught and) brought, and the Prophet ordered that their hands and legs should be cut off and that their eyes should be branded with heated pieces of iron, and that their cut hands and legs should not be cauterized, till they die.'\" \n (Hadith, Sahih Bukhari 8:82:794)\n \n There is no Islamic equivalent of ?turn the other cheek?, or ?blessed are the peacemakers?. What about ?love thy neighbour??\n \"O you who believe! Do not take the Jews and the Christians for friends; they are friends of each other; and whoever amongst you takes them for a friend, then surely he is one of them; surely Allah does not guide the unjust people.\" (Koran 5:51)\n \"O ye who believe! Take not for friends Unbelievers (non-Muslims) rather than believers: Do ye wish to offer Allah an open proof against yourselves?\" \n (Koran 4:144) \n \"Thou seest many of them turning in friendship to the Unbelievers (non-Muslims). Evil indeed are (the works) which their souls have sent forward before them (with the result), that Allah's wrath is on them, and in torment will they abide.\" \n (Koran 5:80)\n \n I must stress that these are teachings revered by Muslims! They saw it as clever that Muhammed massacred PoWs; that it was prudent that he order assinations; that he was a real man that he slept with so many women!\n \n The major problem about progress for Islam is that there concept of the Koran is that it is the direct word from god. To argue against it isn't a matter of a mistranslation, or that the writer was only 'inspired' by god. To argue against it is to argue against their god himself!", 
   {
    "post_info": {
     "post_title": "A response to a rather shallow precis"
    }
   }, 
   22085, 
   null, 
   1068453720.0
  ], 
  [
   22149, 
   null, 
   "montalban", 
   "i posted this on another post:\n \n \"2000 years of christian heritiage:\n http://www.geocities.com/iconoclastes.geo/victims.html\"\n\n \n Right before your very face is the evidence you need. We are having a free an open debate on religion. You, or others of your ilk will describe Christianity in terms that are bordering foul insults, yet you do so freely.\n \n Try doing it in Saudi Arabia.\n \n It's easy to hit someone you know's not going to hit back.", 
   {}, 
   22134, 
   null, 
   1068453960.0
  ], 
  [
   22164, 
   null, 
   "gilligan8503", 
   "Right before your very face is the evidence you need. We are having a free an open debate on religion. You, or others of your ilk will describe Christianity in terms that are bordering foul insults, yet you do so freely.\n \n Try doing it in Saudi Arabia.\n \n It's easy to hit someone you know's not going to hit back.\n\n i'm not \"hitting.\" i was told that islam was more \"brutal\" than christianity. i disproved this.\n \n now, feel free to disprove my link.", 
   {}, 
   22149, 
   null, 
   1068476520.0
  ], 
  [
   22165, 
   null, 
   "Charchuk", 
   "Right before your very face is the evidence you need. We are having a free an open debate on religion. You, or others of your ilk will describe Christianity in terms that are bordering foul insults, yet you do so freely.\n \n Try doing it in Saudi Arabia.\n \n It's easy to hit someone you know's not going to hit back.\n\n \n The only reason why we can openly debate Christianity now is that it has lost most of its power over people's lives. It is because the Church can't use the government (Separation of Church and State) overtly that we now have true freedom of thought. Though, there are some who have some influence who are working to put a stop to this sort of thing. LIke I had said, Islam is where Christianity was around 300 to 400 years ago.\n \n Much of this \"hitting\" was well earned. Christianity has a lot to answer for in the massive numbers of innocent people killed in the name of their god.", 
   {}, 
   22149, 
   null, 
   1068476820.0
  ], 
  [
   22166, 
   null, 
   "Charchuk", 
   "i'm not \"hitting.\" i was told that islam was more \"brutal\" than christianity. i disproved this.\n \n now, feel free to disprove my link.\n\n \n I already know his answer. \"But they were not REAL Christians...\" :)", 
   {}, 
   22164, 
   null, 
   1068476880.0
  ], 
  [
   22262, 
   null, 
   "montalban", 
   "I already know his answer. \"But they were not REAL Christians...\" :)\n\n \n As I said, the logic is right in front of you. Except you're applying it so sparingly.\n \n When an aethist does something bad, do we condemn all aethists?\n \n You might be anti-religious to start off with but I'd given you some credit for intelligence... to see beyond a priori hatreds based on your own personal experiences with Catholicism.\n \n Show me the teachings of Christ that lead to the Crusades.\n \n Ignore as you have the teachings of Muhammed that lead to the same event.\n \n Here's a poor analogy played out in so many movies. The FBI go to arrest the bad guys. The bad guys take a hostage and shoot a few people. The FBI agents have guns drawn but can't shoot until the hostage gets away.\n \n Both peoples are shooting and killing so in a sense what's it all matter because it results in people getting killed. People being killed is bad, however you must recognise that it's not so simple, both groups are operating under different rules of engagement.\n \n Now look at the Crusades. They weren't an action, but a re-action. Christianity had been under attack for 400 years by Islam before the 1st Crusade had even begun. All the Holy Land, Egypt, North Africa, Spain, Asia Minor had been forcibly taken from Christendom. They were Christian lands for 600 years with viable vital Christian communities.\n \n Yes the Crusades were bad, evils committed. We westerners are apologising over this time and again, and you gleeflully hit out at such an easy target. Where are the Muslim apologies for capturing the lands in the first place?\n \n I was a member, albeit briefly of the Sydney University Muslim Student's Association. The magazine given out on joining was \"Call to Islam\"*\n (web-site www.islam.org.au). \n \n The web-site talks of the capture of Constantinople by the Turks as the \"Liberation of Constantinople\" despite the fact it wasn't Turkish to begin with.\n \n The liberal apologist language you use is actually quite sickening. You are pandering to such extremists. They take your message back to Islamic schools and say \"See, even the Westerners agree that Christians attacked Islam\". And they quote liberal intellectuals all the time in their one-sided arguments. Then they feed it all back to create another generation of westerners who feel ashamed that they are progressive and that Islam is still a medieval religion - like it's our fault for that too.\n \n Here endeth the rant.\n \n *It's publisher faces extradition back to Lebanon because of bombings done there!", 
   {}, 
   22166, 
   null, 
   1068546420.0
  ], 
  [
   22263, 
   null, 
   "montalban", 
   "i'm not \"hitting.\" i was told that islam was more \"brutal\" than Christianity. i disproved this.\n \n now, feel free to disprove my link.\n\n \n Again it's right before you.\n \n I stated - and I take it you didn't read it... that there's no Islamic equal to statements such as 'turn the other cheek'\n \n You only have to look at some founders; Christ, Buddha etc. They taught peace and love. Some of their followers (Pol Pot was from a Buddhist nation; Adolf Hitler from a Christian nation)*\n \n Now look at Muhammad. He taught the sword. He personally ordered the killing of PoWs. He lead armies into battle, approved assignations etc.\n \n If that doesn't serve as a juxtaposition to Buddha's life than I don't know what does.\n \n Take Mormons. If their founder Joseph Smith taught 'x' and they do 'x' than you can say 'ah-ha! it's because of their teachings that they do 'x'\"\n \n Your argument seems rather lazy. I've cited heaps of examples of what forms the basis of Islam. Find me things that Jesus said that really cause great misery and you'd have a case. Instead you ignore what I stated re: Islam.\n \n Show me the teachings of Christ that lead to murders.\n \n Show me the teachings of Buddha, or the Raelians etc.\n \n What you've done is quite irrational. You've painted all religions with the same brush, because all humans are flawed and commit vile acts. Your stereotyping of all people of one faith is in fact quite biggoted.\n \n \n * though they themselves may/may not have been practicing, certainly they had followers who were.", 
   {}, 
   22262, 
   null, 
   1068546600.0
  ], 
  [
   22264, 
   null, 
   "montalban", 
   "There are differences on the view of marriage\n \n Christ said that anyone who re-marries is committing adultery.\n \n Muhammed allowed 'temporary marriages' Though only some Muslims still practice this...\n \n Though there are important differences between Twelve-Imam Shi'ism and Sunnism on the level of the principles of the religion (usul al-din), on the level of the sharia and fiqh or jurisprudence there are surprisingly few places where Shi'i or 'Ja'fari' law differs from all four Sunni schools, the Hanaf'i, Hanbali, Maliki, and Shafi'i. Perhaps the most important difference occurs in relation to the institution of mut'a, or 'temporary marriage'. The Sunni authorities agree that mut'a was permitted by the Prophet at certain points during his lifetime, but they maintain that in the end he prohibited it completely. In contrast the Shi'is maintain that the Prophet did not ban it, and they cite numerous hadith from Sunni as well as Shi'i sources to prove this. Having established its legality, they then devote tremendous care and attention to defining its legal status and all the rules and regulations connected with it. \n http://www.al-islam.org/al-serat/muta/\n \n Thus a temporary marriage is an excuse to visit prostitutes; you can temporarily marry the prostitute, then divorce her in the morning.\n \n Further seems as one writer found it permissable to issue a Muslim web-site comparing Christianity to Islam, so I now offer the reverse...\n \n http://www.answering-islam.org/Women/place.html\n \n focussing on the views of each religion towards women...", 
   {
    "post_info": {
     "post_title": "Marriage"
    }
   }, 
   22263, 
   null, 
   1068548940.0
  ], 
  [
   22265, 
   null, 
   "montalban", 
   "The only reason why we can openly debate Christianity now is that it has lost most of its power over people's lives. It is because the Church can't use the government (Separation of Church and State) overtly that we now have true freedom of thought. Though, there are some who have some influence who are working to put a stop to this sort of thing. LIke I had said, Islam is where Christianity was around 300 to 400 years ago.\n \n Much of this \"hitting\" was well earned. Christianity has a lot to answer for in the massive numbers of innocent people killed in the name of their god.\n\n \n Indeed Christians have done wrong. However, as I say, there is little liberal critique of Islam.\n \n Anyway,\n \n The birth (or re-birth) of democracy in the West was because of Christianity. Radical religious groups such as the Quakers, Levellers etc. saw that as each of us is created in God's image, we are all, men and women, equal.\n \n I draw this to your attention because of the arbitrary time-frame you seem dead-set on using; c.300-400 years.\n \n 300-400 years ago takes us back to the 1600s and it was then that these groups were emerging. The mid 1600s is my favourite period of history, so you've picked an excellent time.\n \n If you know of any nascent Islamic groups emerging in Iran calling for equal rights for women, good for you, but are they able to base this on the Koran, or are they trying to apologise to the West?\n \n It is because of Christianity that modern pluralistic democracy emerged.\n \n In many 'forward' or 'progressive' states, such as Morocco, it's still illegal to be an apostate! Most Muslim nations require the death penalty for such an act.\n \n \n \n Speaking of Iran...\n \n Recently on the ABC's* Compass program a modern westernised Muslim woman journalist went to Iran and asked a cleric about marriages to 9 year olds. She praised him as being progressive because he ruled that most marriages should occur when the girl was 13!\n \n She celebrated the fact that he was progressive!\n \n She seemed not to notice\n a) 13 is too young\n b) he still allowed for exceptions when 9 is okay - because under Islam, the moment a girl mensturates she's up for grabs as far as marriage is concerned.\n \n \n *the Australian one not the American one.", 
   {}, 
   22165, 
   null, 
   1068549840.0
  ], 
  [
   22271, 
   null, 
   "Charchuk", 
   "As I said, the logic is right in front of you. Except you're applying it so sparingly.\n \n When an aethist does something bad, do we condemn all aethists?\n\n \n No since atheism is not a cohesive belief system. They have no real dogma, rites, nor rituals.\n \n \nYou might be anti-religious to start off with but I'd given you some credit for intelligence... to see beyond a priori hatreds based on your own personal experiences with Catholicism.\n\n \n That is always the answer for you theists. If one doesn't \"love\" you then they must hate you. Emotion is irrelevant in this.\n \n [quote]Show me the teachings of Christ that lead to the Crusades.[quote]\n \n What does Christ have to do with this? We're talking about the Church.\n \n JER 13:14 And I will dash them one against another, even the fa-\n thers and the sons together, saith the LORD: I will not pity, nor\n spare, nor have mercy, but destroy them. \n \n \nIgnore as you have the teachings of Muhammed that lead to the same event.\n\n \n Irrelevant. I see no real difference between Islam of today and Christianity of a few centuries past/\n \n \nHere's a poor analogy played out in so many movies. The FBI go to arrest the bad guys. The bad guys take a hostage and shoot a few people. The FBI agents have guns drawn but can't shoot until the hostage gets away.\n \n Both peoples are shooting and killing so in a sense what's it all matter because it results in people getting killed. People being killed is bad, however you must recognise that it's not so simple, both groups are operating under different rules of engagement.\n\n \n Christianity of the time I was speaking of operated under the same rules as Islam of today does.\n \n \nNow look at the Crusades. They weren't an action, but a re-action. Christianity had been under attack for 400 years by Islam before the 1st Crusade had even begun. All the Holy Land, Egypt, North Africa, Spain, Asia Minor had been forcibly taken from Christendom. They were Christian lands for 600 years with viable vital Christian communities.\n\n \n The crusades are like the invasion of Iraq is today. Based on a lie.\n \n \nYes the Crusades were bad, evils committed. We westerners are apologising over this time and again, and you gleeflully hit out at such an easy target. Where are the Muslim apologies for capturing the lands in the first place?\n\n \n In comparison to what Christianity had done they were nothing. Afterall, Christianity had the power of the Holy Roman Empire behind them, even if it was a short period. \n \n \nI was a member, albeit briefly of the Sydney University Muslim Student's Association. The magazine given out on joining was \"Call to Islam\"*\n (web-site www.islam.org.au). \n \n The web-site talks of the capture of Constantinople by the Turks as the \"Liberation of Constantinople\" despite the fact it wasn't Turkish to begin with.\n\n \n Where did I say that Islamic fundamentalim was rational?\n \n \nThe liberal apologist language you use is actually quite sickening. You are pandering to such extremists. They take your message back to Islamic schools and say \"See, even the Westerners agree that Christians attacked Islam\". And they quote liberal intellectuals all the time in their one-sided arguments. Then they feed it all back to create another generation of westerners who feel ashamed that they are progressive and that Islam is still a medieval religion - like it's our fault for that too.\n \n Here endeth the rant.\n\n \n There is one important fact which you seem to be overlooking (maybe intentionally?) is that I'm not siding with Islam. I think that it is just as opressive as Christianity was in its hayday. It is just that those, like you, are trying to make it sound as if their motives were different. They are in fact the same.", 
   {}, 
   22262, 
   null, 
   1068562440.0
  ], 
  [
   22272, 
   null, 
   "Charchuk", 
   "Indeed Christians have done wrong. However, as I say, there is little liberal critique of Islam.\n\n \n So, you are saying that \"liberals\" (Why do I get the feeling that this is also a term to mean godless commie as well? :) ) support what the fundamentalists are doing?\n \n \nAnyway,\n \n The birth (or re-birth) of democracy in the West was because of Christianity. Radical religious groups such as the Quakers, Levellers etc. saw that as each of us is created in God's image, we are all, men and women, equal.\n\n \n Wrong.\n \n http://www.internetcampus.com/fog25.htm\n \n If the American founding fathers hadn't setup their government in the manner which they did than there wouldn't have been any mordern democracies. It was an unknown concept to most. \n \n These groups which you speak of were seen as heretics and castouts by the main Church which held power in Europe.\n \n Did you know that the Pope is one of the only absolute rulers in the world now? Even though he rules no nation other than the Vatican. His very word is suppose to be absolute law to over 1 billion Catholics. And if he wanted to he could excommuicate any who defy his wishes. He can not be questioned on what he says for any reason.", 
   {}, 
   22265, 
   null, 
   1068562800.0
  ], 
  [
   22323, 
   null, 
   "maximus", 
   "Did you know that the Pope is one of the only absolute rulers in the world now? Even though he rules no nation other than the Vatican. His very word is suppose to be absolute law to over 1 billion Catholics. And if he wanted to he could excommuicate any who defy his wishes. He can not be questioned on what he says for any reason\n\n \n Actually he cannot excommunicate any who \"defy his wishes.\" You imply that he can excommunicate someone who offends him or one whom he has a personal vendetta against. A person must be guilty of grave sin to be excommunicated. Also, he can be questioned. In fact, a priest can absolve excommunication in the face of someone's death.\n \n I wish all \"absolute rulers\" were like the Pope.", 
   {}, 
   22272, 
   null, 
   1068611220.0
  ], 
  [
   22356, 
   null, 
   "Charchuk", 
   "Actually he cannot excommunicate any who \"defy his wishes.\" You imply that he can excommunicate someone who offends him or one whom he has a personal vendetta against. A person must be guilty of grave sin to be excommunicated. Also, he can be questioned. In fact, a priest can absolve excommunication in the face of someone's death.\n \n I wish all \"absolute rulers\" were like the Pope.\n\n \n Actually no. The example is that his word is absolute law. That whatever he says HAS the be done no matter what it is. That is the power he holds, even if he chooses not to exercise it. The Pope is not just a priest. He is GOD's direct representative on Earth. In the past Popes all to often abused this power they had. We are lucky that current Popes have been more cilvilized in this regard.", 
   {}, 
   22323, 
   null, 
   1068648420.0
  ], 
  [
   22381, 
   null, 
   "maximus", 
   "Actually no. The example is that his word is absolute law. That whatever he says HAS the be done no matter what it is. That is the power he holds, even if he chooses not to exercise it. The Pope is not just a priest. He is GOD's direct representative on Earth. In the past Popes all to often abused this power they had. We are lucky that current Popes have been more cilvilized in this regard.\n\n \n His word is not absolute law, God's Word is. The pope is a protector and communicator of God's Word.\n \n Peace.", 
   {}, 
   22356, 
   null, 
   1068669600.0
  ], 
  [
   22388, 
   null, 
   "Charchuk", 
   "His word is not absolute law, God's Word is. The pope is a protector and communicator of God's Word.\n \n Peace.\n\n \n Same difference. Who are you to say that his word isn't god's word as well? Are you god's direct repersentative on Earth ordained as such? :)", 
   {}, 
   22381, 
   null, 
   1068671700.0
  ], 
  [
   22447, 
   null, 
   "montalban", 
   "No since atheism is not a cohesive belief system. They have no real dogma, rites, nor rituals.\n\n \n Err... you're ignorance of the divisions in Christianity is astounding. What is the ritual or universal of Christianity? Not even a belief in Christ! I believe it's essential, but I've know people who don't think so.\n \n Is there a core belief in atheism? Obviously you don't believe in God/gods in order to be termed atheist. I'm sorry, but that's what the label says.\n \n \nThat is always the answer for you theists. If one doesn't \"love\" you then they must hate you. Emotion is irrelevant in this.\n\n \n It is irrelevant, only if you're not human.\n \n \nShow me the teachings of Christ that lead to the Crusades.\n What does Christ have to do with this? We're talking about the Church.\n JER 13:14 And I will dash them one against another, even the fa-\n thers and the sons together, saith the LORD: I will not pity, nor\n spare, nor have mercy, but destroy them.\n\n \n \nIrrelevant. I see no real difference between Islam of today and Christianity of a few centuries past/\n\n \n I know you don't, but bragging about your ignorance is not really the right thing to do.\n \n Quite deceitfully, you've added a quote from Jeremiah, and edited it as if I said it. And it's irrelevant. I asked you to quote what Jesus said. I've quoted heaps of what Muhammed has said on these matters.\n \n Here we have a trial. We have two witnesses. Both are being accused by you of terrible crimes (yes, you said a) Christianity has in it's past done heaps of bad things and b) that Islam is now like Christianity was in its past!). Of these two witnesses, you are judging both not by them, but what their followers have done. I am judging them by them! What did they say. I ask you again, show me the testimony to condemn Jesus!\n \n \nChristianity of the time I was speaking of operated under the same rules as Islam of today does.\n\n \n Show me the causality.\n \n \nThe crusades are like the invasion of Iraq is today. Based on a lie.\n\n \n Tell me what the lie of the Crusades was? You have the most sparse use of facts that I've ever come across. Such a bland statement that the 'Crusades were based on a lie' what ever that was!\n \n \nIn comparison to what Christianity had done they were nothing. Afterall, Christianity had the power of the Holy Roman Empire behind them, even if it was a short period. \n\n \n The Holy Roman Empire? Which one? It's amazing the pap comments you are coming up with. Half of Europe was Orthodox. Show me when they were ruled by the Holy Roman Empire (any of them!)\n \n \nWhere did I say that Islamic fundamentalim was rational?\n\n \n Your whole argument consists of brandishing all religion as abhorrent, and ignoring facts and spouting generalisations. Hardly rational. And your rationale is you hate religion.", 
   {}, 
   22271, 
   null, 
   1068711960.0
  ], 
  [
   22451, 
   null, 
   "Parcum", 
   "Charchuk, respond to post #11. Gilligan too.", 
   {}, 
   22146, 
   null, 
   1068712260.0
  ], 
  [
   22455, 
   null, 
   "montalban", 
   "So, you are saying that \"liberals\" (Why do I get the feeling that this is also a term to mean godless commie as well? \n\n \n You'd be wrong (again)\n \n \nWrong.\n \n http://www.internetcampus.com/fog25.htm\n \n If the American founding fathers hadn't setup their government in the manner which they did than there wouldn't have been any mordern democracies. It was an unknown concept to most. \n \n These groups which you speak of were seen as heretics and castouts by the main Church which held power in Europe.\n\n \n What a terrible case of cultural imperialism! You need to look out beyond the Anglo-Saxon USA as a be-all and end-all of your world. Your whole argument is not a counter to mine! It is WASP history at its worst! It's actually quite an insulting thing to say to people like me who aren't American, who also believe in democracy. So, we've got you to thank for living in a 'free world', huh?\n \n Firstly, 'the main Church which held power in Europe' - when are we talking about? If you mean 300-400 years ago, then the Orthodox Church, it covered most of Europe both by terms of area and population. But you're occidental world view ignores this. As to them being 'heretics' (again your post-Catholic bias showing) yes they were radical Christians. That's what I said. Radical Christians form the basis of modern democracy, now you're denying this.\n \n Democracy in the USA, if we're even to confine our argument to that, stems from the ideas of the 'Glorious Revolution' of 1688 in Britain, which itself harks back to the movements of the Levellers, the Diggers etc, that I mentioned earlier, and which you've completely ignored by trying to redefine the boundaries not only in time, but in space as well, by confining things to just the USA. The democracy of the USA was hijacked by a great many agnostics, which is why it never became a true democracy - with a large number of people disenfranchised because of property status, sex, or skin colour.\n \n Are you now saying that the USA is a model of democracy? I bet you're not!\n \n Do you acknowledge that your atheistic founding fathers approved of slavery? Do you acknowledge that Christians in UK and USA (Wilberforce and Garrison, respectively) were at the forefront of ending slavery in those nations? I bet you've never even considered that, so quick are you to bag all religions.\n \n \nDid you know that the Pope is one of the only absolute rulers in the world now? Even though he rules no nation other than the Vatican. His very word is suppose to be absolute law to over 1 billion Catholics. And if he wanted to he could excommunicate any who defy his wishes. He can not be questioned on what he says for any reason.\n\n \n Define 'absolute'.\n \n The Pope is elected.\n \n But again, confining your argument to your own experience. You've had dealings with the Catholic Church, and you're American, so you're argument is only against Catholicism and in terms of American experience and you're arguing against ALL of Christianity on the little you know.\n \n Take for instance you've overlooked the fact that the leader of North Korea is an atheist and an absolute ruler. You'd in fact have more chance being Pope than you would of being head of North Korea (being as the later is only open to children of the leader). What does this prove? As much as you having a go at the Pope. But you're irrationally intent on bringing them down.\n \n And you ignore the main thrust of this thread... on Islam. You've had very little to say other than a backwards admission that Islam is pretty repressive now - but hey, all religions are!\n \n This is of course an insult to Buddhists everywhere. You tar them with the same brush.\n \n But again, compare the teachings of Muhammad to Christ. Chalk and cheese.", 
   {}, 
   22272, 
   null, 
   1068714000.0
  ], 
  [
   22468, 
   null, 
   "Charchuk", 
   "Err... you're ignorance of the divisions in Christianity is astounding. What is the ritual or universal of Christianity? Not even a belief in Christ! I believe it's essential, but I've know people who don't think so.\n\n \n The lyrics maybe different, but the melody is the same. The same goes with divisions in one religion as they do with all religions.\n \n \nIs there a core belief in atheism? Obviously you don't believe in God/gods in order to be termed atheist. I'm sorry, but that's what the label says.\n\n \n But it is still not a set form of beliefs. There is no \"baggage\" with it as there is with Christianity and other religions.\n \n \n \nIt is irrelevant, only if you're not human.\n\n \n Irrelevant. I neither love you nor hate you. You're problem is that you're too much of a binary thinker.\n \n \nI know you don't, but bragging about your ignorance is not really the right thing to do.\n\n \n Please, it is you who is bragging and the promoting of ignorance.\n \n [quote]Quite deceitfully, you've added a quote from Jeremiah, and edited it as if I said it. And it's irrelevant. I asked you to quote what Jesus said. I've quoted heaps of what Muhammed has said on these matters.[quote]\n \n I did no such thing. Jesus said nothing directly in the bible. All of what you read is about him, not by him. He isn't around to verify it at all.\n \n \nHere we have a trial. We have two witnesses. Both are being accused by you of terrible crimes (yes, you said a) Christianity has in it's past done heaps of bad things and b) that Islam is now like Christianity was in its past!). Of these two witnesses, you are judging both not by them, but what their followers have done. I am judging them by them! What did they say. I ask you again, show me the testimony to condemn Jesus!\n\n \n Let him spoke in his own words, not hearsay from the bible.\n \n \nShow me the causality.\n \n \n The Inquisition, Crusades, the Burning Times, etc, etc.\n \n \nTell me what the lie of the Crusades was? You have the most sparse use of facts that I've ever come across. Such a bland statement that the 'Crusades were based on a lie' what ever that was!\n\n \n That the Muslims had taken over the holy land and were oppressing Christians there. It turns out that they more or less tolerated each other.\n \n \nThe Holy Roman Empire? Which one? It's amazing the pap comments you are coming up with. Half of Europe was Orthodox. Show me when they were ruled by the Holy Roman Empire (any of them!)\n\n \n Irrelevant. They both used the network already in place left behind by the Roman Empire to their advantage.\n \n \n \nYour whole argument consists of brandishing all religion as abhorrent, and ignoring facts and spouting generalisations. Hardly rational. And your rationale is you hate religion.\n\n \n I see no difference between any of the dominance based religions.", 
   {}, 
   22447, 
   null, 
   1068734460.0
  ], 
  [
   22469, 
   null, 
   "Charchuk", 
   "You'd be wrong (again)\n\n \n The manner in which you use the term liberal is much like they did during the McCarthy Era.\n \n \nWhat a terrible case of cultural imperialism! You need to look out beyond the Anglo-Saxon USA as a be-all and end-all of your world. Your whole argument is not a counter to mine! It is WASP history at its worst! It's actually quite an insulting thing to say to people like me who aren't American, who also believe in democracy. So, we've got you to thank for living in a 'free world', huh?\n\n \n Get real. If it wasn't for the American founding fathers there wouldn't be any democracy in the world now. BTW, my ancestry is not anglo-saxon at all. You are assuming far too much.\n \n \nAre you now saying that the USA is a model of democracy? I bet you're not!\n\n \n It is the first in modern history to be put into affect, even if somewhat flawed. No others had succeeded as much.\n \n \nDo you acknowledge that your atheistic founding fathers approved of slavery?\n\n \n Who said anything about them being atheists? Or that they were mine? Many of them were deists. Dispite their religious upbringing they knew the dangers of what it meant when Church and State were one. That is why so many had left England in the first place. Canada never had an official policy of slavery as the USA had.\n \n \nDo you acknowledge that Christians in UK and USA (Wilberforce and Garrison, respectively) were at the forefront of ending slavery in those nations? I bet you've never even considered that, so quick are you to bag all religions.\n\n \n There are always heretics in any belief system.\n \n \nDefine 'absolute'.\n\n \n In this context;\n \n Without conditions or limitations\n \n \nThe Pope is elected.\n\n \n By all of the Catholics in the world? :)\n \n \nBut again, confining your argument to your own experience. You've had dealings with the Catholic Church, and you're American, so you're argument is only against Catholicism and in terms of American experience and you're arguing against ALL of Christianity on the little you know.\n\n \n Wrong on many accounts. I'm not an American. I'm Canadian. It even says so under my name to the left-hand side of the screen. :)Considering that the vast majority of Christians in the world are Catholic it makes all others into heretics. \n \n BTW, the primary form of Christianity in the USA is Protestantism (56%), and Catholics (28%, 2002). Even then the USA is the third most populous Catholic country in the world.\n \n \nTake for instance you've overlooked the fact that the leader of North Korea is an atheist and an absolute ruler.\n\n \n One thing you may not realize that most far eastern religions are non-theistic in nature. So, calling him an atheists is irrelevant.\n \n North Korea:\n Traditionally Buddhist and Confucianist, some Christian and syncretic Chondogyo (Religion of the Heavenly Way) (They do have religious freedom, of a sort .}\n \n South Korea:\n Christian 49%, Buddhist 47%, Confucianist 3%, Shamanist, Chondogyo (Religion of the Heavenly Way), and other 1% \n \n The majority religious belief in South Korea is more non-theistic than theistic as is in the North.\n \n \nYou'd in fact have more chance being Pope than you would of being head of North Korea (being as the later is only open to children of the leader). What does this prove? As much as you having a go at the Pope. But you're irrationally intent on bringing them down.\n\n \n non sequitur\n \n \nAnd you ignore the main thrust of this thread... on Islam. You've had very little to say other than a backwards admission that Islam is pretty repressive now - but hey, all religions are!\n\n \n Correction, all dominance based religions are. BTW, I've stated in other threads that I mean dominance based religions.\n \n \nThis is of course an insult to Buddhists everywhere. You tar them with the same brush.\n\n \n Irrelevant.\n \n \nBut again, compare the teachings of Muhammad to Christ. Chalk and cheese.\n\n \n At least they had first hand accounts of Muhammad. All they have of Christ are third or more hand accounts. With nothing written during his lifetime. Not even an account of his execution by the Romans and they were fanatics at record keeping.", 
   {}, 
   22455, 
   null, 
   1068735720.0
  ], 
  [
   22483, 
   null, 
   "Parcum", 
   " That the Muslims had taken over the holy land and were oppressing Christians there. It turns out that they more or less tolerated each other.\n\n \n It did? I hardly think so. What happened was that the Fatimids of Egypt were ruling Palestine with religious tolerance. Christians would be able to come and go there as they pleased, often going on pilgrimages. Although one of the Fatimids of Egypt destroyed the Church of the Holy Sepluchur, many Muslim leaders of the caliphate joined in to restore it. It was a nice place for Christians and Muslims to live. However, in 1070, the Seljuk Turks conquered Palestine, and massive persecution and oppression began. The emperors of Constantanople- under the schism of Michael Caerularius, nonetheless begged the Pope for assistance. Hoping to reunite the eastern schism with the west, the Pope began plans to send 50k soldiers to the Middle East. No, it wasn't a lie. \n \n \n Irrelevant. They both used the network already in place left behind by the Roman Empire to their advantage.\n\n \n The Holy Roman Empire was a minor force in the crusades. The Teutonic Knights and Barbarossa are what is known from them, but most of the crusade forces in Europe came from France, England, and miscellaneous other nations, including many Italian state. At any rate, the Holy Roman Empire wasn't this all-time-powerful Empire. IT was so loosely divided and many people had their own Duchys, Counties, and Kingdoms within the empire itself. It's not as if the Holy Roman Emperor had direct rule over these states. If that was the case, Protestantism would not exist today! \n \n I understand that Christianity has it's faults, but Islam has just as many faults, if not more. It doesn't help if you begin making up facts, either. \n \n \n By all of the Catholics in the world?\n\n \n No. Unfortunately, we cannot trusts many of the Catholics on earth, as they are not true Catholics. Christ gave the apostles to elect Patriachs, not average civilians. \n \n \n BTW, the primary form of Christianity in the USA is Protestantism (56%), and Catholics (28%, 2002). Even then the USA is the third most populous Catholic country in the world.\n\n \n That doesn't mean much. The USA is still a nation filled with protestants who have always oppressed the Catholics. Remember, \"Pope's Day\"?", 
   {
    "unicode_changes_made": true
   }, 
   22469, 
   null, 
   1068747720.0
  ], 
  [
   22488, 
   null, 
   "Charchuk", 
   "It did? I hardly think so. What happened was that the Fatimids of Egypt were ruling Palestine with religious tolerance. Christians would be able to come and go there as they pleased, often going on pilgrimages. Although one of the Fatimids of Egypt destroyed the Church of the Holy Sepluchur, many Muslim leaders of the caliphate joined in to restore it. It was a nice place for Christians and Muslims to live. However, in 1070, the Seljuk Turks conquered Palestine, and massive persecution and oppression began. The emperors of Constantanople- under the schism of Michael Caerularius, nonetheless begged the Pope for assistance. Hoping to reunite the eastern schism with the west, the Pope began plans to send 50k soldiers to the Middle East. No, it wasn't a lie. \n\n \n The Official version.\n \n \nThe Holy Roman Empire was a minor force in the crusades. The Teutonic Knights and Barbarossa are what is known from them, but most of the crusade forces in Europe came from France, England, and miscellaneous other nations, including many Italian state. At any rate, the Holy Roman Empire wasn't this all-time-powerful Empire. IT was so loosely divided and many people had their own Duchys, Counties, and Kingdoms within the empire itself. It's not as if the Holy Roman Emperor had direct rule over these states. If that was the case, Protestantism would not exist today!\n\n \n Doesn't matter if it was strong or not. It had its influences. \n \n \nI understand that Christianity has it's faults, but Islam has just as many faults, if not more. It doesn't help if you begin making up facts, either. \n\n \n I agree. all dominance based religions are faulty. I'm not the one who is making up facts.\n \n \nNo. Unfortunately, we cannot trusts many of the Catholics on earth, as they are not true Catholics. Christ gave the apostles to elect Patriachs, not average civilians.\n\n \n Irrelevant. They'd say the say of you. The Pope is appointed by an isolated elite for its own agenda. Protestants don't believe in the Pope in the first place. \n \n \nThat doesn't mean much. The USA is still a nation filled with protestants who have always oppressed the Catholics. Remember, \"Pope's Day\"?\n\n \n Irrelevant. He had said that the USA was primarily Catholic. It isn't.", 
   {
    "unicode_changes_made": true
   }, 
   22483, 
   null, 
   1068750120.0
  ], 
  [
   22499, 
   null, 
   "Parcum", 
   " The Official version.\n\n \n What is \"The Official version\"?\n \n \n Doesn't matter if it was strong or not. It had its influences.\n\n \n Oh undoubtedly. However, you make it seem like the Holy Roman Empire was controlling the crusades, when that's hardly the case!\n \n \n I agree. all dominance based religions are faulty. I'm not the one who is making up facts.\n\n \n Yes you were the one making up facts!\n \n \n Irrelevant. They'd say the say of you. The Pope is appointed by an isolated elite for its own agenda. Protestants don't believe in the Pope in the first place.\n\n \n First of all, how is that irrelevant? It's an argument that is relevant to the discussion. Are you just throwing out the word \"irrelevant\" for fun? At any rate, yes, he is elected by an isolated elite- do you know who there \"elite\" are? They are the successors of the disciples. \n \n \n Irrelevant. He had said that the USA was primarily Catholic. It isn't.\n\n \n Did he say the USA or America? If it is the latter, then it changes everything quite a bit. America is a very Catholic group of nations.", 
   {
    "unicode_changes_made": true
   }, 
   22488, 
   null, 
   1068763020.0
  ], 
  [
   22500, 
   null, 
   "Charchuk", 
   "What is \"The Official version\"?\n\n \n That written or influneced by the victor.\n \n \nOh undoubtedly. However, you make it seem like the Holy Roman Empire was controlling the crusades, when that's hardly the case!\n\n \n Where did I say that?\n \n \nYes you were the one making up facts!\n\n \n Hardly.\n \n \nFirst of all, how is that irrelevant? It's an argument that is relevant to the discussion. Are you just throwing out the word \"irrelevant\" for fun? At any rate, yes, he is elected by an isolated elite- do you know who there \"elite\" are? They are the successors of the disciples.\n\n \n You mean the \"good old boys club\".\n \n \nDid he say the USA or America? If it is the latter, then it changes everything quite a bit. America is a very Catholic group of nations.\n\n \n It was the USA he meant. And he even tried to say that I was an anglo-saxon American at that. :) I'm an Ukrainian, French (Or is that Freedom? :) ), Polish, and Micmac Canadian. :) \n \n And no the USA is primarily Protestant, 56% in fact to 28% being Catholic. American isn't a group of nations. It is a group of united states into one Nation.", 
   {
    "unicode_changes_made": true
   }, 
   22499, 
   null, 
   1068764220.0
  ], 
  [
   22509, 
   null, 
   "Parcum", 
   " That written or influneced by the victor.\n\n \n No, the \"official version\" didn't write that. This was written by an atheist, who is more anti-Christian than anything.\n \n \n \n Hardly.\n\n \n quotes from Charchuck:\n \n \"That the Muslims had taken over the holy land and were oppressing Christians there. It turns out that they more or less tolerated each other.\"\n \n \"The crusades are like the invasion of Iraq is today. Based on a lie.\"\n \n Some of the ones I found...\n \n \n You mean the \"good old boys club\".\n\n \n Sure, why not.\n \n \n And no the USA is primarily Protestant, 56% in fact to 28% being Catholic. American isn't a group of nations. It is a group of united states into one Nation.\n\n \n I was talking if he meant America as in North America, or even south America for that matter.", 
   {
    "unicode_changes_made": true
   }, 
   22146, 
   null, 
   1068773820.0
  ], 
  [
   22512, 
   null, 
   "Charchuk", 
   "No, the \"official version\" didn't write that. This was written by an atheist,\n\n \n You'd like to believe that, but of course no.\n \n \nwho is more anti-Christian than anything.\n\n \n Christians of other Christians not of their sect or denomination? I.E. Ireland.\n \n \nquotes from Charchuck:\n\n \n That's C H A R C H U K, Pacman.\n \n \n \nI was talking if he meant America as in North America, or even south America for that matter.\n\n \n That would be Americas, not America. I knew Americans were bad at geography, but this is sad. :)\n \n Q: How do you hide from the American Military?\n \n A: Remove the name of your country from their maps. :)", 
   {
    "unicode_changes_made": true
   }, 
   22509, 
   null, 
   1068774780.0
  ], 
  [
   22545, 
   null, 
   "montalban", 
   "Charchuk you are American. Just as someone from Italy is European. Canada is on the American continent isn't it? You obviously champion the notion that the USA is the prime-mover in world democracy. The assertion that the USA was the first 'modern democracy. is again one of you pap statements that sounds nice... but what's it mean? What do you mean by 'modern' democracy?\n \n And you've ignore the slavery issue that I raised so I'll have to say it again...\n \n Your champion atheists founded a nation based on slavery. The first several presidents weren't even concerned about popular votes. You couldn't vote if you were a woman, or had little property. It was Christians who campaigned for slavery to be abolished. Hey, but don't let that stand in the way of your vitriol.\n \n What about the Pope? An absolute ruler? No, he's accountable to God. He's elected by his peers. North Korea has an atheist.\n In Post 35 all he can say is \"One thing you may not realize that most far eastern religions are non-theistic in nature. So, calling him an atheists is irrelevant.\"\n \n One thing you may not realise is that Kim Jong-Il is not religious at all! So calling him an atheist is relevant.\n \n \n \n \n \n Parcum: I think here we're trying to deal rationally with someone who hates all religions.\n \n I have asked him to provide the words from Christ that he objects too and he can't\n \n In post 25 he said...\n In comparison to what Christianity had done they were nothing. Afterall, Christianity had the power of the Holy Roman Empire behind them, even if it was a short period. \n \n I asked...\n The Holy Roman Empire? Which one? It's amazing the pap comments you are coming up with. Half of Europe was Orthodox. Show me when they were ruled by the Holy Roman Empire (any of them!)\n \n In 34\n Irrelevant. They both used the network already in place left behind by the Roman Empire to their advantage\n \n Why is it irrelevant? Neither of them 'dominated' Europe; vast areas to the east lay outside it's influence; Russia.\n \n The Holy Roman Empire founded by Otto had very little connection with Rome. Most of it's dominions lay outside areas that had been part of the Roman Empire.\n \n He has a smidgin of historical knowledge and it's based on anti-Catholic hype.\n \n Parcum, you asked the question... \"Oh undoubtedly. However, you make it seem like the Holy Roman Empire was controlling the crusades, when that?s hardly the case!\"\n \n In post 39 he says \"Where did I say that?\"\n \n Obviously he's changing tact again. First the Holy Roman Empire is the spear-head of Christian oppression; such as the crusades, now it's not.\n \n \n \n \n The odd thing in all this is he doesn't seem to disagree what I said about Islam. In fact the only one who has is Gillian and I've heard no more of Gillian on this issue for some time.", 
   {}, 
   22512, 
   null, 
   1068801300.0
  ], 
  [
   22556, 
   null, 
   "Charchuk", 
   "Charchuk you are American. Just as someone from Italy is European.\n\n \n That is North American, there is a big difference. \n \n BTW, my ancestry is mostly European with a small percentage being North American native. Most likely your ancestry is mainly European as well.\n \n \nCanada is on the American continent isn't it?\n\n \n No, it isn't. It is the North American continent. Though, I bet a lot of Mexicans would like it to be so they wouldn't have to sneak across the border. :)\n \n There are three continents in the New World. North America which has three countries; Canada, the U.S. of America, and Mexico, than there is Central America which has many smaller countries in it, and finally South America which has a mix of smaller and larger countries.\n \n What, is the geography education in Australia as terrible as it is in the USA? I know you guys want to be Americans, but that is taking it a bit far. :)\n \n There once was a survey done which asked Americans to point out, on a world map, where they thought North, Central, and South America were. Most pointed to the northern states of the USA as NA, the central States of the USA as CA, and the southern States of the USA as SA. It is really sad. These people want to police the world, scary.\n \n \nYou obviously champion the notion that the USA is the prime-mover in world democracy.\n\n \n It is even if you don't like it. If it weren't for America's example you'd probably still be living in a prison colony.\n \n I know of the British Magna Carta, but that wasn't even remotely the same thing as what the American's started. The MC only really gave more power to the elite over that of the monarch.\n \n \nThe assertion that the USA was the first 'modern democracy. is again one of you pap statements that sounds nice... but what's it mean? What do you mean by 'modern' democracy?\n\n \n Like it or not it was the first with any real success.\n \n \nAnd you've ignore the slavery issue that I raised so I'll have to say it again...\n\n \n No, I didn't. I had answered it a long time ago. They got around this by declaring slaves not to be humans.\n \n \nYour champion atheists founded a nation based on slavery.\n\n \n Man, do you ever have it wrong.\n \n \nThe first several presidents weren't even concerned about popular votes. You couldn't vote if you were a woman, or had little property. \n\n \n That had more to do with what was to become the Republican Party. They had wanted to set the country up as a monarchy of their own. They wanted business as usual, but with themselves in charge instead.\n \n \nIt was Christians who campaigned for slavery to be abolished. Hey, but don't let that stand in the way of your vitriol.\n\n \n Heretics which had went against the established system.\n \n \nWhat about the Pope? An absolute ruler? No, he's accountable to God. He's elected by his peers.\n\n \n Who are you to say that everything he says isn't directly from his god?\n \n \nNorth Korea has an atheist.\n In Post 35 all he can say is \"One thing you may not realize that most far eastern religions are non-theistic in nature. So, calling him an atheists is irrelevant.\"\n \n One thing you may not realise is that Kim Jong-Il is not religious at all! So calling him an atheist is relevant.\n\n \n Still doesn't make him an atheist. There are many Jews who aren't religious, but still call themselves Jewish. Does this make them atheists?\n \n \nParcum: I think here we're trying to deal rationally with someone who hates all religions.\n\n \n You don't really have a clue, do you?\n \n \nI have asked him to provide the words from Christ that he objects too and he can't\n\n \n And you can't either since there are no words by Christ in the bible. It is all just hearsay.\n \n \nObviously he's changing tact again. First the Holy Roman Empire is the spear-head of Christian oppression; such as the crusades, now it's not.\n\n \n Nope, didn't even say that. I had said that it had its influences because of the network set up by the former Roman Empire.\n \n \nThe odd thing in all this is he doesn't seem to disagree what I said about Islam. In fact the only one who has is Gillian and I've heard no more of Gillian on this issue for some time.\n\n \n Of course I had agreed, Islam of today is really no different than Christianity of the past and that is the point.", 
   {}, 
   22545, 
   null, 
   1068821700.0
  ], 
  [
   22585, 
   null, 
   "Parcum", 
   "Christians of other Christians not of their sect or denomination? I.E. Ireland.\n\n \n Will Durant was (is?) an atheist. He doesn't support the Catholic Church. He's very liberal. He is an X-Catholic.", 
   {}, 
   22556, 
   null, 
   1068850320.0
  ], 
  [
   22590, 
   null, 
   "montalban", 
   "That is North American, there is a big difference. \n \n BTW, my ancestry is mostly European with a small percentage being North American native. Most likely your ancestry is mainly European as well.\n \n No, it isn't. It is the North American continent. Though, I bet a lot of Mexicans would like it to be so they wouldn't have to sneak across the border.\n\n \n What a continental border? Mexico is part of America. It is part of North America. Just because there's a man-made border between Mexico and the US doesn't mean the continent ends there!\n \n \nThere are three continents in the New World. North America which has three countries; Canada, the U.S. of America, and Mexico, than there is Central America which has many smaller countries in it, and finally South America which has a mix of smaller and larger countries.\n \n What, is the geography education in Australia as terrible as it is in the USA? I know you guys want to be Americans, but that is taking it a bit far.\n \n There once was a survey done which asked Americans to point out, on a world map, where they thought North, Central, and South America were. Most pointed to the northern states of the USA as NA, the central States of the USA as CA, and the southern States of the USA as SA. It is really sad. These people want to police the world, scary.\n\n \n Actually for simplicity's sake there are only 2 American continents. Your smugness now looks ridiculous. Central America is not a continent. You American! It's no more a continent than the term \"the Middle East\"; you are right, obviously education in America is falling.\n \n The only reason people refer to \"Latin America\" or \"Central America\" is to separate cultures of Anglo-America from the rest. You've adopted the dominant western WASPish mindset, and you've done the same. It is you who want to be part of this homogenous American culture.\n \n [QUOTE=Charchuk]It is even if you don't like it. If it weren't for America's example you'd probably still be living in a prison colony.\n \n Again, you throw these pap statements up as if they are foregone conclusions. Show me how America becoming a democracy lead to Australia ending convict transportation.\n \n \nI know of the British Magna Carta, but that wasn't even remotely the same thing as what the American's started. The MC only really gave more power to the elite over that of the monarch.\n\n \n Huh? Britain was an evolving democracy. The Magna Carta is part of your anglo-American heritage too! Both the USA and Canada can look to it as the ancestor.\n \n \nLike it or not it was the first with any real success.\n\n \n What you mean France wasn't a success? Britain wasn't a success?\n \n When I went to school, Modern History for us began at the French Revolution, therefore the founding of the USA was just before 'Modern History' began. I understand that different educational spheres have delineated a different starting point for the modern world.\n \n \nNo, I didn't. I had answered it a long time ago. They got around this by declaring slaves not to be humans.\n\n \n Who did? The atheists; Hume, and Locke!\n \n I said \"Your champion atheists founded a nation based on slavery.\" And you agree that the founders of the USA were atheists.\n \n \nMan, do you ever have it wrong.\n\n \n Huh? Let's look... you claim that the founders of the USA weren't Christian, but atheists. The USA was founded with slavery entrenched. Therefore 'man, do you ever have it wrong'.\n \n I wrote \"The first several presidents weren't even concerned about popular votes. You couldn't vote if you were a woman, or had little property. \"\n \n \nThat had more to do with what was to become the Republican Party. They had wanted to set the country up as a monarchy of their own. They wanted business as usual, but with themselves in charge instead.\n\n \n Huh? Washington wasn't a Republican! The 'Republican Party' was founded in the 1850s. History isn't your strong-point. Yes, I understand you suggest that there was a party that 'evolved' into the Republicans, but Washington wasn't even elected by popular vote. None of the first presidents, regardless of the party, were elected by popular vote! First you're saying that America is the first real democracy, now you've switched around and saying that they were trying to set up a democracy. Logic, too isn't your strong-point.\n \n \nHeretics which had went against the established system.\n\n \n Circular reasoning. Anyone who went against slavery had to have gone against the established system! The system was established (by your own argument; by atheists). Therefore these Christians went against the established system. They were 'heretics' in that sense. However, they followed Christian values, not secularist ones. Secularists had established that some men were inferior.\n \n I wrote \"What about the Pope? An absolute ruler? No, he's accountable to God. He's elected by his peers.\"\n \n \nWho are you to say that everything he says isn't directly from his god?\n\n \n Huh? I'm not saying that everything he says isn't from his God. It's you making the claim.\n \n [QUOTE=Charchuk]Still doesn't make him an atheist. There are many Jews who aren't religious, but still call themselves Jewish. Does this make them atheists?\n \n Kim is an atheist! Of course it matters. If you don't believe in gods you're an atheist. Go look it up! Define 'religious'. Some years ago, and for some years I never went to Church. I was always someone who believed in Christ. But I wasn't religious because I didn't belong to any denomination.\n \n \nAnd you can't either since there are no words by Christ in the bible. It is all just hearsay.\n\n \n Again your bias. Even if it were hearsay, then show me the words 'attributed' to Jesus that you object too. You can't even do that! Show me what you are actually objecting to, even if it's just hearsay. You can't. You just have an irrational hatred of religion.\n \n \nNope, didn't even say that. I had said that it had its influences because of the network set up by the former Roman Empire.\n\n \n The former Roman Empire again shows your western sensibilities! You mean the Western Roman Empire, because the Roman Empire in the east continued well past the establishment of the Holy Roman Empire. Sorry, history and geography don't seem to be your strong points. You need to look beyond western history. It matters not that your own background is European, because you've adopted the dominant American culture as your reference point. All your statements follow from that axiom.\n \n \n \nOf course I had agreed, Islam of today is really no different than Christianity of the past and that is the point.\n\n \n And you showed no evidence. You just make a pronouncement. Making pap statements is not an argument.", 
   {}, 
   22556, 
   null, 
   1068854040.0
  ], 
  [
   22606, 
   null, 
   "Parcum", 
   "Charchuk, there are only two continents in the new world. North and South America. \n \n It's funny. Charchuk makes responses like \"No, not really\", \"Irrelivent\", \"You're wrong\", \"You're stupid\", \"You don't get it\", and never clearly makes his thesis or argues it for that matter.", 
   {}, 
   22590, 
   null, 
   1068858060.0
  ], 
  [
   22612, 
   null, 
   "montalban", 
   "Charchuk, there are only two continents in the new world. North and South America. \n \n It's funny. Charchuk makes responses like \"No, not really\", \"Irrelevant\", \"You're wrong\", \"You're stupid\", \"You don't get it\", and never clearly makes his thesis or argues it for that matter.\n\n \n Yes, and even here the border is arbitrary: the Panama Canal.\n \n I must admit that I did assume that he was 'American' as in from the USA because of the line he was taking - just because he says he's in Canada doesn't mean anything. He certainly acts like an American; USA is the be-all and end-all of democracy, and is the model for all democracies that came thereafter. He might be 'Canadian' in nationality but he spouts dominant Anglo-American WASPish tripe, and replies like you mention here.\n \n Anyway, I'm still waiting for him to give a proper reply. He seems to use the 'Lurch' approach to argument... one sentence rebuttal as Lurch used to do... where is Lurch anyway?\n \n \n \n To get back to the central issue of this thread... there are some belief systems that a fairly easy-going. There are some that are not.\n \n Take the Nazis. Anyone might recognise that this is at it's centre an evil ideology. A 'liberal' who is trying to find the good in everyone might say 'Okay, but not all Nazis are bad'.\n \n Sure, there is some truth to that. There are good people, there are bad people, wherever you go.\n \n There are a great many good Muslims.\n \n But Islam itself is not a tolerant religion. The founder of Islam was a man who followed his baser desires. He married a nine-year old girl. He had nine wives, and many concubines. He lead armies into battle and ordered the execution of PoWs. He ordered that people who are Muslim should not convert (to be an 'apostate'). The crime of apostasy still carries the death-penalty in some nations.\n \n Likewise, while we in the secular west believe in plurality of ideas, it is not so throughout Islamic nations. Saudi Arabia; an American ally, won't allow anyone to preach their own religion to Moslems. Many Islamic states hold similar laws.\n \n It was my intent to try to reverse or correct a growing liberal trend; the belief that Islam is an oppressed religion.\n \n It is an oppressive belief system. It is so, because it's founder was a part-time desert pirate who's raiders got lucky and struck out at the Byzantine and Persian empires exactly when these two regional super-powers were exhausted after slogging it out against each other for decades; the Persian Empire fell in a year to Islam, the Byzantine Empire lasted; but lost vast amounts of territory.", 
   {}, 
   22606, 
   null, 
   1068861180.0
  ], 
  [
   22626, 
   null, 
   "Charchuk", 
   "Will Durant was (is?) an atheist. He doesn't support the Catholic Church. He's very liberal. He is an X-Catholic.\n\n \n \n Compared to what Christians have done throughout the centuries to other Christians not of their sect it is irrelevant. You're far worse on your own than on anyone else. Being a heretic was a capital offence.", 
   {}, 
   22585, 
   null, 
   1068867360.0
  ], 
  [
   22628, 
   null, 
   "Charchuk", 
   "What a continental border? Mexico is part of America. It is part of North America. \n\n \n What, I had said that Mexico is part of North America. \n \n \nJust because there's a man-made border between Mexico and the US doesn't mean the continent ends there!\n\n \n Like the one between Europe and Asia?\n \n \nActually for simplicity's sake there are only 2 American continents. Your smugness now looks ridiculous. Central America is not a continent. You American! It's no more a continent than the term \"the Middle East\"; you are right, obviously education in America is falling.\n\n \n It is the connector between the two, sort of a sub-continent. Sort of like Australia like a sub-Continuent and India as well.\n \n \nThe only reason people refer to \"Latin America\" or \"Central America\" is to separate cultures of Anglo-America from the rest. You've adopted the dominant western WASPish mindset, and you've done the same. It is you who want to be part of this homogenous American culture.\n\n \n You don't know Canadians very well, do you? :)\n \n \nHuh? Britain was an evolving democracy. The Magna Carta is part of your anglo-American heritage too! Both the USA and Canada can look to it as the ancestor.\n\n \n As a template only. It had to be modified to be of any real use.\n \n \nWhat you mean France wasn't a success? Britain wasn't a success?\n\n \n The French Revolution was AFTER the American Revolution. The USA was the first.\n \n \nWhen I went to school, Modern History for us began at the French Revolution, therefore the founding of the USA was just before 'Modern History' began. I understand that different educational spheres have delineated a different starting point for the modern world.\n\n \n You seem to forget Canada's other heritage.\n \n \n \nWho did? The atheists; Hume, and Locke!\n\n \n Slavery existed in the colonies before there was a USA.\n \n \nI said \"Your champion atheists founded a nation based on slavery.\" And you agree that the founders of the USA were atheists.\n\n \n Where did I said anything like that. A deist isn't an atheist.\n \n \nHuh? Let's look... you claim that the founders of the USA weren't Christian, but atheists.\n\n \n Deist:\n \n 1. A person who believes that God created the universe and then abandoned it\n \n \n \nThe USA was founded with slavery entrenched. Therefore 'man, do you ever have it wrong'.\n\n \n Irrelevant. The Constitution made it wrong.\n \n \nHuh? Washington wasn't a Republican!\n\n \n Did say that he was.\n \n \nThe 'Republican Party' was founded in the 1850s. History isn't your strong-point.\n\n \n Didn't say that they were republicans either. I had said that it was those conservatives types who would later be the bases for it. You are a bit hung up on sementics. I guess that thinking isn't your strong point either.\n \n \nYes, I understand you suggest that there was a party that 'evolved' into the Republicans, but Washington wasn't even elected by popular vote. None of the first presidents, regardless of the party, were elected by popular vote!\n\n \n But he still wasn't appointed as king as the conservatives of the time wanted.\n \n \nFirst you're saying that America is the first real democracy, now you've switched around and saying that they were trying to set up a democracy. Logic, too isn't your strong-point.\n\n \n How is it switching when just said that I switched to the same thing I had said before? I see that you don't know what logic is either.\n \n \nCircular reasoning. Anyone who went against slavery had to have gone against the established system! The system was established (by your own argument; by atheists). Therefore these Christians went against the established system. They were 'heretics' in that sense. However, they followed Christian values, not secularist ones. Secularists had established that some men were inferior.\n\n \n Man, are you ever screwed up.\n \n \nI wrote \"What about the Pope? An absolute ruler? No, he's accountable to God. He's elected by his peers.\"\n \n Huh? I'm not saying that everything he says isn't from his God. It's you making the claim.\n\n \n No, it is the Church which makes that claim. You're just being an irrelevant.\n \n \nAgain your bias. Even if it were hearsay, then show me the words 'attributed' to Jesus that you object too. You can't even do that!\n\n \n Of course not. They don't admit that it is nothing more then hearsay.\n \n \nShow me what you are actually objecting to, even if it's just hearsay. You can't. You just have an irrational hatred of religion.\n\n \n Please. Such tactics are nothing more than apologetics and thus discounted.\n \n \nThe former Roman Empire again shows your western sensibilities! You mean the Western Roman Empire, because the Roman Empire in the east continued well past the establishment of the Holy Roman Empire. Sorry, history and geography don't seem to be your strong points. You need to look beyond western history. It matters not that your own background is European, because you've adopted the dominant American culture as your reference point. All your statements follow from that axiom.\n\n \n It was still the Roman Empire. It is irrelevant if while it was self-destructing that half of it managed to split off and survive for a bit afterwards.\n \n Like it or not Australia is a Western style society as well. Remember, you are decended from British prisoners, castoffs, and undesirables for the most part.\n \n \nAnd you showed no evidence. You just make a pronouncement. Making pap statements is not an argument.\n\n \n Please. again you show yourself for what you truly are. Either that or you forget you history.", 
   {}, 
   22590, 
   null, 
   1068869040.0
  ], 
  [
   22629, 
   null, 
   "Charchuk", 
   "Charchuk, there are only two continents in the new world. North and South America. \n \n It's funny. Charchuk makes responses like \"No, not really\", \"Irrelivent\", \"You're wrong\", \"You're stupid\", \"You don't get it\", and never clearly makes his thesis or argues it for that matter.\n\n \n Look what I had to work with. You're almost not worth it with your blatant willful ignorance of the issue. \n \n So, I get one thing slightly wrong. It is nothing in comparison to what you've been saying.", 
   {}, 
   22606, 
   null, 
   1068869100.0
  ], 
  [
   22630, 
   null, 
   "Charchuk", 
   "I must admit that I did assume that he was 'American' as in from the USA because of the line he was taking - just because he says he's in Canada doesn't mean anything. He certainly acts like an American; USA is the be-all and end-all of democracy, and is the model for all democracies that came thereafter.\n\n \n Yeah, I'm sure that it was a democratic Britain which sent your ancestors to Australia.\n \n \nHe might be 'Canadian' in nationality but he spouts dominant Anglo-American WASPish tripe, and replies like you mention here.\n\n \n What is your race? Is it white by anychance? BTW, I maybe white, but I'm neither anglo-saxon nor a protestant. I was raised catholic and I'm half French.\n \n \nAnyway, I'm still waiting for him to give a proper reply. He seems to use the 'Lurch' approach to argument... one sentence rebuttal as Lurch used to do... where is Lurch anyway?\n\n \n Usually that is all you're worth.\n \n \nIt is an oppressive belief system. It is so, because it's founder was a part-time desert pirate who's raiders got lucky and struck out at the Byzantine and Persian empires exactly when these two regional super-powers were exhausted after slogging it out against each other for decades; the Persian Empire fell in a year to Islam, the Byzantine Empire lasted; but lost vast amounts of territory.\n\n \n Meaningless apologist propaganda. Christianity's history is just as bloody and more so. Especially against those Christians who were not of the same sect. Afterall, that is one reason who so many left England. Religious presecution.\n \n I can see now what the others have been saying about you. They're right.", 
   {}, 
   22612, 
   null, 
   1068869580.0
  ], 
  [
   22635, 
   null, 
   "montalban", 
   "'I must admit that I did assume that he was 'American' as in from the USA because of the line he was taking - just because he says he's in Canada doesn't mean anything. He certainly acts like an American; USA is the be-all and end-all of democracy, and is the model for all democracies that came thereafter.\n\n \n \nYeah, I'm sure that it was a democratic Britain which sent your ancestors to Australia\n\n \n Yeah, I'm sure that it was a democratic America that had slavery. Oops, that's right, they did too! Funny that. So, you can be a 'democracy' and still be oppressive. You're so lame that you don't even realise this; you keep talking about the lie of George W Bush, but the next minute you're going on about America the great! I've never known anyone who is so able to meld two conflicting strains into the same gasp as yourself.\n \n But, again your limited knowledge. You're assuming that my ancestors were convicts; most Australians don't have convict ancestry... don't let facts get in the way of your argument. None of my ancestors were convicts! My father, for instance was born in Clay City, Clay County, Indiana! Except I don't need to be an American apologist like yourself. I don't feel less about myself because I'm not American. Australia gave women the vote in federal elections in 1902. The USA did so in 1919. Did this mean that Australia was in fact 'more' democratic than the USA?\n \n But there's a difference between you and I here. I am not saying that Britain is the prime example of democracy. I am just saying that they are a democracy. You're saying that the USA is the prime example; without it we'd not have any modern democracies left.\n \n You provide no evidence, just more vacuous statements. \n \n \nHe might be 'Canadian' in nationality but he spouts dominant Anglo-American WASPish tripe, and replies like you mention here.\n\n \n \nWhat is your race? Is it white by anychance? BTW, I maybe white, but I'm neither anglo-saxon nor a protestant. I was raised catholic and I'm half French.\n\n \n There is no such thing as race. I agree with Marxists on this. That is why it's irrelevant that you're Canadian; you wanna be American. You put forward America as the normative model of a democracy. You crave what you're not.\n \n \nAnyway, I'm still waiting for him to give a proper reply. He seems to use the 'Lurch' approach to argument... one sentence rebuttal as Lurch used to do... where is Lurch anyway?\n\n \n \n Usually that is all you're worth\n\n \n Wow! A frank admission that you don't have anything to back you up; that takes a lot of guts to admit you're arguing without facts. Lurch would never have done even that. That's cool. You've said you're an ex-Catholic, so from that you're hating all religions. Try a little insight into your own thought processes though; actually that's probably asking too much.\n \n \nIt is an oppressive belief system. It is so, because it's founder was a part-time desert pirate who's raiders got lucky and struck out at the Byzantine and Persian empires exactly when these two regional super-powers were exhausted after slogging it out against each other for decades; the Persian Empire fell in a year to Islam, the Byzantine Empire lasted; but lost vast amounts of territory.\n\n \n \nMeaningless apologist propaganda. Christianity's history is just as bloody and more so. Especially against those Christians who were not of the same sect. Afterall, that is one reason who so many left England. Religious presecution.\n\n \n Firstly, so you disagree that Islam rose at the time that the Persian and Byzantine Empires had exhausted themselves? I'm not sure that you know what you're disagreeing with. You're a comic debater. What is it that you're actually disagreeing too?\n \n Secondly, prove that Christian history is more bloody. Oops, that's right you don't have any facts do you. Keep up with the meaningless drivel.\n \n \n \nI can see now what the others have been saying about you. They're right\n\n \n 'They' again. Do you consult 'them' often? Do 'they' reply?\n \n Anyway, consult them, find an argument, then get back to me.", 
   {}, 
   22630, 
   null, 
   1068872280.0
  ], 
  [
   22641, 
   null, 
   "montalban", 
   "What a continental border? Mexico is part of America. It is part of North America. \n\n \n \nWhat, I had said that Mexico is part of North America.\n\n \n well I asked..\n \n \nCanada is on the American continent isn't it?\n\n \n and you replied...\n \n \nNo, it isn't.It is the North American continent. Though, I bet a lot of Mexicans would like it to be so they wouldn't have to sneak across the border\n\n \n You made a confusing statement about Mexicans wishing that they were on the same continent as Canada.\n \n \nJust because there's a man-made border between Mexico and the US doesn't mean the continent ends there!\n\n \n \nLike the one between Europe and Asia?\n\n \n There is no man made border that equates to the separation of Europe and Asia. I am unaware of one. Tell me about the one you know of.\n \n [QUOTE=Montalban]Actually for simplicity's sake there are only 2 American continents. Your smugness now looks ridiculous. Central America is not a continent. You American! It's no more a continent than the term \"the Middle East\"; you are right, obviously education in America is falling.\n \n \nIt is the connector between the two, sort of a sub-continent. Sort of like Australia like a sub-Continuent and India as well.\n\n \n Australia is neither a sub-Continent, nor a connector between continents. It's a poor analogy again you're using there! The only area that I know of to be commonly referred to as a sub-continent is India. But, I'm sure your back-pedalling has a point.\n \n \nThe only reason people refer to \"Latin America\" or \"Central America\" is to separate cultures of Anglo-America from the rest. You've adopted the dominant western WASPish mindset, and you've done the same. It is you who want to be part of this homogenous American culture.\n\n \n \nYou don't know Canadians very well, do you?\n\n \n Most Canadians I've met are polite and well-educated. You are neither. But then you want to be American don't you. You keep praising them above all else, even Canada.\n \n \n Huh? Britain was an evolving democracy. The Magna Carta is part of your anglo-American heritage too! Both the USA and Canada can look to it as the ancestor.\n\n \n \nAs a template only. It had to be modified to be of any real use\n\n \n So? Britain is an evolving democracy. The USA is too. Why then is the USA the 'first' modern democracy. I asked you to define it, you haven't, because you don't really have a definition. Australia too in a sense uses Magna Carta. We too are an evolving democracy.\n \n \n What you mean France wasn't a success? Britain wasn't a success?\n\n \n \n The French Revolution was AFTER the American Revolution. The USA was the first.\n\n \n So? Britain was before the USA. They had a parliament which was just as representative as the USA system - because in effect even today no one directly votes for the US president... it's the electoral college that counts. If Britain was a democracy before the USA, and France after, then why is the USA the 'first modern democracy'?\n \n \n When I went to school, Modern History for us began at the French Revolution, therefore the founding of the USA was just before 'Modern History' began. I understand that different educational spheres have delineated a different starting point for the modern world.\n \n \n \n You seem to forget Canada's other heritage.\n \n \n What's this got to do with the price of fish? I said that modern history is sometimes said to have begun at the French Revolution. Therefore it could be said that France is the first modern democracy, because the US Revolution is too early to be considered modern. This is you fault for not defining your statement about the USA being the first modern democracy.\n \n \n Who did? The atheists; Hume, and Locke!\n \n \n \n Slavery existed in the colonies before there was a USA.\n \n \n Yes, that's right. Locke, an atheist helped write the charter for the Carolinas, enshrining slavery. The USA founding fathers had the opportunity to end it in 1776 when they declared independence, or later when they drew up the Constitution, but they didn't. Why does this keep escaping you? I know these facts are frustrating to your anti-religious argument, but you'll just have to deal with them.\n \n \n I said \"Your champion atheists founded a nation based on slavery.\" And you agree that the founders of the USA were atheists.\n \n \n \n Where did I said anything like that..\n \n \n Come come, don't be coy!\n \n In post 26 you quote me saying...\n \n\"The birth (or re-birth) of democracy in the West was because of Christianity. Radical religious groups such as the Quakers, Levellers etc. saw that as each of us is created in God's image, we are all, men and women, equal.\"\n \n \n And you said...\n \nWrong\n \n \n So you don't agree that the founding fathers were radical Christians. Plain and simple. You admit that 'some/many' had fled to America. That's it.\n \n In post 35 when you said \nWho said anything about them being atheists? ... Many of them were deists.\"\n\n \n So, 'some' of them are atheists. 'Many' of them are deists, but not radicals, nor non-radicals either, according to you. You keep bandying about such loose terms as 'they' and 'many', it's hard for you to follow your argument.\n \n But then again in Post7 you did say \nChristianity is growing at a stagnant rate of around 2.3% per year.\n If it's stagnant, it's not growing! Sometimes you show an inability to know what you're saying\n \n \nHuh? Let's look... you claim that the founders of the USA weren't Christian, but atheists.\n \n Deist:\n 1. A person who believes that God created the universe and then abandoned it\n\n \n So, I know what a deist is. Some deists believe that god no longer exists, therefore they are atheists... god does not exist now.\n \n \nThe USA was founded with slavery entrenched. Therefore 'man, do you ever have it wrong'.\n\n \n \nIrrelevant. The Constitution made it wrong.\n\n \n What? The same constitution that made the USA the model of democracy? But you're the one arguing that they are the exemplar model of democracy! Yet Britain ended slavery before the USA did; and they didn't have half the nation rise up in arms to defend slavery either! So it's not the people who wrote the Constitution, it's the Constitution itself that's at fault. It must have a life of its own.\n \n \nHuh? Washington wasn't a Republican!\n\n \n \nDid say that he was.\n\n \n You said that the Republicans, or what would become the Republican party tried to make a monarchy in the USA. But you reply too soon anyway...\n \n \nThe 'Republican Party' was founded in the 1850s. History isn't your strong-point.\n\n \n \nDidn't say that they were republicans either. I had said that it was those conservatives types who would later be the bases for it. You are a bit hung up on sementics. I guess that thinking isn't your strong point either.\n\n \n They're your words... Next I said... \n \nYes, I understand you suggest that there was a party that 'evolved' into the Republicans, but Washington wasn't even elected by popular vote. None of the first presidents, regardless of the party, were elected by popular vote!\n\n \n And you reply...\n \n \nBut he still wasn't appointed as king as the conservatives of the time wanted.\n\n \n Now you're really off your nut? Let me summarize, the USA, founded as the ideal democracy by a large group of people who either believed that God never existed or did once exist create your perfect state, which includes slavery, but it's not they're fault, it's the constitution that made it wrong, or people who would 70 years later form the Republican Party. That's cleared things up.\n \n \n\n First you're saying that America is the first real democracy, now you've switched around and saying that they were trying to set up a democracy. Logic, too isn't your strong-point.\n\n \n \nHow is it switching when just said that I switched to the same thing I had said before? I see that you don't know what logic is either.\n\n \n Because you keep switching! One minute you say one thing, then another, then you're back to the original point, then next you're switched again, then back to the original point. Just because you keep saying one point - the USA is the first modern democracy, doesn't mean you've got an argument, especially when you keep saying other things that don't site well with it.\n \n \nCircular reasoning. Anyone who went against slavery had to have gone against the established system! The system was established (by your own argument; by atheists). Therefore these Christians went against the established system. They were 'heretics' in that sense. However, they followed Christian values, not secularist ones. Secularists had established that some men were inferior.\n\n \n \nMan, are you ever screwed up.\n\n \n If you say so. You're the one who said that they went against the system, and the system was established by atheists other humanist losers.\n \n \nI wrote \"What about the Pope? An absolute ruler? No, he's accountable to God. He's elected by his peers.\"\n Huh? I'm not saying that everything he says isn't from his God. It's you making the claim.\n\n \n \nNo, it is the Church which makes that claim. You're just being an irrelevant.\n\n \n And you're being irreverent. You tried to show that religion is bad because a religious person (the Pope) remains one of the last absolute rulers. I said, what about the Kim family in North Korea (and you've not mentioned them here because it's a hole in your argument; so you've gone back to just picking on the Pope).\n \n \nAgain your bias. Even if it were hearsay, then show me the words 'attributed' to Jesus that you object too. You can't even do that!\n\n \n \nOf course not. They don't admit that it is nothing more then hearsay.\n\n \n Exactly, you can't show your connexion. You made baseless claims about Christianity being the evil of the world, because of the actions of Christians. I asked you to show the teachings of Christ that lead to these evils, and you can't. You're effectively blaming Jesus for the failings of his followers. In fact because of your hatred of Catholicism, you've illogically extended it to all Christians, and all religions.\n \n I can show a connexion with Islam; however, because Muhammad (and I quoted him heavily) called for people to kill non-believers.\n \n \n\n Show me what you are actually objecting to, even if it's just hearsay. You can't. You just have an irrational hatred of religion.\n\n \n \nPlease. Such tactics are nothing more than apologetics and thus discounted.\n\n \n In other words you have no argument! Show me the money!\n \n \nThe former Roman Empire again shows your western sensibilities! You mean the Western Roman Empire, because the Roman Empire in the east continued well past the establishment of the Holy Roman Empire. Sorry, history and geography don't seem to be your strong points. You need to look beyond western history. It matters not that your own background is European, because you've adopted the dominant American culture as your reference point. All your statements follow from that axiom.\n\n \n \nIt was still the Roman Empire. It is irrelevant if while it was self-destructing that half of it managed to split off and survive for a bit afterwards.\n\n \n Of course it matters. You said that Christianity had the power of the Roman Empire behind it. Western Europe lost the Roman Empire. Even your terminology 'managed to split off and survive' suggests that the Eastern/Byzantine Empire broke away from the main empire. You're so Western-centric in your arguments its amazing. The Byzantine Empire didn't 'just manage to survive' at all. It was a vibrant entity for 1,000 more years! You suggest it was a mere accident.\n \n I am an Orthodox Christian. I am aware of the cultural heritage of the east.\n \n \nAnd you showed no evidence. You just make a pronouncement. Making pap statements is not an argument.\n\n \n \nPlease. again you show yourself for what you truly are. Either that or you forget you history.\n\n \n Your words speak volumes in nonsense. You're the one to make an irrational attack on Christianity based not on Christ but His followers. I keep asking you to show me what Christ says that's so objectionable and you can't.", 
   {}, 
   22590, 
   null, 
   1068875940.0
  ], 
  [
   22642, 
   null, 
   "Charchuk", 
   "Yeah, I'm sure that it was a democratic America that had slavery. Oops, that's right, they did too! Funny that. So, you can be a 'democracy' and still be oppressive. You're so lame that you don't even realise this; you keep talking about the lie of George W Bush, but the next minute you're going on about America the great! I've never known anyone who is so able to meld two conflicting strains into the same gasp as yourself.\n\n \n Actually the form of democracy which the founding fathers had finally decided on was to be a republic.\n \n I never said even once that America was great. All I ever said was that the USA was first country to successfully use the democratic process on a larger scale.\n \n \nBut, again your limited knowledge. You're assuming that my ancestors were convicts; most Australians don't have convict ancestry... don't let facts get in the way of your argument.\n\n \n Sure, some were the unwanted underclass as well. With only a small minority being actual colonists there by their own choice.\n \n \nNone of my ancestors were convicts! My father, for instance was born in Clay City, Clay County, Indiana! Except I don't need to be an American apologist like yourself.\n\n \n Now I understand why you're being so irrational. You're projecting.\n \n \nI don't feel less about myself because I'm not American. Australia gave women the vote in federal elections in 1902. The USA did so in 1919. Did this mean that Australia was in fact 'more' democratic than the USA?\n\n \n Like I had said, I never said anything at all about how great the USA was. Only that it was the first successful country to use the democratic process\n \n \nBut there's a difference between you and I here. I am not saying that Britain is the prime example of democracy. I am just saying that they are a democracy. You're saying that the USA is the prime example; without it we'd not have any modern democracies left.\n\n \n Of course, wouldn't have been any in the same vein or extent. The French even stated that the American Revolution was what had inspired them.\n \n \nThere is no such thing as race. I agree with Marxists on this.\n\n \n So, you're a communist?\n \n \nThat is why it's irrelevant that you're Canadian; you wanna be American.\n\n \n Hardly. Boy, are you ever wrong on that account. But than again, you are projecting. I would never want to be an American. I couldn't stand the lowering in my standard of living. :)\n \n \nYou put forward America as the normative model of a democracy. You crave what you're not.\n\n \n You really have a bug up your rear.\n \n \nWow! A frank admission that you don't have anything to back you up;\n\n \n Please. \n \n \nthat takes a lot of guts to admit you're arguing without facts. Lurch would never have done even that. That's cool. You've said you're an ex-Catholic, so from that you're hating all religions. Try a little insight into your own thought processes though; actually that's probably asking too much.\n\n \n Most of the time you're not worth going into too much detail. You're more interesting in ad homs.\n \n \nFirstly, so you disagree that Islam rose at the time that the Persian and Byzantine Empires had exhausted themselves? I'm not sure that you know what you're disagreeing with. You're a comic debater. What is it that you're actually disagreeing too?\n\n \n I never said any such thing. I'm just saying that Christianity's history is just as or maybe even more bloody.\n \n \nSecondly, prove that Christian history is more bloody. Oops, that's right you don't have any facts do you. Keep up with the meaningless drivel.\n\n \n Hitler had over 6 million Jews exterminated. The Burning Times in Europe, The Inquisitions. the Crusades, and of course of the centuries of wars between differing Christian sects as well.\n \n '\nThey' again. Do you consult 'them' often? Do 'they' reply?\n \n Anyway, consult them, find an argument, then get back to me.\n\n \n You are irrelevant. A minor amazement only.", 
   {}, 
   22635, 
   null, 
   1068875940.0
  ], 
  [
   22643, 
   null, 
   "Parcum", 
   "Compared to what Christians have done throughout the centuries to other Christians not of their sect it is irrelevant. You're far worse on your own than on anyone else. Being a heretic was a capital offence.\n\n \n What about what the Sunnis have done to the Shi'ites and vice versa? They have been in many wars and have killed eachother! Ever heard of the Persian and Ottoman Empires?", 
   {}, 
   22635, 
   null, 
   1068876360.0
  ], 
  [
   22644, 
   null, 
   "montalban", 
   "So now you're saying as evidence of the evilness of Christianity you wish to submit Hitler's holocaust?\n \n That's rich. You don't want to submit atheists such as Mao, Stalin, the Kim family, Pol Pot etc killed anyone?\n \n \n \n Also...\n \n You mention France was inspired by the USA. So what?\n \n The USA's common law was inspired by Britains.\n \n What makes the USA the 'first'.\n \n You've just plucked them out for your example. Britian is older, France is younger. But the USA is 'first'.", 
   {}, 
   22642, 
   null, 
   1068876480.0
  ], 
  [
   22646, 
   null, 
   "montalban", 
   "What about what the Sunnis have done to the Shi'ites and vice versa? They have been in many wars and have killed eachother! Ever heard of the Persian and Ottoman Empires?\n\n \n \n I think he's been listiening to 'them' again!", 
   {}, 
   22643, 
   null, 
   1068876600.0
  ], 
  [
   22647, 
   null, 
   "Charchuk", 
   "What about what the Sunnis have done to the Shi'ites and vice versa? They have been in many wars and have killed eachother! Ever heard of the Persian and Ottoman Empires?\n\n \n So, they have yet another thing in common with Christianity. Both are complete Smegheads. \"So, what else is new?\" :)", 
   {}, 
   22643, 
   null, 
   1068876660.0
  ], 
  [
   22648, 
   null, 
   "Charchuk", 
   "So now you're saying as evidence of the evilness of Christianity you wish to submit Hitler's holocaust?\n\n \n http://www.beyond-the-illusion.com/files/Religion/Islam/research/hitler.html\n \n \nThat's rich. You don't want to submit atheists such as Mao, Stalin, the Kim family, Pol Pot etc killed anyone?\n\n \n Stalin was a seminary student. As for the rest, they are from far eastern countries and their idea of religion is different for the most part.\n \n \n \nAlso...\n \n You mention France was inspired by the USA. So what?\n \n The USA's common law was inspired by Britains.\n \n What makes the USA the 'first'.\n\n \n The first to put it into wide spread operation. American Law was also inspired by many other sources as well.\n \n \nYou've just plucked them out for your example. Britian is older, France is younger. But the USA is 'first'.\n\n \n The UK is a constitutional monarchy. Even at its start American presidents were not in for life. That is one of the main differences.", 
   {}, 
   22644, 
   null, 
   1068877140.0
  ], 
  [
   22649, 
   null, 
   "Charchuk", 
   "I think he's been listiening to 'them' again!\n\n \n Non sequitur. I see that this discussion is over. Now declare victory so you can make yourself feel important. :)", 
   {}, 
   22646, 
   null, 
   1068877260.0
  ], 
  [
   22651, 
   null, 
   "Parcum", 
   "\n So, they have yet another thing in common with Christianity. Both are complete Smegheads. \"So, what else is new?\" \n\n \n A) We have in recent centuries civilized ourselves.\n B) The faith is civil.", 
   {}, 
   22649, 
   null, 
   1068878880.0
  ], 
  [
   22667, 
   null, 
   "montalban", 
   "You're one funny fella!\n \n \nhttp://www.beyond-the-illusion.com/files/Religion/Islam/research/hitler.html\n\n \n Okay, you think Hitler was Christian. What teachings of Christ did he use?\n \n \n \nStalin was a seminary student. As for the rest, they are from far eastern countries and their idea of religion is different for the most part.\n\n \n So? Stalin gave up his studies! I suppose now you're going to go back through the lives of all the evil atheists and if they were once remotely religious that proves your point about religion being evil. You were once religious therefore you still evil! (by your own logic).\n \n \nYou mention France was inspired by the USA. So what?\n The USA's common law was inspired by Britains.\n What makes the USA the 'first'.\n\n \n \nThe first to put it into wide spread operation. American Law was also inspired by many other sources as well.\n\n \n What did they put into wide-spread operation first? Common law? You're kidding :)\n \n What did the USA lead the world in with regards to government?\n \n \nThe UK is a constitutional monarchy. Even at its start American presidents were not in for life. That is one of the main differences.\n\n \n So? The Prime Ministers aren't.\n \n Do you know what a constitutional monarchy is? It's a monarchy that's powers are limited by a constitution. Australia is a constitutional monarchy. We gave women the right to vote before America. Australia also lead the world with the secret ballot.\n \n Britain, a constitutional monarchy freed slaves before America.\n \n America followed the examples of others in these cases.\n \n Look at inspiration... it unilaterally declared its independence from Britain. How many others did this? Only one... Rhodesia! Not even the Irish took this step!\n \n It was not the first republic. It was not the first democracy. It was not the first constitutional nation. It may have inspired other nations, but it too was inspired. It was not the first 'modern' anything in the sense that modern history (at least by one account) begins after the American Revolution.", 
   {}, 
   22648, 
   null, 
   1068888540.0
  ], 
  [
   22668, 
   null, 
   "montalban", 
   "Non sequitur. I see that this discussion is over. Now declare victory so you can make yourself feel important. \n\n \n \n Is that what 'they' tell you to do?", 
   {}, 
   22649, 
   null, 
   1068888720.0
  ], 
  [
   22670, 
   null, 
   "montalban", 
   "Charchuk has suggested that Hitler was Christian.\n \n Let's see if we can follow the logic....\n \n \n Hitler hated Jews.\n \n Jesus was a Jew.\n \n Hitler hated all Jews, therefore he hated Jesus.\n \n If he hated Jesus, he can't have been a good Christian.\n \n \n \n Christians revere the Bible. Most books in the Bible were written by Jews and feature people who were Jews.\n \n \n Even blind-freddy knows this.\n \n \n But then hatred has never been rational", 
   {}, 
   22668, 
   null, 
   1068889260.0
  ], 
  [
   22702, 
   null, 
   "Charchuk", 
   "A) We have in recent centuries civilized ourselves.\n B) The faith is civil.\n\n \n But that wasn't always so. As I had said, Islam is where Christianity was a few short centuries ago.", 
   {}, 
   22651, 
   null, 
   1068909300.0
  ], 
  [
   22705, 
   null, 
   "Charchuk", 
   "You're one funny fella!\n\n \n You make it so easy.\n \n \nOkay, you think Hitler was Christian. What teachings of Christ did he use?\n\n \n What teachings did the Church use of Christ's to justify much of what they did as well?\n \n \nSo? Stalin gave up his studies! I suppose now you're going to go back through the lives of all the evil atheists and if they were once remotely religious that proves your point about religion being evil. You were once religious therefore you still evil! (by your own logic).\n\n \n Evil atheists? There really aren't that many of them, especially when compared to all of the evil theists. :)\n \n \nWhat did they put into wide-spread operation first? Common law? You're kidding :)\n\n \n The idea of responsible government. The British monarch was not responsible to the British common people at that time. The Magna Carta only mainly gave more power to the British nobility. Though, Queen Victoria did try an experiment in Nova Scotia in regards to responsible government around 1848, but that was still very limited. The Governor General answered to the elected government and not directly to her. But of course this was nearly 60 years after the American Revolution.\n \n \nWhat did the USA lead the world in with regards to government?\n\n \n As I had said responsible government on a much larger scale.\n \n \nSo? The Prime Ministers aren't.\n\n \n At the time PMs were cabinet ministers who is in charge of government affairs, not the leader of a country. That was the monarch. It is different today. The Queen of England is little more than a figurehead.\n \n \nDo you know what a constitutional monarchy is? It's a monarchy that's powers are limited by a constitution. Australia is a constitutional monarchy. We gave women the right to vote before America. Australia also lead the world with the secret ballot.\n\n \n Nope it isn't a constitutional monarchy, though, you do recognize the British monarch as sovereign. Australia is a democratic, federal-state system.\n \n \nBritain, a constitutional monarchy freed slaves before America.\n\n \n So?\n \n \nAmerica followed the examples of others in these cases.\n \n Look at inspiration... it unilaterally declared its independence from Britain. How many others did this? Only one... Rhodesia! Not even the Irish took this step!\n \n It was not the first republic. It was not the first democracy. It was not the first constitutional nation. It may have inspired other nations, but it too was inspired. It was not the first 'modern' anything in the sense that modern history (at least by one account) begins after the American Revolution.\n\n \n I was the first democractic country in modern times. Even the term democratic was obscure at the time. Most people who even had the education only know it as something tried by the anicent Greeks.", 
   {}, 
   22667, 
   null, 
   1068910560.0
  ], 
  [
   22706, 
   null, 
   "Charchuk", 
   "Is that what 'they' tell you to do?\n\n \n Is your tinfoil hat coming loose?", 
   {}, 
   22668, 
   null, 
   1068910620.0
  ], 
  [
   22707, 
   null, 
   "Charchuk", 
   "Charchuk has suggested that Hitler was Christian.\n \n Let's see if we can follow the logic....\n \n \n Hitler hated Jews.\n \n Jesus was a Jew.\n \n Hitler hated all Jews, therefore he hated Jesus.\n \n If he hated Jesus, he can't have been a good Christian.\n\n \n Hitler, like many Christians of the time were taught that Jews were responsible for Christ's death. BTW, even then Hitler, himself, wanted the most humane method used to get rid of the Jews. He didn't want them to suffer for very long. It wasn't as if the German people put up all that much of a fuss when the Nazis made laws restricting what Jews could do and own eiter. Hitler didn't invent anti-semitism it was already well entrenched throughout Europe. And later, most other nations wouldn't take them in when they were depoted. It was a very shameful period as well.\n \n Tell most Christians today that Jesus was a Jew and they'll laugh at you. Come on go ahead. BTW, start in the deep south of the USA and I don't mean South America. :)\n \n \nChristians revere the Bible. Most books in the Bible were written by Jews and feature people who were Jews.\n\n \n So, all of the persecution throughout the centuries of Jews by Christians didn't actually happen?\n \n \nBut then hatred has never been rational\n\n \n Yes, you sure are irrational.", 
   {}, 
   22670, 
   null, 
   1068911160.0
  ], 
  [
   22717, 
   null, 
   "Parcum", 
   "\n But that wasn't always so. As I had said, Islam is where Christianity was a few short centuries ago.\n\n \n Islam has always been what it's like today, from it's conception. Christianity has had it's ups and downs, and in it's conception was peace.", 
   {}, 
   22707, 
   null, 
   1068927600.0
  ], 
  [
   22723, 
   null, 
   "Charchuk", 
   "Islam has always been what it's like today, from it's conception. Christianity has had it's ups and downs, and in it's conception was peace.\n\n \n Hardly. Much of what we know of Christianity is taken from Paul, a man who never actually met Christ. For much of its history it has been just like Islam is today. \n \n http://www.geocities.com/iconoclastes.geo/victims.html\n \n http://www.religioustolerance.org/comp_isl_chr.htm", 
   {}, 
   22717, 
   null, 
   1068931380.0
  ], 
  [
   22728, 
   null, 
   "Parcum", 
   "Much of it, sure. But most of it is from the apostles who wrote about Christ. Some of it is from Paul. We also know abotu Christianity through the traditions of old rites- for instance, the Malabar-Christians, or St. Thomas Christians, who were cut off from Christianity for hundreds of years but still kept the same beliefs. \n \n Once again, you bring two uncrediable sources.", 
   {}, 
   22723, 
   null, 
   1068934080.0
  ], 
  [
   22760, 
   null, 
   "montalban", 
   "Okay, you think Hitler was Christian. What teachings of Christ did he use?\n\n \n \nWhat teachings did the Church use of Christ's to justify much of what they did as well?\n\n \n Once again you sign-post your argument so well. By not answering my question you are screaming 'I don't have an answer'. As to your question, I'm assuming that when you say 'much of what they did' you are referring to bad things. Well they couldn't quote scripture to justify doing bad things. THAT IS THE WHOLE POINT. Eh! You haven't caught on yet. Christ can't be blamed for what some idiot does or says.\n \n \n So? Stalin gave up his studies! I suppose now you're going to go back through the lives of all the evil atheists and if they were once remotely religious that proves your point about religion being evil. You were once religious therefore you still evil! (by your own logic). \n\n \n \nEvil atheists? There really aren't that many of them, especially when compared to all of the evil theists.\n \n\n \n a) you fail to address the gaping hole in the logic of your argument; by suggesting that Stalin was a Christian.\n b) Stalin, Mao, Hitler, the Kim family in power in North Korea, Pol Pot, they've probably killed more people than Christians ever have. They've made up for small numbers.\n \n What Christian teachings inspired the creation of the World Bank, or the IMF which cripple nations?\n \n \nWhat did they put into wide-spread operation first? Common law? You're kidding \n\n \n \nThe idea of responsible government. The British monarch was not responsible to the British common people at that time.\n \n\n \n You're kidding again. Stop trying to tweak with the argument. We're not talking about the monarch. The Parliament was responsible; to a limited franchise, but this franchise was no less 'responsible' than the American one at the founding of the USA. (The USA didn't allow you to vote if you were a woman (50% of the population right there!), if you were black, if you were an Amerindian, if you didn't own property.\n \n Tell me how many Americans voted for Geo. Washington?\n \n The first presidents were never subject to popular vote...\n \" Due to the communications constrictions of the time and the lack of formal political party organizations, the framers of the Constitution specified that the president and vice president be chosen based upon the votes cast by members of an electoral college rather than by a direct popular vote. Eventually, states began to change the method by which electors cast their votes. Today, all but two states, Maine and Nebraska, have a winner-take-all system in which a popular vote decides which candidates will be given all of a given state's electoral votes. \"\n http://www.infoplease.com/ipa/A0781450.html\n \n \nWhat did the USA lead the world in with regards to government?\n \n\n \n \nAs I had said responsible government on a much larger scale.\n \n\n \n See above.\n \n \nSo? The Prime Ministers aren't.\n\n \n \nAt the time PMs were cabinet ministers who is in charge of government affairs, not the leader of a country. That was the monarch. It is different today. The Queen of England is little more than a figurehead.\n\n \n Wrong again. Walpole is generally regarded as the first 'Prime Minister' in the modern sense. This was during the reign of George I. That's two Georges before American became independent.\n \n \nDo you know what a constitutional monarchy is? It's a monarchy that's powers are limited by a constitution. Australia is a constitutional monarchy. We gave women the right to vote before America. Australia also lead the world with the secret ballot.\n\n \n \nNope it isn't a constitutional monarchy, though, you do recognize the British monarch as sovereign. Australia is a democratic, federal-state system.\n\n \n Australia is a democracy. Yes. We are a federal-state system. Yes. We are also a constitutional monarchy! You've looked up the CIA world fact book on this.\n \n I'll put it as simple as I can make it \"Australia is a constitutional monarchy. This means that the head of State is a monarch, or sovereign, who is governed and bound by the Constitution.\"\n http://www.australianpolitics.com/democracy/terms/constitutional-monarchy.shtml\n \n \n \n Britain, a constitutional monarchy freed slaves before America.\n\n \n \nSo?\n\n \n American didn't lead the way in this field, so much for Britain being unrepresentative, undemocratic etc.\n \n \nAmerica followed the examples of others in these cases.\n Look at inspiration... it unilaterally declared its independence from Britain. How many others did this? Only one... Rhodesia! Not even the Irish took this step!\n It was not the first republic. It was not the first democracy. It was not the first constitutional nation. It may have inspired other nations, but it too was inspired. It was not the first 'modern' anything in the sense that modern history (at least by one account) begins after the American Revolution.\n\n \n \nI was the first democratic country in modern times.\n\n \n I know you love saying this, because it sounds good. As I said, at least, when I was at school, modern history studies began with the French Revolution. Perhaps your modern history books do start with the American revolution.\n \n \nEven the term democratic was obscure at the time. Most people who even had the education only know it as something tried by the ancient Greeks.\n\n \n Switzerland was/is a democracy that is older than the USA. San Marino is too. There were many democracies in medieval times; in Italy. France was younger. What makes the USA 'first'?", 
   {}, 
   22705, 
   null, 
   1068946860.0
  ], 
  [
   22762, 
   null, 
   "montalban", 
   "Hardly. Much of what we know of Christianity is taken from Paul, a man who never actually met Christ. For much of its history it has been just like Islam is today. \n \n http://www.geocities.com/iconoclastes.geo/victims.html\n \n http://www.religioustolerance.org/comp_isl_chr.htm\n\n \n Yes, again you post this last site; a Muslim one. Funny that they'd favourably compare the two.\n \n Look at Christianity for its first 300 years. And then at Islam.\n \n Christianity peacefully spread throughout the Roman Empire, despite being persecuted by the state.\n \n Islam spread by war across vast areas, where Islamic law was imposed and non-believers were discriminated against. Islamic governments were imposed. Special poll-taxes were raised on non-believers.\n \n Charchuk, I know you want to ignore these historic truths, but at least other people reading this may not.\n \n I mean, you didn't even get a Christian talking about a justified war till 400 years - with Augustine of Hippo.\n \n Right from its inception Islam was an aggressive religion that used power, and the sword.", 
   {}, 
   22723, 
   null, 
   1068947160.0
  ], 
  [
   22764, 
   null, 
   "montalban", 
   "Much of it, sure. But most of it is from the apostles who wrote about Christ. Some of it is from Paul. We also know abotu Christianity through the traditions of old rites- for instance, the Malabar-Christians, or St. Thomas Christians, who were cut off from Christianity for hundreds of years but still kept the same beliefs. \n \n Once again, you bring two uncrediable sources.\n\n \n The guy can't put 2 + 2 together!\n \n His first site shows the earliest killing...\n \n \"Already in 385 C.E. the first Christians, the Spanish Priscillianus and six followers, were beheaded for heresy in Trier/Germany\"\n \n That's almost 400 years after Christ.\n \n I showed in one of my first posts that Muhammed killed 900 PoWs; that's in his own life-time! He applauded assasinations.\n \n Christ ordered Peter to put away his sword.\n \n But some XXXXXX want to smear Christ with the same brush as Muhammed\n \n It is quite clear that Islam was founded by a militant man. Christianity was not.\n \n His argument is like saying \"Democracy is evil, because two hundred years after the founding of the USA, the President lied about the war in Iraq, therefore let's scrap democracy\"\n \n The old saying of throwing the baby out with the bathwater applies to his logic.", 
   {}, 
   22728, 
   null, 
   1068947580.0
  ], 
  [
   23405, 
   null, 
   "montalban", 
   "I am glad that no one else has stepped into the ring to defend Islam.\n \n There are good and bad people everywhere. There are good and bad ideologies everywhere too.\n \n One, such as Islam, based as it is on the teachings of a leecherous sadistic man, can not be too good. And this has been borne out by the fruit it bears.", 
   {}, 
   22764, 
   null, 
   1069415940.0
  ], 
  [
   23431, 
   null, 
   "Charchuk", 
   "Much of it, sure. But most of it is from the apostles who wrote about Christ. Some of it is from Paul. We also know abotu Christianity through the traditions of old rites- for instance, the Malabar-Christians, or St. Thomas Christians, who were cut off from Christianity for hundreds of years but still kept the same beliefs. \n \n Once again, you bring two uncrediable sources.\n\n \n So? There are really no firsthand accounts of Christ.", 
   {}, 
   22728, 
   null, 
   1069428480.0
  ], 
  [
   23435, 
   null, 
   "Charchuk", 
   "Once again you sign-post your argument so well. By not answering my question you are screaming 'I don't have an answer'. As to your question, I'm assuming that when you say 'much of what they did' you are referring to bad things. Well they couldn't quote scripture to justify doing bad things. THAT IS THE WHOLE POINT. Eh! You haven't caught on yet. Christ can't be blamed for what some idiot does or says.\n\n \n It is irrelevant. The Church still did what it thought what god wanted and used the bible to justify it.\n \n \n \na) you fail to address the gaping hole in the logic of your argument; by suggesting that Stalin was a Christian.\n\n \n He had his training as a Christian seminary student. While there who read Machiavelli and took it to heart.\n \n \nb) Stalin, Mao, Hitler, the Kim family in power in North Korea, Pol Pot, they've probably killed more people than Christians ever have. They've made up for small numbers.\n\n \n Hitler was a Christian. as for the rest they are a product of their cultures as well. They would have been the same even if they were theists. On a per capita basis they are nothing in comparison to what Christianity has been.\n \n \nWhat Christian teachings inspired the creation of the World Bank, or the IMF which cripple nations?\n\n \n What does this have to do with the price of tea in China? Plus, your last part is opinion.\n \n \nYou're kidding again. Stop trying to tweak with the argument. We're not talking about the monarch. The Parliament was responsible; to a limited franchise, but this franchise was no less 'responsible' than the American one at the founding of the USA. (The USA didn't allow you to vote if you were a woman (50% of the population right there!), if you were black, if you were an Amerindian, if you didn't own property.\n\n \n It still was far more \"democratic\" then what the British had. Their leader was appointed, and still is, through divine right. The American president was elected.\n \n \nTell me how many Americans voted for Geo. Washington?\n\n \n Which term? He was the only president who received 100% of the electoral college votes.\n \n http://www.heptune.com/preslist.html\n \n \nWrong again. Walpole is generally regarded as the first 'Prime Minister' in the modern sense. This was during the reign of George I. That's two Georges before American became independent.\n\n \n From time to time PMs \"took over\" control from the monachy, but they were still not elected.\n \n \nAustralia is a democracy. Yes. We are a federal-state system. Yes. We are also a constitutional monarchy! You've looked up the CIA world fact book on this.\n \n I'll put it as simple as I can make it \"Australia is a constitutional monarchy. This means that the head of State is a monarch, or sovereign, who is governed and bound by the Constitution.\"\n http://www.australianpolitics.com/democracy/terms/constitutional-monarchy.shtml\n\n \n So, you're PM isn't elected, and is in for life?\n \n \nAmerican didn't lead the way in this field, so much for Britain being unrepresentative, undemocratic etc.\n\n \n You forget how Britian treated its colonies.\n \n \nI know you love saying this, because it sounds good. As I said, at least, when I was at school, modern history studies began with the French Revolution. Perhaps your modern history books do start with the American revolution.\n\n \n I think that yours is starting with the modern history of art.\n \n \nSwitzerland was/is a democracy that is older than the USA. San Marino is too. There were many democracies in medieval times; in Italy. France was younger. What makes the USA 'first'?\n\n \n Switzerland didn't get its constitution until 1874. \n \n And they didn't allow women to vote until 1971.\n \n http://www.ipu.org/wmn-e/suffrage.htm\n \n The USA was the first successul one on a larger scale and I had said this as well.\n \n I can understand why you're having so much trouble with this. You're like a creationist. You see the \"final\" product and believe that it was always like that. You don't think that it had to evolve to where it is now. :)", 
   {}, 
   22760, 
   null, 
   1069430100.0
  ], 
  [
   23436, 
   null, 
   "Charchuk", 
   "Yes, again you post this last site; a Muslim one. Funny that they'd favourably compare the two.\n\n \n \nLook at Christianity for its first 300 years. And then at Islam.\n\n \n I have.\n \n \nChristianity peacefully spread throughout the Roman Empire, despite being persecuted by the state.\n\n \n The only reason why the Roman Empire \"adopted\" Christianity s was from a deception. No one opposed the will of the Empire.\n \n \nIslam spread by war across vast areas, where Islamic law was imposed and non-believers were discriminated against. Islamic governments were imposed. Special poll-taxes were raised on non-believers.\n\n \n Historical treatment of Jewish people (Prior to World War 1): \n \n Christians:\n Prolonged and widespread anti-Judaism, anti-semitism, oppression, and mass murder. \n \n Muslims:\n Additional taxation, but otherwise general tolerance.\n \n \n \nCharchuk, I know you want to ignore these historic truths, but at least other people reading this may not.\n\n \n I am not the one who is ignoring facts, historical or otherwise.\n \n \nI mean, you didn't even get a Christian talking about a justified war till 400 years - with Augustine of Hippo.\n \n Right from its inception Islam was an aggressive religion that used power, and the sword.\n\n \n Of course most Christians are going to write their history to cast themselves in a more favorable light and others in not so kind a view. They won. They actually believe that they were doing god's will and thus couldn't do evil. And anyone who said otherwise was a heretic and burned or worse.", 
   {}, 
   22762, 
   null, 
   1069431000.0
  ], 
  [
   23438, 
   null, 
   "Charchuk", 
   "The guy can't put 2 + 2 together!\n \n His first site shows the earliest killing...\n \n \"Already in 385 C.E. the first Christians, the Spanish Priscillianus and six followers, were beheaded for heresy in Trier/Germany\"\n \n That's almost 400 years after Christ.\n \n I showed in one of my first posts that Muhammed killed 900 PoWs; that's in his own life-time! He applauded assasinations.\n \n Christ ordered Peter to put away his sword.\n \n But some XXXXXX want to smear Christ with the same brush as Muhammed\n \n It is quite clear that Islam was founded by a militant man. Christianity was not.\n \n His argument is like saying \"Democracy is evil, because two hundred years after the founding of the USA, the President lied about the war in Iraq, therefore let's scrap democracy\"\n \n The old saying of throwing the baby out with the bathwater applies to his logic.\n\n \n I see that you still refuse to see Christianity's history in its entirety. That is understood since many Christians think that Christianity's history begins and end with the new testament.\n \n I think that there was an old joke which said something like, \"All prophets before 200 AD were saints, and all prophets after were madmen.\" :)", 
   {}, 
   22764, 
   null, 
   1069431240.0
  ], 
  [
   23446, 
   null, 
   "Robbie", 
   "Charchuk, I will certainly agree that many Christians have done terrible things. You say that people want to ignore this by saying that they weren't 'real' Christians. Yet, if you look at the teachings of Christ wouldn't you agree that they weren't following his teachings? You have said that Islam is the same thing, only 300 years behind in development. But, why isn't this due to the effects of other cultures or those of Christianity who are ahead, rather than the value of Islam itself? Your opponents have given a good deal of positive evidence compared to yours, yet your position hasn't moved at all. In my opinion you have completly set opinions and nothing will change them as long as some people agree. \n \n Parcum and montalban, I think you have debated well in the first few pages, but in these last there's more name-calling than is needed, I know that I've done equally bad in other debates and please feel free to correct me if you see me doing it. I don't think we should treat anyone as if they were being humble, logical, and fair if they aren't, but there's a line between honestly condemning someone and being un-Christian. We should remember to follow Christ's example, especially if we are to condemn those 'Christians' who don't.", 
   {}, 
   23438, 
   null, 
   1069443660.0
  ], 
  [
   23455, 
   null, 
   "Charchuk", 
   "Charchuk, I will certainly agree that many Christians have done terrible things. You say that people want to ignore this by saying that they weren't 'real' Christians. Yet, if you look at the teachings of Christ wouldn't you agree that they weren't following his teachings?\n\n \n The teachings were the bait on the hook.\n \n \nYou have said that Islam is the same thing, only 300 years behind in development.\n\n \n To 400 years.\n \n \nBut, why isn't this due to the effects of other cultures or those of Christianity who are ahead, rather than the value of Islam itself?\n\n \n The most progress was made since so many got away from Mother Church and came to the New World. And the main framers of the Constitution and Bill of Rights had the freedom to do as they did.\n \n If the Muslims had a new world to come to than things might have been different.\n \n \nYour opponents have given a good deal of positive evidence compared to yours, yet your position hasn't moved at all. In my opinion you have completly set opinions and nothing will change them as long as some people agree.\n\n \n If the Muslims had won instead of the Christians then we would be having the same arguement, but with each party on the other side. As I had said, the victor gets to write the official version and they always paint themselves in a much better light.\n \n \nParcum and montalban, I think you have debated well in the first few pages, but in these last there's more name-calling than is needed, I know that I've done equally bad in other debates and please feel free to correct me if you see me doing it. I don't think we should treat anyone as if they were being humble, logical, and fair if they aren't, but there's a line between honestly condemning someone and being un-Christian. We should remember to follow Christ's example, especially if we are to condemn those 'Christians' who don't.\n\n \n The Church had a term for those who did that. :)", 
   {}, 
   23446, 
   null, 
   1069448220.0
  ], 
  [
   23472, 
   null, 
   "montalban", 
   "So? There are really no firsthand accounts of Christ.\n\n \n Please actually research. He mentioned St.Thomas Christians even there.\n \n Obiously, you've never heard of him, but you're willing to debate the issue and make yourself a fool. St.Thomas was an Apostle.", 
   {}, 
   23431, 
   null, 
   1069458780.0
  ], 
  [
   23474, 
   null, 
   "montalban", 
   "Once again you sign-post your argument so well. By not answering my question you are screaming 'I don't have an answer'. As to your question, I'm assuming that when you say 'much of what they did' you are referring to bad things. Well they couldn't quote scripture to justify doing bad things. THAT IS THE WHOLE POINT. Eh! You haven't caught on yet. Christ can't be blamed for what some idiot does or says.\n\n \n \nIt is irrelevant. The Church still did what it thought what god wanted and used the bible to justify it.\n\n \n Did they? And what teachings of Christ did they use? I asked you before on a number of occasions and you said that was Irrelevant. Now it isn't. Do make up your mind. You're such a comic. You don't keep track of what you're saying.\n \n \n a) you fail to address the gaping hole in the logic of your argument; by suggesting that Stalin was a Christian.\n\n \n He had his training as a Christian seminary student. While there who read Macchiavello and took it to heart.\n \n Which book of Macchiavelli? The Discourses, or The Prince? If you actually knew what you're talking about, you'd know that these are totally different works. One is about democracy, so let's assume he didn't read that. Macchiavello was condemned by the Church for \"The Prince\". If you had an iota of decency you'd actually be embarrassed by all the errors you make.\n Was Stalin a Christian when he butchered people? What teachings of Christ did he use to justify his actions? Irrelevant you'll say, so your point can never be proven.\n \n \nb) Stalin, Mao, Hitler, the Kim family in power in North Korea, Pol Pot, they've probably killed more people than Christians ever have. They've made up for small numbers.\n\n \n \nHitler was a Christian. as for the rest they are a product of their cultures as well. They would have been the same even if they were theists. On a per capita basis they are nothing in comparison to what Christianity has been.\n\n \n Hitler was a Christian? What teachings of Christ did he use to justify his massacres?\n \n Mao killed 20,000,000 people. Not even all the crusades and inquisitions came anywhere near that.\n \n \nWhat Christian teachings inspired the creation of the World Bank, or the IMF which cripple nations?\n\n \n \nWhat does this have to do with the price of tea in China? Plus, your last part is opinion.\n\n \n So you don't think the IMF and World Bank cripple nations?\n if a) you do, then are they acting on a Christian mission or are they modern secularists using rationalistic economics - in other words one of the greatest evils in the world today; perpetual poverty; is instigated by non-religious people.\n b) if you don't then you seem to be going against other left-wing arguments you've made against Broker on another thread - again evidence you don't know which side you're on?\n \n \n You're kidding again. Stop trying to tweak with the argument. We're not talking about the monarch. The Parliament was responsible; to a limited franchise, but this franchise was no less 'responsible' than the American one at the founding of the USA. (The USA didn't allow you to vote if you were a woman (50% of the population right there!), if you were black, if you were an Amerindian, if you didn't own property.\n\n \n \nIt still was far more \"democratic\" then what the British had. Their leader was appointed, and still is, through divine right. The American president was elected.\n\n \n \nTell me how many Americans voted for Geo. Washington?\n\n \n \nWhich term? He was the only president who received 100% of the electoral college votes.\n http://www.heptune.com/preslist.html\n\n \n And he received no popular votes! Do you know what the electoral college is? Obviously not.\n \n How is that a democracy? Only 'electors' voted for him, and they in turn were only elected by people with property. That's not democracy, certainly at least not a popular democracy, it's more oligarchy.\n \n How was a few hundred voting for a president any more democratic then a few hundred voting for a Prime Minister?\n \n And funniest of all, your own site says \"Presidents who ran unopposed George Washington, both terms.\" SO, he was voted for by a few hundred, and he didn't even have an opposition! Some democracy; no choice! Now you know why he received 100% of the electoral college votes.\n \n \nWrong again. Walpole is generally regarded as the first 'Prime Minister' in the modern sense. This was during the reign of George I. That's two Georges before American became independent.\n\n \n \nFrom time to time PMs \"took over\" control from the monachy (sic), but they were still not elected.\n\n \n Huh? Now you're conceeding that they took over? Walpole was elected, he even had a 'party'. The reason he's considered the first PM because even though there were Prime Ministers before him, he was the first in the modern sense, with a party, elected etc.\n \n \n Australia is a democracy. Yes. We are a federal-state system. Yes. We are also a constitutional monarchy! You've looked up the CIA world fact book on this.\n I'll put it as simple as I can make it \"Australia is a constitutional monarchy. This means that the head of State is a monarch, or sovereign, who is governed and bound by the Constitution.\"\n http://www.australianpolitics.com/d...-monarchy.shtml\n\n \n \nSo, you're PM isn't elected, and is in for life?\n\n \n Ah, I see, you really don't know what a constitutional monarchy is.\n \n It's honest of you to not concede you're wrong, but let's move on...I'll even skip over the part that you now seem to be debating on an issue you don't understand - but has that stopped you before?\n \n Canada, Britain, New Zealand, Australia are all constitutional monarchies. We all have the same monarch, Elizabeth II. Her powers in each is limited by the constitutions in each country. Hence constitutional monarchy. I thought that you were in Canada. You don't even know what kind of government you have?\n \n \nAmerican didn't lead the way in this field, so much for Britain being unrepresentative, undemocratic etc.\n\n \n \nYou forget how Britian (sic) treated its colonies.\n\n \n Sure, and the US had slavery. There's a difference in your argument again, you're not now arguing that Britain wasn't a democracy, but that it treated its colonies harshly. Please stick to an argument. The one you're on now has the modern parallel that the USA, a democracy, is involved in an unpopular war in Iraq.\n \n You're subtle switch of focus also must be seen as a tacit admission that you had no dispute with what I said.\n \n \n I know you love saying this, because it sounds good. As I said, at least, when I was at school, modern history studies began with the French Revolution. Perhaps your modern history books do start with the American revolution.\n\n \n \nI think that yours is starting with the modern history of art.\n\n \n No, read my comments. In NSW, my state, all school students who do modern history start their studies at the Napoleonic Wars. That is deemed by us as the start of modern history. Your studies board might start it in 1492 for all I know. I've given you ample time to state this... why you think that the USA is the 'first' 'modern'. By our time-line as taught to us, it's not 'modern' because it predates 'modern' history. I'm not even saying that this is an absolute. I've said it's just how we reckon it. I've asked you how you reckon it that way and you keep going on with something else. When does your 'modern' history start? Did you even do history?\n \n \n Switzerland was/is a democracy that is older than the USA. San Marino is too. There were many democracies in medieval times; in Italy. France was younger. What makes the USA 'first'?\n\n \n \nSwitzerland didn't get its constitution until 1874. \n And they didn't allow women to vote until 1971.\n http://www.ipu.org/wmn-e/suffrage.htm\n\n \n Well, done. You're actually looking things up.\n They didn't allow women to vote in national elections, yes. So what? By your rationale the USA wasn't a democracy until the 1920s, nor Britain.\n You don't need a constitution to be a democracy. From memory the USA didn't get there's till about 20 years later, and even then, well after Geo Washington was president, it wasn't ratified by some states. \n \n What was your point anyway?\n \n \nThe USA was the first successful one on a larger scale and I had said this as well.\n I can understand why you're having so much trouble with this. You're like a creationist. You see the \"final\" product and believe that it was always like that. You don't think that it had to evolve to where it is now. \n\n \n Oh really. Re-stating the mantra about the USA doesn't answer my question, why do you think it was the 'first' 'modern' democracy.\n \n As to 'on a large scale' well what do you mean by this, area? population?\n \n You have moved on a bit since last time; actually taking some time to research. That's an improvement. Unfortunately you're still arguing from ignorance. All the bluff in the world won't cover that.", 
   {}, 
   23435, 
   null, 
   1069460700.0
  ], 
  [
   23475, 
   null, 
   "montalban", 
   "Sigh. This is getting boring.\n \n \n Yes, again you post this last site; a Muslim one. Funny that they'd favourably compare the two.\n\n \n Look at Christianity for its first 300 years. And then at Islam.\n \n \nI have.\n\n \n Glancing is not looking.\n \n \nChristianity peacefully spread throughout the Roman Empire, despite being persecuted by the state.\n\n \n \nThe only reason why the Roman Empire \"adopted\" Christianity s(sic) was from a deception. No one opposed the will of the Empire.\n\n \n Stop changing the focus. Do you agree or not that Christianity spread peacefully for its first few centuries? Obviously you now do, because you've not disputed my claim, merely changed the focus.\n \n \nIslam spread by war across vast areas, where Islamic law was imposed and non-believers were discriminated against. Islamic governments were imposed. Special poll-taxes were raised on non-believers.\n\n \n \nHistorical treatment of Jewish people (Prior to World War 1): \n Christians:\n Prolonged and widespread anti-Judaism, anti-Semitism, oppression, and mass murder. \n Muslims:\n Additional taxation, but otherwise general tolerance.\n\n \n Sigh! I was comparing Christianity and Islam in their respective first 300 years. You said you understood the difference. Now you're changing the focus again, and not looking at Christianity for its first 300 years, but its first 2,000. Please please stick to a debate.\n \n Islam conquered it's empire by the sword. Christianity spread through the Roman Empire without bloody conquest; it was the subject of persecution. If you can't see that then you're showing you're completely unprepared to have a reasoned debate without brining in a priori hatred of religion. Show me where your facts are to dispute this.\n \n They are fundamentally different religions because their founders were different types of people. One was a warrior, the other, Christ, was a messenger of peace.\n \n \nCharchuk, I know you want to ignore these historic truths, but at least other people reading this may not.\n\n \n \nI am not the one who is ignoring facts, historical or otherwise.\n\n \n Saying you're not, and showing that you are. Show me where you find dispute that Christianity spread peacefully in its first 300 years. Actually address the issue, don't suddenly try widening it to encompass all of Christianity as you just tried above.\n \n \n I mean, you didn't even get a Christian talking about a justified war till 400 years - with Augustine of Hippo. Right from its inception Islam was an aggressive religion that used power, and the sword.\n\n \n \nOf course most Christians are going to write their history to cast themselves in a more favorable light and others in not so kind a view. They won. They actually believe that they were doing god's will and thus couldn't do evil. And anyone who said otherwise was a heretic and burned or worse.\n\n \n You're a fool. Augustine is not history! Only an imbecile would keep making so many errors. I'm truly amazed you know how to type. I mention Augustine's writings and you think it's history. How bright you are. You constantly argue from lack of knowledge. You then say \"I've read this\" or \"I understand that\" but in making comments like that you show you don't. Are you still in your early teens? You argue like that; all attitude.\n \n If you don't know about the difference between history and theology, please stay off the debate.\n \n If you don't know what Augustine wrote, please stay off the debate.\n \n I know you hate religions, and you see them all the same. I feel sorry though that you've not been able to use objective evidence to prove your point.\n \n I may not debate you for much longer... call it a victory. You're wearing me down as I actually take the trouble to address your mistakes, and you make so many of them.\n You don't use facts pertinent to your argument.\n You demonstrate the inability to deal with the subject at hand, as you keep changing it.\n You don't stick to an argument, in fact you use mutually exclusive arguments.\n \n Then you have the hide to criticise other people.", 
   {}, 
   23436, 
   null, 
   1069461600.0
  ], 
  [
   23476, 
   null, 
   "montalban", 
   "Parcum and montalban, I think you have debated well in the first few pages, but in these last there's more name-calling than is needed, I know that I've done equally bad in other debates and please feel free to correct me if you see me doing it. I don't think we should treat anyone as if they were being humble, logical, and fair if they aren't, but there's a line between honestly condemning someone and being un-Christian. We should remember to follow Christ's example, especially if we are to condemn those 'Christians' who don't.\n\n \n I put up my hand as the worst example of an Orthodox Christian.\n \n I am getting annoyed trying to debate someone who doesn't even have much depth. All bluster and attitude seems to pass as debate.", 
   {}, 
   23446, 
   null, 
   1069461720.0
  ], 
  [
   23489, 
   null, 
   "Charchuk", 
   "Please actually research. He mentioned St.Thomas Christians even there.\n \n Obiously, you've never heard of him, but you're willing to debate the issue and make yourself a fool. St.Thomas was an Apostle.\n\n \n I never said that Paul made it up out of whole clothe. I had said that much of modern Christianity is based on what Paul did. I didn't say all. Learn to read.", 
   {}, 
   23472, 
   null, 
   1069464060.0
  ], 
  [
   23497, 
   null, 
   "Charchuk", 
   "Did they? And what teachings of Christ did they use? I asked you before on a number of occasions and you said that was Irrelevant. Now it isn't. Do make up your mind. You're such a comic. You don't keep track of what you're saying.\n\n \n They didn't but than again most Christians today don't either.\n \n \n \nhich book of Macchiavelli? The Discourses, or The Prince?\n\n \n The Prince.\n \n \nWas Stalin a Christian when he butchered people? What teachings of Christ did he use to justify his actions? Irrelevant you'll say, so your point can never be proven.\n\n \n You're quite an apologist, you know that. If you look at much of Christian history you will see that he wasn't all that different than those who actually prfessed to be Christians.\n \n \nHitler was a Christian? What teachings of Christ did he use to justify his massacres?\n\n \n The same one's which the Church, and any \"Defender of the FAITH\" has used against the Jews throughout history. The Jews were the Christ killers.\n \n \nMao killed 20,000,000 people. Not even all the crusades and inquisitions came anywhere near that.\n\n \n Maybe in raw numbers, but take a look at it on a per capita basis and you'll get a very different story.\n \n \n \nSo you don't think the IMF and World Bank cripple nations?\n if a) you do, then are they acting on a Christian mission or are they modern secularists using rationalistic economics - in other words one of the greatest evils in the world today; perpetual poverty; is instigated by non-religious people.\n\n \n They ruin themselves.\n \n \nb) if you don't then you seem to be going against other left-wing arguments you've made against Broker on another thread - again evidence you don't know which side you're on?\n\n \n Please, stop it with the apologetics\n \n \nAnd he received no popular votes! Do you know what the electoral college is? Obviously not.\n\n \n Yes, I know what it is. Its where each state gets a certain number of votes used to elect the president based on how the people vote. Did you know that those who hold these votes don't have to vote for the canidate that they are set for. They can change their minds if they want and cast them for the other canidate. I think that this has happened a couple of times.\n \n \nHow is that a democracy? Only 'electors' voted for him, and they in turn were only elected by people with property. That's not democracy, certainly at least not a popular democracy, it's more oligarchy.\n\n \n The USA uses the form of democracy called a republic.\n \n Republic:\n \n 1. A political system in which the supreme power lies in a body of citizens who can elect people to represent them\n \n Democracy:\n \n 1. The political orientation of those who favor government by the people or by their elected representatives\n \n Do you vote for your leader directly? No, you don't. You use basically the same system as we do. The party with the most votes wins and the leader of that party is sworn in as PM.\n \n \nHow was a few hundred voting for a president any more democratic then a few hundred voting for a Prime Minister?\n\n \n I don't know, you tell me what its like in your country. :)\n \n \nAnd funniest of all, your own site says \"Presidents who ran unopposed George Washington, both terms.\" SO, he was voted for by a few hundred, and he didn't even have an opposition! Some democracy; no choice! Now you know why he received 100% of the electoral college votes.\n\n \n They could have with-held their votes. They were jsut starting out as a country.\n \n \nHuh? Now you're conceeding that they took over? Walpole was elected, he even had a 'party'. The reason he's considered the first PM because even though there were Prime Ministers before him, he was the first in the modern sense, with a party, elected etc.\n\n \n A coup is not the same thing.\n \n \nAh, I see, you really don't know what a constitutional monarchy is.\n\n \n Does she have direct say in your affairs?\n \n \nIt's honest of you to not concede you're wrong, but let's move on...I'll even skip over the part that you now seem to be debating on an issue you don't understand - but has that stopped you before?\n \n Canada, Britain, New Zealand, Australia are all constitutional monarchies. We all have the same monarch, Elizabeth II. Her powers in each is limited by the constitutions in each country. Hence constitutional monarchy. I thought that you were in Canada. You don't even know what kind of government you have?\n\n \n Actually you are the one who doesn't know that difference. \n \n Canada is a confederation with parliamentary democracy. The Queens rule is mainly as the leader of the Commonwealth of Nations, primarily an economic union. Are you saying that the leader of the UN is also the leader of your country, that is more of a political union?\n \n \nSure, and the US had slavery. There's a difference in your argument again, you're not now arguing that Britain wasn't a democracy, but that it treated its colonies harshly.\n\n \n Remember, you live in a former prison colony.\n \n \nPlease stick to an argument. The one you're on now has the modern parallel that the USA, a democracy, is involved in an unpopular war in Iraq.\n\n \n The USA is a Republic, but the principles are mainly the same.\n \n \nYou're subtle switch of focus also must be seen as a tacit admission that you had no dispute with what I said.\n\n \n Wrong. The USA was the first, but that doesn't mean that they were perfect from the start. They had to learn over time. \n \n \nNo, read my comments. In NSW, my state, all school students who do modern history start their studies at the Napoleonic Wars. That is deemed by us as the start of modern history.\n\n \n They are teaching a wrong version of history, but that isn't new. The British don't really want to admit that major defeat. :)\n \n \nYour studies board might start it in 1492 for all I know. I've given you ample time to state this... why you think that the USA is the 'first' 'modern'. By our time-line as taught to us, it's not 'modern' because it predates 'modern' history. I'm not even saying that this is an absolute. I've said it's just how we reckon it. I've asked you how you reckon it that way and you keep going on with something else. When does your 'modern' history start? Did you even do history?\n\n \n Poor Aussie.\n \n \nWell, done. You're actually looking things up.\n They didn't allow women to vote in national elections, yes. So what? By your rationale the USA wasn't a democracy until the 1920s, nor Britain.\n You don't need a constitution to be a democracy. From memory the USA didn't get there's till about 20 years later, and even then, well after Geo Washington was president, it wasn't ratified by some states.\n\n \n Irrelevant.\n \n \nWhat was your point anyway?\n\n \n You expect perfection, where there is none and can be none.\n \n \n \nOh really. Re-stating the mantra about the USA doesn't answer my question, why do you think it was the 'first' 'modern' democracy.\n\n \n I don't think that at all. It is fact.", 
   {}, 
   23474, 
   null, 
   1069465980.0
  ], 
  [
   23500, 
   null, 
   "Charchuk", 
   "Stop changing the focus. Do you agree or not that Christianity spread peacefully for its first few centuries? Obviously you now do, because you've not disputed my claim, merely changed the focus.\n\n \n No, it didn't. Once it get the Roman Empire behind it it could impose its beliefs on many.\n \n \n \nSigh! I was comparing Christianity and Islam in their respective first 300 years. You said you understood the difference. Now you're changing the focus again, and not looking at Christianity for its first 300 years, but its first 2,000. Please please stick to a debate.\n\n \n I am, you are the one who is trying to distract from the issue with your apologetic nonsense.\n \n \nIslam conquered it's empire by the sword. Christianity spread through the Roman Empire without bloody conquest; it was the subject of persecution.\n\n \n The empire was already a conquest with a very bloody history of its own.\n \n \nIf you can't see that then you're showing you're completely unprepared to have a reasoned debate without brining in a priori hatred of religion. Show me where your facts are to dispute this.\n\n \n You only have an official version of history prospective.\n \n \nThey are fundamentally different religions because their founders were different types of people. One was a warrior, the other, Christ, was a messenger of peace.\n\n \n Christ was just a figuehead, a martyr to use. Both Christianity and Islam are off-shoots of Judaism. They even share most of the same stories and people. The Muslims even recognise Jesus as a prophet, though not as the Christ (Most Christians don't even know that Christ isn't a name, its a title.) Not even the Christians were that tolerant.\n \n \nSaying you're not, and showing that you are. Show me where you find dispute that Christianity spread peacefully in its first 300 years. Actually address the issue, don't suddenly try widening it to encompass all of Christianity as you just tried above.\n\n \n The victor gets to write the official version.\n \n \nYou're a fool. Augustine is not history! Only an imbecile would keep making so many errors. I'm truly amazed you know how to type. I mention Augustine's writings and you think it's history. How bright you are. You constantly argue from lack of knowledge. You then say \"I've read this\" or \"I understand that\" but in making comments like that you show you don't. Are you still in your early teens? You argue like that; all attitude.\n\n \n Who said that I was speaking of him. I had said that most Christians would write their history to favor them, and that is true.\n \n \nIf you don't know about the difference between history and theology, please stay off the debate.\n\n \n I'm not the one who doesn't know the different... Christians even teach their children theology based history as real history. It is no different than when the Ancient Greeks and later the Romans taught their children the same about their gods. Do you actually believe that Moses went on top of a mountian and talked to god in the guise of a burning bush, or that a flood actually covered the entire Earth and that either 2X2, or 7X7 (Depends on which version) of all animals could fit on a single ark built by a single man and his family? :)\n \n \nI know you hate Religions, and you see them all the same. I feel sorry though that you've not been able to use objective evidence to prove your point.\n\n \n They are all the same.\n \n \nI may not debate you for much longer... call it a victory. You're wearing me down as I actually take the trouble to address your mistakes, and you make so many of them.\n\n \n All you are doing is using apologetics, which mean nothing.\n \n \nYou don't use facts pertinent to your argument.\n You demonstrate the inability to deal with the subject at hand, as you keep changing it.\n You don't stick to an argument, in fact you use mutually exclusive arguments.\n\n \n That best describes you instead.\n \n \nThen you have the hide to criticise other people.\n\n \n Hide? When and where?", 
   {}, 
   23475, 
   null, 
   1069467000.0
  ], 
  [
   23504, 
   null, 
   "Charchuk", 
   "I put up my hand as the worst example of an Orthodox Christian.\n \n I am getting annoyed trying to debate someone who doesn't even have much depth. All bluster and attitude seems to pass as debate.\n\n \n You shouldn't be talking about yourself like that. :)", 
   {}, 
   23476, 
   null, 
   1069469100.0
  ], 
  [
   23512, 
   null, 
   "Parcum", 
   " So? There are really no firsthand accounts of Christ.\n\n \n We have several sources... Matthew, Mark, Luke, John, James, and a few others. We know about Christ. \n \n \n Hitler was a Christian. as for the rest they are a product of their cultures as well. They would have been the same even if they were theists. On a per capita basis they are nothing in comparison to what Christianity has been.\n\n \n Hitler wasn't a Christian. He only said he was Christian in the public to gain votes. He was actually very anti-Christian and wanted to destroy the Church (he said so). He said something to the extent of \"The best thing we can do is allow Christianity to die it's natural death\". \n \n \n Historical treatment of Jewish people (Prior to World War 1): \n \n Christians:\n Prolonged and widespread anti-Judaism, anti-semitism, oppression, and mass murder. \n \n Muslims:\n Additional taxation, but otherwise general tolerance.\n\n \n Religioustolerance.com is wrong. There wasn't mass murder of Jews. We had the inquisition, but it wasn't mass murder. The \"mass murder\" that Christians did to the Jews is quite comparable to what the Muslims did to them as well. \n \n Everyone knows Islam converted by the sword.", 
   {
    "unicode_changes_made": true
   }, 
   23500, 
   null, 
   1069471380.0
  ], 
  [
   23522, 
   null, 
   "montalban", 
   "You shouldn't be talking about yourself like that. :)\n\n \n Honesty is something only you wouldn't understand", 
   {}, 
   23504, 
   null, 
   1069475520.0
  ], 
  [
   23523, 
   null, 
   "montalban", 
   "We have several sources? Matthew, Mark, Luke, John, James, and a few others. We know about Christ. \n \n Hitler wasn?t a Christian. He only said he was Christian in the public to gain votes. He was actually very anti-Christian and wanted to destroy the Church (he said so). He said something to the extent of ?The best thing we can do is allow Christianity to die it?s natural death?. \n \n Religioustolerance.com is wrong. There wasn?t mass murder of Jews. We had the inquisition, but it wasn?t mass murder. The ?mass murder? that Christians did to the Jews is quite comparable to what the Muslims did to them as well. \n \n Everyone knows Islam converted by the sword.\n\n \n At present I see no point in dealing with Charchuk on this issue. He is probably the biggest waste of time.\n \n His factual errors are astounding.\n \n He argues both sides at once.\n \n He keeps changing focus then says \"No I don't\"\n I noticed above he recognised that the Roman Empire arose by conquest. He thinks that Christianity can be blamed for that? They were of course his beloved pagans but such historical realities won't stop his rant.\n \n Nothing will stop him. Normal things such as common sense, facts etc just don't belong with him!\n \n I'm still waiting for to admit his mistake over the type of nation Australia is. He won't because he's too gutless. He'll probably just put loads of :) around.\n \n I actually do believe that he's in his early teens.", 
   {}, 
   23512, 
   null, 
   1069475820.0
  ], 
  [
   23557, 
   null, 
   "Charchuk", 
   "We have several sources... Matthew, Mark, Luke, John, James, and a few others. We know about Christ. \n\n \n From third or four hand accounts written down many decades later.\n \n \nHitler wasn't a Christian. He only said he was Christian in the public to gain votes.\n\n \n That is a lame excuse saying that. It is as bad as saying, \"Butthey were not REAL Christians.' He is as much a Christian as all of the Church leaders throughout the centuries who have done basically the same thing.\n \n \nHe was actually very anti-Christian and wanted to destroy the Church (he said so). He said something to the extent of \"The best thing we can do is allow Christianity to die it's natural death\".\n\n \n I know where that came from. One of his men, which was close to him, had actually been anti-Christian and wrote what he thought Hitler should do in his diary. \n \n http://members.aol.com/IslamTeam/hitler.htm\n \n \nReligioustolerance.com is wrong. There wasn't mass murder of Jews. We had the inquisition, but it wasn't mass murder. The \"mass murder\" that Christians did to the Jews is quite comparable to what the Muslims did to them as well.\n\n \n There may have not been something like the what had happened in Germany, but they were talking about what had happened over the many centuries as well. What the Muslims think of the Jews now. Before that they more or less tolerated them if only they taxed them extra. \n \n \nEveryone knows Islam converted by the sword.\n\n \n And so did Christianity, though, most of the converting was with Christians of a different sect to their sect, but it is the same thing.", 
   {
    "unicode_changes_made": true
   }, 
   23512, 
   null, 
   1069513260.0
  ], 
  [
   23558, 
   null, 
   "Charchuk", 
   "Honesty is something only you wouldn't understand\n\n \n Your form of it is meaningless since you are only an apologist.", 
   {}, 
   23522, 
   null, 
   1069513320.0
  ], 
  [
   23561, 
   null, 
   "Charchuk", 
   "At present I see no point in dealing with Charchuk on this issue. He is probably the biggest waste of time.\n\n \n Please, you're so full of it that I can smell from where I am.\n \n \nHis factual errors are astounding.\n\n \n Astounishing of how few they're really are.\n \n \nHe argues both sides at once.\n\n \n Where?\n \n \nHe keeps changing focus then says \"No I don't\"\n I noticed above he recognised that the Roman Empire arose by conquest. He thinks that Christianity can be blamed for that?\n\n \n Hardly. It existed long before Christianity existed. You are twisting words again.\n \n \nThey were of course his beloved pagans but such historical realities won't stop his rant.\n\n \n You're the only one ranting here. Did I say anywhere that I prefered pagans? Or did I say that all religions are basically the same, the dominance based ones and the others as well?\n \n \nNothing will stop him. Normal things such as common sense, facts etc just don't belong with him!\n\n \n Again you are speaking of yourself instead. In other words you're projecting.\n \n \nI'm still waiting for to admit his mistake over the type of nation Australia is. He won't because he's too gutless. He'll probably just put loads of :) around.\n\n \n It is not my fault that you don't even know what form of government your country has.\n \n \nI actually do believe that he's in his early teens.\n\n \n Like the way you think of Parcum?", 
   {}, 
   23523, 
   null, 
   1069513680.0
  ], 
  [
   23636, 
   null, 
   "Parcum", 
   " From third or four hand accounts written down many decades later.\n\n \n We have several that have been written and all say the same thing. Ever heard of the Peshitta Bible? But Matthew, Mark, Luke, and so on wrote those books. \n \n \n That is a lame excuse saying that. It is as bad as saying, \"Butthey were not REAL Christians.' He is as much a Christian as all of the Church leaders throughout the centuries who have done basically the same thing.\n\n \n Really?\n \n  National Socialism and religion cannot exist together.... The heaviest blow that ever struck humanity was the coming of Christianity. Bolshevism is Christianity's illegitimate child. Both are inventions of the Jew. The deliberate lie in the matter of religion was introduced into the world by Christianity.... Let it not be said that Christianity brought man the life of the soul, for that evolution was in the natural order of things. (Night of 11th-12th July, 1941)\n \n  Christianity is a rebellion against natural law, a protest against nature. Taken to its logical extreme, Christianity would mean the systematic cultivation of the human failure. (10th October, 1941, midday)\n \n  The best thing is to let Christianity die a natural death.... When understanding of the universe has become widespread... Christian doctrine will be convicted of absurdity.... Christianity has reached the peak of absurdity.... And that's why someday its structure will collapse.... ...the only way to get rid of Christianity is to allow it to die little by little.... Christianity the liar.... We'll see to it that the Churches cannot spread abroad teachings in conflict with the interests of the State. (14th October, 1941, midday)\n \n  Christianity is an invention of sick brains: one could imagine nothing more senseless, nor any more indecent way of turning the idea of the Godhead into a mockery.... .... When all is said, we have no reason to wish that the Italians and Spaniards should free themselves from the drug of Christianity. Let's be the only people who are immunised against the disease. (13th December, 1941, midnight)\n \n  Kerrl, with noblest of intentions, wanted to attempt a synthesis between National Socialism and Christianity. I don't believe the thing's possible, and I see the obstacle in Christianity itself.... Pure Christianity-- the Christianity of the catacombs-- is concerned with translating Christian doctrine into facts. It leads quite simply to the annihilation of mankind. It is merely whole-hearted Bolshevism, under a tinsel of metaphysics. (14th December, 1941, midday)\n \n  It would always be disagreeable for me to go down to posterity as a man who made concessions in this field. I realize that man, in his imperfection, can commit innumerable errors-- but to devote myself deliberately to errors, that is something I cannot do. I shall never come personally to terms with the Christian lie. Our epoch Uin the next 200 yearse will certainly see the end of the disease of Christianity.... My regret will have been that I couldn't... behold . (27th February, 1942, midday)\n  The reason why the ancient world was so pure, light and serene was that it knew nothing of the two great scourges: the pox and Christianity. (19th October, 1941, night)\n \n All these statements were made by Hitler during private meetings\n \n \n I know where that came from. One of his men, which was close to him, had actually been anti-Christian and wrote what he thought Hitler should do in his diary.\n\n \n Wrong. The quote is above. \n \n \n There may have not been something like the what had happened in Germany, but they were talking about what had happened over the many centuries as well. What the Muslims think of the Jews now. Before that they more or less tolerated them if only they taxed them extra.\n\n \n Firstly, the Jews weren't just heavily taxed.\n \n  The Muslim attitude toward Jews is reflected in various verses throughout the Koran, the holy book of the Islamic faith. \"They [the Children of Israel] were consigned to humiliation and wretchedness. They brought the wrath of God upon themselves, and this because they used to deny God's signs and kill His Prophets unjustly and because they disobeyed and were transgressors\" (Sura 2:61). According to the Koran, the Jews try to introduce corruption (5:64), have always been disobedient (5:78), and are enemies of Allah, the Prophet and the angels (2:97-98).\n \n Jews were generally viewed with contempt by their Muslim neighbors; peaceful coexistence between the two groups involved the subordination and degradation of the Jews. In the ninth century, Baghdad's Caliph al-Mutawakkil designated a yellow badge for Jews, setting a precedent that would be followed centuries later in Nazi Germany.24\n \n At various times, Jews in Muslim lands lived in relative peace and thrived culturally and economically. The position of the Jews was never secure, however, and changes in the political or social climate would often lead to persecution, violence and death. \n \n When Jews were perceived as having achieved too comfortable a position in Islamic society, anti-Semitism would surface, often with devastating results. On December 30, 1066, Joseph HaNagid, the Jewish vizier of Granada, Spain, was crucified by an Arab mob that proceeded to raze the Jewish quarter of the city and slaughter its 5,000 inhabitants. The riot was incited by Muslim preachers who had angrily objected to what they saw as inordinate Jewish political power.\n \n Similarly, in 1465, Arab mobs in Fez slaughtered thousands of Jews, leaving only 11 alive, after a Jewish deputy vizier treated a Muslim woman in \"an offensive manner.\" The killings touched off a wave of similar massacres throughout Morocco.25\n \n Other mass murders of Jews in Arab lands occurred in Morocco in the 8th century, where whole communities were wiped out by the Muslim ruler Idris I; North Africa in the 12th century, where the Almohads either forcibly converted or decimated several communities; Libya in 1785, where Ali Burzi Pasha murdered hundreds of Jews; Algiers, where Jews were massacred in 1805, 1815 and 1830; and Marrakesh, Morocco, where more than 300 hundred Jews were murdered between 1864 and 1880.26\n \n Decrees ordering the destruction of synagogues were enacted in Egypt and Syria (1014, 1293-4, 1301-2), Iraq (854859, 1344) and Yemen (1676). Despite the Koran's prohibition, Jews were forced to convert to Islam or face death in Yemen (1165 and 1678), Morocco (1275, 1465 and 1790-92) and Baghdad (1333 and 1344).27\n \n The situation of Jews in Arab lands reached a low point in the 19th century. Jews in most of North Africa (including Algeria, Tunisia, Egypt, Libya and Morocco) were forced to live in ghettos. In Morocco, which contained the largest Jewish community in the Islamic Diaspora, Jews were made to walk barefoot or wear shoes of straw when outside the ghetto. Even Muslim children participated in the degradation of Jews, by throwing stones at them or harassing them in other ways. The frequency of anti-Jewish violence increased, and many Jews were executed on charges of apostasy. Ritual murder accusations against the Jews became commonplace in the Ottoman Empire.28\n \n As distinguished Orientalist G.E. von Grunebaum has written:\n \n It would not be difficult to put together the names of a very sizeable number Jewish subjects or citizens of the Islamic area who have attained to high rank, to power, to great financial influence, to significant and recognized intellectual attainment; and the same could be done for Christians. But it would again not be difficult to compile a lengthy list of persecutions, arbitrary confiscations, attempted forced conversions, or pogroms.29\n \n The danger for Jews became even greater as a showdown approached in the UN. The Syrian delegate, Faris el-Khouri, warned: \"Unless the Palestine problem is settled, we shall have difficulty in protecting and safeguarding the Jews in the Arab world.\"30\n \n More than a thousand Jews were killed in anti-Jewish rioting during the 1940's in Iraq, Libya, Egypt, Syria and Yemen.31 This helped trigger the mass exodus of Jews from Arab countries. (http://www.us-israel.org/jsource/myths/mf15.html#c) &#61663;- Jewish site. \n \n And so did Christianity, though, most of the converting was with Christians of a different sect to their sect, but it is the same thing.\n\n \n Charlemagne was the first Emperor to convert by the sword, which wasn't supported by the Church (otherwise the guy would be a saint). That was 700 years after Christ; no, Christianity's belief wasn't to convert by the sword. Only Kings and Emperors did that.", 
   {
    "unicode_changes_made": true
   }, 
   23561, 
   null, 
   1069543500.0
  ], 
  [
   23639, 
   null, 
   "Charchuk", 
   "We have several that have been written and all say the same thing. Ever heard of the Peshitta Bible? But Matthew, Mark, Luke, and so on wrote those books.\n\n \n By the beginning of the 5th century, or slightly earlier, the Syrian Church's version of the Bible, the Peshitta ('simple' translation) was formed. For the New Testament it represented an accommodation of the Syrian canon with that of the Greeks. It contains 22 books - all of the present New Testament except: \n \n II Peter, II John, III John, Jude, Revelation of John \n \n Hardly first hand accounts.\n \n \nReally?\n \n All these statements were made by Hitler during private meetings\n\n \n I know. The source of these writings were from one of his closest men, who happened to be anti-Christian and as I had wrote earlier, wrote what he thought Hitler should have said.\n \n Here are some quotes of my own.\n \n The folkish-minded man, in particular, has the sacred duty, each in his own denomination, of making people stop just talking superficially of God's will, and actually fulfill God's will, and not let God's word be desecrated. [original italics]\n \n For God's will gave men their form, their essence, and their abilities. Anyone who destroys His work is declaring war on the Lord's creation, the divine will. Therefore, let every man be active, each in his own denomination if you please, and let every man take it as his first and most sacred duty to oppose anyone who in his activity by word or deed steps outside the confines of his religious community and tries to butt into the other.\n \n [...]\n \n Hence today I believe that I am acting in accordance with the will of the Almighty Creator: by defending myself against the Jew, I am fighting for the work of the Lord. [original italics]\n \n -- Adolf Hitler, from \"Mein Kampf\",\n translation by Ralph Mannheim.\n \n The Führer made it known to those entrusted with the Final Solution that the killings should be done as humanely as possible. This was in line with his conviction that he was observing God's injunction to cleanse the world of vermin. Still a member in good standing of the Church of Rome despite detestation of its hierarchy (\"I am now as before a Catholic and will always remain so\" [quoting Hitler]), he carried within him its teaching that the Jew was the killer of God. The extermination, therefore, could be done without a twinge of conscience since he was merely acting as the avenging hand of God -- so long as it was done impersonally, without cruelty.\n \n \n -- John Toland (Pulitzer Prize winner),\n from \"Adolf Hitler\", pp 507, talking about the Autumn of 1941.\n \n \n The \"I am now as before a Catholic...\" quotation from Hitler was recorded in the diary of Gerhard Engel, an SS Adjutant, in October 1941. Hitler was speaking in private, not before a mass audience, and so it is difficult to dismiss the comment as propaganda lies.\n \n \nWrong. The quote is above.\n\n \n Name your source. :) \n \n \n \nFirstly, the Jews weren't just heavily taxed.\n \n  The Muslim attitude toward Jews is reflected in various verses throughout the Koran, the holy book of the Islamic faith. \"They [the Children of Israel] were consigned to humiliation and wretchedness. They brought the wrath of God upon themselves, and this because they used to deny God's signs and kill His Prophets unjustly and because they disobeyed and were transgressors\" (Sura 2:61). According to the Koran, the Jews try to introduce corruption (5:64), have always been disobedient (5:78), and are enemies of Allah, the Prophet and the angels (2:97-98).\n \n Jews were generally viewed with contempt by their Muslim neighbors; peaceful coexistence between the two groups involved the subordination and degradation of the Jews. In the ninth century, Baghdad's Caliph al-Mutawakkil designated a yellow badge for Jews, setting a precedent that would be followed centuries later in Nazi Germany.24\n \n At various times, Jews in Muslim lands lived in relative peace and thrived culturally and economically. The position of the Jews was never secure, however, and changes in the political or social climate would often lead to persecution, violence and death. \n \n When Jews were perceived as having achieved too comfortable a position in Islamic society, anti-Semitism would surface, often with devastating results. On December 30, 1066, Joseph HaNagid, the Jewish vizier of Granada, Spain, was crucified by an Arab mob that proceeded to raze the Jewish quarter of the city and slaughter its 5,000 inhabitants. The riot was incited by Muslim preachers who had angrily objected to what they saw as inordinate Jewish political power.\n \n Similarly, in 1465, Arab mobs in Fez slaughtered thousands of Jews, leaving only 11 alive, after a Jewish deputy vizier treated a Muslim woman in \"an offensive manner.\" The killings touched off a wave of similar massacres throughout Morocco.25\n \n Other mass murders of Jews in Arab lands occurred in Morocco in the 8th century, where whole communities were wiped out by the Muslim ruler Idris I; North Africa in the 12th century, where the Almohads either forcibly converted or decimated several communities; Libya in 1785, where Ali Burzi Pasha murdered hundreds of Jews; Algiers, where Jews were massacred in 1805, 1815 and 1830; and Marrakesh, Morocco, where more than 300 hundred Jews were murdered between 1864 and 1880.26\n \n Decrees ordering the destruction of synagogues were enacted in Egypt and Syria (1014, 1293-4, 1301-2), Iraq (854859, 1344) and Yemen (1676). Despite the Koran's prohibition, Jews were forced to convert to Islam or face death in Yemen (1165 and 1678), Morocco (1275, 1465 and 1790-92) and Baghdad (1333 and 1344).27\n \n The situation of Jews in Arab lands reached a low point in the 19th century. Jews in most of North Africa (including Algeria, Tunisia, Egypt, Libya and Morocco) were forced to live in ghettos. In Morocco, which contained the largest Jewish community in the Islamic Diaspora, Jews were made to walk barefoot or wear shoes of straw when outside the ghetto. Even Muslim children participated in the degradation of Jews, by throwing stones at them or harassing them in other ways. The frequency of anti-Jewish violence increased, and many Jews were executed on charges of apostasy. Ritual murder accusations against the Jews became commonplace in the Ottoman Empire.28\n \n As distinguished Orientalist G.E. von Grunebaum has written:\n \n It would not be difficult to put together the names of a very sizeable number Jewish subjects or citizens of the Islamic area who have attained to high rank, to power, to great financial influence, to significant and recognized intellectual attainment; and the same could be done for Christians. But it would again not be difficult to compile a lengthy list of persecutions, arbitrary confiscations, attempted forced conversions, or pogroms.29\n \n The danger for Jews became even greater as a showdown approached in the UN. The Syrian delegate, Faris el-Khouri, warned: \"Unless the Palestine problem is settled, we shall have difficulty in protecting and safeguarding the Jews in the Arab world.\"30\n \n More than a thousand Jews were killed in anti-Jewish rioting during the 1940's in Iraq, Libya, Egypt, Syria and Yemen.31 This helped trigger the mass exodus of Jews from Arab countries. (http://www.us-israel.org/jsource/myths/mf15.html#c) &#61663;- Jewish site.\n\n \n Look at Christianity's treatment of the Jews for the same periods as well. No one like the Jews at all in their long history. If they were not on the move they were someone's slaves.\n \n \nCharlemagne was the first Emperor to convert by the sword, which wasn't supported by the Church (otherwise the guy would be a saint). That was 700 years after Christ; no, Christianity's belief wasn't to convert by the sword. Only Kings and Emperors did that.\n\n \n http://www.newadvent.org/cathen/03610c.htm\n \n I hadn't seen anything there to suggest that he didn't have the Church's favor. Quite the opposite in fact.\n \n They only make one a saint if they performed miracles. Not if they just gave service to the Church.\n \n BTW, that link from the Catholic Encyclopedia website. :)\n \n It doesn't really matter who did it, wheither it be the Church directly, or those with its blessing it is the same thing. Once Christianity gained enough strength they worked to force their religion on all in the name of their god.\n \n \n I never said that Islam was any more cilivized either. If Islam had a New World to go to like the Christians did which allowed them to change without the close watchful eye of Mother Church they may have developed to were Christianity is today. That is what was meant by Islam of today being like Christianity was 300 or 400 years ago. Get it?", 
   {
    "unicode_changes_made": true
   }, 
   23636, 
   null, 
   1069545540.0
  ], 
  [
   23650, 
   null, 
   "montalban", 
   "We have several that have been written and all say the same thing. Ever heard of the Peshitta Bible? But Matthew, Mark, Luke, and so on wrote those books...\n \n \n \n\n \n I praise your patience with Chuck-up but I've grown weary of his antics. Even Lurch has give up faster than he has when he's wrong; although both are as ready to apologise as the other.\n \n The only positive thing about continuing these posts is that others are reading these things.\n \n They both\n a) learn facts from you\n and\n b) see what nonsense Chuck-up comes up with.\n \n I am still waiting for his apology re: Australia's form of government. But it probably will never come, because, in his own mind, he's never wrong... even when I've pointed out logical errors, he's blamed me for pointing them out.\n :xbanghead \n \n So, it's my fault for them too!", 
   {}, 
   23636, 
   null, 
   1069549740.0
  ], 
  [
   23683, 
   null, 
   "Parcum", 
   "LOL. He shifted his argument. He was saying that \"Christians are worse than Muslims\", then he said \"Christians were cruel to Jews in the middle ages and Muslims were nice\", now he's saying \"They both had their good and bad times\".... what's next?", 
   {}, 
   23650, 
   null, 
   1069572840.0
  ], 
  [
   23691, 
   null, 
   "montalban", 
   "LOL. He shifted his argument. He was saying that \"Christians are worse than Muslims\", then he said \"Christians were cruel to Jews in the middle ages and Muslims were nice\", now he's saying \"They both had their good and bad times\".... what's next?\n\n \n He does it all the time. I point it out and he says \"No I don't\" and kids himself.\n \n He also said Australia's not a constitutional monarchy, and neither is Canada. I posted government web-sites from the respective nations, and he keeps quoting the CIA world-factbook as evidence of his claim; because it says we're a Federation (we're both; which means he's claim re: monarchy is false). Unfortunately he's not the balls yet to admit this. I guess he's about 14 years old. He has all the arrogance of Lurch, but none of the cohesion. He still can't understand that words such as democracy, federation, constitutional monarchy, are all equally valid descriptions, and not mutually exclusive.\n \n On another post I mentioned about continued Christian influence in lawmaking. I don't know if you read this. He maintained that there is no influence from Christians, then he agreed, there is influence, but it's not persuasive.\n \n I mentioned Lord Aitken's decision in Donaghue v Stevenson. I asked him to show which pagan texts Lord Aitken was drawing from when he used Christian concepts when he asked 'Who is my neighbour'.\n \n He says all Christian ideals stem from pagans, which means all the times he's had a go about Christians persecuting Jews means it's not Christianity at fault, but paganism!\n \n I insisted that he show which pagan references Lord Aitken was drawing from. He then asked \"Who is Lord Aitken?\" What a buffoon! Then he claimed I slipped it in (I guess retrospectively).\n \n He then said that all the pagan texts were destroyed by persecuting Christians, so how could Lord Aitken (whoever he is :) )draw upon pagan texts? He tries so many opposing arguments at once he's in a muddle.\n \n I asked him again to show me the connexion between Aitken's decision and paganism, and he says he already has! What a laugh he is, except I don't think he's intentionally trying to be funny. Saying he's done something all the time makes me think of myself when I was young... \"Have you cleaned your room?\" \"Yes!\"\n \n He suggested that the USA was the first modern democracy. I asked him why 'modern' as NSW (my state) teaches modern history from the French Revolution; that is after the USA became a state - this isn't to say that his history curriculum has a different start date; I just wanted to know. Instead of telling me, he just repeats that they are the first modern democracy; more democratic than Britain of the same era (despite women and most Negroes couldn't vote). He quoted me figures to show that Geo. Washington was unanimously elected... his own web-site that he was quoting* says a) Washington was unopposed and b) only c.200 people voted for him! Hardly democracy in the 'modern' sense.\n \n Britain was oppressive he says, therefore they weren't a democracy; forgetting how the US treated its indiginies.\n \n These are just a few of his many lapses. Sometimes I grow tired of his antics, but then I feel like I'm duty bound to try to help him; but he doesn't want help as he's showing that he won't research, he won't take time to consider, he won't admit error.\n \n One of his standards was to say irrelevant. I tried it back at him to see how he reacted and boy did he! He said something along the lines that someone arguing like that had nothing to say! The fact that there's not even a skerrick of self-recognition in that is rather spooky.\n \n On another thread he said that Australia had laws against religion\n \n \nWe don't have a law restricting the government from eastablishment (sic) of religion, you do.\n\n \n I said \nAre you referring to s.116. of our Federal Constitution...?\n \"The Commonwealth shall not make any law for establishing any religion, or for imposing any religious observance, or for prohibiting the free exercise of any religion, and no religious test shall be required as a qualification for any office or public trust under the Commonwealth.\"\n Obviously you don't believe in taking time to respond, and actually researching what you're debating. Why clutter your comment with facts?\n\n \n Did he admit his error? No, he said...\n \n \nI was speaking of the USA. You sound just like an American that I forget that you aren't \n\n \n Actually if he knew his stuff he'd have realised that there was a small bluff there. I write this now knowing he might read it; sort of a gloat.\n \n It is because despite this law we have made laws on religions. However, I was prepared for this, because the USA has done so too, despite their amendment; they made laws against Mormons practicing polygamy. I thought he'd have a go at it, but he has so little depth that instead of trying that line he just lied.\n \n He also doesn't know if he's American or Canadian. When talking about American law he uses 'we' instead of 'they'. I have in the past pointed out his miserable failure when it comes to pronouns, and this is the only thing he's even come close to acknowledging; by criticising me for pointing these errors out! Like that's my fault too!\n \n The whole time I've been unsure whether he and Killakozzy are the same poster. Both used the maths argument that Christianity is false because there are more non-Christians. Charchuk and Killakozzy raised this so many times as proofs of their ideas, and both had difficulty with the illogical arguments they were making.\n \n The classic is Killakozzy saying\n \nYou can present whatever evidence you can find. You can quote scripture until you're blue in the face.... post url liks.... demand that I give evidence for my claims.... but until you can prove one little, minute piece of evidence, your \"facts and figures\" are nothing but castles built on mudslides\n\n \n In other words, until I can prove my argument, without Scripture, without references, and without facts and figures, I've lost the debate!\n \n Now I do take some joy in gloating over these issues. I have been subject to ridicule for my own errors, and will be in the future.\n \n \n *that in itself was a major break-through as most the time he just gives opinion. Unfortunately he doesn't fully understand what he's quoting; or he'd stop with the CIA factbook references.", 
   {}, 
   23683, 
   null, 
   1069592220.0
  ], 
  [
   23703, 
   null, 
   "Charchuk", 
   "I praise your patience with Chuck-up but I've grown weary of his antics. Even Lurch has give up faster than he has when he's wrong; although both are as ready to apologise as the other.\n \n The only positive thing about continuing these posts is that others are reading these things.\n \n They both\n a) learn facts from you\n and\n b) see what nonsense Chuck-up comes up with.\n \n I am still waiting for his apology re: Australia's form of government. But it probably will never come, because, in his own mind, he's never wrong... even when I've pointed out logical errors, he's blamed me for pointing them out.\n :xbanghead \n \n So, it's my fault for them too!\n\n \n \n Bendover and insert.", 
   {}, 
   23650, 
   null, 
   1069599960.0
  ], 
  [
   23704, 
   null, 
   "Charchuk", 
   "LOL. He shifted his argument. He was saying that \"Christians are worse than Muslims\", then he said \"Christians were cruel to Jews in the middle ages and Muslims were nice\", now he's saying \"They both had their good and bad times\".... what's next?\n\n \n I shifted nothing. You, like montalban, don't really have a clue.", 
   {}, 
   23683, 
   null, 
   1069600140.0
  ], 
  [
   23705, 
   null, 
   "Charchuk", 
   "montalban\n \n \nHe says all Christian ideals stem from pagans, which means all the times he's had a go about Christians persecuting Jews means it's not Christianity at fault, but paganism!\n\n \n Hardly, but that is just you twisting words again. Christians get all of their principles from the pagans yes, but they change them to suit their own beliefs in the matter. I.E. on Christmas, do Christians celebrate the Winter Soltices or Christ's birth? \n \n Even with most other things they assert they only pay lip service to. They don't live up to their own beliefs for the most part. I think that they are called Sunday Christians. You are proof of that. If they did follow the pagan beliefs, which they base their's on, than they wouldn't have had their bloody history. They can't even live up to their own versions of these beliefs. European Pagans didn't burn people at the stake for disagreeing with them. Most Christians are hypocrits. I've always said this.\n \n Paganism has continued in Europe and the New World, but now they call themselves neo-pagans based on what they could reconstruct from the old, even though they aren't a book religion like the dominance based religions like Christianity are.\n \n [Irrelevant Tripe Deleted]\n \n I've noticed that hardly anyone else debates with you, and I can see why.", 
   {}, 
   23691, 
   null, 
   1069600200.0
  ], 
  [
   23775, 
   null, 
   "montalban", 
   "what's next?\n\n \n Another thing I recall with regard to Islam (I'm continuing on with the debate despite Charchuk's display of dishonesty) is that Muslims consider that everyone is actually born a Muslim.\n \n They believe that Islam is the natural state of affairs.\n \n When a Christian is baptised, they (Muslims) see this as changing yourself from your natural state to be a Christian. They view you as being born a Moslem, but made a Christian.\n \n It is an interesting world-view; and it is difficult to argue against.", 
   {}, 
   23683, 
   null, 
   1069646160.0
  ], 
  [
   23847, 
   null, 
   "Charchuk", 
   "Another thing I recall with regard to Islam (I'm continuing on with the debate despite Charchuk's display of dishonesty) is that Muslims consider that everyone is actually born a Muslim.\n\n \n I've heard the same thing from Christians as well. That everyone in the world who is a theist is actually A Christian, they just don't want to realize it. That they are just \"rebelling\" against the TRUTH (tm).\n \n \nThey believe that Islam is the natural state of affairs.\n \n When a Christian is baptised, they (Muslims) see this as changing yourself from your natural state to be a Christian. They view you as being born a Moslem, but made a Christian.\n \n It is an interesting world-view; and it is difficult to argue against.\n\n \n I've heard this as well. They believe that all other religions are just working their way up to Islam. Sort of a \"trial\" run as well.", 
   {}, 
   23775, 
   null, 
   1069687380.0
  ], 
  [
   23875, 
   null, 
   "Parcum", 
   "Britain was oppressive he says, therefore they weren't a democracy; forgetting how the US treated its indiginies.\n \n\n \n That's funny because he said that the US was more oppressive than Europe in a different debate.", 
   {}, 
   23847, 
   null, 
   1069699620.0
  ], 
  [
   23876, 
   null, 
   "Charchuk", 
   "That's funny because he said that the US was more oppressive than Europe in a different debate.\n\n \n I said neither. Now you're making up things.", 
   {}, 
   23875, 
   null, 
   1069699740.0
  ], 
  [
   23894, 
   null, 
   "montalban", 
   "That's funny because he said that the US was more oppressive than Europe in a different debate.\n\n \n \n He still hasn't apologised for his grand mistake re: Australian government.\n \n Now he says \"But that's what I was taught at school\" so, it's their fault, not his! Despite over a week of me pointing him to web-sites that showed otherwise, he still said I was wrong.\n \n He was wrong to say that, whether he's repeating someone else's mistake or not. But he's demonstrated that he believes all the errors he makes are somebody else's fault.\n \n I was going to point out that our air force is the RAAF (the Royal Australian Air Force). We have the RSPCA (Royal Society for the Prevention of Cruelty to Animals), our ships are all HMAS something. So that HMAS Sydney is the ship Her Majesty's Australian Ship Sydney.\n \n He should know this about Canada too! But as I say, he bucks responsibility on this.", 
   {}, 
   23875, 
   null, 
   1069715940.0
  ], 
  [
   23895, 
   null, 
   "Charchuk", 
   "He still hasn't apologised for his grand mistake re: Australian government.\n \n \n You hadn't read what I had said before in regards to Australia, have you?\n \n [Irrelevent Tripe Deleted]", 
   {}, 
   23894, 
   null, 
   1069716840.0
  ], 
  [
   23932, 
   null, 
   "montalban", 
   "That's funny because he said that the US was more oppressive than Europe in a different debate.\n\n \n I thought it amazing that his defence was 'that's what I was taught' despite all the web citations I gave him. Regardless of what he was taught, the fact that he didn't understand what I'd posted lead to his mistake... because as I said to him, that he was taught Australia is a federation is not incorrect. It is, it is many things.\n \n Anyway. Another interesting difference between Isalm and Christianity is our respective views to out own Holy texts.\n \n Islam claims there's is the unaltered word of God as communicated directly from the Angel Gabriel. Whereas Christians have generally understood the Bible to be 'inspired' by God.", 
   {}, 
   23875, 
   null, 
   1069731540.0
  ], 
  [
   27572, 
   null, 
   "mizmaxx", 
   "I am responding here to montalban from another thread.\n \n \nChrist said to turn the other cheek. There is no such equivalent in Islam.\n\n \n \nBut if the enemy should incline toward peace, you (also) incline toward peace, and trust in Allah...\n\n Surah 8:61, Meaning of the Koran, Modern English Translation\n \n I actually think the Koran version makes more sense. I always thought the whole \"turn the other cheek thing\" was a bit daft.\n \n \nMuhammad lead forces into battle. He ordered the killing of PoWs.\n\n God did the same. He told the tribes of Isreal to kill the people in the land they came to, to destroy all their temples and forbid them to practice their religions.\n \n Just one example of the very \"forgiving\", \"gentle\" God of Christianity-\n \nSamaria must bear her guilt, for she rebelled against her God. Her people will be killed by the invading army, her babies dashed to death against the ground, her pregnant women ripped open with a sword.\n Hosea 13:16\n \n \nHe married a six year old girl - consummating the 'marriage' when she was nine - though he had desired her for a lot longer.\n \n \n Have you read the Old Testament? People offering up their daughters for rape, etc....\n \n \nNow you've seem to switch arguments that would allow for the excusing of the cruel suppression of 'savagery'.\n\n No. I just think it is inaccurate and hypocritical for one colonist to point the finger at another and say, \"they're bad guys! We're not, 'cause they're worse\". \n \n I have many Muslim friends, and they are open about the problems of organized religion. However, now that Muslims are under attack by racists, I will defend them. The same way I would/do defend \n Jewish people from racist attacks. I don't have to agree with all the histories and variations of a belief to know that it is wrong to target people for these beliefs.\n \n The point is that if you're looking to find horrendous things in a religion, take a sentence from an ancient text- it always looks bad.\n \n Having read the English translation of the Meaning of the Koran and the Bible, and having known many Christians and Muslims, I have found there to be no correlation either way as to whether either religion make one violent, despicable, or immoral.\n \n It entirely depends on how each person puts their beliefs into practice. \n \n It can be said that at particular periods, certain groups adopted certain heinous practices and used their beliefs as justification. That goes for any organized religion.", 
   {}, 
   23932, 
   null, 
   1071535080.0
  ], 
  [
   27660, 
   null, 
   "montalban", 
   "You misrepresent Surah 8:61. It says IF your enemy chooses peace, and then choose peace. That is not the same as if your enemy choose to hit you, choose peace, which is what Jesus said. Jesus is saying to choose peace, regardless of what your enemy does!\n \n Jesus is saying peace, peace, peace. He tells us how many times we should forgive our brother etc.\n \n Secondly, how God acts towards His creation is not for me to judge - at best you'll draw nothing more than the same reaction from a Muslim. Therefore this isn't an issue. At this point, even you would have to say in comparison, the best you can get between the two is a draw.*\n \n However, if you read what I said about comparing the actions of Christ to Muhammad they are totally different!\n \n Christ never slept with an under-age girl. Muhammad did.\n \n Christ never called on political assignations and killing of PoWs. Muhammad did.\n \n You are trying to say in essence that these two faiths are the same. They can't be because the chief 'characters' of both works behaved completely differently.\n \n When a Christian misbehaves, we have Christ as a model to compare. We can say 'What you are doing is against Christ's teachings'. Yet the same acts don't have disapproval in Islam, because Muhammad - their 'ideal' man did these horrendous things.\n \n This is why the Ayatollah, when he was 20, married a 10 year old... this was before his fame/infamy. He was following the example of his prophet.\n \n If we follow the example of Jesus we'd be acting completely differently.\n \n *And I will debate this another time. Further, when you talk about what's going on in the Old Testament, it would help if you reference it, as I did with my debate about the Koran, becuase I'd like to check what you're claiming.", 
   {
    "unicode_changes_made": true
   }, 
   27572, 
   null, 
   1071549360.0
  ], 
  [
   27702, 
   null, 
   "mizmaxx", 
   "That is not the same as if your enemy choose to hit you, choose peace, which is what Jesus said.\n\n \n I didn't say they were the same. In fact, I said the \"turn the other cheek\" thing was daft. I was just showing that the Koran advocates peace as well. \n \n In terms of Jesus being all about \"peace\", what about when he violently threw the money-changers out of the Temple? Mat 21:12, Mark 11:15\n \n \nThey can't be because the chief 'characters' of both works behaved completely differently.\n\n First of all, you are comparing the wrong things. Jesus didn't write the Bible. The Koran is not about Muhammad. Muhammad is a prophet (a fallible human, remember?), Jesus was a \"God\" (son of or whatever). Muhammad is not the \"chief character\" of the Koran, he is the prophet. The \"chief character of the Bible is God, not Jesus. Jesus is only introducted near the end, he's not the main character at all. People do not want to follow the prophet as Christians want to follow Jesus, they want to follow Allah. \n \n Second, Muhammad didn't do anything that other Bible characters don't do. He's about the same. \n \n Allah and Jehovah are very much the same.\n \n So, neither is worse than the other.", 
   {
    "unicode_changes_made": true
   }, 
   27660, 
   null, 
   1071562500.0
  ], 
  [
   27713, 
   null, 
   "montalban", 
   "That is not the same as if your enemy choose to hit you, choose peace, which is what Jesus said.\n\n \n It is not the same. One is saying only be peaceful if your enemy is peaceful. The other is saying be peaceful, for it's own sake, no matter what.\n \n The Islamic one is conditional -read the next verse where they also talk about 'if they are trying to trick you'. The Christian one is unconditional.\n \n \nI didn't say they were the same. In fact, I said the \"turn the other cheek\" thing was daft. I was just showing that the Koran advocates peace as well. \n\n \n Firstly, I've dealt with specific verses, not bland generalisations. I for instance can state the Muslim-line that the Koran is about 'right for women' but what are those rights? They make a woman's testimony valid - and thus a right under law - but that her testimony is only worth half that of a man's. Hardly a great breakthrough (I believe I quoted the appropriate texts in my first posts).\n \n There are so many other bland generalisations about. You can take a part of a passage out of context, as you have here and try to say that this is of the same value as that of Jesus' teachings...\n \n \nIn terms of Jesus being all about \"peace\", what about when he violently threw the money-changers out of the Temple? Mat 21:12, Mark 11:15\n\n \n Here again you have a warped sense of sameness. Over-turning tables he did. How is that comparable to killing 900 PoWs? Muhammad lead armies into battle. He celebrated political assassinations. How do these all compare to over-turning tables of people trying to make money off religion?\n \n And yet you think an exhortation for peace is 'daft'!\n \n \n They can?t be because the chief ?characters? of both works behaved completely differently.\n\n \n \nFirst of all, you are comparing the wrong things. Jesus didn't write the Bible. The Koran is not about Muhammad. Muhammad is a prophet (a fallible human, remember?), Jesus was a \"God\" (son of or whatever). Muhammad is not the \"chief character\" of the Koran, he is the prophet.\n\n \n No, Muhammad is put forward by Muslims as the most wise and exemplary man. He is the 'ideal' man. He may not be viewed as a god, but he is supposed to represent the best a man can be.\n \n He is believed by them to be greater than Jesus and all the 'other prophets'\n \"In Islam all prophets are respected, and loved. However, Muhammad has a special place, for He is believed to be the last of prophets and the greatest of them in function and success and for He was predicted by many of the former messengers.\"\n http://www.geocities.com/Athens/Troy/7568/messengers/messengers.htm\n \n He is the final prophet (http://www.geocities.com/zahidtg2/Muhammed/finalprophet.html)\n \n Muslims aren't just implored to obey their god, but to obey him, and Muhammad (http://www.submission.org/obey-Prophet-Muhammed.htm)\n \n \nThe \"chief character of the Bible is God, not Jesus. Jesus is only introduced near the end, he's not the main character at all. People do not want to follow the prophet as Christians want to follow Jesus, they want to follow Allah. \n Second, Muhammad didn't do anything that other Bible characters don't do. He's about the same. \n Allah and Jehovah are very much the same.\n So, neither is worse than the other.\n\n \n Actually, you believe Jesus to be a man, so for you, you should be comparing two men, Jesus and Muhammad. Now you don't want to. Funny that because it runs contrary to what you believe?\n \n And I'm not comparing Allah and Jehovah\n \n As I said, show me where Christ did such horrid things as Muhammad!\n \n You are right, there is no comparison. Christ on earth acted holy. Muhammad was avaricious, lecherous and conniving.\n \n In whom would you rather follow?", 
   {}, 
   27702, 
   null, 
   1071566460.0
  ], 
  [
   28178, 
   null, 
   "mizmaxx", 
   "In whom would you rather follow?\n\n Neither.\n \n \nHere again you have a warped sense of sameness. Over-turning tables he did. How is that comparable to killing 900 PoWs? Muhammad lead armies into battle. He celebrated political assassinations.\n\n \n Jehovah led armies into battle. He told the tribes of Isreal to go into Canaan and destroy it, run the people out, demolish their churches, destroy them- even if they are nice.\n \n What about my no 1 favorite Bible quote? \"Blessed is the man who takes your babies and smashes them against the rocks\" Psalms 137:9 \n \n ...turn the other cheek of my arse.\n \n \nActually, you believe Jesus to be a man, so for you, you should be comparing two men, Jesus and Muhammad. Now you don't want to. Funny that because it runs contrary to what you believe?\n\n \n Actually, since we are arguing about what believers are told about each person, I think it makes sense to consider that one is given God-status and the other is a human prophet.\n \n The problem with arguing about Christianity is that the forms are so varied and the Bible so inconsistent that you could argue that the Bible says virtually anything. The Koran on the other hand was written at a certain time, and passed down intact, never translated or added to or censored.\n \n Anyway, you continue to argue as though Christianity is about Jesus more than it is about God. God did many things that demonstrated him to be as cruel and jealous as Allah. Biblical characters do atrocious things, like offering up their daughters to be raped, for example. Also, the stories about what Jesus supposedly did are fundamental to Christianity, whereas in Islam people are following Muhammad's words more than his life. It sure isn't like Muslims are instructed to follow Muhammad by marrying nine-year-olds. It is also not hard to find praised historical figures of Christian Europe with same or equally heinous predilections.\n \n What is important is how people are taught to think within a religion. So, for example, white right-wing Baptists are taught that most people are evil sinners because they fornicate and whatnot. Liberation Theologists are taught to listen to Jesus' condemnations of the greedy and rich and his exaltations about the poor, and to see the mirrors of Biblical injustices in their lives. This is what effects how their religious beliefs translate into their behaviour. \n \n Because Christianity is so widely interpreted, arguing that \"Christians believe\" anything is difficult. Islam is only slightly less so, but it is still an important consideration. A Muslim fundamentalist in a position of power within the UAE is likely to behave very differently from an anti-racist New Afrikan Muslim. So generalizations are hard to make.\n \n I still don't see any significant difference in the source (books, prophets behaviours) of either religion. I find neither religion particularly appealing on those bases, but I know enough good people of both religions to know that this is not the whole story. Have you ever read the Meaning of the Koran? It's very interesting. \n \n \nAnd I'm not comparing Allah and Jehovah\n\n \n But that would be the most meaningful comparison.", 
   {}, 
   27713, 
   null, 
   1071740040.0
  ], 
  [
   28186, 
   null, 
   "montalban", 
   "In whom would you rather follow?\n\n \n \nNeither.\n\n \n Fair enough, if you think that peace and war amount to the same thing; that over-turning a table is the same as killing 900 people.\n \n \nHere again you have a warped sense of sameness. Over-turning tables he did. How is that comparable to killing 900 PoWs? Muhammad lead armies into battle. He celebrated political assassinations.\n\n \n \nJehovah led armies into battle. He told the tribes of Israel to go into Canaan and destroy it, run the people out, demolish their churches, destroy them- even if they are nice.\n\n \n \nWhat about my no 1 favorite Bible quote? \"Blessed is the man who takes your babies and smashes them against the rocks\" Psalms 137:9 \n ...turn the other cheek of my arse.\n\n \n That is not God talking. That is David. What is your point? Sure, he is hoping for something bad to happen. The same Bible mentions that the very same David sent his best friend into the heart of battle to be killed because he lusted after the man's wife. No where does it say \"This is the right thing to do\". It is merely recording that David is a failed person who made many grave errors. And later sought atonement for them.\n \n If you want to compare God to Muhammad in order to show them as both vindictive/cruel etc., your comparison fails immediately because you can't judge God. You have no idea of the reason why God does what He does.*\n \n You think God as depicted in the Old Testament is bad, but have no idea about Allah (see below).\n \n \n Actually, you believe Jesus to be a man, so for you, you should be comparing two men, Jesus and Muhammad. Now you don't want to. Funny that because it runs contrary to what you believe?\n\n \n \nActually, since we are arguing about what believers are told about each person, I think it makes sense to consider that one is given God-status and the other is a human prophet.\n The problem with arguing about Christianity is that the forms are so varied and the Bible so inconsistent that you could argue that the Bible says virtually anything.\n\n \n \nThe Koran on the other hand was written at a certain time, and passed down intact, never translated or added to or censored.\n\n \n No, that's simply not true. The Koran didn't achieve final and definitive form till some time after.\n http://www.isisforum.com/research/origins.htm\n \n Even it's writting was done over a large portion of Muhammed's later life. Thus we see Muhammed at Medina first imploring his followers to pray towards Jerusalem, but because the Jews didn't convert en mass, he had them turn around, stick their arse's in the air and pray towards Mecca (whence Muhammed had fled).\n \n Further...\n \n Second to the Koran are the Haddiths (the sayings of Muhammad by Muhammad and his followers). These are more extensive, and are used in order to understand how Muhammad interpreted various verses - because Muhammad might go into some length on - a commentary on various Koranic verses.\n \n These are divided into 'strong' and 'weak' Haddiths depending upon the distribution of their acceptance. The 'strong' are generally universally accepted. The 'weak' are not. Thus there is 'universality' here either.\n \n \nAnyway, you continue to argue as though Christianity is about Jesus more than it is about God. God did many things that demonstrated him to be as cruel and jealous as Allah. Biblical characters do atrocious things, like offering up their daughters to be raped, for example.\n\n \n I don't doubt that you've found this, but I'd like the verse, please.\n \n \nAlso, the stories about what Jesus supposedly did are fundamental to Christianity, whereas in Islam people are following Muhammad's words more than his life.\n\n \n Not true at all. Muhammad is, as I've already quoted earlier the exemplar of men. He is the way they are supposed to be.\n \n \nIt sure isn't like Muslims are instructed to follow Muhammad by marrying nine-year-olds.\n\n \n He did so by example. That is why; and I fail to understand why you'd not picked this up when I've mentioned it twice already; the Ayatollah was able to marry a 10 year old when he was 20. Even today in Islam generally as soon as a girl has her first menstruation; she's able to be married - this can be as young as 9. It is in Islamic law in places such as Iran precisely because it was the way Muhammad acted.\n \n \nIt is also not hard to find praised historical figures of Christian Europe with same or equally heinous predilections.\n\n \n I'm not sure what you mean here. I have stated time and time again that when Christians do 'bad' it is in spite of being Christian, NOT because of it. When a Muslim marries an under-age girl, it is because he is allowed to. When he blows up a missionary, it is because of his religion, not despite it.\n \n \nWhat is important is how people are taught to think within a religion. So, for example, white right-wing Baptists are taught that most people are evil sinners because they fornicate and whatnot. Liberation Theologists are taught to listen to Jesus' condemnations of the greedy and rich and his exaltations about the poor, and to see the mirrors of Biblical injustices in their lives. This is what effects how their religious beliefs translate into their behaviour. \n\n \n Now you're contradicting yourself. Your now not arguing that there's something inherently bad about Christianity - that puts it on a par with Islam, but admit how particular groups (mis)interpret their religion.\n \n Tell me how does a Muslim marrying an underage girl misinterpret Islam?\n \n \nBecause Christianity is so widely interpreted, arguing that \"Christians believe\" anything is difficult. Islam is only slightly less so, but it is still an important consideration. A Muslim fundamentalist in a position of power within the UAE is likely to behave very differently from an anti-racist New Afrikan Muslim. So generalizations are hard to make.\n\n \n I'm not in general making the comparison between the practitioners, I am attacking the theology itself. However, I see Islam as worse because it encourages people to be evil.\n \n \nI still don't see any significant difference in the source (books, prophets behaviours) of either religion. I find neither religion particularly appealing on those bases, but I know enough good people of both religions to know that this is not the whole story. Have you ever read the Meaning of the Koran? It's very interesting.\n\n \n No, but I've got the Koran itself. Although it's an English version which Muslims will in fact say is a lesser version than the original Arabic - which is cultural elitism!\n \n \nAnd I'm not comparing Allah and Jehovah\n\n \n \nBut that would be the most meaningful comparison.\n\n \n Then scroll down to the \"Comparison grid between Christianity and Islamic doctrine\"\n at\n http://www.fatheralexander.org/booklets/english/islam_e.htm\n before you cast judgment.\n \n \n Also, I don't refer to God as Jehovah.\n \n \n *Here is what a Christian site says (I don't agree with all their conclusions; but I do agree that we can not judge God). I give it forward because I am pressed for time to find the Orthodox reasonings; a matter for which I apologise.\n \n \"When reading how God acted in a harsh or angry manner, they assume they are seeing what God is really like. After all, that is how we make judgments about other people. We watch them in action and decide if they are gentle or mean, wise or foolish, good or bad. But even when evaluating people, we should always make room for the context. If you saw me grab my son by the arm and yank him toward me, you might conclude I was harsh and abusive. But if that incident occurred along a busy highway, you would call me quick thinking, crediting me with saving my son from being struck by a car. Before we determine character from behavior, we must consider the context.\n We need to do the same when determining the character of God. We must consider what made it necessary for Him to act as He did. Don?t just ask what He did, ask why. When you do, you will notice that God always works with people where they are, doing for them what they need most. When you see a young mother talking baby talk to her toddler, you don?t assume the mother is mentally deficient. You assume she has stooped to her child?s level of conversation because she loves her child and wants to communicate that love. There is always a good reason for what God does, even when we think a particular action is strange. \n When God did not answer Job, it was because silence taught important lessons that words could never teach. When God killed the man trying to help, it was because the help offered was actually harmful. When God behaved violently or asked His people to behave violently, it was not because He is violent. It was because the ancient Near East was a violent place... \n ?Why didn?t He teach them a better way?? He did. He showed them that violence is not the best response. Many laws of the ancient Near East commanded excessive and unfair punishments. You could be killed for insulting someone. An offense against an important official was punished more harshly than the same offense against a common person.[13]\n Instead, God called His people to perfect equity: an eye for an eye and a tooth for a tooth. No more, no less, and no favoritism. It did not matter whose eye or tooth was damaged?noble or common person?the punishment was the same. Like a loving parent, God compassionately and gently taught His people a better way than violence. He told them to treat others the way they would like to be treated.[14]\"\n http://www.trianglepublishing.com/oldtestament/chapter1.html\n \n \n I will read http://www.cbcg.org/graceofGod_OT1.htm another site I have found to see if it has any further to add to this.", 
   {}, 
   28178, 
   null, 
   1071751860.0
  ], 
  [
   28374, 
   null, 
   "montalban", 
   "Mixmaxx has raised some interesting points and I am not as versed with the Old Testament as my 'born-again' brethren.\n \n I am hoping that someone else will enter here into this debate in defence of God.\n \n I do know however that God wished to use Israel as his instrument here on Earth - and allowed them to deal harshly with people who went against them - as they were acting for His Will.", 
   {}, 
   28186, 
   null, 
   1071803760.0
  ], 
  [
   51776, 
   null, 
   "montalban", 
   "Does anyone here honestly believe that Muhammed and Jesus were similar? (many people seem to say that all religions are the same).", 
   {
    "post_info": {
     "post_title": "Posting in the hopes of reviving this subject"
    }
   }, 
   28374, 
   null, 
   1085243760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Islam", 
  "url": "http://www.4forums.com/political/religion-debates/1232-islam.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1232, 
  "discussion_files": [
   [
    "5931.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-print.html"
   ], 
   [
    "5932.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-8-print.html"
   ], 
   [
    "5933.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-6-print.html"
   ], 
   [
    "5934.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-4-print.html"
   ], 
   [
    "5935.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-5-print.html"
   ], 
   [
    "5936.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-7-print.html"
   ], 
   [
    "5937.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-3-print.html"
   ], 
   [
    "5938.html", 
    "http://www.4forums.com/political/religion-debates/1232-islam-2-print.html"
   ]
  ], 
  "identifier": 1232
 }
]