[
 [
  [
   343767, 
   null, 
   "hollygirl", 
   "i belive in creation beacuse in my eyes it is the only 'sientific' exclamation. if evoution is true how come fossiles of amimals ect have not been found ? how would we see if one part of our had not been formed so well and compleately?", 
   {
    "post_info": {
     "post_title": "evolution what facts are there that prove it or all they all theorys ?"
    }
   }, 
   null, 
   null, 
   1234428720.0
  ], 
  [
   343780, 
   null, 
   "Penfold", 
   "A theory is not something dreamed up by scientists after chomping on a few magic mushrooms.", 
   {}, 
   343767, 
   null, 
   1234451340.0
  ], 
  [
   343818, 
   null, 
   "T.Q", 
   "if evoution is true how come fossiles of amimals ect have not been found ?\n\n Wait, are you claiming that fossils have not been found?\n \n \nhow would we see if one part of our had not been formed so well and compleately?\n\n \n \"One part of our...\" what? Body? fingernail? little toe? If you're asking how our bodies could be so perfectly formed without being created, you obviously have never actually studied the human body.\n \n Pointless.", 
   {}, 
   343767, 
   null, 
   1234465800.0
  ], 
  [
   343822, 
   null, 
   "sinjin", 
   "i belive in creation beacuse in my eyes it is the only 'sientific' exclamation. if evoution is true how come fossiles of amimals ect have not been found ? how would we see if one part of our had not been formed so well and compleately?\nI suspect you believe because people you trust told you it was so.", 
   {}, 
   343767, 
   null, 
   1234466340.0
  ], 
  [
   343862, 
   null, 
   "gansao", 
   "i belive in creation beacuse in my eyes it is the only 'sientific' exclamation. if evoution is true how come fossiles of amimals ect have not been found ? how would we see if one part of our had not been formed so well and compleately?\n\n \n Hollygirl, Please excuse me for saying this but the phrase 'scientific exclamation' seems a rather advanced concept for someone who has such difficulty in spelling, So I would assume that it is something that has been told to you rather than your own conclusion.\n All of this stuff about creation versus evolution is a smoke screen.\n It doesnt matter a fig unless you want it to!\n If you really want to express a view that God created the world recently please grow a very thick skin.", 
   {}, 
   343767, 
   null, 
   1234481760.0
  ], 
  [
   348923, 
   null, 
   "Larni", 
   "i belive in creation beacuse in my eyes it is the only 'sientific' exclamation. if evoution is true how come fossiles of amimals ect have not been found ? how would we see if one part of our had not been formed so well and compleately?\n\n \n Another well reasoned, correctly parsed and spelled creo argument.\n \n Full marks.", 
   {}, 
   343767, 
   null, 
   1239135600.0
  ], 
  [
   348998, 
   null, 
   "rEVOLUTION", 
   "Although it is obvious that the OP's thread was meant to be a troll job (I hope), I'll answer anyway.\n \n Have you considered endogenous retroviruses (ERVs) or inactive genes to metabolize vitamin C, or perhaps you've overlooked the field of biogeography? What do you make of continental islands compared to oceanic islands and their subsequent distribution of species?\n \n This should give you somewhere to start. BTW, when you see the word \"theory\" being used when referencing things scientific, you should replace it with the word \"fact\" in your mind. Because, you see, the theory of evolution is supported by mountains of evidence from literally every field of science.\n \n Unfortunately, creationists and ID'ers have been brainwashed to think otherwise.", 
   {}, 
   348923, 
   null, 
   1239220620.0
  ], 
  [
   356275, 
   null, 
   "MarielB", 
   "Have you actually studied any science?\n \n Genesis does not conflict with science. see www.songofgenesis.org\n \n Reach behind you. You have a tail bone.\n Human beings retain the genetic code for vestigial tails. We have additional genes that \"turn off\" the coding so that most people do not actually have tails. However, the coccyx, or tailbone, is the remnant of a lost tail. All mammals have a tail at one point in their development. In humans, it is present for a period of 4 weeks, during stages 14 to 22 of human embryonic development. This tail is most visible in human embryos 31-35 days old. The tailbone, (at the end of the spine), has lost its original function in assisting balance and mobility, though it still serves some secondary functions, such as being an attachment point for muscles, which explains why it has not degraded further. (Natural selection - evolution)\n Since tails are part of our genetic code, and part of our embryonic development, \n why would God have made that little detail if He actually fashioned us out of \"dirt\". \n Doesn't it make more sense that He guided the process of evolution, and when we were \"ready\" gave us our immortal souls \"in His image?\"\n \n p.s. use the FIRST definition in the dictionary when discussing evolution. The others are incorrect for this context. \n \n There are a great many aspects of science that \"prove\" Genesis can not be read literally (although it contains truth). This is just ONE.", 
   {
    "post_info": {
     "post_title": "hollygirl"
    }
   }, 
   348998, 
   null, 
   1244139420.0
  ], 
  [
   356279, 
   null, 
   "Larni", 
   "Have you actually studied any science?\n \n Genesis does not conflict with science. see www.songofgenesis.org\n \n Reach behind you. You have a tail bone.\n Human beings retain the genetic code for vestigial tails. We have additional genes that \"turn off\" the coding so that most people do not actually have tails. However, the coccyx, or tailbone, is the remnant of a lost tail. All mammals have a tail at one point in their development. In humans, it is present for a period of 4 weeks, during stages 14 to 22 of human embryonic development. This tail is most visible in human embryos 31-35 days old. The tailbone, (at the end of the spine), has lost its original function in assisting balance and mobility, though it still serves some secondary functions, such as being an attachment point for muscles, which explains why it has not degraded further. (Natural selection - evolution)\n Since tails are part of our genetic code, and part of our embryonic development, \n why would God have made that little detail if He actually fashioned us out of \"dirt\". \n Doesn't it make more sense that He guided the process of evolution, and when we were \"ready\" gave us our immortal souls \"in His image?\"\n \n p.s. use the FIRST definition in the dictionary when discussing evolution. The others are incorrect for this context. \n \n There are a great many aspects of science that \"prove\" Genesis can not be read literally (although it contains truth). This is just ONE.\n\n \n Good luck getting fundies to swallow that.\n \n As far as they are concerned Genesis is literal.\n \n I have no problem with Genesis as poetic literature but your site does seem to be pure apologetics.", 
   {}, 
   356275, 
   null, 
   1244140380.0
  ], 
  [
   356322, 
   null, 
   "shaunjosef", 
   "i belive in creation beacuse in my eyes it is the only 'sientific' exclamation. if evoution is true how come fossiles of amimals ect have not been found ? how would we see if one part of our had not been formed so well and compleately?\n\n \n If you want evidence of evolution, look at bacteria. There are many of them and the environment is always changing, therefore, changes are adapted quickly. If you say they aren't evolving, why could we cure all TB with antibiotics before, but now there are antibiotic resistant strains.", 
   {}, 
   343767, 
   null, 
   1244158980.0
  ], 
  [
   356357, 
   null, 
   "marc9000", 
   "Have you actually studied any science?\n \n Genesis does not conflict with science. see www.songofgenesis.org\n \n Reach behind you. You have a tail bone.\n Human beings retain the genetic code for vestigial tails. We have additional genes that \"turn off\" the coding so that most people do not actually have tails. However, the coccyx, or tailbone, is the remnant of a lost tail. All mammals have a tail at one point in their development. In humans, it is present for a period of 4 weeks, during stages 14 to 22 of human embryonic development. This tail is most visible in human embryos 31-35 days old. The tailbone, (at the end of the spine), has lost its original function in assisting balance and mobility, though it still serves some secondary functions, such as being an attachment point for muscles, which explains why it has not degraded further. (Natural selection - evolution)\n Since tails are part of our genetic code, and part of our embryonic development, \n why would God have made that little detail if He actually fashioned us out of \"dirt\". \n Doesn't it make more sense that He guided the process of evolution, and when we were \"ready\" gave us our immortal souls \"in His image?\"\n \n p.s. use the FIRST definition in the dictionary when discussing evolution. The others are incorrect for this context. \n \n There are a great many aspects of science that \"prove\" Genesis can not be read literally (although it contains truth). This is just ONE.\n\n \n It's always interesting to look at websites like www.songofgenesis.org and and try to figure out if they are some person or groups sincere belief, or if they are simply an atheist trick. This one has several red flags that tell me it's probably atheism. \n \n It asks this question;\n \n \nSo, if what scientists claim happened, and what Genesis claims happened are so similar to one another, what's the problem? Why is there so much disagreement? \n\n \n It is well written and not really offensive, yet it blames creationists 100% for the disagreement, and atheists 0% for the disagreement. I simply don't believe that the writer(s) are unaware that Victor Stenger wrote a book called \"How Science Shows That God Does Not Exist\". A sincere person with the beliefs of that article simply couldn't ignore that, and all the other militant atheism in the scientific community. They also can't ignore the simple fact that reasons for disagreement between literal Genesis and science is political. \n \n Another quote from songofgenesis;\n \n \nPoetry does not mean fiction. \n \n \n But poetry will never be taken seriously in political decisions. Atheists have a lot to like in songofgenesis, don't they? :)\n \n another quote\n \nScience helps those who seek to understand God in a more profound way, to learn about the intricate and complex unfolding of His creation. \n\n \n And science helped Stenger write his book. How can the same subject make a stronger case for both of two completely opposing viewpoints? \n \n another\n \nIn modern times, The Rabbinical Council of America (RCA) has \"maintained that evolutionary theory, properly understood, is not incompatible with belief in a Divine Creator, nor with the first two chapters of Genesis.\" Perhaps the problem is that creationists do not seem to \"understand\" the process of evolution? \n\n \n Could be another problem - that perhaps Victor Stenger and Richard Dawkins do not properly understand when to stop coming to dramatic conclusions about evolution? Why no reference to that problem? \n \n and another\n \nCharles Darwin was a believer, and a deeply spiritual man. Darwin delayed the publication of his observations in The Origin of the Species for eight years, because he feared becoming another Galileo! It is too bad that he has become demonized by people who misunderstand his findings. \n\n \n This perversion of history is often put fourth by atheists, as they constantly switch back and fourth between associating/disassociating evolution with atheism. Darwin's life has been carefully and extensively studied by many people, and it's almost unanimous among those historians that Darwin's faith faded as his life went on, and that he was an unbeliever when he died. \n \n and\n \nThere is nothing in scripture to support the idea that mankind should remain ignorant by ignoring all that science has to offer. \n\n \n That would be incorrect. There is nothing in scripture that encourages man to cross examine his faith with worldly things. Mark 10:15 warns against it. Other parts of the Bible warn against false teaching. \n \n finally\n \nOur public school children should not be subjected to this one narrow view of our God or our universe. They have the right to enjoy the discovery of our loving creator God's marvelous power by exploring the world of science! Let them learn! \n\n \n Should Victor Stenger teach them? No warnings about that? Sorry -Songofgenesis doesn't cut it.", 
   {
    "unicode_changes_made": true
   }, 
   356275, 
   null, 
   1244169600.0
  ], 
  [
   356358, 
   null, 
   "marc9000", 
   "I have no problem with Genesis as poetic literature but your site does seem to be pure apologetics.\n\n \n NO atheist has a problem with Genesis as poetic literature. Poetry is not involved in political decisions. Atheism doesn't like political competition.", 
   {}, 
   356279, 
   null, 
   1244169840.0
  ], 
  [
   356373, 
   null, 
   "T.Q", 
   "OoooOOOOoooo....\n \n It's the EAC! Everybody run for your lives!", 
   {}, 
   356358, 
   null, 
   1244172600.0
  ], 
  [
   356395, 
   null, 
   "MarielB", 
   "Your response to my post:\n \" I simply don't believe that the writer(s) are unaware that Victor Stenger wrote a book called \"How Science Shows That God Does Not Exist\". A sincere person with the beliefs of that article simply couldn't ignore that, and all the other militant atheism in the scientific community.\"\n \n I believe the writers are aware that there are atheists in the scientific community, since they make passing reference to them, but since the purpose of this site (www.songofgenesis.org) is to help people of faith see that science doesn't have to conflict with religion, what would be the point of dwelling on the stance of non-believers like Stenger? His views were certainly not relevant to their case! \n Also, do you suppose that atheists have perhaps become \"militant\" in order to counter the political activism of creationists?\n \n \"...Darwin&#8217;s faith faded as his life went on, and that he was an unbeliever when he died,\"\n Yes, that is unfortunate and sad. I'm sure he despaired when everyone turned against him. However, he WAS a believer at the time, and that was the important part. His observations were NOT an attempt to \"disprove\" God!\n \n \"There is nothing in scripture that encourages man to cross examine his faith with worldly things. Mark 10:15 warns against it.\"\n \n Mark was warning about becoming obsessed with materialism, not advocating ignorance.\n \n I'm afraid I don't see the connection to \"political competition?\"", 
   {
    "post_info": {
     "post_title": "To Marc9000"
    }
   }, 
   356373, 
   null, 
   1244177220.0
  ], 
  [
   356493, 
   null, 
   "Larni", 
   "NO atheist has a problem with Genesis as poetic literature. Poetry is not involved in political decisions. Atheism doesn't like political competition.\n\n \n I don't understand: what political competition?", 
   {}, 
   356358, 
   null, 
   1244230380.0
  ], 
  [
   356527, 
   null, 
   "marc9000", 
   "Your response to my post:\n \" I simply don't believe that the writer(s) are unaware that Victor Stenger wrote a book called \"How Science Shows That God Does Not Exist\". A sincere person with the beliefs of that article simply couldn't ignore that, and all the other militant atheism in the scientific community.\"\n \n I believe the writers are aware that there are atheists in the scientific community, since they make passing reference to them, but since the purpose of this site (www.songofgenesis.org) is to help people of faith see that science doesn't have to conflict with religion, what would be the point of dwelling on the stance of non-believers like Stenger? His views were certainly not relevant to their case! \n\n \n His views are very relevant because non-believers like him are largely part of the reason science conflicts with religion. No matter how much someone or some organization wishes it did not, it does, and it's a huge issue. Science is controlled by godless naturalists. This link from \"The Humanist\",particularly the following bolded paragraph, sums it up;\n \n \nIt appears to be a widely accepted opinion in America that the long conflict between science and religion is at an end. It is often assumed that science and religion are two nonconflicting bodies of knowledge, equally valuable complementary paths leading toward an ultimate understanding of the world and our place in it. The conflicts of the past are said to be due to excessive zeal and misunderstanding on both sides. Peaceful coexistence and even a measure of syncretism are assumed to be possible as long as each concedes to the other's authority in their separate worlds of knowledge: that of matter and facts for science, and that of the spirit and values for religion.\n \n Let us be blunt. While it may appear open-minded, modest, and comforting to many, this conciliatory view is nonsense. Science and religion are diametrically opposed at their deepest philosophical levels. And, because the two worldviews make claims to the same intellectual territory - that of the origin of the universe and humankind's relationship to it - conflict is inevitable. \n\n \n It's always interesting to see some godless evolutionists embrace theistic evolution, while some others thumb their noses at it. But I would really expect a middle view like theistic evolution to fall somewhere CENTERED between humanist/atheist science and creationist/ Biblical views. Here is a list of recently published books, with science by far the most unifying tool in all of them;\n \n Darwin's Dangerous Idea / Daniel Dennett - 1995\n The End of Faith/ Sam Harris - 2004\n The God Delusion/ Richard Dawkins - 2006\n Letter to a Christian Nation/ Sam Harris - 2006\n The Atheist Universe / David Mills - 2006\n Breaking the Spell/ Daniel Dennett - 2006\n Everything you know about God is wrong/ Russ Kick - 2007\n The Quotable Atheist / Jack Huberman - 2007\n The Atheist Bible / Joan Konner - 2007\n Nothing - Something to Believe / Lalli Nica - 2007\n The Portable Atheist / Christopher Hitchens - 2007\n God is Not Great / Christopher Hitchens - 2007\n God - the failed hypothesis - How Science Shows That God Does Not Exist / Victor Stenger - 2007\n 50 Reasons People Give For Believing in God/ Guy Harrison - 2008\n Godless: How an Evangelical Preacher Became One of America's Leading Atheists / Barker/Dawkins - 2008\n \n Why does \"songofgenesis\" point fingers only at creationists for the conflict? \n \n \nAlso, do you suppose that atheists have perhaps become \"militant\" in order to counter the political activism of creationists? \n\n \n No, I don't. I don't believe creationists have done much of anything new and notable to justify the slew of atheist books listed above. Other than, of course, to point out the recently discoverd complexities of the simplest forms of life. :) Do you think that inspired the above militant books? \n \n I believe creationists have become militant in order to counter the political activism of atheists. Atheists of course, don't agree. What do theistic evoutionists think? It seems like they always side with atheists. \n \n Who is \"countering\" who has been a seesaw battle throughout history. \"Origin of Species\", the Scopes Monkey trial, separation of church and state, McCarthyism, banning prayer in schools, Intelligent Design, so much literature and speculation of all the above. \n \n Obviously, a lot of time and thought went into this Songofgenesis webpage. But we do find this paragraph;\n \n \nThe rest of Genesis covers man's disobedience and his fall from God's grace. We will move on at this point. Since we have already made a case for Genesis being poetic in nature, we will not continue to analyze each element of the account. \n\n \n Man's disobedience and his fall from God's grace are far more important in Christianity than details of how life was formed. I would expect a website like songofgenesis to give some details of how evolution goes along with original sin. Was there one fully formed Adam, or were there many fully formed Adams? \n \n \n\"...Darwin's faith faded as his life went on, and that he was an unbeliever when he died,\"\n Yes, that is unfortunate and sad. I'm sure he despaired when everyone turned against him. \n\n \n I'm not so sure of that, because he made a LOT of atheist friends. Biographers of Darwin say that his physical health, the death of his daughter Anne, and most of all, his observances of nature caused him to take his stand as an unbeliever. How could he believe in one fully formed Adam, whose original sin caused the pain and suffering he was seeing in nature? \n \n \nHowever, he WAS a believer at the time, and that was the important part. His observations were NOT an attempt to \"disprove\" God!\n\n \n He was a believer early in his life. His observations were not an attempt to disprove, but that's what they accomplished. And they can accomplish that in theistic evolutionists today, when they all too quickly go from actual science to naturalist scientific philosophy, as all the above book authors, and their millions of readers do. \n \n \n \n \n\"There is nothing in scripture that encourages man to cross examine his faith with worldly things. Mark 10:15 warns against it.\"\n \n Mark was warning about becoming obsessed with materialism, not advocating ignorance. \n\n \n Here's what it actually says, \n \n \"I tell you the truth, anyone who will not receive the kingdom of God like a little child will never enter it.\" \n \n No reference to materalism there. He was talking about things a child doesn't know, and doesn't need to know, and isn't capable of knowing. Humans aren't capable of understanding what happened billions of years ago. \n \n \n \nI'm afraid I don't see the connection to \"political competition?\"\n\n \n \nI don't understand: what political competition? \n\n \n There could possibly not be conflict between science and religion if it wasn't for politics. \n \n Amazon.com: A Jealous God: Science's Crusade Against Religion: Pamela R. Winnick: Books\n \n I've read the book, and here's a concise review;\n \n \nThe age-old war between religion and science has taken a new twist. Once the dedicated scientist-martyr fought heroically against rigid religionists. But now the tables have turned, and it is established science crusading against religion, pushing atheistic agendas in the classroom, in textbooks, and in the media. This book shows how science has now become a religion of its own-an often fanatical one at that-furiously preaching atheism, punishing dissenters, dictating how and what we should think, and subtly inserting its worldviews in everything from education to entertainment. And, with stunning clarity, it proves that, with billions of dollars up for grabs in the race for stem cell research, intellectual integrity has been replaced with good old-fashioned greed. With sharp insight and completely original reporting, this book defiantly shows the extent to which science is beating down religion and how this systematic tyranny is unmistakably weakening culture and society. \n\n \n Here's how chapter 3 opens;\n \n \nOn December 29, 1968, 2600 scientists, including four Nobel laureates, published a petition in the New York Times, the Wall Street Journal, and the liberal Catholic magazine Commonweal urging Catholics to withhold contributions from collection plates. Calling Pope John Paul VI \"unenlightened\", they went on to state that \"the world must quickly come to realize that Pope Paul VI has sanctioned the deaths of countless numbers of human beings....\n They were referring to the Pope's recent encyclical prohibiting artificial birth control. \"Pope denounces birth control as millions starve\", read a typical poster from that era. \n\n \n December 1968 was over 40 years ago. How much do you think science has involved itself in politics in the last 40 years?", 
   {
    "unicode_changes_made": true
   }, 
   356395, 
   null, 
   1244254680.0
  ], 
  [
   356532, 
   null, 
   "MarielB", 
   "Mark's verse: ...\"No reference to materalism there. He was talking about things a child doesn't know, and doesn't need to know, and isn't capable of knowing. Humans aren't capable of understanding what happened billions of years ago.\" \n \n In the passage you quote here, I've heard theologists interpret this to mean the innocence of childhood, and perhaps obedience to God's will. (though children can be quite selfish and materialisticemoticon_smile\n I'm afraid we'll have to disagree on your next statement as well. Adult human beings are certainly capable of understanding what happened, at least some are. Are you saying we should just ignore all the advancements science has made over the years? How would we communicate on these computers? Do you get vaccinations? Take antibiotics? We cannot just dismiss all scientific discoveries because some fear they will interfere with our faith. They have never interfered with mine and I'm certainly not alone in my beliefs. \n Atheists are really not that great in number. Yet there are many scientists, in many fields. \n \n Pamela Winnick's book: \"...established science crusading against religion, pushing atheistic agendas in the classroom, in textbooks, and in the media. This book shows how science has now become a religion of its own-an often fanatical one at that-furiously preaching atheism, ...\"\n Is it possible that Pamela Winnick is trying to support her \"creationist\" agenda? \n Being involved in public education for many years now, I have never witnessed this \"crusade.\" In fact, while in the south for several years, I witnessed exactly the opposite. I have also worked on biology and other textbooks, and find that they state the FACTS and leave the interpretations open for religious discussions. Religious discussion of any kind, does not belong in the science classroom, (yet the \"Intelligent Design\" advocates tried to) and I have never heard teachers \"preaching atheism\" either. \n \n \"...intellectual integrity has been replaced with good old-fashioned greed.\"\n \n Greed is in every field - Wall Street is a case in point. I don't think it's fair to single out scientists in that regard. Besides, the scientists themselves seldom benefit from their own discoveries. The fruits of their labors go to the corporations that sponsor them. They are people too, with families to support, so they deserve compensation for their work, no? \n \n Man's disobedience and his fall from God's grace are far more important in Christianity than details of how life was formed. I would expect a website like songofgenesis to give some details of how evolution goes along with original sin. Was there one fully formed Adam, or were there many fully formed Adams? \n \n Mankind \"sins\" because of free will. Eve eating an apple, is no more significant a story than Pandora opening her box. Evil exists in the world because we choose to ignore our spiritual nature and gratify our every physical desire instead. Besides, there had to have been \"many Adams\" and many \"Eves\" (the Hebrew word for the man is \"\"ha-adam\" - noun, not name), because who would Cain and Seth have married? Where did all the other people come from? and Why is Adam even significant to Christianity?\n I've heard other creationists say Jesus traced his origins back to Adam, and for some reason that is so important. But why? If Adam was indeed the \"first\" and only man, wouldn't we ALL be able to trace our roots back to Adam? So what? That makes no sense. It was important for the Gospels to establish the roots of Jesus back to King David, because the Messiah was promised to come from his descent, but not Adam. \n Jesus is the Messiah because he reconciled our sinful relationship with God through his sacrifice. I don't see how the Garden of Eden story is relevant in the least to that purpose. \n \n In closing, I have faith that at some point, extremist views will find a middle ground. I am not convinced that the scientists have to be the ones to make all the compromises, though when they are furthering advancements for mankind on many levels. However, perhaps if the strictly fundamentalist views could broaden their perspective, and stop \"pushing\" their own agenda in public education, the other side will make allowances as well.  Have scientists become more political in the last 40 years?  Probably so. But I really don't think scientists want to spend their energy debating this when they'd rather be conducting research. \n Meanwhile, parents and churches should continue efforts to show how God's hand can be seen in every new discovery!", 
   {
    "post_info": {
     "post_title": "To Marc9000"
    }, 
    "unicode_changes_made": true
   }, 
   356527, 
   null, 
   1244258580.0
  ], 
  [
   356558, 
   null, 
   "Larni", 
   "Amazon.com: A Jealous God: Science's Crusade Against Religion: Pamela R. Winnick: Books\n \n I can't say I'm too impressed with Winnick. Nor that this book is from Christian Press. Obviously can't cut it in the real world.\n \n \nBut in general, Winnick engages in enough verbal tricks that it's impossible to rely on her analysis.\n\n \n 'The Republican War on Science' by Chris Mooney / 'A Jealous God: Science's Crusade Against Religion' by Pamela Winnick\n \n \nHow much do you think science has involved itself in politics in the last 40 years?\n\n \n Science is a tool used by politicians, just like religion to advance their agenda.\n \n Remember what Marx said.", 
   {}, 
   356527, 
   null, 
   1244290920.0
  ], 
  [
   356559, 
   null, 
   "Accipiter", 
   "It's always interesting to look at websites like www.songofgenesis.org and and try to figure out if they are some person or groups sincere belief, or if they are simply an atheist trick.\n\n Why do you believe that atheists are trying to trick you?", 
   {}, 
   356357, 
   null, 
   1244293680.0
  ], 
  [
   356608, 
   null, 
   "marc9000", 
   "Mark's verse: ...\"No reference to materalism there. He was talking about things a child doesn't know, and doesn't need to know, and isn't capable of knowing. Humans aren't capable of understanding what happened billions of years ago.\" \n \n In the passage you quote here, I've heard theologists interpret this to mean the innocence of childhood, and perhaps obedience to God's will. (though children can be quite selfish and materialisticemoticon_smile\n I'm afraid we'll have to disagree on your next statement as well. Adult human beings are certainly capable of understanding what happened, at least some are. Are you saying we should just ignore all the advancements science has made over the years? How would we communicate on these computers? Do you get vaccinations? Take antibiotics? \n\n \n There seems to be no limit on assigning credit to certain worldviews for modern technology. One atheist poster here told me that we wouldn't be able to purify and distribute drinking water if we weren't certain that the earth was billions of years old. Explorations of the technicalities of these claims aren't really possible at these forums - it usually results in insult fests involving 10 or 15 posters against one, and the research for the one can be enormous. But all technology we have today is the result of working with material that we have in the here and now. \n \n \nWe cannot just dismiss all scientific discoveries because some fear they will interfere with our faith. They have never interfered with mine and I'm certainly not alone in my beliefs. \n\n \n It depends on what you mean by scientific discoveries. Completely unlimited scientific research (embryonic stem cell research, for example) can clash with widely accepted traditional morals. Life is short for all of us, no matter how much humanism/science tries to keep us alive. How much scientific research should be done on borrowed money? Science is never far from politics. \n \n \nAtheists are really not that great in number. Yet there are many scientists, in many fields. \n\n \n But evolution / biology is what we're talking about - it's what your songofgenesis link is all about - life. According to a 1998 survey of members of the National Academy of Sciences (NAS), nearly 95 percent of NAS biologists are atheists or agnostics. Either biology is converting them to atheism, or people with an interest in atheism are taking up biology. It has to be one of the two, doesn't it? Which do you suspect it is? I suspect the latter. \n \n All evolutionists are not atheists, but all atheists are evolutionists. :)\n \n \nPamela Winnick's book: \"...established science crusading against religion, pushing atheistic agendas in the classroom, in textbooks, and in the media. This book shows how science has now become a religion of its own-an often fanatical one at that-furiously preaching atheism, ...\"\n Is it possible that Pamela Winnick is trying to support her \"creationist\" agenda? \n\n \n Of course it is, though she's Jewish, not Christian. But does that make the factual research she did any less valid? It's much easier to document recent political history than it is to document events from millions of years ago. \n \n \n \nBeing involved in public education for many years now, I have never witnessed this \"crusade.\" \n\n \n People tend not to notice things that they're not keeping an eye out for. Did you know about all of those books I listed above, all with copyrights very recent and close to each other? There is an anger, almost a rage in most evolutionists. It's obvious in those book titles, in many posters at these forums who claim to have an education in it, or just about anywhere evolution is discussed. Have you read through some of the threads at this forum? \n \n \nIn fact, while in the south for several years, I witnessed exactly the opposite. I have also worked on biology and other textbooks, and find that they state the FACTS and leave the interpretations open for religious discussions. Religious discussion of any kind, does not belong in the science classroom, (yet the \"Intelligent Design\" advocates tried to) and I have never heard teachers \"preaching atheism\" either. \n\n \n We can't keep relgious discussion out of the science classroom. Example; All it takes is for one student to refer to anything on talkorigins, and religion enters the science classroom, because talkorigins has dozens of pages of creationist (religion) put downs. Creation has been declared not to be science, so any reference to it is a kind of religious discussion. \n \n \n\"...intellectual integrity has been replaced with good old-fashioned greed.\"\n \n Greed is in every field - Wall Street is a case in point. I don't think it's fair to single out scientists in that regard. Besides, the scientists themselves seldom benefit from their own discoveries. The fruits of their labors go to the corporations that sponsor them. They are people too, with families to support, so they deserve compensation for their work, no? \n \n Man's disobedience and his fall from God's grace are far more important in Christianity than details of how life was formed. I would expect a website like songofgenesis to give some details of how evolution goes along with original sin. Was there one fully formed Adam, or were there many fully formed Adams? \n \n Mankind \"sins\" because of free will. Eve eating an apple, is no more significant a story than Pandora opening her box. Evil exists in the world because we choose to ignore our spiritual nature and gratify our every physical desire instead. Besides, there had to have been \"many Adams\" and many \"Eves\" (the Hebrew word for the man is \"\"ha-adam\" - noun, not name), because who would Cain and Seth have married? Where did all the other people come from? and Why is Adam even significant to Christianity? \n\n \n Adam is one of the few people that God spoke directly to. God was directly disobeyed. If you don't believe God spoke directly to Adam, do you believe he spoke directly to Noah, or Moses? His direct speaking to certain people in those times is basic to all that Christianity is. When Genesis is treated as poetry, how can we stop the whole Bible and all of Christianity from being poetry? \n \n \nI've heard other creationists say Jesus traced his origins back to Adam, and for some reason that is so important. But why? If Adam was indeed the \"first\" and only man, wouldn't we ALL be able to trace our roots back to Adam? So what? That makes no sense. It was important for the Gospels to establish the roots of Jesus back to King David, because the Messiah was promised to come from his descent, but not Adam. \n Jesus is the Messiah because he reconciled our sinful relationship with God through his sacrifice. I don't see how the Garden of Eden story is relevant in the least to that purpose. \n\n \n It was the beginning of the sinful relationship. To disregard it changes our sinful relationship with God to something not clearly defined. It makes its severity something open to different interpretations, making it practically meaningless. It waters it down to a harmless evolutionary factor, and that's not what it is. Man is more than a \"higher\" animal. \n \n \nIn closing, I have faith that at some point, extremist views will find a middle ground. I am not convinced that the scientists have to be the ones to make all the compromises, though when they are furthering advancements for mankind on many levels. However, perhaps if the strictly fundamentalist views could broaden their perspective, and stop \"pushing\" their own agenda in public education, the other side will make allowances as well. \n\n \n I haven't noticed the NAS, or any anti-creationist on these forums make a single compromise. \n \n \n Have scientists become more political in the last 40 years?  Probably so. But I really don't think scientists want to spend their energy debating this when they'd rather be conducting research. \n\n \n That's it exactly - they want all morals and religion out of their way, and they won't broaden their perspective to poetry! \n \n \n \n Meanwhile, parents and churches should continue efforts to show how God's hand can be seen in every new discovery!\n\n \n Songofgenesis / theistic evolution is right next to atheism, pure and simple. Darwin made the simple transition from theistic evolution to non-belief, it's an easy step. An objective subject (like science should be) cannot simultaneously show God vividly and show that he does not exist.\n \n (do you know how to use the quote commands, to put another posters quote in the shaded box? Put [/QUOTE] at the end of the text you're quoting, and put [QUOTE] at the beginning.)", 
   {
    "unicode_changes_made": true
   }, 
   356532, 
   null, 
   1244349900.0
  ], 
  [
   356609, 
   null, 
   "marc9000", 
   "Amazon.com: A Jealous God: Science's Crusade Against Religion: Pamela R. Winnick: Books\n \n I can't say I'm too impressed with Winnick. Nor that this book is from Christian Press. Obviously can't cut it in the real world. \n\n \n People read what they want to read. I don't know how well Winnick's book has done. If it hasn't done as well as the atheist books I listed above, atheists are obviously doing a good public relations job. Winnick was briefly featured in the movie \"Expelled\", so obviously a lot of effort has been made in the scientific community to trash her. \n \n \n'The Republican War on Science' by Chris Mooney / 'A Jealous God: Science's Crusade Against Religion' by Pamela Winnick\n\n \n From your link;\n \n \nMore important, as both Mooney and Judge Jones note, science simply cannot prove or disprove the existence of a divine creator; questions of faith exist in a separate sphere from science. \n\n \n One of the ways Stenger may do a good public relations job is by somehow escaping just about ANY attention from the scientific community in VIOLATING the above paragraph, after writing his book \"How Science Shows That God Does Not Exist\". A google of his name show no noticeable reference to his violation in the first two pages.  His profile  on wikipedia shows no reference to any rejection of his book by the scientific community. (Pamela Winnick doesn't have a wikipedia profile) Yet if we look up  Michael Behe's  profile on wikipedia, we see it make a beeline to this statement;\n \n \nBehe's claims about the irreducible complexity of essential cellular structures are roundly rejected by the scientific community. \n\n \n Yet Victor Stenger's rabid atheism is not nearly as roundly rejected by the scientific community. Anyone who wants to can see the dishonesty in the scientific community.", 
   {
    "unicode_changes_made": true
   }, 
   356558, 
   null, 
   1244351160.0
  ], 
  [
   356611, 
   null, 
   "marc9000", 
   "Why do you believe that atheists are trying to trick you?\n\n \n Not necessarily me personally, but anyone who will listen. If they can reduce the book of Genesis to metaphor or poetry, it goes a long way to getting religious morality and tradition completely out of their way, leaving them free to be gods themselves - to \"grow in political and economic stature, gaining [their] own set of constitutional \"rights\" to both research and funding, arrogating to [themselves] alone the power to make morally troublesome decisions.\" (Winnick)", 
   {
    "unicode_changes_made": true
   }, 
   356559, 
   null, 
   1244351340.0
  ], 
  [
   356622, 
   null, 
   "Larni", 
   "People read what they want to read. I don't know how well Winnick's book has done. If it hasn't done as well as the atheist books I listed above, atheists are obviously doing a good public relations job. Winnick was briefly featured in the movie \"Expelled\", so obviously a lot of effort has been made in the scientific community to trash her. \n\n \n The 'good PR' is only apparent because creationism is so intellectually bankrupt and this is why such as ID is a very definite political movement rather than a scientific position.\n \n \nOne of the ways Stenger may do a good public relations job is by somehow escaping just about ANY attention from the scientific community in VIOLATING the above paragraph, after writing his book \"How Science Shows That God Does Not Exist\". A google of his name show no noticeable reference to his violation in the first two pages.\n \n  His profile  on wikipedia shows no reference to any rejection of his book by the scientific community. (Pamela Winnick doesn't have a wikipedia profile) Yet if we look up  Michael Behe's  profile on wikipedia, we see it make a beeline to this statement;\n \n Yet Victor Stenger's rabid atheism is not nearly as roundly rejected by the scientific community. Anyone who wants to can see the dishonesty in the scientific community.\n\n \n Because only fundamentalist creos have an issue with it?", 
   {
    "unicode_changes_made": true
   }, 
   356609, 
   null, 
   1244376180.0
  ], 
  [
   356858, 
   null, 
   "greentwiga", 
   "As a Fundamentalist Christian, if I saw a decent, well supported set of facts supporting Creation Science, I could accept it. I have read enough to reject all their \"evidence.\" One of the attacks on evolutionary science is to attack C14 decay. I have worked with a group that separated tree rings and analyzed each ring. The tree ring chains that allow us to cringsorrect the C14 analysis back for thousands of years are solid. Furthermore, there are similar layer dating systems, ice core, lake core, stalactite rings among others. These help scientists, even other Christian scientists, to verify other radioactive dating systems. Therefore, when the bones are dug up from the earth and are dated millions of years apart, They have substantial nonevolutionary science backing them up. They also show that the layers are not flood layers, laid down in one years time as some of the Creation scientists maintain. Then, when a chain of bones of a family of animals shows up with the dating agreeing with the pattern of changes, the evidence seems substantial. Whether Whales, Horses or dinosaurs to birds, the chains seem clear. Not only that, but continuing research finds more intermediate species just as the evolutionary Anthropologists had predicted. Well, most of the time. Some times the chian proposed is different from the chain later found, but it is still an evolutionary chain. As I said, I am a devout Fundamentalist Christian, but I must face the facts. Even if a facet of the Evolutionary theory is found wrong, the replacement is also a form of evolution. Some believe in steady changes but more and more believe in punctuated evolution. Even if part of the theory was wrong, the theory as a whole is solid. I went and analyzed the book of Genesis. I thought I might find that genesis was poetry like the songingenesis person states. Instead, I found high accuracy. Especially startling was the story of Adam and Eve. When I didn't bring in any traditional interpretations, but let the Bible speak for itself, I found it preserved the exact location of the domestication of wheat. Thus, though science is proving the evolutionary theory more and more solidly, it is also proving the accuracy of Genesis. See Home ?(gardenofeden)?", 
   {}, 
   356622, 
   null, 
   1244533740.0
  ], 
  [
   356860, 
   null, 
   "Larni", 
   "I found it preserved the exact location of the domestication of wheat.\n\n \n Could you substantiate this, please?", 
   {}, 
   356858, 
   null, 
   1244540460.0
  ], 
  [
   356867, 
   null, 
   "Accipiter", 
   "Not necessarily me personally, but anyone who will listen. If they can reduce the book of Genesis to metaphor or poetry, it goes a long way to getting religious morality and tradition completely out of their way, leaving them free to be gods themselves - to \"grow in political and economic stature, gaining [their] own set of constitutional \"rights\" to both research and funding, arrogating to [themselves] alone the power to make morally troublesome decisions.\" (Winnick)\n\n Do you trust your doctor, he is trained in science, is he out to get you too?\n \n I assure you there is no conspiracy of science out to destroy you or your most cherished beliefs, that's a ridiculous notion.\n \n If anything religion is distorting itself by inspiring that kind of crazy thinking.\n \n When people say stuff like that they come across as total nut cases.\n \n What if I said to you that your religion is a massive clandestine plot against me and my most cherished beliefs, would that give me more credibility in your eyes?", 
   {
    "unicode_changes_made": true
   }, 
   356611, 
   null, 
   1244560680.0
  ], 
  [
   356977, 
   null, 
   "marc9000", 
   " Originally posted by marc9000] Yet Victor Stenger's rabid atheism is not nearly as roundly rejected by the scientific community. Anyone who wants to can see the dishonesty in the scientific community. \n\n \n \nBecause only fundamentalist creos have an issue with it? \n\n \n I don't see how it could be, because I've been told by evolutionists here that science is not a democracy. If it's not a democracy concerning what is science and what is not, how can it suddenly become a democracy as some of its prominent members claim the scientific ability to disprove the existance of God? Does the scientific community switch in and out of democracy mode at will?", 
   {
    "unicode_changes_made": true
   }, 
   356867, 
   null, 
   1244598660.0
  ], 
  [
   356985, 
   null, 
   "marc9000", 
   "Do you trust your doctor, he is trained in science, is he out to get you too? \n\n \n Nothing to do with what I was saying, but you already knew that. I'm talking about political activism in organized groups. \n \n \nI assure you there is no conspiracy of science out to destroy you or your most cherished beliefs, that's a ridiculous notion. \n\n \n Me and my most cherished beliefs is not what I'm talking about. \n \n \nIf anything religion is distorting itself by inspiring that kind of crazy thinking.\n \n When people say stuff like that they come across as total nut cases. \n\n \n All the recent historical facts put fourth by Winnick, combine perfectly with what ID proponent Phillip Johnson puts into words so well;\n \n \"Whenever the \"separate realms\" logic surfaces [science=facts, religion=faith] you can be sure that the wording implies that there is a ruling realm (founded on reality) and a subordinate realm (founded on illusions which must be retained for the time being). Retained, that is, merely for the sake of public relations. The scientific elites know they must not press the anti-religious implications of scientific naturalism too explicitly, lest the natives grow restless and rebel. But by employing the fact/value distinction, they can reassure the public of their great respect for religion, while at the same time reducing it to noncognitive, subjective experience that need not be taken seriously in the public realm.\" \n \n \nWhat if I said to you that your religion is a massive clandestine plot against me and my most cherished beliefs, would that give me more credibility in your eyes?\n\n \n It would tell me that you may have read several of the books I listed in post #16 - that seems to be what they're saying. Johnson's above quote was written before most of those books were written. Maybe times are changing concerning scientific respect for religion?", 
   {
    "unicode_changes_made": true
   }, 
   356867, 
   null, 
   1244599860.0
  ], 
  [
   356987, 
   null, 
   "marc9000", 
   "As a Fundamentalist Christian, if I saw a decent, well supported set of facts supporting Creation Science, I could accept it. I have read enough to reject all their \"evidence.\" One of the attacks on evolutionary science is to attack C14 decay. I have worked with a group that separated tree rings and analyzed each ring. The tree ring chains that allow us to cringsorrect the C14 analysis back for thousands of years are solid. Furthermore, there are similar layer dating systems, ice core, lake core, stalactite rings among others. These help scientists, even other Christian scientists, to verify other radioactive dating systems. Therefore, when the bones are dug up from the earth and are dated millions of years apart, They have substantial nonevolutionary science backing them up. They also show that the layers are not flood layers, laid down in one years time as some of the Creation scientists maintain. Then, when a chain of bones of a family of animals shows up with the dating agreeing with the pattern of changes, the evidence seems substantial. Whether Whales, Horses or dinosaurs to birds, the chains seem clear. Not only that, but continuing research finds more intermediate species just as the evolutionary Anthropologists had predicted. Well, most of the time. Some times the chian proposed is different from the chain later found, but it is still an evolutionary chain. As I said, I am a devout Fundamentalist Christian, but I must face the facts. Even if a facet of the Evolutionary theory is found wrong, the replacement is also a form of evolution. Some believe in steady changes but more and more believe in punctuated evolution. Even if part of the theory was wrong, the theory as a whole is solid. I went and analyzed the book of Genesis. I thought I might find that genesis was poetry like the songingenesis person states. Instead, I found high accuracy. Especially startling was the story of Adam and Eve. When I didn't bring in any traditional interpretations, but let the Bible speak for itself, I found it preserved the exact location of the domestication of wheat. Thus, though science is proving the evolutionary theory more and more solidly, it is also proving the accuracy of Genesis.  See Home ?(gardenofeden)?\n\n \n Looking at this list again;\n \n \nDarwin's Dangerous Idea / Daniel Dennett - 1995\n The End of Faith/ Sam Harris - 2004\n The God Delusion/ Richard Dawkins - 2006\n Letter to a Christian Nation/ Sam Harris - 2006\n The Atheist Universe / David Mills - 2006\n Breaking the Spell/ Daniel Dennett - 2006\n Everything you know about God is wrong/ Russ Kick - 2007\n The Quotable Atheist / Jack Huberman - 2007\n The Atheist Bible / Joan Konner - 2007\n Nothing - Something to Believe / Lalli Nica - 2007\n The Portable Atheist / Christopher Hitchens - 2007\n God is Not Great / Christopher Hitchens - 2007\n God - the failed hypothesis - How Science Shows That God Does Not Exist / Victor Stenger - 2007\n 50 Reasons People Give For Believing in God/ Guy Harrison - 2008\n Godless: How an Evangelical Preacher Became One of America's Leading Atheists / Barker/Dawkins - 2008 \n\n \n What do you think motivates the authors of these books? What motivates the people who buy them?", 
   {
    "unicode_changes_made": true
   }, 
   356858, 
   null, 
   1244600160.0
  ], 
  [
   356989, 
   null, 
   "Accipiter", 
   "Nothing to do with what I was saying, but you already knew that. I'm talking about political activism in organized groups. \n \n \n \n Me and my most cherished beliefs is not what I'm talking about. \n \n \n \n All the recent historical facts put fourth by Winnick, combine perfectly with what ID proponent Phillip Johnson puts into words so well;\n \n \"Whenever the \"separate realms\" logic surfaces [science=facts, religion=faith] you can be sure that the wording implies that there is a ruling realm (founded on reality) and a subordinate realm (founded on illusions which must be retained for the time being). Retained, that is, merely for the sake of public relations. The scientific elites know they must not press the anti-religious implications of scientific naturalism too explicitly, lest the natives grow restless and rebel. But by employing the fact/value distinction, they can reassure the public of their great respect for religion, while at the same time reducing it to noncognitive, subjective experience that need not be taken seriously in the public realm.\" \n \n \n \n It would tell me that you may have read several of the books I listed in post #16 - that seems to be what they're saying. Johnson's above quote was written before most of those books were written. Maybe times are changing concerning scientific respect for religion?\n\n \n This guy your talking about has all the credibility of someone who claims to have been abducted by aliens.\n \n You defense is no defense at all.\n \n It is based on flaky peoples interpretation of myth.\n \n You religious people need to realize that quoting bias whack jobs and passages from you book of fairytales is in no way an adequate defense.", 
   {}, 
   356985, 
   null, 
   1244601120.0
  ], 
  [
   357004, 
   null, 
   "greentwiga", 
   "Looking at this list again;\n \n \n \n What do you think motivates the authors of these books? What motivates the people who buy them?\n\n I am sorry marc, I don't understand your point. Just because there are scientists that don't believe in my God doesn't mean that they can't put out solid science that I can use. Just because there are people who have basically the same theology as me doesn't mean that I have to like their evidence that they have collected. I am trained in science and can tell the difference between a scientist pushing his bias and a scientist publishing solid science. I have some objections to the current version of the Big Bang, but that doesn't stop me from looking at the latest research trying to support the theory.", 
   {}, 
   356987, 
   null, 
   1244618460.0
  ], 
  [
   357216, 
   null, 
   "marc9000", 
   "I am sorry marc, I don't understand your point. \n\n \n My point is that I don't understand the lack of debate between theistic evolutionists and atheistic evolutionists. Atheistic evolutionists claim that science shows that God does not exist, and many/most theistic evolutionists claim that science shows God more vividly than the Bible does. They both wink and nod at each other as they both claim additional proof for their conflicting conclusions. \n \n One of the many weaknesses of humans is the inability to see into the future. Human interest, activity, technology, etc always changes over generations/centuries. Those alive in 1800 couldn't dream of what things would be like in 1900, those alive in 1900 couldn't dream of what things would be like in 2000, etc. To me, it's common sense that we can't dream of what things will be like in 2100, and it's also common sense to know that atheists and theistic evolutionists WON'T BE winking and nodding at each other in 2100. Something in that precarious relationship is going to change. If the atheistic evolutionists are cranking out the books at a 15 to 1, or 15 to 0 ratio to the theistic evolutionists, what does that tell us about how things could end up by 2100? Or maybe by 2015 or 2020? \n \n \nJust because there are scientists that don't believe in my God doesn't mean that they can't put out solid science that I can use. \n\n \n Do you think that Michael Behe could put out solid science that you could use? You should be upset that the scientific community, that claims to be an objective, unbiased organization, roundly critisizes scientists like Behe, whose explorations have a possibility of being solid science that you could use, while not roundly critisizing atheists like Victor Stenger, who has an obvious ideological bias. \n \n Why is Behe condemned for having an ideological bias, while Stenger is given a free pass for an ideological bias? As long as the scientific community continues to draw a blank on naturalistic origins, ID cannot be completely ruled out by actual science. It can be ruled out by atheism, but not by science. \n \n \n \nJust because there are people who have basically the same theology as me doesn't mean that I have to like their evidence that they have collected. I am trained in science and can tell the difference between a scientist pushing his bias and a scientist publishing solid science. I have some objections to the current version of the Big Bang, but that doesn't stop me from looking at the latest research trying to support the theory.\n\n \n If you have objections to the current version of Intelligent design, does something stop you from looking at the latest research trying to support the theory? If so, why? It figures that it would stop an atheist, but not someone who believes in an intelligent God, as theistic evolutionists claim to. \n \n You may not like the evidence of those with the same theology as you, and yet you may like the evidence of those who have a different theology as you? I'm not saying that's impossible, but let's look at a statement by one of our resident atheists;\n \n \nYou religious people need to realize that quoting bias whack jobs and passages from you book of fairytales is in no way an adequate defense. \n\n \n Do you wonder why atheists make these statements to creationists and not to theistic evolutionists? Don't the two have more in common than disagreement, with the \"book of fairytales\"? I wonder why theistic evolutionists seldom if ever take issue with them. It's so common that they don't, it makes it clear that there are at least some \"pretend theistic evolutionists\" - those who don the uniform of the enemy to try to downgrade it from the inside. If I was a sincere theistic evolutionist with an interest in the same subject (science) as phonies, one of the most important things to me would be to show a distinction from myself and the phonies. Can you understand why I wonder why I never see any theistic evolutionist do that?", 
   {
    "unicode_changes_made": true
   }, 
   357004, 
   null, 
   1244775780.0
  ], 
  [
   357223, 
   null, 
   "T.Q", 
   "My point is that I don't understand the lack of debate between theistic evolutionists and atheistic evolutionists.\n\n Why should they be debating? Are people not allowed to have different opinions?\n \n \nAtheistic evolutionists claim that science shows that God does not exist,\n\n Which is their opinion\n \n \nand many/most theistic evolutionists claim that science shows God more vividly than the Bible does.\n\n Which is their opinion\n \n \nThey both wink and nod at each other as they both claim additional proof for their conflicting conclusions. \n\n Or they both understand that their differences are a matter of faith and make no real difference to the science under study.\n \n Why do you consider it neccessary for theistic evolutionists to denounce atheists? The fact that you consider all theistic evolutionists liars and frauds is getting really sickening.\n \n snip paranoid ranting\n \n \nDo you think that Michael Behe could put out solid science that you could use?\n\n He hasn't yet.\n \n \nYou should be upset that the scientific community, that claims to be an objective, unbiased organization, roundly critisizes scientists like Behe,\n\n For not producing solid science! FFS Marc, consider what you write before you hit submit\n \n \nwhile not roundly critisizing atheists like Victor Stenger, who has an obvious ideological bias. \n\n It's a pop culture book, not a science text book. It is his opinion. How is it that you always have trouble distinguishing this? \n \n \nWhy is Behe condemned for having an ideological bias\n\n Because he does\n \n \nwhile Stenger is given a free pass for an ideological bias?\n\n No one says he doesn't have an ideological bias. You show me how he's trying to get his book introduced into a classroom as science, and I'll denounce it just as vehemently as I do ID.\n \n \nAs long as the scientific community continues to draw a blank on naturalistic origins, ID cannot be completely ruled out by actual science. It can be ruled out by atheism, but not by science. \n\n So, you're a God of the Gaps kind of guy.\n \n \n \n \n \nIf you have objections to the current version of Intelligent design, does something stop you from looking at the latest research trying to support the theory?\n\n What research?!\n \n \nIf so, why?\n\n There is no research. There are pop books, blog postings, and newsletters. That is not research.\n \n \nIt figures that it would stop an atheist, but not someone who believes in an intelligent God, as theistic evolutionists claim to. \n\n Back to the paranoid conspiracy theories.\n \n \nDo you wonder why atheists make these statements to creationists and not to theistic evolutionists?\n\n I would say it's because theistic evolutionists don't deny reality and try to institute their fantasies into schools.\n \n Aaaaand...snip rest of paranoid conspiracy theory.", 
   {
    "unicode_changes_made": true
   }, 
   357216, 
   null, 
   1244778600.0
  ], 
  [
   357225, 
   null, 
   "obvious_child", 
   "My point is that I don't understand the lack of debate between theistic evolutionists and atheistic evolutionists. Atheistic evolutionists claim that science shows that God does not exist, and many/most theistic evolutionists claim that science shows God more vividly than the Bible does. They both wink and nod at each other as they both claim additional proof for their conflicting conclusions.\n\n \n Incorrect. Their problem is primarily with the issue of God itself. As neither reject the science behind evolution, there is no need for conflict there. And you do see atheists who accept evolution arguing with theists who accept evolution on matters of whether or not a God exists. What you don't see them arguing about is the mechanisms of evolution, where we see people like you and Arch denying evolution without understanding it.", 
   {
    "unicode_changes_made": true
   }, 
   357216, 
   null, 
   1244779320.0
  ], 
  [
   357228, 
   null, 
   "trebor", 
   "My point is that I don't understand the lack of debate between theistic evolutionists and atheistic evolutionists. Atheistic evolutionists claim that science shows that God does not exist, and many/most theistic evolutionists claim that science shows God more vividly than the Bible does. They both wink and nod at each other as they both claim additional proof for their conflicting conclusions. \n \n\n \n No, not quite. This is an argument known as a 'straw man'. There might be some atheists that say it, but at the very best, what could be said is that evolution shows a way that any kind of deity might not be needed. That scares the living pants out of some folks.\n \n I will note your misrepresentation of the points though.", 
   {
    "unicode_changes_made": true
   }, 
   357216, 
   null, 
   1244779980.0
  ], 
  [
   357237, 
   null, 
   "greentwiga", 
   "Most of you have done a good job of answering Marc 9000. When I look at the theory of Evolution, I have no problem. I don't say it is exactly right. In fact, I enjoy the changes as scientists learn more. I also enjoy the debates over different Theories, such as the one over the humanoid fossils. Is X in the direct chain to mankind or just a dead end side chain? I recognize that details of the theory, or even major chunks can change, but still I am comfortable with the science, and the theory. Now, I know that no science can prove that there is no God guiding evolution, and no science can prove that there is a God guiding evolution. Neither should be taught in schools, just the science. I do see Christians teaching interpretations of the Bible, like the world wide flood, which cause many to turn away from God. I also see other Christians trying to mash the Bible to show that Noah's flood was the flooding of the Black Sea. Now the flooding of the Black Sea was an amazing scientific/historic event, but it doesn't fit Noah's flood. I have searched scripture to see what is possible, within the Biblical statements, and then looked to see which of the possibilities fit science. We can't convince anyone that there is a God by these studies. We can only avoid driving people away by unscientific interpretations. That is only possible if there are solid interpretations that also fit science. My study of the Garden lead me to conclude that it described the moment of Domestication. As a followup, it lead me to give up the Creationist teaching and come to peace with evolution, a conclusion I didn't really want to make. Now, I still am convinced that God is involved in the process, but all I would try to convince you is that the Garden was set in a point in history. If you wanted to talk about the existence of God, I would use a completely different strategy. Therefore, I don't believe that teaching Intelligent Design belongs in a scholastic setting.", 
   {}, 
   357228, 
   null, 
   1244790840.0
  ], 
  [
   357241, 
   null, 
   "obvious_child", 
   "marc9000\n \n Do you believe that when lightning strikes, Zeus is the cause? \n \n I suspect not.\n \n So why do you accept Intelligent Design when it the same thing, except replacing lightning with the origin of the eye? \n \n ID is nothing more than repackaged Animism. \n \n Don't know/can't explain = Goddidit.", 
   {}, 
   357004, 
   null, 
   1244802060.0
  ], 
  [
   357251, 
   null, 
   "Archangel", 
   "As a Fundamentalist Christian, if I saw a decent, well supported set of facts supporting Creation Science, I could accept it. I have read enough to reject all their \"evidence.\" One of the attacks on evolutionary science is to attack C14 decay. I have worked with a group that separated tree rings and analyzed each ring. The tree ring chains that allow us to cringsorrect the C14 analysis back for thousands of years are solid. Furthermore, there are similar layer dating systems, ice core, lake core, stalactite rings among others. These help scientists, even other Christian scientists, to verify other radioactive dating systems. \n\n \n The key question to ask greentwiga, is: \"Has the ratio of C-14 to C-12 ever changed from what it is today, and if so, when and by how much?\" If a change or changes took place, a carbon year may not necessarily equal a calendar year. \n \n Radiometric dating and real time may be assumed to be equivalent only if the following criteria are met:\n \n For C-14 dating the conditions are:\n \n 1. The material to be dated must be organic\n 2. The organism to be tested must have gotten its C-14 from the atmosphere\n 3. The sample has remained chemically and physically a closed system since its\n emplacement.\n 4. That we know what the atmospheric concentration of C-14 was when the\n organism lived.\n \n \n Therefore, when the bones are dug up from the earth and are dated millions of years apart, They have substantial nonevolutionary science backing them up. They also show that the layers are not flood layers, laid down in one years time as some of the Creation scientists maintain. Then, when a chain of bones of a family of animals shows up with the dating agreeing with the pattern of changes, the evidence seems substantial. Whether Whales, Horses or dinosaurs to birds, the chains seem clear. Not only that, but continuing research finds more intermediate species just as the evolutionary Anthropologists had predicted. Well, most of the time. Some times the chian proposed is different from the chain later found, but it is still an evolutionary chain. As I said, I am a devout Fundamentalist Christian, but I must face the facts. Even if a facet of the Evolutionary theory is found wrong, the replacement is also a form of evolution. Some believe in steady changes but more and more believe in punctuated evolution. Even if part of the theory was wrong, the theory as a whole is solid. I went and analyzed the book of Genesis. I thought I might find that genesis was poetry like the songingenesis person states. Instead, I found high accuracy. Especially startling was the story of Adam and Eve. When I didn't bring in any traditional interpretations, but let the Bible speak for itself, I found it preserved the exact location of the domestication of wheat. Thus, though science is proving the evolutionary theory more and more solidly, it is also proving the accuracy of Genesis. See Home ?(gardenofeden)?\n\n \n From your first paragraph where you discuss dating objects at thousands of year ages, you then make the giant leap in this next paragraph and extrapolate that to then extend and accept the dating of fossils at millions of years is rational and a naturally correct progression. Nothing could be more fallacious and wrong to make such a leap based on your perceived, yet unproven C-14 Dating methods.\n \n But let me ask you this as one fundamental Christian to another. How do you align the concept of the Genesis Creation story which clearly states that God created the Universe and everything within it in 6 days time which were broken up into 24 hour days, with evolution which claims that man evolved from lower animals over hundreds of millions of years, if not billions of years if we consider the alleged appearance of original life on Earth according to evolution hypothesis? \n \n What does the evolution account do to the Genesis accounts introduction of sin into the world by way of A&Es fall from grace, and Mans need for reconciliation to God because they disobeyed God, and ate of the fruit from the tree of the knowledge of good and evil? \n \n Don't you agree that if evolution is true then there is no need for God or the need for Mans redemption as outlined in the bible? The whole bible is about mans need for reconciliation to God due to our initial rebellion by disobeying His very clear warning that the day that we ate of that tree we would surely die through A&E. And because of that, the need for Jesus plan for salvation became a spiritual necessity. Can't you see that according to evolution, none of this is necessary?\n \n http://www.specialtyinterests.net/carbon14.html", 
   {}, 
   356858, 
   null, 
   1244814420.0
  ], 
  [
   357253, 
   null, 
   "RealWorld", 
   "Archangel,\n \n The fact that that a literal reading of the bible conflicts with reality leads to the conclusion that the bible is in error, since reality is real!\n \n If that throws doubt on ideas such as original sin, one should reconsider those ideas, especially as they are obviously merely dishonest tactics whereby priests and such gain power over people.", 
   {
    "post_info": {
     "post_title": "Wrong end of the stick"
    }
   }, 
   357251, 
   null, 
   1244816760.0
  ], 
  [
   357265, 
   null, 
   "Archangel", 
   "Archangel,\n \n The fact that that a literal reading of the bible conflicts with reality leads to the conclusion that the bible is in error, since reality is real!\n \n If that throws doubt on ideas such as original sin, one should reconsider those ideas, especially as they are obviously merely dishonest tactics whereby priests and such gain power over people.\n\n \n The literal reading of the bible doesn't conflict with reality in any way, it reflects it. The interpretation of the available observable evidence as perceived by secular humanists through evolutionary science is what conflicts with reality.", 
   {}, 
   357253, 
   null, 
   1244832180.0
  ], 
  [
   357270, 
   null, 
   "Accipiter", 
   "The literal reading of the bible doesn't conflict with reality in any way, it reflects it. The interpretation of the available observable evidence as perceived by secular humanists through evolutionary science is what conflicts with reality.\n\n You keep submitting links that are connected to religion in some way as facts to back up your argument.\n \n That ain't going to fly around here unless you goal is comedy.\n \n Can't you find any stuff not linked to religion in some way that supports your argument?", 
   {
    "unicode_changes_made": true
   }, 
   357265, 
   null, 
   1244836200.0
  ], 
  [
   357300, 
   null, 
   "marc9000", 
   "Most of you have done a good job of answering Marc 9000. \n\n \n I was afraid of that. All you saw in those posts was \"answers\"? :)\n \n \nWhen I look at the theory of Evolution, I have no problem. I don't say it is exactly right. In fact, I enjoy the changes as scientists learn more. I also enjoy the debates over different Theories, such as the one over the humanoid fossils. Is X in the direct chain to mankind or just a dead end side chain? I recognize that details of the theory, or even major chunks can change, but still I am comfortable with the science, and the theory. Now, I know that no science can prove that there is no God guiding evolution, and no science can prove that there is a God guiding evolution. Neither should be taught in schools, just the science. \n\n \n \n This could possibly go along with one of the rage sputterers questions;\n \n \nWhy do you consider it neccessary for theistic evolutionists to denounce atheists? \n\n \n Because statistics show that roughly 95% of biologists are atheists, so there's no question that they believe that life arose from some godless way, most of them believe they can repeat it, most of them try it or want to try it, and most of them want the public to fund it. They've been trying it since Darwin's time, and particularly in recent decades, they have been going backwards, as they discover the amazing complexity in the simplest forms of life. Naturally, creationists don't believe they're ever going to be able to do it, and any non-phony theistic evolutionist should also believe that, if they proclaim that God started the process of evolution. So how much more time should theistic evolutionists give atheists to perform their godless searches, while calling these searches legitimate neutral science? I think their time should be about up, unless they do it with their own money & time, like ID proponents are doing now. \n \n \nI do see Christians teaching interpretations of the Bible, like the world wide flood, which cause many to turn away from God. \n\n \n Why would they do that? Because atheists rant that there was no flood with a louder voice? \n \n \nI also see other Christians trying to mash the Bible to show that Noah's flood was the flooding of the Black Sea. Now the flooding of the Black Sea was an amazing scientific/historic event, but it doesn't fit Noah's flood. I have searched scripture to see what is possible, within the Biblical statements, and then looked to see which of the possibilities fit science. We can't convince anyone that there is a God by these studies. We can only avoid driving people away by unscientific interpretations. That is only possible if there are solid interpretations that also fit science. My study of the Garden lead me to conclude that it described the moment of Domestication. As a followup, it lead me to give up the Creationist teaching and come to peace with evolution, a conclusion I didn't really want to make. \n\n \n It's going to happen every time you make an imperfect human study an ultimate standard, a measuring point, and then subject the Bible to that standard. \n \n \nNow, I still am convinced that God is involved in the process, but all I would try to convince you is that the Garden was set in a point in history. If you wanted to talk about the existence of God, I would use a completely different strategy. Therefore, I don't believe that teaching Intelligent Design belongs in a scholastic setting.\n\n \n If \"science shows that God does not exist\" what other strategy would their be? As Phillip Johnson said, science seeks to be the ruling realm, while reducing religion to a subjective realm. What other realm could there be, that could compete with science? \n \n If you believe God was involved in the process, how can you deny that he was intelligent? Do you automatically disregard anything Behe or Dembski write just because atheists tell you to? It makes sense that atheists are going to immediately disregard anything they say, because they don't believe there is any supernatural intelligence. Shouldn't there be a difference in openness towards ID from theistic evolutionists, than from atheists? \n \n \n\n Why should they be debating? Are people not allowed to have different opinions?\n Which is their opinion\n Which is their opinion\n\n \n Gt, why do you suppose atheists fly into a rage when I express my opinion? They'll say it's because my opinion is stupid, while we watch one say; \"science shows that God does not exist\", and the other answers \"I study science too, and I like how it shows God more vividly than ever before! You're cool, let's go have a beer! And ~I'm~ the stupid one?", 
   {
    "unicode_changes_made": true
   }, 
   357237, 
   null, 
   1244849520.0
  ], 
  [
   357324, 
   null, 
   "obvious_child", 
   "The literal reading of the bible doesn't conflict with reality in any way, it reflects it. The interpretation of the available observable evidence as perceived by secular humanists through evolutionary science is what conflicts with reality.\n\n \n \n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12257-tower-babel-other-contridictions-genesis.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12630-yec-oil-fields.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12025-if-literal-creationism-true.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11843-commercial-products-creationism.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10863-creationists-science-modern-world.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11128-late-carboniferous-athropods-literal-creationism.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10828-niformitarianism-age-creationists-earth.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8816-literal-flood-scientifically-possible.html\n \n And that's just here.", 
   {}, 
   357265, 
   null, 
   1244866620.0
  ], 
  [
   357325, 
   null, 
   "obvious_child", 
   "I was afraid of that. All you saw in those posts was \"answers\"? :)\n\n \n That doesn't mean much coming from a person who has shown a complete lack of any understanding of the terms in question. \n \n \nBecause statistics show that roughly 95% of biologists are atheists, so there's no question that they believe that life arose from some godless way, most of them believe they can repeat it, most of them try it or want to try it, and most of them want the public to fund it.\n\n \n Come again? That poll was done on the National Academy of Sciences biologists. I wasn't aware that all biologists in the world belonged to that. Care to provide information regarding such a statement? Furthermore, that was in 1998. Your data is more than 10 years old. And the rest of your argument is nothing more than conspiracy theory. \n \n \nWhy would they do that? Because atheists rant that there was no flood with a louder voice? \n\n \n No, because the flood makes absolutely no sense whatsoever. \n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8816-literal-flood-scientifically-possible.html\n \n \nIt's going to happen every time you make an imperfect human study an ultimate standard, a measuring point, and then subject the Bible to that standard. \n\n \n Do you realize you just proposed a double standard? \n \n \nGt, why do you suppose atheists fly into a rage when I express my opinion?\n\n \n Rage? Come again? Your opinion is baseless and ignorant. Does that mean we are angry? No. Mostly we have significant pity on you, as you believe something so detached from reality and yet cannot make the connection to how it makes your life a contradiction. It's a crying shame you never went to college or had a decent high school education. \n \n \nThey'll say it's because my opinion is stupid, while we watch one say; \"science shows that God does not exist\", and the other answers \"I study science too, and I like how it shows God more vividly than ever before! You're cool, let's go have a beer! And ~I'm~ the stupid one?\n\n \n Where has anyone here said that?", 
   {
    "unicode_changes_made": true
   }, 
   357300, 
   null, 
   1244867100.0
  ], 
  [
   357338, 
   null, 
   "RealWorld", 
   "The literal reading of the bible doesn't conflict with reality in any way, it reflects it. The interpretation of the available observable evidence as perceived by secular humanists through evolutionary science is what conflicts with reality.\n\n \n Come now, you know very well that that is untrue.\n \n You are clearly the victim of an enormous scam. A scam so pernicious that even some of its perpetrators don't realize it is a scam. The pews and the collection plates are full, but the minds are empty.", 
   {}, 
   357265, 
   null, 
   1244902680.0
  ], 
  [
   357339, 
   null, 
   "Archangel", 
   "\n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12257-tower-babel-other-contridictions-genesis.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12630-yec-oil-fields.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12025-if-literal-creationism-true.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11843-commercial-products-creationism.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10863-creationists-science-modern-world.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/11128-late-carboniferous-athropods-literal-creationism.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/10828-niformitarianism-age-creationists-earth.html\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8816-literal-flood-scientifically-possible.html\n \n And that's just here.\n\n \n From the first link, thanks for reminding me of evidence I have already posted which also answers our new friend RealWorld's denials below. Here it is:\n \n obvious_child \n Tower of Babel and other contridictions of Genesis\n If the flood killed all life aside from Noah, where did the many full grown adults come from to build the Tower of Babel so quickly after the flood?\n\n \n The link below gives an accurate timeline based on archaeological evidence which allows for plenty of time to repopulate the area.\n \n \nSimilarly, if David slew Goliath who is proclaimed to be from a line of Giants, how was Goliath born if all of the giants died during the flood?\n\n \n Where does it say that Goliath was a pre flood giant? Not in the bible.\n 17:4 And there went out a champion out of the camp of the Philistines, named Goliath, of Gath, whose height [was] six cubits and a span.\n \n 17:5 And [he had] an helmet of brass upon his head, and he [was] armed with a coat of mail; and the weight of the coat [was] five thousand shekels of brass.\n \n 17:6 And [he had] greaves of brass upon his legs, and a target of brass between his shoulders.\n \n 17:7 And the staff of his spear [was] like a weaver's beam; and his spear's head [weighed] six hundred shekels of iron: and one bearing a shield went before him.\n \n 17:8 And he stood and cried unto the armies of Israel, and said unto them, Why are ye come out to set [your] battle in array? [am] not I a Philistine, and ye servants to Saul? choose you a man for you, and let him come down to me.\n \n 17:9 If he be able to fight with me, and to kill me, then will we be your servants: but if I prevail against him, and kill him, then shall ye be our servants, and serve us.\n \n 17:10 And the Philistine said, I defy the armies of Israel this day; give me a man, that we may fight together.\n \n How did the Egyptian Empire become so powerful so soon after all non-ark humans were allegedly wiped out? \n \n Care to shed some light on basic problems with the Biblical flood timeline?\n\n \n Here's how a biblical calendar of history explains it: The bolded at the bottom summarizes the evidence.\n Noah born 5590 B.C.\n Flood 4990-4989 B.C.\n Arpachshad&#8217;s generation 4488-4050 B.C.\n Shelah&#8217;s generation 4050-3617 B.C.\n Eber&#8217;s generation 3617-3153 B.C.\n Peleg&#8217;s generation 3153-2914 B.C.\n Reu&#8217;s generation 2914-2675 B.C.\n Serug&#8217;s generation 2675-2445 B.C.\n Nahor&#8217;s generation 2445-2297 B.C.\n Terah born 2297 B.C.\n Abram born 2167 B.C.\n Isaac born 2068 B.C.\n Jacob born 2007 B.C.\n The Biblical Calendar of History\n PAGE 7\n Entrance into Egypt 1877 B.C.\n Exodus 1447 B.C.\n Foundation of temple laid 967 B.C.\n Division of kingdom 931 B.C.\n \n The First Civilization \n \n The development of a Biblical chronology beginning with Adam is interesting, but will it hold up when compared with the known facts of secular history? To ascertain this, the earliest civilization of antiquity will be examined to determine its localization and the time of its emergence.\n \n The threshold of history appears to be located in the area of the present-day nation of Iraq. Albright writes:\n \n Archaeological research has established that there is no focus of civilization in the earth that can begin to compete in antiquity and activity with the basin of the Eastern Mediterranean and the region immediately to the east of it . . . The Obeidan is the earliest clearly defined culture of Babylonia, where we find its remains underlying nearly all the oldest cities of the country, such as Ur, Erech, Lagash, Eridu, etc. This proves that the occupation of the marshlands of Babylonia by human settlers cam rather late in history of the irrigation culture, probably not far from 3700 B.C.\n \n Thus, the archaeological evidence shows that the location of the first civilization after the flood was in the Mesopotamia Valley, and this agrees exactly with the Bible, for it reports the first cities were Babylon, Erech, Nineveh, etc. (Gen. 10:10-11).\n The date 3700 B.C. suggested by Albright is apparently satisfactory to most archeologists. M.B. Rowton writes that in Uruk, one of the most ancient Mesopotamia sites, the earliest level of monumental buildings is that of the level know as Uruk V. He concludes,10 \"the beginning of Uruk V can plausibly be dated 3500 B.C.\" The date 3500 or 3700 B.C. are estimates arrived at by starting at a more clearly defined historical point and allowing a reasonable period of time for each level of occupation prior to this. Thus, the archaeological evidence appears to indicate that prior to about 3700 B.C., there was no substantial culture anywhere in the world. About 3700-3500 B.C. the first great civilization began to\n The Biblical Calendar of History\n PAGE 8\n be formed in the plains of Sumer in the land of Babylon, Erech, Ur, etc.\n How does this time compare with the Biblical chronology? In Genesis 10 the notice is given that the first building activity after the flood is that of Nimrod, the beginning of whose kingdom was Babel, Erech, and Accad, all of them in the land of Shinar (Gen 10:10). When did Nimrod come upon the scene? His genealogical descent is that of Noah, Ham, Cush, Nimrod (Gen. 10:1, 6, 8). The Bible offers no timetable for this side of the family tree, but it does offer precise information regarding the genealogical statements of the Bible, it might be noted that very often two branches of the tree are offered. One is that of the descendants leading eventually to Christ and about which precise timetables are given, as we have seen. The second is the genealogical descent of that side of the family which turned away from God. It can be shown that the timetable of these two lines run roughly parallel.\n It may be assumed that Ham and Shem were contemporaries (they obviously were, inasmuch as they were brothers), that Arpachshad and Cush were nearly contemporaries, and that Shelah and Nimrod were probably men of the same period of history. Thus, if Shelah&#8217;s date is known, it may be surmised that Nimrod&#8217;s was close to the same date.\n Shelah&#8217;s date by Biblical reckoning was 4050 B.C. to 3617 B.C. Nimrod must have lived about this time. Thus, the Bible suggests a date of about 3900 B.C. to 3617 B.C. for the founding of the great cities of the Mesopotamia Valley. The date suggested by the evidence of archaeology (3700-3500 B.C.) accords very well with the Biblical statement.\n It is more than passing interest in this connection that the name \"Nimrod\" has left its mark on the Mesopotamia Valley. The great archaeologist George Rawlinson writes:12\n The remarkable ruin generally called Ahkerhuf, which lies a little to the southwest of Baghdad, is known to many as the \"Tel-Nimrod;\" the great dam across the Tigris below Mosul is the \"Suhr-el-Nimrud;\" one of the chief of the buried cities in the same neighborhood is called \"Nimrud\" simply; and the name of \"Birs-Nimrud\" attaches to the grandest mass of ruins in the lower country.\n \n The Confusion of Tongues \n \n The Biblical Calendar of History\n PAGE 9\n \n Another piece of history that should be interesting to investigate is the Tower of Babel. Is there any secular evidence that relates to the account of the confusion of tongues as set forth in Genesis 11? There is, indeed.\n The Genesis 11 account indicates that prior to this time in history, all men spoke one language. Moreover, the leading civilization was that of the people who dwelt in the plains of Shinar or Sumer. Their desire to be the one great civilization of the world prompted the building of the tower, which in turn brought God&#8217;s interference with their plans so that they were forced to separate into various nations.\n As has already been shown, the first great civilization of the world as revealed by secular evidence was that which sprang forth in the Mesopotamia Valley. The time of the beginning of the second important civilization of antiquity could be of real significance. Presumably, it would have begun shortly after the Tower of Babel. The events concerning the Tower of Babel are known to have occurred during the generation of Peleg, for in his days the earth was divided (Gen. 10:25). Peleg&#8217;s generation was from 3153 B.C. to 2914 B.C. Therefore, one would expect no important civilizations other than Babylonia to have an antiquity greater than about 3150 B.C.\n \n Egypt Becomes a Great Civilization\n \n All archaeological evidence points to Egypt as the second great civilization to appear. While there was a primitive culture in Egypt prior to the First Dynasty, the uniting of all of Egypt under the Pharaoh Menes to form the First Dynasty was the signal for a major burst in the arts of civilization. Albright writes:13\n \n It is now certain that the level of Egyptian culture remained considerably below that of Mesopotamia until the first Dynasty, when under strong indirect influence from the Euphrates Valley, it forged ahead of the latter in a breathtaking spurt.\n \n Interestingly, the new civilization of Egypt beginning with the First Dynasty was patterned after the Babylonian (Mesopotamian) culture. Albright continues:14\n \n The close of the Predynastic Age and the beginning of the Thinite (period of first two centuries) Period witnessed a sudden burst in the arts of civilization. This seems to have been connected in some way with an increase of cultural influence from Asia, since\n \n The Biblical Calendar of History\n PAGE 10\n there are numerous exact parallels between Mesopotamia and Egyptian culture at this time, the former being demonstrably older and more original in nearly every instance.\n \n The date of the beginning of the First Dynasty under Menes is calculated to be somewhere between 2800 B.C. and 3100 B.C. The early archaeologists such as Breasted dated his reign at about 3400 B.C. As new archaeological evidence was uncovered, this date was moved forward to about 3000 B.C. Albright believe 2850 B.C. is a good estimate.15 William C. Hayes suggests 3100 B.C. is the best date presently available.16\n Considering the above information, one is struck by the fact that prior to about 3100 B.C. to 2850 B.C., only one civilization of consequence existed in the world. That was the nation of Babylonia on the plains of Shinar. Then at that time, in a sudden burst of progress, Egypt grew to become a second great civilization, a civilization patterned after the first. These dates are in almost exact agreement with the Biblical date for the Tower of Babel. Surely the confusion of tongues as recorded in Genesis 11 sent thousands of people skilled in all the arts and crafts of Mesopotamia to Egypt and elsewhere. Thus, accord can be seen between the sacred and the secular records by this indirect evidence of the timetable of the civilizations of antiquity.\n \n Writing and the Tower of Babel\n \n It might be noted that writing had its beginning in Mesopotamia and may be related to the confusion of tongues. Sir Leonard Wooley writes:17\n \n All the archaeological evidence seems to prove that true writing was first developed in southern Mesopotamia.\n \n The timing for this event is given as 3500 B.C. to 3000 B.C. Gelb concludes:18\n \n The date of the earliest Sumerian writing should be set tentatively at about 3100 B.C.\n \n The confusion of tongues in Sumer some time in the period between 3150-2900 B.C. could have been the catalyst that produced writing. Before this dramatic civilization-splitting event, all was secure. Only one language was spoken in all the world. Verbal communication was ad-\n The Biblical Calendar of History\n PAGE 11\n equate and dependable. But then came the fearful event that shook the very foundations of this great civilization; and men could no longer understand each other. They wanted to find a better way. The application of the spoken word to clay tablets would provide insurance that this kind of happening would never again totally destroy a culture. The clay tablets would prove to be a reference point. One surely can see the possibility if not the probability of this connection between writing and the Tower of Babel.\n \n Conclusion\n \n Thus, we see that the chronology of history established by Biblical reckoning agrees rather satisfactorily with the archaeological evidence of the earliest civilizations. The Biblical timetable is, of course, the most reliable, for it is God&#8217;s Word. If we have properly interpreted it, it should make possible a far more definitive analysis of the secular evidence than ever before. It should also provide a dependable framework in which to understand dating evidence such as that offered by radiometric isotopes like carbon 14.\n Hopefully, a perspective of history has been set forth that shows that answers are potentially forthcoming when we begin with the Biblical framework. The concept of a 13,000-year-old world, which began to be repopulated after the flood some 7,000 years ago, and which 1,500 years later had grown to a point that allowed the spawning of the first great cities, surely makes much more sense than the idea that mankind has been around for hundreds or even thousands of millenniums, and then became a cohesive city civilization only in the last 5,500 years. Furthermore, the apparent possibility of the end of the age occurring in our time also accords far better with the shorter timetable.The Biblical Calendar of History\n \n \nCome now, you know very well that that is untrue.\n \n You are clearly the victim of an enormous scam. A scam so pernicious that even some of its perpetrators don't realize it is a scam. The pews and the collection plates are full, but the minds are empty.\n\n \n The only victims around here my friend, are those who are blind to the spiritual aspects of who and what we are as human beings who were created in Gods image for fellowship. \n \n For example, have any of your real world studies in archeology actually disproved what the bible records as historical facts? Do you have the courage and integrity, unlike the other deniers here to actually research what secular archeology has found in confirming what the bible says happened, and when? \n \n If so, then we have something to discuss. But if you are just going to make unfounded blanket statements based on lies you have been told but can't prove or support absolutely, then we have nothing tangible to actually discuss, do we? That's up to you now.", 
   {}, 
   357338, 
   null, 
   1244906700.0
  ], 
  [
   357340, 
   null, 
   "Penfold", 
   "\" But if you are just going to make unfounded blanket statements based on lies you have been told but can't prove or support absolutely, then we have nothing tangible to actually discuss, do we? \"\n \n The Bible in a sentence.", 
   {}, 
   357339, 
   null, 
   1244907420.0
  ], 
  [
   357341, 
   null, 
   "marc9000", 
   "That doesn't mean much coming from a person who has shown a complete lack of any understanding of the terms in question. \n\n \n Doesn't matter who it comes from, it's a fact that there were more in those posts than answers. There were insults, and questions, most of them stupid questions. One term I understand is Christianity, and another is purpose. I hope to get into the term \"purpose\" with greentwiga when/if he comes back. \n \n \nCome again? That poll was done on the National Academy of Sciences biologists. I wasn't aware that all biologists in the world belonged to that. Care to provide information regarding such a statement? Furthermore, that was in 1998. Your data is more than 10 years old. \n\n \n So you have evidence that biologists have made a drastic switch to Christianity in the last 10 years? That poll is a good measuring stick for all of biology, recent past and present, and you know it. It's clear that their beliefs are not consistant with those of the general public. Why that is, is another debate. \n \n \nAnd the rest of your argument is nothing more than conspiracy theory. \n\n \n Those who shriek that ID is a conspiracy theory don't have a lot of room to accuse others of conspiracy theories. \n \n \nNo, because the flood makes absolutely no sense whatsoever. \n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/8816-literal-flood-scientifically-possible.html\n\n \n Not to an atheist - not to one who uses science as the only standard for determining what reality is. Not everyone is like that. \n \n \nDo you realize you just proposed a double standard? \n\n \n Uh no, because I didn't. I just showed that different people have different ultimate standards for judging what the truth is. \n \n \nRage? Come again? Your opinion is baseless and ignorant. Does that mean we are angry? No. Mostly we have significant pity on you, as you believe something so detached from reality and yet cannot make the connection to how it makes your life a contradiction. It's a crying shame you never went to college or had a decent high school education. \n\n \n If you're one of those people that assigns value on human lives according to their education, one of the best things for you to do would be to get your spelling, sentence structure and general English usage up to at least a high school level on these forums. emoticon_rolleyes\n \n \nWhere has anyone here said that?\n\n \n It's all over the scientific community - it starts with authors Kenneth Miller and Richard Dawkins, and branches out all over the place from there.", 
   {
    "unicode_changes_made": true
   }, 
   357325, 
   null, 
   1244907660.0
  ], 
  [
   357343, 
   null, 
   "Larni", 
   "It&#8217;s clear that their beliefs are not consistant with those of the general public. Why that is, is another debate.\n\n \n Because to become a biologist you have to study and learn what that biology is not faith in a supernatural entity?\n \n \nThose who shriek that ID is a conspiracy theory don&#8217;t have a lot of room to accuse others of conspiracy theories. \n\n \n The only way that ID is a conspiracy would be if ID proponents had a political agenda...oh wait, they do.\n \n \n Not to an atheist &#8211; not to one who uses science as the only standard for determining what reality is. Not everyone is like that. \n\n \n You are correct. Not every one is scientist. But in terms of science, they are the ones who count; certainly not faith driven pseudo scientists such as ID proponents.\n \n \n I just showed that different people have different ultimate standards for judging what the truth is. \n\n \n That's the problem here. You are essentially saying that science is not the only way to assess reality. But alternative ways of assessing reality are useless at making any real predictions. An example is how the idea that plants and animals were created at more or less the same time (geologically speaking). We would expect to find dinosaur bones in the same strata as pollen: we don't find this. We find that they are very separate; as predicted by the scientific model.\n \n \n If you&#8217;re one of those people that assigns value on human lives according to their education, \n\n \n I think the point is that one needs to understand the subject at hand before one can make meaningful comments. If anyone tried to tell me about cognitive theory (my field) but did not have a recognised qualification I would not be inclined to put much store in what the fellow said if it was at odds with what I knew. That does not mean I'm assigning value to him/her, just his her opinion.\n \n \n It&#8217;s all over the scientific community &#8211; it starts with authors Kenneth Miller and Richard Dawkins, and branches out all over the place from there. \n\n \n Often the case, but does that make it wrong? The delivery may be rude and combative and this does not make for a good debate, but the message should not be ignored because of this (not that I particularly agree with some of what Darkins comes out with).", 
   {}, 
   357341, 
   null, 
   1244909880.0
  ], 
  [
   357348, 
   null, 
   "greentwiga", 
   "The problem is that science is concerned with methodological naturalism. Atheists, Agnostics, and Christians all can use this method. Hard line Atheists that use metaphysical relativism and Christians that insist on ID both leave the neutral area of methodological Naturalism (see Wikipedia.) This method treats science as if all is done by natural forces, but says nothing about there being no God or there being a God. Either one of the other two groups is free to pursue their concept and try to prove it to the rest of us, but until they do, and they haven't proven a thing yet, they should not force their ideas on the rest.", 
   {}, 
   357343, 
   null, 
   1244917560.0
  ], 
  [
   357355, 
   null, 
   "Accipiter", 
   "The problem is that science is concerned with methodological naturalism. Atheists, Agnostics, and Christians all can use this method. Hard line Atheists that use metaphysical relativism and Christians that insist on ID both leave the neutral area of methodological Naturalism (see Wikipedia.) This method treats science as if all is done by natural forces, but says nothing about there being no God or there being a God. Either one of the other two groups is free to pursue their concept and try to prove it to the rest of us, but until they do, and they haven't proven a thing yet, they should not force their ideas on the rest.\n\n \n Science is not trying to disprove god nor does it want to.\n \n Science has no interest in proving there is or is not a god or what ever fairytale you happen to believe in.\n \n It&#8217;s the religious who step up to foolishly to do battle.\n \n I am wondering, do you have a dog?", 
   {}, 
   357348, 
   null, 
   1244922960.0
  ], 
  [
   357369, 
   null, 
   "obvious_child", 
   ".Where does it say that Goliath was a pre flood giant? Not in the bible.\n\n \n LOL.\n \n You never learn do you? \n \n You got rightly slammed for misreading that thread the first them and THEN YOU GO AND DO THE EXACT SAME THING!!!!\n \n No one said Goliath was a pre-flood giant. The Bible says that Goliath was descended from the Giants. But only Noah and his family survived. So that makes absolutely no sense. \n \n Good job on proving you can't read properly.", 
   {}, 
   357339, 
   null, 
   1244935260.0
  ], 
  [
   357371, 
   null, 
   "obvious_child", 
   "Doesn't matter who it comes from, it's a fact that there were more in those posts than answers. There were insults, and questions, most of them stupid questions. One term I understand is Christianity, and another is purpose. I hope to get into the term \"purpose\" with greentwiga when/if he comes back.\n\n \n Do you know why you get insulted? \n \n Tell me, what do you think of a person who calls physics wrong and does not understand what \"force\" is? \n \n What do you think of someone who calls geology wrong but doesn't know what a rock is? \n \n Do you think that someone who calls genetics false but cannot define what a gene is to understand the subject? \n \n You call evolution wrong, but have repeatedly shown you have absolutely no idea what it is.\n \n \nSo you have evidence that biologists have made a drastic switch to Christianity in the last 10 years? That poll is a good measuring stick for all of biology, recent past and present, and you know it.\n\n \n No it's not. All it is, is a measure of one group. And that group in total is only 2,100 members. There are 800 steves on the steve list with 51% being biologists. Are you seriously going to tell me that the NAS represents all biologists beliefs when the biologists belonging to the NAS are statistically tiny in comparison to all biologists? \n \n Let's see just how asinine your response will be. \n \n \nIt's clear that their beliefs are not consistant with those of the general public. Why that is, is another debate.\n\n \n It is when you compare them to the general public stratified by education. Gallup did a poll on that around the same time. Hint: the more poor you are and the less educated, the more you believe in Creationism. \n \n \nThose who shriek that ID is a conspiracy theory don't have a lot of room to accuse others of conspiracy theories. \n\n \n Who called ID a conspiracy theory? Lying again eh Marc? \n \n ID as I pointed out is nothing more than animism. I see you refused to answer my question about Zeus. Tell me, how is ID fundamentally any different from Animism? What we cannot explain now is credited to a higher being. Replace lightning with eye and the argument is still the same. \n \n \nNot to an atheist - not to one who uses science as the only standard for determining what reality is. Not everyone is like that.\n\n \n So what do you use to determine reality? If God said there were two suns, would you use your eyes and testable methods to determine if there were two suns or just believe God independent of the actual facts? \n \n God said pigs can fly! Therefore, reality has flying pigs. emoticon_xgood\n \n \nUh no, because I didn't. I just showed that different people have different ultimate standards for judging what the truth is.\n\n \n And some people are wrong. \n \n \nIf you're one of those people that assigns value on human lives according to their education, one of the best things for you to do would be to get your spelling, sentence structure and general English usage up to at least a high school level on these forums. emoticon_rolleyes\n\n \n That was weak and you know it. Your critical thinking skills and basic knowledge are severely stunted. And that is likely due to lack of decent education. Simple fact of the matter is that you think you can discuss evolution without a slightest understanding of it. It's like calling physics all wrong without understanding what a force is. It's like calling genetics wrong without understanding what a gene is. It's like calling geology wrong but not knowing what a rock is. You don't understand, but your lack of education has prevented you from making the connection that sheer unbridled ignorance creates problems when one declared a subject they do not understand to be false. \n \n \nIt's all over the scientific community - it starts with authors Kenneth Miller and Richard Dawkins, and branches out all over the place from there.\n\n \n Start citing.", 
   {
    "unicode_changes_made": true
   }, 
   357341, 
   null, 
   1244935920.0
  ], 
  [
   357389, 
   null, 
   "marc9000", 
   "Because to become a biologist you have to study and learn what that biology is not faith in a supernatural entity? \n\n \n It's always claimed that science cannot prove nor disprove the existance of God. Studies in biology should stop before that happens, shouldn't it? Some imperfect human interference must be happening. \n \n \nThe only way that ID is a conspiracy would be if ID proponents had a political agenda...oh wait, they do. \n\n \n And atheism doesn't have a political agenda? You know it does. So we can agree that they both do. It would be nice if I could point out factual evidence of political action of atheism without another stronger, mocking term like \"conspiracy theory\" being used against me. It's a form of emotional shout-down, not honest debate. \n \n \nYou are correct. Not every one is scientist. But in terms of science, they are the ones who count; certainly not faith driven pseudo scientists such as ID proponents. \n\n \n In terms of science they are, but in terms of philosophical applications of science, they are not. \n \n \nThat's the problem here. You are essentially saying that science is not the only way to assess reality. But alternative ways of assessing reality are useless at making any real predictions. \n\n \n Surely you're kidding. We can make predictions about many things, most notably human behavior, by consulting subjects other than science. Unrevised history is a good one, some people believe a recognition of supernatural good & evil is another. \n \n \nI think the point is that one needs to understand the subject at hand before one can make meaningful comments. If anyone tried to tell me about cognitive theory (my field) but did not have a recognised qualification I would not be inclined to put much store in what the fellow said if it was at odds with what I knew. That does not mean I'm assigning value to him/her, just his her opinion. \n\n \n What we're doing here is discussing the APPLICATION of a subject, not necessarily the nuts and bolts of the subject itself. There is a big difference. A detailed knowledge of a subject isn't necessary to form an opinon on how far an application of that subject should go in politics. Atheists here seem to demand a detailed knowledge of science by Christians, yet they show a woefully inadequate knowledge of Christianity to disregard it to the extent that they do. \n \n \nOften the case, but does that make it wrong? \n\n \n It's wrong in that it can't go on indefinately. Two opposing viewpoints can't claim studies of the same subject increase proof for BOTH VIEWS forever. If neither of them eventually fails, it's clear that neither of them are accomplishing anything. \n \n \nThe delivery may be rude and combative and this does not make for a good debate, but the message should not be ignored because of this (not that I particularly agree with some of what Darkins comes out with).\n\n \n There are several messages when it comes to origins of life - Stenger/Dawkins has one, Miller has one, Behe/Dembski has one. All three are blends of science and philosophy, but all three are philosophical enough so that a neutral scientific community should treat them equally, and they don't. If a young person is deciding which one to persue, a consultation of the scientific community would be a logical way to help them make their decision. That young person shouldn't see winking an nodding going on with one philosophy, and condemnation of another.", 
   {
    "unicode_changes_made": true
   }, 
   357343, 
   null, 
   1244953080.0
  ], 
  [
   357390, 
   null, 
   "marc9000", 
   "The problem is that science is concerned with methodological naturalism. Atheists, Agnostics, and Christians all can use this method. Hard line Atheists that use metaphysical relativism and Christians that insist on ID both leave the neutral area of methodological Naturalism (see Wikipedia.) This method treats science as if all is done by natural forces, but says nothing about there being no God or there being a God. \n\n \n If science claims that all is done by natural forces, it's not saying that God doesn't exist, but it IS saying that God does nothing. Is there really a difference? \n \n \nEither one of the other two groups is free to pursue their concept and try to prove it to the rest of us, but until they do, and they haven't proven a thing yet, they should not force their ideas on the rest.\n\n \n But since atheism claims all naturalism proves its concept, it really has a big advantage with science, doesn't it? It has a much politically easier time leaving the neutral area of actual science. This Wikipedia related page says this;\n \n \nHowever, this assumption of naturalism need not extend beyond an assumption of methodology. This is what separates methodological naturalism from philosophical naturalism - the former is merely a tool and makes no truth claim; while the latter makes the philosophical - essentially atheistic - claim that only natural causes exist. \n\n \n Claims and implications that only natural causes exist is happening in the scientific community. It \"need not\" happen in a perfect world, but since it's not a perfect world, it's happening, and it's not a good thing, and theistic evolutionists should be concerned. \n \n The mathematical improbability of naturalistic origins (increasing recently by new scientific studies) is a valid point as the creation/ID side pursues their concept. Most everyone could probably agree that talkorigins is a pretty good representative of what should be the neutral scientific community. Here's a page that addresses their response to mathematics;\n \n Lies, Damned Lies, Statistics, and Probability of Abiogenesis Calculations\n \n Does this look like an open minded approach, or does it look like a guarded, belligerent response to something they would prefer not to address?", 
   {
    "unicode_changes_made": true
   }, 
   357348, 
   null, 
   1244953500.0
  ], 
  [
   357394, 
   null, 
   "marc9000", 
   "Do you know why you get insulted? \n\n \n Because militant atheists of 4forums are more intolerant and immature than most other people? \n \n \nTell me, what do you think of a person who calls physics wrong and does not understand what \"force\" is? \n\n \n I haven't given it any thought, I'd rather simply disregard any person who would do that. If you can link me to anywhere on 4forums where I've addressed physics or force, we'll discuss it. If you can't, we'll call this straw man #1. \n \n \nWhat do you think of someone who calls geology wrong but doesn't know what a rock is? \n\n \n Same as above, with this being straw man #2.\n \n \nDo you think that someone who calls genetics false but cannot define what a gene is to understand the subject? \n\n \n #3. \n \n \nYou call evolution wrong, but have repeatedly shown you have absolutely no idea what it is. \n\n \n I haven't called it wrong, just questioned the atheism that's involved in some of its definitions. We've discussed it all before. Evolution has many meanings, according to what is being discussed. If we look at Dictionary.com as we did years ago (you musta forgot) you'll see a variety of meanings - several don't even include biology. See number 7, \"an evolving or giving off of gas, heat, etc.\" so that could include hot air, so we can safely say that you evolve when you post!\n \n \nNo it's not. All it is, is a measure of one group. And that group in total is only 2,100 members. There are 800 steves on the steve list with 51% being biologists. Are you seriously going to tell me that the NAS represents all biologists beliefs when the biologists belonging to the NAS are statistically tiny in comparison to all biologists? \n \n Let's see just how asinine your response will be. \n\n \n I'm going to seriously tell you that biologists worldviews are clearly more godless than those of the general public. It could be because biology naturally attracts godless people, or it could be that its education procedure favors them and discourages others, or it could be that studies of it convert them to godlessnes, like it did to Charles Darwin himself. As I said, why is another debate, the fact of its occurance isn't a debate. \n \n \nIt is when you compare them to the general public stratified by education. Gallup did a poll on that around the same time. Hint: the more poor you are and the less educated, the more you believe in Creationism. \n\n \n That's not the way I was doing it though, was it goalpost mover? As I said, unlike you I don't consider human lives and worldviews to be of less value because they don't have an education in biology. \n \n \nWho called ID a conspiracy theory? Lying again eh Marc? \n\n \n It's called a religious conspiracy all the time. A conspiracy to undermine \"true\" science all the time. Dazed and confused again eh, child? \n \n \nID as I pointed out is nothing more than animism. I see you refused to answer my question about Zeus. Tell me, how is ID fundamentally any different from Animism? What we cannot explain now is credited to a higher being. Replace lightning with eye and the argument is still the same. \n\n \n Your \"Zeus\" question was one of the stupid questions I referred to in a previous post, as is your calling ID animism. \n \n \nSo what do you use to determine reality? If God said there were two suns, would you use your eyes and testable methods to determine if there were two suns or just believe God independent of the actual facts? \n \n God said pigs can fly! Therefore, reality has flying pigs. emoticon_xgood \n\n \n This is yet another example of atheists not being too well educated in Christianity. \n \n \n Originally posted by marc9000] They'll say it's because my opinion is stupid, while we watch one say; \"science shows that God does not exist\", and the other answers \"I study science too, and I like how it shows God more vividly than ever before! You're cool, let's go have a beer! And ~I'm~ the stupid one? \n\n \n \nOriginally posted by child] Where has anyone here said that? \n\n \n \n Originally posted by marc9000] It's all over the scientific community - it starts with authors Kenneth Miller and Richard Dawkins, and branches out all over the place from there. \n\n \n \nStart citing.\n\n \n \n Richard Dawkins - \"The God Delusion\"\n \n Kenneth Miller - \"Finding Darwin's God\". Remember, I read this one, and we had a discussion on it. On page 258 of the book we find;\n \n \n...only those who embrace the scientific reality of [common ancestor] evolution are adequately prepared to give God the credit and power he truly deserves. \n\n \n Miller refered to Dawkins on 15 pages of that book and never said a bad word about him. The two have united more than once in evolution presentations/court battles.", 
   {
    "unicode_changes_made": true
   }, 
   357371, 
   null, 
   1244955300.0
  ], 
  [
   357400, 
   null, 
   "Archangel", 
   "LOL.\n \n You never learn do you?\n\n \n From a liar and promoter of misinformation? No! Because you have nothing true to teach anyone.\n \n \n You got rightly slammed for misreading that thread the first them and THEN YOU GO AND DO THE EXACT SAME THING!!!!\n \n No one said Goliath was a pre-flood giant. The Bible says that Goliath was descended from the Giants. But only Noah and his family survived. So that makes absolutely no sense. \n \n Good job on proving you can't read properly.\n\n \n Here again is wonderful evidence of the lies and corruption of the truth you constantly perpetuate. Not only that, but you have the nerve to continue to claim victory on it as if your bogus claim which your lying buddies supported last time was proven totally incorrect by me here: http://www.4forums.com/political/341791-post10.html And in the posts which followed where you and your buddies continued to claim you were right, not one of you posted one iota of evidence which proved your corruption of the bible was accurate or true. \n \n But that doesn't stop you from continuing to misinterpret the bible to suit your perverse gospel of lies and blasphemies against what God truly represents. You fallaciously claimed that Goliath was descended from the line of pre-flood giants. You said it twice, here: [Post#6]Except that the Bible states that Goliath was born from the people know as Giants that existed prior to the flood. And here: [Post#1]Similarly, if David slew Goliath who is proclaimed to be from a line of Giants, how was Goliath born if all of the giants died during the flood? \n \n So you were very clear in what you were asserting. And I misinterpreted nothing at all which is precisely what I explained to smiley, here again so you can't deny it: http://www.4forums.com/political/341791-post10.html . But all we can expect from you are lies and then backpedaling as you once again continue to claim you are right when all you do is pervert and corrupt whatever truth you come across.", 
   {}, 
   357369, 
   null, 
   1244956320.0
  ], 
  [
   357401, 
   null, 
   "Archangel", 
   "The problem is that science is concerned with methodological naturalism. Atheists, Agnostics, and Christians all can use this method. Hard line Atheists that use metaphysical relativism and Christians that insist on ID both leave the neutral area of methodological Naturalism (see Wikipedia.) This method treats science as if all is done by natural forces, but says nothing about there being no God or there being a God. Either one of the other two groups is free to pursue their concept and try to prove it to the rest of us, but until they do, and they haven't proven a thing yet, they should not force their ideas on the rest.\n\n \n You keep talking my friend, but you don't say much, or prove anything at all. Any response to this reply to you earlier? http://www.4forums.com/political/357251-post38.html Or will you just ignore any and all questions from your fellow fundamentalist christians? And Oh, btw, when did you accept Jesus as the Lord of your life? You know, receive the Holy Spirit? Become born again? It's also worth repeating this section from my last post which you have so far ignored. If you're a true believer answering these questions which pose real problems for the theory of evolution should be easy for you. And by easy, I mean supportable with the bible itself, not just your opinion.\n \n But let me ask you this as one fundamental Christian to another. How do you align the concept of the Genesis Creation story which clearly states that God created the Universe and everything within it in 6 days time which were broken up into 24 hour days, with evolution which claims that man evolved from lower animals over hundreds of millions of years, if not billions of years if we consider the alleged appearance of original life on Earth according to evolution hypothesis? \n \n What does the evolution account do to the Genesis accounts introduction of sin into the world by way of A&Es fall from grace, and Mans need for reconciliation to God because they disobeyed God, and ate of the fruit from the tree of the knowledge of good and evil? \n \n Don't you agree that if evolution is true then there is no need for God or the need for Mans redemption as outlined in the bible? The whole bible is about mans need for reconciliation to God due to our initial rebellion by disobeying His very clear warning that the day that we ate of that tree we would surely die through A&E. And because of that, the need for Jesus plan for salvation became a spiritual necessity. Can't you see that according to evolution, none of this is necessary?", 
   {}, 
   357348, 
   null, 
   1244957640.0
  ], 
  [
   357410, 
   null, 
   "obvious_child", 
   "From a liar and promoter of misinformation? No! Because you have nothing true to teach anyone\n\n \n And arch fails once again:\n \n http://www.4forums.com/political/356648-post27.html\n \n \nAnd in the posts which followed where you and your buddies continued to claim you were right, not one of you posted one iota of evidence which proved your corruption of the bible was accurate or true.\n\n \n What does fail taste like Arch?\n \n http://www.4forums.com/political/356648-post27.html\n \n After all, you are constantly eating it. \n \n More fail?\n \n http://www.4forums.com/political/356648-post27.html\n \n Huh. Imagine that. Arch constantly failing. \n \n Rephaite - Wikipedia, the free encyclopedia\n \n More fail!", 
   {}, 
   357400, 
   null, 
   1244966580.0
  ], 
  [
   357421, 
   null, 
   "Archangel", 
   "Why's that? Because you repost the same post 3 times that greentwiga wrote, that proves nothing at all, but is simply his opinion? He says this: Even he admits how convoluted his explanation is and he ties nothing together at all in the end. No wonder you accept that as evidence. In another post on the same thread he says this, and I quote: \n [greentwiga said:] Goliath's height was six cubits and a span. A cubit was the length from the elbow to the fingertip and it varied from one person to another and from one culture to another. A typical 6 foot tall person has a cubit (1/4 of height) of 1 1/2 feet. Six cubits is 9 feet. Sumerians had a cubit slightly longer (19 or 20 inches) A tribe with men averaging 5 feet tall would have a cubit of 1 1/4 feet. Thus Goliath would have been 7 1/2 feet tall. He could have been a perfectly normal giant with none of the health problems that come from a pituitary abnormality. This leaves us with an interpretation of the Bible that does not contradict science.\n \n So my alleged fundamentalist friend is all over the place as he attempts to marry science with theology. What he will eventually realize hopefully is that all he accomplishes in doing so is to deceive himself and miss the precious truth in Gods word. Here, let me explain how his explanation contradicts Gods word and message in the end. It is exposed in this attempt to once again compromise Gods truth with a secular humanist interpretation which he supports with no spiritual or theological sources at all. \n \n [greentwiga also said:] The second problematical interpretation is that all men died in the flood. The word for World in Gen 6 & 7 is also translated region or country. In Peter, he refers to the creation of the world and the final destruction of the world with the word \"Ge.\" He refers to the destruction of the world by the flood with the word cosmos. This means the organized world. An literal interpretation of the Bible can be that just Sumer was flooded. Then the Nephilim were not all destroyed in the flood, Goliath was one of the Anakim who were descended from the Nephilim, and there is no contradiction.\n \n So, if you read greentwigas second paragraph here and place it side by side with the Genesis account regarding Gods reason for destroying the Earth by flood as told here: \n Gen 6:1 Now it came about, when men began to multiply on the face of the land, and daughters were born to them,\n Gen 6:2 that the sons of God saw that the daughters of men were beautiful; and they took wives for themselves, whomever they chose.\n Gen 6:3 Then the LORD said, \"My Spirit shall not strive with man forever, because he also is flesh; nevertheless his days shall be one hundred and twenty years.\"\n Gen 6:4 The Nephilim were on the earth in those days, and also afterward, when the sons of God came in to the daughters of men, and they bore {children} to them. Those were the mighty men who {were} of old, men of renown.\n Gen 6:5 Then the LORD saw that the wickedness of man was great on the earth, and that every intent of the thoughts of his heart was only evil continually.\n Gen 6:6 The LORD was sorry that He had made man on the earth, and He was grieved in His heart.\n Gen 6:7 The LORD said, \"I will blot out man whom I have created from the face of the land, from man to animals to creeping things and to birds of the sky; for I am sorry that I have made them.\"\n So, we see that according to greentwiga God totally failed in his reason and motivation for destroying the World through the flood if the giants survived, since Gods intention was to wipe out these creatures which were the result of Fallen Angels mixing with women which resulted in these giants existing in the first place.\n \n Also greentwiga, you have an immediate problem of credibility with true believers around here since the only people buying into your theology are atheists like the obvious child here. \n \n Also you say the word used to describe the world/Earth in Genesis 6 is cosmos? \n Gen 6:4 The Nephilim were on the earth in those days, and also afterward, when the sons of God came in to the daughters of men, and they bore {children} to them. Those were the mighty men who {were} of old, men of renown.\n Wrong again, and here is evidence from the Lexicon. How about you stop just making claims and start supporting your theological assertions with respected theological sources which support what you say?\n Blue Letter Bible - Lexicon\n \n For a real comparison, here is the usage of the word Earth in Genesis 1:1 click on #776 to get the meaning of the word used and you will see that it is the same word used in Genesis 6. Blue Letter Bible - Book of Beginnings - Genesis 1 (NASB - New American Standard Bible)\n \n So rather than use diversionary tactics which attempt to build an argument that is once again based on misinformation and lies, why not honestly respond with actual supportable theological evidence for once? Or is it your preference to always promote lies rather than the truth, little child?", 
   {}, 
   357410, 
   null, 
   1244991120.0
  ], 
  [
   357435, 
   null, 
   "Larni", 
   "It&#8217;s always claimed that science cannot prove nor disprove the existance of God. \n \n \n The scientific method cannot prove anything. That's part of the philosophy of science. We always have the chance that new evidence will come along to falsify the current paradigm. Biology (just like any scientific discipline) is always re assessing it's self against new evidence.\n \n \n In terms of science they are, but in terms of philosophical applications of science, they are not. \n \n \n Quite. The uses that scientific discoveries are put to can only be decided by the people. However the findings of science are not democratically decided. Science is not a democracy.\n \n \n Surely you&#8217;re kidding. We can make predictions about many things, most notably human behavior, by consulting subjects other than science. Unrevised history is a good one, some people believe a recognition of supernatural good & evil is another. \n \n \n No I am not kidding. You pick a bad example. Human behaviour. That would be the science of psychology (my field for the last 15 years or so). History does not use the scientific method as far as I'm aware but it's not my field so I could be wrong. \n \n That some people believe in things with no evidence is hardly out of the ordinary. People frequently engage in 'magical thinking' confusing correlation for causation. \n \n \n Atheists here seem to demand a detailed knowledge of science by Christians, yet they show a woefully inadequate knowledge of Christianity to disregard it to the extent that they do. \n\n \n If the discussion is science and one member of the discussion does not have the required level of expertise to have a meaningful debate, there can be no debate. Knowledge of subjects outside the sphere of the debate at had is irrelevant to the debate.\n \n If one of my patients knows more about engineering than I do, what difference does that make to the treatment my training dictates is appropriate? I still value the patient as an individual but his knowledge in this case is irrelevant. Just as religion is irrelevant to science.\n \n \n It&#8217;s wrong in that it can&#8217;t go on indefinately. Two opposing viewpoints can&#8217;t claim studies of the same subject increase proof for BOTH VIEWS forever. If neither of them eventually fails, it&#8217;s clear that neither of them are accomplishing anything. \n\n \n Science keeps in improving it's accuracy at describing and predicting the way the universe works. The various theologies that religious people have becomes getting less useful at doing this as time progresses. People will always believe in the supernatural (magical thinking again) but this does not make it an accurate reflection of reality (correlation is not causation).\n \n \n There are several messages when it comes to origins of life - Stenger/Dawkins has one, Miller has one, Behe/Dembski has one. All three are blends of science and philosophy, but all three are philosophical enough so that a neutral scientific community should treat them equally, and they don&#8217;t. If a young person is deciding which one to persue, a consultation of the scientific community would be a logical way to help them make their decision. That young person shouldn&#8217;t see winking an nodding going on with one philosophy, and condemnation of another.\n\n \n Stenger and Dawkins only really point out that there is no evidence for the supernatural (although The God Delusion did read like a speech from an evangelical pulpit).\n \n The fact is that ID is not science. It is creationism. Young people should be taught what science is and what it is not. \n \n ID is not science.", 
   {}, 
   357389, 
   null, 
   1245002820.0
  ], 
  [
   357509, 
   null, 
   "greentwiga", 
   "But let me ask you this as one fundamental Christian to another. How do you align the concept of the Genesis Creation story which clearly states that God created the Universe and everything within it in 6 days time which were broken up into 24 hour days, with evolution which claims that man evolved from lower animals over hundreds of millions of years, if not billions of years if we consider the alleged appearance of original life on Earth according to evolution hypothesis? \n \n What does the evolution account do to the Genesis accounts introduction of sin into the world by way of A&Es fall from grace, and Mans need for reconciliation to God because they disobeyed God, and ate of the fruit from the tree of the knowledge of good and evil? \n \n Don't you agree that if evolution is true then there is no need for God or the need for Mans redemption as outlined in the bible? The whole bible is about mans need for reconciliation to God due to our initial rebellion by disobeying His very clear warning that the day that we ate of that tree we would surely die through A&E. And because of that, the need for Jesus plan for salvation became a spiritual necessity. Can't you see that according to evolution, none of this is necessary?[/QUOTE]\n \n First, I accept each and every word in the original was inspired by God (not necessarily the translations) Then I went back to look at the original passage. It says, \"There was evening and there was morning, a second day.\" This pattern is repeated almost unchanged over six days. Then I looked to see what it means. It could be six literal days. In Genesis 2:4, it says, \"This is the generations of the heavens and the earth when they were created, in the day that the Lord God made the heavens and earth. 5:1 and 10:1 are two other passages that use the same formula and cover all the generations mentioned. Frequently, the next statement about generations goes back in time from where the previous one ended and starts another group, such as Gen 11:10 where it even repeats part of the genealogy of Shem. The first one, started in Gen 2:4 ends (time wise) with the three sons of Lamech. All this, according to Gen 2:4 is in one day. The six days of Genesis 1 are said to be one day and the seven generations of Cain are also part of the one day. It could be that the days of Genesis 1 are not 24 hour days. Thus, it does nothing to the account of Genesis 2-4. Adam and Eve committed Evil (Look up the meaning in Hebrew), and in the same day, died. They lived many more years, so could this mean they died spiritually? Yes. Now they needed the reconciliation. When you understand the Hebrew word for Evil, you see that even if evolution is right, Rom 5 shows that through one man, sin entered the world and death spread to all men, because all sinned. It states how Adam was given a law and broke it. Death spread to all men, even over people who had not sinned in the likeness of Adam. They had sinned a different way. I agree, the whole Bible is about man's need to be reconciled to God. I fail to see how evolution negates that in any way.", 
   {}, 
   357401, 
   null, 
   1245031020.0
  ], 
  [
   357511, 
   null, 
   "marc9000", 
   "The scientific method cannot prove anything. That's part of the philosophy of science. We always have the chance that new evidence will come along to falsify the current paradigm. Biology (just like any scientific discipline) is always re assessing it's self against new evidence. \n\n \n In a perfect world, yes. But there's common sense evidence that shows Darwinism is elevated above that. In 1959, George Gaylord Simpson said \"No other single human production has had so great an impact on science or on learning and thought in general as \"The Origin of Species\". Ernst Mayr said that Darwin's work led to \"perhaps the most fundamental of all intellectual revolutions in the history of mankind\". I realize that's only two men, but it's not hard to see throughout the scientific community. That kind of worship of Darwin is throughout Kenneth Miller's book \"Finding Darwin's God\", which I read, and is also throughout the rantings of people like Dawkins, who I try to avoid reading, (but sometimes watch him speak if I'm trying to accomplish a personal medical task, like purging my stomach of its contents)\n \n Imperfect humans, even those with impressive educations, take Darwinism far beyond \"paradigm\" status. It's a worship that is no easier to re assess than any religion.\n \n \nQuite. The uses that scientific discoveries are put to can only be decided by the people. However the findings of science are not democratically decided. Science is not a democracy. \n\n \n Findings are results of searches. Not everything will be found, and not everything will be searched for. Science can't do everything possible that is scientific, decisions have to be made concerning choices of what to study, and applications.The applications/searches shouldn't be controlled by those who get paid for the searching, it should be controlled by those who pay for the searching. \n \n \nNo I am not kidding. You pick a bad example. Human behaviour. That would be the science of psychology (my field for the last 15 years or so). History does not use the scientific method as far as I'm aware but it's not my field so I could be wrong. \n\n \n Well, it really wasn't my example, you used the words \"predictions\" and \"reality\", as if scientific mastery over them was all-encompasing, which it clearly isn't. \n \n \nThat some people believe in things with no evidence is hardly out of the ordinary. People frequently engage in 'magical thinking' confusing correlation for causation. \n\n \n There's magical thinking in Darwin's elevated status too. The idolization of him continues to grow since his death. It's been established that Jesus Christ is the most written about person who has ever walked on earth. If Darwin isn't yet in second place, I'm sure he will be some day. \n \n \n \nIf the discussion is science and one member of the discussion does not have the required level of expertise to have a meaningful debate, there can be no debate. Knowledge of subjects outside the sphere of the debate at had is irrelevant to the debate.\n \n If one of my patients knows more about engineering than I do, what difference does that make to the treatment my training dictates is appropriate? I still value the patient as an individual but his knowledge in this case is irrelevant. Just as religion is irrelevant to science. \n\n \n Let's try this again;\n \n Originally posted by marc9000] What we're doing here is discussing the APPLICATION of a subject, not necessarily the nuts and bolts of the subject itself. There is a big difference. A detailed knowledge of a subject isn't necessary to form an opinon on how far an application of that subject should go in politics. \n\n \n You quoted what I said all around the above three sentences, yet left those sentences out. Either you didn't think they were important at all, or they were too troublesome for you. I'm not trying to pin you down on why you left them out, but I have to restate them because they are important to what I believe, and as you have probably guessed, my belief is that the Dover court decision was the wrong one. It's easy to see that I'm not alone, not only because of the interest the Dover case generated, but because there's enough logic in my (and millions of others) viewpoint that there is a chance that a future political event/court decision will overturn that Dover decision. \n \n ID's status as science, independent of everything else concerned, isn't the only issue. ID can be a form of competition, to expose other forms of non-science. And I've heard it all before - science shouldn't be a place for competitive games. In a perfect would, that would be true. In a world where a minority, (atheists) largely rule it, it is true. \n \n \nScience keeps in improving it's accuracy at describing and predicting the way the universe works. The various theologies that religious people have becomes getting less useful at doing this as time progresses. People will always believe in the supernatural (magical thinking again) but this does not make it an accurate reflection of reality (correlation is not causation). \n\n \n Like selection without a selector, or information without an informer? Is the definition of magic, 'something that humans can't figure out'? \n \n \nStenger and Dawkins only really point out that there is no evidence for the supernatural (although The God Delusion did read like a speech from an evangelical pulpit).\n \n The fact is that ID is not science. It is creationism. Young people should be taught what science is and what it is not. \n \n ID is not science.\n\n \n I know what the claims are, I've discussed them with others here many times before. They say ID is not science because anything that deals with the supernatural has limits on what can be studied, that science can only study naturalism. I've said that abiogenesis shouldn't be studied by the public scientific establishment because it can be a [public/ government established/ government sanctioned] attempt to disprove the supernatural. If religion should be kept out of science, then attempts to disprove religion should also be kept out of science. I've been told that's just too bad for religion, that abiogenesis is 100% naturalism, therefore it's science. So that's where we are, we have a constitution that says we can't publicly establish religion, but we have, to some degree, a public establishment of atheism. Young people need to know it. They need to know that it's un-American for the majority who believes in an intelligent designer to have tax money taken from them so atheists can waste it looking for godless origins of life that they're never going to find, and call it science. Maybe we need mandatory \"science watch\" classes in public schools.", 
   {
    "unicode_changes_made": true
   }, 
   357435, 
   null, 
   1245032040.0
  ], 
  [
   357517, 
   null, 
   "Archangel", 
   "[Archangel said] But let me ask you this as one fundamental Christian to another. How do you align the concept of the Genesis Creation story which clearly states that God created the Universe and everything within it in 6 days time which were broken up into 24 hour days, with evolution which claims that man evolved from lower animals over hundreds of millions of years, if not billions of years if we consider the alleged appearance of original life on Earth according to evolution hypothesis? \n \n What does the evolution account do to the Genesis accounts introduction of sin into the world by way of A&Es fall from grace, and Mans need for reconciliation to God because they disobeyed God, and ate of the fruit from the tree of the knowledge of good and evil? \n \n Don't you agree that if evolution is true then there is no need for God or the need for Mans redemption as outlined in the bible? The whole bible is about mans need for reconciliation to God due to our initial rebellion by disobeying His very clear warning that the day that we ate of that tree we would surely die through A&E. And because of that, the need for Jesus plan for salvation became a spiritual necessity. Can't you see that according to evolution, none of this is necessary?\n\n \n \nFirst, I accept each and every word in the original was inspired by God (not necessarily the translations) \n\n \n This is why we have Lexicons, so we can get the original meanings which are lost in translation sometimes. \n \n \n Then I went back to look at the original passage. It says, \"There was evening and there was morning, a second day.\" This pattern is repeated almost unchanged over six days. Then I looked to see what it means. It could be six literal days. \n\n \n It is a literal six days. Why would God creates 24 hour days, and tell us He's creating each aspect of creation in a day and then actually mean some other measure of time? It makes no sense.\n \n \n In Genesis 2:4, it says, \"This is the generations of the heavens and the earth when they were created, in the day that the Lord God made the heavens and earth. 5:1 and 10:1 are two other passages that use the same formula and cover all the generations mentioned. Frequently, the next statement about generations goes back in time from where the previous one ended and starts another group, such as Gen 11:10 where it even repeats part of the genealogy of Shem. The first one, started in Gen 2:4 ends (time wise) with the three sons of Lamech. All this, according to Gen 2:4 is in one day. The six days of Genesis 1 are said to be one day and the seven generations of Cain are also part of the one day. It could be that the days of Genesis 1 are not 24 hour days. \n\n \n This is complete gibberish. It makes no sense at all, nor is it consistent with any theological explanation of Gods timing in the creation account. You'll have to do better than this if you're going to suggest that God didn't create the world in 6 literal days.\n \n \n Thus, it does nothing to the account of Genesis 2-4. Adam and Eve committed Evil (Look up the meaning in Hebrew), and in the same day, died. They lived many more years, so could this mean they died spiritually? Yes. Now they needed the reconciliation. When you understand the Hebrew word for Evil, you see that even if evolution is right, Rom 5 shows that through one man, sin entered the world and death spread to all men, because all sinned. \n\n \n Why don't you show the specific verse in Genesis where the word evil is used in the context which pleases you, then show what it means in the original language using an online lexicon? Here's an example. Gen 3:22 \n \n Blue Letter Bible - Book of Beginnings - Genesis 3 (NASB - New American Standard Bible)\n \n \n It states how Adam was given a law and broke it. Death spread to all men, even over people who had not sinned in the likeness of Adam. They had sinned a different way. I agree, the whole Bible is about man's need to be reconciled to God.  I fail to see how evolution negates that in any way.\n\n \n You don't? I thought my question above was outlined very clearly. With evolution as envisioned by Darwin, there is no need for God or salvation in any way. Evolution erases God from the equation of how and why Man exists at all. That's why evolution negates the Creation account.", 
   {}, 
   357509, 
   null, 
   1245038220.0
  ], 
  [
   357532, 
   null, 
   "Larni", 
   "But there's common sense evidence that shows Darwinism is elevated above that. \n\n \n Ask yourself why this is. ToE is an incredibly well supported theory. Just like Gravitational and Germ theory. We no longer believe disease created by 'bad humours', do we? \n \n At one time this is what people believed (as a result of magical thinking [which I use in its formal sense]). Now we don't because of a solid and very well supported theory (Germ Theory).\n \n Once some people believed Earth was created by supernatural means. Can you see the parallel?\n \n \n In 1959, George Gaylord Simpson said \"No other single human production has had so great an impact on science or on learning and thought in general as \"The Origin of Species\". Ernst Mayr said that Darwin's work led to \"perhaps the most fundamental of all intellectual revolutions in the history of mankind\".\n\n \n I see your point. However, if something is viewed as tremendously important (again I point out Germ Theory) it is because it most likely is. Anyone with the ability can wade through the reams and reams of research and draw ones own conclusions about any subject. If one disagree ones is able to perform research to explore the reasons for that disagreement.\n \n The fact is that challenging ToE on scientific grounds is as impossible as challenging Germ Theory on scientific grounds. That's why all the challenges are religious or (in the case of the Wedge brigade) politico-religious.\n \n Either way one cuts it, it is biblical literalists who push this argument. \n \n \n Imperfect humans, even those with impressive educations, take Darwinism far beyond \"paradigm\" status. It's a worship that is no easier to re assess than any religion.\n\n \n The fact that some people may or may not take ToE beyond that which it is, is no reason to compare lack of belief in the supernatural with holding a belief in the supernatural. \n \n Lack of belief is not the opposite of belief, just as darkness is not the opposite if light. \n \n \n Findings are results of searches. Not everything will be found, and not everything will be searched for. Science can't do everything possible that is scientific, decisions have to be made concerning choices of what to study, and applications.The applications/searches shouldn't be controlled by those who get paid for the searching, it should be controlled by those who pay for the searching.\n \n \n As much as it sometimes pains me, I concur that the areas for the searches should be determined by the people. But I don't agree that those with the means to pay should dictate the direction of the searches. As I said before, this choice is the choice of the people, not a privileged, rich minority.\n \n \n Well, it really wasn't my example, you used the words \"predictions\" and \"reality\", as if scientific mastery over them was all-encompasing, which it clearly isn't. \n\n \n As I said, science does what science does. Sometimes the wider population does not have a correct picture of what science can do and what it can't. But I do confess to pouncing on the psychology reference (human behaviour is often trumpeted as a limit of science-it's not). \n \n \n There's magical thinking in Darwin's elevated status too. The idolization of him continues to grow since his death. It's been established that Jesus Christ is the most written about person who has ever walked on earth. If Darwin isn't yet in second place, I'm sure he will be some day. \n\n \n I'm using magical thinking in its formal usage, here.\n \n \n What we're doing here is discussing the APPLICATION of a subject, not necessarily the nuts and bolts of the subject itself. There is a big difference. A detailed knowledge of a subject isn't necessary to form an opinon on how far an application of that subject should go in politics.\n\n \n Point taken. As I said: by the people (not just the rich).\n \n \n It's easy to see that I'm not alone, not only because of the interest the Dover case generated, but because there's enough logic in my (and millions of others) viewpoint that there is a chance that a future political event/court decision will overturn that Dover decision. \n\n \n But this simply goes back to the issue that many people do not have the training to make an informed choice. \n \n Every single person with OCD believes the way to control their anxiety is to perform some ritualised task. \n \n Every. Single. One.\n \n This is an example of magical thinking. What is and is not is not a democracy. Experts are far more likely to be right than non experts.\n \n \n ID's status as science, independent of everything else concerned, isn't the only issue. ID can be a form of competition, to expose other forms of non-science. And I've heard it all before - science shouldn't be a place for competitive games. In a perfect would, that would be true. In a world where a minority, (atheists) largely rule it, it is true. \n\n \n I don't how ID can do anything other than encourage biologist to knock down IC (over and over again). But is this not a waste of money? ID basically plays God of the Gaps and keeps losing ground. IC has never been upheld. \n \n What a waste of time and money.\n \n \n Like selection without a selector, or information without an informer? Is the definition of magic, 'something that humans can't figure out'? \n\n \n I'm sorry, I was using magical thinking in it's formal sense. With out digressing too much. The 'selector' in this case is the environment and if you are calling DNA Shannon information you are dead wrong.\n \n \nThey say ID is not science because anything that deals with the supernatural has limits on what can be studied, that science can only study naturalism. \n\n \n There is no part of the supernatural that science measure. Full stop.\n \n \n I've said that abiogenesis shouldn't be studied by the public scientific establishment because it can be a [public/ government established/ government sanctioned] attempt to disprove the supernatural. \n\n \n It is not research to disprove the supernatural. It is an attempt to establish as best as we can the facts around abiogenesis. If you don't want this to be studied you can use your political power to influence your government to cut funding. I support your right to do that (even if I believe it will cause your country to lag behind the others in terms of scientific prowess).\n \n \n If religion should be kept out of science, then attempts to disprove religion should also be kept out of science. \n\n \n Science is not a crusade against religion. The fact that science affects the likelihood of someone holding faith based beliefs is a side effect that is not even a guaranteed: my father in law is a physicist and is Christian. He is part of the scientific establishment (as I would like to think of myself) with no anti religious axe to grind. I suspect he is not a biblical literalist (never asked-it's considered rude to bring up religion in polite conversation over here). \n \n \n I've been told that's just too bad for religion, that abiogenesis is 100% naturalism, therefore it's science. So that's where we are, we have a constitution that says we can't publicly establish religion, but we have, to some degree, a public establishment of atheism. Young people need to know it. \n\n \n Can't comment, I don't know enough about your constitution.\n \n \n They need to know that it's un-American for the majority who believes in an intelligent designer to have tax money taken from them so atheists can waste it looking for godless origins of life that they're never going to find, and call it science. Maybe we need mandatory \"science watch\" classes in public schools.\n\n \n I agree that the majority should decide where the money goes, but you sound as if you are demonising people who don't believe in ID as un-American.\n \n I dug this up on the first hit (google) about your president commenting about ID in schools.\n \n \n Q: York County was recently in the news for a lawsuit involving the teaching of intelligent design. What's your attitude regarding the teaching of evolution in public schools?\n \n A: \"I'm a Christian, and I believe in parents being able to provide children with religious instruction without interference from the state. But I also believe our schools are there to teach worldly knowledge and science. I believe in evolution, and I believe there's a difference between science and faith. That doesn't make faith any less important than science. It just means they're two different things. And I think it's a mistake to try to cloud the teaching of science with theories that frankly don't hold up to scientific inquiry.\"\n\n \n Bold by me.\n \n Obama on ID (Intelligent Design)\n \n Is he un-American? \n \n Was he voted in by un-Americans?", 
   {
    "unicode_changes_made": true
   }, 
   357511, 
   null, 
   1245070020.0
  ], 
  [
   357896, 
   null, 
   "greentwiga", 
   "Overall, Larni gave a very well reasoned reply. As long as the Theory of Evolution (ToE) sticks to what is says, it doesn't say a thing about Atheism or religion. Some people use it and go beyond it to say there is no God, but it does not say that. Years ago, people said Galileo's sun centered solar system attacked the Bible and oppressed scientists. The only thing that Galileo's theory attacked was a certain interpretation. The only thing that ToE attacks is a certain interpretation. There was a dramatic change possibly 70,000 years ago. Whether the complex sudden changes were that a group of statistically unlikely changes happened together, or that a God caused them to happen, science can't say. All science can say is that suddenly there were these beings that science calls fully modern Humans. As for the rest of time, Christians know that miracles are not common. Most of the time, it operates according to the laws God establishes. (eg ps 104:5 compared to what scientists say about the moon keeping the earth from tottering forever and ever. One act, and after that, the laws keep it going.) Therefore, the ToE could be true and Gen 1 could refer to specific points in time when God stepped in, and that Sin entered the world through Adam and that Jesus then had to die. Though Atheists try to use the ToE to prove there is no God, most scientists will say they have not proven that. Though IDers are welcome to try to prove their point scientifically, there is nothing solid yet. I as a Christian am much more willing to accept their studies than skeptical scientists, and I have seen nothing that I would use, yet.", 
   {}, 
   357532, 
   null, 
   1245365640.0
  ], 
  [
   357906, 
   null, 
   "Penfold", 
   "For interest and comparison with Ps 104, see below a hymn to Ra, from the Papyrus of Hu-nefer.\n \n \n \" O thou who art crowned king amongst the gods...\n [Here is expressed the polytheistic point of view] \n Thou art the lord of heaven, \n Thou art the lord of the earth; \n Thou art the creator of those who dwell in the heights, \n and \n Those who dwell in the depths. \n Thou art the One God who came into being at the \n beginning of time. \n [monotheism was beginning throughout the world with the idea of the \"God of Gods\", and is consistent with the concept of G-d in the Pentateuch] \n Thou didst create the earth, \n Thou dist fashion the man, \n Thou didst make the watery abyss of the sky... \n Thou dost travel across the sky with thy heart swelling \n in joy; \n The great deep of heaven is content thereat...\"\n \n Psalm 104 and The Hymn To Aten\n \n \n As usual there are claims that Goddidit, but which one, if any?", 
   {}, 
   357896, 
   null, 
   1245371400.0
  ], 
  [
   357940, 
   null, 
   "pandion", 
   "Originally Posted by marc9000\n \n ...we have a constitution that says we can't publicly establish religion, but we have, to some degree, a public establishment of atheism. Young people need to know it.\n\n Can't comment, I don't know enough about your constitution.\nLet me help, since I have devoted some effort in the study of my Constitution.\n \n Marc's error is that because the Constitution does not support the establishment of his religion, that it opposes his religion. The government of the US is not anti-religious, it is secular. The purpose is to neither support or oppose any religion.\n \n How sad that marc thinks that a document that guarantees his right to worship as he sees fit, without government interference, is somehow the imposition of another theological view. Does not the Constitution guarantee my right to be free from his religion? I think that the idea is that the Constitution means that we are all free from any religion except that particular one that we choose to accept.", 
   {
    "unicode_changes_made": true
   }, 
   357532, 
   null, 
   1245399360.0
  ], 
  [
   357964, 
   null, 
   "Larni", 
   "Let me help, since I have devoted some effort in the study of my Constitution.\n \n Marc's error is that because the Constitution does not support the establishment of his religion, that it opposes his religion. The government of the US is not anti-religious, it is secular. The purpose is to neither support or oppose any religion.\n \n How sad that marc thinks that a document that guarantees his right to worship as he sees fit, without government interference, is somehow the imposition of another theological view. Does not the Constitution guarantee my right to be free from his religion? I think that the idea is that the Constitution means that we are all free from any religion except that particular one that we choose to accept.\n\n \n I think I see. \n \n I did a bit of back ground reading and it seems this part of your constitution was to stops us Brits pushing our religion on you damn Yankees rather than pushing a state religion (like us Limeys have).", 
   {}, 
   357940, 
   null, 
   1245438300.0
  ], 
  [
   357965, 
   null, 
   "ShadowPikachu", 
   "Let me help, since I have devoted some effort in the study of my Constitution.\n \n Marc's error is that because the Constitution does not support the establishment of his religion, that it opposes his religion. The government of the US is not anti-religious, it is secular. The purpose is to neither support or oppose any religion.\n \n How sad that marc thinks that a document that guarantees his right to worship as he sees fit, without government interference, is somehow the imposition of another theological view. Does not the Constitution guarantee my right to be free from his religion? I think that the idea is that the Constitution means that we are all free from any religion except that particular one that we choose to accept.\n\n \n Well, I think also that Marc's problem here is not only his difficulty with the First amendment, but with the fact that he seems to be conflating the term \"secular\", with the term \"atheistic\". And I think that is his main problem here, thinking the two are one in the same, when they aren't.", 
   {}, 
   357940, 
   null, 
   1245438840.0
  ], 
  [
   357999, 
   null, 
   "marc9000", 
   "Ask yourself why this is. ToE is an incredibly well supported theory. Just like Gravitational and Germ theory. We no longer believe disease created by 'bad humours', do we? \n\n \n Bad comparison. We have gravity now. We have germs now. We don't have events of billions of years ago now. \n \n \nAt one time this is what people believed (as a result of magical thinking [which I use in its formal sense]). Now we don't because of a solid and very well supported theory (Germ Theory).\n \n Once some people believed Earth was created by supernatural means. Can you see the parallel? \n\n \n Once? I still do, as do many people. I know the \"big bang\" theory is accepted by many people, Christian and non-Christian alike. I don't claim to rule it completely out myself, I just think speculation about that and similar things is the ultimate exercise in futility. We live in a realm of re-arrangement, and that's all we can think about. We can't create nor destroy, and we can't witness creation or destruction. There may be a significant realm of creation and destruction that we can't comprehend, yet is very present in what we experience. (I believe it's the Christian God) If science claims it can explain everything we experience by naturalistic means (re-arrangement) then science goes beyond it's bounds, and into philosophy. \n \n \nI see your point. However, if something is viewed as tremendously important (again I point out Germ Theory) it is because it most likely is. Anyone with the ability can wade through the reams and reams of research and draw ones own conclusions about any subject. If one disagree ones is able to perform research to explore the reasons for that disagreement.\n \n The fact is that challenging ToE on scientific grounds is as impossible as challenging Germ Theory on scientific grounds. That's why all the challenges are religious or (in the case of the Wedge brigade) politico-religious. \n\n \n And I believe that studying the possibility of abiogenesis from billions of years ago on scientific grounds is just as impossible. \n \n \nEither way one cuts it, it is biblical literalists who push this argument. \n\n \n Equally, it's atheists who push abiogenesis. (and some theistic evolutionists) I guess the theistic evolutionists don't think God is intelligent. emoticon_rolleyes\n \n \nThe fact that some people may or may not take ToE beyond that which it is, is no reason to compare lack of belief in the supernatural with holding a belief in the supernatural. \n\n \n Talkorigins, and many other \"scientific\" websites, devote plenty of energy to downgrade creationism and religion. Are they taking the ToE beyond that which it is when they do that? \n \n \nLack of belief is not the opposite of belief, just as darkness is not the opposite if light. \n\n \n Could you explain that? If lack of belief is not the opposite of belief, are you saying that something else is the opposite of belief? Or are you saying that there is no opposite of belief? What is the opposite of light if it's not darkness? \n \n \nAs much as it sometimes pains me, I concur that the areas for the searches should be determined by the people. But I don't agree that those with the means to pay should dictate the direction of the searches. \n\n \n No no no, you misunderstand, I'm not saying those with monetary influence should have a greater influence in what is studied at all, I'm saying anyone who contributes in any way to the public till should have a say in what is searched, not because of any in-depth knowledge they may have of the searches, but because of their conclusions concerning the goals/uses of the results of the searches. \n \n \nAs I said before, this choice is the choice of the people, not a privileged, rich minority.\n\n \n Often, it is the scientific community that is a privileged and rich minority. \n \n \nAs I said, science does what science does. Sometimes the wider population does not have a correct picture of what science can do and what it can't. But I do confess to pouncing on the psychology reference (human behaviour is often trumpeted as a limit of science-it's not). \n\n \n \n But they have the most correct picture of the public usefulness of a search. \n \n \nBut this simply goes back to the issue that many people do not have the training to make an informed choice. \n \n Every single person with OCD believes the way to control their anxiety is to perform some ritualised task. \n \n Every. Single. One. \n\n \n According to Wikipedia; \"The sufferer feels compelled to voluntarily perform irrational, time-consuming behaviors to diminish the anxiety.\" What makes you use the word \"ritualised\" over \"irrational, time consuming\"? The word \"ritualised\" can tend to lean toward religion, and I think it has a possibility of being unfair, in a field such as yours. When it comes to feeling compelled to perform irrational, time consuming behaviors..........I THINK I MIGHT HAVE THAT NOW!!!!!!! HELP ME HELP ME!!!!!!!! emoticon_cry\n \n \nThis is an example of magical thinking. What is and is not is not a democracy. Experts are far more likely to be right than non experts.\n \n I don't how ID can do anything other than encourage biologist to knock down IC (over and over again). But is this not a waste of money? ID basically plays God of the Gaps and keeps losing ground. IC has never been upheld. \n \n What a waste of time and money. \n\n \n It's a worldview difference - I think the ones who are losing ground are the Darwinists. Ever since the enthusiastic writings of numerous followers of Darwin, (Huxley, Spencer, others) the origin of the first, simplest form of life didn't seem of much concern to them, or Darwin for that matter. They had no idea of its complexity, and didn't know that finding it would be so elusive, if not impossible. \n \n \nI'm sorry, I was using magical thinking in it's formal sense. With out digressing too much. The 'selector' in this case is the environment and if you are calling DNA Shannon information you are dead wrong. \n\n \n I was referring to purpose, and specified information. Just because evolutionists don't like the terms, it shouldn't mean we have to automatically rule them out. \n \n \nThere is no part of the supernatural that science measure. Full stop.\n\n \n If it can't measure it, it can't challenge it. The scientific community \"roundly criticizing Behe over Stenger lays the serious problem bare. If science doesn't want to measure with ID, it shouldn't have such a keen desire to challenge religion with atheism. It's what abiogenesis is. \n \n \nIt is not research to disprove the supernatural. It is an attempt to establish as best as we can the facts around abiogenesis. If you don't want this to be studied you can use your political power to influence your government to cut funding. I support your right to do that (even if I believe it will cause your country to lag behind the others in terms of scientific prowess). \n\n \n Scientific prowess, or atheistic prowess? We seem to be doing just fine in that department according to statistics - the U.S. and the world. The big bucks seem to be in atheism far more than science. \n \n \nScience is not a crusade against religion. The fact that science affects the likelihood of someone holding faith based beliefs is a side effect that is not even a guaranteed: my father in law is a physicist and is Christian. He is part of the scientific establishment (as I would like to think of myself) with no anti religious axe to grind. I suspect he is not a biblical literalist (never asked-it's considered rude to bring up religion in polite conversation over here). \n\n \n It's largely the same over here. That's what I love about good ol worldwide 4forums, we don't let too much politeness get in the way here. :p\n \n \nCan't comment, I don't know enough about your constitution. \n\n \n It's simple - religion can't be publicly established, and can't have its free exercise publicly prohibited. Different people have different ideas of when attacks on it in public education actually publicly prohibit it. With the vast majority of biologists being atheists, largely controlling every aspect of biological application and education, we're supposed to believe that everything suddenly snaps into 50/50 neutrality in publicly funded science education classrooms. Common sense and actual events tell me it's not going very well. \n \n Teacher's rant on Christians draws court rebuke\n \n For every child who goes to all the trouble to record his teachers rant against religion, how many go unrecorded? Thousands? Millions? \n \n \nI agree that the majority should decide where the money goes, but you sound as if you are demonising people who don't believe in ID as un-American. \n\n \n There is a difference between having a staunch belief in something, vs having an open mind about exploring its possibilities. Those who vehemently oppose both are who I \"demonize\".\n \n \n \nI dug this up on the first hit (google) about your president commenting about ID in schools.\n \n Bold by me.\n \n Obama on ID (Intelligent Design)\n \n Is he un-American? \n\n \n No, but I'd question his honesty. When he says \"that doesn't make faith any less important than science\", what consideration is he talking about? Public policy? Personal action? If it's personal action, that's something that is often altered by public policy. They're not going to be given equal consideration concerning public policy. As Phillip Johnson said, there will be a ruling realm, and a subordinate realm. \n \n \nWas he voted in by un-Americans?\n\n \n Don't get me started. ;)", 
   {
    "unicode_changes_made": true
   }, 
   357532, 
   null, 
   1245472920.0
  ], 
  [
   358000, 
   null, 
   "marc9000", 
   "Overall, Larni gave a very well reasoned reply. As long as the Theory of Evolution (ToE) sticks to what is says, it doesn't say a thing about Atheism or religion. Some people use it and go beyond it to say there is no God, but it does not say that. \n\n \n Talkorigins is a scientific website. Here are a few statements from their \"Index to Creationist Claims\";\n \n \nGod's omnibenevolence usually goes along with claims that He is all-knowing and all-powerful. But the three qualities are not compatible with the observation that there is suffering in the world. \n \n The same God that people consider all-good is credited with creating hell and banishing there all souls who do not accept Him. Allowing anyone to suffer ultimate torment for all eternity--particularly when it is within your power to prevent it--is arguably the greatest form of evil possible. The only point to causing pain and suffering with no chance of redemption is petty cruelty. \n \n Forcing someone to suffer for not returning your love is cruel, spiteful and petty. Society considers such behavior evil enough to enact laws to prevent it. \n \n Causing one person to suffer for eternity (even for a truly heinous crime) is bad enough. Causing billions of people to suffer for eternity (especially when most are guilty of nothing more than never having been taught the \"true\" religion) can only be considered vastly more sick, depraved and evil. \n \n The Bible itself says God created evil (\"I form the light, and create darkness: I make peace, and create evil: I the LORD do all these things.\"--Isa. 45:7). Genesis 2 says the tree of knowledge of good and evil existed in Eden before Adam and Eve interacted with it, implying that evil existed from the beginning. And God pronounced it good. \n\n \n Are these scientific statements? As a theistic evolutionist, do you agree with them? Should they be taught in public school science classes? Do studies in evolution inspire these kinds of statements? \n \n \n Years ago, people said Galileo's sun centered solar system attacked the Bible and oppressed scientists. The only thing that Galileo's theory attacked was a certain interpretation. The only thing that ToE attacks is a certain interpretation. There was a dramatic change possibly 70,000 years ago. Whether the complex sudden changes were that a group of statistically unlikely changes happened together, or that a God caused them to happen, science can't say. All science can say is that suddenly there were these beings that science calls fully modern Humans. As for the rest of time, Christians know that miracles are not common. Most of the time, it operates according to the laws God establishes. (eg ps 104:5 compared to what scientists say about the moon keeping the earth from tottering forever and ever. One act, and after that, the laws keep it going.) Therefore, the ToE could be true and Gen 1 could refer to specific points in time when God stepped in, and that Sin entered the world through Adam and that Jesus then had to die. Though Atheists try to use the ToE to prove there is no God, most scientists will say they have not proven that. Though IDers are welcome to try to prove their point scientifically, there is nothing solid yet. I as a Christian am much more willing to accept their studies than skeptical scientists, and I have seen nothing that I would use, yet.\n\n \n The simplest forms of life have been only recently found to be far more complicated than Darwin and most of even his current day followers originally believed. Do you think that gives ID a better chance of being accepted as science in the near future? Could the application of ID to the simplest forms of life possibly be compatable with the current ToE?", 
   {
    "unicode_changes_made": true
   }, 
   357896, 
   null, 
   1245473220.0
  ], 
  [
   358001, 
   null, 
   "marc9000", 
   "I think I see. \n\n \n Hmm - you think you see? I see uncertainty in your four words, and that's a good sign. Let's untangle the web of deceit;\n \n \nMarc's error is that because the Constitution does not support the establishment of his religion, that it opposes his religion. \n\n \n I've never said the Constitution opposes my religion, I've said that the scientific community publicly opposes my religion, in violation of the constitution. emoticon_idea\n \n \nThe government of the US is not anti-religious, it is secular. The purpose is to neither support or oppose any religion. \n\n \n And when a public entity like the scientific community opposes religion, it violates the constitution. \n \n \nHow sad that marc thinks that a document that guarantees his right to worship as he sees fit, without government interference, is somehow the imposition of another theological view. \n\n \n How sad that Pandion thinks that my posts indicate that I'm blaming the constitution for what the scientific community does. \n \n \nDoes not the Constitution guarantee my right to be free from his religion? \n\n \n Does not the Constitution guarantee a student in a publicly mandated science class to be free from atheism? \n \n \nI think that the idea is that the Constitution means that we are all free from any religion except that particular one that we choose to accept. \n\n \n That's what it means all right, now if only we had something besides the Dover court case to enforce it. \n \n \n \nI did a bit of back ground reading and it seems this part of your constitution was to stops us Brits pushing our religion on you damn Yankees rather than pushing a state religion (like us Limeys have). \n\n \n You're too hard on yourself. The founders recognized religion as a biased ideology. An ideology with special interests, political organization, and respected leaders. The scientific community is rife with all three.", 
   {
    "unicode_changes_made": true
   }, 
   357940, 
   null, 
   1245474000.0
  ], 
  [
   358009, 
   null, 
   "Accipiter", 
   "And when a public entity like the scientific community opposes religion, it violates the constitution.\n\n \n Why do you think the scientific community opposes religion?\n \n (Just curious.)", 
   {}, 
   358001, 
   null, 
   1245488820.0
  ], 
  [
   358021, 
   null, 
   "Penfold", 
   "As Marc knows, his country's constitution prohibits government interference in an individual's religion. The scientific community is not the government. He rails against a non-existent breach.", 
   {}, 
   358009, 
   null, 
   1245505140.0
  ], 
  [
   358076, 
   null, 
   "T.Q", 
   "The founders recognized religion as a biased ideology. An ideology with special interests, political organization, and respected leaders. The scientific community is rife with all three.\n\n \n So science is a religion? Jesus Marc...", 
   {}, 
   358001, 
   null, 
   1245526500.0
  ], 
  [
   358079, 
   null, 
   "pandion", 
   "I've never said the Constitution opposes my religion, I've said that the scientific community publicly opposes my religion, in violation of the constitution.\n\n What idiocy. Perhaps if you actually read the Constitution and learned something you wouldn't make yourself look like such a dunce. \n \n If a public school were to teach your religion as true in a science class, that would be a violation of the Constitution. The Constitution says, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" The 14th Amendment has extended that prohibition to all levels of the government, even including school boards.\n \n I know that you think that the laws of physics and chemistry violate your religion, but that's not the kind of laws that the Constitution is talking about. And that big bad science is not Congress or a division of government. Further, just because the findings of science have made your superstitious mythology look so foolish does not violate your right to practice that mythology. Science does not prohibit you from your spiritualistic practices nor does science dictate how you should adhere to your mythology.\n \n Science doesn't even care if you continue your silly paranoia. Just because you religion is laughable doesn't mean the science opposes it anyway. Science also opposes astrology. Neither opposition is a violation of the Constitution - you know - government.", 
   {
    "unicode_changes_made": true
   }, 
   358001, 
   null, 
   1245529740.0
  ], 
  [
   358103, 
   null, 
   "marc9000", 
   "Why do you think the scientific community opposes religion?\n \n (Just curious.)\n\n \n Because the scientific community seeks political and economic stature, and many ethical standards of religion get in its way. The scientific community seeks to increase its own power, to make morally troublesome decisions in a whole host of controversial issues; abortion, cloning, environmentalism, the buying and selling of human genes, stem cells, and body parts, etc. If humans are no more than accidents of \"natural selection\" just like animals, scientific activity, particularly in the medical field, can take on drastic changes from long held traditional moral standards. They want the world to belong to themselves and themselves alone, not God.", 
   {
    "unicode_changes_made": true
   }, 
   358009, 
   null, 
   1245555000.0
  ], 
  [
   358105, 
   null, 
   "marc9000", 
   "As Marc knows, his country's constitution prohibits government interference in an individual's religion. The scientific community is not the government. He rails against a non-existent breach.\n\n \n As atheists know, an exploration of ID in science classes in no way interferes with an individuals religion or lack of it, but it doesn't stop them from screaming that ID in science classes violates the establishment clause of the first amendment. They railed against a NON EXISTANT BREACH. But they have double standards, don't they?", 
   {
    "unicode_changes_made": true
   }, 
   358021, 
   null, 
   1245555180.0
  ], 
  [
   358109, 
   null, 
   "marc9000", 
   "So science is a religion? Jesus Marc...\n\n \n Of course I never said that - it's just a straw man that you built. The scientific community (mainly the biology division) has all the characteristics of religion. Science is one of their tools. You should try to distinguish between the two terms.", 
   {}, 
   358076, 
   null, 
   1245555540.0
  ], 
  [
   358110, 
   null, 
   "obvious_child", 
   "As atheists know, an exploration of ID in science classes in no way interferes with an individuals religion or lack of it\n\n \n Aside from ID being principally nothing more than Animism. \n \n ID should be taught in schools. If done honestly, then kids would reject it instantly. \n \n \"Intelligent Design is the belief that if something is too complex to understand or explain now, God or a higher being must be the cause.\"\n \n Never mind how that is exactly the same reason for crediting lightning to Zeus. Never mind how that is exactly the same as crediting the rain to the various native American rain Gods. Never mind how if we applied that to modern living, God/higher being causes my food to heat up in the microwave. \n \n \nbut it doesn't stop them from screaming that ID in science classes violates the establishment clause of the first amendment. They railed against a NON EXISTANT BREACH. But they have double standards, don't they?\n\n \n You ignore who actually is behind ID.", 
   {
    "unicode_changes_made": true
   }, 
   358105, 
   null, 
   1245555720.0
  ], 
  [
   358111, 
   null, 
   "marc9000", 
   "What idiocy. Perhaps if you actually read the Constitution and learned something you wouldn't make yourself look like such a dunce. \n\n \n All I'm doing is applying the constitution to atheism in exactly the same way it has ALREADY BEEN APPLIED TO ID. \n \n \nIf a public school were to teach your religion as true in a science class, that would be a violation of the Constitution. \n\n \n And if a public school were to imply atheism as true in a science class, without an alternative philosophy to balance it, that would also be a violation of the constitution. I know you'll assure me that talkorigins, Victor Stenger, and Richard Dawkins NEVER have their names mentioned in science classes. You'll assure me that ANYTIME a teacher goes on a rant against religion in a public school, at least one student will always have a tape recorder ready to go, and justice will always be done. Common sense tells me not to believe you. \n \n \nThe Constitution says, \"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.\" The 14th Amendment has extended that prohibition to all levels of the government, even including school boards.\n \n I know that you think that the laws of physics and chemistry violate your religion, but that's not the kind of laws that the Constitution is talking about.\n\n \n And I know that you think scientific exploration of the RECENTLY DISCOVERED complexities of the simplest forms of life by means of ID establish a religion, but that's not the kind of extablishment the first amendment, or the Constitution is talking about. \n \n \nAnd that big bad science is not Congress or a division of government. \n\n \n Just like big bad ID is not Congress or a division of government. \n \n \nFurther, just because the findings of science have made your superstitious mythology look so foolish does not violate your right to practice that mythology. Science does not prohibit you from your spiritualistic practices nor does science dictate how you should adhere to your mythology.\n\n \n Just like the recently discovered complexities of the simplest forms of life have made today's atheistic scientific community look so foolish, as they continue to be baffled by origins of life. New public methods of studying origins of life don't violate atheists right to practice their lifestyle. Why did the courts say it was? Double standards, big money influence? \n \n There seems to be a genuine anger within the scientific community about recent biological discoveries. If they sought the truth, rather than to fulfill their faith of Darwinism, they would probably be less angry. \n \n \nScience doesn't even care if you continue your silly paranoia. Just because you religion is laughable doesn't mean the science opposes it anyway. Science also opposes astrology. Neither opposition is a violation of the Constitution - you know - government.\n\n \n Science is a subject, it is not capable of \"caring\", or \"opposing\". Please try to distinguish between science, and a biased, imperfect scientific community. The scientific community may not care about my silly paranoia, but they sure have a silly paranoia about ID, don't they?", 
   {
    "unicode_changes_made": true
   }, 
   358079, 
   null, 
   1245556200.0
  ], 
  [
   358113, 
   null, 
   "marc9000", 
   "Aside from ID being principally nothing more than Animism. \n \n ID should be taught in schools. If done honestly, then kids would reject it instantly. \n \n \"Intelligent Design is the belief that if something is too complex to understand or explain now, God or a higher being must be the cause.\"\n \n Never mind how that is exactly the same reason for crediting lightning to Zeus. Never mind how that is exactly the same as crediting the rain to the various native American rain Gods. Never mind how if we applied that to modern living, God/higher being causes my food to heat up in the microwave. \n\n \n I've already seen all the descriptions of ID by those who choose to dismiss it in 5 seconds, without a long enough attention span to explore it. \n \n \n \n \nYou ignore who actually is behind ID.\n\n \n What about those who are actually behind ID? Is opposition to it about personal attacks against people? How does the bias in their credentials compare with those of Stenger and Dawkins?", 
   {}, 
   358110, 
   null, 
   1245556620.0
  ], 
  [
   358116, 
   null, 
   "obvious_child", 
   "I've already seen all the descriptions of ID by those who choose to dismiss it in 5 seconds, without a long enough attention span to explore it.\n\n \n Just because we dismiss it does not mean we have not explored it. ID is a failure because it is Animism at its core logic. What is too complex to explain now is evidence of a higher being. ID is a pseudo science grab for people either trying to sneak creationism back into schools or those who cannot accept that their beliefs are purely emotional. \n \n Good luck proving that my depiction of ID isn't what ID is. \n \n The last thing IDers should want is ID taught honestly in schools. That's a sure fire way to get kids to reject it. \"Don't know = Goddidit.\"\n \n \nWhat about those who are actually behind ID?\n\n \n Creationists. Seems to suggest your commentary (like normal) is wrong. \n \n \nIs opposition to it about personal attacks against people? How does the bias in their credentials compare with those of Stenger and Dawkins?\n\n \n Care to cite such incidents?", 
   {}, 
   358113, 
   null, 
   1245562260.0
  ], 
  [
   358118, 
   null, 
   "Accipiter", 
   "Because the scientific community seeks political and economic stature, and many ethical standards of religion get in its way. The scientific community seeks to increase its own power, to make morally troublesome decisions in a whole host of controversial issues; abortion, cloning, environmentalism, the buying and selling of human genes, stem cells, and body parts, etc. If humans are no more than accidents of \"natural selection\" just like animals, scientific activity, particularly in the medical field, can take on drastic changes from long held traditional moral standards. They want the world to belong to themselves and themselves alone, not God.\n\n \n The same can be said of religion.", 
   {
    "unicode_changes_made": true
   }, 
   358103, 
   null, 
   1245566880.0
  ], 
  [
   358121, 
   null, 
   "pandion", 
   "All I'm doing is applying the constitution to atheism in exactly the same way it has ALREADY BEEN APPLIED TO ID.\nID is religion and can't be taught in science classes. Atheism, although not a religion, isn't taught. Biology is not a form of atheism.\n \nAnd if a public school were to imply atheism as true in a science class, without an alternative philosophy to balance it, that would also be a violation of the constitution.\nYes, it would. But atheism isn't taught in science class. Further, only dimwits think that the Constitution requires an \"alternative philosophy\" to modern science to balance it. That has been rejected by every court that has considered the issue. The mythology of creationism is religion with no foundation in reality.\n \nI know you'll assure me that talkorigins, Victor Stenger, and Richard Dawkins NEVER have their names mentioned in science classes.\nWho is Victor Stenger and why should the mention of his name in science class be important? I know who Dawkins is, but you'll have to offer more than your hysterical fear of the mention of his name is actually justified by the mention of his name. What science classes - when and where and by whom. Moreover, in what context were their names mentioned. I'll bet that Ken Miller's name has been mentioned more times than either of yours put together, and yet Ken Miller is a christian. Why should the mention of his name cause distress for scientists?\n \nYou'll assure me that ANYTIME a teacher goes on a rant against religion in a public school, at least one student will always have a tape recorder ready to go, and justice will always be done. Common sense tells me not to believe you.\nActually, common sense should tell you not to invent such idiotic scenarios and attribute them to me. As far as I am aware, no such rants have ever taken place. In my experience, there are far more rants by creationists, who even do their ranting at school board meetings.\n \n Besides, what you characterize as a rant by a teacher against religion is probably just a teacher trying to explain that the superstition of religious mythology has no place in a science classroom. Justice should be done when students who cause disturbances when they find that scientific facts and theories disagree with their particular mythological superstitions. The teacher should be allowed to permanently eject them from the class.\n \nAnd I know that you think scientific exploration of the RECENTLY DISCOVERED complexities of the simplest forms of life by means of ID establish a religion, but that's not the kind of extablishment [sic] the first amendment, or the Constitution is talking about.\nHow do you know that? What RECENTLY DISCOVERED complexities are you babbling about? I do know that the ID creationist movement began about 18 years ago and the proponents have made promises of scientific research programs. I also know that there have been none - nothing published. No discoveries recently or ever about simple forms of life establishing a religion. Are you smoking something? Can I get some?\n \n Actually, the Constitution is talking about any establishment of religion by the government. If the government were to support the teaching of ID creationism in science classes, that would violate the Establishment Clause. However, on the other hand, you are actually free to adopt any mythological superstition as your religion that you wish. You are free to practice that superstition as you see fit without interference from the government. But you are not permitted to impose your mythology on everyone through our public schools just because you fail to understand what science is and how it works, and in fact don't want to learn. By the same token, I may not teach my religion as a matter of science. That's not a problem for me. Science isn't my religion and I have never presented religious matters in science classes.\n \nJust like big bad ID is not Congress or a division of government.\n\n Of course it isn't. ID creationism is religion. Are you not aware of the court cases that have found it to be so? As a result, the presentation of ID creationism, because it is religion, cannot be presented in public schools as science. That would be unconstitutional. On the other hand, science is not religion and is actually the proper subject for presentation in science classes. Why is that concept so hard for you to grasp?\n \nJust like the recently discovered complexities of the simplest forms of life have made today's atheistic scientific community look so foolish, as they continue to be baffled by origins of life.\n\n Again, what are you talking about? I certainly hope that it isn't the bacterial flagellum, since that is neither recent nor baffling. Of course, the origin of life is not a question of evolutionary theory. It may be a question of a field of biology called abiogenesis. But, recent discoveries have allowed the manufacture of synthetic life forms. Some of these were imitations of real organisms that were assembled a nucleotide at a time, others were inventions of man that do not exist in nature. But they live! (Well, except for the artificial viruses. They are mostly defined as being outside of living organisms.) In fact, there are no recent discoveries by ID creationists that point out complexities that were previously unknown by real scientists. On the other hand, there have been recent discoveries that have been published in scientific literature that document the creation in the lab of artificial viruses and bacteria.\n \nNew public methods of studying origins of life don't violate atheists right to practice their lifestyle.\nBut ID creationists haven't published any new methods of studying life. What is even worse, even if it were true, there is no such thing as an atheist life style. You've actually gone off the deep end here.\n \n Why did the courts say it was? Double standards, big money influence?\nThe courts have said that religion may not be presented as science in public school science classes. The courts have said that creationism, creation science, and ID creationism are religious in nature and therefore may not be presented in public schools. On the other hand, the scientific theories of evolution have been found to be evidence based science and non-religious in nature.\n \nThere seems to be a genuine anger within the scientific community about recent biological discoveries. If they sought the truth, rather than to fulfill their faith of Darwinism, they would probably be less angry.\nWhat discoveries? Again you babble about nonsense. Please tell us in which scientific journal these scientific discoveries have been published. Science doesn't seek truth (and neither does any religion). Science seeks explanations for observed facts that have been verified. When a scientific explanation if found to be in conflict with reality, the science is rejected or adjusted. When religious truth is found to be in conflict with reality, reality is rejected. Your superstitious mythology is always true no matter how idiotic it becomes.\n \nScience is a subject,\n\n Actually, science is a process of offering and testing naturalistic explanations for naturalistic processes. If an explanation fails a test, it is rejected. That is why spiritualism, super-naturalism, and mythology have not been allowed to be taught as science in public schools. They are mostly not subject to test. They are based on belief in mythology and magic. Any time that someone has actually offered an hypothesis of superstitions mythology that has been able to testing, the hypothesis has failed the test. Of course, there are many christian schools that teach the above in lieu of science.\n \nit is not capable of \"caring\", or \"opposing\".\nI know. And that is puzzling since it is you who has characterized science at opposing or fighting against your superstitious mythology. It has always been my position that \"science\" doesn't actually give a rat's tootie about what your mythology asserts.\n \nPlease try to distinguish between science, and a biased, imperfect scientific community.\nAs opposed to the biased and imperfect religious community? As a scientist, my bias is in favor of empirical evidence. Show me evidence the the earth is only 6,000 years old. Show me evidence that women are made from man. Show me evidence of a great FLUD and \"kinds\" of living organisms. Show me evidence that 8 people could load and care for millions of species of living organisms on that little wooden box for a year. Or, as an alternative, show me evidence that 36 species of cat, in three genera, could have evolved from a single pair of the cat kind in a few hundred years, along with the several genera and many known species of extinct cat. Follow that up with the species of canid (dog) - even more numerous than cats.\n \n In other words, show me any bit of evidence that your superstitious mythology has the slightest possibility of being true. Please stop with the whining about your Constitutional rights unless you understand your rights and my rights, and unless you can actually present real evidence.\n \nThe scientific community may not care about my silly paranoia, but they sure have a silly paranoia about ID, don't they?\nWell, at least you admit your silly paranoia. That's a step. On the other hand, the only reason that any scientist has come to care about ID creationism is because of efforts by creationists to introduce it as science in public school classrooms. If it were not for the religious zealots who pretend that because they are prohibited from imposing their religion on all public school students, their constitutional rights are being violated. The logic seems to be that because the Constitution prohibits Congress, and by incorporation under the 14th Amendment, all bodies of government from making laws regarding an establishment of religion, this somehow means that spiritualism and the mythology of bronze age, nomadic herdsmen must be taught as science, because to prohibit the teaching of such superstition would be making a law about an establishment of religion. Sadly, creationists have little understanding of the Constitution. They seem to continue to maintain their historical position of opposition to the Constitution and the Bill of Rights. The major opposition to the ratification of both documents was from christian churches.", 
   {
    "unicode_changes_made": true
   }, 
   358111, 
   null, 
   1245570900.0
  ], 
  [
   358122, 
   null, 
   "pandion", 
   "Jesus Marc...\nSo, it's not Jesus Christ?", 
   {}, 
   358076, 
   null, 
   1245570960.0
  ], 
  [
   358198, 
   null, 
   "Archangel", 
   "Just because we dismiss it does not mean we have not explored it. ID is a failure because it is Animism at its core logic. \n Good luck proving that my depiction of ID isn't what ID is. \n\n \n Your error in stating that Intelligent Design equals animism is the epitome of ignorance as you once again reveal how little you understand about that which you speak. Now I realize that you will take this evidence and squirm in 3 different directions as you insist you are right. But that wont change the fact that you are as wrong as only you are capable of being. \n Animism:Greeks, Romans, Santeria, Voodoo, American Indians, Mayas, Witches, Ancestors, Hindus...\n \n The \"Primitive Religions\" were born in the five Continents, more than 3,000 years ago, mostly in the form of \"Animism\", because they believed that everything has a \"soul\", an \"anima\" in Latin, a \"spirit\"... including animals, plants, rocks, mountains, rivers, stars... each \"anima\" is powerful, spiritual, that can help or hurt them, including the souls of the dead, the \"ancestors\".\n \n For thousands of years they deified animals, stars, idols of any kind... and practiced Spiritism, witchcraft, divination, astrology... and they used magic, spells, enchantments, superstitions, prayers, amulets, talismans, charms... often with the worship of an Absolute, or the Great One...\n \n Today Animism is represented, among others, by the Mormons, Hinduism and the New Age. They proclaim that every human is God, and their practices will help each one to realize it.\n \n The Bible destroys this way of thinking in the first verse of he Bible:\n 1 In the beginning God created the heavens and the earth. (Gen.1:1). There is only one God, everything else in the heavens or earth are \"creatures of God\". The sun and the moon are \"creatures of God\", and the rocks and animals and oceans, and all the mountains and stars, and each man and woman is also a \"creature of God\", is not God.\n \n But they usually did not care much about a Creator God, only about the \"spirits\" that can help or hurt them... and what they sometimes called \"gods\", are \"demons\"... or simply a \"lie\"... and this is why the Bible condemns them with very strong words: abominations to God, stone them to death, the fire shall burn them (Deut.18, Lev.20, Isa.47).\n - 10There shall not be found among you any one that maketh his son or his daughter to pass through the fire, or that useth divination, or an observer of times, or an enchanter, or a witch. 11Or a charmer, or a consulter with familiar spirits, or a wizard, or a necromancer. 12For all that do these things are an abomination unto the LORD: and because of these abominations the LORD thy God doth drive them out from before thee. (Deut.18:10-12)\n - 27 \" 'A man or woman who is a medium or spiritist among you must be put to death. You are to stone them; their blood will be on their own heads.' \" (Lev. 20:7).\n - 12Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail. 13Thou art wearied in the multitude of thy counsels. Let now the astrologers, the stargazers, the monthly prognosticators, stand up, and save thee from these things that shall come upon thee. 14Behold, they shall be as stubble; the fire shall burn them; they shall not deliver themselves from the power of the flame: there shall not be a coal to warm at, nor fire to sit before it. (Is.47:12-13)\n \n God, for the Animist, is not a person... as for the Hindu, god is the Energy, the Force, the Power, the Universal Mind, the Absolute, the Unknown, the Divine Being... is not a \"he\" but an \"it\"... it is not somebody but something... but something powerful able to get wonderful things for you using Magic... and worshiping it!... yes, worshiping the Force or the Energy...\n \n Since god is not a person, there are no revelations from a non-person... you never find in Animism or Wicca or Hinduism, God said... Yahweh calls...\n \n The gods never existed, they are the product of novels or the imagination... they are myths, legends... but they never existed and they do not exist today.\n \n The big problem is that \"Today\" an estimated 40% of the world's population is animistic (Van Rheenen), including all kinds of occultism, often in syncretism with Christianity, Islam, Buddhism...\n \n The Animism is attractive because infuses the sacred into the real life, and mainly, because offers people a way to cope with one's everyday needs and problems: Healing of an illness, to be successful in a business, or in love, or to find a job, or to restore a soured relationship, to find a mate, to gain guidance for the future...\n \n The animist views the \"formal religions\" as being relevant with respect to \"ultimate\" issues, but irrelevant when it comes to addressing the \"immediate\" issues of everyday life... which is totally wrong!, because Christianity, Islam, and all \"formal religions\" deal with issues of every day's life... but this is the reason why a Christian or a Jew go to the witch or consult the Zodiac... They go to church on Saturday or Sunday to take care of their soul, and they go to the witch or astrologer on Monday to take care of their business or illness... absolutely wrong!...\n \n Come to Jesus... Believe in him!... is the solution of all the problems in this life, and on top of the glorious life on earth, he offers you eternal life of joy in Heaven.\n \n \n The World View of Animism: \n \n Pantheism is the first logical consequence of Animism: All the world is divine: A mountain is god, a rock, an animal... you are god!... though you can't make stars not even atoms, but you are god!... a planet, and even a cockroach is god!... they are the \"idols\" often mentioned in the Bible.\n \n Polytheism is the next obvious consequence: There are thousands of gods... the concept of 333 million deities is believed to emphasize the fundamental doctrine of Animism, Hinduism, Wicca... \n \n The first verse of the Bible contradicts these views: In the beginning God created the heavens and the earth... so, in the Bible, there is one God, a person, and everything else in the world are creatures of God... God created and is the soul and life and is inside everything, but everything is not God... there is only one God, Creator.\n \n Of course, for Animists or Hindus, the aim of this life is to stop the relentless and frightful reincarnation, and become nothingness, not-a-person, but the drop of water in the ocean of the Absolute... for a Christian, an eternal life of joy is waiting, and not like a drop of water, but as a person, recognizable by God and by every neighbor... a person!, an individual!, eternally!, as God is an eternal Person!... eternally in Hell or in Heaven!...Religion and Cults - Animism\n \n So you see, those who worship idols and such are the practitioners of animism. Judaism and evangelical christianity condemn such practices as abominations before God. And that is because the God of the Old and New Testament also condemns such practices throughout His word. So you have once again blatantly and ignorantly misrepresented what the bible and God Himself stands for and represents to us as His Truths. So in short order I have easily proven that according to what animism is, it plays no actual part in the scriptural perspective of how, why and who Man is according to our relationship with the living God.", 
   {}, 
   358116, 
   null, 
   1245634380.0
  ], 
  [
   358201, 
   null, 
   "Archangel", 
   "ID is religion and can't be taught in science classes. Atheism, although not a religion, isn't taught. Biology is not a form of atheism.\n\n \n Although the bolded is technically true from a secular/humanistic perspective, according to the living God who is offended by any form of idolatry, any philosophy which detracts from Him or draws His children away from Him is deemed as idolatry. \n \n That is why christians see evolution as a philosophical enemy of God. Not because it specifically teaches that God doesn't exist, but because it doesn't acknowledge the part God played in creating all that exists in time and space. It attempts to explain our existence apart from an intelligent being.", 
   {}, 
   358198, 
   null, 
   1245635820.0
  ], 
  [
   358244, 
   null, 
   "Penfold", 
   "The above demonstrates how a misunderstanding of animism can come from introducing complexity before grasping the essentials. Animism is the earliest building block in man's primitive religious belief systems. In seeking to understand the world around him, he apportioned supernatural causation to things not understood, and first conceived the concept of the soul. \n Animism lies at the foundation of all religion. It signifies man's earliest attempts to understand his surroundings, and take to himself the perception of control of them. Events outwith his control or understanding were attributed to supernatural causes. ID is no more than animism rationalised with a thin veneer of pseudoscientific jargon.", 
   {}, 
   358201, 
   null, 
   1245656100.0
  ], 
  [
   358249, 
   null, 
   "obvious_child", 
   "The above demonstrates how a misunderstanding of animism can come from introducing complexity before grasping the essentials. Animism is the earliest building block in man's primitive religious belief systems. In seeking to understand the world around him, he apportioned supernatural causation to things not understood, and first conceived the concept of the soul. \n Animism lies at the foundation of all religion. It signifies man's earliest attempts to understand his surroundings, and take to himself the perception of control of them. Events outwith his control or understanding were attributed to supernatural causes. ID is no more than animism rationalised with a thin veneer of pseudoscientific jargon.\n\n \n Ssssh. Arch is not capable of moving beyond the surface. I already explained this to him and he completely and utterly failed to grasp it. \n \n Instead of lightning, it's the eye.", 
   {}, 
   358244, 
   null, 
   1245661620.0
  ], 
  [
   358250, 
   null, 
   "Larni", 
   "Please ignore.", 
   {}, 
   358198, 
   null, 
   1245667860.0
  ], 
  [
   358254, 
   null, 
   "Archangel", 
   "The above demonstrates how a misunderstanding of animism can come from introducing complexity before grasping the essentials. Animism is the earliest building block in man's primitive religious belief systems. In seeking to understand the world around him, he apportioned supernatural causation to things not understood, and first conceived the concept of the soul. \n Animism lies at the foundation of all religion. It signifies man's earliest attempts to understand his surroundings, and take to himself the perception of control of them. Events outwith his control or understanding were attributed to supernatural causes. ID is no more than animism rationalised with a thin veneer of pseudoscientific jargon.\n\n \n If you can show that Intelligent Design attributes a soul to plants, rocks, trees and all types of inanimate objects, and natural phenomena in causing the creation of the world and everything in it, then I will agree with you. But you can't do that because it is a patently ridiculous proposition. Intelligent Design proposes that God, an all powerful intelligent being created all that is, not that everything created by the intelligent designer has a soul which animism proposes.", 
   {}, 
   358244, 
   null, 
   1245673320.0
  ], 
  [
   358259, 
   null, 
   "Penfold", 
   "Your concrete literalist thinking leads you astray again. No-one is suggesting rocks have souls, although if souls existed, why not all living things? Animism first proposed the existence of magical beings who made everything. Animism included everything in that creation, and included multiple creators and multiple receivers of souls. Such inclusion evolved to exclude many things (such as rocks, plants, trees, animals) until some religions evolved to the extent of exclude all gods but one, which resided in only one of its creations.\n ID is merely an updated version of that early superstition, which postulated that since the making of the world was beyond their capability, it must have been some imaginary invisible undetectable being.", 
   {}, 
   358254, 
   null, 
   1245675480.0
  ], 
  [
   358265, 
   null, 
   "Archangel", 
   "Your concrete literalist thinking leads you astray again. No-one is suggesting rocks have souls, although if souls existed, why not all living things? Animism first proposed the existence of magical beings who made everything. Animism included everything in that creation, and included multiple creators and multiple receivers of souls. Such inclusion evolved to exclude many things (such as rocks, plants, trees, animals) until some religions evolved to the extent of exclude all gods but one, which resided in only one of its creations.\n ID is merely an updated version of that early superstition, which postulated that since the making of the world was beyond their capability, it must have been some imaginary invisible undetectable being.\n\n \n Wrong again!!! Animism believes that every object has a soul which is why animists worship stone and wooden idols and idols made of any inanimate objects. They even believe that weather systems have souls. To equate this belief to ID is to corrupt and pervert ID at its most basic level.\n \n ID believes that an intelligent designer created all that is, not that everything in existence shares the universal soul of the intelligent designer who created everything.", 
   {}, 
   358259, 
   null, 
   1245677460.0
  ], 
  [
   358270, 
   null, 
   "chester", 
   "Although the bolded is technically true from a secular/humanistic perspective, according to the living God who is offended by any form of idolatry, any philosophy which detracts from Him or draws His children away from Him is deemed as idolatry. \n \n That is why christians see evolution as a philosophical enemy of God. Not because it specifically teaches that God doesn't exist, but because it doesn't acknowledge the part God played in creating all that exists in time and space. It attempts to explain our existence apart from an intelligent being.\n\n \n Believe what you will.\n \n I very much prefer this: \n \n \"The correct scientific response to something that is not understood must always be to look harder for the explanation, not give up and assume a supernatural cause.\"\n David Attenborough", 
   {}, 
   358201, 
   null, 
   1245679860.0
  ], 
  [
   358276, 
   null, 
   "Penfold", 
   " ........\n \n ID believes that an intelligent designer created all that is, .......\n\n \n And the reason they believe this? ..... Because we can't do it, it must have been magic. Just like the Animists.\n \n It's like getting blood from a soulless stone.", 
   {}, 
   358265, 
   null, 
   1245683220.0
  ], 
  [
   358286, 
   null, 
   "Archangel", 
   "Believe what you will.\n \n I very much prefer this: \n \n \"The correct scientific response to something that is not understood must always be to look harder for the explanation, not give up and assume a supernatural cause.\"\n David Attenborough\n\n \n Attenborough's premise would be fine if God did not in fact create all that is. So that question is answered. As for using science to investigate the unknown, my belief system is fine with that, of course.", 
   {}, 
   358270, 
   null, 
   1245689940.0
  ], 
  [
   358288, 
   null, 
   "Accipiter", 
   "Science is mostly interested in the questions that have answers not so much the questions that can not be answered.\n \n That is why science will not investigate weather or not there is a god because there is no way to answer that question and trying to would be a waste of time and money.\n \n The conflict between science and religion has a direction and that direction is religion opposes science, science does not oppose religion.\n \n People think that since we have found that the bible is untrue in many respects, that it means science and reason have disproved god but nothing could be farther from the truth.", 
   {}, 
   358286, 
   null, 
   1245693300.0
  ], 
  [
   358309, 
   null, 
   "obvious_child", 
   "Wrong again!!! Animism believes that every object has a soul which is why animists worship stone and wooden idols and idols made of any inanimate objects. They even believe that weather systems have souls. To equate this belief to ID is to corrupt and pervert ID at its most basic level.\n \n ID believes that an intelligent designer created all that is, not that everything in existence shares the universal soul of the intelligent designer who created everything.\n\n \n LOL. Penfold is discussing the reasons for why Animism assigned its animistic beliefs and thus its core logic. You are stuck at the surface as to why Animism did rather than move below the superficial into its core logic and principles. Instead of talking about why you are only talking about what. Hence why we laugh at you. You are trying to argue that the superficial appearance of Animism negates our arguments about the primary core logic and principles of why Animism did what it did. You are arguing that the ocean is calm by looking at the surface while we are discussing the turbulence of underwater currents. We move below the surface, while you are stuck.", 
   {}, 
   358265, 
   null, 
   1245709800.0
  ], 
  [
   358328, 
   null, 
   "Archangel", 
   "LOL. Penfold is discussing the reasons for why Animism assigned its animistic beliefs and thus its core logic. You are stuck at the surface as to why Animism did rather than move below the superficial into its core logic and principles. Instead of talking about why you are only talking about what. Hence why we laugh at you. You are trying to argue that the superficial appearance of Animism negates our arguments about the primary core logic and principles of why Animism did what it did. You are arguing that the ocean is calm by looking at the surface while we are discussing the turbulence of underwater currents. We move below the surface, while you are stuck.\n\n \n Unlike you, I don't feel like having the same debate on two threads. So here you go: http://www.4forums.com/political/358324-post14.html", 
   {}, 
   358309, 
   null, 
   1245715620.0
  ], 
  [
   358368, 
   null, 
   "obvious_child", 
   "Unlike you, I don't feel like having the same debate on two threads. So here you go: http://www.4forums.com/political/358324-post14.html\n\n \n Your epic failure to understand the terms \"why\" and \"what\" is your downfall. \n \n What is it is different from Why did they do it?\n \n Seriously, before I didn't think you were that intellectually deficient to fail to understand the difference between those words. But clearly are you.", 
   {}, 
   358328, 
   null, 
   1245733860.0
  ], 
  [
   358380, 
   null, 
   "Larni", 
   "Because the scientific community seeks political and economic stature,\n \n \n This is simply untrue. Individual scientists may seek political power just like anyone else. But the scientific community as a whole does not.\n \n Would you argue the same things against Lawyers? Your god does not come into the equation when a prosecution and defence is layed. \n \n Do you beleive they are against your particular god?\n \n \nand many ethical standards of religion get in its way. \n\n \n I'm current involved in carrying out research and I can tell you that the only ethical standards I have to reach are those set by the locale Ethics Board. This is not part of the 'ethical standards of religion' and is the most torturous set of hoops any one can jump through. \n \n I could no more do harm because of the hypersensitivity of this Board than I could walk to the moon. Nothing to do with the 'ethical standards of religion'.\n \n You seem to characterise scientist as one homolgous group. Nothing can be further from the truth: if you want to see two people fight it out, put two scientist with slightly different paradigms in a room, then stand back.", 
   {}, 
   358103, 
   null, 
   1245750780.0
  ], 
  [
   358381, 
   null, 
   "Larni", 
   "That is why christians see evolution as a philosophical enemy of God. Not because it specifically teaches that God doesn't exist, but because it doesn't acknowledge the part God played in creating all that exists in time and space. It attempts to explain our existence apart from an intelligent being.\n\n \n But don't you see. This is only a problem for people who believe in your particular version of a god. \n \n The only reason for regecting the findings of science is if it conflicts with with your version of a god.\n \n This is an a priori assumption and obviously flawed.\n \n If you regect science on these grounds I support you right to do so, but should you not regect all science? \n \n Biology uses the scientific method no different to psychology or physics.", 
   {}, 
   358201, 
   null, 
   1245751080.0
  ], 
  [
   358384, 
   null, 
   "Archangel", 
   " \n That is why christians see evolution as a philosophical enemy of God. Not because it specifically teaches that God doesn't exist, but because it doesn't acknowledge the part God played in creating all that exists in time and space. It attempts to explain our existence apart from an intelligent being.\n \n\n \n \nBut don't you see. This is only a problem for people who believe in your particular version of a god. \n \n The only reason for regecting the findings of science is if it conflicts with with your version of a god.\n \n This is an a priori assumption and obviously flawed.\n \n If you regect science on these grounds I support you right to do so, but should you not regect all science? \n \n Biology uses the scientific method no different to psychology or physics.\n\n \n In responding to your post, I also said this in that post which you redacted:\n \n \n \n Although the bolded is technically true from a secular/humanistic perspective, according to the living God who is offended by any form of idolatry, any philosophy which detracts from Him or draws His children away from Him is deemed as idolatry. \n\n \n You see, I was describing Gods opinion about these philosophies according to His own word which demands that any rejection of His place and part in our creation is jealously seen as Idolatry which means it's the worship of false gods, or idolatry since they bow at the alter of this false science.\n Exd 20:1 And God spoke all these words, saying:\n Exd 20:2 \"I am the LORD your God, who brought you out of the land of Egypt, out of the house of bondage.\n Exd 20:3 \"You shall have no other gods before Me.\n Exd 20:4 \"You shall not make for yourself a carved image--any likeness of anything that is in heaven above, or that is in the earth beneath, or that is in the water under the earth;\n Exd 20:5 you shall not bow down to them nor serve them. For I, the LORD your God, am a jealous God, visiting the iniquity of the fathers upon the children to the third and fourth generations of those who hate Me,\n Also Larni, I don't reject science at all. I respect it as Mans ability to discern and define the world we live in in an organized manner. But I do reject this so called science of evolution which denies the true origins of humanity by misinterpreting how we came to be by its claim that we evolved from lower animals over millions of years. This philosophy is patently false and intended to draw people away from our true origin which is the Genesis Creation account.", 
   {}, 
   358381, 
   null, 
   1245759000.0
  ], 
  [
   358392, 
   null, 
   "Larni", 
   "But I do reject this so called science of evolution which denies the true origins of humanity by misinterpreting how we came to be by its claim that we evolved from lower animals over millions of years.\n\n \n You are rejecting science. \n \n Just like I would be rejecting your god if I rejected the only the Genesis account of creation. How could I believe in your god if I did not believe in Genesis?\n \n How can you 'accept science' but reject biology, physic, geology, to name but a few?\n \n You can't pick and choose.\n \n \nThis philosophy is patently false and intended to draw people away from our true origin which is the Genesis Creation account.\n\n \n A priori assumption and a patently absurd prejudice about the motives of scientists.\n \n If I said all xians are right wing bigots would you believe me? No, of course not because it's not true.\n \n You can't ascribe motives to people as a homolgous group like that.", 
   {}, 
   358384, 
   null, 
   1245763560.0
  ], 
  [
   358396, 
   null, 
   "obvious_child", 
   "Also Larni, I don't reject science at all.\n\n \n Uh, yeah you do. In most posts you reject science as a whole.\n \n Remember, you stated that density is a key factor in sorting in a fluid medium was \"ludicrous.\" Too bad you can test this in your sink to show that it is in fact true. \n \n Furthermore, you have called for more nuclear power which rests upon the same principles as radiometric dating yet have called the assumptions and principles of radiometric dating \"false.\" We have repeatedly pointed this out to you and all you do is throw hissy fits and toss horrible insults at us rather than address how you called the basis of nuclear power \"false.\" \n \n And you have cited a theory of creationist plate tectonics that is so implausible that many other Creationists reject it due to its heat issues. A theory that its creator has admitted required miracles to function. \n \n Historically, you argued that bees can't fly according to modern understanding. Too bad that you were flat out wrong as the basis of bumblebee flight is the same as the physics that allows helicopters to fly. \n \n You wonder why we don't take you seriously? \n \n You reject science on a daily basis which enjoying its products everyday. Contradictions are the blood of YEC.\n \n \nI respect it as Mans ability to discern and define the world we live in in an organized manner.\n\n \n Except when it rejects a young Earth. Which mostly all of it does. \n \n \nBut I do reject this so called science of evolution which denies the true origins of humanity by misinterpreting how we came to be by its claim that we evolved from lower animals over millions of years.\n\n \n And what evidence do you have to suggest there is misrepresentation? I mean actual evidence. Not the Bible. \n \n \nThis philosophy is patently false and intended to draw people away from our true origin which is the Genesis Creation account.\n\n \n Never mind how your belief mandates God to be a liar.", 
   {}, 
   358384, 
   null, 
   1245764280.0
  ], 
  [
   358398, 
   null, 
   "Penfold", 
   "\n Also Larni, I don't reject science at all. I respect it as Mans ability to discern and define the world we live in in an organized manner. \n\n \n \n You were doing pretty well up to this point, then you completely contradicted this claim.", 
   {}, 
   358384, 
   null, 
   1245764700.0
  ], 
  [
   358419, 
   null, 
   "Accipiter", 
   "If the science of evolution is wrong then all of science must be filled misinformation.", 
   {}, 
   358384, 
   null, 
   1245786120.0
  ], 
  [
   360625, 
   null, 
   "MarielB", 
   "Just pointing out that the first definition of theory in the American dictionary is the correct one to use regarding evolution. \n \"A set of statements or principles devised to explain a group of facts or phenomena, especially one that has been repeatedly tested or is widely accepted and can be used to make predictions about natural phenomena.\"\n \n If someone did so already, I apologize. I can't navigate through all these posts and counter-posts as easily as you all do.\n \n \n There is OVERWHELMING evidence in support of evolution. The fossil record is quite convincing, but is only one factor. \n \n (What's New in An Index to Creationist Claims)\n \n Genetics also presents excellent evidence. The fact that we share over 90% of our DNA with higher primates for instance. (Comparing Genomes - Page 1)\n The fact that we still have DNA for tails\n (see: Evidence for Evolution (Page 11))\n \n The fact that cephalopods have no blind spot and we do\n (See: Pax-6: Where to be conserved is not?conservative ? PNAS)\n \n There is much, much more. \n This website explains how science and faith can work well together, if you care to read it.\n http://www.songofgenesis.org", 
   {
    "post_info": {
     "post_title": "Evolution...what facts... theories?"
    }
   }, 
   358419, 
   null, 
   1247604120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  evolution what facts are there that prove it or all they all theorys ?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 12338, 
  "discussion_files": [
   [
    "4098.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-print.html"
   ], 
   [
    "4099.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-8-print.html"
   ], 
   [
    "4100.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-6-print.html"
   ], 
   [
    "4101.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-4-print.html"
   ], 
   [
    "4102.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-5-print.html"
   ], 
   [
    "4103.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-7-print.html"
   ], 
   [
    "4104.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-3-print.html"
   ], 
   [
    "4105.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/12338-evolution-what-facts-there-prove-all-they-all-theorys-2-print.html"
   ]
  ], 
  "identifier": 12338
 }
]