[
 [
  [
   22041, 
   null, 
   "superbuddhaman", 
   "It sure is funny how many times the \"pro-lifers\" claim a victory- and yet that victory is quickly overturned by the supreme authority in this country- which is not the senate, not the president, it is the COURT.\n I find it truly insulting that this great nation, which was founded upon the idea of religious freedom has allowed so many of its laws to be affected by the over-dominant christian right. If we put aside the bible, the commandments, and the intentionally biased commentaries of christian leaders, what argument is left? \n The Christian right will say that all life is precious, but obviously there are tiers. An unborn, unwanted, and even sometimes malformed child is more precious than that of the mother. Who cares if she was raped? Who cares if she was the victim of incest? Who cares if the child she carries has tested positive for all sorts of defects- \"My preacher says it's wrong!\"\n Another disturbing all too common event is that of the woman who has taken her prescribed birth control, but it failed, so she finds herself carrying a child she never wanted, and even worse, as a result of the augmented hormone levels as a result of birth control, her child has little chance of being born normal and healthy. But if these \"pro-lifers\" have their way, she will be forced to have the child, and raise it.\n Another argument I often hear is the option of adoption. One must wonder, though, if adoptive families were so abundant, why so many group homes for unwanted children who are doomed to live out their childhoods at the knees of the state? The gross majority of open-adoption agencies out there are christian-founded, which means of course, that unless you adhere to their strict guidelines, you will not recieve a child. Single parents (no matter the income) homosexuals, any person who does not subscribe to christianity is immediately disqualified!\n What I really want to say is, If you have some moral objection to abortion, that's just fine~ then never have one yourself. But please do not expect another person to conform to your ideas. Why should they?", 
   {
    "post_info": {
     "post_title": "America the Great"
    }
   }, 
   null, 
   null, 
   1068376680.0
  ], 
  [
   22043, 
   null, 
   "Charchuk", 
   "It sure is funny how many times the \"pro-lifers\" claim a victory- and yet that victory is quickly overturned by the supreme authority in this country- which is not the senate, not the president, it is the COURT.\n I find it truly insulting that this great nation, which was founded upon the idea of religious freedom has allowed so many of its laws to be affected by the over-dominant christian right. If we put aside the bible, the commandments, and the intentionally biased commentaries of christian leaders, what argument is left? \n The Christian right will say that all life is precious, but obviously there are tiers. An unborn, unwanted, and even sometimes malformed child is more precious than that of the mother. Who cares if she was raped? Who cares if she was the victim of incest? Who cares if the child she carries has tested positive for all sorts of defects- \"My preacher says it's wrong!\"\n Another disturbing all too common event is that of the woman who has taken her prescribed birth control, but it failed, so she finds herself carrying a child she never wanted, and even worse, as a result of the augmented hormone levels as a result of birth control, her child has little chance of being born normal and healthy. But if these \"pro-lifers\" have their way, she will be forced to have the child, and raise it.\n Another argument I often hear is the option of adoption. One must wonder, though, if adoptive families were so abundant, why so many group homes for unwanted children who are doomed to live out their childhoods at the knees of the state? The gross majority of open-adoption agencies out there are christian-founded, which means of course, that unless you adhere to their strict guidelines, you will not recieve a child. Single parents (no matter the income) homosexuals, any person who does not subscribe to christianity is immediately disqualified!\n What I really want to say is, If you have some moral objection to abortion, that's just fine~ then never have one yourself. But please do not expect another person to conform to your ideas. Why should they?\n\n \n \n But didn't you know? The USA is a CHRISTIAN NATION and all other beliefs are subservient to that. They don't get it, they actally believe that they're doing good and are also doing it for our own good as well. \n \n It isn't terrorists, or any other outside force which are a threat to American rights and freedoms, it is those like the Christian right who you truly have to fear. Those like Pat Robertson, or Jerry Falwel who have influence and many others as well like your President. How many other Judges feel and believe the same as Judge Moore in Alabama did?", 
   {}, 
   22041, 
   null, 
   1068386040.0
  ], 
  [
   22076, 
   null, 
   "Parcum", 
   "Sticking a pair of scisors in the back of a full-grown, half born, fetus' head, with the doctor holding in his hands a fetus about to be born, is not just wrong in a Christian belief.\n \n YOu're sick if you support it.", 
   {}, 
   22043, 
   null, 
   1068417540.0
  ], 
  [
   22082, 
   null, 
   "Charchuk", 
   "Sticking a pair of scisors in the back of a full-grown, half born, fetus' head, with the doctor holding in his hands a fetus about to be born, is not just wrong in a Christian belief.\n \n YOu're sick if you support it.\n\n \n And you're quite naive if you think that emotional examples mean anything against the facts. The so-called \"Partial Birth\" Abortion is quite rare and usually only performed to save the mother's life, but now they're going to have to let the mother die because Dubya has banned this now thus the first step to going back to the \"good old days\" when women were nothing more than property. You're the sick one.\n \n Also, with your resorting to such tactics shows that you are losing.\n \n BTW, isn't putting \"Your god\" under your name somewhat sacrilegious by putting yourself above your god? I guess that I'll be seeing you in Hell. :)", 
   {}, 
   22076, 
   null, 
   1068421080.0
  ], 
  [
   22084, 
   null, 
   "Parcum", 
   "The partial birth abortion is rare, but it is not always used to save the mother's life. At any rate, I may seem radical, but even if it is to save the mother's life I think it should be disallowed, as it is a very cruel preocedure. Would you do that to a born baby? Of course not. It's very sickening that the so called \"land of the free\" would allow such a murderous procedure to be done.", 
   {}, 
   22082, 
   null, 
   1068421980.0
  ], 
  [
   22086, 
   null, 
   "gilligan8503", 
   "The partial birth abortion is rare, but it is not always used to save the mother's life. At any rate, I may seem radical, but even if it is to save the mother's life I think it should be disallowed, as it is a very cruel preocedure. Would you do that to a born baby? Of course not. It's very sickening that the so called \"land of the free\" would allow such a murderous procedure to be done.\n\n you disgust me.", 
   {}, 
   22084, 
   null, 
   1068422700.0
  ], 
  [
   22089, 
   null, 
   "Charchuk", 
   "The partial birth abortion is rare, but it is not always used to save the mother's life. At any rate, I may seem radical, but even if it is to save the mother's life I think it should be disallowed, as it is a very cruel preocedure. Would you do that to a born baby? Of course not. It's very sickening that the so called \"land of the free\" would allow such a murderous procedure to be done.\n\n \n So-called \"Partial Birth\" Abortions are so rare as to be negligible. This ban was just a small step onto taking away a woman's right to choice.\n \n If it were a \"born baby\" then they wouldn't have to perform the abortion. It would be able to survive in a respirator.\n \n There you go again misusing a legal term.\n \n You are the sick one for using emotional arguements and ignoring the facts.", 
   {}, 
   22084, 
   null, 
   1068423720.0
  ], 
  [
   22133, 
   null, 
   "sundowner", 
   "The partial birth abortion is rare, but it is not always used to save the mother's life. At any rate, I may seem radical, but even if it is to save the mother's life I think it should be disallowed, as it is a very cruel preocedure. Would you do that to a born baby? Of course not. It's very sickening that the so called \"land of the free\" would allow such a murderous procedure to be done.\n\n \n That's just great. You think it is cruel to abort a fetus when the life of the mother is in danger. So what your really saying is: \"Oh just let the chick die, save that baby\". It strikes me as strange that you don't think letting that woman die would be cruel, or that the baby growing up without his mother would be cruel. And there would be no reason to do it to a \"born baby\". If they are already born, you cannot perform an abortion. And I think it is sickening that in this so called \"land of the free\" that there would even be an argument against an abortion done to prevent the death of the mother, or abortions done in the case of rape. I would think that the land of the free and the right to choose would go hand in hand. And let me ask you, with your demented, self righteous views, do you celebrate your birth date or your conception date?", 
   {}, 
   22084, 
   null, 
   1068448740.0
  ], 
  [
   22136, 
   null, 
   "Parcum", 
   "The problem is, sundowner, that it doesn't help save the mother at all. Right them and there, the baby could be born- it is inches away from being born, but it isn't. It's stabbed in the back of the neck. An abortion- especially the partial birth abortions- are just as bad as going into labor. Women are just as likely to die from an partial-birth abortion as from giving birth.\n \n That is sickening. Rape is sick, dying from cancer is sad, but murdering a full-grown fetus- who looks identical to an infant- is ten times more disgustiny. Don't make me show links of the partial-birth aborton procedure. \n \n \nAnd let me ask you, with your demented, self righteous views, do you celebrate your birth date or your conception date?\n\n \n I don't personally, but my sister in law does because she's chinese.", 
   {}, 
   22133, 
   null, 
   1068450840.0
  ], 
  [
   22138, 
   null, 
   "superbuddhaman", 
   "Sticking a pair of scisors in the back of a full-grown, half born, fetus' head, with the doctor holding in his hands a fetus about to be born, is not just wrong in a Christian belief.\n \n YOu're sick if you support it.\n\n \n \n Your obvious ignorance of medical procedure is astonishing. I do not think any such uninformed person has a right to an opinion, but since you have decided you do, let me try to inform you. A doctor would never \"stick a pair of scissors\" into a baby's head. Any propaganda that has told you otherwise is just that, propaganda. If the doctor is \"holding in his hands\" a baby about to be born, (which implies labor) and that child weighs more than 500 grams (just under two pounds), he is required by law to do all in his power to protect and support that child's life. Partial-birth abortion is done only in a case when the mother's life is at stake, no, it does not always \"save the mother's life\" in some cases it is done as a prophylaxis against an event in which life-saving measures would be deemed neccessary. Example- the mother has advanced liver disease, when she concieved it seemed as though it would be possible to carry the child, but as her pregnancy advanced, so did her disease, so that now she is in complete renal failure. The doctors advise her that if she continues with her pregnancy, she is putting her own life and that of ther child into jeopardy. He urges her to abort the child, in order to save her life. This is one case where a partial-birth abortion would be the method.\n If the woman decides to continue her pregnancy, she might die, the child might die as well. But if she chooses not to have the child, she lives to fight another day. \n Tough choices- What right on earth would I have to enter into this situation and tell her that \"god says you gotta put your life at risk and carry this child, even though both of you might die\"????\n \n \n I may be sick, but I pride myself on the ability to create an informed opinion on a matter, and until I am informed, I keep my opinions to myself.\n That should be in the bible somewhere", 
   {}, 
   22076, 
   null, 
   1068451680.0
  ], 
  [
   22141, 
   null, 
   "mizmaxx", 
   "Tough choices- What right on earth would I have to enter into this situation and tell her that \"god says you gotta put your life at risk and carry this child, even though both of you might die\"????\n\n \n Tough choice is right. Deciding to end a pregnancy is usually really difficult. I don't understand how anyone gets the impression that they can judge someone facing that choice.\n \n BTW, parcum, when you say \"half-born\" do you mean that this procedure is done during an otherwise timely healthy labor or are you referring to an induced or premature and spontaneous labor?", 
   {}, 
   22136, 
   null, 
   1068452460.0
  ], 
  [
   22186, 
   null, 
   "sundowner", 
   "The problem is, sundowner, that it doesn't help save the mother at all. Right them and there, the baby could be born- it is inches away from being born, but it isn't. It's stabbed in the back of the neck. An abortion- especially the partial birth abortions- are just as bad as going into labor. Women are just as likely to die from an partial-birth abortion as from giving birth.\n\n \n \n \n You don't seem to understand what partial birth abortion is, or much about any medical procedures for that matter. Why don't you educate yourself on the subject prior to spouting off your XXXX. You make it sound like the healthy full term woman is in the middle of labor or is about to start labor, and the doctor just goes and attacks the fetus, killing it for no other reason than nobody want's the baby. I don't care what you have read, or what twisted links you can provide that say this is the case, it is not. Perhaps if you have ever cared for these women or been involved in the struggle to save a pregnant womans life you might understand a little better. I have, and I consider myself much more informed on the subject because of my experiences. \n \n \nThat is sickening. Rape is sick, dying from cancer is sad, but murdering a full-grown fetus- who looks identical to an infant- is ten times more disgustiny. Don't make me show links of the partial-birth aborton procedure. \n \n \n You ignore the issue. Don't you find it disgusting to put the life of the pregnant woman in grave danger in order to save a fetus? Allowing one life to end so another can begin make no sense. In a way, by knowing you could do something to save the life of the pregnant woman and doing nothing, you are in a sense guilty of her murder. You don't find that disgusting? I think your line of thinking is sick. And you don't need to show me the links, I have been in the operating room, emergency room, and delivery room and seen it done. I have practical first hand knowledge of this, and the circumstances surrounding the decisions made to do it. In every case, It was done because there was a great risk to the life of the woman. One they actually attempted C-section, however the fetus was not viable at it's age and weight. So let me just tell you Dr. Parcum, until you have been there and understand the situation fully, you have no right to judge. \n \n \nI don't personally, but my sister in law does because she's chinese.\n\n \n Good for her. I asked about you. You seem to think that you have the rights and protections of a full fledged citizen at the age of -9 months. You know you don't become an american citizen until the doctor writes down the time you were born. It is at this point you fall under the laws and protections of the constitution, YOUR BIRTH DATE. So, by logic, if you feel that one is alive and a full citizen at conception, you should really celebrate your conception date. Anyway, your argument that this is murder is made moot by the point that a fetus is not born yet, and therefore cannot be murdered. And oh yes...let's look to the chinese for humane and decent treatment of babies...let's do that.", 
   {}, 
   22136, 
   null, 
   1068492240.0
  ], 
  [
   22188, 
   null, 
   "Charchuk", 
   "The problem is, sundowner, that it doesn't help save the mother at all. Right them and there, the baby could be born- it is inches away from being born, but it isn't. It's stabbed in the back of the neck. An abortion- especially the partial birth abortions- are just as bad as going into labor. Women are just as likely to die from an partial-birth abortion as from giving birth.\n \n That is sickening. Rape is sick, dying from cancer is sad, but murdering a full-grown fetus- who looks identical to an infant- is ten times more disgustiny. Don't make me show links of the partial-birth aborton procedure.\n\n \n Your ignorance is amazing. You are saying that the woman must die for her \"sin\" as well as the fetus. Partial birth abortion is a misleading term (intentionally so) to bring forth an emotional response.\n \n \n \nI don't personally, but my sister in law does because she's chinese.\n\n \n It is most likely that the Chinese celebrate the birth as the first birthday, which makes sense. I am 40, but I am in my 41st year and in the beginning of my 5th decade. My 41st birthday will be in less than two months. That is also how this can be the 21st century and the year is 2003 instead of 2103.", 
   {}, 
   22136, 
   null, 
   1068493320.0
  ], 
  [
   22197, 
   null, 
   "Parcum", 
   " Your obvious ignorance of medical procedure is astonishing. I do not think any such uninformed person has a right to an opinion, but since you have decided you do, let me try to inform you. A doctor would never \"stick a pair of scissors\" into a baby's head. Any propaganda that has told you otherwise is just that, propaganda. If the doctor is \"holding in his hands\" a baby about to be born, (which implies labor) and that child weighs more than 500 grams (just under two pounds), he is required by law to do all in his power to protect and support that child's life. Partial-birth abortion is done only in a case when the mother's life is at stake, no, it does not always \"save the mother's life\" in some cases it is done as a prophylaxis against an event in which life-saving measures would be deemed neccessary. Example- the mother has advanced liver disease, when she concieved it seemed as though it would be possible to carry the child, but as her pregnancy advanced, so did her disease, so that now she is in complete renal failure. The doctors advise her that if she continues with her pregnancy, she is putting her own life and that of ther child into jeopardy. He urges her to abort the child, in order to save her life. This is one case where a partial-birth abortion would be the method.\n If the woman decides to continue her pregnancy, she might die, the child might die as well. But if she chooses not to have the child, she lives to fight another day. \n Tough choices- What right on earth would I have to enter into this situation and tell her that \"god says you gotta put your life at risk and carry this child, even though both of you might die\"????\n\n \n Excuse me, I've been in the pro-life movement for quite a while now, and I do understand what the partial birth abortion is. Before I show you a picture of how the procedure is done (no graphic images), I will explain a few things. First, the partial-birth abortion is a very stressful procedure- much more stressful then say an emergency C-section. The blood loss, surgery, and psychological damage the partial-birth abortion causes on women is astonishing. Not to mention, the women has to wait several months to have the procedure (third trimester), and the pregnancy causes a ton of stress to the mother as well. Why not just give birth? I highly doubt that anyone would get a newly born infant and- to save the mother's life from cancer- stab it in the back of the head. \n \n I've said this before and I'll say it again, don't bring God into the issue. I personally am Catholic but in no way do I condone abortion because of my religion. I condone abortion as a secularist. Why? Because it is a cruel, inhumane, procedure. \n \n \n  http://www.nrlc.org/abortion/pba/diagram.html \n \n There is a picture of how the procedure is done. Yes, the doctor is holding the child in his hands. \n \n \n BTW, parcum, when you say \"half-born\" do you mean that this procedure is done during an otherwise timely healthy labor or are you referring to an induced or premature and spontaneous labor?\n\n \n Neither. Look at the diagram above. There are no graphic photos. \n \n \n You don't seem to understand what partial birth abortion is, or much about any medical procedures for that matter. Why don't you educate yourself on the subject prior to spouting off your XXXX. You make it sound like the healthy full term woman is in the middle of labor or is about to start labor, and the doctor just goes and attacks the fetus, killing it for no other reason than nobody want's the baby. I don't care what you have read, or what twisted links you can provide that say this is the case, it is not. Perhaps if you have ever cared for these women or been involved in the struggle to save a pregnant womans life you might understand a little better. I have, and I consider myself much more informed on the subject because of my experiences.\n\n \n Once again, Sundowner, I've been in the pro-life movement for a few years now and very well understand the issue. It's quite similar to your explanation. The fetus feels every second of it. I usually don't debate emotionally, but there is no other way to debate this. To think that the fetus is two inches away from being a normal, healthy, baby, and then suddenly they stab the fetus in the back of the head, killing it. Of course, there are several procedures to be done for the fetus to be born, but the partial-birth abortion causes much more tension then giving birth via C-section. \n \n You are wrong in saying that nobody wants the baby- several people do. There are over 3 million couples waiting to adopt a baby every year, and most of them are put onto waiting lists. Ignoring this point, you say that because nobody wants it, we can simply stab it in the back of the head, killing it? The fetus at this point looks identical to a newborn infant:\n \n http://suttermedicalcenter.org/images/neonatal.gif\n \n  http://suttermedicalcenter.org/images/neonatal.gif\n \n And you support the cruel killing of these guys? You call me sick- that is sick.\n \n \nAllowing one life to end so another can begin make no sense.\n\n \n The life has already begun. The mother must make a choice; allow herself to die less painfully, or allow the fetus to die savagely. It shouldn't be a choice. \n \n \nIn a way, by knowing you could do something to save the life of the pregnant woman and doing nothing, you are in a sense guilty of her murder. You don't find that disgusting? \n\n \n If I were to see two people driving cars separately about to collide into each other, and for some spontaneous reason one were probably to survive (usually both would), and I would shoot the person in one vehicle, killing him, who then crashes to the side and the woman driving the other car shortly crashes into a tree- I would be guilty of murder. I killed one person, to save the other woman, who shortly dies. Partial-birth Abortion doesn't save a life- it prolongs it. I really hate to say this, but the mother is going to die. If she is pregnant, there are two individuals in the issue now. The first is the fetus, who is surely going to live. The second is the mother, who most likely will die. Who should have the right to life?\n \n There was a story of a man who was married to this women, who shortly discovered cancer in her liver (I believe). She tried desperately to find treatments- going around the world. During this time, she got pregnant. She had a partial birth abortion. The woman died a few months later, and the husband was left with nobody. Not a child to see his wife's face, not his wife's face. Both died. Do you want it to turn out this way, as it almost always does? Just because you have a chance of surviving if your child is dead, you would savagely kill your child to attempt to keep your life, which will most likely end anyway?\n \n That is gross.\n \n \n \nI think your line of thinking is sick. And you don't need to show me the links, I have been in the operating room, emergency room, and delivery room and seen it done. I have practical first hand knowledge of this, and the circumstances surrounding the decisions made to do it. In every case, It was done because there was a great risk to the life of the woman. One they actually attempted C-section, however the fetus was not viable at it's age and weight. So let me just tell you Dr. Parcum, until you have been there and understand the situation fully, you have no right to judge.\n\n \n I've been in the operating room, emergency room several times, but not in the delivery room. I have seen films, however, of how both birth and abortion are done. An emergency C-section is always available, mister. You're talking to somebody with seven siblings, eight aunts, nine uncles, and several friends who have had emergency C-sections, and a C-section is as readily available as late-term abortions, and always available for the partial-birth abortion. It is always done for premature births. If the fetus was not viable for it's age and weight, meaning it had a chance of death, I would rather see the child have a chance of life then both dead. \n \n I now highly doubt your credibility when hearing your last statement.\n \n \n Good for her. I asked about you. You seem to think that you have the rights and protections of a full fledged citizen at the age of -9 months. You know you don't become an american citizen until the doctor writes down the time you were born. It is at this point you fall under the laws and protections of the constitution, YOUR BIRTH DATE. So, by logic, if you feel that one is alive and a full citizen at conception, you should really celebrate your conception date. Anyway, your argument that this is murder is made moot by the point that a fetus is not born yet, and therefore cannot be murdered. And oh yes...let's look to the chinese for humane and decent treatment of babies...let's do that.\n\n \n Firstly, the things going on in China are not because of the Chinese, but of the communists. Do not bring that up, as it is a red-herring. Secondly, you seem to fully put your soul with the government. Whatever the government says goes. Okay, when Bush sent soldiers to Iraq, did you support that? When Clinton went to Yugoslavia, did you support that? When Bush banned the partial-birth aborton, did you support that? The government isn't perfect, but. A birth day isn't when life begins- it's when life in this world begins. \n \n OH, and just for the record, you're sick.", 
   {
    "unicode_changes_made": true
   }, 
   22188, 
   null, 
   1068497880.0
  ], 
  [
   22199, 
   null, 
   "Charchuk", 
   "Excuse me, I've been in the pro-life movement for quite a while now, and I do understand what the partial birth abortion is. Before I show you a picture of how the procedure is done (no graphic images), I will explain a few things. First, the partial-birth abortion is a very stressful procedure- much more stressful then say an emergency C-section. The blood loss, surgery, and psychological damage the partial-birth abortion causes on women is astonishing. Not to mention, the women has to wait several months to have the procedure (third trimester), and the pregnancy causes a ton of stress to the mother as well. Why not just give birth? I highly doubt that anyone would get a newly born infant and- to save the mother's life from cancer- stab it in the back of the head. \n\n \n I've heard of these \"pictures\" before. It turns out that they weren't really what you say they are. But from miscarries and the like.\n \n \nI've said this before and I'll say it again, don't bring God into the issue. I personally am Catholic but in no way do I condone abortion because of my religion. I condone abortion as a secularist. Why? Because it is a cruel, inhumane, procedure.\n\n \n Condone:\n \n 1. Excuse, overlook, or make allowances for; be lenient with\n \n \n I think that the word you're looking for is condemn. :) And that is bull pucky. If you were truly a secularist you would know the real facts and not make such silly statements.\n \n \n \n \n http://www.nrlc.org/abortion/pba/diagram.html \n \n There is a picture of how the procedure is done. Yes, the doctor is holding the child in his hands. \n \n \n \n Neither. Look at the diagram above. There are no graphic photos.\n\n \n \n Of course there wouldn't be any such photos since it is mainly anti-abortion propaganda. They usually either use pictures and claim that they are of something they are not.\n \n Guess what, I'm pro-life as well, that is why I'm also pro-choice and if you knew what you were talking about instead of spreading false propaganda and other lies you would understand why.\n \n One thing you should be careful of. Many of these anti-abortion groups are quite hypocritical. They concider abortion murder, but think nothing of sending out their death squads to kill doctors who provide them and anyone else who gets in their way. They are no different than the terrorists who crashed the planes on 9/11.\n \n [Emotional propaganda deleted]", 
   {
    "unicode_changes_made": true
   }, 
   22197, 
   null, 
   1068503160.0
  ], 
  [
   22206, 
   null, 
   "Parcum", 
   " I've heard of these \"pictures\" before. It turns out that they weren't really what you say they are. But from miscarries and the like.\n\n \n Most of them and all the ones I would show you are confirmed by doctors. \n \n \n I think that the word you're looking for is condemn. And that is bull pucky. If you were truly a secularist you would know the real facts and not make such silly statements.\n\n \n Woops, I was going to say \"I don't condemn abortion because of Christianity\", but I guess I wasn't paying attention. And I don't make silly statements. Let me ask you; in the entire time we've been debating about abortion, have I mentioned \"God\" or anything about Christianity or religion at all? You wont be able to find anything. Why is that? Because I completely base my arguments against abortion on scientific facts. \n \n \n Guess what, I'm pro-life as well, that is why I'm also pro-choice and if you knew what you were talking about instead of spreading false propaganda and other lies you would understand why.\n\n \n Name one lie I've made, my child.\n \n \n One thing you should be careful of. Many of these anti-abortion groups are quite hypocritical. They concider abortion murder, but think nothing of sending out their death squads to kill doctors who provide them and anyone else who gets in their way. They are no different than the terrorists who crashed the planes on 9/11.\n\n \n There are several types of pro-lifers. There are the philosophical pro-lifers, the hard-truth pro-lifers, and the terrorists. The terrorists are below a minority, their actions are very rare (but the media makes it a big deal, of course). The radical pro-lifers are those who shove pictures of dead fetuses in your face. Philosophical pro-lifers are those that don't use graphics images but use facts. I'm in the middle between hard-truth pro-life and philosophical pro-life. I use facts, and occasionally I use graphic images to show people what abortion is. The philosophy of hard-truth pro-lifers is that since people don't understand what abortion is, they'll show them what it is. Many people change sides because of these real, graphic images.\n \n I could easily argue that the late-term fetus is a human being. Not only is it biologically a human being, but it is intellectually one as well; it thinks. The most stressful issue I can debate about abortion is that of defining a person. It's not that I don't know the answers- I have read many books on the issue, and do know, but it is very confusing so many people don't understand the philosophy. I think that you do agree that the late-term fetus is a human being, am I correct? If this is so, then the partial-birth abortion is murder, and homicide. \n \n These are some pictures of real, certified, aborted fetuses. Doctors even signed the photos for their authenticity. Just a fair warning, these are very graphic images.\n \n I really hate to debate emotionally, as I've said, but sometimes it is necessary.", 
   {
    "unicode_changes_made": true
   }, 
   22199, 
   null, 
   1068507900.0
  ], 
  [
   22210, 
   null, 
   "sundowner", 
   "Excuse me, I've been in the pro-life movement for quite a while now, and I do understand what the partial birth abortion is. Before I show you a picture of how the procedure is done (no graphic images), I will explain a few things. First, the partial-birth abortion is a very stressful procedure- much more stressful then say an emergency C-section. The blood loss, surgery, and psychological damage the partial-birth abortion causes on women is astonishing. Not to mention, the women has to wait several months to have the procedure (third trimester), and the pregnancy causes a ton of stress to the mother as well. Why not just give birth? I highly doubt that anyone would get a newly born infant and- to save the mother's life from cancer- stab it in the back of the head. \n \n \n Again, making statements like this shows your obvious ignorance about the subject.\n \n \nI personally am Catholic but in no way do I condone abortion because of my religion. I condone abortion as a secularist. Why? Because it is a cruel, inhumane, procedure. \n \n \n I would like to put this in my signature\n \n \nThere is a picture of how the procedure is done. Yes, the doctor is holding the child in his hands.\n \n \n Wow. A drawing. Wow.\n \n \nOnce again, Sundowner, I've been in the pro-life movement for a few years now and very well understand the issue. It's quite similar to your explanation. The fetus feels every second of it. I usually don't debate emotionally, but there is no other way to debate this. To think that the fetus is two inches away from being a normal, healthy, baby, and then suddenly they stab the fetus in the back of the head, killing it. Of course, there are several procedures to be done for the fetus to be born, but the partial-birth abortion causes much more tension then giving birth via C-section. \n \n \n I don't care how long you have been in the pro-life movement. You only see things from the pro-life movement point of view. I see things from the medical point of view, and from the medical point of view it does not matter if you are pro-choice or pro-life. You really do not understand the procedures, the terminology, or the reasons for doing them. \"And the partial birth abortion causes more tension then giving birth via C-section?\" Is your alarm on? An emergency C-Section can be a dnagerous procedure. Again, do you really understand what you are saying? \n \n \nYou are wrong in saying that nobody wants the baby- several people do. There are over 3 million couples waiting to adopt a baby every year, and most of them are put onto waiting lists. Ignoring this point, you say that because nobody wants it, we can simply stab it in the back of the head, killing it? The fetus at this point looks identical to a newborn infant:\n \n \n Then why do we have children that grow up in state run homes? Why do we have children bouncing from foster home to foster home? And when did I ever say kill it because nobody wants it? Don't misquote me, I find it rude. \n \n \nIf I were to see two people driving cars separately about to collide into each other, and for some spontaneous reason one were probably to survive (usually both would), and I would shoot the person in one vehicle, killing him, who then crashes to the side and the woman driving the other car shortly crashes into a tree- I would be guilty of murder. I killed one person, to save the other woman, who shortly dies. Partial-birth Abortion doesn't save a life- it prolongs it. I really hate to say this, but the mother is going to die. If she is pregnant, there are two individuals in the issue now. The first is the fetus, who is surely going to live. The second is the mother, who most likely will die. Who should have the right to life?\n \n \n I must say...that is the dumbest thing I have ever read on this forum. Do you really believe the XXXX you are spouting off? First off, they are done when the womans life is in danger to save the woman. What do you mean she will shortly die? Do you mean that she is old and might die in 40 years, as opposed to the child that could live for another 75 years? What do you mean by this? And why is the fetus surely going to live? Do you really know what you are talking about? I don't think you do. In many cases the fetus is too underdeveloped to survive on it's own. If it is not, and it can be considered viable, a C-section is usually attempted. Even vaginal birth can be attempted with tocolytics and hormones if the risk of a C-section is too great. But in an emergency, both are usually too stressful for the woman. Abortion is a relatively stress free procedure for the woman. Again, it might help if you knew what you were talking about. And the mother should always have the right to life in the cases where it comes down to chosing one over the other. \n \n \nThere was a story of a man who was married to this women, who shortly discovered cancer in her liver (I believe). She tried desperately to find treatments- going around the world. During this time, she got pregnant. She had a partial birth abortion. The woman died a few months later, and the husband was left with nobody. Not a child to see his wife's face, not his wife's face. Both died. Do you want it to turn out this way, as it almost always does? Just because you have a chance of surviving if your child is dead, you would savagely kill your child to attempt to keep your life, which will most likely end anyway?\n \n \n Can you provide any evidentiary support for this? Can you show me an article outlining the facts of the case? Or is this just something you read on one of your bleeding heart pro-life pamphlets. I would have to see the facts of the case before I formed any opinions about it. And by partial birth abortion, again, what do you mean? Was she in labor, and the baby was 3/4 of the way out, and she said kill it? Or was it done for other reasons. What are the particulars? Or are you just repeating something you heard. Once again, You really do not seem to know what you are talking about. \n \n \nI've been in the operating room, emergency room several times, but not in the delivery room. I have seen films, however, of how both birth and abortion are done. An emergency C-section is always available, mister. You're talking to somebody with seven siblings, eight aunts, nine uncles, and several friends who have had emergency C-sections, and a C-section is as readily available as late-term abortions, and always available for the partial-birth abortion. It is always done for premature births. If the fetus was not viable for it's age and weight, meaning it had a chance of death, I would rather see the child have a chance of life then both dead. \n \n \n LOL, what as a patient? And do you think that seeing a few films qualifies you to be an expert? An emergency C-section is not always available....MISTER. It depends on the circumstances. Trauma is a good example. Watching films and having relatives who have had C-sections does not make you an authority on the subject. I am trained and have worked as a nurse and a paramedic. I have spent time working in OB, L&D, ER, OR, ICU, you name it. I actually have the education and practical experience. I understrand these procedures, the terminology associated with them, and the reason for and against doing them much better than you. You may doubt my credibility all you want, but at the end of the day, I know what I am talking about, and you're are a poser. \n \n \nirstly, the things going on in China are not because of the Chinese, but of the communists. Do not bring that up, as it is a red-herring. Secondly, you seem to fully put your soul with the government. Whatever the government says goes. Okay, when Bush sent soldiers to Iraq, did you support that? When Clinton went to Yugoslavia, did you support that? When Bush banned the partial-birth aborton, did you support that? The government isn't perfect, but. A birth day isn't when life begins- it's when life in this world begins. \n \n \n And who are the communists? Perhaps...ummm....chinese people? And I trust very little of what the government says, does or tells me. I put very little faith in them. Yes it was ok to go to Iraq, Yes it was right to go to Yugoslavia, and no, I don't support a ban on partial birth abortions when done to save a life. And a fetus is alive right? But not in this world. Ok then, why are people like you in this world trying to make policies for a fetus not yet in it? Your words, not mine. \n \n \nOH, and just for the record, you're sick.\n \n \n emoticon_xagree Thank you, it's a gift.", 
   {
    "unicode_changes_made": true
   }, 
   22199, 
   null, 
   1068509160.0
  ], 
  [
   22211, 
   null, 
   "Charchuk", 
   "Most of them and all the ones I would show you are confirmed by doctors. \n\n \n I didn't say the pictures were fakes, just that they're not exactly of what they proport to be.\n \n \nWoops, I was going to say \"I don't condemn abortion because of Christianity\", but I guess I wasn't paying attention. And I don't make silly statements. Let me ask you; in the entire time we've been debating about abortion, have I mentioned \"God\" or anything about Christianity or religion at all? You wont be able to find anything. Why is that? Because I completely base my arguments against abortion on scientific facts.\n\n \n Irrelevant. It is mainly the theists who are anti-abortionist and don't know any of the facts. \n \n \nName one lie I've made, my child.\n\n \n I didn't say that you lied, only that you're spreading the lies of others. That makes you nothing more than a tool.\n \n \nThere several types of pro-lifers. There are the philosophical pro-lifers, the hard-truth pro-lifers, and the terrorists. The terrorists are below a minority, their actions are very rare (but the media makes it a big deal, of course).\n\n \n Again, irrelevant. It is enough that they are doing what they are.\n \n \nThe radical pro-lifers are those who shove pictures of dead fetuses in your face. Philosophical pro-lifers are those that don't use graphics images but use facts.\n\n \n Do they use good facts or real facts. There is a difference and I wonder if you get the reference?\n \n \nI'm in the middle between hard-truth pro-life and philosophical pro-life. I use facts, and occasionally I use graphic images to show people what abortion is.\n\n \n Hardly. You haven't used one real fact at all. You mostly just use emotional blackmail.\n \n \nThe philosophy of hard-truth pro-lifers is that since people don't understand what abortion is, they'll show them what it is. Many people change sides because of these real, graphic images.\n\n \n People know what abortion is. You just don't like it that they don't take your definition of it. In this you are no different than any fundamentalist fanatic theist. Dangerous and criminal.\n \n \nI could easily argue that the late-term fetus is a human being.\n\n \n No, you couldn't ans still use the facts.\n \n \nNot only is it biologically a human being, but it is intellectually one as well; it thinks.\n\n \n The first point is irrelevant and we've more than proven this. and the second point is irrelevant as well since we've also proven this as well.\n \n \nThe most stressful issue I can debate about abortion is that of defining a person. It's not that I don't know the answers-\n\n \n You more than proven that you don't. We aren't the sum of our parts.\n \n \nI have read many books on the issue, and do know, but it is very confusing so many people don't understand the philosophy. I think that you do agree that the late-term fetus is a human being, am I correct? If this is so, then the partial-birth abortion is murder, and homicide.\n\n \n No. As we've said MANY times before such abortions are so rare that they are negligible. Yet you continue to use them as an example of the whole. You are wrong. \n \n \nThese are some pictures of real, certified, aborted fetuses. Doctors even signed the photos for their authenticity. Just a fair warning, these are very graphic images.\n\n \n Now, why would an ethical doctor do something like that? Did you see the \"doctor\" voluntrily sign such things and why would they be taking pictures as well come to think of it? You've been lied to and you are just too naive to realize it.\n \n \nI really hate to debate emotionally, as I've said, but sometimes it is necessary.\n\n \n Please, that is all you've done from the start.", 
   {
    "unicode_changes_made": true
   }, 
   22206, 
   null, 
   1068509340.0
  ], 
  [
   22228, 
   null, 
   "Parcum", 
   "Hold on Charchuk, I'll debate you later. I first have to shut this dude up. He's really an idiot. \n \n Putting that in your signature would be taking advantage of a silly mistake I made. I don't care if you do, but it will only prove how ignorant you are. After this comment, you made two useless statements of name-calling. I laugh.\n \n \n I don't care how long you have been in the pro-life movement. You only see things from the pro-life movement point of view. I see things from the medical point of view, and from the medical point of view it does not matter if you are pro-choice or pro-life. You really do not understand the procedures, the terminology, or the reasons for doing them. \"And the partial birth abortion causes more tension then giving birth via C-section?\" Is your alarm on? An emergency C-Section can be a dnagerous procedure. Again, do you really understand what you are saying?\n\n \n I wouldn't agree. 90% of my close-relatives are pro-abortion. Both of my grandmothers are nurses- one retired recently, one is going to retire soon. I personally know an abortionist, who does partial-birth abortions I have several friends who are nurses and doctors, including my God-father. Secondly, the C-section is not any more dangerous than the partial birth-abortion. Although healing for the C-section takes longer, the partial birth abortion causes all sorts of problems. Uncontrollable bleeding is one. Cancer is also linked to abortion, especially late term. Think about it- the C-section is simple. You're put to sleep, and the doctor opens the womb and takes the fetus out. He stitches the belly, and then after some healing, everything is done. \n \n During this debate I had a conversation with my best friend's mother- who has assisted births, had 2 emergency C-sections, and is pro-choice (she's a nurse practitioner, I believe). She told me that having an abortion is just as bad as having a Cesarean Section, for the mother. Not to mention, abortion causes psychological damage to the mother, and there is a link between breast cancer and abortion.\n \n \n Then why do we have children that grow up in state run homes? Why do we have children bouncing from foster home to foster home? And when did I ever say kill it because nobody wants it? Don't misquote me, I find it rude.\n\n \n First of all, you can never justify savagely murdering something for the good of their future. Since my friend's father is an alcoholic, my friend will most likely be one as well. Should I kill him for the good of him and others? What about his newborn brother? Of course not. Secondly, the reason people are in foster homes is not because they weren't adopted at birth, but because their parents either died, went to jail, or put them up for adoption. Almost all newborn children put up for adoption have plans for adoption before birth. In fact, a family friend of ours tried to adopt a child, but had to be put on a waiting list. When a child was finally available, they brought her home, but there were technicalities on who actually was on the waiting list and if the mother really wanted to put the child up for adoption.\n \n \n I must say...that is the dumbest thing I have ever read on this forum. Do you really believe the XXXX you are spouting off? First off, they are done when the womans life is in danger to save the woman. What do you mean she will shortly die? Do you mean that she is old and might die in 40 years, as opposed to the child that could live for another 75 years? What do you mean by this? And why is the fetus surely going to live? Do you really know what you are talking about? I don't think you do. In many cases the fetus is too underdeveloped to survive on it's own. If it is not, and it can be considered viable, a C-section is usually attempted. Even vaginal birth can be attempted with tocolytics and hormones if the risk of a C-section is too great. But in an emergency, both are usually too stressful for the woman. Abortion is a relatively stress free procedure for the woman. Again, it might help if you knew what you were talking about. And the mother should always have the right to life in the cases where it comes down to chosing one over the other.\n\n \n LOL. You are so ignorant, it's amazing! The 1% of abortions that happen to save the mother's life are usually because of cancer or some sort of illness. The woman is going to die- usually within a few years. Sacrifice a few years for another life full of years? I would do it. Sacrifice your less painful death for your child's life, who would die a savage death? I would do it. After all, isn't that what parents are supposed to do? Take care of their children?\n \n Look at the partial birth abortion. They stick a bunch of tools inside of the mother. They pull the baby out. They could take the fetus out right then and there, and cut the umbilical cord, so giving the fetus at least a chance of survival. But they don't. Instead, they stab it in the back of the head.\n \n \n Can you provide any evidentiary support for this? Can you show me an article outlining the facts of the case? Or is this just something you read on one of your bleeding heart pro-life pamphlets. I would have to see the facts of the case before I formed any opinions about it. And by partial birth abortion, again, what do you mean? Was she in labor, and the baby was 3/4 of the way out, and she said kill it? Or was it done for other reasons. What are the particulars? Or are you just repeating something you heard. Once again, You really do not seem to know what you are talking about.\n\n \n It was on Dr. Laura Schlesinger's show. A woman called and wanted to know what to do with her son (the husband) who was contemplating suicide. Do you know what happens in the partial birth abortion? The fetus is taken almost entirely out of the body and stabbed in the back. Is that really humane? I know precisely what I'm speaking about! You seem to not. \n \n \n LOL, what as a patient? And do you think that seeing a few films qualifies you to be an expert? An emergency C-section is not always available....MISTER. It depends on the circumstances. Trauma is a good example. Watching films and having relatives who have had C-sections does not make you an authority on the subject. I am trained and have worked as a nurse and a paramedic. I have spent time working in OB, L&D, ER, OR, ICU, you name it. I actually have the education and practical experience. I understrand these procedures, the terminology associated with them, and the reason for and against doing them much better than you. You may doubt my credibility all you want, but at the end of the day, I know what I am talking about, and you're are a poser.\n\n \n First of all, idiot, I never said I was an expert, and from what you've been telling me you seem to be very far from a professional. You seem to be saying \"Oh because I was a paramedic and a nurse I know everything and you are nothing\". You seem to be assuming that films I've seen are drama films. No, they aren't. I'm talking about going to classes and watching videos of live births. I'm talking about going to my grandmother's house and watching her videos of surgeries, that gives explainations of how they're done and the like. I don't claim to understand the terminology. I don't care frankly. Have you ever assisted births? Have you ever assisted an emergency C-section? Have you ever assisted a partial-birth abortion?\n \n As a matter of fact, looking at this entire paragraph you wrote, you are simply bragging about yourself. LOL.\n \n \n And who are the communists? Perhaps...ummm....chinese people? And I trust very little of what the government says, does or tells me. I put very little faith in them. Yes it was ok to go to Iraq, Yes it was right to go to Yugoslavia, and no, I don't support a ban on partial birth abortions when done to save a life. And a fetus is alive right? But not in this world. Ok then, why are people like you in this world trying to make policies for a fetus not yet in it? Your words, not mine.\n\n \n So if a pro-lifer bombs an abortion clinic, does that mean that pro-lifers are cruel to doctors? What about if this pro-lifer was American? Does this mean that Americans are cruel to infants? Of course not. You're just making red herrings (which is good! You usually brag about yourself or make ridiculous statements... I like to see variation!).\n \n The fetus isn't alive? Hey , you're a nurse right? Don't you remember your biology? What's the biological criteria for life? \n \n A) Metabolism\n B) Reproduction\n C) Stimuli\n D) Growth\n \n That's the core quad. Learn it, Mr. IknoweverythingsinceIwasanurseandthereforeknoweverything. \n \n \n Thank you, it's a gift.\n\n \n I don't think highly of it.", 
   {
    "unicode_changes_made": true
   }, 
   22211, 
   null, 
   1068516540.0
  ], 
  [
   22233, 
   null, 
   "sundowner", 
   "Forget it Parcum, you must be right, and I must be wrong about everything. I really shouldn't have gotten involved in the abortion debate anyway, since I really know nothing about it and have no idea what I am talking about. You are the champion of knowledge here, and I bow to your superior intelect. Forgive me for posting.", 
   {}, 
   22228, 
   null, 
   1068521520.0
  ], 
  [
   22244, 
   null, 
   "Parcum", 
   "Well, I'm glad you've finally realized your ignorance. I give you permission to continue to post, but I banish you from the abortion forum, and silence you to ever debate abortion. Give to yourself 30 lashings and be off. Never come into my kingdom again. :P", 
   {}, 
   22233, 
   null, 
   1068526500.0
  ], 
  [
   22256, 
   null, 
   "mizmaxx", 
   "I give you permission to continue to post, but I banish you from the abortion forum, and silence you to ever debate abortion.\n\n \n Goodness knows we wouldn't want someone with arguments that prove you wrong to be allowed to speak...\n \n \nDo you know what happens in the partial birth abortion?\n \n \nNeither. Look at the diagram above. There are no graphic photos. \n\n \n The diagram you referred to doesn't answer any questions. My experience with pregnancy and birth is with the more common situations. I have trouble believing the diagrams because they don't mention how the woman was prepared for the procedure. If the woman was not induced or already in labor, how would the doctor be able to get the head out? Without dilation and effacement, he would have to cut through a huge amount of tissue. \n \n Anyway, don't forget that doctors will always push for the faster, more expensive way to do things. They love doing c-sections on women who are perfectly capable of having the baby through labor. That's why the rate of caesareans has gone up so much in the past few years.", 
   {}, 
   22199, 
   null, 
   1068541500.0
  ], 
  [
   22257, 
   null, 
   "superbuddhaman", 
   "[. First, the partial-birth abortion is a very stressful procedure- much more stressful then say an emergency C-section. The blood loss, surgery, and psychological damage the partial-birth abortion causes on women is astonishing. Not to mention, the women has to wait several months to have the procedure (third trimester), and the pregnancy causes a ton of stress to the mother as well. Why not just give birth? I highly doubt that anyone would get a newly born infant and- to save the mother&#8217;s life from cancer- stab it in the back of the head. ]\n \n You say a woman has to wait several months to have this procedure? Well, then, that implies that a woman finds herself pregnant, and ignoring all other possible options says to herself, I think I'll just go have one of those nice late-term abortions. Let's wait awhile and see how painful and traumatic (not too mention expensive) we can possible make this?\n \n [I&#8217;ve said this before and I&#8217;ll say it again, don&#8217;t bring God into the issue. I personally am Catholic but in no way do I condone abortion because of my religion. I condone abortion as a secularist. Why? Because it is a cruel, inhumane, procedure. ]\n \n Where did you learn english? I take from your context that you are against abortion, and yet the word condone....doesn't that mean that you allow, sanction, or support? hmmmmm, very confusing.\n \n  http://www.nrlc.org/abortion/pba/diagram.html \n \n [There is a picture of how the procedure is done. Yes, the doctor is holding the child in his hands. \n Look at the diagram above. There are no graphic photos. \n  http://suttermedicalcenter.org/images/neonatal.gif\n \n And you support the cruel killing of these guys? You call me sick- that is sick.]\n \n All of the above is not only propagandizing, but it is also inflammatory and flagrantly biased. Why no links to pictures of people dying in cancer wards? How about a nice closeup of a woman in the depths of despairing over the situation of this terrible choice? Even better, how about a picture of a child about age two helping her bedridden mother try to cover up her dialysis scars? \n \n \n [The life has already begun. The mother must make a choice; allow herself to die less painfully, or allow the fetus to die savagely. It shouldn&#8217;t be a choice.] \n \n So if the baby got a nice little lethal injection, painless and all, would be just fine? Do not blame the recipient of a procedure technology has caught up with.\n \n Your ridiculous analogy comparing a car wreck to a late term abortion is also inflammatory, but it is also irrelevant. Our laws and freedoms should not be based upon the personal opinions of anyone besides that ofthe supreme court, as a group. \n \n [I&#8217;ve been in the operating room, emergency room several times, but not in the delivery room. I have seen films, however, of how both birth and abortion are done. An emergency C-section is always available, mister. You&#8217;re talking to somebody with seven siblings, eight aunts, nine uncles, and several friends who have had emergency C-sections, and a C-section is as readily available as late-term abortions, and always available for the partial-birth abortion. It is always done for premature births. If the fetus was not viable for it&#8217;s age and weight, meaning it had a chance of death, I would rather see the child have a chance of life then both dead.] \n \n A cesarean is always done for premature births? You're telling me that when a woman goes into labor early, they stop her labor, (not quite safe to cut through tissue that is contracting) then invoke a serious surgery, in which they go through how many layers? Another problem with this statement is another flagrant misunderstanding of the english language. The word viable means able, properly functioning, etc. If something is not viable, it does not mean it has a chance of failure, it means it has failed.\n \n \n \n [Firstly, the things going on in China are not because of the Chinese, but of the communists. Do not bring that up, as it is a red-herring. Secondly, you seem to fully put your soul with the government. Whatever the government says goes. Okay, when Bush sent soldiers to Iraq, did you support that? When Clinton went to Yugoslavia, did you support that? When Bush banned the partial-birth aborton, did you support that? The government isn&#8217;t perfect, but. A birth day isn&#8217;t when life begins- it&#8217;s when life in this world begins. ]\n \n Now you are comparing war to abortion? Very bad comparisons you folks always seem to come up with. Is it because you have no background, research, etc in order to pass judgement on the issue at hand? Or isis simply that you know your arguments are bad ones?\n \n You make one wonder whether your opinions are based upon your truly disgusting interpretation of language, Perhaps if you could understand simple words, you might have a chance to understand a comples medical procedure.\n \n Yeah, I may be sick, I know I'm a sinner, and I'm probably cruel and heartless to boot, but at least I can form a sentence properly. I was also taught how to compile research a discern truth from propaganda.", 
   {}, 
   22197, 
   null, 
   1068542400.0
  ], 
  [
   22270, 
   null, 
   "Charchuk", 
   "Hold on Charchuk, I'll debate you later. I first have to shut this dude up. He's really an idiot.\n\n \n You shouldn't be so hard on yourself. :) \n \n \nI wouldn't agree. 90% of my close-relatives are pro-abortion.\n\n \n Correction. that would be pro-choice. Unless they go around telling every pregnant woman they see to have an abortion?\n \n \nFirst of all, you can never justify savagely murdering something for the good of their future. Since my friend's father is an alcoholic, my friend will most likely be one as well. Should I kill him for the good of him and others? What about his newborn brother? Of course not. Secondly, the reason people are in foster homes is not because they weren't adopted at birth, but because their parents either died, went to jail, or put them up for adoption. Almost all newborn children put up for adoption have plans for adoption before birth. In fact, a family friend of ours tried to adopt a child, but had to be put on a waiting list. When a child was finally available, they brought her home, but there were technicalities on who actually was on the waiting list and if the mother really wanted to put the child up for adoption.\n\n \n Emotional blackmail.\n \n \nLook at the partial birth abortion. They stick a bunch of tools inside of the mother. They pull the baby out. They could take the fetus out right then and there, and cut the umbilical cord, so giving the fetus at least a chance of survival. But they don't. Instead, they stab it in the back of the head.\n\n \n You mean the diagram of it since there are no pictures.\n \n \nIt was on Dr. Laura Schlesinger's show.\n\n \n Please. If you want us to take you seriously you shouldn't use her as an example. :)\n \n A woman called and wanted to know what to do with her son (the husband) who was contemplating suicide. Do you know what happens in the partial birth abortion? The fetus is taken almost entirely out of the body and stabbed in the back. Is that really humane? I know precisely what I'm speaking about! You seem to not. \n \n Her son was her husband?\n \n \nFirst of all, idiot, I never said I was an expert, and from what you've been telling me you seem to be very far from a professional. You seem to be saying \"Oh because I was a paramedic and a nurse I know everything and you are nothing\". You seem to be assuming that films I've seen are drama films. No, they aren't. I'm talking about going to classes and watching videos of live births. I'm talking about going to my grandmother's house and watching her videos of surgeries, that gives explainations of how they're done and the like. I don't claim to understand the terminology. I don't care frankly. Have you ever assisted births? Have you ever assisted an emergency C-section? Have you ever assisted a partial-birth abortion?\n\n \n You continue to harpping on about a form of abortion which is negligible.\n \n \nSo if a pro-lifer bombs an abortion clinic, does that mean that pro-lifers are cruel to doctors?\n\n \n \n It means that they are nothing more than hypocrits.\n \n \n What about if this pro-lifer was American? Does this mean that Americans are cruel to infants? Of course not. You're just making red herrings (which is good! You usually brag about yourself or make ridiculous statements... I like to see variation!).\n\n \n Irrelevant.\n \n \nThe fetus isn't alive?\n\n \n Isn't a life. There is a difference.\n \n \nHey , you're a nurse right? Don't you remember your biology? What's the biological criteria for life? \n \n A) Metabolism\n B) Reproduction\n C) Stimuli\n D) Growth\n \n That's the core quad. Learn it, Mr. IknoweverythingsinceIwasanurseandthereforeknoweverything.\n\n \n This is bordering on an ad hominem. \n \n \n \nI don't think highly of it.\n\n \n As if that mattered.", 
   {
    "unicode_changes_made": true
   }, 
   22228, 
   null, 
   1068561420.0
  ], 
  [
   22279, 
   null, 
   "sundowner", 
   "Well, I'm glad you've finally realized your ignorance. I give you permission to continue to post, but I banish you from the abortion forum, and silence you to ever debate abortion. Give to yourself 30 lashings and be off. Never come into my kingdom again. :P\n\n \n emoticon_cry\n Yes, as I said Parcum, my deepest appologies. I certainly never meant to step on your toes or challenge your superior knowledge of the subject. Now, that being said, would you mind dropping the whining baby act and getting back to the debate? Do you feel threatened when someone who perhaps knows a little more about something than you do comes along? Is it that difficult for you to admit someone might know a little more about something? You must always ride in the car alone, as I think it would be difficult for anyone else to climb in with you and your ego.", 
   {}, 
   22244, 
   null, 
   1068572220.0
  ], 
  [
   22299, 
   null, 
   "Parcum", 
   "Just because you've been proven incorrect, I have a big ego? HAH. \n \n \n Correction. that would be pro-choice. Unless they go around telling every pregnant woman they see to have an abortion?\n\n \n Correction. Pro-abortion means you support abortion. They are for abortion. \n \n \n Please. If you want us to take you seriously you shouldn't use her as an example.\n\n \n I'm not using her as an example. I'm using her caller as an example. \n \n \n Her son was her husband?\n\n \n No, the husband of the wife who died. \n \n \n This is bordering on an ad hominem.\n\n \n Dude, that's a fact.", 
   {
    "unicode_changes_made": true
   }, 
   22279, 
   null, 
   1068591180.0
  ], 
  [
   22340, 
   null, 
   "mizmaxx", 
   "Parcum, you still haven't answered my question from post #22, concerning the diagrams you linked. If you don't respond I'm going to have to assume that the whole \"partial birth\" thing was just invented.", 
   {}, 
   22299, 
   null, 
   1068622800.0
  ], 
  [
   22354, 
   null, 
   "Charchuk", 
   "Just because you've been proven incorrect, I have a big ego? HAH. \n\n \n You shouldn't be talking about yourself in the 3rd person.\n \n \nCorrection. Pro-abortion means you support abortion. They are for abortion.\n\n \n You are still wrong. They are for the choice of wheither to have one or not. Not to only have them.\n \n \nI'm not using her as an example. I'm using her caller as an example.\n\n \n Same thing. People who call into her type of program are like the ones who read the National Enquirier and think that it is all real.\n \n \nNo, the husband of the wife who died.\n\n \n You should write more clearly.\n \n \nDude, that's a fact.\n\n \n It was a personal attack.", 
   {
    "unicode_changes_made": true
   }, 
   22299, 
   null, 
   1068648000.0
  ], 
  [
   22357, 
   null, 
   "superbuddhaman", 
   "\" IF YOU CAN'T TRUST ME WITH A CHOICE-\n WHY WOULD YOU TRUST ME WITH A BABY?\"\n \n -seen on a t-shirt", 
   {
    "post_info": {
     "post_title": "If you can't trust me....."
    }
   }, 
   22354, 
   null, 
   1068651180.0
  ], 
  [
   22360, 
   null, 
   "AMD4EVER", 
   "You shouldn't be talking about yourself in the 3rd person.\n\n \n Actually he shouldn't be talking like that at all. I've seen the act he puts on when he is proven wrong and it is a sad sight.\n \n \n \n\" IF YOU CAN'T TRUST ME WITH A CHOICE-\n WHY WOULD YOU TRUST ME WITH A BABY?\"\n \n -seen on a t-shirt\n\n \n Now that is an excellent quote!", 
   {}, 
   22354, 
   null, 
   1068653160.0
  ], 
  [
   22362, 
   null, 
   "Charchuk", 
   "Actually he shouldn't be talking like that at all. I've seen the act he puts on when he is proven wrong and it is a sad sight.\n\n \n I know, it is quite sad.\n \n \nNow that is an excellent quote!\n\n \n The problem is that the anti-abortionists want to take all choices away from women as well. To be nothing more than property without a say with regards to her own body. Next thing you know they'll want to choose who the father is as well. It all starts small and works it way up.", 
   {}, 
   22360, 
   null, 
   1068653700.0
  ], 
  [
   22656, 
   null, 
   "mizmaxx", 
   "I've seen the act he puts on when he is proven wrong and it is a sad sight.\n\n \n Well, he's all but admitted he hasn't got a clue what he's talking about regarding \"partial birth\" abortions, by not addressing any questions which poke at the validity of his sources.\n \n \nNext thing you know they'll want to choose who the father is as well. It all starts small and works it way up.\n\n \n Sure, who you have sex with, how you have sex, it's all part of the same thing.", 
   {}, 
   22362, 
   null, 
   1068881520.0
  ], 
  [
   22665, 
   null, 
   "Robbie", 
   "***sigh*** What a savage debate. This guy from India told me that they usually hit each other rather than use sarcasm, yelling, etc when the arguments get heated. Personally, I think that would be preferable to what we do over here. \n \n Anyhow, I had to answer once I saw people talking about how us Pro-Lifers want to control women, take away choice, control every aspect of life etc.\n \n The point I want to make here is that beleif in God does not make you controlling, anti-freedom, etc. I'll be using the foundations and beginning of America to argue. I'm not argueing that the founders were specifially Christian, though I would be interested in doing so. (I'm not fully certain of my veiw on that)\n \n \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness..............We, therefore, the Representatives of the united States of America, in General Congress, Assembled, appealing to the Supreme Judge of the world\"\n (from the declaration of independence)\n \n \"We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\"\n \n Here's another point. People always say that Pro-lifer's are taking away the women's choice and freedom. \n \n A) If the unborn is human/a person, it is unequivocally wrong to kill it. (Except if the woman's life is in danger)\n \n B) An arguement/fear Pro-choicers sometimes bring up is that Men want to control women.\n \n Here is yet another link from boundless :) \n http://www.boundless.org/2000/features/a0000419.html \n \n I'll try to paraphrase some of it here. Pro-choicers fear that, men will get women pregnant... Ok I can't paraphrase it. Its an interesting article, I just can't do any justice to it.\n \n I don't want to control women. For some strange reason, I don't think it should be legal to murder. How anti-choice of me. (here's where someone says that abortion is legal, and therefore not murder. That what the argument is, should abortion be legal. Not 'evil anti-abortionists want to make women into slaves.'", 
   {}, 
   22362, 
   null, 
   1068887040.0
  ], 
  [
   22696, 
   null, 
   "Charchuk", 
   " I don't want to control women. For some strange reason, I don't think it should be legal to murder. How anti-choice of me. (here's where someone says that abortion is legal, and therefore not murder. That what the argument is, should abortion be legal. Not 'evil anti-abortionists want to make women into slaves.'\n\n \n You may be intend to, but that is what will eventually happen. As they say, the road to hell is paved with good intentions.\n \n Murder is a legal term. Abortion is no more murder than when soldiers go to war. By your thinking war is legal murderl. The death penalty is legal murder as well. It is funny. Many anti-abortions consider abortion murder, but they also support the death penalty. There is a contradiction there. They want to save non-persons and yet kill persons.", 
   {}, 
   22665, 
   null, 
   1068907680.0
  ], 
  [
   22697, 
   null, 
   "montalban", 
   "[QUOTE=Charchuk]Murder is a legal term.\n \n So is abortion. What is your point?\n \n \nAbortion is no more murder than when soldiers go to war.\n\n \n So, George W Bush sent in troops to abort Saadam? :)", 
   {}, 
   22696, 
   null, 
   1068907860.0
  ], 
  [
   22719, 
   null, 
   "Charchuk", 
   "So, George W Bush sent in troops to abort Saadam? :)\n\n \n What a smeghead.", 
   {}, 
   22697, 
   null, 
   1068930780.0
  ], 
  [
   22722, 
   null, 
   "Crim", 
   "The death penalty is legal murder as well. \n \n \n It's legal killing, not legal murder.\n \n \n It is funny. Many anti-abortions consider abortion murder, but they also support the death penalty. There is a contradiction there. \n \n \n It's not a contradiction. People receiving the death penalty are (ideally, but all too often not) guilty of serious crimes, while ZEFs are not.", 
   {}, 
   22719, 
   null, 
   1068931140.0
  ], 
  [
   22724, 
   null, 
   "Charchuk", 
   "[QUOTE=Crim]It's legal killing, not legal murder.[q/uote]\n \n I know that, but I'm using his definition against him. Is in if he thinks that abortion is murder than so is this.\n \n \nIt's not a contradiction. People receiving the death penalty are (ideally, but all too often not) guilty of serious crimes, while ZEFs are not.\n\n \n His point is that a life is a life and no one has a right to take it. I'm using his logic against him.", 
   {}, 
   22722, 
   null, 
   1068932880.0
  ], 
  [
   22733, 
   null, 
   "Robbie", 
   "His point is that a life is a life and no one has a right to take it. I'm using his logic against him.\n\n \n Let me clarify my postition, murder is the killing of an innocent human being.", 
   {}, 
   22724, 
   null, 
   1068936780.0
  ], 
  [
   22735, 
   null, 
   "Charchuk", 
   "Let me clarify my postition, murder is the killing of an innocent human being.\n\n \n Wrong. \n \n Murder:\n \n 1. Unlawful premeditated killing of a human being\n \n Whether it is innocent or not is irrelevant. Besides, to you Christians none of us are innocent. We're all sinners. The Original Sin nonsense. :)", 
   {}, 
   22733, 
   null, 
   1068937740.0
  ], 
  [
   22738, 
   null, 
   "Parcum", 
   "Yes, us pro-lifers just want to take away women's choices. We hate women. Even pro-life women hate themselves. (which means that the majority of American women hate themselves.", 
   {}, 
   22735, 
   null, 
   1068938520.0
  ], 
  [
   22740, 
   null, 
   "Robbie", 
   "Wrong. \n \n Murder:\n \n 1. Unlawful premeditated killing of a human being\n \n Whether it is innocent or not is irrelevant. Besides, to you Christians none of us are innocent. We're all sinners. The Original Sin nonsense. :)\n\n \n Ooops, what I meant was that's the moral definition of murder. My position is, if it's wrong to kill human beings, its wrong to kill the unborn because they are human beings.", 
   {}, 
   22735, 
   null, 
   1068939000.0
  ], 
  [
   22742, 
   null, 
   "Charchuk", 
   "Ooops, what I meant was that's the moral definition of murder. My position is, if it's wrong to kill human beings, its wrong to kill the unborn because they are human beings.\n\n \n Wrong yet again. The moral definition is the same as the legal definition. Still wrong, a fetus is not a human being even if it does have human DNA. It is only a potential human being. A being is a person. A fetus is not a person under the law, or in the biological sense either since it doesn't have a higher brain to form a mind.", 
   {}, 
   22740, 
   null, 
   1068939360.0
  ], 
  [
   22745, 
   null, 
   "Parcum", 
   "It is only a potential human being. A being is a person. A fetus is not a person under the law, or in the biological sense either since it doesn't have a higher brain to form a mind.\n\n \n A person is somebody with personal characteristics. A zygote has personal characteristics (personal DNA, personal blood type, personal sex, et cetera). Therefore, the zygote is a person. \n \n A personality isn't the only personal characteristic.", 
   {}, 
   22742, 
   null, 
   1068940860.0
  ], 
  [
   22814, 
   null, 
   "mizmaxx", 
   "Even if a fetus is a \"person\" (which depends on your definition), why would any killing of a person be unilaterally bad? That's an incredibly limited moral code, making self-defense, war, euthenasia, etc., all wrong.", 
   {}, 
   22745, 
   null, 
   1068970860.0
  ], 
  [
   22846, 
   null, 
   "Charchuk", 
   "A person is somebody with personal characteristics. A zygote has personal characteristics (personal DNA, personal blood type, personal sex, et cetera). Therefore, the zygote is a person. \n \n A personality isn't the only personal characteristic.\n\n \n Wrong. In this context a person is the personality.\n \n Personal sex? I have to same blood type as my mother. Does this mean that I'm not a person?", 
   {}, 
   22745, 
   null, 
   1068994260.0
  ], 
  [
   22931, 
   null, 
   "montalban", 
   "Now that is an excellent quote!\n\n \n Yes, and I follow the teachings of T-shirts too! What a source for an argument!", 
   {}, 
   22360, 
   null, 
   1069058820.0
  ], 
  [
   22932, 
   null, 
   "montalban", 
   "Even if a fetus is a \"person\" (which depends on your definition), why would any killing of a person be unilaterally bad? That's an incredibly limited moral code, making self-defense, war, euthenasia, etc., all wrong.\n\n \n I'm amazed you would argue this.\n \n Well, I suppose if the foetus is 'out to kill' his/her mother, then you might be able to plead self-defence. The mother could say that she was just pre-empting what might happen in 20 years time.:)\n \n Killing is bad. Regardless of the circumstances. Even for self-defence. Such is the prescious nature of humanity.\n \n The only thing in favour of self-defence is that it is the lesser of two evils, not that it is good vs. bad. (It is bad vs worse).", 
   {}, 
   22814, 
   null, 
   1069059060.0
  ], 
  [
   22939, 
   null, 
   "superbuddhaman", 
   "***sigh*** What a savage debate. This guy from India told me that they usually hit each other rather than use sarcasm, yelling, etc when the arguments get heated. Personally, I think that would be preferable to what we do over here. \n \n Anyhow, I had to answer once I saw people talking about how us Pro-Lifers want to control women, take away choice, control every aspect of life etc.\n \n The point I want to make here is that beleif in God does not make you controlling, anti-freedom, etc. I'll be using the foundations and beginning of America to argue. I'm not argueing that the founders were specifially Christian, though I would be interested in doing so. (I'm not fully certain of my veiw on that)\n \n \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness..............We, therefore, the Representatives of the united States of America, in General Congress, Assembled, appealing to the Supreme Judge of the world\"\n (from the declaration of independence)\n \n \"We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\"\n \n Here's another point. People always say that Pro-lifer's are taking away the women's choice and freedom. \n \n A) If the unborn is human/a person, it is unequivocally wrong to kill it. (Except if the woman's life is in danger)\n \n B) An arguement/fear Pro-choicers sometimes bring up is that Men want to control women.\n \n Here is yet another link from boundless :) \n http://www.boundless.org/2000/features/a0000419.html \n \n I'll try to paraphrase some of it here. Pro-choicers fear that, men will get women pregnant... Ok I can't paraphrase it. Its an interesting article, I just can't do any justice to it.\n \n I don't want to control women. For some strange reason, I don't think it should be legal to murder. How anti-choice of me. (here's where someone says that abortion is legal, and therefore not murder. That what the argument is, should abortion be legal. Not 'evil anti-abortionists want to make women into slaves.'\n\n \n \n You must have missed the original post. I asked you to put your belief in god aside. One of my problems with your post is that you state that you are not sure if the frounders were christian- but would love to prove it. This does not matter when the founders came to this country looking for religious freedom from the church of england- much like the protestant- american ideal that is trying to foist its beliefs on the rest of the population. \n You repeatedly quote the Declaration of Independence, which although a profound and eloquent document, with good intentions, it is not nor has it ever been a law. Maybe you should read the CONSTITUTION, most importantly the bill of rights- actually, for this arguement we will only be needing the first right listed there. \n You state that it is unequivically wrong to kill an unborn child- as long as it is human. First of all- i might remind you that it is only your christian ideals that make this a fact within your own mind. IN fact, there are many religions that beleive that there are many reasons why an abortion would make sense, religions that are supposed to feel welcome and free in this country, that are not supposed to have to answer to the ideals of another religion. Something else I might point out is that it should not matter whether it is human or not, as long as you bring the bible into it. I don't think there are any \"on this one condition\" in your commandments. Isn't it funny that a 12 year old child is required to disect a fetal pig, but their parents may be protesting fetal- tissue research at the same exact moment?", 
   {
    "post_info": {
     "post_title": "did ya miss the point?"
    }
   }, 
   22665, 
   null, 
   1069067280.0
  ], 
  [
   22940, 
   null, 
   "superbuddhaman", 
   "It's legal killing, not legal murder.\n \n \n \n It's not a contradiction. People receiving the death penalty are (ideally, but all too often not) guilty of serious crimes, while ZEFs are not.\n\n \n \n \n \n Eeeeeenteresting- it's ok for you to sentence a person to death, as long as you have an excuse? \n \"Thou shalt not kill...........unless you don't like the guy\"\n \n Nice Logic there", 
   {}, 
   22722, 
   null, 
   1069067520.0
  ], 
  [
   22941, 
   null, 
   "superbuddhaman", 
   "Yes, us pro-lifers just want to take away women's choices. We hate women. Even pro-life women hate themselves. (which means that the majority of American women hate themselves.\n\n \n \n No......... The majority of women- no- mankind as a whole is clueless to what is \"right\". Just because it is a popular opinion does not mean it is the correct one...........just ask the Nazi leaders serving time for war crimes.", 
   {}, 
   22738, 
   null, 
   1069067700.0
  ], 
  [
   22942, 
   null, 
   "montalban", 
   "You must have missed the original post. I asked you to put your belief in god aside. One of my problems with your post is that you state that you are not sure if the frounders (sic) were Christian- but would love to prove it. This does not matter when the founders came to this country looking for religious freedom from the church of England- much like the protestant- American ideal that is trying to foist its beliefs on the rest of the population. \n You repeatedly quote the Declaration of Independence, which although a profound and eloquent document, with good intentions, it is not nor has it ever been a law. Maybe you should read the CONSTITUTION, most importantly the bill of rights- actually, for this arguement (sic) we will only be needing the first right listed there. \n\n \n Have you read the US Constitution? I'm unaware (and I'm an outsider on this so I could be wrong), that it has any clauses regarding the killing of unborn. It is neither implicit nor explicit.\n \n When it comes to religion, the US Constitution was over-ridden with regards to Mormon Polygamy.\n Mormon Church v. United States (1890), 136 U. S. 1 (49), ref Amend,Art.1,Cl.1*\n Where the Church pleaded that polygamy as part of their religion was protected by the Constriction.\n \n So why are you raising the issue of the Constitution?\n \n \nYou state that it is unequivically (sic) wrong to kill an unborn child- as long as it is human. First of all- i might remind you that it is only your Christian ideals that make this a fact within your own mind. IN fact, there are many religions that beleive (sic) that there are many reasons why an abortion would make sense, religions that are supposed to feel welcome and free in this country, that are not supposed to have to answer to the ideals of another religion. Something else I might point out is that it should not matter whether it is human or not, as long as you bring the bible into it. \n\n \n Err, no. To determine what is human, many people here have been using un-religious terms such as 'DNA' etc. Perhaps you missed that. You seem to have a problem following the debate.\n \n \nI don't think there are any \"on this one condition\" in your commandments. Isn't it funny that a 12 year old child is required to disect (sic) a fetal pig, but their parents may be protesting fetal- tissue research at the same exact moment?\n\n \n So you are equating pigs with humans. Pig rights! Yes that is logical. We should value a farm animal the same as your kids.\n What basis are you using to rationalise such equality? You did have a point, right?\n \n \n *\n \"In 1890 the Supreme Court of the United States, concluding a great contest begun in the District Court of the Territory of Utah in 1887, held that the National Government had \"a perfect right to prohibit polygamy and all other open offenses against the enlightened sentiment of mankind, not withstanding the pretense of religious convictions by which they may be advocated and practiced.\"\n http://www.barefootsworld.net/consti11.html#c84b", 
   {}, 
   22939, 
   null, 
   1069070820.0
  ], 
  [
   22945, 
   null, 
   "Charchuk", 
   "Yes, us pro-lifers just want to take away women's choices. We hate women. Even pro-life women hate themselves. (which means that the majority of American women hate themselves.\n\n \n The majority of Americans. both men and women, support a woman's right to choose. And this is, according to Michael Moore from right-wing sources. It is really only a few nutjobs, like you, who want to take a woman's rights away from her.", 
   {}, 
   22738, 
   null, 
   1069076040.0
  ], 
  [
   22950, 
   null, 
   "superbuddhaman", 
   "Have you read the US Constitution? I'm unaware (and I'm an outsider on this so I could be wrong), that it has any clauses regarding the killing of unborn. It is neither implicit nor explicit.\n \n When it comes to religion, the US Constitution was over-ridden with regards to Mormon Polygamy.\n Mormon Church v. United States (1890), 136 U. S. 1 (49), ref Amend,Art.1,Cl.1*\n Where the Church pleaded that polygamy as part of their religion was protected by the Constriction.\n \n So why are you raising the issue of the Constitution?\n \n \n \n Err, no. To determine what is human, many people here have been using un-religious terms such as 'DNA' etc. Perhaps you missed that. You seem to have a problem following the debate.\n \n \n \n So you are equating pigs with humans. Pig rights! Yes that is logical. We should value a farm animal the same as your kids.\n What basis are you using to rationalise such equality? You did have a point, right?\n \n \n *\n \"In 1890 the Supreme Court of the United States, concluding a great contest begun in the District Court of the Territory of Utah in 1887, held that the National Government had \"a perfect right to prohibit polygamy and all other open offenses against the enlightened sentiment of mankind, not withstanding the pretense of religious convictions by which they may be advocated and practiced.\"\n http://www.barefootsworld.net/consti11.html#c84b\n\n \n \n \n You have a problem giving pigs rights? Perhaps the hindu people who worship cows have a problem with you eating steak!That goes back to my first argument, the very first post on this thread which stated that their are obviously ranks and tiers to the statement that \"All life is precious and should be preserved.\" \n My point was that it is research, whether it is a clumsy 12 year old and a disection tray, or a highly skilled scientist is a lab. What makes the one kind of research better than the other? Indeed, the scientist studying fetal tissue and stem-cells has a much better hope of providing society with a signifigant finding than the 12 year old. Even more ridiculous is the fact that perhaps some critical disease that might cause a woman to have to decide to have a late-term abortion, could very well be prevented or cured with the help of research done on fetal tissues! \n \n and yes, I am aware that people have been using \"non'religious\" terms such as DNA to define what is human- Good! I'm so tired of people using the bible or the church as their only reason to be against abortion.\n \n It's funny that guy used the declaration of independence in his pro-life retort to common-sense. Especially the quote \"life, liberty, and teh pursuit of happiness...\" Of course, if our fore-fathers agreed with him the way he thinks they did, they might have phrased it...\"Life, liberty, and the pursuit of happiness.....as long as your happiness does not interfere with the opinions and religious rhetoric of your neighbor\"", 
   {}, 
   22942, 
   null, 
   1069080720.0
  ], 
  [
   22990, 
   null, 
   "Robbie", 
   "Wrong yet again. The moral definition is the same as the legal definition. \n\n \n I see. Sorry to bring up slavery, but obviously it was morally right while it was legally sanctioned.\n \n \n Still wrong, a fetus is not a human being even if it does have human DNA. It is only a potential human being. A being is a person. A fetus is not a person under the law, or in the biological sense either since it doesn't have a higher brain to form a mind.\n\n \n Thanks for arguing the main point! :) \n \n So, your position is that personhood is defined by having a higher brain. When does this develop? Does a newborn have it?\n \n My position is that human personhood is defined by three things: a body, a soul, and a mind.", 
   {}, 
   22742, 
   null, 
   1069114860.0
  ], 
  [
   22995, 
   null, 
   "Robbie", 
   "You must have missed the original post. I asked you to put your belief in god aside. One of my problems with your post is that you state that you are not sure if the frounders were christian- but would love to prove it. This does not matter when the founders came to this country looking for religious freedom from the church of england- much like the protestant- american ideal that is trying to foist its beliefs on the rest of the population. \n You repeatedly quote the Declaration of Independence, which although a profound and eloquent document, with good intentions, it is not nor has it ever been a law. Maybe you should read the CONSTITUTION, most importantly the bill of rights- actually, for this arguement we will only be needing the first right listed there. \n You state that it is unequivically wrong to kill an unborn child- as long as it is human. First of all- i might remind you that it is only your christian ideals that make this a fact within your own mind. IN fact, there are many religions that beleive that there are many reasons why an abortion would make sense, religions that are supposed to feel welcome and free in this country, that are not supposed to have to answer to the ideals of another religion. Something else I might point out is that it should not matter whether it is human or not, as long as you bring the bible into it. I don't think there are any \"on this one condition\" in your commandments. Isn't it funny that a 12 year old child is required to disect a fetal pig, but their parents may be protesting fetal- tissue research at the same exact moment?\n\n \n As far as I know, I have never yet argued that abortion is wrong because the Bible says so. I wanted to defend against accusations made against my faith, so it was actually someone else who brought religion back in. I quoted the Declaration of Independence to show that the founders had faith in God, yet wanted a state of religous freedom. You're right though, I should use the constitution rather than the declaration in regards to abortion.\n \n My arguement is that the unborn is a human being in the same sense that a newborn is a human being, therefore it is wrong to kill the unborn. (unless the mother's life is threatened) Maybe it is my Christian 'ideals' that make me believe this. Actually it is, when I think about it. I beleive that human beings have a soul and will live for ever. This means they are far more important than a country or nation. That's why I believe it's wrong to kill retards or disabled people in order to benefit the economy. Since I beleive it's wrong to kill people for these reasons, I believe its wrong to kill the unborn for reasons such as personal comfort, and even if the child is likely to be retarded - just as I beleive its wrong to kill a newborn or adult for the same reasons. So where my arguements do not rely on Christianity is where I'm trying to show that the unborn and newborn are not different any more than the adult and newborn are different. Where my argument does rely on Christianity is when I say it is wrong to murder.\n \n I like your point \"This does not matter when the founders came to this country looking for religious freedom from the church of england- much like the protestant- american ideal that is trying to foist its beliefs on the rest of the population. \"\n \n This shows a good deal of intelligence, IMHO. I notice that people often accuse Christians of 'forcing their beleifs'. It is certainly a compex subject. One thing I want to say is this: When people say you should never try to change other's beliefs - ie \"what's right for you is right for you, and what's right for me...\", they are actually forcing a particular beleif on you. The beleive that there is no real Right or Wrong, and therefore each person has their own which is equally valid.\n \n When you say - \"there are many religions that beleive that there are many reasons why an abortion would make sense, religions that are supposed to feel welcome and free in this country\"\n \n I would like to know which religions you are referring to. Also, not all religions can feel welcome in the U.S. A religion that advocates mass suicide in order to hitch a ride to heaven on a comet passing by, would, in fact, be prohibited. A religion that advocates murder would also not be welcomed.\n \n \"Something else I might point out is that it should not matter whether it is human or not, as long as you bring the bible into it. I don't think there are any \"on this one condition\" in your commandments. \"\n \n I'm not sure what you mean here, could you explain further?\n \n When you say it is \"only your christian ideals that make this a fact within your own mind\" reffering to the wrongness of abortion if the unborn is indeed human, I don't entirely agree. In one sense, it is Christianity that leads me to beleive murder is Wrong. However, it is also legally wrong. You're statement does make me curious... do you beleive that killing, for example, a severly retarded individual in order to benefit society, is fine? If so, I would think that you must be an honest Atheist who recognizes that if there is no God giving human life innate value, it has none.\n \n ***edit*** Althought, I'm more interested in talking about Christianity/Atheism and Right and Wrong, If you want, we could debate abortion only in regards to how it benefits society. I don't think this actually would leave out religions however - it would be based on an atheistic veiw that humans have no God-given innate value and therefore 'right' and 'wrong' must be evaluated in regards to how society is affected. (although, I don't see why we should care about anything, including society, if there is no God)", 
   {}, 
   22939, 
   null, 
   1069117200.0
  ], 
  [
   22999, 
   null, 
   "Robbie", 
   "Sorry to do three posts in a row, just a bit disorderly today :)\n \n \n It's funny that guy used the declaration of independence in his pro-life retort to common-sense. Especially the quote \"life, liberty, and teh pursuit of happiness...\" Of course, if our fore-fathers agreed with him the way he thinks they did, they might have phrased it...\"Life, liberty, and the pursuit of happiness.....as long as your happiness does not interfere with the opinions and religious rhetoric of your neighbor\"\n\n \n And hey! If they agreed with you, they ought to have rephrased it \"Life, liberty, and the pursuit of happiness... as long as your life doesn't interfere with the opinions and retoric of you're neighbor\"", 
   {}, 
   22950, 
   null, 
   1069117740.0
  ], 
  [
   23036, 
   null, 
   "superbuddhaman", 
   "So, your position is that personhood is defined by having a higher brain. When does this develop? Does a newborn have it?\n \n My position is that human personhood is defined by three things: a body, a soul, and a mind.[/QUOTE]\n \n \n \n Hmmm... good question. would you consider a person with severe mental retardation abd/or brain damage to posess a higher brain? A child who has no chance of ever developing past a mental age of 3? A person who's IQ is in the mid-50s? These are often the cadidates for a late-term abortion\n \n As to your position on personhood...That is a religious stance, since not all religions include the concept of a \"soul\".", 
   {}, 
   22990, 
   null, 
   1069147560.0
  ], 
  [
   23039, 
   null, 
   "montalban", 
   "You have a problem giving pigs rights? \n\n \n No, of course I think you should have rights.\n \n \nand yes, I am aware that people have been using \"non'religious\" terms such as DNA to define what is human- Good! I'm so tired of people using the bible or the church as their only reason to be against abortion.\n\n \n So, you're upset that some people are expressing their religious viewpoints?\n \n \nIt's funny that guy used the declaration of independence in his pro-life retort to common-sense. Especially the quote \"life, liberty, and teh pursuit of happiness...\" Of course, if our fore-fathers agreed with him the way he thinks they did, they might have phrased it...\"Life, liberty, and the pursuit of happiness.....as long as your happiness does not interfere with the opinions and religious rhetoric of your neighbor\"\n\n \n No, you meant to say that it should have been stated \"Life liberty and the pursuit of happiness... unless the person doesn't have a voice\"", 
   {}, 
   22950, 
   null, 
   1069148100.0
  ], 
  [
   23064, 
   null, 
   "Charchuk", 
   "Yes, and I follow the teachings of T-shirts too! What a source for an argument!\n\n \n It is much better than following the teachings of thousands of year old myths and legends written by superstituos people who speak of an invisible skyfather... \"Tradition without truth is but an old error...\"", 
   {}, 
   22931, 
   null, 
   1069167120.0
  ], 
  [
   23065, 
   null, 
   "Charchuk", 
   "I see. Sorry to bring up slavery, but obviously it was morally right while it was legally sanctioned.\n\n \n It was never morally right.\n \n \nThanks for arguing the main point! :) \n \n So, your position is that personhood is defined by having a higher brain. When does this develop? Does a newborn have it?\n\n \n The higher brain developes after the period when most abortions are performed.\n \n \nMy position is that human personhood is defined by three things: a body, a soul, and a mind.\n\n \n A fetus only has one of these things. \n \n BTW, what is a soul? Can you prove that you have one, that I have one? It is more than easy enough to prove the existence of a mind.", 
   {}, 
   22990, 
   null, 
   1069167420.0
  ], 
  [
   23083, 
   null, 
   "Robbie", 
   "It was never morally right. \n\n \n Yet it was legal. Therefore there are things that are morally right regardless of what is lawful. And what do you mean morally right? I was under the impression you didn't beleive in moral right and wrong.\n \n \nThe higher brain developes after the period when most abortions are performed. \n\n \n That is a bit ambiguous. Would you say abortion is wrong after that time?\n \n \nA fetus only has one of these things. \n \n BTW, what is a soul? Can you prove that you have one, that I have one? It is more than easy enough to prove the existence of a mind.\n\n \n I don't think you can prove the existence of a soul. As for the mind, its not that easy... does it involve any amount of higher brain, a certain amount, etc? Do you think that different levels of mind means different levels of human value - ie, retarded = less human? Or do you think that any level of 'mind' equals a human being?\n \n \n would you consider a person with severe mental\n retardation abd/or brain damage to posess a higher brain? A child who has no\n chance of ever developing past a mental age of 3? A person who's IQ is in the\n mid-50s? These are often the cadidates for a late-term abortion\n \n As to your position on personhood...That is a religious stance, since not all\n religions include the concept of a \"soul\". \n\n \n My position is if you would not kill a severly retarded born human, then you should not kill a severly retarded unborn human.", 
   {}, 
   23065, 
   null, 
   1069179000.0
  ], 
  [
   23085, 
   null, 
   "Robbie", 
   "So how would I (non-religously) define a person? A living human being. This includes people with physical or mental challenges. It includes the unborn because: An adult is a human person... a child is a human person... a baby is a human person... therefore an unborn child is a human person. The difference between a newborn 'person' and the unborn doesn't change it. That's my postition.", 
   {}, 
   23083, 
   null, 
   1069179540.0
  ], 
  [
   23088, 
   null, 
   "Charchuk", 
   "Yet it was legal. Therefore there are things that are morally right regardless of what is lawful. And what do you mean morally right? I was under the impression you didn't beleive in moral right and wrong.\n\n \n Wrong. I don't believe in morality based on religion inspired fear. There is a difference. I had even stated that Atheists and Agnostics based their morality on reason and not fear as theists do.\n \n \nThat is a bit ambiguous. Would you say abortion is wrong after that time?\n\n \n That depends on the type of brainwaves it has. there are more than one type. A mind produces differen brainwaves than a blank brain. It is sort of like on a phone. When there is no connection all you get is a carrier wave. No contain. BTW, I'm not the one who brought up brainwaves.\n \n \nI don't think you can prove the existence of a soul. As for the mind, its not that easy... does it involve any amount of higher brain, a certain amount, etc?\n\n \n Just use a MRI. It clearly shows brain activity in reaction to the thought process.\n \n \nDo you think that different levels of mind means different levels of human value - ie, retarded = less human? Or do you think that any level of 'mind' equals a human being?\n\n \n Even a simple mind is still a mind, and I have said this before as well.\n \n \nMy position is if you would not kill a severly retarded born human, then you should not kill a severly retarded unborn human.\n\n \n A mind is a mind.", 
   {}, 
   23083, 
   null, 
   1069180920.0
  ], 
  [
   23089, 
   null, 
   "Charchuk", 
   "So how would I (non-religously) define a person? A living human being. This includes people with physical or mental challenges. It includes the unborn because: An adult is a human person... a child is a human person... a baby is a human person... therefore an unborn child is a human person. The difference between a newborn 'person' and the unborn doesn't change it. That's my postition.\n\n \n Your position is uninformed.", 
   {}, 
   23085, 
   null, 
   1069180980.0
  ], 
  [
   23093, 
   null, 
   "Robbie", 
   "Wrong. I don't believe in morality based on religion inspired fear. There is a difference. I had even stated that Atheists and Agnostics based their morality on reason and not fear as theists do. \n\n \n I mean, do you believe there is such a thing as right and wrong? After all, if we're just chemicals, who really cares what we do? Once again you accuse religion of being fear-based and non-religion reason-based. Sigh.\n \n \nEven a simple mind is still a mind, and I have said this before as well...\n A mind is a mind.\n\n \n I'm glad we agree on something. The brainwaves usually start at around 6 weeks don't they?", 
   {}, 
   23088, 
   null, 
   1069182240.0
  ], 
  [
   23094, 
   null, 
   "Robbie", 
   "Your position is uninformed.\n\n \n Oh! NOW I understand!", 
   {}, 
   23089, 
   null, 
   1069182300.0
  ], 
  [
   23096, 
   null, 
   "AMD4EVER", 
   "Oh! NOW I understand!\n\n \n Although I disagree with your stance I do agree with your sarcastic response here. Charchuk really should try harder to come up with a real response to an intellegent post such as the one you provided.\n \n You defined a person as a living human being. It would seem that you define human being as anything with human DNA, correct? But what do you define as living? If I were to have a no pulse or brain waves would I be dead or could I still be living? An unborn doesn't always have a pulse or brain waves so how can we define it as living while avoiding being able to characterize a corpse as living?\n \n One other problem I have with your statement is that I believe if the human mind is one day replaced with a computer chip and that computer chip is placed inside of a robot then that robot is still the same person they were when their mind was contained in their former brain. Do you think I am wrong in this?", 
   {}, 
   23094, 
   null, 
   1069187940.0
  ], 
  [
   23105, 
   null, 
   "Robbie", 
   "Thanks for replying, AMD. \n \n \n You defined a person as a living human being. It would seem that you define human being as anything with human DNA, correct? But what do you define as living? If I were to have a no pulse or brain waves would I be dead or could I still be living? An unborn doesn't always have a pulse or brain waves so how can we define it as living while avoiding being able to characterize a corpse as living?\n \n One other problem I have with your statement is that I believe if the human mind is one day replaced with a computer chip and that computer chip is placed inside of a robot then that robot is still the same person they were when their mind was contained in their former brain. Do you think I am wrong in this? \n\n \n There is differences between a corpse and an early unborn human. (as we've argued before) The corpse has no future or potential, while the unborn does. In that case, I should add 'future conciouseness', or maybe 'potential conciousness' to my definition of living.\n \n The computer question is interesting. I can't imagine a chip complex enough to match the human brain. There are billions of synapses and possibly trillions of connections in an adult brain. My beleif is that what we call 'myself' is a soul or spirit. One day my soul will leave my body, so I guess I won't have any human DNA. Nor will I have a brain! Yet I'll be able to think. (what would be the point, otherwise) So, as for the computer, I don't know. I don't think it would be human, because only God could make the soul part of the computer. However, if the computer had free will, I think I would say yes.\n \n You've got me in a bit of a quandary. I have said that I believe the difference between a newborn and an unborn is really not so different, especially when you compare the newborn and adult. Yet, if you go far enough back - to before heart-beat and brainwaves, there is a rather significant difference. So what I said wouldn't seem to be valid for earlier unborn humans. My problem, then, is that I still believe the unborn should be considered to have a right to life, from conception. And the reason I believe that in the first place is my beleif in souls, which I can't very well argue to someone who doesn't beleive in souls. \n \n I'm finding it very hard to think of a non-religous way to define personhood. Especially a way that gives a newly conceived human the right to life. Minus the soul, what does define a person as something valuable and different from other animals? What my Phych. teacher says is conciousness. In which case, the earlier unborn human, the 'vegetable', maybe even someone who is knocked out is not deserving of rights. You could say conciousness and the likelyhood of that conciousness to continue. This saves the knocked out person. Maybe you could say value to society. That takes out the vegetable, althought the unborn without defects would probably be included. I feel that I could go on and on and never get anywhere with this. As far as I can see, the only thing that gives humans the right to life is God. If you beleive in God, then all human life is infinitely valuable and why take a chance with an unborn child? Otherwise, I suppose the ultimate good is society, or the state - so value to society would determine the right to life. That's the way I see it.", 
   {}, 
   23096, 
   null, 
   1069192500.0
  ], 
  [
   23116, 
   null, 
   "Charchuk", 
   "I mean, do you believe there is such a thing as right and wrong? After all, if we're just chemicals, who really cares what we do? Once again you accuse religion of being fear-based and non-religion reason-based. Sigh.\n\n \n Of course I believe in the concepts, but they are still only man-made concepts. The same as good and evil.\n \n You base your morality on the fear of being punished forever if you don't behave. I base mine on survival benefit. The only differences is that I'm honest enough to admit where I get mine from. :)\n \n \nI'm glad we agree on something. The brainwaves usually start at around 6 weeks don't they?\n\n \n And the actually mind forms much later.", 
   {}, 
   23093, 
   null, 
   1069202580.0
  ], 
  [
   23117, 
   null, 
   "Charchuk", 
   "Oh! NOW I understand!\n\n \n That's the problem, you actually don't.", 
   {}, 
   23094, 
   null, 
   1069202580.0
  ], 
  [
   23118, 
   null, 
   "Charchuk", 
   "You defined a person as a living human being. It would seem that you define human being as anything with human DNA, correct? But what do you define as living? If I were to have a no pulse or brain waves would I be dead or could I still be living? An unborn doesn't always have a pulse or brain waves so how can we define it as living while avoiding being able to characterize a corpse as living?\n \n One other problem I have with your statement is that I believe if the human mind is one day replaced with a computer chip and that computer chip is placed inside of a robot then that robot is still the same person they were when their mind was contained in their former brain. Do you think I am wrong in this?\n\n \n I agree with you on this.", 
   {}, 
   23096, 
   null, 
   1069202700.0
  ], 
  [
   23120, 
   null, 
   "Charchuk", 
   "\n \n I'm finding it very hard to think of a non-religous way to define personhood. Especially a way that gives a newly conceived human the right to life. Minus the soul, what does define a person as something valuable and different from other animals? What my Phych. teacher says is conciousness. In which case, the earlier unborn human, the 'vegetable', maybe even someone who is knocked out is not deserving of rights. You could say conciousness and the likelyhood of that conciousness to continue. This saves the knocked out person. Maybe you could say value to society. That takes out the vegetable, althought the unborn without defects would probably be included. I feel that I could go on and on and never get anywhere with this. As far as I can see, the only thing that gives humans the right to life is God. If you beleive in God, then all human life is infinitely valuable and why take a chance with an unborn child? Otherwise, I suppose the ultimate good is society, or the state - so value to society would determine the right to life. That's the way I see it.\n\n \n You say that you're having trouble defining personhood with non-religious term. Well, for many centuries the Church had taught that a fetus wasn't a human being, person, until it draw its first breathe. If it was stillborn than it wasn't a person and couldn't be baptized or even buried on hallow ground. That was the religious definition of personhood for the majority of Christians throughout history. It even continued into the 20th century. \n \n My grandmother's last pregnancy ended in a stillbirth (The cord had been wraped around his neck). Like most births at the time it was done at home. The priest refused to bless him and wouldn't let my grandparents bury him in the family section of the graveyard. They had to bury him just outside of the graveyards wall. Until recently there had been a monument to all aborted fetuses in this graveyard, but the Pope had ordered all such monuments removed from Catholic cemeteries.", 
   {}, 
   23105, 
   null, 
   1069203360.0
  ], 
  [
   23157, 
   null, 
   "montalban", 
   "It is much better than following the teachings of thousands of year old myths and legends written by superstituos people who speak of an invisible skyfather...\n\n \n Prove it. (to quote your standard pap answer)", 
   {}, 
   23064, 
   null, 
   1069239900.0
  ], 
  [
   23158, 
   null, 
   "montalban", 
   "My position is that human personhood is defined by three things: a body, a soul, and a mind.\n\n \n \nA fetus only has one of these things. \n \n BTW, what is a soul? Can you prove that you have one, that I have one? It is more than easy enough to prove the existence of a mind.\n\n \n So, you don't think that they have a body?", 
   {}, 
   23065, 
   null, 
   1069240020.0
  ], 
  [
   23159, 
   null, 
   "montalban", 
   "Of course I believe in the concepts, but they are still only man-made concepts. The same as good and evil.\n \n You base your morality on the fear of being punished forever if you don't behave. I base mine on survival benefit. The only differences is that I'm honest enough to admit where I get mine from. \n\n \n Huh? So, you're saying that what is good is what allows you to survive? If that's the case; that it just is about your own survival, then why are you even in this abortion debate at all? You're not a woman, so what's in it for your survival?", 
   {}, 
   23116, 
   null, 
   1069240200.0
  ], 
  [
   23169, 
   null, 
   "Charchuk", 
   "Prove it. (to quote your standard pap answer)\n\n \n Re: The Bloody History of Christianity.", 
   {}, 
   23157, 
   null, 
   1069253160.0
  ], 
  [
   23170, 
   null, 
   "Charchuk", 
   "So, you don't think that they have a body?\n\n \n What does that have to do with the so-called soul? The old saying goes \"body and soul\". What exactly is a soul and has it been actually proven to exist like all other parts of the body have, including the mind?", 
   {}, 
   23158, 
   null, 
   1069253280.0
  ], 
  [
   23171, 
   null, 
   "Charchuk", 
   "Huh? So, you're saying that what is good is what allows you to survive? If that's the case; that it just is about your own survival, then why are you even in this abortion debate at all? You're not a woman, so what's in it for your survival?\n\n \n Read my reply in \"The worst Pro-choice arguement\" thread and you'll get your answer.", 
   {}, 
   23159, 
   null, 
   1069253400.0
  ], 
  [
   23183, 
   null, 
   "Robbie", 
   "Of course I believe in the concepts, but they are still only man-made concepts. The same as good and evil.\n \n You base your morality on the fear of being punished forever if you don't behave. I base mine on survival benefit. The only differences is that I'm honest enough to admit where I get mine from. :) \n\n \n You don't beleive in a real, actual right and wrong then. That's good, since you don't beleive in God - it's honest and logical. I can't imagine what it would be like, though. Do you really think, for instance, the Nazi's weren't evil or bad? Considering survival benifit, the really 'bad' moral thing they did was attack Russia, since that was the beginning of the end of their conquests.\n \n Christianity doesn't say you'll be punished if you're bad, and rewarded if you're good - as if you were taking a test. Christianity says that there's something gone wrong with us, which can only begin to be fixed if we will let God help us.", 
   {}, 
   23116, 
   null, 
   1069264980.0
  ], 
  [
   23185, 
   null, 
   "Charchuk", 
   "You don't beleive in a real, actual right and wrong then.\n\n \n And neither can you since the concepts have always been for the most part subjective to each culture.\n \n \nThat's good, since you don't beleive in God - it's honest and logical. I can't imagine what it would be like, though. Do you really think, for instance, the Nazi's weren't evil or bad?\n\n \n By our standards they were evil. Not by their own.\n \n \nConsidering survival benifit, the really 'bad' moral thing they did was attack Russia, since that was the beginning of the end of their conquests.\n\n \n What truly defeated them there wasn't the Russians themselves, but what had also defeated Napoleon as well, the Russian winter. :)\n \n \nChristianity doesn't say you'll be punished if you're bad, and rewarded if you're good - as if you were taking a test.\n\n \n Yes, it does.\n \n \nChristianity says that there's something gone wrong with us, which can only begin to be fixed if we will let God help us.\n\n \n And thus we are rewarded if we \"behave\", are good, or punished if we \"misbehave\" , are bad.\n \n There is nothing \"wrong\" with us. That is only a means of the Church to keep us beatened down and thus easier to control as well. It is a classic tactic of anyone who wants to dominate another. Just ask any slave, or battered woman.", 
   {}, 
   23183, 
   null, 
   1069266720.0
  ], 
  [
   23189, 
   null, 
   "Robbie", 
   "And neither can you since the concepts have always been for the most part subjective to each culture. \n\n \n But I do. I beleive that the real right and wrong is what God wants. Different cultures have some different ideas, but some are more right and more wrong compared to the real right and wrong is. That's why I believe that the Nazi's were wrong and our culture comparativley right. If you're interested, C.S. Lewis has argued that different cultures in fact have quite similar moralities. \n \n \nBy our standards they were evil. Not by their own.\n\n \n And the question is are our standards any more right than theirs? That's the thought that I would have trouble accepting - that the Nazi's were no more 'evil' than anyone else.\n \n \n Yes, it does.... And thus we are rewarded if we \"behave\", are good, or punished if we \"misbehave\" , are bad.\n\n \n I obviously don't beleive in Christianity, then.\n \n \n There is nothing \"wrong\" with us. That is only a means of the Church to keep us beatened down and thus easier to control as well. It is a classic tactic of anyone who wants to dominate another. Just ask any slave, or battered woman.\n\n \n I don't seem to follow you. Did people tell slaves that they were more sinful than their masters, and therefore had no right to freedom?", 
   {}, 
   23185, 
   null, 
   1069267560.0
  ], 
  [
   23195, 
   null, 
   "Charchuk", 
   "But I do. I beleive that the real right and wrong is what God wants.\n\n \n Of course you do, but it really isn't no different than what I believe in this regard. It is just that I don't need the threat of some invisible sky father to enforce them. :)\n \n \nDifferent cultures have some different ideas, but some are more right and more wrong compared to the real right and wrong is. That's why I believe that the Nazi's were wrong and our culture comparativley right. If you're interested, C.S. Lewis has argued that different cultures in fact have quite similar moralities. \n\n \n I've seen much of what he has to say on many of these topics, but than again he is a product of his own culture. :)\n \n \nAnd the question is are our standards any more right than theirs? That's the thought that I would have trouble accepting - that the Nazi's were no more 'evil' than anyone else.\n\n \n Evil is in the eye of the beholder. The Inquisition and what had happened during the Buring Times was not thought of as evil by the Church of the time either. They actually believed, for the most part, that they were doing good. That it was god's will to cleanse the world of evil.\n \n \nI obviously don't beleive in Christianity, then.\n\n \n Not the Christianity of the majority. Afterall, people will create god in their own image. You're no different.\n \n \nI don't seem to follow you. Did people tell slaves that they were more sinful than their masters, and therefore had no right to freedom?\n\n \n No, they told them that they were inferior, that they were less than human beings. That they were no differnt than the other livestock. Though, I guess the female slaves were human enough for sex. Or would that be count as bestiality?\n \n With Christian calling them no good and sinners does basicially the same thing as telling slaves that they were inferior.", 
   {}, 
   23189, 
   null, 
   1069271100.0
  ], 
  [
   23415, 
   null, 
   "montalban", 
   "Re: The Bloody History of Christianity.\n\n \n You didn't prove anything on that post.\n \n You offered opinion.\n \n Learn the difference, then get back to me.", 
   {}, 
   23169, 
   null, 
   1069421820.0
  ], 
  [
   23416, 
   null, 
   "montalban", 
   "What does that have to do with the so-called soul? The old saying goes \"body and soul\". What exactly is a soul and has it been actually proven to exist like all other parts of the body have, including the mind?\n\n \n I'll go over this again, as you seem to have missed it.\n \n \n My position is that human personhood is defined by three things: a body, a soul, and a mind.\n\n \n \n A fetus only has one of these things. \n BTW, what is a soul? Can you prove that you have one, that I have one? It is more than easy enough to prove the existence of a mind.\n\n \n \nSo, you don't think that they have a body?\n\n \n Let's look at it now in a little more detail\n Robbie says the person has three things; mind, body and soul\n You say it only has one of these things. You obviously don't believe in a soul, that leaves only a mind, or a body.\n \n So, which is it?\n \n Well, now you're saying it's just the soul that doesn't exist. So, before there was one thing, now two.\n \n A case of you changing your argument again?", 
   {}, 
   23170, 
   null, 
   1069422060.0
  ], 
  [
   23420, 
   null, 
   "Charchuk", 
   "You didn't prove anything on that post.\n \n You offered opinion.\n \n Learn the difference, then get back to me.\n\n \n I know the difference, you obviously don't.", 
   {}, 
   23415, 
   null, 
   1069424460.0
  ], 
  [
   23421, 
   null, 
   "Charchuk", 
   "I'll go over this again, as you seem to have missed it.\n \n \n Let's look at it now in a little more detail\n Robbie says the person has three things; mind, body and soul\n You say it only has one of these things. You obviously don't believe in a soul, that leaves only a mind, or a body.\n \n So, which is it?\n \n Well, now you're saying it's just the soul that doesn't exist. So, before there was one thing, now two.\n \n A case of you changing your argument again?\n\n \n The fetus only has a developing body and you knew that is what I had meant. You really like to twist words into something which isn't there. Don't you. Well, I guess that you have to since you don't have any valid arguements to begin with.", 
   {}, 
   23416, 
   null, 
   1069424760.0
  ], 
  [
   23481, 
   null, 
   "montalban", 
   "The fetus only has a developing body and you knew that is what I had meant. You really like to twist words into something which isn't there. Don't you. Well, I guess that you have to since you don't have any valid arguements to begin with.\n\n \n So you're saying you have valid arguments that don't make sense? I can only argue against what you write, and you wrote that they only have one, then you changed it. If I'd have made that mistake, I'd have gone \"Ooops, sorry\", but you don't, you just blame that on me too!\n \n That's a valid argument! :)\n \n As I've asked you to do in the past, take some time before you respond.\n \n If I made a mistake, I'm sure you'd be the first to point it out, actually there'd be a three-corner race between you, Lurch and SLP. emoticon_xbye", 
   {}, 
   23421, 
   null, 
   1069462560.0
  ], 
  [
   23482, 
   null, 
   "montalban", 
   "As you don't believe in any real or absolute right or wrong, except according to culture then your statement earlier that I as a man have no right to comment on abortion should carry a qualifier that your 'rule' only need apply to western men reading this.\n \n Obviously your statement was an absolute, regarding all men.\n \n Now you need to make it culturally specific, so that men in other cultures can tell women what to do.\n \n And you can't argue against them, as it's valid for their own culture.\n \n All you can do is point out what you believe to be true, but even then you can't suggest that it be carried over into their culture, that would be cultural imperialism.\n \n I'm sure you'll forget this and just make generalisations again.\n \n \n :)", 
   {}, 
   23195, 
   null, 
   1069462800.0
  ], 
  [
   23484, 
   null, 
   "Charchuk", 
   "So you're saying you have valid arguments that don't make sense? I can only argue against what you write, and you wrote that they only have one, then you changed it. If I'd have made that mistake, I'd have gone \"Ooops, sorry\", but you don't, you just blame that on me too!\n\n \n I changed nothing. You knew which one I had meant.", 
   {}, 
   23481, 
   null, 
   1069463040.0
  ], 
  [
   23485, 
   null, 
   "Charchuk", 
   "As you don't believe in any real or absolute right or wrong, except according to culture then your statement earlier that I as a man have no right to comment on abortion should carry a qualifier that your 'rule' only need apply to western men reading this.\n\n \n Many women in the other parts of the world don't have nearly as many rights as those in the West do.\n \n \nObviously your statement was an absolute, regarding all men.\n\n \n Get pregnant and we'll talk.\n \n \nNow you need to make it culturally specific, so that men in other cultures can tell women what to do.\n\n \n See above.\n \n \nAnd you can't argue against them, as it's valid for their own culture.\n\n \n In some cultures it is ok to circumize women as well.\n \n \nAll you can do is point out what you believe to be true, but even then you can't suggest that it be carried over into their culture, that would be cultural imperialism.\n \n I'm sure you'll forget this and just make generalisations again.\n\n \n It still doesn't change the fact that all concepts of right and wrong are subjective. The USA doesn't seem to mind imposing its own ideas of this on other cultures, though. The same as the Church didn't mind it either.", 
   {}, 
   23482, 
   null, 
   1069463340.0
  ], 
  [
   23521, 
   null, 
   "montalban", 
   "What's it matter if women in other parts of the world don't have the same rights? It's all, according to you, culturally subjective, therefore okay.\n \n :)\n \n \n You talk about women being circumcised, then say \"It still doesn't change the fact that all concepts of right and wrong are subjective\"\n \n So what if they are being circumcised? According to you, you've no right to make comment on it because it's from another culture.\n \n Your words to me to get pregnant first, is, according to your own rules, a retort only viable if I am a western-orientated (culturally speaking), man.", 
   {}, 
   23485, 
   null, 
   1069475340.0
  ], 
  [
   23545, 
   null, 
   "Charchuk", 
   "What's it matter if women in other parts of the world don't have the same rights? It's all, according to you, culturally subjective, therefore okay.\n \n :)\n\n \n Who are you to impose your concepts on others? We may not like it, but it is still a fact. \n \n \nYou talk about women being circumcised, then say \"It still doesn't change the fact that all concepts of right and wrong are subjective\"\n\n \n It doesn't. These concepts have always been subjective. This still doesn't mean that some can't adopt those of another culture if they choose to.\n \n \nSo what if they are being circumcised? According to you, you've no right to make comment on it because it's from another culture.\n\n \n We do if they are members of organizations like the UN where they have agreed to the conditions of membership. That is not the same as imposing our concepts on them. They joined willingly. You sure like to twist other's words. Don't you? But than again that is the only arguement you have is to do that.\n \n \nYour words to me to get pregnant first, is, according to your own rules, a retort only viable if I am a western-orientated (culturally speaking), man.\n\n \n Or in a country which is a member of an organization like the UN, which subscribes to the Declaration of Human Rights.", 
   {}, 
   23521, 
   null, 
   1069509120.0
  ], 
  [
   23689, 
   null, 
   "montalban", 
   "Who are you to impose your concepts on others? We may not like it, but it is still a fact. \n \n \n \n It doesn't. These concepts have always been subjective. This still doesn't mean that some can't adopt those of another culture if they choose to.\n \n \n \n We do if they are members of organizations like the UN where they have agreed to the conditions of membership. That is not the same as imposing our concepts on them. They joined willingly. You sure like to twist other's words. Don't you? But than again that is the only arguement you have is to do that.\n \n \n \n Or in a country which is a member of an organization like the UN, which subscribes to the Declaration of Human Rights.\n\n \n No, you're telling people how they should interpret those rights. Also, you're telling them once they've signed on they can never change their minds.\n \n I notice you've gone yellow-belly on the constitutional issue. emoticon_ic", 
   {}, 
   23545, 
   null, 
   1069589520.0
  ], 
  [
   23692, 
   null, 
   "Charchuk", 
   "No, you're telling people how they should interpret those rights. Also, you're telling them once they've signed on they can never change their minds.\n\n \n What a load of XXXX.\n \n \nI notice you've gone yellow-belly on the constitutional issue. emoticon_ic\n\n \n Hardly. I had said that we weren't never taught that it was anything other than what I had said. You're the one being dishonest, but that is expected considering.", 
   {}, 
   23689, 
   null, 
   1069596000.0
  ], 
  [
   23784, 
   null, 
   "montalban", 
   "One poster on this issue believes that human rights are both subjective; depending upon culture and fixed, dependent upon his interpretation of the UN Charter for Human Rights.\n \n This does not make any sense when one considers that culture and nation don't necessarily equate.\n \n How does a nation, a signer of the declaration deal with a culture within it's own bounds that does something that the UN Charter forbids?\n \n They can not make a determination over-riding that culture (according to him), but they must, by virtue of being a signatory to the Charter.", 
   {}, 
   23692, 
   null, 
   1069647240.0
  ], 
  [
   23792, 
   null, 
   "Charchuk", 
   "One poster on this issue believes that human rights are both subjective; depending upon culture and fixed, dependent upon his interpretation of the UN Charter for Human Rights.\n \n This does not make any sense when one considers that culture and nation don't necessarily equate.\n \n How does a nation, a signer of the declaration deal with a culture within it's own bounds that does something that the UN Charter forbids?\n \n They can not make a determination over-riding that culture (according to him), but they must, by virtue of being a signatory to the Charter.\n\n \n They choose to be subjected to it. They choose to change.", 
   {}, 
   23784, 
   null, 
   1069650000.0
  ], 
  [
   23835, 
   null, 
   "superbuddhaman", 
   "Ok, I promise, the minute a UN ambassador show up on the street corner with one of those disgusting signs... I will talk to him about human rights.\n When I see a UN ambassador down at the clinic, violating federal mandates with his venomous hatred and propaganda, I will make a point of it to bring up human rights.\n The next time I see the UN peacekeepers show up there at the clinic, to protect the patrons and the staff...we'll talk.\n \n This argument has nothing to do with the UN... It has a lot to do with bourgeois protestant fundamentalists who don't like the way the law is written. The United States Supreme Court has ruled, and continues to support the opinion that a woman has the right to choose. That is a fact. The only problem I see is making people realize that their personal opinions are just that... personal...more important.. they are irrelevant. \n \n I think we can all agree that abortion is, at best, a tragic solution. At worst it can cause permanent physical and psychological damage or even death. To castigate a woman who would make this unfortunate decision is uncaring, unenlightened and illogical.", 
   {}, 
   23792, 
   null, 
   1069667340.0
  ], 
  [
   23940, 
   null, 
   "montalban", 
   "Ok, I promise, the minute a UN ambassador show up on the street corner with one of those disgusting signs... I will talk to him about human rights.\n When I see a UN ambassador down at the clinic, violating federal mandates with his venomous hatred and propaganda, I will make a point of it to bring up human rights.\n The next time I see the UN peacekeepers show up there at the clinic, to protect the patrons and the staff...we'll talk.\n \n This argument has nothing to do with the UN... It has a lot to do with bourgeois protestant fundamentalists who don't like the way the law is written. The United States Supreme Court has ruled, and continues to support the opinion that a woman has the right to choose. That is a fact. The only problem I see is making people realize that their personal opinions are just that... personal...more important.. they are irrelevant. \n \n I think we can all agree that abortion is, at best, a tragic solution. At worst it can cause permanent physical and psychological damage or even death. To castigate a woman who would make this unfortunate decision is uncaring, unenlightened and illogical.\n\n \n For me a rule such as \"Thou shall not kill\" applies, as it does to the issue of capital punishment, self-defence, euthenasia.\n \n All human life, bearing as it does the image of God, is sacred.\n \n As to women's decisions, they can't be informed if as we see here, there's debate about what exactly a foetus is. I believe it is human, others may not.\n \n But it is because I see it as human that I believe that the killing of it; a human, is wrong.\n \n Oddly enough many people don't consider that if we outlaw abortions women will still have them, and richer women will have greater access to better back-yard abortionists, and thus it will be poorer women who will suffer more. It's a difficult issue because of this, weighing up one person's suffering to another's.", 
   {}, 
   23835, 
   null, 
   1069734360.0
  ], 
  [
   23963, 
   null, 
   "superbuddhaman", 
   "For me a rule such as \"Thou shall not kill\" applies, as it does to the issue of capital punishment, self-defence, euthenasia.\n \n All human life, bearing as it does the image of God, is sacred.\n \n As to women's decisions, they can't be informed if as we see here, there's debate about what exactly a foetus is. I believe it is human, others may not.\n \n But it is because I see it as human that I believe that the killing of it; a human, is wrong.\n \n Oddly enough many people don't consider that if we outlaw abortions women will still have them, and richer women will have greater access to better back-yard abortionists, and thus it will be poorer women who will suffer more. It's a difficult issue because of this, weighing up one person's suffering to another's.\n\n \n You seem to want to deny a person's ingrained fight to survive. Not even in self defence do you have a right to protect your own person?!?Amazing.Perhaps you beleive that even in this modern era, where technology and medical science is on our side that a person must endure hardship over superstitious religious dogma? \n This seems like a lot of mumbo jumbo to me. Not all persons in this country beleive as you do in the ten commandments. Not all persons in this country believe as you do in God, and the idea that He \"created\" all life in his image. Why should all of American culture be forced to submit to a christian ideal? \n You see it as a human, that the killing of it is wrong.... a few hundred years ago these children would have been left out on the hillside for \"nature to take it's course\". (now we have a group of people who sit in a room somewhere and decide when it is legal to go to the hillside, exactly which hillside is the best one, in what conditions is it unnacceptable to do so....) It is wrong to \"kill\" an unborn child, thereby sentencing it's mother to death? Where exactly do you get your priorities?\n You say that women will still have abortions. This is true. Why? A woman has the right and the desire to decide her own future. Perhaps you feel that if she is making a decision you don't personally agree with that she is not entitled to a safe and sanitary procedure? \n It is indeed a difficult issue, weighing one person's suffering against another's...\n Why do you feel entitled to enter into a stranger's innermost personal and tragic decisions? Who are you to assume you know better than the persons involved in said decision? You think you know better than the parents, than the medical staff, than the honored judges who sit in the courts? \n \n Wow", 
   {}, 
   23940, 
   null, 
   1069755060.0
  ], 
  [
   23970, 
   null, 
   "montalban", 
   "You seem to want to deny a person's ingrained fight to survive. Not even in self defence do you have a right to protect your own person?!?Amazing.Perhaps you beleive that even in this modern era, where technology and medical science is on our side that a person must endure hardship over superstitious religious dogma? \n\n \n Actually on a previous post I qualified this; I believe it was a thread Parcum started asking about the Orthodox view on abortion. I would fight for my family, as an example, because if I had the power to prevent a death, but sat back and let it happen, then I believe I'm complied in the death. I would do my best to prevent death. But death might occur. I am saying that I would not lightly treat such a matter.\n \n So I have been given a life by God. For me to just lie there and let myself be killed then I would be in effect committing suicide, which is wrong.\n \n But each killing of a human being is a very bad thing. There simply is no way else of looking at it, each human being is created in the image of God. In effect it's a choice between two wrongs, not a wrong and a right.\n \n Even if I killed a murderer I would have great remorse and would seek the forgiveness of God.\n \n I never said anything about putting up with hardship. I don't know where you read that into my words. You may have me confused with another poster. God gave us a brain, and if we've come up with medicines, then good.\n \n \nThis seems like a lot of mumbo jumbo to me. \n\n \n That's not a very Buddhist thing to say. For a Buddhist you too are being rather judgemental of another's beliefs. I recall the Dalai Lama for instance having great respect for Christianity. You've caught me just before I've gone off to bed, so I hope I don't sound angry.\n \n \nNot all persons in this country beleive as you do in the ten commandments. Not all persons in this country believe as you do in God, and the idea that He \"created\" all life in his image. Why should all of American culture be forced to submit to a Christian ideal? \n\n \n If I believe it is the truth, then I must act accordingly. For me to do otherwise is dishonest. And, also, if I help someone on the street, I do so because of my beliefs. You lean towards a negative image of this religious view of mine.\n \n \nYou see it as a human, that the killing of it is wrong.... a few hundred years ago these children would have been left out on the hillside for \"nature to take it's course\". (now we have a group of people who sit in a room somewhere and decide when it is legal to go to the hillside, exactly which hillside is the best one, in what conditions is it unnacceptable to do so....)\n\n \n Huh? The killing of a human being is wrong. Period.\n \n [QUOTE=superbuddhaman]It is wrong to \"kill\" an unborn child, thereby sentencing it's mother to death? Where exactly do you get your priorities?\n \n I can't say which human is more valuable. Also, on another post I said that I would not be for criminalizing abortions. I believe it is wrong to kill, but changing from killing one to another makes no sense.\n \n \nYou say that women will still have abortions. This is true. Why? A woman has the right and the desire to decide her own future. \n\n \n She is killing another human being. Unfortunately many people don't even believe that this is the case. Some people on these subjects have suggested that the foetus she is aborting is nothing more than an amalgam of cells.\n \n \nPerhaps you feel that if she is making a decision you don't personally agree with that she is not entitled to a safe and sanitary procedure? \n\n \n No. See above; two comments up.\n \n \nIt is indeed a difficult issue, weighing one person's suffering against another's...\n Why do you feel entitled to enter into a stranger's innermost personal and tragic decisions? Who are you to assume you know better than the persons involved in said decision? You think you know better than the parents, than the medical staff, than the honored judges who sit in the courts? \n\n \n By your own rationale; what makes a doctor more an expert on the woman's life choice (excepting when it's a medical issue). Ditto for the judge in all cases. Judges are often men anyway.\n \n But as to the truth of the matter. I hold it as true that a human being is made in the image of God. I am telling you what I believe. I am not calling for women to be hung in public for their decisions, but likewise I can't remain silent. I believe that the foetus is a human and I will argue against people who believe that it's just some weird off-shoot of the mother; or that it's not a life until it takes it's first breath. (In my state, New South Wales, the baby isn't officially a baby until it takes it's first gasp of air, and this can be while it's still connected to the mother).", 
   {}, 
   23963, 
   null, 
   1069761660.0
  ], 
  [
   23977, 
   null, 
   "Charchuk", 
   "For me a rule such as \"Thou shall not kill\" applies, as it does to the issue of capital punishment, self-defence, euthenasia.\n\n \n As was shown that isn't possible. No one can live up to that commandment written as it is. Even in the original form it still wasn't as all emcompassing as you may want it to be since it only commanded against the murder of Israelites and not anyone else.\n \n \nAll human life, bearing as it does the image of God, is sacred.\n\n \n Prove this statement. Even the Pope has said that the image we're suppose to be made in is spiritual, not physical. A fetus doesn't even have a mind, and the so-called soul is a fantasy.\n \n \nAs to women's decisions, they can't be informed if as we see here, there's debate about what exactly a foetus is. I believe it is human, others may not.\n\n \n Science already knows what a fetus is. And women can base their decision on facts instead of fantazy.\n \n \nBut it is because I see it as human that I believe that the killing of it; a human, is wrong.\n\n \n It maybe human, and we never said that it wasn't, but it is not a human being and thus not murder.\n \n \nOddly enough many people don't consider that if we outlaw abortions women will still have them, and richer women will have greater access to better back-yard abortionists,\n\n \n Of course they will since that was how it was before women got their reproductive rights.\n \n \nand thus it will be poorer women who will suffer more. It's a difficult issue because of this, weighing up one person's suffering to another's.\n\n \n In this case you choose the fetus over the life of a person. That is what the ban on PBA will do as well to.", 
   {}, 
   23940, 
   null, 
   1069768800.0
  ], 
  [
   24109, 
   null, 
   "superbuddhaman", 
   "[But each killing of a human being is a very bad thing. There simply is no way else of looking at it, each human being is created in the image of God. In effect it's a choice between two wrongs, not a wrong and a right.]\n \n Of course the killing of a human is a bad thing. Of course it is tragic and heart-wrenching. Of course you feel strongly about it. That's normal. The implication that a respect for life can only come from a god-belief is truly insulting. I find it astoundingly pretentious of you to present, as fact, your personal superstitions and religious rhetoric. The idea that I am created in the image of a god, yet not twenty people can line up and agree on what that god is. There are so many other ways of looking at things than the siple christian ideal, I apologise for not claiming to grasp an \"eternal truth\"\n \n \n \n [Even if I killed a murderer I would have great remorse and would seek the forgiveness of God.]\n \n Once again, Of course the killing of a human is a bad thing. Of course it is tragic and heart-wrenching. Of course you feel strongly about it. That's normal\n \n [ God gave us a brain, and if we've come up with medicines, then good.]\n \n They don't have medicine for everything.\n \n [That's not a very Buddhist thing to say. For a Buddhist you too are being rather judgemental of another's beliefs. I recall the Dalai Lama for instance having great respect for Christianity. You've caught me just before I've gone off to bed, so I hope I don't sound angry]\n \n Let me tell you , just once, that not all people agree on everything. If you think you have me dialed because I am a buddhist... i can tell you right now, your asumptions are wrong. I try not to be too judgemental of other beliefs. What I don't like is when someone is treading on the toes of my freedom and my rights, waving a religious banner.\n I do respect christianity. I don't doubt for a minute it has actually helped at least a dozen people thoughout it's colorful history. But that doesn't mean for a minute that i have to respect you., hope I don't sound angry.\n \n [If I believe it is the truth, then I must act accordingly. For me to do otherwise is dishonest. And, also, if I help someone on the street, I do so because of my beliefs. You lean towards a negative image of this religious view of mine.]\n \n Might I suggest a thorough reading of Shakespeare's 'Othello' for what might be wrong with acting in accordance of what you think to be true. I should hope you would help some one on the street because they neede it, not with your ulterior religious motives.\n \n \n \n [Huh? The killing of a human being is wrong. Period.]\n \n Once again, Of course the killing of a human is a bad thing. Of course it is tragic and heart-wrenching. Of course you feel strongly about it. That's normal\n \n [By your own rationale; what makes a doctor more an expert on the woman's life choice (excepting when it's a medical issue). Ditto for the judge in all cases. Judges are often men anyway.]\n \n That would be my basic ingrained understanding and trust of the american judicial system. We have entrusted our judges with the responsibility of making these decisions for us. That's what they do. We trust our doctors because of the many years of training and education they accrue at our nation's medical schools. Abortion is a medical issue, silly. \n \n \n [But as to the truth of the matter. I hold it as true that a human being is made in the image of God. I am telling you what I believe. I am not calling for women to be hung in public for their decisions, but likewise I can't remain silent. I believe that the foetus is a human and I will argue against people who believe that it's just some weird off-shoot of the mother; or that it's not a life until it takes it's first breath. (In my state, New South Wales, the baby isn't officially a baby until it takes it's first gasp of air, and this can be while it's still connected to the mother).\n [/QUOTE]\n \n I don't really care what you hold as true. You may hold it as true tha the moon is made of green cheese- I still don't think your ideas should affect laws. You are not calling for women to be hung in public for their decisions, you are just saying they have no right at all to make that decision! Nobody expects you to remain silent, no, of course not... you have every right to get involved in some stranger a half a word away's personal and private medical decisions....Let me know the next time you have a check-up...I might have an opinion on the matter.", 
   {}, 
   23970, 
   null, 
   1069837860.0
  ], 
  [
   24111, 
   null, 
   "montalban", 
   "[But each killing of a human being is a very bad thing. There simply is no way else of looking at it, each human being is created in the image of God. In effect it's a choice between two wrongs, not a wrong and a right.\n\n \n \nOf course the killing of a human is a bad thing. Of course it is tragic and heart-wrenching. Of course you feel strongly about it. That's normal. The implication that a respect for life can only come from a god-belief is truly insulting. I find it astoundingly pretentious of you to present, as fact, your personal superstitions and religious rhetoric. The idea that I am created in the image of a god, yet not twenty people can line up and agree on what that god is. There are so many other ways of looking at things than the siple christian ideal, I apologise for not claiming to grasp an \"eternal truth\"\n\n \n I find your whole tone absolutely insulting. Especially the bit about bringing all my beliefs down to the phrase mumbo jumbo. I suppose your religion is the one rational belief system\n \n I am trying to to reply insult with insult. In that mind here endeth my discussions with you.", 
   {}, 
   24109, 
   null, 
   1069846440.0
  ], 
  [
   24113, 
   null, 
   "superbuddhaman", 
   "I find your whole tone absolutely insulting. Especially the bit about bringing all my beliefs down to the phrase mumbo jumbo. I suppose your religion is the one rational belief system\n \n I am trying to to reply insult with insult. In that mind here endeth my discussions with you.\n\n \n \n Awwww....I didn't mean to damage your ego.... poor thing. I'm sure you do find my tone insulting... I'm sure if I had bowed to your ridiculous notions youwould have been pleased. Sorry. \n And for the record... NO, I don't think mine is the only rational belief system, just the most rational, but that's why I chose it.... I'm sure you feel the same way about yours... that's called faith. This debate is not about faith though, it is about abortion.\n I value life very much.. in all its varying shapes and sizes. I value every aspect of life, especially the rights of the person concerned to make decisions regarding their own life and that of their children. I support a woman's right to choose on many different levels. Although I don't doubt that this is often the wrong choice to make... it is not my place to say that.\n It is my place to have compassion for my fellow beings.... I'm sorry if you can't handle that.\n Get back up there on your high horse... I'm sure your expert opinion is needed in some stranger's life.", 
   {}, 
   24111, 
   null, 
   1069847880.0
  ], 
  [
   24135, 
   null, 
   "Robbie", 
   "I have seen that you are intelligent, superbuddhaman, but I don't think I've met anyone on the board more condescending that you. Of course, its your choice, I'm not saying you can't be a jerk.\n \n What I'm curious about, though, is what does your faith say about pride? I've never met a buddist before. Do buddist's beleive in a God?...", 
   {}, 
   24113, 
   null, 
   1069868700.0
  ], 
  [
   24157, 
   null, 
   "Charchuk", 
   "I find your whole tone absolutely insulting. Especially the bit about bringing all my beliefs down to the phrase mumbo jumbo. I suppose your religion is the one rational belief system\n \n I am trying to to reply insult with insult. In that mind here endeth my discussions with you.\n\n \n That greater insult is your assumption that morality can only be right if it is your version of morality which is based on the fear of what will happen to you if you do something wrong. That people can't be moral if they aren't a Christian, or even religious at all.", 
   {}, 
   24111, 
   null, 
   1069883520.0
  ], 
  [
   24488, 
   null, 
   "montalban", 
   "That greater insult is your assumption that morality can only be right if it is your version of morality which is based on the fear of what will happen to you if you do something wrong. That people can't be moral if they aren't a Christian, or even religious at all.\n\n \n \n Find where I said that you have to be a Christian to be moral, or again you're making a silly remark.\n \n Secondly, the greater insult is that someone who is 'religious' as the person you're defending would claim that my religion is a bunch of 'mumbo jumbo' when one of the leading lights of Buddhism; the Dalai Lama has said the opposite.\n \n That you'd now enter into this show either you've not understood this, or read it (as I mentioned it before)... and also, why are you believing that his religious beliefs are more rational than mine?", 
   {}, 
   24157, 
   null, 
   1070075220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  America the Great", 
  "url": "http://www.4forums.com/political/abortion-debates/1234-america-great.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 1234, 
  "discussion_files": [
   [
    "28693.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-print.html"
   ], 
   [
    "28694.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-8-print.html"
   ], 
   [
    "28695.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-6-print.html"
   ], 
   [
    "28696.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-4-print.html"
   ], 
   [
    "28697.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-5-print.html"
   ], 
   [
    "28698.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-7-print.html"
   ], 
   [
    "28699.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-3-print.html"
   ], 
   [
    "28700.html", 
    "http://www.4forums.com/political/abortion-debates/1234-america-great-2-print.html"
   ]
  ], 
  "identifier": 1234
 }
]