[
 [
  [
   344193, 
   null, 
   "isly ilwott", 
   "French state found responsible for deporting Jews | World news | Chron.com - Houston Chronicle\n \n PARIS &#8212; France's top judicial body on Monday recognized the French government's responsibility for the deportation of Jews during World War II, the clearest such recognition of the state's role in the Holocaust.\n \n The Council of State found that the government of Nazi-occupied France at the time held the \"responsibility\" for deportations that led to anti-Semitic persecution.\n \n The decision released Monday also found that the deportation had been \"compensated for\" since 1945, apparently ruling out any reparations for deportees or their families.\n \n Thousands of Jews were deported from France to Nazi death camps during the occupation. After the war, subsequent French governments took decades to acknowledge any role by the collaborationist Vichy regime in the Holocaust.\n \n A Paris court had sought the Council of State's opinion on a request by the daughter of a deportee who died at Auschwitz for reparations from the French state. She was also asking for material and moral damages for her own personal suffering during and after the occupation.\n \n The council left it up to the Paris court to rule on her request.\n \n But the council in its decision said that it \"considers that because the acts and actions by the state led to the deportation of people considered Jews by the Vichy regime, (they) constituted errors and became its responsibility.\"\n \n The council called for a \"solemn recognition of the state's responsibility and of collective prejudice suffered\" by the deportees.\n \n Today, France has western Europe's largest Jewish community of approximately 500,000.", 
   {
    "post_info": {
     "post_title": "Finally, the French 'fess up!"
    }
   }, 
   null, 
   null, 
   1234816320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Finally, the French 'fess up!", 
  "url": "http://www.4forums.com/political/news-forum/12358-finally-french-fess-up.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 12358, 
  "discussion_files": [
   [
    "16983.html", 
    "http://www.4forums.com/political/news-forum/12358-finally-french-fess-up-print.html"
   ]
  ], 
  "identifier": 12358
 }
]