[
 [
  [
   344325, 
   null, 
   "foundit66", 
   "Herman Rosenblat received international attention for his tale about being a hungry little boy in a Nazi concentration camp who was thrown apples every day by a little girl named Roma, on the other side of the fence. \n \n Years later, according to the story, Rosenblat met that same girl on a blind date in New York City and proposed to her on the spot. \n \n The only problem was, Rosenblat's story, which he and his wife had been telling for 13 years, was a lie. \n \n Six weeks ago Holocaust scholars proved that it was physically impossible for prisoners to approach the fence at the concentration camp where Herman was kept and that Roma's family was actually 200 miles away at the time. \n \n Today, for the first time, Rosenblat spoke out in an exclusive interview with \"Good Morning America\" to share his side of the story. \n \n \"It wasn't a lie,\" he told \"GMA.\" \"It was my imagination. And in my imagination, in my mind, I believed it. Even now, I believe it, that she was there and she threw the apple to me. ... In my imagination, it was true.\" \n \n Rosenblat said he told the story to give people hope and to promote understanding about the Holocaust. His wife went along with the story because, as Rosenblat said, she \"loved\" him. \n \n But even Rosenblat's son said his real motivation was money. \n \"It was always hurtful,\" Rosenblat's son Ken Rosenblat told The New Republic. \"My father is a man who I don't know. ... I didn't agree with it. I didn't want anything to do with it.\" \n \n \"I can't respond to it,\" Rosenblat said of his son's comments. \"I don't know why he said that. Maybe I'll ask him.\" ABC News: Exclusive: Holocaust Faker Speaks Out\n \n I have noticed that some people focus what I believe to be an unwarranted amount of attention on the issue of \"Is it a lie?\"\n For example, somebody says something blatantly false. Something that it would seem obvious that the original person stating the falsehood should (by assumed intelligence and cognizance) realize that the statement is false.\n \n Along comes a poster who labels the statement as a \"lie\", and thus begins a multi-page saga on the issue of whether or not it is a \"lie\", while the absurdity of the claim and the indefensibility of the original speaker of the falsehood goes ignored.\n \n Ergo, I start this thread. I am not certain if this is the right place for this, but it seems the best for the generic issue at hand, if people are interested.\n \n In your opinions, Is this person lying?\n \n My main interest is in the debating analysis of justification for the classification, but I guess all sorts of commentary may be evoked...", 
   {
    "post_info": {
     "post_title": "Is This a Lie?"
    }
   }, 
   null, 
   null, 
   1235000580.0
  ], 
  [
   344341, 
   null, 
   "Zardoz", 
   "It primarily is an untruth.\n \n The fact is also that the teller KNEW it was an untruth despite his personal beliefs and wishes does make it a lie and him a liar.\n If he didn't know this was a false story, I'd say he's not a liar.\n \n Lies can be beneficial as he seems to desirer this one to be. But, they can also be detremental...just as this one is (to other people).\n Benefit / detriment is in the eye of the beholder.\n \n A related story would be the movie 'Jakob the Liar' starring Mork.\n \n \n I think I get what you're trying to find out here.\n We see this a lot in the arguements over whether Bush was lying for the Iraq war. Whether there is lying about knowing that god exists. Whether some statistic is quoted but later turns out to be false...\n \n \n I'd state that in such arguments, you can state 'That is a lie' and then disprove it with known facts (in some cases) but, refrain from calling the other person a liar (which is an insult on their integrity) unless they later repeat such false statements.\n \n For example, Jim states abortionist eat fetuses and post a picture of bigfoot with a doll in his hands as proof.\n Bill then points out that that is false and shows where the picture actually came from and that the source Jim used was a biased web site.\n Jim later continues to post the photo and make the same claims.\n \n Jim is now a known liar.\n A liar being (to me) someone who intentionally tells falsehoods.\n \n \n That's my take on the subject.\n \n Many people get things wrong all the time. Humans make mistakes.\n Getting something wrong and making a mistake doesn't make you a liar.", 
   {}, 
   344325, 
   null, 
   1235003160.0
  ], 
  [
   344360, 
   null, 
   "CUNxTime", 
   "Technically, was a lie but a lil' white one. Until he used it to sell a book, that's what makes it more than just harmless. However, people tell them everyday and sometimes even believe them. With the bunk we're told by 'public' officials and the big, hurtful liars of the world, I'd be inclined to let this one slip...", 
   {}, 
   344341, 
   null, 
   1235009580.0
  ], 
  [
   344365, 
   null, 
   "Baron", 
   "A lie is a lie. Especially when it appears that his motivation for lying was money. In that respect I am much more inclined to believe his son.", 
   {}, 
   344360, 
   null, 
   1235013000.0
  ], 
  [
   344806, 
   null, 
   "Archangel", 
   "A lie is a lie. Especially when it appears that his motivation for lying was money. In that respect I am much more inclined to believe his son.\n\n \n Exactly, it was a blatant misrepresentation of the facts which in his case were nonexistent. It was fiction passed off as fact. An opinion isn't a lie, it's an opinion. If a person states what is alleged to be a fact, but is shown to be inaccurate, even that isn't necessarily a lie unless they knowingly misrepresent what they know to be factual. But that is probably not possible to prove in this setting.\n \n What this guy did was create a story out of whole cloth and even made his wife an accessory to it. That is the definition of a lie. And when you add to that, that he published it in a book, then he knowingly perpetrated an untruth for personal monetary gain.", 
   {}, 
   344365, 
   null, 
   1235364720.0
  ], 
  [
   369452, 
   null, 
   "QuackAttack1887", 
   "While normally lies are not in okay, I agree with him to a point. The holocaust was horrible, and the camps worse. I obviously was not in one, but the accounts I've read were well researched. I know things have gotten so bad for me that I sort of locked myself inside. And my family never disappeared into death towers or went to work and never came home. So with these horrors and there was probably worse then I mentioned, I could see if he locked himself inside his imagination and thought his wife was a girl he imagined throwing him apples. So for him, it was probably very real.", 
   {}, 
   344806, 
   null, 
   1252816800.0
  ], 
  [
   371493, 
   null, 
   "JPSartre12", 
   "While normally lies are not in okay, I agree with him to a point. The holocaust was horrible, and the camps worse. I obviously was not in one, but the accounts I've read were well researched. I know things have gotten so bad for me that I sort of locked myself inside. And my family never disappeared into death towers or went to work and never came home. So with these horrors and there was probably worse then I mentioned, I could see if he locked himself inside his imagination and thought his wife was a girl he imagined throwing him apples. So for him, it was probably very real.\n\n \n There's much that occurred in concentration camps that is better left unspoken. For example, a jew could gain favors with the guards by acting cruely to their fellow jews. This is an area of unspoken truth.\n (BTW, if you're so inclined, I suggest that you read \"The Theory and Practice of Hell\" a book written by a collection of concentration camp survivors after the war.)", 
   {}, 
   369452, 
   null, 
   1253903040.0
  ], 
  [
   372877, 
   null, 
   "lita456", 
   "If it was his imagination and he believed in it, let him believe in it....nothing wrong with it.....", 
   {}, 
   371493, 
   null, 
   1254806400.0
  ], 
  [
   372902, 
   null, 
   "Setarcos", 
   "If by calling something a 'lie' one implies intentional misrepresentation, does a lie cease being a lie if/when the teller becomes deluded and begins believing the tale?", 
   {}, 
   372877, 
   null, 
   1254838620.0
  ], 
  [
   373047, 
   null, 
   "antonia", 
   "No he is not lying. The father is quite a poetic person, and loves his wife and expresses his love in metaphor, becomes the metaphor. His wife nourished his soul. Made it possible for him to survive. He's always loved her, he's always known her, she's always been there for him throughout time.\n \n The son is mad at his father about something else, and doesn't yet understand certain things that went on for his father, or who he is in another way. One day he will. The father will understand the son better too in some way. There's some kind of generation gap, but they'll work this out.\n \n The news article is unkind. They should leave him alone with this very poignant memory and beautiful feelings for his wife. And stay out of the family's business.\n \n ------------------\n \n In a word,\n Never let go on these three things:\n Faith, hope and love.\n And know that the greatest of these\n Will always be love\n \n - The Bible\n \n ----------------------", 
   {
    "post_info": {
     "post_title": "Love is eternal"
    }
   }, 
   372902, 
   null, 
   1254880440.0
  ], 
  [
   373797, 
   null, 
   "Mintaka", 
   "What this guy did was create a story out of whole cloth and even made his wife an accessory to it. That is the definition of a lie. And when you add to that, that he published it in a book, then he knowingly perpetrated an untruth for personal monetary gain.\n\n \n Well he did not make his wife the subject of a locker room conversation did he. Published on the internet no less. That's the definition of a number of things not complimentary to a guy's manhood. He also does not make up stories about other women. Now that really shows a guy who's not a man IMO. No guts. Doesn't have a speck of the courage, integrity and love inside that this man does. Probably would bother him a lot too. Deep down inside himself. Knowing that he's a guy without balls or character.", 
   {}, 
   344806, 
   null, 
   1255224660.0
  ], 
  [
   373901, 
   null, 
   "Archangel", 
   "Well he did not make his wife the subject of a locker room conversation did he. Published on the internet no less. That's the definition of a number of things not complimentary to a guy's manhood. He also does not make up stories about other women. Now that really shows a guy who's not a man IMO. No guts. Doesn't have a speck of the courage, integrity and love inside that this man does. Probably would bother him a lot too. Deep down inside himself. Knowing that he's a guy without balls or character.\n\n \n You wrote this post in response to an opinion I gave above Mintaka, so please explain the meaning of your post if you can. Because I don't understand it at all. Are you implying that I made my wife the subject of a locker room conversation? Published on the internet, no less? \n \n I challenge you to prove the allegation as you say it applies to me with real and accurate evidence, or retract it as dishonest libel and a slanderous lie.", 
   {}, 
   373797, 
   null, 
   1255292340.0
  ], 
  [
   373950, 
   null, 
   "Mintaka", 
   "You wrote this post in response to an opinion I gave above Mintaka, so please explain the meaning of your post if you can. Because I don't understand it at all. Are you implying that I made my wife the subject of a locker room conversation? Published on the internet, no less? \n \n I challenge you to prove the allegation as you say it applies to me with real and accurate evidence, or retract it as dishonest libel and a slanderous lie.\n\n \n Try to stick to the issue even though your brain is not swift. Don't you think a guy's completely dickless if (1) he makes his wife the subject of a locker room conversation? Published on the internet no less? And (2) spreads stories about other women? Which (3) make his opinions on honesty and lying completely worthless? Yet (4) illuminate just how lowly he must feel himself to be, deep down inside, and especially when he sees the courage and dignity of another man, whose balls he will never possess? And (5) explain why he is such dishonest person himself?\n \n emoticon_idea", 
   {}, 
   373901, 
   null, 
   1255307340.0
  ], 
  [
   373960, 
   null, 
   "Archangel", 
   "Try to stick to the issue even though your brain is not swift. Don't you think a guy's completely dickless if (1) he makes his wife the subject of a locker room conversation? Published on the internet no less? And (2) spreads stories about other women? Which (3) make his opinions on honesty and lying completely worthless? Yet (4) illuminate just how lowly he must feel himself to be, deep down inside, and especially when he sees the courage and dignity of another man, whose balls he will never possess? And (5) explain why he is such dishonest person himself?\n \n emoticon_idea\n\n \n My only question for you is why did you quote my post before posting your opinion which evidently agrees with me that he lied? And where are you getting this locker room conversation drivel from? I read the posted article and this is the relevant part that I see, and it says nothing about the gutter aspect you try to inject into it, see?\n Before he was exposed, Rosenblat sold his memoir, \"Angel at the Fence,\" to Berkley Books; the publishing company's deal was later canceled.\n \n A children's book called \"Angel Girl\" was published in September, but was also pulled by its publishing company.\n \n Nevertheless, a reported $25 million film version of the fictional story called \"Flower of the Fence\" is going to proceed.\n Only that it was pure fiction and never actually happened. So when you quoted me and interjected that someone made their wife the subject of locker room conversation, I assumed you were making some slanderous accusation about me and wanted clarification, rightfully so. \n \n Please quote the posted article to show this gutter talk you speak of which degrades his wife, if you can. From what I see, his wife participated in the massive deception which allowed him to spread the lie so effectively. So explain and clarify what issue I am missing because my brain is not swift if you can. Or is it your brain which is so clouded that you can't get even the simplest story right? emoticon_ic ", 
   {}, 
   373950, 
   null, 
   1255309020.0
  ], 
  [
   373986, 
   null, 
   "Mintaka", 
   " Or is it your brain which is so clouded that you can't get even the simplest story right?\n\n \n I see that your brain is so clouded you cannot answer the questions posed to you about the dicklessness of the man who (1) publishes locker room talk about his wife on the internet and (2) makes up stories about other women and (3) the psychological conclusions we can draw about such a dickless wonder such as (4) how he must feel about himself deep inside when he sees another man who has real character and balls. It must bother him to no end seeing what he will never have. And just imagine. The other man is also a Jew. That must really bother him.", 
   {}, 
   373960, 
   null, 
   1255318380.0
  ], 
  [
   373999, 
   null, 
   "Archangel", 
   "I see that your brain is so clouded you cannot answer the questions posed to you about the dicklessness of the man who (1) publishes locker room talk about his wife on the internet and (2) makes up stories about other women and (3) the psychological conclusions we can draw about such a dickless wonder such as (4) how he must feel about himself deep inside when he sees another man who has real character and balls. It must bother him to no end seeing what he will never have. And just imagine. The other man is also a Jew. That must really bother him.\n\n \n Are you dense sonny? Why repeat your questions to me rather than respond to my post which is an answer to the last time you asked the same questions of me? What is your major malfunction sonny boy?\n \n \nMy only question for you is why did you quote my post before posting your opinion which evidently agrees with me that he lied? And where are you getting this locker room conversation drivel from? I read the posted article and this is the relevant part that I see, and it says nothing about the gutter aspect you try to inject into it, see?\n Before he was exposed, Rosenblat sold his memoir, \"Angel at the Fence,\" to Berkley Books; the publishing company's deal was later canceled.\n \n A children's book called \"Angel Girl\" was published in September, but was also pulled by its publishing company.\n \n Nevertheless, a reported $25 million film version of the fictional story called \"Flower of the Fence\" is going to proceed.\n Only that it was pure fiction and never actually happened. So when you quoted me and interjected that someone made their wife the subject of locker room conversation, I assumed you were making some slanderous accusation about me and wanted clarification, rightfully so. \n \n Please quote the posted article to show this gutter talk you speak of which degrades his wife, if you can. From what I see, his wife participated in the massive deception which allowed him to spread the lie so effectively. So explain and clarify what issue I am missing because my brain is not swift if you can. Or is it your brain which is so clouded that you can't get even the simplest story right? emoticon_ic \n", 
   {}, 
   373960, 
   null, 
   1255324560.0
  ], 
  [
   374014, 
   null, 
   "Mintaka", 
   "You are melting down I see. All the answer that's needed.", 
   {}, 
   373999, 
   null, 
   1255332000.0
  ], 
  [
   374039, 
   null, 
   "Archangel", 
   "You are melting down I see. All the answer that's needed.\n\n \n Am I frustrated once again from attempting to actually have a rational discourse with the likes of you and your ilk? Absolutely. But I don't melt down, I place ignorant schmucks on ignore so I never have to deal with their double speak and hypocrisy again. And you are very close to meeting the same end. So keep up the sarcasm rather than attempting to have a thoughtful debate, see what it gets you in the end.", 
   {}, 
   374014, 
   null, 
   1255359780.0
  ], 
  [
   374230, 
   null, 
   "obvious_child", 
   "You are melting down I see. All the answer that's needed.\n\n \n Eh. That's pretty much par for Archie. He lacks basic reading comprehension skills (in addition to many other skills you'd expect from a normal person).", 
   {}, 
   374014, 
   null, 
   1255491000.0
  ], 
  [
   374232, 
   null, 
   "obvious_child", 
   "Is that a lie?\n \n No. Lying requires one to pass off as the truth something they know to be false. If you truly believe that what you say is the truth, you cannot be lying. Hence whenever Archie passes off some completely insane argument against evolution/ for YEC, he's not a liar because he thinks what he's saying is true despite it being horribly, horribly wrong. Just recently he argued that the Coelacanth was the same species in the fossils despite being informed of his wrongness months ago. Was he lying? No. Because his belief is what he think is correct, independent of what reality states. While this is a clear sign of mental illness, it does not equate to lying. \n \n In the same fashion, if the author believed what he was saying as the truth, he cannot be lying. \n \n Now, those who want to attack my argument, you are treading on thin ice as your attack on my argument makes Bush a liar about Iraq.", 
   {}, 
   373986, 
   null, 
   1255491300.0
  ], 
  [
   374235, 
   null, 
   "JPSartre12", 
   "Eh. That's pretty much par for Archie. He lacks basic reading comprehension skills (in addition to many other skills you'd expect from a normal person).\n\n \n Careful or you'll feel the wrath of JP. I now have the power to edit your posts into obscurity. ;)", 
   {}, 
   374230, 
   null, 
   1255491960.0
  ], 
  [
   374238, 
   null, 
   "obvious_child", 
   "Careful or you'll feel the wrath of JP. I now have the power to edit your posts into obscurity. ;)\n\n \n Seriously? We both know he lacks the basic capacity to understand significant parts of the written English language. I did enjoy watching Archie get his *** handed to him over at EvC though. Nothing more amusing then watching Archie try to argue mistakes most people never heard of were frauds.", 
   {}, 
   374235, 
   null, 
   1255492320.0
  ], 
  [
   374240, 
   null, 
   "Archangel", 
   "Seriously? We both know he lacks the basic capacity to understand significant parts of the written English language. I did enjoy watching Archie get his *** handed to him over at EvC though. Nothing more amusing then watching Archie try to argue mistakes most people never heard of were frauds.\n\n \n Interesting how deluded this poster is in his belief that I got anything handed to me when it required the full force of the best evolutionists on EvC to gang up on me to the tune of at least 10 to 1. As evidence of the debate I started there, and that like always these evolutionists never deal directly with what is posted but must always change the subject and ignore the specific arguments offered up, here is the link so anyone who cares to can read it for themselves. And most importantly note that obvious child contributed absolutely nothing substantial throughout the whole debate. He reminded me of a scared little straggler kid who followed the big kids around and popped in every 50 or 60 posts from behind one of the participating adult evolutionists and attempted to throw a childish jab before running away and hiding again. Here, see for yourself. You can click on only his posts and see specifically how and where they fit into the debate. Just as you can click on mine and read my arguments. EvC Forum: EVOLUTION'S FRAUD HAS CONTRIBUTED TO ITS PUBLIC ACCEPTANCE:", 
   {}, 
   374238, 
   null, 
   1255494000.0
  ], 
  [
   374252, 
   null, 
   "obvious_child", 
   "Generally, self respecting people don't post links to threads which show themselves to be utter fools.\n \n By all means, people should read that thread. I know a few people here already have. \n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13247-geological-question-2.html#post371115\n \n And it doesn't matter how many people post against you. When you do not determine the difference between the words \"Fraud\" and \"Mistake\" despite having dictionary definitions provided to you, you got a real problem independent of everyone else. \n \n But for kicks and giggles, here are some quotes replying to Archie\n \n \"You're funny to the point of pathos.\n \n I hate to have to tell you this, but you would make a fine case study in abnormal psychology.\n \n Your elaborate belief system is impervious to logic, reason, and massive amounts of evidence that shows you are wrong.\n \n That may seem fine to you, but that puts you so far out on the fringe that you couldn't see your way back to the mainstream with the Hubble.\n \n I'm not going to engage you any longer on this thread. You have shown that you're not listening to anything we are saying, you're just repeating the details of your anti-science and anti-realism--and totally mythical--belief system. That those details have been explained to you as false has made no impact on you.\n \n Your mind is truly closed, and I won't waste your time or mine with further evidence.\n \n But you do have my pity.\" - Coyote\n \n \n \"Archy had no \"arguments\" that stood up to even a cursory examination.\n \n His inability to even get one (Orce man) of those arguments to stick led to an even heavier drubbing from RAZD to merely hulk in shadow, unused.\n \n I personally wish we could have got beyond the first example, because the next salvo would've been a doozy.\n \n No fraud. case closed. \" - greyseal\n \n This quote is too long to post, but nicely sums up your (as usual) epic failures:\n EvC Forum: EVOLUTION'S FRAUD HAS CONTRIBUTED TO ITS PUBLIC ACCEPTANCE:\n \n (notice you don't even reply to it, you just flee)\n \n I see you are abandoning that site. Does your rear hurt too much from that *ss kicking?", 
   {}, 
   374240, 
   null, 
   1255504800.0
  ], 
  [
   374256, 
   null, 
   "Archangel", 
   "Generally, self respecting people don't post links to threads which show themselves to be utter fools.\n\n \n Then my question for you is, why are you posting here or at EvC at all? Because all you do is embarrass yourself with the shallow and dishonest drivel you spew.\n \n \n And it doesn't matter how many people post against you. When you do not determine the difference between the words \"Fraud\" and \"Mistake\" despite having dictionary definitions provided to you, you got a real problem independent of everyone else. \n\n \n This is what is so dishonest about you proponents of the big lie of evo. You think because evo only forwarded the erroneous evidence which was later proven to be false, but they didn't own the publications which published the stories all around the world, then evolution science itself is innocent of propagating the fraud it represents. This is another manipulation of the facts as they exist. You fail to appreciate that its the press releases by these evolutionists which put this false info out in the first place.\n \n Especially since when the fraud was discovered, this pseudo science just quietly shuffled it to the back page while never fully acknowledging the fraud as loudly as they originally presented it as the next great leap forward in evolutionary discoveries for worldwide dissemination.\n \n \nBut for kicks and giggles, here are some quotes replying to Archie\n \n \"You're funny to the point of pathos.\n \n I hate to have to tell you this, but you would make a fine case study in abnormal psychology.\n \n Your elaborate belief system is impervious to logic, reason, and massive amounts of evidence that shows you are wrong.\n \n That may seem fine to you, but that puts you so far out on the fringe that you couldn't see your way back to the mainstream with the Hubble.\n \n I'm not going to engage you any longer on this thread. You have shown that you're not listening to anything we are saying, you're just repeating the details of your anti-science and anti-realism--and totally mythical--belief system. That those details have been explained to you as false has made no impact on you.\n \n Your mind is truly closed, and I won't waste your time or mine with further evidence.\n \n But you do have my pity.\" - Coyote\n\n \n Thankyou for once again proving my point that most all of what the opposition offered for the most part was off topic insults and shallow lip service which didn't even attempt to refute my position, but simply revealed that they were only capable of attacking me. How apropos that you should absolutely prove my point as further evidence of how clueless you are to what defines a debate with actual content rather than a gang bang by a bunch of empty suits. http://www.evcforum.net/cgi-bin/dm.cgi?action=msg&t=13706 emoticon_xdonno emoticon_frazzled \n \n\n This quote is too long to post, but nicely sums up your (as usual) epic failures:\n EvC Forum: EVOLUTION'S FRAUD HAS CONTRIBUTED TO ITS PUBLIC ACCEPTANCE:\n \n (notice you don't even reply to it, you just flee)\n\n \n Really? Are you saying that I fled the debate after that post and never responded to it again, at all? Is that the lie you're attempting to promote now? And are you also saying that I never dealt with any of the points RAZD made in that post anywhere down the line? Remember child, the link is there for all to see so your lies have no weight.\n \n \nI see you are abandoning that site. Does your rear hurt too much from that *ss kicking?\n\n \n Again, REALLY? Must I post according to your schedule in order to maintain an acceptable presence there? How long must I suffer the same denials of reality from the same cultists before I have proven that those deniers of reality are no more capable of honestly dealing with my questions regarding the inconsistencies of evolution science over there than you are, here. \n \n You originally threatened that I was incapable of standing up to their scrutiny at EvC, I went there and proved you wrong by starting a thread that has gone on for over 300 posts. You also said I would get banned in short order when it was your fellow evos who got banned for attacking me due to their inability to respond on topic to my thread premise. At every turn I have proven you're a schmuck who can only pat yourself on the back because nobody else will based on anything you contribute. Talk about constantly failing epically, you define the label epic failure. And this post which proves every accusation I have made about the boys at EvC just confirms that.\n \n Especially since you offered nothing substantial at all when you claim to be a rational and informed evolutionist. Then why didn't you take the opportunity to pummel me when you had the chance over there and take the lead in humbling me? I'll tell you why little child, because you're a sanctimonious little punk who doesn't have the guts or the knowledge to answer any of my questions which reveal the shortcomings of evolutionist claims. \n \n So you do the next best thing as the coward you are and attempt to claim some victory on the backs of others who did at least dare to confront my arguments, as shallow as they were. Go away little child, and come back when you grow up. At this point you're not worthy of my time as an equal on this or any adult debate forum.", 
   {}, 
   374252, 
   null, 
   1255525140.0
  ], 
  [
   374291, 
   null, 
   "JPSartre12", 
   "This is not the place to hurl invectives at each other. I wasn't the moderator when this thread was started, but it doesn't belong in a \"debating techniques and styles\" forum. \n Now, I can either move the entire thread to another forum, ask that you remain on topic or close the thread. \n I'll leave it open for now and see what happens.", 
   {}, 
   374256, 
   null, 
   1255540140.0
  ], 
  [
   374317, 
   null, 
   "Archangel", 
   "I've said my piece. Shut the child up \"if you can\" and all will be well at 4forums. emoticon_xagree", 
   {}, 
   374291, 
   null, 
   1255563240.0
  ], 
  [
   374340, 
   null, 
   "obvious_child", 
   "This is not the place to hurl invectives at each other. I wasn't the moderator when this thread was started, but it doesn't belong in a \"debating techniques and styles\" forum. \n Now, I can either move the entire thread to another forum, ask that you remain on topic or close the thread. \n I'll leave it open for now and see what happens.\n\n \n Do we really need more evidence that archie has a reading disability? \n \n What happened to the original admin?", 
   {}, 
   374291, 
   null, 
   1255576260.0
  ], 
  [
   374341, 
   null, 
   "JPSartre12", 
   "Do we really need more evidence that archie has a reading disability? \n \n What happened to the original admin?\n\n \n He's still here. I used to have mod authority in this forum along with Billsco, but was away for a while and lost it. Since it appears that there's some interest again in formal debates, I offered to take over for Billsco, who appears to be AWOL and the admin was kind enough to oblige.\n I only mentioned about your banter with AA because this isn't the right forum for it.", 
   {}, 
   374340, 
   null, 
   1255576560.0
  ], 
  [
   376898, 
   null, 
   "ImYY4U", 
   "Exactly, it was a blatant misrepresentation of the facts which in his case were nonexistent. It was fiction passed off as fact. An opinion isn't a lie, it's an opinion. If a person states what is alleged to be a fact, but is shown to be inaccurate, even that isn't necessarily a lie unless they knowingly misrepresent what they know to be factual. But that is probably not possible to prove in this setting.\n \n What this guy did was create a story out of whole cloth and even made his wife an accessory to it. That is the definition of a lie. And when you add to that, that he published it in a book, then he knowingly perpetrated an untruth for personal monetary gain.\n\n \n He also diluted the credence of all the many other somewhat unbelievable holocaust legends.", 
   {}, 
   344806, 
   null, 
   1257463800.0
  ], 
  [
   379616, 
   null, 
   "SeriousSister08", 
   "Is that a lie?\n \n No. Lying requires one to pass off as the truth something they know to be false. If you truly believe that what you say is the truth, you cannot be lying. Hence whenever Archie passes off some completely insane argument against evolution/ for YEC, he's not a liar because he thinks what he's saying is true despite it being horribly, horribly wrong. Just recently he argued that the Coelacanth was the same species in the fossils despite being informed of his wrongness months ago. Was he lying? No. Because his belief is what he think is correct, independent of what reality states. While this is a clear sign of mental illness, it does not equate to lying. \n \n In the same fashion, if the author believed what he was saying as the truth, he cannot be lying. \n \n Now, those who want to attack my argument, you are treading on thin ice as your attack on my argument makes Bush a liar about Iraq.\n\n \n I disagree with you on all levels. Why?! Let's take a look at this statement from the man in question.....\n \n [Quote]\"It wasn't a lie,\" he told \"GMA.\" \"It was my imagination. And in my imagination, in my mind, I believed it. Even now, I believe it, that she was there and she threw the apple to me. ... In my imagination, it was true.\" \n \n Rosenblat said he told the story to give people hope and to promote understanding about the Holocaust. His wife went along with the story because, as Rosenblat said, she \"loved\" him.[QUOTE]\n \n Now let's take a look at what you said...\nIs that a lie?\n \n No. Lying requires one to pass off as the truth something they know to be false. If you truly believe that what you say is the truth, you cannot be lying.\n\n \n Now from what you said, this man truly believes that he is telling the truth, but then in he's statement he admits that it is in his imagination. And we all should know that a person's imagination is something that was made up in your mind. For him to admit that it was in his imagination, and then says that he still believes it shows that he is contradicting himself. If he in fact felt that the story he made up was true, why would he admit that it was in his imagination?! Anyone who felt as if they were telling the truth, would never admit that is was a part of their imagination because they would be sold on the fact that it REALLY happened. For him to be able to say that it happened in his imagination, and then say that he still believed it happened shows that he is a liar, and not only that, but he lied while trying to tell a lie. What a loser. It's all a scheme to get money. Anyone who believes this man is just as twisted as he is.", 
   {}, 
   374232, 
   null, 
   1258868400.0
  ], 
  [
   379720, 
   null, 
   "Archangel", 
   "I disagree with you on all levels. Why?! Let's take a look at this statement from the man in question.....\n \n \"It wasn't a lie,\" he told \"GMA.\" \"It was my imagination. And in my imagination, in my mind, I believed it. Even now, I believe it, that she was there and she threw the apple to me. ... In my imagination, it was true.\" \n \n Rosenblat said he told the story to give people hope and to promote understanding about the Holocaust. His wife went along with the story because, as Rosenblat said, she \"loved\" him.\n\n \n \nNow let's take a look at what you said...\n \n Now from what you said, this man truly believes that he is telling the truth, but then in he's statement he admits that it is in his imagination. And we all should know that a person's imagination is something that was made up in your mind. For him to admit that it was in his imagination, and then says that he still believes it shows that he is contradicting himself. If he in fact felt that the story he made up was true, why would he admit that it was in his imagination?! Anyone who felt as if they were telling the truth, would never admit that is was a part of their imagination because they would be sold on the fact that it REALLY happened. For him to be able to say that it happened in his imagination, and then say that he still believed it happened shows that he is a liar, and not only that, but he lied while trying to tell a lie. What a loser. It's all a scheme to get money. Anyone who believes this man is just as twisted as he is.\n\n \n Exactly right SeriousSister, great post and very insightful. This is why I said what I did about this guy who attempted to profit from the sympathy others naturally felt after hearing such a heart wrenching piece of fiction. I marvel at how some people here will make excuses and justifications for blatant liars. Just look at antonia, she calls his lies poetic metaphors as expressions of love for his wife when he himself never even thought of that excuse. but that doesn't stop antonia of creating it for him. emoticon_rolleyes Weird huh, that these liberals can lie to themselves so easily as long as the lie sounds nice and pleasant to the ear. emoticon_confused\n \n \nExactly, it was a blatant misrepresentation of the facts which in his case were nonexistent. It was fiction passed off as fact. An opinion isn't a lie, it's an opinion. If a person states what is alleged to be a fact, but is shown to be inaccurate, even that isn't necessarily a lie unless they knowingly misrepresent what they know to be factual. But that is probably not possible to prove in this setting.\n \n What this guy did was create a story out of whole cloth and even made his wife an accessory to it. That is the definition of a lie. And when you add to that, that he published it in a book, then he knowingly perpetrated an untruth for personal monetary gain.\n", 
   {}, 
   344806, 
   null, 
   1258945140.0
  ], 
  [
   379749, 
   null, 
   "SeriousSister08", 
   "Exactly right SeriousSister, great post and very insightful. This is why I said what I did about this guy who attempted to profit from the sympathy others naturally felt after hearing such a heart wrenching piece of fiction. I marvel at how some people here will make excuses and justifications for blatant liars. Just look at antonia, she calls his lies poetic metaphors as expressions of love for his wife when he himself never even thought of that excuse. but that doesn't stop antonia of creating it for him. emoticon_rolleyes Weird huh, that these liberals can lie to themselves so easily as long as the lie sounds nice and pleasant to the ear. emoticon_confused\n\n \n Thanks Archangel; I'm glad you see my point. I mean I don't see how anyone can dance around a lie and make it seem as if there is some logic to it. But there can never be any logic to lying. He would have done better just recalling his story of the holocaust from his personal experience instead of thinking up some outrageous lie to gain money.emoticon_xdonno I mean there are a small percentage of weirdo's that will feel sorry for him, but the average person will see through the lie and see him for the money hungry liar that he is.;)", 
   {
    "unicode_changes_made": true
   }, 
   379720, 
   null, 
   1258989720.0
  ], 
  [
   380143, 
   null, 
   "JPSartre12", 
   "This thread has wandered way off the forum's beaten path to the point that there is not even a semblance to the forum's purpose \"Debating Techniques and Styles\" so as Arhnold would say. It's been terminated.", 
   {}, 
   379749, 
   null, 
   1259177700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is This a Lie?", 
  "url": "http://www.4forums.com/political/debating-techniques-styles/12369-lie.html", 
  "breadcrumbs": [
   "Debating Techniques and Styles"
  ], 
  "id_number": 12369, 
  "discussion_files": [
   [
    "20009.html", 
    "http://www.4forums.com/political/debating-techniques-styles/12369-lie-print.html"
   ], 
   [
    "20010.html", 
    "http://www.4forums.com/political/debating-techniques-styles/12369-lie-3-print.html"
   ], 
   [
    "20011.html", 
    "http://www.4forums.com/political/debating-techniques-styles/12369-lie-2-print.html"
   ]
  ], 
  "identifier": 12369
 }
]