[
 [
  [
   344258, 
   null, 
   "isly ilwott", 
   "This guy really makes Bernie Madoff look bad...sold his bank and gave $60 million to the employees that helped him make it big.\n \n Miami banker gives $60 million of his own to employees - State/Nation/World - Belleville News-Democrat\n \n \n MIAMI -- Lots of bosses say they value their employees. Some even mean it.\n And then there's Leonard Abess Jr.\n \n After selling a majority stake in Miami-based City National Bancshares last November, all he did was take $60 million of the proceeds - $60 million out of his own pocket - and hand it to his tellers, bookkeepers, clerks, everyone on the payroll. All 399 workers on the staff received bonuses, and he even tracked down 72 former employees so they could share in the windfall.\n \n For longtime employees, the bonus - based on years of service - amounted to tens of thousands of dollars, and in some cases, more than $100,000.\n At a time when financial titans are being paraded before Congress to explain how they blew billions on executives' bonuses even as they received a taxpayer bailout, the big-hearted banker's selfless deed stands out.\n \n \"I retired seven years ago, and all of a sudden I get this wonderful letter and phone call,\" said Evelyn J. Budde, who spent 43 years at City National Bank of Florida, rising to vice president.\n \n \"I was shocked,\" said William Perry. In 43{ years at City National, he climbed from janitor to vice president. Like many longtime City National employees, he forged an unbreakable bond with the bank that continued into retirement. Perry returns regularly for the annual employees' dinner.\n \n Abess didn't publicize what he had done. He didn't even show up at the bank to bask in his employees' gratitude on the day the bonus envelopes were distributed. He was inundated with letters soon afterward.\n \n Asked later what motivated him, Abess said he had long dreamed of a way to reward employees. He had been thinking of creating an employee stock option plan before he decided to sell the bank.", 
   {
    "post_info": {
     "post_title": "Not all bankers are greedy..."
    }
   }, 
   null, 
   null, 
   1234914240.0
  ], 
  [
   359491, 
   null, 
   "bagssz123", 
   "&#36825;&#26159;&#26032;&#21152;&#30340;&#31354;&#30333;&#25991;&#31456;18&#65292;&#21487;&#20197;&#22312;ubb&#21487;&#35270;&#21270;&#32534;&#36753;&#22120;&#20013;&#65292;&#28155;&#21152;&#21644;&#20462;&#25913;&#25991;&#31456;&#20869;&#23481;&#12290;", 
   {
    "post_info": {
     "post_title": "&#26032;&#21152;&#30340;&#31354;&#30333;&#25991;&#31456;18"
    }
   }, 
   344258, 
   null, 
   1246660740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Not all bankers are greedy...", 
  "url": "http://www.4forums.com/political/news-forum/12364-not-all-bankers-greedy.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 12364, 
  "discussion_files": [
   [
    "32764.html", 
    "http://www.4forums.com/political/news-forum/12364-not-all-bankers-greedy-print.html"
   ]
  ], 
  "identifier": 12364
 }
]