[
 [
  [
   344937, 
   null, 
   "isly ilwott", 
   "...here is some news from Iraq that you likely will not hear from our liberal main stream media.\n \n Soldier: Iraq?s full story not told - Pratt, KS - Pratt Tribune", 
   {
    "post_info": {
     "post_title": "Ignored by MSM..."
    }
   }, 
   null, 
   null, 
   1235514600.0
  ], 
  [
   344938, 
   null, 
   "Penfold", 
   "The Pratt Tribune says it all, really....... emoticon_rolleyes", 
   {}, 
   344937, 
   null, 
   1235515320.0
  ], 
  [
   344973, 
   null, 
   "Jo Bennett", 
   "Nothing to do with the media being \"liberal\", everything to do with the media being sensationalist and focussed on explosions, when news isn't having a direct impact on their audience. US media is almost entirely entertainment, so they rely on big explosions and such much the same way as Hollywood does.", 
   {}, 
   344938, 
   null, 
   1235545800.0
  ], 
  [
   344975, 
   null, 
   "T.Q", 
   "I don't know about anyone else, but as soon as I see \"MSM\", I know to disregard the author and the article.", 
   {}, 
   344973, 
   null, 
   1235557560.0
  ], 
  [
   344988, 
   null, 
   "isly ilwott", 
   "I don't know about anyone else, but as soon as I see \"MSM\", I know to disregard the author and the article.\nWhy is that? Do you not agree that there is a \"Main Stream Media\"...consisting of the major networks and giant newsprint publishers?\n \n ...and how did you come to post in this thread?", 
   {}, 
   344975, 
   null, 
   1235582460.0
  ], 
  [
   344990, 
   null, 
   "isly ilwott", 
   "Nothing to do with the media being \"liberal\", everything to do with the media being sensationalist and focussed on explosions, when news isn't having a direct impact on their audience. US media is almost entirely entertainment, so they rely on big explosions and such much the same way as Hollywood does.\nUnfortunately, that's because the public hungers for gore and destruction. The media is simply satisfying the demand. It does seem that they could include some stories of good happenings now and then...not that they never do that...but it's usually found in the smaller local papers or buried on page 6, Section D, instead of the front page...and it is hardly ever seen on the evening news broadcasts.", 
   {}, 
   344973, 
   null, 
   1235582820.0
  ], 
  [
   344997, 
   null, 
   "simone", 
   "...here is some news from Iraq that you likely will not hear from our liberal main stream media.\n \n Soldier: Iraq?s full story not told - Pratt, KS - Pratt Tribune\n\n Here's a quote from that story:\n \n&#8220;We have to respect their society but help them understand, help them evolve. They&#8217;re making strides,&#8221; he said, noting that women and girls are being educated and violence is becoming less prevalent &#8212; Detroit has more violence now than the country of Iraq.\n\n Women were being educated and they held important posts throughout the nation of Iraq under Saddam Hussein's rule, unjust though it may have been in other ways. Saddam's Iraq was a secular state, not a narrowly religious anti-woman state as it has become under the rule of the present Shi'a Islamic governance of Iraq.\n \n As a result of Shi'a rule, the status of women has fallen enormously and it is dangerous for women to seek education and to hold important jobs.\n \n To illustrate, an imbecile in Iraq, Mazin al-Shihan, the director of the Baghdad Displacement Committee, a city agency, says he wants to pay men to marry widows.\n \n When asked why Iraq shouldn't pay direct benefits to the women themselves, al-Shihan was so foolish as to say:\n \nIf we give the money to the widows, they will spend it unwisely because they are uneducated and they don&#8217;t know about budgeting, but if we find her a husband, there will be a person in charge of her and her children for the rest of their lives. This is according to our tradition and our laws.\n\n http://www.nytimes.com/2009/02/23/world/middleeast/23widows.html\n \n For the record, the very first female mathematician I ever met was an elegant and accomplished Iraqi woman.", 
   {}, 
   344937, 
   null, 
   1235584620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ignored by MSM...", 
  "url": "http://www.4forums.com/political/news-forum/12382-ignored-msm.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 12382, 
  "discussion_files": [
   [
    "26839.html", 
    "http://www.4forums.com/political/news-forum/12382-ignored-msm-print.html"
   ]
  ], 
  "identifier": 12382
 }
]