[
 [
  [
   345136, 
   null, 
   "foundit66", 
   "Washington - The US Supreme Court has ruled that a Utah city did not violate the free speech rights of a religious sect when it refused to place the group's monument beside an existing Ten Commandments monument in a public park.\n \n Lawyers for the Summum religion insisted in a lawsuit that the placement of the Ten Commandments monument in a Pleasant Grove City park created a public forum that required the city to accept other kinds of monuments and messages.\n \n When Pleasant Grove refused to accept Summum's monument, the group sued the city for engaging in unconstitutional censorship. A federal appeals court agreed. The city was ordered to erect the Summum monument.\n \n In a unanimous decision announced Wednesday, the Supreme Court reversed that decision. The high court said that when a government entity decides to place a privately donated monument on public land, the display represents the government's own speech and does not require government acceptance of any and all other monuments conveying competing messages private groups may want displayed.\n \n \"Government decisionmakers select the monuments that portray what they view as appropriate for the place in question, taking into account such content-based factors as esthetics, history, and local culture,\" Justice Samuel Alito wrote for the court in an 18-page decision. \"The monuments that are accepted, therefore, are meant to convey ... a government message, and they thus constitute government speech.\"\n \n The decision in Pleasant Grove City v. Summum is important because it marks the latest expression of an emerging doctrine in Supreme Court jurisprudence setting the limits and powers of government speech.\n \n \"The decision gives government the right to speak for itself and the ability to communicate on behalf of its citizens,\" said Jay Sekulow, chief counsel at the American Center for Law and Justice, who argued the case for Pleasant Grove.\n \n \"It's a landmark decision that clears the way for government to express its views and its history through the selection of monuments - including religious monuments and displays,\" Mr. Sekulow said in a statement.\n \n The decision is raising concern among some analysts that it might encourage government officials to approve religious displays on public land.\n \n \"Government has no business erecting, maintaining, or promoting religious symbols or codes,\" said the Rev. Barry Lynn, executive director of Americans United for the Separation of Church and State. \"The answer in this case is to remove the Ten Commandments from the public park, not compound the problem by adding more sectarian material,\" he said in statement. Supreme Court rules Utah city can reject religious sect's monument | csmonitor.com\n \n This is part of the reason I am against the mentality of \"we can put up religious symbols, as long as we don't discriminate against other groups\".\n It's the same fallacy as \"separate but equal\". The people involved are only interested in \"separate\", and they habitually IGNORE the \"equal\" requirement.\n \n Here, the government wants to put up the CHRISTIAN monument, but they discriminate brazenly against the non-Christian monument.", 
   {
    "post_info": {
     "post_title": "Supreme Court rules Utah city can reject religious sect's monument"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1235682420.0
  ], 
  [
   430022, 
   null, 
   "Angel", 
   "Hi foundit66,\n Yes I have read this news and thank you for sharing here as those who haven't heard or missed this will get to know through this forum.\n Keep posting.\n Orem recreation center", 
   {}, 
   345136, 
   null, 
   1305617520.0
  ], 
  [
   430049, 
   null, 
   "jyoshu", 
   "\"Christians and town fathers have objected, claiming that the Ten Commandments are of great historic significance to the United States, and as such are not solely a religious statement, whereas the seven aphorisms are a modern philosophy.\" ~ Summum - Wikipedia, the free encyclopediaI think they have a good point, and therefore I tend to agree with the unanimous decision of the Supreme Court. This was certainly no cut-and-dried religious liberty case.\n \n What's REALLY interesting though, is that you would be for getting govt. out of religious monuments altogether rather than just deciding the benefit on a case by case basis. Yet you are hypocritically against the idea of getting the government out of marriage altogether ... :)", 
   {}, 
   430022, 
   null, 
   1305645600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Supreme Court rules Utah city can reject religious sect's monument", 
  "url": "http://www.4forums.com/political/religion-debates/12392-supreme-court-rules-utah-city-can-reject-religious-sects-monument.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12392, 
  "discussion_files": [
   [
    "24901.html", 
    "http://www.4forums.com/political/religion-debates/12392-supreme-court-rules-utah-city-can-reject-religious-sects-monument-print.html"
   ]
  ], 
  "identifier": 12392
 }
]