[
 [
  [
   345485, 
   null, 
   "Shooterandproud", 
   "What makes your book (the Bible) more true than any other religious text? I still have not received a valid answer to this question.", 
   {
    "post_info": {
     "post_title": "A simple question for Christians."
    }
   }, 
   null, 
   null, 
   1235884560.0
  ], 
  [
   345507, 
   null, 
   "Jo Bennett", 
   "I suspect you have received an answer, just not one you agree with. I believe that most of the people who wrote the Bible had a close relationship with God, closer than I do and closer than the authors of other religious texts. I suppose the best explanation is that the image of God given by the New Testament \"rings true\" with my own experience of God, and I'm prepared to trust that people who get that right are probably right about what they've recorded about Christ. Whether they're right about specific proscriptions within their writing is another matter.", 
   {}, 
   345485, 
   null, 
   1235903040.0
  ], 
  [
   346268, 
   null, 
   "Shooterandproud", 
   "I suspect you have received an answer, just not one you agree with. I believe that most of the people who wrote the Bible had a close relationship with God, closer than I do and closer than the authors of other religious texts. I suppose the best explanation is that the image of God given by the New Testament \"rings true\" with my own experience of God, and I'm prepared to trust that people who get that right are probably right about what they've recorded about Christ. Whether they're right about specific proscriptions within their writing is another matter.\n\n \n So the bible is more true because you have read various religious text and listened to sermons of various religions and Christianity \"felt right\"?", 
   {}, 
   345507, 
   null, 
   1236390900.0
  ], 
  [
   346305, 
   null, 
   "Easyrider", 
   "What makes your book (the Bible) more true than any other religious text? I still have not received a valid answer to this question.\n\n \n Fulfilled prophecy at a rate greater than any other work.\n \n Tons of prophecy sites on the net, some good, some not so good. Here's one of the better ones. Enjoy!\n \n The Messiah Pages", 
   {}, 
   345485, 
   null, 
   1236438120.0
  ], 
  [
   346315, 
   null, 
   "thelmoose", 
   "I suspect you have received an answer, just not one you agree with. I believe that most of the people who wrote the Bible had a close relationship with God, closer than I do and closer than the authors of other religious texts. I suppose the best explanation is that the image of God given by the New Testament \"rings true\" with my own experience of God, and I'm prepared to trust that people who get that right are probably right about what they've recorded about Christ. Whether they're right about specific proscriptions within their writing is another matter.\n\n \n I don't really want to argue about this and I respect and honor your opinions and beliefs. However, I am not sure how you might know that the authors of the bible had a closer relationship with their god than the authors of other texts had with theirs.\n \n Also, if something rings true with a personal experience it doesn't make it true. Do you think that the NT might resonate with you because of the culture you have been immersed in? Vishnu would seem \"foreign\". Jesus does not because everyone you know talks about Christianity's teachings as the norm. I think that could play a part in something \"feeling right\". But its your experience, not mine.", 
   {}, 
   345507, 
   null, 
   1236442740.0
  ], 
  [
   346326, 
   null, 
   "ShadowPikachu", 
   "Fulfilled prophecy at a rate greater than any other work.\n \n Tons of prophecy sites on the net, some good, some not so good. Here's one of the better ones. Enjoy!\n \n The Messiah Pages\n\n \n When you make extremely vague, common sense predictions, OF COURSE you'll have a high \"fulfilld prophecy rate\".\n \n However, when they tried to get into a more specific, naming names and specific events, etc., it was usually an epic fail - Destruction of Tyre Prophecy is a great example (as well as the Desolation of Egypt Prophecy).", 
   {}, 
   346305, 
   null, 
   1236446520.0
  ], 
  [
   346337, 
   null, 
   "Archangel", 
   "When you make extremely vague, common sense predictions, OF COURSE you'll have a high \"fulfilld prophecy rate\".\n \n However, when they tried to get into a more specific, naming names and specific events, etc., it was usually an epic fail - Destruction of Tyre Prophecy is a great example (as well as the Desolation of Egypt Prophecy).\n\n \n You are wrong as usual SP. ANCIENT TYRE is still an unoccupied mass of ancient rubble just as was prophesied that it would remain in the bible. Tyre - World Heritage Site - Pictures, info and travel reports\n \n Ezekiel 26\n 1And it came to pass in the eleventh year, in the first day of the month, that the word of Jehovah came unto me, saying, 2Son of man, because that Tyre hath said against Jerusalem, Aha, she is broken that was the gate of the peoples; she is turned unto me; I shall be replenished, now that she is laid waste: 3therefore thus saith the Lord Jehovah, Behold, I am against thee, O Tyre, and will cause many nations to come up against thee, as the sea causeth its waves to come up. 4And they shall destroy the walls of Tyre, and break down her towers: I will also scrape her dust from her, and make her a bare rock. 5She shall be a place for the spreading of nets in the midst of the sea; for I have spoken it, saith the Lord Jehovah; and she shall become a spoil to the nations. 6And her daughters that are in the field shall be slain with the sword: and they shall know that I am Jehovah. 7For thus saith the Lord Jehovah: Behold, I will bring upon Tyre Nebuchadrezzar king of Babylon, king of kings, from the north, with horses, and with chariots, and with horsemen, and a company, and much people. 8He shall slay with the sword thy daughters in the field; and he shall make forts against thee, and cast up a mound against thee, and raise up the buckler against thee. 9And he shall set his battering engines against thy walls, and with his axes he shall break down thy towers. 10By reason of the abundance of his horses their dust shall cover thee: thy walls shall shake at the noise of the horsemen, and of the wagons, and of the chariots, when he shall enter into thy gates, as men enter into a city wherein is made a breach. 11With the hoofs of his horses shall he tread down all thy streets; he shall slay thy people with the sword; and the pillars of thy strength shall go down to the ground. 12And they shall make a spoil of thy riches, and make a prey of thy merchandise; and they shall break down thy walls, and destroy thy pleasant houses; and they shall lay thy stones and thy timber and thy dust in the midst of the waters. 13And I will cause the noise of thy songs to cease; and the sound of thy harps shall be no more heard. 14And I will make thee a bare rock; thou shalt be a place for the spreading of nets; thou shalt be built no more: for I Jehovah have spoken it, saith the Lord Jehovah.\n \n Here we see that much of ancient Tyre would be submerged just as archeology has confirmed is still currently the case, and the part of the original ANCIENT CITY which remains above Sea Level is still a desolate wasteland in spite of the fact that a city has been built right up to its borders on 3 sides. This is an incredible prophecy due to the current value of, and need for land in that region.\n Ezekiel 29:9 And the land of Egypt shall be a desolation and a waste; and they shall know that I am Jehovah. Because he hath said, The river is mine, and I have made it; 10therefore, behold, I am against thee, and against thy rivers, and I will make the land of Egypt an utter waste and desolation, from the tower of Seveneh even unto the border of Ethiopia. 11No foot of man shall pass through it, nor foot of beast shall pass through it, neither shall it be inhabited forty years. 12And I will make the land of Egypt a desolation in the midst of the countries that are desolate; and her cities among the cities that are laid waste shall be a desolation forty years; and I will scatter the Egyptians among the nations, and will disperse them through the countries. 13For thus saith the Lord Jehovah: At the end of forty years will I gather the Egyptians from the peoples whither they were scattered; 14and I will bring back the captivity of Egypt, and will cause them to return into the land of Pathros, into the land of their birth; and they shall be there a base kingdom. 15It shall be the basest of the kingdoms; neither shall it any more lift itself up above the nations: and I will diminish them, that they shall no more rule over the nations. 16And it shall be no more the confidence of the house of Israel, bringing iniquity to remembrance, when they turn to look after them: and they shall know that I am the Lord Jehovah. 17And it came to pass in the seven and twentieth year, in the first month, in the first day of the month, the word of Jehovah came unto me, saying, 18Son of man, Nebuchadrezzar king of Babylon caused his army to serve a great service against Tyre: every head was made bald, and every shoulder was worn; yet had he no wages, nor his army, from Tyre, for the service that he had served against it. 19Therefore thus saith the Lord Jehovah: Behold, I will give the land of Egypt unto Nebuchadrezzar king of Babylon; and he shall carry off her multitude, and take her spoil, and take her prey; and it shall be the wages for his army. 20I have given him the land of Egypt as his recompense for which he served, because they wrought for me, saith the Lord Jehovah.\n If you'll note the bolded, it perfectly describes what happened to Egypt. Since its invasion and destruction by Babylon it was a baron uninhabited land for 40 years, the same amount of time, ONE GENERATION which the Jews wandered in the wilderness, just at a different time in history. And it never regained its superpower status of the Pharaohs after that destruction occurred. I don't see how these prophecies could be anymore specific and accurate based on what is currently undeniable current event evidence that what God said would be, IS IN FACT EXACTLY HOW IT IS. \n \n But you're one heck of a christian in your defense of Gods word and reliability. You have my condolences for preferring ignorance and lies over seeking the truth in what His word says would, and will be.", 
   {}, 
   346326, 
   null, 
   1236451560.0
  ], 
  [
   346350, 
   null, 
   "simone", 
   "Blah! Blah! And Blahdeblahblah!", 
   {}, 
   346337, 
   null, 
   1236457320.0
  ], 
  [
   346361, 
   null, 
   "Archangel", 
   "Blah! Blah! And Blahdeblahblah!\n\n \n It just kills you when the lies unbelievers tell about the bible are exposed for what they are, doesn't it simone? Wont you people ever get it that God sees all, and knows all in advance of it occurring? How can you deny that such supernatural insight is solid evidence that He is God? If I were you, I would study every prophecy in the bible as if my very soul depended on it so I could personally confirm for myself if it is reliable or not.", 
   {}, 
   346350, 
   null, 
   1236464700.0
  ], 
  [
   346369, 
   null, 
   "Shooterandproud", 
   "It just kills you when the lies unbelievers tell about the bible are exposed for what they are, doesn't it simone? Wont you people ever get it that God sees all, and knows all in advance of it occurring? How can you deny that such supernatural insight is solid evidence that He is God? If I were you, I would study every prophecy in the bible as if my very soul depended on it so I could personally confirm for myself if it is reliable or not.\n\n \n I believe the Koran and the Vedas are backed by about the same amount of evidence as the bible. So your reason for choosing Christianity over another religion is historical events?", 
   {}, 
   346361, 
   null, 
   1236472920.0
  ], 
  [
   346378, 
   null, 
   "jyoshu", 
   "What makes your book (the Bible) more true than any other religious text? I still have not received a valid answer to this question.\n\n \n I think a better question is to ask yourself why it bothers you so that Christians feel that way. Basically, anyone with a concluded position on something believes they are right and that those who believe differently are wrong. Christians really shouldn't be expected to be the one group that can't believe their view is right and that others who disagree with them are wrong--everyone does this--it's part of what it means to hold to views. You yourself are engaging in that very behavior by your view that the Christians are wrong and that you are right. If you don't believe Christians are correct in their views then by no means is anyone making you hold to them. Christianity isn't based on the idea that everyone else is wrong; it's a set of beliefs, and to focus on the idea that holding to those beliefs happens to require the converse view that OTHER beliefs out there are incorrect really isn't quite fair to Christians (or any religion toward which such an approach is levied), now is it? If that sort of thing were, no one could ever hold to any view.\n \n I hold to the view that Christianity is the valid religion for many reasons. But mostly they can boil down to: it's the one that seems to have the most historical consistency and it's the one that is most consistent with my personal religious experience. And with all due respect, I don't really care that other people in the world have had DIFFERENT religious experiences. I can't speak for them; only for myself.\n \n Now then. Please don't say you've not received an answer to your question. You've probably heard people answer this sort of thing numerous times, I suspect.", 
   {}, 
   345485, 
   null, 
   1236477840.0
  ], 
  [
   346381, 
   null, 
   "Penfold", 
   "You will therefore agree that their experience is no less valid than yours.....", 
   {}, 
   346378, 
   null, 
   1236478380.0
  ], 
  [
   346384, 
   null, 
   "jyoshu", 
   "You will therefore agree that their experience is no less valid than yours.....\n\n \n No more than you would agree the experiences of religious people are no less valid than yours. What you're doing is like asking me to say that I think it's no less valid if someone tells me they see a green sky when I've clearly experienced a blue one but never a green one ... I say the sky is blue because that's what I've experienced, and therefore it's what I go on. I can't help it if mileage varies depending on who you talk to--that's really not my problem. It doesn't change the fact I've experienced what I experience. This all-too-often played attempt to pit Christians against other religions by playing up the natural outcome of exclusivity of a position due to the TAKING of a position is really a disingenuous and unrealistic approach. ANY position taken by someone--including you--on pretty much ANYTHING is going to require the view that one is correct (and naturally, therefore, that others who disagree are incorrect). I mean seriously ... what do you expect religious people to do, exactly? Follow every religious claim with some silly disclaimer that says \"but other positions may be equally as valid\"? I don't see anyone making such expectations in other arenas of discourse, so pardon me if I find it a tad hard to take this seriously.", 
   {}, 
   346381, 
   null, 
   1236479820.0
  ], 
  [
   346392, 
   null, 
   "Penfold", 
   "That would be \"no\" then.", 
   {}, 
   346384, 
   null, 
   1236484200.0
  ], 
  [
   346394, 
   null, 
   "trebor", 
   "Fulfilled prophecy at a rate greater than any other work.\n \n Tons of prophecy sites on the net, some good, some not so good. Here's one of the better ones. Enjoy!\n \n The Messiah Pages\n\n \n If that is your 'prophecies', I am not very impressed. The vast majority of them are not prophecies at all. \n \n I mean, I fulfilled at least one of those prophecies myself. I was born of a woman. For that matter, do you know ONE person who was not born of a woman? Even you fulfilled that one. Do you have something that actually makes sense at all?", 
   {}, 
   346305, 
   null, 
   1236485100.0
  ], 
  [
   346395, 
   null, 
   "jyoshu", 
   "That would be \"no\" then.\n\n \n As if there's any relevance whatsoever to that point to begin with.", 
   {}, 
   346392, 
   null, 
   1236487380.0
  ], 
  [
   346421, 
   null, 
   "Jo Bennett", 
   "If that is your 'prophecies', I am not very impressed. The vast majority of them are not prophecies at all. \n \n I mean, I fulfilled at least one of those prophecies myself. I was born of a woman. For that matter, do you know ONE person who was not born of a woman? Even you fulfilled that one. Do you have something that actually makes sense at all?\n\n \n There's a son of a bitch joke I'm going to resist making here...", 
   {}, 
   346394, 
   null, 
   1236510120.0
  ], 
  [
   346426, 
   null, 
   "Easyrider", 
   "Prophecy: A Nation Born in a Single Day\n \n Source: The Rebirth of Israel\n \n The rebirth of Israel as an independent nation in 1948 is one of the most significant events in world history. Never before has an entire race of people been without a homeland for so long without assimilating into surrounding populations. However, no other conquered race had the promise of God to \"give all this land of Canaan to you and to your offspring forever.\" Genesis 17:8 (NLT)\n \n The scriptures prophesied that Israel would be dispersed among the nations then brought out from among them in a gradual process that would culminate in the establishment of Israel as a nation in a single day. And that's exactly what happened. The Bible also foretold the exact year in which this would happen. Those who study the Word of God recognize the restoration of Israel as the primary sign of the end of the age. Jesus promised the generation that witnessed this event would also witness His return. Matthew 24:34 (NLT)\n \n Long ago the Bible predicted these events would transpire in the last days:\n \n 1) The gathering of the Jews into their homeland\n 2) The rebirth of Israel in a single day\n 3) The rebirth of Israel in the year 1948\n 4) Israel's possession of Jerusalem\n 5) The nations of the earth aligned against Israel\n 6) The war of Gog / Magog\n 7) The rebuilding of the Jewish Temple\n \n Five of these seven prophetic events have already been fulfilled, and the final two are certain to follow.\n \n The Gathering of the Jews\n \n Numerous biblical prophecies foretold of the re-gathering of Israel as a nation. Approximately 2,700 years ago, God revealed to the prophet Ezekiel a \"Valley of Dry Bones\" (Ezekiel Chapter 37). God spoke of these bones (the Jews) gathered together and covered with flesh and muscles (re-gathered from the nations) with life being breathed into them (a dead nation brought to life once again).\n \n \"Then he said to me, 'Son of man, these bones represent the people of Israel. They are saying, 'We have become old, dry bones - all hope is gone.' Now give them this message from the Sovereign Lord: O my people, I will open your graves of exile and cause you to rise again. Then I will bring you back to the land of Israel. When this happens, O my people, you will know that I am the Lord.\" Ezekiel 37:11-13 (NLT)\n \n Beginning in the late 19th Century, the birth of the Zionist movement culminated in the gradual emigration of Jews from all over the world to resettle the land of Israel. Each decade the number of returning Jews increased, until finally the nation of Israel came to life once again in 1948.\n \n Israel Becomes a Nation in a Single Day\n \n God foretold long ago that after He brought His scattered people out from among the nations, He would declare them to be a nation in a single day:\n \n \"'Who has ever seen or heard of anything as strange as this? Has a nation ever been born in a single day? Has a country ever come forth in a mere moment? But by the time Jerusalem's birth pains begin, the baby will be born; the nation will come forth. Would I ever bring this nation to the point of birth and then not deliver it?' asks the Lord. 'No! I would never keep this nation from being born,' says your God.\" Isaiah 66:8-9 (NLT)\n \n This is exactly what happened on May 14, 1948. Having been brought to the brink of extinction by the horrors of the Holocaust, facing persecution around the world, and surrounded by their enemies, the Jewish people gathered together in Israel and declared themselves a nation in a single day. The United States recognized Israel as a nation on that same day, and Israel's victories in the wars since have solidified their place among the nations of the world.\n \n Israel an Object of Scorn in the Last Days\n \n The prophet Zechariah noted the following would be true of Israel in the last days:\n \n \"I will make Jerusalem and Judah like an intoxicating drink to all the nearby nations that send their armies to besiege Jerusalem. On that day I will make Jerusalem a heavy stone, a burden for the world. None of the nations who try to lift it will escape unscathed.\" Zechariah 12:2-3 (NLT)\n \n The rebirth of Israel in 1948 has been accompanied by constant war and conflict with surrounding Muslim nations. The main focus of world attention today concerns Israel's relationship with its neighbors. Just as God foretold, Israel has become a \"burdensome stone\" for the world's political leaders. The majority of the Islamic countries surrounding Israel have made it clear their primary goal is the destruction of Israel. However, God has made it clear that Israel is here to stay.\n \n The War of Gog/Magog\n \n In the last days, Russia and a coalition of Muslim nations led by Iran will gather a horde of armies together in an effort to wipe Israel off the map. Israel will appear defenseless in the face of this massive invasion force with none of its worldly allies willing to come to its defense. However, God is Israel's greatest ally, and He vows to make his presence known to the entire world by supernaturally destroying the armies arrayed against Israel:\n \n \"Therefore, son of man, prophesy against Gog. Give him this message from the Sovereign Lord: When my people are living in peace in their land, then you will rouse yourself. You will come from your homeland in the distant north with your vast cavalry and your mighty army, and you will cover the land like a cloud. This will happen in the distant future. I will bring you against my land as everyone watches, and my holiness will be displayed by what happens to you. Then all the nations will know that I am the Lord.\" Ezekiel 38:14-16 (NLT)\n \n The Third Temple\n \n In the last days, the Jewish Temple will be rebuilt. The Temple will then be desecrated in an act known as the \"abomination of desolation\". Both the prophet Daniel and Jesus refer to this act as a clear signal of the beginning of the Great Tribulation and the identity of the Antichrist.\n \n \"The time will come when you will see what Daniel the prophet spoke about<b></b>: the sacrilegious object that causes desecration standing in the Holy Place.\" Matthew 24:15 (NLT)\n \n This event, which will occur three and a half years into the Tribulation, will trigger the Great Tribulation, a time of unimaginable horror for the human race. Following this time period, Jesus will return triumphantly to establish His Millennial Kingdom.\n \n Why All This is Important\n \n Jesus told his disciples the primary sign of His soon return would be the restoration of Israel:\n \n \"Now learn a lesson from the fig tree. When its buds become tender and its leaves begin to sprout, you know without being told that summer is near. Just so, when you see the events I've described beginning to happen, you can know his return is very near, right at the door. I assure you, this generation will not pass from the scene before all these things take place. Heaven and earth will disappear, but my words will remain forever.\" Matthew 24:32-35 (NLT)\n \n The fig tree Jesus refers to is Israel. It's been six decades since Israel was once again declared a nation against all worldly odds. Jesus promised that the generation which witnessed fulfillment of this prophecy would not die off until all the things of which he spoke came to pass. Given the past credibility of the Bible and God's Son Jesus Christ, we should fully expect these events to come to pass. What this means is that Jesus is going to return soon, within this generation. A wise person will prepare accordingly.", 
   {
    "unicode_changes_made": true
   }, 
   346421, 
   null, 
   1236519660.0
  ], 
  [
   346431, 
   null, 
   "Archangel", 
   "Prophecy: A Nation Born in a Single Day\n \n Source: The Rebirth of Israel\n \n The rebirth of Israel as an independent nation in 1948 is one of the most significant events in world history. Never before has an entire race of people been without a homeland for so long without assimilating into surrounding populations. However, no other conquered race had the promise of God to \"give all this land of Canaan to you and to your offspring forever.\" Genesis 17:8 (NLT)\n \n The scriptures prophesied that Israel would be dispersed among the nations then brought out from among them in a gradual process that would culminate in the establishment of Israel as a nation in a single day. And that's exactly what happened. The Bible also foretold the exact year in which this would happen. Those who study the Word of God recognize the restoration of Israel as the primary sign of the end of the age. Jesus promised the generation that witnessed this event would also witness His return. Matthew 24:34 (NLT)\n \n Long ago the Bible predicted these events would transpire in the last days:\n \n 1) The gathering of the Jews into their homeland\n 2) The rebirth of Israel in a single day\n 3) The rebirth of Israel in the year 1948\n 4) Israel's possession of Jerusalem\n 5) The nations of the earth aligned against Israel\n 6) The war of Gog / Magog\n 7) The rebuilding of the Jewish Temple\n \n Five of these seven prophetic events have already been fulfilled, and the final two are certain to follow.\n \n The Gathering of the Jews\n \n Numerous biblical prophecies foretold of the re-gathering of Israel as a nation. Approximately 2,700 years ago, God revealed to the prophet Ezekiel a \"Valley of Dry Bones\" (Ezekiel Chapter 37). God spoke of these bones (the Jews) gathered together and covered with flesh and muscles (re-gathered from the nations) with life being breathed into them (a dead nation brought to life once again).\n \n \"Then he said to me, 'Son of man, these bones represent the people of Israel. They are saying, 'We have become old, dry bones - all hope is gone.' Now give them this message from the Sovereign Lord: O my people, I will open your graves of exile and cause you to rise again. Then I will bring you back to the land of Israel. When this happens, O my people, you will know that I am the Lord.\" Ezekiel 37:11-13 (NLT)\n \n Beginning in the late 19th Century, the birth of the Zionist movement culminated in the gradual emigration of Jews from all over the world to resettle the land of Israel. Each decade the number of returning Jews increased, until finally the nation of Israel came to life once again in 1948.\n \n Israel Becomes a Nation in a Single Day\n \n God foretold long ago that after He brought His scattered people out from among the nations, He would declare them to be a nation in a single day:\n \n \"'Who has ever seen or heard of anything as strange as this? Has a nation ever been born in a single day? Has a country ever come forth in a mere moment? But by the time Jerusalem's birth pains begin, the baby will be born; the nation will come forth. Would I ever bring this nation to the point of birth and then not deliver it?' asks the Lord. 'No! I would never keep this nation from being born,' says your God.\" Isaiah 66:8-9 (NLT)\n \n This is exactly what happened on May 14, 1948. Having been brought to the brink of extinction by the horrors of the Holocaust, facing persecution around the world, and surrounded by their enemies, the Jewish people gathered together in Israel and declared themselves a nation in a single day. The United States recognized Israel as a nation on that same day, and Israel's victories in the wars since have solidified their place among the nations of the world.\n \n Israel an Object of Scorn in the Last Days\n \n The prophet Zechariah noted the following would be true of Israel in the last days:\n \n \"I will make Jerusalem and Judah like an intoxicating drink to all the nearby nations that send their armies to besiege Jerusalem. On that day I will make Jerusalem a heavy stone, a burden for the world. None of the nations who try to lift it will escape unscathed.\" Zechariah 12:2-3 (NLT)\n \n The rebirth of Israel in 1948 has been accompanied by constant war and conflict with surrounding Muslim nations. The main focus of world attention today concerns Israel's relationship with its neighbors. Just as God foretold, Israel has become a \"burdensome stone\" for the world's political leaders. The majority of the Islamic countries surrounding Israel have made it clear their primary goal is the destruction of Israel. However, God has made it clear that Israel is here to stay.\n \n The War of Gog/Magog\n \n In the last days, Russia and a coalition of Muslim nations led by Iran will gather a horde of armies together in an effort to wipe Israel off the map. Israel will appear defenseless in the face of this massive invasion force with none of its worldly allies willing to come to its defense. However, God is Israel's greatest ally, and He vows to make his presence known to the entire world by supernaturally destroying the armies arrayed against Israel:\n \n \"Therefore, son of man, prophesy against Gog. Give him this message from the Sovereign Lord: When my people are living in peace in their land, then you will rouse yourself. You will come from your homeland in the distant north with your vast cavalry and your mighty army, and you will cover the land like a cloud. This will happen in the distant future. I will bring you against my land as everyone watches, and my holiness will be displayed by what happens to you. Then all the nations will know that I am the Lord.\" Ezekiel 38:14-16 (NLT)\n \n The Third Temple\n \n In the last days, the Jewish Temple will be rebuilt. The Temple will then be desecrated in an act known as the \"abomination of desolation\". Both the prophet Daniel and Jesus refer to this act as a clear signal of the beginning of the Great Tribulation and the identity of the Antichrist.\n \n \"The time will come when you will see what Daniel the prophet spoke about<b></b>: the sacrilegious object that causes desecration standing in the Holy Place.\" Matthew 24:15 (NLT)\n \n This event, which will occur three and a half years into the Tribulation, will trigger the Great Tribulation, a time of unimaginable horror for the human race. Following this time period, Jesus will return triumphantly to establish His Millennial Kingdom.\n \n Why All This is Important\n \n Jesus told his disciples the primary sign of His soon return would be the restoration of Israel:\n \n \"Now learn a lesson from the fig tree. When its buds become tender and its leaves begin to sprout, you know without being told that summer is near. Just so, when you see the events I've described beginning to happen, you can know his return is very near, right at the door. I assure you, this generation will not pass from the scene before all these things take place. Heaven and earth will disappear, but my words will remain forever.\" Matthew 24:32-35 (NLT)\n \n The fig tree Jesus refers to is Israel. It's been six decades since Israel was once again declared a nation against all worldly odds. Jesus promised that the generation which witnessed fulfillment of this prophecy would not die off until all the things of which he spoke came to pass. Given the past credibility of the Bible and God's Son Jesus Christ, we should fully expect these events to come to pass. What this means is that Jesus is going to return soon, within this generation. A wise person will prepare accordingly.\n\n \n Amen and amen... I just want to attest to the scriptural truth and theological accuracy of riders post.", 
   {
    "unicode_changes_made": true
   }, 
   346426, 
   null, 
   1236523980.0
  ], 
  [
   346455, 
   null, 
   "GiantOreo", 
   "Amen and amen... I just want to attest to the scriptural truth and theological accuracy of riders post.\n\n \n Wow, since ARCHIE ATTESTED to it I KNOW it must be true and accurate. After all, Archie is the most trustworthy person around here, what with Ica stones, Civil War Pterodactyls, Angels-and-free-will etc. How COULDN'T you trust him here?emoticon_rolleyesemoticon_rolleyesemoticon_rolleyes :ROTFLCOPTER:", 
   {}, 
   346431, 
   null, 
   1236536460.0
  ], 
  [
   346457, 
   null, 
   "Matthew S", 
   "I think the question should be why do you think your bible is any more true then Grimms Fairy Tales or any other piece literature?", 
   {}, 
   345485, 
   null, 
   1236536700.0
  ], 
  [
   346467, 
   null, 
   "Archangel", 
   "Wow, since ARCHIE ATTESTED to it I KNOW it must be true and accurate. After all, Archie is the most trustworthy person around here\n\n \n Thank you G.O. And to think I doubted your common sense and intellectual honesty. emoticon_xhohoemoticon_xgood", 
   {}, 
   346455, 
   null, 
   1236541020.0
  ], 
  [
   346468, 
   null, 
   "ShadowPikachu", 
   "Thank you G.O. And to think I doubted your common sense and intellectual honesty. emoticon_xhohoemoticon_xgood\n\n \n And most cretos try to claim they don't quotemine...... emoticon_rolleyesemoticon_rolleyes What a laugh....", 
   {}, 
   346467, 
   null, 
   1236542460.0
  ], 
  [
   346473, 
   null, 
   "Archangel", 
   "And most cretos try to claim they don't quotemine...... emoticon_rolleyesemoticon_rolleyes What a laugh....\n\n \n No comment on your bogus and dishonest claims about the bibles prophecies SP? And all atheists/secular humanists claim they don't lie about the bible..... emoticon_rolleyesemoticon_rolleyes What a laugh....\n \n \nWhen you make extremely vague, common sense predictions, OF COURSE you'll have a high \"fulfilld prophecy rate\".\n \n However, when they tried to get into a more specific, naming names and specific events, etc., it was usually an epic fail - Destruction of Tyre Prophecy is a great example (as well as the Desolation of Egypt Prophecy).\n\n \n \nYou are wrong as usual SP. ANCIENT TYRE is still an unoccupied mass of ancient rubble just as was prophesied that it would remain in the bible. Tyre - World Heritage Site - Pictures, info and travel reports\n \n Ezekiel 26\n 1And it came to pass in the eleventh year, in the first day of the month, that the word of Jehovah came unto me, saying, 2Son of man, because that Tyre hath said against Jerusalem, Aha, she is broken that was the gate of the peoples; she is turned unto me; I shall be replenished, now that she is laid waste: 3therefore thus saith the Lord Jehovah, Behold, I am against thee, O Tyre, and will cause many nations to come up against thee, as the sea causeth its waves to come up. 4And they shall destroy the walls of Tyre, and break down her towers: I will also scrape her dust from her, and make her a bare rock. 5She shall be a place for the spreading of nets in the midst of the sea; for I have spoken it, saith the Lord Jehovah; and she shall become a spoil to the nations. 6And her daughters that are in the field shall be slain with the sword: and they shall know that I am Jehovah. 7For thus saith the Lord Jehovah: Behold, I will bring upon Tyre Nebuchadrezzar king of Babylon, king of kings, from the north, with horses, and with chariots, and with horsemen, and a company, and much people. 8He shall slay with the sword thy daughters in the field; and he shall make forts against thee, and cast up a mound against thee, and raise up the buckler against thee. 9And he shall set his battering engines against thy walls, and with his axes he shall break down thy towers. 10By reason of the abundance of his horses their dust shall cover thee: thy walls shall shake at the noise of the horsemen, and of the wagons, and of the chariots, when he shall enter into thy gates, as men enter into a city wherein is made a breach. 11With the hoofs of his horses shall he tread down all thy streets; he shall slay thy people with the sword; and the pillars of thy strength shall go down to the ground. 12And they shall make a spoil of thy riches, and make a prey of thy merchandise; and they shall break down thy walls, and destroy thy pleasant houses; and they shall lay thy stones and thy timber and thy dust in the midst of the waters. 13And I will cause the noise of thy songs to cease; and the sound of thy harps shall be no more heard. 14And I will make thee a bare rock; thou shalt be a place for the spreading of nets; thou shalt be built no more: for I Jehovah have spoken it, saith the Lord Jehovah.\n \n Here we see that much of ancient Tyre would be submerged just as archeology has confirmed is still currently the case, and the part of the original ANCIENT CITY which remains above Sea Level is still a desolate wasteland in spite of the fact that a city has been built right up to its borders on 3 sides. This is an incredible prophecy due to the current value of, and need for land in that region.\n Ezekiel 29:9 And the land of Egypt shall be a desolation and a waste; and they shall know that I am Jehovah. Because he hath said, The river is mine, and I have made it; 10therefore, behold, I am against thee, and against thy rivers, and I will make the land of Egypt an utter waste and desolation, from the tower of Seveneh even unto the border of Ethiopia. 11No foot of man shall pass through it, nor foot of beast shall pass through it, neither shall it be inhabited forty years. 12And I will make the land of Egypt a desolation in the midst of the countries that are desolate; and her cities among the cities that are laid waste shall be a desolation forty years; and I will scatter the Egyptians among the nations, and will disperse them through the countries. 13For thus saith the Lord Jehovah: At the end of forty years will I gather the Egyptians from the peoples whither they were scattered; 14and I will bring back the captivity of Egypt, and will cause them to return into the land of Pathros, into the land of their birth; and they shall be there a base kingdom. 15It shall be the basest of the kingdoms; neither shall it any more lift itself up above the nations: and I will diminish them, that they shall no more rule over the nations. 16And it shall be no more the confidence of the house of Israel, bringing iniquity to remembrance, when they turn to look after them: and they shall know that I am the Lord Jehovah. 17And it came to pass in the seven and twentieth year, in the first month, in the first day of the month, the word of Jehovah came unto me, saying, 18Son of man, Nebuchadrezzar king of Babylon caused his army to serve a great service against Tyre: every head was made bald, and every shoulder was worn; yet had he no wages, nor his army, from Tyre, for the service that he had served against it. 19Therefore thus saith the Lord Jehovah: Behold, I will give the land of Egypt unto Nebuchadrezzar king of Babylon; and he shall carry off her multitude, and take her spoil, and take her prey; and it shall be the wages for his army. 20I have given him the land of Egypt as his recompense for which he served, because they wrought for me, saith the Lord Jehovah.\n If you'll note the bolded, it perfectly describes what happened to Egypt. Since its invasion and destruction by Babylon it was a baron uninhabited land for 40 years, the same amount of time, ONE GENERATION which the Jews wandered in the wilderness, just at a different time in history. And it never regained its superpower status of the Pharaohs after that destruction occurred. I don't see how these prophecies could be anymore specific and accurate based on what is currently undeniable current event evidence that what God said would be, IS IN FACT EXACTLY HOW IT IS. \n \n But you're one heck of a christian in your defense of Gods word and reliability. You have my condolences for preferring ignorance and lies over seeking the truth in what His word says would, and will be.\n", 
   {}, 
   346337, 
   null, 
   1236548040.0
  ], 
  [
   346476, 
   null, 
   "trebor", 
   "Prophecy: A Nation Born in a Single Day\n \n Source: The Rebirth of Israel\n \n The rebirth of Israel as an independent nation in 1948 is one of the most significant events in world history. Never before has an entire race of people been without a homeland for so long without assimilating into surrounding populations. However, no other conquered race had the promise of God to \"give all this land of Canaan to you and to your offspring forever.\" Genesis 17:8 (NLT)\n \n The scriptures prophesied that Israel would be dispersed among the nations then brought out from among them in a gradual process that would culminate in the establishment of Israel as a nation in a single day. And that's exactly what happened. The Bible also foretold the exact year in which this would happen. Those who study the Word of God recognize the restoration of Israel as the primary sign of the end of the age. Jesus promised the generation that witnessed this event would also witness His return. Matthew 24:34 (NLT)\n \n\n \n This is partly 'self fulfilled' prophecy, and partly 'non fulfilled' at all. The current state of Israel is not brought togather all the Jews.. just a minority of them. Not only that, it does not fulfill the requirements, since the nation of Israel is secular, and does not have the Torah as it's center.\n \n So much is taking vague references, and trying to retrofit what we know into words. This is known as 'prophecy by imagination'. Also known as being nuts.", 
   {
    "unicode_changes_made": true
   }, 
   346426, 
   null, 
   1236549240.0
  ], 
  [
   346483, 
   null, 
   "marc9000", 
   "I think the question should be why do you think your bible is any more true then Grimms Fairy Tales or any other piece literature?\n\n \n Maybe because Grimms fairy tales, other pieces of literature, the Koran, Buddhism, Hinduism, Shinto, Flying Spaghetti Monsters, and all the rest, find favor with militant atheists far more than Christianity. Christianity (the Bible) is the most favored religion throughout the world, and the most attacked religion throughout the world. In addition to the prophecies spelled out in posts above, the Bible warns against many, or most, of the attacks we see against it today.", 
   {}, 
   346457, 
   null, 
   1236554160.0
  ], 
  [
   346487, 
   null, 
   "GiantOreo", 
   "Maybe because Grimms fairy tales, other pieces of literature, the Koran, Buddhism, Hinduism, Shinto, Flying Spaghetti Monsters, and all the rest, find favor with militant atheists far more than Christianity. Christianity (the Bible) is the most favored religion throughout the world, and the most attacked religion throughout the world. In addition to the prophecies spelled out in posts above, the Bible warns against many, or most, of the attacks we see against it today.\n\n \n http://i16.photobucket.com/albums/b2/DavionShores/help_oppressed.gif\n \n \n emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes emoticon_xdonno", 
   {}, 
   346483, 
   null, 
   1236554520.0
  ], 
  [
   346490, 
   null, 
   "marc9000", 
   "http://i16.photobucket.com/albums/b2/DavionShores/help_oppressed.gif\n \n \n emoticon_rolleyes emoticon_rolleyes emoticon_rolleyes emoticon_xdonno\n\n \n Sorry, a big part of the blue part of your pie includes enemies of Christianity. emoticon_idea (it's in the Bible)", 
   {}, 
   346487, 
   null, 
   1236555240.0
  ], 
  [
   346491, 
   null, 
   "ShadowPikachu", 
   "No comment on your bogus and dishonest claims about the bibles prophecies SP? And all atheists/secular humanists claim they don't lie about the bible..... emoticon_rolleyesemoticon_rolleyes What a laugh....\n\n \n \n \nYou are wrong as usual SP. ANCIENT TYRE is still an unoccupied mass of ancient rubble just as was prophesied that it would remain in the bible. Tyre - World Heritage Site - Pictures, info and travel reports\n \n Ancient Tyre was an Island City which Old Nebby was never able to break. He destroyed the mainland suburbs, but not the city. The city is still occupied and is no longer an island (as the later Alexander the Great IIRC built out to the city to siege it and ended up destroying it - even then, it was still rebuilt and not desolated as the Bible claims).\n \n In fact, even the verse you quoted about Egypt gives a good hint that things did't go well for Nebby: \"17 In the twenty-seventh year, in the first month on the first day, the word of the LORD came to me: 18 \"Son of man, Nebuchadnezzar king of Babylon drove his army in a hard campaign against Tyre; every head was rubbed bare and every shoulder made raw. Yet he and his army got no reward from the campaign he led against Tyre. 19 Therefore this is what the Sovereign LORD says: I am going to give Egypt to Nebuchadnezzar king of Babylon, and he will carry off its wealth. He will loot and plunder the land as pay for his army. 20 I have given him Egypt as a reward for his efforts because he and his army did it for me, declares the Sovereign LORD. \"\nEzekiel 26\n 1And it came to pass in the eleventh year, in the first day of the month, that the word of Jehovah came unto me, saying, 2Son of man, because that Tyre hath said against Jerusalem, Aha, she is broken that was the gate of the peoples; she is turned unto me; I shall be replenished, now that she is laid waste: 3therefore thus saith the Lord Jehovah, Behold, I am against thee, O Tyre, and will cause many nations to come up against thee, as the sea causeth its waves to come up. 4And they shall destroy the walls of Tyre, and break down her towers: I will also scrape her dust from her, and make her a bare rock. 5She shall be a place for the spreading of nets in the midst of the sea; for I have spoken it, saith the Lord Jehovah; and she shall become a spoil to the nations. 6And her daughters that are in the field shall be slain with the sword: and they shall know that I am Jehovah. 7For thus saith the Lord Jehovah: Behold, I will bring upon Tyre Nebuchadrezzar king of Babylon, king of kings, from the north, with horses, and with chariots, and with horsemen, and a company, and much people. 8He shall slay with the sword thy daughters in the field; and he shall make forts against thee, and cast up a mound against thee, and raise up the buckler against thee. 9And he shall set his battering engines against thy walls, and with his axes he shall break down thy towers. 10By reason of the abundance of his horses their dust shall cover thee: thy walls shall shake at the noise of the horsemen, and of the wagons, and of the chariots, when he shall enter into thy gates, as men enter into a city wherein is made a breach. 11With the hoofs of his horses shall he tread down all thy streets; he shall slay thy people with the sword; and the pillars of thy strength shall go down to the ground. 12And they shall make a spoil of thy riches, and make a prey of thy merchandise; and they shall break down thy walls, and destroy thy pleasant houses; and they shall lay thy stones and thy timber and thy dust in the midst of the waters. 13And I will cause the noise of thy songs to cease; and the sound of thy harps shall be no more heard. 14And I will make thee a bare rock; thou shalt be a place for the spreading of nets; thou shalt be built no more: for I Jehovah have spoken it, saith the Lord Jehovah.\n \n \n\n Ok, so (first bolding), the prophecy says that Nebby and the boys are going to make a spoil of their riches and a prey of their merchandise.\n \n And yet, three chapters later Ezekial in his prophecy about Egypt says they DIDN'T get any spoils. \n \n So which is it? Was the prophecy wrong, or was Ezekial lying three chapters later?\n \n As to the second bolding - that is blatantly false. Were it true then Tyre would not have been around for Alexander to sack and it sure as hell wouldn't be around today.\n \n \n\n Here we see that much of ancient Tyre would be submerged just as archeology has confirmed is still currently the case, and the part of the original ANCIENT CITY which remains above Sea Level is still a desolate wasteland in spite of the fact that a city has been built right up to its borders on 3 sides. This is an incredible prophecy due to the current value of, and need for land in that region.\n Er, what are you talking about? Not sure I get you here.\n \n \nEzekiel 29:9 And the land of Egypt shall be a desolation and a waste; and they shall know that I am Jehovah. Because he hath said, The river is mine, and I have made it; 10therefore, behold, I am against thee, and against thy rivers, and I will make the land of Egypt an utter waste and desolation, from the tower of Seveneh even unto the border of Ethiopia. 11No foot of man shall pass through it, nor foot of beast shall pass through it, neither shall it be inhabited forty years. 12And I will make the land of Egypt a desolation in the midst of the countries that are desolate; and her cities among the cities that are laid waste shall be a desolation forty years; and I will scatter the Egyptians among the nations, and will disperse them through the countries. 13For thus saith the Lord Jehovah: At the end of forty years will I gather the Egyptians from the peoples whither they were scattered; 14and I will bring back the captivity of Egypt, and will cause them to return into the land of Pathros, into the land of their birth; and they shall be there a base kingdom. 15It shall be the basest of the kingdoms; neither shall it any more lift itself up above the nations: and I will diminish them, that they shall no more rule over the nations. 16And it shall be no more the confidence of the house of Israel, bringing iniquity to remembrance, when they turn to look after them: and they shall know that I am the Lord Jehovah. 17And it came to pass in the seven and twentieth year, in the first month, in the first day of the month, the word of Jehovah came unto me, saying, 18Son of man, Nebuchadrezzar king of Babylon caused his army to serve a great service against Tyre: every head was made bald, and every shoulder was worn; yet had he no wages, nor his army, from Tyre, for the service that he had served against it. 19Therefore thus saith the Lord Jehovah: Behold, I will give the land of Egypt unto Nebuchadrezzar king of Babylon; and he shall carry off her multitude, and take her spoil, and take her prey; and it shall be the wages for his army. 20I have given him the land of Egypt as his recompense for which he served, because they wrought for me, saith the Lord Jehovah.\n If you'll note the bolded, it perfectly describes what happened to Egypt. \n Oh, really? Well then I'm sure you wouldn't mind showing some evidence of this?\n \n \n\n Since its invasion and destruction by Babylon it was a baron[sic] uninhabited land for 40 years,\n Again - EVIDENCE please. I do recall Nebby made a campaign against Egypt, but I cannot recall anything about a 40 year desolation in which nothing walked the land. So, I'll wait for you to provide some evidence here.\n \n \n\n the same amount of time, ONE GENERATION which the Jews wandered in the wilderness, just at a different time in history. And it never regained its superpower status of the Pharaohs after that destruction occurred. I don't see how these prophecies could be anymore specific and accurate based on what is currently undeniable current event evidence that what God said would be, IS IN FACT EXACTLY HOW IT IS. \n \n But you're one heck of a christian in your defense of Gods word and reliability. You have my condolences for preferring ignorance and lies over seeking the truth in what His word says would, and will be.\n\n \n I'm sorry if you're so deluded as a \"Christian\" to think that the work of man (which may have been inspired by the Lord) should be \"reliable\" or correct.........\n \n Most Christians have more common sense than that.", 
   {}, 
   346337, 
   null, 
   1236556560.0
  ], 
  [
   346501, 
   null, 
   "Penfold", 
   "Maybe because Grimms fairy tales, other pieces of literature, the Koran, Buddhism, Hinduism, Shinto, Flying Spaghetti Monsters, and all the rest, find favor with militant atheists far more than Christianity. Christianity (the Bible) is the most favored religion throughout the world, and the most attacked religion throughout the world. In addition to the prophecies spelled out in posts above, the Bible warns against many, or most, of the attacks we see against it today.\n\n \n You place your belief in a book because you think it's the one least liked by atheists. Good to know it's not for some shallow reason.;)", 
   {}, 
   346483, 
   null, 
   1236557640.0
  ], 
  [
   346507, 
   null, 
   "marc9000", 
   "You place your belief in a book because you think it's the one least liked by atheists. Good to know it's not for some shallow reason.;)\n\n \n I never said that was my only reason -it's actually a very small part of it. But it is a good reinforcement of my major reasons.", 
   {}, 
   346501, 
   null, 
   1236563760.0
  ], 
  [
   346515, 
   null, 
   "Archangel", 
   "Ancient Tyre was an Island City which Old Nebby was never able to break. He destroyed the mainland suburbs, but not the city. The city is still occupied and is no longer an island (as the later Alexander the Great IIRC built out to the city to siege it and ended up destroying it - even then, it was still rebuilt and not desolated as the Bible claims).\n \n In fact, even the verse you quoted about Egypt gives a good hint that things did't go well for Nebby: \"17 In the twenty-seventh year, in the first month on the first day, the word of the LORD came to me: 18 \"Son of man, Nebuchadnezzar king of Babylon drove his army in a hard campaign against Tyre; every head was rubbed bare and every shoulder made raw. Yet he and his army got no reward from the campaign he led against Tyre. 19 Therefore this is what the Sovereign LORD says: I am going to give Egypt to Nebuchadnezzar king of Babylon, and he will carry off its wealth. He will loot and plunder the land as pay for his army. 20 I have given him Egypt as a reward for his efforts because he and his army did it for me, declares the Sovereign LORD. \"\n Ok, so (first bolding), the prophecy says that Nebby and the boys are going to make a spoil of their riches and a prey of their merchandise.\n \n And yet, three chapters later Ezekial in his prophecy about Egypt says they DIDN'T get any spoils. \n \n So which is it? Was the prophecy wrong, or was Ezekial lying three chapters later?\n \n As to the second bolding - that is blatantly false. Were it true then Tyre would not have been around for Alexander to sack and it sure as hell wouldn't be around today.\n\n \n Rather than piece all of the prophecies together myself and take pages to try to explain something you will only reject, let me give you this link which explains it in chronological order so you can just deny that source which I fully expect.\n \n But thank you for bringing up Alexander. Because he did complete the process of fulfilling the prophecy in its entirety. And as I said, we are referring to the Ancient City of Tyre, not the modern city which is so named but isn't in the same location as the original which remains a wasteland of ancient rubble.\n According to verse 1, this prophecy came to Ezekiel in the eleventh year of the king Zedekiah's reign, which would make it the year 586 B.C., the year in which Jerusalem was destroyed by Nebuchadnezzar.\n \n So it came to pass in the eleventh year, the first day of the month, that the word of the LORD came unto me, saying, Son of man, because Tyrus has said against Jerusalem, Aha, she is broken that was the gates of the people; she is turned unto me; I shall be replenished, now she is laid waste: Therefore thus saith the Lord GOD; Behold, I am against thee, O Tyrus, and will cause many nations to come up against thee, as the sea causeth his waves to come up (Eze 26:1-3).\n \n It is interesting to me that God does not like the wicked rejoicing in the judgments of His people. There is a quality of love in First Corinthians 13 that rejoices not in iniquity, but rejoices in the truth. And here God brings His judgment against Tyre because Tyre was rejoicing in the judgment of God that He brought against His people, against the city of Jerusalem. Thinking that somehow they were going to prosper from the devastation of Jerusalem by Nebuchadnezzar.\n \n So God declares that, first of all, there will be many nations that will be used in the judgment of Tyre, not Nebuchadnezzar only. So that the prophecy would not be completed with just Nebuchadnezzar's conquering of Tyre, but God would bring other nations against it for its destruction. And speaking of the total destruction first, and then dropping back to give us details. First of all, the overall destruction:\n \n They shall destroy [that is, the many nations] the walls of Tyrus, break down the towers: will scrape her dust from her, and make her like the top of a rock. It shall be a place for the spreading of nets in the midst of the sea: for I have spoken it, saith the Lord GOD: and it shall become a spoil to the nations. And her daughters which are in the field shall be slain by the sword; and they shall know that I am the LORD. For thus saith the Lord GOD; Behold, I will bring upon Tyrus Nebuchadnezzar king of Babylon, a king of kings, from the north, with horses, and with chariots, and with horsemen, and companies, and much people. He shall slay with the sword thy daughters in the field: and he shall make a fort against thee, and cast a mount against thee, and lift up the buckler against thee. And he (Eze 26:4-9)\n \n Notice the personal pronouns, he, Nebuchadnezzar,\n \n shall set engines of war against thy walls, and with his axes he shall break down thy towers. By reason of the abundance of his horses their dust shall cover thee: thy walls shall shake at the noise of the horsemen, and of the wheels, and of the chariots, when he shall enter into thy gates, as men enter into a city wherein is made a breach. With the hoofs of his horses shall he tread down all thy streets: he shall slay thy people by the sword, and thy strong garrisons shall go down to the ground (Eze 26:9-11).\n \n And thus is described that destruction of Tyre that would come about by Nebuchadnezzar.\n \n Now, one year after the prophecy was written, or in the year 585 B.C., Nebuchadnezzar began his siege of Tyre. The common practice of the Babylonian army was to, and of course, in warfare in those days, was to lay siege upon a city by surrounding the city and cutting off all outside supplies. And by cutting off all the outside supplies, they could soon deplete the city of its food resources. Once the food resources were depleted, the people began to starve to death. With a shortage of water, shortage of food, with a famine usually would come pestilence, disease. And then when the people were weakened by the pestilence and by the famine, then they would move in. And it would be much easier to take the city, because the people had been so weakened as the result of the siege.\n \n But because Tyrus was on the seacoast and it was a beautiful port city, in fact, it was one of the major ports of the ancient world. A very rich city of merchandise, and from Tyrus, of course, were the Phoenicians and the Phoenician navy of historic lore. He was not able to totally cut off the supplies; the city of Tyrus was continually supplied by her navies from the sea, so that the people were able to live under the siege of Nebuchadnezzar. And so the siege went on for thirteen years. During which time the majority of the city moved from the mainland to the island that was about a half mile offshore. And that became then the major city of Tyre, this island offshore. So that by the time Nebuchadnezzar finally made the onslaught against the city, there was only a small garrison and a small part of the population left within the city there on the mainland. The majority of the people had moved to the island along with the wealth of the city. So that there was no spoils to be taken by Nebuchadnezzar in the conquering of the city of Tyre.\n \n So it was a very empty and hollow victory by Nebuchadnezzar inasmuch as there was no spoil for Nebuchadnezzar from the destruction. But as is described here, the destruction by Nebuchadnezzar did come to pass, beginning one year after the prophecy and continuing for the next thirteen years in his siege of the city of Tyre.\n \n But now as we get into verse 12, there is a change of pronoun significantly. Because the prophecy was that many nations would come against Tyre. Its destruction was not to be fully accomplished by Nebuchadnezzar. So the city of Tyre went on prospering for 240 years; now an island city. And it became extremely strong and powerful. Especially now that it was an island city just a half-mile offshore, it was almost impregnable as far as any enemy was concerned. Unless you would try to attack by sea, but the Phoenician navy ruled the seas in those days. And so Tyrus became a very powerful, well-defensed city because it was on this island a half-mile offshore.\n \n So they shall make a spoil (Eze 26:12)\n \n Change of pronoun from he, Nebuchadnezzar, to they shall make a spoil\n \n of thy riches, and make a prey of thy merchandise: and they shall break down thy walls, and destroy thy pleasant houses: and they shall lay thy stones and thy timber and thy dust in the midst of the water (Eze 26:12).\n \n An extremely interesting and yet a bizarre prophecy. Because unparalleled in history, to my knowledge, is any city when destroyed the stones the timbers and the dust were put in the midst of the water.\n \n And I will cause the noise of thy songs to cease; and the sound of thy harps shall be no more heard. And I will make thee like the top of a rock: thou shalt be a place to spread nets upon; thou shalt be built no more: for I the LORD have spoken it (Eze 26:13-14),\n \n Now that's a pretty powerful statement, \"I the Lord have spoken it, saith the Lord God.\" I have spoken it; this is what's going to be.\n \n Now, did God really speak that? Is this really the Word of God to the prophet Ezekiel, or is Ezekiel making calculated guesses? Well, did it really come to pass? In 322 B.C. when Alexander the Great began his move towards Persia, he was fearful that if he moved all of his troops in a war against Persia that the Phoenicians would take advantage of it and that the Phoenician navy would then attack Greece. So he felt essential to his moving further against Persia was the conquering of Tyrus. And so he moved down the coast to Tyrus and gave an ultimatum to the city of Tyrus to surrender to him or he would destroy them. The people of Tyrus scoffed at Alexander's ultimatum, because they knew that it would be difficult for any army to besiege their city. Alexander went up to Sidon and to some of the other port cities in the area and confiscated many ships. And he attempted a naval assault against Tyrus, which was defeated. He next decided that he would take the rubble of the ancient city of Tyre which had not been rebuilt on the mainland and with the rocks and the timbers, the ruins of the ancient city, he would make this wide causeway out to the island. Taking first and throwing the rocks and the timbers into the Mediterranean beginning to form this causeway, and then putting and scraping the dirt and putting it over the top of the rocks. So he made this wide causeway out to the island.\n \n As he began to get near the island, the people of Tyre began to heat sand until it was almost molten and then shoot this molten sand on his troops. And so they built kind of defenses against that, special types of towers and all to defend the workers against this hot sand and oil that they began to shoot over at them from the city. And he began to move up these towers and these weapons of war, and finally with a combined naval assault and the assaulting of the walls themselves, Alexander the Great was able to conquer the city of Tyre in 322 after about an eight-month siege of Tyre.\n \n Because Tyre had resisted him, he sought to make an example of the city of Tyre to strike fear in the hearts of the neighboring areas. And so he really devastated and destroyed the city of Tyre. A tremendous slaughter and destruction. As the result, the other nations, the other cities and kingdoms around were terrified. They opened their doors to Alexander the Great. They began to capitulate one after another including Jerusalem. And Alexander the Great was of course a very religious person. Not godly--religious. And there's a difference. There are a lot of people that are religious, but not really very godly, but very religious. And he was an extremely religious person. And he did come to Jerusalem and was received by the Jews and the city was open to him. And he gave sacrifices unto the priests in Jerusalem to offer for him unto their gods. And he was actually... many cities opened to him after the conquest of Tyre.\n \n Now, in his taking the stones, the timbers, and the dust and scraping it, he caused the prophecy of Ezekiel to be literally fulfilled some 240 years after the prophecy was made. So the prophecy was made by Ezekiel; 240 years later it was literally fulfilled. God is not in a hurry. Ezekiel prophesied it; he never lived to see the fulfillment of it. But yet, we, now in looking back, have that advantage of seeing how that history finally confirmed the fact that it evidently was God speaking to Ezekiel. It would have been impossible for him to have made these predictions just out of his own mind or head. The things that he declared were too impractical.\n \n Now, \"it will make it like the top of a rock.\" It is impossible to accurately determine the actual site of the original city of Tyre on the mainland because it was so totally devastated and destroyed by the dirt even being scraped and cast into the sea. We can only guess that this area which is barren rock today was no doubt somewhere in these perimeters, and in this area was the ancient city of Tyre. But there are no ruins, no walls, nothing to indicate where the city itself might have been. And so the place of it has never been found or discovered, nor can we ascertain it with any certainty at all. Which, of course, is another fulfillment here.\n \n But because the dirt was scraped, the rocks are an excellent place for the fishermen to dry their nets. And if you go to that area today, you will find even today fishermen drying their nets on these rocks which were once the great city of Tyre, the nemesis of the ancient world because of the power of their navy. A city that was great in glory and power. But God pronounced His judgment because they rejoiced in the judgment of God upon Jerusalem.\n \n Thus saith the Lord GOD [verse 15] to Tyrus; Shall not the isles [or the coasts] shake at the sound of your fall, when the wounded cry, and when the slaughter is made in the midst of thee? Then all the princes of the sea shall come down from their thrones, and lay away their robes, and put off their broidered garments: they shall clothe themselves with trembling; they shall sit upon the ground, and shall tremble at every moment, and be astonished at thee (Eze 26:15-16).\n \n And so the great fear that did come into the other neighboring cities and areas.\n \n And they shall take up a lamentation for thee, and say to thee, How art thou destroyed, that wast inhabited of seafaring men, the renowned city, which was strong in the sea, she and her inhabitants, which cause their terror to be on all that haunt it! Now shall the isles tremble in the day of thy fall; yea, the isles that are in the sea shall be troubled at thy departure. For thus saith the Lord GOD; When I shall make thee a desolate city, like the cities that are not inhabited; when I shall bring up the deep upon thee, and great waters shall cover thee; When I shall bring thee down with them that descend into the pit, with the people of old time, and shall set thee in the low parts of the earth, in places desolate of old, with them that go down to the pit, that thou be not inhabited; and I shall set glory in the land of the living; I will make thee a terror, and thou shalt be no more: though thou be sought for, yet shalt thou never be found again, saith the Lord GOD (Eze 26:17-21).\n \n Such is the case. We can't tell exactly where the city was because it was so totally devastated and all you have is barren rock in that area where Tyre once existed.\n \n Now, there is a modern city of Tyre which is a Palestinian stronghold in southern Lebanon. However, it is a few miles from the site of the ancient city. So though it bears the name of Tyre, it has not been built again in the area where the original Tyre once existed. There is however a spring there in Tyre known as Ras El Ain, which the engineers have measured a water flow of ten million gallons a day. So it would be a very likely spot for a city to be built because of this abundant supply of fresh water. And yet in spite of that, the city has never been built on that site again.\n \n So God's Word holding to the present day. And you can go over there today and walk on that peninsula and see the causeway that was built by Alexander the Great looking down into the water seeing the stones that were thrown and the timbers. Well, the timbers, of course, have since have gone. But you can still see the stones, and you can see the fishermen drying their nets, and you can see the barren rocky area that was once the city of Tyre. But God's Word still holding true to the present time.\n \n Tyre, of course, was a city of tremendous merchandise. It was almost the commercial center of the world, because the navy, the powerful navy, carried the goods from Tyre all over the Mediterranean. And they supplied all of the nations around the Mediterranean as far as England with all of the merchandise and the goods and so forth. And thus because of the commercial aspects was an extremely wealthy city. But it is interesting that God had a dislike for commercialism as such. People taking advantage of people. And in the book of Revelation, chapter 18, we find the judgment of God that is yet to come against the commercial system that has enslaved men's souls. How many people have become slaves to the whole commercial system. That is, most of your paycheck is going out on the various credit accounts and all, and you're really a slave in a sense. You're laboring to pay the commercial accounts. And so God speaks against commercialism in Revelation 18, but also in the lamentation now against Tyre that is taken up by the prophet. And it is interesting and important for you that when you get a chance this week, you read Revelation 18 in the light of Ezekiel 27. And you will find the very same things that God is saying against the commercial system of the last days that is being destroyed was said at the destruction of Tyre. In fact, there are similar parallel passages that are here in twenty-seven that are also found in Revelation, chapter 18.Blue Letter Bible - Commentaries\n \n \n ==================================================================================Again, as Nebuchadnezzar said, \"This great Babylon is mine, I have made it.\" And the watchers in heaven said, \"Oh, we'll put you down for that one.\" And he went insane for a period of time. We'll get that in a few weeks when we get to Daniel. Fascinating story.\n \n Behold, therefore I am against thee, and against thy rivers, and I will make the land of Egypt utterly waste and desolate, from the tower of Syene even unto the border of Ethiopia. No foot of man shall pass through it, nor foot of beast for a period of forty years. And I will make the land of Egypt desolate in the midst of the countries that are desolate, and her cities among the cities that are laid waste shall be desolate forty years: and I will gather the Egyptians among the nations, and will disperse them through the countries. Yet thus saith the Lord GOD; At the end of forty years will I gather the Egyptians from the people whither they were scattered: And I will bring again the captivity of Egypt, and will cause them to return into the land of Pathros, into the land of their habitation; and they shall be there a base kingdom. It shall be the basest of the kingdoms; neither shall it exalt itself any more above the nations: for I will diminish them, that they shall no more rule over the nations. And it shall be no more the confidence of the house of Israel, which brings their iniquity to remembrance. And it came to pass in the seventh and twentieth year, in the first month, in the first day of the month, the word of the LORD came unto me saying, Son of man (Eze 29:10-18),\n \n Now, there are those Bible critics who say, \"Well, this did not happen during the time of Pharaoh Haaibre, that Nebuchadnezzar did not conquer Egypt during the time of his reign.\" It is interesting that they have skipped this particular reference in verse 17. He doesn't say that Nebuchadnezzar conquered the Pharaoh Haaibre and conquered Egypt during the time of his reign. But this came in the twenty-seventh year; the previous prophecy came in the tenth year. So the latter part of this chapter came seventeen years later, after the death of Pharaoh Haaibre.\n \n Son of man, Nebuchadnezzar king of Babylon caused his army to serve a great service against Tyrus: every head was made bald, and every shoulder was peeled: yet had he no wages, nor his army, for Tyrus, for the service that he had served against it (Eze 29:18):\n \n Now God is saying, \"Look, Nebuchadnezzar was My servant. He destroyed Tyrus but he didn't get paid.\" By the time he conquered the city, there was no spoil. So neither he nor his army got their pay for the job that they did for Me in the destruction of Tyrus. Therefore they will go down and they will conquer Egypt and there they will get their wages as they take the great wealth of Egypt unto themselves. And so the spoil of Egypt was to be the pay that God gave to Nebuchadnezzar and his troops for the lack of pay in the destruction of Tyrus.\n \n Chapter 30\n \n In chapter 30:\n \n The word of the LORD came again unto me, saying, Son of man, prophesy and say, Thus saith the Lord GOD; Howl ye, Woe worth the day! (Eze 30:1-2)\n \n So he is going around howling, \"Woe worth the day!\"\n \n For the day is near, even the day of the LORD is near, a cloudy day; it shall be the time of the heathen. And the sword shall come upon Egypt, and great pain shall be in Ethiopia (Eze 30:3-4),\n \n And he tells of the destruction that is going to come against these nations.\n \n Ethiopia, Libya, Lydia, and all the mingled people, and Chub, and the men of the land that is in league, shall fall with them by the sword. Thus saith the LORD; They also that uphold Egypt shall fall; and the pride of her power shall come down: from the tower of Syene shall they fall in it by the sword, saith the Lord. And it shall be desolate in the midst of the countries that are desolate, and her cities shall be in the midst of the cities that are wasted. And they shall know that I am the LORD, when I have set a fire in Egypt, and when all her helpers shall be destroyed. In that day shall messengers go forth from me in ships to make the careless Ethiopians afraid, and great pain shall come upon them, as in the day of Egypt: for, lo, it cometh. Thus saith the Lord GOD; I will also make the multitude of Egypt to cease by the hand of Nebuchadnezzar the king of Babylon (Eze 30:5-10).\n \n So the greatness which was once Egypt, one of the greatest nations in the ancient world. You study ancient history, and Egypt always stands out. And you go, of course, to Egypt and you see the tremendous monuments to the genius of the people of that ancient world. You see the ruins in Memphis and in Thebes. You see the pyramids, you see the sphinx, and all of these great monuments that were there in Egypt. And you can only stand in awe and imagine the glory that once was in Egypt. But Egypt is to fall. Not to rise into a world-dominating stature again, but to remain just a base nation from then on. And of course, such is the story. Egypt is no longer a major kind of a world empire or a major kingdom of the world, but it is just one of the many lesser nations of the world even today.\n \n And God speaks of this judgment that is going to come. And He names the various cities. The Lord said, verse 13,\n \n I will destroy the idols, I will cause their images to cease out of [Memphis] Noph [is Memphis] (Eze 30:13);\n \n And of course, you go to Memphis and you can see these huge idols that are still there.\n \n And there shall be no more a prince in the land of Egypt (Eze 30:13):\n \n That is a Pharaoh.\n \n I will put a fear in the land of Egypt. And I will make Pathros desolate, and I will set on fire in Zoan, and will execute judgments in No [which is Thebes]. I will pour out my fury upon Sin, and the strength of Egypt; and I will cut off the multitude of Thebes. And I will set fire in Egypt: and Sin shall have great pain, and Thebes shall be torn asunder, and Memphis shall have distresses daily. And the young men of Aven and Pibeseth shall fall by the sword: and these cities shall go into captivity. At Tehaphnehes also the day shall be darkened, when I shall break there the yokes of Egypt (Eze 30:13-18):\n \n Now it was at Tehaphnehes that Jeremiah, you remember, took stones and he buried them and he said, \"Over the top of these stones Nebuchadnezzar is going to build his throne.\" And of course, archaeologists in excavating at Tehaphnehes uncovered the porch of the palace and they removed the stones, the pavement, and underneath they found the very stones that Jeremiah buried as a witness against that city. And it was indeed there that Nebuchadnezzar came and set up his throne, Jeremiah says, \"You're trusting in Egypt to deliver you, look, Nebuchadnezzar is gonna set up his throne right here. Egypt isn't going to deliver.\"\n \n Now that did not happen during the period of Pharaoh Haaibre, but this portion of course happened later, seventeen years after the beginning of the siege of Tyre. Or actually, it was fifteen years after that, that God for payment to Nebuchadnezzar gave him Egypt.\n \n Verse 20:\n \n It came to pass now in the eleventh year (Eze 30:20)\n \n That is, you're back into the first month April of 586 B.C., and it's important that you catch these datings of these prophecies so that you know at what time these particular prophecies were made. So this now was made in April 586, the year that Jerusalem fell to Nebuchadnezzar.\n \n The word of the LORD came unto me, saying, Son of man, I have broken the arm of Pharaoh king of Egypt; and, lo, it shall not be bound up to be healed, to put a roller to bind it, to make it strong to hold the sword. Therefore thus saith the Lord GOD; Behold, I am against Pharaoh king of Egypt [Pharaoh Haaibre again at this time], and will break his arms, the strong, and that which was broken; and I will cause the sword to fall out of his hand. And I will scatter the Egyptians among the nations, and will disperse them through the countries. And I will strengthen the arms of the king of Babylon, and put my sword in his hand: but I will break Pharaoh's arms, and he shall groan before him with the groanings of a deadly wounded man. But I will strengthen the arms of the king of Babylon, and the arms of Pharaoh shall fall down; and they shall know that I am the LORD, when I shall put my sword into the hand of the king of Babylon, and he shall stretch it out upon the land of Egypt. And I will scatter the Egyptians among the nations, and disperse them among the countries; and they shall know that I am the LORD (Eze 30:20-26).\n \n And so God's judgments pronounced against Egypt. And the next couple of chapters he continues these judgments against Egypt, and then we get into these instructions for those of the Jewish captivity and of their coming back into the land.Blue Letter Bible - Commentaries Chapter 29\n \n \nI'm sorry if you're so deluded as a \"Christian\" to think that the work of man (which may have been inspired by the Lord) should be \"reliable\" or correct.........\n \n Most Christians have more common sense than that.\n\n \n The so called work of man is the INSPIRED word of God. That you cannot see that means that you are not a believer who is guided by faith, but by only what you can see in the flesh.", 
   {}, 
   346491, 
   null, 
   1236570660.0
  ], 
  [
   346524, 
   null, 
   "Penfold", 
   "His refutation of you is is no less inspired. There's a guy works down at the chip shop who swears he's Elvis told me so.", 
   {}, 
   346515, 
   null, 
   1236573900.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A simple question for Christians.", 
  "url": "http://www.4forums.com/political/religion-debates/12402-simple-question-christians.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12402, 
  "discussion_files": [
   [
    "14877.html", 
    "http://www.4forums.com/political/religion-debates/12402-simple-question-christians-print.html"
   ], 
   [
    "14878.html", 
    "http://www.4forums.com/political/religion-debates/12402-simple-question-christians-3-print.html"
   ], 
   [
    "14879.html", 
    "http://www.4forums.com/political/religion-debates/12402-simple-question-christians-2-print.html"
   ]
  ], 
  "identifier": 12402
 }
]