[
 [
  [
   345509, 
   null, 
   "T.Q", 
   "We have a few members on here who claim that they are true christians, and that others who claim to have faith are obviously lying or mistaken. So, in the interests of seeing if we can determine how such a decision is made, is this author a true christian? If so, why? If not, why not?", 
   {
    "post_info": {
     "post_title": "So, is this person a True Christian?"
    }
   }, 
   null, 
   null, 
   1235905980.0
  ], 
  [
   345511, 
   null, 
   "Jo Bennett", 
   "I have no mechanism for examining an individual's conscience, and neither does anyone else. Only God is able to determine whether someone is a Christian or not.", 
   {}, 
   345509, 
   null, 
   1235906460.0
  ], 
  [
   345515, 
   null, 
   "Zardoz", 
   "Not a lot about her affiliations on the internet.\n \n Based on a review of the information given in that write-up, I'd say she appears related to Word of Faithers. \n \n The opening statement (in block capitals no less) state the she has 'extra-biblical' information \"WHEN YOU BUY THIS BOOK YOU WILL BE READING A HOLYSPIRIT DIRECTED BOOK FROM GOD; & *CHRIST JESUS. THIS BOOK IS GODS HOLYSPIRIT VOICE\"\n \n That contradicts the biblical teachings.\n \n So, yeah, you can go by Jo's belief and state we don't know...\n But, most of all that we do know about what Christianity 'is' is based on what is writen in the bible.\n \n My take?\n \n No, she's not a \"Christian\".\n She can have Christian leanings and a desire to be one but labeling yourself something don't make it so in the face of common definitions.\n It's like self-labeling yourself a vegan while wearing leather shoes and eatting a bacon double cheese burger.\n \n I've often though of starting a 'No True Scotsman: Revisited' thread on this type of subject.", 
   {}, 
   345511, 
   null, 
   1235913420.0
  ], 
  [
   345516, 
   null, 
   "Archangel", 
   "In remembering that we are given the authority by God to discern the spirit which guides those who call themselves Teachers or Prophets, it is not only our right but the responsibility to determine if what she represents is from Him or not. And my immediate impression about this woman is not very trusting or encouraging regarding the relationship she has with my Father in Heaven.\n \n Why? Because if what she has to say is inspired words from the living God, there is no way God would have told her to gouge 135.00 to 150.00 dollars per copy from my people for this paperback. If this was from God it would be free for the cost of a donation, not a ridiculous price which screams out that \"I, the author surely think more of myself than I ought to.\" \n \n So, although I don't want to actually judge her salvation, I question how balanced she is spiritually speaking.", 
   {}, 
   345515, 
   null, 
   1235920200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  So, is this person a True Christian?", 
  "url": "http://www.4forums.com/political/religion-debates/12404-so-person-true-christian.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12404, 
  "discussion_files": [
   [
    "23426.html", 
    "http://www.4forums.com/political/religion-debates/12404-so-person-true-christian-print.html"
   ]
  ], 
  "identifier": 12404
 }
]