[
 [
  [
   346787, 
   null, 
   "simone", 
   "Ten gunned down in southern Alabama.\n \n At least seventeen gunned down in Germany.\n \n On Monday, March 9, 2009, some twenty-seven human beings were living, breathing, going about their respective businesses.\n \n They are no more.", 
   {
    "post_info": {
     "post_title": "Body Count"
    }
   }, 
   null, 
   null, 
   1236799440.0
  ], 
  [
   346800, 
   null, 
   "NATO 556", 
   "Since I'm new here and don't know which side of the aisle you occupy, I'm going to have to assume that you're on the gun hating side based on your post.", 
   {}, 
   346787, 
   null, 
   1236803940.0
  ], 
  [
   346817, 
   null, 
   "snakespit", 
   "Since I'm new here and don't know which side of the aisle you occupy, I'm going to have to assume that you're on the gun hating side based on your post.\n\n \n Correct. Had simone placed it in the news forum, it could have just been seen as a stating of fact. Since she put it in the gun control forum, I see it as her way of baiting people into the same old tired gun control arguments. \n \n What happened in AL and Germany is certainly tragic.", 
   {}, 
   346800, 
   null, 
   1236814980.0
  ], 
  [
   346826, 
   null, 
   "Superlite27", 
   "Ten gunned down in southern Alabama.\n \n At least seventeen gunned down in Germany.\n \n On Monday, March 19, 2009, some twenty-seven human beings were living, breathing, going about their respective businesses.\n \n They are no more.\n\n \n \n Uhhh, March 19th 2009 hasn't arrived yet. If you're going to play up the melodrama and wax eloquent in memorium, I highly suggest remembering the date CORRECTLY. Otherwise it just comes off as an act. \n \n (Oh, and if your hand just slipped, the 1 is clear on the other side of the keyboard from the 9. You must have HUGE fingers to slip that badly)\n \n I wonder how many of these poor souls killed by careless criminals had CCW permits? Maybe they should have used a hair pick or vomited on themselves as suggested by the Illinois State Police.", 
   {}, 
   346787, 
   null, 
   1236824460.0
  ], 
  [
   346882, 
   null, 
   "simone", 
   "Since I'm new here and don't know which side of the aisle you occupy, I'm going to have to assume that you're on the gun hating side based on your post.\n\n I'm actually on the side of keeping innocent people alive.\n \n Even innocent people who have been born.\n \n I'm not of the \"innocence only exists within the womb.\" Or, the \"once an infant passes through the soiled vagina of a woman it becomes evil school.\" I'm not religious enough for that kind of crapola.", 
   {}, 
   346800, 
   null, 
   1236885300.0
  ], 
  [
   346885, 
   null, 
   "NATO 556", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n Most of the people in this discussion forum are on that side, last time I checked. That doesn't really tell me anything, though.", 
   {}, 
   346882, 
   null, 
   1236886020.0
  ], 
  [
   346894, 
   null, 
   "Tither", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n Then you should celibate this then.\n Link   How Often Are Firearms Used in Self-Defense?  \n There are approximately two million defensive gun uses (DGU's) per year by law abiding citizens. That was one of the findings in a national survey conducted by Gary Kleck, a Florida State University criminologist in 1993. Prior to Dr. Kleck's survey, thirteen other surveys indicated a range of between 800,000 to 2.5 million DGU's annually. However these surveys each had their flaws which prompted Dr. Kleck to conduct his own study specifically tailored to estimate the number of DGU's annually. \n", 
   {}, 
   346882, 
   null, 
   1236888660.0
  ], 
  [
   346898, 
   null, 
   "TRIGGER", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n Then why are you opposed to the innocent fighting for their own lives instead of hopeing the police will get there in time? Or is it your belief that once someone owns a gun that they are no longer law abiding or innocent?", 
   {}, 
   346882, 
   null, 
   1236891120.0
  ], 
  [
   346987, 
   null, 
   "Ethmi", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n First off, everyone here is. What we think will do that may differ, but you make the NRA and all gun owners sound like hate-mongering murderers.\n \n Second, are you saying that gun owners aren't innocent? I got my first gun at the age of 13 (I first fired a 22. at the age of seven, I think) and I've never had to use them against a human.\n \n \nEven innocent people who have been born.\n\n \n Your point is?\n \n \nI'm not of the \"innocence only exists within the womb.\" Or, the \"once an infant passes through the soiled vagina of a woman it becomes evil school.\" I'm not religious enough for that kind of crapola.\n\n \n What makes you think I am? I distinctly remember debates when I had the courtesy to call you simone, but you were persistent in calling me \"EthicallyChallenged\". What did I name you on the elections thread... Grimone? So Grimone, prove to me that anyone on here believes such a thing.\n \n That's what I don't like about the anti-religion side. You're a jerk, Foundit thinks that anyone who disagrees with him is a predictabley evasive liar, and OC thinks he impresses me by citing elementary school science.", 
   {}, 
   346882, 
   null, 
   1237001880.0
  ], 
  [
   347021, 
   null, 
   "Superlite27", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n Wow. I thought I'd never see an anti-gunner change their mind. I have to congratulate simone on the decision to let innocents defend themselves at last!\n \n Welcome to the club, simone! I believe you'll find us firearms enthusiasts to be a close knit group. Many will often hesitate welcoming a person who suddenly stands up and says, \"Hey, instead of mouthing the words about protecting innocent people, I believe I'll actually support something that will actually allow them to be physically protected.\"\n \n Not me. When a person actually believes in allowing innocents the means to resist violent criminals, I will always welcome them with open arms. I'm glad you finally are on the side of reason. If any of your former associates try to sway you with their empty ideology and emotional pandering that has no basis in reality, feel free to let me know. I'm sure all the other folks here who also believe in letting innocents keep themselves alive will back you up.\n \n Well joined. Could I ask what swayed you? Was it the hypocrisy of their constant drivel about protecting innocents by keeping them defenseless and at the mercy of violent criminals? Or did you finally come to grips that those innocents were dropping like flies while some big sea of gun control idealogical change was taking forever to actually disarm all the criminals who, sadly, continue to remain violent, bloodthirsty murderers who prey on the defenseless no matter what inanimate object they choose to wield?", 
   {}, 
   346882, 
   null, 
   1237049820.0
  ], 
  [
   347119, 
   null, 
   "simone", 
   "Then why are you opposed to the innocent fighting for their own lives instead of hopeing the police will get there in time? Or is it your belief that once someone owns a gun that they are no longer law abiding or innocent?\n\n Doesn't everyone in Alabama own a gun?\n \n So, where the Hades were they?", 
   {}, 
   346898, 
   null, 
   1237146600.0
  ], 
  [
   347121, 
   null, 
   "simone", 
   "Uhhh, March 19th 2009 hasn't arrived yet. If you're going to play up the melodrama and wax eloquent in memorium, I highly suggest remembering the date CORRECTLY. Otherwise it just comes off as an act. \n \n (Oh, and if your hand just slipped, the 1 is clear on the other side of the keyboard from the 9. You must have HUGE fingers to slip that badly)\n \n I wonder how many of these poor souls killed by careless criminals had CCW permits? Maybe they should have used a hair pick or vomited on themselves as suggested by the Illinois State Police.\n\n For your information, should you be capable of taking it in, it happened in my daughter's neighborhood and I was extremely upset.", 
   {}, 
   346826, 
   null, 
   1237146720.0
  ], 
  [
   347125, 
   null, 
   "NATO 556", 
   "For your information, should you be capable of taking it in, it happened in my daughter's neighborhood and I was extremely upset.\n\n \n That's no excuse for treating us like we're the villains responsible for this mess.", 
   {}, 
   347121, 
   null, 
   1237148460.0
  ], 
  [
   347219, 
   null, 
   "simone", 
   "I kick anyone around who refuses to acknowledge the need for responsible gun ownership. Especially when there's a large body count in my daughter's neighborhood.", 
   {}, 
   347125, 
   null, 
   1237236300.0
  ], 
  [
   347222, 
   null, 
   "Tither", 
   "I kick anyone around who refuses to acknowledge the need for responsible gun ownership. Especially when there's a large body count in my daughter's neighborhood.\n\n I understand your frustrations. However this guy was a firmer cop. What gun responsible gun control would have kept him from attacking all of those people?\n \n I think responsible gun control in my case is, give us the chance to defend ourselves if we choose to carry. That being until you Liberals create the utopia you seek. \n \n All I know is you guys are failing in that goal!", 
   {}, 
   347219, 
   null, 
   1237237020.0
  ], 
  [
   347229, 
   null, 
   "NATO 556", 
   "I kick anyone around who refuses to acknowledge the need for responsible gun ownership. Especially when there's a large body count in my daughter's neighborhood.\n\n \n Responsible gun ownership? Show me how many, and which, NRA members have gone on killing sprees.\n \n Just because we refuse to recognize your opinions that bans on certain firearms and other such restrictions are \"reasonable\" in your mind, doesn't mean that we're against responsibility.", 
   {}, 
   347219, 
   null, 
   1237239360.0
  ], 
  [
   347233, 
   null, 
   "Ethmi", 
   "Doesn't everyone in Alabama own a gun?\n \n So, where the Hades were they?\n\n \n What makes you think that? After all, I'm sure you never taught your daughter the \"vile, murderous, disgusting practice\" of owning a gun, did you? :)\n \n Also, might I add that \"little person\" Germany can legally own a handgun.", 
   {}, 
   347119, 
   null, 
   1237245780.0
  ], 
  [
   347243, 
   null, 
   "Archangel", 
   "I'm actually on the side of keeping innocent people alive.\n\n \n If this were true, you would oppose any and all laws which suggest disarming citizens since you would realize that only honest gun owners would be disarmed by such laws. Criminals would never give up their illegally gotten, unregistered weapons so only criminals would be armed then. And you and all law abiding people would be at their mercy, or lack of it I should say. \n \n \nEven innocent people who have been born.\n\n \n Interesting qualification that \"born\" distinction is simone. As if an unborn child isn't alive or human yet. And yet, you will never explain how such a being can grow and develop into a human being if it wasn't alive at the cellular and genetic level. And how does it reflect the combined genetic material of its parents if it isn't a result of their DNA? You must ignore that reality which I find to be completely evil and reprobate at the most basic level of rationale.\n \n \nI'm not of the \"innocence only exists within the womb.\" Or, the \"once an infant passes through the soiled vagina of a woman it becomes evil school.\" I'm not religious enough for that kind of crapola.\n\n \n Neither am I religious as a fundamentalist christian. Where did you get such a perverse idea from anyway? From some atheistic or secular humanist propaganda talking points? By the way, Religion is the creation of men in order to hold people in bondage to rules and regulations made up by other men. And that is precisely the type of religion you do buy into when you want to give an appearance of religiosity. \n \n Does this sound like Jesus thought children were evil or lost their innocence once they were born?\n Mat 19:14 Jesus said, \"Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.\"Ask yourself simone, will God see you as innocent as a little child? I know He sees me and all those who possess His Holy Spirit that way. emoticon_xangel", 
   {}, 
   346882, 
   null, 
   1237262400.0
  ], 
  [
   347502, 
   null, 
   "simone", 
   "Blah! Blah! Blah!\n \n And, rather condescending and patronizing at that!", 
   {}, 
   347243, 
   null, 
   1237492380.0
  ], 
  [
   347506, 
   null, 
   "NATO 556", 
   "Simone-\n \n If the nearly 30,000 firearms regulations already on the books didn't make any sort of difference, what leads you to believe that another one would've done any better?", 
   {}, 
   347502, 
   null, 
   1237493160.0
  ], 
  [
   347535, 
   null, 
   "Archangel", 
   "Blah! Blah! Blah!\n \n And, rather condescending and patronizing at that!\n\n \n At least it's accurate as it applies to the ignorant drivel you constantly spew around here. Unlike your distorted opinion of those of us who respect innocent life enough to allow for defending themselves.", 
   {}, 
   347502, 
   null, 
   1237501980.0
  ], 
  [
   347576, 
   null, 
   "Ethmi", 
   "Blah! Blah! Blah!\n \n And, rather condescending and patronizing at that!\n\n \n I am amazed at this brilliant response. Someone give her a Klondike bar! :)", 
   {}, 
   347502, 
   null, 
   1237514280.0
  ], 
  [
   348665, 
   null, 
   "simone", 
   "Binghamton, New York, 12?\n \n Thirteen? What's the body count?\n \n Hostages?", 
   {}, 
   347576, 
   null, 
   1238793600.0
  ], 
  [
   348667, 
   null, 
   "NATO 556", 
   "Binghamton, New York, 12?\n \n Thirteen? What's the body count?\n \n Hostages?\n\n \n I know a good deal about New York firearms laws. Let's have a look, shall we?\n \n Initial reports use the buzz term \"high powered rifle\" in the covering of the story, so unless the guy is armed with a hunting rifle it's all hyperbole and lies, because New York specifically bans the sale and possession of firearms that can be considered \"assault weapons\". New York also bans the sale and possession of magazines that hold more than 10 rounds of ammunition, requires a permit to purchase or even own a firearm, they require registration of firearms, there's a waiting period on acquiring a firearm, etc.\n \n Doesn't look like an absence of gun laws are responsible for this shooting taking place.", 
   {}, 
   348665, 
   null, 
   1238794560.0
  ], 
  [
   348668, 
   null, 
   "Tither", 
   "Yep, yet another tragedy. \n \n Now I guess it is time for someone to tell us how this is our fault, instead of a society that is this dysfunctional!\n \n Personally I was at home, but I am sure you will pin this on me!", 
   {}, 
   348665, 
   null, 
   1238794680.0
  ], 
  [
   348675, 
   null, 
   "Charliegone", 
   "Yep, yet another tragedy. \n \n Now I guess it is time for someone to tell us how this is our fault, instead of a society that is this dysfunctional!\n \n Personally I was at home, but I am sure you will pin this on me!\n\n \n My condolences to the families. It seems as the economic situation is getting worse, people are starting to go crazy.", 
   {}, 
   348668, 
   null, 
   1238797200.0
  ], 
  [
   348707, 
   null, 
   "Archangel", 
   "Binghamton, New York, 12?\n \n Thirteen? What's the body count?\n \n Hostages?\n\n \n And you blame this tragedy on our right to keep and bear arms? You can't see that it's the result of a deeper social problem which disarming law abiding citizens wont prevent from occurring at all in the future? You need proof of that claim simone? Here ya go!!! Let's just look at what's happening in a Country which has already bought into the lies and propaganda of fear which you promote and support. NRA-ILA :: Australia`s Gun Ban, Crime & Video Tape Here's more which clarifies that a gun isn't required in order to commit mass murder.... Austin Gun Rights Examiner: Australia experiencing mass murder despite gun control What is painfully obvious and clear is that criminals wont ever freely give up their guns to the government in a gun confiscation effort for 2 reasons. 1) there is no record of their illegally obtained weapon so the government doesn't know they have weapons which need to be confiscated, and 2) they need and want the guns for their chosen field of interest which is committing crimes, of which the gun is the preferred tool of choice. So the consequence of such a law would simply be to disarm the honest citizen and take their ability of self defense away from them.", 
   {}, 
   348665, 
   null, 
   1238856240.0
  ], 
  [
   348713, 
   null, 
   "NATO 556", 
   "Simone-\n \n How many innocent people have to be brutally and senselessly murdered in a supposedly safe state, before you get it through your head that gun control will never save even a single life?", 
   {}, 
   348707, 
   null, 
   1238858280.0
  ], 
  [
   348736, 
   null, 
   "Tither", 
   "Simone-\n \n How many innocent people have to be brutally and senselessly murdered in a supposedly safe state, before you get it through your head that gun control will never save even a single life?\n\n We recently passed the NICS improvement Act that is supposed to stop people with mental problems from getting guns. We knew that wouldn't work, but we gave that to them anyway! \n \n Seems to me that the gun controllers know this, but no amount of gun control will solve this problem. Germany a recent example! \n \n So some want all guns banned, so we can be like Mexico where the Drug Gangs actually run the neighborhoods and the police department! Rampant death to any So called Free American who dares try to stand up to them and take back their neighborhoods, and runs to the cops! Cops until they become totally corrupt, would be extremely overworked, and disheartened and probably quit, or just learn that they would need to submit the the Drug Gangs rule. But Gun Banners want what they want, and it seems like nothing can change their minds.", 
   {}, 
   348713, 
   null, 
   1238883000.0
  ], 
  [
   348744, 
   null, 
   "Tither", 
   "I just heard a report on Wong, the New York Immigration Center killer. People that knew him were not surprised. \n \n Here is what was reported. He had been laid off from a low paying job, not IBM. He was unable to pay his bills on his low amount of unemployment, he barely spoke English, was a client of the Immigration Center to learn English, and people made fun of his inability to learn the language. \n \n Although it is somewhat of a human failing to want to put down and make fun of people, I have always felt we are courting disaster when we do. When I told my wife, how stupid it was to put people down, she told me, Well, as she has observed, it seems to be human nature to want to put people down. (Not that she does that.) But I asked her, how funny those people inside the Immigrations Center thought is was when he came back with a rifle and barricaded the back door so none of them could escape! \n \n Come On folks! We gotta do better then this! We need to teach people this is not acceptable behavior. Use your heads! Or possibly lose it!", 
   {}, 
   348736, 
   null, 
   1238894880.0
  ], 
  [
   348759, 
   null, 
   "Ethmi", 
   "Binghamton, New York, 12?\n \n Thirteen? What's the body count?\n \n Hostages?\n\n \n Simone, you have to realize that not all examples help you, particulary from places with strict gun laws. :)", 
   {}, 
   348665, 
   null, 
   1238908500.0
  ], 
  [
   348784, 
   null, 
   "simone", 
   "Three cops gunned down in Pittsburgh by a right wing nutso who sucked in the imbecilic rhethoric of Glenn Beck and Chuck Norris...\"They are going to take your guns away from you!!\"\n \n Scream! Scream! Oh my God! My Guns! My God! My Guns!", 
   {}, 
   348759, 
   null, 
   1238956440.0
  ], 
  [
   348786, 
   null, 
   "TRIGGER", 
   "Three cops gunned down in Pittsburgh by a right wing nutso who sucked in the imbecilic rhethoric of Glenn Beck and Chuck Norris...\"They are going to take your guns away from you!!\"\n \n Scream! Scream! Oh my God! My Guns! My God! My Guns!\n\n \n Please simone guns are pretty much evenly distributed between the left and right. Can you show us a link where this persons political affiliation lies?", 
   {}, 
   348784, 
   null, 
   1238958540.0
  ], 
  [
   348789, 
   null, 
   "NATO 556", 
   "Three cops gunned down in Pittsburgh by a right wing nutso who sucked in the imbecilic rhethoric of Glenn Beck and Chuck Norris...\"They are going to take your guns away from you!!\"\n \n Scream! Scream! Oh my God! My Guns! My God! My Guns!\n\n \n You say the person is a right wing nut, but do you have any proof of that?", 
   {}, 
   348784, 
   null, 
   1238960640.0
  ], 
  [
   348791, 
   null, 
   "simone", 
   "White supremacist:\n \nSuspect in officers' shooting was into conspiracy theories\n Sunday, April 05, 2009\n By Dennis B. Roddy, Pittsburgh Post-Gazette\n .... by January 2007, was posting photographs of his tattoos on white supremacist Web site Stormfront. Among his ambitions: \"to accumulate enough 'I punched that [expletive] so hard' stories to match my old man.\"\n \n .... No longer obscure, the 22-year-old is charged in the worst police shooting in the modern history of Pittsburgh. No one is calling his actions anything but pointless.\n \n .... Believing most media were covering up important events, Mr. Poplawski turned to a far-right conspiracy Web site run by Alex Jones, a self-described documentarian with roots going back to the extremist militia movement of the early 1990s.\n \n Around the same time, he joined Florida-based Stormfront, which has long been a clearinghouse Web site for far-right groups. He posted photographs of his tattoo, an eagle spread across his chest.\n \n .... \"For some time now there has been a pretty good connection between being sucked into this conspiracy world and propagating violence,\" said Heidi Beirich, director of research at the Southern Poverty Law Center and an expert on political extremists. She called Mr. Poplawski's act, \"a classic example of what happens when you start buying all this conspiracy stuff.\"\n\n Suspect in officers' shooting was into conspiracy theories\n \n So, the guy was a raving leftie?\n \n Hah!", 
   {}, 
   348789, 
   null, 
   1238961420.0
  ], 
  [
   348803, 
   null, 
   "NATO 556", 
   "I seem to remember early into the New York shooting the news media kept going on about how the shooter was armed with a \"high powered rifle\" over and over and over again, before eventually finally learning that he was only armed with two handguns.\n \n Now if they can be giving the wrong information for hours even after a conflict has been resolved, why should we believe that all this supposed \"evidence\" that the PA shooter was a right wing conservative, is accurate and factual?", 
   {}, 
   347535, 
   null, 
   1238968680.0
  ], 
  [
   348808, 
   null, 
   "Archangel", 
   "I seem to remember early into the New York shooting the news media kept going on about how the shooter was armed with a \"high powered rifle\" over and over and over again, before eventually finally learning that he was only armed with two handguns.\n \n Now if they can be giving the wrong information for hours even after a conflict has been resolved, why should we believe that all this supposed \"evidence\" that the PA shooter was a right wing conservative, is accurate and factual?\n\n \n That's because he wasn't a right wing conservative at all. He was an ignorant racist/white supremacist. I'll bet he's never voted in his life, much less for a conservative politician. But the anti gun leftists of simones ilk must attempt to make this a right wing problem rather than just blame the individual whack jobs for being crazy.\n \n Notice how they hate to talk about Ted Kaczynski who was without a doubt according to his own manifesto a left wing lunatic who was also known as the unabomber. I guess that because he didn't use a gun, but just mailed bombs to people he was ok, huh simone?", 
   {}, 
   348803, 
   null, 
   1238972100.0
  ], 
  [
   348823, 
   null, 
   "Tither", 
   "Who cares weather he was a Lefty or a Righty. As I have said all along, I make no excuses for criminals. What we know for sure is that this guy was a no good scumbag who called the police, told them that there was a domestic in progress, and then hid in ambush to Murder the cops who responded!\n \n His affiliation is, Murdering Scumbag! \n \n Trying to pin this guys actions on us, just because we are gun owners is despicable to say the least! Why don't we find our what ethnic group he was a part of and then Simone can slime a whole country as well! \n \n So Simone. Do you believe in a woman's Right to commit an abortion? If so, can we, by your very affiliation, pin every child aborted on you! Somehow I don't think you will think this is fair! \n \n Not that I believe for a moment that what is fair matters much to you!", 
   {}, 
   348808, 
   null, 
   1238982360.0
  ], 
  [
   348825, 
   null, 
   "jyoshu", 
   "Ten gunned down in southern Alabama.\n \n At least seventeen gunned down in Germany.\n \n On Monday, March 9, 2009, some twenty-seven human beings were living, breathing, going about their respective businesses.\n \n They are no more.\n\n \n I know ... I know. I agree with you that it's sad more of those people couldn't or didn't take advantage of concealed carry to help prevent so many deaths. That needs to change along with education so more people can defend themselves.", 
   {}, 
   346787, 
   null, 
   1238983560.0
  ], 
  [
   348841, 
   null, 
   "Tither", 
   "  Gun rights activists are not to blame for Pittsburgh slayings \n Saturday, Richard Poplawski of Pittsburgh killed three police officers and injured two more. Allegedly, Poplawski had just lost his job and friends claim he was worried the Obama administration would bring back the \"Assault Weapon Ban\" that expired in 2004. Even if it is true that such a fear was the reason for his actions, it is unclear how he hoped such an attack would resolve the situation.\n \n For the sake of the argument, let's assume that those allegations are true. Since we all know that every subset of society, whether doctors, lawyers, judges, teachers, priests, etc., can contain psychopaths, it is only a matter of time before a person identifying as a gun rights activist does something illegal.  When an Ohio sheriff goes bad,  we don't condemn the other 87 sheriffs in Ohio. \n \n Yet that is exactly what some media members are doing to gun rights activists.\n", 
   {}, 
   348825, 
   null, 
   1239027960.0
  ], 
  [
   348861, 
   null, 
   "simone", 
   "Well and good.\n \n But that is a site profoundly in favor of everyone owning a gun.\n \n Can you find a less biased site?", 
   {}, 
   348841, 
   null, 
   1239043080.0
  ], 
  [
   348863, 
   null, 
   "Tither", 
   "Well and good.\n \n But that is a site profoundly in favor of everyone owning a gun.\n \n Can you find a less biased site?\n\n Simone. We are all Americans. Part of the point I am trying to get across is to stop dividing us, into us and them. \n \n An American made that point! Not an Enemy! Either it is true or it is not! Neither I, nor did 300 million other Americans commit this crime. I along with many others have been asked to serve our country during a time of war, and we proudly served. We are NOT the enemy. We are your fellow citizens.", 
   {}, 
   348861, 
   null, 
   1239044100.0
  ], 
  [
   348868, 
   null, 
   "Tither", 
   "My biggest objection to those who turn vitriol after tragic events like this is that they say this only shows the need for more gun control! \n \n OK, so maybe you have a point. What gun control can you enact that is both Constitutional and will address this issue? Good and proper question. No?\n \n I'm open for suggestions, but let me set forth the stipulation. It has to STOP this from happening!", 
   {}, 
   348863, 
   null, 
   1239048120.0
  ], 
  [
   348878, 
   null, 
   "NATO 556", 
   "Simone-\n \n If a deranged racist, white supremacist purposely and intentionally ambushing and killing three police officers is sufficient evidence that gun owners are dangerous individuals, by the same token would you be willing to admit that the New York shooting of a young black male by three fully armed police officers, is evidence that the police aren't trustworthy of being armed either?", 
   {}, 
   348861, 
   null, 
   1239053340.0
  ], 
  [
   348881, 
   null, 
   "Penfold", 
   "His paranoia stems from the believing the lies propagated by Obama-haters about having his guns taken away...He just drank a little more of the koolade than he could handle.", 
   {}, 
   348878, 
   null, 
   1239056100.0
  ], 
  [
   348883, 
   null, 
   "NATO 556", 
   "His paranoia stems from the believing the lies propagated by Obama-haters about having his guns taken away...He just drank a little more of the koolade than he could handle.\n\n \n How quickly you've forgotten that Obama was and still is friends with the Weathermen terrorist organization, and his preacher publicly supported anti-American positions and anti-white measures.", 
   {}, 
   348881, 
   null, 
   1239056760.0
  ], 
  [
   348890, 
   null, 
   "Tither", 
   "His paranoia stems from the believing the lies propagated by Obama-haters about having his guns taken away...He just drank a little more of the koolade than he could handle.\n\n When gun owners talk about taking guns away, we mean any gun. Like the so called assault Weapons Ban. \n \n Gun Banners think it means taking all of our guns away! That is absolutely Unconstitutional, and therefore it cannot be what we mean. Just deduce the logic. \n \n Obama declares that he will do this if we let him! From the Whitehouse website.\n   Address Gun Violence in Cities: \n Obama and Biden would repeal the Tiahrt Amendment, which restricts the ability of local law enforcement to access important gun trace information, and give police officers across the nation the tools they need to solve gun crimes and fight the illegal arms trade. Obama and Biden also favor commonsense measures that respect the Second Amendment rights of gun owners, while keeping guns away from children and from criminals. They support closing the gun show loophole and making guns in this country childproof. They also support making the expired federal Assault Weapons Ban permanent.\n\n It is Not paranoia if it is true!", 
   {}, 
   348881, 
   null, 
   1239065520.0
  ], 
  [
   348903, 
   null, 
   "Charliegone", 
   "His paranoia stems from the believing the lies propagated by Obama-haters about having his guns taken away...He just drank a little more of the koolade than he could handle.\n\n \n Well, Obama did say that on his website (like Tither pointed out) so it is true, but I think he was just way unstable, like really mentally unstable. I find that many people are not too well versed in the ways of politics. Politicians will say something (like promise something) and then completely forget about it when they have that position they want. Also, it is odd that the media does not make his dishonorable discharge (which would disqualify him from gun ownership) an issue. The media, as stated by my professor in Comparative Politics, is focused mainly on sensationalism. They have to be in order to keep people watching.", 
   {}, 
   348881, 
   null, 
   1239079320.0
  ], 
  [
   348905, 
   null, 
   "simone", 
   "How quickly you've forgotten that Obama was and still is friends with the Weathermen terrorist organization, and his preacher publicly supported anti-American positions and anti-white measures.\n\n Got any specifics on your accusation?\n \n Or is this just another little right wing lie?", 
   {}, 
   348883, 
   null, 
   1239079680.0
  ], 
  [
   348908, 
   null, 
   "NATO 556", 
   "Got any specifics on your accusation?\n\n \n http://blog.washingtonpost.com/fact-checker/2008/02/obamas_weatherman_connection.html\n \n obama weathermen - Yahoo! Search Results", 
   {}, 
   348905, 
   null, 
   1239082620.0
  ], 
  [
   348911, 
   null, 
   "Tither", 
   "Well, Obama did say that on his website (like Tither pointed out) so it is true, but I think he was just way unstable, like really mentally unstable. I find that many people are not too well versed in the ways of politics. Politicians will say something (like promise something) and then completely forget about it when they have that position they want. Also, it is odd that the media does not make his dishonorable discharge (which would disqualify him from gun ownership) an issue. The media, as stated by my professor in Comparative Politics, is focused mainly on sensationalism. They have to be in order to keep people watching.\n\n Exactly! As I said before, I make no excuses for criminal scum bags. \n \n However, Obama does have a past record. Everyone is willing to give him a pass on his anti-gun votes, and I am too, just as long as he lives up to his, \"Law-abiding gun owners have nothing to fear from An Obama Administration\", statement.\n \n For instance  we have him flipping on his support for the DC handgun ban here.\n And \n  Here on the issues has his anti-gun voting and support record. ", 
   {}, 
   348903, 
   null, 
   1239115140.0
  ], 
  [
   348916, 
   null, 
   "Tither", 
   "Man! WHAT is going ON!\n \n   At least two dead in German court shooting \n BERLIN (AFP) - A gunman killed at least two people when he opened fire in a German courthouse on Tuesday in the southern city of Landshut, police spokesman Leonard Mayer told rolling news channel NTV.\n \n The incident comes just four weeks after a 17-year-old gunned down 15 people in the German town of Winnenden, in a bloodbath that revived an emotional debate over gun laws.\n The teenage killer shot himself when police tried to apprehend him.\n\n Folks, if you pray, please pray for our world, hard and very earnestly.\n \n Have we ever seen evil such as this before? Is it the economy? What is it? This has got to stop!", 
   {
    "unicode_changes_made": true
   }, 
   348911, 
   null, 
   1239122880.0
  ], 
  [
   348929, 
   null, 
   "Lakrite", 
   "@simone\n -The news is not going to report about the vast majority of gun owners who do not kill people. You see constant stories on the news about people dying from guns, but that does not mean that everyone who owns a gun is a murderer. \n \n -Guns are not the only way to kill people anyway. If somebody really wanted to murder someone, they could use any other weapon.\n \n -We have a constitutional right to own guns.\n \n -Just as outlawing marijuana will not stop people from smoking it, outlawing guns will not stop criminals from obtaining guns. The people who would not use guns if guns were banned would be the innocent law-abiding citizens. They will simply be left defenseless when criminals come at them with guns just as before.", 
   {}, 
   348916, 
   null, 
   1239153240.0
  ], 
  [
   348935, 
   null, 
   "Ethmi", 
   "Three cops gunned down in Pittsburgh by a right wing nutso who sucked in the imbecilic rhethoric of Glenn Beck and Chuck Norris...\"They are going to take your guns away from you!!\"\n\n \n You have to realize that this guy was dishonorably discharged from the marine corps.; there is no way that gun was owned legally. This is a single isolated incedent, and if you want left wing fanatics, think ELF (Earth Liberation Front).\n \n Also, Simone, I do wonder what all this is about legally obtained firearms; would it somehow make the families of the officers feel better if the gun was illegally obtained?\n \n \nScream! Scream! Oh my God! My Guns! My God! My Guns!\n\n \n In case you haven't noticed, the only one screaming is you. Very accurate depiction, and very mature behavior, simone.", 
   {}, 
   348784, 
   null, 
   1239162060.0
  ], 
  [
   348936, 
   null, 
   "Ethmi", 
   "White supremacist:\n \n Suspect in officers' shooting was into conspiracy theories\n \n So, the guy was a raving leftie?\n \n Hah!\n\n \n Think ELF. \n \n You see, simone, the difference between us and you is our maturity levels. We're not saying that you run around throwing molotov cocktails at construction products, living like a caveman, graffiting \"ELF\" everywhere, and sending death threats to logging company executives.", 
   {}, 
   348791, 
   null, 
   1239162180.0
  ], 
  [
   348937, 
   null, 
   "Ethmi", 
   "Well and good.\n \n But that is a site profoundly in favor of everyone owning a gun.\n \n Can you find a less biased site?\n\n \n Or maybe you tell us, using a source of your own, how it really is, if you know it all. Or maybe that's the exact reason why you never do?", 
   {}, 
   348861, 
   null, 
   1239162420.0
  ], 
  [
   348938, 
   null, 
   "Ethmi", 
   "Got any specifics on your accusation?\n \n Or is this just another little right wing lie?\n\n \n Let me teach you something, simone; contrary to your beliefs, you can't refute someone simply by screaming \"YOU'RE WRONG!!! YOU'RE WRONG!!!!\". So, if you know it all then why don't you tell us how it really is?", 
   {}, 
   348905, 
   null, 
   1239162540.0
  ], 
  [
   348961, 
   null, 
   "Penfold", 
   "How quickly you've forgotten that Obama was and still is friends with the Weathermen terrorist organization, and his preacher publicly supported anti-American positions and anti-white measures.\n\n \n How pathetic that you should be led to believe this empty twaddle.", 
   {}, 
   348883, 
   null, 
   1239201600.0
  ], 
  [
   348967, 
   null, 
   "NATO 556", 
   "How pathetic that you should be led to believe this empty twaddle.\n\n \n Calling the truth twaddle just makes you an ostrich with its head buried in the sand.\n \n You refuse to admit that Obama is a terrorist supporter who got campaign contributions and an endorsement from the middle east, who has ties and friendship with known terrorist organizations, and supports an anti-American agenda. You're full of nothing but twaddle.", 
   {}, 
   348961, 
   null, 
   1239205080.0
  ], 
  [
   349184, 
   null, 
   "Ethmi", 
   "How pathetic that you should be led to believe this empty twaddle.\n\n \n We've presented plenty of evidence on other forums that you've conveniently forgotten, but I won't bother presenting it because you'll just start trolling. So I'll just ask you, O wise one: if you know it all, then why don't you tell us what the truth is?", 
   {}, 
   348961, 
   null, 
   1239401880.0
  ], 
  [
   349228, 
   null, 
   "simone", 
   "Obama's 'Weatherman' Connection - Fact Checker\n \n obama weathermen - Yahoo! Search Results\n\n Um, did you happen to read those sources?\n \n And, by the way, how did you interpret the data?", 
   {}, 
   348908, 
   null, 
   1239472860.0
  ], 
  [
   349275, 
   null, 
   "OldSarge", 
   "Yea like the left even knows what truth is!", 
   {
    "post_info": {
     "post_title": "Or is this just another little right wing lie?"
    }
   }, 
   349184, 
   null, 
   1239556740.0
  ], 
  [
   349310, 
   null, 
   "Ethmi", 
   "Um, did you happen to read those sources?\n \n And, by the way, how did you interpret the data?\n\n \n Do you even know what thread you're posting on? I'll hoping for a yes, but if I hold my breath I might as well bury myself alive.", 
   {}, 
   349228, 
   null, 
   1239579600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Body Count", 
  "url": "http://www.4forums.com/political/gun-control-debates/12449-body-count.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12449, 
  "discussion_files": [
   [
    "12704.html", 
    "http://www.4forums.com/political/gun-control-debates/12449-body-count-print.html"
   ], 
   [
    "12705.html", 
    "http://www.4forums.com/political/gun-control-debates/12449-body-count-5-print.html"
   ], 
   [
    "12706.html", 
    "http://www.4forums.com/political/gun-control-debates/12449-body-count-4-print.html"
   ], 
   [
    "12707.html", 
    "http://www.4forums.com/political/gun-control-debates/12449-body-count-3-print.html"
   ], 
   [
    "12708.html", 
    "http://www.4forums.com/political/gun-control-debates/12449-body-count-2-print.html"
   ]
  ], 
  "identifier": 12449
 }
]