[
 [
  [
   347151, 
   null, 
   "Superlite27", 
   "Well, I've noticed that there are many arguments that liberals use to push their gun control agenda. After looking around the internet, I have found this compilation which kind of summarizes all their talking points into a list. This is nice in that it puts all their reasons on one page instead of them switching back and forth, dribbling them out a little at a time.\n \n 40 reasons to support gun control:\n \n 1) Banning guns works, which is why New York, DC, and Chicago cops need guns. \n \n 2) Washington DC's low murder rate of 80.6 per 100,000 is due to strict gun control, and Arlington, VA's high murder rate of 1.6 per 100,000 is due to the lack of gun control. \n \n 3) Statistics showing high murder rates justify gun control but statistics showing increasing murder rates after gun control are \"just statistics.\" \n \n 4) The Brady Bill and the Assault Weapons Ban, both of which went into effect in 1994, are responsible for the decrease in violent crime rates, which have been declining since 1991. \n \n 5) We must get rid of guns because a deranged lunatic may go on a shooting spree at any time and anyone who would own a gun out of fear of such a lunatic is paranoid. \n \n 6) The more helpless you are the safer you are from criminals. \n \n 7) An intruder will be incapacitated by a golf club or pepper spray, but if shot with a .357 Magnum, will get angry and kill you. \n \n 8) A woman raped and strangled is morally superior to a woman with a smoking gun and a dead rapist at her feet. \n \n 9) When confronted by violent criminals, you should \"put up no defense, give them what they want, or run\" (Handgun Control Inc. Chairman Pete Shields, Guns Don't Die - People Do, 1981, p. 125). \n \n 10) The New England Journal of Medicine is filled with expert advice about guns; just like Guns and Ammo has some excellent treatises on heart surgery.\n \n 11) One should consult an automotive engineer for safer seatbelts, a civil engineer for a better bridge, a surgeon for spinal paralysis, a computer programmer for hard drive problems, and Sarah Brady for firearms expertise. \n \n 12) The 2nd Amendment, ratified in 1791, refers to the National Guard, which was created by an act of Congress in 1903. \n \n 13) The National Guard, funded by the federal government, occupying property leased to the federal government, using weapons owned by the federal government, punishing trespassers under federal law, is a state militia. \n \n 14) These phrases,\" right of the people peaceably to assemble,\" \"right of the people to be secure in their homes,\" \"enumeration's herein of certain rights shall not be construed to disparage others retained by the people,\" and \"The powers not delegated herein are reserved to the states respectively, and to the people,\" all refer to individuals, but \"the right of the people to keep and bear arms\" refers to the state. \n \n 15) We don't need guns against an oppressive government, because the Constitution has internal safeguards, but we should ban and seize all guns, thereby violating the 2nd, 4th, and 5th amendments to that Constitution.\n \n 16) Rifles and handguns aren't necessary to national defense, which is why the army has millions of them. \n \n 17) Private citizens shouldn't have handguns, because they serve no military purpose, and private citizens shouldn't have \"assault rifles,\" because they are military weapons. \n \n 18) The ready availability of guns today, with waiting periods, background checks, fingerprinting, government forms, et cetera, is responsible for recent school shootings,compared to the lack of school shootings in the 40's, 50's and 60's, which resulted from the availability of guns at hardware stores, surplus stores, gas stations, variety stores, mail order, et cetera. \n \n 19) The NRA's attempt to run a \"don't touch\" campaign about kids handling guns is propaganda, and the anti-gun lobby's attempt to run a \"don't touch\" campaign is responsible social activity. \n \n 20) Guns are so complex that special training is necessary to use them properly, and so simple to use that they make murder easy. \n \n 21) A handgun, with up to 4 controls, is far too complex for the typical adult to learn to use, as opposed to an automobile that only has 20. \n \n 22) Women are just as intelligent and capable as men but a woman with a gun is \"an accident waiting to happen\" and gun makers' advertisements aimed at women are \"preying on their fears.\" \n \n 23) Ordinary people in the presence of guns turn into slaughtering butchers but revert to normal when the weapon is removed. \n \n 24) Guns cause violence, which is why there are so many mass killings at gun shows and shooting ranges.\n \n 25) A majority of the population supports gun control, just like a majority of the population supported owning slaves. \n \n 26) A self-loading small arm can legitimately be considered to be a \"weapon of mass destruction\" or an \"assault weapon.\" \n \n 27) Most people can't be trusted, so we should have laws against guns, which most people will abide by because they can be trusted. \n \n 28) The right of online pornographers to exist cannot be questioned because it is constitutionally protected by the Bill of Rights, but the use of handguns for self defense is not really protected by the Bill of Rights.\n \n 29) Free speech entitles one to own newspapers, transmitters, computers, and typewriters, but self-defense only justifies bare hands.\n \n 30) The ACLU is good because it uncompromisingly defends certain parts of the Constitution, and the NRA is bad, because it defends other parts of the Constitution. \n \n 31) John Sigler, as president of the NRA is a \"lobbyist\", but Paul Helmke, as president of The Brady Campaign to Prevent Gun Violence is a \"representative\".\n \n 32) Police operate with backup within groups, which is why they need larger capacity pistol magazines than do \"civilians\" who must face criminals alone and therefore need less ammunition. \n \n 33) We should ban \"Saturday Night Specials\" and other inexpensive guns because it's not fair that poor people have access to guns too. \n \n 34) Police officers, who qualify with their duty weapons once or twice a year, have some special Jedi-like mastery over handguns that private citizens can never hope to obtain. \n \n 35) Private citizens don't need a gun for self-protection because the police are there to protect them even though the Supreme Court says the police are not responsible for their protection. \n \n 36) Citizens don't need to carry a gun for personal protection but police chiefs, who are desk-bound administrators who work in a building filled with cops, need a gun. \n \n 37) \"Assault weapons\" have no purpose other than to kill large numbers of people, which is why the police need them but \"civilians\" do not. \n \n 38) When Microsoft pressures its distributors to give Microsoft preferential promotion, that's bad; but when the Federal government pressures cities to buy guns only from Smith & Wesson, that's good. \n \n 39) Trigger locks do not interfere with the ability to use a gun for defensive purposes, which is why you see police officers with one on their duty weapon. \n \n 40) When The Brady Campaign to Prevent Gun Violence says they want to \"keep guns out of the wrong hands,\" guess what...YOU have the wrong hands.", 
   {
    "post_info": {
     "post_title": "40 reasons to support gun control"
    }
   }, 
   null, 
   null, 
   1237168500.0
  ], 
  [
   347275, 
   null, 
   "daewoo", 
   "7) An intruder will be incapacitated by a golf club or pepper spray, but if shot with a .357 Magnum, will get angry and kill you.\n\n \n \n hehehehehe", 
   {}, 
   347151, 
   null, 
   1237310100.0
  ], 
  [
   347318, 
   null, 
   "Winston Smith", 
   "a liberal is a neoconservative who developed a social conscience :)", 
   {}, 
   347275, 
   null, 
   1237380360.0
  ], 
  [
   347323, 
   null, 
   "NATO 556", 
   "a liberal is a neoconservative who developed a social conscience :)\n\n \n Tell me, Mr. Smith, were those rocket launchers and other military weapons that were stolen from an Australian army base ever recovered?", 
   {}, 
   347318, 
   null, 
   1237391280.0
  ], 
  [
   347330, 
   null, 
   "Penfold", 
   "Tell me, Mr. Smith, were those rocket launchers and other military weapons that were stolen from an Australian army base ever recovered?\n\n \n \n Don't be silly, didn't you tell us the Mexican cartels bought them with American drug money?", 
   {}, 
   347323, 
   null, 
   1237393260.0
  ], 
  [
   347395, 
   null, 
   "Winston Smith", 
   "a neoconservative is a liberal who had a lobotomy :)", 
   {}, 
   347330, 
   null, 
   1237420320.0
  ], 
  [
   347398, 
   null, 
   "NATO 556", 
   "A liberal is someone who still believes in fairy tales.", 
   {}, 
   347395, 
   null, 
   1237420440.0
  ], 
  [
   347406, 
   null, 
   "Winston Smith", 
   "Don't be silly, didn't you tell us the Mexican cartels bought them with American drug money?\n\n \n \n it is NAFTA with a vengeance emoticon_xagree\n \n I am all for free trade.\n \n 5,000 persons died last year in narco wars. This year 1000 persons have died so far.\n \n a narco soldier is between 18-25 years of age and only a handful make it to 30. the average 'job' life is 3 years. there is an excellent retirement plan :p\n \n there are specialists who make the bodies dissapear. they dismember them and drop them in vats filled with acid\n \n Well, they have to thank the gringos for being 'employed'.", 
   {}, 
   347330, 
   null, 
   1237426680.0
  ], 
  [
   347408, 
   null, 
   "Winston Smith", 
   "A liberal is someone who still believes in fairy tales.\n\n \n like .... emoticon_xkill don't kill ? :p", 
   {}, 
   347398, 
   null, 
   1237426740.0
  ], 
  [
   347412, 
   null, 
   "NATO 556", 
   "like .... emoticon_xkill don't kill ?\n\n \n Do computers download and trade kiddie porn?", 
   {}, 
   347408, 
   null, 
   1237428300.0
  ], 
  [
   347464, 
   null, 
   "Superlite27", 
   "like .... emoticon_xkill don't kill ? :p\n\n \n \n Do matches burn down houses?\n \n I put a loaded gun on my coffee table. I'm watching it very closely, but so far, it hasn't jumped up and attempted to injure anyone, much less commit murder. Funny, it is also one of those evil \"assault weapons\". I've been waiting for it to assault me. No such luck. Yet....... I'm keeping a careful eye on it.", 
   {}, 
   347408, 
   null, 
   1237480500.0
  ], 
  [
   347469, 
   null, 
   "daewoo", 
   "a neoconservative is a liberal who had a lobotomy :)\n\n \n No, a neoconservative is a liberal who decided they were going to use the military to cram their social ideology down the worlds throat and damn the costs.", 
   {}, 
   347395, 
   null, 
   1237481640.0
  ], 
  [
   347522, 
   null, 
   "Penfold", 
   "No, a neoconservative is a liberal who decided they were going to use the military to cram their social ideology down the worlds throat and damn the costs.\n\n \n That's a fairly illiberal thing to do. ;)", 
   {}, 
   347469, 
   null, 
   1237499100.0
  ], 
  [
   347527, 
   null, 
   "daewoo", 
   "That's a fairly illiberal thing to do. ;)\n\n \n No, because they are making peoples lives BETTER....those who survive anyway. The rest are dead, so they dont really matter. \n \n You have to look at these things logically.", 
   {}, 
   347522, 
   null, 
   1237499400.0
  ], 
  [
   347566, 
   null, 
   "Winston Smith", 
   "you look but you don't see :)", 
   {}, 
   347527, 
   null, 
   1237510920.0
  ], 
  [
   347567, 
   null, 
   "Winston Smith", 
   "Do matches burn down houses?\n \n I put a loaded gun on my coffee table. I'm watching it very closely, but so far, it hasn't jumped up and attempted to injure anyone, much less commit murder. Funny, it is also one of those evil \"assault weapons\". I've been waiting for it to assault me. No such luck. Yet....... I'm keeping a careful eye on it.\n\n \n \n while you were waiting and using a match to light a cigarette did you have time to consider what is the purpose of a gun?\n \n Yes, it is a hard question. :p", 
   {}, 
   347464, 
   null, 
   1237511100.0
  ], 
  [
   347568, 
   null, 
   "Winston Smith", 
   "a neoconservative is a rich kid who listens to his conservative father rant nightly at the dinner table against 'socialists' and the 'radical left' while the government bails his failed bank out using hundreds of millions of taxpayers money while he pays himself a multimillion dollar pre-planned bonus for his 'performance' thanks to the income tax paid by the millions and millions of people living on meagre wages.\n \n ideology is passed on at the dinner table. :)", 
   {}, 
   347567, 
   null, 
   1237511400.0
  ], 
  [
   347569, 
   null, 
   "Winston Smith", 
   "a gun crazy is a kid who looked between his legs and decided that to compensate for it, he needed to buy a long barrel gun.\n \n just ask any shrink emoticon_smile", 
   {}, 
   347568, 
   null, 
   1237511580.0
  ], 
  [
   347570, 
   null, 
   "NATO 556", 
   "a gun crazy is a kid who looked between his legs and decided that to compensate for it, he needed to buy a long barrel gun.\n \n just ask any shrink emoticon_smile\n\n \n Ah, so this is the new face of the member formally known as Brady. He's the only one who results to that Dr. Joyce Brother's nonsense that all gun owners are compensating for sexual dysfunction.", 
   {}, 
   347569, 
   null, 
   1237512360.0
  ], 
  [
   347573, 
   null, 
   "Penfold", 
   "Ah, so this is the new face of the member formally known as Brady. He's the only one who results to that Dr. Joyce Brother's nonsense that all gun owners are compensating for sexual dysfunction.\n\n \n Resorts, not \"results\" and it is not ALL gun owners. emoticon_rolleyes", 
   {}, 
   347570, 
   null, 
   1237513740.0
  ], 
  [
   347575, 
   null, 
   "Ethmi", 
   "a gun crazy is a kid who looked between his legs and decided that to compensate for it, he needed to buy a long barrel gun.\n \n just ask any shrink emoticon_smile\n\n \n Then let's see you present a table for the average length and compare non-gun owner lengths to gun-owner lengths. :)", 
   {}, 
   347569, 
   null, 
   1237514160.0
  ], 
  [
   349237, 
   null, 
   "OldSarge", 
   "love what passes for logic and reasoning in a liberal.", 
   {
    "post_info": {
     "post_title": "Ya gotta"
    }
   }, 
   347575, 
   null, 
   1239475560.0
  ], 
  [
   349238, 
   null, 
   "OldSarge", 
   "And if the firearm owner happens to be female, then what? Penis envy I suppose.", 
   {
    "post_info": {
     "post_title": "Frage"
    }
   }, 
   349237, 
   null, 
   1239475620.0
  ], 
  [
   349284, 
   null, 
   "simone", 
   "No, because they are making peoples lives BETTER....those who survive anyway. The rest are dead, so they dont really matter. \n \n You have to look at these things logically.\n\n By Jove, I think you're being ironic here!\n \n I don't always catch on to irony, ya know.", 
   {}, 
   347527, 
   null, 
   1239564180.0
  ], 
  [
   349285, 
   null, 
   "simone", 
   "And if the firearm owner happens to be female, then what? Penis envy I suppose.\n\n No, dear. Penis control.\n \n I dunno. As a feminist, I figure most men can control their own penises and it's none of of my business but some women like absolute control over men.\n \n And they ain't feminists.\n \n We feminists just want control over ourselves.", 
   {}, 
   349238, 
   null, 
   1239564360.0
  ], 
  [
   349294, 
   null, 
   "OldSarge", 
   "Well the typical dance around the queation. My bad for not making it a simple yes or no.", 
   {
    "post_info": {
     "post_title": "And if the firearm owner happens to be female, then what?"
    }
   }, 
   349285, 
   null, 
   1239573240.0
  ], 
  [
   409922, 
   null, 
   "COBHC", 
   "41. A firearm is not a senior citizens best choice for self-defense, as the recoil may injure them. Hand-to-hand combat is a much safer option for seniors.\n \n 42. Gun laws are constantly being broken. More gun laws will solve this problem.\n \n 43. According to a study by Arthur Kellerman, a gun is 43 times more likely to be used against its owner than an attacker. Thus, the solution is to take guns from police, as that would stop police deaths and multiply the number of police by 43, and to give guns to criminals, as that would cut the number of criminals to 1/43 of what it is now.", 
   {
    "post_info": {
     "post_title": "I know this is an old thread, but..."
    }
   }, 
   347566, 
   null, 
   1281775800.0
  ], 
  [
   409937, 
   null, 
   "Doc Jones", 
   "Well the typical dance around the queation. My bad for not making it a simple yes or no.\n\n \n Welcome home Sarge. Looks like you made it just in time for the litter(ers) and short arms inspectors? emoticon_xhoho", 
   {}, 
   349294, 
   null, 
   1281798840.0
  ], 
  [
   409959, 
   null, 
   "Tither", 
   "Welcome home Sarge. Looks like you made it just in time for the litter(ers) and short arms inspectors? emoticon_xhoho\n\n No Doc, that post is a year and a half old. Ole Sarge is still AWOL!", 
   {}, 
   409937, 
   null, 
   1281828360.0
  ], 
  [
   409964, 
   null, 
   "Doc Jones", 
   "No Doc, that post is a year and a half old. Ole Sarge is still AWOL!\n\n \n \n Well DUH on me. I just figured the antis were locked in a time warp. :)", 
   {}, 
   409959, 
   null, 
   1281831360.0
  ], 
  [
   409965, 
   null, 
   "COBHC", 
   "Well DUH on me. I just figured the antis were locked in a time warp. :)\n\n \n I'm the one who bumped this thread. Sorry for the confusion.", 
   {}, 
   409964, 
   null, 
   1281835800.0
  ], 
  [
   410184, 
   null, 
   "Superlite27", 
   "It's still a good thing to be brought up as numbers 12 - 17 of the list have been officially rejected as a legitimate argument for gun control since that time.\n \n Keeping and bearing a firearm is now incorporated by the states as an individual right.\n \n Looks like that kooky collectivist argument has been given the lethal injection it deserved.\n \n When will the other nonsensical BS on this list get sent to the same place all the other farcical anti logic goes to?", 
   {}, 
   409965, 
   null, 
   1282251420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  40 reasons to support gun control", 
  "url": "http://www.4forums.com/political/gun-control-debates/12460-40-reasons-support-gun-control.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12460, 
  "discussion_files": [
   [
    "2279.html", 
    "http://www.4forums.com/political/gun-control-debates/12460-40-reasons-support-gun-control-print.html"
   ], 
   [
    "2280.html", 
    "http://www.4forums.com/political/gun-control-debates/12460-40-reasons-support-gun-control-3-print.html"
   ], 
   [
    "2281.html", 
    "http://www.4forums.com/political/gun-control-debates/12460-40-reasons-support-gun-control-2-print.html"
   ]
  ], 
  "identifier": 12460
 }
]