[
 [
  [
   347716, 
   null, 
   "Archangel", 
   "Here's where the money AIG paid to politicians before the financial collapse occurred. It is very telling about who has been in their pocket for years prior to this debacle taking place and explains why a blind eye has been turned toward holding them responsible for their failures. \n As long as everyone's talking today about AIG's payouts to its executives and foreign banks, let's remember the payouts AIG has made over the years to politicians. In the last 20 years American International Group (AIG) has contributed more than $9 million to federal candidates and parties through PAC and individual contributions. That's enough to rank AIG on OpenSecrets.org's Heavy Hitters list, which profiles the top 100 contributors of all time.\n \n Over time, AIG hasn't shown an especially partisan streak, splitting evenly the $9.3 million it has contributed since 1989. In the last election cycle, though, 68 percent of contributions associated with the company went to Democrats. Two senators who chair committees charged with overseeing AIG and the insurance industry, Sen. Chris Dodd (D-Conn.) and Sen. Max Baucus (D-Mont.), are among the top recipients of AIG contributions. Baucus chairs the Senate Finance Committee and has collected more money from AIG in his congressional career than from any other company--$91,000. And with more than $280,000, AIG has been the fourth largest contributor to Dodd, who chairs the Senate's banking committee. President Obama and his rival in last year's election, Sen. John McCain (R-Ariz.), are also high on the list of top recipients.\n \n AIG has been a personal investment for lawmakers, too. Twenty-eight current members of Congress reported owning stock in AIG in 2007, worth between $2.5 million and $3.3 million. Sen. John Kerry (D-Mass.), one of the richest members of Congress, was by far the biggest investor in AIG, with stock valued around $2 million.\n \n Last year AIG and its subsidiaries spent about $9.7 million on federal lobbying, or about $53,000 for every day Congress was in session in 2008. The company's spending on advocacy last year was down from an all-time high of $11.4 million spent on lobbying in 2007.OpenSecrets | Before the Fall, AIG Payouts Went to Washington - Capital Eye\n \n Regarding this 90% \"bonus\" tax on all employees who's companies have received in excess of 5 billion in bailout money; as wrong and offensive as these bonuses are, does anyone else see the problem with Congress targeting bonuses which were legally given according to the laws at the time? I have a real problem with that. \n \n The time to have made this stipulation was before the bill giving the bailout money was signed which many pundits pointed out at the time, only to be assured by the dems/administration that the issue had been dealt with. Of course we are now finding out from Chris Dodd that the administration contacted him specifically to remove that safeguard that was placed in the original bill.\n \n Of course Congress also signed the bailout bill without it having ever been read completely by ANYONE AT ALL from the President on down to the signers of it. Is this not an example of dereliction of duty of such massive proportions that it translates into an illegal if not unconstitutional misuse of the power we have afforded them as our elected representatives? And do we have no legal recourse apart from voting them out at the next election to hold them responsible for such irresponsible malfeasance? emoticon_angry", 
   {
    "post_info": {
     "post_title": "Before the Fall, AIG Payouts Went to Washington"
    }
   }, 
   null, 
   null, 
   1237662660.0
  ], 
  [
   347757, 
   null, 
   "Steeeeve", 
   "the \"bonus\" takes is really pushing the limits of the constitution and I'm guessing it is illegal since congress basically said it is to punish AIG. It probably won't get overruled but no one to blame for this but congress for being ###### in the first place. \n \n As for donations..no one cares because everyone knows congress is bought off.", 
   {}, 
   347716, 
   null, 
   1237695840.0
  ], 
  [
   347758, 
   null, 
   "Archangel", 
   "the \"bonus\" takes is really pushing the limits of the constitution and I'm guessing it is illegal since congress basically said it is to punish AIG. It probably won't get overruled but no one to blame for this but congress for being ###### in the first place.\n\n \n I agree, It is absolutely illegal imo. I can't wait to see how the Senate deals with it now since they have had time to hear constitutional lawyers speak on the wrongness of what the House did. If they follow suit and pass this bill they just confirm that both houses are corrupted and have no sense of ethics at all. I pray they will do the right thing.\n \n Another concern about this ridiculous tax is that lower and middle income earners in these companies which have received over 5 billion in bailout money, who actually deserve their annual bonuses and did nothing to cause this debacle, would also be charged this tax thereby hurting the little guy again.\n \n \n As for donations..no one cares because everyone knows congress is bought off.\n\n \n Just because we know that politicians are in the pocket of big business doesn't mean we don't care. I care. And I also know that not ALL politicians are taking money for reasons of quid pro quo in the process of doing their jobs legislating. The problem is finding them and keeping them that way.", 
   {}, 
   347757, 
   null, 
   1237700280.0
  ], 
  [
   347892, 
   null, 
   "Steeeeve", 
   "Just because we know that politicians are in the pocket of big business doesn't mean we don't care. I care. And I also know that not ALL politicians are taking money for reasons of quid pro quo in the process of doing their jobs legislating. The problem is finding them and keeping them that way.\nWell have fun caring...you aren't going to get anywhere. The only way you stop that is to have a change of moral character in the country. And yes, all of them are...just some worse than others. You should try talking to some powerful lobbyists about how they operate...you'd be amazed.", 
   {}, 
   347758, 
   null, 
   1237840440.0
  ], 
  [
   347911, 
   null, 
   "Archangel", 
   "Well have fun caring...you aren't going to get anywhere. The only way you stop that is to have a change of moral character in the country. And yes, all of them are...just some worse than others. You should try talking to some powerful lobbyists about how they operate...you'd be amazed.\n\n \n I don't disagree regarding lobbyists. They are a cancer on ethics and fairplay in the political system we are losing control of more each day. Here are some numbers you'll find interesting.\n \n Lobbying Database | OpenSecrets", 
   {}, 
   347892, 
   null, 
   1237864860.0
  ], 
  [
   347934, 
   null, 
   "Archangel", 
   "And here's more:\n \n The US has just lifted travel restriction to Iraq for the first time since the 2003 military invasion. As a result of this move more than 500 college students have booked vacations there over the upcoming and infamous SPRING BREAK VACATION WEEK. \n \n When asked about this, a White house spokesman said, and I quote: We don't see any difference between spending Spring Break in Iraq or the normal destination for college students which is Florida. After all, when all is said and done, half the kids will get bombed and the other half will get stoned. ouch!!! \n \n Sorry, I couldn't resist it. emoticon_smile", 
   {}, 
   347911, 
   null, 
   1237899300.0
  ], 
  [
   347967, 
   null, 
   "Easyrider", 
   "Fannie Mae Eases Credit To Aid Mortgage Lending \n \n By STEVEN A. HOLMES \n \n Published: Thursday, September 30, 1999 - The New York Times \n \n Fannie Mae Eases Credit To Aid Mortgage Lending - The New York Times\n \n In a move that could help increase home ownership rates among minorities and low-income consumers, the Fannie Mae Corporation is easing the credit requirements on loans that it will purchase from banks and other lenders.\n \n The action, which will begin as a pilot program involving 24 banks in 15 markets -- including the New York metropolitan region -- will encourage those banks to extend home mortgages to individuals whose credit is generally not good enough to qualify for conventional loans. Fannie Mae officials say they hope to make it a nationwide program by next spring.\n \n Fannie Mae, the nation's biggest underwriter of home mortgages, has been under increasing pressure from the Clinton Administration to expand mortgage loans among low and moderate income people and felt pressure from stock holders to maintain its phenomenal growth in profits.\n \n In addition, banks, thrift institutions and mortgage companies have been pressing Fannie Mae to help them make more loans to so-called subprime borrowers. These borrowers whose incomes, credit ratings and savings are not good enough to qualify for conventional loans, can only get loans from finance companies that charge much higher interest rates -- anywhere from three to four percentage points higher than conventional loans.\n \n ''Fannie Mae has expanded home ownership for millions of families in the 1990's by reducing down payment requirements,'' said Franklin D. Raines, Fannie Mae's chairman and chief executive officer. ''Yet there remain too many borrowers whose credit is just a notch below what our underwriting has required who have been relegated to paying significantly higher mortgage rates in the so-called subprime market.''\n \n Demographic information on these borrowers is sketchy. But at least one study indicates that 18 percent of the loans in the subprime market went to black borrowers, compared to 5 per cent of loans in the conventional loan market.\n \n In moving, even tentatively, into this new area of lending, Fannie Mae is taking on significantly more risk, which may not pose any difficulties during flush economic times. But the government-subsidized corporation may run into trouble in an economic downturn, prompting a government rescue similar to that of the savings and loan industry in the 1980's.\n \n ''From the perspective of many people, including me, this is another thrift industry growing up around us,'' said Peter Wallison a resident fellow at the American Enterprise Institute. ''If they fail, the government will have to step up and bail them out the way it stepped up and bailed out the thrift industry.''\n \n Under Fannie Mae's pilot program, consumers who qualify can secure a mortgage with an interest rate one percentage point above that of a conventional, 30-year fixed rate mortgage of less than $240,000 -- a rate that currently averages about 7.76 per cent. If the borrower makes his or her monthly payments on time for two years, the one percentage point premium is dropped.\n \n Fannie Mae, the nation's biggest underwriter of home mortgages, does not lend money directly to consumers. Instead, it purchases loans that banks make on what is called the secondary market. By expanding the type of loans that it will buy, Fannie Mae is hoping to spur banks to make more loans to people with less-than-stellar credit ratings.\n \n Fannie Mae officials stress that the new mortgages will be extended to all potential borrowers who can qualify for a mortgage. But they add that the move is intended in part to increase the number of minority and low income home owners who tend to have worse credit ratings than non-Hispanic whites.\n \n Home ownership has, in fact, exploded among minorities during the economic boom of the 1990's. The number of mortgages extended to Hispanic applicants jumped by 87.2 per cent from 1993 to 1998, according to Harvard University's Joint Center for Housing Studies. During that same period the number of African Americans who got mortgages to buy a home increased by 71.9 per cent and the number of Asian Americans by 46.3 per cent.\n In contrast, the number of non-Hispanic whites who received loans for homes increased by 31.2 per cent. \n \n Despite these gains, home ownership rates for minorities continue to lag behind non-Hispanic whites, in part because blacks and Hispanics in particular tend to have on average worse credit ratings.\n \n In July, the Department of Housing and Urban Development proposed that by the year 2001, 50 percent of Fannie Mae's and Freddie Mac's portfolio be made up of loans to low and moderate-income borrowers. Last year, 44 percent of the loans Fannie Mae purchased were from these groups.\n \n The change in policy also comes at the same time that HUD is investigating allegations of racial discrimination in the automated underwriting systems used by Fannie Mae and Freddie Mac to determine the credit-worthiness of credit applicants. (end of article)\n \n So there you have it. Thank you, Bill Clinton and all you bleeding heart liberals who again, lacked the foresight and wisdom needed to keep America strong.", 
   {
    "post_info": {
     "post_title": "Clinton Administration behind Fannie Mae Fiasco"
    }, 
    "unicode_changes_made": true
   }, 
   347934, 
   null, 
   1237936080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Before the Fall, AIG Payouts Went to Washington", 
  "url": "http://www.4forums.com/political/politics-debates/12472-before-fall-aig-payouts-went-washington.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12472, 
  "discussion_files": [
   [
    "2046.html", 
    "http://www.4forums.com/political/politics-debates/12472-before-fall-aig-payouts-went-washington-print.html"
   ]
  ], 
  "identifier": 12472
 }
]