[
 [
  [
   349063, 
   null, 
   "Symbiote", 
   "As usual, LewRockwell.com has pointed me to a truly fascinating article.\n \n I want to share the article primarily because it is immensely interesting. This is a man I truly admire.\n \n Personally I'd only come across him previously due to his influence on science fiction - (a Dyson sphere, his idea, being a ball wrapped around a sun to absorb all the energy it spits out, being somewhat prevalent)\n \n http://www.nytimes.com/2009/03/29/magazine/29Dyson-t.html?_r=2\n \n Of secondary importance;\n \n I'm appalled that people would smear this man of all people, a living genius, for his beliefs. Scientific enquiry should be rational, not some garbage about who supposedly is in the pay of who.\n \n I want to highlight that it is possible to be a person of great integrity, and still disagree about such things. Have we become so mad that we cannot tolerate dissent on such matters?", 
   {
    "post_info": {
     "post_title": "Freeman Dyson"
    }
   }, 
   null, 
   null, 
   1239276120.0
  ], 
  [
   349066, 
   null, 
   "Jo Bennett", 
   "Seems to me that his solutions, while interesting, are more science fiction than science, and the \"innovate our way out of the problem\" is a well worn path, and not a particularly convincing one.\n \n My concern is that he's about as qualified as Stephen Hawking to comment on climate change, and it appears that he has scant regard, coming from a branch of physics reliant on experiment, for modelling ongoing situations, as climatology necessarily must.\n \n That said, there is a lot of food for thought in what he says about the cheapness and abundance of coal and its use in the development of India and China. I can't fault either country for pursuing the same development path as the west, and if we're going to deal with climate change we're going to have to develop and supply alternative technology at coal-comparable prices.\n \n I also find it rather depressing that he uses the Y2K bug as an example of incorrect prediction, because actually it's a perfect example of early and decisive action mitigating a problem.", 
   {}, 
   349063, 
   null, 
   1239281940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Freeman Dyson", 
  "url": "http://www.4forums.com/political/environmental-debates/12532-freeman-dyson.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 12532, 
  "discussion_files": [
   [
    "5486.html", 
    "http://www.4forums.com/political/environmental-debates/12532-freeman-dyson-print.html"
   ]
  ], 
  "identifier": 12532
 }
]