[
 [
  [
   349435, 
   null, 
   "Cyberateos", 
   "If a 22 month baby could not survive out of its natural incubator (the womb), but it can survive into an artifitial incubator, is not that baby really a fetus?\n \n If a nurse who cares for a baby into an incubator kills it, she is locked in jail. Why should not be punished equally too a mother who has killed her 22 month fetus?\n \n WOMB = INCUBATOR\n \n NURSE = MOTHER\n \n FETUS = BABY INTO AN INCUBATOR\n \n Pregnant mother is not an incubator; her womb is. That mother has a brain, an adult brain, just as the nurse. Both should be punished if they attack the highly dependant baby.", 
   {
    "post_info": {
     "post_title": "Are premature newborns a kind of fetuses?"
    }
   }, 
   null, 
   null, 
   1239670440.0
  ], 
  [
   349458, 
   null, 
   "jyoshu", 
   "Good question. \n \n It seems for some, the birth canal somehow magically transforms the unborn into a person. One minute it's not a person, the next, it is! emoticon_xangel", 
   {}, 
   349435, 
   null, 
   1239681540.0
  ], 
  [
   349480, 
   null, 
   "chester", 
   "Good question. \n \n It seems for some, the birth canal somehow magically transforms the unborn into a person. One minute it's not a person, the next, it is! emoticon_xangel\n\n \n Among other things, the newborn must obtain its own oxygen and its own nourishment. It must also transition from an aquatic environment to an aerobic one.\n \n Those are significant enough changes in and of themselves as to be transforming.\n \n Be that as it may, the central question still remains. \n \n Who is better able to determine the future of a particular woman's pregnancy, the nanny state or the woman herself?\n \n All other issues are subordinated to that one.emoticon_xgood", 
   {
    "post_info": {
     "post_title": "Choice - an all-American family value!"
    }
   }, 
   349458, 
   null, 
   1239713160.0
  ], 
  [
   349481, 
   null, 
   "chester", 
   "If a 22 month baby could not survive out of its natural incubator (the womb), but it can survive into an artifitial incubator, is not that baby really a fetus?\n \n If a nurse who cares for a baby into an incubator kills it, she is locked in jail. Why should not be punished equally too a mother who has killed her 22 month fetus?\n \n \n\n \n 22 month fetus, eh?\n \n Are we talking pachyderms here?emoticon_smile", 
   {
    "post_info": {
     "post_title": "Choice - an all-American family value!"
    }
   }, 
   349435, 
   null, 
   1239713220.0
  ], 
  [
   349526, 
   null, 
   "Cyberateos", 
   "Chester:\n \n Ha, ha... English is not my mother language. 22 week fetus is what I wanted to say.\n \n Jyoshu:\n \n \nIt seems for some, the birth canal somehow magically transforms the unborn into a person. One minute it's not a person, the next, it is!\n\n \n Really. For that reason, we, antiabortion atheists, hold that abortionist are really religious nuts who believe that a soul exists and penetrates into a body along with the first air breathing.\n \n Chester:\n \n \nAmong other things, the newborn must obtain its own oxygen and its own nourishment. It must also transition from an aquatic environment to an aerobic one.\n\n \n What if a newborn has to use a device to obtain oxygen, and probes to obtain nourishment? Is not the duty of a nurse to provide them? Should not be also a duty of a pregnant women even to eat adequate meals in order to support her baby?\n \n \n \nThose are significant enough changes in and of themselves as to be transforming.\n\n \n That changes are not relevant, because to be highly dependant is an aggravant circumstance of an attack. If Mike Tyson were connected to artifitial respirators, even a teenager could kick his XXX.\n \n \nBe that as it may, the central question still remains. \n Who is better able to determine the future of a particular woman's pregnancy, the nanny state or the woman herself?\n\n \n What is a \"pregnancy\"?\n \n \nAll other issues are subordinated to that one\n\n \n A pregnancy implies PARENTAL DUTIES towards intrauterine offspring.\n \n As well as a civilized State forces a divorced man to pay some money for his children, that State also should force a pregnant woman to care for the health of the fetal person.\n \n Even, some baby carrier mothers have been legally punished because they have consumed cocanie, harming the fetal minor.", 
   {}, 
   349435, 
   null, 
   1239734100.0
  ], 
  [
   349555, 
   null, 
   "simone", 
   "if a 22 month baby could not survive out of its natural incubator (the womb), but it can survive into an artifitial incubator, is not that baby really a fetus?\n \n If a nurse who cares for a baby into an incubator kills it, she is locked in jail. Why should not be punished equally too a mother who has killed her 22 month fetus?\n \n Womb = incubator\n \n nurse = mother\n \n fetus = baby into an incubator\n \n pregnant mother is not an incubator; her womb is. That mother has a brain, an adult brain, just as the nurse. Both should be punished if they attack the highly dependant baby.\n\n woman = incubator\n \n woman < human person", 
   {}, 
   349435, 
   null, 
   1239743700.0
  ], 
  [
   349564, 
   null, 
   "Cyberateos", 
   "simone:\n \n \nwoman = incubator\n \n woman < human person\n\n \n \n You are using a common \"strawman`s fallacy\".\n \n If women were not human persons, but incubators, they should not be punished if they would kill the fetuses.\n \n A mechanical incubator is not punished if a nurse kills the baby she should care. The nurse is who is punished, because she has an adult brain.", 
   {}, 
   349555, 
   null, 
   1239745080.0
  ], 
  [
   349643, 
   null, 
   "jyoshu", 
   "Among other things, the newborn must obtain its own oxygen and its own nourishment. It must also transition from an aquatic environment to an aerobic one.\n\n \n So, if a baby is having trouble breathing that's been born already, you don't consider it a 'person'? Methinks you've not thought through the implications of your argument here at all.\n \n \nBe that as it may, the central question still remains. Who is better able to determine the future of a particular woman's pregnancy, the nanny state or the woman herself?\n\n \n A woman who has an abortion out of convenience or as just a form of after-the-act birth control is hardly exercising determination of what constitutes a person, at all. She just wants out with no regard for the baby. People like myself don't so much have a problem with choice if your movement will at least acknowledge and show the value of the life growing inside that will be a child, adolescent, and adult rather than ONLY focusing on the mother as if the fetus has no relevance or value whatsoever. We just want to save lives of those needlessly killed.", 
   {}, 
   349480, 
   null, 
   1239814560.0
  ], 
  [
   349657, 
   null, 
   "simone", 
   "22 month fetus, eh?\n \n Are we talking pachyderms here?emoticon_smile\n\n Chester, thank you for catching this outlandishly wrong statement.\n \n It did not occur to me that anyone could be so ignorant of the term of a human pregnancy and I failed to see that major, major bit of medical and scientific ignorance.", 
   {}, 
   349481, 
   null, 
   1239820560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are premature newborns a kind of fetuses?", 
  "url": "http://www.4forums.com/political/abortion-debates/12551-premature-newborns-kind-fetuses.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 12551, 
  "discussion_files": [
   [
    "317.html", 
    "http://www.4forums.com/political/abortion-debates/12551-premature-newborns-kind-fetuses-print.html"
   ]
  ], 
  "identifier": 12551
 }
]