[
 [
  [
   349610, 
   null, 
   "jazyjason", 
   "Des Moines, Iowa) Police in Des Moines, Iowa are investigating death threats against openly gay state lawmaker Sen. Matt McCoy (D).UPDATE: Death threats also have been made against Senate Majority Leader Mike Gronstal (D) and House Speaker Pat Murphy (D).\n \n McCoy met with the Iowa State Patrol at the Capitol but declined to give specifics to the media except to confirm he had been threatened with death.\n \n \"That's all I can say, I've been threatened,\" McCoy told reporters when he emerged from the meeting.\n \n Because the threats were made outside the Capitol, the investigation has been turned over to the Des Moines police department.\n \n The threats came as emotions by opponents of same-sex marriage escalated following the April 3 Iowa Supreme Court ruling legalizing same-sex marriage.\n \n McCoy also is the sponsor of a bill that would have made marriage gender neutral in the state. The bill became moot after the high court ruling.\n \n Following the threat against the senator, the State Patrol issued an advisory to all lawmakers that if they receive similar threats through their legislative e-mail accounts or on Statehouse phones, to notify them. But the advisory said if the threats are made on a personal telephone or at their homes they should call their local law enforcement.\n \n Monday, security at the Capitol was tight as several hundred gay marriage foes demonstrated. The protest was organized by the Iowa Christian Alliance, the Iowa Family Policy Center and Everyday America.\n \n The demonstrators demanded lawmakers take up a constitutional amendment to ban same-sex marriage.\n \n Last week the Democratically-controlled Legislature turned back two Republican attempts to bring the amendment to a vote. GOP lawmakers will take another stab at it this week.\n \n It is expected to fail, but despite the setbacks for gay foes conservatives say there is still a way they can kill the state Supreme Court ruling - through a Constitutional Convention.\n \n Once every decade, Iowa voters can decide whether to hold a convention. The question is scheduled to go on the ballot in November 2010 and needs only a simple majority.\n \n Conservatives believe that if a Constitutional Convention is approved, they can convince delegates to vote for an amendment limiting marriage to opposite-sex couples.\n \n If voters approve holding a convention, and if enough delegates can be convinced to amend the constitution, the question could be put to voters in a special election, possibly in 2011.\n \n On April 3, the Supreme court ruled that \"[t]he Iowa statute limiting civil marriage to a union between a man and a woman violates the equal protection clause of the Iowa Constitution.\"\n \n The court also discounted civil unions as an alternative to marriage.\n \n \"A new distinction based on sexual orientation would be equally suspect and difficult to square with the fundamental principles of equal protection embodied in our constitution,\" the ruling said.", 
   {
    "post_info": {
     "post_title": "Death threats against gay lawmaker following Iowa ruling"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1239761700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Death threats against gay lawmaker following Iowa ruling", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12560-death-threats-against-gay-lawmaker-following-iowa-ruling.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12560, 
  "discussion_files": [
   [
    "14840.html", 
    "http://www.4forums.com/political/gay-rights-debates/12560-death-threats-against-gay-lawmaker-following-iowa-ruling-print.html"
   ]
  ], 
  "identifier": 12560
 }
]