[
 [
  [
   349990, 
   null, 
   "jazyjason", 
   "By The Associated Press\n 04.17.2009 5:32pm EDT\n \n (New York City) When Harvey Milk attended high school in suburban Long Island in the 1940s, and later taught math and history and coached basketball there, he kept his sexuality a well-guarded secret.\n \n \"Like most men of his generation,\" biographer Randy Shilts wrote in The Mayor of Castro Street, \"Milk assiduously stuck to the double life he had carefully followed since his high school days.\"\n \n More than half a century later, the Long Island Gay, Lesbian, Bisexual, and Transgender Services Network will honor the slain gay-rights activist posthumously to draw attention to gays and lesbians with small-town roots. Milk's nephew, Stuart Milk, will accept the award for his uncle on Saturday.\n \n \"Things have changed dramatically since the late 1940s when Harvey Milk graduated from high school,\" said David Kilmnick, founder of the network of three organizations. \"But there's a lot more to be done.\"\n \n Milk, the focus of renewed attention this year when the biographical film \"Milk\" won two Oscars, became one of the country's first openly gay elected officials when he was elected to the San Francisco Board of Supervisors in 1977.\n \n In November 1978, Milk and San Francisco Mayor George Moscone were fatally shot by Dan White, a disgruntled former city supervisor. Milk was 48.\n \n Since the days when Milk was growing up in the shadow of New York City, there's no question life for gay men and women on Long Island, home to more than 2.8 million people, has improved in many ways.\n \n Many gays and lesbians say they feel comfortable enough to live openly. Still, they add, not everyone welcomes that openness.\n \n During his senior year at Bay Shore High School, which counts Milk among its alumni, Erik Normandin came out.\n \n \"Everyone was pretty much OK with it,\" the 18-year-old recalled, except his ex-girlfriend's family. \"They told me it was disgusting,\" said Normandin, who graduated in 2008.\n \n Since then, Normandin has had no qualms about holding another guy's hand at the mall or on the street, but the manager of a restaurant that markets itself as a family establishment once asked him to stop or leave, and a customer complained.\n \n \"I'm very surprised how many people on Long Island are accepting of it,\" Normandin said. \"I thought they'd have more resistance.\"\n \n Normandin didn't rule out settling in Long Island after college but he was unsure whether his career goal of working in stage lighting and design will take him elsewhere.\n \n One of the goals of Kilmnick's organization is to get Normandin and other suburban and rural gays and lesbians to live openly gay lives and create friendlier environments in their hometowns, rather than flock to gay meccas like New York, San Francisco and Atlanta.\n \n That was partly the point of the posthumous award to Milk, he said.\n \n \"We need to keep some of that in suburban and rural America, if we truly want to see full equality,\" Kilmnick said.\n \n When Milk was elected, he was only the fifth openly gay U.S. elected official, according to Denis Dison, a spokesman for the Gay & Lesbian Victory Fund, a political action committee.\n \n Today there are 427 openly gay elected officials, Dison said, and more than three-quarters of them serve at the local level. \"In the last few years there have been folks who did not leave their towns and go to the coastal cities,\" he said.\n \n When Kilmnick and his partner of eight years moved into their Long Island home in 2003, a neighbor dropped by to welcome them to the neighborhood.\n \n \"She asked, `Oh, where's your wife?'\" Kilmnick said. He then introduced her to his male partner, Robert. \"This was six years ago and we haven't seen her since,\" he said.\n \n Still, Kilmnick said, there's tangible evidence things have changed since Milk lived in Long Island. There are 67 gay-straight alliances in Long Island schools, he said, and last year, more than 40,000 students participated in National Coming Out Day.", 
   {
    "post_info": {
     "post_title": "LI gays to honor Harvey Milk"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1240059960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  LI gays to honor Harvey Milk", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12570-li-gays-honor-harvey-milk.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12570, 
  "discussion_files": [
   [
    "20324.html", 
    "http://www.4forums.com/political/gay-rights-debates/12570-li-gays-honor-harvey-milk-print.html"
   ]
  ], 
  "identifier": 12570
 }
]