[
 [
  [
   350170, 
   null, 
   "Cyberateos", 
   "Melissa Huckaby cries at hearing over girl in suitcase murder and rape trial\n By staff writers\n NEWS.com.au\n April 16, 2009 09:29am\n \n \n \n ... Melissa Huckaby appears in court accused of raping and murdering a girl / AP \n Woman appears in court over girl's murder \n Victim was allegedly raped with foreign object \n Body found in suitcase dumped in pond\n A SUNDAY school teacher accused of raping and murdering a girl and leaving the body in a suitcase has cried during her first court appearance.\n \n In a red jumpsuit and shackles Melissa Huckaby, 28, trembled and cried as the judge read out the charges against her in a San Joaquin County courtroom in California, Associated Press reports.\n \n Ms Huckaby has been charged with murdering eight-year-old Sandra Cantu, whose body was found in a suitcase pulled from a pond.\n \n Family members of Ms Huckaby and Sandra were also in attendance at the hearing and some were observed softly crying during proceedings.\n \n Prosecutors have included an extra charge against Ms Huckaby the special circumstances of rape with a foreign object, lewd and lascivious conduct with a child and murder in the course of a kidnapping, AP reported. \n \n \n Ms Huckaby was a volunteer Sunday school teacher at her grandfather's Clover Road Baptist Church and lived in the mobile home park in the northern California town of Tracy where Sandra also lived, AP reported. \n \n \n Security camera video footage of the girl showed her skipping through her neighbourhood shortly before her disappearance. \n \n The suitcase containing her body - which Ms Huckaby claimed had been stolen from her - was recovered from an irrigation pond on April 6. \n \n Ms Huckaby had previously told the local media that her five-year-old daughter had been playing with Sandra on the day of her disappearance.", 
   {
    "post_info": {
     "post_title": "Pro Choicers: do you support this choice?"
    }
   }, 
   null, 
   null, 
   1240113960.0
  ], 
  [
   350251, 
   null, 
   "simone", 
   "Are you arguing that Sandra Cantu was an aborted fetus?\n \n How grotesque!", 
   {}, 
   350170, 
   null, 
   1240162800.0
  ], 
  [
   350267, 
   null, 
   "Cyberateos", 
   "Sandra Cantu was a minor\n \n A fetal person is a minor too", 
   {}, 
   350251, 
   null, 
   1240167420.0
  ], 
  [
   350269, 
   null, 
   "simone", 
   "What is a person?", 
   {}, 
   350267, 
   null, 
   1240168200.0
  ], 
  [
   350372, 
   null, 
   "Cyberateos", 
   "Simone:\n \n A person is an animal belonging to Homo sapies specie.\n \n \n Really, that is an antropocentrist definition, of course. Probably domestic dogs could be considered persons too.", 
   {}, 
   350269, 
   null, 
   1240244340.0
  ], 
  [
   350387, 
   null, 
   "simone", 
   "Um... And do you consider domestic dogs and fetuses to be more like persons than women?", 
   {}, 
   350372, 
   null, 
   1240251840.0
  ], 
  [
   350394, 
   null, 
   "Cyberateos", 
   "Simone:\n \n \nUm... And do you consider domestic dogs and fetuses to be more like persons than women?\n\n \n Please avoid the use of strawman`s fallacies.", 
   {}, 
   350387, 
   null, 
   1240254180.0
  ], 
  [
   350963, 
   null, 
   "simone", 
   "You are attempting to evade my line of questioning.", 
   {}, 
   350394, 
   null, 
   1240602840.0
  ], 
  [
   351016, 
   null, 
   "Cyberateos", 
   "Some dogs may deserve more right than some men and some women.\n \n Even some dogs are trained to attack undesirable persons.", 
   {}, 
   350963, 
   null, 
   1240623900.0
  ], 
  [
   351017, 
   null, 
   "Roesgen08", 
   "I oppose late term abortions and this thread is one of the worst arguments I've ever seen. \n \n A murderer commits murder, ergo abortion is wrong.\n \n Rene Descartes, you are not.", 
   {}, 
   351016, 
   null, 
   1240624740.0
  ], 
  [
   351097, 
   null, 
   "simone", 
   "Some dogs may deserve more right than some men and some women.\n \n Even some dogs are trained to attack undesirable persons.\n\n And, Cybererratus, I suppose that women are \"undesirable persons.\"", 
   {}, 
   351016, 
   null, 
   1240679460.0
  ], 
  [
   351098, 
   null, 
   "simone", 
   "I oppose late term abortions and this thread is one of the worst arguments I've ever seen. \n \n A murderer commits murder, ergo abortion is wrong.\n \n Rene Descartes, you are not.\n\n Actually, I appreciate your statement. Why do you, personally, oppose late-term abortions?\n \n By the way, I also oppose such abortions unless medically necessary or for some other extremely presseing reason.\n \n I am also rabidly pro-choice until the point a fetus reaches a point of viability outside the womb. The issues of rights for the fetus begins to arise.", 
   {}, 
   351017, 
   null, 
   1240679700.0
  ], 
  [
   351111, 
   null, 
   "Roesgen08", 
   "Actually, I appreciate your statement. Why do you, personally, oppose late-term abortions?\n \n\n \n People can make mistakes. Maybe a person gets pregnant and doesn't realize it. Then when human life, is merely a clump of cells and the mother cannot really be faulted beyond a reasonable doubt, then it is fair enough to have an abortion.\n \n However, once it becomes obvious to a mother that she's pregnant and she's waited months for the fetus to develop, then she's at fault for negligence. Allowing the life to grow inside of her basically on a whim, treating life with no respect. At that point, there is no reason to sympathize with her negligence and the fetus has grown to a point where it is far more than a clump of cells and resembles a human being. As you say, in many cases in can survive outside of the womb. \n \n My preference is to set the cut off date at around 3 months from inception. That would be my deadline to get an abortion. I would rather see late term abortion completely banned.", 
   {}, 
   351098, 
   null, 
   1240688400.0
  ], 
  [
   351112, 
   null, 
   "Lakrite", 
   "Some dogs may deserve more right than some men and some women.\n \n Even some dogs are trained to attack undesirable persons.\n\n Some dogs should have more rights than some people...I am afraid that I don't agree with you on that...I would never put a dog above a human. That is absurd. Are you sure you aren't a member of PETA in disguise? They often put animals above humans too.", 
   {}, 
   351111, 
   null, 
   1240688580.0
  ], 
  [
   351123, 
   null, 
   "Cyberateos", 
   "And, Cybererratus, I suppose that women are \"undesirable persons.\"\n\n \n \n May you avoid the use of strawman`s fallacies?\n \n Be honest, please.", 
   {}, 
   351097, 
   null, 
   1240692060.0
  ], 
  [
   351124, 
   null, 
   "Cyberateos", 
   "Lakrite:\n \n Do you know what is specieism?", 
   {}, 
   351123, 
   null, 
   1240692240.0
  ], 
  [
   351131, 
   null, 
   "Lakrite", 
   "You mean speciesism? It looks like you ARE a member of PETA after all...emoticon_rolleyes", 
   {}, 
   351124, 
   null, 
   1240693620.0
  ], 
  [
   351139, 
   null, 
   "Cyberateos", 
   "Lakrite:\n \n If you are not fetusphobous but you are specieist, then you are being discriminatory.", 
   {}, 
   351131, 
   null, 
   1240694820.0
  ], 
  [
   351144, 
   null, 
   "Lakrite", 
   "I don't believe that a dog will ever have more value than a human. Sorry. If I had to choose between saving a dog or a human, I would always choose the human.\n \n Speciesism is a ridiculous theory. Why should animals and humans be equal? I am somehow racist because I believe a human child has more rights than a chimp or parrot?", 
   {}, 
   351139, 
   null, 
   1240696860.0
  ], 
  [
   351147, 
   null, 
   "Cyberateos", 
   "Lakrite:\n \n \nI don't believe that a dog will ever have more value than a human. Sorry. If I had to choose between saving a dog or a human, I would always choose the human.\n\n \n Are you sure? If a dog, a pet that is loved by your 5 year daughter, and a psychotic murderer who has killed lots of children, both, are in danger to die, who would you choose to save?\n \n \nSpeciesism is a ridiculous theory. \n\n \n Some persons say that to consider fetus humans is ridiculous too.\n \n \nWhy should animals and humans be equal? \n\n \n Why not?\n \n \n \nI am somehow racist because I believe a human child has more rights than a chimp or parrot?\n\n \n Yes, you would be. Genetically, you would be. Bible could affirmate that men are the kings of the world, but Biblie is being increasingly lesser accepted as a moral guide.", 
   {}, 
   351144, 
   null, 
   1240698120.0
  ], 
  [
   351153, 
   null, 
   "chester", 
   "Why are we feeding this troll?emoticon_angry", 
   {
    "post_info": {
     "post_title": "Choice - an all-American family value!"
    }
   }, 
   351147, 
   null, 
   1240704300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Pro Choicers: do you support this choice?", 
  "url": "http://www.4forums.com/political/abortion-debates/12576-pro-choicers-do-you-support-choice.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 12576, 
  "discussion_files": [
   [
    "13813.html", 
    "http://www.4forums.com/political/abortion-debates/12576-pro-choicers-do-you-support-choice-print.html"
   ], 
   [
    "13814.html", 
    "http://www.4forums.com/political/abortion-debates/12576-pro-choicers-do-you-support-choice-2-print.html"
   ]
  ], 
  "identifier": 12576
 }
]