[
 [
  [
   350065, 
   null, 
   "foundit66", 
   "Some Iowa county recorders say they have contemplated refusing to give a marriage license to gay couples who walk into the office, but so far none is vowing to do so.\n \n \"This is putting us in a very, very difficult position here,\" Wayne County Recorder Angela Horton said Thursday in an interview. \"But sometimes you have to put aside your personal beliefs, your religious beliefs, when you're doing a job you've sworn under oath to provide.\"\n \n After hearing rumblings of discontent, a state official sent a strongly worded note to all recorders Thursday explaining why they should obey the Iowa Supreme Court ruling legalizing same-sex marriage when it takes effect April 27.\n \n Victoria Hutton of the Iowa Department of Public Health informed recorders that the ruling has the force of law statewide: \"All county recorders in the state of Iowa are required to comply with the Varnum decision ... and to issue marriage licenses to same sex couples in the same manner as licenses issued to opposite gender applicants.\"\n \n Republican state senators on Thursday crafted a new proposal that would give recorders an out if their religion is opposed to gay marriage, but Senate Democratic Leader Mike Gronstal scorned it as \"blatantly unconstitutional.\"State to counties: Obey gay marriage ruling, issue certificates | DesMoinesRegister.com | The Des Moines Register\n \n Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\n \n Do your job, or get out of the office.\n Why is it any more special for a \"Christian\" to have a \"religious\" belief against homosexuality, as opposed to a NON-Christian having a \"non-religious\" belief against homosexuality???", 
   {
    "post_info": {
     "post_title": "State to counties: Obey gay marriage ruling, issue certificates"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1240083000.0
  ], 
  [
   350083, 
   null, 
   "jyoshu", 
   "Some Iowa county recorders say they have contemplated refusing to give a marriage license to gay couples who walk into the office, but so far none is vowing to do so.\n \n &#8220;This is putting us in a very, very difficult position here,&#8221; Wayne County Recorder Angela Horton said Thursday in an interview. &#8220;But sometimes you have to put aside your personal beliefs, your religious beliefs, when you&#8217;re doing a job you&#8217;ve sworn under oath to provide.&#8221;\n \n After hearing rumblings of discontent, a state official sent a strongly worded note to all recorders Thursday explaining why they should obey the Iowa Supreme Court ruling legalizing same-sex marriage when it takes effect April 27.\n \n Victoria Hutton of the Iowa Department of Public Health informed recorders that the ruling has the force of law statewide: &#8220;All county recorders in the state of Iowa are required to comply with the Varnum decision &#8230; and to issue marriage licenses to same sex couples in the same manner as licenses issued to opposite gender applicants.&#8221;\n \n Republican state senators on Thursday crafted a new proposal that would give recorders an out if their religion is opposed to gay marriage, but Senate Democratic Leader Mike Gronstal scorned it as &#8220;blatantly unconstitutional.&#8221;State to counties: Obey gay marriage ruling, issue certificates | DesMoinesRegister.com | The Des Moines Register\n \n Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\n \n Do your job, or get out of the office.\n Why is it any more special for a \"Christian\" to have a \"religious\" belief against homosexuality, as opposed to a NON-Christian having a \"non-religious\" belief against homosexuality???\n\n \n But let me guess ... if they step down RIGHT after they find they will have to issue to gay couples, you'd be in favor of them being able to be sued for it, simply because the \"discrimination\" in such an event was toward gays? Right? At least if you are consistent with your stance elsewhere in regards to 'timing' ... emoticon_rolleyes\n \n Anyway, aside from that inconsistency with your position elsewhere, I agree that county officials should need to comply. After all, there are probably OTHER examples whereby county officials have to do things that they are religiously against, such as issue divorce papers. Or marry some drunk couple that they know aren't really being serious even though they're tying the knot ... If all county officials could just refuse to do their job because of their objections--for WHATEVER reasons--it would be a collosal mess.", 
   {}, 
   350065, 
   null, 
   1240088580.0
  ], 
  [
   350086, 
   null, 
   "foundit66", 
   "But let me guess ... if they step down RIGHT after they find they will have to issue to gay couples, you'd be in favor of them being able to be sued for it, simply because the \"discrimination\" in such an event was toward gays? Right? At least if you are consistent with your stance elsewhere in regards to 'timing' ... emoticon_rolleyes\n\n What the heck are you talking about?\n Oh wait. You're trying to compare THIS issue to the denial of service for the gay pavilion.\n (You still haven't found the capacity to understand what my argument is in that other case, have you...)\n \n Go back to that thread and try to argue your failed point there.\n I personally don't see a point in \"suing\" an individual clerk who refuses to do their job and quits, as long as the office maintains the capability to have somebody to replace them to DO THE JOB.\n \n The thing you fail to recognize (well, one amongst many emoticon_rolleyes ) is that for the pavilion, the pavilion was ultimately ENTIRELY denied.\n Here, as long as somebody fills the marriage license and the office takes care of people who refuse to do their job, I have no major issue...\n \n \n \nAnyway, aside from that inconsistency with your position elsewhere...\n\n And your cowardice in not addressing that elsewhere, but instead trying to snipe away by applying it in other threads where it doesn't belong... :xbanghead\n \n \n \nI agree that county officials should need to comply.\n\n Good for you.\n Now, do you have any answer to the question I originally asked?\n (I know, I know. Of course you don't like to answer straight-forward questions, but I gotta try. Hope springs eternal! emoticon_xangel )\n \n Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\n \n Why is it any more special for a \"Christian\" to have a \"religious\" belief against homosexuality, as opposed to a NON-Christian having a \"non-religious\" belief against homosexuality???\n \n \n \n \nAfter all, there are probably OTHER examples whereby county officials have to do things that they are religiously against, such as issue divorce papers.\n\n Gee.\n Sounds like one of my arguments you keep ignoring... emoticon_rolleyes", 
   {}, 
   350083, 
   null, 
   1240089540.0
  ], 
  [
   350098, 
   null, 
   "jyoshu", 
   "Go back to that thread and try to argue your failed point there. I personally don't see a point in \"suing\" an individual clerk who refuses to do their job and quits, as long as the office maintains the capability to have somebody to replace them to DO THE JOB.\n\n \n So if there are other pavillions--or other place to get married--available, there shouldn't be a lawsuit over just this ONE, then should it? emoticon_xangel\n \n \nAnd your cowardice in not addressing that elsewhere\n\n \n That's because the inconsistency happened HERE. 'Course, you'll never admit that ...\n \n \nNow, do you have any answer to the question I originally asked? \n Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\n\n \n Don't know ... maybe you should ask someone who's actually doing that. I already told you I agree with you here.\n \n \nWhy is it any more special for a \"Christian\" to have a \"religious\" belief against homosexuality, as opposed to a NON-Christian having a \"non-religious\" belief against homosexuality???\n\n \n Who said they think it's more 'special' of one over the other? Why do you assume these people wouldn't equally support someone being opposed to homosexuality for NON-religious reasons as well?\n \n \nGee.\n Sounds like one of my arguments you keep ignoring... emoticon_rolleyes\n\n \n Well ... that does tend to happen when you waste time arguing the obvious as if it were a rebuttal to anything. Maybe rather than being argumentative to the point of arguing over things that are pointless and that no one disagrees on, you could thoughtfully discuss things that people don't see eye to eye on. You might get better results from people that way.", 
   {}, 
   350086, 
   null, 
   1240090380.0
  ], 
  [
   350116, 
   null, 
   "foundit66", 
   "So if there are other pavillions--or other place to get married--available, there shouldn't be a lawsuit over just this ONE, then should it? emoticon_xangel\n\n I am talking about another clerk AT THE SAME COURTHOUSE.\n Not the people having to go to another courthouse...\n \n If they have to go to another pavilion (like having to go to another restaurant or another hotel), that is illegal.\n \n I take it you're not willing to discuss this honestly and openly in the original thread, are you... \n \n \n \nThat's because the inconsistency happened HERE. 'Course, you'll never admit that ...\n\n There is no inconsistency here.\n You are attempting to misrepresent my position.\n \n If the gay couple had asked one church member who didn't want to rent them the pavilion, and were quickly shown another church member who would rent them the pavilion, I wouldn't see any major legal problem there...\n \n Can you understand the difference between being served ENTIRELY, and with an INDIVIDUAL refusing (but another doing the job)...\n And before I get the inevitable, this is only on the LEGAL front.\n If you have an employee that refuses to do his job, then the employer must consider why that employee is being employed there...\n \n \n \nDon't know ... maybe you should ask someone who's actually doing that. I already told you I agree with you here.\n\n My question wasn't aimed at just those who want the special privilege, although you have clearly shown YOU want special privilege for religion in other threads.\n \n Don't worry. I didn't expect you to answer... \n \n \n \nWho said they think it's more 'special' of one over the other?\n\n That much is obvious.\n The legislation gives a special out for RELIGIOUS reasons, but says nothing about non-religious reasons.\n Duh!\n \n \n \nWell ... that does tend to happen when you waste time arguing the obvious as if it were a rebuttal to anything.\n\n So I can take this as a quote to use for you in the future to show you that (at one time) you didn't disagree with that argument?\n Good to know!\n It's bookmarked!", 
   {}, 
   350098, 
   null, 
   1240093080.0
  ], 
  [
   350167, 
   null, 
   "jyoshu", 
   "My question wasn't aimed at just those who want the special privilege, although you have clearly shown YOU want special privilege for religion in other threads.\n\n \n Why would you aim such a question about 'special privilege' at anyone who WASN'T wanting such 'special privilege'? \n \n At any rate, in many of these cases, whether or not it's truly \"special privilege\" is begging the question. I would agree that THIS is a case where it could be described as \"special privilege\" (though that's not the best wording in terms of what's going on IMO.) I think if you stoped and really asked the people involved, their perspective is that they can't really reconcile giving gay marriages with their religion. To them it's like asking an Amish person to work in a electricity plant, or a Jewish person to work in a pork processing facility. I wouldn't call any of these cases, including the one this thread is over as wanting a \"special privilege\". But I agree that in any of these cases, the person shouldn't work in such a role, and the proper response isn't to refuse to do this one task, but rather to not be in such a job at all. Public officials have to do what the law requires of them; otherwise they should step down. However, there's a flip-side to this. A public official also should step down rather than not do their job even if it's a situation that goes AGAINST what the gay pride movement might want. An example would be the officials like Gavin Newsom that refused to go along with the law in San Francisco and started giving out gay marriage certificates when they weren't supposed to. (And I can't help but wonder if you'd be consistent and call THAT a case of 'wanting a special privilege'? :) )\n \n \nDon't worry. I didn't expect you to answer... \n\n \n Guess you were wrong, as is often the case on this. I never had any thought of not answering, and did so. Honestly, a lot of the reason you don't always get answers for every little thing from people is that you belabor things far more than most people have time to mess with. Sometimes people have to just hit the high points. Most of us understand that--you don't seem to understand it when it happens. Or sometimes, you indeed get an answer--just not an answer that is exactly what you were trying to pin someone down towards. Sometimes people answer in a way to try to get you to actually THINK about an issue in a different way.\n \n \nThat much is obvious.\n The legislation gives a special out for RELIGIOUS reasons, but says nothing about non-religious reasons.\n Duh!\n\n \n Well of course. It's religious people that are wanting it, and they have religious reasons. Duh! What would you expect?? Or is this just another case of trying to fling any assertion you can at religious people? \n \n \nSo I can take this as a quote to use for you in the future to show you that (at one time) you didn't disagree with that argument?\n Good to know!\n It's bookmarked!\n\n \n I would LOVE for you to show where I've ever contradicted what I just said. In fact, I've basically said as much BEFORE, in cases where you YOURSELF have tried to draw a distinction between divorce and the religious objection over gay marriage. (the whole 'religious people have a double-standard' thing.) I indicated they were a similar issue THEN, and I do so NOW. It just so happens that THIS time, you need them to be similar for the sake of your argument.  I'm the one who's been consistent on this, and you haven't always been.", 
   {}, 
   350116, 
   null, 
   1240112940.0
  ], 
  [
   350284, 
   null, 
   "foundit66", 
   "Why would you aim such a question about 'special privilege' at anyone who WASN'T wanting such 'special privilege'? \n\n I don't think opinions should be just relegated to people who have one particular stance on an issue.\n \n \n \nAt any rate, in many of these cases, whether or not it's truly \"special privilege\" is begging the question. I would agree that THIS is a case where it could be described as \"special privilege\" (though that's not the best wording in terms of what's going on IMO.)\n\n It's been used for far less appropriateness by some ( emoticon_rolleyes ) people...\n \n \n \nI think if you stoped and really asked the people involved, their perspective is that they can't really reconcile giving gay marriages with their religion.\n\n So?\n People who are against blacks for reasons OTHER than religion often \"can't really reconcile\" things either.\n Why should the \"religion\" crowd get an excuse, while the non-religion crowd doesn't?\n \n \n \nTo them it's like asking an Amish person to work in a electricity plant, or a Jewish person to work in a pork processing facility. I wouldn't call any of these cases, including the one this thread is over as wanting a \"special privilege\".\n\n Suppose somebody was phobic of electricity or somebody else just really didn't like pork (thought eating from pigs was disgusting)...\n Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\n \n \n \nBut I agree that in any of these cases, the person shouldn't work in such a role, and the proper response isn't to refuse to do this one task, but rather to not be in such a job at all. Public officials have to do what the law requires of them; otherwise they should step down. However, there's a flip-side to this. A public official also should step down rather than not do their job even if it's a situation that goes AGAINST what the gay pride movement might want. An example would be the officials like Gavin Newsom that refused to go along with the law in San Francisco and started giving out gay marriage certificates when they weren't supposed to.\n\n Except the law essentially vindicated him.\n Gay marriages WERE a right.\n \n \n \n(And I can't help but wonder if you'd be consistent and call THAT a case of 'wanting a special privilege'? :) )\n\n If he continued despite being corrected, I would think he would have to step down or else have other action taken against him.\n Hardly \"special privilege\"...\n \n \n \nGuess you were wrong, as is often the case on this.\n\n Funny thing is, I WAS NOT WRONG.\n I asked you to answer a question: \"Why is it that people of religion keep trying to seek special privilege for their religious beliefs?\"\n \n You didn't answer that question.\n NOTHING in your response explained why people of religion seek \"special privilege\" for their religious beliefs...\n \n You started rambling, but NEVER ANSWERED THE QUESTION.\n \n \n \nI never had any thought of not answering, and did so.\n\n emoticon_rolleyes\n How many times did I repeat the question before you pretended to answer it???\n \n \n \nHonestly, a lot of the reason you don't always get answers for every little thing from people ...\n\n I asked essentially one question (repeating it) in the opening post.\n That's it.\n \n It's not an issue of not always getting answers, you habitually AVOID answering questions.\n Would you like me to compile you a list?\n \n \n \nSometimes people have to just hit the high points. Most of us understand that--you don't seem to understand it when it happens.\n\n Jyoshu, I would not include yourself in \"most of us\" if I were you...\n Furthermore, it's rather hypocritical of you to throw this junk out there, when just about a week ago or so YOU were on a rant about me supposedly not answering questions (when I actually was)...\n \n \n \nWell of course. It's religious people that are wanting it, and they have religious reasons. Duh! What would you expect??\n\n :xbanghead\n Jyoshu, you're obfuscating the point.\n \n Suppose I am a white man who thinks unemployment benefits should be extended.\n It would be obviously improper for me to just demand that WHITE applicants for unemployment should be extended.\n \n Here, you are essentially saying that \"religious people ... are wanting\" to be exempt from laws on equality, so they set up legislation to exempt JUST the religious objectors.\n IGNORE the \"special privilege\" aspect of the issue as to why it should JUST be \"religious\" excuses that get honored and not non-religious ones...\n \n \n \nOr is this just another case of trying to fling any assertion you can at religious people?\n\n There is no \"flinging\" of any \"assertion\".\n The example is documented in the original post. This isn't an \"assertion\", but an accounting of what DID happen.\n I can give a variety of examples of this repeating itself as well... \n \n \n \nI would LOVE for you to show where I've ever contradicted what I just said. In fact, I've basically said as much BEFORE, in cases where you YOURSELF have tried to draw a distinction between divorce and the religious objection over gay marriage.\n\n And you have NEVER tried to obfuscate the issue????\n emoticon_rolleyes\n :xbanghead\n \n It's for your obfuscation attempts that I book-mark it.\n The next time you try to side-track my point, I'll just ignore you obfuscation. LINK YOU to where you have already agreed with me on the point, and move on.\n It'll save us both time! emoticon_xgood\n \n \n \n(the whole 'religious people have a double-standard' thing.) I indicated they were a similar issue THEN, and I do so NOW. It just so happens that THIS time, you need them to be similar for the sake of your argument.  I'm the one who's been consistent on this, and you haven't always been.\n\n ROFLMAO!\n And so you start repeating some of that obfuscation I was talking about...\n Yeah. Who didn't see THAT coming...\n You knew EXACTLY what I was talking about! emoticon_xgood\n \n And if you think I have been \"inconsistent\", then prove it.\n 'nuff said...", 
   {}, 
   350167, 
   null, 
   1240173720.0
  ], 
  [
   350288, 
   null, 
   "jitobear", 
   "I hate this ####. Do your job or get another. Your freedom of religion ends at the tip of your nose. This goes for Christians who handle marriage licenses, Catholic pharmacists, homophobic doctors, Mulsim cab drives (who refuse to pick up the blind of those carrying alcohol) or those who work in meat processing plants and then do not want to handle pork. emoticon_mad\n \n Your religion is not your customer's or employer's problem.", 
   {}, 
   350284, 
   null, 
   1240174800.0
  ], 
  [
   350289, 
   null, 
   "thelmoose", 
   "I hate this ####. Do your job or get another. Your freedom of religion ends at the tip of your nose. This goes for Christians who handle marriage licenses, Catholic pharmacists, homophobic doctors, Mulsim cab drives (who refuse to pick up the blind of those carrying alcohol) or those who work in meat processing plants and then do not want to handle pork. emoticon_mad\n \n Your religion is not your customer's or employer's problem.\n\n \n Agreed.\n There are requirements for every job. Pharmacists dispense all lawfully presribed medications. Government clerks give out marriage licenses. Cabbies give rides. If you are unable or unwilling to perform your job, then it is not for you. You should not apply for that job or quit. A lack of meeting these requirements would not make you fit for hiring and should be a basis for dismissal. If the rules change while employed (as in this case), it would be reasonable to transfer, if possible. If not possible, you are SOL.\n \n The fact that you are unqualified to do a job because of your chosen religious behavior makes no difference, as it would not for any other reason. Your rights to practice your religion in private are not infringed.", 
   {}, 
   350288, 
   null, 
   1240176120.0
  ], 
  [
   350308, 
   null, 
   "jazyjason", 
   "Agreed.\n There are requirements for every job. Pharmacists dispense all lawfully presribed medications. Government clerks give out marriage licenses. Cabbies give rides. If you are unable or unwilling to perform your job, then it is not for you. You should not apply for that job or quit. A lack of meeting these requirements would not make you fit for hiring and should be a basis for dismissal. If the rules change while employed (as in this case), it would be reasonable to transfer, if possible. If not possible, you are SOL.\n \n The fact that you are unqualified to do a job because of your chosed religious behavior makes no difference, as it would not for any other reason. Your rights to practice your religion in private are not infringed.\n\n \n Could not have said it better myself.", 
   {}, 
   350289, 
   null, 
   1240185540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  State to counties: Obey gay marriage ruling, issue certificates", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12573-state-counties-obey-gay-marriage-ruling-issue-certificates.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12573, 
  "discussion_files": [
   [
    "19861.html", 
    "http://www.4forums.com/political/gay-rights-debates/12573-state-counties-obey-gay-marriage-ruling-issue-certificates-print.html"
   ]
  ], 
  "identifier": 12573
 }
]