[
 [
  [
   350436, 
   null, 
   "jazyjason", 
   "The International Gay and Lesbian Human Rights Commission writes: \"The following is a translation of a story from Alarabiya, a UAE-based media network, which was published on its Arabic website a few hours ago. While IGLHRC has not verified all of the allegations, many are consistent with patterns of human rights violations being reported from within the country.\"\n \n The translation:\n \n \"A prominent Iraqi human rights activist says that Iraqi militia have deployed a painful form of torture against homosexuals by closing their anuses using 'Iranian gum.' ... Yina Mohammad told Alarabiya.net that, 'Iraqi militias have deployed an unprecedented form of torture against homosexuals by using a very strong glue that will close their anus.' According to her, the new substance 'is known as the American hum, which is an Iranian-manufactured glue that if applied to the skin, sticks to it and can only be removed by surgery. After they glue the anuses of homosexuals, they give them a drink that causes diarrhea. Since the anus is closed, the diarrhea causes death. Videos of this form of torture are being distributed on mobile cellphones in Iraq.' According to this human rights activist, for the past 3 weeks a crackdown on homosexuals has been going on based on a religious decree that demands their death; dozens have been targeted. She says that the persecution of homosexuals is not confined to the Shiite clerics. Some Sunni leaders have also declared the death penalty for sodomy on satellite channels.\" \n \n Report: Iraqi Militia Killing Gay Men with Painful Anal Glue Torture - Towleroad, More than gay news. More gay men", 
   {
    "post_info": {
     "post_title": "Report: Iraqi Militia Killing Gay Men with Painful Anal Glue Torture"
    }
   }, 
   null, 
   null, 
   1240314000.0
  ], 
  [
   350437, 
   null, 
   "jazyjason", 
   "This is just sick and disturbing. To see this kind of torture is just jaw dropping and needs to be stopped.", 
   {}, 
   350436, 
   null, 
   1240314060.0
  ], 
  [
   350447, 
   null, 
   "Matthew S", 
   "This is just sick and disturbing. To see this kind of torture is just jaw dropping and needs to be stopped.\n\n \n What is sicker is the religion that demands it. This is a prime example of why the earth would be better off without religion.", 
   {}, 
   350437, 
   null, 
   1240321500.0
  ], 
  [
   350463, 
   null, 
   "jazyjason", 
   "What is sicker is the religion that demands it. This is a prime example of why the earth would be better off without religion.\n\n \n I am inclined to disagree. Seeing as I am a gay christian, I find that being spiritual has it's benefits. A world without religion would then be one without faith, and the result would be a decline of culture and diversity around the world.\n \n I do though agree that the senseless and often violent and deadly acts claimed upon in the name of a religion is hypocrisy at it's finest. These clerics and such with their radical views of the Islamic faith just like Al Queda and the like, shows how man twists and contorts a faith to their own selfish and violent ways, as justification for unspeakable actions agains their fellow man.", 
   {}, 
   350447, 
   null, 
   1240340160.0
  ], 
  [
   350475, 
   null, 
   "Matthew S", 
   "I am inclined to disagree. Seeing as I am a gay christian, I find that being spiritual has it's benefits. A world without religion would then be one without faith, and the result would be a decline of culture and diversity around the world.\n \n I do though agree that the senseless and often violent and deadly acts claimed upon in the name of a religion is hypocrisy at it's finest. These clerics and such with their radical views of the Islamic faith just like Al Queda and the like, shows how man twists and contorts a faith to their own selfish and violent ways, as justification for unspeakable actions agains their fellow man.\n\n \n I disagree with you. A religion is what the religious leader says it is. If a religious leader says that the religion demands the death of gay people. If people then do sick things because of that religious dictate from a religious leader who says that the religion demands it then the religion is just as sick as the acts. The world would be better off with out this type of sick religion.\n \n Learn Jason. We gay people and religion are at the opposite end of the spectrum. There can be no cohabitation without one side changing its beliefs to accommodate the other. In other words either we gay people stop being gay or religion has to accept us for who we are. I for one do not want to stop being gay, nor should I because someone else has a religious belief that they refuse to change. It is better to have no religion then to have a world without gay people.", 
   {}, 
   350463, 
   null, 
   1240342380.0
  ], 
  [
   350492, 
   null, 
   "jyoshu", 
   "Learn Jason. We gay people and religion are at the opposite end of the spectrum. There can be no cohabitation without one side changing its beliefs to accommodate the other.\n\n \n Did you not just read him say that he's a gay Christian?", 
   {}, 
   350475, 
   null, 
   1240353060.0
  ], 
  [
   350494, 
   null, 
   "foundit66", 
   "I disagree with you. A religion is what the religious leader says it is. If a religious leader says that the religion demands the death of gay people. If people then do sick things because of that religious dictate from a religious leader who says that the religion demands it then the religion is just as sick as the acts. The world would be better off with out this type of sick religion.\n\n The same could be said of politics. Or of humanitarianism.\n Look at what the Americans did to the Indians because we thought we had a \"right\" to this land.\n \n The thing is whether people THINK for themselves or not.\n \n \n \nLearn Jason. We gay people and religion are at the opposite end of the spectrum. There can be no cohabitation without one side changing its beliefs to accommodate the other.\n\n And Christianity has done that in a lot of ways.\n Even Islam is changing, where it is allowed.\n \n I think the thing that should really be feared are those who stick to their beliefs \"cause their book that is over a thousand years old told them to\".\n \n \n \nIn other words either we gay people stop being gay or religion has to accept us for who we are. I for one do not want to stop being gay, nor should I because someone else has a religious belief that they refuse to change. It is better to have no religion then to have a world without gay people.\n\n I expect we'll have gay marriage legalized (for the most part) in 20 years.\n Religion will still be around.\n Then what? Will you fail to recognize that the two are not irrevocably incompatible.", 
   {}, 
   350475, 
   null, 
   1240353720.0
  ], 
  [
   350499, 
   null, 
   "jyoshu", 
   "The topic of this thread is pretty awful, if it's true. Though it does sound like the sort of thing that might just turn up on Snopes one of these days.", 
   {}, 
   350494, 
   null, 
   1240355040.0
  ], 
  [
   350500, 
   null, 
   "Matthew S", 
   "Did you not just read him say that he's a gay Christian?\n\n \n He does not understand.\n \n Either we change or religion changes. There can be no middle ground with the openness and equality of our lives.", 
   {}, 
   350492, 
   null, 
   1240355700.0
  ], 
  [
   350506, 
   null, 
   "Brigid", 
   "He does not understand.\n \n Either we change or religion changes. There can be no middle ground with the openness and equality of our lives.\n\n \n You are as intolerant as the anti-gay people you so despise.", 
   {}, 
   350500, 
   null, 
   1240356480.0
  ], 
  [
   350514, 
   null, 
   "Matthew S", 
   "You are as intolerant as the anti-gay people you so despise.\n\n \n Why? Because I refuse to go back into the closet? That I refuse to change or adhere to their view?", 
   {}, 
   350506, 
   null, 
   1240358880.0
  ], 
  [
   350516, 
   null, 
   "Brigid", 
   "Why? Because I refuse to go back into the closet? That I refuse to change or adhere to their view?\n\n \n No, becuase you are being just as intolerant of them as they are of you. You say there \"is no middle ground\" - that smacks very loudly of intolerance by itself. You want no religion in the world - they want no gays (or at least don't want them acknowledged). \n \n You expect THEM to change or adhere yo YOUR view - it seems it isn't enough to just get equal rights (something myself and other homosexuals like me want) - you say that they themselves have to accept us for who we are. I say bull shite to that - they don't have to change their beliefs or accept us - all we need are equal legal rights (marriage, adoption, etc.).\n \n You try to put everything in extremes - make everything black and white: Religion versus homosexuality. Sorry, but outside of your fantasyland, the real world doesn't work that way. \n \n Just for example, my religion, Wicca, is perfectly accepting of homosexuality. There are also numerous Christian groups and churches that support our rights as Homosexuals, and I know of at least three churches just in my city that willingly provide marriage ceremonies for gay couples (even though it isn't legally binding due to our state's rejection of our marriage rights).\n \n In the REAL world, your extremes are just that - extremes.\n \n You both are the same - just opposite radical ends of the same coin.\n \n The rest of us are all in the middle and get along just fine with one another.", 
   {}, 
   350514, 
   null, 
   1240361520.0
  ], 
  [
   350562, 
   null, 
   "Matthew S", 
   "No, becuase you are being just as intolerant of them as they are of you. You say there \"is no middle ground\" - that smacks very loudly of intolerance by itself. You want no religion in the world - they want no gays (or at least don't want them acknowledged). \n \n You expect THEM to change or adhere yo YOUR view - it seems it isn't enough to just get equal rights (something myself and other homosexuals like me want) - you say that they themselves have to accept us for who we are. I say bull shite to that - they don't have to change their beliefs or accept us - all we need are equal legal rights (marriage, adoption, etc.).\n \n You try to put everything in extremes - make everything black and white: Religion versus homosexuality. Sorry, but outside of your fantasyland, the real world doesn't work that way. \n \n Just for example, my religion, Wicca, is perfectly accepting of homosexuality. There are also numerous Christian groups and churches that support our rights as Homosexuals, and I know of at least three churches just in my city that willingly provide marriage ceremonies for gay couples (even though it isn't legally binding due to our state's rejection of our marriage rights).\n \n In the REAL world, your extremes are just that - extremes.\n \n You both are the same - just opposite radical ends of the same coin.\n \n The rest of us are all in the middle and get along just fine with one another.\n\n \n \n So if I understand you correctly I need to go back into the closet, or at least cover in order to come into alignment with their beliefs when they put those beliefs into law?", 
   {}, 
   350516, 
   null, 
   1240378020.0
  ], 
  [
   350566, 
   null, 
   "Brigid", 
   "So if I understand you correctly I need to go back into the closet, or at least cover in order to come into alignment with their beliefs when they put those beliefs into law?\n\n \n No - not even close to what I said. If you had READ my post, you would not have even made this post (or your wild strawman that has nothing to do with what I actually said).\n \n To sum it up for you since long paragraphs seem to be too much for you to handle in one sitting: You give those of us working for Gay Rights a bad name. You are the Archangel and EasyRider of our movement.\n \n In fact, to show just how much you DIDN'T bother reading my post (but rather pulled an SS and Archie on us), you say: \nor at least cover in order to come into alignment with their beliefs when they put those beliefs into law?\n\n \n When had you read my post you would have seen this among other things which says the exact opposite of your strawman: \"all we need are equal legal rights (marriage, adoption, etc.).\" in reference to forcing Christians to accept us. \n \n I don't give a damn if they accept us for who we are - so long as I have equal rights, they can go rot in their bigotry for all I care. Their beliefs certainly wouldn't be \"put into law\" if we had equal rights, now would they. Durr.\n \n Now you, on the other hand, seem to want to shove Religion and its many varied adherents into a closet so you don't have to see them - you want to do the same thing to them as the anti-gy groups have been doing to people like myself for years. You are no better than them.", 
   {}, 
   350562, 
   null, 
   1240378560.0
  ], 
  [
   350578, 
   null, 
   "jazyjason", 
   "The topic of this thread is pretty awful, if it's true. Though it does sound like the sort of thing that might just turn up on Snopes one of these days.\n\n \n It is true. Sick and horrific as it may sound it is.", 
   {}, 
   350499, 
   null, 
   1240392060.0
  ], 
  [
   350580, 
   null, 
   "jazyjason", 
   "I disagree with you. A religion is what the religious leader says it is. If a religious leader says that the religion demands the death of gay people. If people then do sick things because of that religious dictate from a religious leader who says that the religion demands it then the religion is just as sick as the acts. The world would be better off with out this type of sick religion.\n \n Learn Jason. We gay people and religion are at the opposite end of the spectrum. There can be no cohabitation without one side changing its beliefs to accommodate the other. In other words either we gay people stop being gay or religion has to accept us for who we are. I for one do not want to stop being gay, nor should I because someone else has a religious belief that they refuse to change. It is better to have no religion then to have a world without gay people.\n\n \n \n Matt I understand that most of our issues (meaning the gay community) stems from religion, or rather the misinterpretation or abuse of ones beliefs and justification for violence and harassment. \n \n However, I must point out that there are wonderful Gay religious leaders such as Mel White who aids those in his congregation and those who seek to be loved and seek to find their faith again while giving them positive advice and support about their sexual orientation.\n \n Fact is Matt that yes there are alot of bigots. But are they true believers in their faith? If a person claiming to be a christian kicks their son out of the house for being gay, or beats a gay man are they christian? NO. They are like the Pharisees in Christ's time who were called out as hypocrites and bigots for not embracing the leper, the blind, the poor. Instead they took advantage of the poor and their sacrifices and being in allegiance with Rome, made a profit at the temple by saying the poor's offering was unclean and they had to buy one of their own as a sacrifise to god.\n \n What did jesus do? he kicked them all out of the temple! Jesus''s teachings were of love and compassion, and embracing your fellow man and loving them no matter who they were or their so called sin. Sadly most modern christians lose sight of this teaching.\n \n What I'm getting at matt is that not all of us being christians are bigots. I'mma big flaming queen with blond hair and tight jeans and flip flops, but I still love jesus and know he loves me for who I am.\n \n Am I going to use him as a scapegoat for political agenda? no. I'm not a modern day televangelist. But I do understand Christ's teachings and I do think religion, as tattered and fragmented as it may be, and although it is a main point in the suffering of gays, is a thing that must remain not only for its significance in the lives of everyday peoples and their hopes, dreams, and spiritual well being. But also as a means of connection, so that people of all faiths may find a common ground, and come together in peace and love one day to spread a message of love and tolerance. That is what I hope and pray one day may happen.", 
   {}, 
   350475, 
   null, 
   1240392660.0
  ], 
  [
   350581, 
   null, 
   "jazyjason", 
   "He does not understand.\n \n Either we change or religion changes. There can be no middle ground with the openness and equality of our lives.\n\n \n Wrong. There are many open churches and clergy who embrace their gay and lesbian brethren with equality and love. Not scorn or false \"love\". But a true open love that binds them together as people. \n \n As far as a middle ground I think you confuse right wing extreme religious people with the modern day moderate believer who now today more than ever embraces gays and lesbians.", 
   {}, 
   350500, 
   null, 
   1240392960.0
  ], 
  [
   350591, 
   null, 
   "Matthew S", 
   "Wrong. There are many open churches and clergy who embrace their gay and lesbian brethren with equality and love. Not scorn or false \"love\". But a true open love that binds them together as people. \n \n \n \n As far as a middle ground I think you confuse right wing extreme religious people with the modern day moderate believer who now today more than ever embraces gays and lesbians.\n\n \n Then they have changed their beliefs to accept us. You have just confirmed my statement.", 
   {}, 
   350581, 
   null, 
   1240404420.0
  ], 
  [
   350593, 
   null, 
   "Archangel", 
   "The International Gay and Lesbian Human Rights Commission writes: \"The following is a translation of a story from Alarabiya, a UAE-based media network, which was published on its Arabic website a few hours ago. While IGLHRC has not verified all of the allegations, many are consistent with patterns of human rights violations being reported from within the country.\"\n \n The translation:\n \n \"A prominent Iraqi human rights activist says that Iraqi militia have deployed a painful form of torture against homosexuals by closing their anuses using 'Iranian gum.' ... Yina Mohammad told Alarabiya.net that, 'Iraqi militias have deployed an unprecedented form of torture against homosexuals by using a very strong glue that will close their anus.' According to her, the new substance 'is known as the American hum, which is an Iranian-manufactured glue that if applied to the skin, sticks to it and can only be removed by surgery. After they glue the anuses of homosexuals, they give them a drink that causes diarrhea. Since the anus is closed, the diarrhea causes death. Videos of this form of torture are being distributed on mobile cellphones in Iraq.' According to this human rights activist, for the past 3 weeks a crackdown on homosexuals has been going on based on a religious decree that demands their death; dozens have been targeted. She says that the persecution of homosexuals is not confined to the Shiite clerics. Some Sunni leaders have also declared the death penalty for sodomy on satellite channels.\" \n \n Report: Iraqi Militia Killing Gay Men with Painful Anal Glue Torture - Towleroad, More than gay news. More gay men\n\n \n I actually have a suggestion that might just make a difference in changing this policy if it is true. You should align around a million or so homosexuals and all buy tickets to Iraq and carry out a million man march over there demanding an end to this activity. You could even call it the million man tour and hit all of the capitals of all of the islamic countries which currently make homosexuality a crime. That'll show em! \n \n I'm sure islam will buckle under the pressure of your politically correct demands which defy all logic and moral grounding. I'll tell you what, if you get at least 100,000 American homosexuals to sign a contract agreeing to this plan, I will personally make a sizable donation towards your travel expenses. emoticon_smile Isn't that great? Now let's come together and make a real difference for our homosexual brothers who are being abused in this and in other islamic countries. \n \n Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...", 
   {}, 
   350436, 
   null, 
   1240406580.0
  ], 
  [
   350603, 
   null, 
   "foundit66", 
   "I actually have a suggestion that might just make a difference in changing this policy if it is true. You should align around a million or so homosexuals and all buy tickets to Iraq and carry out a million man march over there demanding an end to this activity. You could even call it the million man tour and hit all of the capitals of all of the islamic countries which currently make homosexuality a crime. That'll show em! \n \n I'm sure islam will buckle under the pressure of your politically correct demands which defy all logic and moral grounding. I'll tell you what, if you get at least 100,000 American homosexuals to sign a contract agreeing to this plan, I will personally make a sizable donation towards your travel expenses. emoticon_smile Isn't that great? Now let's come together and make a real difference for our homosexual brothers who are being abused in this and in other islamic countries. \n \n Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...\n\n \n How the heck is gays not desiring to rush off to what would be pretty much certain death or imprisonment a sign of \"hypocrisy\"???\n :xbanghead\n \n Remember Saddam's great human rights abuses?\n How many Republicans who railed against them rushed off to Iraq to protest?\n Guess that must make them hypocrites then, huh... :xbanghead", 
   {}, 
   350593, 
   null, 
   1240418040.0
  ], 
  [
   350632, 
   null, 
   "Brigid", 
   "I actually have a suggestion that might just make a difference in changing this policy if it is true. You should align around a million or so homosexuals and all buy tickets to Iraq and carry out a million man march over there demanding an end to this activity. You could even call it the million man tour and hit all of the capitals of all of the islamic countries which currently make homosexuality a crime. That'll show em! \n \n I'm sure islam will buckle under the pressure of your politically correct demands which defy all logic and moral grounding. I'll tell you what, if you get at least 100,000 American homosexuals to sign a contract agreeing to this plan, I will personally make a sizable donation towards your travel expenses. emoticon_smile Isn't that great? Now let's come together and make a real difference for our homosexual brothers who are being abused in this and in other islamic countries. \n \n Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...\n\n Wow. This takes second place for the most illogical, absurd, and absolutely stupid posts I have ever read (first is Supersport and his eyebeams). And I've seen a LOT of retarded posts.......", 
   {}, 
   350593, 
   null, 
   1240430160.0
  ], 
  [
   350633, 
   null, 
   "Brigid", 
   "No - not even close to what I said. If you had READ my post, you would not have even made this post (or your wild strawman that has nothing to do with what I actually said).\n \n To sum it up for you since long paragraphs seem to be too much for you to handle in one sitting: You give those of us working for Gay Rights a bad name. You are the Archangel and EasyRider of our movement.\n \n In fact, to show just how much you DIDN'T bother reading my post (but rather pulled an SS and Archie on us), you say: \n \n When had you read my post you would have seen this among other things which says the exact opposite of your strawman: \"all we need are equal legal rights (marriage, adoption, etc.).\" in reference to forcing Christians to accept us. \n \n I don't give a damn if they accept us for who we are - so long as I have equal rights, they can go rot in their bigotry for all I care. Their beliefs certainly wouldn't be \"put into law\" if we had equal rights, now would they. Durr.\n \n Now you, on the other hand, seem to want to shove Religion and its many varied adherents into a closet so you don't have to see them - you want to do the same thing to them as the anti-gy groups have been doing to people like myself for years. You are no better than them.\n\n \n No response, Matt? A little embarassed that you got called on not reading through my post and instead went on a little rant based on your ASSumptions of my views?", 
   {}, 
   350566, 
   null, 
   1240430280.0
  ], 
  [
   350657, 
   null, 
   "jitobear", 
   "Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...\n\n \n You know. Just because someone doesn't shoot their neighbor in the head does not mean its OK that they kick them.", 
   {}, 
   350593, 
   null, 
   1240438020.0
  ], 
  [
   350660, 
   null, 
   "Matthew S", 
   "No response, Matt? A little embarassed that you got called on not reading through my post and instead went on a little rant based on your ASSumptions of my views?\n\n \n I am not embarrassed about anything. I want religion to keep its nose out of my life and the laws I have to live under. As I have said before, if the termites keep to the forest and mind their own business then I am all for live and let live. With those religions that consider homosexuality to be a sin there can not be any compromise. What are we to compromise about? What part of our lives are we supposed to hide so they get to protect their privilege? There can be no coexistence without one group losing something. Either we have to change and go back into the closet, or cover, or they have to change their beliefs to accept us.", 
   {}, 
   350633, 
   null, 
   1240438560.0
  ], 
  [
   350682, 
   null, 
   "Brigid", 
   "I am not embarrassed about anything. I want religion to keep its nose out of my life and the laws I have to live under. As I have said before, if the termites keep to the forest and mind their own business then I am all for live and let live. With those religions that consider homosexuality to be a sin there can not be any compromise. What are we to compromise about? What part of our lives are we supposed to hide so they get to protect their privilege? There can be no coexistence without one group losing something. Either we have to change and go back into the closet, or cover, or they have to change their beliefs to accept us.\n\n \n There is absolutely no requirement that they accept homosexuality. So long as we have equal rights to them, it does not matter if they accept us or not. People even today do not accept Blacks or interracial coupling. Doesn't mean those couples don't have equal rights - their rights are not contingent on whether or not some group of people changes their beliefs to accept them.\n \n I mean listen to yourself: \"there cannot be any compromise\". You sound JUST like those you hate. Sit back and think about that. It's bad enough our country is filled with intolerant conservatives - I don't want to just replace it with intolerant liberals on the opposite end of the spectrum.\n \n And listen to yourself earlier on: \"if the termites keep to the forest and mind their own business then I am all for live and let live\". What would be your response if an anti-gay poster like Archie came on here and called you a termite that should keep to the forest and mind your own business? I'm pretty sure I already know, given what I've seen of your posts, but I'd say it wouldn't be a very calm rational response. Think about that as well - you're basically telling anyone that practices religion that you will be fine as long as they stay in the closet. \n \n \n ----\n Now, are you planning to respond to my post that I bumped?\n \n I'll repost it here in full for you:\n \n \nSo if I understand you correctly I need to go back into the closet, or at least cover in order to come into alignment with their beliefs when they put those beliefs into law?\n\n \n No - not even close to what I said. If you had READ my post, you would not have even made this post (or your wild strawman that has nothing to do with what I actually said).\n \n To sum it up for you since long paragraphs seem to be too much for you to handle in one sitting: You give those of us working for Gay Rights a bad name. You are the Archangel and EasyRider of our movement.\n \n In fact, to show just how much you DIDN'T bother reading my post (but rather pulled an SS and Archie on us), you say: \nor at least cover in order to come into alignment with their beliefs when they put those beliefs into law?\n\n \n When had you read my post you would have seen this among other things which says the exact opposite of your strawman: \"all we need are equal legal rights (marriage, adoption, etc.).\" in reference to forcing Christians to accept us. \n \n I don't give a damn if they accept us for who we are - so long as I have equal rights, they can go rot in their bigotry for all I care. Their beliefs certainly wouldn't be \"put into law\" if we had equal rights, now would they. Durr.\n \n Now you, on the other hand, seem to want to shove Religion and its many varied adherents into a closet so you don't have to see them - you want to do the same thing to them as the anti-gay groups have been doing to people like myself for years. You are no better than them.\n \n EDIT: It seems you want to shove them into a closet so you don't have to see them, even, it seems, your fellow gays who also happen to practice religion (Myself - a Wiccan, JazyJason - a Christian, for two examples)", 
   {}, 
   350660, 
   null, 
   1240444440.0
  ], 
  [
   350708, 
   null, 
   "Archangel", 
   "I actually have a suggestion that might just make a difference in changing this policy if it is true. You should align around a million or so homosexuals and all buy tickets to Iraq and carry out a million man march over there demanding an end to this activity. You could even call it the million man tour and hit all of the capitals of all of the islamic countries which currently make homosexuality a crime. That'll show em! \n \n I'm sure islam will buckle under the pressure of your politically correct demands which defy all logic and moral grounding. I'll tell you what, if you get at least 100,000 American homosexuals to sign a contract agreeing to this plan, I will personally make a sizable donation towards your travel expenses. emoticon_smile Isn't that great? Now let's come together and make a real difference for our homosexual brothers who are being abused in this and in other islamic countries. \n \n Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...\n\n \n \nHow the heck is gays not desiring to rush off to what would be pretty much certain death or imprisonment a sign of \"hypocrisy\"???\n :xbanghead\n \n Remember Saddam's great human rights abuses? :xbanghead\n\n \n My point is that there is no way they can glue all of your butts closed. You could wear them down through attrition and by the sheer volume of militant homosexuals overwhelming them all at once. It's a winner I tell ya! emoticon_xgood And saddam is dead so he can't hurt you anymore foundit. These other guys are just posers and wanna be despots. \n \n You guys are always saying that our government is worse than the terrorists Bush claimed were such a threat to us. You know, his fear mongering and all. So the homosexual community needs to really take a stand and go international in your drive for equality. You can call yourselves the pink army. emoticon_xhoho Just remember, I want credit for coming up with the idea though, ok? As long as I can stay home cuz I don't do well in hot, arid desert conditions. I break out with heat rash. emoticon_xchicken", 
   {}, 
   350603, 
   null, 
   1240452780.0
  ], 
  [
   350711, 
   null, 
   "foundit66", 
   "My point is that there is no way they can glue all of your butts closed. You could wear them down through attrition and by the sheer volume of militant homosexuals overwhelming them all at once. It's a winner I tell ya! emoticon_xgood And saddam is dead so he can't hurt you anymore foundit. These other guys are just posers and wanna be despots. \n\n emoticon_frazzled\n You know they kill Christians in the Middle East, don't you?\n Are you going to get a group of your own to go over there too?\n emoticon_ic\n \n \n \nYou guys are always saying that our government is worse than the terrorists Bush claimed were such a threat to us.\n\n Archie, I have never said that.\n I have never seen anybody say that.\n \n Furthermore, anybody who says our government is worse than the terrorists is ridiculously exaggerating the situation.\n \n \n But seriously, considering it was your idea, are you going to go to Middle East to hold your own Christian rally?", 
   {}, 
   350708, 
   null, 
   1240453320.0
  ], 
  [
   350743, 
   null, 
   "jazyjason", 
   "I actually have a suggestion that might just make a difference in changing this policy if it is true. You should align around a million or so homosexuals and all buy tickets to Iraq and carry out a million man march over there demanding an end to this activity. You could even call it the million man tour and hit all of the capitals of all of the islamic countries which currently make homosexuality a crime. That'll show em! \n \n I'm sure islam will buckle under the pressure of your politically correct demands which defy all logic and moral grounding. I'll tell you what, if you get at least 100,000 American homosexuals to sign a contract agreeing to this plan, I will personally make a sizable donation towards your travel expenses. emoticon_smile Isn't that great? Now let's come together and make a real difference for our homosexual brothers who are being abused in this and in other islamic countries. \n \n Or isn't it a fact that none of you would actually risk your lives to speak out against any of the human rights injustices which exist in the real world when you can safely stay here and complain about how bad you have it because some of us object to redefining marriage in your favor. emoticon_rolleyes The hypocrisy is mind numbing...\n\n \n \n ???????????? emoticon_wow", 
   {}, 
   350593, 
   null, 
   1240476480.0
  ], 
  [
   350745, 
   null, 
   "Archangel", 
   "emoticon_frazzled\n You know they kill Christians in the Middle East, don't you?\n Are you going to get a group of your own to go over there too?\n emoticon_ic\n \n Archie, I have never said that.\n I have never seen anybody say that.\n \n Furthermore, anybody who says our government is worse than the terrorists is ridiculously exaggerating the situation.\n \n \n But seriously, considering it was your idea, are you going to go to Middle East to hold your own Christian rally?\n\n \n Christians are putting their mouths where their beliefs are as we speak, and in the most oppressive and dangerous countries on Earth foundit. They are already over there and yes, they are being killed for their beliefs. But that doesn't stop us from continuing to go there to share the gospel. You can't name one continent except maybe Antarctica which doesn't have christian missionaries working there, and yes, being killed for their beliefs. But that doesn't stop christians because we understand that our message of eternal life is more important than this physical life. \n \n Take a stand for once and be willing to sacrifice for your cause if you truly believe in it. Stand up as a group and change the world if you're convinced that you are right about this so called equality rant we see in every post you guys write. Go to the countries where the true human rights injustices exist and take a stand against them. Stop your whining and complaining from a safe distance if you truly have the commitment of your convictions. Here is an example of what evangelicals have been doing to fight these inequities. Middle East Report 249: The Politics of Persecution by Melani McAlister", 
   {}, 
   350711, 
   null, 
   1240489740.0
  ], 
  [
   350746, 
   null, 
   "Matthew S", 
   "Christians are putting their mouths where their beliefs are as we speak, and in the most oppressive and dangerous countries on Earth foundit. They are already over there and yes, they are being killed for their beliefs. But that doesn't stop us from continuing to go there to share the gospel. You can't name one continent except maybe Antarctica which doesn't have christian missionaries working there, and yes, being killed for their beliefs. But that doesn't stop christians because we understand that our message of eternal life is more important than this physical life. \n \n Take a stand for once and be willing to sacrifice for your cause if you truly believe in it. Stand up as a group and change the world if you're convinced that you are right about this so called equality rant we see in every post you guys write. Go to the countries where the true human rights injustices exist and take a stand against them. Stop your whining and complaining from a safe distance if you truly have the commitment of your convictions. Here is an example of what evangelicals have been doing to fight these inequities. Middle East Report 249: The Politics of Persecution by Melani McAlister\n\n \n So then what is the difference between anal gluing done in the name of Islam, shock treatments on gay teens done in the name of Mormonism, or burning at the stake in the name of Christianity?", 
   {}, 
   350745, 
   null, 
   1240492260.0
  ], 
  [
   350756, 
   null, 
   "Archangel", 
   "So then what is the difference between anal gluing done in the name of Islam, shock treatments on gay teens done in the name of Mormonism, or burning at the stake in the name of Christianity?\n\n \n If you can show where mormons arrest or abduct homosexuals and give them shock treatments against their will, and that Christians burn homosexuals at the stake under the same circumstances you will have made a valid point. But as usual you are making a fallacious point since that isn't the reality at all. You must go back hundreds of years in history to find such examples of so called christian atrocities. \n \n And what is most important to note is that those atrocities were NOT representative of the message and principles which Jesus, the founder of the christian belief system established for humanity. They were an absolute corruption of that gospel message. Unlike islam which is perfectly following the principles which mohammed established by setting the example for how perceived sinners against islam were to be treated. That is the difference Matthew, and it is massive in comparison.", 
   {}, 
   350746, 
   null, 
   1240499340.0
  ], 
  [
   350778, 
   null, 
   "foundit66", 
   "Christians are putting their mouths where their beliefs are as we speak, and in the most oppressive and dangerous countries on Earth foundit.\n\n The same could be said of the gay men whom the government is persecuting.\n After all, the government wouldn't know if the men weren't out...\n \n But my point was more simple.\n You advocated MORE people going over there.\n More GAY people.\n I'm just wondering why you yourself don't follow suit on the \"Christian issue\", like you advocate gays do.\n \n Or do you have some unbased belief that it's \"enough\" for the Christians (can you show any Christians killed in Middle East?), but the gays must go off like lemmings...\n emoticon_xdonno\n \n \n \nTake a stand for once and be willing to sacrifice for your cause if you truly believe in it.\n\n I agree.\n Why aren't you doing that?\n It's your idea. So why aren't you doing that?\n \n If \"there are already people doing it\" is good for Christians, than it should be good for gays as well.\n If it's not good for gays, then it's not good for Christians.\n \n \n \nHere is an example of what evangelicals have been doing to fight these inequities. Middle East Report 249: The Politics of Persecution by Melani McAlister\n\n So you provide a story about TEENAGERS being put in harms way?\n From the article: \"Teenagers staff an overseas service booth at the 2005 Creation Festival, a Christian music event. (Stephanie Keith)\"\n \n Wow. Such great parents that Christians make! :xbanghead", 
   {}, 
   350745, 
   null, 
   1240509000.0
  ], 
  [
   350789, 
   null, 
   "jyoshu", 
   "So you provide a story about TEENAGERS being put in harms way?\n From the article: \"Teenagers staff an overseas service booth at the 2005 Creation Festival, a Christian music event. (Stephanie Keith)\"\n \n Wow. Such great parents that Christians make! :xbanghead\n\n \n So ... you're just going to spin anything said to you in a way that finds fault, eh? Using your approach, it could be stated \"wow; such bad parents gays make\" if they let their kids protest for gay rights, putting them in harm's way. emoticon_xangel 'Course, you'd never say that ...", 
   {}, 
   350778, 
   null, 
   1240510020.0
  ], 
  [
   350794, 
   null, 
   "foundit66", 
   "So ... you're just going to spin anything said to you in a way that finds fault, eh?\n\n I am talking to Archie, Jyoshu, and my comments TO Archie reflect the mentality he is using against me.\n A certain level of \"sarcasm\" is being employed... \n \n \n \nUsing your approach, it could be stated \"wow; such bad parents gays make\" if they let their kids protest for gay rights, putting them in harm's way. emoticon_xangel 'Course, you'd never say that ...\n\n :xbanghead\n So you think that letting kids protest for gay rights IN THE U.S. is the same thing as letting kids protest for Christian rights IN FOREIGN COUNTRIES where people have been imprisoned or killed for being Christian or espousing Christianity...\n \n Is that what you're saying?\n Cause THAT is the context we are dealing with here... emoticon_rolleyes", 
   {}, 
   350789, 
   null, 
   1240510800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Report: Iraqi Militia Killing Gay Men with Painful Anal Glue Torture", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12592-report-iraqi-militia-killing-gay-men-painful-anal-glue-torture.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12592, 
  "discussion_files": [
   [
    "28916.html", 
    "http://www.4forums.com/political/gay-rights-debates/12592-report-iraqi-militia-killing-gay-men-painful-anal-glue-torture-print.html"
   ], 
   [
    "28917.html", 
    "http://www.4forums.com/political/gay-rights-debates/12592-report-iraqi-militia-killing-gay-men-painful-anal-glue-torture-3-print.html"
   ], 
   [
    "28918.html", 
    "http://www.4forums.com/political/gay-rights-debates/12592-report-iraqi-militia-killing-gay-men-painful-anal-glue-torture-2-print.html"
   ]
  ], 
  "identifier": 12592
 }
]