[
 [
  [
   350680, 
   null, 
   "OldSarge", 
   "President Obama, who supported the handgun ban in Washington, D.C., before it was over turned by the Supreme Court, since his election has watched various proposals to ban \"assault\" weapons, require handgun owners to submit to mental health evaluations and sparked a rush on ammunition purchases that caused some retailers to name him their salesman of the year. Now he apparently is going after citzens who reload their ammunition. \n \n It was during an official visit earlier this month to Mexico that he affirmed his support for a proposed international treaty that addresses \"firearms trafficking.\" \n \n If you reload your own ammo you may find yourself engaged in 'Illicit Manufacturing' of ammunition under an arms control treaty that President Obama started pushing last week in Mexico.\n \n Those thoughts may be in vain if the current administration is successful in getting the 'INTER-AMERICAN CONVENTION AGAINST THE ILLICIT MANUFACTURING OF AND TRAFFICKING IN FIREARMS, AMMUNITION, EXPLOSIVES, AND OTHER RELATED MATERIALS' treaty passed.\n \n The treaty defines \"illicit manufacturing\" as \"the manufacture or assembly of firearms, ammunition, explosives, and other related materials.\n \n Wonder what requirements you have to have to get a license, not to mention the price? If you collect antique reloading equipment do you also need a license?\n \n INTER-AMERICAN CONVENTION AGAINST THE ILLICIT MANUFACTURING OF AND TRAFFICKING IN FIREARMS, AMMUNITION, EXPLOSIVES, AND OTHER RELATED MATERIALS", 
   {
    "post_info": {
     "post_title": "new threat"
    }
   }, 
   null, 
   null, 
   1240443360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  new threat", 
  "url": "http://www.4forums.com/political/gun-control-debates/12601-new-threat.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12601, 
  "discussion_files": [
   [
    "14089.html", 
    "http://www.4forums.com/political/gun-control-debates/12601-new-threat-print.html"
   ]
  ], 
  "identifier": 12601
 }
]