[
 [
  [
   351197, 
   null, 
   "Brady", 
   "Washington, D.C.--U.S. court records from southwestern states clearly show that illegal gun traffickers involved in smuggling firearms to Mexico seek semiautomatic assault weapons, armor-piercing handguns, and 50 caliber anti-armor sniper rifles from U.S. gun shops according to a new report released today by the Violence Policy Center (VPC). \n \n \"The NRA has received a free ride with its undocumented assertions,\" Rand said. \"Now, for the first time, the American people can see detailed information on the types of military-style firearms illegal traffickers are buying in the United States and shipping to Mexican criminals. This is merely a snapshot of the kind of detailed information about tens of thousands of smuggled guns that the federal Bureau of Alcohol, Tobacco, Firearms, and Explosives has in its files but no longer releases to the public or our elected representatives on Capitol Hill.\" \n VPC - Press Release - (04/15/2009) - Mexican Gun Traffickers Easily Obtain Military-Style Weapons from U.S. Civilian Gun Market, New Analysis of Federal Criminal Court Records Confirms\n \n its obvious America needs alot more gun control if mexican criminals have no problem buying things like cop killer handguns and 50 caliber and assault weapons in US gun shops!", 
   {
    "post_info": {
     "post_title": "smoking gun proof alot more gun control needed"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1240729860.0
  ], 
  [
   351213, 
   null, 
   "OldSarge", 
   "Washington, D.C.--U.S. court records from southwestern states clearly show that illegal gun traffickers involved in smuggling firearms to Mexico seek semiautomatic assault weapons, armor-piercing handguns, and 50 caliber anti-armor sniper rifles from U.S. gun shops according to a new report released today by the Violence Policy Center (VPC). \n \n &#8220;The NRA has received a free ride with its undocumented assertions,&#8220; Rand said. &#8220;Now, for the first time, the American people can see detailed information on the types of military-style firearms illegal traffickers are buying in the United States and shipping to Mexican criminals. This is merely a snapshot of the kind of detailed information about tens of thousands of smuggled guns that the federal Bureau of Alcohol, Tobacco, Firearms, and Explosives has in its files but no longer releases to the public or our elected representatives on Capitol Hill.&#8221; \n VPC - Press Release - (04/15/2009) - Mexican Gun Traffickers Easily Obtain Military-Style Weapons from U.S. Civilian Gun Market, New Analysis of Federal Criminal Court Records Confirms\n \n its obvious America needs alot more gun control if mexican criminals have no problem buying things like cop killer handguns and 50 caliber and assault weapons in US gun shops!\n\n \n The VPC is hardly a real source. If any thing what this shows is the real and pressing need to close the border. Splain exactly how they get up here to do the dastardly deeds. What is interesting is how many laws were broken to buy and get the weapons back into Mexico. Sounds like a problem with lax enforcement. \n \n PS what exactly are \"cop killer handguns\" beyond an attempt to get the unknowing public aroused and enraged. The self same bunch of loons touted \"cop killer\" bullets and Hollywierd even jumped on the bandwagon with a movie. The only fly in the ointment was they couldn't trot out a single case when a LEO died from bullets penetrating the vest. ", 
   {
    "post_info": {
     "post_title": "its the border stupid"
    }
   }, 
   351197, 
   null, 
   1240750380.0
  ], 
  [
   351240, 
   null, 
   "NATO 556", 
   "its obvious America needs alot more gun control if mexican criminals have no problem buying things like cop killer handguns and 50 caliber and assault weapons in US gun shops!\n\n \n I saw a picture of one of the caches of weapons seized in Mexico. Amongst them were military-issue M16 rifles, with attached M203 grenade launchers, 40mm grenades, fragmentation grenades, IEDs, and short barreled rifles.\n \n Can you kindly tell us exactly which gun stores in America sell fragmentation grenades, 40mm grenades, 40mm grenade launchers, short barreled rifles, and military-issued machine guns?", 
   {}, 
   351197, 
   null, 
   1240764840.0
  ], 
  [
   351286, 
   null, 
   "Tither", 
   "This caught my eye. armor-piercing handguns, cop killer handguns. What exactly is an Armor piercing handgun? And who sells those? :)\n \n Nothing like making up some stuff to make the problem seem worse than it is. Handgun bullets that will defeat a policeman's vest are already illegal! Nothing like throwing in a few lies~!~", 
   {}, 
   351240, 
   null, 
   1240780320.0
  ], 
  [
   351336, 
   null, 
   "Charliegone", 
   "What a ridiculous \"study\" (if I could call it that.)\n \n Where should I start off? First off, it posts nothing, really, on how the 90% number is reached. It just spouts off some diatribe about how the NRA is lying and how they are right because ATF told them so. Where are the real numbers? The reason they fail to post it is because that 90% number is big lie. I already posted a graph showing how they got that number and also posted the right amount of guns traced (look around this section in gun control.)\n \n Secondly, they contradict themselves. If the Cartels are truly using ak-47's and ar-15's as they stated, why is there less ammunition of that type being confiscated? If the choice of weapon was the ak-47 and ar-15 they'd be finding a lot more than 4,000 rounds of 7.62 and a lot more of 5.56 nato. Do they really believe me to believe this? Heck I have a lot more ammo than they have confiscated which tells you a lot (basically that the guns of choice are NOT the ak-47 and the ar-15 and most likely smaller calibers like the 9mm or 40 cal. Not only that, they make the definition of \"assault weapon\" very broad including even guns that are NOT assault weapons as they are allowed to be imported (no \"non-sporting\" firearm may be imported into the US, the Saiga they listed is an imported firearm.) So, again what is an assault weapon and what is not? Like I said the term \"assault weapon\" is non-existent because the ban is no longer in effect and they no longer apply. Simply having a pistol grip allows the gun to be AW according to VPC, sorry, but that is plain \"puppy cow\" like one of my professors says.\n \n Another thing is they are relying on one particular case (the one that seems where they got all those number for their ammunition confiscation list). They neither elaborate on anymore cases like this because most likely they are non-existent or because they do not deal of anything of particular importance to them and their agenda.\n \n \n That being said, if gun dealers are knowingly dealing with people they know are smuggling across the border, they should be prosecuted. The ATF, while they do a crappy job in some respects, are doing a good job it seems on tracking down arms traffickers. That deserves merit, but it doesn't allow them or give them the authority to stomp on our liberties or demand certain laws that would make their \"job easier.\" Please next time post a study with some relevance. The VPC hardly touched on anything in this study that we didn't already know. They also try very hard to paint certain guns like the 5-7 as armory piercing (which is a big lie because hand gun armor piercing rounds are prohibited in the US).", 
   {}, 
   351286, 
   null, 
   1240805160.0
  ], 
  [
   351430, 
   null, 
   "Ethmi", 
   "You know, Sarge, Brady has also been known to toss up the Brady Campaign to End Gun Ownership as one of his \"sources\". Brady, even I thought you'd have the intelligence to notice that this article emphasizes that these \n \n\n illegal traffickers\n \n\n are taking\n \ntens of thousands of smuggled guns\n into Mexico. Even your \"source\" subtly acknowledges that the problem is with enforcement of the law, not absence of it. You can't stop logs from burning by throwing more logs on top.", 
   {}, 
   351336, 
   null, 
   1240870500.0
  ], 
  [
   351439, 
   null, 
   "OldSarge", 
   "And yet these liberals will challenge any source you may put up. It's right out of the leftard playbook. Loosely translated it means I certainly have zero facts, figures or arguments to refute your post but I will go after your source. So that will some how morph the attack into a refuting of your argument. We saw that at play in the attack on Worldnetdaily and Mr. Elmore.", 
   {
    "post_info": {
     "post_title": "Brady bunch"
    }
   }, 
   351430, 
   null, 
   1240875840.0
  ], 
  [
   351572, 
   null, 
   "Galileo", 
   "I saw a picture of one of the caches of weapons seized in Mexico. Amongst them were military-issue M16 rifles, with attached M203 grenade launchers, 40mm grenades, fragmentation grenades, IEDs, and short barreled rifles.\n \n Can you kindly tell us exactly which gun stores in America sell fragmentation grenades, 40mm grenades, 40mm grenade launchers, short barreled rifles, and military-issued machine guns?\n\n Is this a diversionary tactic? I don't see any claim being made about those types of weapons being sold in US gun stores. \n \n Someone mentioned armor piercing handguns. As I remember, there was a controversy about a type of Belgian handgun being sold in the US that could fire bullets which could possibly pierce body armor.", 
   {}, 
   351240, 
   null, 
   1240944720.0
  ], 
  [
   351582, 
   null, 
   "NATO 556", 
   "Is this a diversionary tactic? I don't see any claim being made about those types of weapons being sold in US gun stores.\n\n \n Not at all, I'm simply forcing those making the argument to address the undeniable facts.\n \n \nSomeone mentioned armor piercing handguns. As I remember, there was a controversy about a type of Belgian handgun being sold in the US that could fire bullets which could possibly pierce body armor.\n\n \n First, I'd like to see somebody try and penetrate a police vest with a handgun. Go ahead and find evidence that the whole gun can easily be shoved through a layer of kevlar like it's wet tissue paper. I'll wait.\n \n Second, the controversy was over the fact that The Brady Campaign didn't follow proper testing procedures when trying to prove that the 5.7 caliber has armor piercing capabilities. While nobody will deny that it does, the AP ammunition is specifically limited to military and police sales exclusively.", 
   {}, 
   351572, 
   null, 
   1240948740.0
  ], 
  [
   351588, 
   null, 
   "Tither", 
   "5.7 caliber has armor piercing capabilities. \n \n .... While nobody will deny that it does, the AP ammunition is specifically limited to military and police sales exclusively.\n\n Yep. Here in the U.S., the 5.7 ammo is the ordinary hollow point for Civilian use. It does not penetrate. It is not Armor Piercing.", 
   {}, 
   351582, 
   null, 
   1240951080.0
  ], 
  [
   351597, 
   null, 
   "Ethmi", 
   "Galileo, there is no such thing as an armour piercing firearm. There are armour piercing bullets, but no firearm is specifically designed to pierce armour.", 
   {}, 
   351588, 
   null, 
   1240961400.0
  ], 
  [
   351623, 
   null, 
   "OldSarge", 
   "Galileo, there is no such thing as an armour piercing firearm. There are armour piercing bullets, but no firearm is specifically designed to pierce armour.\n\n \n Its a buzz word like \"cop killer bullets\" created by the slavers to outrage the uneducated so to further their agenda. ", 
   {}, 
   351597, 
   null, 
   1240974960.0
  ], 
  [
   351637, 
   null, 
   "Galileo", 
   "Excerpts from the statement of an ATF agent to Congress:\n \n \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.....\n \n \"Drug traffickers are able to obtain firearms and ammunition more easily in the U.S., including sources in the secondary market such as gun shows and flea markets. Depending on State law, the private sale of firearms at those venues often does not require record keeping or background checks prior to the sale.\n \n \"In addition, drug traffickers frequently resort to using 'straw purchasers' to obtain firearms from federally licensed gun dealers in the U.S.; these dealers are often unwitting participants in these schemes. Straw purchases refer to instances wherein an individual purchases a firearm for someone who is either prohibited by law from possessing one, such as a convicted felon, or who does not want his or her name associated with the transaction.....\n \n \"Until recently drug traffickers' 'weapon of choice' had been .38 caliber handguns. However, they now have developed a preference for more powerful weapons, such as the .233 semi-automatic rifle, the AK-47 variant rifle, 5.57 caliber pistols, and .50 caliber rifles; ATF has seized each of these types of weapons as those weapons en route to Mexico. ATF also has seized large quantities of ammunition for use in these high-caliber weapons.\"\n http://appropriations.house.gov/Witness_testimony/CJS/William_Newell_03_24_09.pdf", 
   {
    "unicode_changes_made": true
   }, 
   351623, 
   null, 
   1240987440.0
  ], 
  [
   351657, 
   null, 
   "OldSarge", 
   "Excerpts from the statement of an ATF agent to Congress:\n \n \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.....\n \n That fiction has already been disproven.\n \n \"Drug traffickers are able to obtain firearms and ammunition more easily in the U.S., including sources in the secondary market such as gun shows and flea markets. Depending on State law, the private sale of firearms at those venues often does not require record keeping or background checks prior to the sale.\n \n Definate proof the border needs to be sealed. Why isn't it?\n \n \"In addition, drug traffickers frequently resort to using 'straw purchasers' to obtain firearms from federally licensed gun dealers in the U.S.; these dealers are often unwitting participants in these schemes. Straw purchases refer to instances wherein an individual purchases a firearm for someone who is either prohibited by law from possessing one, such as a convicted felon, or who does not want his or her name associated with the transaction.....\n \n If it is know that straw purchasers are used then why aren't they prosecuted to the full extent of the law and imprisoned?\n \n \"Until recently drug traffickers' 'weapon of choice' had been .38 caliber handguns. However, they now have developed a preference for more powerful weapons, such as the .233 semi-automatic rifle, the AK-47 variant rifle, 5.57 caliber pistols, and .50 caliber rifles; ATF has seized each of these types of weapons as those weapons en route to Mexico. ATF also has seized large quantities of ammunition for use in these high-caliber weapons.\"\n http://appropriations.house.gov/Witness_testimony/CJS/William_Newell_03_24_09.pdf\n\n \n Again why hasn't the border been sealed and more prosecutions under existing laws been done?", 
   {
    "post_info": {
     "post_title": "If gun control worked DC would not be the murder Capitol"
    }, 
    "unicode_changes_made": true
   }, 
   351637, 
   null, 
   1241010420.0
  ], 
  [
   351663, 
   null, 
   "NATO 556", 
   "\"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.....\n\n \n And it's been proven that only a handful of firearms have been sent to the ATF to trace, while the vast majority of all others haven't crossed the border yet.\n \n \n\"Drug traffickers are able to obtain firearms and ammunition more easily in the U.S., including sources in the secondary market such as gun shows and flea markets. Depending on State law, the private sale of firearms at those venues often does not require record keeping or background checks prior to the sale.\n\n \n So you're trying to tell us, that's it's easier to come to America and deal with massive amounts of paperwork, than it is to smuggle machine guns from Colombia? Somehow our 30,000 laws are easier to bypass than no law at all?\n \n \n\"In addition, drug traffickers frequently resort to using 'straw purchasers' to obtain firearms from federally licensed gun dealers in the U.S.; these dealers are often unwitting participants in these schemes. Straw purchases refer to instances wherein an individual purchases a firearm for someone who is either prohibited by law from possessing one, such as a convicted felon, or who does not want his or her name associated with the transaction.....\n\n \n Then close the damn border. Illegal aliens have no business being in this country, smuggling in drugs and the swine flu.\n \n \n\"Until recently drug traffickers' 'weapon of choice' had been .38 caliber handguns. However, they now have developed a preference for more powerful weapons, such as the .233 semi-automatic rifle, the AK-47 variant rifle, 5.57 caliber pistols, and .50 caliber rifles; ATF has seized each of these types of weapons as those weapons en route to Mexico. ATF also has seized large quantities of ammunition for use in these high-caliber weapons.\"\n http://appropriations.house.gov/Witness_testimony/CJS/William_Newell_03_24_09.pdf\n\n \n Proof, I demand proof! I demand to be shown the evidence that for the longest time, the only weapons to ever be seized from drug cartel members have been revolvers chambered for the .38 Special, and that absolutely nothing else has ever been used until a short time ago.\n \n The .38 Special revolver hasn't been used by either the military or the police in over two decades, I refuse to believe that the drug cartels would continue using an outdated sidearm as their weapon of choice, beyond that of any organized force.", 
   {
    "unicode_changes_made": true
   }, 
   351637, 
   null, 
   1241016960.0
  ], 
  [
   351667, 
   null, 
   "Superlite27", 
   "This Brady is the ULTIMATE TROLL!\n \n He does nothing but show up, post some totally ignorant ####, then leave, never to be heard from until his next incindiary lie-filled remark.\n \n What is an \"armor-piercing handgun\"? I have never seen an entire firearm penetrate armor. This handgun must be moving at an extremely high rate of speed in order to go through a tank.\n \n The clue to telling when a person is a completely non-viable source of information is when the person is so completely out of touch with reality that they make up stuff to use as propaganda, then believe their own propaganda.\n \n In essence: They have brainwashed...themselves!\n \n At this point, the fact that the ATF has ITSELF admitted to the inaccuracy that \"90% of traceable frearms used by Mexican drug cartels come from the U.S.\" is irrellevant. They admit that the traceable amount of weapons are a tiny percentage. The VAST MAJORITY are from third world countries.....\n \n ...but this means NOTHING. The TRUTH means NOTHING.\n \n When you have brainwashed yourself to the point that the truth is irrellevant, there is absolutely NO credibility to anything you have to say. When you make up terms in order to frighten, when you make up lies to propagate your agenda, and when you act like you are familiar with things that everyone knows don't even exist, you have obviously become a blind hack who ignorantly spouts the drivel that only you believe. The sad thing is, only Brady cannot see his own failing credibility. He has succesfully been brainwashed.......by himself.\n \n O.K. Mr. Firearms Expert: What exactly is a \"armor-piercing handgun\"? Is it a Sig P245? How about a Glock 21? Reminton 870? Smith and Wesson 686? What is the nomenclature of an \"armor piercing handgun\"?\n \n Well? Either you can tell me(hence: maybe a picture of an \"armor peircing handgun\"?), admit you have no idea what the hell you're talking about (hence:I'm right about you brainwashing youself into believing #### you have made up yourself), or you'll do what I suspect: Fail to post a response and we won't hear from you until your next attempt to start a flame war (hence: TROLL!)", 
   {}, 
   351663, 
   null, 
   1241019840.0
  ], 
  [
   351672, 
   null, 
   "Tither", 
   "Excerpts from the statement of an ATF agent to Congress:\n \n \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.....\n\n Keep selling the Lie and HOPE that America buys it! Huh Galileo? \n  Gun-rights supporters are misrepresented \n In other cases, stories have reported only partial truths in transparent attempts to link lawful gun ownership with criminal activity. For example, a recent Washington Post story reprinted in the Tribune cited a statistic that 90 percent of guns seized from criminals in Mexico that are submitted for tracing can be linked to the U.S. This statistic has been cited by many, including the secretary of state and attorney general, who argue that the vast majority of guns confiscated from drug traffickers and other criminals in Mexico came from the U.S. This has become a major justification advanced by anti-gun activists and politicians to justify stricter gun-control laws. However, those numbers are extremely misleading as the vast majority of guns confiscated by Mexican law enforcement cannot be traced. In fact, only about 17 percent of the total guns confiscated in Mexico have been traced to the U.S.\n\n \n   ATF beefs up efforts to stop gun trafficking \n Melson said 90 percent of the guns that U.S. officials have traced for Mexican authorities have come from the United States. Of those, most have been traced back to Texas, and within the state most came from the Houston area.\n \n \n \n\"Drug traffickers are able to obtain firearms and ammunition more easily in the U.S., ......... \"In addition, drug traffickers frequently resort to using 'straw purchasers' \n\n Well Duh! \n \n The answer has ALWAYS BEEN Drugs, and Drug Traffickers. Concentrate on them and you have the answer to the problems!", 
   {}, 
   351637, 
   null, 
   1241024340.0
  ], 
  [
   351743, 
   null, 
   "OldSarge", 
   "Gun Ownership at All-Time High, Violent Crime Near 30-Year Low \n \n Over the last two decades, many \"gun control\" laws have been eliminated or made less restrictive at the federal, state, and local levels. Numbers of privately-owned guns and Right-to-Carry states have risen to all-time highs. Every step of the way, \"gun control\" groups predicted violent crime would increase. Instead, violent crime decreased dramatically. \n \n Less \"Gun Control\": The Brady Act's handgun waiting period expired in 1998, in favor of the NRA-supported National Instant Check System. Some states thereafter eliminated waiting periods or purchase permit requirements. The federal \"assault weapon\" ban expired in 2004. Since 1987, 30 states have eliminated prohibitory or restrictive carry laws, in favor of Right-to-Carry (RTC) laws; there are now 40 RTC states. All states have hunter protection laws, 46 have range protection laws, 47 prohibit local jurisdictions from imposing gun laws more restrictive than state law, 44 protect the right to arms in their constitutions, and Congress and 33 states have prohibited frivolous lawsuits against the firearm industry.1 Studies by or for Congress, the Congressional Research Service, the Library of Congress, the National Institute of Justice, the National Academy of Sciences, and the Centers for Disease Control and Prevention have found no evidence that \"gun control\" reduces crime.2\n \n More Guns: The number of new guns rises by about 4.5 million every year.3 There are 250+ million privately-owned firearms in the United States.4\n \n Less Violent Crime: Since 1991, the nation's total violent crime rate is down 38 percent. (Murder is down 43 percent; rape, 29 percent; robbery, 46 percent; and aggravated assault, 35 percent.) Violent crime dropped every year from 1991-2004, to a 30-year low; increased slightly in 2005 and 2006; and decreased to nearly the 2004 level in 2007. Every year since 2002, the violent crime rate has been lower than anytime since 1974. Every year since 1999, the murder rate has been lower than anytime since 1966. States with RTC laws, compared to the rest of the country, have lower violent crime rates on average: total violent crime by 24 percent, murder, 28 percent; robbery, 50 percent; and aggravated assault, 11 percent.5\n \n Notes:\n \n 1. For fact sheets and gun law information, visit NRA-ILA ::. \n 2. Roth, Koper, et al., Impact Evaluation of the Public Safety and Recreational Firearms Use Protection Act of 1994, March 13, 1997, The Urban Institute | Search Reedy and Koper, \"Impact of handgun types on gun assault outcomes: a comparison of gun assaults involving semiautomatic pistols and revolvers,\" Injury Prevention 2003, http://ip.bmjjournals.com/cgi/reprint/9/2/151; Koper et al., Report to the National Institute of Justice, An Updated Assessment of the Federal Assault Weapons Ban: Impacts on Gun Markets and Gun Violence, 1994-2003, June 2004, Untitled Document Wm. J. Krouse, Congressional Research Service Report for Congress, \"Semiautomatic Assault Weapons Ban,\" Dec. 16, 2004; Library of Congress, Report for Congress: Firearms Regulations in Various Foreign Countries, May 1998, LL98-3, 97-2010; Task Force on Community Preventive Service, \"First Reports Evaluating the Effectiveness of Strategies for Preventing Violence: Firearms Laws,\" Morbidity and Mortaility Weekly Report, Oct. 3, 2003, www.cdc.gov/mmwr/preview/mmwrhtml/rr5214a2.htm; National Research Council, \"Firearms and Violence: A Critical Review,\" National Academies Press, 2005 , Firearms and Violence: A Critical Review.\n \n 3. BATFE, Annual Firearm Manufacturers and Export Reports, ATF Online.\n \n 4. BATFE estimated 215 million guns in 1999 (Crime Gun Trace Reports, 1999, National Report, Nov. 2000, p. ix , ATF Online - Crime Gun Trace Reports (1999) National Report). The National Academy of Sciences estimated 258 million (National Research Council, Firearms and Violence: A Critical Review, National Academies Press, 2005). The Bureau of Justice Statistics reports 72 million approved new and used firearm transactions by firearm dealers through the National Instant Check System between 1999-2007 (\"Background Checks for Firearm Transfers, 2007,\" Bureau of Justice Statistics - Background Checks for Firearm Transfers, 2007 - Statistical Tables - Table 1. Number of applications and estimates of denials for firearm transfers or permits since the inception of the Brady Act, 1994-2007).\n \n 5. FBI Table 4 - Crime in the United States 2007 Bureau of Justice Statistics, Bureau of Justice Statistics Crime and Justice Data Online. RTC comparison based on data in the FBI table.", 
   {
    "unicode_changes_made": true
   }, 
   351197, 
   null, 
   1241060280.0
  ], 
  [
   351744, 
   null, 
   "OldSarge", 
   "Anti-Gunners and .50 Cal. Rifles:\n Same Song, Different Gun \n \n Anti-gun groups and Rep. Jim Moran (D-Va.) are making far-fetched claims about crimes they believe might be committed with .50 caliber rifles.1 Urged on by such speculations, CBS and CNN recently aired unbalanced, irresponsible stories portraying the rifles as \"too dangerous to be in the hands of private citizens\" and \"a clear and present danger to the public safety.\"2 Instead, the facts are:\n \n .50 caliber rifles have existed since the 1860s. Those that use modern .50 cal. ammunition have existed for a half century. Those that anti-gunners attack now have existed since the 1980s. \n .50 caliber rifles are virtually unheard of in crime. Modern .50 caliber rifles are too large, heavy, and expensive for most criminals. They generally measure 4-5 feet in length, weigh between 22-34 pounds, and cost thousands of dollars. The VPC has identified only two crimes in the U.S. since 1992 in which a .50 caliber rifle was fired. \n Most .50 caliber owners use their rifles for long-range target shooting competitions. Long-range matches have been common for more than a century. For 20 years, the Fifty Caliber Shooters Association has been the nation's leading exponent of .50 caliber marksmanship competitions. \n Modern .50 caliber rifle ammunition was invented in the 1920s. Despite anti-gunners' claims, Mk211 .50 cal. rounds are not available to the public, but are restricted to military use only. \n The use of modern .50 caliber rifles by private citizens has played a key role in developing the rifles for subsequent military use. Most rifles, pistols, and shotguns used by today's military were first used by civilians. Civilians have owned most of the same firearms as the military throughout America's history. Under federal law, civilians have comprised the Militia of the U.S. since 1792, and federal law has encouraged civilian ownership of military firearms since 1905. \n Anti-gunners are just trying to manufacture an issue to rejuvenate their gun-banning agenda, which collapsed last year when Congress allowed the Clinton Gun Ban to expire, after independent studies for Congress showed that the ban had been a mistake.3 The Congressional Research Service's report also exposed anti-gun groups' false claims about the ban.4 Ultimately, anti-gunners always want to ban somethingÐall handguns, small handguns, semi-auto rifles, pump-action shotguns, .50 cal. rifles, or varmint-caliber pistols. But whatever the gun, anti-gunners' rhetoric is always the same.\n \n 1. Violence Policy Center: www.vpc.org/terror.htm; Brady Campaign: \"News Release,\" 2/14/05; Freedom States Alliance: www.50caliberterror.com; and Moran: \"Dear Colleague\" letter, 1/10/05.\n 2. CBS \"60 Minutes,\" Jan. 9, 2005; and CNN \"Paula Zahn Now,\" Feb. 17, 2005.\n 3. Urban Institute, \"Impact Evaluation of the Public Safety and Recreational Firearms Use Protection Act of 1994,\" 3/13/97; Koper et al., \"Impact of handgun types on gun assault outcomes,\" Injury Prevention, Sept. 2003; Koper et al., Report to the National Institute of Justice, An Updated Assessment of the Federal Assault Weapons Ban, June 2004.\n 4. CRS Report for Congress: Semiautomatic Assault Weapons Ban, Dec. 16, 2004.", 
   {}, 
   351743, 
   null, 
   1241060340.0
  ], 
  [
   351931, 
   null, 
   "Galileo", 
   " \n\n \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.....\n\n Keep selling the Lie and HOPE that America buys it! Huh Galileo? Keep selling the Lie and HOPE that America buys it! Huh Galileo? \n \n\n My source: \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.\"\n \n Tither's source: \"Melson said 90 percent of the guns that U.S. officials have traced for Mexican authorities have come from the United States.\"\n \n The above statements don't contradict each other. It makes no sense to accuse someone of \"selling the Lie\" about a statistic and then quote from a source which makes the same claim about that statistic.", 
   {}, 
   351672, 
   null, 
   1241169780.0
  ], 
  [
   351948, 
   null, 
   "OldSarge", 
   "My source: \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.\"\n \n Tither's source: \"Melson said 90 percent of the guns that U.S. officials have traced for Mexican authorities have come from the United States.\"\n \n The above statements don't contradict each other. It makes no sense to accuse someone of \"selling the Lie\" about a statistic and then quote from a source which makes the same claim about that statistic.\n\n \n No the ATFE contradicts the lie. And its a whopper. One of those urban legends that Goebbels would be proud of. Tell it enough times and maybe it will become true.\n \n The 90% number reported by Hoover came from a small group of weapons turned over to the U.S. for tracing, but they were by no means all of the weapons seized by Mexican authorities. A spokesman for the ATFE, Matt Allen, has now \"clarified\" the number and admitted that only 17% of the weapons found at crime scenes in Mexico have been traced to the U.S. Ironically, while Mexican officials have freely used the 90% number from the ATFE, they have not themselves made such a charge based on their own numbers. The truth is, they know better. ", 
   {
    "post_info": {
     "post_title": "the big lie"
    }
   }, 
   351931, 
   null, 
   1241184300.0
  ], 
  [
   351965, 
   null, 
   "NATO 556", 
   "My source: \"In fact, 90% of the firearms recovered in Mexico, and which are then successfully traced, were determined to have originated from various sources within the continental U.S.\"\n \n Tither's source: \"Melson said 90 percent of the guns that U.S. officials have traced for Mexican authorities have come from the United States.\"\n \n The above statements don't contradict each other. It makes no sense to accuse someone of \"selling the Lie\" about a statistic and then quote from a source which makes the same claim about that statistic.\n\n \n Give us the exact number of firearms that have been successfully traced to American sources. Come up with the number of weapons that were sold to the mexican government by the American government, how many were stolen, how many were last seen as being purchased illegally.", 
   {}, 
   351931, 
   null, 
   1241193540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  smoking gun proof alot more gun control needed", 
  "url": "http://www.4forums.com/political/gun-control-debates/12615-smoking-gun-proof-alot-more-gun-control-needed.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12615, 
  "discussion_files": [
   [
    "25519.html", 
    "http://www.4forums.com/political/gun-control-debates/12615-smoking-gun-proof-alot-more-gun-control-needed-print.html"
   ], 
   [
    "25520.html", 
    "http://www.4forums.com/political/gun-control-debates/12615-smoking-gun-proof-alot-more-gun-control-needed-2-print.html"
   ]
  ], 
  "identifier": 12615
 }
]