[
 [
  [
   351220, 
   null, 
   "OldSarge", 
   ".50 Caliber Rifles - Latest Bugaboo From Anti-Gun Fringe \n \n \n They aren`t used in crimes, but they might be one day.1 Not just any crimes, of course. No, they won`t be used to rob liquor stores, settle disputes between rival drug-trafficking gangs, or commit other crimes that happen in the real world. Costing thousands of dollars, measuring 4-5 feet in length, and weighing 22-34 pounds, they`re way too expensive and cumbersome for run-of-the-mill lowlifes. But, claim a few of the most radical anti-gun activists, they might--just might--be used to damage power transformers, armored limousines, and helicopters, crimes which may not make the police blotter in your (or anyone else`s) home town, but which happen all the time in \"action\" novels, movies, and TV shows, and, evidently, in the activists` imagination. Ridiculous in the extreme, this fear-mongering is currently being peddled by--you guessed it--the Violence Policy Center (VPC). Those who are familiar with the group might say, \"Consider the source,\" given its cynical positions and preposterous claims over the years. For a sampling of VPC nonsense, see page two.\n \n VPC`s Ultimate Goal -- Just as there can be no mistake about VPC`s credibility in this instance (or any other), there should be no mistake about its motives. VPC is not interested in restricting .50 caliber rifles alone. They are trying to create a bogus .50 caliber rifle \"issue,\" hoping to use it to achieve what they really want: to have the Bureau of Alcohol, Tobacco and Firearms (BATF, or ATF) given regulatory authority to ban all handguns, and to ban or severely restrict all other firearms.\n \n VPC proposes that .50 caliber rifles be restricted by giving BATF the authority to \"regulate the design, manufacture, and distribution of firearms and ammunition\" and to \"ban certain models or classes of weapons.\" VPC`s support for such a scheme is long-standing, though.2 In 1994, VPC disparaged the legislative process as \"piecemeal\" and said, \"It is essential that a comprehensive regulatory strategy be instituted at the federal level. . . . Handguns should be banned from future sale\" and \"ATF should be empowered to operate as a health and safety agency with the ability to set safety standards for firearms. . . (,) restrict the availability of specific firearms, classes of firearms and firearm products . . . (and) take immediate action to stop the sale and distribution of firearms or firearm products found to be `imminent hazards.`\"\n \n VPC Hypocrisy -- For many years, VPC has said that handguns should be banned because they are too small, but now says that .50 caliber rifles should be banned because they are too big. VPC calls .50 caliber rifles \"the exact opposite\" of \"assault weapons,\" but advocates restrictions on both anyway. After complaining about other bowls of porridge being too hot or too cold, Goldilocks at least eventually found a bowl that was \"just right.\" The VPC, though, will never agree that there is a gun that`s \"just right\" for the American people.\n \n .50 Caliber Rifle Facts \n \n \n .50 caliber rifles are not used in crimes. As desperate as VPC is to fault .50 caliber rifles, it cannot cite a single incident of their criminal misuse in the United States.\n \n Most people who own .50 caliber rifles are long range target shooting experts. For more than a century, long range target shooting competitions have attracted the interest of marksmen, and modern .50 caliber rifles are among the most accurate for long range shooting. The rifles are also among the most expensive made, confining their purchase to dedicated marksmen and collectors.\n \n .50 caliber rifle ammunition is not new, nor are its bullets the heaviest or the fastest available to sportsmen. Contrary to VPC`s claims, the ammunition used in modern .50 caliber rifles was invented in 1921. Its bullets are significantly lighter than hunting bullets introduced more than a century ago, and they travel slower than many commonplace rifles used for deer hunting and varmint control.\n \n Debunking the phony \"military-only\" argument. VPC argues that because .50 caliber rifles are used by the military, they should not be available to civilians. This false premise, also used against \"assault weapons,\" suffers at least two flaws. First, .50 caliber rifles used by the military were developed through the combined efforts of civilian target shooters, firearm engineers, and gunsmiths. (Similarly, civilians have played a leading role in improving the accuracy of the current U.S. Service Rifle, the M16, and its semi-automatic counterpart, the AR-15, defined as an \"assault weapon\" despite being the center-fire rifle most often used for marksmanship competitions in the U.S.). Second, civilians have always owned the same kinds of firearms as the military, and many firearms have been adopted by the military only after being widely adopted by hunters and target shooters.\n \n VPC Doozies\n \n VPC opposes firearm safety training because it might encourage people to own firearms and because \"the majority of such training would inevitably be conducted by NRA-certified instructors.\"\n \n VPC opposes trigger locking devices because they might encourage people to feel safer with guns.\n \n VPC opposes President Bush`s emphasis on prosecuting felons who illegally possess guns. Never blame the criminal, according to VPC ideology. Always, always blame the gun.\n \n VPC opposes popular action-oriented marksmanship competitions because they \"create new legal arguments in favor of non-sporting arms.\"\n \n VPC falsely claims that Florida`s Right to Carry law \"puts guns in the hands of criminals,\" earning the group a strong reprimand from Florida`s Secretary of State.\n \n VPC, campaigning for a ban on gun shows in Montgomery County, Md., facilities, falsely claims that guns may legally be sold to anyone at a gun show in Maryland. (Federal and Md. law prohibit selling firearms to felons, for example. Maryland prohibits the sale of any firearm to a minor under age 18 and requires those who sell firearms to possess a permit, or be licensed and thus required to run background checks on all purchasers.)\n \n VPC leader Josh Sugarmann, in 1988, advised anti-gun groups to begin campaigning against \"assault weapons\" because \"Handgun restriction consistently remains a non-issue with the vast majority of legislators, the press, and the public\" and \"Efforts to restrict assault weapons are more likely to succeed.\" He noted, \"the public`s confusion over (the difference between machine guns and semi-automatics);--anything that looks like a machine gun is assumed to be a machine gun--can only increase the chance of public support for restrictions.\" \n \n NRA-ILA :: .50 Caliber Rifles - Latest Bugaboo From Anti-Gun Fringe", 
   {
    "post_info": {
     "post_title": "speaks for itself"
    }
   }, 
   null, 
   null, 
   1240753560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  speaks for itself", 
  "url": "http://www.4forums.com/political/gun-control-debates/12616-speaks-itself.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12616, 
  "discussion_files": [
   [
    "28078.html", 
    "http://www.4forums.com/political/gun-control-debates/12616-speaks-itself-print.html"
   ]
  ], 
  "identifier": 12616
 }
]