[
 [
  [
   351371, 
   null, 
   "jazyjason", 
   "By The Associated Press\n 04.24.2009 4:58pm EDT\n \n (Milwaukee) Nearly seven months after defying a prohibition on endorsing candidates from the pulpit, 33 churches across the country are still waiting to learn whether the Internal Revenue Service will take action against them.\n \n The goal of \"Pulpit Freedom Sunday\" was to trigger a legal fight and ultimately overturn regulations that prevent places of worship from supporting or opposing candidates for office. But a conservative legal group that organized the effort says the IRS has yet to notify the churches of any investigation.\n \n Legal experts suggest a number of possibilities: The IRS has nothing to gain from a costly and mainly symbolic battle; it has limited resources; or it could still be deciding how to respond.\n \n On Sept. 28, participating pastors urged worshippers to vote according to conservative views on abortion and gay marriage. Several endorsed Republican presidential candidate John McCain.\n \n Under the IRS code, places of worship can distribute voter guides, run nonpartisan voter-registration drives and hold forums on issues, among other things. But they cannot endorse a candidate, nor can their political activity be biased for or against a candidate.\n \n Churches that violate the rule can lose their tax-exempt status.\n \n The protest was organized by the Phoenix-based Alliance Defense Fund and involved pastors in 22 states.\n \n \"The wheels of bureaucracy move slowly,\" said Erik Stanley, the group's senior legal counsel. \"We're prepared if they do come after these churches, and we're also prepared if they do not.\"\n \n IRS spokesman Christopher Miller declined to comment, and the agency would not confirm or deny whether it is conducting an investigation. At the time of the protest, the IRS said it would \"monitor the situation and take action as appropriate.\"\n \n ADF officials view the regulation as a violation of the pastors' right to free speech. Some legal scholars counter that the government has every right to treat political and nonpolitical speech differently.\n \n A number of the pastors said they hoped the IRS would respond immediately so the legal challenge could get under way.\n \n Luke Emrich, pastor at New Life Church in West Bend, Wis., had urged about 100 congregants to support an anti-abortion platform by voting for McCain. He said he was disappointed the IRS had not responded.\n \n \"It would have been nice to have a direct conversation with the IRS,\" he said. \"I thought they would at least contact us, talk to us about the issues.\"\n \n Historically, the IRS has been shy to investigate political activity in churches. It has stepped up oversight in recent years after receiving a flurry of complaints from the 2004 campaign. The IRS reported issuing written advisories against 42 churches for improper politically activity that year.\n \n It's possible the IRS ignored the recent protest because it does not have an incentive to pursue the issue, said Robert Tuttle, a professor of law and religion at George Washington University.\n \n \"It would be expensive for them to fight, and it would give people all sorts of reasons to say the IRS is evil and irreligious,\" Tuttle said. \"It's not like they're going to recoup a lot of money. Their attitude is probably 'why bother?'\"\n \n Or, it could be too early to say. When similar violations occurred during previous presidential elections, the IRS took two or three years to introduce litigation to strip a church of its tax-exempt status, said John Witte Jr., director of the Center for the Study of Law and Religion at Emory University.\n \n \"Even so, if the IRS wanted to pounce on this, I think it would have by now,\" Witte said. Perhaps it did not consider an investigation a wise use of resources, he speculated, or maybe the agency is occupied with more pressing cases.\n \n Stanley, the ADF's attorney, said the organization will continue its protests as long as necessary, holding annual Pulpit Freedom Sundays every year ahead of federal, state or local elections. If the IRS does not take action against future protests, he said, pastors will learn the regulation can be safely ignored.\n \n Polls suggest the campaign does not have wide support. An August survey from the Pew Forum on Religion and Public Life found that two-thirds of adults oppose political endorsements from churches and other places of worship. Another 52 percent wanted religious institutions out of politics altogether.\n \n But those statistics did not dissuade Pastor Paul Blair, who took part in the initiative at Fairview Baptist Church in Edmond, Okla. He said the main point of the protest was to make a stand to protect religious freedom.\n \n \"I don't let the federal government dictate to me what I can and cannot preach,\" he said. \"I answer to a higher power than the federal government.\"", 
   {
    "post_info": {
     "post_title": "Churches that staged protest wait for IRS response"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1240826640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Churches that staged protest wait for IRS response", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12619-churches-staged-protest-wait-irs-response.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12619, 
  "discussion_files": [
   [
    "17856.html", 
    "http://www.4forums.com/political/gay-rights-debates/12619-churches-staged-protest-wait-irs-response-print.html"
   ]
  ], 
  "identifier": 12619
 }
]