[
 [
  [
   351501, 
   null, 
   "foundit66", 
   "Some students at Ohio State University found that Colbert Satire was lost on a significant number of conservatives...\n Considering this is the same party that would label you as a \"terrorist sympathizer\" for disagreeing with their political approach to terrorism response, I can't say I am surprised...\n \n \nThis study investigated biased message processing of political satire in The Colbert Report and the influence of political ideology on perceptions of Stephen Colbert. Results indicate that political ideology influences biased processing of ambiguous political messages and source in late-night comedy. Using data from an experiment (N = 332), we found that individual-level political ideology significantly predicted perceptions of Colbert's political ideology. Additionally, there was no significant difference between the groups in thinking Colbert was funny, but conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. Conservatism also significantly predicted perceptions that Colbert disliked liberalism. Finally, a post hoc analysis revealed that perceptions of Colbert's political opinions fully mediated the relationship between political ideology and individual-level opinion.\n\n The Irony of Satire: Political Ideology and the Motivation to See What You Want to See in The Colbert Report -- LaMarre et al. 14 (2): 212 -- The International Journal of Press/Politics", 
   {
    "post_info": {
     "post_title": "The Irony: Satire Over the Head..."
    }
   }, 
   null, 
   null, 
   1240900140.0
  ], 
  [
   351516, 
   null, 
   "Jo Bennett", 
   "Could the preponderance of right wingers in the US be the cause of the global reputation of Americans not understanding irony?", 
   {}, 
   351501, 
   null, 
   1240902900.0
  ], 
  [
   351517, 
   null, 
   "electrolyte", 
   "Could the preponderance of right wingers in the US be the cause of the global reputation of Americans not understanding irony?\n\n and of Americans being holier-than-thou bastards, torturers, warmongers, economically irresponsible, and anti-scientific religio-bots.", 
   {}, 
   351516, 
   null, 
   1240904160.0
  ], 
  [
   351519, 
   null, 
   "Symbiote", 
   "Could the preponderance of right wingers in the US be the cause of the global reputation of Americans not understanding irony? \n\n \n It's more likely to be the preponderance of public education, also known to be a leading cause of illiteracy.", 
   {}, 
   351517, 
   null, 
   1240905060.0
  ], 
  [
   351541, 
   null, 
   "Ripskar", 
   "We had the same thing here with Nationalists believing that Alf Garnett was presenting a serious political position.", 
   {}, 
   351519, 
   null, 
   1240925760.0
  ], 
  [
   351568, 
   null, 
   "CUNxTime", 
   "I LOVE Colbert...he's a true conservative with a strong belief in the one true God and the path to salvation through Jesus Christ. I love the way he sticks it to Liberals and counter balances the horrid Daily Show!", 
   {}, 
   351541, 
   null, 
   1240942440.0
  ], 
  [
   351608, 
   null, 
   "Steeeeve", 
   "I LOVE Colbert...he's a true conservative with a strong belief in the one true God and the path to salvation through Jesus Christ. I love the way he sticks it to Liberals and counter balances the horrid Daily Show!\n\n \n Sarcasm doesn't really translate over the internet so please tell me you are joking here.", 
   {}, 
   351568, 
   null, 
   1240965420.0
  ], 
  [
   351622, 
   null, 
   "Penfold", 
   "We had the same thing here with Nationalists believing that Alf Garnett was presenting a serious political position.\n\n \n I believe Alf was toned down a lot and presented to America as Archie Bunker.", 
   {}, 
   351541, 
   null, 
   1240971300.0
  ], 
  [
   351640, 
   null, 
   "Jo Bennett", 
   "Sarcasm doesn't really translate over the internet so please tell me you are joking here.\n\n \n If memory serves CUNxTimes is an atheist so I'm reasonably sure he was joking.", 
   {}, 
   351608, 
   null, 
   1240988880.0
  ], 
  [
   351654, 
   null, 
   "Ripskar", 
   "I believe Alf was toned down a lot and presented to America as Archie Bunker.\n\n \n And eventually becoming Eric Cartman according to Wikipedia...", 
   {}, 
   351622, 
   null, 
   1241009520.0
  ], 
  [
   351670, 
   null, 
   "Steeeeve", 
   "If memory serves CUNxTimes is an atheist so I'm reasonably sure he was joking.\n\n \n Good because Colbert and Stewart are one in the same. Colbert appears to actually just care about entertaining while Stewart really seems to think he is providing a true news source. I hope this isn't true but after watching the beating of Jim Cramer on COMEDY CENTRAL I wonder. \n \n I think it is sad that teens and 20 year olds think this is actual news...if they do.", 
   {}, 
   351640, 
   null, 
   1241020920.0
  ], 
  [
   351687, 
   null, 
   "Jo Bennett", 
   "Good because Colbert and Stewart are one in the same. Colbert appears to actually just care about entertaining while Stewart really seems to think he is providing a true news source. I hope this isn't true but after watching the beating of Jim Cramer on COMEDY CENTRAL I wonder. \n \n I think it is sad that teens and 20 year olds think this is actual news...if they do.\n\n \n It contains more actual news than CNN, from what I've seen. Obviously it doesn't compare with a decent serious news programme, like Channel 4 News over here. I got the impression that Jon Stewart laid into Cramer because the situation was so ludicrous it wasn't funny any more, so the only way to play it was straight.", 
   {}, 
   351670, 
   null, 
   1241037300.0
  ], 
  [
   351699, 
   null, 
   "Steeeeve", 
   "It contains more actual news than CNN, from what I've seen. Obviously it doesn't compare with a decent serious news programme, like Channel 4 News over here. I got the impression that Jon Stewart laid into Cramer because the situation was so ludicrous it wasn't funny any more, so the only way to play it was straight.\nThe Daily Show is a comedic news show....if it isn't funny than don't put it on. \n \n Saying CNN is worse isn't really helping anything when both don't provide true news. Anyone who follows the daily show as a legitimate news story should be discredited in my opinion. It shows where our country/educational system is heading/is if that is our prime news source.", 
   {}, 
   351687, 
   null, 
   1241043540.0
  ], 
  [
   351706, 
   null, 
   "Penfold", 
   "You're not getting it. Liberals can see beyond the satire and parse the actual news from the comedic interpretation.....\n \n \" ... conservatives were more likely to report that Colbert only pretends to be joking and genuinely meant what he said while liberals were more likely to report that Colbert used satire and was not serious when offering political statements. ..... \"", 
   {}, 
   351699, 
   null, 
   1241046120.0
  ], 
  [
   351708, 
   null, 
   "CUNxTime", 
   "LOL yes I was joking...since i'm conservative I guess I haven't mastered Irony and Satire yet.emoticon_smile", 
   {}, 
   351706, 
   null, 
   1241048940.0
  ], 
  [
   351716, 
   null, 
   "Zardoz", 
   "LOL yes I was joking...since i'm conservative I guess I haven't mastered Irony and Satire yet.emoticon_smile\n\n \n No, you've got it down well enough...some are just immune to it's effects.", 
   {}, 
   351708, 
   null, 
   1241051040.0
  ], 
  [
   351719, 
   null, 
   "Steeeeve", 
   "No, you've got it down well enough...some are just immune to it's effects.\n\n \n After reading some of the posts on here it should be no surprise why I asked if he was serious or not.", 
   {}, 
   351716, 
   null, 
   1241052120.0
  ], 
  [
   351777, 
   null, 
   "Jo Bennett", 
   "The Daily Show is a comedic news show....if it isn't funny than don't put it on. \n\n \n But schadenfreude is even better than comedy emoticon_xclown\n \n \n\n Saying CNN is worse isn't really helping anything when both don't provide true news. Anyone who follows the daily show as a legitimate news story should be discredited in my opinion. It shows where our country/educational system is heading/is if that is our prime news source.\n\n \n I don't see you saying that anyone taking CNN, MSNBC etc. as their prime news source should be discredited. I treat the Daily Show as news commentary, though it does fill in a few bits and pieces of US news that don't make it to UK sources (not many, as it happens). Have you never heard the phrase \"many a true word spoken in jest\"?", 
   {}, 
   351699, 
   null, 
   1241076720.0
  ], 
  [
   351803, 
   null, 
   "Steeeeve", 
   "I don't see you saying that anyone taking CNN, MSNBC etc. as their prime news source should be discredited. I treat the Daily Show as news commentary, though it does fill in a few bits and pieces of US news that don't make it to UK sources (not many, as it happens). Have you never heard the phrase \"many a true word spoken in jest\"?\nThat's because CNN and MSNBC have to provide a few real news stories (or parts of one). In fact, I'm convinced if you watch the same story on MSNBC, CNN, and Fox News followed by a little digging on the internet you will have what actually happened from piecing things together. I've actually done this. If you use just the website stories, take the first sentence from each...find in the article where it sites an authority...look up the authority for the correct data...and make your own news story in your head. \n \n For example, take the 100 days news stories:\n \n Fox News: WASHINGTON -- President Obama turned the page on 100 days in office with an iffy boast about job creation and claims of fiscal prudence that are hard to square with his spending.\n \n CNN: President Obama said Wednesday that he's under no illusions that he'll have a \"rubber-stamp Senate\" now that Sen. Arlen Specter has switched parties to join the Democrats. \"To my Republican friends, I want them to realize that me reaching out to them has been genuine,\" Obama said at a prime time news conference capping his 100th day in office.\n \n First off, yes the front page of their website claim these are stories about 100 days in office. \n \n Second we can break down facts from these two opinion pieces...err..i mean news stories. We can see from Fox News that the budget is big this year, job creation is slow and jobs are in trouble, and maybe infer that our economy is bad. From CNN we see that Arlen Specter switched parties and Obama claims he wants to reach out to republicans.\n \n Fox News mentions the Bureau of Labor Statistics for jobs.\n Fox News mentions Committee for a Responsible Federal Budget for budget\n CNN quotes Obama directly\n CNN mentions World Health Organization for Swine Flu\n \n So Now we can go to those websites and find true facts about current issues in our society.\n \n Ha, kind of a long process just to get some News.", 
   {}, 
   351777, 
   null, 
   1241110320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Irony: Satire Over the Head...", 
  "url": "http://www.4forums.com/political/politics-debates/12626-irony-satire-over-head.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12626, 
  "discussion_files": [
   [
    "23637.html", 
    "http://www.4forums.com/political/politics-debates/12626-irony-satire-over-head-print.html"
   ], 
   [
    "23638.html", 
    "http://www.4forums.com/political/politics-debates/12626-irony-satire-over-head-2-print.html"
   ]
  ], 
  "identifier": 12626
 }
]