[
 [
  [
   352692, 
   null, 
   "antonia", 
   "It now comes down to this. Our doctors being taken away to prison in handcuffs by police -- protesting that 22,000 Americans die every year as a result of not having health coverage. That, while 65% of Americans want single payer, and 59% of the medical profession, this opinion isn't being heard right now in Congress. \n \n -------\n \n WASHINGTON - Doctors and other advocates of a national single-payer health system - also known as an improved Medicare for All - directly confronted senators at a Senate Finance Committee &#8220;roundtable&#8221; on health reform today.\n \n One-by-one, eight single-payer advocates in the audience stood up during the opening comments of the hearing and asked why single-payer experts were being excluded from the proceedings. They each spoke out in turn until they were removed from the committee hearing room and arrested, one-by-one, by U.S. Capitol police.\n \n The doctors and others said that a publicly funded, privately delivered single-payer system is the only solution to the crisis plaguing our nation&#8217;s non-system of health care, noting that single-payer national health insurance would guarantee coverage for everyone and contains costs.\n \n Despite polling that shows a clear majority of public and physician support for a single-payer system, Sen. Max Baucus (D-Mont.), chair of the Senate Finance Committee, has stated on multiple occasions that single payer is &#8220;off the table&#8221; of health reform.\n \n Today&#8217;s round table, the second of three, consisted of 15 witnesses with no single-payer advocates among them. By contrast, several witnesses have direct ties to the for-profit, private health insurance industry.\n \n The doctors and activists were dressed in black, which they said was in memory of the 22,000 people who die every year due to lack of health insurance. They represented a coalition of single-payer advocacy organizations including Physicians for a National Health Program (PNHP), Healthcare-NOW, Single Payer Action, Private Health Insurance Must Go, the Campaign for Fresh Air and Clean Politics, Prosperity Agenda, and Health Care for the Homeless.\n \n &#8220;Health insurance administrators are practicing medicine without a medical license,&#8221; said Dr. Margaret Flowers, co-chair of Maryland chapter of PNHP. &#8220;The result is the suffering and death of thousands of patients for the sake of private profit. The private health insurance industry has a solid grip on patients, providers and legislators. It is time to stand up and declare that health care is a human right.&#8221;\n \n Much to the frustration of Baucus, the multiple disruptions demanding single-payer be on the table set the tone for the second of three roundtables on Health Reform by the Senate Finance Committee.\n \n Katie Robbins, assistant national coordinator of Healthcare-NOW, said: &#8220;The current discussion on health reform is political theater at its best. Our elected officials are hosting these events to go through the motions of what developing effective national health policy should look like. There is a big difference between getting health policy experts in the room and the witnesses here today who would profit the most from reform. That difference means our hard-earned dollars will go to further insurance industry profits, not to guarantee health care to the American people.&#8221;\n \n &#8220;It&#8217;s a pretty spectacular display of raw political power,&#8221; said Russell Mokhiber of Single Payer Action. &#8220;The health insurance industry demands that not one of the 15 people who testified today shall be a single-payer advocate. And the industry gets what it wants. It&#8217;s time for the American people to storm the gates and demand - put single payer on the table.&#8221;\n \n Single payer is successfully implemented in the United States&#8217; own Medicare system providing comprehensive care to the elderly, as well as in many of the best health care systems in the world. A single-payer system, as embodied in legislation H.R. 676 and S. 703, would provide guaranteed, quality care to all Americans with no increase in U.S. health spending.\n \n The single-payer advocates said they will continue to use direct actions and nonviolent civil disobedience to urge the inclusion of a publicly funded, privately delivered system.\n \n Other methods of communication with elected officials have failed in delivering the demand for single-payer national health care as evidenced by the exclusion of single-payer advocates from official hearings on health reform.\n \n VIDEO footage:&#8232;Sen. Max Baucus (D-Mont.) reacts to protesters,&#8232;YouTube - Protester Delays Senate Committee Opening\n \n Russell Mokhiber, Single Payer Action, speaks at hearing&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Margaret Flowers, MD & Katie Robbins, Healthcare-NOW&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Carol Paris, MD, PNHP&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Mark Dudzic, Labor Campaign for Single-Payer Healthcare&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Adam Schneider, Health Care for the Homeless&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Pat Salomon, MD & Kevin Zeese&#8232;YouTube - Doctors protest exclusion of single-payer at Senate Finance Committee\n \n Doctors protest exclusion of single-payer at Senate Finance Committee | Physicians for a National Health Program\n \n -------------------------", 
   {
    "post_info": {
     "post_title": "Doctors Protest Exclusion of Single Payer at Senate Finance Committee"
    }
   }, 
   null, 
   null, 
   1241595000.0
  ], 
  [
   354611, 
   null, 
   "antonia", 
   "Thursday May 21, 2009\n by Single Payer Action\n \n Senator Max Baucus (D-Montana) drove up to the Kaiser Family Foundation in downtown Washington, D.C., this morning.\n \n His initial idea - park on G Street in front of the office building - and walk in the front door to meet reporters gathered inside.\n \n But activists from Single Payer Action were out front, waiting to question Baucus about why, over the past two weeks, he ordered thirteen of them arrested, handcuffed, and charged with \"disruption of Congress.\"\n \n Upon seeing the activists gathered at the front door, Baucus drove down a back alley to a rear service entrance.\n \n The activists followed him down the back alley.\n \n Baucus pulled up to Kaiser's service entrance.\n \n A large metal door opened.\n \n \"I asked Baucus to roll down his window so I could ask him a question,\" said Russell Mokhiber of Single Payer Action and the first person arrested at the Senate Finance Committee on May 5. \"But he shook his head no.\"\n \n Baucus drove into the service entrance and the security guards rolled down the metal door.\n \n \"I wanted to ask Senator Baucus whether it was pharmaceutical industry money or health insurance money that led him to prohibit any single payer advocate from testifying before the Senate Finance Committee which he chairs,\" Mokhiber said.\n \n According to a recent analysis by the group Consumer Watchdog, Senator Baucus, the leading architect of health reform in the Congress, has received more campaign contributions from the health insurance and pharmaceutical corporations than any other current Democratic member of the House or Senate.\n \n According to the report, Senator Baucus received $183,750 from health insurance companies and $229,020 from drug companies in the last two election cycles.\n \n During recent Senate Finance Committee hearings on health care reform, Baucus has refused to allow even one person to testify on behalf of a single payer health care system.\n \n Forty-one people have testified in three days of health care hearings before the Senate Finance Committee in recent weeks (13 testified on April 21, 15 testified on May 5, and 13 testified on May 12).\n \n Not one has been an advocate for a single payer, everybody in, nobody out, Medicare for all health insurance system.\n \n According to recent polls, single payer is supported by a majority of Americans, doctors and health economists.\n \n Baucus has been repeatedly asked over the past months to allow a single payer advocate to testify.\n \n He has steadfastly refused.\n \n Before the start of the May 5 hearing, a group of eight doctors, lawyers and other single advocates rose inside the Senate Finance Committee hearing room and one by one asked that Baucus open up the hearing to single payer advocates.\n \n Baucus refused and had the eight arrested, handcuffed, and charged with \"disruption of Congress.\"\n \n At the May 12 hearing, another five rose - this time nurses and doctors - and asked that Baucus hear from single payer advocates.\n \n Baucus again refused and had the five arrested and charged with \"disruption of Congress.\"\n \n The Baucus 13, as they call themselves, are scheduled to be arraigned starting next week.\n \n \"Senator Baucus is charging us with 'disruption of Congress,'\" Mokhiber said. \"But who\"s disrupting what? Here is the architect of health care reform in Congress. And he's taking hundreds of thousands of dollars from the drug and health insurance corporations. And sixty Americans are dying every day from lack of health insurance. And single payer is the only proven way to save the hundreds of billions of dollars in administrative overhead and profits needed to insure everyone. And the majority of Americans, doctors and health economists support single payer. And Baucus doesn't even allow one person out of 41 over three days of hearings on health care reform to testify on behalf of single payer? How corrupt is that?\"\n \n Kevin Zeese, another one of the Baucus 13 arrested on May 5, also wanted to question Baucus this morning.\n \n Zeese is the executive director of ProsperityAgenda.US.\n \n \"Senator Baucus is putting the interests of the insurance industry ahead of the health care of Americans,\" Zeese said. \"He is living up to his reputation as the 'Senator for K Street' and should no longer be considered the senator for Montana.\"\n \n t r u t h o u t | Baucus Flees From Single Payer Advocates", 
   {
    "post_info": {
     "post_title": "Baucus Flees From Single Payer Advocates"
    }
   }, 
   352692, 
   null, 
   1242983340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Doctors Protest Exclusion of Single Payer at Senate Finance Committee", 
  "url": "http://www.4forums.com/political/health-debates/12665-doctors-protest-exclusion-single-payer-senate-finance-committee.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 12665, 
  "discussion_files": [
   [
    "22182.html", 
    "http://www.4forums.com/political/health-debates/12665-doctors-protest-exclusion-single-payer-senate-finance-committee-print.html"
   ]
  ], 
  "identifier": 12665
 }
]