[
 [
  [
   352634, 
   null, 
   "foundit66", 
   "The US's highest ranking military officer has said it is not the US military's position to promote any specific religion, after Al Jazeera revealed footage of troops apparently preparing to convert Afghans to their Christian faith.\n \n \"From the United States' military's perspective, it is not our position to ever push any specific kind of religion, period,\" said Admiral Mike Mullen, the chairman of the Joint Chiefs of Staff, on Monday.\n \n The US military has also confiscated Bibles that Christian US soldiers in Afghanistan had apparently intended to give to local Muslims, a military spokesman told Al Jazeera.\n \n In addition, some of the soldiers who appeared in the video have also been reprimanded, US government and military officials told Al Jazeera's James Bays.\n \n The video, shot about a year ago, appeared to show military chaplains stationed in the US air base at Bagram discussing how to distribute copies of the Bible printed in the country's main Pashto and Dari languages.\n \n In one recorded sermon, Lieutenant-Colonel Gary Hensley, the chief of the US military chaplains in Afghanistan, tells soldiers that, as followers of Jesus Christ, they all have a responsibility \"to be witnesses for him\".\n \n \"The special forces guys - they hunt men basically. We do the same things as Christians, we hunt people for Jesus. We do, we hunt them down,\" he says.\n \n \"Get the hound of heaven after them, so we get them into the kingdom. That's what we do, that's our business.\"\n \n Questioned about the footage, Greg Julian, a US colonel in Afghanistan, told Al Jazeera: \"Most of this is taken out of context ... this is irresponsible and inappropriate journalism.\n \n \"This footage was taken a year ago ... the Bibles were taken into custody and not distributed.\n \n \"There is no effort to go out and proselytise to Afghans.\"\n\n US army 'does not promote religion'\n \n They confiscated BIBLES that were printed in FOREIGN LANGUAGES (to most U.S. military personnel)...\n WHY were these bibles printed in the LOCALS languages there then???\n \n The level of dishonesty some people apply is amazing!\n \n You have to check out the video. They EVEN MENTION the U.S. law which EXPLICITLY PROHIBITS proselytizing.\n (Starts at 1:10...)\n Then they call it \"giving gifts\" as an obvious way of getting around the law.\n :xbanghead :xbanghead \n YouTube - US troops urged to share faith in Afghanistan - 04 May 09\n \n Tell me something.\n If there is nothing wrong with \"giving gifts\", then WHY were these bibles confiscated????\n :xbanghead :xbanghead \n \n I love how they talk about \"giving gifts\", and then you have the quotes in the article (and in the video, \"hunt people for Jesus\").\n \n Jeremy Scahill: US Soldiers in Afghanistan Told to \"Hunt People for Jesus... So We Get Them into the Kingdom\" (Video)\n \n If the chaplains cannot observe the military law, they should not be there. Replace them with chaplains who will honor the military law.", 
   {
    "post_info": {
     "post_title": "U.S. Military Promoting Christianity"
    }
   }, 
   null, 
   null, 
   1241561400.0
  ], 
  [
   353071, 
   null, 
   "Anthony321", 
   "Anthony321:\n It's kind of like someone going into a Carl's Jr. and passing out McDonalds hamburgers.", 
   {}, 
   352634, 
   null, 
   1241871600.0
  ], 
  [
   353606, 
   null, 
   "Accipiter", 
   "Anthony321:\n It's kind of like someone going into a Carl's Jr. and passing out McDonalds hamburgers.\n\n \n Bravo on reducing religion to the stature of fast food, what a great insight!", 
   {}, 
   353071, 
   null, 
   1242243660.0
  ], 
  [
   353656, 
   null, 
   "Lakrite", 
   "Questioned about the footage, Greg Julian, a US colonel in Afghanistan, told Al Jazeera: \"Most of this is taken out of context ... this is irresponsible and inappropriate journalism.\n\n Why is that statement being ignored?", 
   {}, 
   353606, 
   null, 
   1242262200.0
  ], 
  [
   353658, 
   null, 
   "Penfold", 
   "Because he is minimising a significant breach with irrelevance in order to CHA.", 
   {}, 
   353656, 
   null, 
   1242262500.0
  ], 
  [
   353659, 
   null, 
   "Lakrite", 
   "Because he is minimising a significant breach with irrelevance.\n\n If something truly is taken out of context, it is not irrelevant to say so.", 
   {}, 
   353658, 
   null, 
   1242262560.0
  ], 
  [
   353676, 
   null, 
   "trebor", 
   "If something truly is taken out of context, it is not irrelevant to say so.\n\n \n Then, perhaps you can show what the context IS? Or, perhaps you can have a lone person complaining it was taken out of context.", 
   {}, 
   353659, 
   null, 
   1242271020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  U.S. Military Promoting Christianity", 
  "url": "http://www.4forums.com/political/religion-debates/12662-u-s-military-promoting-christianity.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12662, 
  "discussion_files": [
   [
    "17252.html", 
    "http://www.4forums.com/political/religion-debates/12662-u-s-military-promoting-christianity-print.html"
   ]
  ], 
  "identifier": 12662
 }
]