[
 [
  [
   352806, 
   null, 
   "foundit66", 
   "Numerous comments were made that were appalling, not the least of which were remarks by Mr. Ross which included the following; \"If a guy can't rape his wife...who's he gonna rape?\" and \"There wouldn't be an issue with domestic violence if women would learn to keep their mouths shut.\"\n \n Other members made their own contributions such as, \"We have the right to discipline our wives and children without the interference of government in our lives!\"\n \n These comments were greeted with laughter and affirmative responses by the group. Given the fact that they had referred to me in recent months as a \"femi-nazi\", the comments I was witness to at this meeting, while abhorrent, were unfortunately not surprising.\n\n The Mudflats Tune in to KUDO. New Revelations About Palin&#8217;s AG Pick.\n \n THIS is the guy Palin had chosen for Attorney General.\n \n Fortunately, Alaska told her what to do with her nomination...\n Alaska lawmakers reject Palin's choice, Ross, for attorney general | McClatchy\n \n The sad part is a lot of Republicans still think she would have been a good choice ...\n ... for president. emoticon_frazzled", 
   {
    "post_info": {
     "post_title": "Palin's Choice: Not Like Sophie's..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1241717160.0
  ], 
  [
   352807, 
   null, 
   "jyoshu", 
   "Why are the left still so obsessed with Palin? She didn't win. Good grief, let it go.", 
   {}, 
   352806, 
   null, 
   1241717880.0
  ], 
  [
   352813, 
   null, 
   "foundit66", 
   "Why are the left still so obsessed with Palin? She didn't win. Good grief, let it go.\n\n First of all, \"obsessed\"???\n \"Obsessed\" would be posting thousands of posts in one forum section.\n I haven't even mentioned Palin since a couple months ago, when I found out the evangelicals were trying to block the INVESTIGATION into \"trooper-gate\".\n And even then, that thread wasn't really about her but rather the efforts of some people to HALT a CRIMINAL INVESTIGATION for POLITICAL reasons.\n I wouldn't point any fingers on \"obsessed\" if I were you... emoticon_emb\n \n \n To repeat some relevance...\n \n The sad part is a lot of Republicans still think she would have been a good choice ...\n ... for president. emoticon_frazzled\n \n And for further good measure...\n When asked to choose among some of the GOP's top names for their choice for the party's 2012 presidential nominee, 64% say Palin. The next closest contenders are two former governors and unsuccessful challengers for the presidential nomination this year -- Mike Huckabee of Arkansas with 12% support and Mitt Romney of Massachusetts with 11%.Poll: 64 Percent Of Republicans Want Palin To Run In 2012\n \n \n And for the record, ???????????????\n Jyoshu, even if I redacted \"Palin's\" name from the entire article and just labeled it as \"an unnamed governor\", this would STILL BE NEWS.\n Any governor who nominates a guy for ATTORNEY GENERAL who says &#8220;If a guy can&#8217;t rape his wife&#8230;who&#8217;s he gonna rape?&#8221; and &#8220;There wouldn&#8217;t be an issue with domestic violence if women would learn to keep their mouths shut.&#8221; IS NEWS.\n \n I think a more interesting thing out of all this is how you looked at this article, BYPASSED the newsworthiness of the issue presented, and instead you start whining about *why are you obsessed with Palin?* ...", 
   {}, 
   352807, 
   null, 
   1241721300.0
  ], 
  [
   352849, 
   null, 
   "Steeeeve", 
   "Not that I support Palin...which I don't (although she has been treated like ####)...but there is nothing supporting the claims that this guy actually said what is claimed. Not to mention it is claimed by someone who hates Palin and is probably a nut in herself. So this guy may be terrible and Palin may be terrible but stick with the facts...this nonsense shouldn't even be commented on.", 
   {}, 
   352813, 
   null, 
   1241744100.0
  ], 
  [
   352895, 
   null, 
   "Charliegone", 
   "The Mudflats Tune in to KUDO. New Revelations About Palin's AG Pick.\n \n THIS is the guy Palin had chosen for Attorney General.\n \n Fortunately, Alaska told her what to do with her nomination...\n Alaska lawmakers reject Palin's choice, Ross, for attorney general | McClatchy\n \n The sad part is a lot of Republicans still think she would have been a good choice ...\n ... for president. emoticon_frazzled\n\n \n Seriously....emoticon_emb \n \n I could bring up Obama and his \"nominations\" that never made it because of something they did or didn't do...cough Daschle cough..", 
   {
    "unicode_changes_made": true
   }, 
   352806, 
   null, 
   1241765100.0
  ], 
  [
   352970, 
   null, 
   "foundit66", 
   "I could bring up Obama and his \"nominations\" that never made it because of something they did or didn't do...cough Daschle cough..\n\n ROFLMAO!\n \"something they did or didn't do\"?\n You're trying to compare apples to an apple orchard.\n \n Quite frankly, it's reminiscent of one of Bush's choices for a medical position, where the guy's wife essentially came out and accused him of anal rape.\n His excuse? The gynecologist said he couldn't tell the difference during sex... emoticon_frazzled\n \n If you're going to balk at not paying taxes, we've got some agreement.\n But don't try to put that in the same ball-park as what we've got here...", 
   {}, 
   352895, 
   null, 
   1241811240.0
  ], 
  [
   352981, 
   null, 
   "jyoshu", 
   "But don't try to put that in the same ball-park as what we've got here...\n\n \n Of course! Who would ever think a second-hand account of sexist remarks are in the same ball-park as a federally indictable offense (up to 5 years prison sentence) that was directly admitted to? Whew! Glad you feel that way too. emoticon_xangel", 
   {}, 
   352970, 
   null, 
   1241814540.0
  ], 
  [
   352988, 
   null, 
   "foundit66", 
   "Of course! Who would ever think a second-hand account of sexist remarks are in the same ball-park as a federally indictable offense (up to 5 years prison sentence) that was directly admitted to? Whew! Glad you feel that way too. emoticon_xangel\n\n And how many of those indictments have been handed down? emoticon_rolleyes\n And how often are people indicted for that offense?\n \n And for the record, those aren't just \"sexist remarks\", but rather a clear indication of how a guy who was nominated for ATTORNEY GENERAL thinks about crimes against women.\n \n It's a bit like a surgeon general nominee recommending witch doctors...\n \n \n And why is it that some guys can't just ADMIT that what happened was wrong?\n I think Obama royally screwed up in some of his nominations.\n But this thread WAS NOT ABOUT Obama or his nominations.\n \n Why can't Republicans just admit that PALIN royally screwed up?", 
   {}, 
   352981, 
   null, 
   1241815380.0
  ], 
  [
   353020, 
   null, 
   "jyoshu", 
   "Why can't Republicans just admit that PALIN royally screwed up?\n\n \n I think the real question is why is it so important to you and your ilk to keep bringing up Anything-Palin(TM)? She lost the election. She's not VP. The supermaket-tabloid-like junk has destroyed the credibility of what has sort of been an anti-Palin movement, and I think you'd do well to take the advice of one of your biggest multi-million $ activist groups and move on. It's like trying to return, over and over, to the John Edwards problem, except also being fixated to the point of reporting on any problems with his children and any problems they've had, trying to dig up junk on his wife, etc., etc. And then when an issue of a nomination or other OFFICIAL issue DOES come up (with 2nd hand heresay \"evidence\" to boot), people are naturally suspicious of intentions.", 
   {}, 
   352988, 
   null, 
   1241821200.0
  ], 
  [
   353021, 
   null, 
   "Steeeeve", 
   "And for the record, those aren't just \"sexist remarks\", but rather a clear indication of how a guy who was nominated for ATTORNEY GENERAL thinks about crimes against women.\nThe thing is this person has no evidence that the guy said anything like that! It would be like me claiming Obama likes killing small children and then claiming it was fact. This story has NO credibility and it is sad you take it as absolute fact.", 
   {}, 
   352988, 
   null, 
   1241821380.0
  ], 
  [
   353030, 
   null, 
   "Charliegone", 
   "ROFLMAO!\n \"something they did or didn't do\"?\n You're trying to compare apples to an apple orchard.\n \n Quite frankly, it's reminiscent of one of Bush's choices for a medical position, where the guy's wife essentially came out and accused him of anal rape.\n His excuse? The gynecologist said he couldn't tell the difference during sex... emoticon_frazzled\n \n If you're going to balk at not paying taxes, we've got some agreement.\n But don't try to put that in the same ball-park as what we've got here...\n\n \n ehhh last I check not paying taxes is a crime...saying sexist remarks is not, for the most part. Besides my point wasn't that. My point is inexperienced politicians will not make good choices when it comes to appointees, or they either view that their views are not a big deal. They still work at the whim of the Governor/ President, after all.", 
   {}, 
   352970, 
   null, 
   1241824440.0
  ], 
  [
   353067, 
   null, 
   "Steamroller", 
   "The thing is this person has no evidence that the guy said anything like that! It would be like me claiming Obama likes killing small children and then claiming it was fact. This story has NO credibility and it is said you take it as absolute fact.\n\n \n This is the quote I'd like to see a response to since I haven't seen or heard about this story.", 
   {}, 
   353021, 
   null, 
   1241852700.0
  ], 
  [
   353080, 
   null, 
   "Steeeeve", 
   "This is the quote I'd like to see a response to since I haven't seen or heard about this story.\nMe too! I will tell you one thing, you can always tell a biased person who doesn't care about the facts when he/she assumes anything that support his/her position is fact. It is similar to the nutcases who thought Obama wasn't a US citizen.", 
   {}, 
   353067, 
   null, 
   1241876220.0
  ], 
  [
   353116, 
   null, 
   "foundit66", 
   "The thing is this person has no evidence that the guy said anything like that!\n\n Last time I checked, somebody saying what they heard is evidence.\n \n \n \nehhh last I check not paying taxes is a crime...\n\n Last I checked, speeding was also a crime.\n Harriet Meiers was guilty of no crime, but she was rejected from Bush's nomination.\n \n The classification of a \"crime\" is irrelevant and myopic here.\n I am not saying that the \"not paying taxes\" should be overlooked. I think Obama should have taken that into serious consideration and rejected those that failed.\n \n But you're using \"it's a crime\" to ignore a bigger picture here...\n \n \n \nsaying sexist remarks is not, for the most part.\n\n emoticon_wow\n Do you get that we're talking about an ATTORNEY GENERAL who is talking about trivializing crimes against women...\n \n Your response is like me saying \"not paying taxes is not a war crime\".\n Of course that statement is grammatically true, but you're missing a much bigger point...\n \n \n \nBesides my point wasn't that. My point is inexperienced politicians will not make good choices when it comes to appointees, or they either view that their views are not a big deal.\n\n I recommend you look back at history to see how much time Gonzalez spent being asked questions about his position and the actions he took based on his position.\n Don't worry too much about his response, cause \"I don't recall\" ad nausieum is easy to sum up.", 
   {}, 
   353021, 
   null, 
   1241899620.0
  ], 
  [
   353134, 
   null, 
   "Steamroller", 
   "The Mudflats Tune in to KUDO. New Revelations About Palin's AG Pick.\n \n THIS is the guy Palin had chosen for Attorney General.\n \n Fortunately, Alaska told her what to do with her nomination...\n [url=http://www.mcclatchydc.com/homepage/story/66365.html]Alaska lawmakers reject Palin's choice, Ross, for attorney general | McClatchy\n\n \n How can you be so disingenuous? Is your credibility on display with this thread or are you just being antagonistic?\n \n The first piece of evidence you sited never mentioned your scandalous remarks.\n \n The second piece of evidence you sited comes from \"Mudflaps\" which is a decidedly left leaning website and has had an agenda against Palin from the first time she stated that she was pro-life. Does this mean Limbaugh quotes are now considered credible evidence on boths sides of the isle???\n The woman you quoted is also an advocate for single women/mothers. Mr. Ross apparently has litigated on behalf of single fathers and thier rights, making them natural adversaries. Leah, the woman you sited, is obviously bitter and willing to go after Mr. Ross' reputation.\n \n Your evidence also points out that Mr. Ross loss the appointment in large part because the Native population in Alaska did not believe he would defend thier interests and the state legislators responded to that call. \n \n \nLast time I checked, somebody saying what they heard is evidence.\n\n \n psst, Hey foundit66 wanna know what I just heard???\n \n \nLast I checked, speeding was also a crime.\n Harriet Meiers was guilty of no crime, but she was rejected from Bush's nomination..\n\n \n Classic. \n ACORN Manual, pg 23, paragraph 3. Subject: deflection.\n \n HARRIET MIERS???\n \n Harriet Miers withdrew her nomination because democrats insisted she give up documents relating to the advice she had given Bush as his legal council and because conservatives were not convinced of her positions regarding abortion and other conservative values. In addition she had never held the position as a judge so there was no record to refer to.\n \n But hang on to that thought about Harriet Miers as we await Chairman Obama's nomination to the High Court.\n \n Still waiting...... uh evidence??", 
   {
    "post_info": {
     "post_title": "OH Brother!!!"
    }, 
    "unicode_changes_made": true
   }, 
   353116, 
   null, 
   1241908260.0
  ], 
  [
   353144, 
   null, 
   "foundit66", 
   "How can you be so disingenuous? Is your credibility on display with this thread or are you just being antagonistic?\n\n < yawn <\n \n \n \nThe first piece of evidence you sited never mentioned your scandalous remarks.\n\n emoticon_confused\n I am now clicking on my first link.\n I am cutting and pasting from my first link.\n It says:Leah Burton is on with CC, sharing her testimony regarding Wayne Anthony Ross. She is a former citizen lobbyist who worked on behalf of families and children concerning child support, child custody, domestic violence, child abuse and sexual assault.\n \n She discusses a meeting of the group DADS, being run by Wayne Anthony Ross, and what she heard.\n  Numerous comments were made that were appalling, not the least of which were remarks by Mr. Ross which included the following; \"If a guy can't rape his wife...who's he gonna rape?\" and \"There wouldn't be an issue with domestic violence if women would learn to keep their mouths shut.\"The Mudflats Tune in to KUDO. New Revelations About Palin&#8217;s AG Pick.\n \n You appear to have a problem counting, as you then proceed to say ...\n \n \n \nThe second piece of evidence you sited comes from \"Mudflaps\" which is a decidedly left leaning website and has had an agenda against Palin from the first time she stated that she was pro-life.\n\n Actually, that was the FIRST piece of evidence.\n \n Also, you're shooting the messenger to ignore the message. The web-site is simply QUOTING ANOTHER PERSON's comments on the subject.\n \n But hey. Are you a Palin supporter?\n Are your comments from \"a decidedly right leaning poster who has an agenda with Palin\"???\n emoticon_rolleyes\n \n \n \nDoes this mean Limbaugh quotes are now considered credible evidence on boths sides of the isle???\n\n You don't know squat about me, so let me fill you in.\n If somebody quoted Limbaugh to me, I wouldn't try to blindly discount them because he was right-wing.\n I would LOOK at the statement and evaluate the accuracy of the claims.\n \n There are only a few resources I discount as an automatic response, and \"Paul Cameron\" is the only one that comes to mind. He has been proven to lie about gays on almost every occasion he has spoken about them, so he has achieved a special status.\n With that said, I typically ALSO demonstrate how his words are ALSO false, and not just say \"he's biased\" and have that be it... :xbanghead\n \n \n \nThe woman you quoted is also an advocate for single women/mothers. Mr. Ross apparently has litigated on behalf of single fathers and thier rights, making them natural adversaries. Leah, the woman you sited, is obviously bitter and willing to go after Mr. Ross' reputation.\n\n emoticon_rolleyes\n Again, you attack the messenger to ignore the message.\n So the woman has politics that are at odds with other people.\n That doesn't make her a liar.\n It doesn't make her statements a lie.\n \n Maybe I should ask what YOUR political positions are compared to these people, and blindly discount YOUR statements just cause of your position?\n :xbanghead\n \n \n \npsst, Hey foundit66 wanna know what I just heard???\n\n And your reply in no way refutes my statement.\n The fact that some people CAN lie doesn't mean that testimony should be discounted.\n \n \n \nClassic. \n ACORN Manual, pg 23, paragraph 3. Subject: deflection.\n\n I'm sorry, but do your reading comprehension capabilities prevent you from recognizing that I EXPLICITLY STATED that Obama screwed up in nominating the people who failed to pay their taxes???\n \n Furthermore, it wasn't \"deflection\".\n The previous poster made an EXPLICIT attempt at establishing a standard whereby breaking the law was to be automatically judged as more insidious than a non-law breaking offense.\n I was demonstrating the FALLACY of such an approach.\n \n I was responding DIRECTLY to what another poster was saying...\n \n \n \nHARRIET MIERS???\n\n Now this is hilarious.\n Somebody else brings up Obama, and there is NO complaint from you.\n I mention Harriet Meiers, and you whine like crazy.\n Hypocritical much?\n \n \n \nHarriet Miers withdrew her nomination because democrats insisted she give up documents relating to the advice she had given Bush as his legal council and because conservatives were not convinced of her positions regarding abortion and other conservative values. In addition she had never held the position as a judge so there was no record to refer to.\n\n I think you switched around the important aspects there.\n Democrats AND REPUBLICANS criticized Harriet Meiers cause she never held a position as a judge, much less had ANY REAL credentials which would warrant her position on SCOTUS.\n \n Harriet Meiers withdrew her nomination cause Bush did something stupid. She saved Bush face instead of Bush facing opposition from both Democrats AND REPUBLICANS... emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   353134, 
   null, 
   1241911380.0
  ], 
  [
   353147, 
   null, 
   "jyoshu", 
   "Last time I checked, somebody saying what they heard is evidence.\n\n \n Evidence, but not proof. You didn't just take it as evidence. If that's all you had taken it for, you wouldn't have a problem here. When you say things like ...\"THIS is the guy Palin had chosen for Attorney General.\"\n \n \"Any governor who nominates a guy for ATTORNEY GENERAL who says &#8220;If a guy can&#8217;t rape his wife&#8230;who&#8217;s he gonna rape?&#8221; and &#8220;There wouldn&#8217;t be an issue with domestic violence if women would learn to keep their mouths shut.&#8221; IS NEWS\"... you make it clear that you went farther than just taking it as evidence, but took it as gospel. THAT'S why people are calling you on it. You have a habit of doing that.", 
   {}, 
   353116, 
   null, 
   1241916360.0
  ], 
  [
   353150, 
   null, 
   "foundit66", 
   "Evidence, but not proof.\n\n I never said it was inequivocable proof... emoticon_rolleyes\n \n \n \nYou didn't just take it as evidence.\n\n CLAFCLOW.\n You have no basis for that claim.\n \n You believe your religion despite an even higher absence of proof, so don't presume to lecture me on this...\n \n \n \nIf that's all you had taken it for, you wouldn't have a problem here. When you say things like ...\"THIS is the guy Palin had chosen for Attorney General.\"\n \"Any governor who nominates a guy for ATTORNEY GENERAL who says \"If a guy can't rape his wife...who's he gonna rape?\" and \"There wouldn't be an issue with domestic violence if women would learn to keep their mouths shut.\" IS NEWS\"... you make it clear that you went farther than just taking it as evidence, but took it as gospel.\n\n Sigh.\n Jyoshu, the story appears credible.\n Me talking about that doesn't mean that there is automatically inequivocable proof.\n \n \n \nTHAT'S why people are calling you on it.\n\n BLOWI.\n I am responding to the people who have a variety of complaints.\n \n \n \nYou have a habit of doing that. \n\n You have a habit of doubting things when they are convenient for your cause, based on absolutely no evidence as you misrepresent the situation.\n Do you really want to get in a discussion on what we are in a \"habit of doing\"?\n \n I think a great place to start would be that article on \"Reagan v Obama\" you posted earlier. But of course, you post it and refuse to justify it when it's disputed and questioned.\n I see absolutely NO evidence of \"500 deaths\" since 2003. Can we start with that?\n emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   353147, 
   null, 
   1241919960.0
  ], 
  [
   353159, 
   null, 
   "jyoshu", 
   "I think a great place to start would be that article on \"Reagan v Obama\" you posted earlier. But of course, you post it and refuse to justify it when it's disputed and questioned. I see absolutely NO evidence of \"500 deaths\" since 2003. Can we start with that?\n\n \n Not sure why something that I've said nothing whatsoever about would be 'great place to start.' Regardless, clearly you didn't even try .... I mean, seriously .... emoticon_rolleyes I found information about it in the 3rd item of a Google search ... emoticon_frazzled\n \n http://trendsupdates.com/the-%E2%80%98sexual-cleansing%E2%80%99-of-iraq/\n \n Why are you even continuing this at this point, Foundit, when it's clear you're not even trying? emoticon_wow LOL", 
   {}, 
   352806, 
   null, 
   1241926500.0
  ], 
  [
   353163, 
   null, 
   "foundit66", 
   "Not sure why something that I've said nothing whatsoever about would be 'great place to start.'\n\n You posted the article.\n Unless you're just going to say you have no problem with posting junk?\n \n \n \nRegardless, clearly you didn't even try ....\n\n Jyoshu, it's the responsibility of the person PUTTING FORTH the claim to substantiate it.\n Remember?\n It's not my responsibility to find some source which could corroborate the statement...\n \n \n \nI mean, seriously .... emoticon_rolleyes I found information about it in the 3rd item of a Google search ... emoticon_frazzled\n The ?Sexual Cleansing? of Iraq | Trends Updates\n\n Seriously Jyoshu, that's funny.\n You denigrate the statements of people reporting what happened in a Ugandan conference, and now you offer THIS as evidence?\n \n Did you even bother to look at your \"resource\"?\n \n It claims 500, and links to its resource.\n Clicking THAT link brings us to another article claiming: \"There are documentary evidences of armed men engaged in persecuting homosexuals in Iraq. Nearly 480 gay, lesbian, bisexual, or transgender Iraqis have been killed mostly by the police since the invasion.\"\n Doesn't say WHERE this \"documentary evidence\" comes from, but if you look down at the bottom of the article...\n ... what do you see???\n \"Via IRAQI LGBT/Gays Without Borders\"\n \n That's right. Two \"gay agenda blogger\" groups (as you would refer to them)...\n Something you CRITICIZED ME for when it came to the \"Ugandan gay rights\" issue...\n \n ROFLMAO!\n \n So let's put this in perspective.\n Jyoshu CRITICIZES ME for putting up an article brought forth by a couple of Ugandan gay rights agenda people...\n ... and then to substantiate HIS OWN ARTICLE, he turns around and does EXACTLY THAT with some \"Iraqi\" gay rights agenda people... emoticon_xagree\n \n Hypocritical much Jyoshu???\n \n And to be clear, my item of contention is the NUMBER involved.\n Considering the nature of Iraq, I find it seriously difficult to believe that an accurate head count was obtained ...\n THAT is why I wanted substantiation...\n \n But based on this, can I happily conclude that you will NEVER AGAIN complain about \"gay blogger\" web-sites as resources, now that YOU YOURSELF have offered them as evidence???\n BUSTED!!!!\n \n \n \nWhy are you even continuing this at this point, Foundit, when it's clear you're not even trying? emoticon_wow LOL\n\n First of all, it's not on me to prove somebody else's claim...\n \n Second of all, when the proof WAS IN THE ARTICLE YOU WERE WHINING ABOUT, YOU could not even be bothered to click on the link...\n \n Again, your hypocrisy shines through! emoticon_xagree", 
   {}, 
   353159, 
   null, 
   1241931600.0
  ], 
  [
   353164, 
   null, 
   "Steamroller", 
   "< yawn <\n \n You appear to have a problem counting, as you then proceed to say ...\n Actually, that was the FIRST piece of evidence.\n \n Also, you're shooting the messenger to ignore the message. \n \n But hey. Are you a Palin supporter?\n Are your comments from \"a decidedly right leaning poster who has an agenda with Palin\"???\n \n You don't know squat about me, so let me fill you in.\n \n emoticon_rolleyes\n Again, you attack the messenger to ignore the message.\n \n Maybe I should ask what YOUR political positions are compared to these people, and blindly discount YOUR statements just cause of your position?\n \n And your reply in no way refutes my statement.\n \n I'm sorry, but do your reading comprehension capabilities prevent you from recognizing that I EXPLICITLY STATED that Obama screwed up in nominating the people who failed to pay their taxes???\n \n Now this is hilarious.\n Somebody else brings up Obama, and there is NO complaint from you.\n I mention Harriet Meiers, and you whine like crazy.\n Hypocritical much?\n \n I think you switched around the important aspects there.\n\n \n I didn't respond to the rest of your post as there was nothing there to respond to.\n \n I did, however, post the aspects of your post that either \"deflect\" the subject or attempt to make derogatory remarks toward me. It was nice to have met you Foundit66.", 
   {
    "post_info": {
     "post_title": "What a waste of time."
    }
   }, 
   353144, 
   null, 
   1241932980.0
  ], 
  [
   353165, 
   null, 
   "foundit66", 
   "I didn't respond to the rest of your post as there was nothing there to respond to.\n\n Again, < yawn < ...\n I'll leave it up to the viewing audience to see what they can see in the exchange...\n \n \n \nI did, however, post the aspects of your post that either \"deflect\" the subject or attempt to make derogatory remarks toward me. It was nice to have met you Foundit66.\n\n First of all, no \"deflection\", except in your statements here...\n You claim \"nothing to respond to\", and make a point of cutting out points that were EXPLICITLY made regarding your claims...\n \n And then, claim \"derogatory remarks toward me\", when you're just as guilty...\n emoticon_frazzled", 
   {}, 
   353164, 
   null, 
   1241934780.0
  ], 
  [
   353166, 
   null, 
   "jyoshu", 
   "Jyoshu, it's the responsibility of the person PUTTING FORTH the claim to substantiate it.\n\n \n (Shrug) If you were being honest about really wanting the information--rather than wanting to just belligerently 'one-up' someone in debate--you would have actually tried to do the MINIMAL amount of effort to find it out. If anyone's busted, it's you, bucko. :p\n \n \nSeriously Jyoshu, that's funny.\n You denigrate the statements of people reporting what happened in a Ugandan conference, and now you offer THIS as evidence?\n\n \n emoticon_rolleyes\n Foundit, seiously, get over yourself. I'm not \"offering\" you anything. Frankly, I don't care what you think of it, or your eagerness to try to point fingers over anything here. What I did was do your research for you, which you were too lazy to do. If you REALLY wanted the information, you'd have tried to get it; if you were even half as interested in actually trying to get information talking about this rather than just trying get 'got-cha' moments in these forums, you might actually find out some important information. You asked for the info, remember? What's absolutely FASCINATING is that you seem more interested in pointing fingers and make claims of \"hypocrisy\" than the all-too-possible issue of potentially 500 gays being killed. And it's pretty bizarre you would be arguing so much over all these gays being killed anyway. Once again, your argumentativeness outshines your arguments.", 
   {}, 
   353163, 
   null, 
   1241935500.0
  ], 
  [
   353168, 
   null, 
   "foundit66", 
   "(Shrug) If you were being honest about really wanting the information--rather than wanting to just belligerently 'one-up' someone in debate--you would have actually tried to do the MINIMAL amount of effort to find it out. If anyone's busted, it's you, bucko.\n\n Seriously...\n You need to take YOUR OWN ADVICE, especially regarding the Ugandan thread...\n For you to criticize me on that? Wow... emoticon_ic\n Let's just say that you have given me PLENTY to book-mark in this section, to remind you of at a later date... emoticon_xagree\n \n But as for me, I looked at the original article. I went through what was available in the links there.\n The article gave a variety of links peppered throughout the article, but in THAT section it was strangely devoid of any substantiation.\n \n I made an effort. I admit it wasn't exhaustive, but it sure as heck was a LOT more than you even bothered with on the Ugandan thread... emoticon_emb\n \n \n \nFoundit, seiously, get over yourself. I'm not \"offering\" you anything. Frankly, I don't care what you think of it, or your eagerness to try to point fingers over anything here.\n\n No. I've come to realize that about you.\n You are COMPLETELY comfortable with hypocrisy.\n \n On one thread, you'll whine about the thread claims being substantiated by two gay bloggers (which wasn't even accurate). You'll complain that isn't sufficient.\n But in THIS thread, when it is pointed out that YOUR resource is substantiated by two gay blogging resources, you don't even flinch.\n \n See, a person who gave an iota of concern over fairness and avoiding obvious hypocrisy would have simply said \"Yeah. You're right. I said that wasn't enough last time around, and it isn't enough here...\"\n But like I said, I've come to realize some things about you, so of course I don't expect that from you ... emoticon_frazzled\n \n \n \nWhat I did was do your research for you...\n\n WRONG! It was not \"my\" research to do. You did YOUR research...\n I never made the claim.\n It was NOT my responsibility to prove somebody else's claim.\n \n It was not \"my\" research to do.\n If anything, YOU posted an article giving that claim.\n If YOU want to put it forth as credible, YOU need to substantiate that claim.\n \n To quote your own words Jyoshu...\n \"If you are going to make that accusation, you need to pony up and prove it.\"\n ***Jyoshu\n \n But like I said, I know you're comfortable with hypocrisy...\n \n \n \n...you might actually find you'd make a difference here at times.\n\n ROFLMAO!\n Jyoshu. Seriously.\n I REALLY think you over-estimate your situation at times, and how things are perceived...\n \n \n \nYou asked for the info, remember?\n\n So if poster Jack makes a claim, and poster Mark challenges him on it, then it's MARK's responsibility to find proof of that claim???\n emoticon_frazzled\n \n You get seriously funny at times.\n \n \n \nWhether you are convinced or see it as evidence doesn't really matter, Foundit.\n\n See, this is where you SERIOUSLY don't get the situation.\n I asked for the source, and it looks like you found it.\n I was skeptical cause the nature of the info seemed improbable to assess.\n \n I look at the estimate as \"close enough for government work\", and what you fail to recognize is that I am not putting forth a fight to dispute it...\n \n What WAS interesting was how YOU treated the situation...\n Of course, again I don't expect any honest acknowledgement of YOUR hypocrisy in this matter either...\n \n \n \nIf you were SINCERELY asking for where the claim came from, then you should have made the tiny effort it would have taken to get the information...\n\n I did Jyoshu.\n I did what is typically expected in discussion exchanges.\n \n The person MAKING the claim is requested to SUBSTANTIATE the claim.\n \n But like I said, this whole post of yours is proving to be a GOLD-MINE for future quotes. Next time you challenge somebody for substantiation, it's gonna be interesting...\n If you were up to it (and I know you aren't) I would LOVE to take some of your comments here back to the Ugandan thread and just reply to some of your statements THERE with some of the quotes you made HERE...\n \n But like I said, I've come to recognize things about you and I don't expect you to be willing to do that...\n \n \n \nWhat's absolutely FASCINATING is that obviously trying to point fingers and make claims of \"hypocrisy\" is more important to you than the issue of potentially 500 gays being killed.\n\n Jyoshu, I've already addressed this issue MULTIPLE TIMES now.\n There are Iraqi people being killed. YES. That IS a tragedy.\n I have already commented on the general issue IN THE ORIGINAL IRAQ thread, remember???\n Plus, since there is no dispute on the Iraqi people being killed being an awful thing, what's the point in me repeatedly bringing it up?\n \n I am concerned, but I see no point in simply repeating myself in statements which were not addressed last time around.\n \n \n \nAnd it's pretty bizarre you wouldn't be arguing over all these gays being killed anyway. Once again, your argumentativeness shines over the actual issues themselves.\n\n BLOWI.\n I am not \"arguing over all these gays being killed\".\n I was asking for SUBSTANTIATION of the claim.\n I pointed that out in my LAST post, but with absolutely no surprise, you ignored my comments on that. emoticon_frazzled\n \n Well Jyoshu, thanks for all the great comments. I am sure I'll have plenty of opportunity to use them in the future...\n If you're interested in rejoining the Ugandan thread, PLEASE let me know.\n I'm sure the discussion will be much more fruitful now that you have contradicted yourself in your previous condemnation of \"two gay bloggings\" being insufficient, but here you have no complaints about them... emoticon_xagree", 
   {}, 
   353166, 
   null, 
   1241936580.0
  ], 
  [
   353213, 
   null, 
   "simone", 
   "Look! Palin's man is an underground member of the Taliban and Al-Qaeda and we don't need that in America!", 
   {}, 
   353168, 
   null, 
   1241977740.0
  ], 
  [
   353229, 
   null, 
   "Lakrite", 
   "I am finding this whole topic quite ironic. Palin is being criticized and attacked for her appointment choices, yet Obama, our president for God's sake, has made far more bad appointments. Just look at Tim Geithner. A treasury secretary who can't even pay his own taxes! Put him in charge of the money? If Palin had appointed someone like that I can assure you the criticism would rain down far harder.", 
   {}, 
   353213, 
   null, 
   1241986140.0
  ], 
  [
   353231, 
   null, 
   "foundit66", 
   "I am finding this whole topic quite ironic. Palin is being criticized and attacked for her appointment choices, yet Obama, our president for God's sake, has made far more bad appointments.\n\n Ahhh yes.\n The continual effort to change the topic...\n \n I take it that by your response, you are happy to condemn PALIN then, as vigorously as you condemn Obama????\n \n I personally think Obama royally screwed up in some of his appointments.\n I disagree that it was worse than Palin. \n \n \n \nIf Palin had appointed someone like that I can assure you the criticism would rain down far harder.\n\n And as it is, I see no criticism from you towards Palin... emoticon_frazzled\n \n Instead, you throw in Obama as an obfuscational ploy to avoid addressing Palin's screw-up...", 
   {}, 
   353229, 
   null, 
   1241986920.0
  ], 
  [
   353234, 
   null, 
   "Lakrite", 
   "Palin Wayne Anthony Ross | The Conservative American\n According to that site, the proof behind claims made against Ross came from somebody who apparently \"overheard him\" speaking about it.", 
   {}, 
   353231, 
   null, 
   1241987460.0
  ], 
  [
   353237, 
   null, 
   "jyoshu", 
   "Ahhh yes.\n The continual effort to change the topic...\n\n \n Yes, trying to talk about Uganda and 'hypocrisy' are indeed changes of topic here. What? Oh you meant someone else ... Oh, ok! emoticon_emb emoticon_xangel", 
   {}, 
   353231, 
   null, 
   1241988780.0
  ], 
  [
   353251, 
   null, 
   "foundit66", 
   "Palin Wayne Anthony Ross | The Conservative American\n According to that site, the proof behind claims made against Ross came from somebody who apparently \"overheard him\" speaking about it.\n\n According to the ORIGINAL WEB-SITE, the proof behind the claims came from somebody who \"heard\" him speaking about it...\n \n Classifying it as \"overheard\" or \"heard\" is meaningless semantics...\n \n \n \nYes, trying to talk about Uganda and 'hypocrisy' are indeed changes of topic here.\n\n I brought up something IN ADDITION TO the topic.\n \n Moreover to the point, YOU were the one who started criticizing ME with that lame \"You have a habit of doing that.\" line. Something CLEARLY extra-topical.\n I RESPONDED ON YOUR comment (you started the ball rolling) by pointing out where YOU were guilty of that, even moreso.\n \n If you don't like talking about criticizing others for not doing work, then YOU should never have brought it up in the first place.\n It's not my fault you habitually fail to live up to your own standards...\n \n And I'll take your failure to respond as an indication that you're cowardly ducking talking about your comments HERE in the context of your UGANDAN THREAD complaints.\n Cause that WOULD be going back to the \"topical\" realm, but you don't want to do that, do you...\n Again, not surprised...", 
   {}, 
   353234, 
   null, 
   1241998080.0
  ], 
  [
   353259, 
   null, 
   "jyoshu", 
   "I brought up something IN ADDITION TO the topic.\n\n \n LOL. Ok Foundit. I'm sure that's just NEVER the case when YOU criticize over it ... emoticon_rolleyes\n \n Foundit, I really don't think you want to get into a discussion here about 'criticizing' people--you quite simply have no standing to even be lecturing anyone on that. The bottom line is that either you TRULY wanted to know (in which case you'd actually try to find the source which was EMBARRASSINGLY easy to find, or you didn't and had ulterior motives for asking where the information came from. Apparently the latter is the case.\n \n \n.... Cause that WOULD be going back to the \"topical\" realm, but you don't want to do that, do you...\n\n \n Yeah, 'cause we all know that you bringing up a different thread (the Uganda one) and starting to talk about 'hypocrisy' was \"going back to the topical realm\" .... LOL :p emoticon_xangel", 
   {}, 
   353251, 
   null, 
   1242006060.0
  ], 
  [
   353270, 
   null, 
   "foundit66", 
   "LOL. Ok Foundit. I'm sure that's just NEVER the case when YOU criticize over it ... emoticon_rolleyes\n\n If you can show an example where I dropped the subject of discussion to fixate exclusively on a non-topical matter, then please do so.\n Otherwise, your innuendo is pointless and shallow.\n \n \n \nFoundit, I really don't think you want to get into a discussion here about 'criticizing' people\n\n Don't misrepresent what I said. I wasn't complaining about it. \n I was simply noting the ACTUAL SEQUENCE in which things happened when YOU started YOUR complaint.\n \n \n \n--you quite simply have no standing to even be lecturing anyone on that.\n\n Considering I wasn't lecturing anybody on that, your response is unwarranted...\n \n \n \nThe bottom line is that either you TRULY wanted to know (in which case you'd actually try to find the source which was EMBARRASSINGLY easy to find, or you didn't and had ulterior motives for asking where the information came from. Apparently the latter is the case.\n\n Jyoshu, I seriously don't think you recognize how the general public perceive these antics of yours.\n It is a generally accepted standard that people who make claims should substantiate them. That is all I was doing.\n \n As for \"ulterior motives\", my motive was in seeing the source of the claim.\n \n And more to the point, this criticism of yours is ridiculously shallow coming from you considering your conduct in the Ugandan conference thread.\n You even went as far as to complain that you didn't know what an abbreviation stood for, but if you had even bothered to click ON THE LINK GIVEN IN THE ARTICLE, you would have seen it right there... emoticon_emb\n \n \n \nYeah, 'cause we all know that you bringing up a different thread (the Uganda one) and starting to talk about 'hypocrisy' was \"going back to the topical realm\" .... \n\n Like I have told you on multiple occasions, it is understandable to include side-bars in the discussion, AS LONG AS the actual topic is not dropped entirely (which is what YOU DID) in an effort to fixate exclusively on the side-bar.\n \n I can't help it if you refuse to follow the topic.\n Your refusal to address my TOPICAL comments, and address SOLELY my side-bar comments are incredibly indicative of your attempts to blame others for your own actions... emoticon_frazzled", 
   {}, 
   353259, 
   null, 
   1242016260.0
  ], 
  [
   353297, 
   null, 
   "Steeeeve", 
   "Last time I checked, somebody saying what they heard is evidence.\nNot always credible evidence. This is not credible AT ALL and yet you seemingly take it as fact.\n \n It is said by a girl who hates Palin and has no audio and no secondary witness. Maybe the New York Times would pick this up but given todays media I would say this is not credible and therefore should not be listened to.", 
   {}, 
   353116, 
   null, 
   1242058740.0
  ], 
  [
   353323, 
   null, 
   "foundit66", 
   "Not always credible evidence. This is not credible AT ALL and yet you seemingly take it as fact.\n\n emoticon_rolleyes\n No. Not always credible.\n And I take it as credible.\n \n \n \nIt is said by a girl who hates Palin and has no audio and no secondary witness. Maybe the New York Times would pick this up but given todays media I would say this is not credible and therefore should not be listened to.\n\n The woman's bias is not automatic cause for dismissal. YOU are biased against gay equality, but that doesn't mean your testimony is meaningless.\n \n Newspapers have much higher standards for evidence.\n And as for \"should not be listened to\", considering you take the self-contradictory bible as fact, written by people who were furthering their own superstitions, you're hardly a person to be criticizing... emoticon_rolleyes", 
   {}, 
   353297, 
   null, 
   1242070380.0
  ], 
  [
   353341, 
   null, 
   "Steeeeve", 
   "emoticon_rolleyes\n No. Not always credible.\n And I take it as credible.\n \nThat speaks a lot about you and shows other posters they shouldn't take what you say at face value.\n \n \n \nThe woman's bias is not automatic cause for dismissal. YOU are biased against gay equality, but that doesn't mean your testimony is meaningless.\nYes it does. If I go before congress and say \"being gay is a choice without a doubt made at age 11\" and had NO evidence than I should be laughed at. Same thing as this woman. She makes a claim with no evidence and reason to lie. This makes you NOT credible. \n \n \nNewspapers have much higher standards for evidence.\nThan a legislative body? While probably true, this is sad because newspapers have none.", 
   {}, 
   353323, 
   null, 
   1242079380.0
  ], 
  [
   353352, 
   null, 
   "foundit66", 
   "That speaks a lot about you and shows other posters they shouldn't take what you say at face value.\n\n Honestly Steeeeve?\n Are you going to go back to your \"character assassination\" mode with me?\n \n All I am saying is that people's statements of other people's words are not always reliable.\n THIS statement strikes me as credible.\n Palin has a history of questionable associations. Her association with Alaska's AIP group is one good example.\n Such a nomination is in keeping with her poor choices...\n \n And quite frankly, I would LOVE for you to apply this standard of yours to other issues.\n Like people who say they \"know\" there is a God. Or make similar claims about their beliefs...\n Of course, that will never happen....\n \n All I am talking about is my belief on this person's statement. I could be wrong, but I see no evidence of that.\n \n \n \nYes it does. If I go before congress and say \"being gay is a choice without a doubt made at age 11\" and had NO evidence than I should be laughed at.\n\n Steeeeve, that's a really bad example as the statement can be SHOWN WRONG.\n If somebody presents evidence that this woman's statement is wrong, then so be it...\n \n \n \nSame thing as this woman. She makes a claim with no evidence and reason to lie. This makes you NOT credible. \n\n Steeeeve, you just described the vast majority of divorce cases.\n Does that mean the judge refuses to let the divorcing couple on the stand? emoticon_rolleyes", 
   {}, 
   353341, 
   null, 
   1242082980.0
  ], 
  [
   353389, 
   null, 
   "Steeeeve", 
   "Honestly Steeeeve?\n Are you going to go back to your \"character assassination\" mode with me?\nLets just be honest about it is all I'm saying. I mean archy posts here with some ridiculous sources and so I don't take what he says at face value because he takes biased sources as fact. It just is what it is. \n \n \nAll I am talking about is my belief on this person's statement. I could be wrong, but I see no evidence of that.\nAnd again speaks about what you think is appropriate. I would say there is no evidence this person did say that. \n \n \nIf somebody presents evidence that this woman's statement is wrong, then so be it...\nWhich is impossible to prove. You take hearsay as believable and I don't...that is all we need to know. \n \n \nSteeeeve, you just described the vast majority of divorce cases.\n Does that mean the judge refuses to let the divorcing couple on the stand? emoticon_rolleyes\nI have limited experience talking to judges who have heard divorces but from what I understand their testimony is not considered credible if they have reason to lie (such as more alimony).", 
   {}, 
   353352, 
   null, 
   1242098100.0
  ], 
  [
   353403, 
   null, 
   "foundit66", 
   "Lets just be honest about it is all I'm saying. I mean archy posts here with some ridiculous sources and so I don't take what he says at face value because he takes biased sources as fact. It just is what it is. \n\n \"ridiculous sources\" which can be shown \"ridiculous\" by INDEPENDENT EXAMINATION OF ACTUAL STATEMENTS.\n Not just \"they are against gays, ergo they can't be trusted\".\n \n Assuming a statement is wrong or cannot be trusted just because bias exists is not logical.\n \n \n \nAnd again speaks about what you think is appropriate. I would say there is no evidence this person did say that.\n\n By this logic, if a person confesses in a room with people (or just a person?) who don't like him, then that confession is assumed not credible as repeated by the witnesses...\n \n \n \nWhich is impossible to prove. You take hearsay as believable and I don't...that is all we need to know. \n\n How is that impossible to prove?\n From the article: \"She discusses a meeting of the group DADS, being run by Wayne Anthony Ross, and what she heard.\"\n Other people were there...\n \n You're discounting this without even looking at the article, aren't you...\n You did just enough research to see if she had a bias, discounted her because of it, and the rest of the situation be damned... emoticon_rolleyes\n \n \n \nI have limited experience talking to judges who have heard divorces but from what I understand their testimony is not considered credible if they have reason to lie (such as more alimony).\n\n But the testimony is given anyways, isn't it.\n It isn't prevented, is it...\n \n A defendant obviously has \"a reason to lie\", yet he gets on the stand.\n Are you telling me that you think judges automatically discount the words of the defendant??? :xbanghead\n \n People involved in a civil suit... One suing for money. Another looking to defend against having to give out money. Are their words automatically discounted?\n \n By your logic, if I think you have a reason to lie on that statement, it shouldn't be taken as credible.\n Considering your history with me, attacking me repeatedly, I would say you have a \"reason to lie\"... emoticon_rolleyes\n \n The people in the Bible could be said to have a reason to lie. Religious dogma passed down by the priests is a way of controlling the populace.\n Do you discount their word?\n \n \n My position is that a person should TAKE INTO ACCOUNT possible motive in assessing the situation.\n You cut-and-paste around the fact that I took OTHER things into account, such as Palin's other questionable choices. That should ALSO be considered.", 
   {}, 
   353389, 
   null, 
   1242101760.0
  ], 
  [
   353421, 
   null, 
   "Steeeeve", 
   "\"ridiculous sources\" which can be shown \"ridiculous\" by INDEPENDENT EXAMINATION OF ACTUAL STATEMENTS.\n Not just \"they are against gays, ergo they can't be trusted\".\n \n Assuming a statement is wrong or cannot be trusted just because bias exists is not logical.\nhearsay by a biased source cannot be trusted and in cases of archy this too would prove to make them ridiculous. \n \n \nBy this logic, if a person confesses in a room with people (or just a person?) who don't like him, then that confession is assumed not credible as repeated by the witnesses...\nNo, because you already assume the person said it. It would be like a person that hated you saying you confessed to a crime. This would not be credible. How is that hard to believe?\n \n \nHow is that impossible to prove?\nThere is no recording and no other witnesses. It would be ones persons word against the other....\n \n \nYou're discounting this without even looking at the article, aren't you...You did just enough research to see if she had a bias, discounted her because of it, and the rest of the situation be damned... emoticon_rolleyes\nI read the article, tracked down who said it, looked at her blog/articles and verified no other sources exist for what was supposedly said and finally did a quick search for any other controversial comments made by this guy (I admit that would be hard to find) and discounted her statement based upon that. This is insanely reasonable and I'm not sure how you could disagree. To review 1) no other witnesses 2) no recording 3)the only witness HATES Sarah Palin 4)No other evidence showing this guy would say such things\n \n I'd say that is compelling.\n \n \nBut the testimony is given anyways, isn't it.\n It isn't prevented, is it...\nAnyone can testify. \n \n \nA defendant obviously has \"a reason to lie\", yet he gets on the stand. Are you telling me that you think judges automatically discount the words of the defendant??? :xbanghead\nThey often are unless evidence supports the defendants claims. I see nothing wrong with that.\n \n \nPeople involved in a civil suit... One suing for money. Another looking to defend against having to give out money. Are their words automatically discounted?\nThe defendant doesn't have any burden of proof so it is really the person making the claim that has to provide evidence. If the only evidence is \"I say ____\" than case dismissed. \n \n \nBy your logic, if I think you have a reason to lie on that statement, it shouldn't be taken as credible.\n Considering your history with me, attacking me repeatedly, I would say you have a \"reason to lie\"... emoticon_rolleyes\nI don't really care if you believe me or not. \n \n \nMy position is that a person should TAKE INTO ACCOUNT possible motive in assessing the situation.\n You cut-and-paste around the fact that I took OTHER things into account, such as Palin's other questionable choices. That should ALSO be considered.\nThat has nothing to do with what this guy has supposedly said. Talk about guilt by association!", 
   {}, 
   353403, 
   null, 
   1242106020.0
  ], 
  [
   353423, 
   null, 
   "foundit66", 
   "hearsay by a biased source cannot be trusted and in cases of archy this too would prove to make them ridiculous.\n\n I guess we're different, in that I see more room for believing in something. Not so quick to dismiss it.\n \n \n \nNo, because you already assume the person said it. It would be like a person that hated you saying you confessed to a crime. This would not be credible. How is that hard to believe?\n\n See, the problem with your response is that you are IGNORING the possibility that the person DID say it.\n Your position basically assumes EVERYBODY who has a motive to do so is a liar and can't be trusted.\n \n \n \nThere is no recording and no other witnesses. It would be ones persons word against the other....\n\n The problem with that reply is that nobody has even shown if the other person denies saying it... emoticon_rolleyes\n But, you evidently have already ASSUMED that...\n \n \n \nI read the article, tracked down who said it, looked at her blog/articles and verified no other sources exist for what was supposedly said and finally did a quick search for any other controversial comments made by this guy (I admit that would be hard to find) and discounted her statement based upon that. This is insanely reasonable and I'm not sure how you could disagree. To review 1) no other witnesses 2) no recording 3)the only witness HATES Sarah Palin 4)No other evidence showing this guy would say such things\n I'd say that is compelling.\n\n The ADDITIONAL info has given a more substantial case for doubt.\n \n \n \nAnyone can testify. \n\n But WHY?\n If the standard supposedly is \"if you have a motive to lie, then you aren't credible\", then WHY are they allowed to testify anyways?\n \n \n \nThey often are unless evidence supports the defendants claims. I see nothing wrong with that.\n\n Wow.\n This whole thing is absurd, cause people DO have cases that boil down to \"he said / she said\".\n Convictions DO happen, nevertheless.\n \n \n \nThe defendant doesn't have any burden of proof so it is really the person making the claim that has to provide evidence. If the only evidence is \"I say ____\" than case dismissed. \n\n Um. I'm sorry but that's just plain false.\n Discrimination cases are a prime example.\n \n \n \nI don't really care if you believe me or not.\n\n But the problem is YOU YOURSELF violate your own standard.\n IF you have a motive to lie (as previously discussed), AND IF you hold to the standard you have previously explained, then YOU WOULD NOT TRY to offer your word as evidence of anything.\n \n IF you really believed that \"people with a motive to lie cannot be trusted\", then YOU WOULD NOT OFFER YOURSELF as a witness of condemnation against me.\n \n The real issue at hand is that your \"standard\" is not a hard and fast assumed rule. People are taken at their word all the time, even when they may have a motive to lie.\n Sure, there are plenty a good number who ARE NOT believed because of it, but BELIEVING them is not unprecedented.\n \n \n \nThat has nothing to do with what this guy has supposedly said. Talk about guilt by association!\n\n Actually, it has everything to do with it.\n If a guy has a history of spousal abuse, do you think that should just be ignored?\n That a new wive's family should not be concerned?\n \n It obviously is not conclusive evidence, but it is something.", 
   {}, 
   353421, 
   null, 
   1242106920.0
  ], 
  [
   353450, 
   null, 
   "Steeeeve", 
   "See, the problem with your response is that you are IGNORING the possibility that the person DID say it.\n Your position basically assumes EVERYBODY who has a motive to do so is a liar and can't be trusted.\nNo, it leaves that possibility there. All we can take from it is that someone who hates you says you confessed to a crime. They could be right but without any other evidence it is not trusted. \n \n \nThe problem with that reply is that nobody has even shown if the other person denies saying it... \n But, you evidently have already ASSUMED that...\nI don't assume they did or didn't. \n \n \n \nBut WHY?\n If the standard supposedly is \"if you have a motive to lie, then you aren't credible\", then WHY are they allowed to testify anyways?\nIn a court of law you can bring whatever witnesses you want. This is, in part, addressed in the constitution. \n \n \nBut the problem is YOU YOURSELF violate your own standard.\n IF you have a motive to lie (as previously discussed), AND IF you hold to the standard you have previously explained, then YOU WOULD NOT TRY to offer your word as evidence of anything.\n \n IF you really believed that \"people with a motive to lie cannot be trusted\", then YOU WOULD NOT OFFER YOURSELF as a witness of condemnation against me.\n \n The real issue at hand is that your \"standard\" is not a hard and fast assumed rule. People are taken at their word all the time, even when they may have a motive to lie.\n Sure, there are plenty a good number who ARE NOT believed because of it, but BELIEVING them is not unprecedented.\nI'm not saying you have to believe me. Frankly, I don't really care.\n \n \nActually, it has everything to do with it.\n If a guy has a history of spousal abuse, do you think that should just be ignored?\n That a new wive's family should not be concerned?\n \n It obviously is not conclusive evidence, but it is something.\nYet it is more like a guys friend has a history of spousal abuse so you should be concerned. The person has no history of saying things like that from what I can tell.", 
   {}, 
   353423, 
   null, 
   1242147180.0
  ], 
  [
   353485, 
   null, 
   "foundit66", 
   "No, it leaves that possibility there.\n\n The thing you don't recognize is that I am not criticizing you for your doubt.\n I acknowledge that doubt, and acknowledge the validity of that doubt.\n \n The problem here is that you are criticizing me for recognizing that possibility and believing in that possibility at a lower threshhold than you have. Well, at least on THIS issue...\n \n \n \nAll we can take from it is that someone who hates you says you confessed to a crime. They could be right but without any other evidence it is not trusted.\n\n Which is why I also pointed out Palin has a history of bad associations.\n \n \n \nI don't assume they did or didn't.\n\n Rrriiiggghhhttt....\n And that position is what prompted the following statement from you?\n Steeeeve: \"That speaks a lot about you and shows other posters they shouldn't take what you say at face value.\"\n \n You obviously weren't so open when you made that statement against me, based on my position on \"did or didn't\". emoticon_frazzled\n \n \n \nIn a court of law you can bring whatever witnesses you want. This is, in part, addressed in the constitution. \n I'm not saying you have to believe me. Frankly, I don't really care.\n\n And then you've got a jury. Possibly 12 people who get to determine guilt or innocence, based on something you claim that a judge would automatically assess as not credible... \n \n \n \nYet it is more like a guys friend has a history of spousal abuse so you should be concerned. The person has no history of saying things like that from what I can tell.\n\n The point is Palin has a history of crappy choices.\n THIS LAST one was presented by me as her latest crappy choice.\n THAT is HER history.\n \n And then, when Mary comes forth (who didn't like the new husband cause he was an abuser) and says that the wife told her that he is beating her, you automatically discount it.\n REFUSING to look at the REASONS for Mary's position.\n \n I guess by your logic, all a guy has to do to get acquitted is be a big enough jerk so that he makes anybody who could testify against him not like him.\n Ergo, they have a motive to lie!\n Ergo, their testimony can't be trusted!\n \n Look. All I am saying is that it is not unreasonable or unheard of to think a testimony is credible, even if that testifier has a reason to dislike the person involved.\n It sure as heck doesn't justify a character assassination statement from you...", 
   {}, 
   353450, 
   null, 
   1242167340.0
  ], 
  [
   353492, 
   null, 
   "Steeeeve", 
   "The thing you don't recognize is that I am not criticizing you for your doubt.\n I acknowledge that doubt, and acknowledge the validity of that doubt.\n \n The problem here is that you are criticizing me for recognizing that possibility and believing in that possibility at a lower threshhold than you have. Well, at least on THIS issue...\nI'm saying it is unreasonable for someone to take this as fact and thus make a judgment about Sarah Palin based on it..or in part on it. \n \n \nWhich is why I also pointed out Palin has a history of bad associations.\nWhich doesn't prove anything in terms of this guy. People think Obama had bad associations as well but to reflect this onto someone else just because they know each other is a bad way to judge.\n \n \n\n Rrriiiggghhhttt....\n And that position is what prompted the following statement from you?\n Steeeeve: \"That speaks a lot about you and shows other posters they shouldn't take what you say at face value.\"\nI said I didn't know if the other person denied saying it. I'm not sure what you are saying here.\n \n \nAnd then you've got a jury. Possibly 12 people who get to determine guilt or innocence, based on something you claim that a judge would automatically assess as not credible... \nThe jury can assess it as they wish actually....but in the end a theft saying \"I didn't do it\" is not exactly persuasive (granted in a trial it isn't the defendant who has to prove something...kind of the opposite of the scenario presented here).\n \n \nThe point is Palin has a history of crappy choices.\n THIS LAST one was presented by me as her latest crappy choice.\n THAT is HER history.\nBased upon something he said that no one can back up? I think that is a little unfair. If your point is to show Palin makes bad choices than mission failed because the first post clearly addresses what this guy said followed by a statement about Palin making a bad choice in this case. So either you made a terrible case for your point (by showing \"evidence\" that cannot be backed up) or you didn't present your point correctly. \n \n \nAnd then, when Mary comes forth (who didn't like the new husband cause he was an abuser) and says that the wife told her that he is beating her, you automatically discount it.\n REFUSING to look at the REASONS for Mary's position.\nAdding a little bit on here aren't you? If Mary has evidence than I'd hear that but Mary just saying it because she hates the husband is worthless testimony. \n \n In any event this example doesn't come close to matching the scenario addressed.\n \n \nI guess by your logic, all a guy has to do to get acquitted is be a big enough jerk so that he makes anybody who could testify against him not like him.\n Ergo, they have a motive to lie!\n Ergo, their testimony can't be trusted!\nNo, this is a manipulation of logic. If evidence is presented than this is credible. What if everyone hated a certain guy in town and his wife decided to tell the townspeople she was beaten by this unpopular guy. No other evidence exists (such as bruises or anything)...should the man be sent to prison? This again does not truly reflect the scenario addressed but I am curious about what you think here. \n \n \nLook. All I am saying is that it is not unreasonable or unheard of to think a testimony is credible, even if that testifier has a reason to dislike the person involved.\n It sure as heck doesn't justify a character assassination statement from you...\nI'd say it is unreasonable given no evidence. And how ironic you give me heat over character assassination after this is basically what this lady did to the Palin choice barring no evidence to support her claims...and you believe it.", 
   {}, 
   353485, 
   null, 
   1242170580.0
  ], 
  [
   353494, 
   null, 
   "foundit66", 
   "I'm saying it is unreasonable for someone to take this as fact and thus make a judgment about Sarah Palin based on it..or in part on it. \n\n There you go again. Exaggerating my position. I never called it fact.\n I think it's credible, but I wouldn't declare it as \"fact\". I am open to having contradicting evidence proposed.\n \n \n \nWhich doesn't prove anything in terms of this guy.\n\n Just like a prior spousal abuse doesn't prove he'll abuse the \"new\" spouse...\n \n \n \nPeople think Obama had bad associations as well but to reflect this onto someone else just because they know each other is a bad way to judge.\n\n Rev Wright? I've talked to a variety of people who go to a church they don't always agree with.\n Ayers? Hardly proves anything.\n \n Palin has a husband in the AIP.\n Palin has given some speaking greeting to the 2006 and 2008 AIP convention.\n It's an ongoing thing, for a group that is pretty much JUST about seceding.\n \n \n \nI said I didn't know if the other person denied saying it. I'm not sure what you are saying here.\n\n The point is comparing the nature of your original post and attack, compared to the current tenor.\n \n \n \nThe jury can assess it as they wish actually....but in the end a theft saying \"I didn't do it\" is not exactly persuasive (granted in a trial it isn't the defendant who has to prove something...kind of the opposite of the scenario presented here).\n\n I don't think you get the distinction.\n For ME, you talked about \"That speaks a lot about you and shows other posters they shouldn't take what you say at face value.\"\n \n But for a JURY who is put in the same situation, with the possibility of sending somebody to jail (or letting them go free) or awarding legal settlement, it's an \"assess it as they wish\" situation. emoticon_rolleyes\n \n \n \nBased upon something he said that no one can back up?\n\n To make some distinctions here, you presented some valid information that should also be considered in the big picture.\n The \"no one can back\" is part of that valid information.\n \n I am not contesting people's assessment on doubt.\n My point is that you attacked my original assessment of finding it credible.\n And Palin making crappy choices was part of my original information that I used.\n \n \n \nI think that is a little unfair. If your point is to show Palin makes bad choices than mission failed because the first post clearly addresses what this guy said followed by a statement about Palin making a bad choice in this case. So either you made a terrible case for your point (by showing \"evidence\" that cannot be backed up) or you didn't present your point correctly.\n\n Quite frankly, the Palin making bad choices has a plethora of history behind it. Not just this example.\n I was showing a CURRENT item in the news. THAT was the point.\n \n But the issue of Palin is a land-mine that I don't think we really need to expand upon here. Unless you're going to question the general assessment of \"Palin making bad choices\". \n \n \n \nAdding a little bit on here aren't you?\n\n \"Adding a little bit\"???\n YOU established a standard earlier of automatic DOUBT AND DISMISSAL.\n \n I am showing how such a standard is premature and presumptuous.\n So I am showing EXAMPLES of how your standard can be just plain wrong.\n \n One other example exists in child abuse.\n One symptom of child abuse is for the child to LASH OUT and ACT UP. Become a \"bad child\" in the perception of others.\n But if that child subsequently tries to come forth and inform people about the child abuse, some people DISCOUNT that claim as just another lie the kid is telling.\n Because of the NATURE of the actual act, there is a misdiagnosis.\n \n Now I am not saying every accusation of child abuse is legit. I am not saying that any time a \"bad child\" makes an accusation it is legit.\n What I am saying is that AUTOMATIC DISMISSAL based on such information is NOT legit.\n \n \n \nIf Mary has evidence than I'd hear that but Mary just saying it because she hates the husband is worthless testimony.\n\n And the fact that Palin has a history of poor choices is somehow inadmissable???\n \n Palin is (by analogy) the spouse abuser.\n Here, we have a new case of that problem with the A.G. nomination.\n \n You DO NOT KNOW if \"mary\" is \"just saying it because she hates the husband\". THAT is the point.\n You discounting the information because she COULD BE \"just saying it because she hates the husband\" is a problem.\n There could be LEGITIMATE GROUNDS for that emotional response.\n \n \n \nIn any event this example doesn't come close to matching the scenario addressed.\n\n It's an analogy showing past abuse.\n \n \n \nNo, this is a manipulation of logic. If evidence is presented than this is credible.\n\n The situation (by analogy) would be JUST eye-witness testimony.\n Eye-witness testimony from people who didn't like the defendant.\n IGNORING the issue as to whether or not they had just cause to dislike the defendant.\n By analogy, the testimony IS the evidence, but your position refuses to allow it.\n \n \n \nWhat if everyone hated a certain guy in town and his wife decided to tell the townspeople she was beaten by this unpopular guy. No other evidence exists (such as bruises or anything)...should the man be sent to prison?\n\n RIGHT HERE is where you don't get the difference.\n I never said ANYTHING about sending the man to prison.\n I was just presenting information I saw as credible.\n \n The case needs to be evaluated FOR WHAT IT IS.\n Ironically, that is in keeping with something YOU just said: Steeeeve: \"The jury can assess it as they wish actually\"\n By your standard, you would automatically think the claim as noncredible. So a guy who is careful in abusing his wife can get away with it (with your hypothetical jury vote), just cause he was smart enough to discredit people's testimony by making them mad against him first.\n \n \n \nI'd say it is unreasonable given no evidence. And how ironic you give me heat over character assassination after this is basically what this lady did to the Palin choice barring no evidence to support her claims...and you believe it.\n\n Steeeeve, you've got a history of jumping in, dropping insulting comments on me, and then running off.\n There's actually a thread I have bookmarked where you claimed you would offer evidence, but then you never got back to it.\n \n Furthermore, your attacks were hypocritical as you would bash me for attacks, and you yourself would be committing them. THAT is why I started simply reporting your abuses, and asking you to do the same.\n But of course, I saw no admin e-mails correcting me for dialogue with you, and I did see the admin correct some of your posts removing offensive content.\n \n The \"character assassination\" here is how you jump to a conclusion without the facts. The reason I think Palin makes crappy choices are abundant.\n \n If you want me to dig up that bookmark, I think I've still got it and you can show if your \"reasons\" have any validity... emoticon_rolleyes\n \n Furthermore, I think you fail to recognize a significant difference.\n I'm just another internet poster.\n Palin has been shown to have PLURALITY SUPPORT WITHIN the RNC for the next presidential nod.\n So if I post something about her, that's got some importance to it.\n You picking up again on your character assassination on me? You're just fixating for reasons you often fail to defend.", 
   {}, 
   353492, 
   null, 
   1242172440.0
  ], 
  [
   353495, 
   null, 
   "foundit66", 
   "And on the issue of Obama, Steeeeve, one of the best belly laughs I have had recently was to the following joke...Q: What's the difference between Jesus and Obama?\n A: Jesus could build a cabinet.\n \n With Obama, I don't trust any of his nominations based on his say-so. They need to be put through the wringer and inspected heavily, based on his past mistakes.", 
   {}, 
   353494, 
   null, 
   1242173400.0
  ], 
  [
   353566, 
   null, 
   "jyoshu", 
   "\n If you want me to dig up that bookmark, I think I've still got it and you can show if your \"reasons\" have any validity... emoticon_rolleyes\n\n \n Dude, you must have the longest bookmarks list ever, given how much I've seen you say you're \"bookmarking this post\" or that you have something bookmarked. Do you really bookmark peoples' posts?? I find that fascinating.\n \n \n\n I'm just another internet poster.\n Palin has been shown to have PLURALITY SUPPORT WITHIN the RNC for the next presidential nod.\n\n \n If there's one thing I've learned, it's that such really means little at this point. Way back well before the last presidential election, a lot of people thought Fred Thompson was going to be the man, and there was \"plurality of support\" behind him. Didn't happen. No one ever even HEARS about him now. It's too early for that to even factor in.", 
   {}, 
   353494, 
   null, 
   1242228300.0
  ], 
  [
   353578, 
   null, 
   "Steeeeve", 
   "And on the issue of Obama, Steeeeve, one of the best belly laughs I have had recently was to the following joke...Q: What's the difference between Jesus and Obama?\n A: Jesus could build a cabinet.\n \n With Obama, I don't trust any of his nominations based on his say-so. They need to be put through the wringer and inspected heavily, based on his past mistakes.\n\n \n Haha, that's actually a pretty good one emoticon_xhoho", 
   {}, 
   353495, 
   null, 
   1242233100.0
  ], 
  [
   353590, 
   null, 
   "Steeeeve", 
   "Just like a prior spousal abuse doesn't prove he'll abuse the \"new\" spouse...\nYes it does. But that is not the case here. There is no indication this guy had said things in the past.\n \n \nRev Wright? I've talked to a variety of people who go to a church they don't always agree with.\n Ayers? Hardly proves anything.\n \n Palin has a husband in the AIP.\n Palin has given some speaking greeting to the 2006 and 2008 AIP convention.\n It's an ongoing thing, for a group that is pretty much JUST about seceding.\nBad associations are bad associations... in any event I don't care about them.\n \n As for the Palin AIP thing...this is also ridiculous and further proves that you need to reexamine the way you make judgments. FactCheck.org: Sliming Palin\n \n Clearly not a big issue and certainly doesn't show Palin associates with bad people. \n \n \nI don't think you get the distinction.\n For ME, you talked about \"That speaks a lot about you and shows other posters they shouldn't take what you say at face value.\"\n \n But for a JURY who is put in the same situation, with the possibility of sending somebody to jail (or letting them go free) or awarding legal settlement, it's an \"assess it as they wish\" situation.\nTo make this more relevant...if the prosecution stated \"so and so did it\" without and evidence and the jury believed them than I would question their ability to make a judgment.\n \n\n My point is that you attacked my original assessment of finding it credible.\n And Palin making crappy choices was part of my original information that I used.\nI think this is poor judgment. If Obama appoints another cabinet person I'm not going to assume the person had a tax problem even if Rush Limbaugh says he heard he does.\n \n \nQuite frankly, the Palin making bad choices has a plethora of history behind it. Not just this example.\n I was showing a CURRENT item in the news. THAT was the point.\nWell don't use some rumor to prove that point.\n \n \nBut the issue of Palin is a land-mine that I don't think we really need to expand upon here. Unless you're going to question the general assessment of \"Palin making bad choices\". \nReviewing Palin is not worth my time because she is the governor of a far away state\n \n \nOne other example exists in child abuse.\n One symptom of child abuse is for the child to LASH OUT and ACT UP. Become a \"bad child\" in the perception of others.\n But if that child subsequently tries to come forth and inform people about the child abuse, some people DISCOUNT that claim as just another lie the kid is telling.\n Because of the NATURE of the actual act, there is a misdiagnosis.\nThis is actually someone saying something and having evidence behind it since lashing out is evidence to support the claim. Sadly it is also evidence of lying so that is another issue. \n \n \nSteeeeve, you've got a history of jumping in, dropping insulting comments on me, and then running off.\n There's actually a thread I have bookmarked where you claimed you would offer evidence, but then you never got back to it.\nYou bookmark threads? Why would you ever take this forum that seriously? \n \n In any event, if it is the thread I'm thinking of I believe I was told to cool it so I stopped posting there.", 
   {}, 
   353494, 
   null, 
   1242236280.0
  ], 
  [
   353650, 
   null, 
   "Lakrite", 
   "Q: What's the difference between Jesus and Obama?\n A: Jesus could build a cabinet.\n\n Haha, that really is a good one emoticon_smile\n \n \nRev Wright? I've talked to a variety of people who go to a church they don't always agree with.\n\n I agree that one's associations are not the main importance, but they can say something about one's character.\n \n Reverend Wright is on a different plane...he is racist, and if he were a white man speaking about black people it would have never been tolerated.", 
   {}, 
   353590, 
   null, 
   1242260400.0
  ], 
  [
   353827, 
   null, 
   "foundit66", 
   "Dude, you must have the longest bookmarks list ever, given how much I've seen you say you're \"bookmarking this post\" or that you have something bookmarked. Do you really bookmark peoples' posts?? I find that fascinating.\n\n There are programs that organize them.\n And when it's worth it, I do book-mark things.\n \n \n \nIf there's one thing I've learned, it's that such really means little at this point.\n\n To you, maybe.\n I am talking about the reason for MY interest.\n Quite frankly, if there was NO interest, people wouldn't even bother to respond. If I pointed out how some Alaskan mayor tried to appoint a crappy choice, would people even bother to respond?\n \n So if it really means little to you, then move along. That's what most people do with things that REALLY mean little to them...\n \n \n \nWay back well before the last presidential election, a lot of people thought Fred Thompson was going to be the man, and there was \"plurality of support\" behind him. Didn't happen. No one ever even HEARS about him now. It's too early for that to even factor in.\n\n Wow. I really don't remember it like that AT ALL.\n I would be curious if you could show any poll that had a \"plurality of support\" for him. Possibly you're thinking of something highly localized, like one regional poll?\n \n Cause what I remember is him NOT EVEN BEING CONSIDERED for a LARGE amount of Republican candidate polls.\n \n \n \nReverend Wright is on a different plane...he is racist\n\n And we're talking about a misogynist who is accused of not treating SERIOUS crimes against women as significant, who is nominated for ATTORNEY GENERAL.\n \n That's like nominating a guy for the U.N. spot who doesn't even believe in the U.N. emoticon_frazzled\n \n \n \n... and if he were a white man speaking about black people it would have never been tolerated. \n\n Put your feelings of victimhood away.\n Rev Wright's statements WERE NOT tolerated by most people. They were not dismissed in the media.", 
   {}, 
   353566, 
   null, 
   1242350100.0
  ], 
  [
   353828, 
   null, 
   "foundit66", 
   "Yes it does. But that is not the case here. There is no indication this guy had said things in the past.\n\n Again, you are looking at the wrong item of focus in the analogy.\n I am talking about Palin being analogous to the abuser.\n \n And if you think that anybody who has abused in the past is automatically guilty of abuse in the future, then it is you who is jumping to conclusions. I have no illusions about recidivism of abusers, but the recidivism rate is NOT 100%.\n \n \n \nReviewing Palin is not worth my time because she is the governor of a far away state\n\n You say that, but then you actively defend her like in the following...\n \n \n \nAs for the Palin AIP thing...this is also ridiculous and further proves that you need to reexamine the way you make judgments. FactCheck.org: Sliming Palin\n\n Considering I never even laid out the accusations in the first place, your response is premature.\n The article is an example of a strawman. It attacks claims I never made.\n \n HERE is what I am talking about regarding Palin and the AIP.\n \n \n \n Palin's addressed the AIP convention in 2008.\n YouTube - Sarah Palin and the Alaska Independence Party. Palin addresses AIP convention\n She also had an address for them in 2006.\n \n And this is what the AIP stands for...\n YouTube - Sarah Palin has ties to radical Alaskan Independence Party\n \n \nVogler disappeared under suspicious circumstances in May 1993,[4] just weeks before he was scheduled to give a speech to the United Nations on Alaskan independence, sponsored by the government of Iran.[5][6] Convicted thief Manfried West confessed to having murdered Vogler the following year in what he described as an illegal plastic explosive sale gone bad.[4] Manfried West, trying to recant, later said the confession was a lie, but this was before Vogler's body had been discovered.[7] Vogler's remains were discovered in a gravel pit east of Fairbanks in October 1994 following an anonymous tip.[4] They had been wrapped in a blue tarp secured with duct tape and were identified through fingerprint analysis.[4] Manfried West was convicted of murdering Joe Vogler and is serving an 80 year sentence.[6]\n \n In the opinion of AIP Chair Lynette Clark and other AIP leaders, however, Vogler's death reflected more than a dispute with West. Clark has stated, \"He was executed.\"[8] She notes that Vogler was about to appear before the United Nations to address the issue of Alaskan independence: \"The United States government would have been deeply embarrassed. And we can't have that, can we?\"[8]\n\n Joe Vogler - Wikipedia, the free encyclopedia\n \n YouTube - Sarah Palin's Secessionist Pal Speaks\n \n And even though I believe Palin had NO membership card, the AIP DOES CLAIM her as one of their own...\n YouTube - Palin AIP member\n And you'll note that this claim takes place WITHIN THEIR CONVENTION. No press present.\n One has to wonder, if the claim were really false, why would they casually talk about it as fact WITHIN THEIR OWN ORGANIZATION WALLS. They weren't bragging to the press there...\n \n THOSE are the actual items of contention.\n Now, if you want to contest them, I suggest you argue against what I am ACTUALLY saying instead of quoting some \"FactCheck\" that doesn't address most of my comments, and barely broaches the final one.\n \n But before you do, let me quote something that your article DOES admit...\n \n \nThere is still some dispute as to whether Sarah Palin also attended the AIP&#8217;s 1994 convention, held in Wasilla. Clark and another AIP official told ABC News&#8217; Jake Tapper that both Palins were there. Palin was elected mayor of Wasilla two years later. The McCain campaign says Sarah Palin went to the 2000 AIP convention, also held in Wasilla, &#8220;as a courtesy since she was mayor.&#8221; As governor, Palin sent a video message to the 2008 convention, which is available on YouTube, and the AIP says she attended in 2006 when she was campaigning.\n\n \n Now I ask you. WHY would Palin cater to these SECESSIONISTS like this???\n If Obama had given REPEATED video tape addresses for Ayers conventions, or if Michelle had a membership with an Ayers club, they would have been rightfully crucified.\n But with Palin, you guys ignore REAL extremist ties...\n \n If anything, the way you dismissed my comment WITHOUT EVEN FINDING OUT WHAT IT WAS ABOUT shows it is you who needs to reexamine your judgments.", 
   {}, 
   353590, 
   null, 
   1242350580.0
  ], 
  [
   353996, 
   null, 
   "Steeeeve", 
   "You say that, but then you actively defend her like in the following...\nBecause it is ridiculous and you shouldn't spread false things about people. It was like when people thought Obama wasn't a US citizen. That was ridiculous as well. \n \n \n \nConsidering I never even laid out the accusations in the first place, your response is premature.\n The article is an example of a strawman. It attacks claims I never made.\n \nOk, well the article talked about that... See \"Closet Secessionist?\". \n \n \nNow I ask you. WHY would Palin cater to these SECESSIONISTS like this???\n If Obama had given REPEATED video tape addresses for Ayers conventions, or if Michelle had a membership with an Ayers club, they would have been rightfully crucified.\n But with Palin, you guys ignore REAL extremist ties...\nBecause being a secessionist is not a big deal. I don't care about Ayers either because it looks like Obama just had a crazy friend...who doesn't? Until I see something more conclusive on that or Palin I see no need for judgment. This is what I am talking about with just taking things at face value just because it agrees with your political position. There is no integrity with that. I have little doubt in my mind that if Ayers knew Palin or McCain you'd be all over it.", 
   {}, 
   353828, 
   null, 
   1242451260.0
  ], 
  [
   354035, 
   null, 
   "foundit66", 
   "Because it is ridiculous and you shouldn't spread false things about people. It was like when people thought Obama wasn't a US citizen. That was ridiculous as well. \n\n The problem is that you assumed it was false, and then attacked me before even figuring out why I thought it would be credible.\n We have been debating for several posts on the standards for whether or not something is \"credible\".\n I don't \"spread false things\" about people.\n If I thought it was false, I would apologize and retract.\n \n \n \nOk, well the article talked about that... See \"Closet Secessionist?\". \n\n I did read it Steeeeve.\n How about you QUOTE it.\n \n No wait.\n I quoted your article didn't I.\n So you should know I read it.\n \n The article doesn't refute what I just posted.\n And your failure to honestly own up to Palin's association, and attack me for statements I never even said, reflects poorly on YOUR character...\n \n \n \nBecause being a secessionist is not a big deal.\n\n Are you serious?\n You actually believe that?\n \n Okay. Riddle me this then.\n If it's really not a \"big deal\", then WHY did the McCain campaign put forth an effort to try to debunk those statements, even if they employed a shady \"strawman approach\" in doing so...\n \n \n Let's go a step further.\n Have you READ about this group?\n Do you know anything about what their founder was like?\n \n Oh wait. I JUST QUOTED what the founder was like.\n IRAN was going to sponsor him to speak at the U.N.\n IRAN!\n And you think this group is no big deal?\n You think secessionists are no big deal???\n \n Wow Steeeeve.\n Just wow.\n \n \n \nI don't care about Ayers either because it looks like Obama just had a crazy friend...who doesn't?\n\n If I seriously believed Ayers is Obama's friend, I would not have voted for Obama.\n \n \n \nUntil I see something more conclusive on that or Palin I see no need for judgment. This is what I am talking about with just taking things at face value just because it agrees with your political position.\n\n And in steps the strawman arguments.\n No. I am not saying this just because it agrees with my political position.\n \n Quite frankly, if McCain had been president I would be proud to have him as president.\n Sure. I would disagree with him on probably a LOT of stuff, but the man has character and integrity.\n I wouldn't want Edwards elected because of his lies.\n This transcends politics.\n \n Palin is just plain scary. If she switched to \"Democrat\", I WOULD NOT WANT her.\n \n So please. Don't denigrate the discussion with false allegations that this is about \"politics\".\n \n \n \nI have little doubt in my mind that if Ayers knew Palin or McCain you'd be all over it.\n\n emoticon_ic\n It's funny how you criticize me for making statements with no substantiation, but you have obviously no problem doing that.\n Ayers \"knowing\" somebody is not an issue, IMO.\n Palin, Obama, McCain, Biden, WHOEVER actively claiming Ayers as a friend???\n THAT would be a problem.", 
   {}, 
   353996, 
   null, 
   1242500040.0
  ], 
  [
   354050, 
   null, 
   "jyoshu", 
   "\n You think secessionists are no big deal???\n \n Wow Steeeeve.\n Just wow.\n\n \n Steeeeve is right; that some people are secessionists is not a big deal. Heck, even Ron Paul recently defended the concept fairly definitively. Perhaps rather than just reacting at people hold to this idea, you should actually make the effort to find out WHY they feel this way and see what they believe the problems are.", 
   {}, 
   354035, 
   null, 
   1242505200.0
  ], 
  [
   354058, 
   null, 
   "Steeeeve", 
   "The problem is that you assumed it was false, and then attacked me before even figuring out why I thought it would be credible.\nIt isn't credible and no reasonable person would think so.\n \n \nThe article doesn't refute what I just posted.\nIt shows you are blowing it up more than it is. As far as I can tell she was merely being a good host for the AIP when they came to her town. \n \n \nAre you serious?\n You actually believe that?\nAh, yes. You could even claim our founders were somewhat secessionists. \n \n \nOkay. Riddle me this then.\n If it's really not a \"big deal\", then WHY did the McCain campaign put forth an effort to try to debunk those statements, even if they employed a shady \"strawman approach\" in doing so...\n \nI'm not sure what strawman approach you refer to and I don't know why the McCain campaign did a lot of things.... You should probably contact them.\n \n \nLet's go a step further.\n Have you READ about this group?\n Do you know anything about what their founder was like?\n \n Oh wait. I JUST QUOTED what the founder was like.\n IRAN was going to sponsor him to speak at the U.N.\n IRAN!\n And you think this group is no big deal?\n You think secessionists are no big deal???\n \n Wow Steeeeve.\n Just wow.\nI have and they do not come across as any crazier than other political parties. In fact, they are somewhat similar to the republican party of a decade+ ago. \n \n Time to take off the blinders there Foundit\n \n \nIf I seriously believed Ayers is Obama's friend, I would not have voted for Obama.\nReally? That is sad. Reminds me of that scene in the movie \"Head of State\" where Chris Rock knows a guy from a gas station who he says \"waz up\" to all the time and the News gets after him for it. A causal friend who is a little off the wall is not a big deal in my book. Must be the Christian value in me ;)\n \n \nNo. I am not saying this just because it agrees with my political position.\nI highly doubt this given your history on these forums. Don't even try to tell me you never give the benefit of the doubt to people you disagree with. I don't until I step back and think about it for a second. Judging from your thread here and claims about Palin and AIP and numerous others I don't think I can say the same about you. \n \n \nQuite frankly, if McCain had been president I would be proud to have him as president.\n Sure. I would disagree with him on probably a LOT of stuff, but the man has character and integrity.\nBecause nothing says integrity like acting as if you were a conservative just to get elected when you are, in fact, not. Thus is the case with McCain. Perhaps you just have bad judgment.", 
   {}, 
   354035, 
   null, 
   1242513660.0
  ], 
  [
   354063, 
   null, 
   "foundit66", 
   "It isn't credible and no reasonable person would think so.\n\n And I've already demonstrated how it is not unreasonable to think so.\n I've also demonstrated how you quickly jump to conclusions, dismissing things before even looking at the facts.\n \n Would you care to admit that you jumped to the conclusion that Palin had no AIP association, WITHOUT EVEN LOOKING at the evidence at hand?\n The sad part is that YOUR OWN LINK talked about the association. \n It just denied certain aspects like \"is she a member\" and similar junk. That's like denying Obama's relationship with Rev Wright by arguing they aren't brothers.\n emoticon_emb\n \n \n \nIt shows you are blowing it up more than it is. As far as I can tell she was merely being a good host for the AIP when they came to her town. \n\n Are you freakin' serious?\n If the KKK \"comes to town\", you don't have to be a \"good host\".\n \n She went out of her way to give an address to these people, when she didn't have to.\n Her husband is a card carrying member, and you just sum it up as \"good host\".\n Behind closed doors, these guys talk about her being a member, and you claim it's \"good host\".\n \n But on your claim, can you show proof of where the AIP had their conventions that Palin was a part of?\n emoticon_emb\n Nah. You're going out to google it right now, and you're going to ignore the fact that you tossed off an excuse with NO CLUE as to whether or not the AIP \"came to her town\" or not.\n \n \n \nAh, yes. You could even claim our founders were somewhat secessionists. \n\n emoticon_xdonno\n Wow Steeeeve. On that, we would agree.\n But think of it from the perspective of the existing party in power. Would you want people to do TODAY what our founding fathers did years ago?\n Declare war on the U.S. insisting that they should be let go?\n Cause that's what we're really talking about here. Secessionists murdering U.S. citizens in an attempt to ensure that their \"independence\" is recognized.\n DECLARING WAR on the United States.\n Does that get a gold star in your book Steeeeve?\n \n Damn dude. You are bending over backwards to try and paint their actions in a good light.\n \n \n \nI'm not sure what strawman approach you refer to and I don't know why the McCain campaign did a lot of things.... You should probably contact them.\n\n emoticon_frazzled\n Way to ignore the point...\n \n Palins association WAS significant. THAT is why the news talked about it.\n McCain's campaign tried the \"strawman approach\" to say \"she wasn't a card carrying member\", while ignoring her REAL associations. The REAL reasons for why she was declared \"associated\" with the AIP.\n \n \n \nI have and they do not come across as any crazier than other political parties. In fact, they are somewhat similar to the republican party of a decade+ ago. \n\n Again, you're revealing more about your character...\n The problem is Steeeeve is that I HAVE ALREADY DISCUSSED the party's roots.\n And you think they aren't \"any crazier than other political parties\"???\n \n Let's recap what I've already told you and you've ignored, 'mmkay?\n Vogler disappeared under suspicious circumstances in May 1993,[4] just weeks before he was scheduled to give a speech to the United Nations on Alaskan independence, sponsored by the government of Iran.[5][6] Convicted thief Manfried West confessed to having murdered Vogler the following year in what he described as an illegal plastic explosive sale gone bad.[4] Manfried West, trying to recant, later said the confession was a lie, but this was before Vogler's body had been discovered.[7] Vogler's remains were discovered in a gravel pit east of Fairbanks in October 1994 following an anonymous tip.[4] They had been wrapped in a blue tarp secured with duct tape and were identified through fingerprint analysis.[4] Manfried West was convicted of murdering Joe Vogler and is serving an 80 year sentence.[6]\n \n In the opinion of AIP Chair Lynette Clark and other AIP leaders, however, Vogler's death reflected more than a dispute with West. Clark has stated, \"He was executed.\"[8] She notes that Vogler was about to appear before the United Nations to address the issue of Alaskan independence: \"The United States government would have been deeply embarrassed. And we can't have that, can we?\"[8] \n Keep ignoring it Steeeeve.\n I'll just keep reposting it...\n \n \nReally? That is sad. Reminds me of ...\n\n Reminds you of nothing I actually said.\n I talked about Obama actually being FRIENDS with Ayers.\n Not just treating him friendly...\n emoticon_frazzled\n \n Don't obfuscate what I said.\n \n \n \nI highly doubt this given your history on these forums. Don't even try to tell me you never give the benefit of the doubt to people you disagree with.\n\n Ooookay.\n I wasn't going to claim that \"I never give the benefit of the doubt to people I disagree with\" anyways...\n I do give the benefit of the doubt to people I disagree with. I guess that means we agree on that?\n \n And I wouldn't be dragging up \"history on these forums\" if I were you.\n You have already admitted that you were chastised off of one thread you were harassing me on.\n \n \n \nI don't until I step back and think about it for a second.\n\n Dude.\n I talked about Palin being associated with secessionists, AND WITHOUT EVEN CHECKING WHAT MY JUSTIFICATION WAS you declared me wrong by grabbing SOMEBODY ELSE'S statements as justification for denying.\n \n That's not an example of \"think about it for a second\".\n You went out and looked for some justification to deny my claim, before you even UNDERSTOOD my claim.\n That isn't \"think about it for a second\".\n \n The funny thing is now YOU ARE NOT TRYING to deny the association.\n You're trying to downplay the type of group AIP is by ignoring what they've done.\n \n \n \nJudging from your thread here and claims about Palin and AIP and numerous others I don't think I can say the same about you.\n\n The funny thing is you aren't even discussing what I'm talking about with the AIP.\n \n You haven't addressed the fact that their founder was invited BY IRAN to speak at the U.N.\n You haven't addressed the fact that their previous leader died in an apparent illegal EXPLOSIVES deal.\n The subsequent leader ACCUSED THE UNITED STATES OF MURDERING Vogler.\n \n You aren't even really talking about my claims about Palin, or the AIP.\n \n \n \nBecause nothing says integrity like acting as if you were a conservative just to get elected when you are, in fact, not. Thus is the case with McCain. Perhaps you just have bad judgment.\n\n Wow.\n Now who is judging things based on their political positions?\n \n There used to be a phrase \"There is no fury like a woman scorned...\"\n I think the new phrase should be \"There is no fury like a Republican turning on its own party members...\"\n \n I think the real issue is that you have \"attack\" issues. Even OhioProf noted that you were on the attack.", 
   {}, 
   354058, 
   null, 
   1242517800.0
  ], 
  [
   354065, 
   null, 
   "Steeeeve", 
   "And I've already demonstrated how it is not unreasonable to think so.\nBecause she was appointed by Palin who you think has a history of shady contacts? This is far from reasonable. \n \n \nWould you care to admit that you jumped to the conclusion that Palin had no AIP association, WITHOUT EVEN LOOKING at the evidence at hand?\nI never said she didn't have an association with Palin.\n \n \nAre you freakin' serious?\n If the KKK \"comes to town\", you don't have to be a \"good host\".\nThe KKK isn't a legitimate political party of the state of Alaska. \n \n \nShe went out of her way to give an address to these people, when she didn't have to.\n Her husband is a card carrying member, and you just sum it up as \"good host\".\n Behind closed doors, these guys talk about her being a member, and you claim it's \"good host\".\nOf course she isn't a member and neither is he (anymore). \n \n \nWow Steeeeve. On that, we would agree.\n But think of it from the perspective of the existing party in power. Would you want people to do TODAY what our founding fathers did years ago?\n Declare war on the U.S. insisting that they should be let go?\n Cause that's what we're really talking about here. Secessionists murdering U.S. citizens in an attempt to ensure that their \"independence\" is recognized.\n DECLARING WAR on the United States.\n Does that get a gold star in your book Steeeeve?\nYou don't have to have a war but in any event, to answer your question, it isn't a crazy idea to want to form your own country so that your own values are recognized. I wouldn't support a measure in my state but it isn't a crazy idea. \n \n emoticon_frazzled\n Way to ignore the point...\n \n \nPalins association WAS significant. THAT is why the news talked about it. McCain's campaign tried the \"strawman approach\" to say \"she wasn't a card carrying member\", while ignoring her REAL associations. The REAL reasons for why she was declared \"associated\" with the AIP.\nThere is no evidence she was part of the party or even believed in secession. You jump to conclusions because you don't like her and that is why I made my comment. You take rumor and conspiracy theory type evidence (meaning manipulated evidence) and consider it fact. I'm not the one with a character problem on that.\n \n \n\n The problem is Steeeeve is that I HAVE ALREADY DISCUSSED the party's roots.\nA murdered founder? Yes, very crazy...of course you will probably point to the unfounded explosive claim by the person that murdered him. But I know you wouldn't be the type to believe rumors of a murderer. Finally, what does that have to do with the party anyway? The Mormon church was founded by a theft but I don't call them all crazy.\n \n \nI wasn't going to claim that \"I never give the benefit of the doubt to people I disagree with\" anyways...\nPeople can judge for themselves. \n \n \nI talked about Palin being associated with secessionists, AND WITHOUT EVEN CHECKING WHAT MY JUSTIFICATION WAS you declared me wrong by grabbing SOMEBODY ELSE'S statements as justification for denying.\nYou are wrong.\n \n \nThe funny thing is now YOU ARE NOT TRYING to deny the association.\nI never did deny it I said it wasn't a big deal and it is \"overblown\". This is obvious!\n \n \nYou aren't even really talking about my claims about Palin, or the AIP.\nDon't forget the US blew up the world trade center too! emoticon_rolleyes\n \n \n \n \nWow.\n Now who is judging things based on their political positions?\nYou.\n \n \nI think the real issue is that you have \"attack\" issues. Even OhioProf noted that you were on the attack.\nThat must make it true given your standard for the truth.", 
   {}, 
   354063, 
   null, 
   1242519900.0
  ], 
  [
   354121, 
   null, 
   "foundit66", 
   "I never said she didn't have an association with Palin.\n\n Your lack of honesty is amazing.\n I requote what you said earlier...\n STEEEEVE: As for the Palin AIP thing...this is also ridiculous and further proves that you need to reexamine the way you make judgments. FactCheck.org: Sliming Palin\n Clearly not a big issue and certainly doesn't show Palin associates with bad people. \n For the record, the article NEVER EVEN TALKED about whether or not the AIP was \"bad people\". So if you're going to turn around and try to make THAT argument, you better check yourself right there cause the article doesn't say anything about that.\n Can't you make up your mind?\n \n \n \nThe KKK isn't a legitimate political party of the state of Alaska. \n \n So all the KKK has to do is establish a \"legitimate political party\" in some state, and you would have no problem with a GOVERNOR associating with them... :xbanghead\n \n Wow. I mean Obama isn't supposed to talk to foreign heads of state that the Republicans don't like, but when it comes to home-grown organizations that should be watched because of a propensity for illegal actions, you don't care...\n \n \n \nOf course she isn't a member and neither is he (anymore). \n\n She went out of her way to give an address to these people, when she didn't have to.\n Her husband was a card carrying member, and you just sum it up as \"good host\".\n Behind closed doors, these guys talk about her being a member, and you claim it's \"good host\". Even if she doesn't have a card, they DO recognize that she supports them LIKE SHE IS.\n \n \n \nYou don't have to have a war ...\n\n Dude. \n YOU compared them to our founding fathers.\n NOT me...\n \n I am just pointing out the full extent of that analogy, which you obviously want to back-peddle on.\n Why is it so difficult to admit that a state seceding from the United States is a CONDEMNABLE idea. One that should not be supported by our United States politicians.\n It is because the idea of seceding is a popular extremist idea amongst the Republican party these days?\n \n \n \n... it isn't a crazy idea to want to form your own country so that your own values are recognized. I wouldn't support a measure in my state but it isn't a crazy idea. \n\n Do you know what the definition of \"treason\" is?\n And trust me. It isn't just the EXISTENCE of the party which is a problem.\n \n Just out of curiousity (although I think I already know the answer) did you even bother to look at the links on Vogler's positions?\n What he thinks about the United States??\n Let me quote it for you, cause you have a propensity to ignore information given to you...\n \n \"The fires of hell are frozen glaciers compared to my hatred for the American government. And I won't be buried under their damn flag. I'll be buried in Dawson. And when Alaska is an independent nation they can bring my bones home.\"\n \n Let's recap what I've already told you and you've ignored, 'mmkay?\n  Vogler disappeared under suspicious circumstances in May 1993,[4] just weeks before he was scheduled to give a speech to the United Nations on Alaskan independence, sponsored by the government of Iran.[5][6] Convicted thief Manfried West confessed to having murdered Vogler the following year in what he described as an illegal plastic explosive sale gone bad.[4] Manfried West, trying to recant, later said the confession was a lie, but this was before Vogler's body had been discovered.[7] Vogler's remains were discovered in a gravel pit east of Fairbanks in October 1994 following an anonymous tip.[4] They had been wrapped in a blue tarp secured with duct tape and were identified through fingerprint analysis.[4] Manfried West was convicted of murdering Joe Vogler and is serving an 80 year sentence.[6]\n In the opinion of AIP Chair Lynette Clark and other AIP leaders, however, Vogler's death reflected more than a dispute with West. Clark has stated, \"He was executed.\"[8] She notes that Vogler was about to appear before the United Nations to address the issue of Alaskan independence: \"The United States government would have been deeply embarrassed. And we can't have that, can we?\"[8]\n Keep ignoring it Steeeeve.\n I'll just keep reposting it...\n This is part and parcel of the reasons why Palin should keep her distance.\n \n \n \nThere is no evidence she was part of the party or even believed in secession. You jump to conclusions ...\n\n I have had it with your blatant dishonesty.\n I never claimed she was a part of the party.\n I never claimed she believed in secession.\n The point is her association with these people.\n \n I find it hilarious how you try to have a double-standard on this issue.\n You claim you have never argued against her having an association, yet when I point it out you claim I am \"jumping to conclusions\"...\n emoticon_xdonno\n :xbanghead\n \n Which is it Steeeeve?\n Either you're not arguing against her having an association with the AIP...\n ... or I am \"jumping to conclusions\".\n You can't argue both, unless you want to prove your illogical hypocrisy...\n \n \n \nYou take rumor and conspiracy theory type evidence (meaning manipulated evidence) and consider it fact. I'm not the one with a character problem on that.\n\n Let's see.\n You're currently showing honesty problems.\n Earlier, you tried to refute me assessing an \"association\" by refuting SOMEBODY ELSE's comments. And even then, I bet you didn't even read YOUR OWN article which reiterates the points of my claim.\n \n Gee Steeeeve. At this stage, I don't think you know what you're arguing, other than the fact that you're trying to argue against something I am saying.\n Except you're not even doing that. You're whining about how she isn't a member, when I never claimed she was.\n \n \n \nA murdered founder? Yes, very crazy...of course you will probably point to the unfounded explosive claim by the person that murdered him.\n\n :xbanghead\n \"unfounded\"?\n Is that just a word you use these days to reply to people who say things you don't like, while you do ABSOLUTELY NO WORK to try to figure out what the \"foundation\" actually is???\n \n The guy CONFESSED TO THE CRIME, and you don't want to believe him?\n I guess he must not have done it then, huh... emoticon_xdonno\n \n And I don't think you get THE OTHER PART of that crazy situation.\n The party replacement leader BLAMES THE UNITED STATES FOR MURDERING Vogler.\n Yeah. These guys aren't crazy at all. Paranoid, schizophrenic, crazy...\n \n \n \nPeople can judge for themselves. \n\n Yes. They can.\n And that is precisely what McCain's campaign recognized, and why they tried to obfuscate Palin's association with these radicals.\n \n \n \nYou are wrong.\n\n So when you made your comments about how wrong my statement was, you had already read your own article and saw that it SUBSTANTIATED an association between Palin and the AIP???\n \n Or do you want to get into a discussion on WHAT YOUR ARTICLE SAYS and how it supposedly \"refutes\" me, cause you claim to have read it BEFORE you typed that it was a resource proving me wrong?\n \n No. I don't think you want to discuss your \"reasoning\" in this area at all. That's why you simply type three words \"you are wrong\" without giving ANY explanation on how you could have put up the reply you did with the resource you did... emoticon_wow\n \n \n \nDon't forget the US blew up the world trade center too! \n\n emoticon_xdonno\n Were you trying to give me substantiation of my point that \"You aren't even really talking about my claims about Palin, or the AIP. \"\n \n \n \nWow.\n Now who is judging things based on their political positions?\n\n \nYou.\n\n \nI think the real issue is that you have \"attack\" issues. Even OhioProf noted that you were on the attack.\n That must make it true given your standard for the truth. \n\n Wow. AGAIN you jump to conclusions. emoticon_xdonno\n Ohioprof is one of the more level-headed posters around here. My comment had nothing to do with a pro or anti- marriage stance.\n \n Steeeeve, you DO have a history of attacking others.\n You DO have a history of attacking me.\n You even ADMITTED that you were warned off of attacking me on one thread. And I know I've had a variety of your posts attacking me changed by the admin.\n This junk of yours is getting real old.", 
   {}, 
   354065, 
   null, 
   1242580620.0
  ], 
  [
   354129, 
   null, 
   "Steeeeve", 
   "Your lack of honesty is amazing.\n I requote what you said earlier...\n \n For the record, the article NEVER EVEN TALKED about whether or not the AIP was \"bad people\". So if you're going to turn around and try to make THAT argument, you better check yourself right there cause the article doesn't say anything about that.\nOnce again, never stated she didn't have an association with the AIP...that quote doesnt' contradict that. Seems you are the one being dishonest. \n \n \nSo all the KKK has to do is establish a \"legitimate political party\" in some state, and you would have no problem with a GOVERNOR associating with them... :xbanghead\nWow, are you purposely dense? \n \n \nShe went out of her way to give an address to these people, when she didn't have to.\n Her husband was a card carrying member, and you just sum it up as \"good host\".\n Behind closed doors, these guys talk about her being a member, and you claim it's \"good host\". Even if she doesn't have a card, they DO recognize that she supports them LIKE SHE IS.\nYou miss the point in that you are the one who is jumping to conclusions about the AIP and Palin's association with it. If attending a few conventions makes you have significant association then I'm part of a lot of organizations. She attended a few conventions because they were in her town and nothing suggests she supports all there views. Second, there views arent' even that big of a deal. So far your evidence about Palin's \"bad associations\" is a political party that is reasonable in viewpoint and a non credible quote from someone she appointed. That is pathetic. Not only that, you actually claim the things the appointee are probably true based on previous bad associations which from I can tell are no different than any other person including Obama!\n \n \nDude. \n YOU compared them to our founding fathers.\n NOT me...\n \n I am just pointing out the full extent of that analogy, which you obviously want to back-peddle on.\nCritical thinking is not really working for you is it? I claimed the founding fathers could be called \"secessionists\". Nothing logical follows that all secessionists have to support a war to leave the union/country. \n \n \nWhy is it so difficult to admit that a state seceding from the United States is a CONDEMNABLE idea. One that should not be supported by our United States politicians.\n It is because the idea of seceding is a popular extremist idea amongst the Republican party these days?\nI wouldn't know as I'm not a part of that party but I'm not sure how it is a \"condemnable\" idea. Lots of countries form that way. \n \n \nDo you know what the definition of \"treason\" is?\n And trust me. It isn't just the EXISTENCE of the party which is a problem.\nThe fact that you still think you are logical is beyond me. So Iran supported a speech by the founder of the AIP who also hates our government so therefore he is crazy and since Palin went to a few conventions she associates with bad people which therefore means the things said about her appointee are probably true. \n \n You can keep posting it but I'm going to keep laughing. \n \n \nI have had it with your blatant dishonesty.\n I never claimed she was a part of the party.\n I never claimed she believed in secession.\n The point is her association with these people.\nGoes to a few conventions is an association making everyone she knows no good? Keep digging the hole there.....\n \n \nWhich is it Steeeeve?\n Either you're not arguing against her having an association with the AIP...\n ... or I am \"jumping to conclusions\".\nYou jump to conclusions about her association and whether it is a bad thing and whether that translate to other \"associations\" being bad. \n \n \nThe guy CONFESSED TO THE CRIME, and you don't want to believe him? I guess he must not have done it then, huh...\nActually the guy murdered someone and you want to believe everything he says....that is more interesting to me.\n \n \nYou DO have a history of attacking me.\nI have a history of attacking you because you are not a reasonable person. There is one right there :)\n \n \nThis junk of yours is getting real old.\nYou don't have to respond.", 
   {}, 
   354121, 
   null, 
   1242586380.0
  ], 
  [
   354139, 
   null, 
   "foundit66", 
   "Once again, never stated she didn't have an association with the AIP...that quote doesnt' contradict that. Seems you are the one being dishonest.\n\n At this stage, repeating your quote for the world is the best I'm going to get.\n You're never going to admit what you were trying to do, and now that you are no longer trying to contradict me (yet you're obviously still trying to criticize me for that conclusion), most of my work is \"done\"...\n \n \n \nWow, are you purposely dense? \n\n Are you purposely obfuscating?\n Nice way to avoid my point.\n \n \n \nYou miss the point in that you are the one who is jumping to conclusions about the AIP and Palin's association with it.\n\n ROFLMAO!\n So you don't contradict the association, but you complain to people jumping to conclusions...\n Steeeeve? This is getting ridiculous.\n I HAVE PRESENTED THE EVIDENCE for recognizing the association.\n YOUR OWN WEB-SITE admits the evidence.\n \n At this stage, you're just trying to flail around like somebody who wants to lash out, but doesn't have a leg to stand on.\n \n \n \nIf attending a few conventions makes you have significant association then I'm part of a lot of organizations.\n\n And while you're at it, QUIT WITH YOUR DISHONESTY.\n She did a lot more than just \"attend\".\n She ADDRESSED the convention on MULTIPLE OCCASIONS.\n Her husband was a card carrying member.\n The organization THOUGHT of her AS a member.\n emoticon_rolleyes\n \n But in your dishonest portrayal, you just claim she \"attended\"...\n \n \n \nShe attended a few conventions because they were in her town and nothing suggests she supports all there views.\n\n I asked you to prove where the conventions were held earlier, and you dropped the request.\n Here, you not only JUMP TO A CONCLUSION as to why she attended (with no evidence), you again repeat your claim as to where the convention was held.\n \n 1) Can you show WHERE these conventions were even held?\n 2) Can you provide any proof that her motivation was as you claim?\n \n \n \nSecond, there views arent' even that big of a deal. So far your evidence about Palin's \"bad associations\" is a political party that is reasonable in viewpoint and a non credible quote from someone she appointed.\n\n emoticon_rolleyes\n Dude. I've got a list of things about her.\n So far, you aren't HONESTLY addressing the things you've been shown in the first place.\n \n IRAN invited the AIP leader to speak at the U.N., and you think nothing of it???\n \n \n \nI claimed the founding fathers could be called \"secessionists\". Nothing logical follows that all secessionists have to support a war to leave the union/country.\n\n I never said all secessionists \"have to support a war to leave the union/country\".\n I am pointing out the association you are making Steeeeve. I am pointing out the REAL NATURE of the association YOU made.\n \n \n \nI wouldn't know as I'm not a part of that party but I'm not sure how it is a \"condemnable\" idea. Lots of countries form that way. \n\n So you seriously wouldn't have any concern over Alaska seceding?\n Is that what you're saying?\n Or is the truth that you're AVOIDING saying anything specific here.\n You want to give this group an ILLUSION of decency, when you aren't even really talking about the group in the first place... \n \n \n \nSo Iran supported a speech by the founder of the AIP who also hates our government so therefore he is crazy and since Palin went to a few conventions she associates with bad people which therefore means the things said about her appointee are probably true. \n\n I was considering redacting your statements so that they would be an HONEST portrayal of my position, but there wouldn't be much left.\n \n Palin did a lot more than just \"attend\".\n Are you seriously even trying to defend the mental condition of Vogler? Cause it sounds like you are, but you haven't the courage to go on the record. \n \n \n \nYou jump to conclusions about her association ...\n\n Steeeeve, there is no \"jumping to conclusions\".\n The REASON for that assessment exists.\n You may not share the opinion, but the REASON is there.\n There is no \"jumping\" to anything.\n \n \n \nActually the guy murdered someone and you want to believe everything he says....that is more interesting to me.\n\n He confessed.\n There are no facts disputing his assessment.\n Do you have an alternative suggestion, or is your position one more of eternal doubt. Anything you don't like gets automatically doubted.\n \n \n \nI have a history of attacking you because you are not a reasonable person. There is one right there :)\n\n \nThis junk of yours is getting real old. \n\n \nYou don't have to respond.\n\n Oh. But I will.\n I point out that YOU ATTACKING ME is getting old, and you criticize me for making the observation?\n Wow. You will condemn me for absolutely anything, won't you...", 
   {}, 
   354129, 
   null, 
   1242591660.0
  ], 
  [
   354142, 
   null, 
   "jyoshu", 
   "\" ... he brings up an important issue and I think the biggest surprise to me was the outrage expressed by an individual that even thinks along these lines because I heard people say, &#8220;Well, this was treasonous and this was un-American&#8221;. But don&#8217;t they remember how we came into our being? We used secession. We seceeded from England. So it&#8217;s a very good principle. It&#8217;s a principle of a free society and it&#8217;s a shame we don&#8217;t have it anymore.\n \n I argue that if we had the principle of secession our federal government wouldn&#8217;t be as intrusive into our state of affairs. That would be very good. We as a nation have endorsed secession all along. I mean, think of all the secession of the countries and the republics from the Soviet system. We were delighted, we loved it. And yet we get hysterical over this. Just because people want to debate and defend the principle of secession that doesn&#8217;t mean that they&#8217;re calling for secession. I think it&#8217;s that restraining element of secession that would keep the federal government from doing so much. In our early history, they accepted the principle of secession all along.\"More at Ron Paul on Secession - CNN American Morning | Ron Paul .com", 
   {
    "post_info": {
     "post_title": "Ron Paul on Secession"
    }
   }, 
   354139, 
   null, 
   1242594780.0
  ], 
  [
   354147, 
   null, 
   "Steeeeve", 
   "She did a lot more than just \"attend\".\n She ADDRESSED the convention on MULTIPLE OCCASIONS.\n Her husband was a card carrying member.\n The organization THOUGHT of her AS a member.\nSo lets see...we only know she attended a convention in Wasilla as mayor in 2000, sent a \"welcome\" speech in 2008 where she said \"it is good to have competition in parties\" and referring to some of her shared views, we have her husband who was a member, and we have Palin who says she was never a member backed up by documents. There is also very little reason to lie about being a party that is more or less a republican type party...which is why it was stupid of McCain to even care.\n \n In any event, you don't care about any of this because guilt by association (a logical fallacy) is your style. She clearly wasn't a member but was friendly towards them...probably because of her husband. I can't tell you how many times I've been to a democratic or republican event and I hate both parties. By your logic I must be a huge fan of Bill Clinton and other democrats considering some of the things I've done (which I won't mention so don't ask). Get over yourself, you have nothing but biased views on a non-issue and you use it say Palin has bad associations. Palin has so many other bad qualities for holding political office yet why you choose to make up some is beyond me. I can guess a few reasons but you'd just deny them anyway :)\n \n \nI asked you to prove where the conventions were held earlier, and you dropped the request.\nProbably because I assumed you read the articles I posted and listened to the videos you posted which clearly state this. Apparently I overestimated you.\n \n Dude. I've got a list of things about her.\n So far, you aren't HONESTLY addressing the things you've been shown in the first place.\n \n \nIRAN invited the AIP leader to speak at the U.N., and you think nothing of it???\n \nI fell into this trap with Columbia university invited Ahmadinejad to speak. After thinking about it and how they went about the speech, it wasn't that bad and neither is this. \n \n \nSo you seriously wouldn't have any concern over Alaska seceding?\nI don't care that the party holds that view. As you see from Ron Paul in the post above it is a good principal to have. \n \n \nI point out that YOU ATTACKING ME is getting old, and you criticize me for making the observation?\nYou stop making illogical claims and I'll stop criticizing you for them.", 
   {}, 
   354139, 
   null, 
   1242597420.0
  ], 
  [
   354151, 
   null, 
   "foundit66", 
   "I can't help but remember Baldwin and other rare \"Hollywood\" individuals talking about leaving this country if their candidate didn't get elected.\n If they didn't get their way.\n Such outbursts were childish, and not typical of the norm.\n They were typically recognized as such on both sides.\n \n In the 2000 election, people talked about \"voter disenfranchisement\". But I never heard that coupled with a desire to take their land and leave the United States.\n \n But in today's day and age, we have an even more childish approach.\n Some Republicans, mad that they can't get their way in the government, rightfully VOTED OUT, are suddenly talking \"secession\" and pretending it's a good thing.\n And these extremists think they are being intelligent in their radical temper tantrum... emoticon_rolleyes\n \n Amongst the humorous things is how these people react to different situations.\n Burn a flag? OMG! Let's pass a constitutional amendment PREVENTING that.\n A state seceding from the union? Oh. Let's not be too hasty to judge... emoticon_rolleyes\n \n People complaining about treatment of detainees / prisoners of war? They must be terrorist sympathizers!\n People talking about secession? Who are we to judge? emoticon_rolleyes\n \n Republicans criticize Obama for his association with Ayers. \"Palling around with terrorists\".\n Vogler is sponsored BY IRAN to speak at the U.N.? Obviously nothing to be concerned over... emoticon_rolleyes\n \n And let's not kid ourselves. For these particular republicans, they were NOT talking \"secession\" before the election. They were NOT talking about \"secession\" under Bush.\n Why is it that Ron Paul and his ilk are suddenly picking up the \"secession\" banner NOW???\n It's ultimately a whiny back-handed complaint about not getting THEIR president into office.\n \n I'm sorry, but this isn't the Revolutionary War scenario. You HAD representation in the last election.\n You LOST.\n In a democracy, you don't just \"secede\" if you don't get your way...\n \n \n As for the AIP, they join a variety of other groups that would like to rid themselves of the \"tyranny\" of the government...\n Thank God they're being watched...\n \nRightwing extremists have capitalized on the election of the first African American president, and are focusing their efforts to recruit new members, mobilize existing supporters, and broaden their scope and appeal through propaganda, but they have not yet turned to attack planning.\n\n http://www.fas.org/irp/eprint/rightwing.pdf\n Secession groups aren't like harmless gardening clubs. The hatred that burned within Vogler is not indicative of a harmless man.", 
   {}, 
   354142, 
   null, 
   1242599160.0
  ], 
  [
   354153, 
   null, 
   "foundit66", 
   "So lets see...we only know she attended a convention in Wasilla as mayor in 2000, sent a \"welcome\" speech in 2008 where she said \"it is good to have competition in parties\" and referring to some of her shared views, we have her husband who was a member, and we have Palin who says she was never a member backed up by documents.\n\n Is it impossible for you to speak of this truthfully?\n She gave a 2006 speech as well. YOUR WEB-SITE admitted that.\n The group, BEHIND CLOSED DOORS, talked of her as one of their own. I can understand a possibility of people bragging to reporters about a \"membership\" that is exaggerated, but WHEN TALKING TO THEIR OWN, they obviously were speaking about something that was well understood within the party...\n \n And as for another conference in 1994, Palin denies it but the AIP holds that she attended. Considering the AIP capitulated that she was not an \"official\" member, the fact that they still say she attended in 1994 seems rather poignant.\n \n And also, considering you aren't going to honestly address my question on where the conferences were, I'll get to the point.\n The 2008 AIP conference was NOT IN Wasilla. It was in Fairbanks some 300 miles away.\n It wasn't a situation where Palin thought \"Oh. This group is in my backyard so I'll stop in...\"\n It was a situation where Palin went OUT OF HER WAY to make sure her address to the 2008 AIP conference was heard.\n emoticon_frazzled\n \n \n [quote=There is also very little reason to lie about being a party that is more or less a republican type party...which is why it was stupid of McCain to even care.[/quote]\n Bigger picture here???\n Considernig how hard you're fighting on this whole \"Palin / AIP\" thing???\n Thou dost protest WAYYY too much...\n \n YOU are putting up more of a fight than McCain ever dreamed of doing on the subject.\n \n Furthermore, you'll note what McCain's approach ACTUALLY was.\n YOU, Steeeeve, are taking the approach of \"secessionists? they ain't so bad if Palin was associated\"\n McCain and his POLITICAL ADVISORS? They DISTANCED Palin from the AIP...\n \n Despite what you may think, the AIP WAS an issue. While some right-wingers are now entertaining ideas of \"secession\" like spoiled kids who didn't get their way, cavalierly ignoring such associations DURING A UNITED STATES PRESIDENTIAL ELECTION would have been political suicide.\n \n \"Hey! I want to be your Vice-President! And I don't deny a relationship with a group who wants to SECEDE from the government you're about to put me as second-in-place to a very old candidate! Please elect me!\"\n emoticon_frazzled\n \n \n \nIn any event, you don't care about any of this because guilt by association (a logical fallacy) is your style. She clearly wasn't a member but was friendly towards them...probably because of her husband.\n\n Dude.\n The Republicans LIVED off of the \"guilt by association\" platform in 2008.\n Ayers / Obama.\n Rev Wright / Obama.\n And you're trying to criticize me for it???\n ROFLMAO!\n \n Here, we are ultimately talking about a person who would / could be second-highest elected official, or THE highest elected official if she gets her party's nomination in a future election...\n And you think her association with a group that wants to SECEDE A STATE is nothing to be concerned with???\n \n My gawd man.\n That is somewhere inbetween hilarious and terrifying!\n \n \n \nBy your logic ...\n\n No. You're not using my logic.\n And I'm not going to even bother quoting such grotesque strawman arguments.\n \n \n \nPalin has so many other bad qualities for holding political office yet why you choose to make up some is beyond me.\n\n And we're back to the conundrum where you on one hand claim you aren't contesting the observation...\n ... and on the other hand claiming I am \"making it up\"... emoticon_frazzled\n \n \n \nProbably because I assumed you read the articles I posted and listened to the videos you posted which clearly state this. Apparently I overestimated you.\n\n < snore <\n You're obfuscating my point.\n It dealt specifically with your claim on that *she dropped by because they were in her backyard*.\n \n 2008 convention was nowhere in her backyard.\n \n \n \nDude. I've got a list of things about her.\n So far, you aren't HONESTLY addressing the things you've been shown in the first place.\n\n You accusing me of dishonesty.\n That's funny...\n \n \n \nI fell into this trap with Columbia university invited Ahmadinejad to speak. After thinking about it and how they went about the speech, it wasn't that bad and neither is this.\n\n The only problem with your attempt to side-step is that WE KNEW THE SUBJECT of Vogler's speech.\n emoticon_xdonno \n \n \n \nI don't care that the party holds that view. As you see from Ron Paul in the post above it is a good principal to have. \n\n I think the right-wing (or at least a good number of them) have completely lost their minds after the last election.\n And yes. I firmly believe that THEY believe there is nothing wrong with them, and it's \"the rest\" that there is a problem with...\n \n \n \nYou stop making illogical claims and I'll stop criticizing you for them.\n\n ROFLMAO!\n See, Steeeeve the civil thing to do would be to criticize the CLAIMS.\n But there, in your very words, you demonstrate that you make it about the OTHER PERSON.\n \n No matter.\n Eventually you'll get rabid like you have typically done and start calling me names and I'll report them to the admin.\n AT least this time around you aren't trying to pretend that I am the one calling names, as you do it verbosely.... emoticon_xgood", 
   {}, 
   354147, 
   null, 
   1242600660.0
  ], 
  [
   354170, 
   null, 
   "Steeeeve", 
   "The group, BEHIND CLOSED DOORS, talked of her as one of their own. I can understand a possibility of people bragging to reporters about a \"membership\" that is exaggerated, but WHEN TALKING TO THEIR OWN, they obviously were speaking about something that was well understood within the party...\nWell Palin disagrees and so do official documents. Once again you believe anything that supports your view and never care about true evidence.\n \n \nThe Republicans LIVED off of the \"guilt by association\" platform in 2008.\n Ayers / Obama.\n Rev Wright / Obama.\n And you're trying to criticize me for it???\nYes, you are doing the same thing as the republicans...glad you noticed.\n \n \nHere, we are ultimately talking about a person who would / could be second-highest elected official, or THE highest elected official if she gets her party's nomination in a future election...\n And you think her association with a group that wants to SECEDE A STATE is nothing to be concerned with???\nSo if attending conventions or events gives you an association why don't you apply the same standard to Obama as you said here: \"Rev Wright? I've talked to a variety of people who go to a church they don't always agree with.\". Apparently if you attend a few conventions (and he WAS part of the church) Obama must agree with everything Wright says. I'm sure will see a classic Foundit coverup here. \n \n \nNo. You're not using my logic.\nGood point, you don't have any.\n \n \nAnd we're back to the conundrum where you on one hand claim you aren't contesting the observation...\nIf you say \"Bush is bad because he planned 9/11\" I'd say yes Bush is bad but no it isn't because of him planning 9/11 as he didn't. The same applies in your case. You think Palin is bad but your reasons are no more than half-truths you take as fact to form an opinion to go with your own viewpoint. It is a backwards way of thinking.\n \n \nSee, Steeeeve the civil thing to do would be to criticize the CLAIMS.\nWith you it is ineffective. :)\n \n \nAT least this time around you aren't trying to pretend that I am the one calling names, as you do it verbosely.... emoticon_xgood\nDon't even pretend to take the high ground..you name call EVERYONE you disagree with on this forum.", 
   {}, 
   354153, 
   null, 
   1242612060.0
  ], 
  [
   354172, 
   null, 
   "Steeeeve", 
   "http://www.fas.org/irp/eprint/rightwing.pdf\n Secession groups aren't like harmless gardening clubs. The hatred that burned within Vogler is not indicative of a harmless man.\nThis is a perfect example of our government going overboard. Do you support this? Groups that oppose abortion or immigration may be threats to the United States? Are groups supporting Gay Rights a threat? Maybe those against Palin? Hmmm, apparently not.", 
   {}, 
   354151, 
   null, 
   1242612300.0
  ], 
  [
   354237, 
   null, 
   "foundit66", 
   "Well Palin disagrees and so do official documents. Once again you believe anything that supports your view and never care about true evidence.\n\n :xbanghead\n The \"official documents\" were never in dispute. We agreed that she was never a card-carrying member, but you refuse to acknowledge that and try to paint things in the worst light possible.\n \n Yes. Palin does disagree.\n So if you have an ORGANIZATION that says one thing and Palin says another, who do you believe?\n By your previous standards (if one were to suspend reality and believe you could apply consistently) you MUST discount Palin's claim cause she has a motive to lie.\n She is going for vice-president, and trying her to a SECESSIONIST group is not a positive thing for her job resume as a major-elected-post (heartbeat away from president) of the FEDERAL government.\n \n So what's it going to be Steeeeve?\n Are you going to apply your standards consistently?\n Nah. I didn't think so.\n \n And as for the flip side, they have no reason to lie that I can see.\n They aren't going to get a recruiting drive by claiming her. No extra money in their pocket.\n Furthermore, the fact that they claimed her IN PRIVATE demonstrates an even larger lack of motive and an even more concrete reason to believe them.\n \n \n \nYes, you are doing the same thing as the republicans...glad you noticed.\n\n As difficult as it may be to believe, I don't think the Republicans are 100% wrong 100% of the time.\n \n \n \nSo if attending conventions or events gives you an association why don't you apply the same standard to Obama as you said here: \"Rev Wright? I've talked to a variety of people who go to a church they don't always agree with.\". Apparently if you attend a few conventions (and he WAS part of the church) Obama must agree with everything Wright says. I'm sure will see a classic Foundit coverup here.\n\n Steeeeve, forest for the freakin' trees here.\n As it has been pointed out to me REPEATEDLY, Christianity is pretty diverse. It has a LOT of different aspects to believe in, with lots of trivial differences.\n \n Quite frankly, the REAL comparison here should be between Obama choosing to attend a CHRISTIAN church, as opposed to choosing to attend a MORMON church.\n Do I see Obama choosing to attend a CHRISTIAN church as a sign of his CHRISTIANITY????\n YES! \n \n Now, the real question here should be by YOUR standards of eternal doubt, would you obfuscate the fact that attending a Christian church is a sign of a person's Christianity???\n Again, I don't expect a reply. More of your cutting-and-pasting what is convenient for you...\n \n \n As for the other side, if I were to say \"Vogler supported his independent Alaskan state withholding all oil revenue from the people, and applying a strict minimum 25% tax to the people regardless of tax situation\"...\n And then assume that Palin ALSO believed that, then you would have an analogy.\n \n As it was, the MAIN PURPOSE of the Christian church is the fundamental belief in Jesus as savior, and that IS shown as being supported by attendance.\n And the MAIN PURPOSE of the AIP is secession and repeatedly speaking at the conference DOES show support for that ideal.\n \n \n \nIf you say \"Bush is bad because he planned 9/11\" I'd say yes Bush is bad but no it isn't because of him planning 9/11 as he didn't. The same applies in your case. You think Palin is bad but your reasons are no more than half-truths you take as fact to form an opinion to go with your own viewpoint. It is a backwards way of thinking.\n\n Wow. MORE OF YOUR OBFUSCATION.\n That wasn't my point at all.\n \n My point is this. And considered I have explained it EXPLICITLY and REPEATEDLY, it would indicate either blatant dishonesty (or willful ignorance) in your failure to accurately portray what I am saying...\n \n You have proposed two things.\n A) You claim you are not contesting Palin's association with AIP. (I recommend people review his last post to see how false that is.)\n B) You also criticize me for observing Palin's association with AIP.\n \n You can't have it both ways.\n Now, you are free to obfuscate what I just said, but I'll just end up repeating it.\n \n \n \nDon't even pretend to take the high ground..you name call EVERYONE you disagree with on this forum.\n\n Baloney!\n I actively encourage EVERYBODY to report any time I call somebody a name.\n I got so fed up with your repeated attempts to CALL ME NAMES as you falsely insisted I was calling other people names, that I just took the road of having the moderator sort it out.\n \n Report EVERY violation to him, and see who gets busted for what.\n And you've already admitted YOU LEFT A THREAD because you were admonished for your treatment of me.\n I don't recall any admonishment from the moderator to me from your behalf.\n \n As I predicted at the start of this, you've turned this into a character assassination. And you accuse me of being guilty of your own flaw.", 
   {}, 
   354170, 
   null, 
   1242680640.0
  ], 
  [
   354238, 
   null, 
   "foundit66", 
   "This is a perfect example of our government going overboard. Do you support this? Groups that oppose abortion or immigration may be threats to the United States? Are groups supporting Gay Rights a threat? Maybe those against Palin? Hmmm, apparently not.\n\n \n Steeeeve, did you even read the article?\n Do you think they are going after groups just cause they \"oppose abortion or immigration\"???\n \n Let me QUOTE the article: \"(U//LES) Threats from white supremacist and violent antigovernment groups\n during 2009 have been largely rhetorical and have not indicated plans to carry\n out violent acts. Nevertheless, the consequences of a prolonged economic\n downturn-including real estate foreclosures, unemployment, and an inability\n to obtain credit-could create a fertile recruiting environment for rightwing\n extremists and even result in confrontations between such groups and\n government authorities similar to those in the past.\"\n Does that sound like anti-abortion groups?\n Does that sound like anti-immigration groups?\n \n Once again, you fly off the handle without even reading the article...", 
   {
    "unicode_changes_made": true
   }, 
   354172, 
   null, 
   1242680760.0
  ], 
  [
   354240, 
   null, 
   "Steeeeve", 
   "Steeeeve, did you even read the article?\n Do you think they are going after groups just cause they \"oppose abortion or immigration\"???\n \n Let me QUOTE the article: \"(U//LES) Threats from white supremacist and violent antigovernment groups\n during 2009 have been largely rhetorical and have not indicated plans to carry\n out violent acts. Nevertheless, the consequences of a prolonged economic\n downturn-including real estate foreclosures, unemployment, and an inability\n to obtain credit-could create a fertile recruiting environment for rightwing\n extremists and even result in confrontations between such groups and\n government authorities similar to those in the past.\"\n Does that sound like anti-abortion groups?\n Does that sound like anti-immigration groups?\n \n Once again, you fly off the handle without even reading the article...\nLet me quote the report (it isn't an article):\n \n Rightwing extremism in the United States can be broadly divided into those groups, movements, and adherents that are primarily hate-oriented (based on hatred of particular religious, racial or ethnic groups), and those that are mainly antigovernment, rejecting federal authority in favor of state or local authority, or rejecting government authority entirely. It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\n \n Not only did I read the report but I read the footnotes as well :)", 
   {
    "unicode_changes_made": true
   }, 
   354238, 
   null, 
   1242682020.0
  ], 
  [
   354241, 
   null, 
   "Steeeeve", 
   "Yes. Palin does disagree.\n So if you have an ORGANIZATION that says one thing and Palin says another, who do you believe?\n By your previous standards (if one were to suspend reality and believe you could apply consistently) you MUST discount Palin's claim cause she has a motive to lie.\nShe has as much reason to lie as they do so I go with what the official records say. Hard evidence is always the best evidence.\n \n \nAs it has been pointed out to me REPEATEDLY, Christianity is pretty diverse. It has a LOT of different aspects to believe in, with lots of trivial differences.\nOf course, and political parties are not...you believe everything about them when you attend a convention and are NOT EVEN A MEMBER. Give me a break Foundit...I called you on it so just admit it for once .\n \n \nI actively encourage EVERYBODY to report any time I call somebody a name.\nHa, wonder if Jyoshu agrees.", 
   {}, 
   354237, 
   null, 
   1242682620.0
  ], 
  [
   354250, 
   null, 
   "foundit66", 
   "Let me quote the report (it isn't an article):\n \n Rightwing extremism in the United States can be broadly divided into those groups, movements, and adherents that are primarily hate-oriented (based on hatred of particular religious, racial or ethnic groups), and those that are mainly antigovernment, rejecting federal authority in favor of state or local authority, or rejecting government authority entirely. It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\n \n Not only did I read the report but I read the footnotes as well :)\n\n \n Let me move your bold-faced so you recognize the important part of that sentence...\n \"It MAY INCLUDE GROUPS ...\"\n \n It didn't say that just cause these groups existed, they were automatically items of concern. emoticon_frazzled\n \n There you go again. Jumping to conclusions...\n \n And for the record, whoever burned down Palin's church, whether part of a group or an individual or insurance fraud, THEY are of concern.", 
   {}, 
   354240, 
   null, 
   1242690240.0
  ], 
  [
   354251, 
   null, 
   "foundit66", 
   "She has as much reason to lie as they do so I go with what the official records say.\n\n I have presented her reasons for lying.\n To date, you haven't even tried to contradict them.\n \n You have yet to give ANY reason why the AIP should lie about it, at their own convention behind closed doors, just speaking to their own members.\n \n Instead, you come up with this flimsy \"she has as much reason to lie as they do\" junk... emoticon_frazzled\n You say that without showing any evidence or reason.\n Who exactly is the one jumping to conclusions?\n \n \n \nOf course, and political parties are not...\n\n Oh Steeeeve.\n Perpetually obfuscating, refusing to address the point Steeeeve.\n \n A \"Christian\" church should have one FUNDAMENTAL aspect shared. Their belief in Christ as Lord and Savior.\n While they have OTHER MINOR details that vary, this FUNDAMENTAL aspect is supreme.\n It wouldn't make sense for a Jew to repeatedly attend Christian services...\n \n The AIP has one FUNDAMENTAL aspect that they are about.\n SECESSION.\n Their party is BUILT upon the ideals of secession.\n And THAT is the fundamental issue for which Palin either \"associates\" with, or she doesn't \"associate\" with.\n \n \n \nyou believe everything about them when you attend a convention and are NOT EVEN A MEMBER. Give me a break Foundit...I called you on it so just admit it for once .\n\n No Steeeeve, YOU give ME a break and start showing some intellectual honesty for a change. You repeatedly try to under-represent the situation to try to make it appear like I am judging based off of a mole-hill, while you ignore the MOUNTAIN I'm really talking about.\n \n This isn't about just \"attending\" a convention.\n She GAVE AN ADDRESS for MULTIPLE conventions.\n When they met OUTSIDE her own home-town, she STILL MADE IT A POINT to give an address.\n \n Now, if Obama WENT OUT OF HIS WAY to give an address (multiple addresses) to the Black Panthers, would you think that meaningless?\n \n Furthermore, they claimed her as a member BEHIND CLOSED DOORS at their own convention.\n WHY would they lie in that scenario?\n Makes no sense.\n \n \n \nHa, wonder if Jyoshu agrees.\n\n I have asked the same from him. If he has any problem with \"personal attacks\", he should report them immediately.\n Actually, Jyoshu is an EXTREMELY bad example cause when I FIRST got to this board, he started in with that passive-aggressive junk and I immediately told him to report it cause I would listen to the moderator but I wouldn't pretend I was insulting when I wasn't.\n Without surprise, nothing...\n \n I got fed up with Jyoshu's personal attacks as well and have reported him on occasion.\n Heck. Jyoshu once commented on PHYSICAL attacks against me based on how he didn't like my posting. So if you want to claim him as your role model, that's your problem.\n \n The only thing you two seem to understand is a moderator pointing out your bad behavior, so I'm happy to oblige!", 
   {}, 
   354241, 
   null, 
   1242690720.0
  ], 
  [
   354257, 
   null, 
   "Steeeeve", 
   "Let me move your bold-faced so you recognize the important part of that sentence...\n \"It MAY INCLUDE GROUPS ...\"\n \n It didn't say that just cause these groups existed, they were automatically items of concern. emoticon_frazzled\nWhich is probably why I said \"Groups that oppose abortion or immigration may be threats to the United States? \".\n \n can you just admit this one mistake? I won't even say anything about it if you do.", 
   {}, 
   354250, 
   null, 
   1242697500.0
  ], 
  [
   354258, 
   null, 
   "Steeeeve", 
   "I have presented her reasons for lying.\n To date, you haven't even tried to contradict them.\n \n You have yet to give ANY reason why the AIP should lie about it, at their own convention behind closed doors, just speaking to their own members.\nI figured you could easily think about it...A popular governor who has a husband in the party (or formerly of) and spoke at a convention would be a good person to relate to your own party and viewpoints in order to draw more support and thus more money in order to get your views enacted. In fairness I don't think they would hatefully lie about it but would be more than willing to stretch the truth for their own benefit. It's actually a good move on their part. If I were them I'd try to come across as a \"reformed republican party\" now. \n \n \nA \"Christian\" church should have one FUNDAMENTAL aspect shared. Their belief in Christ as Lord and Savior.\n While they have OTHER MINOR details that vary, this FUNDAMENTAL aspect is supreme.\n It wouldn't make sense for a Jew to repeatedly attend Christian services...\nYou just want to change the goal posts now so go ahead...It is funny that I catch you and you just deflect instead of admitting. \n \n \nThe AIP has one FUNDAMENTAL aspect that they are about.\n SECESSION.\n Their party is BUILT upon the ideals of secession.\nCan you show this from their platform? Alaskan Independence Party\n \n You are right in that they were founded on the idea of secession but when they became a true party it changed to allowing a vote on alaskan independence. According to their website there goal is: \n The Alaskan Independence Party's goal is the vote we were entitled to in 1958, one choice from among the following four alternatives:\n \n 1) Remain a Territory.\n 2) Become a separate and Independent Nation.\n 3) Accept Commonwealth status.\n 4) Become a State.\n So you are misleading if you say they want option 2 only....seems their goal is to just get a vote but their party stands for much more. As for Palin association herself with the idea that she wants option 2...there is NO evidence she does. In fact, the party's website talks about how you don't have to be all for secession to support the party. So even if she was a party member it doesn't mean she supports secession. \n \n I'm not even sure why I had to give this much detail into something that is so obvious to most folks.", 
   {}, 
   354251, 
   null, 
   1242698820.0
  ], 
  [
   354268, 
   null, 
   "foundit66", 
   "Which is probably why I said \"Groups that oppose abortion or immigration may be threats to the United States? \".\n can you just admit this one mistake? I won't even say anything about it if you do.\n\n I can. I should have read your statement more closely.\n \n If only you had the same capacity... emoticon_rolleyes\n \n \n \nI figured you could easily think about it...A popular governor who has a husband in the party (or formerly of) and spoke at a convention would be a good person to relate to your own party and viewpoints in order to draw more support and thus more money in order to get your views enacted.\n\n The problem with that is that the one incident I am directly referring to happened BEHIND CLOSED DOORS.\n It was their convention, to their fellow members.\n There is no \"more support\" to draw upon when you are speaking to JUST a group that is already \"supporting\" you.\n I DID think of that, which is why I pointed out the SPECIFIC example where it was behind closed doors to their own group!\n I figured you could easily recognize that... emoticon_rolleyes\n \n \n \nIf I were them I'd try to come across as a \"reformed republican party\" now. \n\n If you would listen to them, you would realize that they don't like the Republican party.\n They joke about the \"problems\" that Palin had when she joined the party. I believe it was a direct reference to Palin bucking her own party on ethics issues.\n \n \n \nYou just want to change the goal posts now so go ahead...It is funny that I catch you and you just deflect instead of admitting.\n\n Steeeeve?\n WAKE UP!\n It was MY analogy, which I MADE, talking about MY REASONING for why I came to the conclusion.\n I never changed ANY \"goalposts\" here.\n I think you have finally come around to realize what I was talking about on this issue, and instead of addressing it you're going to obfuscate the issue and deflect with a lame \"change the goal posts\" complaint. :xbanghead\n \n \n \nCan you show this from their platform? Alaskan Independence Party\n\n If I link you to NAMBLA's web-site, can you show me where they advocate molesting children??? :xbanghead\n \n Steeeeve, they are a SECESSION party.\n Always have been.\n Always will be.\n \n \n \nYou are right in that they were founded on the idea of secession but when they became a true party it changed to allowing a vote on alaskan independence. According to their website there goal is:\n \n The Alaskan Independence Party's goal is the vote we were entitled to in 1958, one choice from among the following four alternatives:\n \n 1) Remain a Territory.\n 2) Become a separate and Independent Nation.\n 3) Accept Commonwealth status.\n 4) Become a State.\n\n Oh for the love of ...\n \n And WHICH OPTION do you think the AIP party will advocate voting for???\n Could the Alaskan INDEPENDENCE Party possibly be interested in option #2, which talks about them being an INDEPENDENT nation???? :xbanghead\n \n \n \nSo you are misleading if you say they want option 2 only....seems their goal is to just get a vote but their party stands for much more.\n\n Wow dude.\n That's like saying \"The Republicans want McCain and Obama on the ballot, so obviously we can't say who they want for President\"...\n :xbanghead :xbanghead :xbanghead\n \n \n \nAs for Palin association herself with the idea that she wants option 2...there is NO evidence she does.\n\n I would love to see you post something that doesn't include at least one blatant strawman association...\n That sentence should read \"As for Palin association herself with the idea that she wants option 2, NOBODY IS ARGUING THAT HAS BEEN PROVEN\"\n \n In the Obama association with Ayers, does anybody think that it showed Obama thought Ayers was right in his terrorist attack????\n NO!!!! :xbanghead\n \n \n \nI'm not even sure why I had to give this much detail into something that is so obvious to most folks. \n\n Cause you're desparate to avoid responding to what I AM saying.\n So you're throwing all sorts of junk out there that I NEVER ARGUED AGAINST in the first place... :xbanghead", 
   {}, 
   354257, 
   null, 
   1242708480.0
  ], 
  [
   354284, 
   null, 
   "Steeeeve", 
   "The problem with that is that the one incident I am directly referring to happened BEHIND CLOSED DOORS.\n It was their convention, to their fellow members.\n There is no \"more support\" to draw upon when you are speaking to JUST a group that is already \"supporting\" you.\n I DID think of that, which is why I pointed out the SPECIFIC example where it was behind closed doors to their own group!\nYes there...called donations. In any event, it is contradicted by other more persuasive evidence such as a voter registration card. This is just like Obama who is clearly a US Citizen based upon the birth certificate and not what people in Kenya or others may have said.\n \n \n Furthermore, you should read about the AIP party more to understand their viewpoints. Not all of them are about secession as supported below (and I wouldn't care if they did support it because that is ok as well):\n Since its founding, the AIP has radically changed with respect to the issue of secession. At present, it does not support secession, though, at its founding, it did.\n Alaskan Independence Party", 
   {}, 
   354268, 
   null, 
   1242751980.0
  ], 
  [
   354296, 
   null, 
   "foundit66", 
   "Yes there...called donations.\n\n \"donations\"?\n Do you really think people are there saying \"Well, I was only going to donate $100, but since Palin is a member I'll donate $200\"\n \n That's really flimsy.\n \n \n \nIn any event, it is contradicted by other more persuasive evidence such as a voter registration card. This is just like Obama who is clearly a US Citizen based upon the birth certificate and not what people in Kenya or others may have said.\n\n There is a huge difference between a binary situation, of either being a citizen or not being a citizen, and whether or not a person SHOULD be considered a member.\n \n If somebody were to hang out with the Republicans and provide them with support by giving them key speeches like public addresses, but not have a Republican member card, does that mean the person isn't really a \"Republican\"?\n What party a person associates with is not dictated by the existence or absence of a membership card.\n \n I admit the card IS a significant factor, but my point is that it is not the end-all and be-all of the argument.\n \n \n \nFurthermore, you should read about the AIP party more to understand their viewpoints. Not all of them are about secession as supported below (and I wouldn't care if they did support it because that is ok as well):\n Since its founding, the AIP has radically changed with respect to the issue of secession. At present, it does not support secession, though, at its founding, it did.\n Alaskan Independence Party\n\n So riddle me this.\n If this is supposedly true, WHY SUPPORT THE VOTE?\n \n It's like NAMBLA saying that they don't want to have sex with kids, but then they support repealing the age of consent laws and all laws restricting sex by age.\n Actions speak louder than words.\n \n And despite what you claim, if you don't think that a person campaigning to be elected to the second highest office in this UNITED STATES associating with a group pushing a vote for independence is somehow relevant, you're kidding yourself.\n It's like saying \"Hi! I want to be head of the RNC. But in the past, I have given speeches of support to these pro-abortion rights groups. Don't worry about that, cause I don't have a membership card to those groups! emoticon_xgood \"\n \n She should have been ASKED about her association with AIP in an interview, instead of just having a press release from the campaign trail. But then again, the McCain campaign needed to give special treatment demands for interviewers, demanding \"deference\", so that the \"ready for the White House\" governor could be treated with kid gloves... :xbanghead", 
   {}, 
   354284, 
   null, 
   1242766560.0
  ], 
  [
   354303, 
   null, 
   "jyoshu", 
   "I have asked the same from him. If he has any problem with \"personal attacks\", he should report them immediately.\n\n \n I have done so on more than one occasion, and noticed the post commented on had changed (moderator edit, no doubt). But I do so very sparingly. I prefer rather to just call you on your junk as Steeeeve is doing, so others can see what you're up to.\n \n \nHeck. Jyoshu once commented on PHYSICAL attacks against me based on how he didn't like my posting.\n\n \n Huh??? What the heck are you even talking about now? \n \n It's interesting though, to watch yet another Foundit trainwreck unfold in this thread. Yet again, Foundit can't resist temptation to discuss POSTERS (messenger over message) rather than the topics at hand. At least you're glaringly consistent, F.", 
   {}, 
   354251, 
   null, 
   1242768180.0
  ], 
  [
   354305, 
   null, 
   "foundit66", 
   "I have done so on more than one occasion, and noticed the post commented on had changed (moderator edit, no doubt). But I do so very sparingly. I prefer rather to just call you on your junk as Steeeeve is doing, so others can see what you're up to.\n\n The thing is Jyoshu?\n When you first started \"calling me on my junk\", I had several posters sending me IMs to reconfirm what I already suspected.\n \n It was just a lame passive-aggressive stunt on your part.\n The vast majority of your complaints are meaningless mewling.\n \n You pull this passive-aggressive junk A LOT, and a lot of the \"others\" have recognized that a long time ago... emoticon_xagree\n \n Plus, I know there have been some reporting attempts you have made that have failed miserably.\n http://www.4forums.com/political/320183-post61.html\n Ultimately, I think you just like to whine about being mistreated and I think deep down even you recognize your complaints aren't significant enough to warrant action.\n \n \n \nHuh??? What the heck are you even talking about now? \n\n Yeah. I figured you would play ignorant on it.\n I'll have to dig it up if I have time. It was a while ago, but I couldn't help but think in retrospect how much it was showing that you were having a melt-down.\n \n \n \nIt's interesting though, to watch yet another Foundit trainwreck unfold in this thread. Yet again, Foundit can't resist temptation to discuss POSTERS (messenger over message) rather than the topics at hand. At least you're glaringly consistent, F.\n\n BLOWI.\n If you look at what Steeeeve and I are discussing, it IS THE MESSAGE. We have side-comments, but they are SIDE-comments. Not \"rather than the topic at hand\" which you deceitfully claim.\n On the other hand, you jump on and IGNORE the topic, and you SOLELY discuss the messenger.\n At least you're glaringly consistent, J.", 
   {}, 
   354303, 
   null, 
   1242768660.0
  ], 
  [
   354315, 
   null, 
   "jyoshu", 
   "The thing is Jyoshu?\n When you first started \"calling me on my junk\", I had several posters sending me IMs..\n\n \n [applause] Thanks for the example of EXACTLY the sort of junk I'm referring to, right on cue. \n Look, it's pretty clear that you think most people care about these little spats of yours a LOT more than they really do. I'll repeat a suggestion I made awhile back ... that you petition the moderator for a special section of the forum (mainly just for you I suppose, since this sort of think is mostly your gig) for the express purpose of whining about the posters you take umbrage with. That would at least allow myself and others to not have to scroll past all the junk posts. And if anyone DOES want to read them, they'll be all right there in a dedicated section.", 
   {}, 
   354305, 
   null, 
   1242771840.0
  ], 
  [
   354317, 
   null, 
   "foundit66", 
   "[applause] Thanks for the example of EXACTLY the sort of junk I'm referring to, right on cue. \n Look, it's pretty clear that you think most people care about these little spats of yours a LOT more than they really do.\n\n Talk about the pot calling the kettle black.\n You jump on here, IGNORE THE TOPIC, and complain about me...\n emoticon_frazzled\n \n If you don't recognize how you're having a \"spat\" right now, IGNORING THE TOPIC, then you're blind.\n \n \n \nI'll repeat a suggestion I made awhile back ... that you petition the moderator a special section of the forum (mainly just for you I suppose, since this sort of think is mostly your gig) for the express purpose of whining about the posters you take umbrage with.\n\n Jyoshu, what are you doing RIGHT HERE???\n As much as you don't want to admit it, YOU would be on that section a LOT.\n \n And the whole reason we even started on this is because Steeeeve started on his character assassination kick again. Talking about ME PERSONALLY...\n \n Like I was saying, you guys COMMIT the acts you perpetually complain about.\n \n In the interests of you not attacking the messenger, I recommend you do just that if you're going to complain about it. Stop spamming this thread with non-topical junk and telling me to stop doing what YOU ARE OBVIOUSLY DOING RIGHT NOW. emoticon_ic\n \n Incidentally, I have bookmarked THAT post as well to address you the next time you start pulling this elsewhere...\n Thanks!", 
   {}, 
   354315, 
   null, 
   1242772080.0
  ], 
  [
   354322, 
   null, 
   "Steeeeve", 
   "\"donations\"?\n Do you really think people are there saying \"Well, I was only going to donate $100, but since Palin is a member I'll donate $200\"\n \n That's really flimsy.\nI do that. If I think a party/political member is not really going anywhere I donate less. If I see some life and recognizable figures supporting my cause I donate more. There is a reason United Way has football players do their ads :)\n \n \nThere is a huge difference between a binary situation, of either being a citizen or not being a citizen, and whether or not a person SHOULD be considered a member.\n \n If somebody were to hang out with the Republicans and provide them with support by giving them key speeches like public addresses, but not have a Republican member card, does that mean the person isn't really a \"Republican\"?\nI think it doesn't mean they are a republican. Even more so if you have the case of two parties being very close in viewpoint and your spouse is a member. This overshadows the original point that any association is minor AND not a big deal anyway...or \"overblown\" was the word I used. \n \n You'd have a more valid point if this was the Nazi party and you saw her doing the Hitler salute all the time. But that is just not the case here and thus it is overblown. And yes, this was a huge mistake by McCain to make it a big deal...you are correct in they did.\n \n \nI admit the card IS a significant factor, but my point is that it is not the end-all and be-all of the argument.\nVery true...my uncle is a card carrying democrat only so he can get elected :). It is more persuasive evidence, in my opinion, than other things and to me doesn't show an extremist position held by Palin (or rather a bad association).\n \n \nSo riddle me this.\n If this is supposedly true, WHY SUPPORT THE VOTE?\nCould they just be saying this? I'm sure, but I don't know and don't have any evidence to support that. If I had to guess (and this is JUST a guess) I would say they removed that in order to attract more support from those iffy on the subject of secession. So instead you put it a few options and you become more inclusive.\n \n \nAnd despite what you claim, if you don't think that a person campaigning to be elected to the second highest office in this UNITED STATES associating with a group pushing a vote for independence is somehow relevant, you're kidding yourself.\nNot only is it not a big deal but perhaps she should have taken more issues from the AIP...after reading their platform they seem more conservative than the republican party for sure.\n \n \nShe should have been ASKED about her association with AIP in an interview, instead of just having a press release from the campaign trail. But then again, the McCain campaign needed to give special treatment demands for interviewers, demanding \"deference\", so that the \"ready for the White House\" governor could be treated with kid gloves... :xbanghead\nListen, no one doubts the McCain campaign was probably the worst run since '88.", 
   {}, 
   354296, 
   null, 
   1242774060.0
  ], 
  [
   354324, 
   null, 
   "Steeeeve", 
   "Foundit,\n \n You get IMs from people? Did you mean PM?\n \n I'm just interested in if you talk to people on this forum outside of the forum environment.", 
   {}, 
   354322, 
   null, 
   1242774180.0
  ], 
  [
   354329, 
   null, 
   "foundit66", 
   "Foundit,\n You get IMs from people? Did you mean PM?\n I'm just interested in if you talk to people on this forum outside of the forum environment.\n\n I meant Private Messages (on board \"e-mail\" system, accessible in upper right corner).\n I confused the terminology.\n \n And there are a few I correspond with on personal e-mail, independent of this board.", 
   {}, 
   354324, 
   null, 
   1242776400.0
  ], 
  [
   354338, 
   null, 
   "Steeeeve", 
   "I meant Private Messages (on board \"e-mail\" system, accessible in upper right corner).\n I confused the terminology.\n \n And there are a few I correspond with on personal e-mail, independent of this board.\nOk, it didn't relate to anything I was just going to be surprised if people communicate outside the board", 
   {}, 
   354329, 
   null, 
   1242786000.0
  ], 
  [
   356438, 
   null, 
   "foundit66", 
   "Huh??? What the heck are you even talking about now? \n\n Foundit!\n jyoshu: \"If they didn't and employed the examples we see above regularly (referencing foundit66 post), it would be a sure ticket to losing some teeth now and then.\"\n http://www.4forums.com/political/gay-rights-debates/12020-prop-8-protests-changing-minds-3.html#post334631", 
   {}, 
   354303, 
   null, 
   1244186820.0
  ], 
  [
   356477, 
   null, 
   "jyoshu", 
   "Foundit!\n jyoshu: \"If they didn't and employed the examples we see above regularly (referencing foundit66 post), it would be a sure ticket to losing some teeth now and then.\"\n http://www.4forums.com/political/gay-rights-debates/12020-prop-8-protests-changing-minds-3.html#post334631\n\n \n How does \"commenting on physical attacks against\" you even matter in your discussion w Steeeeve? Geez, it's not like I was threatening you--I was trying to get you to see that you have an offensive posting style and if you were to talk to people like that in real life--face to face--there's no way you'd go very many conversations without loosing some teeth. An anonymous online venue allows you to get away with things like 'roll on the floor and laugh at people', roll your eyes constantly, do the online-equivient of shouting at them, etc. without worry that you would have to deal with the repercussions that you would if you were actually doing that sort of thing to so many people in a real face-to-face setting.", 
   {}, 
   356438, 
   null, 
   1244216400.0
  ], 
  [
   356484, 
   null, 
   "foundit66", 
   "How does \"commenting on physical attacks against\" you even matter in your discussion w Steeeeve?\n\n Actually, Steeeeve brought you up.\n \n \n \nGeez, it's not like I was threatening you--I was trying to get you to see that you have an offensive posting style and if you were to talk to people like that in real life--face to face--there's no way you'd go very many conversations without loosing some teeth.\n\n Like many things with you, it's simply a passive-aggressive threat.\n More aggressive than your usual demeanor...\n \n Quite frankly, I never even consider physical violence against anybody I am posting to. It just never occurs to me.\n I don't sit here thinking \"Gee. Somebody would have hit ____ by now in real life.\"\n It's bizarre that you picture it.\n \n \n \nAn anonymous online venue allows you to get away with things like 'roll on the floor and laugh at people', roll your eyes constantly, do the online-equivient of shouting at them, etc. without worry that you would have to deal with the repercussions that you would if you were actually doing that sort of thing to so many people in a real face-to-face setting.\n\n Jyoshu, an anonymous online venue allows YOU to get away with a lot of %%%% also.\n You've got a pretty serious history yourself.\n It's incredibly hypocritical of you to criticize others for \"anonymous\" stuff, considering your history.\n \n But seriously, I am who I am online and in real life. I am real here, unlike some people.\n I HAVE NEVER come across the type of stuff you present, \"in real life\".\n If I were, that WOULD be my honest reaction.\n I think it would be a LOT of people's honest reaction, cause it's just too absurd for words!\n \n But let me guess. You want to comment on OTHER people's reactions and history, while YOURS is protected and not to be discussed? emoticon_rolleyes\n Can I smell your inevitable hypocrisy here?\n \n You asked for what I was talking about.\n I gave it.\n You try to justify it?\n I give my version of things.\n \n Quite frankly, I would LOVE if you would get to a TOPICAL SUBJECT, but I don't think you're about to on these threads.", 
   {}, 
   356477, 
   null, 
   1244219340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Palin's Choice: Not Like Sophie's...", 
  "url": "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12675, 
  "discussion_files": [
   [
    "3531.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-print.html"
   ], 
   [
    "3532.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-6-print.html"
   ], 
   [
    "3533.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-4-print.html"
   ], 
   [
    "3534.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-5-print.html"
   ], 
   [
    "3535.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-3-print.html"
   ], 
   [
    "3536.html", 
    "http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies-2-print.html"
   ]
  ], 
  "identifier": 12675
 }
]