[
 [
  [
   353433, 
   null, 
   "obvious_child", 
   "Archangel has argued that The Theory of evolution says that \"life originated spontaneously from a single celled organism and that all life came about through random mutation.\"\n \n I disagree. \n \n Resolved: The Theory of Evolution and its associated evolutionary sciences do not discuss how life arouse (abiogenesis) and provide other numerous mechanisms for how life came to be as we see it today other than random mutation.", 
   {
    "post_info": {
     "post_title": "Evolution - Not Abiogenesis and not just random mutations"
    }
   }, 
   null, 
   null, 
   1242119100.0
  ], 
  [
   353449, 
   null, 
   "Archangel", 
   "Archangel has argued that The Theory of evolution says that \"life originated spontaneously from a single celled organism and that all life came about through random mutation.\"\n\n \n You're a blatant and unmitigated liar! I'm a creationist and argue no such thing at all. AND EVERY SINGLE PERSON WHO HAS EVER READ MY POSTS ON THIS FORUM KNOWS THAT. And here is my profile so anyone can check my posting history for evidence of that. 4Forums.com Political Debates and Polls - View Profile: Archangel It is you who defends evolution and random mutation by way of Natural Selection. But you are so incredibly dishonest that you will now claim that because I define what evolution claims that I am now arguing in favor of it. A more despicable line of arguing is hard to imagine, but coming from an ignorant, cowardly and dishonest philosophical coward like you, I guess it's to be expected. \n\n \n I disagree. \n \n Resolved: The Theory of Evolution and its associated evolutionary sciences do not discuss how life arouse (abiogenesis) and provide other numerous mechanisms for how life came to be as we see it today other than random mutation.\n\n \n Once again you simpleton, it's arose. Get a clue before using nonexistent words, ok? And I already proved you are full of it on the other thread by posting this same link. Here it is again since you want to be proven to be an uninformed liar once again. \n The link is titled the \"Basics of Evolution\"\n \n The Basic Theory:\n The theory of evolution teaches that the complex life forms on Earth that we see today (mammals, birds, insects, plants) evolved over millions of years from much simpler life forms (bacteria, single celled organisms) via a process called natural selection. Minor mutations occur in individuals over generations. If these mutations are beneficial, the animal has a slightly better chance of survival and passes the mutation on to its off spring. (For example, a slight mutation that makes the animal run slightly faster may mean that it can better escape being eaten by predators.) Over time these mutations lead to animals evolving that cannot inter breed with each other &#8211; a new species has evolved.\n The link also says this:\n \"Evolution\" can help explain how life first appeared on earth:\n \n The origin of life remains very much a mystery, but scientists have learned how primitive building blocks of life (nucleic acids, amino acids etc) could have formed and organized themselves into simple life forms (self-replicating, self-sustaining bodies).\n Notice little child, no mention of the process of abiogenesis here at all. This is being discussed as the process of evolution.\n Analysis of space dust carried out by NASA hints that quantities of these primitive building blocks might have originated in space and fallen to earth in comets. This scenario may solve the problem of how life arose when our planet was young.\n Computer modelling of evolution has shown that natural selection can push evolution in one direction and produce sophisticated structures in surprisingly short times (tens of thousands of years).Basics of Evolution - Info Barrel\n \n And here we see an explanation which your hero Dawkins endorses as a way for spontaneous life to have appeared on a completely dead world some alleged 4.5 billion years ago since they know that there is no evidence at all upon which to base this preposterous fairy tale. So obviously the building blocks came from outer space, right? All we need do now is discover how these living organisms survived the sulfuric acid atmosphere and molten lava oceans they assume also existed at that time. :xbanghead \n \n Now, NOTE THE BOLDED: this is what I claimed evolution asserts, and this is PRECISELY what evolution claims is a fact at its most fundamental level since it is here in black and white in the posted pro-evolution link which is explaining what the theory represents. Now come back with your usual sanctimonious and insulting manner and tell me I just don't get it obvious child, so everyone can see without doubt how incredibly dishonest your debating tactics are, not to mention your own ignorance of the alleged science you attempt to defend and your incredible denial of what it actually represents in reality.", 
   {}, 
   353433, 
   null, 
   1242146580.0
  ], 
  [
   353458, 
   null, 
   "T.Q", 
   "Archie, he's saying that's what you claim the ToE argues. NOT that you support it.\n \n \nNow, NOTE THE BOLDED: this is what I claimed evolution asserts, and this is PRECISELY what evolution claims is a fact at its most fundamental level since it is here in black and white in the posted pro-evolution link which is explaining what the theory represents.\n\n And then you go ahead and spend the rest of your post arguing exactly what he claims you are arguing!\n \n I mean really Archie, I'm embarassed for you at this point.", 
   {}, 
   353449, 
   null, 
   1242150420.0
  ], 
  [
   353481, 
   null, 
   "obvious_child", 
   "Can someone point out to me where \"the change in allele frequencies\" say anything about how life first came to be? \n \n And arch, how am I lying when I directly quoted you and linked to the post you made that statement? \n \n And I said you claimed that was what the theory said. I never said you believed it. In fact the point of the thread was to show that the belief that abiogenesis = evolution and evolution is nothing more than random mutations is wrong. \n \n And your site is wrong.\n CB090: Evolution without abiogenesis\n Evolution -- Abiogenesis -- Origin of Life\n \n And I'd love to see a textbook on biology that says the two are the same. \n \n As for lack of any evidence, explain to me the billion+ year old microbes found in meteorites from Mars found in Antarctica. \n \n You obviously don't get it. ", 
   {}, 
   353458, 
   null, 
   1242163860.0
  ], 
  [
   353539, 
   null, 
   "tester", 
   " As for lack of any evidence, explain to me the billion+ year old microbes found in meteorites from Mars found in Antarctica.\n \n\n \n The evidence for microbes in the Martian meteorites is not particularly strong. Its validity is still being debated, and there not a clear consensus.", 
   {}, 
   353481, 
   null, 
   1242191340.0
  ], 
  [
   353541, 
   null, 
   "Archangel", 
   "Archangel has argued that The Theory of evolution says that \"life originated spontaneously from a single celled organism and that all life came about through random mutation.\"\n\n \n You're a blatant and unmitigated liar! I'm a creationist and argue no such thing at all. AND EVERY SINGLE PERSON WHO HAS EVER READ MY POSTS ON THIS FORUM KNOWS THAT. And here is my profile so anyone can check my posting history for evidence of that. 4Forums.com Political Debates and Polls - View Profile: Archangel It is you who defends evolution and random mutation by way of Natural Selection. But you are so incredibly dishonest that you will now claim that because I define what evolution claims that I am now arguing in favor of it. A more despicable line of arguing is hard to imagine, but coming from an ignorant, cowardly and dishonest philosophical coward like you, I guess it's to be expected. \n\n \n I disagree. \n \n Resolved: The Theory of Evolution and its associated evolutionary sciences do not discuss how life arouse (abiogenesis) and provide other numerous mechanisms for how life came to be as we see it today other than random mutation.\n\n \n Once again you simpleton, it's arose. Get a clue before using nonexistent words, ok? And I already proved you are full of it on the other thread by posting this same link. Here it is again since you want to be proven to be an uninformed liar once again. \n The link is titled the \"Basics of Evolution\"\n \n The Basic Theory:\n The theory of evolution teaches that the complex life forms on Earth that we see today (mammals, birds, insects, plants) evolved over millions of years from much simpler life forms (bacteria, single celled organisms) via a process called natural selection. Minor mutations occur in individuals over generations. If these mutations are beneficial, the animal has a slightly better chance of survival and passes the mutation on to its off spring. (For example, a slight mutation that makes the animal run slightly faster may mean that it can better escape being eaten by predators.) Over time these mutations lead to animals evolving that cannot inter breed with each other - a new species has evolved.\n The link also says this:\n \"Evolution\" can help explain how life first appeared on earth:\n \n The origin of life remains very much a mystery, but scientists have learned how primitive building blocks of life (nucleic acids, amino acids etc) could have formed and organized themselves into simple life forms (self-replicating, self-sustaining bodies).\n Notice little child, no mention of the process of abiogenesis here at all. This is being discussed as the process of evolution.\n Analysis of space dust carried out by NASA hints that quantities of these primitive building blocks might have originated in space and fallen to earth in comets. This scenario may solve the problem of how life arose when our planet was young.\n Computer modelling of evolution has shown that natural selection can push evolution in one direction and produce sophisticated structures in surprisingly short times (tens of thousands of years).Basics of Evolution - Info Barrel\n \n And here we see an explanation which your hero Dawkins endorses as a way for spontaneous life to have appeared on a completely dead world some alleged 4.5 billion years ago since they know that there is no evidence at all upon which to base this preposterous fairy tale. So obviously the building blocks came from outer space, right? All we need do now is discover how these living organisms survived the sulfuric acid atmosphere and molten lava oceans they assume also existed at that time. :xbanghead \n \n Now, NOTE THE BOLDED: this is what I claimed evolution asserts, and this is PRECISELY what evolution claims is a fact at its most fundamental level since it is here in black and white in the posted pro-evolution link which is explaining what the theory represents. Now come back with your usual sanctimonious and insulting manner and tell me I just don't get it obvious child, so everyone can see without doubt how incredibly dishonest your debating tactics are, not to mention your own ignorance of the alleged science you attempt to defend and your incredible denial of what it actually represents in reality.", 
   {
    "unicode_changes_made": true
   }, 
   353539, 
   null, 
   1242193440.0
  ], 
  [
   353550, 
   null, 
   "T.Q", 
   "The surest sign that Archie's been caught out:\n \n He repeats the same drivel he was just caught on.", 
   {}, 
   353541, 
   null, 
   1242198780.0
  ], 
  [
   353552, 
   null, 
   "obvious_child", 
   "The evidence for microbes in the Martian meteorites is not particularly strong. Its validity is still being debated, and there not a clear consensus.\n\n \n Fair enough, but it does suggest that the capacity for life to actually move across stellar distances is a possibility.", 
   {}, 
   353539, 
   null, 
   1242209820.0
  ], 
  [
   353553, 
   null, 
   "obvious_child", 
   "The surest sign that Archie's been caught out:\n \n He repeats the same drivel he was just caught on.\n\n \n At this point, I'm not even sure he can read properly.\n \n The fact that he clearly misses that all I said was his statement that Evolution says _____ is wrong is kind of disturbing. Furthermore, the whole thread being about why his statement is wrong is even more disturbing. He doesn't even get that no one is saying he believes it. Only that his statement was wrong. And I'd really like to know how I am the alleged liar when all I did was quote him and directly link to the post where he made the statement. \n \n I do find it amusing how he earlier stated \"that all life came about through random mutation\" yet he cites a source that argues that natural selection and not random mutations were the cause. One really does wonder if he has the capacity to understand the English language when he does something like that. Normally, people don't cite websites that refute their own claim when trying to refute their debate opponent. \n \n And at this point, I've given up any hope that Arch has any clue about what evolution actually is. The fact that he thinks evolution deals with things that don't have genes is rather amusing.\n \n I do feel a bit guilty for beating up on a guy who doesn't have the capacity to understand simple English words.", 
   {}, 
   353550, 
   null, 
   1242210180.0
  ], 
  [
   353560, 
   null, 
   "smiley", 
   "Archie's inability to read has been pointed out on many many occasions. I suspect it is just laziness. He quickly reads something and jumps to the wrong conclusion, then goes off on one of his rants. All it would take is a quick reread to see that he had got the wrong end of the stick.\n \n If he then were to admit his error and make some sort of apology for his stupidity, all would be well. But then of course we encounter his bigger character flaw of being unable to admit that he could possibly be wrong about anything.\n \n Then the victimisation complex emerges. Along with the insults, threats of eternal damnation etc etc etc.\n \n Rinse and repeat.", 
   {}, 
   353553, 
   null, 
   1242222000.0
  ], 
  [
   353574, 
   null, 
   "Archangel", 
   "Archie's inability to read has been pointed out on many many occasions. I suspect it is just laziness. He quickly reads something and jumps to the wrong conclusion, then goes off on one of his rants. All it would take is a quick reread to see that he had got the wrong end of the stick.\n \n If he then were to admit his error and make some sort of apology for his stupidity, all would be well. But then of course we encounter his bigger character flaw of being unable to admit that he could possibly be wrong about anything.\n \n Then the victimisation complex emerges. Along with the insults, threats of eternal damnation etc etc etc.\n \n Rinse and repeat.\n\n \n What I find humorous is that you would say this about me while you have no opinion about the blatant dishonesty and lunacy which the little child represents in every debate he trolls on. This just shows that you are no better than he is so your opinion of me, and your over all points of view become irrelevant. But thanks for sharing anyway. emoticon_rolleyes", 
   {}, 
   353560, 
   null, 
   1242232620.0
  ], 
  [
   353576, 
   null, 
   "smiley", 
   "What I find humorous is that you would say this about me while you have no opinion about the blatant dishonesty and lunacy which the little child represents in every debate he trolls on. This just shows that you are no better than he is so your opinion of me, and your over all points of view become irrelevant. But thanks for sharing anyway. emoticon_rolleyes\n\n Victimisation complex right on cue.", 
   {}, 
   353574, 
   null, 
   1242232800.0
  ], 
  [
   353579, 
   null, 
   "Archangel", 
   "Victimisation complex right on cue.\n\n \n Any honest observation which is leveled at you and about you will be seen as a proclamation of victimization rather than what it is since you are in such deep personal denial, right on cue.", 
   {}, 
   353576, 
   null, 
   1242233100.0
  ], 
  [
   353633, 
   null, 
   "obvious_child", 
   "What I find humorous is that you would say this about me while you have no opinion about the blatant dishonesty and lunacy which the little child represents in every debate he trolls on. This just shows that you are no better than he is so your opinion of me, and your over all points of view become irrelevant. But thanks for sharing anyway. emoticon_rolleyes\n\n \n Oh this is funny. Smiley highlights your inability to read. You respond by citing my alleged dishonesty, which you think is me saying you believe in evolution. The funny **** is that no one ever said you believed it, only that your statement about what evolution is, is wrong. And Smiley is again right as you have cited a website that refutes your claim. If you could actually read, you wouldn't have picked that site as it says that life came to be as we know it through natural selection, not just random mutations as you have claimed. Why would someone who could read properly quote a website that refutes their own claims? \n \n Clearly, Smiley is right. You cannot read for comprehension. Nor will you ever admit you're wrong. \n \n Please tell me, where did I ever say you believed in evolution? \n \n And you're a liar when you said this \"I'm a creationist and argue no such thing at all.\" \n \n But you did:\n \n \n\n And you do this because you can't argue evolutionary science on the merits it claims to be based upon, and that is that life originated spontaneously from a single celled organism and that all life came about through random mutation. But nice try once again attempting to redirect the debate.\n\n \n http://www.4forums.com/political/353415-post20.html", 
   {}, 
   353574, 
   null, 
   1242251940.0
  ], 
  [
   353647, 
   null, 
   "The Skeptic", 
   "Archangel, do you seriously think your last few posts in this thread will convert people to your point of view? What is your objective?", 
   {}, 
   353633, 
   null, 
   1242259260.0
  ], 
  [
   353662, 
   null, 
   "marc9000", 
   "Archangel, do you seriously think your last few posts in this thread will convert people to your point of view? What is your objective?\n\n \n My guess is that his objective is to expose this thread for what it is - nothing but flame bait. It should be deleted, or moved to the open forum.\n \n Has anyone noticed what a train wreck this resolution is? How it completely contradicts itself? \n \n \nResolved: The Theory of Evolution and its associated evolutionary sciences do not discuss how life arouse (abiogenesis) and provide other numerous mechanisms for how life came to be as we see it today other than random mutation. \n\n \n It does not \"discuss\" how life \"arose\", but it does \"provide\" other numerous mechanisms for how life \"came to be\"? What are the differences between discussing and providing, or arising vs coming to be?", 
   {}, 
   353647, 
   null, 
   1242264540.0
  ], 
  [
   353663, 
   null, 
   "T.Q", 
   "I can see why you're confused Marc. I often don't understand the meaning behind a sentence when I ignore half of it.\n \"how life came to be as we see it today\"\n \n See? Makes much more sense when you read the entire sentence?\n \n O_C is saying that the ToE does not address the origin of life, and that evolution does not act strictly through the occurence of random mutation.", 
   {}, 
   353662, 
   null, 
   1242265200.0
  ], 
  [
   353665, 
   null, 
   "marc9000", 
   "I can see why you're confused Marc. I often don't understand the meaning behind a sentence when I ignore half of it.\n \"how life came to be as we see it today\"\n \n See? Makes much more sense when you read the entire sentence?\n \n O_C is saying that the ToE does not address the origin of life, and that evolution does not act strictly through the occurence of random mutation.\n\n \n So you believe it's a perfectly worded resolution?", 
   {}, 
   353663, 
   null, 
   1242266160.0
  ], 
  [
   353667, 
   null, 
   "T.Q", 
   "Not at all. It's awkwardly phrased. It is, however, completely understandable. Especially if you read the entire sentence instead of only parts of it.", 
   {}, 
   353665, 
   null, 
   1242266520.0
  ], 
  [
   353668, 
   null, 
   "obvious_child", 
   "Not at all. It's awkwardly phrased. It is, however, completely understandable. Especially if you read the entire sentence instead of only parts of it.\n\n \n It is a bit awkward. But I had to phrase it around Arch's stated misconception. \n \n But whowouldathunk that reading the entire sentence would result in that sentence making sense? \n \n Nah, let's just ignore half of the words and fill in the rest with what we think they said. emoticon_xagree\n \n I do think it's a bit sad we're bashing creationists on their deficiencies in reading comprehension. At some point, it's not about the science. It's about their fundamental capacities as a literate person in the field of literacy.", 
   {}, 
   353667, 
   null, 
   1242267180.0
  ], 
  [
   353669, 
   null, 
   "Archangel", 
   "And yet the link I posted above, \"The Basics of Evolution\" says this very clearly:\n \"Evolution\" can help explain how life first appeared on earth:\n \n The origin of life remains very much a mystery, but scientists have learned how primitive building blocks of life (nucleic acids, amino acids etc) could have formed and organized themselves into simple life forms (self-replicating, self-sustaining bodies).\n If any of you evos had even one honest bone in your bodies, in any other debate you would argue ad infinitum that this statement is a perfect definition of abiogenesis. But here we see it in a pro-evolution site titled \"The Basics of Evolution\" And the denials and obfuscations kick in full force as you discuss anything but that fact. It's easier to attack Archangel's reading comprehension than admit that he is right. which would mean that it's your reading comprehension which is seriously flawed, not to mention your intellectual honesty, of course. ;)", 
   {}, 
   353663, 
   null, 
   1242267420.0
  ], 
  [
   353670, 
   null, 
   "obvious_child", 
   "My guess is that his objective is to expose this thread for what it is - nothing but flame bait. It should be deleted, or moved to the open forum.\n\n \n Arch thinks this about everything that he disagrees with. Not a great measure of anything really. \n \n \nHas anyone noticed what a train wreck this resolution is? How it completely contradicts itself?\n\n \n As T.Q has pointed out, it only appears that way if you don't read the whole resolution. Generally, the English Language is structured so that sentences and paragraphs are meant to be read as a whole. Not in individual bits and pieces as you do. All of the words between the two periods go together, thus when you do what you did, not read all of the words between the two sentences as a singular unit of literacy, you get messed up outcomes in interpretation. \n \n \nIt does not \"discuss\" how life \"arose\", but it does \"provide\" other numerous mechanisms for how life \"came to be\"?\n\n \n Again, as T.Q pointed out, ignoring half of the sentence results in failure to understand the meaning of that sentence. As I previously pointed out, sentences are meant to be taken as a whole. When you again, refuse to abide to the basic rules of the English language, you end up with messed up interpretations. \n \n \nWhat are the differences between discussing and providing, or arising vs coming to be?\n\n \n Simple. Evolution explains and provided mechanisms for how life changed over time. It says nothing about how that first living organisms with alleles came from non-life.", 
   {}, 
   353662, 
   null, 
   1242267540.0
  ], 
  [
   353671, 
   null, 
   "obvious_child", 
   "And yet the link I posted above, \"The Basics of Evolution\" says this very clearly:\n [INDENT][COLOR=&quot;DarkRed&quot;]\"Evolution\" can help explain how life first appeared on earth:\n\n \n And it's wrong.\n \n Which you have clearly ignored at least three different times. \n \n \nThe origin of life remains very much a mystery, but scientists have learned how primitive building blocks of life (nucleic acids, amino acids etc) could have formed and organized themselves into simple life forms (self-replicating, self-sustaining bodies).\n\n \n Show me a respectable textbook that says that. Show me any respectable journal that says that. Show me any half decent university biology website that says that. \n \n All you have is some person who created their own website and typed stuff on it. \n \n \nIf any of you evos had even one honest bone in your bodies, in any other debate you would argue ad infinitum that this statement is a perfect definition of abiogenesis.\n\n \n if you had any honesty, you'd acknowledge that evolution is the change in allele frequencies over time. I've probably asked at least 15 times here how evolution deals with things that don't have alleles. I've yet to get a single answer out of anyone other then \"It doesn't, creationists are stupid.\" \n \n \nBut here we see it in a pro-evolution site titled \"The Basics of Evolution\" And the denials and obfuscations kick in full force as you discuss anything but that fact.\n\n \n By that measure, any kid with html skills and internet access can define evolution as they see fit under your logic. Similarly, that same kid can define YEC as he sees fit since your whole argument is predicated on \"the website says this, therefore it is, never mind the lack of any authority on it.\" Stupid of course, but entirely expected from you. \n \n \nIt's easier to attack Archangel's reading comprehension than admit that he is right. which would mean that it's your reading comprehension which is seriously flawed, not to mention your intellectual honesty, of course. ;)\n\n \n Except that we already refuted that argument before. You're just rehashing the same bull**** over and over again. \n \n And apparently you did go back to re-read how you were completely full of ****. And of course, no apologies for your screw ups. \n \n No accusations of me being the liar. No discussion at all about natural selection vs random mutations. \n \n All you are down to is a website saying evolution can explain the origins of life. Which has already been refuted. \n \n \n You're not right about a single thing in this thread. Hell, it took you days to figure out that we never said you believed it. ", 
   {}, 
   353669, 
   null, 
   1242267840.0
  ], 
  [
   353672, 
   null, 
   "obvious_child", 
   "Archangel, do you seriously think your last few posts in this thread will convert people to your point of view? What is your objective?\n\n \n There are days when I think people like him and Easyrider are actually atheists out to make Christanity look like a pack of bubbling, uneducated, ###### by masquerading as Christians.", 
   {}, 
   353647, 
   null, 
   1242268080.0
  ], 
  [
   353673, 
   null, 
   "Archangel", 
   "See, I told you. Excuses and obfuscations... And this statement is another blatant lie which anyone can see by clicking on the link where the statement is made. [the obvious child] All you have is some person who created their own website and typed stuff on it. emoticon_rolleyes\n Basics of Evolution - Info Barrel", 
   {}, 
   353671, 
   null, 
   1242268320.0
  ], 
  [
   353674, 
   null, 
   "Penfold", 
   "Suggesting a hypothesis is a lie in your reality?", 
   {}, 
   353673, 
   null, 
   1242268980.0
  ], 
  [
   353678, 
   null, 
   "T.Q", 
   "And yet the link I posted above, \"The Basics of Evolution\" says this very clearly:\n \"Evolution\" can help explain how life first appeared on earth:\n \n The origin of life remains very much a mystery, but scientists have learned how primitive building blocks of life (nucleic acids, amino acids etc) could have formed and organized themselves into simple life forms (self-replicating, self-sustaining bodies).\n If any of you evos had even one honest bone in your bodies, in any other debate you would argue ad infinitum that this statement is a perfect definition of abiogenesis. But here we see it in a pro-evolution site titled \"The Basics of Evolution\" And the denials and obfuscations kick in full force as you discuss anything but that fact. It's easier to attack Archangel's reading comprehension than admit that he is right. which would mean that it's your reading comprehension which is seriously flawed, not to mention your intellectual honesty, of course. ;)\n\n \n As I pointed out to you http://www.4forums.com/political/353456-post26.html. it is wrong. How the hell does you quoting a site that everyone is telling you is wrong prove your point that evolution=abiogenesis? The idiocy you display is mind-numbing. But by all means, keep telling us what we're saying instead of addressing what we're actually saying. It makes you look even stupider than usual.\n \n The gall of you talking about anyone having \"one honest bone\" is ridiculous.", 
   {}, 
   353669, 
   null, 
   1242271680.0
  ], 
  [
   353680, 
   null, 
   "obvious_child", 
   "See, I told you. Excuses and obfuscations.\n\n \n Translation: **** they proved me wrong. Come up with something fast.\n \n \nAnd this statement is another blatant lie which anyone can see by clicking on the link where the statement is made. [the obvious child] All you have is some person who created their own website and typed stuff on it. emoticon_rolleyes\n Basics of Evolution - Info Barrel\n\n \n How is that a blatant lie? Let's look at the website:\n \n Below the title header: \n \n By RAWR | Mar 7, 2009 | Views: 261 \n \n No Citations. No links other than search tags. \n \n Explain to me how it is a lie when all that is, is some guy posting an article. Fine, it's not his website. Actually, I don't know that, and neither do you. It could be his website. Besides, that part is quite irrelevant. \n \n It doesn't change the fact that your entire argument is predicated on if someone posts it to the web, it's authoritative. \n \n Notice I also wrote this (which you choose to ignore):\n \n \"By that measure, any kid with html skills and internet access can define evolution as they see fit under your logic. Similarly, that same kid can define YEC as he sees fit since your whole argument is predicated on \"the website says this, therefore it is, never mind the lack of any authority on it.\" Stupid of course, but entirely expected from you.\"\n \n The theory of evolution - Google Book Search\n \n Start reading. \n \n So, let's recount:\n \n 1) Arch totally screwed up basic reading when he accused me of lying about his acceptance of evolution despite my clear statement saying his statement is wrong\n 2) Arch totally screwed up his argument by posting a website that contradicted his statement on random mutations\n 3) Arch totally screwed up proving that evolution = abiogenesis as his entire argument is based on the belief that if someone posts it to the internet, it is authoritative! (i think I'll go make a website and say YEC = TOE and Arch will have to accept that since, someone posted it to a website!)\n \n I'm still waiting for an actual real source that says evolution = abiogenesis.\n Won't happen though. Can't expect Arch to do that given his utter failure to even define evolution. Not to mention his tirades on honesty when he refuses to admit he's wrong on anything in this thread despite screwing the pooch from his first post.", 
   {}, 
   353673, 
   null, 
   1242271980.0
  ], 
  [
   353682, 
   null, 
   "obvious_child", 
   "Suggesting a hypothesis is a lie in your reality?\n\n \n Anything that he disagrees with is a lie in his reality. Remember how he called us liars for saying his Freaky Links prop was not evidence for Creationism because it was a TV show prop?\n \n Correction. He called us liars for pointing out how the Incan stone art wasn't proof for Creationism because the villagers admitted to drawing them off of comics to sell to tourists.", 
   {}, 
   353674, 
   null, 
   1242272640.0
  ], 
  [
   353684, 
   null, 
   "Archangel", 
   "As I pointed out to you http://www.4forums.com/political/353456-post26.html. it is wrong. How the hell does you quoting a site that everyone is telling you is wrong prove your point that evolution=abiogenesis? The idiocy you display is mind-numbing. But by all means, keep telling us what we're saying instead of addressing what we're actually saying. It makes you look even stupider than usual.\n \n The gall of you talking about anyone having \"one honest bone\" is ridiculous.\n\n \n You mean because you have repeatedly said something which I reject means that it's me who's the stupid one? LOLOLOLOL All it means is that I'm not as dumb and uninformed as you are. \n \n abiogenesis, or biogenesis is a process of evolution which you amateurs compartmentalize for the sake of argument only. Spontaneous Generation: According to this theory, life originates spontaneously from lifeless matter abeogenesis for example, frogs could arise from moist soil. However, this idea had been put to rest when Louis Pasteur (1862) provided proof that micro-organisms come only from other micro-organisms. Since then, it is being widely accepted that life originates from pre-existing life- Biogenesis.\n \n Extraterrestrial or Cosmic Origin: This idea holds that life is coeternal with matter without any beginning. This notion advocates that life could have originated once or several times in various parts of the Galaxy in the Universe. The alternative name of this cosmozoan theory is panspermia. which holds that &#8217;spores&#8217; or &#8217;see s (sperm) having extraterrestrial origin might have infected the barren Earth at the time of its origin or afterwards. Likelihood of this notion is remote because the hazards known to exist in the interplanetary space are not conducive to life. These non-conducive conditions are extremely low temperatures. Lack of atmosphere, utter dryness and very high flux of cosmic and ultraviolet radiation from the sun.\n \n (tv) Terrestrial orAbiogenic Origin :This idea holds that life arose by a series of sequential chemical reactions. There is a general consensus of scientific opinions that life originated on Earth from collections of organic molecules that were produced early in the history of Earth. \n \n But all of these theoretical processes fall under the heading of The Theory of Evolution, or the Origin Of life on Earth \n \n Origin And Evolution Of Life | BioMoz.com\n \n The only people around here who are either too stupid to know their own religion or in such denial that they can't admit the truth are you and the little child. There are many suspected processes by which life originated on Earth, but they all fall under the umbrella of the science of the theory of evolution.", 
   {}, 
   353678, 
   null, 
   1242273660.0
  ], 
  [
   353685, 
   null, 
   "obvious_child", 
   "How long does it take you Archangel to find some of the most obscure websites on the planet to support your position?\n \n But to play your game, I clicked on the link to \"Theory of Evolution\"\n \n The Theory of Evolution | BioMoz.com\n \n Absolutely nothing about the origin of life. In fact the whole article is about changes to existing life. Nothing about how life came from nonlife. Your own link again self-pwns you. \n \n As for the original link, the only mention of evolution is in the title and evolution of life as a statement. No mention of abiogenesis as PART of the theory. No mention of it as part of evolution within the body of the text.\n \n Are you again trying to prove that you cannot read for comprehension?\n \n To the next article, it starts with: \"Origin of life is inseparably linked with the origin of Earth\" Huh. No mention of evolution or how Origin of Life is inseparably linked the theory of evolution. \n \n Seriously, we all know you just google search, read the titles and post them. You don't read the body nor do you check to make sure it actually supports your claim.", 
   {}, 
   353684, 
   null, 
   1242274860.0
  ], 
  [
   353686, 
   null, 
   "Archangel", 
   "Excuses, denials and obfuscations, that's all I get from you. emoticon_rolleyes", 
   {}, 
   353685, 
   null, 
   1242275280.0
  ], 
  [
   353687, 
   null, 
   "obvious_child", 
   "Excuses, denials and obfuscations, that's all I get from you. emoticon_rolleyes\n\n \n Damn reading comprehension! Why you gotta go and show that what I said the article is about ain't what the article is about? \n \n Really, it's blatantly clear you're willing to post anything in sheer laziness in the hopes it sticks. If you had bothered to read your own link and the accompanying ones, you wouldn't have posted them. \n \n And you still have yet to respond to how you think if someone posts it on the internet, it must be true argument regardless of any actual expertise or authority.\n \n I missed this in your last post:\n \n \nThere are many suspected processes by which life originated on Earth, but they all fall under the umbrella of the science of the theory of evolution\n\n \n Prove it. You won't. Because you can't. The same way you tried to prove how a tv prop was evidence of creation. How comic book art on rocks was proof of creation.", 
   {}, 
   353686, 
   null, 
   1242275700.0
  ], 
  [
   353688, 
   null, 
   "Archangel", 
   "Damn reading comprehension! Why you gotta go and show that what I said the article is about ain't what the article is about? \n \n Really, it's blatantly clear you're willing to post anything in sheer laziness in the hopes it sticks. If you had bothered to read your own link and the accompanying ones, you wouldn't have posted them. \n \n And you still have yet to respond to how you think if someone posts it on the internet, it must be true argument regardless of any actual expertise or authority.\n\n \n I've been saying that about the fairy tale links you post about evolution for years. Only now you admit that when it applies to links I post which are alo pro evolution? \n \n And riddle me this schmuck, how can the links i posted be both wrong and it's my reading comprehension which you attack? It is painfully obvious which of us is grasping at straws for any angle to attack me from as you deny the reality of the issue.", 
   {}, 
   353687, 
   null, 
   1242276120.0
  ], 
  [
   353689, 
   null, 
   "obvious_child", 
   "Evolution can be defined as the change in allele frequencies in a population\n\n \n www.faculty.virginia.edu/evolutionlabs/Humanpopgen.pdf\n \n What is an allele?\n \n \nAn allele is one member of a pair or series of different forms of a gene.\n\n \n Allele - Wikipedia, the free encyclopedia\n \n Do non-living things have alleles?\n \n For someone who proclaims evolution to be wrong and claims knowledge about it, this should be a real easy question for him to answer. \n \n If non-living things do not have alleles, does evolution discuss them? ", 
   {}, 
   353687, 
   null, 
   1242276180.0
  ], 
  [
   353691, 
   null, 
   "obvious_child", 
   "I've been saying that about the fairy tale links you post about evolution for years. Only now you admit that when it applies to links I post which are alo pro evolution?\n\n \n The difference is that the links we provide and provided are actually authoritative. Peer review, from university biology departments, National Institute of Sciences, that kind of stuff. Things that people with actual educations, with actual degrees, who actually practice the science read, review and write. You post the rantings of people who have access to the internet. \n \n Furthermore, your own links have refuted you before. \n \n \nAnd riddle me this schmuck, how can the links i posted be both wrong and it's my reading comprehension which you attack? It is painfully obvious which of us is grasping at straws for any angle to attack me from as you deny the reality of the issue.\n\n \n Easily Islamofascist (again Me not a Jew), you don't understand when someone says your statement is wrong, not you believe that statement. You don't understand the difference between natural selection and random mutations. You don't understand the difference between conventional lift and thrust. You don't understand a great many basic English words. And your links are wrong. Just because you can't read well doesn't mean your links aren't wrong. \n \n Straws are we?\n \n \n 1) Arch totally screwed up basic reading when he accused me of lying about his acceptance of evolution despite my clear statement saying his statement is wrong\n 2) Arch totally screwed up his argument by posting a website that contradicted his statement on random mutations\n 3) Arch totally screwed up proving that evolution = abiogenesis as his entire argument is based on the belief that if someone posts it to the internet, it is authoritative! (i think I'll go make a website and say YEC = TOE and Arch will have to accept that since, someone posted it to a website!)\n \n How about your entire post which consisted of accusing me of lying about RAWR owning that website? \n \n C;mon. I highlighted numerous failures you and your argument did and ALL you had to reply with was this: \" See, I told you. Excuses and obfuscations... And this statement is another blatant lie which anyone can see by clicking on the link where the statement is made. [the obvious child] All you have is some person who created their own website and typed stuff on it. Basics of Evolution - Info Barrel\"\n \n You must buy straws by the kilo every day.", 
   {}, 
   353688, 
   null, 
   1242276480.0
  ], 
  [
   353694, 
   null, 
   "T.Q", 
   "You mean because you have repeatedly said something which I reject means that it's me who's the stupid one? \n\n No, I mean exactly what I said. You are wrong. Your link is wrong. Abiogenesis has nothing to do with the ToE.\n \n \nLOLOLOLOL All it means is that I'm not as dumb and uninformed as you are. \n\n Yeah, ok...\n \n \nabiogenesis, or biogenesis is a process of evolution\n\n No, again.\n \n \nwhich you amateurs compartmentalize for the sake of argument only.\n\n Which we keep correcting you on while you tell us that we are arguing that it is a part of the ToE.\n \n \nSpontaneous Generation: According to this theory, life originates spontaneously from lifeless matter abeogenesis for example, frogs could arise from moist soil. However, this idea had been put to rest when Louis Pasteur (1862) provided proof that micro-organisms come only from other micro-organisms. Since then, it is being widely accepted that life originates from pre-existing life- Biogenesis.\n\n Are you ####ing kidding me? You're going to try and say now that we're arguing that Pasteur was wrong, and that abiogenesis states that maggots arise from rotting meat, and that mice come from sawdust? Are you insane? Of course that's not what the modern abiogenesis hypothesis is about. To pretend it is is dishonest on a scale that, well, only you could reach.\n \n \nTerrestrial orAbiogenic Origin :This idea holds that life arose by a series of sequential chemical reactions. There is a general consensus of scientific opinions that life originated on Earth from collections of organic molecules that were produced early in the history of Earth. \n\n And this would be the actual abiogenesis hypothesis.\n \n \nBut all of these theoretical processes fall under the heading of The Theory of Evolution, or the Origin Of life on Earth\n\n Then guess what, you found another site that is wrong.\n \n Origin And Evolution Of Life | BioMoz.com\n \n \nThe only people around here who are either too stupid to know their own religion or in such denial that they can't admit the truth are you and the little child. There are many suspected processes by which life originated on Earth, but they all fall under the umbrella of the science of the theory of evolution.\n\n \n What I find really funny here is that Archie rants about how any site that he disagrees with can't be trusted, simply because it's a link on the internet-very true. Yet here he's found a link that states that abiogenesis is a part of the ToE, and despite everyone telling him the site is wrong, he holds it up as gospel because it says what he wants it to say.", 
   {}, 
   353684, 
   null, 
   1242278520.0
  ], 
  [
   353741, 
   null, 
   "Archangel", 
   "But all of these theoretical processes fall under the heading of The Theory of Evolution, or the Origin Of life on Earth.\n\n \nThen guess what, you found another site that is wrong.\n\n \n So now I have posted 2 links and they are both wrong? How convenient for you. I could post 50 links which all admit that abiogenesis is a process/study which falls under the umbrella of the science of evolution and you would remain in denial, yet your only real response will be to claim it's me who is the stupid one. Thankfully for me though, the passive observer can read this entire exchange and make up their own minds regarding which of us is ignorant of the facts and in denial. emoticon_xdonno", 
   {}, 
   353694, 
   null, 
   1242316380.0
  ], 
  [
   353761, 
   null, 
   "Penfold", 
   "Rest assured it is all too apparent whose ignorance of the subject is encyclopaedic.", 
   {}, 
   353741, 
   null, 
   1242328500.0
  ], 
  [
   353773, 
   null, 
   "T.Q", 
   "So now I have posted 2 links and they are both wrong?\n\n Yes.\n \n \nHow convenient for you.\n\n It's convenient for me that there are people out there posting false information for you to find to bolster your (incorrect) argument? How is that convenient for me? \n \n \nI could post 50 links which all admit that abiogenesis is a process/study which falls under the umbrella of the science of evolution and you would remain in denial,\n\n No, I would continue to correct you.\n \n \nyet your only real response will be to claim it's me who is the stupid one.\n\n You're not stupid for posting links that are incorrect. You are stupid for accepting them as the gospel truth simply because they say what you already think!\n \n \nThankfully for me though, the passive observer can read this entire exchange and make up their own minds regarding which of us is ignorant of the facts and in denial. emoticon_xdonno\n\n \n Yes, yes they can. It always confuses me as to why you think this would end up good for you though.", 
   {}, 
   353741, 
   null, 
   1242332400.0
  ], 
  [
   353786, 
   null, 
   "obvious_child", 
   "That's not entirely true T.Q. If you look at his second link, there's nothing about how the origin of life is part of evolution. \n \n Arch is stupid for thinking that the articles say what he believes when they clearly don't. \n \n The TOE article has nothing about the origin of life, just how life changes.\n The origin of the planet does not mention evolution.\n The origin of life has it in the title. \n \n Seriously, we all know that arch either just reads the titles of Google and posts the link without actually opening it or when he quotes it doesn't read for comprehension. Remember how he said I was wrong about rejecting his statement on just random mutations and then he goes and cites his own link saying natural selection? \n \n \nSo now I have posted 2 links and they are both wrong?\n\n \n The second one isn't wrong. It just doesn't say what you say it does. I already pointed this out and you had no relevant replies (as normal). \n \n \nThankfully for me though, the passive observer can read this entire exchange and make up their own minds regarding which of us is ignorant of the facts and in denial.\n\n \n And that user, if educated, will know you're totally wrong. I see you outright ignored my post about alleles. A passive observer who actually understands evolution, unlike you, will know that Evolution is the change in allele frequencies over time. Non-life does not have alleles (viruses are in classification limbo). Therefore, how can evolution discuss things that do not have alleles when it is concerned about the change in frequencies in alleles?\n \n It can't. And the passive observer will laugh at your stunning ignorance.", 
   {}, 
   353773, 
   null, 
   1242338340.0
  ], 
  [
   353788, 
   null, 
   "obvious_child", 
   "Rest assured it is all too apparent whose ignorance of the subject is encyclopaedic.\n\n \n Agreed. \n \n I wonder who will think that the person who rejects modern geology, thinks that Tv props and comic book art is evidence of Creationism and believes that bees can't fly is less ignorant than those who actually understand evolution and modern geology. \n \n I'm never going to get a reply to this post from Arch:\n http://www.4forums.com/political/352898-post138.html\n \n I guess he thinks that 950,832,139 cubic miles of sediment magically appeared.", 
   {}, 
   353761, 
   null, 
   1242338520.0
  ], 
  [
   353797, 
   null, 
   "Archangel", 
   "You're not stupid for posting links that are incorrect. You are stupid for accepting them as the gospel truth simply because they say what you already think!\n\n \n I don't accept them as gospel truth at all since they are pro-evolution links which I don't agree with under any circumstances. What they do is outline the different studies within the science of evolution which compliment it and fall under its umbrella as a scientific theory. Here's the second link again. It's titled Origin and Evolution of Life. Within it, it describes the different theories for how life allegedly originated on Earth. \n \n It is describing these processes as subgroups of study within the science of evolution. This is undeniable to any reasonable and rational person. Which you and the child obviously are not. What is most amazing to me is that this doesn't detract from or impugn your religion of evolution at all. Many debates on evolution end up getting into origins which inevitably leads to the different processes mentioned in the quoted link I posted which is solid evidence that it's difficult to discuss evolution without considering these aspects of it course of study.\n \n For you to deny this is infantile and ignorant. I would expect it from the child, but would hope you had a deeper intellectual grasp of reality. Obviously I was hoping for too much. The fact remains that all of these theoretical processes and fields of study fall under the heading of The Theory of Evolution, for the Origin Of life on Earth.\n Origin And Evolution Of Life\n \n Life had a beginning. Since when life appeared on Earth? What is the mechanism involved in the origin of life ?Such questions are very difficult to answer because we cannot go back in time and observe life's beginning. Since its appearance, life on Earth has changed through time. Hence, the history of life actually comprises two events -first, the origin of life and, second, the mechanism involved in the changes of living organisms through time or evolution of life.\n ORIGIN OF LIFE:\n The oldest surviving terrestrial rocks, about 4.3 billion years old, contain no definite trace of life. At least not recognizable as yet. Some rocks, about 3.9 billion years old: contain carbonates. Geologists interpret that these carbonates have resulted from life processes. Therefore, life was present on Earth about 3.9 billion years ago. However. the oldest micro fossils discovered so far are that of photosynthetic cyanobacteria that appeared 3.3 to 3.5 billion years ago. Given this background, we can only speculate how life has originated and when.\n Theories on the Orlgin of Life:\n Many theories have been advanced to explain the origin of life. Most of the ideas on the origin of life fall into one of our categories.\n (i) Special Creation: This idea embodies that life on Earth is a special or divine creation of one or more superior, intelligent, and all-powerful being, the God. It also attributes the origin on Life to a supernatural or vitalistic event, at a particular time in the past. It upholds that life is immutable and has not changed ever since its. origin.\n (ii) Spontaneous Generation: According to this theory, life originates spontaneously from lifeless matter abeogenesis for example, frogs could arise from moist soil. However, this idea had been put to rest when Louis Pasteur (1862) provided proof that micro-organisms come only from other micro-organisms. Since then, it is being widely accepted that life originates from pre-existing life- Biogenesis.\n (iii) Extraterrestrial or Cosmic Origin: This idea holds that life is coeternal with matter without any beginning. This notion advocates that life could have originated once or several times in various parts of the Galaxy in the Universe. The alternative name of this cosmozoan theory is panspermia. which holds that 'spores' or 'see s (sperm) having extraterrestrial origin might have infected the barren Earth at the time of its origin or afterwards. Likelihood of this notion is remote because the hazards known to exist in the interplanetary space are not conducive to life. These non-conducive conditions are extremely low temperatures. Lack of atmosphere, utter dryness and very high flux of cosmic and ultraviolet radiation from the sun.\n (tv) Terrestrial orAbiogenic Origin:This idea holds that life arose by a series of sequential chemical reactions. There is a general consensus of scientific opinions that life originated on Earth from collections of organic molecules that were produced early in the history of Earth.\n << The Theory of Evolution/Origin Of Earth >>\n Origin And Evolution Of Life | BioMoz.com", 
   {
    "unicode_changes_made": true
   }, 
   353788, 
   null, 
   1242341880.0
  ], 
  [
   353800, 
   null, 
   "T.Q", 
   "OK, Archie, follow along with your finger if you have to. you can even mouth the words as you go along, if that will help you:\n \n Abiogenesis is completely seperate from the ToE. When I said that you accept these links as the truth because they say what you want to say, I did not mean that you believe the ToE is correct. I meant exactly what I said. You believe abiogenesis is part of the ToE. The links you scraped up say the same thing. Since you already believe this, you, rather than consider the link may be wrong, accept it as gospel.\n \n I swear, it's like trying to hold a conversation with a dim-witted two year old.\n \n One last thing-if, as you claim, evolution and the origin of life are one and the same, why does the article seperate them into two seperate, yet related subjects? Could it be because they are two seperate, yet related, subjects?", 
   {}, 
   353797, 
   null, 
   1242342060.0
  ], 
  [
   353811, 
   null, 
   "Archangel", 
   "OK, Archie, follow along with your finger if you have to. you can even mouth the words as you go along, if that will help you:\n \n Abiogenesis is completely seperate from the ToE. When I said that you accept these links as the truth because they say what you want to say, I did not mean that you believe the ToE is correct. I meant exactly what I said. You believe abiogenesis is part of the ToE. The links you scraped up say the same thing. Since you already believe this, you, rather than consider the link may be wrong, accept it as gospel.\n \n I swear, it's like trying to hold a conversation with a dim-witted two year old.\n \n One last thing-if, as you claim, evolution and the origin of life are one and the same, why does the article seperate them into two seperate, yet related subjects? Could it be because they are two seperate, yet related, subjects?\n\n \n Your sanctimony and condescension does you no good TQ, and someone with your level of intellect shouldn't be throwing stones either. At any rate, I disagree with your conclusions. Now be sure to stay in character and attempt to attack my intelligence some more. I say attempt, because you only serve to reveal your own ignorance every time you try it. emoticon_rolleyes\n \n \nI don't accept them as gospel truth at all since they are pro-evolution links which I don't agree with under any circumstances. What they do is outline the different studies within the science of evolution which compliment it and fall under its umbrella as a scientific theory. Here's the second link again. It's titled Origin and Evolution of Life. Within it, it describes the different theories for how life allegedly originated on Earth. \n \n It is describing these processes as subgroups of study within the science of evolution. This is undeniable to any reasonable and rational person. Which you and the child obviously are not. What is most amazing to me is that this doesn't detract from or impugn your religion of evolution at all. Many debates on evolution end up getting into origins which inevitably leads to the different processes mentioned in the quoted link I posted which is solid evidence that it's difficult to discuss evolution without considering these aspects of it course of study.\n \n For you to deny this is infantile and ignorant. I would expect it from the child, but would hope you had a deeper intellectual grasp of reality. Obviously I was hoping for too much. The fact remains that all of these theoretical processes and fields of study fall under the heading of The Theory of Evolution, for the Origin Of life on Earth.\n Origin And Evolution Of Life\n \n Life had a beginning. Since when life appeared on Earth? What is the mechanism involved in the origin of life ?Such questions are very difficult to answer because we cannot go back in time and observe life's beginning. Since its appearance, life on Earth has changed through time. Hence, the history of life actually comprises two events -first, the origin of life and, second, the mechanism involved in the changes of living organisms through time or evolution of life.\n ORIGIN OF LIFE:\n The oldest surviving terrestrial rocks, about 4.3 billion years old, contain no definite trace of life. At least not recognizable as yet. Some rocks, about 3.9 billion years old: contain carbonates. Geologists interpret that these carbonates have resulted from life processes. Therefore, life was present on Earth about 3.9 billion years ago. However. the oldest micro fossils discovered so far are that of photosynthetic cyanobacteria that appeared 3.3 to 3.5 billion years ago. Given this background, we can only speculate how life has originated and when.\n Theories on the Orlgin of Life:\n Many theories have been advanced to explain the origin of life. Most of the ideas on the origin of life fall into one of our categories.\n (i) Special Creation: This idea embodies that life on Earth is a special or divine creation of one or more superior, intelligent, and all-powerful being, the God. It also attributes the origin on Life to a supernatural or vitalistic event, at a particular time in the past. It upholds that life is immutable and has not changed ever since its. origin.\n (ii) Spontaneous Generation: According to this theory, life originates spontaneously from lifeless matter abeogenesis for example, frogs could arise from moist soil. However, this idea had been put to rest when Louis Pasteur (1862) provided proof that micro-organisms come only from other micro-organisms. Since then, it is being widely accepted that life originates from pre-existing life- Biogenesis.\n (iii) Extraterrestrial or Cosmic Origin: This idea holds that life is coeternal with matter without any beginning. This notion advocates that life could have originated once or several times in various parts of the Galaxy in the Universe. The alternative name of this cosmozoan theory is panspermia. which holds that 'spores' or 'see s (sperm) having extraterrestrial origin might have infected the barren Earth at the time of its origin or afterwards. Likelihood of this notion is remote because the hazards known to exist in the interplanetary space are not conducive to life. These non-conducive conditions are extremely low temperatures. Lack of atmosphere, utter dryness and very high flux of cosmic and ultraviolet radiation from the sun.\n (tv) Terrestrial orAbiogenic Origin:This idea holds that life arose by a series of sequential chemical reactions. There is a general consensus of scientific opinions that life originated on Earth from collections of organic molecules that were produced early in the history of Earth.\n << The Theory of Evolution/Origin Of Earth >>\n Origin And Evolution Of Life | BioMoz.com\n", 
   {
    "unicode_changes_made": true
   }, 
   353797, 
   null, 
   1242345720.0
  ], 
  [
   353815, 
   null, 
   "Penfold", 
   "Your sanctimony and condescension does you no good TQ, and someone with your level of intellect shouldn't be throwing stones either. At any rate, I disagree with your conclusions. Now be sure to stay in character and attempt to attack my intelligence some more. I say attempt, because you only serve to reveal your own ignorance every time you try it. emoticon_rolleyes\n\n \n \n Again, from your own link.... The title itself differentiates between the two, which should give a clue as to the content, but you linked to it anyway despite the fact that it refutes your point in the first paragraph.\n \n \" ... Life had a beginning. Since when life appeared on Earth? What is the mechanism involved in the origin of life ?Such questions are very difficult to answer because we cannot go back in time and observe life's beginning. Since its appearance, life on Earth has changed through time. Hence, the history of life actually comprises two events -first, the origin of life and, second, the mechanism involved in the changes of living organisms through time or evolution of life. .... \"", 
   {
    "unicode_changes_made": true
   }, 
   353811, 
   null, 
   1242347160.0
  ], 
  [
   353843, 
   null, 
   "obvious_child", 
   "It's futile Penfold. I already pointed out to arch why he's wrong about his new link:\n \n http://www.4forums.com/political/353685-post31.html\n \n He ignored that. \n \n It's pretty clear he doesn't understand the written word, or he's deliberately lying about what the article says and hopes we aren't going to notice he's lying.", 
   {}, 
   353815, 
   null, 
   1242362760.0
  ], 
  [
   384105, 
   null, 
   "mitnummul", 
   "I accept with information:Analysis of space dust carried out by NASA hints that quantities of these primitive building blocks might have originated in space and fallen to earth in comets. This scenario may solve the problem of how life arose when our planet was young.\n Computer modelling of evolution has shown that natural selection can push evolution in one direction and produce sophisticated structures in surprisingly short times (tens of thousands of years).emoticon_xkill", 
   {}, 
   353647, 
   null, 
   1262203500.0
  ], 
  [
   400995, 
   null, 
   "Freedom", 
   "Can someone point out to me where \"the change in allele frequencies\" say anything about how life first came to be? \n \n\n Can someone point out to me where \"The change in allele frequencies\" advances life from a single celled organism to arguing with each other on online forums?\n \n You know that evolution is considered to be more than just that by the public and by scientists.\n \n Abiogensis has everything to do with the problem in evolutionary theory, it is the only example of IC for which no sane story can be told.", 
   {}, 
   353433, 
   null, 
   1273467180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Evolution - Not Abiogenesis and not just random mutations", 
  "url": "http://www.4forums.com/political/debate-challenges/12701-evolution-not-abiogenesis-not-just-random-mutations.html", 
  "breadcrumbs": [
   "Debate Challenges"
  ], 
  "id_number": 12701, 
  "discussion_files": [
   [
    "13484.html", 
    "http://www.4forums.com/political/debate-challenges/12701-evolution-not-abiogenesis-not-just-random-mutations-print.html"
   ], 
   [
    "13485.html", 
    "http://www.4forums.com/political/debate-challenges/12701-evolution-not-abiogenesis-not-just-random-mutations-4-print.html"
   ], 
   [
    "13486.html", 
    "http://www.4forums.com/political/debate-challenges/12701-evolution-not-abiogenesis-not-just-random-mutations-3-print.html"
   ], 
   [
    "13487.html", 
    "http://www.4forums.com/political/debate-challenges/12701-evolution-not-abiogenesis-not-just-random-mutations-2-print.html"
   ]
  ], 
  "identifier": 12701
 }
]