[
 [
  [
   353720, 
   null, 
   "OldSarge", 
   "\"You still haven't shown that registration led to confiscation, it simply preceeded it in this one instance. You'd have to show intent to confiscate pior to requiring registration to prove your point. Handguns have been registered for years in CA with no move to confiscate. And wasn't everyone compensated for turning in the weapons in question?\"\n \n You will note the slide as illustrated above. One slides out from under what is being debated over to a different position altogether. All along we have been stating that confiscation follows registration. No one argues that registration leads to confiscation or is a cause of it. Numerous examples exist throught modern history, Turkey, Russia, Germany, United Kingdom, etc. Yet we have one that maintains it has never happened in a country with a constitutional protection. Yet we have the state of California with its Roberti-Roos law that forced firearm owners to register certain firearms. Then in an about face declared them no longer legal and confiscated them. It happened here in spite of constitutional protection. Now the slide comes in. Well it was one particular firearm so it really doesn't count some how. Plus \"wasn't everyone compensated\" like that some how negates the confiscation. Or the best part handguns have been registered for years. Now that is supposed to negate the fact that yes firearms were registered then confiscated. One can certainly understand the dismay of having the plank you have been standing on suddenly cut off making your position totally untenable. \n \n ", 
   {
    "post_info": {
     "post_title": "The leftist slide"
    }
   }, 
   null, 
   null, 
   1242298920.0
  ], 
  [
   353730, 
   null, 
   "Tither", 
   "Ah. The lies, deceit, and the panacea of gun registration! \n \n Gun registration hasn't been proven to Quote \"LEAD\" Gun Confiscation. \n \n That is a silly argument. A deceitful and dishonest one to boot. Why, because someone who says that has an agenda. \n \n They want to change our laws. They want to change what a Constitutionally protected right, what is protected in the Bill of Rights, actually means. Rights that our Founding Fathers called Inalienable, and chose to protect away from the preview of Government. Not to mention from the very people who want all of this Radical Gun control in the first place!\n \n Now lets look at what they have not proven. They have not even attempted to prove that it won't lead to confiscation, because the one making that statement has already said, Oh, that is just one or two instances where Registration has lead to Confiscation. You have plenty of guns! That's OK!\n \n So we already know that the Confiscation of, what they want to call the \"Dangerous\" guns is OK with them! In fact, one could infer from that exceptional statement is that this may also be what they have in mind in the first place. Or maybe it is just that these Confiscation is somehow different, and should not be counted as confiscation. Huh? \n \n So who gets to make this Unconstitutional Judgment? They do, that is who! So, is this the plan all along. We already know that it has been OK'ed by them! Do they plan to take our guns, one class of gun at a time? \n \n Two, they have not proven or even attempted to show that this Radical Constitutional step, this Radical Gun control law they want, will actually do what they claim. But they want to do it anyway, Just In Case it Might work! \n \n Three, they have not shown that we actually need to do all of this Radical changing of what a Constitutional Right means, either! They just have theories on what they HOPE it will do. \n \n Mr. and Ms. America! Is THAT the way our Constitution should be treated?", 
   {
    "unicode_changes_made": true
   }, 
   353720, 
   null, 
   1242312660.0
  ], 
  [
   353732, 
   null, 
   "Tither", 
   "We have previously proven beyond a shadow of a doubt that many people dearly WANT to confiscate all guns, but one thing we do know for sure. If you were planning to confiscate guns, you first have to know beyond a shadow of a doubt where they are, and who has them!\n   Gun Registration and Gun Control \n Why Gun Rights Advocates Oppose Gun Registration \n \n A centralized registration system is the one usually proposed by gun control activists, and it is the type most feared by gun rights advocates. At the heart of resistance to registration is the belief that it encourages firearm prohibitions and ultimately leads to confiscation. (It is also why many choose not to comply and register weapons already owned.) \n \n .. Many gun rights advocates \"believe that a nucleus of anti-gun activists will agitate for restrictions and bans on the 'most dangerous' type of firearm in common use. When that gun is banned they will move on to the next model which will in turn become the 'most dangerous' type. Firearms owners fears are supported by what has happened recently in the UK, Australia, and Canada, and has previously happened in NZ [New Zealand].\" (The Registration of Firearms: A Compendium of Available Fact From Australia, Canada, and New Zealand, 1998)\n \n The New York City Council banned firearms that had been classified by the city as \"assault weapons.\" This was done despite the testimony of Police Commissioner Lee Brown that no registered \"assault weapon\" had been used in a violent crime in the city. The 2,340 New Yorkers who had registered their firearms were notified that these firearms had to be surrendered, rendered inoperable, or taken out of the city.\n \n More recently, California revoked a grace period for the registration of certain rifles (SKS Sporters) and declared that any such weapons registered during that period were illegal. In addition, California has prohibited certain semi-automatic long-rifles and pistols. Those guns currently owned, must be registered, and upon the death of the owner, either surrendered or moved out of state\nThere you see it for yourselves! It is not just us here on this board. That is what we believe you WILL do if you are allowed.", 
   {}, 
   353730, 
   null, 
   1242313440.0
  ], 
  [
   353734, 
   null, 
   "Tither", 
   "Sinjin do not read any offense because of blanket statements made by me because you are NOT the only one what wants it. There a multitude of people who mean exactly what I indicated.", 
   {}, 
   353732, 
   null, 
   1242314880.0
  ], 
  [
   353743, 
   null, 
   "NATO 556", 
   "We have the word of gun control advocates themselves dictating the game plan.\n \n Step 1: Reduce the number of guns coming into circulation.\n Step 2: Mandate all guns being registered.\n Step 3: Confiscate all registered firearms.\n \n We know better, we've heard from the mouths of the enemy what they want, and nothing you can say is ever going to change that fact. The enemy had laid out the game plan, detailing what they're going to do if they get the chance, so don't try and tell us different.", 
   {}, 
   353720, 
   null, 
   1242319080.0
  ], 
  [
   353752, 
   null, 
   "sinjin", 
   "We have previously proven beyond a shadow of a doubt that many people dearly WANT to confiscate all guns, but one thing we do know for sure. If you were planning to confiscate guns, you first have to know beyond a shadow of a doubt where they are, and who has them!\n \nAll this is true and I am well aware of that. What is also true is that if we are to have any hope of identifying illegal transfers of firearms, we would likewise have to know who has them, where they are and also, do they still have them. How this could be accomplished without registration, I can't imagine. Do any of you have anything to offer as an alternative or do you simply expect the citizens of the US to accept that large numbers of legally purchased weapons are going to end up in criminals hands and that arming oneself is the only practical solution? That nothing can be done to prevent or identify/punish someone who purchases a firearm with the intent to turn it over, or sell it, to someone that cannot legally purchase a firearm?", 
   {}, 
   353732, 
   null, 
   1242326580.0
  ], 
  [
   353754, 
   null, 
   "sinjin", 
   "Sinjin do not read any offense because of blanket statements made by me because you are NOT the only one what wants it. There a multitude of people who mean exactly what I indicated.\nNo offense taken but what I want is not what the most extreme guntrollers want.\n \n I accept the notion that I am a pawn being used by the more extreme to further their agenda. \n Do you accept the same thing about yourself?", 
   {}, 
   353734, 
   null, 
   1242326820.0
  ], 
  [
   353760, 
   null, 
   "NATO 556", 
   "All this is true and I am well aware of that. What is also true is that if we are to have any hope of identifying illegal transfers of firearms, we would likewise have to know who has them, where they are and also, do they still have them. How this could be accomplished without registration, I can't imagine.\n\n \n We've already been over this, many times before. There's already a system of registration in place, it's background check Form 4473. It lists all the information on who bought the gun(s) and what was bought. The law specifically says that the seller has to maintain all of these forms for the duration of their business license, and once the business closes they have to forward all the paperwork to the ATF.\n \n And then there's the firearms trace data that's protected by the Tiahrt Amendment. All of these show who bought what, where they bought it, when they bought it, and where they live, and not a single person has to go down to the police station to do a thing to be in the system.\n \n And before anybody tries to argue that the NRA forced the ATF to destroy all records after so many days, don't try that argument; if it was truly done that way then there would be no trace data for the Tiahrt Amendment to cover.\n \n And then there's Form 3310.4, the form covering multiple handgun sales to an individual. Federal law specifies that this form has to be filled out anytime one person buys more than two handguns in a one week calender period. This form also has to be forwarded immediately to the ATF, who monitors that person's name to see how large their future purchases are. These people are watched as potential gun traffickers.\n \n \nDo any of you have anything to offer as an alternative or do you simply expect the citizens of the US to accept that large numbers of legally purchased weapons are going to end up in criminals hands and that arming oneself is the only practical solution?\n\n \n I don't see how we're impotent to prevent such an outcome from happening with what we already have in place. If we'd stop the soft shoe approach and start crucifying genuine arms traffickers and stop trying to shield them with rationing schemes, that undercut the resources of the ATF, and stop offering them get out of jail free cards then maybe we could get somewhere.\n \n \nThat nothing can be done to prevent or identify/punish someone who purchases a firearm with the intent to turn it over, or sell it, to someone that cannot legally purchase a firearm?\n\n \n We already have such a system in place. The problem is that it's simply not being used. And arguing for the passage of more laws is unlikely to change matters since they won't be used either.", 
   {}, 
   353752, 
   null, 
   1242328440.0
  ], 
  [
   353765, 
   null, 
   "sinjin", 
   "So when we trace a recovered firearm back to the original owner, what stick does law enforcement have. Cannot the original owner simply claim it was lost some time ago? No requirement to file a theft/loss report. And for those that purchase with intent to transfer the weapon to a felon, when and how could we know that this illegal transfer has taken place?", 
   {}, 
   353760, 
   null, 
   1242329220.0
  ], 
  [
   353766, 
   null, 
   "Tither", 
   "Here is what I think. If this is actually something the nation desires to do, then the BATF is the ones capable of dealing with it. But that is going to cost more money. Maybe a lot. That is the choice. More money. \n \n I actually thought that Clinton's 100,000 new cops on the beat was a brilliant crime fighting plan. And it worked! However, as we have seen, cities all over this nation have had to lay off most, if not all, of these new crime fighters once the Federal money ran dry. That was a shame, because we could directly see the result of these layoffs in the next years crime figures. \n \n A couple of facts we need to come to grips with. Crime will never be zero, and as long as drugs are able to enter into this country, that means so will everything else that someone wants to import. That is the unfortunate fact. \n \n I look at the Australian model and see this. Besides many classes of guns being banned, they also have safe storage requirements, and absolute gun registration since 1996 - 97. And yet we read this March 1, 2009 article. \n   Gun amnesty under way \n The amnesty is the third conducted in NSW in the past 10 years, with 63,000 handguns being handed into police during the 2001 and 2003 operations.\n \n \"We have taken 63,000 illegal firearms off the streets so far but there are still more to go and we are always doing what we can to protect the community.\"\n\n \n When the 3rd amnesty was announced, Philip Alpers is an Anti-gun researcher in Australia and he recognizes this. \n   NSW gun amnesty won't work, says expert \n But the proposed amnesty would not significantly impact on the number of illegal guns in NSW, said Philip Alpers, an adjunct associate professor at the University of Sydney's School of Public Health.\n \n \"It's one of the easiest solutions for a politician, to call an amnesty,\" Mr Alpers told AAP.\n \n \"Nobody pretends, even the police don't pretend, that they're bringing in the guns they want.\n \n \"The guns that they really want are the ones held by criminals, and if you're a criminal an illegal gun is the most valuable thing you can have.\"\n \n NSW Opposition Leader Barry O'Farrell said the scheme would not work and was just an act of spin. \"Criminals just don't participate in buyback schemes,\" he told reporters in Sydney. \"This proposal will do nothing to stop drive-by shootings across Sydney and it's a further demonstration of a government engaged in spin.\"\n\n \n Even though it is a crime punishable be a 15 year sentence, the Australian people did not wish to tell the Government everything they wanted to know, and they did not turn in every gun. Or perhaps they also purchased imported guns from the criminals. So now who are the criminals likely to be caught? The average citizen who figures that they government does not have the Right. \n   South Australians surrender more than 1100 guns during amnesty \n \"What we wanted to do was to flush out those illegal weapons that are out in the community,\" he said. \"That means there is now no longer any excuses and those retaining illegal weapons better watch out because we now have by far the toughest illegal fire arms laws in the country. \"If people have a fire arms prohibition notice slapped on them, they can be searched anywhere and face up to a 15 year maximum jail sentence.\"\n\n \n Many Australians complain about what the Half a Billion Australian dollars had produced. Many think a better crime fighting solution could have been reached if the 1/2 Bullion dollars were used in actual crime fighting, like we chose here in the U.S..\n \n All of this is why I think it better to turn lose the BATF, or other members of the FBI if we really want to deal with these problems. Everything else is likely to produce the exact same results as Australia and or Canada as two recent examples of gun registry failures. For how can our experience with a gun registry be any different?\n \n   New South Wales Government NSW Police Force Media release \n Among the collection comprised:\n \n \u0095 A 5.56mm Colt AR15/M16 Armalite military assault rifle (converted to fully automatic)\n \u0095 A 7.62mm Springfield M14 military assault rifle (converted to fully automatic)\n \u0095 A 12 gauge Franchi SPAS 12 automatic combat shotgun\n \u0095 A 12 gauge Korean-made military automatic shotgun\n \u0095 A .357 Smith &amp; Wesson Magnum revolver\n \u0095 A .38 Smith &amp; Wesson snub nose revolver\n Earlier this month, the same team of detectives from the Firearms Squad's Strike Force Clough arrested and charged two men after covertly buying or seizing a large cache of prohibited weapons including a Kalashnikov AK-47, a Colt AR15/M16 and a .50 calibre heavy sniper/anti-materiel rifle.\n \n \"We appeal to those in possession of unlicensed or illegal firearms to surrender them before the amnesty expires,\" Detective Superintendent Katsogiannis said, \"Otherwise, if you are caught, you will be charged and face jail.\n \n \"Strike Force Clough has been an outstanding success so far with 25 unlicensed guns confiscated by detectives,\" he added.\n \n \"The military-grade firearms, particularly the fully automatic rapid-fire weapons, were designed for warfare and have no place in our society.\"\n\n REAL Machine guns, Not what the Antis call assault weapons.", 
   {
    "unicode_changes_made": true
   }, 
   353752, 
   null, 
   1242329580.0
  ], 
  [
   353767, 
   null, 
   "Tither", 
   "Do you accept the same thing about yourself?\n\n Absolutely! When making laws, neither what you or I want is of any consequences what so ever! emoticon_smile", 
   {}, 
   353754, 
   null, 
   1242329760.0
  ], 
  [
   353781, 
   null, 
   "NATO 556", 
   "So when we trace a recovered firearm back to the original owner, what stick does law enforcement have. Cannot the original owner simply claim it was lost some time ago? No requirement to file a theft/loss report. And for those that purchase with intent to transfer the weapon to a felon, when and how could we know that this illegal transfer has taken place?\n\n \n I feel the irresistible need to ask:\n \n What exactly is preventing a gun trafficker from reporting the cache stolen right after they sell it, so not only do they get their butt off the hook, they also have the police report of the loss so they can get the insurance money and reimburse themselves?\n \n Think about it for a minute. Gun traffickers are likely to be professional businessmen. It's not unthinkable that they would consider these possibilities and have a long term game plan developed. They could buy up a lot of guns, sell them under the table, and then report that they were taking their collection to the range and were robbed on the way there.\n \n You yourself have continually talked about how every year 200,000 guns are reported stolen in the US. What better way to avoid being incriminated than by making yourself into a victim of one of these robberies, when in actuality you're the guilty party?", 
   {}, 
   353765, 
   null, 
   1242335340.0
  ], 
  [
   353784, 
   null, 
   "sinjin", 
   "I feel the irresistible need to ask:\n \n What exactly is preventing a gun trafficker from reporting the cache stolen right after they sell it, so not only do they get their butt off the hook, they also have the police report of the loss so they can get the insurance money and reimburse themselves?\n \n Think about it for a minute. Gun traffickers are likely to be professional businessmen. It's not unthinkable that they would consider these possibilities and have a long term game plan developed. They could buy up a lot of guns, sell them under the table, and then report that they were taking their collection to the range and were robbed on the way there.\n \n You yourself have continually talked about how every year 200,000 guns are reported stolen in the US. What better way to avoid being incriminated than by making yourself into a victim of one of these robberies, when in actuality you're the guilty party?\nI would think that might work once or twice but they'd be watching you after that. Doesn't sound workable in the long run.", 
   {}, 
   353781, 
   null, 
   1242337740.0
  ], 
  [
   353790, 
   null, 
   "NATO 556", 
   "I would think that might work once or twice but they'd be watching you after that. Doesn't sound workable in the long run.\n\n \n There's nothing in the law that suggests this is a possibility. The lost or stolen laws don't set any number of limitations, but it spells out protection for those who report the loss in a timely manner. To me that suggests that the bill contains immunity for professional gun traffickers who know how to work the system.", 
   {}, 
   353784, 
   null, 
   1242339420.0
  ], 
  [
   353792, 
   null, 
   "sinjin", 
   "There's nothing in the law that suggests this is a possibility. The lost or stolen laws don't set any number of limitations, but it spells out protection for those who report the loss in a timely manner. To me that suggests that the bill contains immunity for professional gun traffickers who know how to work the system.\nThose laws could be refined.", 
   {}, 
   353790, 
   null, 
   1242339600.0
  ], 
  [
   353793, 
   null, 
   "NATO 556", 
   "Those laws could be refined.\n\n \n Why should they need to be refined? Why can't the legislative body simply craft and try to pass an already refined bill that doesn't need to be adjusted after it's already passed?\n \n Is it simply too hard to try and draft a piece of proposed legislation that spells out clear penalties for people who intentionally transfer weapons to prohibited individuals, while at the same time having specific protections for people who were the victim of a violent crime?", 
   {}, 
   353792, 
   null, 
   1242339960.0
  ], 
  [
   353803, 
   null, 
   "OldSarge", 
   "All this is true and I am well aware of that. What is also true is that if we are to have any hope of identifying illegal transfers of firearms, we would likewise have to know who has them, where they are and also, do they still have them. How this could be accomplished without registration, I can't imagine. Do any of you have anything to offer as an alternative or do you simply expect the citizens of the US to accept that large numbers of legally purchased weapons are going to end up in criminals hands and that arming oneself is the only practical solution? That nothing can be done to prevent or identify/punish someone who purchases a firearm with the intent to turn it over, or sell it, to someone that cannot legally purchase a firearm?\n\n \n Some of them are caught on the NCIS check. We could start by prosecuting them to the fullest. We could also start applying Project Exile across the country. We could also make stiffer penalties with no plea bargins for gun crimes. If a felon with a firearm is on an express ride to prison for a very long time it might not deterr others. But the caught one will not be repeating his or her error any time soon. There are already penalties for straw purchasers. They need better enforcement. \n \n Perhaps you could show how registration would work to do any thing towards illegal firearms transactions? It has yet to be shown by anyone that any crimes are prevented by registration. If so it would be trumpeted from the roof tops. Given the very real danger of confiscation I for one would simply refuse to register any firearms. \n \n Given the real boondoggle of our neighbors to the north, can we afford to duplicate it? Not to mention there is no demonstrated return for registration. No thanks, I'll pass on the registration thank you. As Nato and others have said, stop the kid glove treatment for criminals. As it stands now your attacker is out of jail before you clear the emergency if you are lucky enough to survive.", 
   {}, 
   353752, 
   null, 
   1242342840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The leftist slide", 
  "url": "http://www.4forums.com/political/gun-control-debates/12713-leftist-slide.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12713, 
  "discussion_files": [
   [
    "18241.html", 
    "http://www.4forums.com/political/gun-control-debates/12713-leftist-slide-print.html"
   ], 
   [
    "18242.html", 
    "http://www.4forums.com/political/gun-control-debates/12713-leftist-slide-2-print.html"
   ]
  ], 
  "identifier": 12713
 }
]