[
 [
  [
   354331, 
   null, 
   "OldSarge", 
   "1. Banning guns works, which is why New York, DC, & Chicago cops need guns. \n \n 2. Washington DC's low murder rate of 69 per 100,000 is due to strict gun control, and Indianapolis' high murder rate of 9 per 100,000 is due to the lack of gun control. \n \n 3. Statistics showing high murder rates justify gun control but statistics showing increasing murder rates after gun control are \"just statistics.\" \n \n 4. The Brady Bill and the Assault Weapons Ban, both of which went into effect in 1994 are responsible for the decrease in violent crime rates, which have been declining since 1991. \n \n 5. We must get rid of guns because a deranged lunatic may go on a shooting spree at any time and anyone who would own a gun out of fear of such a lunatic is paranoid. \n \n 6. The more helpless you are the safer you are from criminals. \n \n 7. An intruder will be incapacitated by tear gas or oven spray, but if shot with a .357 Magnum will get angry and kill you. \n \n 8. A woman raped and strangled is morally superior to a woman with a smoking gun and a dead rapist at her feet. \n \n 9. When confronted by violent criminals, you should \"put up no defense -- give them what they want, or run\" (Handgun Control Inc. Chairman Pete Shields, Guns Don't Die - People Do, 1981, p.125). \n \n 10. The New England Journal of Medicine is filled with expert advice about guns; just like Guns & Ammo has some excellent treatises on heart surgery. \n \n 11. One should consult an automotive engineer for safer seatbelts, a civil engineer for a better bridge, a surgeon for internal medicine, a computer programmer for hard drive problems, and Sarah Brady for firearms expertise. \n \n 12. The 2nd Amendment, ratified in 1787, refers to the National Guard, which was created 130 years later, in 1917. \n \n 13. The National Guard, federally funded, with bases on federal land, using federally-owned weapons, vehicles, buildings and uniforms, punishing trespassers under federal law, is a \"state\" militia. \n \n 14. These phrases: \"right of the people peaceably to assemble,\" \"right of the people to be secure in their homes,\" \"enumeration's herein of certain rights shall not be construed to disparage others retained by the people,\" and \"The powers not delegated herein are reserved to the states respectively, and to the people\" all refer to individuals, but \"the right of the people to keep and bear arm\" refers to the state. \n \n 15. \"The Constitution is strong and will never change.\" But we should ban and seize all guns thereby violating the 2nd, 4th, and 5th Amendments to that Constitution. \n \n 16. Rifles and handguns aren't necessary to national defense! Of course, the army has hundreds of thousands of them. \n \n 17. Private citizens shouldn't have handguns, because they aren't \"military weapons\", but private citizens shouldn't have \"assault rifles\", because they are military weapons. \n \n 18. In spite of waiting periods, background checks, finger printing, government forms, etc., guns today are too readily available, which is responsible for recent school shootings. In the 1940's, 1950's and 1960's, anyone could buy guns at hardware stores, army surplus stores, gas stations, variety stores, Sears mail order, no waiting, no background check, no fingerprints, no government forms and there were no school shootings. \n \n 19. The NRA's attempt to run a \"don't touch\" campaign about kids handling guns is propaganda, but the anti-gun lobby's attempt to run a \"don't touch\" campaign is responsible social activity. \n \n 20. Guns are so complex that special training is necessary to use them properly, and so simple to use that they make murder easy. \n \n 21. A handgun, with up to 4 controls, is far too complex for the typical adult to learn to use, as opposed to an automobile that only has 20. \n \n 22. Women are just as intelligent and capable as men but a woman with a gun is \"an accident waiting to happen\" and gun makers' advertisements aimed at women are \"preying on their fears.\" \n \n 23. Ordinary people in the presence of guns turn into slaughtering butchers but revert to normal when the weapon is removed. \n \n 24. Guns cause violence, which is why there are so many mass killings at gun shows. \n \n 25. A majority of the population supports gun control, just like a majority of the population supported owning slaves. \n \n 26. Any self-loading small arm can legitimately be considered to be a \"weapon of mass destruction\" or an \"assault weapon.\" \n \n 27. Most people can't be trusted, so we should have laws against guns, which most people will abide by because they can be trusted. \n \n 28. The right of Internet pornographers to exist cannot be questioned because it is constitutionally protected by the Bill of Rights, but the use of handguns for self defense is not really protected by the Bill of Rights. \n \n 29. Free speech entitles one to own newspapers, transmitters, computers, and typewriters, but self-defense only justifies bare hands. \n \n 30. The ACLU is good because it uncompromisingly defends certain parts of the Constitution, and the NRA is bad, because it defends other parts of the Constitution. \n \n 31. Charlton Heston, a movie actor as president of the NRA is a cheap lunatic who should be ignored, but Michael Douglas, a movie actor as a representative of Handgun Control, Inc. is an ambassador for peace who is entitled to an audience at the UN arms control summit. \n \n 32. Police operate with backup within groups, which is why they need larger capacity pistol magazines than do \"civilians\" who must face criminals alone and therefore need less ammunition. \n \n 33. We should ban \"Saturday Night Specials\" and other inexpensive guns because it's not fair that poor people have access to guns too. \n \n 34. Police officers have some special Jedi-like mastery over hand guns that private citizens can never hope to obtain. \n \n 35. Private citizens don't need a gun for self-protection because the police are there to protect them even though the Supreme Court says the police are not responsible for their protection. \n \n 36. Citizens don't need to carry a gun for personal protection but police chiefs, who are desk-bound administrators who work in a building filled with cops, need a gun. \n \n 37. \"Assault weapons\" have no purpose other than to kill large numbers of people. The police need assault weapons. You do not. \n \n 38. When Microsoft pressures its distributors to give Microsoft preferential promotion, that's bad; but when the Federal government pressures cities to buy guns only from Smith & Wesson, that's good. \n \n 39. Trigger locks do not interfere with the ability to use a gun for defensive purposes, which is why you see police officers with one on their duty weapon. \n \n 40. Handgun Control, Inc. says they want to \"keep guns out of the wrong hands.\" Guess what? You have the wrong hands. \n \n Ooops more than 25 ha ha", 
   {
    "post_info": {
     "post_title": "25 Reasons Gun Control Does Work"
    }
   }, 
   null, 
   null, 
   1242777960.0
  ], 
  [
   354377, 
   null, 
   "Tither", 
   "  Support Plummets for Restrictions on Gun Rights \n Though some anti-gun rights extremists pretend that gun owners represent a tiny minority, the fact is that there are more than 90 million firearms owners in this country, and lawful gun ownership is the mainstream in America today.\n \n Four different polls recently point to declining support for gun restrictions as the answer to crime. In October, a Gallup poll found that fewer Americans than ever favor handgun bans, based on Gallup's 49 year history of polling on the issue. Support fell from a high of 60% in 1959 to a low of less than 30% in 2008. The same trend repeats itself in a question on whether more restrictions are needed on the sales of all firearms, not just handguns.\n \n In addition,   three different media polls  taken in April reflect plummeting support for gun control. .... All of these polls show what peaceable gun owners already know - that support for the Second Amendment is the dominant belief in America today, and the fallacy that restricting the rights of honest citizens will impact crime has been exposed for what it is.\n \n Those who pretend that gun owners are a tiny minority are the same ones who decry the so-called \"gun lobby\" as all powerful. If gun owners are really such a tiny minority, then how could the organizations that represent them be so powerful? \n \n In truth, there really is no \"gun lobby.\" But there are many millions of individuals who believe deeply in the Second Amendment who have organized themselves into groups like NRA to speak with one resounding voice. The late Charlton Heston said it best: \"the NRA is a fellowship of millions dedicated to the singular proposition of defending freedom from its adversaries.\" I'm proud to be one of them.\n\n Hear, hear! Me too!", 
   {
    "unicode_changes_made": true
   }, 
   354331, 
   null, 
   1242822840.0
  ], 
  [
   354379, 
   null, 
   "Doc Jones", 
   "Crime control, not gun control, is needed - Berkshire Eagle Online\n \n \nIf the intent of the Gun Control Act of 1998 was to discourage the sport of hunting and competitive target shooting and to disarm Massachusetts citizens, it must be considered a howling success. In 10 years since its passage, the number of licensed gun owners has decreased from 1,500,000 to 220,000, an 85 percent drop, according to figures provided by the by the House Post Audit and Oversight Committee. Well done!\n \n If the intent was to reduce crime, then that law must be considered a miserable failure. Based on incidents per 100,000, gun-related homicides are up 68 percent, assault related gun injuries up 72 percent, assault related hospital discharges up 160 percent, gun assault Emergency Dept visits up 222 percent and gun assault outpatient observations up 538 percent. Keep in mind that these increases occurred when there were 1,280,000 fewer licensed gun owners in the state.\n \n In addition to not curbing gun crime, the legal gun owners have had to bear the brunt of additional costs and inconvenience, not to mention the constant character assignation that licensed gun owners receive. There appears to be a misconception that has been instilled into the public that everyone who owns a gun is suspect and is one to be feared.\n", 
   {
    "post_info": {
     "post_title": "Another experiment goes horribly wrong!"
    }
   }, 
   354377, 
   null, 
   1242823440.0
  ], 
  [
   354384, 
   null, 
   "Tither", 
   "Dan Bidstrup calls his article The new Prohibition. I would have named it the Criminalizing of Americans, for what they can clearly read in the Constitution is their Unalienable Right! \n \n   The new Prohibition \n ... step one: make it an earned privilege to own a gun. Step two is to raise the bar so high that practically nobody is clean enough or trained enough or sane enough to actually own one. After the basic permit is in place and all guns registered, each time someone forgets to renew or the government agency adds a requirement like \"successful completion of the FBI Academy firearms training protocol paid for by the permit holder\" that many could not afford, the permit is yanked and the guns taken away. \n \n ... I fear that passing a law to fix the \"gun show loophole\" like the Lautenberg bill in the Senate or the Rush bill in the house will create a large, new class of criminals. .... I see the huge jump not only in ammunition sales but also the number of guns being bought by first time buyers as a vote against further gun control, and a belief that congress will try to do it. \n \n Where do you come down on the issue? ..... Or do you say \"The duly elected representatives of the majority of Americans have overstepped the intentions of the founders of America and I will not obey an unconstitutional law\" knowing that at that point, the Supreme Court has not ruled on the law, and you are not on the Supreme Court. I suspect that millions of Americans will appeal to natural law, which predates the US Constitution. Our rights come from God first, and include liberty and the right to self defense. The US constitution is an attempt to codify and protect the natural rights of man. I predict that millions of law-abiding citizens will quietly decide not to follow this law if it is passed, and will join the felons and uncaught criminals who already don't obey the existing laws. This will erode respect for law overall among the most staunch supporters of the rule of law as provided by the US Constitution. If the government over-reaches with national permitting of gun-owners, (not just concealed carry which is bad enough) we will see disobedience like what occurred during Prohibition. \n \n We currently have roughly 120 million gun owners in America. How many would reject a law requiring them to volunteer to be vetted merely to own a gun, and submit to yearly inventory of their collection by the local police to assure the government that they hadn't added or sold any in the last 12 months? Criminalizing a big chunk of your most law-abiding citizens is a sure recipe for societal disaster.\n", 
   {
    "unicode_changes_made": true
   }, 
   354379, 
   null, 
   1242825180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  25 Reasons Gun Control Does Work", 
  "url": "http://www.4forums.com/political/gun-control-debates/12741-25-reasons-gun-control-does-work.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12741, 
  "discussion_files": [
   [
    "23938.html", 
    "http://www.4forums.com/political/gun-control-debates/12741-25-reasons-gun-control-does-work-print.html"
   ]
  ], 
  "identifier": 12741
 }
]