[
 [
  [
   354772, 
   null, 
   "Cyberateos", 
   "I believe that all ISMS are 5% useful and 95% stupid theories to beneit mainly to a few evil persons.\n \n In the web, it is easy right now to find sites dedicated to reveal the lies of theocracy and of a matriarcal society. Here are some sites against feminazism:\n \n \n \n antimisandry.com\n \n The Ghost Nation ... topic=9116\n \n \n ::: La Marcha Masculina :::\n \n Mandefender : Forum", 
   {
    "post_info": {
     "post_title": "Is feminISM a brainwashing similar to ChristianISM?"
    }
   }, 
   null, 
   null, 
   1243104240.0
  ], 
  [
   354775, 
   null, 
   "CUNxTime", 
   "I think just about ALL dogma is ridiculous. Anyone who is fanatical about ANYTHING is usually wrong to some degree. There is a balance to everything and if you are overly partisan toward any group, there's a good chance your wrong about a lot of things. Militant feminism isn't any more ideal than militant Christianity or the Islamists.\n \n That said...for millennia, woman have been the N-words of the world. Just as it took groups such as the NAACP to help blacks get their rights, so too it takes pro-female groups to ensure their equality...and as a conservative I believe that equal OPPORTUNITY is the basis of an ideal society. So I've got to come down like this any group that is pro-woman is good...but if it becomes a group that is ANTI-male it has degraded its own position.", 
   {}, 
   354772, 
   null, 
   1243105980.0
  ], 
  [
   354782, 
   null, 
   "simone", 
   "Cybererratus, where is your favorite website, Help! I'm scared to death of women!?", 
   {}, 
   354775, 
   null, 
   1243111740.0
  ], 
  [
   354792, 
   null, 
   "Cyberateos", 
   "Simone:\n \n Feminazis, Christians and other fanatics should be controlled.", 
   {}, 
   354782, 
   null, 
   1243119000.0
  ], 
  [
   354794, 
   null, 
   "CUNxTime", 
   "Simone:\n \n Feminazis, Christians and other fanatics should be controlled.\n\n \n NO ONE should be 'controlled' in their ideas or speach...only in actions against others is there a problem.\n \n But I think you are just trying to get her goat with comments like this...", 
   {}, 
   354792, 
   null, 
   1243126500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is feminISM a brainwashing similar to ChristianISM?", 
  "url": "http://www.4forums.com/political/civil-rights-debates/12774-feminism-brainwashing-similar-christianism.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 12774, 
  "discussion_files": [
   [
    "27111.html", 
    "http://www.4forums.com/political/civil-rights-debates/12774-feminism-brainwashing-similar-christianism-print.html"
   ]
  ], 
  "identifier": 12774
 }
]