[
 [
  [
   354771, 
   null, 
   "MrWriteLA", 
   "Look, people... you have to understand how things work biologically.\n \n I'm not going to go into \"the birds and the bees,\" -- for the moment, I just want to concentrate on the bees. \n \n Flowers have evolved to exude a fragrance or a nectar or whatever to lure bees (in some cases other creatures) to come to them so they'd get pollen on them and spread it around to other flowers. (Not that a creator had anything to do with it... it just evolved as the best way to spread pollen.)\n \n The flower doesn't know what it's doing. The bee (or whatever) doesn't know what it's doing. Neither are sentient beings. Morality doesn't enter into it. As Cole Porter put it: \"It's a chemical reaction, that's all.\" \n \n The bee may next be attracted to a different species of flower, for which the previous pollen may do squat. But the bee, at least, got the nectar the flowers used to lure it with, is a happy camper, and flies back to the hive with it to the benefit of the other bees.\n \n My point being: this attraction evolved to BETTER THE CHANCES of spreading a flower species, not NECESSARILY result in it.\n \n Humans exude sexual attractors called pheromones. Most attract the opposite sex, some attract the same sex, some attract both. At any rate, the kind they exude can't be changed, and there's no reason it should be. You're attracted to who you're attracted to, not whom you're INSTRUCTED to. Otherwise, there wouldn't have to be a lonely person on the planet, because you could just choose to be attracted to anyone, and they could choose you back.\n \n Anyway, a sufficient number people have pheromones that attract the opposite sex to result in intercourse, which produces offspring and keeps the species going. The ones that don't... big deal. They got the fun of getting the \"nectar\" (pardon the symbolism), and still contribute to the human hive. \n \n Sexual attraction is a biochemical MECHANISM that evolved to IMPROVE the chances of procreation; not MANDATE it.\n \n Humans shouldn't be REQUIRED to be attracted to a one kind of human any more than bees should be required to be attracted to one species of flower. We have enough people on the planet as it is, consuming its resources far beyond its capacity. For all we know, the evolution of homosexuality in people (and virtually every other animal species on earth) developed to keep the planet in ecological balance.\n \n We, however, the so-called \"thinking\" species, have come up with baseless reasons (propriety, appearance, ancient superstitious beliefs) to insist that we countermand that evolutionary development, deny an essential biological pleasure to millions, and contribute -- in the case of sexually mis-matched humans who succumb to social pressure and manage to actually procreate -- to the overpopulation that may threaten our very existence on this planet.", 
   {
    "post_info": {
     "post_title": "Sexual attraction vs. procreation"
    }
   }, 
   null, 
   null, 
   1243103460.0
  ], 
  [
   354925, 
   null, 
   "pappillion001", 
   "Look, people... you have to understand how things work biologically.\n \n I'm not going to go into \"the birds and the bees,\" -- for the moment, I just want to concentrate on the bees. \n \n Flowers have evolved to exude a fragrance or a nectar or whatever to lure bees (in some cases other creatures) to come to them so they'd get pollen on them and spread it around to other flowers. (Not that a creator had anything to do with it... it just evolved as the best way to spread pollen.)\n \n The flower doesn't know what it's doing. The bee (or whatever) doesn't know what it's doing. Neither are sentient beings. Morality doesn't enter into it. As Cole Porter put it: \"It's a chemical reaction, that's all.\" \n \n The bee may next be attracted to a different species of flower, for which the previous pollen may do squat. But the bee, at least, got the nectar the flowers used to lure it with, is a happy camper, and flies back to the hive with it to the benefit of the other bees.\n \n My point being: this attraction evolved to BETTER THE CHANCES of spreading a flower species, not NECESSARILY result in it.\n \n Humans exude sexual attractors called pheromones. Most attract the opposite sex, some attract the same sex, some attract both. At any rate, the kind they exude can't be changed, and there's no reason it should be. You're attracted to who you're attracted to, not whom you're INSTRUCTED to. Otherwise, there wouldn't have to be a lonely person on the planet, because you could just choose to be attracted to anyone, and they could choose you back.\n \n Anyway, a sufficient number people have pheromones that attract the opposite sex to result in intercourse, which produces offspring and keeps the species going. The ones that don't... big deal. They got the fun of getting the \"nectar\" (pardon the symbolism), and still contribute to the human hive. \n \n Sexual attraction is a biochemical MECHANISM that evolved to IMPROVE the chances of procreation; not MANDATE it.\n \n Humans shouldn't be REQUIRED to be attracted to a one kind of human any more than bees should be required to be attracted to one species of flower. We have enough people on the planet as it is, consuming its resources far beyond its capacity. For all we know, the evolution of homosexuality in people (and virtually every other animal species on earth) developed to keep the planet in ecological balance.\n \n We, however, the so-called \"thinking\" species, have come up with baseless reasons (propriety, appearance, ancient superstitious beliefs) to insist that we countermand that evolutionary development, deny an essential biological pleasure to millions, and contribute -- in the case of sexually mis-matched humans who succumb to social pressure and manage to actually procreate -- to the overpopulation that may threaten our very existence on this planet.\n\n \n Hey what are you doing using that science biology poo poo stink. If God wanted us to know things like that it would have been put in at least one of the bibles inspired by God himself. \n \n I am so confused. Are saying that homosexuals are like flowers with stingers or bees that have pretty colors and smell nice?\n \n You are so going over the heads of so many christians. Great points to bad facts doesn't seem to be a language understood by the religious right.", 
   {}, 
   354771, 
   null, 
   1243232280.0
  ], 
  [
   354934, 
   null, 
   "Ohioprof", 
   "Hey what are you doing using that science biology poo poo stink. If God wanted us to know things like that it would have been put in at least one of the bibles inspired by God himself. \n\n \n There is plenty of information that we now know that is not in any Bible. It's a good thing, too, since the Bible is no guide to science. It may have other uses, but providing scientific knowledge is not one of them.", 
   {}, 
   354925, 
   null, 
   1243261200.0
  ], 
  [
   356831, 
   null, 
   "Sigma", 
   "\n We, however, the so-called \"thinking\" species, have come up with baseless reasons (propriety, appearance, ancient superstitious beliefs) to insist that we countermand that evolutionary development, deny an essential biological pleasure to millions, and contribute -- in the case of sexually mis-matched humans who succumb to social pressure and manage to actually procreate -- to the overpopulation that may threaten our very existence on this planet.\n\n \n You cannot mandate biology. The fact of the matter is, however, that homosexual relationships, themselves, appear to have no positive evolutionary purpose. Without effects on the female line, this aberration (for lack of a better word) would have bred itself out of the population long ago. It would be similar to a subset of the population in an animal species suddenly being attracted to another, separate animal species. It would seem to serve no positive purpose.\n \n Procreation is a positive, useful purpose to any activity in an evolutionary context. Sexual attraction exists to facilitate procreation. Pleasure during sex exists to facilitate procreation. Homosexual individuals have brains that co-opt specific biological functions to substitute creatures that do not facilitate the purpose they evolved to involve.", 
   {}, 
   354771, 
   null, 
   1244519940.0
  ], 
  [
   356832, 
   null, 
   "Anthony321", 
   "[QUOTE=Sigma;356831]You cannot mandate biology. The fact of the matter is, however, that homosexual relationships, themselves, appear to have no positive evolutionary purpose. Without effects on the female line, this aberration (for lack of a better word) would have bred itself out of the population long ago. \n \n \n Anthony321\n Variation is a better word, it even has fewer letters.", 
   {}, 
   356831, 
   null, 
   1244521380.0
  ], 
  [
   356834, 
   null, 
   "Sigma", 
   "Anthony321\n Variation is a better word, it even has fewer letters.\n\n \n A negative adaptation would be more properly termed an aberration, imo.\n \n Simply terming homosexuality as an alternative trait (as \"variation\" would imply) would be erroneous when it cannot be selected for since procreation would obviously not exist.", 
   {}, 
   356832, 
   null, 
   1244522220.0
  ], 
  [
   356843, 
   null, 
   "foundit66", 
   "You cannot mandate biology. The fact of the matter is, however, that homosexual relationships, themselves, appear to have no positive evolutionary purpose.\n\n One of the funny things about people who do not understand evolution is assuming that a \"purpose\" has to be readily determinable.\n It doesn't.\n \n Survivability demonstrates evolution.\n And when it comes to homosexuality, the proof is overwhelming. Not only in the human species, but also in species across the animal spectrum.\n \n But beyond that, the homosexual evolutionary purpose is readily discernible, unless somebody is prejudicially assuming not to see it in the first place.\n A family having homosexual members is more capable of protecting the family unit without having to divert extra resources to care for more children. Homosexuals are able to pick and choose when and how many children to have more effectively than heterosexuals, who often have unwanted and accidental children.\n The capability to incorporate INTELLIGENT FAMILY PLANNING is obviously beneficial above and beyond a plan that results in an excessive family that cannot be financially cared for.\n \n \n \nWithout effects on the female line, this aberration (for lack of a better word) would have bred itself out of the population long ago. It would be similar to a subset of the population in an animal species suddenly being attracted to another, separate animal species. It would seem to serve no positive purpose.\n\n And yet it survives.\n And people like you insist it shouldn't.\n Such a quandry would force a logical person to reassess their original observation and logic.\n \n \n \nProcreation is a positive, useful purpose to any activity in an evolutionary context.\n\n Yes.\n Procreation is.\n But how the heck is \"procreation\" defined EXCLUSIVELY to the heterosexual, and EXCLUSIVELY FROM the homosexual?\n Gays reproduce and care for children just like straights do.\n In fact, gays often care for the EXCESS children that heterosexuals produce in excess and cannot care for.\n Such a situation makes homosexuals obviously evolutionary BENEFICIAL to the species.\n \n \n \nSexual attraction exists to facilitate procreation.\n\n This is a false premise repeated over and over again by the anti-gay side.\n To follow this argument logically, it would be obvious to determine that if \"procreation\" is not possible, then sexual attraction should not exist.\n The fact that sexual attraction STILL REMAINS when procreation is not possible or viable is a demonstration that MORE than just \"facilitating procreation\" is going on... emoticon_xgood\n \n \n \nPleasure during sex exists to facilitate procreation.\n\n On some level, I can't help but wonder if I should pity people who think like this.\n They obviously have some bizarre mental approach towards sexual attraction and sex which makes them think it is just about procreation.\n Perhaps people who think like this don't get laid unless somebody else wants to procreate? They can't understand the pure joy and benefits to a union that result between two people coming together and bonding in such an intimate act?\n \n Do people like this look at a beautiful woman and think \"Gawd! I find her attractive because she is obviously prime for sexual reproduction!\" emoticon_wow\n \n \n \nHomosexual individuals have brains that co-opt specific biological functions to substitute creatures that do not facilitate the purpose they evolved to involve.\n\n Such arguments are like saying \"The stomach is not a heart! Therefore, the stomach is useless to the body!\" emoticon_xdonno\n People like this fail to recognize the CLEAR BENEFITS that homosexuality provides.\n \n If EVERY homosexual turned heterosexual tomorrow, the planet would be filled with MORE over-procreation. MORE over-crowding. MORE orphans and welfare babies.\n The evolutionary benefit is obvious!\n \n \n \nSimply terming homosexuality as an alternative trait (as \"variation\" would imply) would be erroneous when it cannot be selected for since procreation would obviously not exist.\n\n That argument (or perhaps just the sentence structure) makes no sense whatsoever.\n \"It cannot be selected for\" somehow means something intelligible?\n Can heterosexuality \"be selected for\"?\n \n And where does this \"procreation would obviously not exist\" nonsense come from?\n If you have both a heart and a stomach, does the fact that the stomach does not pump blood mean the stomach is useless? Or that the existence of the stomach somehow means pumping blood is less meaningful?\n Diversity of design and purpose.\n Some people can't grasp it. :xbanghead", 
   {}, 
   356831, 
   null, 
   1244524260.0
  ], 
  [
   356846, 
   null, 
   "shaunjosef", 
   "You cannot mandate biology. The fact of the matter is, however, that homosexual relationships, themselves, appear to have no positive evolutionary purpose. Without effects on the female line, this aberration (for lack of a better word) would have bred itself out of the population long ago. It would be similar to a subset of the population in an animal species suddenly being attracted to another, separate animal species. It would seem to serve no positive purpose.\n \n Procreation is a positive, useful purpose to any activity in an evolutionary context. Sexual attraction exists to facilitate procreation. Pleasure during sex exists to facilitate procreation. Homosexual individuals have brains that co-opt specific biological functions to substitute creatures that do not facilitate the purpose they evolved to involve.\n\n \n Humans don't just have sex for procreation. Humans have sex for pleasure. That explains the evolution of the clitoris and the bundle of nerves underneath the head of the penis.", 
   {}, 
   356831, 
   null, 
   1244525520.0
  ], 
  [
   356847, 
   null, 
   "Sigma", 
   "\n Survivability demonstrates evolution. And when it comes to homosexuality, the proof is overwhelming. Not only in the human species, but also in species across the animal spectrum.\n\n \n No, successful reproduction indicates a successful organism. The survival of any individual creature is meaningless without reproduction, in an evolutionary context. If that creature's specific traits were not passed on it is a failure, in an evolutionary context.\n \n \n\n A family having homosexual members is more capable of protecting the family unit without having to divert extra resources to care for more children. Homosexuals are able to pick and choose when and how many children to have more effectively than heterosexuals, who often have unwanted and accidental children.\n \n The capability to incorporate INTELLIGENT FAMILY PLANNING is obviously beneficial above and beyond a plan that results in an excessive family that cannot be financially cared for.\n\n \n You're suggesting that homosexuality is a successful adaptation because they... reproduced? That's a bold claim and frankly unbelievable. While it is true that fewer children require fewer resources, a homosexual relationship does not produce any children.\n \n You're assuming a great deal in order to justify a very slim claim. Genetic relatives certainly live together, work in each other's gardens, protect each other and adopt each other's needy or orphaned children, but a grouping of heterosexuals would enjoy greater reproductive success than a group that contained homosexual couples that did not reproduce. While some children may die due to limits in resources, there is an optimum number of children that could be achieved with a greater number of reproducers.\n \n \nAnd yet it survives. And people like you insist it shouldn't. Such a quandry would force a logical person to reassess their original observation and logic.\n\n \n Read the quote again. \"Without effects on the female line\" refers to research that suggest that homosexuality is a deliberately negative adaptation to retard the fitness of certain male lines, while simultaneously increasing the fecundity of female members of that line.\n \n \nYes. Procreation is. But how the heck is \"procreation\" defined EXCLUSIVELY to the heterosexual, and EXCLUSIVELY FROM the homosexual?\n\n \n Sexual reproduction does not naturally occur in homosexual relationships. Heterosexual attraction facilitates reproduction while homosexual attraction does not.\n \n \nGays reproduce and care for children just like straights do. In fact, gays often care for the EXCESS children that heterosexuals produce in excess and cannot care for. Such a situation makes homosexuals obviously evolutionary BENEFICIAL to the species.\n\n \n LOL\n \n To be a successful evolutionary trait it would have to replicate itself through sexual reproduction. Since sexual reproduction cannot exist in a homosexual relationship homosexuality would be a negative adaptation.\n \n \nOn some level, I can't help but wonder if I should pity people who think like this. They obviously have some bizarre mental approach towards sexual attraction and sex which makes them think it is just about procreation. Perhaps people who think like this don't get laid unless somebody else wants to procreate? They can't understand the pure joy and benefits to a union that result between two people coming together and bonding in such an intimate act?\n \n Do people like this look at a beautiful woman and think \"Gawd! I find her attractive because she is obviously prime for sexual reproduction!\" emoticon_wow\n\n \n While on this end I really do pity people who think like your quote here indicates.\n \n You're suffering under misconceptions about the subject of evolutionary psychology. This talk about genes that influence behavior does not mean we are mindlessly executing the dictates of DNA. The genes in question are those that endow us with the neural systems for conscience, attraction, and will. When I talk about selection of such genes, I'm talking about the way those faculties could have evolved. If these faculties are products of a nonrandom organization of the brain, then there have to be genes that help do the organizing and that raises the question of how those genes would have been selected for in the course of human evolution, which is driven by sexual reproduction.\n \n Your second misconception is to imagine that this talk about successful mating implies that people are Machiavellian cynics, coldly calculating the genetic advantages of every situation. To fret over this picture, or to denounce it because you don't like it, is to confuse proximate and ultimate causation. People don't care about their genes; they care about happiness, love, power, respect, and other passions. The cost-benefit calculations are a metaphorical way of describing the selection of alternative genes ove rmillennia, not a literal description of what takes place in a human brain in real time.\n \n \nIf EVERY homosexual turned heterosexual tomorrow, the planet would be filled with MORE over-procreation. MORE over-crowding. MORE orphans and welfare babies. The evolutionary benefit is obvious!\n\n \n This is one of the more bizarre justifications for homosexuality I've seen. In an era with contraception and women's rights we are tormented by the Darwinian economics of babies we are no longer having. This is a testimony to how hardwired human nature is to the act of procreation.\n \n \nThat argument (or perhaps just the sentence structure) makes no sense whatsoever.\"It cannot be selected for\" somehow means something intelligible? Can heterosexuality \"be selected for\"?\n\n \n Heterosexuality is the method through which traits are selected for.\n \n \nAnd where does this \"procreation would obviously not exist\" nonsense come from?\n\n \n In a homosexual relationship natural children do not exist. Only a heterosexual relationship produces children.", 
   {}, 
   356843, 
   null, 
   1244529000.0
  ], 
  [
   356848, 
   null, 
   "Sigma", 
   "Humans don't just have sex for procreation. Humans have sex for pleasure. That explains the evolution of the clitoris and the bundle of nerves underneath the head of the penis.\n\n \n The pleasure during the act of sex facilitates reproduction. Without pleasure few would have sex.", 
   {}, 
   356846, 
   null, 
   1244529060.0
  ], 
  [
   356851, 
   null, 
   "shaunjosef", 
   "The pleasure during the act of sex facilitates reproduction. Without pleasure few would have sex.\n\n \n No, because then it would be an instinct. Most animals don't derive pleasure from sex, but they still reproduce. It's an instinct. It would be the same with humans if we didn't derive something pleasure from it, it'd be instinctual.", 
   {}, 
   356848, 
   null, 
   1244530380.0
  ], 
  [
   356852, 
   null, 
   "shaunjosef", 
   "And Sigma, how does the pleasure facilitate reproduction? What about oral sex? And anal? And sex with a prophilactic on?", 
   {}, 
   356851, 
   null, 
   1244531400.0
  ], 
  [
   356854, 
   null, 
   "Sigma", 
   "No, because then it would be an instinct. Most animals don't derive pleasure from sex, but they still reproduce. It's an instinct. It would be the same with humans if we didn't derive something for pleasure, it'd be instinctual.\n\n \n If a couple were guaranteed to be faithful, to favor each other over their kin, and to die at the same time, their genetic interest would be identical and wrapped up in their common children. Such couples would have no use for love, have sex only for the purpose of procreation (why waste energy?) and sex would bring no more pleasure than the rest of reproductive physiology such and the release of hormones or the formation of gamates.\n \n If we were insects and virtual clones of each then our genetic interests would be served by the children of our relatives and there would need be no pleasurable incentive to form our own bonds or reproduce ourselves. \n \n We, instead, are mammals and our sexual behavior is consistent with our Linnaean class. Men seek a greater number of sexual partners than women, are less picky in their choice of short-term partners, and are far more likely to be customers for visual pornography. Sex is the most concentrated source of physical pleasure granted by our nervous system, conducted in private, pondered obsessively, regulated by custom and taboo, is the subject of gossip and teasing, and a trigger for jealous rage. One of the hazards of sex is a baby, and a baby is not just any seven-pound object but is, from an evolutionary point of view, our reason for being.\n \n While we have instincts regarding the economics of babies, the conscious decision to have sex is not ruled by the cost-benefit analysis if genetic interests. Real-time decisions are made by passions that evolved due to these genetic interests, and one of those incentives is the pleasure associated with sex.", 
   {}, 
   356851, 
   null, 
   1244531880.0
  ], 
  [
   356855, 
   null, 
   "Sigma", 
   "And Sigma, how does the pleasure facilitate reproduction? What about oral sex? And anal? And sex with a prophilactic on?\n\n \n You misunderstand. Pleasure during sex evolved to facilitate reproduction.", 
   {}, 
   356852, 
   null, 
   1244532180.0
  ], 
  [
   356856, 
   null, 
   "shaunjosef", 
   "If a couple were guaranteed to be faithful, to favor each other over their kin, and to die at the same time, their genetic interest would be identical and wrapped up in their common children. Such couples would have no use for love, have sex only for the purpose of procreation (why waste energy?) and sex would bring no more pleasure than the rest of reproductive physiology such and the release of hormones or the formation of gamates.\n \n If we were insects and virtual clones of each then our genetic interests would be served by the children of our relatives and there would need be no pleasurable incentive to form our own bonds or reproduce ourselves. \n \n We, instead, are mammals and our sexual behavior is consistent with our Linnaean class. Men seek a greater number of sexual partners than women, are less picky in their choice of short-term partners, and are far more likely to be customers for visual pornography. Sex is the most concentrated source of physical pleasure granted by our nervous system, conducted in private, pondered obsessively, regulated by custom and taboo, is the subject of gossip and teasing, and a trigger for jealous rage. One of the hazards of sex is a baby, and a baby is not just any seven-pound object but is, from an evolutionary point of view, our reason for being.\n \n While we have instincts regarding the economics of babies, the conscious decision to have sex is not ruled by the cost-benefit analysis if genetic interests. Real-time decisions are made by passions that evolved due to these genetic interests, and one of those incentives is the pleasure associated with sex.\n\n \n I said that if we derived no pleasure from sex, it'd still be instinctual. We are the only mammal that derives pleasure from sex, but we aren't the only mammals on the Earth. Therefore, sex is an instinct in animals that don't derive pleasure from it. If we didn't evolve the pleasure centers, we'd still have sex to propogate the species. It'd be much less enjoyable, though.\n \n However, I do see your point.", 
   {}, 
   356854, 
   null, 
   1244532600.0
  ], 
  [
   356857, 
   null, 
   "Sigma", 
   "I said that if we derived no pleasure from sex, it'd still be instinctual. We are the only mammal that derives pleasure from sex, but we aren't the only mammals on the Earth. Therefore, sex is an instinct in animals that don't derive pleasure from it. If we didn't evolve the pleasure centers, we'd still have sex to propogate the species. It'd be much less enjoyable, though.\n \n However, I do see your point.\n\n \n We are the only mammals on earth that derive pleasure from sex? Dolphins are thought to have sex for the pleasure they derive from it, similar to the way humans do. Certainly we can see dogs and horses derive pleasure from sex as well.\n \n Zoologists have found that the males of many species will court an enormous range of objects having a vague resemblance to the female: other males, females of the wrong species, females of the right species that have been stuffed and nailed to a board, parts of stuffed females such as a head suspended in midair, even parts of stuffed females with important features missing like theeyes and the mouth. The male of the human species is aroused by the sight of a nude woman, not only the real thing but in movies, photographs, drawings, postcards, dolls, and bit-mapped cathode-ray-tube displays. The behavior is similar and for similar reasons.\n \n The behavior of desiring sex merely by instinct could not compete successfully, imo, with a group that willfully chose to have sex due to the pleasure it produced. While there is no proof that we competed against humans who derived no pleasure from sex, rationally I cannot see how such a group would out-produce our own method.", 
   {}, 
   356856, 
   null, 
   1244533680.0
  ], 
  [
   356866, 
   null, 
   "Anthony321", 
   "[QUOTE=Sigma;356834]A negative adaptation would be more properly termed an aberration, imo.\n \n Simply terming homosexuality as an alternative trait (as \"variation\" would imply) would be erroneous when it cannot be selected for since procreation would obviously not exist.\n \n \n Anthony321\n How would you describe heterosexuals who cannot reproduce (sterile people)?\n Is sterility an aberration? What about heterosexuals who can reproduce but choose not to? What about homosexuals who can reproduce and do?\n Procreation is a weak arguement in this day and age. It's been a weak arguement for the past 100 years.", 
   {}, 
   356834, 
   null, 
   1244558220.0
  ], 
  [
   356870, 
   null, 
   "Sigma", 
   "\n Anthony321\n How would you describe heterosexuals who cannot reproduce (sterile people)?\n\n \n Sterility due to genetic defect is a defect in an individual instead of an aberrant trait among a subset of the population.\n \n \nWhat about heterosexuals who can reproduce but choose not to?\n\n \n Heterosexuals who do not reproduce for any reason are not aberrations since non-parity within reproducing populations is simply part of evolution. The traits of that individual will be selected out of subsequent populations. Humanity is still evolving.\n \n \nWhat about homosexuals who can reproduce and do?\n\n \n Statistically irrelevent. Acting contrary to their nature does not mean their nature is not an aberration. It just means they acted contrary to that nature.\n \n \nProcreation is a weak arguement in this day and age. It's been a weak arguement for the past 100 years.\n\n \n Procreation is the reason we exist as a species.", 
   {}, 
   356866, 
   null, 
   1244562120.0
  ], 
  [
   356925, 
   null, 
   "foundit66", 
   "No, successful reproduction indicates a successful organism. The survival of any individual creature is meaningless without reproduction, in an evolutionary context. If that creature's specific traits were not passed on it is a failure, in an evolutionary context.\n\n You fixate on \"evolution\" on an individual basis, ignoring the fact that GROUP survival is also important.\n \n If you have two animal groups, both procreating at identical rates.\n One group establishes a practice whereby an individual animal sacrifices itself in a situation that would have typically cost the herd three animals to predators. The other group (same scenario) does not intelligently defend the group, and sacrifices three animals.\n Which herd is evolutionary superior?\n The first group, of course.\n \n Your limited understanding of evolution fails to appreciate that it dictates MORE than just an individual organism's survival and procreation.\n It deals with SPECIES survival as well. And if a feature benefits the SPECIES, then that feature is an evolutionary benefit.\n \n \n \nYou're suggesting that homosexuality is a successful adaptation because they... reproduced? That's a bold claim and frankly unbelievable. While it is true that fewer children require fewer resources, a homosexual relationship does not produce any children.\n\n Reality proves you wrong.\n There are plenty of gay couples that have \"produced\" children.\n It may require outside assistance, but we don't condemn the STRAIGHT couples who also use these practices.\n \n Sperm donors. Egg donors. Surrogate mothers. etc, etc.\n \n \n \nYou're assuming a great deal in order to justify a very slim claim. Genetic relatives certainly live together, work in each other's gardens, protect each other and adopt each other's needy or orphaned children, but a grouping of heterosexuals would enjoy greater reproductive success than a group that contained homosexual couples that did not reproduce.\n\n What is it with you people always trying to look at \"group of heterosexuals\" vs \"group of homosexuals\".\n \n It's like the heart saying \"If the entire body had organs made of hearts, that would be better\" emoticon_xdonno\n The point is that homosexuals and heterosexuals WORKING TOGETHER is better. There is evolutionary benefit in a society that has BOTH homosexuals AND heterosexuals.\n \n In your heterosexual only environment, you would have MORE overcrowding. MORE over-procreation. MORE unwanted children.\n Why can't you address that?\n \n \n \nWhile some children may die due to limits in resources, there is an optimum number of children that could be achieved with a greater number of reproducers.\n\n Why can't you recognize that we are PAST THAT NUMBER???\n We have starvation on this planet. We have children who are procreated who parents CANNOT CARE for.\n We have more children in the foster system than adoptive parents.\n \n And you think changing our system to eliminate the homosexuals would be BETTER???\n \n \n \nRead the quote again. \"Without effects on the female line\" refers to research that suggest that homosexuality is a deliberately negative adaptation to retard the fitness of certain male lines, while simultaneously increasing the fecundity of female members of that line.\n\n What's funny here is that you take an aspect of the system, try to insist that it is somehow flawed, and refuse to acknowledge how the system works.\n \n Your approach would be like saying \"without the throat, the lungs would starve from lack of oxygen\"\n The female line producing MORE children is beneficial. Those children can help with family functions including protection, finances, etc.\n And with more male children, we are again back to the problem of OVER-PROCREATION. If every single one of those male children were heterosexual, you would have OVER-PROCREATION problems more extreme than we see in today's society.\n \n \n \nSexual reproduction does not naturally occur in homosexual relationships. Heterosexual attraction facilitates reproduction while homosexual attraction does not.\n\n \"Naturally\" is irrelevant.\n Whether or not it DOES OCCUR is the issue.\n Does evolution care about your opinion on whether a child is \"naturally\" produced? No.\n \n \n \nTo be a successful evolutionary trait it would have to replicate itself through sexual reproduction.\n\n And golly gee whiz.\n Homosexuals are 100% the result of sexual reproduction!\n Amazing how that works...\n < end sarcasm <\n \n \n \nTo be a successful evolutionary trait it would have to replicate itself through sexual reproduction. Since sexual reproduction cannot exist in a homosexual relationship homosexuality would be a negative adaptation.\n\n I quoted your first statement, which I responded to with the ACTUAL intelligent meaning.\n And now I look at how you combine the two...\n \n You confuse the issues.\n Homosexuality DOES propagate itself through the evolutionary line. \n But homosexual relationships PRODUCING a homosexual is an illogical and non-existent requirement. It shows you don't understand evolution at all.\n \n You are too stuck thinking in a solitary way of gene propagation and continuance. You fail to look at the SPECIES benefits to the system.\n \n \n \nYou're suffering under misconceptions about the subject of evolutionary psychology. This talk about genes that influence behavior does not mean we are mindlessly executing the dictates of DNA.\n\n And you are trying to look at how things COULD work, while failing to recognize how things DO work.\n I never said anything about \"mindlessly executing the dictates of DNA\".\n What I am doing is looking at how things ACTUALLY PLAY OUT.\n \n Heterosexuals have an over-procreation problem.\n It doesn't matter how many heterosexuals sit around saying to themselves \"We shouldn't over-procreate\". \n IT STILL HAPPENS.\n \n \n \nThe genes in question are those that endow us with the neural systems for conscience, attraction, and will. When I talk about selection of such genes, I'm talking about the way those faculties could have evolved. If these faculties are products of a nonrandom organization of the brain, then there have to be genes that help do the organizing and that raises the question of how those genes would have been selected for in the course of human evolution, which is driven by sexual reproduction.\n Your second misconception ...\n\n ROFLMAO!\n I just got finished reading your first paragraph thinking \"Sigma has said nothing of worth\", and then I realize that you think you are somehow correcting a misconception?\n No.\n \n You are running off on some tangent, babbling away with pointless commentary that doesn't really address what I said.\n \n \n \nYour second misconception is to imagine that ...\n\n I don't imagine what you're about to talk about, so I'll just cut you off there and not waste space.\n \n \n \nThis is one of the more bizarre justifications for homosexuality I've seen. In an era with contraception and women's rights we are tormented by the Darwinian economics of babies we are no longer having. This is a testimony to how hardwired human nature is to the act of procreation.\n\n But my statement is 100% true. And you avoid its truth by pointing to products that ARE NOT used, or used improperly to achieve the situation we have today.\n \n IF people were to act more responsibly, then yes. It would be a different situation.\n BUT PEOPLE DO NOT act more responsibly. We have religious organizations running around proclaiming we have to teach \"abstinence only\", which is shown to increase teen-age pregnancy. We have religious organizations that insist on refusing aid to foreign entities which discuss abortion.\n In THIS era, we have over-procreation due to a variety of factors.\n \n \n \nHeterosexuality is the method through which traits are selected for.\n\n First of all, no. We're back to gay couples procreating, disproving your allegation.\n We have evolved PAST heterosexual coupling being the only method of reproduction.\n \n Secondly, you are stating things and then MISREPRESENTING CONCLUSIONS that can be drawn.\n This has nothing to do with the fact that homosexuality DOES PRESENT an advantage to the species.\n \n \n \nIn a homosexual relationship natural children do not exist. Only a heterosexual relationship produces children.\n\n Evolution doesn't care about \"natural\" children.\n A procreated child is a procreated child.\n Your thinking is stuck 100 years in the past, ignoring the modern advances and modern consequences of today.", 
   {}, 
   356847, 
   null, 
   1244580960.0
  ], 
  [
   356958, 
   null, 
   "Sigma", 
   "You fixate on \"evolution\" on an individual basis, ignoring the fact that GROUP survival is also important.\n\n \n \"Group evolution\" does not exist in the manner you believe, according to the modern theory of evolution. \n \n It maintains that complex adaptations, including behavioral strategies, evolved to benefit the individual (or the genes within that individual), not the community, species, or ecosystem. Social organization evolves when the long-term benefits to the individual outweigh the immediate costs. Darwin and many of his successors analyze evolution of sociality using tools such as game theory and other optimization techniques to account for such things as reciprocal altruism.\n \n This, of course, runs counter to two different traditions (you fall in one of these traditions, foundit66). The first is the sociological tradition, where a society is a cohesive organic entity and its individual citizens are mere parts. People are social by their very nature and function as constituents of a larger superorganism. This is the tradition of Plato, Hegel, Marx, Durkheim, Weber, Kroeber and postmodernism in the humanities and social sciences.\n \n The other tradition is the social contract tradition, where society is an arrangement negotiated by rational, self-interested individuals. They agree to sacrifice some of their autonomy in exchange for security from the depredations of others wielding their autonomy. This is the tradition of Plato's Republic, of Machiavelli, Hobbes, Locke, Rousseau and Smith. It forms the basis for the rational actor or \"economic man\" models in economics and political science, and for cost-benefit analyses of public choices.\n \n Of course humans were never solitary, and they did not inaugurate group lioving by haggling over a contract at a particular time and place. But the logic of social contracts may have propelled the evolution of the mental faculties that keep us in these groups. Social arrangements are evolutionarily contingent, arising when the benefits of group living exceed the cost to the individual.\n \n So, then, let me try to show you exactly what is incorrect about your assumptions.\n \n \nIf you have two animal groups, both procreating at identical rates. One group establishes a practice whereby an individual animal sacrifices itself in a situation that would have typically cost the herd three animals to predators. The other group (same scenario) does not intelligently defend the group, and sacrifices three animals. Which herd is evolutionary superior? The first group, of course.\n\n \n You, of course, are trying to show that the logic of altruism can evolve due to evolutionary pressure. Modern evolutionary theory trumps that belief.\n \n Humans, unlike social insects like ants, do not have the superorganism instinct that prompts them to do everything for the colony. This romantic notion that people are instinctively communal is an important precept of the doctrine of the Noble Savage. But unless people treat other members of society the way they treat their own children, this is a non sequitur: people care deeply about their own children but feel differently about the millions of other people who make up society. The very framing of the question and answer assumes that humans are competitive or sympathetic across the board, rather than having different emotions toward people with whom they have different genetic relations, as predicted by evolutionary theory.\n \n The biologist Robert Trivers has pointed out that public-minded altruism (the desire to benefit the group or species at the expense of the self) is unlikely to evolve among nonrelatives, because it is vulnerable to invasion by cheaters who prosper by enjoying the good deeds of others without contributing in turn. However, a measure of reciprocal altruism can evolve and this is supported by the complex emotional apparatus humans are endowed with. Remembering others as individuals, a memory for cheaters. Moralistic emotions such as liking, sympathy, gratitude, guilt, shame and anger are uncanny implementations of the strategies for reciprocal altruism in computer simulations and mathematical models. We like people who grant us favors, grant favors to those we like, feel guilty when we withhold a possible favor and punish those who withhold favors from us.\n \n However, as I have said, public-minded altruism is unlikely to evolve as per your example. The problem is inherent with public goods and can be outlined by the fable \"Who Will Bell the Cat?\" \n \n The mice in a household agree they would be better off if the cat had a bell around its neck to warn them of its approach, but no mouse will risk life and limb to attach the bell. A willingness to bell the cat (contribute to the public good) can only evolve if it is accompanied by a willingness to reward those who shoulder the burden or to punish cheaters who shirk it. In other words, a willingness to help others can only evolve if the benefit outweighs the cost to the operator.\n \n These results are borne out in Game Theory. The Ultimatum Game, the Dictator Game (especially the Double-Blind Dictator Game), and then the Public Good Game. These experiments may be artificial but the motives they expose are very real and support the selfish-gene theory that makes up modern evolutionary thought.\n \n \nReality proves you wrong. There are plenty of gay couples that have \"produced\" children. It may require outside assistance, but we don't condemn the STRAIGHT couples who also use these practices. Sperm donors. Egg donors. Surrogate mothers. etc, etc.\n\n \n Aye, but those have nothing to do with our evolutionary history or with evolutionary psychology.\n \n \nWhy can't you recognize that we are PAST THAT NUMBER???\n \n And you think changing our system to eliminate the homosexuals would be BETTER???\n\n \n Our instincts, emotions and mental calculus evolved a long time ago for many different purposes, some of which are irrelevant today but still are a powerful force within us. Modern social issues have no bearing on evolutionary psychology.\n \n \n\n The female line producing MORE children is beneficial. \n\n \n From an evolutionary perspective generally more children = more successful organism.\n \n \nAnd with more male children, we are again back to the problem of OVER-PROCREATION. If every single one of those male children were heterosexual, you would have OVER-PROCREATION problems more extreme than we see in today's society.\n\n \n Whether overpopulation is a problem is irrelevent to our evolution as a species. Honestly I don't know why you even bring it up.\n \n Animals reach an equalibrium with their environment in terms of population, evolution does not generally throttle procreation. Evolution generally errs on the side of overpopulation as a matter of course to account for premature deaths due to accident and/or predation. Of course, modern medicine has taken much of that out of the equation, but you have presented no logic to suggest that homosexuality is a creation of an overpopulation problem. \n \n \n\"Naturally\" is irrelevant. Whether or not it DOES OCCUR is the issue. Does evolution care about your opinion on whether a child is \"naturally\" produced? No.\n\n \n Yes, it does. Evolution gave us tools to deal with the natural world and it was able to do this through pressures that occurred in the natural world. While certainly we are co-opting mental faculties for purposes they were never intended for, this does not eliminate the tools, modules and faculties that evolved to deal with the world as it existed when we evolved those tools, modules and faculties. \n \n Since homosexual relationships do not produce children, they would not be part our evolution. At best, it is a side effect of increased fecundity in the female line.\n \n \nFirst of all, no. We're back to gay couples procreating, disproving your allegation. We have evolved PAST heterosexual coupling being the only method of reproduction.\n\n \n Sexual reproduction is how we evolved as a species. While scientific advances such as you've outlined are interesting but very irrelevent to our evolution as a species. Heterosexual relationships producing children is what our species is built around.\n \n \nSecondly, you are stating things and then MISREPRESENTING CONCLUSIONS that can be drawn. This has nothing to do with the fact that homosexuality DOES PRESENT an advantage to the species.\n\n \n Certainly not in your erroneous group evolution claim. As a solution to overpopulation? That is not generally a concern of evolution, since evolution usually ends up with overpopulation as a goal so there is no logic to your claim.\n \n \nEvolution doesn't care about \"natural\" children. A procreated child is a procreated child. Your thinking is stuck 100 years in the past, ignoring the modern advances and modern consequences of today.\n\n \n Heterosexual relationships producing children is how our species evolved, foundit66. Unless you invent a time machine and start creating children in unnatural ways in the past it will always be so. The mental faculties, as it stands today, were built a long time ago to deal with much different problems. They evolved to maximize our reproductive potential, which requires a heterosexual relationship.", 
   {}, 
   356925, 
   null, 
   1244589960.0
  ], 
  [
   357041, 
   null, 
   "foundit66", 
   "\"Group evolution\" does not exist in the manner you believe, according to the modern theory of evolution. \n\n :xbanghead\n That's like saying \"the internal hard drive isn't necessary for a computer, except in modern computers\"...\n You want to ignore modern science, while attempting to use science to invalidate homosexuality???\n :xbanghead\n \n \n \nSocial organization evolves when the long-term benefits to the individual outweigh the immediate costs.\n\n Quit misrepresenting my point.\n The point is that the benefit is seen TO THE SPECIES.\n You fixate on \"evolution\" as if it's only a concept that should further the development of an INDIVIDUAL organism.\n But the truth is that evolutionary benefits which benefit THE SPECIES IS STILL EVOLUTION.\n \n Quit obfuscating the issue by trying to drone on with pointless commentary about \"society\"...\n \n \n \nYou, of course, are trying to show that the logic of altruism can evolve due to evolutionary pressure. Modern evolutionary theory trumps that belief.\n\n No. I am not doing that.\n And you are obfuscating my point.\n If a characteristic gives the SPECIES a benefit that is not necessarily present for the individual, then the SPECIES will continue to bring forth that characteristic.\n It has nothing to do with \"altruism\", which is your attempt to obfuscate the issue. It has to do with EVOLUTIONARY RECOGNITION of how comparing a group that provides the SPECIES with more survivability is superior to a group that lacks this characteristic.\n \n \n \nThe biologist Robert Trivers has pointed out that public-minded altruism (the desire to benefit the group or species at the expense of the self) is unlikely to evolve among nonrelatives, because it is vulnerable to invasion by cheaters who prosper by enjoying the good deeds of others without contributing in turn.\n\n This line of response is absurd.\n You talk about \"unlikely to evolve\", and I am talking about an EXISTING CHARACTERISTIC which DOES BENEFIT SOCIETY.\n The fact that somebody thinks it is \"unlikely to evolve\" is not refutation of a characteristic which DOES EXIST, and DOES BENEFIT SOCIETY in the manner discussed... emoticon_rolleyes\n \n This conversation is like having somebody say that it is \"unlikely\" that humans will develop the capability to mass transit through the air.\n emoticon_rolleyes\n \n \n \nAye, but those have nothing to do with our evolutionary history or with evolutionary psychology.\n\n evolutionary HISTORY?\n That's like insisting that we look at gills when the animal has evolved to land-based. \n And this isn't about evolutionary psychology, but rather SPECIES survival and which system works best.\n \n \n \nOur instincts, emotions and mental calculus evolved a long time ago for many different purposes, some of which are irrelevant today but still are a powerful force within us. Modern social issues have no bearing on evolutionary psychology.\n\n You aren't even responding to what I am saying anymore.\n I am pointing out that our society is procreating PAST the level of self-sustaining, to the extent that excess procreation goes without parents. Without FOOD.\n And you ignore that.\n \n \n \nFrom an evolutionary perspective generally more children = more successful organism.\n\n Again, you fixate myopically ignoring the bigger picture.\n Improving SPECIES FUNCTION is also beneficial. An evolutionary advantage.\n You are stuck thinking popping out more and more kids is somehow better. emoticon_rolleyes\n By that mentality, the welfare mom with 7 kids is a \"more successful organism\" as opposed to the lesbian couple who choose to have 2 kids and care for them more thoroughly.\n :xbanghead\n \n \n \nWhether overpopulation is a problem is irrelevent to our evolution as a species. Honestly I don't know why you even bring it up.\n\n I don't know why you try to dodge it.\n Obviously, a more ideal evolutionary sequence would be an INTELLIGENT CHOICE of reproduction, as opposed to accidental pregnancy from rutting around in the back-seat of a car.\n \n And if you think over-population is \"irrelevant\", then you really don't understand the effects of over-population on a species. It holds back the species, and can lead to all sorts of negative consequences.\n In nature, it leads to starvation. Causing an incapability to feed is hardly beneficial to the species.\n \n \n \nAnimals reach an equalibrium with their environment in terms of population, evolution does not generally throttle procreation. Evolution generally errs on the side of overpopulation as a matter of course to account for premature deaths due to accident and/or predation. Of course, modern medicine has taken much of that out of the equation, but you have presented no logic to suggest that homosexuality is a creation of an overpopulation problem. \n\n :xbanghead\n What is it with you and trying to drag NON-SCIENTIFIC THINKING into the situation.\n \"homosexuality is a creation of an overpopulation problem\"???\n \"CREATION\"???\n \n Evolution reproduces characteristics that are beneficial to the species and individual organisms. There is no \"creation\" of these characteristics involved.\n If a characteristic comes into being and is reproducible through the species, AND IT PROVIDES AN ADVANTAGE (to either the species or individual), then that characteristic is evolutionary feasible.\n \n \n \nSince homosexual relationships do not produce children, they would not be part our evolution. At best, it is a side effect of increased fecundity in the female line.\n\n :xbanghead\n You keep revealing how little you understand about evolution.\n Being able to \"produce children\" is not the end-all and be-all of being a part of evolution.\n \n \n \nSexual reproduction is how we evolved as a species. While scientific advances such as you've outlined are interesting but very irrelevent to our evolution as a species. Heterosexual relationships producing children is what our species is built around.\n\n Again, you're ignoring the MODERN adaptations, to fixate on the PRIOR adaptations.\n Quit talking about the gills on the amphibian that has been walking on the land for quite some time now!\n \n \n \nCertainly not in your erroneous group evolution claim. As a solution to overpopulation? That is not generally a concern of evolution, since evolution usually ends up with overpopulation as a goal so there is no logic to your claim.\n\n :xbanghead\n \"not generally a concern of evolution\"?\n Why is it that logic leads to the obvious conclusion, and all you do is pop up and say \"you're wrong\" and think that's it?\n There are OBVIOUS SPECIES ADVANTAGES in having attributes which limit procreation to prevent over-crowding.\n If you had even studied the animal food-chain, you would realize that over-crowding causes a ripple effect in BOTH the food supply AND the predator population.\n \n If the gazelle population goes up, the gazelle food source goes down.\n The lions, happy to have plenty of food, have THEIR population go up.\n So the gazelle population plummets.\n \n Add in other factors, like a possibly ill timed drought which could further damage the gazelle food, and you've created a sling-shot effect to make the gazelle population go down even further.\n \n In the real world, we have overpopulation which results in orphans. Welfare babies. Parents who CANNOT ADEQUATELY CARE for their children.\n Compare a gay couple adopting a baby, consciously choosing the time and place to ensure they are capable of caring for the baby, as opposed to another welfare baby which gets inadequate medical care.\n WHICH is obviously more advantageous to survival? The GAY COUPLE of course!\n Ergo, an EVOLUTIONARY BENEFIT.\n \n \n \nHeterosexual relationships producing children is how our species evolved, foundit66. Unless you invent a time machine and start creating children in unnatural ways in the past it will always be so.\n\n Your lack of logic is boring.\n IT DOES NOT MATTER how it started.\n Life started in the water. That doesn't mean that we have to demand humans observe something about gills, or give more benefits to people who have gills.\n You lose sight of the big picture with this response. Evolution DOES NOT REQUIRE people to fixate on how things evolved IN THE PAST.\n The evolutionary benefits OF TODAY are what is relevant to EVOLUTION TODAY! emoticon_xgood", 
   {}, 
   356958, 
   null, 
   1244656200.0
  ], 
  [
   357047, 
   null, 
   "Anthony321", 
   "[QUOTE=Sigma;\n Heterosexual relationships producing children is how our species evolved, foundit66. \n \n \n \n Anthony321:\n Heterosexual relationships from day one have been producing homosexual children. Whatever problem it is you have with homosexuals you need to take it up with the heterosexuals who keep giving birth to them.\n \n \n Sigma:\n Unless you invent a time machine and start creating children in unnatural ways in the past it will always be so. \n \n \n \n Anthony321:\n Well the first children were created from dust and a rib bone and that certainly is not a natural way to create children as we all know. So you can scrap the time machine because children have already been created in unnatural ways, it says so right in the Bible.\n \n \n \n Sigma:\n The mental faculties, as it stands today, were built a long time ago to deal with much different problems. They evolved to maximize our reproductive potential, which requires a heterosexual relationship.[/QUOTE]\n \n \n \n Anthony321:\n It does not require a relationship at all. It requires sexual intercourse, which you may or may not know does not need a relationship to transpire.", 
   {}, 
   356958, 
   null, 
   1244659380.0
  ], 
  [
   357048, 
   null, 
   "Anthony321", 
   "[QUOTE=Sigma\n Procreation is the reason we exist as a species.[/QUOTE]\n \n \n \n \n \n Anthony321:\n It will also be the reason that we cease to exist a species. You need to be careful when you use procreation as an arguement for your beliefs, it's a sword that cuts both ways.", 
   {}, 
   356870, 
   null, 
   1244659680.0
  ], 
  [
   357050, 
   null, 
   "Sigma", 
   "\n You want to ignore modern science, while attempting to use science to invalidate homosexuality???\n\n \n LOL\n Actually what I said was, essentially: Modern science does not support your argument. Thanks for playing though!\n \n Our discussion seems to be ended if I have to go back to explain to you what my post means. Since I've shown you where modern understanding of evolution does not support your contention and that altruistic sacrifice for the good of the species isn't considered to exist, you've added nothing further to the discussion besides reiteration of that point.\n \n I'll leave you here. Good day to you :)", 
   {}, 
   357041, 
   null, 
   1244659860.0
  ], 
  [
   357051, 
   null, 
   "foundit66", 
   "LOL\n Actually what I said was, essentially: Modern science does not support your argument. Thanks for playing though!\n\n emoticon_rolleyes\n You don't seem to get that YOU CLAIM science doesn't support my argument, but I am using REAL EVOLUTIONARY ARGUMENTS in my presentation.\n You are IGNORING the real evolutionary issues.\n \n You claim evolution is just about individual organisms and their capability to further their line.\n THAT IS FALSE. Evolutionary benefits to the SPECIES are also evolutionary advantages which the species can utilize.\n \n \n \nOur discussion seems to be ended if I have to go back to explain to you what my post means.\n\n Our discussion is ended cause you refuse to address what I am saying.\n I understood what you said. You don't have to \"explain\" it to me.\n If you are using an excuse to quit the conversation, that is your perogative. \n \n \n \nSince I've shown you where modern understanding of evolution does not support your contention and that altruistic sacrifice for the good of the species isn't considered to exist, you've added nothing further to the discussion besides reiteration of that point.\n\n Your claim is false.\n The statements you quoted specify that altruistic evolution IS UNLIKELY to develop.\n I refuted this issue on two fronts.\n 1) This IS NOT ABOUT ALTRUISM.\n altruism is \"the quality of unselfish concern for the welfare of others \"\n There is no \"concern for others\" in what I am talking about!\n Homosexuals are attracted to the SAME gender, so there is no accidental procreation. Homosexuals still receive the BENEFITS from being in a couple and psychological benefits from sexual interaction. They still have a drive to procreate and raise children.\n The absence of ACCIDENTAL procreation has NOTHING TO DO with altruism.\n \n If you couldn't get that, then it is actually me who would be needing to explain things to YOU cause you obviously didn't get it. emoticon_rolleyes\n \n 2) The quote said \"is unlikely to develop\".\n That says NOTHING about ACTUAL development of such evolutionary beneficial aspects.\n \n \n Sigma, you may be quitting the conversation, but it ain't because I didn't understand anything you said. The way you fixate EXCLUSIVELY on individual organism procreation, pretending evolution is JUST about that and ignoring the SPECIES procreation advantages, demonstrates you do NOT know what evolution is really about.", 
   {}, 
   357050, 
   null, 
   1244660340.0
  ], 
  [
   357052, 
   null, 
   "foundit66", 
   "Evolution and Homosexuality...\n \n Regarding female fecundity, I don't think you realize how well homosexuality actually COMPLIMENTS the phenomenon...\n Another possibility is that homosexuality evolves and persists because it benefits groups or relatives, rather than individuals. In bonobos, homosexual behaviour might have benefits at a group level by promoting social cohesion. One study in Samoa found gay men devote more time to their nieces and nephews, suggesting it might be an example of kin selection (promoting your own genes in the bodies of others).Evolution myths: Natural selection cannot explain homosexuality - life - 16 April 2008 - New Scientist\n \n Another article demonstrating the POPULATION examination, instead of fixating JUST on individual organisms.\n The common argument goes like this: if evolution is true, then only those individuals who are able to reproduce will contribute offspring to the next generation. Thus, individuals who are homosexuals will not be able to reproduce, their genes will not be passed on to the next generation, and so if there is some genetic or biological reason for homosexuality, evolution should have removed it a long time ago.\n \n First of all, is homosexuality a specifically human behavior? If it is a fundamentally biological behavior, there should be some other species which share it. And, in fact, there are close to 500 known species which are known to engage in homosexual behavior, including elephants, dolphins, sheep, bears, deer, rats, cats, dogs, cows, rabbits, kangaroos, squirrels, whales, bats, pigs, mice, goats, as well as just about every other primate. And that's just the mammals! There are many more birds, fish, reptiles, and even insects which have also engaged in homosexual behavior.\n \n So it really doesn't seem as if homosexuality is really all that uncommon. But so what? Why should homosexuality be a trait found in so many organisms if it's so fatal to the evolution of the species.\n \n Well, the answer is, as with most things I discuss here, that sex really isn't black and white. And homosexuality isn't fatal to the evolution of species. Remember the definition I gave for evolution way back in the first podcast- \"change in allele frequency in a given population over time.\" There's a reason why I specified \"population,\" and not \"individual.\" Individual organisms don't \"evolve\" any more than a single pixel makes up a picture on your computer screen. What is necessary for evolution to take place is for there to be a group of individuals, a population, within which genes can change and flow.Evolution myths: Natural selection cannot explain homosexuality - life - 16 April 2008 - New Scientist\n \n Above it all Sigma, the approach you take on the issue is backwards.\n You CANNOT look at a situation, insist on applying RIGID AND INFLEXIBLE analyses to the situation, and then refusing to recognize what is going on just because you have DEFINED things a certain way.\n Evolution is inevitably NOT a study in how things \"should be\".\n It is a study in how things SURVIVE generations upon generations of life.\n \n The fact that homosexuality DOES SURVIVE generations upon generations of life, even amongst NUMEROUS SPECIES across the animal kingdom, should make you stop fixating a narrow gaze on \"organisms\" to question WHAT IS REALLY GOING ON HERE...\n \n You are trying to use evolution to EXCLUDE a real analysis on the issue of homosexuality, trying to judge it based on a narrow view.\n But the REAL evolutionist would look at the issue and ask WHAT IS GOING ON whereby this trait is surviving so easily? What mechanism is occurring which brings about the maintenance of this trait?\n THAT is how evolution REALLY works.", 
   {
    "unicode_changes_made": true
   }, 
   357051, 
   null, 
   1244661060.0
  ], 
  [
   357054, 
   null, 
   "Sigma", 
   "Anthony321, do you know how to use the quote / unquote features? It would make it easier to respond to each of your points.\n \n \nAnthony321:\n Heterosexual relationships from day one have been producing homosexual children. Whatever problem it is you have with homosexuals you need to take it up with the heterosexuals who keep giving birth to them\n\n \n I'm not sure exactly what your point is with this. Could you clarify?\n \n \nAnthony321:\n Well the first children were created from dust and a rib bone and that certainly is not a natural way to create children as we all know. So you can scrap the time machine because children have already been created in unnatural ways, it says so right in the Bible.\n\n \n I'm not religious and I don't believe in the bible.\n \n \n\n Anthony321:\n It does not require a relationship at all. It requires sexual intercourse, which you may or may not know does not need a relationship to transpire.\n\n \n It requires sexual intercourse, certainly, but I believe you're wrong that it does not require a relationship (technically speaking you would be right but practically speaking it is not so).\n \n The logic of their relationship is rooted in the most fundamental difference between the sexes: not their chromosomes and not their plumbing, but their parental involvement in potential offspring. In mammals, the minimal parental investments of the male and female differ dramatically. A male can get away with a few minutes of copulation and a tablespoon of semen, but the female carries an offspring for months inside her body and nourishes it before and after it is born. As they say: on the breakfast table, the chicken is involved but the pig is committed.\n \n While many dreamed of sex that is anonymous, casual and free from guilt, this type of sex is, in the words of Isadora Wing, \"rarer than the unicorn\". The psychologist Elizabeth Paul researched the phenomenom and concluded: \"Casual sex is not casual. Very few people are coming out unscathed.\" The reason for this is as deep as anything in biology. Every time a woman has sex with a man (when our instincts and mental faculties evolved), she is committing a chunk of her finite reproductive output to the genes and intentions of that man, forgoing the opportunity to use it with some other man who may have better endowments of either or both. The man, for his part, has parental involvement that is greater than zero and may beither be implicitly committing his sweat and toil to the incipient child or deceiving his partner about such intentions.\n \n Of course, as I told foundit66, the volatility of sex is a paradox in our era of contraception and women's rights. We are still tormented by the Darwinian economics of babies we are no longer having.\n \n The point of my little speech is this: The position that sexual intercourse occured without heterosexual attraction to fuel it and a heterosexual relationship to support it would be difficult to defend.", 
   {}, 
   357047, 
   null, 
   1244661540.0
  ], 
  [
   357059, 
   null, 
   "Sigma", 
   "Anthony321:\n It will also be the reason that we cease to exist a species. You need to be careful when you use procreation as an arguement for your beliefs, it's a sword that cuts both ways.\n\n \n I'm not sure what you mean by this. Could you clarify?", 
   {}, 
   357048, 
   null, 
   1244663400.0
  ], 
  [
   357060, 
   null, 
   "Sigma", 
   "Evolution and Homosexuality...\n \n Regarding female fecundity, I don't think you realize how well homosexuality actually COMPLIMENTS the phenomenon...\n Another possibility is that homosexuality evolves and persists because it benefits groups or relatives, rather than individuals. In bonobos, homosexual behaviour might have benefits at a group level by promoting social cohesion. One study in Samoa found gay men devote more time to their nieces and nephews, suggesting it might be an example of kin selection (promoting your own genes in the bodies of others).Evolution myths: Natural selection cannot explain homosexuality - life - 16 April 2008 - New Scientist\n \n Another article demonstrating the POPULATION examination, instead of fixating JUST on individual organisms.\n\n \n Aye, and that conflicts with modern evolutionary theory.\n \n From your own source: Even if homosexuality does reduce reproductive success, as most people assume, there are plenty of possible reasons why it is so common. For instance, gene variants that cause homosexual behaviour might have other, beneficial effects such as boosting fertility in women, as one recent study suggests, just as the gene variant for sickle-cell anaemia is maintained because it reduces the severity of malaria\n \n A negative adaptation that exists because it is linked with other, positive adaptations. Thanks for playing ;)", 
   {}, 
   357052, 
   null, 
   1244663640.0
  ], 
  [
   357068, 
   null, 
   "Anthony321", 
   "Anthony321, do you know how to use the quote / unquote features? It would make it easier to respond to each of your points.\n I'm not sure exactly what your point is with this. Could you clarify?\n \n \n Anthony321:\n You have made the point of how heterosexuality insures survival of the species. No arguement from me on that one. That being said, it is quite obvious that homosexuals are spawned from heterosexuals. They are not a seperate species, and they are not inferior in any way shape or form to heterosexuals. If you want to see them as a problem or an aberration, there is obviously a problem or an aberration that accompanies procreation.\n \n \n \n Sigma:\n I'm not religious and I don't believe in the bible.\n \n \n Anthony321:\n Niether do I, it was a joke.\n \n \n Sigma:\n It requires sexual intercourse, certainly, but I believe you're wrong that it does not require a relationship (technically speaking you would be right but practically speaking it is not so).\n \n \n \n Anthony321:\n Are we talking about procreation as in having babies? Or are we talking about having children and parenting?\n \n \n Sigma:\n The logic of their relationship is rooted in the most fundamental difference between the sexes: not their chromosomes and not their plumbing, but their parental involvement in potential offspring. \n \n \n \n Anthony321:\n I understand all of that, but how often has that \"involvement\" happenned since the world began? And how often does it happen now? And if you are talking about actual parenting gay people do not lack in that department. What children need is a responsible adult or adults in their lives who they can trust and rely upon while they are growing. They do not need Ozzie and Harriet to become well adjusted adults.\n \n \n \n \n Sigma:\n In mammals, the minimal parental investments of the male and female differ dramatically. A male can get away with a few minutes of copulation and a tablespoon of semen, but the female carries an offspring for months inside her body and nourishes it before and after it is born. As they say: on the breakfast table, the chicken is involved but the pig is committed.\n \n While many dreamed of sex that is anonymous, casual and free from guilt, this type of sex is, in the words of Isadora Wing, \"rarer than the unicorn\". The psychologist Elizabeth Paul researched the phenomenom and concluded: \"Casual sex is not casual. Very few people are coming out unscathed.\" The reason for this is as deep as anything in biology. Every time a woman has sex with a man (when our instincts and mental faculties evolved), she is committing a chunk of her finite reproductive output to the genes and intentions of that man, forgoing the opportunity to use it with some other man who may have better endowments of either or both. The man, for his part, has parental involvement that is greater than zero and may beither be implicitly committing his sweat and toil to the incipient child or deceiving his partner about such intentions.\n \n Of course, as I told foundit66, the volatility of sex is a paradox in our era of contraception and women's rights. We are still tormented by the Darwinian economics of babies we are no longer having.\n \n The point of my little speech is this: The position that sexual intercourse occured without heterosexual attraction to fuel it and a heterosexual relationship to support it would be difficult to defend.\n\n \n \n \n Anthony321:\n I understand that heterosexual attraction is of utmost importance in regards to heterosexual activity. What I don't understand is how homosexuality has anything to do with that. I have never looked at heterosexuals as a group that needs to be regulated or categorized or demonized for that matter. They are just people. In my opinion most gay people do not take issue with straight people based solely on their sexuality because (like I said before) we are raised by them. We see them as people because that is what they are. The fact that they are attracted to the opposite sex is irrelevant for two reasons,,,,,,,,,,,,1) Because it is really none of my business,,,,,,,2) Because is absolutely none of my business. 3) And if one day I decide to make it my business I would hope that somebody close to me (gay or straight) would remind me that it is none of my business.", 
   {}, 
   357054, 
   null, 
   1244666040.0
  ], 
  [
   357071, 
   null, 
   "Anthony321", 
   "I'm not sure what you mean by this. Could you clarify?\n\n \n \n \n Anthony321:\n Yes procreation keeps the species going, but procreation continuing at the level it is now will have us wiped out as a species in the not too distant future.", 
   {}, 
   357059, 
   null, 
   1244666280.0
  ], 
  [
   357073, 
   null, 
   "foundit66", 
   "Aye, and that conflicts with modern evolutionary theory.\n From your own source: Even if homosexuality does reduce reproductive success, as most people assume, there are plenty of possible reasons why it is so common. For instance, gene variants that cause homosexual behaviour might have other, beneficial effects such as boosting fertility in women, as one recent study suggests, just as the gene variant for sickle-cell anaemia is maintained because it reduces the severity of malaria\n A negative adaptation that exists because it is linked with other, positive adaptations. Thanks for playing ;)\n\n \n emoticon_rolleyes\n What's truly funny is that you seem to be caught up in the word \"negative\" in the phrase \"negative adaptation\", refusing to recognize what is really going on here.\n \n That, and you refuse to LISTEN to what the article is actually saying...\n \n I guess the real starting point for you (and I know you don't want to start emoticon_rolleyes ) is to ask \"If 'boosting fertility in women' is an obvious good, then WHY has the evolutionary REALITY of that coupled itself SUCCESSFULLY with homosexuality?\"\n \n Obviously, by YOUR approach of disregarding homosexuality and fixating myopically on procreation, having procreation fertility boosted WITHOUT homosexuality would be evolutionary advantageous to boosting procreation fertility with homosexuality.\n After all, the first (fertility without homosexuality) would result in MORE kids.\n But the reality is that the LATTER is the prominent feature...\n \n Now MY explanation provides a BASIS for explaining such a phenomenon and how it is ADVANTAGEOUS OVER the fertility boost without homosexuality.\n BETTER cared for children are evolutionary advantaged over 'welfare' willy-nilly boosted procreation. And you have failed to contest the repeated observation that homosexuality DOES PROVIDE BETTER CARE for excessive procreation.\n \n I think ultimately, you simply want to label homosexuality as a negative adaptation, to attach the word \"negative\" to it, FAILING TO RECOGNIZE that homosexuality is actually providing an ADVANTAGE over a system that does not have homosexuality in it.\n \n Suppose you have a pipe for fluid flow.\n An engineer wants to build a better pipe which will produce more flow for a higher demand, but recognizes the risk in such a system with excessive pressure damaging the pipe.\n He includes a automatic relief into the system which diverts water in case of excessive pressure.\n Along comes Sigma declaring the automatic relief design as a \"negative adaptation\", FAILING TO RECOGNIZE that the system design WITH the relief is SUPERIOR to one without it.\n But Sigma likes calling it a \"negative\" adaptation... emoticon_rolleyes\n \n \n \nAye, and that conflicts with modern evolutionary theory.\n\n It's hilarious how you claim this, and then try to use an article which DISPROVES your claim as evidence for something else... :xbanghead", 
   {}, 
   357060, 
   null, 
   1244668080.0
  ], 
  [
   357074, 
   null, 
   "Sigma", 
   "Anthony321:\n You have made the point of how heterosexuality insures survival of the species. No arguement from me on that one. That being said, it is quite obvious that homosexuals are spawned from heterosexuals. They are not a seperate species, and they are not inferior in any way shape or form to heterosexuals. If you want to see them as a problem or an aberration, there is obviously a problem or an aberration that accompanies procreation.\n\n \n Anthony321, again, I can tell you how to use the quote feature if you're unfamiliar with it. I don't really intend to parsing all your posts for you :P\n \n Your point here does not really follow. I can have a problem with pychopaths without having a problem with the reproduction that spawns them. Or seek to cure genetic defects instead of accepting them out of respect for procreation.\n \n \nAnthony321:\n Are we talking about procreation as in having babies? Or are we talking about having children and parenting?\n\n \n They are intrinsically linked in our evolution. Is there any reason to separate them for the purposes of this discussion?\n \n \nAnthony321:\n I understand all of that, but how often has that \"involvement\" happenned since the world began? And how often does it happen now? And if you are talking about actual parenting gay people do not lack in that department. What children need is a responsible adult or adults in their lives who they can trust and rely upon while they are growing. They do not need Ozzie and Harriet to become well adjusted adults.\n\n \n Whether or not gay couples can raise well-adjusted children is not relevent to the discussion as far as I can see. Hunter-gatherer societies (where our evolution would take place) would see natural parents raising children they created in the vast majority of cases.\n \n \nAnthony321:\n I understand that heterosexual attraction is of utmost importance in regards to heterosexual activity. What I don't understand is how homosexuality has anything to do with that.\n\n \n That's sort of the point. Homosexuality, itself, has little to nothing to do with our evolution as a species while heterosexuality is central to our existance as a species.\n \n \nAnthony321:\n Yes procreation keeps the species going, but procreation continuing at the level it is now will have us wiped out as a species in the not too distant future.\n\n \n That's a social concern, not a concern of evolutionary psychology. Whether or not we curb our population growth is beyond the scope of my argument.", 
   {}, 
   357068, 
   null, 
   1244669640.0
  ], 
  [
   357075, 
   null, 
   "Sigma", 
   "\n I guess the real starting point for you (and I know you don't want to start emoticon_rolleyes ) is to ask \"If 'boosting fertility in women' is an obvious good, then WHY has the evolutionary REALITY of that coupled itself SUCCESSFULLY with homosexuality?\"\n \n Obviously, by YOUR approach of disregarding homosexuality and fixating myopically on procreation, having procreation fertility boosted WITHOUT homosexuality would be evolutionary advantageous to boosting procreation fertility with homosexuality.\n After all, the first (fertility without homosexuality) would result in MORE kids.\n But the reality is that the LATTER is the prominent feature...\n \n\n \n Ooo finally! You're beginning to sound half-way intelligent :) Those sort of questions are exactly what we should be discussing, not your pendantic misunderstandings of what I say.\n \n To answer your question: Evolution is not intelligent design. The same question could be: why is the gene variant for sickle-cell anaemia linked to the reduction of the severity of malaria? One is certainly harmful and the other helpful. For that matter, why do we use the same tube for eating as breathing? It's a very accident prone type of adaptation that certainly kills. It's idiotic, really. But that doesn't matter because evolution is not intelligent. It just has to work.\n \n If it were intelligent then homosexuality would likely not exist since, as you pointed out, it would be even more advantageous to have the increased fecundity without the negative of homosexuality.", 
   {}, 
   357073, 
   null, 
   1244670000.0
  ], 
  [
   357076, 
   null, 
   "foundit66", 
   "Ooo finally! You're beginning to sound half-way intelligent :) Those sort of questions are exactly what we should be discussing, not your pendantic misunderstandings of what I say.\n\n You seriously misunderstand (or misrepresent) recognizing glaring flaws in your arguments as me not understanding...\n It's not.\n I understand what you're saying. It's just wrong.\n \n \n \nI guess the real starting point for you (and I know you don't want to start ) is to ask \"If 'boosting fertility in women' is an obvious good, then WHY has the evolutionary REALITY of that coupled itself SUCCESSFULLY with homosexuality?\"\n\n \nTo answer your question: Evolution is not intelligent design.\n\n See. THIS is part of the problem.\n WHAT QUESTION do you think you are answering?\n I said NOTHING about \"intelligent design\". There is nothing about \"intelligent design\" in my question.\n You are obfuscating the issue, ignoring (or misunderstanding) the point of the question, and failing to address what is going on. emoticon_frazzled\n \n \n \nThe same question could be: why is the gene variant for sickle-cell anaemia linked to the reduction of the severity of malaria? One is certainly harmful and the other helpful. For that matter, why do we use the same tube for eating as breathing? It's a very accident prone type of adaptation that certainly kills. It's idiotic, really. But that doesn't matter because evolution is not intelligent. It just has to work.\n\n Yeah.\n REALLY not answering ANY part of my question.\n \n \n \nIf it were intelligent then homosexuality would likely not exist since, as you pointed out, it would be even more advantageous to have the increased fecundity without the negative of homosexuality.\n\n And thus, you haven't answered anything.\n \n And you have failed to answer the comments that WERE in my post REFUTING your allegation of \"If it were intelligent then homosexuality would likely not exist ...\"\n \n I give an example of how somebody COULD DESIGN something that would be ADVANTAGEOUS, but then you evidently mistook that for me saying it was intelligent design??? emoticon_frazzled\n The point of the analogy was NOT that it \"was designed\", but rather that one system was ADVANTAGEOUS over the other.\n The system which included a mechanism to DIVERT water flow would be better than the one WITHOUT it, even though by your (lack of) logic, you would think it would be less advantaged. emoticon_frazzled\n The point is that you can't recognize what is better... emoticon_cool\n \n If you want to answer my question, please do so.\n Cause you didn't...\n \"If 'boosting fertility in women' is an obvious good, then WHY has the evolutionary REALITY of that coupled itself SUCCESSFULLY with homosexuality?\"\n \n \n \nWhether or not gay couples can raise well-adjusted children is not relevent to the discussion as far as I can see.\n\n Straights can procreate and raise kids, and that's supposedly relevant to elevating heterosexuality.\n Gays procreate and raise kids as well, and now that's supposedly irrelevant??? emoticon_frazzled\n The only consistency here is that you ignore or disregard anything that's inconvenient or contradictory to your attempted position.\n \n \n \nThat's a social concern, not a concern of evolutionary psychology. Whether or not we curb our population growth is beyond the scope of my argument.\n\n And again, you disregard an obvious recognition of a SUPERIOR system.\n A system that is advantaged in caring for MORE children, while at the same time also creating HIGHER FERTILITY is advantageous.\n In the human body, we recognize that the hand does not have to be the foot.\n We recognize that the stomach does not have to be the heart.\n The system works BETTER with the different components fulfilling DIFFERENT functions.\n But in a SPECIES system, you would presume that everybody cranking out over-populated procreation is somehow superior??? emoticon_frazzled", 
   {}, 
   357075, 
   null, 
   1244671740.0
  ], 
  [
   357079, 
   null, 
   "Sigma", 
   "\n See. THIS is part of the problem.\n WHAT QUESTION do you think you are answering?\n I said NOTHING about \"intelligent design\". There is nothing about \"intelligent design\" in my question.\n You are obfuscating the issue, ignoring (or misunderstanding) the point of the question, and failing to address what is going on. emoticon_frazzled\n\n \n Oh foundit66 you're so adorable ;)\n \n You appear to be asking the reason behind a decision, which implies a decision maker. If this is not the case please reword your question; otherwise I am indeed answering your question. What was the intention behind making the system made this way? The answer is that there was no intention.\n \n There is no intelligence behind it, otherwise homosexuality would indeed not be linked with increased fertility in females. Perhaps a mutation will occur that will \"de-link\" those two traits in the future of our species and homosexuality will breed itself out of the population. \n \n :)", 
   {}, 
   357076, 
   null, 
   1244672580.0
  ], 
  [
   357081, 
   null, 
   "foundit66", 
   "Oh foundit66 you're so adorable ;)\n\n And you're funny how you complain about my attitude, while showing one yourself... emoticon_ic\n \n \n \nYou appear to be ...\n\n I have to stop you right there.\n What you claim I am \"appearing to be\"?\n I AM NOT DOING THAT.\n \n So how about you address what I AM doing instead of obfuscating the issue into what you want to CLAIM I \"appear to be\" doing...\n \n \n \nYou appear to be asking the reason behind a decision, which implies a decision maker.\n\n NO!\n Nothing in my question dictates a \"decision\" or \"decision maker\".\n emoticon_frazzled\n \n If we were to be watching an apple tree, and somebody saw an apple fall (observed phenomenon), one could reasonably ask \"Why did that apple fall?\"\n We could answer that question by talking about gravity.\n \n If we were to be watching a bird and somebody says \"How does that bird travel through the air? I made some home-made wings and I can't fly?\", we could answer those questions by talking about aerodynamics and the weight of the bird as compared to his wingspan.\n \n NONE of that presumes a \"decision maker\".\n Furthermore, since my question was obviously within the evolutionary context, AND VERY RELATED to direct questions posed to evolutionary scientists WHICH I HAVE POSTED, it should seem obvious that this is NOT ABOUT a \"decision maker\"...\n \n \n \nIf this is not the case please reword your question; otherwise I am indeed answering your question. What was the intention behind making the system made this way? The answer is that there was no intention.\n\n Your assessment is as flawed as most of your responses.\n My question makes NO mention of any \"intention\".\n It makes NO implication of anybody \"making the system\" a certain way.\n \n \"If 'boosting fertility in women' is an obvious good, then WHY has the evolutionary REALITY of that coupled itself SUCCESSFULLY with homosexuality?\"\n \n It's a question comparing TWO SYSTEMS and why one has developed evolutionary-wise OVER another one.\n That much should have been transparent by my follow-on discussion...\n \n Obviously, by YOUR approach of disregarding homosexuality and fixating myopically on procreation, having procreation fertility boosted WITHOUT homosexuality would be evolutionary advantageous to boosting procreation fertility with homosexuality.\n After all, the first (fertility without homosexuality) would result in MORE kids.\n But the reality is that the LATTER is the prominent feature...\n \n Now MY explanation provides a BASIS for explaining such a phenomenon and how it is ADVANTAGEOUS OVER the fertility boost without homosexuality.\n BETTER cared for children are evolutionary advantaged over 'welfare' willy-nilly boosted procreation. And you have failed to contest the repeated observation that homosexuality DOES PROVIDE BETTER CARE for excessive procreation.\n \n I have provided an explanation why EVOLUTION would favor homosexuality coupled with higher procreation OVER an absence of homosexuality.\n You reject my explanation for arbitrary and self-created nonsense claims.\n I am asking you for YOUR explanation (since my explanation is supposedly invalid) as to why the CURRENT REALITY has come to pass.\n \n \n \nThere is no intelligence behind it, otherwise homosexuality would indeed not be linked with increased fertility in females. Perhaps a mutation will occur that will \"de-link\" those two traits in the future of our species and homosexuality will breed itself out of the population.\n\n Wishful thinking on your part that REAL LIFE NATURAL EVOLUTION OBSERVATIONS will simply go away...\n You claim \"no intelligence behind it\", when I have explained WHY increased fertility WITH homosexuality is ACTUALLY ADVANTAGEOUS OVER increased fertility with no homosexuality. \n \n You are misrepresenting and ignoring galore!\n And on another level, I find it hilarious how you just casually disregard OBSERVED EVOLUTIONARY PERSISTENCE with homosexuality (in humans and across many animal species) as being \"not intelligent\".\n That is NOT how \"evolution\" actually operates.\n Evolution looks at REAL situations, and looks for explanations of NATURALLY development.\n You just look at it, say \"it's unlikely to develop\" like that and ignore reasons for why it HAS developed like that...\n \n To re-use the previous analogy...\n If we were to be watching an apple tree, and somebody saw an apple fall UPWARDS (observed phenomenon), one could reasonably ask \"Why did that apple go up?\"\n You would look at it and say \"evolution should want it to go down, and maybe it will someday\" while providing no intelligible explanation for why the observed phenomenon ACTUALLY HAPPENED.", 
   {}, 
   357079, 
   null, 
   1244673960.0
  ], 
  [
   357085, 
   null, 
   "Sigma", 
   "And you're funny how you complain about my attitude, while showing one yourself... emoticon_ic\n\n \n Oh, does that mean you're going to drop your attitude? That would be fine with me :)\n \n \nI have to stop you right there.\n What you claim I am \"appearing to be\"?\n\n \n You appear to be asking the reason why evolution has done something. Perhaps if you reword the question I'll understand what you're asking me :)\n \n You're posts are much longer than they really need to be, foundit66 :P\n \n \nYou claim \"no intelligence behind it\", when I have explained WHY increased fertility WITH homosexuality is ACTUALLY ADVANTAGEOUS OVER increased fertility with no homosexuality.\n\n \n Your \"group evolution\" theory sits among others, and it runs counter to the modern theory of evolution. Increased fertility linked with homosexuality is not advantageous to the same scenario with no homosexuality :P", 
   {}, 
   357081, 
   null, 
   1244674500.0
  ], 
  [
   357098, 
   null, 
   "foundit66", 
   "Oh, does that mean you're going to drop your attitude? That would be fine with me :)\n\n emoticon_wow\n Are you going to deny the fact that you have been complaining about \"attitude\", while exhibiting it?\n \n Cause I don't mind \"attitude\".\n It's the hypocrisy that stinks.\n \n \n \nYou appear to be asking the reason why evolution has done something. Perhaps if you reword the question I'll understand what you're asking me\n\n Why do I feel like you're behaving like that little Microsoft Word paper-clip?\n \n \"It appears you are < insert thing you are not really working on here <\"\n \n \n \nYou're posts are much longer than they really need to be, foundit66\n\n You know what's really funny about this claim?\n The posts GET LONGER AS I HAVE TO EXPLAIN THE OBVIOUS to you about what I meant.\n If you would stop trying to misrepresent (or misunderstanding) what I am CLEARLY saying, I wouldn't have to place my question followed by a dozen sentences explaining what I just clearly said.\n \n At this stage, you can either answer the question, or you can't.\n I'm not going to waste more time and space explaining the question I have already clearly phrased, just so you can either ignore it some more or misrepresent it some more.\n \n Even if you refuse to recognize what I said, others won't be easily duped by you...\n \n \n \nYour \"group evolution\" theory sits among others, and it runs counter to the modern theory of evolution. Increased fertility linked with homosexuality is not advantageous to the same scenario with no homosexuality :P\n\n And there you go again.\n You refuse to address the issue, and then you repeat yourself.\n \n I have pointed out an article WHICH CLEARLY ACKNOWLEDGES THE EXISTENCE of species evolution with regards to characteristics which enhance species survival.\n You ignore it and proclaim it's \"counter to the modern theory of evolution\".\n I quote \"New Scientist\" article from LAST YEAR on the evolution of homosexuality, and you IGNORE the fact that \"the modern theory of evolution\" CLEARLY DOES have people incorporating homosexuality into the issue.\n \n I explain how \"increased fertility linked with homosexuality\" IS advantageous over inreased fertility without homosexuality, and YOU IGNORE it and keep repeating yourself.\n You're a skipping record who can't address an issue.\n \n \n Even wikipedia can refute your record-skipping nonsense!Two major mechanisms determine which variants will become more common or rare in a population. One is natural selection, a process that causes helpful traits (those that increase the chance of survival and reproduction) to become more common in a population and causes harmful traits to become more rare.Evolution - Wikipedia, the free encyclopedia\n \n Note. It talks about chance of SURVIVAL and reproduction.\n You keep insisting that it is JUST about reproduction, ignoring survival.\n Homosexuality ENHANCES survival, while MAINTAINING reproductive edge.\n \n Some more stuff for you to ignore...\n Clearly, if homosexuality appears simply as a result of expanding courtship behaviors, then the fitness aspect is moot - the fitness gains of courtship for the population far outweigh the loss of a small percentage of individuals from the breeding pool. So, for the sake of argument, let's assume that homosexuality is an independent trait, and examine it evolutionarily. As demonstrated above, homosexuality exists throughout the animal kingdom, so it must have either a positive or neutral effect on fitness.Re: evolution of homosexuality and why does it persist?\n This is one of the points I have been trying to drive home.\n You keep looking at evolution, insisting that under YOUR UNDERSTANDING of evolution homosexuality does not fit.\n But the reality is that you are looking at it BACKWARDS.\n A real scientific approach EXAMINES THE PHENOMENON, and then recognizes aspects of the phenomenon. It doesn't just dismiss the phenomenon as \"non-applicable\" cause it can't explain it... :xbanghead\n \n A gene that is deleterious (in the sense of reducing reproductive success) in large doses may be beneficial in small doses. A classic example is the gene for sickle cell anemia, which in large doses (i.e., in a person with two copies of the gene) produces a debilitating disease, but in small doses (i.e., in a person with a single copy of the gene) produces a heightened resistance to malaria. For any numerical values you care to pick for (a) the benefit of a little extra malaria resistance, and (b) the penalty for having the debilitating disease, you can compute an equilibrium frequency for the sickle-cell gene, below which the gene will, on the average, benefit the organisms bearing it more than it hinders them.\n \n Similarly, there is evidence that a single dose of the cystic fibrosis gene, which produces disease in a double dose, may increase resistance to cholera. (more on this) The relevance to the homosexual-gene hypothesis is, of course, that such a gene might, in heterozygotes (people with a single copy), produce behavior that promotes reproductive success. Re: Evolution and homosexuality\n Re: evolution of homosexuality and why does it persist?\n \n You keep trying to look at it from a situation of \"just homosexual relationships, couldn't procreate, and thus not evolutionary productive\".\n By that logic, we should take our vaccines, make them FULL STRENGTH PATHOGENS, and if that were injected, it would have a negative effect.\n Ergo, not beneficial and not feasible.\n But that approach IS ABSURD cause it ignores the VERY REAL ADVANTAGES of the EXISTING system... :xbanghead", 
   {}, 
   357085, 
   null, 
   1244678700.0
  ], 
  [
   357104, 
   null, 
   "Sigma", 
   "emoticon_wow\n Are you going to deny the fact that you have been complaining about \"attitude\", while exhibiting it?\n\n \n I give what I'm given, foundit66. If you see an attitude in me it is because you have a bad attitude :P\n \n \nAt this stage, you can either answer the question, or you can't.\n\n \n Er... maybe if you reword the question I'll understand what you're trying to ask. As it is I answered what you appeared to be asking me.\n \n \nI'm not going to waste more time and space explaining the question I have already clearly phrased, just so you can either ignore it some more or misrepresent it some more. Even if you refuse to recognize what I said, others won't be easily duped by you...\n\n \n Oooh you see right through me ;) I can see I won't fool you with my oh so clever ruse of: \"If you reword the question I might be able to understand what your asking\". Wow, nothing gets by you :P\n \n \nI have pointed out an article WHICH CLEARLY ACKNOWLEDGES THE EXISTENCE of species evolution with regards to characteristics which enhance species survival.\n\n \n Yes, you did. I acknowledge you provided an article that included a theory that has group evolution as a it's premise. However, group evolution is contrary to modern evolutionary theory. \n \n \nI explain how \"increased fertility linked with homosexuality\" IS advantageous over inreased fertility without homosexuality, and YOU IGNORE it and keep repeating yourself.\n\n \n I'm not ignoring it. I'm saying it's wrong. Self-interest is much more consistent with all available data. Group evolution among non-relatives is not. I provided the evidence while you provided an article that provided many competing theories, not just the one you're sticking with :P\n \n \nNote. It talks about chance of SURVIVAL and reproduction. You keep insisting that it is JUST about reproduction, ignoring survival.\n\n \n Survival is important only insofar as it increases the reproduction of your own genetic traits. Survival by itself is meaningless :P\n \n \n Homosexuality ENHANCES survival, while MAINTAINING reproductive edge.\n\n \n It reduces reproductive success of the individual... and survival without reproduction is meaningless in an evolutionary context, foundit66. While they would share some of their genes with relatives, reproductive success is measured by having your own children.\n \n \n So, for the sake of argument, let's assume that homosexuality is an independent trait, and examine it evolutionarily. As demonstrated above, homosexuality exists throughout the animal kingdom, so it must have either a positive or neutral effect on fitness.\n\n \n Obviously if homosexuality, a negative trait, is linked to a bona fide positive effect then it would continue to exist and would not be an independent trait. If homosexuality, as a negative trait, exists on a continuum of sexuality then it would continue to exist. The problem with this quote is that the author is a lazy thinker. \"It exists so it must be positive or neutral\" merely dismisses the issue, it doesn't address it.", 
   {}, 
   357098, 
   null, 
   1244679960.0
  ], 
  [
   357112, 
   null, 
   "foundit66", 
   "I give what I'm given, foundit66. If you see an attitude in me it is because you have a bad attitude :P\n\n Excuses are like noses.\n Everybody has one, and they all smell...\n \n \n \nEr... maybe if you reword the question I'll understand what you're trying to ask. As it is I answered what you appeared to be asking me.\n\n I have already explained the question more than should be necessary...\n ... and then after I spend more time and words to explain, you complain about too many words.\n \n \n \n \nOooh you see right through me ;) I can see I won't fool you with my oh so clever ruse of: \"If you reword the question I might be able to understand what your asking\". Wow, nothing gets by you :P\n\n You still misunderstand.\n I dispute the \"... I might be able to understand ...\" portion.\n \n As such, it is pointless for me to try to explain calculus to somebody who can't grasp trig.\n \n \n \nYes, you did. I acknowledge you provided an article that included a theory that has group evolution as a it's premise. However, group evolution is contrary to modern evolutionary theory. \n\n emoticon_xdonno\n So you keep claiming. Like a broken record.\n WITH ABSOLUTELY NO SUBSTANTIATION of your claim...\n \n The ONLY attempt you have made to try to substantiate ANYTHING in this discussion is when you started discussing people on *altruism* and evolution.\n Except there again, I wasn't talking about altruism so your comments were pointless.\n \n \n \nI'm not ignoring it. I'm saying it's wrong.\n\n Saying \"it's wrong\" without any rational explanation is just as good as \"ignoring it\"....\n \n \n \nSelf-interest is much more consistent with all available data. Group evolution among non-relatives is not. I provided the evidence while you provided an article that provided many competing theories, not just the one you're sticking with :P\n\n You provided no relevant evidence.\n My arguments have NOTHING TO DO with \"self-interest\" vs \"altruism\".\n More strawman on your part.\n \n \n \nSurvival is important only insofar as it increases the reproduction of your own genetic traits. Survival by itself is meaningless\n\n You keep claiming this.\n I keep quoting people proving you are wrong.\n \n Also, you fail to look at this from the angle of the TRUE \"genetic traits\".\n Which is funny, considering you keep talking about it from the \"female fertility\" perspective.\n It's the MOTHER'S genetic traits, more likely to produce homosexuals, which are MORE LIKELY TO SURVIVE in a scenario where some of her offspring concentrate more effort on preserving the family, and less effort on procreating.\n \n Suppose a mother_A has seven kids. Last boy is gay.\n He helps his nieces and nephews (already discussed in one of my articles you didn't understand), furthering THEIR CHANCES TO SURVIVE and pass on mother_A's genetics.\n While the \"Last boy\" has not procreated in this scenario, it is the MOTHER'S GENETICS HE HAS INCREASED the chances of survival.\n :xbanghead\n \n You're still not going to get it, are you.\n You still can't get past the idea that \"last boy\" is not going to have kids in this scenario, IGNORING the fact that it is NOT NECESSARILY HIS SPECIFIC genes which have been furthered by the mother HAVING A GAY SON.\n \n \n \nIt reduces reproductive success of the individual... and survival without reproduction is meaningless in an evolutionary context, foundit66.\n\n A mother pumping out seven welfare babies with poor health care and poor nutrition, as opposed to a lesbian couple picking and choosing and planning their child.\n You really fail to recognize which has the better chance here...\n \n \n \nWhile they would share some of their genes with relatives, reproductive success is measured by having your own children.\n\n Part of the problem in this is that you repeatedly REFUSE to look at this as \"survival of the fittest\", which is ultimately the credo of evolution.\n Part of that problem is that you refuse to recognize that the fittest DO SURVIVE, and when homosexuality survives, you automatically assume it is \"not fit\" and therefore ignore its characteristic effects.\n \n Seriously. You only have about 4 or 5 phrases you repeat through this discussion. OVER and OVER and OVER again.\n And you cannot EXPOUND or SUBSTANTIATE on those claimed statements.\n \n \n \nObviously if homosexuality, a negative trait, is linked to a bona fide positive effect then it would continue to exist and would not be an independent trait. If homosexuality, as a negative trait, exists on a continuum of sexuality then it would continue to exist. The problem with this quote is that the author is a lazy thinker. \"It exists so it must be positive or neutral\" merely dismisses the issue, it doesn't address it.\n\\\n There you go again failing to recognize the REAL argument.\n He was NOT saying \"it exists so...\"\n He said that it exists THROUGHOUT the animal kingdom. In the same article, he notes it has survived through MANY generations in our human history.\n It is homosexualities PREVALENCE and SURVIVABILITY which positively identifies it as either a \"positive or neutral\" trait.\n \n There you go again with the assumptions.\n WHY do you assume homosexuality is \"a negative trait\"?\n I seriously don't think you know what those terms mean in the first place.\n \n We're back to square one where you're looking at the stomach, IGNORING ITS ROLE in the body, declaring that it doesn't reproduce therefore it is not beneficial in an evolutionary status to the body...\n \n Actually, you never left square one.\n I am amused at how you think you are absolutely the right one in this discussion, and no matter how many people have been shown to recognize homosexuality's position in evolution, you just say they're wrong.", 
   {}, 
   357104, 
   null, 
   1244682480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Sexual attraction vs. procreation", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12773-sexual-attraction-vs-procreation.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12773, 
  "discussion_files": [
   [
    "712.html", 
    "http://www.4forums.com/political/gay-rights-debates/12773-sexual-attraction-vs-procreation-print.html"
   ], 
   [
    "713.html", 
    "http://www.4forums.com/political/gay-rights-debates/12773-sexual-attraction-vs-procreation-3-print.html"
   ], 
   [
    "714.html", 
    "http://www.4forums.com/political/gay-rights-debates/12773-sexual-attraction-vs-procreation-2-print.html"
   ]
  ], 
  "identifier": 12773
 }
]