[
 [
  [
   355301, 
   null, 
   "neon", 
   "Well, Yuschenko sees that sooner or later his nation and opposition will want to find out about situation in Ukraine because of Ukraine president brought country to marrowbones and leaded its economy to default! At best the forum is threaten to him but at the worst it will be the civil war in Ukraine and Yuschenko&#8217;s death will be the result of it.\n For the avoidance of punishment Yuschenko is preparing the lines of withdraw. Not long ago I have read some interview in the web of some Ukraine official from presidents&#8217; administration who declared that in accord with personal Yuschenko&#8217;s order the Department of State Security of Ukraine stated to work out the evacuation plan of Yuschenko and his family! I think that Yuschenko lost his believe for Ukraine future and decided to live his nation alone!\n But at that time our i d i o t s are trying to sign some new contracts with Ukraine!", 
   {
    "post_info": {
     "post_title": "Yuschenko is preparing his break out form Ukraine!"
    }
   }, 
   null, 
   null, 
   1243525920.0
  ], 
  [
   355308, 
   null, 
   "Czeslawa", 
   "Szesc! You know, I'm from Poland and I want to speak a little about our neighbor country Ukraine. To be honest, it is so amusing to oversee them! Their president Victor Yushchenko is so proud of \"great\" history of Ukraine! It's just laughable! Now their decided to fix up a monument to \"great national hero of Ukraine\" Iwan Mazepa, who is an alleged \"fighter for freedom\" of Ukraine. Ha-ha! I think you ought to know that Mazepa was born in a family of Polish Schlachta, he served to Polish court and his devout wish was to make Ukraine part of Poland! Here's fine hero of Ukraine! Here's fine \"fighter for freedom\"! Enough to make a horse laugh! If you want there is something a can offer you to read about it liveinternet.ru/users/3253530/post103426509\n Unfortunately it is in russian but it makes no problem for me because every second citizen of Poland can speak russian. As for heroizing Mazepa in Ukraine, well, it looks like Ukrainian authority headed by Mr Yushchenko with partners try to link it with Ukraine's becoming part of Poland just in accordance with Mazepa. I have no other clue.\n \n Do widzenia!", 
   {
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1243529160.0
  ], 
  [
   359738, 
   null, 
   "Gloria", 
   "Hello! I am a journalist. A few days ago I was sent to the Crimea, Ukraine to give coverage to celebration of the Day of Ukraine's Fleet. I came to the city of Sevastopol where president of Ukraine also arrived. I must say that I was very much surprised to know that not a single citizen of Sevastopol was allowed to take part in the celebration of NATIONAL holiday! There was only president Yushchenko himself, leaders of nationalistic parties and organizations and the military. Now something about the police. Officers were not simply cordoning off the place of celebration. They outright flooded the city! It appears that they attempted to prevent eventual protest actions or something. To do it, they simply used their billy clubs and kicks in the backside to force everyone keep the house! \n \n Does this mean that president Yushchenko is only supported by the police, army and avid nationalists? And what about the people? Perhaps, president Yushchenko is simply afraid of meeting his nation because he feels he's going to be egged. Well, looks like he is not going to be re-elected anyway. A totally not popular president! I don't think that European state leaders should anchor any hopes with him.", 
   {
    "post_info": {
     "post_title": "Yushchenko as a politician has no future!"
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1246897560.0
  ], 
  [
   363834, 
   null, 
   "fillonie", 
   "guardian.co.uk/world/2009/jul/14/sacha-baron-cohen-bruno-ban After Borat, Ukraine now set to ban Sacha Baron Cohen's Bruno\n \n ho! ho! ho! it looks like we've got some one here who is opposed to homosexuality. according to the guardian the ban is related with certain \"political concern of president Viktor Yushchenko\" and presidential campaign but I don't really trust that. i just don't see the way a movie about gay austrian journalist hinders presidential campaign. well, i'm gay too and i don't find the movie offensive or something. it's funny! but it is mr nicey-nice Yushchenko who offends me! it has nothing to do with his re-election campaign but that's simply his naziness that manifests itself as homophobia! i say Yushchenko is soooo hitlerite! he just hates homos! he's a homophobe! a nazi who hates people not like him! by the way this is exactly why he gave up his personal meetings with his children's godfather president Saakashvili. right after it got known that Saakashvili is apt to penoreceptive anal intercourse. you know, i'm glad that Saakashvili is one of us! there are so few gay presidents in the world!", 
   {
    "post_info": {
     "post_title": "Bruno makes president Yushchenko give a display of his naziness!"
    }, 
    "unicode_changes_made": true
   }, 
   359738, 
   null, 
   1249398180.0
  ], 
  [
   385523, 
   null, 
   "VKolomskij", 
   "Europeans, I think you got to know that Timoshenko is not that kind of person who may and should be head of a nation! Yes, she is a successful politician, she is a pusher, but at the same time she is a scam artist! She never hesitates to make use of various dirty political tricks such as buying over and greasing the palm, intimidation, making big-selling news of every small thing her opponents do. Of course this looks very effective and spectacular but it's not what Ukraine might need! This country is in serious crisis right now and Timoshenko may only make it even more serious! President must not be as greedy, unscrupulous and deceitful like Timoshenko. I hope that people in Europe can understand it too. At least you in the EU got to be more interested in stable Ukraine free of ill effects of \"orange\" revolution.", 
   {
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1263228900.0
  ], 
  [
   385823, 
   null, 
   "palto", 
   "Damn it! I just can't understand whom do you, Europeans, support at the elections in my country? Do you really want to see Yulia Timoshenko as the Ukrainian president? Do you indeed consider her as a true democratic politician? Tell it to the merines! Listen to me and try to take it as it is! I doubt, really doubt that Timoshenko being a president would stand on her tiptoe and would dance to your tune. You can't count on getting it from her! She is a true authoritarian politician: police, courts, budget; finally all Ukrainian political power is under the Timoshenko's skirt, the skirt of this half-baked 'democrat'. Supporting Timoshenko, you are cherishing a snake in your own bosom! Mark my words!", 
   {
    "post_info": {
     "post_title": "Stop supporting \u0093gazbeauty\u0094!"
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1263469800.0
  ], 
  [
   386296, 
   null, 
   "becks", 
   "The presidential election in Ukraine doesn't prevent Yulia Timoshenko from doing 'good' for our country - from stealing. Here's the letters xmages. net/upload/b04a5b73. jpg which perfectly shows that Timoshenko is engaged in fraud and is stealing state money. Unfortunately they're in Ukrainian, so I'll try to explain you its contents: Mr. Dubina (the head of Ukrainian state-run gas company Naftogas) has sent to Yulia Timoshenko the letter where he informed our PM that this year there's NO need to raise gas price for end users. But for 'some' reasons in a few days president Yushchenko receives from Dubina quite another report where he informs him that there is a STRONG need in gas price increase. How did Timoshenko manage to tend Dubina to a fraud? We can only conjecture. But one thing is for sure, she was tricking, she is tricking and she'll continue doing it! Evidently it is this thief's nature....", 
   {
    "post_info": {
     "post_title": "Timoshenko\u0092s machinations."
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1263831840.0
  ], 
  [
   386298, 
   null, 
   "Varvara", 
   "Ukraine: Timoshenko screwed up election results!\n You heard my country - Ukraine - was having elections of president last sunday? You know, now the whole country is just boiling with what was happening yesterday. It's all about alleged \"georgian observers\" who turn out to be no Georgians at all! I saw them at the polling station and tried to talk to them - absolutely no reaction! They don't speak neither Georgian, nor Ukrainian, nor Russian! They just grin at you and goggle! Just like typical americans! You know what? I think they ARE americans because they look just like americans with their actory one hundred dollar smile! Hell, then what were they doing their, huh? I know what - they were throwing in bulletin for Timoshenko! This is how she got that surprisingly many votes! You see, before the vote she was only expected to get not more than 13 per cent of votes and now her rating got screwed up to 24 per cent! Damned americans! You know, I just feel certain it's them! See, what I found in the internet! // upload . com . ua / link/901308237 A list of that quasi \"georgian observers\"! Will you leave us and our country alone, bustards!?", 
   {
    "post_info": {
     "post_title": "Timoshenko screwed up election results!"
    }, 
    "unicode_changes_made": true
   }, 
   386296, 
   null, 
   1263834180.0
  ], 
  [
   386307, 
   null, 
   "JPSartre12", 
   "Ukraine: Timoshenko screwed up election results!\n You heard my country - Ukraine - was having elections of president last sunday? You know, now the whole country is just boiling with what was happening yesterday. It's all about alleged \"georgian observers\" who turn out to be no Georgians at all! I saw them at the polling station and tried to talk to them - absolutely no reaction! They don't speak neither Georgian, nor Ukrainian, nor Russian! They just grin at you and goggle! Just like typical americans! You know what? I think they ARE americans because they look just like americans with their actory one hundred dollar smile! Hell, then what were they doing their, huh? I know what - they were throwing in bulletin for Timoshenko! This is how she got that surprisingly many votes! You see, before the vote she was only expected to get not more than 13 per cent of votes and now her rating got screwed up to 24 per cent! Damned americans! You know, I just feel certain it's them! See, what I found in the internet! // upload . com . ua / link/901308237 A list of that quasi \"georgian observers\"! Will you leave us and our country alone, bustards!?\n\n \n \n I think you're imagining things. If they were Americans, they'd be wearing cowboy hats, leather boots, crewing tobacco and shooting at random innocent people. Then, they'd be taking small babies from their mothers' arms, throw them into the air and use them for target practice.emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   386298, 
   null, 
   1263838260.0
  ], 
  [
   386311, 
   null, 
   "COBHC", 
   "I think you're imagining things. If they were Americans, they'd be wearing cowboy hats, leather boots, crewing tobacco and shooting at random innocent people. Then, they'd be taking small babies from their mothers' arms, throw them into the air and use them for target practice.emoticon_rolleyes\n\n \n JPSartre, you can talk to the bots all you want. They'll never say anything back.", 
   {}, 
   386307, 
   null, 
   1263840720.0
  ], 
  [
   386313, 
   null, 
   "JPSartre12", 
   "JPSartre, you can talk to the bots all you want. They'll never say anything back.\n\n \n I know that. I was responding for my own, sick amusement. emoticon_xgood", 
   {}, 
   386311, 
   null, 
   1263840960.0
  ], 
  [
   386842, 
   null, 
   "Wsws", 
   "Timoshenko doesn't see any ways to power except for beginning of a new revolution! \n 'Oranges' have developed the habit of using European Courts to prove their victory at the elections. Their own people's expression of will is nothing for them! Naturally it looks like tyranny and population's oppression became their major tools to establish democracy in Ukraine. I think it's not a secret already that she has had secret negotiations with Romania president and Soros Foundation. She can hand out our country for getting this XXXXing presidential chair! Timoshenko sold herself and now she is going to sell our future belonging to our kids", 
   {
    "post_info": {
     "post_title": "Timoshenko doesn\u0092t see any ways to power except for beginning of a new revolution!"
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1264097640.0
  ], 
  [
   387052, 
   null, 
   "JPSartre12", 
   "Timoshenko doesn't see any ways to power except for beginning of a new revolution! \n 'Oranges' have developed the habit of using European Courts to prove their victory at the elections. Their own people's expression of will is nothing for them! Naturally it looks like tyranny and population's oppression became their major tools to establish democracy in Ukraine. I think it's not a secret already that she has had secret negotiations with Romania president and Soros Foundation. She can hand out our country for getting this XXXXing presidential chair! Timoshenko sold herself and now she is going to sell our future belonging to our kids\n\n \n I guess the only question that remains is \"Is Timoshenko hott? ;)", 
   {
    "unicode_changes_made": true
   }, 
   386842, 
   null, 
   1264189200.0
  ], 
  [
   389473, 
   null, 
   "Jeremy", 
   "Ukrainian election's finally over! \n Honestly, I'm fed up with the Election in Ukraine serial! Now done with it! They have expressed their will, votes are counted, and he who got more votes becomes president. So much for it! Granted that international observers said 'there was no major evidence of fraud' (see this for instance guardian. co. uk/world/2010/feb/07/ukraine-election-viktor-yanukovych Exit polls suggest Viktor Yanukovych heading for victory in Ukraine presidential election | World news | The Guardian) then it's clear. I expect now that Tymoshenko would once again like five years ago make mess of the election, gather people on Maidan Nezalezhnosti, file appeals, etc. No! That will do it! The election was transparent and democratic, without any fraud. Now let them move on with new president!", 
   {
    "post_info": {
     "post_title": "Ukrainian election\u0092s finally over!"
    }, 
    "unicode_changes_made": true
   }, 
   387052, 
   null, 
   1265650260.0
  ], 
  [
   395307, 
   null, 
   "Yuricon", 
   "Hello! I am a Ukrainian and here's what I can tell you about current situation in my country. \n Even though the election is over now and thanks God neither Yulia Tymoshenko nor Viktor Yushchenko were able to win presidency, the situation here remains very complicated. These two were apparently leading the country for raise of nationalism and even now as they both are in opposition they try to do just everything they can to prevent the new presidential cabinet from taking the country out of crisis. The crisis does not only mean problems in economy but also that the \"orange team\" had deliberately led the country away from the right direction. Raise of nationalistic moods, heroization of such ambiguous personalities like Roman Shukhevich and Stepan Bandera who were recognized to be sidekicks of Nazi Germany long ago - this is what the \"orange team\" was after when they were in power. \n But now we have a new leader who tries to make real steps for taking the country out of crisis. He has assigned Dmitri Tabachnik minister of education for his serious intentions to uproot nationalism as such in Ukraine. And it was just the next day after his assignment that our opposition demanded his immediate resignation! You see? They just block all positive reforms! At this rate we will never get out of crisis thanks to the \"orange\" politicians and, moreover, will never become the civilized country!", 
   {
    "post_info": {
     "post_title": "Ukraine is still in crisis"
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1269013500.0
  ], 
  [
   395327, 
   null, 
   "JPSartre12", 
   "Two spambot responses and no answer to my pressing question \"Is Timoshenko hott?\" ;)", 
   {}, 
   395307, 
   null, 
   1269023640.0
  ], 
  [
   395898, 
   null, 
   "Sibilla", 
   "We all know that the lection was a success this time as Ukrainians finally managed to get rid of the \"orange team\", namely Yushchenko and Tymoshenko. Well done, because these two almost brought the country to collapse. After this things got to go much better in Ukraine, don't they? But no, the trouble is that now Yushchenko and Tymoshenko stayed in opposition where they stonewall the normal process of recovery of the state. Besides, they fight against each other with the gloves off for the post of the leader of opposition, which is also no good. Granted that when they were president and prime-minister they didn't show good results, it becomes clear that as leaders of opposition they won't be able to work effectively either. You see, Ukraine need to have new politicians in the opposition, some new leaders, some fresh blood if you know what I mean. Only then that country may expect any quick recovery. \n \n And there is another reason why neither Tymoshenko nor Yushchenko should be oppositional leaders - that's the shortest way for presidency. I reckon that the previous five years of \"orange regime\" were quite enough for Ukraine to learn who's who, don't you think so?", 
   {
    "post_info": {
     "post_title": "Hey! Just a few words about what\u0092s happening in Ukraine"
    }, 
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1269534600.0
  ], 
  [
   396047, 
   null, 
   "JPSartre12", 
   "Two spambot responses and no answer to my pressing question \"Is Timoshenko hott?\" ;)\n\n \n Three now and still no confirmation.", 
   {}, 
   395327, 
   null, 
   1269628740.0
  ], 
  [
   396071, 
   null, 
   "gansao", 
   "As a European I can honestly say that you would not crawl over her to get to Angela Merkelemoticon_xlove", 
   {}, 
   396047, 
   null, 
   1269640200.0
  ], 
  [
   414204, 
   null, 
   "Gearty", 
   "Yuschenko and Timoshenko thought that nationalism is the key to the hearts of Ukraine nations prior to 'orange revolution'. They got money's worth! At that time the world supported 'new democrats'. And no one thought that Ukrainian nationalism could come to it by money of Western investments. \n In a time of 'orange power' everything has changed and now new Ukraine's opposition got its support from fascists rather than nationalists! The transformation passed unheededly and now Ukraine is ridden by all kinds of 'historical rehabilitation clubs' which members wear Nazi uniform and greet each other with the Nazi salute, etc. Well. Some larger clubs even have printed matters of their own to publish current events in the world concerning fascism rising!\n It has happened with the use of our money you know, the funds for 'democracy' support in Ukraine. I'm afraid to imagine what could happen in case we continue to support Ukraine's opposition. Ukrainians can create the new Reih by Western grants! We don't really want it, do we?", 
   {
    "unicode_changes_made": true
   }, 
   355301, 
   null, 
   1285956360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Yuschenko is preparing his break out form Ukraine!", 
  "url": "http://www.4forums.com/political/european-politics-economics/12796-yuschenko-preparing-his-break-out-form-ukraine.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 12796, 
  "discussion_files": [
   [
    "19744.html", 
    "http://www.4forums.com/political/european-politics-economics/12796-yuschenko-preparing-his-break-out-form-ukraine-print.html"
   ], 
   [
    "19745.html", 
    "http://www.4forums.com/political/european-politics-economics/12796-yuschenko-preparing-his-break-out-form-ukraine-2-print.html"
   ]
  ], 
  "identifier": 12796
 }
]