[
 [
  [
   23397, 
   null, 
   "Adrenalin30", 
   "What do you think? \n \n I personally think the guy is guilty and needs to be in jail for a long time. He was in trouble for molesting a boy in 1993; now in 2003 he has done it again. My thought is if he did it in 1993 and again now in 2003 he needs to be in jail for at least 20 years, 10 minimal. First time he did this he should have been put in jail; he wasn't, and because of that look at what happened, he did it again.", 
   {
    "post_info": {
     "post_title": "Michael Jackson, Guilty or Inocent?"
    }
   }, 
   null, 
   null, 
   1069404300.0
  ], 
  [
   23437, 
   null, 
   "AMD4EVER", 
   "Let Bubba have his way with him for the next 30 years.", 
   {}, 
   23397, 
   null, 
   1069431060.0
  ], 
  [
   23443, 
   null, 
   "Adrenalin30", 
   "Let Bubba have his way with him for the next 30 years.\n\n \n LOL\n \n Naw I think Michael would like that to much, the man needs to be punished not given a scooby snack.", 
   {}, 
   23437, 
   null, 
   1069437420.0
  ], 
  [
   23456, 
   null, 
   "Charchuk", 
   "http://cagle.slate.msn.com/news/JacksonArrested/main.asp", 
   {}, 
   23397, 
   null, 
   1069448700.0
  ], 
  [
   23463, 
   null, 
   "sundowner", 
   "I think he is innocent for the time being, at least until he has his day in court. As soon as they find him guilty, I will call him guilty. That's the way it works here anyway isn't it? (side note: I hope they strap him to a table and fill him with poison. no more innocent kids will get hurt, and the music world will definately improve) emoticon_xbye", 
   {}, 
   23456, 
   null, 
   1069454700.0
  ], 
  [
   23464, 
   null, 
   "Charchuk", 
   "I think he is innocent for the time being, at least until he has his day in court. As soon as they find him guilty, I will call him guilty. That's the way it works here anyway isn't it? (side note: I hope they strap him to a table and fill him with poison. no more innocent kids will get hurt, and the music world will definately improve) emoticon_xbye\n\n \n \n If this does turn out to be just a case of extortion would you call for the same punishment for the parents who would use their child in this manner? It is no different than child prostitution in my opinion, but than again I also think that when the Jehovah Witnesses use their children, to get in your door, as the same thing as well.", 
   {}, 
   23463, 
   null, 
   1069457100.0
  ], 
  [
   23496, 
   null, 
   "Parcum", 
   "LOL. Change the question in the poll, or edit the title. It's like my uncle- you ask him \"You want me to go left or right?\" and he says \"Yes\". Make the question \"Is Michael Jackson guilty?\"", 
   {}, 
   23464, 
   null, 
   1069465980.0
  ], 
  [
   23499, 
   null, 
   "SilentPoet", 
   "My personal opinion is that he is guilty. He has already admitted that he sleeps with children and he doesn't think there is anything wrong with that. So he probably doesn't think there is anything wrong with molesting them either.\n \n As a side note:\n Something I learned in a recent movie was a police trick to see if someone is telling the truth. For instance when asked a question, (in many cases), if the person is telling the truth their eyes will shift or look to their right that (something to do with the right side of the brain) and if they are making something up their eyes generally tend to vear to the left (something to do with the left side of the brain. Anyways guess which way Michael's eyes kept vearing in when he claimed that he let children sleep with them only if their parents had said it was ok. \n (And what parent tells their child that?)\n Or maybe its the other way around.\n Regardless its just something I found interesting.", 
   {}, 
   23496, 
   null, 
   1069466940.0
  ], 
  [
   23502, 
   null, 
   "Charchuk", 
   "My personal opinion is that he is guilty. He has already admitted that he sleeps with children and he doesn't think there is anything wrong with that. So he probably doesn't think there is anything wrong with molesting them either.\n\n \n There really isn't anything wrong with children sleeping with you. It was a common practice. Just because it is a bed doesn't mean that it is only for having sex in. You know, people actually do sleep in them. \n \n From what I've been hearing is that it is looking more and more like extortion. The story is that the child had cancer and Jackson had invited them to his home for awhile. They staying for around 5 months before Jackson hinted that they should leave, but they stayed on for another month. In the extra time Jackson stopped giving them gifts and the like and they finally got the hint. They just got use to the lifestyle.\n \n Yes, Jackson is a weirdo, and a flake (My mother calls him a vampire), but everyone is innocent until proven guilty even them.\n \n \nAs a side note:\n Something I learned in a recent movie was a police trick to see if someone is telling the truth. For instance when asked a question, (in many cases), if the person is telling the truth their eyes will shift or look to their right that (something to do with the right side of the brain) and if they are making something up their eyes generally tend to vear to the left (something to do with the left side of the brain. Anyways guess which way Michael's eyes kept vearing in when he claimed that he let children sleep with them only if their parents had said it was ok. \n (And what parent tells their child that?)\n Or maybe its the other way around.\n Regardless its just something I found interesting.\n\n \n It is a movie. Hardly anything in them is real. :)", 
   {}, 
   23499, 
   null, 
   1069468680.0
  ], 
  [
   23581, 
   null, 
   "SilentPoet", 
   "Yes, Jackson is a weirdo, and a flake (My mother calls him a vampire), but everyone is innocent until proven guilty even them.\n\n \n In legal terms yes. But as far as my opinion goes, I would say he is guilty.\n \n \nIt is a movie. Hardly anything in them is real. \n \n \n Oh no! emoticon_cry \n \n Family friend Rick James told CNN that he believes authorities were pursuing Jackson \"because he's black, he's rich and he's famous, and they've got nothing else better to do.\" \n (http://www.cnn.com/2003/LAW/11/21/jackson/index.html)\n \n ..Because he's black?\n Yeah I'm sure.", 
   {}, 
   23502, 
   null, 
   1069522140.0
  ], 
  [
   23585, 
   null, 
   "Charchuk", 
   "In legal terms yes. But as far as my opinion goes, I would say he is guilty./quote]\n \n Well, its a good thing that our legal system isn't based on mob rule. :)\n \n \nOh no! emoticon_cry\n\n \n \n Family friend Rick James told CNN that he believes authorities were pursuing Jackson \"because he's black, he's rich and he's famous, and they've got nothing else better to do.\" \n (http://www.cnn.com/2003/LAW/11/21/jackson/index.html)\n \n ..Because he's black?\n Yeah I'm sure.\n\n \n Well, considering some of the cases in the States one would get the impression that it is a little biased towards the persecution of blacks over whites. They also tend to get harsher sentences for the same crimes in certain states as well as getting the death penalty as well over whites.", 
   {}, 
   23581, 
   null, 
   1069522620.0
  ], 
  [
   23606, 
   null, 
   "Crim", 
   "Family friend Rick James told CNN that he believes authorities were pursuing Jackson \"because he's black, he's rich and he's famous, and they've got nothing else better to do.\" \n \n \n Yeah right. The authorities pursued Jackson because he's the one the little kid said molested him.\n \n A more accurate statement would probably be:\n \n \nFamily friend Rick James told CNN that he believes money-hungry families were pursuing Jackson \"because he's rich and he's famous, and they've got nothing else better to do.\" \n", 
   {}, 
   23585, 
   null, 
   1069527240.0
  ], 
  [
   23621, 
   null, 
   "Adrenalin30", 
   "Family friend Rick James told CNN that he believes money-hungry families were pursuing Jackson \"because he's rich and he's famous, and they've got nothing else better to do.\" :\n\n \n I wouldn't doupt that but I still say Michael is guilty, the fact that he paid 20mil to the kid in 1993 to shut up and now it happened again, I mean he does look guilty.", 
   {}, 
   23606, 
   null, 
   1069535220.0
  ], 
  [
   23623, 
   null, 
   "sundowner", 
   "If this does turn out to be just a case of extortion would you call for the same punishment for the parents who would use their child in this manner? It is no different than child prostitution in my opinion, but than again I also think that when the Jehovah Witnesses use their children, to get in your door, as the same thing as well.\n\n \n In that case...if it is shown beyond a doubt that it is extortion, then yes, same punishment for the parents. However, the parents are not on trial here, wacko jacko is on trial. If he was found not guilty, then I would support his right to file suit against the parents for attempted extortion etc... (and just so you know, I hope they strap him to a table and fill him full of poison regardless of the disposition of the case.)\n \n \nThere really isn't anything wrong with children sleeping with you. It was a common practice. Just because it is a bed doesn't mean that it is only for having sex in. You know, people actually do sleep in them. \n \n \n I would have no problem with my child getting into bed with me. I have slept in the same bed as friends (also all adults), simply due to limited space. Where I see a problem is people allowing their children to go to a famous persons house and sleep over for the night (or months as the case may be). For all intents and purposes, he is practically a stranger. That is bad enough, but allowing these children to sleep in the same room is another thing. Then allowing them to get in bed with this freak is another step up the old insanity ladder. Their is a vast difference between my children crawling into my bed and sleeping, and my children going to a strangers house and sleeping in his bed with him. Regardless of the outcome of the trial, I think any parent that would give their child permision to go to a strangers house and sleep with him needs to have their head examined. Perhaps when the trial is over, we should look into the fitness of these people to be parents. I honestly think that some people are so blinded by their fanaticism over wacko jacko that they would place their children in comprimising situations just to satisfy their desires to meet him. It makes me sick. You know, I am a huge fan of Journey, but I am not going to let my children go sleep with Steve Perry.", 
   {}, 
   23464, 
   null, 
   1069536780.0
  ], 
  [
   23626, 
   null, 
   "Charchuk", 
   "I wouldn't doupt that but I still say Michael is guilty, the fact that he paid 20mil to the kid in 1993 to shut up and now it happened again, I mean he does look guilty.\n\n \n There are some who thought him guilty in 93 find the current situation suspisious. They doubt that he may be guilty.\n \n Here I am a non-Christian and I have more compassion than so many Christians claim that they should have. If he is guilty he should be punished, of course, but not torture as some on here are demanding. That's barbaric and no different than the crime itself.", 
   {}, 
   23621, 
   null, 
   1069539660.0
  ], 
  [
   23627, 
   null, 
   "Charchuk", 
   "In that case...if it is shown beyond a doubt that it is extortion, then yes, same punishment for the parents. However, the parents are not on trial here, wacko jacko is on trial. If he was found not guilty, then I would support his right to file suit against the parents for attempted extortion etc... (and just so you know, I hope they strap him to a table and fill him full of poison regardless of the disposition of the case.)\n\n \n I see that in fact you are not interested in justice at all, but in revenge only. That is why we have a justice system, to weed out the revenge. Revenge makes you no better than the criminal. \n \n \nI would have no problem with my child getting into bed with me. I have slept in the same bed as friends (also all adults), simply due to limited space. Where I see a problem is people allowing their children to go to a famous persons house and sleep over for the night (or months as the case may be). For all intents and purposes, he is practically a stranger. That is bad enough, but allowing these children to sleep in the same room is another thing. Then allowing them to get in bed with this freak is another step up the old insanity ladder. Their is a vast difference between my children crawling into my bed and sleeping, and my children going to a strangers house and sleeping in his bed with him. Regardless of the outcome of the trial, I think any parent that would give their child permision to go to a strangers house and sleep with him needs to have their head examined. Perhaps when the trial is over, we should look into the fitness of these people to be parents. I honestly think that some people are so blinded by their fanaticism over wacko jacko that they would place their children in comprimising situations just to satisfy their desires to meet him. It makes me sick. You know, I am a huge fan of Journey, but I am not going to let my children go sleep with Steve Perry.\n\n \n Much of what we see and hear about him is PR, an image. Not true at all. If anything he is a very sad person who is crying out for attention. And there are people who will take advantage of that. This maybe such a case. In the last case in 93 they got their money and then shut up.", 
   {}, 
   23623, 
   null, 
   1069540080.0
  ], 
  [
   23671, 
   null, 
   "SilentPoet", 
   "I saw today on CNN headline news:\n Hundreds of demonstrators held a march in Paris in support of Michael Jackson. I saw a poster that said \"Let him go, he's innocent\". (Or something like that)\n \n Now I'm ok with making jokes about the French. ;)", 
   {}, 
   23627, 
   null, 
   1069565640.0
  ], 
  [
   23672, 
   null, 
   "Adrenalin30", 
   "There are some who thought him guilty in 93 find the current situation suspisious. They doubt that he may be guilty.\n \n Here I am a non-Christian and I have more compassion than so many Christians claim that they should have. If he is guilty he should be punished, of course, but not torture as some on here are demanding. That's barbaric and no different than the crime itself.\n\n \n I have no compassion for people that do that to kids, I mean there kids!\n If he turns out to be innocent then what I thought was wrong, but for now I say he really is guilty.\n \n Question is how much will he spend to get himself out of it this time. I heard he spend 20mil last time.", 
   {}, 
   23626, 
   null, 
   1069566060.0
  ], 
  [
   23699, 
   null, 
   "Charchuk", 
   "I have no compassion for people that do that to kids, I mean there kids!\n\n \n Hate the sin, love the sinner. Isn't that what your god commands you to do?\n \n \nIf he turns out to be innocent then what I thought was wrong, but for now I say he really is guilty.\n\n \n Why, because you think so? Even some who thought he was guilty the last time don't think so this time because the situation is very suspisious now.\n \n \nQuestion is how much will he spend to get himself out of it this time. I heard he spend 20mil last time.\n\n \n Irrelevant. The last case was only in civil court and we all know that you don't have to actually be guilty to be found guilty there. You can be found to be innocent in criminal court and still be found guilty in civil because beyond a reasonable doubt is not a factor in civil court.\n \n It could be that the last time he paid them the extortion to keep it out of court.", 
   {}, 
   23672, 
   null, 
   1069599000.0
  ], 
  [
   23743, 
   null, 
   "sundowner", 
   "Much of what we see and hear about him is PR, an image. Not true at all. If anything he is a very sad person who is crying out for attention. And there are people who will take advantage of that. This maybe such a case. In the last case in 93 they got their money and then shut up.\n \n \n You call letting children sleep with him PR? An image? What sick person is going to want the image that they sleep with small children anyway? He does let children at his ranch. He does let them sleep with him. At the same time, people allow their children to do this. People continued to let their children do this after 93 when he was accused the first time. Now what part of that is untrue. In what way do you think he is crying out for attention? Could you please explain that statement? I think that perhaps his music career is beginning to languish, and he perhaps would like to step back into the spotlight a little, but do you think he would make himself look like a pedophile to do so? I do believe in his right to due process and a fair and expeditious trial. I believe he is guilty, but that is certainly only an opinion. Is that wrong? Does not every sentient being have the right to form an opinion? Isn't it natural to form an opinion?", 
   {}, 
   23627, 
   null, 
   1069619700.0
  ], 
  [
   23748, 
   null, 
   "Charchuk", 
   "You call letting children sleep with him PR? An image? What sick person is going to want the image that they sleep with small children anyway?\n\n \n Maybe because he didn't let it out.\n \n \nHe does let children at his ranch. He does let them sleep with him. At the same time, people allow their children to do this. People continued to let their children do this after 93 when he was accused the first time. Now what part of that is untrue.\n\n \n That wasn't part of his image. \n \n \nIn what way do you think he is crying out for attention? Could you please explain that statement?\n\n \n He never had a normal childhood and this is probably his way of getting one.\n \n \nI think that perhaps his music career is beginning to languish, and he perhaps would like to step back into the spotlight a little, but do you think he would make himself look like a pedophile to do so?\n\n \n His career mostly died in North America long ago. He is still popular in Europe.\n \n \nI do believe in his right to due process and a fair and expeditious trial. I believe he is guilty, but that is certainly only an opinion. Is that wrong? Does not every sentient being have the right to form an opinion? Isn't it natural to form an opinion?\n\n \n Like the old saying goes, \"Opinions are like aholes, everyone's got one...\" :)\n \n What is wrong with your opinion was what you called for his punishment to be. It is one thing to say that you think he is guilty, but it is yet another to call for something which is almost just as bad as what he is accused of. That is the point of justice in a modern society. To mix punishment with mercy and compassion, even if the accused doesn't deserve any, otherwise it is nothing more than revenge and thus loses all moral authority.\n \n An eye for an eye only leaves the world blind.", 
   {}, 
   23743, 
   null, 
   1069620720.0
  ], 
  [
   23767, 
   null, 
   "sundowner", 
   "He never had a normal childhood and this is probably his way of getting one.\n \n \n What is? Having a kids theme park or having kids sleep in his bed if they want to? Being a kind hearted person and opening a theme park for children is a great and noble gesture. Allowing children to not only sleep over at your mansion, but sleep in your room, or even worse your bed, is really no way of reliving a childhood. The hardest part for me to understand is why parents allow their children to do this...but that's another issue. \n \n \nThat wasn't part of his image.\n \n \n Go out and get the \"man-on-the-street\" reaction about wacko and his ranch. Ask people what their image of him is. I will bet you that many more people will be able to tell you that they know children sleep over at his ranch than the people that will be able to tell you the name of his last album. What is an image...the way the majority of people view you. Seems clear to me what his image is. \n \n \nHis career mostly died in North America long ago. He is still popular in Europe.\n \n \n Nobody ever accused the Europeans of having good taste in music. \n \n \nWhat is wrong with your opinion was what you called for his punishment to be. It is one thing to say that you think he is guilty, but it is yet another to call for something which is almost just as bad as what he is accused of. That is the point of justice in a modern society. To mix punishment with mercy and compassion, even if the accused doesn't deserve any, otherwise it is nothing more than revenge and thus loses all moral authority.\n \n \n What do you think the punishment should be for child molestation? Do you think he should get a fine and then be told to go on his way? Should he be allowed to keep his children? I think the penalty should be quite harsh for this kind of behavior. (I do support the death penalty, actually I support the idea of public execution...but again, totally different story). Mixing punishment with mercy and compassion is certainly an idealistic point of view. \n \n \nAn eye for an eye only leaves the world blind.\n \n \n Well, I happen to agree with the middle east philosophy that if you steal, you lose a hand. In that case it certainly is not difficult to spot a thief, and you know who you cannot trust again. I would think this to be a great way to deter crime. In the case of wacko...I wonder what we would have to cut off...hmmmm......", 
   {}, 
   23748, 
   null, 
   1069633920.0
  ], 
  [
   23773, 
   null, 
   "Adrenalin30", 
   "Hate the sin, love the sinner. Isn't that what your god commands you to do?\n \n \n \n Why, because you think so? Even some who thought he was guilty the last time don't think so this time because the situation is very suspisious now.\n \n \n \n Irrelevant. The last case was only in civil court and we all know that you don't have to actually be guilty to be found guilty there. You can be found to be innocent in criminal court and still be found guilty in civil because beyond a reasonable doubt is not a factor in civil court.\n \n It could be that the last time he paid them the extortion to keep it out of court.\n\n \n Hate the sin, Love teh sinner? God commands us to follow the 10 commandments, if your going to sit there and say its OK for Michael Jackson to do what he did to that little boy, then you need to be put in jail! Have you no heart? I mean good grief man!\n \n I only say Michael is guilty because this has happened twice now, rumor had it he gave the boys family in 93 20mil to shut them up. if Michael turns out to be inocent then so be it, He just looks guilty to me as well many others.", 
   {}, 
   23699, 
   null, 
   1069644120.0
  ], 
  [
   23801, 
   null, 
   "Charchuk", 
   "What is? Having a kids theme park or having kids sleep in his bed if they want to? Being a kind hearted person and opening a theme park for children is a great and noble gesture. Allowing children to not only sleep over at your mansion, but sleep in your room, or even worse your bed, is really no way of reliving a childhood. The hardest part for me to understand is why parents allow their children to do this...but that's another issue.\n\n \n As I understand it his bedroom is qite large in and of itself. I had said that he may have wanted to regain his lost childhood, I never said that he was being rational about it. That is why he is such a sad person, and I mean pittiful in this regard. \n \n \n \nGo out and get the \"man-on-the-street\" reaction about wacko and his ranch.\n\n \n It's good thing that we don't try people on public opinion alone. :)\n \n \nNobody ever accused the Europeans of having good taste in music.\n\n \n Like the Beattles? \n \n \nWhat do you think the punishment should be for child molestation?\n\n \n Treatment and if that fails monitoring for the rest of their lives. It would be far cheaper than prison.\n \n \nDo you think he should get a fine and then be told to go on his way?\n\n \n Hardly. What, you think that if he isn't tortured that he will get away scottfree?\n \n \nShould he be allowed to keep his children? I think the penalty should be quite harsh for this kind of behavior.\n\n \n Depends on if he is actually a danger to them. There is harse and their is cruelity and unusally and the second is illegal in the USA. It is one of the things which makes American a bit more civilized than most other countries in the world. :)\n \n \n(I do support the death penalty, actually I support the idea of public execution...but again, totally different story).\n\n \n Yeah, entertainment for the whole family. You could put it on cable as well. One of the things which is a black mark agains the USA is that it still has the death penalty. The DP has never been shown to be a more affective deterent than a long prison sentence. Did you know that in Canada we have longer prison sentences than the USA? That we don't have the DP and we also have far fewer murders, per capita, than the USA as well. We have many of the same influences as the USA does to.\n \n \nMixing punishment with mercy and compassion is certainly an idealistic point of view.\n \n \n And for the most part it does work, at least for us it does. :)\n \n \nWell, I happen to agree with the middle east philosophy that if you steal, you lose a hand.\n\n \n All that does is get rid of the competition. That is also why the Middle-East is where all of the terrorists are as well. You support the terrorists?\n \n \nIn that case it certainly is not difficult to spot a thief, and you know who you cannot trust again. I would think this to be a great way to deter crime. In the case of wacko...I wonder what we would have to cut off...hmmmm......\n\n \n Actually it also deters just about everything else since it is more or less exercised in totalitarian societies. All an eye for an eye does is leave the world blind.", 
   {}, 
   23767, 
   null, 
   1069652100.0
  ], 
  [
   23802, 
   null, 
   "Charchuk", 
   "Hate the sin, Love teh sinner? God commands us to follow the 10 commandments, if your going to sit there and say its OK for Michael Jackson to do what he did to that little boy, then you need to be put in jail! Have you no heart? I mean good grief man!\n\n \n Where did I say that? I have said that if he is guilty than he should get punished to the fullest extent of the law.\n \n \nI only say Michael is guilty because this has happened twice now, rumor had it he gave the boys family in 93 20mil to shut them up.\n\n \n Or it could have been that he agreed to pay the extortion. As I had said, even some of those who thought him guilty the last time have doubts that he maybe guilty this time. The situation, as I explain above, is just too suspicious.\n \n \nif Michael turns out to be inocent then so be it, He just looks guilty to me as well many others.\n\n \n Its a good thing we don't have a justice system based on that anymore.\n \n The bad guy doesn't always wear a black hat. Some of the worse mass murderers looked as normal as anyone else. Like they say, it is always the one you least expect. :)", 
   {}, 
   23773, 
   null, 
   1069652520.0
  ], 
  [
   23813, 
   null, 
   "sundowner", 
   "It's good thing that we don't try people on public opinion alone. \n \n \n I agree. But we were talking about image. \n \n \nLike the Beattles? \n \n \n Exactly.\n \n \nTreatment and if that fails monitoring for the rest of their lives. It would be far cheaper than prison.\n \n \n I never mentioned cost, but since you brought it up...what do you suppose the treatment and monitoring for the rest of his life would cost...lets assume he lives another 30 years? I bet that would be far more expensive than a lethal injection. I bet I could carry out a lethal injection for about $300 considering cost of drugs, equipment needed, and personell to carry out the job. How many millions of dollars should american taxpayers be required to put forth for his treatment and monitoring? I myself don't feel I should have to provide a cent for this. \n \n \nHardly. What, you think that if he isn't tortured that he will get away scottfree?\n \n \n I never mentioned torturing him. I mentioned executing him.\n \n \nDepends on if he is actually a danger to them. There is harse and their is cruelity and unusally and the second is illegal in the USA. It is one of the things which makes American a bit more civilized than most other countries in the world. \n \n \n Yes, cruel and unusual punishment is against the law in the US. I certainly don't think this makes our country more civilized than others. I think that a lot of the criminals in the US see jail as an inconvenience, rather than true punishment. Many of our dangerous felons are back on the streets far to early without any rehabilitation only to commit the same or worse crimes again. I think stiffer penalties and more severe forms of punishment might make people think a little more in this society. \n \n \nYeah, entertainment for the whole family. You could put it on cable as well. One of the things which is a black mark agains the USA is that it still has the death penalty. The DP has never been shown to be a more affective deterent than a long prison sentence. Did you know that in Canada we have longer prison sentences than the USA? That we don't have the DP and we also have far fewer murders, per capita, than the USA as well. We have many of the same influences as the USA does to.\n \n \n I would think that deterence would be very hard to measure quantitatively, since it is a crime that did not occur. And you really cannot compare the US and Canada on the subject of crime and crime prevention. (for that matter healthcare, foreign and domestic policy, etc...) While we do have many similarities, we are 2 different cultures. It is an apple and oranges type comparison. You can put crime rate statistics, laws, and crime prevention charts side by side, but the cultures still remain different, and even if we had the same laws and crime prevention measures I would wager to say that the effectiveness would still be different between the 2 countries. And yes, I am for putting it on cable TV, great idea. I think it was George Carlin that discussed a similar idea in on of his comedy routines. He even went as far as making it a weekly event, having corporate sponsers, and varying the method of execution for variety (after all...variety is the spice of life). Now seriously, I think he takes it to the extreme, but the basic principle might just have merit. American kids spend far more time in front of the TV than any other children anywhere in the world. Perhaps this time can be used to educate them on what happens if you commit a crime. It is kind of like a scared straight program (no reference to gays). You take at risk children to the morgue, county jail, or courthouse to show them what can result from a couple moments of irresponsible action. I know that in this country the christian reich would never allow this to happen, but I like the idea. After seeing a few beheadings, maybe a few of these 14 y/o kids in Newark would think twice before they go out to carjack another old man. And if they don't, at least we can make sure that they won't do it a second time. I say violent crime calls for violent punishment. Pacifism looks good on paper, but allows far to many innocent people to get hurt. \n \n \nAll that does is get rid of the competition. That is also why the Middle-East is where all of the terrorists are as well. You support the terrorists?\n \n \n No, it makes sure there is one less person out there willing to hit me over the head and take my wallet. And at the same time, it perhaps makes another 5 people say \"it's not worth losing my hand over a few bucks, perhaps I should try to get real job\". I don't see the conection to the terrorists here...perhaps you could elaborate? And no, I do not support terrorism of any kind. \n \n \nActually it also deters just about everything else since it is more or less exercised in totalitarian societies. All an eye for an eye does is leave the world blind.\n \n \n What else does it deter? This ideal is why we have registration for sex offenders in the US. We put there pictures out there for the public to see, that way we know who the sex offenders are. I was surprised when I looked in the area I grew up in, I found one that I recognized. This kind of information arms parents with the knowledge they need to keep their kids safe. I wish we could \"mark\" all criminals in some way, it would certainly prevent a lot of crime. A modern day \"scarlett letter\" if you will.", 
   {}, 
   23802, 
   null, 
   1069659000.0
  ], 
  [
   23838, 
   null, 
   "Charchuk", 
   "I agree. But we were talking about image.\n\n \n I had said much of what we see of him is image, not all. \n \n \nExactly.\n\n \n \n The Beattles were on of the best music groulds in the world, probably still are. \n \n \nI never mentioned cost, but since you brought it up...what do you suppose the treatment and monitoring for the rest of his life would cost...\n\n \n Cheaper than living in a cell even for the current sentence max of 8 years.\n \n \nlets assume he lives another 30 years? I bet that would be far more expensive than a lethal injection.\n\n \n Actually, it costs more to execute a prisoner than to incarcerate them.\n \n \nI bet I could carry out a lethal injection for about $300 considering cost of drugs, equipment needed, and personell to carry out the job.\n\n \n You would lose that bet.\n \n http://www.deathpenaltyinfo.org/article.php?did=108&scid=7\n \n \nHow many millions of dollars should american taxpayers be required to put forth for his treatment and monitoring? I myself don't feel I should have to provide a cent for this.\n\n \n Much less than in an unjustifed war on a nation which wasn't a threat. \n \n \nI never mentioned torturing him. I mentioned executing him.\n\n \n You wanted him to suffer. Even when resulting in death torture is still torture.\n \n \nYes, cruel and unusual punishment is against the law in the US. I certainly don't think this makes our country more civilized than others.\n\n \n Yes, it does. Many other countries don't have laws against that.\n \n \nI think that a lot of the criminals in the US see jail as an inconvenience, rather than true punishment.\n\n \n Try a month in prison and then come back and say that.\n \n \nMany of our dangerous felons are back on the streets far to early without any rehabilitation only to commit the same or worse crimes again.\n\n \n So, you're going to throw the baby out with the bathwater?\n \n \nI think stiffer penalties and more severe forms of punishment might make people think a little more in this society.\n\n \n We already have longer sentences here in Canada, but not harsher penalties and we have far less really violent crime.\n \n The \"get tough on crime\", policy is no better than those nations which are \"softer\" on crime. Over all violent crime in the Industrialized world is on the decline.\n \n \nI would think that deterence would be very hard to measure quantitatively, since it is a crime that did not occur. And you really cannot compare the US and Canada on the subject of crime and crime prevention.\n\n \n Why not, we both have the same cultural influences. Even on a per capita basis our crime rate is much lower. I think that there was a recent study which show that in all of the Industrailized Nations that the USA was the most violent in comparison even though their crime rate is dropping as well.\n \n \n(for that matter healthcare, foreign and domestic policy, etc...) While we do have many similarities, we are 2 different cultures. It is an apple and oranges type comparison. You can put crime rate statistics, laws, and crime prevention charts side by side, but the cultures still remain different, and even if we had the same laws and crime prevention measures I would wager to say that the effectiveness would still be different between the 2 countries.\n\n \n Irrelevant. As much as I don't like to think so there are still many simularities between our two cultures and a shared history as well. Afterall, America does beam in 10 times the amount of TV and other \"entertainment\" than we can produce on our own. Another factor is our favor is universal health care. The USA is alos the only one of the Industrailized Nations not to have it. This could be an important factor which does separate us from you in regards to violence.\n \n \nAnd yes, I am for putting it on cable TV, great idea.\n\n \n That would be no different then what had occured in Rome. It got to the point when people got more interested in the \"Bread and Circuses\" than in their Empire and it rotted from within. All the Vandals had to do is tip it over.\n \n \nI think it was George Carlin that discussed a similar idea in on of his comedy routines. He even went as far as making it a weekly event, having corporate sponsers, and varying the method of execution for variety (after all...variety is the spice of life).\n\n \n I think that he was being sarcastic. :)\n \n \nNow seriously, I think he takes it to the extreme, but the basic principle might just have merit. American kids spend far more time in front of the TV than any other children anywhere in the world. Perhaps this time can be used to educate them on what happens if you commit a crime.\n\n \n No, more likely they will become bored with it in short order. They see far more bloody things on their Saturday morning cartoons.\n \n \nIt is kind of like a scared straight program (no reference to gays).\n\n \n Don't many of those programs get canceled because they are inaffective?\n \n \nYou take at risk children to the morgue, county jail, or courthouse to show them what can result from a couple moments of irresponsible action.\n\n \n http://www.aic.gov.au/campbellcj/news/20010603.html\n \n \n I know that in this country the christian reich would never allow this to happen, but I like the idea.\n\n \n If anything they would love it and probaby make corporal punishment mandatory in all schools again as well. All that did was teach children that if you want others to do as you want, hit them.\n \n \nAfter seeing a few beheadings, maybe a few of these 14 y/o kids in Newark would think twice before they go out to carjack another old man.\n\n \n Beheadings? They've seen worse, and done worse in many of their games. What is the movie Friday the 13th up to now, number 11? \n \n \nAnd if they don't, at least we can make sure that they won't do it a second time. I say violent crime calls for violent punishment. Pacifism looks good on paper, but allows far to many innocent people to get hurt. \n\n \n Violent crime is going down all over the Industrailized world dispite what you see on the nightly news. In both countries which are hard and soft on crime.\n \n \nNo, it makes sure there is one less person out there willing to hit me over the head and take my wallet.\n\n \n It makes no difference as I had said above.\n \n \nAnd at the same time, it perhaps makes another 5 people say \"it's not worth losing my hand over a few bucks, perhaps I should try to get real job\". I don't see the conection to the terrorists here...perhaps you could elaborate? And no, I do not support terrorism of any kind.\n\n \n It is only in these societies which use such \"punishments\" that you also have a totalitarian society which breeds the same atitude as the terrorists have. The USA set itself apart from these sorts of governments on purpose. In England they use to hang a man if he was caught stealling, even to feed his family. \n \n \nWhat else does it deter? This ideal is why we have registration for sex offenders in the US. We put there pictures out there for the public to see, that way we know who the sex offenders are. I was surprised when I looked in the area I grew up in, I found one that I recognized. This kind of information arms parents with the knowledge they need to keep their kids safe. I wish we could \"mark\" all criminals in some way, it would certainly prevent a lot of crime. A modern day \"scarlett letter\" if you will.\n\n \n That is a part of monitoring as I had said above.\n \n I've read stories based on that sort of idea. In them they had placed a mark on the forehead of a criminal for about a year where no one else was allowed to notice them at all. They were marked as being \"invisible\" and that included even if they got hurt. It turned out that the punishment did far more real harm to the society than the crime the criminal was accused of since they run out of real criminals eventually and started giving this punishment to those whose only crime was not caring. A guilded cage is still a cage.\n \n Many Islamic nations under the Sharia, like Afghanistan before the fall of the Taliban, are places where no one has ANY individual rights nor freedoms. \n \n As I had said, getting tough on crime doesn't really work any more effectively than going easier on crime as recent numbers show over all.\n \n The news only makes it look far worse than it actually is, even in the USA, though the USA is still higher than other such nations. There is still an improvement going on.", 
   {}, 
   23813, 
   null, 
   1069685100.0
  ], 
  [
   23880, 
   null, 
   "sundowner", 
   "I had said much of what we see of him is image, not all.\n \n \n Not a really great image huh?\n \n \nThe Beattles were on of the best music groulds in the world, probably still are.\n \n \n Opinion.\n \n \nCheaper than living in a cell even for the current sentence max of 8 years.\n \n \n Then perhaps we need to re-evaluate prison spending, like the sheriff in Arizona did. Look into his program, it is really interesting, and he has a much lower rate of repeat offenders. \n \n \nActually, it costs more to execute a prisoner than to incarcerate them.\n \n \n That is because we allow every prisoner 7 or 8 appeals, using public defenders, and state attorneys as prosecution to fight in the courts for years and years before someone sentenced to death ever gets close to their execution. This is a rediculous system. 1 appeal, for all convicted prisoners...just 1. If they lose the appeal, off they go. And why should it be a big production when we execute someone. Here is my $300 execution. $10 = IV solution, $5 =IV tubing, $3 =IV catheter, $20 Vial of IV potassium chloride, $100 x2 for assistants pay, and I will take the remaining $62 dollars as my fee. There you go, $300 execution. emoticon_xclown \n \n \nMuch less than in an unjustifed war on a nation which wasn't a threat. \n \n \n Was the my fault? Don't blame all Americans for the war, not all Americans wanted the war, not all Americans supported the reasoning for the war. And this has nothing to do with the matter at hand. \n \n \nYou wanted him to suffer. Even when resulting in death torture is still torture.\n \n \n How is giving someone a lethal injection torture?\n \n \nSo, you're going to throw the baby out with the bathwater?\n \n \n Not going to get a dirty baby clean with dirty water. \n \n \nWe already have longer sentences here in Canada, but not harsher penalties and we have far less really violent crime.\n \n \n In my book, a longer sentence is a harsher penalty. \n \n \nThe \"get tough on crime\", policy is no better than those nations which are \"softer\" on crime. Over all violent crime in the Industrialized world is on the decline.\n \n \n I guess that is subjective, try coming and living with me in Miami for a couple weeks. \n \n \nIrrelevant. As much as I don't like to think so there are still many simularities between our two cultures and a shared history as well. Afterall, America does beam in 10 times the amount of TV and other \"entertainment\" than we can produce on our own. Another factor is our favor is universal health care. The USA is also the only one of the Industrailized Nations not to have it. This could be an important factor which does separate us from you in regards to violence.\n \n \n 2 different societies / cultures. I still see it as hard to make an acurate comparison between the 2, even on a per capita basis. You can compare our numbers all day long, and I will not argue that our crime rate is much higher than yours, but why is that? Because we are 2 different societies / cultures. \n \n \nThat would be no different then what had occured in Rome. It got to the point when people got more interested in the \"Bread and Circuses\" than in their Empire and it rotted from within. All the Vandals had to do is tip it over.\n \n \n I rather like the idea of throwing people to the lions. Great entertainment, and you could reduce the cost of food for zoos. \n \n \nI think that he was being sarcastic. \n \n \n As he always is, but his comedy has a good underlying point to it. \n \n \nhttp://www.aic.gov.au/campbellcj/news/20010603.html\n \n \n One article questioning the effectiveness of the program, I bet I could find 3 saying it is effective, then you could find 5 saying it wasn't...etc... I believe in the merit and idea of the program, although the strip search thing was completely out of line. \n \n \nIf anything they would love it and probaby make corporal punishment mandatory in all schools again as well. All that did was teach children that if you want others to do as you want, hit them.\n \n \n I was on the recieving end of a paddle once or twice, and I can honestly say, it taught me that there are people in authority, and if I break the rules, these people can punish me. It taught me that there were consequences for my actions, and I need to way the fact if the action is worth the punishment.\n \n \nBeheadings? They've seen worse, and done worse in many of their games. What is the movie Friday the 13th up to now, number 11?\n \n \n There is a vast difference between poorly made movies and reality. Kids watch these movies and laugh at them...they know it is fake, not reality, that the actors collect a paycheck at the end of the day and go home. Show them some real live punishment, that might make a real impression on them.\n \n \nI've read stories based on that sort of idea. In them they had placed a mark on the forehead of a criminal for about a year where no one else was allowed to notice them at all. They were marked as being \"invisible\" and that included even if they got hurt. It turned out that the punishment did far more real harm to the society than the crime the criminal was accused of since they run out of real criminals eventually and started giving this punishment to those whose only crime was not caring. A guilded cage is still a cage.\n\n \n These I assume are fictional stories? Objection you honor! Inadmissable evidence offered by the defense with no basis or grounding in reality.\n \n \nAs I had said, getting tough on crime doesn't really work any more effectively than going easier on crime as recent numbers show over all.\n \n \n Do you truely believe that?", 
   {}, 
   23838, 
   null, 
   1069703340.0
  ], 
  [
   23892, 
   null, 
   "Charchuk", 
   "Not a really great image huh?\n\n \n Can you lay your hands on $300 million?\n \n \nThen perhaps we need to re-evaluate prison spending, like the sheriff in Arizona did. Look into his program, it is really interesting, and he has a much lower rate of repeat offenders.\n\n \n You mean that one who keeps his prisoners in tents and makes them wear pink? \n \n \nThat is because we allow every prisoner 7 or 8 appeals, using public defenders, and state attorneys as prosecution to fight in the courts for years and years before someone sentenced to death ever gets close to their execution. This is a rediculous system. 1 appeal, for all convicted prisoners...just 1. If they lose the appeal, off they go. And why should it be a big production when we execute someone. Here is my $300 execution. $10 = IV solution, $5 =IV tubing, $3 =IV catheter, $20 Vial of IV potassium chloride, $100 x2 for assistants pay, and I will take the remaining $62 dollars as my fee. There you go, $300 execution. emoticon_xclown\n\n \n So, you want to limited justice? Imagine you'll beable to execute more innocent people as well. \n \n \nWas the my fault? Don't blame all Americans for the war, not all Americans wanted the war, not all Americans supported the reasoning for the war. And this has nothing to do with the matter at hand.\n\n \n But you're going to be paying for it sure enough. Halibruton is sure going to make a killing with most of the $87 billion. \n \n \nHow is giving someone a lethal injection torture?\n\n \n Not if it is instant, but you had wanted him to suffer first. With instant there is no punishment because there is no suffering. That is why it is a penalty and not really a punishment. You learn nothing when you're dead.\n \n \nNot going to get a dirty baby clean with dirty water.\n\n \n Metaphor. \n \n \nIn my book, a longer sentence is a harsher penalty.\n\n \n Depends on the conditions. A longer sentence in a Turkish Prison would be far harsher. :) \n \n \nI guess that is subjective, try coming and living with me in Miami for a couple weeks.\n\n \n No thank you. My aunt lived in Florida for 30 years and around 10 years ago they moved back to Canada. Florida, where they give a whole new meaning to tourist season. \n \n \n2 different societies / cultures. I still see it as hard to make an acurate comparison between the 2, even on a per capita basis. You can compare our numbers all day long, and I will not argue that our crime rate is much higher than yours, but why is that? Because we are 2 different societies / cultures.\n\n \n We share far too many simularities and history as well. Plus, the USA is the only Industralized country with such a high crtime rate without also being at internal war.\n \n \nI rather like the idea of throwing people to the lions. Great entertainment, and you could reduce the cost of food for zoos.\n\n \n I hope you're joking, because that is sick. \n \n \nAs he always is, but his comedy has a good underlying point to it.\n\n \n I like it when he is talking about his pets. That poor cat, evertime he is taken to the vet he \"loses\" something. :) \n \n \nOne article questioning the effectiveness of the program, I bet I could find 3 saying it is effective, then you could find 5 saying it wasn't...etc... I believe in the merit and idea of the program, although the strip search thing was completely out of line.\n\n \n It is no different than those boot camp programs. They cause more harm than good in the end. And they don't work as well as claimed. \n \n \nI was on the recieving end of a paddle once or twice, and I can honestly say, it taught me that there are people in authority, and if I break the rules, these people can punish me. It taught me that there were consequences for my actions, and I need to way the fact if the action is worth the punishment.\n\n \n All the strap taught me was to question authority. Especially the times I got it in school when I wasn't guilty.\n \n When my mother was little and going to school they had a principal who would strap the entire school if only one had misbehaved. He only strapped my mother and her siblings once. My grandmother gave him a good talking to afterwards.\n \n \nThere is a vast difference between poorly made movies and reality. Kids watch these movies and laugh at them...they know it is fake, not reality, that the actors collect a paycheck at the end of the day and go home.\n\n \n No, they don't. It means nothing to them. Especially if they are pre-teens.\n \n \nShow them some real live punishment, that might make a real impression on them.\n\n \n I highly doubt that.\n \n \nThese I assume are fictional stories? Objection you honor! Inadmissable evidence offered by the defense with no basis or grounding in reality.\n\n \n Of course they were fiction. They were showing a possible outcome of such extreme thinking. You can see same examples of such thinking in places like Singapore and the like.\n \n \nDo you truely believe that?\n\n \n I don't have to believe that since it is fact. Violent crime is a real problem in the USA as compared to other nations.\n \n http://www.urban.org/Template.cfm?NavMenuID=24&template=/TaggedContent/ViewPublication.cfm&PublicationID=5922", 
   {}, 
   23880, 
   null, 
   1069714920.0
  ], 
  [
   23919, 
   null, 
   "sundowner", 
   "Can you lay your hands on $300 million?\n \n \n Money means nothing to me if I am labeled as a pedophile to get it.\n \n \nYou mean that one who keeps his prisoners in tents and makes them wear pink? \n \n \n Yeah, I like him.\n \n \nSo, you want to limited justice? Imagine you'll beable to execute more innocent people as well. \n \n \n I never mentioned executing innocent people. I just see no reason for people to get 8 appeals payed for by taxpayers. They are guilty, that's it. One review, by an appeals court, and then off they go. If that is limiting justice, then yes, I guess I wish to limit justice. \n \n \nBut you're going to be paying for it sure enough. Halibruton is sure going to make a killing with most of the $87 billion.\n \n \n So, like I said, what does this have to do with the matter at hand?\n \n \nDepends on the conditions. A longer sentence in a Turkish Prison would be far harsher.\n \n \n A longer sentence in any prison to me seems harsher, I don't care what country it is in. \n \n \nNo thank you. My aunt lived in Florida for 30 years and around 10 years ago they moved back to Canada. Florida, where they give a whole new meaning to tourist season. \n \n \n For a while it was like they were handing out licenses like it was deer season. \n \n \nAs I had said, getting tough on crime doesn't really work any more effectively than going easier on crime as recent numbers show over all.\n \n \n This is what I asked you if you truely believe, not if we have the highest crime rate. I wanted to know if you contend that reducing sentences, abolishing the death penalty, and \"going easy on crime\" will really reduce the rate of crime in this country.\n \n \nNot if it is instant, but you had wanted him to suffer first. With instant there is no punishment because there is no suffering. That is why it is a penalty and not really a punishment. You learn nothing when you're dead.\n \n \n Could you point out where I said I wished him to suffer?\n \n \nI hope you're joking, because that is sick. \n \n \n About half. \n \n \nIt is no different than those boot camp programs. They cause more harm than good in the end. And they don't work as well as claimed. \n \n \n These programs are usually used for first time felons. (good movie by that name, First Time Felon, see it if you get a chance...based on a true story.) I think that if the program prevents even one person from becoming a repeat offender, then it was worth it. \n \n \nOf course they were fiction. They were showing a possible outcome of such extreme thinking. You can see same examples of such thinking in places like Singapore and the like.\n \n \n Please try not to use fictional stories for argument. I understand the point you are trying to make, but again, it has no grounding in reality. If Singapore is a good example, then show me information about that.", 
   {}, 
   23892, 
   null, 
   1069724700.0
  ], 
  [
   23921, 
   null, 
   "10ite", 
   "MJ News \n \n :)", 
   {
    "post_info": {
     "post_title": "MJ News"
    }
   }, 
   23919, 
   null, 
   1069725180.0
  ], 
  [
   23926, 
   null, 
   "Charchuk", 
   "Money means nothing to me if I am labeled as a pedophile to get it.\n\n \n He hasn't been convicted of anything yet. Remember, innocent until proven guilty in a court of law. \n \n \nYeah, I like him.\n\n \n But than you're also into humiliation as well. What do you think of leather?\n \n \nI never mentioned executing innocent people. I just see no reason for people to get 8 appeals payed for by taxpayers.\n\n As recent cases have proven that if they didn't have these appeals that later proved their innocents they would have been executed. Your way probaby more innocent and wrongly convicted people will be put to death, but hey better 99 innocent people die than one guilty person go free, right.\n \n \nThey are guilty, that's it. One review, by an appeals court, and then off they go. If that is limiting justice, then yes, I guess I wish to limit justice.\n\n \n That is because you aren't really interrest in justice to begin with, either that or you don't know what it is to begin with.\n \n \nSo, like I said, what does this have to do with the matter at hand?\n\n \n Plenty in regards to the Iraqi war.\n \n \nA longer sentence in any prison to me seems harsher, I don't care what country it is in.\n\n \n The goal of punishment is as a deterent. The death pentaly isn't a deterent and it is not a punishment since you learn nothing when you're dead. \n \n \nFor a while it was like they were handing out licenses like it was deer season.\n\n \n Exactly. You usually only see stuff like that in places like Iraq. \n \n [quote]This is what I asked you if you truely believe, not if we have the highest crime rate. I wanted to know if you contend that reducing sentences, abolishing the death penalty, and \"going easy on crime\" will really reduce the rate of crime in this country.[quote]\n \n It is working for the other Industralized nations.\n \n \nCould you point out where I said I wished him to suffer?\n\n \n To pay for what he had done to these children,\n \n \nAbout half.\n\n \n Even that much is telling.\n \n \nThese programs are usually used for first time felons.\n\n \n The same as most locks are really only meant to keep out honest people.\n \n \n(good movie by that name, First Time Felon, see it if you get a chance...based on a true story.) I think that if the program prevents even one person from becoming a repeat offender, then it was worth it.\n\n \n Even if that person wouldn't have been a repeat \"offender\" anyways?\n \n \nPlease try not to use fictional stories for argument.\n\n \n It is used as an example the same as a parable would be. Fictional stories are just a modern version of parables.\n \n \nI understand the point you are trying to make, but again, it has no grounding in reality. If Singapore is a good example, then show me information about that.\n\n \n Try writing graffiti on any public building and see just how many whacks you get from the cane. You can't even chew gum in public there.\n \n http://www.nationbynation.com/Singapore/Human.html\n \n And on another point.\n \n http://www.tahr.org.tw/data/report97/eng97/e01.html", 
   {}, 
   23919, 
   null, 
   1069728180.0
  ], 
  [
   23950, 
   null, 
   "sundowner", 
   "He hasn't been convicted of anything yet. Remember, innocent until proven guilty in a court of law. \n \n \n You don't have to be convicted to gain an image as a pedophile in the eyes of the public. Especially when most people figure you just bought your way out last time. \n \n \nBut than you're also into humiliation as well. What do you think of leather?\n \n \n As in leather jackets, leather bull whips, leather body suits, leather bondage apparell...what are you reffering to?\n \n \nAs recent cases have proven that if they didn't have these appeals that later proved their innocents they would have been executed. Your way probaby more innocent and wrongly convicted people will be put to death, but hey better 99 innocent people die than one guilty person go free, right.\n \n \n I think you would find that it is rare for an innocent person to be convicted and sentenced to death anyway. Probably 99% guilty to the 1% innocent...if that. At any rate, the majority of cases later overturned are due to technicalities, not neccesarily the true innocence of the defendant. \n \n \nThat is because you aren't really interrest in justice to begin with, either that or you don't know what it is to begin with.\n \n \n Like I said, if he is innocent...good for him. I am wrong, big deal. If he is guilty, he needs to pay...preferably with his life. \n \n \nPlenty in regards to the Iraqi war.\n \n \n This subject has nothing to do with the Iraq war, you know that. \n \n \nThe goal of punishment is as a deterent. The death pentaly isn't a deterent and it is not a punishment since you learn nothing when you're dead.\n \n \n No, the threat of punishment is deterrence. Actual punishment is after the fact, and is not deterrence since the crime already occured. The death penalty as a concept is deterrence. When put into practice, it is a punishment. \n \n \nTo pay for what he had done to these children,\n \n \n I never said he should suffer. Show me my quote from where I said he should suffer.\n \n \nEven if that person wouldn't have been a repeat \"offender\" \n anyways?\n \n \n There is no way to measure this, other than statistics showing that first time felons who complete a boot camp course are less likely to return to prison than another first time felon who serves a 5 years sentence in prison. I will look for the statistics and post them in the morning, getting tired. \n \n \nTry writing graffiti on any public building and see just how many whacks you get from the cane.\n \n \n I bet not too many people write graffiti there. Sounds like an effective punishment system to me. That was a very informative article, thank you. \n \n \nAnd on another point.\n \n \n I am all for human rights, but not criminal rights. Especially in the case you provided, 13 boys beat up, tortured, and killed a girl showing no sign of remorse after they are caught. I say kill them too. They did not give the girl they killed a choice, and if that is what the people are calling for, so be it.", 
   {}, 
   23926, 
   null, 
   1069741500.0
  ], 
  [
   23981, 
   null, 
   "Charchuk", 
   "You don't have to be convicted to gain an image as a pedophile in the eyes of the public. Especially when most people figure you just bought your way out last time.\n\n \n That is irrelevant in a court of law. \n \n \nAs in leather jackets, leather bull whips, leather body suits, leather bondage apparell...what are you reffering to?\n\n \n I think that the reference spoke for itself. :) \n \n \nI think you would find that it is rare for an innocent person to be convicted and sentenced to death anyway.\n\n \n If Texas is any indication that may not be all that true.\n \n \nProbably 99% guilty to the 1% innocent...if that. At any rate, the majority of cases later overturned are due to technicalities, not neccesarily the true innocence of the defendant. \n\n \n Irrelevant. Everyone is guaranteed equal justice under the law. \n \n \nLike I said, if he is innocent...good for him. I am wrong, big deal. If he is guilty, he needs to pay...preferably with his life.\n\n \n The State doesn't seem to think that. The max sentence they are saying he would get if convicted is 8 years. \n \n \nThis subject has nothing to do with the Iraq war, you know that.\n\n \n You had brought up something about wasting taxpayers on treatment and monitoring of pedophiles. The Iraqi War is an even bigger waste and it is totally unjustifed as well.\n \n \n \nNo, the threat of punishment is deterrence.\n Actual punishment is after the fact, and is not deterrence since the crime already occured. The death penalty as a concept is deterrence. When put into practice, it is a punishment. \n\n \n And the DP has never been shown to be an effective deterent. In fact in places which still have it the murder rate is still higher than in places which don't have it.\n \n http://dpa.state.ky.us/library/advocate/nov97/crime_control.htm\n \n http://www.skidmore.edu/%7Emstokes/LS2/Deathpen-sample.html\n \n \nI never said he should suffer. Show me my quote from where I said he should suffer.\n\n \n Pay for, is the same as suffer. \n \n \nThere is no way to measure this, other than statistics showing that first time felons who complete a boot camp course are less likely to return to prison than another first time felon who serves a 5 years sentence in prison. I will look for the statistics and post them in the morning, getting tired.\n\n \n Many of these boot camp programs are for children, teens, who have gotten into a some minor trouble or were just being rebellious. Many of these programs had to be shut down because of criminal behavior on their part which in several cases had lead to the death of a teen. These camps are not regulated. \n \n \nI bet not too many people write graffiti there. Sounds like an effective punishment system to me. That was a very informative article, thank you.\n\n \n There are more and more canings each year, not less. \n \n \nI am all for human rights, but not criminal rights. Especially in the case you provided, 13 boys beat up, tortured, and killed a girl showing no sign of remorse after they are caught. I say kill them too. They did not give the girl they killed a choice, and if that is what the people are calling for, so be it.\n\n \n That is revenge you are calling for, not real justice.", 
   {}, 
   23950, 
   null, 
   1069771860.0
  ], 
  [
   24032, 
   null, 
   "sundowner", 
   "That is irrelevant in a court of law. \n \n \n I thought we were speaking of image, not verdict.\n \n \nI think that the reference spoke for itself. \n \n \n I don't think it did. You said something like \"you are into humiliation..\". I don't think you know me quite well enough to make statements such as that, and I don't appreciate the implications. \n \n \nIf Texas is any indication that may not be all that true.\n \n \n Ok, so tell me, out of everyone sentenced to death in Texas, how many were innocent.\n \n \nThe State doesn't seem to think that. The max sentence they are saying he would get if convicted is 8 years. \n \n \n I guess I should make the distinction, this is a personal opinion, not a legal fact.\n \n \nYou had brought up something about wasting taxpayers on treatment and monitoring of pedophiles. The Iraqi War is an even bigger waste and it is totally unjustifed as well.\n \n \n That is strictly an opinionated statement, as my original statement was opinion. We are all entitled to our opinions. In your opinion you may be able to make the connection, in my opinion, no connection exists. \n \n \nPay for, is the same as suffer.\n \n \n Maybe in Cananandian, not in english. Pay for means: to atone for, make up for, perhaps pay a fine, serve a sentence, be executed, recieve probation, community service...etc... I never said he should suffer. Again, quote me the text in which I said this, ehh?\n \n \nMany of these boot camp programs are for children, teens, who have gotten into a some minor trouble or were just being rebellious. Many of these programs had to be shut down because of criminal behavior on their part which in several cases had lead to the death of a teen. These camps are not regulated. \n \n \n I'm speaking of alternative sentencing for first time felons, not 13 y/o's who steal a pack of gum. There is a large difference in these programs. \n \n \nThere are more and more canings each year, not less. \n \n \n And why do you suppose that is? Perhaps more crime? I would be curious to see what would happen if they took caining away from the punishment for graffiti, do you think graffiti would increase or decrease? You make it sound as if people go out and write graffiti saying \"gee, I hope I get cained today!\" I bet many of these people getting cained will never write graffiti again, however, give the same people a $30 fine and see how many do it again. \n \n \nThat is revenge you are calling for, not real justice.\n \n \n Again, personal opinion. I consider it punishment within the scope of the law. You must look at the basic reason why we punish people in the first place.", 
   {}, 
   23981, 
   null, 
   1069801920.0
  ], 
  [
   24121, 
   null, 
   "Charchuk", 
   "I thought we were speaking of image, not verdict.\n\n \n Both. \n \n \nand I don't appreciate the implications.\n\n \n That was the point. \n \n \nOk, so tell me, out of everyone sentenced to death in Texas, how many were innocent.\n\n \n One is one too many. \n \n \nI guess I should make the distinction, this is a personal opinion, not a legal fact.\n\n \n And it is a good thing that the justice system isn't based on personal opinion.\n \n \nThat is strictly an opinionated statement, as my original statement was opinion. We are all entitled to our opinions. In your opinion you may be able to make the connection, in my opinion, no connection exists.\n \n \n Some opinions are more valid than others, epecially when they are informed. \n \n \nMaybe in Cananandian,\n\n \n Canadian.\n \n \nnot in english. Pay for means: to atone for, make up for, perhaps pay a fine, serve a sentence, be executed, recieve probation, community service...etc... I never said he should suffer. Again, quote me the text in which I said this, ehh?\n\n \n In the context of your postings it sounding like you wanted him to suufer.\n \n \nI'm speaking of alternative sentencing for first time felons, not 13 y/o's who steal a pack of gum. There is a large difference in these programs.\n \n \n As was stated those programs aren't as affective as claimed. \n \n \nAnd why do you suppose that is? Perhaps more crime? I would be curious to see what would happen if they took caining away from the punishment for graffiti, do you think graffiti would increase or decrease?\n\n \n It probaby would decrease since there is no risk to it.\n \n \nYou make it sound as if people go out and write graffiti saying \"gee, I hope I get cained today!\" I bet many of these people getting cained will never write graffiti again, however, give the same people a $30 fine and see how many do it again.\n\n \n Not unless they're into \"caning\". :) In England didn't they have to stop corporate punishment for a while because it was creating far too many people who actually liked it, or something like that? :)\n \n \nAgain, personal opinion. I consider it punishment within the scope of the law. You must look at the basic reason why we punish people in the first place.\n\n \n As a deterent, but the DP has never been shown to be an effective one at all, and usually has the opposite effect.", 
   {}, 
   24032, 
   null, 
   1069855200.0
  ], 
  [
   24144, 
   null, 
   "sundowner", 
   "That was the point.\n \n \n That's just ignorant...you're above that.\n \n \nOne is one too many.\n \n \n Likewise, one guilty person getting off on a technicality is one too many, but it happens. The justice system is not perfect.\n \n \nAnd it is a good thing that the justice system isn't based on personal opinion.\n \n \n Especially not yours or mine, ehh?\n \n \nCanadian.\n \n \n Yeah, like I said, Canadinnian.\n \n \nIn the context of your postings it sounding like you wanted him to suufer.\n \n \n So now I did not say it, now it is in my \"context\". I still don't see it. \n \n \nIt probaby would decrease since there is no risk to it.\n \n \n Huh? So now crimes are commited because there is a risk of punishment? Hell, by that logic, just get rid of jails and courts, we won't punish anyone anymore, and crime will stop! Why did we not think of this before?\n \n \nNot unless they're into \"caning\". In England didn't they have to stop corporate punishment for a while because it was creating far too many people who actually liked it, or something like that? \n \n \n Never heard anything about it. And you meant corporal punishment right?", 
   {}, 
   24121, 
   null, 
   1069873860.0
  ], 
  [
   24147, 
   null, 
   "rapture", 
   "Doesn't Never Never Land have a crocadile with a ticking clock? \n \n \n For a male that pretends to love kids and relate to them. It was said that one female child out of thousand's of kids has had access to Never Never Land.(?)\n \n \n \n \n F.Y.I  Somebody better check on Bubbles", 
   {}, 
   24144, 
   null, 
   1069876260.0
  ], 
  [
   24159, 
   null, 
   "Charchuk", 
   "That's just ignorant...you're above that.\n\n \n That is fire with fire. \n \n \nLikewise, one guilty person getting off on a technicality is one too many, but it happens. The justice system is not perfect.\n\n \n It is just that your system in many places seems to lean towards executing the innocent so that the guilty won't go free. The old \"Kill them all and let god sort them out...\"\n \n \nEspecially not yours or mine, ehh?\n\n \n We don't execute people, and we have a lower violent crime rate. :) BTW, I don't know anyone who says eh all the time. You know, Mexicans say ci, and Canadians are suppose to say eh. The least that Americans can do is say Bee. :) \n \n \nYeah, like I said, Canadinnian.\n\n \n Is that like mericans?\n \n \nHuh? So now crimes are commited because there is a risk of punishment?\n\n \n It depends on the type of punishment and the crime.\n \n \n \nHell, by that logic, just get rid of jails and courts, we won't punish anyone anymore, and crime will stop! Why did we not think of this before?\n\n \n Now you're just being flippant.\n \n \nNever heard anything about it. And you meant corporal punishment right?\n\n \n :). The way some of them act you'd think that it would be that as well. :)", 
   {}, 
   24144, 
   null, 
   1069884120.0
  ], 
  [
   24306, 
   null, 
   "sundowner", 
   "That is fire with fire. \n \n \n I have not intentionally insulted you, have I? If I have, I appologize. I am here to debate people, not insult them. \n \n \nIt is just that your system in many places seems to lean towards executing the innocent so that the guilty won't go free. The old \"Kill them all and let god sort them out...\"\n \n \n What, you mean the people that were found guilty in a court of law? Thos innocent people? I have said, I agree with an appeal for all prisoners, to specifically address any errors or overlooked evidence. I do not however support 8 appeals, this is excesive and a waste of money. I support this idea for all prisoners, not just people on death row. I don't want innocent people to go to jail, nor do I want guilty people to go free. We will never be completely safe from either.\n \n \nWe don't execute people, and we have a lower violent crime rate. BTW, I don't know anyone who says eh all the time. You know, Mexicans say ci, and Canadians are suppose to say eh. The least that Americans can do is say Bee. \n \n \n Again, you really cannot compare our 2 societies by saying this works for us, it would work for you. We are far to different for ideology like this. And good one. I have only known about 5 or 6 Canadadians, so I would wager you know many more than I do, but the ones I do know say eh all the time. It just makes me laugh, that and when they try to tell me \"aboot\" something. emoticon_xhoho \n \n \nIs that like mericans?\n \n \n Sure. \n \n \nNow you're just being flippant.\n \n \n Perhaps, or perhaps I think the idea that criminals committ crime because there is a risk of punishment is flippant. (I am sure there are a few extreme examples, but the majority of criminals have other motives)\n \n \n. The way some of them act you'd think that it would be that as well. \n \n \n No doubt. Can you say ENRON?", 
   {}, 
   24159, 
   null, 
   1069978740.0
  ], 
  [
   24314, 
   null, 
   "Charchuk", 
   "What, you mean the people that were found guilty in a court of law? Thos innocent people? I have said, I agree with an appeal for all prisoners, to specifically address any errors or overlooked evidence. I do not however support 8 appeals, this is excesive and a waste of money. I support this idea for all prisoners, not just people on death row. I don't want innocent people to go to jail, nor do I want guilty people to go free. We will never be completely safe from either.\n\n \n Sometimes it takes more than one appeal.\n \n \nAgain, you really cannot compare our 2 societies by saying this works for us, it would work for you. We are far to different for ideology like this. And good one. I have only known about 5 or 6 Canadadians, so I would wager you know many more than I do, but the ones I do know say eh all the time. It just makes me laugh, that and when they try to tell me \"aboot\" something. emoticon_xhoho\n\n \n That is another thing, I've never heard anyone say aboot. :) \n \n \nPerhaps, or perhaps I think the idea that criminals committ crime because there is a risk of punishment is flippant. (I am sure there are a few extreme examples, but the majority of criminals have other motives)\n\n \n What I've found is that there are far too many people who don't actually care aboot if a person is really guilty or not. They just want someone to be punished, to suffer.", 
   {}, 
   24306, 
   null, 
   1069982700.0
  ], 
  [
   24332, 
   null, 
   "sundowner", 
   "Sometimes it takes more than one appeal.\n \n \n OK, 2, but no more. :) \n \n \nThat is another thing, I've never heard anyone say aboot.\n \n \n Must just be those 'mericanized canadinians. \n \n \nWhat I've found is that there are far too many people who don't actually care aboot if a person is really guilty or not. They just want someone to be punished, to suffer.\n \n \n I am sure there are many people like this out there. Sad, isn't it.", 
   {}, 
   24314, 
   null, 
   1069991640.0
  ], 
  [
   24387, 
   null, 
   "Charchuk", 
   "OK, 2, but no more. :) \n\n \n It takes as many as it takes. \n \n \nI am sure there are many people like this out there. Sad, isn't it.\n\n \n Far too many. If they had their way we'd be like ancient Rome.", 
   {}, 
   24332, 
   null, 
   1070027220.0
  ], 
  [
   24475, 
   null, 
   "sundowner", 
   "It takes as many as it takes. \n \n \n For what, a guilty person to get off on a technicality? If a court is good enough to find someone guilty and send them to jail in the first place, why does a criminal need 8 more attempts to get off? Like I said, I think one appeal and a review of the trial is more than sufficient, and would definately improve our justice system. Of course, this is just my opinion. \n \n \nFar too many. If they had their way we'd be like ancient Rome.\n \n \n You mean the greatest civilization of it's time? That ancient Rome? Yes, some of it was barbaric, but it was no less a great society.", 
   {}, 
   24387, 
   null, 
   1070071740.0
  ], 
  [
   24484, 
   null, 
   "Charchuk", 
   "For what, a guilty person to get off on a technicality? If a court is good enough to find someone guilty and send them to jail in the first place, why does a criminal need 8 more attempts to get off? Like I said, I think one appeal and a review of the trial is more than sufficient, and would definately improve our justice system. Of course, this is just my opinion.\n\n \n Like I had said, you're more interested in retribution than in actual justice. \n \n \nYou mean the greatest civilization of it's time? That ancient Rome? Yes, some of it was barbaric, but it was no less a great society.\n\n \n Depends on how you define great. Anicent Greese was a far better civilization in comparison for the ideas and concepts it first put forth. I don't think that might makes for a truly great society.", 
   {}, 
   24475, 
   null, 
   1070074140.0
  ], 
  [
   24491, 
   null, 
   "sundowner", 
   "Like I had said, you're more interested in retribution than in actual justice. \n \n \n Not at all, I just think that we should have more confidence in our criminal justice system. How many times should a court have to say that someone is guilty? To say \"we find you guilty, but you have 8 chances to have another set of people find you not guilty\" makes it seem as if our justice system just downright sucks. With the high technology available today with forensic investigation, the burdon of proof has become exacting physical and scientific evidence. 8 appeals are a waste of money, time, and resources. It has nothing to do with revenge. \n \n \nDepends on how you define great. Anicent Greese was a far better civilization in comparison for the ideas and concepts it first put forth. I don't think that might makes for a truly great society.\n \n \n Might was certainly not the only virtue of the Romans, but it was one of them.", 
   {}, 
   24484, 
   null, 
   1070076060.0
  ], 
  [
   24580, 
   null, 
   "SparkleSocks22", 
   "I think that Michael Jackson is 100% innocent. C'mon you people are smart, don't you see what's going on here? They are just after his money! Gavin and his mother saw what happened in 1993, so they thought emoticon_idea DUH they can probably get money this time because they know that Michael hates court. He hates having drawn out things on TV and that is why he paid the Chandlers that disclosed amount of money. This time though, it will be different, Michael is going to fight in court. Just you watch and see, Jan. 9th, 2004 he will finally be proven innocent. PLUS they already have videotapes of Gavin (the 12 year old cancer patient) SAYING that Michael has not done anything to harm them. ALSO Gavin's father is on Michael's side saying that Michael NEVER did anything to harm Gavin. This should be a fairly easy trial to win. Sneddon just wants to see Michael locked up... revenge from 10 years ago. *shakes head*", 
   {}, 
   24491, 
   null, 
   1070128560.0
  ], 
  [
   24582, 
   null, 
   "Charchuk", 
   "Not at all, I just think that we should have more confidence in our criminal justice system. How many times should a court have to say that someone is guilty? To say \"we find you guilty, but you have 8 chances to have another set of people find you not guilty\" makes it seem as if our justice system just downright sucks.\n\n \n It would really suck if after only one or two appeals you were executed and then evidence came along saying that you were actually innocent all along. This is the sort of thing which eventually caused capital punishment to be stopped in most industralized nations. Far too many innocent people were being executed. I think that it was a case like that which helpped decide against CP in Canada when it was discovered that an innocent man was hung.\n \n Isn't the USA the only Western nation to still use CP on a regular basis now? It is also the only Industralized nation not to have universal health care as well.\n \n \nWith the high technology available today with forensic investigation, the burdon of proof has become exacting physical and scientific evidence. 8 appeals are a waste of money, time, and resources. It has nothing to do with revenge.\n\n \n When there is a life on the line no cost is too great. Even the life of a criminal. \n \n \nMight was certainly not the only virtue of the Romans, but it was one of them.\n\n \n It was their main thing.", 
   {}, 
   24491, 
   null, 
   1070136780.0
  ], 
  [
   24585, 
   null, 
   "sundowner", 
   "I think that Michael Jackson is 100% innocent. C'mon you people are smart, don't you see what's going on here? They are just after his money! Gavin and his mother saw what happened in 1993, so they thought emoticon_idea DUH they can probably get money this time because they know that Michael hates court. He hates having drawn out things on TV and that is why he paid the Chandlers that disclosed amount of money. This time though, it will be different, Michael is going to fight in court. Just you watch and see, Jan. 9th, 2004 he will finally be proven innocent. PLUS they already have videotapes of Gavin (the 12 year old cancer patient) SAYING that Michael has not done anything to harm them. ALSO Gavin's father is on Michael's side saying that Michael NEVER did anything to harm Gavin. This should be a fairly easy trial to win. Sneddon just wants to see Michael locked up... revenge from 10 years ago. *shakes head*\n\n \n Yeah sparkle, we will see.", 
   {}, 
   24580, 
   null, 
   1070140500.0
  ], 
  [
   24619, 
   null, 
   "SparkleSocks22", 
   "Yeah sparkle, we will see.\n\n \n Indeed we will.", 
   {}, 
   24585, 
   null, 
   1070151660.0
  ], 
  [
   24714, 
   null, 
   "sundowner", 
   "Indeed we will.\n\n \n And actually, Jan 9th is only the arraignment, not the trial. So it will be some time later until he is found guilty.", 
   {}, 
   24619, 
   null, 
   1070183280.0
  ], 
  [
   24752, 
   null, 
   "SparkleSocks22", 
   "Well whenever the trial is set, the world will soon see that he is innocent.", 
   {}, 
   24714, 
   null, 
   1070216940.0
  ], 
  [
   24755, 
   null, 
   "sundowner", 
   "OK sparkle, thank you for your contribution.", 
   {}, 
   24752, 
   null, 
   1070222160.0
  ], 
  [
   24990, 
   null, 
   "bud095", 
   "listening to the press he is guilty already .he deserves his day in court! let the courts decide!", 
   {
    "post_info": {
     "post_title": "jacko"
    }
   }, 
   24755, 
   null, 
   1070320680.0
  ], 
  [
   25005, 
   null, 
   "sundowner", 
   "listening to the press he is guilty already .he deserves his day in court! let the courts decide!\n\n \n The court will decide. But there is nothing wrong with people showing their opinions or views on the subject. You know, in the court of public opinion there is no such thing as innocent until proven guilty.", 
   {}, 
   24990, 
   null, 
   1070321700.0
  ], 
  [
   25017, 
   null, 
   "bud095", 
   "after the press says he is guilty a juror is more likely to convict him no matter what", 
   {
    "post_info": {
     "post_title": "pre trial publicity"
    }
   }, 
   25005, 
   null, 
   1070323680.0
  ], 
  [
   25057, 
   null, 
   "sundowner", 
   "after the press says he is guilty a juror is more likely to convict him no matter what\n\n \n Just like OJ huh?", 
   {}, 
   25017, 
   null, 
   1070336220.0
  ], 
  [
   25227, 
   null, 
   "SparkleSocks22", 
   "it's not like u were contributing... thats not the point that I'm here to make, I posted this in my thread in the entertainment section but I will also post this here because it also has to do with this thread.\n \n Here is what WE here in the UNITED STATES are assured. \n \n No citizen shall be held to be GUILTY of a crime UNTIL it is proven beyond a REASONABLE DOUBT, in a COURT OF LAW! \n \n Why? \n \n Because we are a PEOPLE of LAWS. \n \n Our government if founded not only on human principles of reason logic, and consent by the PEOPLE, but these principles are protected and established by LAW! \n \n Out traditions, our principles, and our laws are to be applied equally for all PEOPLE, no matter their Race, Creed, Color of Skin, Economic Status, Ethnicity, Country, Religion, Number of Operations, Physical Appearance, Name or Fame, or Number of TIMES they also have been found INNOCENT! \n \n In AMERICA, we pursue our happiness within the confines of LAWS that we are Governed. \n \n WE hold, that any person, JOE PUBLIC INCLUDED,,,,, be granted a Presumption of INNOCENCE! \n \n WE hold these PRINCIPLES of LAW as reasonable and true! \n \n Therefore he is innocent... in the public eye or not, he still is innocent, people have the right to assume that he's not be he is officially innocent for now (and will continue to be after this trial is over and done with... but u've already heard my opinion and very well know where I stand so there is no reason to tell u again.)", 
   {}, 
   25057, 
   null, 
   1070416260.0
  ], 
  [
   25230, 
   null, 
   "sundowner", 
   "it's not like u were contributing... thats not the point that I'm here to make, I posted this in my thread in the entertainment section but I will also post this here because it also has to do with this thread.\n \n Here is what WE here in the UNITED STATES are assured. \n \n No citizen shall be held to be GUILTY of a crime UNTIL it is proven beyond a REASONABLE DOUBT, in a COURT OF LAW! \n \n Why? \n \n Because we are a PEOPLE of LAWS. \n \n Our government if founded not only on human principles of reason logic, and consent by the PEOPLE, but these principles are protected and established by LAW! \n \n Out traditions, our principles, and our laws are to be applied equally for all PEOPLE, no matter their Race, Creed, Color of Skin, Economic Status, Ethnicity, Country, Religion, Number of Operations, Physical Appearance, Name or Fame, or Number of TIMES they also have been found INNOCENT! \n \n In AMERICA, we pursue our happiness within the confines of LAWS that we are Governed. \n \n WE hold, that any person, JOE PUBLIC INCLUDED,,,,, be granted a Presumption of INNOCENCE! \n \n WE hold these PRINCIPLES of LAW as reasonable and true! \n \n Therefore he is innocent... in the public eye or not, he still is innocent, people have the right to assume that he's not be he is officially innocent for now (and will continue to be after this trial is over and done with... but u've already heard my opinion and very well know where I stand so there is no reason to tell u again.)\n\n \n Yeah, looks good on paper.", 
   {}, 
   25227, 
   null, 
   1070417220.0
  ], 
  [
   25468, 
   null, 
   "SparkleSocks22", 
   "Yeah, looks good on paper.\n\n \n Yea it does... so? He should still be granted all the rights that everyone else has. There is no reason for this thread... He is innocent until proven guilty, plain and simple.", 
   {}, 
   25230, 
   null, 
   1070556960.0
  ], 
  [
   25474, 
   null, 
   "sundowner", 
   "Yea it does... so? He should still be granted all the rights that everyone else has. There is no reason for this thread... He is innocent until proven guilty, plain and simple.\n\n \n Nobody argued that he should not have all the rights as everyone else until he receives a fair trial. Nobody is demanding he does not receive a fair trial. The reason for this thread is: This is a debate forum, and someone started a thread asking the opinion of the people whether or not he is guilty. It is possible to have a personal opinion, which many have displayed. If my personal opinion does not suit you, let me say this...I don't really care. It is my opinion, and when asked, I will publish it when and where I wish. If you have an objection to it, fine, but just know that I could not care less.", 
   {}, 
   25468, 
   null, 
   1070563200.0
  ], 
  [
   25496, 
   null, 
   "SparkleSocks22", 
   "Good we agree on at least one thing... we both could not care less what anyone else (especially eachother) thinks about the other's opinion.", 
   {}, 
   25474, 
   null, 
   1070576880.0
  ], 
  [
   26738, 
   null, 
   "ENDOMI", 
   "He Is Innocent, Its Call Innocent Until Proven Guilty U Iddiots.\n No One His Gone To Them Music Levels Michael Has Gone. None Of U Trying To Put Have Down Have Sold More Records Then Him.", 
   {}, 
   23626, 
   null, 
   1071111720.0
  ], 
  [
   26747, 
   null, 
   "Boopee20", 
   "What do I think?\n \n I think he is totally NOT guilty! Does anyone even keep up with what is happening? It is all a set up from that **** head cop. The parents of the boy who \"got raped\" knew what they were doing when they moved onto his estate 2 years ago, they got used to thier life style and now they want his ranch, the little pride he has left, and his life. He's been out of trouble for a long time. Everytime he is coming out with new record some bull comes out about him and little boys and its all hear-say. I LOVE MICHAEL JACKSON and always will. He is always innocent in my eyes. emoticon_xlove", 
   {}, 
   23397, 
   null, 
   1071114240.0
  ], 
  [
   26749, 
   null, 
   "Moderator", 
   "Please refrain from using profanity.", 
   {}, 
   26747, 
   null, 
   1071114720.0
  ], 
  [
   26753, 
   null, 
   "SparkleSocks22", 
   "F-I-N-A-L-L-Y emoticon_xagree", 
   {}, 
   26749, 
   null, 
   1071115500.0
  ], 
  [
   30923, 
   null, 
   "mamboni", 
   "Personally, I'm indifferent on this emotionally. I couldn't care less.\n However, it's easy to accept any allegations against this guy because of his appearance. \n I'm not sure if he committed any crimes or not, but if he did he needs to be locked away and rehabilitated.", 
   {}, 
   26753, 
   null, 
   1073933940.0
  ], 
  [
   31159, 
   null, 
   "sundowner", 
   "Personally, I'm indifferent on this emotionally. I couldn't care less.\n However, it's easy to accept any allegations against this guy because of his appearance. \n I'm not sure if he committed any crimes or not, but if he did he needs to be locked away and rehabilitated.\n\n \n I don't think it is about his appearance. If I heard the same story about T. Cruise, I would feel the same way. It is about a man who has repeatedly stated that there is nothing wrong with sharing your bed with children, the same man that was accused of having innappropriate relations with children in the past. I think the majority of the opinions shared here who support Wacko are because they like him as a musician, and are \"die hard\" fans. It seems as if they are saying...\"I love Wacko, he could never have done this...because I love him so much.\" Truth is that people who may be loved by the majority can still be predatory criminals. Look at J. Gotti for an example. Ask these people...If this was your non-famous neighbor...would you feel the same way?", 
   {}, 
   30923, 
   null, 
   1074079020.0
  ], 
  [
   31167, 
   null, 
   "mamboni", 
   "I think it's a bit peculiar the man owns a child's petting zoo and has mass sleepovers at time.\n I'm goin' to have to say guilty, because that's just plain obtuse.", 
   {}, 
   23626, 
   null, 
   1074085860.0
  ], 
  [
   39529, 
   null, 
   "shooting_star24", 
   "This is my opinion on the whole ordeal:\n Michael Jackson is a weirdo. He is a strange man. It's really a shame since he is very talented.\n \n Now, considering the molestation charges, I am not sure if he is innocent or guilty. I think that he could be guilty, but it might be just for money that this child is claiming he was molested. I do think that the tabloids are much too harsh on Mr. Jackson. I mean, that one documentary was a little one-sided.\n \n I'm not sure. I just am not going to care whether he is guilty or innocent.\n \n Though I think he WILL be found guilty. emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "My opinion"
    }
   }, 
   31167, 
   null, 
   1079374740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Michael Jackson, Guilty or Inocent?", 
  "url": "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 1280, 
  "discussion_files": [
   [
    "1349.html", 
    "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent-print.html"
   ], 
   [
    "1350.html", 
    "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent-5-print.html"
   ], 
   [
    "1351.html", 
    "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent-4-print.html"
   ], 
   [
    "1352.html", 
    "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent-3-print.html"
   ], 
   [
    "1353.html", 
    "http://www.4forums.com/political/crime-debates/1280-michael-jackson-guilty-inocent-2-print.html"
   ]
  ], 
  "identifier": 1280
 }
]