[
 [
  [
   355812, 
   null, 
   "antonia", 
   "An update on how much money Max Baucus has received from the health insurance and pharmaceutical industries. This conflict of interest has prompted single payer advocates to call for his stepping down leadership in health care reform. \n \n Senator Baucus has shut out from the process the majority of Americans' and physicians' support and voice for single payer.\n \n --------------------\n \n Why aren't single payer advocates allowed to testify before Baucus' committee? Follow the money. Campaign donations explain why, and demonstrate that the Senate Finance Committee should not be in charge of health care. Senator Reid should remove the health care reform bill from Baucus and start all over before the Health Committee in the Senate.\n \n Here's why Baucus is not doing the people's business:\n \n According to OpenSecrets.org, over his career he has taken donations from:\n \n The Insurance Industry: $1,170,313\n Health Professionals: $1,016,276\n Pharmaceuticals/Health Products Industry: $734,605\n Hospitals/Nursing Homes: $541,891\n Health Services/HMOs: $439,700\n \n That is a grand total of $3,902,785. Can we trust Baucus to put aside the profits of the industries that have kept him in the Senate? Will he put the people's necessities ahead of the profits of his contributors? Baucus has shown his bias and should be removed from leading the health care reform effort by the Democratic Party leadership.\n \n In 2008 Baucus had virtually no challenger in Montana. A little-known Republican was on the ballot, and Baucus won with 73% of the vote. But, Baucus sought big donations from big business anyway. He used his connections to corporations with business before his committee to raise an immense campaign fund of more than $11 million. In 2008, 91% of his donations come from individuals living outside of Montana, which is why he is more the \"Senator for K Street\" then the Senator for Montana. Corporate health profiteers who invested in Baucus will now benefit from his stewardship over health care reform. His 2008 donations from health care profiteers included:\n \n Insurance: $592,185\n Health Professionals: $537,141\n Pharmaceuticals/Health Products: $524,813\n Health Services/HMOs: $364,500\n Hospitals/Nursing Homes: $332,826\n \n That is $1,826,652 Baucus took from these industries, and now he can reward them by deforming health care reform.\n \n The health care profiteers knew that Baucus would determine their fate and ponied up. Now the only thing standing between them and their payback is a single payer national health care plan. Yet single payer, which would end private insurance and control the cost of pharmaceutical drugs, is not being considered-not even allowed to participate in the conversation before Baucus.\n \n It is not just the chairman of the committee who has received massive donations. The full Finance Committee is a gluttonous embarrassment of campaign pay-offs. In 2008 the committee members received a total of $13,263,986 from industries affected by health care reform. Can we trust this committee to put the interests of the people before their donors?\n \n The donations to the Finance Committee in 2008 included:\n \n Insurance: $5,103,900\n Pharmaceuticals/Health Products: $3,308,831\n Hospitals/Nursing Homes: $2,809,353\n Health Services/HMOs: $2,041,902\n These industries expect to be rewarded with billions, even trillions, in profits and hundreds of millions in corporate welfare. Senator Baucus's behavior shows they have made a good investment-they've bought themselves a senator who should be called Chairman Blagojevich. He is doing his best to make sure the single payer message is not heard because he knows it is the fairest, most efficient and cost-effective way to ensure health care access for all Americans-but he can't let that be implemented because it would put some of his donors out of business and control the profits of others.\n \n It is time to remove Baucus from the leadership of health care reform. It is time to move the critically important priority of reforming America's health care system from the Finance Committee and put it before the Senate Health, Education, Labor and Pensions Committee. At least their mission is health care, not money.\n \n Kevin Zeese is the executive director of the FreshAirCleanPolitics.net, which is urging a single payer national health care system as part of its ProsperityAgenda.US project. Along with seven others, Zeese was arrested when he testified from the audience of a recent Senate Finance Committee meeting on health care. See the video on YouTube.\n \n Max Baucus Should Not Be Deciding Health Care for America\n \n --------------------------", 
   {
    "post_info": {
     "post_title": "Baucus' Campaign Contributions"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1243932660.0
  ], 
  [
   355838, 
   null, 
   "CUNxTime", 
   "It's disgusting what our political system is becoming, regardless of the issue the money is backing.", 
   {}, 
   355812, 
   null, 
   1243956480.0
  ], 
  [
   355973, 
   null, 
   "antonia", 
   "It's disgusting what our political system is becoming, regardless of the issue the money is backing.\n\n \n The money backing, how that works, is what makes it disgusting.", 
   {}, 
   355838, 
   null, 
   1243986060.0
  ], 
  [
   356027, 
   null, 
   "CUNxTime", 
   "The money backing, how that works, is what makes it disgusting.\n\n \n Exactly...whether its an issue I agree with or one I oppose, the money is corrupting those in power on both sides of every issue.", 
   {}, 
   355973, 
   null, 
   1243996620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Baucus' Campaign Contributions", 
  "url": "http://www.4forums.com/political/health-debates/12817-baucus-campaign-contributions.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 12817, 
  "discussion_files": [
   [
    "7722.html", 
    "http://www.4forums.com/political/health-debates/12817-baucus-campaign-contributions-print.html"
   ]
  ], 
  "identifier": 12817
 }
]