[
 [
  [
   356563, 
   null, 
   "Accipiter", 
   "I am interested in learning about what it was like when you first realized that the bible or a religion was something you wanted to be a part of. \n \n Were you struck by the notion all at once or did it take a long time?\n \n Did you have some kind of religious experience that moved you to believe?\n \n What did it feel like, did you have any related physical sensation?\n \n If your experience was unlike any of the above please describe it.", 
   {
    "post_info": {
     "post_title": "Religious Experiences Wanted"
    }
   }, 
   null, 
   null, 
   1244295660.0
  ], 
  [
   356576, 
   null, 
   "jirmwarfare", 
   "Although I did know of Christianity before the \"event\" from my foster mother, I did not know in the sense of real belief. A (thankfully) failed suicide attempt was sort of the catalyst. By pills and car exhaust. To this day I can't explain my living at all much less having a liver left after a ton of tylenol-3s. I wasn't found for quite some time, unconscious but able to be woken. I say sort of the catalyst because for many months after I had attitude of \"I couldn't even do that right\". \n \n So during the following months (18 months altogether) I began to experience little mini signs, I suppose you'd call them. Like I was being directed to perceive things differently. Not the hard core red sea miracle stuff, but normal everyday stuff. Like I'm short my rent and about to be evicted and given up looking for a job and suddenly from a very unexpected source (an enemy in fact) I'm offered a job and somehow manage an advance for the rent. Other things to that effect what I believe they call class-B miracles (not direct intervention by God but sort of using other means to further His plan). \n \n Remembering back to various points in my life I collected evidence of many of these examples. Like I was being directed in that way, where before I wouldn't have even cared for those things. It wasn't an otherwordly feeling but more of an uncanny type focusing on those events followed by a certainty and sort of peace and joy about it. Felt the happiness allright. More and more of this happened. I denied it was the God of my mother many times, but kind of these overpowering thoughts that you can't get rid of convinced me that it was. As it turned out I was able to honor my mother by repenting and praying with her and accepting Jesus for real, as my Friend and personal God and Savior. It did turn out that a mother's prayers had some power. :)", 
   {}, 
   356563, 
   null, 
   1244305320.0
  ], 
  [
   356617, 
   null, 
   "Zardoz", 
   "Well, she was a young thing with little experience and a lot of desire for some kinky fun. Her hair was naturally red and she has an ample booossssooomm.\n The other one was some ditzy bi chick looking for some free love. Cute with a nice bod.\n Then there was...\n And...\n And that's just been the past week.\n \n After awhile of this, I realized I must be god.\n \n After all...they're on their knees in prayer...\n \n And unlike all those false gods...I answer prayers at times and grant boons to those who worship me.", 
   {}, 
   356576, 
   null, 
   1244370780.0
  ], 
  [
   356698, 
   null, 
   "greentwiga", 
   "I was searching kinda similar to Ecclesiastes. Everything I tried seemed worthless. This included Sex (hi Zardoz) money, great knowledge, and others. I began looking at various religions, but they didn't satisfy. I met a Christian cult group that only intrigued me enough to read the Bible. The Bible told me to give up my life and I would gain something (I was kinda confused on what but was tilling to try) I thought, OK I'm gonna try this, and then went to sleep. Soon, I was traveling cross country and noticing my life change. Everybody unloaded their pet interpretations of what was happening, but not until I met a group of Christians did something agree, \"this is what happened to me.\" Much later, I read the book of first John and saw all the changes that happened to me listed clearly. My faith is not based on a leap in the dark, or an emotional experience, but on the promise of the Holy Spirit changing lives and seeing those changes, all as a down payment guaranteeing the things to come.", 
   {}, 
   356617, 
   null, 
   1244445480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Religious Experiences Wanted", 
  "url": "http://www.4forums.com/political/religion-debates/12836-religious-experiences-wanted.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12836, 
  "discussion_files": [
   [
    "21409.html", 
    "http://www.4forums.com/political/religion-debates/12836-religious-experiences-wanted-print.html"
   ]
  ], 
  "identifier": 12836
 }
]