[
 [
  [
   356585, 
   null, 
   "JakeCJB", 
   "Someone emailed me the following--\n \n \n An Australian's Definition of a Canadian \n \n \n Once \n in a while someone does a nice job of describing a Canadian. \n This time it was an Australian dentist. \n In \n case anyone asks you who a Canadian is . . \n . \n \n \n \n \n \n \n An \n Australian's Definition of a Canadian - \n \n \n \n \n \n \n You \n probably missed it in the local news, but there was a report \n that someone in Pakistan had advertised in a newspaper an \n offer of a reward to anyone who killed a Canadian - any \n Canadian. \n \n \n \n \n \n An \n Australian dentist wrote the following editorial to help \n define what a Canadian is, so they would know one when they \n found one: \n \n \n \n \n \n \"A \n Canadian can be English, or French, or Italian, Irish, German, \n Spanish, Polish, Russian or Greek. A Canadian can be Mexican, \n African, Indian, Chinese, Japanese, Korean, Australian, \n Iranian, Asian, Arab, Pakistani or Afghan. \n \n \n \n \n \n \n A \n Canadian may also be a Cree, Métis, Mohawk, Blackfoot, Sioux, \n or one of the many other tribes known as native \n Canadians. \n \n \n \n \n \n A \n Canadian's religious beliefs range from Christian, Jewish, \n Buddhist, Muslim, Hindu or none. In fact, there are more \n Muslims in Canada than in Afghanistan . The key difference is \n that in Canada they are free to worship as each of them \n chooses. Whether they have a religion or no religion, each \n Canadian ultimately answers only to God, not to the \n government, or to armed thugs claiming to speak for the \n government and for God. \n \n \n \n \n \n A \n Canadian lives in one of the most prosperous lands in the \n history of the world. The root of that prosperity can be found \n in the Charter of Rights and Freedoms which recognize the \n right of each person to the pursuit of \n happiness. \n \n \n \n \n \n A \n Canadian is generous and Canadians have helped out just about \n every other nation in the world in their time of need, never \n asking a thing in return. \n \n \n \n \n \n Canadians \n welcome the best of everything: the best products, the best \n books, the best music, the best food, the best services and \n the best minds. But they also welcome the least - the \n oppressed, the outcast and the rejected. \n \n \n \n \n \n \n These \n are the people who built Canada . \n \n \n \n \n \n \n You \n can try to kill a Canadian if you must as other blood-thirsty \n tyrants in the world have tried, but in doing so you could \n just be killing a relative or a neighbor. This is because \n Canadians are not a particular people from a particular place. \n They are the embodiment of the human spirit of freedom. \n Everyone who holds to that spirit, everywhere, can be a \n Canadian.\" \n \n \n \n \n \n Please \n keep this going! Pass this around the World. Then pass it \n around again. It says it all, for all of us.\n \n \n \n \n \n \n \n \n \n \n 'Keep your stick on the ice'", 
   {
    "post_info": {
     "post_title": "Finding A Canadian Target"
    }
   }, 
   null, 
   null, 
   1244319420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Finding A Canadian Target", 
  "url": "http://www.4forums.com/political/politics-debates/12838-finding-canadian-target.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12838, 
  "discussion_files": [
   [
    "25394.html", 
    "http://www.4forums.com/political/politics-debates/12838-finding-canadian-target-print.html"
   ]
  ], 
  "identifier": 12838
 }
]