[
 [
  [
   357162, 
   null, 
   "simone", 
   "You're in America and every angry white male has a gun!\n \n As a matter of fact, he has two or three or four or more, enough ammo to stock an army for a year and a basement full of explosives.\n \n See that one over there, that really old guy?\n \n He hates Jews and \"Negroes\" and the solemnity of the Holocaust is not going to stop him from shooting down an innocent.\n \n That man there? He hates women and doctors and doesn't hesitate to spill blood in a church.\n \n That fellow? He hates cops and the government because they're coming after your guns.\n \n And that fellow? He hates liberals and all the people in Bernard Goldberg's book 100 People Who Are Screwing Up America so he's going to shoot up a Unitarian church and kill some liberals.\n \n That man? He hates little girls in Amish dress and he likes to shoot them.\n \n And Bill O'Reilly chants:\n \nTiller the baby killer! Tiller the baby killer!\n\n And the rest of the Greek chorus joins him in spewing hate speech:\n \n Glenn Beck, Sean Hannity, Rush Limbaugh, Michelle Malkin, Ann Coulter, Laura Ingraham ...", 
   {
    "post_info": {
     "post_title": "Hit the Floor! Hit the Floor!"
    }
   }, 
   null, 
   null, 
   1244743500.0
  ], 
  [
   357163, 
   null, 
   "CUNxTime", 
   "You're in America and every angry white male has a gun!\n \n \n\n \n That's why I'm glad I own guns. I don't care what color a person is. All I need to know is that if they come to my house and want to kill me, for my views or for my television, I can protect myself.", 
   {}, 
   357162, 
   null, 
   1244743620.0
  ], 
  [
   357164, 
   null, 
   "simone", 
   "Hey, as long as you don't pack your heat in churches or museums or places in DC where you can take out security people, or you're not going around to shoot cops, enjoy your guns.", 
   {}, 
   357163, 
   null, 
   1244743740.0
  ], 
  [
   357166, 
   null, 
   "CUNxTime", 
   "That's kinda my point...I don't do all that because it #1 wrong and #2 illegal. Making a law to take the guns outta my hands won't help any of those issues (because they are already illegal).", 
   {}, 
   357164, 
   null, 
   1244744940.0
  ], 
  [
   357170, 
   null, 
   "simone", 
   "Who the devil is going to take the guns out of your hands?\n \n Have you been listening to too much Glenn Beck?\n \n That guy's a royal nutcase!", 
   {}, 
   357166, 
   null, 
   1244746320.0
  ], 
  [
   357171, 
   null, 
   "simone", 
   "Rachel Maddow, June 8 2009:\n \nWe begin tonight with another deadly act of domestic terrorism. The first time a doctor was murdered by the modern anti-abortion terrorist movement in America was March 1993. Anti-abortion demonstrators were protesting at a clinic in Pensacola, Florida. As Dr. David Gunn arrived at a clinic, a young man named Michael Griffin shot Dr. Gunn several times in the chest with a snub-nose .38 revolver.\n \n Michael Griffin, the killer, became a cause celebre among anti-abortion extremists. He was associated with the group called Rescue America, which said after Griffin killed Dr. Gunn that while they did not condone the killing, they didn't condemn it either.\n \n Five months after Dr. David Gunn was killed, another doctor, George Tiller-yes, the same Dr. Tiller from today's headlines-was shot by a woman named Shelly Shannon. Shannon had written letters of support for Michael Griffin, who killed Dr. David Gunn. She called him a hero.\n \n In 1992 and 1993, Shelly Shannon set fires and used acid to attack at least 10 abortion clinics in Oregon, California, Idaho and Nevada. In 1993, she went to Wichita, Kansas, and used a semiautomatic pistol to shoot Dr. George Tiller in each of his arms outside the clinic at which he worked.\n \n While she was in prison, Ms. Shannon signed on to a pledge of support for Paul Hill, the murderer of yet another American doctor. In June 1994, Paul Hill shot to death Dr. George Britton and a 74-year-old clinic escort named James Barrett, and he seriously wounded Mr. Barrett's wife.\n \n Six months later, a man named John Salvi walked into two clinics in Brookline, Massachusetts, and killed two receptionists and wounded five other people. In January 1998, yet another murder-security guard Robert Sanderson was killed and a nurse named Emily Lyons was critically injured by a nail bomb that exploded at an Alabama abortion clinic at which they worked. That bomb was planted by a man named Eric Rudolph.\n \n Eric Rudolph had also bombed another abortion clinic and a gay bar in Atlanta the year before and he had famously bombed the Atlanta Olympics the year before that, killing Alice Hawthorne and wounding 111 other people. The Atlanta Olympics bombing was a terrorist act committed by an anti-abortion extremist.\n \n In October 1998, another murder-in Amherst, New York, Dr. Barnett Slepian was standing inside his house when James Kopp shot and killed him with a sniper rifle. Kopp was a member of an anti-abortion extremist group that calls itself the Lambs of Christ.\n \n And [last Sunday], George Tiller was shot again. This time, it was inside his church in Wichita. He was killed instantly. A man named Scott Roeder is the suspect in custody in this case. He's known in extremist anti-abortion circles. He has had writings published in a newsletter called \"Prayer and Action News,\" which promotes the idea of killing people who provide abortion services as justifiable homicide.\n \n Someone calling himself Scott Roeder had participated in anti-abortion discussion at a Web site of the group called Operation Rescue. The group's founder, Randal Terry, spoke at the National Press Club today and celebrated Dr. George Tiller's death.\n\n Rachel Maddow: Right-Wing Terrorism Must Be Stopped | Reproductive Justice and Gender | AlterNet", 
   {
    "unicode_changes_made": true
   }, 
   357170, 
   null, 
   1244746500.0
  ], 
  [
   357172, 
   null, 
   "CUNxTime", 
   "I thought that's what your post was implying. I didn't think you were just listing reasons for fear/hate white men.", 
   {}, 
   357170, 
   null, 
   1244746560.0
  ], 
  [
   358069, 
   null, 
   "simone", 
   "I don't fear or hate white man.\n \n I just think that a man who desperately needs to have a gun is not, erm, very manly.", 
   {}, 
   357172, 
   null, 
   1245523980.0
  ], 
  [
   358269, 
   null, 
   "DrNo", 
   "I don't fear or hate white man.\n \n I just think that a man who desperately needs to have a gun is not, erm, very manly.\n\n \n Wow, what a sexist remark.", 
   {}, 
   358069, 
   null, 
   1245679860.0
  ], 
  [
   358292, 
   null, 
   "simone", 
   "Pssst! No! You're really reaching there!", 
   {}, 
   358269, 
   null, 
   1245696540.0
  ], 
  [
   358329, 
   null, 
   "Symbiote", 
   "Personally, I think that a woman that needs to have a job is not very feminine and obviously suffers from penis envy. I mean ethnic jobs I can accept maybe, being a maid or cleaner, but those uppity white trash working in offices are really quite butch.", 
   {}, 
   358292, 
   null, 
   1245715620.0
  ], 
  [
   358412, 
   null, 
   "simone", 
   "And you, dear Symbiote, are making a feeble attempt to be combative, provocative, inflammatory. \n \n Try again.", 
   {}, 
   358329, 
   null, 
   1245784500.0
  ], 
  [
   358456, 
   null, 
   "Symbiote", 
   "Sorry I thought this was the thread where you make pointless sexist generalisations.", 
   {}, 
   358412, 
   null, 
   1245801480.0
  ], 
  [
   358512, 
   null, 
   "CUNxTime", 
   "Sorry I thought this was the thread where you make pointless sexist generalisations.\n\n \n Just like a MAN!", 
   {}, 
   358456, 
   null, 
   1245865020.0
  ], 
  [
   365700, 
   null, 
   "Ethmi", 
   "I don't fear or hate white man.\n \n I just think that a man who desperately needs to have a gun is not, erm, very manly.\n\n \n If you're going to rant about this fair fight BS, you must think an average guy could win a \"fair\" fight with the Governator or Chuck Norris.\n \n So if a gun makes a man less than a man, then what do you suggest my 96 year old grandpa defend himself with if a young, 20-some year old guy breaks into his home?", 
   {}, 
   358069, 
   null, 
   1250503200.0
  ], 
  [
   365703, 
   null, 
   "Ethmi", 
   "You're in America and every angry white male has a gun!\n \n As a matter of fact, he has two or three or four or more, enough ammo to stock an army for a year and a basement full of explosives.\n \n See that one over there, that really old guy?\n \n He hates Jews and \"Negroes\" and the solemnity of the Holocaust is not going to stop him from shooting down an innocent.\n \n That man there? He hates women and doctors and doesn't hesitate to spill blood in a church.\n \n That fellow? He hates cops and the government because they're coming after your guns.\n \n And that fellow? He hates liberals and all the people in Bernard Goldberg's book 100 People Who Are Screwing Up America so he's going to shoot up a Unitarian church and kill some liberals.\n \n That man? He hates little girls in Amish dress and he likes to shoot them.\n \n And Bill O'Reilly chants:\n \n And the rest of the Greek chorus joins him in spewing hate speech:\n \n Glenn Beck, Sean Hannity, Rush Limbaugh, Michelle Malkin, Ann Coulter, Laura Ingraham ...\n\n \n Let's talk ELF.\n \n See that environmentalist over there? He murdered a forester to save the trees.\n \n See that guy over there? He caused thousands of dollars in damage to construction equipment.\n \n What about that guy? He burnt down a large construction project to send message.\n \n And that guy? He burnt down a condominum and left a banner there that said \"If you build it we burn it.\"\n \n And Al Bore, Arnold Schwarzenegger, Michael Bloomberg, and Henry Waxman are all environmentalists.\n \n But Simone, do you think it's reasonable for me to judge environmentalists this way? Is it reasonable for me to say that guys who have mustaches are evil because Hitler had one?\n \n It's not reasonable for you to judge pro-gun advocates this way either. I've noticed that, like you, alot of left-wingers like to label anyone who disagrees with them as an extremist.", 
   {}, 
   357162, 
   null, 
   1250504340.0
  ], 
  [
   365708, 
   null, 
   "OldSarge", 
   "You're in America and every angry white male has a gun!\n \n As a matter of fact, he has two or three or four or more, enough ammo to stock an army for a year and a basement full of explosives.\n \n See that one over there, that really old guy?\n \n He hates Jews and \"Negroes\" and the solemnity of the Holocaust is not going to stop him from shooting down an innocent.\n \n That man there? He hates women and doctors and doesn't hesitate to spill blood in a church.\n \n That fellow? He hates cops and the government because they're coming after your guns.\n \n And that fellow? He hates liberals and all the people in Bernard Goldberg's book 100 People Who Are Screwing Up America so he's going to shoot up a Unitarian church and kill some liberals.\n \n That man? He hates little girls in Amish dress and he likes to shoot them.\n \n And Bill O'Reilly chants:\n \n And the rest of the Greek chorus joins him in spewing hate speech:\n \n Glenn Beck, Sean Hannity, Rush Limbaugh, Michelle Malkin, Ann Coulter, Laura Ingraham ...\n\n \n Yep and black on black gun crimes are nil! I have land for sale, its low tide we can see it.", 
   {}, 
   357162, 
   null, 
   1250514180.0
  ], 
  [
   371537, 
   null, 
   "zsu2357", 
   "I don't fear or hate white man.\n \n I just think that a man who desperately needs to have a gun is not, erm, very manly.\n\n \n I will admit I am way late here but what the heck right?if you saw my GUN you would fear it to death.I agree with Symbiote , i thought this was the thread where you make pointless sexist generalizations.If you think a gun makes a man less of one, then I guess you have never met one yet,probably never will,and thats all I got to say about that.emoticon_love", 
   {}, 
   358069, 
   null, 
   1253926800.0
  ], 
  [
   371597, 
   null, 
   "simone", 
   "Let's talk ELF.\n \n See that environmentalist over there? He murdered a forester to save the trees.\n \n See that guy over there? He caused thousands of dollars in damage to construction equipment.\n \n What about that guy? He burnt down a large construction project to send message.\n \n And that guy? He burnt down a condominum and left a banner there that said \"If you build it we burn it.\"\n \n And Al Bore, Arnold Schwarzenegger, Michael Bloomberg, and Henry Waxman are all environmentalists.\n \n But Simone, do you think it's reasonable for me to judge environmentalists this way? Is it reasonable for me to say that guys who have mustaches are evil because Hitler had one?\n \n It's not reasonable for you to judge pro-gun advocates this way either. I've noticed that, like you, alot of left-wingers like to label anyone who disagrees with them as an extremist.\n\n Documentation please?\n \n Thank you.", 
   {}, 
   365703, 
   null, 
   1253993280.0
  ], 
  [
   371599, 
   null, 
   "simone", 
   "Yep and black on black gun crimes are nil! I have land for sale, its low tide we can see it.\n\n The average American has more to fear from an armed white man than from an armed black man.\n \n In the first place, there are far fewer armed black men.\n \n In the second place, you'd have to go out of your way to connect with an armed black man, whereas I probably cross the path of 20 or so armed white men every day I go outside my house. Packing concealed heat, legally or not.", 
   {}, 
   365708, 
   null, 
   1253993460.0
  ], 
  [
   371660, 
   null, 
   "OldSarge", 
   "The average American has more to fear from an armed white man than from an armed black man.\n \n In the first place, there are far fewer armed black men.\n \n In the second place, you'd have to go out of your way to connect with an armed black man, whereas I probably cross the path of 20 or so armed white men every day I go outside my house. Packing concealed heat, legally or not.\n\n \n There may be fewer armed black men because there are fewer black men. Find some statistics on black on black crime, preferrably at DOJ and get back to me. Since they are concealed you are either psychic or delusional. which is it? ", 
   {}, 
   371599, 
   null, 
   1254039180.0
  ], 
  [
   371663, 
   null, 
   "zsu2357", 
   "The average American has more to fear from an armed white man than from an armed black man.\n \n In the first place, there are far fewer armed black men.\n \n In the second place, you'd have to go out of your way to connect with an armed black man, whereas I probably cross the path of 20 or so armed white men every day I go outside my house. Packing concealed heat, legally or not.\n\n \n I see the point your trying to make but-the bullet from said gun firing it don't know the difference between black or white, green or purple for that matter.emoticon_smile", 
   {}, 
   371599, 
   null, 
   1254039540.0
  ], 
  [
   371705, 
   null, 
   "simone", 
   "Bullets don't know the color of their victims but gunners do.", 
   {}, 
   371663, 
   null, 
   1254077040.0
  ], 
  [
   371720, 
   null, 
   "OldSarge", 
   "Bullets don't know the color of their victims but gunners do.\n\n \n Find some statistics on black on black crime, preferrably at DOJ and get back to me. Since they are concealed you are either psychic or delusional. which is it?\n \n \"The statistics tell a tragic story. According to federal crime figures, homicide is the leading cause of death among African-American males aged 15 to 34. They also indicate that between 1976 and 2004, 94 percent of black murder victims were killed by black offenders. While \"black-on-black crime\" is having a devastating impact in Minnesota and across the country, its racial overtones have made it a difficult problem to address or even discuss. In this story, three community leaders weigh in on the roots of black-on-black crime and what, if anything, can be done about it.\"\n \n \"While African Americans comprise 12% of the U.S. population, 45% of all murder victims in 2002 were African American, 91% of whom were killed by African Americans. Nationally, homicide is the leading cause of death for black men and second leading cause of death for black women ages 15-24. United States spends an average of over $4.5 billion on emergency and physical/occupational therapy associated with crime-related injuries/deaths.\"\n Black On Black Crime Coalition\n But you knew that, just didn't want to fess up.", 
   {}, 
   371705, 
   null, 
   1254084720.0
  ], 
  [
   371751, 
   null, 
   "Ethmi", 
   "Documentation please?\n \n Thank you.\n\n \n Are you blonde? That's not even the point. The point is that your \"logic\" is horse ****. You're not stereotyping, you're going well beyond stereotyping. You read things with the monitor, not the keyboard.", 
   {}, 
   371597, 
   null, 
   1254109860.0
  ], 
  [
   371752, 
   null, 
   "Ethmi", 
   "Bullets don't know the color of their victims but gunners do.\n\n \n You know you've won when you're not a racist, have made no racist comments, yet your opponent resorts to calling you a racist.", 
   {}, 
   371705, 
   null, 
   1254109980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hit the Floor! Hit the Floor!", 
  "url": "http://www.4forums.com/political/crime-debates/12855-hit-floor-hit-floor.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 12855, 
  "discussion_files": [
   [
    "7953.html", 
    "http://www.4forums.com/political/crime-debates/12855-hit-floor-hit-floor-print.html"
   ], 
   [
    "7954.html", 
    "http://www.4forums.com/political/crime-debates/12855-hit-floor-hit-floor-2-print.html"
   ]
  ], 
  "identifier": 12855
 }
]