[
 [
  [
   357230, 
   null, 
   "foundit66", 
   "LOS ANGELES - Miss California USA Carrie Prejean, who stirred up a hornet's nest of controversy when she said gays shouldn't be allowed to marry, got the word from pageant poobah Donald Trump today: \"You're fired.\"\n \n But Trump and other pageant leaders said Prejean was being sacked not because of her controversial remarks but because she hadn't been holding up her end of the agreement she signed when she entered the pageant.\n \n \"This was a decision based solely on contract violations, including Ms. Prejean's unwillingness to make appearances on behalf of the Miss California USA organization,\" the California pageant's executive director, Keith Lewis, said in a statement.\n \n He had complained at a news conference last month that Prejean was skipping Miss California USA events while speaking out against gay marriage at unsanctioned appearances.\n \n After the complaints reached Trump, who owns Miss California USA's parent organization, the mogul decided to give her a second chance and keep her on. On Thursday he changed his mind and sided with Lewis.\n \n \"I told Carrie she needed to get back to work and honor her contract with the Miss California USA Organization and I gave her the opportunity to do so,\" Trump said in a statement. \"Unfortunately it just doesn't look like it is going to happen.\"\n \n Pageant officials said Prejean would be replaced by the Miss California pageant's first runner-up, Tami Farrell. \n\n Donald Trump fires Miss California Carrie Prejean - San Jose Mercury News\n \n Too busy playing anti-gay marriage spokesperson to do her job as Miss California... emoticon_rolleyes\n \n And then, the predictable response from the anti-gay marriage side...", 
   {
    "post_info": {
     "post_title": "Donald Trump fires Miss California Carrie Prejean"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1244782440.0
  ], 
  [
   357231, 
   null, 
   "foundit66", 
   "\"Hollywood hates Carrie. First they abuse her, then they try to get her to recant, then they threw mud, and now they are doing what they wanted to do from day one: Get rid of Carrie.\n \n This cover story about a contract dispute doesn't pass the smell test. Americans aren't fooled that easily. God knows, and we know, the truth about Carrie: She's a young woman of great beauty who chose truth over the glittering tiara that Hollywood offers,\" said Brian Brown, Executive Director for NOM. \"Of course they will try to punish her, but we know she will be fine in the end, because her values are in the right place.\"\n \n \"Hollywood will dance its tribal war dance over her body--the hatred generated against her has been extraordinary--but Carrie will be free to define her own mission and message from now on. Congratulations,\" stated Maggie Gallagher, President for NOM. \n\n http://www.nationformarriage.org/site/apps/nlnet/content2.aspx?c=omL2KeN0LzH&b=5075187&content_id={AFA5FA5C-D506-4E25-B901-128E1796E6CB}&notoc=1\n \n She gets fired because she doesn't meet her Miss California commitments.\n The anti-gay marriage side tries to pretend it's all about how people don't like her stance against gay marriage... :rolls\n \n 1) NO. She did NOT lose Miss U.S.A. because of her view. She was firmly in second place BEFORE the Q&A forum, publicly recognizable by the fact that her swimsuit and evening gown scores were MARKEDLY LOWER than the winner.\n (If her Q&A had cost her anything, she would have gotten THIRD instead of second cause third place was a LOT CLOSER to Prejean than she was to first place.)\n \n 2) Donald could have legitimately fired her for lying about her semi-nude photos, but he chose not to. That alone should demonstrate a lack of bias based on a stupid answer.\n \n 3) SHE WAS WARNED to start making her contractual commitments for the Miss California events. She ignored them.\n \n 4) And THEN she gets fired. After all that.\n And NOM wants to paint her as a victim... emoticon_frazzled\n Why is it that the anti-gay side PERPETUALLY pretending to be a victim, when it is they who espouse discrimination? emoticon_emb", 
   {
    "unicode_changes_made": true
   }, 
   357230, 
   null, 
   1244782740.0
  ], 
  [
   357234, 
   null, 
   "Symbiote", 
   "I do wonder whether these \"two minute hates\" towards media demons are a kind of control mechanism, where by directing your concern towards trivialities you are prevented from engaging with anything meaningful.\n \n Two Minutes Hate - Wikipedia, the free encyclopedia\n \n There will always be someone politically incorrect for you to hate. Keep fighting the good fight, brother.", 
   {}, 
   357231, 
   null, 
   1244783220.0
  ], 
  [
   357256, 
   null, 
   "jyoshu", 
   "Doncha' just love the focus of things the gay rights movement seems to want to talk about these days (if this board lately is any indication)?\n \n Beauty pageant contestants and duck sex.\n \n Wow. Progressivism is just outdoing itself lately.", 
   {}, 
   357234, 
   null, 
   1244823240.0
  ], 
  [
   357267, 
   null, 
   "Bad Mojo", 
   "Doncha' just love the focus of things the gay rights movement seems to want to talk about these days (if this board lately is any indication)?\n \n Beauty pageant contestants and duck sex.\n \n Wow. Progressivism is just outdoing itself lately.\n\n \n Lame. Why do you ignore every other thread on this forum to bring up two examples?\n \n Duck Sex which is nothing but a little comedy based on the rantings of those on the right who have compared sex with ducks, turtles and dolphins to gay sex. So, yeah....rightfully it's going to be made fun of and why not?\n \n As far as beauty pageant contestants, she is an out and about spokesperson for NOM, why wouldn't she be talked about? You had no problem conversing about her and Perez Hilton elsewhere, why the change of mind? \n \n Anyway, what about the debates that refer to religion, civil rights, pedophilia (right wing slop) and of course the constitution? I'm kind of new here but are you the one in charge of all that is worthy to post on every single topic, or are you just attempting in vain to make an inane point about the debate of gay marriage? Oh, that kind of was your point wasn't it and you chose to demonstrate by example? How clever!", 
   {}, 
   357256, 
   null, 
   1244834820.0
  ], 
  [
   357320, 
   null, 
   "jyoshu", 
   "Lame. Why do you ignore every other thread on this forum to bring up two examples?\n\n \n You're welcome to comment on whatever aspect of the issues you want. I'm just pointing out what a lot of the conversation has been on lately. And frankly, I suspect the Ms America organization is milking/prolonging this for all it's worth. Controversy is good for bidness. :)", 
   {}, 
   357230, 
   null, 
   1244863200.0
  ], 
  [
   357321, 
   null, 
   "foundit66", 
   "Doncha' just love the focus of things the gay rights movement seems to want to talk about these days (if this board lately is any indication)?\n Beauty pageant contestants and duck sex.\n Wow. Progressivism is just outdoing itself lately.\n\n First of all, the \"duck sex\" was ultimately about Pat Robertson's stupid claim.\n If you bothered to realize, you'd see that a similar claim has been bandied about in CONGRESS ITSELF regarding how some people obtusely think hate crimes legislation protecting sexual orientation will somehow protect bestiophiles...\n But I guess if \"duck sex\" is all you got from that thread, failing to recognize why it was an issue in the first place, that would be par for your course, eh?\n \n Secondly, It's funny how you label this as \"Progressivism is just outdoing itself\"...\n After all, there are TWO SIDES to the issue, aren't there?\n \n Are the anti-gay conservatives \"outdoing\" themselves as well? Where is their presence trying to start threads justifying anti-gay discrimination or opposition to gay equality measures?\n Or are they just too pathetic to bring up, considering we have thread after thread of their obvious bigotry already posted around here?\n \n \n \nAnyway, what about the debates that refer to religion, civil rights, pedophilia (right wing slop) and of course the constitution? I'm kind of new here but are you the one in charge of all that is worthy to post on every single topic, or are you just attempting in vain to make an inane point about the debate of gay marriage? Oh, that kind of was your point wasn't it and you chose to demonstrate by example? How clever!\n\n You noticed that too, huh...\n \n That's Jyoshu. Forever claiming he is \"for\" gay equality, but at the same time eternally defending and obfuscating for the actions of the anti-gay, while criticizing those who further gay equality...\n \n Quite frankly, one of his latest tactics against people pointing out the discrimination is to snidely say *Yes. We all acknowledge gays are discriminated against* (even though that's a false claim on his part).\n Which is kind of funny in the context of his last statement, cause he appears to be complaining there aren't enough threads showing anti-gay discrimination for his taste... emoticon_rolleyes\n \n \n \nYou're welcome to comment on whatever aspect of the issues you want.\n\n Like you have commented on the issue of Prejean in this thread?\n Oh wait. No. You haven't.\n You've just whined about others talking about her...", 
   {}, 
   357256, 
   null, 
   1244863260.0
  ], 
  [
   357322, 
   null, 
   "Symbiote", 
   "Did you hear the latest news on ange and brad, oh my god I cant believe it, i just feel so sorry for her", 
   {}, 
   357321, 
   null, 
   1244865900.0
  ], 
  [
   357445, 
   null, 
   "jyoshu", 
   "Did you hear the latest news on ange and brad, oh my god I cant believe it, i just feel so sorry for her\n\n \n What's been happnin' with Tom n' Katy this week.. anyone know? LOL\n \n It'll also be interesting to see if these folks who couldn't wait to bring up Prejean's photos are going to now give equal time (or any time, LOL) to the Dustin Lance Black thing? More likely there will pretty much be hypocritical silence on that. I guess there's always some chance of snow in ... um, the underworld.", 
   {}, 
   357322, 
   null, 
   1245006300.0
  ], 
  [
   357453, 
   null, 
   "foundit66", 
   "What's been happnin' with Tom n' Katy this week.. anyone know? LOL\n\n And still nothing topical to add...\n Why am I not surprised?\n \n \n \nIt'll also be interesting to see if these folks who couldn't wait to bring up Prejean's photos are going to now give equal time (or any time, LOL) to the Dustin Lance Black thing? More likely there will pretty much be hypocritical silence on that. I guess there's always some chance of snow in ... um, the underworld.\n\n You fail to recognize a critical difference.\n Prejean aligned herself with the \"moral\" pro-family side. A side that embraced her for her publicity so that they could point to the sins of others, but then they ignored her own sins.\n She took pictures with the intent to distribute for her popularity. And then she LIED (great morals there) about the pictures.\n \n Dustin Lance Black? emoticon_rolleyes\n Never (to my knowledge) pretended to align himself with any \"moral\" outcry.\n Took PRIVATE photos with him and a lover, and that lover then proceeded to distribute photos which were never meant to be distributed.", 
   {}, 
   357445, 
   null, 
   1245011520.0
  ], 
  [
   357470, 
   null, 
   "Bad Mojo", 
   "You noticed that too, huh...\n \n That's Jyoshu. Forever claiming he is \"for\" gay equality, but at the same time eternally defending and obfuscating for the actions of the anti-gay, while criticizing those who further gay equality...\n \n Quite frankly, one of his latest tactics against people pointing out the discrimination is to snidely say *Yes. We all acknowledge gays are discriminated against* (even though that's a false claim on his part).\n Which is kind of funny in the context of his last statement, cause he appears to be complaining there aren't enough threads showing anti-gay discrimination for his taste... emoticon_rolleyes\n\n I think it's a compliment on his part to the gay community. He obviously holds them to a higher standard than his own. Want proof? Here was his original entry into this thread:\n \n \nDoncha' just love the focus of things the gay rights movement seems to want to talk about these days (if this board lately is any indication)?\n Beauty pageant contestants and duck sex.\n Wow. Progressivism is just outdoing itself lately.\n\n Ok first the duck sex thing. Easy enough to get out of the way. Regressives have for decades compared homosexuality to bestiality and pedophilia. The latest was Pat Robertson, so it was a Regressive who brought the topic up and not the gay community, they&#8217;ve only had to listen to this slander for years and years. Now, someone does a spoof to characterize how&#8230;well, how retarded a point of view that is given there is absolutely no basis in truth, they do a music video, it&#8217;s a hit on YouTube, it goes viral because it points out the perverseness of the right wing and their complete and total lack of common sense all in the name of Jebus. It&#8217;s an insult to Pat Robertson&#8217;s audience. Not to mention other prominent regressives like Bill O&#8217;reilly have made the exact same point with turtles and dolphins (he is ok with hot gay penguin on penguin sex though, who knew?). So, jyoshu decides he doesn&#8217;t take issue with the message which has floated around his circles for decades only when someone makes fun of it. \n Now, onto Prejean and by connection Perez Hilton who is just as ridiculous. Let&#8217;s watch the jyoshu&#8217;s quotes fly:\n A 2fer:\n \nThe funny thing is that NO one--in the news or anywhere that I've seen--has said anything about \"family values\" here or \"religious right\" other than our beloved Foundit, here. Prejean didn't speak on behalf of \"family values\" or the \"religious right\" anymore than PHilton speaks on behalf of gays. (Funny how some here are so eager to cast off PHilton, but don't seem to have any problem trying to associate Prejean with the \"family values\" crowd in their eagerness to try and look for what they think is hypocrisy, under every rock.) There is no hypocrisy here. Prejean simply spoke her view on GAY MARRIAGE--not on how much a person should be clothed, which isn't even remotely the same issue.\n\n That&#8217;s right, jyoshu, let&#8217;s compare the differences between a beauty pageant contestant and a gossip blogger, I guess it&#8217;s ok when you do it.\n \n You posted a story by Roland Martin that was full of all the Prejean nuttyness that you love. (I onloy have 8 posts, can't link to it and too long to quote)\n \n Another Prejean/PHilton orgy of relevance:\n \nOne other thing ... PH IS a prominent outspoken gay rights advocate. That much is undeniable. While he doesn't represent the gay rights movement any more than an anti-gay Christian represents Christianity (something you've been FAR less likely to admit), I think the incident does underline some peoples' tendency to outwardly over-personalize this issue. Perez' reaction was not unlike some of the nasty things said in the wake of Prop 8, where gay rights advocates were not exactly civil either, and got pretty darn nasty. And, like it or not, Prejean's view IS the mainstream view. In that sense, she might as well have been answering a question about apple pie, and when outright incivility and foul-mouthed name-calling is the reaction to a mainstream comment, it looks bad. Really bad.\n\n Jyoshu, I&#8217;m beginning to think you have a crush on someone. Prejean or Hilton, I&#8217;m not sure. \n Seriously, something happened in the news and it was posted, does that define the progressive agenda? Cuz if it does what about all of these conservative links that relate to Prejean articles on conservative web sites? The NOM was quoted in this post yet you ignore that and call it all &#8220;progressive&#8221;? I don&#8217;t have enough posts to add links but here are a few web sites with stories on Prejean:\n \n National Organization for Marriage\n Fox News\n Washington Times\n RedState\n Free Republic\n Pajamas Media\n Conservapedia\n \n Now, of course there are liberal websites which site this story too, but it&#8217;s hardly a progressive hang up. It&#8217;s called current events and in the long run does it mean anything? Probably not, my understanding is Prejean isn&#8217;t as talented as Anita Bryant who was nothing more than a washed up conservative fighting her way to relevance against the &#8220;pink mafia.&#8221; So, give it a rest already, you&#8217;re not clever, you&#8217;re not capable of defining something as progressive simply because you say so, you don&#8217;t have the power.\n \n Oh, and jyoshu, regarding Dustin Lance Black, I believe your favorite celebrity gossip blogger Perez Hilton (PHilton or PH to you) has a story up regarding the pics so he&#8217;s doing his part I guess&#8230;whatever it means I have no idea, I&#8217;ve seen Pamela Anderson engaging in sex on a boat after all, doesn&#8217;t mean a damn thing but if you want to get all trivial on us then go ahead.", 
   {}, 
   357453, 
   null, 
   1245014100.0
  ], 
  [
   357476, 
   null, 
   "jyoshu", 
   "You fail to recognize a critical difference.\n Prejean aligned herself with the \"moral\" pro-family side. \n\n \n The reason DL Blacks' case is considered hypocritical by some is that the the gay pride movement has given such lip service to things like fighting AIDS and taking precautions. For someone who has been trying to pin Prejean to the \"pro-family\" movement in order to be able to make a hypocrisy accusation about PAST (not recent) behavior, you should understand how that works.\n \n \nTook PRIVATE photos..\n\n \n Since when does a movement that has intentionally done things like trying to 'out' people in the past care about whether or not something is private or not? You haven't cared in plenty of other cases.", 
   {}, 
   357453, 
   null, 
   1245017400.0
  ], 
  [
   357491, 
   null, 
   "foundit66", 
   "The reason DL Blacks' case is considered hypocritical by some is that the the gay pride movement has given such lip service to things like fighting AIDS and taking precautions. For someone who has been trying to pin Prejean to the \"pro-family\" movement in order to be able to make a hypocrisy accusation about PAST (not recent) behavior, you should understand how that works.\n\n emoticon_rolleyes\n Gee. And considering DL's case was an EX-boyfriend, obviously that is \"past\" behavior as well.\n \n Regardless, regarding Black's case, there are a variety of precautions one can take towards HIV prevention. Getting tested and being monogamous is certainly one of them.\n To complain about DL's case is definitely judging without having all the facts.\n \n As for Prejean's case, Carrie attempted to JUSTIFY her actions.\n So as for \"past\" behavior, she obviously saw NO PROBLEM with it and would probably be inclined to do so again, given the opportunity.\n Or should I say, give her some cash and she'll be happy to drop her bra and skirt for pictures... emoticon_rolleyes\n \n \n \nSince when does a movement that has intentionally done things like trying to 'out' people in the past care about whether or not something is private or not? You haven't cared in plenty of other cases.\n\n Huh???\n 1) \"Outing\" has ABSOLUTELY NOTHING to do with private bedroom act pictures vs PREJEAN'S DISTRIBUTED PUBLICITY/ADVERTISEMENT SHOTS.\n I mean try to THINK for a change.\n People who want to make a person's characteristic public, is the same thing (on the \"privacy\" front) as distributing private bedroom nude/sex photographs???\n So a Bush White House Reporter is a gay hustler, and pointing that out is the same thing as distributing private sex photos???\n You are really reaching on that one...\n \n 2) I typically don't comment on \"outing\".\n To give my opinion (before you presume or stereo-type it), I think people have a right to be \"in the closet\" if they prefer, but they forfeit any support for \"privacy\" when they act like Larry Craig and actively campaign against what they actually are.\n I'm betting you think I'm \"anti-Christian\", despite being corrected on that a variety of times.\n If you found out I was Christian, do you think that would be pertinent to the discussions?\n \n You're mixing apples and oranges when EVEN YOU should be able to tell the difference.", 
   {}, 
   357476, 
   null, 
   1245024060.0
  ], 
  [
   357910, 
   null, 
   "foundit66", 
   "Oh. The irony...\n \n New Miss California USA also against gay marriage\n \nIn a television interview Thursday, Farrell said she believed marriage should be between a man and a woman. But she added: \"I don't think I have the right or anybody has the right to tell somebody who they can or can't love.\"\n \n Prejean says she was dethroned because during the Miss USA pageant she said gays shouldn't be allowed to marry.\n\n New Miss California USA also against gay marriage\n \n Over and OVER and OVER again, I have heard people try to pretend that all of Prejean's issues were just about her \"gay marriage\" response.\n NO!\n \n P Hilton? Yeah. That schmuck was obviously fixated and acting improperly because of it.\n \n But Prejean lying about her semi-nude pictures WAS NOT about gay marriage.\n Prejean failing to meet her Miss California obligations WAS NOT about gay marriage.\n \n And here's her replacement. Also against gay marriage...\n \n It's like a black person accusing an employer of racism, and they hire a black replacement... \n \n YES. People were dissatisfied with her answer.\n And similarly using their freedom of speech, voiced their dissent to her answer.\n \n But QUIT PRETENDING it's Prejean being busted on behaving poorly is just about people being against gay marriage.\n I swear. Jesse Jackson and Al Sharpton should take notes from the anti-gay marriage side's attempts to claim victimization... :rolls", 
   {}, 
   357491, 
   null, 
   1245372120.0
  ], 
  [
   357925, 
   null, 
   "jyoshu", 
   "LOL! Serves the gay pride movement right, IMO. Some of them made such a stink about it, and now that they got what they wanted by her being ousted, the got more of the same. Maybe it's time to realize that many people are going to disagree sometimes on controversial issues... something many of us understand. Nevertheless, there will be some that will insist on just chalking her up as some 'bigot'.", 
   {}, 
   357910, 
   null, 
   1245384420.0
  ], 
  [
   357931, 
   null, 
   "foundit66", 
   "LOL! Serves the gay pride movement right, IMO.\n\n emoticon_rolleyes\n You're just perpetuating the association junk.\n \n Gays voiced their opinion. Rare souls (like P Hilton) went over the line and a lot of gays and gay supporters condemned them.\n \n The very fact that you think \"serves the gay pride movement right\" indicates you are caught up in the faulty anti-gay victim-hood think.\n \n \n \nMaybe it's time to realize that many people are going to disagree sometimes on controversial issues... something many of us understand.\n\n Evidently, you're not one of those \"many\".\n \n I invite people to compare Jyoshu's first statement above to his later statement there...\n First, he talks about the gay rights movement deserving something, like in retribution or punishment.\n Then, he follow up by telling us to understand \"people are going to disagree\"...\n \n Jyoshu, If you understood it was just an issue of \"people disagree\", then you wouldn't think it appropriate for retribution or punishment, just because others spoke an opposing view-point...", 
   {}, 
   357925, 
   null, 
   1245390780.0
  ], 
  [
   357938, 
   null, 
   "Symbiote", 
   "LOL! Serves the gay pride movement right, IMO.\n\n \n I completely agree - but they did prove their point, that they can and will set out to hurt those who don't think the same way they do.", 
   {}, 
   357925, 
   null, 
   1245396240.0
  ], 
  [
   357966, 
   null, 
   "foundit66", 
   "I completely agree - but they did prove their point, that they can and will set out to hurt those who don't think the same way they do.\n\n Another gullible person who falls for the anti-gay \"poor me, I'm a victim\" line of bull...\n \n Prejean lost cause of her scores on the swimsuit and evening gown section. Nothing to do with her gay marriage answer. She could have said \"I am for gay marriage\", and she still would have lost.\n \n She got in trouble cause she lied about her semi-nude pictures. Prejean's actions of lying got her in trouble. She could have said \"I am for gay marriage\", and she still would have been lying about her semi-nude pictures, which were taken when she was UNDER 18!\n \n Then she got in trouble again cause she was not doing her job.\n \n This has nothing to do with her gay marriage answer.", 
   {}, 
   357938, 
   null, 
   1245439740.0
  ], 
  [
   358092, 
   null, 
   "Ethmi", 
   "Foundit, could you at least pretend like you tolerate people disagreeing with you? She didn't say \"I don't want gays to marry\", she said this:\n \n \n\n \"We live in a land where you can choose same-sex marriage or opposite marriage, \"And you know what, I think in my country, in my family, I think that I believe that a marriage should be between a man and a woman. No offense to anybody out there, but that's how I was raised.\" \n \n\n \n She never said she wanted to keep gay marriage from being legalized, she stated her personal opinion, answering the question honestly. The judges were upset because that wasn't the answer they wanted to hear. And then you whine about Christians being intolerant of other peoples opinions...", 
   {}, 
   357230, 
   null, 
   1245540900.0
  ], 
  [
   358098, 
   null, 
   "foundit66", 
   "Foundit, could you at least pretend like you tolerate people disagreeing with you?\n\n Can you explain how I don't tolerate people disagreeing with me?\n \n And while you're at it, kindly explain what you think \"tolerate\" means in the first place.\n \n \n \nShe never said she wanted to keep gay marriage from being legalized, she stated her personal opinion, answering the question honestly.\n\n \"I think in my country, in my family, I think that I believe that a marriage should be between a man and a woman.\"\n That is clearly an opinion for man / woman only marriage.\n \n \n \nThe judges were upset because that wasn't the answer they wanted to hear. And then you whine about Christians being intolerant of other peoples opinions...\n\n ONE judge, P Hilton, proved himself to be a complete *** in his response.\n But don't confuse that with a larger group.\n \n I have repeatedly repudiated Hilton.\n Can you at least admit that? emoticon_emb", 
   {}, 
   358092, 
   null, 
   1245546660.0
  ], 
  [
   358124, 
   null, 
   "JakeCJB", 
   "LOL! Serves the gay pride movement right, IMO. Some of them made such a stink about it, and now that they got what they wanted by her being ousted, the got more of the same. Maybe it's time to realize that many people are going to disagree sometimes on controversial issues... something many of us understand. Nevertheless, there will be some that will insist on just chalking her up as some 'bigot'.\n\n \n What is \"the gay pride movement\", that you constantly refer to? What's it to you if gay people have pride? It sounds like your own personal issue. In fact, despite your pre-occupation with making negative comments about the pride others have in their identity, showing insecurity with your own, a broad spectrum of people support gay equality, and see any exclusion of gay people for the bigotry it is. This wasn't even the reason she was fired.", 
   {}, 
   357925, 
   null, 
   1245574500.0
  ], 
  [
   358162, 
   null, 
   "jyoshu", 
   "What is \"the gay pride movement\", that you constantly refer to?\n\n \n The movement that involves activism among gays, which seems to have \"gay pride\" at its core. Gay pride seems to be the unifying factor, so that's how I refer to it. Why is that a problem to you?\n \n \nWhat's it to you if gay people have pride?\n\n \n Did I say it was anything to me? No. It seems rather it's something to you that someone uses such terminology.", 
   {}, 
   358124, 
   null, 
   1245614040.0
  ], 
  [
   358165, 
   null, 
   "foundit66", 
   "What is \"the gay pride movement\", that you constantly refer to? What's it to you if gay people have pride? It sounds like your own personal issue. In fact, despite your pre-occupation with making negative comments about the pride others have in their identity, showing insecurity with your own, a broad spectrum of people support gay equality, and see any exclusion of gay people for the bigotry it is. This wasn't even the reason she was fired.\n\n \n I wouldn't expect an honest answer from Jyoshu.\n It's rather obvious to casual observers that he has a problem with the \"gay pride movement\", but you'll never see him admit it... emoticon_rolleyes", 
   {}, 
   358124, 
   null, 
   1245614820.0
  ], 
  [
   358168, 
   null, 
   "jyoshu", 
   "I wouldn't expect an honest answer from Jyoshu.\n\n \n I see you're in Mr. Hyde attack mode today, eager to argue about posters rather than the issues, as usual. In what way do you think my response was 'dishonest'? It was completely honest. I have no problem whatsoever with someone having 'pride' in their identity, and that's what he asked. (Of course, unlike you, I'd have no problem in someone having pride in something that's not based on political correctness to do so, as well, like straight pride.) But I make no bones about the fact I don't approve of the way the movement has conducted itself at times, as I've told you before. Just as you've made it clear you don't approve of the way organized religion conducts itself sometimes. If you think any of that is 'dishonest', then you're clearly just looking for excuses to make baseless accusations. But I'd expect no different from you.", 
   {}, 
   358165, 
   null, 
   1245615660.0
  ], 
  [
   358185, 
   null, 
   "foundit66", 
   "I see you're in Mr. Hyde attack mode today, eager to argue about posters rather than the issues, as usual.\n\n emoticon_rolleyes\n Jyoshu, I have addressed your reply on the issue.\n Predictably, you dodged it. Ignoring the hypocrisy of your position.\n http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-2.html#post357931\n \n Adding on to that, you allege \"Serves the gay pride movement right\" with no explanation...\n Is it just cause P Hilton mouthed off vilely that millions more \"deserve\" something???\n \n If you want to discuss the issue, you can start there...\n \n \n \nIn what way do you think my response was 'dishonest'? It was completely honest. I have no problem whatsoever with someone having 'pride' in their identity, and that's what he asked.\n\n That would be rather contradictory with your earlier statement of \"serves the gay pride movement right\"... emoticon_rolleyes\n \n \n \nBut I make no bones about the fact I don't approve of the way the movement has conducted itself at times, as I've told you before.\n\n And how has the \"movement\" conducted itself here?\n \n \n \nJust as you've made it clear you don't approve of the way organized religion conducts itself sometimes.\n\n My complaint is typically about the ACTION itself.\n Here, you have made it personal...", 
   {}, 
   358168, 
   null, 
   1245625860.0
  ], 
  [
   358188, 
   null, 
   "jyoshu", 
   "Jyoshu, I have addressed your reply on the issue.\n\n \n No. You said \"I wouldn't expect an honest reply from Jyoshu.\" That's an attack, not addressing any reply. The reply I DID give him was completely honest. \n \n So ... bug off.\n \n \nAdding on to that, you allege \"Serves the gay pride movement right\" with no explanation... Is it just cause P Hilton mouthed off vilely that millions more \"deserve\" something???\n\n \n I guess your complaints about Hilton being considered representative of the gay pride movement in any way would carry more clout--or even ANY clout--if you hadn't hypocritically committed the same sort of thing by associating Prejean with \"the family values crowd\", yourself, and posting stories about past indiscretions on her part. You quite simply have no credibility here to be complaining about that. (shrug)", 
   {}, 
   358185, 
   null, 
   1245628260.0
  ], 
  [
   358189, 
   null, 
   "foundit66", 
   "No. You said ...\n\n I wasn't talking about that.\n I was talking about my ORIGINAL reply, which I linked to.\n http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-2.html#post357931\n \n Predictably, you dodged it. Ignoring the hypocrisy of your position.\n You are STILL dodging it.\n \n \n \nSo ... bug off.\n\n emoticon_rolleyes\n \n \n \nI guess your complaints about Hilton being considered representative of the gay pride movement in any way would carry more clout--or even ANY clout--if you hadn't hypocritically committed the same sort of thing by associating Prejean with \"the family values crowd\"...\n\n Wow. Forest for the trees.\n Amazing how that works for you. You see two situations, ASSUME THEM THE SAME, and ignore the precious details which derail your absurd conclusion...\n \n Prejean HAS GARNERED that title by her actions and the treatment of her BY the anti-gay marriage crowd.\n She has REPEATEDLY appeared in public for them. Been in their ads.\n She IS associated \"with the family values crowd\".\n \n As for P Hilton, what the heck does he do?\n He's a mouthy gossip columnist. Nothing more.\n Does HRC invite him to be a part of their advertising? No.\n \n It is really funny how you take ONE situation of Prejean and the anti-gay marriage crowd, IGNORE THE DETAILS of how she has EXPLICITLY involved herself with them, and them with her, and just blindly assume that P Hilton must be the same for \"gay pride\"... emoticon_rolleyes\n \n \n \nYou quite simply have no credibility here to be complaining about that. (shrug)\n\n Funny.\n I feel I should be using that on you.\n Jake and I aren't the only ones to make these observations...", 
   {}, 
   358188, 
   null, 
   1245629880.0
  ], 
  [
   358218, 
   null, 
   "jyoshu", 
   "\n I wasn't talking about that.\n I was talking about my ORIGINAL reply\n\n \n I'M TALKING about your personal attack comment where you said \"I wouldn't expect an honest reply from Jyoshu.\" You're not going to get off the hook for it so easily as trying to sweep it under the rug as if you didn't make it. Own up to it, Foundit. For once.\n \n At any rate, regarding you trying to avoid your own comment...\n Deep gruff Yoda voice -< Predictable response that is.[/voice]\n \n \nWow. Forest for the trees.\n Amazing how that works for you. You see two situations, ASSUME THEM THE SAME, and ignore the precious details which derail your absurd conclusion...\n \n Prejean HAS GARNERED that title by her actions and the treatment of her BY the anti-gay marriage crowd.\n She has REPEATEDLY appeared in public for them. Been in their ads.\n She IS associated \"with the family values crowd\".\n\n \n The situation is really not so different. Prejean is not held up as some paragon of goodness by the \"family values crowd\" (LOVE to know how you'd specifically define that, by the way); and even though you tried to make the connection and still do basically, no doubt you won't actually try to prove the connections (beyond the recent defense of her because she was attacked for her Miss America comments, which would be AFTER the fact of family values connections as you use them ....) In fact, the ONLY person I have heard call her a \"family values\" associated-person is .... you.\n \n \nI feel I should be using that on you.\n Jake and I aren't the only ones to make these observations...\n\n \n It seems you can't go for a single exchange these days without doing the \"nya, nya, there's several of us against you, nya, nya\" playground thing. You've done that a lot lately, and it's absolutely fascinating that you seem to have the need to do so, particularly as ironic as such statements are when you make them, in reality. :p Irony, thy name is Foundit. ", 
   {}, 
   358189, 
   null, 
   1245639180.0
  ], 
  [
   358221, 
   null, 
   "foundit66", 
   "I'M TALKING about your personal attack comment where you said \"I wouldn't expect an honest reply from Jyoshu.\" You're not going to get off the hook for it so easily as trying to sweep it under the rug as if you didn't make it. Own up to it, Foundit. For once.\n\n I said it and explained why I said it. I didn't realize you needed me to admit the obvious and uncontested... emoticon_rolleyes\n For the life of me I don't understand how me EXPLAINING WHY it was said is somehow an attempt to \"sweep it under the rug\"...\n \n You still haven't honestly addressed many things brought up in this thread. No honest reply!\n I keep giving you a chance to, but you keep insisting on showing me I'm right.\n \n \n \nThe situation is really not so different. Prejean is not held up as some paragon of goodness by the \"family values crowd\" (LOVE to know how you'd specifically define that, by the way); and even though you tried to make the connection and still do basically, no doubt you won't actually try to prove the connections (beyond the recent defense of her because she was attacked for her Miss America comments, which would be AFTER the fact of family values connections as you use them ....) In fact, the ONLY person I have heard call her a \"family values\" associated-person is .... you.\n\n emoticon_frazzled\n Wow.\n Do you really need an education on what Prejean HAS BEEN BUSY DOING instead of her actual work as Miss California?\n I had assumed you had at least some basic knowledge of this issue. I guess I made a mistake in assuming that.\n \n Heck. Even the Christian Coalition recognizes her stance \"for family values\"...\n Miss California Stands Up For Family Values | Christian Coalition of America\n Miss California: The new family values spokeswoman?\n \n Why you try to avoid the admitted relationship is beyond me...\n \n Moreover, it's funny how you claim the situation is not that different, but FAIL TO SHOW ANY CONNECTION between P Hilton as a significant member of the \"gay pride\" movement...\n \n \n \nIt seems you ...\n\n And you STILL haven't addressed my original point, as you accuse me of not talking about the issue...\n And you STILL INSIST on spending more time talking about me, than you do the actual topic of the thread.\n \n If you want to talk about the topic, THEN DO SO.\n http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-2.html#post357931", 
   {}, 
   358218, 
   null, 
   1245640320.0
  ], 
  [
   358225, 
   null, 
   "jyoshu", 
   "I said it and explained why I said it. \n\n \n Except, you cited something that had nothing to do with \"dishonesty\" for an 'explanation' of you attack about dishonesty. Go figure!\n \n \nDo you really need an education on what Prejean HAS BEEN BUSY DOING instead of her actual work as Miss California? I had assumed you had at least some basic knowledge of this issue. I guess I made a mistake in assuming that.\n \n Heck. Even the Christian Coalition recognizes her stance \"for family values\"...\n\n \n Dude ... all that stuff is POST-Hilton. It happened AFTER the incident. Of COURSE they're going to stand up for her. She needed SOMEONE to come to her defense, after all. To require your Stewart-wannabe hypocrisy-police junk to stick, that doesn't work. You delved into her PAST indiscretions, remember? :)\n \n (Maybe family-values folks are just more forgiving that you are, F.)\n \n \nIf you want to talk about the topic, THEN DO SO.\n http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-2.html#post357931\n\n \n Frankly, I think it's mostly a stupid topic, and in this case I fully admit I'm mostly not taking you seriously here at all. ;) I think I made that clear earlier. Just like the whole duck sex topic. Besides, you're arguing in circles anyway. Got some other celebrity gossip to .... er, debate? emoticon_xangel", 
   {}, 
   358221, 
   null, 
   1245641580.0
  ], 
  [
   358236, 
   null, 
   "foundit66", 
   "Except, you cited something that had nothing to do with \"dishonesty\" for an 'explanation' of you attack about dishonesty.\n\n Talk about forest for the trees! emoticon_wow\n I swear. Sometimes I think you are so preoccupied with ignoring what people say that you ACTUALLY DO NOT RECOGNIZE what people say...\n \n First of all, I told Jake \"I wouldn't expect an honest answer from Jyoshu.\"\n \n Secondly, going a step further, I gave an explanation in my VERY FIRST RESPONSE to your criticism of my comment...\n You asked the question.\n I answered it.\n You AVOIDED my answer.\n And then you turned around and insisted I didn't answer...\n jyoshu: \"In what way do you think my response was 'dishonest'? It was completely honest. I have no problem whatsoever with someone having 'pride' in their identity, and that's what he asked.\"\n \n foundit66: \"That would be rather contradictory with your earlier statement of \"serves the gay pride movement right\"... \"\n \n \nDude ... all that stuff is POST-Hilton. It happened AFTER the incident. Of COURSE they're going to stand up for her.\n\n Yep! You're in full on obfuscation mode...\n I AM NOT TALKING about why they stood up for her.\n I am pointing out that the pro-family values crowd RECOGNIZES HER AS ONE OF THEIR OWN.\n \n That is what we were talking about.\n You tried to analogize P Hilton to \"gay pride\" as similar to Prejean and the pro-family.\n And now that I show P Hilton has no real association to \"gay pride\", and that Prejean IS CLAIMED by the pro-family movement, you try to move the goal-posts...\n \n \n \nShe needed SOMEONE to come to her defense, after all.\n\n I wasn't talking about them \"defending\" her.\n \n But more to the spirit of my ORIGINAL point, one gay blogger acts like a @##, and suddenly you need the pro-family movement to rush to her aid???\n Oh Lordy! How afraid of these mighty powerful gays (scratch that =< A 'mighty powerful' gay) these pro-family people must be!\n < end sarcasm < emoticon_rolleyes\n \n No. What actually happened is typical of the pro-family response.\n One gay guy, P Hilton, goes rabid and suddenly the \"pro-family\" side tries to pretend a much larger contingent of gays out there are going for blood. They generalize the issue, pretending it's a much bigger problem than it is...\n They start using generalizing statements like \"gay pride movement\"...\n Oh wait. That's what YOU just did... emoticon_rolleyes\n \n \n \nTo require your Stewart-wannabe hypocrisy-police junk to stick, that doesn't work. You delved into her PAST indiscretions, remember? :)\n\n HuH?\n Are you trying to make up yet ANOTHER standard and pretend I automatically have it?\n \n I see no reason why \"past indiscretions\" have anything to do with this situation.\n Prejean DEFENDED her pre-18, semi-nude pictures. So calling it a \"past discretion\" is entirely pointless because she DOES NOT RECANT her behavior, but defends it.\n \n And as for her recent firing, not doing her job is something she was CURRENTLY guilty of.\n \n \n \nFrankly, I think it's mostly a stupid topic, and in this case I fully admit I'm mostly not taking you seriously here at all.\n\n I have no doubt that you THINK it's stupid, considering you are PERPETUATING EXACTLY what I am talking about.\n People who are highly hypocritical, like yourself, don't see their hypocrisy as a big thing.\n Others see it as a means to recognize that you don't take your own standards very seriously, so why should they?\n \n \n \nBesides, you're arguing in circles anyway.\n\n It's not a circle when I keep pointing to the same response you can't address.\n And can I just say I am amused at how much effort you are putting into this topic, which you think is \"stupid\"?\n Oh wait. You're putting MINIMAL effort into it, and MAXIMUM effort into complaining about me...\n Non-topical response? Check.\n Passive aggressive responses? Check.\n \n Par for your course... emoticon_rolleyes", 
   {}, 
   358225, 
   null, 
   1245645780.0
  ], 
  [
   358297, 
   null, 
   "jyoshu", 
   "They generalize the issue, pretending it's a much bigger problem than it is...\n\n \n Obviously it's a pretty big deal ... it's been all over the news. You yourself can't help but talk about it. \n \n \nI see no reason why \"past indiscretions\" have anything to do with this situation.\n\n \n Look, you're the one who's been wanting to discuss this stuff. Take your own advice. (shrug)\n \n \nI have no doubt that you THINK it's stupid, considering you are PERPETUATING EXACTLY what I am talking about.\n People who are highly hypocritical, like yourself, don't see their hypocrisy as a big thing.\n\n \n Foundit, people don't see hypocrisy as a big deal with YOU point it out, because your Stewart-wannabe hypocrisy stuff is hypocritical in and of itself. When you're being a hypocrite by trying to police hypocrisy, you really have no credibility. And frankly, you seem to try to look for any excuse you can to play the hypocrisy card. The schtick of yours definitely gets a little silly after awhile.", 
   {}, 
   358236, 
   null, 
   1245697920.0
  ], 
  [
   358306, 
   null, 
   "foundit66", 
   "Obviously it's a pretty big deal ... it's been all over the news. You yourself can't help but talk about it. \n\n emoticon_rolleyes\n Brittney Spears crotch shot was all over the news.\n Michael Jackson dangling a kid over a balcony was big news.\n Whether Brangelina is together or split is big news.\n If Madonna is going to be able to adopt her newest baby is big news.\n \n You mistake \"news\" with IMPORTANT information... emoticon_rolleyes\n \n As for me, I talk about it from the \"anti-gay\" angle.\n Prejean is so busy doing her anti-gay marriage thing that she neglects her duties as Miss California. The anti-gay side turns around and BLOWIs all over the place pretending it's all about her \"gay marriage\" comment.\n FROM THE START, they have been BLOWI-ing this issue.\n Pretending that she lost because of her gay marriage statement, when that is plainly false.\n Pretending she was up for review under Trump because of her gay marriage statement, obfuscating and ignoring the REAL issue of her lying about under-age, semi-nude photos.\n Pretending she was fired because of her gay marriage response, when the truth is that it was about her not fulfilling her duties.\n \n Gawd Jyoshu. WHY can't you understand that which has been REPEATEDLY PLAINLY EXPLAINED to you...\n The reason I see this as news is because the anti-gay side KEEPS BLOWI-ing about her. They keep telling blatant lies, or willfully deluding themselves that this is about her gay marriage response.\n When the truth is that it's about her indecency and lying about it, and not showing up to work!\n \n \n \nLook, you're the one who's been wanting to discuss this stuff. Take your own advice. (shrug)\n\n Wow!\n Talk about taking a comment out of context for a cheap and ineffective comment.\n I don't see any reason why \"past indiscretions\" are a standard for excluding criticism of her actions. ESPECIALLY since she still attempts to JUSTIFY her under-age, semi-nude photos.\n \n \n \nFoundit, people don't see hypocrisy as a big deal with YOU point it out...\n\n Jyoshu, you don't.\n Other people? You have no clue.\n \n \n \nWhen you're being a hypocrite by trying to police hypocrisy, you really have no credibility.\n\n HOW am I being a hypocrite?\n EXPLAIN it.\n QUOTE what standard I actually have, and then SHOW how I have violated that standard.\n \n What's really funny is that here you understand how hypocrisy can lead to a lack of credibility, but in other places you insist that it's not important and you ignore it.", 
   {}, 
   358297, 
   null, 
   1245707400.0
  ], 
  [
   358311, 
   null, 
   "jyoshu", 
   "emoticon_rolleyes\n Brittney Spears crotch shot was all over the news.\n Michael Jackson dangling a kid over a balcony was big news.\n Whether Brangelina is together or split is big news.\n If Madonna is going to be able to adopt her newest baby is big news.\n\n \n Yep, those examples pretty much capture how I see the Hilton/Miss America/DTrump soap opera. Maybe now you're starting to get an idea of how ridiculous I think this discussion is. I guess the difference is that I don't see EITHER your examples OR the topic of this thread particularly \"important\" as news.\n \n \nThe reason I see this as news is because the anti-gay side KEEPS BLOWI-ing about her. They keep telling blatant lies, or willfully deluding themselves that this is about her gay marriage response.\n When the truth is that it's about her indecency and lying about it, and not showing up to work!\n\n \n Well by all means, belabor the discussion so their \"lies\" can get that much more airtime!! I mean, half the stuff you post about I would never have heard about if not for you. \n \n \nI don't see any reason why \"past indiscretions\" are a standard for excluding criticism of her actions.\n\n \n Particularly when they're so handy for you to try and use them against \"the anti-gay side\", huh? emoticon_xangel \n \n \nOther people? You have no clue.\n\n \n Irony, thy name is Foundit.\n \n \nHOW am I being a hypocrite?\n EXPLAIN it\n\n \n I don't think so. You've never given indication that you're serious about any self-reflection, so what good would it do? No one cares enough to take part in these your-a-so-and-so little games of yours. Including me. I really don't CARE to spend post after post with you arguing forever about who's a hypocrite and who's not. (Though I will defend myself when you make a 'you're deceptive/you're a hypocrite/you're a whatever-Foundit's-attack-of-the-day' is.) Arguing ad infinitum about posters and making personal comments rather than the issues is YOUR schtick, Foundit, so forget I said it. Do your little thing and carry on. I can't believe I almost let you bait me into another one.", 
   {}, 
   358306, 
   null, 
   1245710100.0
  ], 
  [
   358336, 
   null, 
   "foundit66", 
   "Yep, those examples pretty much capture how I see the Hilton/Miss America/DTrump soap opera. Maybe now you're starting to get an idea of how ridiculous I think this discussion is.\n\n If you think this discussion is ridiculous, nobody is forcing you to stay here.\n \n And furthermore, you are STILL AVOIDING THE REAL POINT.\n My comments and focus ARE NOT about Prejean, but rather on the ANTI-GAY MARRIAGE LIES about the situation, trying to paint themselves as a victim to further their goals.\n THAT is the real focus here.\n \n \n \nWell by all means, belabor the discussion so their \"lies\" can get that much more airtime!! I mean, half the stuff you post about I would never have heard about if not for you.\n\n ROFLMAO!\n OMG. It's funny how you perpetuate the issues I talk about, AND BE AN EXAMPLE of the issues I talk about...\n \n Repeatedly, I talk about what the anti-gay marriage movement is like.\n You try to paint it as something else.\n Then I SHOW EXAMPLES of it in action.\n And you have \"never heard about\" half this stuff???\n \n Like I said, it only goes to show you HOW OUT OF THE LOOP you are when you try to contradict me.\n It's like arguing over the geometry of a triangle, but then when I show that the angles add up to 180 degrees, you hadn't heard of that... emoticon_ic\n \n And then you think it's all trivial anyways...\n It's funny how the anti-gay movement acting CONTRARY to what you claim is trivial, yet you still insist on trying to correct me on what they are like...\n \n Furthermore, your reply is amusing that you think me EXPOSING THEIR LIES (giving them airtime) is somehow beneficial to the anti-gay movement???\n emoticon_xdonno\n \n And I suppose O.J. got all sorts of benefits from the press on his trial.\n And by your blind attitude, since the anti-gay movement talks about gays so much, that must all be benefiting gays then, huh...\n \n LOL. At times I am torn inbetween thinking that you actually believe what you say, and that you're just desperate to try to respond with anything, but you temporarily fail to recognize how pathetic it is...\n \n \n \nParticularly when they're so handy for you to try and use them against \"the anti-gay side\", huh? emoticon_xangel \n\n No. Not \"particularly\".\n If you can show any discrepancy in application, please do so.\n \n In this thread, you are showing some of your worst behavior. Left and right, stating and insinuating things about me and my positions, but providing absolutely no foundation for it...\n \n \n \nIrony, thy name is Foundit.\n\n Don't get me wrong.\n I'm sure Ethmi and Archie are more than happy to join your assessment.\n I'm sure you've got all sorts of support from people who you don't want to admit where it really comes from.\n \n \n \nHOW am I being a hypocrite?\n EXPLAIN it\n QUOTE what standard I actually have, and then SHOW how I have violated that standard.\n\n \nI don't think so.\n\n Yeah. I didn't think so.\n You have a serious problem with making accusations, and refusing to back them up.\n I challenge you on it, and you cower away...\n \n As for what comes afterwards, it's amusingly enough an ad hominem attack, which you profess such disdain over... emoticon_ic\n I guess I should say \"disdain over\" when YOU are the victim, or you can paint somebody else as a victim to benefit your position...\n \n You continue to passive-aggresively attack me... emoticon_ic", 
   {}, 
   358311, 
   null, 
   1245719640.0
  ], 
  [
   358348, 
   null, 
   "jyoshu", 
   "If you think this discussion is ridiculous, nobody is forcing you to stay here.\n\n \n Good. I am indeed tired of discussing Miss America Trump, Hilton, or whatever other celebrity topic of the day there is.\n \n \nYeah. I didn't think so.\n You have a serious problem with making accusations, and refusing to back them up.\n I challenge you on it, and you cower away...\n\n \n Oh Foundit. \n Don't misinterpret my refusal to wallow with you in one of your low-brow personal discussions as not being able to back something up or cowardice. (You JUST gave an example of blatant hypocrisy in another thread that would be EASY to point out.) It's that people just don't care about these immature spit-spat name-calling games of yours, F, and nor do I ... not enough to give it the benefit of participation.", 
   {}, 
   358336, 
   null, 
   1245723720.0
  ], 
  [
   358353, 
   null, 
   "foundit66", 
   "Good. I am indeed tired of discussing Miss America Trump, Hilton, or whatever other celebrity topic of the day there is.\n\n LOL!\n Considering you never even really started in the first place...\n emoticon_cool\n \n You made some false insinuations on the topic, hypocritically chastising others for something you were guilty of in your assessment...\n ... then when challenged you dropped the issue.\n After that, you tried to go all ad hominem on Colbert, Stewart, and their fans...\n \n \n \nDon't misinterpret my refusal to wallow with you ...\n\n No, no, no...\n Quit blatantly lying or willfully delusioning yourself on the situation.\n YOU ALREADY ENGAGED in the accusation. emoticon_frazzled\n That cow has already left the barn.\n \n All I was asking you to do was to BACK UP your claim.\n The ACCUSATION is something you CONSISTENTLY are willing to \"wallow\" in.\n BACKING UP your claim is something you habitually cower from...", 
   {}, 
   358348, 
   null, 
   1245724800.0
  ], 
  [
   358460, 
   null, 
   "foundit66", 
   "Incidentally Jyoshu...\n I realize you didn't even try to justify your association of P Hilton with \"gay pride\", even after I ripped your allegation to shreds.\n \n But to show further evidence of how Hilton should NOT be associated with gay pride, here's a story with P Hilton saying \"you're a f**king f*ggot\" to another person.\n Video tape...\n Hardly \"gay pride\" at all.\n Perez vs. Will.I.Am -- CAUGHT ON TAPE | TMZ.com", 
   {}, 
   358353, 
   null, 
   1245804120.0
  ], 
  [
   358475, 
   null, 
   "jyoshu", 
   "But to show further evidence of how Hilton should NOT be associated with gay pride, here's a story...\n\n \n Oh, make no mistake, I can definitely see why you all want to drop him like a hot potato ...", 
   {}, 
   358460, 
   null, 
   1245817380.0
  ], 
  [
   358476, 
   null, 
   "foundit66", 
   "Oh, make no mistake, I can definitely see why you all want to drop him like a hot potato ...\n\n You can't \"drop\" what you never had in the first place.\n He was NEVER a \"gay pride\" person.\n He's a gossip columnist who happens to be gay.\n He uses his \"gay\" thing like a prop, the way some politicians use \"christianity\" as a tool for votes and attention.\n \n I am not surprised you can't tell the difference... emoticon_rolleyes", 
   {}, 
   358475, 
   null, 
   1245817740.0
  ], 
  [
   358557, 
   null, 
   "chester", 
   "Craig, Vitter, Ensign, and Sanford make a powerful case for the weakness of heterosexual marriage.:(\n \n Kinda makes me wonder why same gender people would want to get married in the first place.\n \n Perhaps we should just pass a Constitutional Amendment that forbids those who try to tell others how to live their lives from getting married.:)", 
   {
    "post_info": {
     "post_title": "I may be straight, but I'm not narrow."
    }
   }, 
   358476, 
   null, 
   1245890460.0
  ], 
  [
   358606, 
   null, 
   "Brigid", 
   "Oh, make no mistake, I can definitely see why you all want to drop him like a hot potato ...\n\n \n Sort of like how you dropped your claim about hypocrisy? emoticon_xbounceremoticon_xbouncer", 
   {}, 
   358475, 
   null, 
   1245945000.0
  ], 
  [
   358607, 
   null, 
   "Brigid", 
   "I don't think so. \n\n \n Typical Fundi. Make a claim, disparaging someone else, and then refuse to back that claim up with evidence. Quite unsuprising.", 
   {}, 
   358311, 
   null, 
   1245945060.0
  ], 
  [
   358618, 
   null, 
   "jyoshu", 
   "Typical Fundi. Make a claim, disparaging someone else, and then refuse to back that claim up with evidence. Quite unsuprising.\n\n \n Nah, I'm no fundie. I'm pro gay rights in most cases, anti-death penalty, and theist evolutionist, pro-social programs in most cases, among other things. I backed out of the discussion because I'm not interested in a protracted personal-attack based discussion. If that's what you want to do, knock yourself out.", 
   {}, 
   357230, 
   null, 
   1245957660.0
  ], 
  [
   358619, 
   null, 
   "foundit66", 
   "Typical Fundi. Make a claim, disparaging someone else, and then refuse to back that claim up with evidence. Quite unsuprising.\n\n Yeah. He does that a lot.\n \n \n \nI backed out of the discussion because I'm not interested in a protracted personal-attack based discussion, and that's what Foundit's exchanges tend to devolve into.\n\n emoticon_cool\n Again with YOUR passive-aggressive attacks?\n The funny thing is that you did continue to respond after making that \"I don't think so\" response.\n You chose to not back up a PARTICULAR ATTACK you made against me, but then you continued to respond with another couple posts... emoticon_frazzled\n \n We could talk about YOUR ATTACKS Jyoshu, but you won't acknowledge the situation so it would be a one-way discussion. Like on another thread how you attacked Colbert and his viewers. Or on this thread where you bizarrely put forth that 'gay pride' deserved to have another Miss California who opposed gay marriage. You complain about your hypocrisy recognized, but then you call me a hypocrite...\n \n Like I said. I'm not the only one who sees your tactics... emoticon_frazzled", 
   {}, 
   358607, 
   null, 
   1245958380.0
  ], 
  [
   358621, 
   null, 
   "jyoshu", 
   "Like I said. I'm not the only one who sees your tactics... emoticon_frazzled\n\n \n Oooooo ... Foundit finds himself a bully-buddy for his pointless jabs. LOL", 
   {}, 
   358619, 
   null, 
   1245959460.0
  ], 
  [
   358624, 
   null, 
   "Brigid", 
   "Oooooo ... Foundit finds himself a bully-buddy for his pointless jabs. LOL\n\n \n Well - if asking someone to back up their disparaging claims of another as \"hypocritical\" is a \"pointless jab\" - then I think that tells us all we need to know about you, sir.", 
   {}, 
   358621, 
   null, 
   1245960780.0
  ], 
  [
   358630, 
   null, 
   "jyoshu", 
   "Well - if asking someone to back up their disparaging claims of another as \"hypocritical\" is a \"pointless jab\"...\n\n \n Why pointlessly feed a non-issue-related personal discussion that will just go on indefinitely?\n Now if you would like to discuss pertinent issues, I'm fully willing to do so.", 
   {}, 
   358624, 
   null, 
   1245970800.0
  ], 
  [
   358636, 
   null, 
   "Penfold", 
   "Why then do you point to another when the hypocrite Sanford is the topic of another thread? A thousand others doing the same do not lessen the act of a man who championed \"Family Values\"", 
   {}, 
   358630, 
   null, 
   1245972600.0
  ], 
  [
   358661, 
   null, 
   "jyoshu", 
   "Why then do you point to another when the hypocrite Sanford is the topic of another thread? \n\n \n Who, John Edwards? I addressed that in that thread.", 
   {}, 
   358636, 
   null, 
   1245990420.0
  ], 
  [
   358663, 
   null, 
   "foundit66", 
   "Why then do you point to another when the hypocrite Sanford is the topic of another thread? A thousand others doing the same do not lessen the act of a man who championed \"Family Values\"\n\n Predictably, he didn't answer your question... emoticon_rolleyes\n \n \n \nOooooo ... Foundit finds himself a bully-buddy for his pointless jabs. LOL \n\n Calling other people \"bullies\" is doing wonders for your complaint about personal attacks... emoticon_rolleyes\n \n \n \nNow if you would like to discuss pertinent issues, I'm fully willing to do so. \n\n No you aren't.\n I've been trying to get you to discuss topical issues on multiple threads now.\n \n I EVEN CREATED A NEW THREAD for you to talk about separation of church and state, and you promptly dropped the issue...", 
   {}, 
   358636, 
   null, 
   1245990900.0
  ], 
  [
   358664, 
   null, 
   "jyoshu", 
   "I've been trying to get you to discuss topical issues on multiple threads now.\n\n \n emoticon_rolleyes\n \n I discuss topical issues with you all the time, Foundit. No, I don't care about the silly \"topical issues\" such as what's been in this thread, topics of 'duck sex', or who's currently on your politically-onesided hypocrisy-police hit list. Sue me. emoticon_cool", 
   {}, 
   358663, 
   null, 
   1245991260.0
  ], 
  [
   358667, 
   null, 
   "foundit66", 
   "emoticon_rolleyes\n I discuss topical issues with you all the time, Foundit.\n\n You can? Yes!\n You have been recently? No.\n \n You chastising Colbert and his audience is not topical.\n You calling Brigid and me bullies is not topical.\n \n You have been persistently avoiding the topic.\n When I ask you questions about your posts, you dodge them.\n \n \n \nNo, I don't care about the silly \"topical issues\" such as what's been in this thread...\n\n Yet, you come here to post and disrupt ...\n I think you're proving my point by admitting what I'm talking about!\n \n So please.\n When you say, \"Now if you would like to discuss pertinent issues, I'm fully willing to do so.\", it gives people the false idea that you are willing to discuss the issue.", 
   {}, 
   358664, 
   null, 
   1245991860.0
  ], 
  [
   358669, 
   null, 
   "jyoshu", 
   "You can? Yes!\n You have been recently? No.\n\n \n I think it more reflects the sad quality of a lot of the topics you've been wanting to discuss recently than anything... No, I don't care about Trump firing Miss America. Or duck-sex. Or your hypocrite-o'-the-day approach. And frankly, as this thread exemplifies, you seem to have gotten in the habit of mostly just wanting to whine and complain about 'anti-gay' people rather than discussing the issues themselves. It gets boring. (shrug)", 
   {}, 
   358667, 
   null, 
   1245992220.0
  ], 
  [
   358675, 
   null, 
   "foundit66", 
   "I think it more reflects the sad quality of a lot of the topics ...\n\n No, Jyoshu.\n If you didn't want to discuss them, then you don't need to discuss them.\n Just plain don't post.\n \n Coming onto a thread, making statements that you are challenged on and then you fail to back up or defend, and then obfuscating the point of the thread by talking about even more trivial matters like your passive-aggressive attacks or you calling other posters names...\n \n ... NONE of that is justified by you not liking the topic.\n If you don't care about the topic.\n Don't post.\n It's just that simple.\n \n Considering you HAVE POSTED on the topic of this thread, but were rebutted and you failed to defend, that kinda shows how you DID have an interest. Your emotional outbursts also demonstrate the falseness of your claims.", 
   {}, 
   358669, 
   null, 
   1245993000.0
  ], 
  [
   358679, 
   null, 
   "jyoshu", 
   "No, Jyoshu.\n If you didn't want to discuss them, then you don't need to discuss them.\n Just plain don't post.\n\n \n Like you're posting now in a discussion that isn't doesn't pertain to the issues. Then, when I DO stop posting, you still can't leave well-enough alone. As you said earlier, it's amazing how much what you say actually applies to you. Do yourself a favor F, and stick to discussions like the ENDA thread you created. This claptrap discussion you're trying to perpetuate is getting you NOWHERE.", 
   {}, 
   358675, 
   null, 
   1245993420.0
  ], 
  [
   358683, 
   null, 
   "foundit66", 
   "Like you're posting now in a discussion that isn't doesn't pertain to the issues.\n\n You start attacking others with accusations of \"bullies\", and I will respond.\n emoticon_frazzled\n \n The funny thing is we have further proof of what I'm talking about in a thread YOU started.\n I responded, addressing the issue, and you avoid responding to the detractions of the article.\n \n \n \nThen, when I DO stop posting, you still can't leave well-enough alone. As you said earlier, it's amazing how much what you say actually applies to you.\n\n What the heck are you talking about?\n *When you (jyoshu) stop posting*, how exactly am I not \"leaving well enough alone\"?\n \n \n \nThis claptrap discussion you're trying to perpetuate is getting you NOWHERE.\n\n Funny.\n Multiple people here have recognized your tactics now.\n But it's \"me\" who is getting nowhere...\n Again, you really don't recognize the junk you pull...\n You seem to really think that when you pull these passive-aggressive accusations, in addition to calling people names like \"bully\", others should just walk away???\n emoticon_xdonno", 
   {}, 
   358679, 
   null, 
   1245994440.0
  ], 
  [
   358691, 
   null, 
   "jyoshu", 
   "What the heck are you talking about?\n *When you (jyoshu) stop posting*, how exactly am I not \"leaving well enough alone\"?\n\n \n Because when I do, you keep talking about it. You've pulled your little tactic numerous times where I say I'm not going to respond anymore and you are unable to resist getting last dig in by making some comment about 'cowardice' or 'inability' rather than simply acknowledging the truth that I am choosing to step away for neither of those reasons. So on one hand you recommend me not posting, then if I DO follow that recommendation, you make accusations of cowardice. You always play a damned-if-you-do/damned-if-you-don't thing. You don't think those tactics of yours go unnoticed, do you? :) \n \n \nMultiple people here have recognized your tactics now.\n\n \n A whopping 2 folks at last count. And what's worse, at this point, I'm not sure it would be anyone you're in particularly good company with.", 
   {}, 
   358683, 
   null, 
   1245998100.0
  ], 
  [
   358693, 
   null, 
   "foundit66", 
   "Because when I do, you keep talking about it.\n\n Talking about what?\n Talking about the subject? Imagine that.\n \n If you're talking about the fact that you put in a reply, and then I reply back not giving you the last word ...\n ... when in a lot of cases I didn't realize you were stopping your reply...\n Then that's just a pointless complaint.\n \n \n \nYou've pulled your little tactic numerous times where I say I'm not going to respond anymore and you are unable to resist getting last dig in by making some comment about 'cowardice' or 'inability' rather than simply acknowledging the truth that I am choosing to step away for neither of those reasons.\n\n Dude. You say you're not going to reply to me.\n That doesn't mean I have to stop replying to you.\n In fact, I've told you multiple times that I am STILL going to reply to you, cause your passive-aggressive stunts don't mean squat to me.\n \n There are too many times you DO run away from the conversation.\n You posted #15, and then when I tore it apart, exposing you as being guilty of what you were trying to criticize gays of, you ignored it.\n \n Just cause you stop responding doesn't mean I have to.\n \n \n \nSo on one hand you recommend me not posting...\n\n NO, NO, NO!\n Stop this BLOWI ####.\n \n I am asking you to stop OBFUSCATING the issue of a thread with NON-TOPICAL JUNK.\n You should be discussing the topic of the thread in SOME manner, but habitually you pop on and start side-tracking things by doing your personal attacks against Colbert and his viewers, and other junk.\n \n If you think me asking you to not OBFUSCATE the topic is the same as you \"not posting\", then that's really pathetic.\n \n \n \nYou always play a damned-if-you-do/damned-if-you-don't thing. You don't think those tactics of yours go unnoticed, do you? \n\n You're the first one to try to pin that claim... emoticon_frazzled\n Most people can recognize the difference inbetween not posting at all, and not posting obfuscational, non-topical junk.\n \n \n \nA whopping 2 folks at last count.\n\n Two more folks than have chimed in agreeing with you...\n And like I said, you've got a LONG list of people who have stopped responding to you altogether...\n \n \n \nAnd what's worse, at this point, I'm not sure it would be anyone you're in particularly good company with.\n\n What is that supposed to mean?", 
   {}, 
   358691, 
   null, 
   1245998820.0
  ], 
  [
   358695, 
   null, 
   "foundit66", 
   "Jyoshu? Here's the deal.\n \n You post something topical. I respond with topical.\n You post stories about Obama and gay rights? I responded ON TOPIC.\n \n I post stories about ENDA. You seem to think that's okay.\n You put in a response. I responded topically.\n \n Stories you don't like get posted. You don't have to reply emoticon_frazzled\n You sure as heck don't have to reply with some junk like \"gay pride\" somehow deserves something negative on a thread you think is pointless, and then refuse to follow through on what COULD HAVE BEEN a topical discussion.\n \n Quite frankly, I think you totally missed the point of the \"duck sex\" thread, cause it was talking about a statement made by a religious right anti-gay preacher. Trying to justify opposition to gay equality cause of \"duck sex\" nonsense.\n I do think the absurdity of the anti-gay proponent is topical and note-worthy.\n If you disagree, you don't have to reply.\n \n Keep your comments topical, and there is no problem.\n Ride in trying to obfuscate the thread and start name-calling of people like Colbert or his viewers, and somebody (probably me) is going to call you on it.\n It's just that simple...", 
   {}, 
   358693, 
   null, 
   1245999420.0
  ], 
  [
   358697, 
   null, 
   "jyoshu", 
   "See...? Foundit can't do it. He can't leave well enough alone. \n \n \nI am asking you to stop OBFUSCATING the issue of a thread with NON-TOPICAL JUNK.\n \n If you think me asking you to not OBFUSCATE the topic is the same as you \"not posting\", then that's really pathetic.\n\n \n You said, quite clearly a bit ago \"don't post\" if I think it's pointless. Perhaps you should keep up w/what your typing.\n \n Frankly, the \"issue\" of the thread isn't worth commenting on to me. It obfuscates itself, for all practical purposes. If I start a thread about Mickey Mouse, then accuse people who decide to point out it's a dumb thread of obfuscating, I think the person who starts such a juvenile thread are obfuscating the more important issues already.\n \n - You created a questionable topic to begin with\n - You've digressed the discussion to talking about posters more than the topic\n - Now you're being argumentative asserting I'm the one who should digress from a failed topic that was YOURS, not mine.", 
   {}, 
   358693, 
   null, 
   1246001220.0
  ], 
  [
   359709, 
   null, 
   "Ethmi", 
   "Well it's probably been to long since I visited this thread, but I don't want you to think I abandoned it.\n \n \nCan you explain how I don't tolerate people disagreeing with me?\n\n \n Compare it to your opponents. Would Carrie Prejean be getting all this criticism and publicity if she said she was all for gay rights?\n \n \nAnd while you're at it, kindly explain what you think \"tolerate\" means in the first place.\n\n \n Well I can't see me, Archie, Jyoshu, or the media (not even Fox News) jumping all over Carrie Prejean if she said she was all for gay rights.\n \n \n\"I think in my country, in my family, I think that I believe that a marriage should be between a man and a woman.\"\n That is clearly an opinion for man / woman only marriage.\n \n\n \n I think in my country, in my family, I think that I believe that people shouldn't smoke. Does that mean I advocate banning tobacco?\n \n \nONE judge, P Hilton, proved himself to be a complete *** in his response.\n But don't confuse that with a larger group.\n\n \n How have I confused this? If Fox News jumped on her for saying she supported gay rights, you'd surely \"confuse\" that with all anti-gays. Hell, you once used the claim that Barack Obama was a witch to question the credibility of all who support McCain. Then you changed the subject and started comparing this to the Palin Rally videos, which was a completely different thing.\n \n \nI have repeatedly repudiated Hilton.\n Can you at least admit that? emoticon_emb\n\n \n Before you brought it up, I haven't made any claim that Carrie Prejean lost because of her statement. My point is that she gave an honest answer that nobody wanted to hear. I never said this is why she lost. Can you at least admit that? emoticon_emb", 
   {}, 
   358098, 
   null, 
   1246855740.0
  ], 
  [
   359713, 
   null, 
   "foundit66", 
   "See...? Foundit can't do it. He can't leave well enough alone.\n\n Wow. Speaking of \"can't leave well enough alone\".\n \n You posted a BUNCH of junk on here, hoping that I would respond cause you wanted some pretend conclusion based simply on the fact that I responded to you.\n \n And then when I didn't respond, you came back here AND EDITED YOUR POST to eliminate the evidence of your false predictions... emoticon_xdonno\n \n \n \n- You created a questionable topic to begin with\n\n No. It had several valid points.\n The pathetic part is that you have repeatedly refused to address the ACTUAL POINTS...\n \n The religious right lies about why Prejean was fired, and you think pointing that out is \"questionable\"?\n The \"moral values\" crowd refuses to address the fact that Prejean ACTIVELY DEFENDS her under-age semi-nude photos, and you think pointing that out is \"questionable\"?\n emoticon_wow\n \n \n \n- Now you're being argumentative asserting I'm the one who should digress from a failed topic that was YOURS, not mine. \n\n And that is 100% accurate.\n If you don't think the thread has merit, then leave it alone.\n Instead, you make a point of OBFUSCATING the issue and trying to drag everything off track.\n \n \n And incidentally jyoshu...\n Do you feel lucky enough to hope that I didn't copy down YOUR ORIGINAL POST before you changed it??? emoticon_xangel", 
   {}, 
   358697, 
   null, 
   1246863360.0
  ], 
  [
   359715, 
   null, 
   "Ethmi", 
   "I'll wait for you to finish that post.\n \n Why is it that none of us people...?\n \n Also...\n \n \nWell I can't see me, Archie, Jyoshu, or the media (not even Fox News) jumping all over Carrie Prejean if she said she was all for gay rights.\n \n I think in my country, in my family, I think that I believe that people shouldn't smoke. Does that mean I advocate banning tobacco?\n \n How have I confused this? If Fox News jumped on her for saying she supported gay rights, you'd surely \"confuse\" that with all anti-gays. Hell, you once used the claim that Barack Obama was a witch to question the credibility of all who support McCain. Then you changed the subject and started comparing this to the Palin Rally videos, which was a completely different thing.\n \n Before you brought it up, I haven't made any claim that Carrie Prejean lost because of her statement. My point is that she gave an honest answer that nobody wanted to hear. I never said this is why she lost. Can you at least admit that? \n\n \n Please explain how that's trivia that isn't worth the time of day.", 
   {}, 
   359713, 
   null, 
   1246864980.0
  ], 
  [
   359716, 
   null, 
   "foundit66", 
   "Compare it to your opponents. Would Carrie Prejean be getting all this criticism and publicity if she said she was all for gay rights?\n\n You don't seem to appreciate the real significance of the issue at hand.\n If Prejean hadn't taken the anti-gay marriage stance she had, she would never have been chosen as the \"anti-gay marriage poster child\" in the first place.\n \n THAT KEY MOVE was the item that created the later contradictions...\n \n 1) If Prejean had never been the poster child for the \"moral values\" crew, there would be no contradiction in the moral values crew having a poster child who was acting immorally by taking under-age semi-nude photos, and then lying about it.\n \n 2) If Prejean had never been the poster child for the \"moral values\" crew, they wouldn't have tried to falsely claim she was fired for making a statement she never made.\n \n 3) I really think you fail to recognize WHERE the criticism is aimed at.\n Above, I am pointing out the \"family values\" crew and their association with Nancy. THAT was the key part of this whole thing.\n \n \n A) Her taking semi-nude photos, under-age, and lying about it would have been an issue REGARDLESS of her statement.\n \n B) Her not fulfilling her duties as Miss California would have been an issue REGARDLESS of her statement.\n \n \n \nWell I can't see me, Archie, Jyoshu, or the media (not even Fox News) jumping all over Carrie Prejean if she said she was all for gay rights.\n\n emoticon_wow\n Perez Hilton has \"jumped all over Prejean\".\n If you would bother to READ the posts from the pro-gay posters here, they have expressed disapproval of her statement. But that's it.\n They ALSO REBUKED PEREZ for his antics.\n \n And without surprise, you AGAIN IGNORE MY REQUEST for you to back up your claim.\n I asked you: Kindly explain what you think \"tolerate\" means in the first place. \n Can you do that?\n \n \n \nI think in my country, in my family, I think that I believe that people shouldn't smoke. Does that mean I advocate banning tobacco?\n\n Have you seen her ad with NOM?\n emoticon_xdonno\n \n \n \nHow have I confused this? If Fox News jumped on her for saying she supported gay rights, you'd surely \"confuse\" that with all anti-gays.\n\n No. I wouldn't.\n And you're trying to pretend that two wrongs make a right.\n \n \n \nHell, you once used the claim that Barack Obama was a witch to question the credibility of all who support McCain. Then you changed the subject and started comparing this to the Palin Rally videos, which was a completely different thing.\n\n Either you have gone off the deep-end, or you have me confused with somebody else...\n I never \"used a claim that Barack Obama was a witch\"... emoticon_wow\n \n \n \nBefore you brought it up, I haven't made any claim that Carrie Prejean lost because of her statement. My point is that she gave an honest answer that nobody wanted to hear. I never said this is why she lost. Can you at least admit that? emoticon_emb\n\n First of all, naturally you refused to admit the simple thing I asked for.\n No surprise there.\n \n Going a step further, I admit you never said that was why she lost.\n I also admit, I never said that you said that was why she lost. emoticon_xdonno\n \n I think you miss the major points here.\n P Hilton was virtually alone in going crazy over his opposition.\n Other people VOICED AN OPINION opposing Prejean's opinion, but that's it.", 
   {}, 
   359709, 
   null, 
   1246865160.0
  ], 
  [
   359722, 
   null, 
   "Ethmi", 
   "You don't seem to appreciate the real significance of the issue at hand.\n If Prejean hadn't taken the anti-gay marriage stance she had, she would never have been chosen as the \"anti-gay marriage poster child\" in the first place.\n \n THAT KEY MOVE was the item that created the later contradictions...\n \n 1) If Prejean had never been the poster child for the \"moral values\" crew, there would be no contradiction in the moral values crew having a poster child who was acting immorally by taking under-age semi-nude photos, and then lying about it.\n \n 2) If Prejean had never been the poster child for the \"moral values\" crew, they wouldn't have tried to falsely claim she was fired for making a statement she never made.\n \n 3) I really think you fail to recognize WHERE the criticism is aimed at.\n Above, I am pointing out the \"family values\" crew and their association with Nancy. THAT was the key part of this whole thing.\n \n \n A) Her taking semi-nude photos, under-age, and lying about it would have been an issue REGARDLESS of her statement.\n \n B) Her not fulfilling her duties as Miss California would have been an issue REGARDLESS of her statement.\n\n \n Then I wonder why she wasn't getting this publicity until after she made the statement. I also wonder what kind of jackasses do the background checks for these competitions, considering that someone known for willingly modeling for semi-nude photos underage and lying about it, both of which are crimes, could waltz onto the stage.\n \n Well even if it's true I guess, which it may be, nobody gave a damn until after she made the statement.\n \n However, I'm not sure about this so this may just be \"trivia not worth the time of day\", but if you refer to an \"exclusive\" image or story, you can trust it to be fake. \n \n \nemoticon_wow\n Perez Hilton has \"jumped all over Prejean\".\n If you would bother to READ the posts from the pro-gay posters here, they have expressed disapproval of her statement. But that's it.\n They ALSO REBUKED PEREZ for his antics.\n\n \n Mario Lavandeira, may be acting like a jackass, but that's not what I'm talking about. Suddenly, after her statement, people begin to \"discover\" scandals, crimes, unflattering photos, etc. that are sometimes exclusively found on sites all over the internet, probably exclusive for a reason.\n \n It will never cease to amaze me how wretched someones past becomes after they tell society something they don't want to hear. Even if all the accusations are true and she's also done some stuff we don't know about, did anyone really care until she said she thinks marriage should be between a man and a woman?\n \n \nAnd without surprise, you AGAIN IGNORE MY REQUEST for you to back up your claim.\n I asked you: Kindly explain what you think \"tolerate\" means in the first place. \n Can you do that?\n\n \n Can you stop digging up graves? You won't exhume treasure, just rot. Do you understand why I said that nobody would've given a rat's XXX if she said \"I'm all for gay rights?\"\n \n Look, eleventy thousand peopole on the gay rights side is \"uncovering\" photos, stories, dirty little secrets, etc. about what a miscreant Carrie Prejean is, but it happens after she tells them something they don't want to hear. \n \n \nHave you seen her ad with NOM?\n emoticon_xdonno\n\n \n I had to dig a bit to find this. This situation isn't exactly the same but it's pretty much the same basic idea.\n \n \nYOU make the claim, and do absolutely nothing to \"prove it\".\n But then you insist people \"prove you wrong\". \n \n http://www.4forums.com/political/religion-debates/11181-biblical-god-bigger-liar-then-satan-4.html\n \n\n \n Maybe you should practice what you preach?\n \n \nNo. I wouldn't.\n\n \n You expect me to believe that after all you concluded about McCain supporters and Christians because one radical Pastor called Obama a witch, then you used the completely irrelevant Palin rally videos to support this? \n \n \nAnd you're trying to pretend that two wrongs make a right.\n\n \n If you mean that I'm saying it'd be right for Fox to do that, you're completely wrong. I don't get upset when I see Barack Obama get up on stage and say we need a \"Civilian security force\", I don't get upset when I see Sarah Brady talking about the evils of guns, I don't get upset when I see peaceful gay rights protests.\n \n However, none of the pro-gays have hesitated to scream bloody gore when Carrie Prejean got up on stage and said \"I believe that a marriage should be between a man and a woman, no offense to anyone out there, but that's how I was raised...\"\n \n It doesn't matter wether you bluntly say \"She was wrong to say that\" or you magically find dirty little secrets that got no publicity before she made the statement, the reason you react doesn't change.\n \n \nEither you have gone off the deep-end, or you have me confused with somebody else...\n I never \"used a claim that Barack Obama was a witch\"... emoticon_wow\n\n \n It wasn't your claim, some Christian guy used that. Then you found it, posted it, and said \"See? Christians and McCain supporters are just as radical as this guy! Just look at the Palin rally videos, which are relevant to the Pastor in absolutely no way at all.\"\n \n Before you accuse me of lying, I was paraphrasing what you said.\n \n \nFirst of all, naturally you refused to admit the simple thing I asked for.\n No surprise there.\n\n \n That's because it's not relevant. I don't give a damn about what Mario Lavandeira has to say. It's how the pro-gay community is \"uncovering\" all of Carrie Prejeans dirty little secrets.\n \n \nGoing a step further, I admit you never said that was why she lost.\n I also admit, I never said that you said that was why she lost. emoticon_xdonno\n\n \n Then how was Mario Lavandeira relevant to this? I don't care much about the pageant.\n \n \nI think you miss the major points here.\n P Hilton was virtually alone in going crazy over his opposition.\n Other people VOICED AN OPINION opposing Prejean's opinion, but that's it.\n\n \n Mario Lavandeira was virtually alone among the elites of society. But I don't think you really believe that it's just coincidence that all these scandals are being \"revealed\" conviniently after she made a statement expressing her honest opinion. And I don't know what you believe, but I don't think every single one of these secrets is true.\n \n EDIT: I guess I forgot to mention this, but I highly doubt anyone would be finding these \"secrets\" if she said she supported gay rights.", 
   {}, 
   359716, 
   null, 
   1246870980.0
  ], 
  [
   359757, 
   null, 
   "foundit66", 
   "Then I wonder why she wasn't getting this publicity until after she made the statement. I also wonder what kind of jackasses do the background checks for these competitions, considering that someone known for willingly modeling for semi-nude photos underage and lying about it, both of which are crimes, could waltz onto the stage.\n\n I suspect the \"background checks\" consist of \"does she have a criminal record\" and \"how does her back look\"...\n \n I doubt they did any real investigative work at all.\n \n \n \nWell even if it's true I guess, which it may be, nobody gave a damn until after she made the statement.\n\n I don't understand why this is such a big deal to you.\n Before, she was just a contestant. The average Tawna, Delores, and Henrietta don't get real attention.\n But WHEN THEY GET HIGHER ON THE CELEBRITY scale, THEN people start paying more attention.\n \n Quite frankly, I think you guys are looking at this bass-ackwards.\n If we could compare parallel universes, I would LOVE to see the following two scenarios compared:\n A) Prejean gives her reply, exactly the same, but P Hilton does NOT become an offensive %%% over it.\n B) Prejean gives her reply, exactly the same, and P Hilton does become an offensive %%% over it (our reality).\n \n Quite frankly, it was P Hilton who rocketed the whole situation, and people don't appreciate THE RIGHT-WING making her a celebrity because of it.\n Again, referencing her NOM ad, she would not have been in it if P Hilton hadn't attacked her like he did.\n \n BECAUSE OF THAT, the right-wing embraced her. Otherwise, they would never have been able to say \"look how vilely gays attack her\".\n \n \n \nMario Lavandeira, may be acting like a jackass, but that's not what I'm talking about.\n\n That's not what you WANT to talk about.\n 'mmkay?\n And frankly, I don't think you appreciate the significance of him acting like a jackass. A LOT of what followed would not have happened without his actions. Cause HIS ACTIONS are part of what made this an issue for the right-wing exaggeration/stereo-type.\n \n (There is no \"may be\" about whether or not ML was a jackass.)\n \n \n \nSuddenly, after her statement, people begin to \"discover\" scandals, crimes, unflattering photos, etc. that are sometimes exclusively found on sites all over the internet, probably exclusive for a reason.\n\n You're trying to fixate exclusively on PART of the thing that made her famous, ignoring ALL of what made her famous.\n And people dig into \"famous people's\" lives all the time. Look at Obama and his Rev Wright tapes after he became a serious contender.\n \n You want to pretend it is JUST about her being anti-gay, but the REAL issue is that she became MORE FAMOUS.\n It wasn't \"anti-gay\", but rather FAME which was the driving force.\n \n \n \nIt will never cease to amaze me how wretched someones past becomes after they tell society something they don't want to hear. Even if all the accusations are true and she's also done some stuff we don't know about, did anyone really care until she said she thinks marriage should be between a man and a woman?\n\n The more precise question should be \"did anyone really care until she said became famous?\"\n \n Earlier, I gave two scenarios.\n A) Prejean gives her reply, exactly the same, but P Hilton does NOT become an offensive %%% over it.\n I think that under this scenario, gay bloggers would have joked about her \"opposite marriage\" comment, voiced their disapproval of her statement, and moved on.\n The right would not have been able to embrace her as a martyr. She wouldn't be on Fox News talking about how bashed she was because of P Hilton.\n It would have died off fairly quickly. Maybe somebody would have dug up her semi-nude photos.\n She would not have gotten fired cause she would not have been busy doing the anti-gay marriage poster child thing.\n \n Look at your point from a different angle.\n MILLIONS of people share her belief, yet nobody runs around trying to dig up dirt on every single one of them.\n What's the difference?\n FAME!\n \n \n \nCan you stop digging up graves?\n\n Can you stop avoiding the question? You made a statement I want to hear elaboration on.\n If you want to withdraw your accusation, then please do so and we'll be done with it.\n But until then... \n I asked you: Kindly explain what you think \"tolerate\" means in the first place.\n Can you do that? \n \n \n \nDo you understand why I said that nobody would've given a rat's XXX if she said \"I'm all for gay rights?\"\n\n \"Nobody\"? I think you under-estimate the anti-gay marriage crowd's response. If a politician says they support gay marriage, suddenly the anti-gay marriage crowd portrays the person as being \"against family values\".\n \n But more to the heart of the matter, I still hold that it would be more accurate to recognize the linchpin as *Do you understand why people would not have paid that much attention if P Hilton hadn't acted like an %%%?*\n \n \n \nLook, eleventy thousand peopole on the gay rights side is \"uncovering\" photos, stories, dirty little secrets, etc. about what a miscreant Carrie Prejean is, but it happens after she tells them something they don't want to hear.\n\n You do reality a serious misjustice in thinking it's just about \"on the gay rights side\".\n I mean, LOOK at who uncovered the Prejean photos in the first place...\n TMZ.com - Wikipedia, the free encyclopedia\n \n They aren't \"on the gay rights side\".\n They are \"...a celebrity gossip website which debuted in December 2005, and is a collaboration between AOL and Telepictures Productions, a division of Warner Bros. (all of which are owned by Time Warner).[1] TMZ's managing editor is Harvey Levin, a law graduate-turned-journalist who got his start as a legal expert on LA's KCBS-TV.\" \n That isn't a \"gay rights\" thing. They are interested in CELEBRITY GOSSIP. Celebrity scandals.\n \n And they harass people who are for gay rights and against gay rights ALIKE. An equal opportunity hemorrhoid.\n \n \n \nI had to dig a bit to find this. This situation isn't exactly the same but it's pretty much the same basic idea.\n\n I would agree. It is the same basic idea.\n Except we have profound differences on what that \"idea\" is.\n \n Look. The anti-gay marriage crowd RECOGNIZES HER STATEMENT for being the same as what I have talked about.\n They understand she is against gay marriage.\n I understand she is against gay marriage.\n \n Quite frankly, you are the first person I have come across who has tried to draw the line like you claim.\n \n \n \nMaybe you should practice what you preach?\n\n I happily do.\n If you have a claim that I actually made that you want me to substantiate, please point it out.\n Otherwise, your reply is shallow and empty. Much like your original accusation of my lack of tolerance.\n \n \n \nIf you mean that I'm saying it'd be right for Fox to do that, you're completely wrong.\n\n No. I'm saying that you are using your HYPOTHETICAL accusation of what you think I would do to try to justify what you ACTUALLY did...\n \n From your earlier statement: \"The judges were upset because that wasn't the answer they wanted to hear.\"\n Can you name me ANY other judge beyond P Hilton who was \"upset\" because of her response?\n \n Quit generalizing and then accusing me of doing it in your imagination.\n \n \n \nHowever, none of the pro-gays have hesitated to scream bloody gore when Carrie Prejean got up on stage and said \"I believe that a marriage should be between a man and a woman, no offense to anyone out there, but that's how I was raised...\"\n\n I added the emphasis to \"scream bloody gore\".\n You need to tone down the exaggeration.\n P Hilton acted like a jerk.\n Do NOT generalize his attitude onto everybody else.\n \n You say \"none of the pro-gays\" stopped from doing that?\n Fine. QUOTE ME in where I supposedly \"screamed bloody gore\"... emoticon_ic\n \n \n \nIt doesn't matter wether you bluntly say \"She was wrong to say that\" or you magically find dirty little secrets that got no publicity before she made the statement, the reason you react doesn't change.\n\n Are you seriously that delusional?\n \"It doesn't matter\" if we just bluntly say \"She was wrong to say that\"???? emoticon_xdonno\n I think it matters COMPLETELY.\n Cause in this country, it is entirely rational for people to SPEAK THEIR MIND and state their opinion of agreement or disagreement.\n There is NOTHING WRONG with saying \"she was wrong\".\n Nothing at all.\n \n And as for the latter part, you are again improperly assuming the driving factor is \"we got to get her cause she said something against gay marriage\".\n You are EPITOMIZING what the right-wing anti-gay side wants America to believe. That they are victimized just cause they oppose gay equality... \n She was investigated by a TABLOID RAG (which has no real \"pro-gay\" association) BECAUSE SHE BECAME MORE FAMOUS.\n \n \n \nIt wasn't your claim, some Christian guy used that. Then you found it, posted it, and said \"See? Christians and McCain supporters are just as radical as this guy! Just look at the Palin rally videos, which are relevant to the Pastor in absolutely no way at all.\"\n\n Now you are ringing some bells.\n Let me repeat WHAT I ACTUALLY SAID.\n \n foundit66: \"I am routinely amazed at the depths that some of the \"McCain supporters\" will go to.\"\n I added emphasis to the word you evidently missed.\n Later on: \"I am just demonstrating what some McCain supporters are like.\"\n \n \n \nBefore you accuse me of lying, I was paraphrasing what you said.\n\n Inappropriately paraphrasing.\n Look. You're pulling the same junk you routinely do.\n You DROP the issue in the thread it was ACTUALLY RAISED in, and then later on you try to make it part of a focus in a SEPARATE thread.\n \n http://www.4forums.com/political/elections-debates/11811-block-african-witchcraft-curses-against-mccain-palin-now-2.html\n Here's the original thread.\n RESPOND to what you don't like THERE, and then we can talk about THAT THERE.\n Otherwise, this is pointless.\n \n \n \nIt's how the pro-gay community is \"uncovering\" all of Carrie Prejeans dirty little secrets.\n\n Provide any evidence you can muster that the TMZ (a celebrity gossip / tabloid / rag) uncovering Prejean's nude photos HAD ANYTHING to do with a \"pro-gay\" motivation.\n You assume it so, cause you want to see the gay boogeyman behind inconveniences out there for people who oppose gay equality.\n But the truth is that this is NOTHING NEW for that magazine.\n THIS is what they do. They RAKE UP DIRT for a living.\n \n \n \nThen how was Mario Lavandeira relevant to this? I don't care much about the pageant.\n\n Explained above.\n He was a linchpin. Without his reaction, the anti-gay marriage crowd could not have exaggerated her as a martyr. Without his reaction, she would not have done interviews on an \"attack\" that never happened.\n She would probably still have her job, as she would not have been out doing the \"anti-gay marriage\" thing instead of her Miss California committments.\n \n \n \nMario Lavandeira was virtually alone among the elites of society. But I don't think you really believe that it's just coincidence that all these scandals are being \"revealed\" conviniently after she made a statement expressing her honest opinion.\n\n Let's put this in perspective...\n TMZ ROUTINELY looks for and finds nude pictures of celebrities that have ABSOLUTELY NOTHING to do with \"anti-gay marriage\" stances.\n Google \"tmz nude pictures\" (NOT in picture mode, with google filter searching on) and you'll see that TMZ has put out naked pictures of:[*]Rihanna[*]Vanessa Hudgens[*]Adrienne Bailon[*]Brittney Spears[*]Zac Efron[*]Blah, Blah, blah...Posting nude pictures of celebrities IS WHAT THESE PEOPLE DO!\n So it boggles the mind as to why you think that THIS SAME MAGAZINE which ROUTINELY DOES THIS FOR A LIVING decided to just go after Prejean just cause she was \"anti-gay marriage\". emoticon_xdonno\n \n \n \nEDIT: I guess I forgot to mention this, but I highly doubt anyone would be finding these \"secrets\" if she said she supported gay rights.\n\n The actual linchpin to her popularity was P Hilton.\n If he hadn't been an #####, saying all those vile things, the right-wing would not have made her their poster child and paraded her around interviews and talk shows to talk about how abused she was.\n She would not have had the \"fame\" if not for Perez.\n And therefore, the tabloid rag the routinely posts nude photos of famous people would not have seen her as print worthy.\n \n This is about her BEING MADE FAMOUS.\n Not about the details which lead to the fame. emoticon_xdonno", 
   {}, 
   359722, 
   null, 
   1246917360.0
  ], 
  [
   359759, 
   null, 
   "jyoshu", 
   "And incidentally jyoshu...\n Do you feel lucky enough to hope that I didn't copy down YOUR ORIGINAL POST before you changed it??? emoticon_xangel\n\n \n If there's anything someone says before they edit a post that you think you could use against them, I'm sure you would do so. It's been awhile and I don't even remember what it was or why I made the correction, frankly. Nor do I really care that much.", 
   {}, 
   359713, 
   null, 
   1246919280.0
  ], 
  [
   359760, 
   null, 
   "foundit66", 
   "If there's anything someone says before they edit a post that you think you could use against them, I'm sure you would do so.\n\n It's more along the lines of you saying you were going to do something...\n ... and posting it ...\n ... then deciding to erase all evidence of what you said you were going to do after you decide you don't want to follow through.\n \n \n \nIt's been awhile and I don't even remember what it was or why I made the correction, frankly. Nor do I really care that much.\n\n Care enough to make this post, eh?\n Ironically, it had to do with you not coming back to this thread anymore...\n \n But yeah. I'm not surprised you *wouldn't remember* that... emoticon_frazzled", 
   {}, 
   359759, 
   null, 
   1246920000.0
  ], 
  [
   359764, 
   null, 
   "jyoshu", 
   "It's more along the lines of you saying you were going to do something...\n ... and posting it ...\n ... then deciding to erase all evidence of what you said you were going to do after you decide you don't want to follow through.\n\n \n Sorry, I don't even know what you're talking about. And I think whatever you're carrying on about here is probably a lot bigger deal to you than it is to me.", 
   {}, 
   359760, 
   null, 
   1246923900.0
  ], 
  [
   359765, 
   null, 
   "foundit66", 
   "Sorry, I don't even know what you're talking about. And I think whatever you're carrying on about here is probably a lot bigger deal to you than it is to me.\n\n Dude...\n If I come across an insignificant thread, I just don't bother to comment.\n You on the other hand, spend dozens of posts complaining about it...\n Obfuscating it. Trying to change the thread subject...\n \n As Shakespeare stated, thou \"doth protest too much, methinks\"... emoticon_frazzled", 
   {}, 
   359764, 
   null, 
   1246924440.0
  ], 
  [
   359768, 
   null, 
   "jyoshu", 
   "Dude...\n If I come across an insignificant thread, I just don't bother to comment.\n You on the other hand, spend dozens of posts complaining about it...\n Obfuscating it. Trying to change the thread subject...\n\n \n More FOPIOI.", 
   {}, 
   359765, 
   null, 
   1246926000.0
  ], 
  [
   359776, 
   null, 
   "foundit66", 
   "More FOPIOI.\n\n There you go again.\n You talk about me.\n I respond in kind.\n Then you accuse FOPIOI... :xbanghead\n \n And the funny thing is that you have REPEATEDLY PROVEN that you want to ignore the issue in this thread.\n You repeatedly post comments making it just about the posters.\n But then you accuse others of it...\n \n Tell you what Jyoshu.\n Here's a challenge.\n I will discuss the topic and stop discussing the posters from here-on out on this thread.\n Will you do the same?", 
   {}, 
   359768, 
   null, 
   1246931040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Donald Trump fires Miss California Carrie Prejean", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12858, 
  "discussion_files": [
   [
    "15270.html", 
    "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-print.html"
   ], 
   [
    "15271.html", 
    "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-5-print.html"
   ], 
   [
    "15272.html", 
    "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-4-print.html"
   ], 
   [
    "15273.html", 
    "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-3-print.html"
   ], 
   [
    "15274.html", 
    "http://www.4forums.com/political/gay-rights-debates/12858-donald-trump-fires-miss-california-carrie-prejean-2-print.html"
   ]
  ], 
  "identifier": 12858
 }
]