[
 [
  [
   357269, 
   null, 
   "antonia", 
   "What are people's thoughts on the Iranian elections? There's massive turn-out in what is reportedly a very close election. I don't know much about Ahmadinajad's challenger, but I prefer what the cameras seem to represent about the challenger's supporters. That is, they show the peace sign a lot and friendly faces to the American cameras. They also speak about the human rights abuses in Iran and the need for reform, there. While Amadinajad's people have \"Down With U.S.A.\" painted on them, all the old war-like rhetoric, etc. etc. One headline said his competitor will win if the elections aren't rigged. Anyway, short of more info. about the candidates, I am hoping for the world's sake that a changing of the guard is about to take place. I am really tired of hearing that guy shoot his idiotic mouth off.\n \n Here's coverage from BBC.\n \n BBC NEWS | Middle East | Huge turnout in Iran presidential poll", 
   {
    "post_info": {
     "post_title": "Iranian Elections"
    }
   }, 
   null, 
   null, 
   1244835720.0
  ], 
  [
   357304, 
   null, 
   "DrNo", 
   "I think they mean absolutely nothing and they are probably rigged. The president of Iran is just a figurehead anyway. Of course they will say it was close, so that people who \"voted\" against Ahmadinajad will feel better about losing.", 
   {}, 
   357269, 
   null, 
   1244850120.0
  ], 
  [
   357308, 
   null, 
   "Penfold", 
   "It is a close-run thing, and we may yet witness a step toward more democratic freedom for the Iranian people. From the only place that counts, within.", 
   {}, 
   357304, 
   null, 
   1244854620.0
  ], 
  [
   357362, 
   null, 
   "Lakrite", 
   "I think they mean absolutely nothing and they are probably rigged. The president of Iran is just a figurehead anyway. Of course they will say it was close, so that people who \"voted\" against Ahmadinajad will feel better about losing.\n\n I think that is the most likely scenario.", 
   {}, 
   357308, 
   null, 
   1244928720.0
  ], 
  [
   357366, 
   null, 
   "Penfold", 
   "It seems we were all wrong. It's no change, but there wasn't even a pretence of close.", 
   {}, 
   357362, 
   null, 
   1244933760.0
  ], 
  [
   357384, 
   null, 
   "chester", 
   "It seems we were all wrong. It's no change, but there wasn't even a pretence of close.\n\n \n It seems the people of Iran have spoken in a relatively free and fair election.\n \n Now the onus is on the USA to negotiate with this legally elected head of state.\n \n For us to do otherwise is to make a mockery of the very idea of free elections.", 
   {}, 
   357366, 
   null, 
   1244948340.0
  ], 
  [
   357386, 
   null, 
   "antonia", 
   "Huffingtonpost is reporting violent demonstrations regarding the election results, which the contenders' supporters allege is fraudulent. They have a number of photographs and television news videos documenting the public outcry. Washington Post is reporting that, in spite of the greatly differing figures between candidates, both are claiming victory.", 
   {}, 
   357366, 
   null, 
   1244950680.0
  ], 
  [
   357391, 
   null, 
   "Zardoz", 
   "It seems the people of Iran have spoken in a relatively free and fair election.\n \n Now the onus is on the USA to negotiate with this legally elected head of state.\n \n For us to do otherwise is to make a mockery of the very idea of free elections.\n\n \n Yep.\n We must obey the will of the people.\n The vote was totally fair!\n \n So...why are those who obviously voted for M.A. rioting?\n \n I guess they are like America.\n Vote for someone insane...and then riot about the results.", 
   {}, 
   357384, 
   null, 
   1244954460.0
  ], 
  [
   357438, 
   null, 
   "simone", 
   "The Iranians are doing what we Americans should have been doing in the year 1000.", 
   {}, 
   357269, 
   null, 
   1245003540.0
  ], 
  [
   357441, 
   null, 
   "antonia", 
   "Here's another article, as Iranian demonstrations continue, on the second day. This writer discusses some of the evidence for what he calls a \"soft coup\", i.e. massive election fraud, but concludes that the demonstrations aren't great enough, even in Iran, and Ahmadinajad, the world's spoiled brat of political entitlement, will get his way.\n \n t r u t h o u t | Stealing the Iranian Election\n \n I hope it's not going to be another XX number of years, tolerating and oversighting and eye rolling his rhetorical idiocy, but it looks like the Grand Religious Pooh Pahs are behind their Boy Wonder, despite how many empty buses the Iranian People set on fire.\n \n Not that the religious authorities necessarily like him so much, but they've had a dispute with his contender for about 30 years now. So implies that writer.", 
   {}, 
   357438, 
   null, 
   1245004080.0
  ], 
  [
   357475, 
   null, 
   "jim's trucking", 
   "It seems the people of Iran have spoken in a relatively free and fair election.\n \n Now the onus is on the USA to negotiate with this legally elected head of state.\n \n For us to do otherwise is to make a mockery of the very idea of free elections.\n...and of course you are in a perfect position to judge the fairness of the Iranian election.emoticon_rolleyes\n \n \nThe Iranians are doing what we Americans should have been doing in the year 1000.\nWe Americans did not exist in the year 1000.\n \n \n ...and I'm not sure I get what you mean by \"The Iranians are doing what we should have been doing...\" Do you mean we should be voting for a racist, maniacal pygmy with a Napoleon complex and a hatred of Jews or that we should be protesting the rigged election of such a worthless dog?", 
   {}, 
   357441, 
   null, 
   1245016980.0
  ], 
  [
   357492, 
   null, 
   "simone", 
   "But, of course, trucker Jim. Make that the year 2000 when the U.S. Supreme Court anointed George W. Bush as president of the U.S.", 
   {}, 
   357475, 
   null, 
   1245024180.0
  ], 
  [
   357513, 
   null, 
   "antonia", 
   "Radio Free Europe has an interview with a female news reporter from a moderate Iranian newspaper. Her identity is protected. Excerpt:\n \n -----------\n \n RFE/RL: What happened in Iran or what is happening in Iran? Some call it a coup, while others describe it as an epic and a \"people's election.\" What is your view as a journalist who is in Tehran?\n \n Iranian Journalist: The important event that took place in Iran is that it wasn't an election; it was a coup d'etat. [They] stole 24 million votes of the nation and took them away for themselves. If there were really a winner, they would have to celebrate, but instead they beat people. They performed a coup, but they don't call it a coup.\n \n RFE/RL: What are the indications?\n \n Journalist: Please don't use the word \"fraud\" because it is mitigation of what has happened in Iran. Fraud is what was happening in the past 30 years. This is not fraud. They haven't [counted ] people's votes. Using the word fraud is like calling a deep cut a small scratch. There was no fraud; it was a coup.\n \n RFE/RL: Please explain why you call it a coup. Based on what? \n \n Journalist: Based on the military atmosphere that is now ruling [in the country], based on the threats against senior officials in the country. What are the elements of a coup in the world? Just now as we're speaking, [Mahmud Ahmadinejad] said I'll clean the Iranian establishment of all these corrupted elements. [If this isn't] a coup, then what is it?\n \n Coup means that right now they're beating people in the streets. A coup means they didn't even count people's votes. They announced the results without opening the ballot boxes. It was sent as a circular to the state television, which announced it. Is it so difficult for the world to understand this? \n \n RFE/RL: How do you think the world should react to what has happened in Iran and what is happening right now -- the protests and the crackdown?\n \n Journalist: Recognizing Iran's election as an election is a crime against democracy. The countries that have fought for democracy, countries that talk about democracy, if they accept this, they're betraying themselves. This was not an election. If they accept this, it means they've put democracy under question. They've launched a coup under the cover of democracy.\n \n This is a very important event. Just look at what the indications for a coup are. Last night, [cellphone] lines were cut; we can't send SMSs. We can't check our e-mails. We can't keep in touch on Facebook. If this was a real election, then why [these measures]? [People] are responding to this in the streets. People were being beaten up in the streets until 4 a.m. They had gone out to be beaten. Everyone is upset and [holding back tears].\n \n (full interview at link)\n \n 'From Now On, Democracy Doesn't Exist Anymore' - Radio Free Europe / Radio Liberty 2009\n \n --------------------\n \n Christianne Amanpour, who was born in Iran, also reports from within the nation that they are beating the demonstrators up. \n \n YouTube - Iran Election protests 4/4\n \n Another article I read said the police beat up a middle aged woman.\n \n Huffpost has another video interview with Amanpour and her analysis.", 
   {
    "unicode_changes_made": true
   }, 
   357492, 
   null, 
   1245033900.0
  ], 
  [
   357570, 
   null, 
   "Lakrite", 
   "There is no way these elections were fair. Ahmadinejad censored the websites of his opponent. \n Q & A: Was the Iranian election rigged? - CNN.com\n \n Blocking websites:\n Iranian authorities censor Ahmadinejad opponent&#8217;s websites\n \n This election was anything but fair.", 
   {}, 
   357513, 
   null, 
   1245098400.0
  ], 
  [
   357572, 
   null, 
   "Chuz Life", 
   "But, of course, trucker Jim. Make that the year 2000 when the U.S. Supreme Court anointed George W. Bush as president of the U.S.\n\n \n Don't be a hater, Simone.", 
   {
    "post_info": {
     "post_title": "Now,...."
    }
   }, 
   357492, 
   null, 
   1245098760.0
  ], 
  [
   357577, 
   null, 
   "simone", 
   "If speaking the simple truth is hatred...", 
   {}, 
   357572, 
   null, 
   1245099840.0
  ], 
  [
   357582, 
   null, 
   "Chuz Life", 
   "If speaking the simple truth is hatred...\n\n \n I know how you feel.", 
   {
    "post_info": {
     "post_title": "Yeah,...."
    }
   }, 
   357577, 
   null, 
   1245101460.0
  ], 
  [
   357616, 
   null, 
   "antonia", 
   "I think both of Bush's elections were invalid, though 2000 was pretty blatant. That being behind us, though, it's astounding the degree to which Ahmadinejad is thumbing his nose in the face of democracy. Heck, they didn't even try to make it look close. They have no monitoring body. Plus, they didn't count boxes upon boxes of votes, if I am understanding the story correctly, and while claiming to have counted 40 million paper ballots in 2 hours after the polls closed. (Canada is remarkable for being able to hand count their paper ballots for a national election in 4 days.) I guess the rough equivalent, in the U.S., would be if they counted the votes for 2 or 3 states heavily known to be one candidate's favor, and then, declared victory and ignored all the rest.\n \n In the U.S., the big issue, to me, in holding valid elections, is having a return to simple paper ballots publicly counted (like, in Canada, for example). Because I think computerized election is so open to corruption. And with paper ballots, when you do monitor elections, the evidence is right there.\n \n Given that they have paper ballots, it seems there should be some impartial monitoring body to publicly recount -- and account for -- all the votes. But considering that recounts are challenging even in our elections (with whoever's ahead fighting it), and Iran is a country where they stone people to death, it seems unlikely short of some unusual international feat.\n \n Ahamadinajad seems plagued with an extraordinary inadequacy complex that he is trying to compensate for. Like many dictators. And of course, his thumbing the nose at blatant voting evidence is no different than the way he thumbs his nose at blatant evidence for other things ...", 
   {}, 
   357582, 
   null, 
   1245113520.0
  ], 
  [
   357629, 
   null, 
   "Jo Bennett", 
   "I think both of Bush's elections were invalid, though 2000 was pretty blatant. That being behind us, though, it's astounding the degree to which Ahmadinejad is thumbing his nose in the face of democracy. Heck, they didn't even try to make it look close. They have no monitoring body. Plus, they didn't count boxes upon boxes of votes, if I am understanding the story correctly, and while claiming to have counted 40 million paper ballots in 2 hours after the polls closed. (Canada is remarkable for being able to hand count their paper ballots for a national election in 4 days.) \n\n \n It all depends on how many people you have counting. In the UK, we normally get the first results within the hour (a couple of constituencies in urban areas compete to get the first results in) and enough results to tell who won within 12 hours of the polls closing. A well organised ballot with only a few candidates, and sufficient counters, could be completed within a relatively small time scale, paper ballots or no. Canada is huge, just getting ballot boxes from remote areas will take time (complete UK results are usually delayed by Eilean Siar and Orkney & Shetland)", 
   {}, 
   357616, 
   null, 
   1245132840.0
  ], 
  [
   357632, 
   null, 
   "antonia", 
   "It all depends on how many people you have counting. In the UK, we normally get the first results within the hour (a couple of constituencies in urban areas compete to get the first results in) and enough results to tell who won within 12 hours of the polls closing. A well organised ballot with only a few candidates, and sufficient counters, could be completed within a relatively small time scale, paper ballots or no. Canada is huge, just getting ballot boxes from remote areas will take time (complete UK results are usually delayed by Eilean Siar and Orkney & Shetland)\n\n \n That makes sense, but you have a broad consensus in the U.K. that the results obtained within such a time frame are a reasonable projection of outcome once vote counting is completed. And, you don't stop counting, at that point. Your elections are also monitored by all sides. And certainly not just handed over to the Church.\n \n There were hundreds of thousands of Iraqis in the street today, I read. A demonstration reportedly 5 miles long, with people carrying signs saying things like, \"What happened to my vote?\", decrying Ahmadinajad as a corrupt dictator, and the government as a theocracy.", 
   {}, 
   357629, 
   null, 
   1245141720.0
  ], 
  [
   357636, 
   null, 
   "Winston Smith", 
   "theocracy? that sounds good to me. I'd rather be ruled by men of the cloth than by atheists and Marxists and pro-abortion femininists\n emoticon_xangel", 
   {}, 
   357632, 
   null, 
   1245144960.0
  ], 
  [
   357641, 
   null, 
   "DrNo", 
   "I find it absolutely amazing how people on this forum (and in general) can so easily accuse Bush of rigging the elections and then somehow believe Obama is not guilty of the same thing. I mean, if the Republicans rigged the votes for two straight elections, why didn't John McCain win? Why didn't they rig the vote again? Could it be that all of our elections are rigged and the \"two party system\" is just an illusion? Could it be that Republicans and Democrats are just two sides of the same coin?\n \n This reminds me of the original Iraq war in 1991. I remember hearing reports of how the media in Iraq was fabricating stories of victory and the Iraqi people had no idea they were getting their asses kicked. I remember how people laughed at how naive those people were for believing their silly state-run media. I remember asking, \"What makes you think that doesn't happen here?\" And I remember never getting a response.", 
   {}, 
   357636, 
   null, 
   1245157920.0
  ], 
  [
   357654, 
   null, 
   "CUNxTime", 
   "theocracy? that sounds good to me. I'd rather be ruled by men of the cloth than by atheists and Marxists and pro-abortion femininists\n emoticon_xangel\n\n \n I'd rather just be left the #&%@ alone then ruled by anyone no matter how 'benign'.", 
   {}, 
   357636, 
   null, 
   1245165720.0
  ], 
  [
   357657, 
   null, 
   "chester", 
   "I'd rather just be left the #&%@ alone then ruled by anyone no matter how 'benign'.\n\n \n Then find your own deserted island and set up shop.\n \n It had better be completely uninhabited before your arrival or you will soon find yourself in Hobbes's State of Nature.", 
   {}, 
   357654, 
   null, 
   1245166620.0
  ], 
  [
   357658, 
   null, 
   "chester", 
   "I find it absolutely amazing how people on this forum (and in general) can so easily accuse Bush of rigging the elections and then somehow believe Obama is not guilty of the same thing. I mean, if the Republicans rigged the votes for two straight elections, why didn't John McCain win? Why didn't they rig the vote again? Could it be that all of our elections are rigged and the \"two party system\" is just an illusion? Could it be that Republicans and Democrats are just two sides of the same coin?\n\n \n Because the traitorous McCain was SUCH a loser, and the Wink Girl was SUCH a drag on the ticket that NO amount of rigging could have changed the outcome.", 
   {}, 
   357641, 
   null, 
   1245166740.0
  ], 
  [
   357664, 
   null, 
   "trebor", 
   "Because the traitorous McCain was SUCH a loser, and the Wink Girl was SUCH a drag on the ticket that NO amount of rigging could have changed the outcome.\n\n \n \n Let's face it, a large amount of people were so upset at the economy, and so upset with the last 8 years, it would have taken a total incompetent democrate to lose. McCain was a sacrificial lamb in some respects, and having Palin as VP choice was a gamble of desperation that made things even worse.\n \n That being said, I see the internal politics of Iran being pretty unstable at the moment. I suspect that the current admin will 'win', and there will be a lot of repression of the opposition, where any violence that happens will be blamed on the west/israel.", 
   {}, 
   357658, 
   null, 
   1245170460.0
  ], 
  [
   357671, 
   null, 
   "simone", 
   "theocracy? that sounds good to me. I'd rather be ruled by men of the cloth than by atheists and Marxists and pro-abortion femininists\n emoticon_xangel\n\n Hie thyself off to Iran, then. Or to Saudi Arabia. I'm sure you'd love it there.", 
   {}, 
   357636, 
   null, 
   1245177360.0
  ], 
  [
   357681, 
   null, 
   "antonia", 
   "Jon Stewart from the Daily Show takes on the Iranian elections and muted international response,\n \n Irandecision 2009 - Sham, Wow | The Daily Show | Comedy Central\n \n Jon Oliver breaks down the results for Jon Stewart on his magic screen; also zips us through the streets of Tehran via motorbike,\n \n Irandecision 2009 - Election Results | The Daily Show | Comedy Central", 
   {}, 
   357671, 
   null, 
   1245182400.0
  ], 
  [
   357689, 
   null, 
   "Chuz Life", 
   "I'd rather just be left the #&%@ alone then ruled by anyone no matter how 'benign'.\n\n \n May I suggest using \"than\" rather than then? \n \n I know it completely changes the meaning of what you said,.... but if my hunch is correct,... \"THAN\" is more along the lines of what you were trying to say.", 
   {
    "post_info": {
     "post_title": "Then?"
    }
   }, 
   357654, 
   null, 
   1245190980.0
  ], 
  [
   357695, 
   null, 
   "CUNxTime", 
   "May I suggest using \"than\" rather than then? \n \n I know it completely changes the meaning of what you said,.... but if my hunch is correct,... \"THAN\" is more along the lines of what you were trying to say.\n\n \n \n Thank you for the grammar lesson...the then/than dichotomy has always befuddled me....", 
   {}, 
   357689, 
   null, 
   1245196440.0
  ], 
  [
   357700, 
   null, 
   "Winston Smith", 
   "Hie thyself off to Iran, then. Or to Saudi Arabia. I'm sure you'd love it there.\n\n \n \n I was thinking of the Vatican or Paraguay", 
   {}, 
   357671, 
   null, 
   1245201840.0
  ], 
  [
   357702, 
   null, 
   "Chuz Life", 
   "Thank you for the grammar lesson...the then/than dichotomy has always befuddled me....\n\n \n I just had a feeling that you didn't want to be left alone \"then\" ruled by anyone. It's good to know that I can still catch the easy ones.\n \n emoticon_xgood", 
   {
    "post_info": {
     "post_title": "URquiteWelcome"
    }
   }, 
   357695, 
   null, 
   1245203580.0
  ], 
  [
   357712, 
   null, 
   "antonia", 
   " Could it be that all of our elections are rigged and the \"two party system\" is just an illusion? Could it be that Republicans and Democrats are just two sides of the same coin? \n\n \n Well if you're bothered by the idea of voting fraud and want to throw the computerized voting machines manufactured by Diebold into the Boston Harbor and have publicly monitored, hand-counted paper ballots, that's fine by me. Personally, I think GWB was one of the worst (if not *the* worst ) President in American history. But I could have lived a lot easier with his presidency if I had confidence that he really won.\n \n When voting is hotly contested, too, I see no reason to reject a public recount. I don't like Ahmadinajad, but I respect the right of the Iranian people to self-determine their own government. Like GWB, I can live easier with his presence, internationally, if I just knew that they really picked him.\n \n Assuming his leadership goes through (and it looks like it will), perhaps he is going to be bit like the Iranian people's George W. Bush. (Though each is distinctly far worse than the other in their own way.)\n \n \nThis reminds me of the original Iraq war in 1991. I remember hearing reports of how the media in Iraq was fabricating stories of victory and the Iraqi people had no idea they were getting their asses kicked. I remember how people laughed at how naive those people were for believing their silly state-run media. I remember asking, \"What makes you think that doesn't happen here?\" And I remember never getting a response.\n\n \n I remember being laughed at by a member of the American military recruiting young men for the army, one year prior to our entry into Iraq, when I suggested that he discuss the very REAL possibility that we could go to war. \"War? LOL.\"\n \n 4,000 dead Americans later ... and all the rest (including tens of thousands of now disabled American veterans, 1/2 million dead Iraqis, their country demolished, and the American economy in the toilet bowl) ... THANK YOU, GWB.", 
   {}, 
   357641, 
   null, 
   1245216900.0
  ], 
  [
   357714, 
   null, 
   "Winston Smith", 
   "The Iraqi people? I thought Mahmoud Ahmadinejad was Iranian", 
   {}, 
   357712, 
   null, 
   1245217560.0
  ], 
  [
   357716, 
   null, 
   "antonia", 
   "Excuse me, I meant Iranian in that reference. I'll edit and correct.", 
   {}, 
   357714, 
   null, 
   1245219000.0
  ], 
  [
   357720, 
   null, 
   "Winston Smith", 
   "Too late, the damage is done!! :p\n \n Bush made the same mistake, he intended to invade Iran and ended up invading Iraq. \"Same difference\" he said, but not in public.", 
   {}, 
   357716, 
   null, 
   1245222720.0
  ], 
  [
   357722, 
   null, 
   "antonia", 
   "No, Bush intended to invade Iraq for some time before it happened.\n \n We only wish his mistake were but a slip of the vowels, instead of the massive destruction that it wrought.\n \n Thinking adults understand that difference, WS.", 
   {}, 
   357720, 
   null, 
   1245224160.0
  ], 
  [
   357727, 
   null, 
   "Winston Smith", 
   "thinking children understand I was joking, Antonia :)\n \n Luckily he didn't go for Iran. It would have been apocalyptic.\n \n the majority of the people in Iran are pro Mahmoud Ahmadinejad so who cares about elections. Democracy is for Ancient Greeks and enlightened Western democracies. Yes, democracy is for democratic minded people not for absolutists Persians. Darius, Xerkes, Mahmoud Ahmadinejad ... same difference", 
   {}, 
   357722, 
   null, 
   1245227340.0
  ], 
  [
   357728, 
   null, 
   "Winston Smith", 
   "No, Bush intended to invade Iraq for some time before it happened.\n \n We only wish his mistake were but a slip of the vowels, instead of the massive destruction that it wrought.\n \n Thinking adults understand that difference, WS.\n\n \n \n you mean a slip of the consonants, right ? :p", 
   {}, 
   357722, 
   null, 
   1245227460.0
  ], 
  [
   357759, 
   null, 
   "antonia", 
   "thinking children understand I was joking, Antonia :)\n\n \n I know you were joking, Winston.\n \n \nLuckily he didn't go for Iran. It would have been apocalyptic.\n\n \n Well there's still time for an apocalypse, unfortunately. Remember, only Nixon could go to China.\n \n \nthe majority of the people in Iran are pro Mahmoud Ahmadinejad so who cares about elections. \n\n \n That doesn't appear to be the case, but who are you or I to say? At any rate, it's pretty obvious Mahmoud is a virtual i**** who could provoke an international global crisis, bringing hellfire upon the Iranian people, who are for the most part, trying to live their lives like anyone else on this planet. \n \n While the other candidate is more mature, intelligent, and rational. \n \n Ahama is like their i****-child, while Bush was like ours, set loose upon the world (think supermarket aisles). A difference, of course, that as an American President, he could cause a lot more damage whereever he went, while earth basically tries to contain and distract the other Wonder Boy until his time is up. Let's hope all can keep it up if (as it appears) he goes in again. (At least George was better in history and wasn't an anti-Semitic hate-monger with a smile paralysis of the face.)\n \n \nDemocracy is for Ancient Greeks and enlightened Western democracies. Yes, democracy is for democratic minded people not for absolutists Persians. Darius, Xerkes, Mahmoud Ahmadinejad ... same difference\n\n \n Well it's not perfect, but I don't know anything better. Throw in some separation of church and state, strong social security nets, a sensible police department with psych, vs motorbike/batan, training. Iran also needs a full, not partial recount. What good is a partial recount if they only counted part of the vote to begin with? That was the problem, wasn't it?", 
   {}, 
   357727, 
   null, 
   1245264360.0
  ], 
  [
   357760, 
   null, 
   "antonia", 
   "you mean a slip of the consonants, right ? :p\n\n \n Is it up or down?\n ;)", 
   {}, 
   357728, 
   null, 
   1245264480.0
  ], 
  [
   357799, 
   null, 
   "Zardoz", 
   "LOL's\n \n Bush pwned you all and you knows it!!1!!12", 
   {}, 
   357760, 
   null, 
   1245298740.0
  ], 
  [
   357803, 
   null, 
   "Winston Smith", 
   "I was reading in the latest issue of The New Scientist one of the letters to the editor of the magazine, in it the writer says :\n \n &#8220;I have taught evolution as part of my geology courses for 40 years and have become very pessimistic about American values. The average American is very religious and militaristic &#8212;feelings driven by fear, superstition and ignorance.&#8221;\n \n I would add that the militaristic feelings of the populace have made it easy for the ruling classes to make the USA the super-interventionist power of the XXth century and so far this one. What is ironic, for most Americans look only at their navels and think the sun shines out of their anuses illuminating the rest of creation. So the irony is that the people with their head stuck up their &#8216;you know what&#8217;, are at the same time the ones roaming the world like crazy vigilantes. This lethal combination of inward looking people patrolling blindly the world is the cause of US interventionism having done and doing more harm than good and created a feeling of anti-Americanism world wide. The ugliest manifestation of which was 9/11.\n \n Who cares about imposing democracy in Iraq? It won&#8217;t last long. And leave the Iranians alone. Those cultures have been anti-democratic for thousands of years and maybe if they had subjugated the Greeks we wouldn&#8217;t have democracy now.", 
   {
    "post_info": {
     "post_title": "Antonia"
    }
   }, 
   357799, 
   null, 
   1245301320.0
  ], 
  [
   357892, 
   null, 
   "antonia", 
   "I was reading in the latest issue of The New Scientist one of the letters to the editor of the magazine, in it the writer says :\n \n &#8220;I have taught evolution as part of my geology courses for 40 years and have become very pessimistic about American values. The average American is very religious and militaristic &#8212;feelings driven by fear, superstition and ignorance.&#8221;\n \n I would add that the militaristic feelings of the populace have made it easy for the ruling classes to make the USA the super-interventionist power of the XXth century and so far this one. What is ironic, for most Americans look only at their navels and think the sun shines out of their anuses illuminating the rest of creation. So the irony is that the people with their head stuck up their &#8216;you know what&#8217;, are at the same time the ones roaming the world like crazy vigilantes. This lethal combination of inward looking people patrolling blindly the world is the cause of US interventionism having done and doing more harm than good and created a feeling of anti-Americanism world wide. The ugliest manifestation of which was 9/11.\n \n Who cares about imposing democracy in Iraq? It won&#8217;t last long. And leave the Iranians alone. Those cultures have been anti-democratic for thousands of years and maybe if they had subjugated the Greeks we wouldn&#8217;t have democracy now.\n\n \n Far be for me or anyone else to impose democracy on Iran. I was against that notion insofar as Iraq was concerned, too. Democracy has to come from within a nation, from the nation's people -- not another nation's -- or it is not democracy. Oxymoronic, that is.\n \n I agree that our country has been quite militaristic. We pour lots of money into the military budget, so it follows, of course. And this was a direct result of the Second World War. Now, we take the heat from countries and peoples who, at the same time, rely on that military might, or have greatly relied, while they have financial advantages for their nations otherwise, and no excuse not to put their money into those other endeavors, like healthcare, for example. \n \n HP is carrying a heck of lot photographs of the demonstrations inside the country. Their signs (one said he was Nazi and a Fascist, so they're not into self-consciously and apologetically sc*****g themselves about using the N or F words -- when the shoe fits, hey -- less like Americans and more like the French) and their massively and spontaneously organized efforts (using just Twitter, they say!) demonstrate that they are, rather, very very democratically oriented as a people. Even moreso than in the U.S. (where we should all get on Twitter and, for example, overthrow the health care system -- but Americans are so *divorced* from one another when it comes to concerted social action related to matters of everyday importance -- a big problem if you want to have a democracy). Of course, media sources can distort the magnitude of unrest, and that media source, too, may well be in bed with the defense contractors, but it really looks like Iran wants a changing of the guard.\n \n I wouldn't go to war with them over their government, but I hope they get what they want, if that's what's going on. Just like our presidential elections affect the rest of the planet, theirs do, as well. In Europe, they stayed up around the clock, watching the American returns and praying that it wasn't going to be the Republicans going in, yet again. I was glad the world was engaged about our process. So unlike yourself, I imagine many Iranians would feel similarly, as long as it's not in the spirit of inteference, of GWB going into Iraq. There is a difference, though I suppose, as soon as you're identified as American or European or Australian, your motives suspect insofar as world conquest and blood lust are concerned.\n \n However, I wouldn't let that stop me from expressing myself, as an individual, or as a citizen of the world. Nor should I blind myself to the ambitions of other human beings, who, like anyone else, are but human. For I have nothing to apologize for, being no more than one person born as one miniscule of a miniscule of a miniscule of a (etc) speck in the vast sweep of time and space and wonder.", 
   {}, 
   357803, 
   null, 
   1245361320.0
  ], 
  [
   357919, 
   null, 
   "Winston Smith", 
   "The problem arises when what the people want is not in the best of US interests. \n Frankly my dear, when it comes to Iran or Iraq or Israel, I don't give a damn.\n \n In my opinion and history proves me right, isolationism is the best foreign policy.\n \n If the Americans hadn't intervened in WWI, Germany would have obtained a better deal rather than the rotten one it got at the war's end. The onerous humilliating terms of the Armistice where the cause for the collapse of the economy and the Weimar Republic and the rise of fascism.\n \n If the Americans hadn't forcefully opened Japan to the rest of the world, Japan would have never developed an appetite for imperialism a la British and invaded Korea and China and gone to war with the other imperialists.\n \n It would have been better for the sake of the world that the American colonies had remained colonies for a long long time.", 
   {}, 
   357892, 
   null, 
   1245381840.0
  ], 
  [
   357934, 
   null, 
   "antonia", 
   "The problem arises when what the people want is not in the best of US interests.\n\n \n The problem arises whenever people want something that is not in someone else's best interests. You being no exception to the rule.\n \n \nFrankly my dear, when it comes to Iran or Iraq or Israel, I don't give a damn.\n\n \n Then why are you on this thread?\n \n \nIn my opinion and history proves me right, isolationism is the best foreign policy. \n\n \n Not so far as the Second World War was concerned.\n \n \nIf the Americans hadn't intervened in WWI, Germany would have obtained a better deal rather than the rotten one it got at the war's end. The onerous humilliating terms of the Armistice where the cause for the collapse of the economy and the Weimar Republic and the rise of fascism.\n \n If the Americans hadn't forcefully opened Japan to the rest of the world, Japan would have never developed an appetite for imperialism a la British and invaded Korea and China and gone to war with the other imperialists.\n \n It would have been better for the sake of the world that the American colonies had remained colonies for a long long time.\n\n \n Well we can go back further than this, no? It would have been better for the sake of the world if the British hadn't so mistreated the people who set off for the new land to begin with! \n \n So many what if's on a great big planet against the great big sweep of time and space, Mr. Smith!\n \n It's forever 'merica this, 'merica that! in your book ... we made the poor Germans and Japanese do what they did! And you hailing from the conquistadores who began the mental, physical and spiritual rape of Latin America. In the name of Jesus Christ. Amen.\n \n Perhaps better for the planet if Jesus of Nazareth had never lived? Or was it Paul, instead?\n \n So stop this speculative nonsense. From your comfortable armchair in Australia. Where your other forefathers were convicts who destroyed the lives of the Aborigines. It would have been better for them if they'd stayed out of jail. So no one could send them in rowboats as labor!\n \n Come to think of it, it would be better for the world if it never existed at all. Period. emoticon_rolleyes", 
   {}, 
   357919, 
   null, 
   1245392940.0
  ], 
  [
   357947, 
   null, 
   "Winston Smith", 
   "The problem arises whenever people want something that is not in someone else's best interests. You being no exception to the rule.\n\n \n I don't invade my neighbours house and burn it to the ground because we have a disagreament\n \n \n \n \nThen why are you on this thread?\n\n \n I don't care if Angelina adopts another dozen kids but still read and comment about it: \"Poor Brad\"\n \n \n \nNot so far as the Second World War was concerned.\n\n \n If the Yanks hadn't intervened in WWI there would have been no WWII. if Commodore Perry hadn't forcibly opened Japan (gun boat diplomatic rape) and intruded. Japan would have never become an Imperial power in emulation of Russia, Britain and the USA, therefore: no Pearl Harbour\n \n \n \nWell we can go back further than this, no? It would have been better for the sake of the world if the British hadn't so mistreated the people who set off for the new land to begin with! \n \n \n I agree\n \n \nSo many what if's on a great big planet against the great big sweep of time and space, Mr. Smith!\n\n \n Not 'what if's at all. Just facts m'am\n \n \nIt's forever 'merica this, 'merica that! in your book ... we made the poor Germans and Japanese do what they did! \n \n \n It is forever 'merica this' because that is what history teaches us. Too bad if the truth hurts.\n \n \nAnd you hailing from the conquistadores who began the mental, physical and spiritual rape of Latin America. In the name of Jesus Christ. Amen.\n\n \n Two wrongs don't make a right\n \n \nPerhaps better for the planet if Jesus of Nazareth had never lived? Or was it Paul, instead?\n\n \n On the contrary Christianity (the one Paul built) did a lot of good in Europe.\n \n \nSo stop this speculative nonsense. From your comfortable armchair in Australia. Where your other forefathers were convicts who destroyed the lives of the Aborigines. It would have been better for them if they'd stayed out of jail. So no one could send them in rowboats as labor!\n\n \n Make up your mind, am I a descendant of Conquistadores or convicts? You can't have it both way, sister Antonia.\n Many convicts were also sent to the New World colonies\n \n Your armchair in America is as comfortable if not more than mine here in Australia. Only the poor have 'volunteered' to go to Iraq and Afghanistan.\n the 'chattering classes' to wich you belong haven't.\n \n \n Come to think of it, it would be better for the world if it never existed at all. Period. emoticon_rolleyes\n\n \n It would have been better for the planet and all the rest of life on it if we had never existed, that's for sure.", 
   {}, 
   357934, 
   null, 
   1245417900.0
  ], 
  [
   357960, 
   null, 
   "antonia", 
   "\n If the Yanks hadn't intervened in WWI there would have been no WWII. if Commodore Perry hadn't forcibly opened Japan (gun boat diplomatic rape) and intruded. Japan would have never become an Imperial power in emulation of Russia, Britain and the USA, therefore: no Pearl Harbour\n\n \n I'm not a fan of WW I, but history is more complex than you are making it.\n \n \nNot 'what if's at all. Just facts m'am\n\n \n Now you are sounding like Archangel with his pipeline to the absolute truth. Speculations about what history might have been if such and such happened differently is not fact, but opinion.\n \n \nIt is forever 'merica this' because that is what history teaches us. Too bad if the truth hurts.\n\n \n Nonsense. For all its flaws, the United States has an outstanding and fabulous history. Our country has served as a beacon of inspiration and hope to millions throughout the world. Drawing people from everywhere.\n \n \nOn the contrary Christianity (the one Paul built) did a lot of good in Europe.\n\n \n And America didn't? Where would the world have been without the Normandy invasion, for example? All those Americans willing to risk or give their lives? Without the principles espoused by the American Revolution? Without jazz or Martha Graham or the Harlem Renaissance? Hemmingway, Faulkner, Emily Dickinson, Ralph Waldo Emerson, Henry David Thoreau, Thomas Jefferson? Thomas Edison, Albert Einstein, Elizabeth Cady Stanton, Susan B. Anthony, Sojourner Truth, Martin Luther King, Jr., Abraham Lincoln, Cesar Chavez, Dolores Huerta, Pocahantas, Sacajawea, Sitting Bull, Black Elk, Chief Joseph? Elvis Presley, Louis Armstrong, Barbara Streisand, Paul Newman? Joan Baez, Bob Dylan, Mohammad Ali, Malcolm X? Noam Chomsky, Bruno Bettleheim, Albert Ellis, Carl Rogers, Carol Gilligan, Kenneth Clark? Stephen J. Gould, Arthur Kornberg, Persi Diaconnis, Howard Zinn, Deborah Hertz? John Brown, Harriet Tubman, Frederick Douglass? Frank Sinatra, Joseph Stella, John Romita Sr., the Jacuzzi family, Sacco and Vanzetti? Frank Lloyd Wright, Maya Lin, Michelle Kwan, Kristi Yamaguchi, Magic Johnson, Babe Ruth, Willie Mays, Jesse Owens? Al Capone, Spike Lee, Stephen Spielberg, Marilyn Monroe, Woody Allen, the Marx Brothers, Charlie Chaplin, Helen Keller, Woody Guthrie, Pete Seeger? Leonard Bernstein, Harrison Ford, Hillary Clinton, Jesse Jackson, Michelle Obama, Josh Holloway, Levi Strauss, Frederic Tudor? Leonard Nimoy, Gene Roddenberry, Alvin Ailey, Georgia O'Keefe, Isabel Allende, Zora Neale Hurston, Anne Bradstreet, Paul Krugman, John Kenneth Galbraith? William James, Henry James, Neil Armstrong, Colin Powell, Franklin D. Roosevelt, Mark Twain, Paul Robeson, Harvey Milk? Grandma Moses, James Whistler, Walt Whitman, Langston Hughes, Stephen Poplawski? Chick Corea, George Winston, Taj Mahal, Billy Preston, Ray Charles? Jane Addams, John Dewey, Ansel Adams, Gordon Parks, Amelia Earhart, Bessie Coleman, Billie Holiday, Aretha Franklin, Johnny Cash, Jose Feliciano, The Supremes, The Everly Brothers? Andy Warhol, Sandra Day O'Connor, Oprah Winfrey, Annie Oakley, Sally Ride, Betsy Ross, Rosa Parks, Whoopie Goldberg, Barbara Walters, George Gershwin, Benjamin Franklin, Humphrey Bogart, William Rush? Dr. Marcia Angell, Dr. David Himmelstein, Donna Smith, Bill Moyers? William Grey, Scott Foresman, Dr. Seuss, Walt Disney, Dr. Benjamin Spock, Dr. Linus Pauling, Eleanor Roosevelt, Maya Angelou, Shirley Chisholm, Dorothy Day, Daniel Berrigan, Daniel Pearl, Elie Wiesel, Louisa May Alcott, Bronson Alcott, Betty Friedan, Gloria Steinem? George Washington Carver, Phil Knight, Bill Bowerman, Bernard Silver, Norman Woodland, Willis Haviland Carrier? Samuel Crumbine, Frank Rose, Clarence Birdseye, Otto Rohwedder, Robert F. de Graff, Philo Farnsworth, Timothy Berners-Lee?\n \n For starters!\n \n \nMake up your mind, am I a descendant of Conquistadores or convicts? You can't have it both way, sister Antonia.\n\n \n Of course you can have it both ways. A person can have many ancestors.\n \n \nYour armchair in America is as comfortable if not more than mine here in Australia. Only the poor have 'volunteered' to go to Iraq and Afghanistan.\n the 'chattering classes' to wich you belong haven't.\n\n \n I have news for you. There's quite a range of people who are part of the \"chattering classes\". Internet is no longer the possession of a privileged few.\n \n So .... what has Australia done, lately?", 
   {}, 
   357947, 
   null, 
   1245431280.0
  ], 
  [
   358005, 
   null, 
   "antonia", 
   "While waiting with bated breath to hear about Australia's contributions, it appears Canada has another name to add to its list -- Lila Ghobady, an Iranian exile, commenting on the elections, though Winston would prefer all tongues held quiet on the western front ...\n \n No Matter Who Is President of Iran, They Would Stone Me | CommonDreams.org", 
   {}, 
   357960, 
   null, 
   1245481740.0
  ], 
  [
   358008, 
   null, 
   "Winston Smith", 
   "She is pretty, it seems that many Iranian women are beautiful.\n \n Soorrrry but nope! no pretty Iranian women have escaped to Australia who are activists\n \n She agrees with me, forget the elections in Iran.", 
   {}, 
   358005, 
   null, 
   1245488580.0
  ], 
  [
   358010, 
   null, 
   "Winston Smith", 
   "Sorry but before you embarked on thiat list of names, you should have checked the facts: The USA is part of Christianity.\n \n \n The guys who wrote the constitution were the progeny of the Enlightenment and heavily influenced by the French philosophers. \n \n So there are some notorious people in the USA, so what? what has it got to do with the interventionist policies of the US? Many people opposed the invasion of Iraq, Obama one of them, but it still hapenned. \n I didn't say that the USA has no redeeming features.\n \n Explain this to me: Assume that Japan was not forcibly opened to the outside world by the US and remained isolated for another fifty years or so, how could Japan then have been ready to wage war in 1942?\n \n Don't be blinded by patriotism in the same way Archie is blinded by his beliefs.", 
   {
    "post_info": {
     "post_title": "Antonia"
    }
   }, 
   358008, 
   null, 
   1245489300.0
  ], 
  [
   358060, 
   null, 
   "antonia", 
   "You are a very mixed up fellow, WinstonSmith.\n \n \nShe agrees with me, forget the elections in Iran.\n\n \n Witticisms aside, I don't think her point is to forget the elections, but to draw attention to how neglected women's rights are, in either case. Though it appears to me that, the more forward looking elements, among both women and men, are with Mousavi. Women standing to gain more with him in power. (And as you infer, perhaps the men, too.) But of course, even the Western press is pretty sexist, so we don't read coverage on this matter. Even though women make up more than half the country.\n \n I see in a number of papers that it is a real show down in Iran right now, with police tear gassing people, people having been beaten up and killed. Iranians are twittering photos over to the foreign newspapers, circumventing State attempts to quash any information coming out of the country. Times Online is also running a series of photos of demonstrations by Iranians, presumably many exiled, living around the world. \n \n President Obama is well aware of the history of western interference and the sentiments around that issue, and to his credit, is apparently taking a disapproving but arms length approach. While I essentially support that, i.e. I think the administration's doing very well with this, I'm not a diplomat or a politician, Winston. Just a member of the \"chattering classes\". So I get to say all kinds of things, and let people be responsible for themselves.\n \n Riot police clash with demonstrators in Iran - Times Online", 
   {}, 
   358010, 
   null, 
   1245519600.0
  ], 
  [
   358064, 
   null, 
   "antonia", 
   "Btw, France is discussing a ban on the public burkhas. They are investigating whether some of the more extreme versions (small face screens, very heavy cloaking) are being imposed on women, and to allow it only in the home. So they are going to embark on a research project around this, as more are disturbingly popping up around Marseilles and Paris.", 
   {}, 
   358060, 
   null, 
   1245523380.0
  ], 
  [
   358068, 
   null, 
   "simone", 
   "Antonia, I adore your quote from Voltaire.", 
   {}, 
   358064, 
   null, 
   1245523860.0
  ], 
  [
   358072, 
   null, 
   "antonia", 
   "Thank you Simone! Likewise, with Wafa Sultan.", 
   {}, 
   358068, 
   null, 
   1245524880.0
  ], 
  [
   358085, 
   null, 
   "Jo Bennett", 
   "Btw, France is discussing a ban on the public burkhas. They are investigating whether some of the more extreme versions (small face screens, very heavy cloaking) are being imposed on women, and to allow it only in the home. So they are going to embark on a research project around this, as more are disturbingly popping up around Marseilles and Paris.\n\n \n I'm very wary of French attitudes to religious expression, and particularly in this case as the likely result if women are being forced to wear the burkha is that they won't be permitted to leave the house at all if they're not allowed t wear it.", 
   {}, 
   358064, 
   null, 
   1245536220.0
  ], 
  [
   358120, 
   null, 
   "antonia", 
   "The Iranian police have cold-bloodedly killed a young woman standing with her father watching one of the demonstrations. A doctor happened to be among the demonstrators, tried to save her, and recounts the incident as follows below. If you go to the link below, be aware that her death was graphically recorded by photo and video camera, and the link includes those documents. \n \n ---------------\n \n Hamed Rad writes:&#8232;&#8232;\n \n Basij shots to death a young woman &#8232;in Tehran's Saturday June 20th protests &#8232;&#8232;\n \n At 19:05 June 20th Place: Karekar Ave., at the corner crossing Khosravi St. and Salehi St. &#8232;&#8232;\n \n A young woman who was standing aside with her father watching the protests was shot by a basij member hiding on the rooftop of a civilian house. &#8232;&#8232;\n \n He had clear shot at the girl and could not miss her. However, he aimed straight her heart. I am a doctor, so I rushed to try to save her. &#8232;&#8232;\n \n But the impact of the gunshot was so fierce that the bullet had blasted inside the victim's chest, and she died in less than 2 minutes. &#8232;&#8232;\n \n The protests were going on about 1 kilometers away in the main street and some of the protesting crowd were running from tear gass used among them, towards Salehi St. &#8232;&#8232;\n \n The film is shot by my friend who was standing beside me. &#8232;&#8232;\n \n Please let the world know.&#8232;\n \n BreakForNews.com apologises to the family of the deceased woman for publishing these graphic photographs of her horrific death.&#8232;&#8232;We publish in the hope of securing justice for the family in her murder.&#8232;\n \n BreakForNews.com\n \n ----------------------", 
   {}, 
   358085, 
   null, 
   1245570300.0
  ], 
  [
   358123, 
   null, 
   "antonia", 
   "I'm very wary of French attitudes to religious expression, and particularly in this case as the likely result if women are being forced to wear the burkha is that they won't be permitted to leave the house at all if they're not allowed t wear it.\n\n \n French society is even more secular than the U.S., but my understanding is that they are indiscriminately thus. For example, you can't wear a hijab to a public school, but you can't wear a cross or a Star of David, either. \n \n I don't know how far they want to take this dress code -- some of the women among the hardline demonstrators in Iran, for example, look like they're in nuns' habits. The garments, a little less bulky, and the face shows. (Of course, there must be a lot of nuns in France, but then again, the government is getting fed up with the Church. Take, for example, the show down with the Pope and their public health officials over AIDS and condoms. I give them a lot of credit for not mincing words with the religious authorities over that.)\n \n You couldn't do this legally in the U.S., I guess, short of public places like airports or banks. But I would hardly object to the French exercising their laws in this respect, as I must restrain my desire to interfere with other countries doing much worse -- that is, what is happening presently in Iran, as we politely \"non-interfere\" -- or do \"the prime directive\" (if you followed Star Trek at all in the U.K.).\n \n My guess is that hardline chauvinists would have to relent because otherwise no one would do their shopping and errands. And in France, one must go shopping each day.\n \n That is, they'd adapt. And of course, it's illegal in France (like the States or the U.K.) to keep an adult against their will in a house or apartment. Equivalent to kidnapping.", 
   {}, 
   358085, 
   null, 
   1245571680.0
  ], 
  [
   358125, 
   null, 
   "Jo Bennett", 
   "\n That is, they'd adapt. And of course, it's illegal in France (like the States or the U.K.) to keep an adult against their will in a house or apartment. Equivalent to kidnapping.\n\n \n But, just as in the UK or US, you have to know they're there, know they're being held against their will and be able to prove it in court. I don't see it as my job to pass judgement on the genuineness of someone's religious expression and the values they expect of their family, unless they are demonstrably damaging.\n \n Whilst the French position is theoretically neutral, it doesn't take account of the fact that there are no Christian denominations that require the wearing of a crucifix, but both Muslims and Jews have religious requirements for how they dress. The French secular system is dangerous and fosters intolerance of difference. There is a reason fascists do better in France than elsewhere in Europe. Studies have shown underlying racism is a serious problem in France. They don't have any monitoring of ethnic minority employment or discrimination because they law says that ethnicity doesn't exist. This is fine in principle, but what it means is that people with French names get jobs where identically qualified people with Arab Muslim names do not, and there is no official way of dealing with it.", 
   {}, 
   358123, 
   null, 
   1245575580.0
  ], 
  [
   358126, 
   null, 
   "antonia", 
   "But, just as in the UK or US, you have to know they're there, know they're being held against their will and be able to prove it in court. I don't see it as my job to pass judgement on the genuineness of someone's religious expression and the values they expect of their family, unless they are demonstrably damaging. \n\n \n Well, it sounds to me like they're looking for a way to give the women more empowerment, more opportunity to stand up for their rights. They're coming in from countries where they were compelled by law to be literally bagged. In Afghanistan, women with no other means of support, sit in the street in these sacks, begging, and men kick them as they walk by.\n \n \nWhilst the French position is theoretically neutral, it doesn't take account of the fact that there are no Christian denominations that require the wearing of a crucifix, but both Muslims and Jews have religious requirements for how they dress.\n\n \n The cross is very important to Christians in the U.S. It may not be imposed as a formal rule, but I know a number of Christians who feel religiously required, almost as if it were. There is a tremendous feeling of offense at the idea of not being able to wear it, for example, as a student -- or even among some teachers -- in a public school. Not an issue in France -- why? Because it's not such a big deal for human beings to adapt in this respect. They may squawk a lot at first, but they are not being tortured. Whether it's a cross, a hijab, or a Star of David. And if it is such torture, well, there's private school. One thing no one can say, however, is that someone has been discriminated against.\n \n \nThe French secular system is dangerous and fosters intolerance of difference.\n\n \n Rubbish. I see the burkha as quite extreme, and dangerous in that it fosters oppression of women. I find it completely offensive, as a woman and as a human being.\n \n \n There is a reason fascists do better in France than elsewhere in Europe. Studies have shown underlying racism is a serious problem in France.\n\n \n I don't know that fascists necessarily do better in France than elsewhere in Europe. I've read about some pretty intense fascists in the U.K. and Germany and Italy, for example. We have some very sick ones here, too.\n \n I recognize that racism exists in France, as it does in many places. I do agree that fascism and racism go hand in hand, and can be an issue in all this -- as in Islamaphobia and forms of ethnocentrism. \n \n I think, however, it's important to recognize that the burkha is fascistic and sexist. One can only bend over so far in sensitivity to religion before religion is walking all over you and your rights.\n \n This reminds me of the debate around FGM. I think, at some point, you just have to say, it's time to step into the 21st century.\n \n This is not about religion and faith and culture (though, at the same time, it very much is). IOW, it's being used an excuse to violate human rights.", 
   {}, 
   358125, 
   null, 
   1245576660.0
  ], 
  [
   358128, 
   null, 
   "Jo Bennett", 
   "FGM is vastly different because it has a permanent irreversible and demonstrably damaging effect and the procedure itself is risky.\n \n And yes, fascists do better in France than other countries. The BNP (the largest fascist party in the UK) has never won seat in parliament, and has never managed so much as 1% in a general election (0.74% at the last election). Even at a European election under Proportional Representation, amid disgust and anger with the political class in this country, and widespread anti-europe sentiment, they could only scrape together 6.2% of the very low turnout, coming in 6th behind the Green Party. In France, on the other hand, Front Nationale leader le Penn made it through to the run off in the Presidential election in 2002, achieving 25% of the vote, and even in the most recent national assembly elections registered over a million votes.", 
   {}, 
   358126, 
   null, 
   1245578700.0
  ], 
  [
   358129, 
   null, 
   "antonia", 
   "FGM is vastly different because it has a permanent irreversible and demonstrably damaging effect and the procedure itself is risky.\n\n \n Well you try walking around for the rest of your life in a large black bag with slits for eyes and then come back and talk about how it's not damaging or risky.\n \n The point is that this cultural and religious sensitivity stuff can become absurd. You're actually incredibly insensitive to the women in these situations. You're defending the right of the men to oppress them. \n \n \nAnd yes, fascists do better in France than other countries. The BNP (the largest fascist party in the UK) has never won seat in parliament, and has never managed so much as 1% in a general election (0.74% at the last election). Even at a European election under Proportional Representation, amid disgust and anger with the political class in this country, and widespread anti-europe sentiment, they could only scrape together 6.2% of the very low turnout, coming in 6th behind the Green Party. In France, on the other hand, Front Nationale leader le Penn made it through to the run off in the Presidential election in 2002, achieving 25% of the vote, and even in the most recent national assembly elections registered over a million votes.\n\n \n But that doesn't connect a set of dots to French secularism!", 
   {}, 
   358128, 
   null, 
   1245579300.0
  ], 
  [
   358130, 
   null, 
   "antonia", 
   "Fascists are not secularists. Indeed, they're unfailingly mixed up in religion. Which is one of the reasons why the people demonstrating against what's-his-face in Iran are more secular, while the ones sniper-shooting-from-rooftops young women in cold blood straight-through-the-heart in the street (while the woman is SECULARLY dressed in a pair of blue jeans and a western top and NO hijab), are very, very, very religious.", 
   {}, 
   358129, 
   null, 
   1245579660.0
  ], 
  [
   358131, 
   null, 
   "Winston Smith", 
   "You are a very mixed up fellow, WinstonSmith.\n \n \n \n Witticisms aside, I don't think her point is to forget the elections, but to draw attention to how neglected women's rights are, in either case. Though it appears to me that, the more forward looking elements, among both women and men, are with Mousavi. Women standing to gain more with him in power. (And as you infer, perhaps the men, too.) But of course, even the Western press is pretty sexist, so we don't read coverage on this matter. Even though women make up more than half the country.\n \n I see in a number of papers that it is a real show down in Iran right now, with police tear gassing people, people having been beaten up and killed. Iranians are twittering photos over to the foreign newspapers, circumventing State attempts to quash any information coming out of the country. Times Online is also running a series of photos of demonstrations by Iranians, presumably many exiled, living around the world. \n \n President Obama is well aware of the history of western interference and the sentiments around that issue, and to his credit, is apparently taking a disapproving but arms length approach. While I essentially support that, i.e. I think the administration's doing very well with this, I'm not a diplomat or a politician, Winston. Just a member of the \"chattering classes\". So I get to say all kinds of things, and let people be responsible for themselves.\n \n Riot police clash with demonstrators in Iran - Times Online\n\n \n Yes, I watched the news today and thing are getting hot. It reminds me of the last days of the Shah. (His wife was beautiful, wasn't she?)\n \n Yes, you are right ,the chattering classes, of which you are a self confessed member just chatter and criticise left and right, without taking any action. Here we also call them the Chardonnay Set, for they sip from their glasses delicately while spitting venomous words.", 
   {}, 
   358060, 
   null, 
   1245583440.0
  ], 
  [
   358132, 
   null, 
   "Winston Smith", 
   "FGM is vastly different because it has a permanent irreversible and demonstrably damaging effect and the procedure itself is risky.\n \n And yes, fascists do better in France than other countries. The BNP (the largest fascist party in the UK) has never won seat in parliament, and has never managed so much as 1% in a general election (0.74% at the last election). Even at a European election under Proportional Representation, amid disgust and anger with the political class in this country, and widespread anti-europe sentiment, they could only scrape together 6.2% of the very low turnout, coming in 6th behind the Green Party. In France, on the other hand, Front Nationale leader le Penn made it through to the run off in the Presidential election in 2002, achieving 25% of the vote, and even in the most recent national assembly elections registered over a million votes.\n\n \n The BNP won two seats in the European parliament. The Poms haven't experienced the equivalent of the Algerian war and the subsequent mass invasion of Arabs.\n Besides Le Penn's policies are not so extreme as the BNP. \n I support the BNP stance on immigration but not the racism.", 
   {}, 
   358128, 
   null, 
   1245583680.0
  ], 
  [
   358133, 
   null, 
   "Winston Smith", 
   "Fascists are not secularists. Indeed, they're unfailingly mixed up in religion. Which is one of the reasons why the people demonstrating against what's-his-face in Iran are more secular, while the ones sniper-shooting-from-rooftops young women in cold blood straight-through-the-heart in the street (while the woman is SECULARLY dressed in a pair of blue jeans and a western top and NO hijab), are very, very, very religious.\n\n \n Fascism is secular per definition. The state is all powerful in a fascist state, as in a Communist one, and therefore shares power with no other institution.", 
   {}, 
   358130, 
   null, 
   1245583860.0
  ], 
  [
   358134, 
   null, 
   "Winston Smith", 
   "Well you try walking around for the rest of your life in a large black bag with slits for eyes and then come back and talk about how it's not damaging or risky. (Antonia)\n\n \n Many women who walk covered from head to toe, do it by their own free will here in Australia, to show their adherence to Islam.\n Maybe they are ugly? who knows? \n But if they are not, it is a crime.", 
   {
    "post_info": {
     "post_title": "Antonia"
    }
   }, 
   358133, 
   null, 
   1245584040.0
  ], 
  [
   358136, 
   null, 
   "antonia", 
   "\n Yes, you are right ,the chattering classes, of which you are a self confessed member just chatter and criticise left and right, without taking any action. Here we also call them the Chardonnay Set, for they sip from their glasses delicately while spitting venomous words.\n\n \n No, that's not how I defined myself, but indeed, how you are defining me in your typically nasty and venomous way.\n \n Interestingly enough, though, you yourself do often sound like what you call \"very Chardonney Set\"; that is, an arrogant, sniping, pretentious dilettante, unsurprisingly a former Pinochet supporter, and a disgusting chauvinist pig.", 
   {}, 
   358131, 
   null, 
   1245584460.0
  ], 
  [
   358137, 
   null, 
   "antonia", 
   "Fascism is secular per definition.\n\n \n You know full well that the fascists were very tied up with the Church.", 
   {}, 
   358133, 
   null, 
   1245584580.0
  ], 
  [
   358139, 
   null, 
   "Winston Smith", 
   "No, that's not how I defined myself, but indeed, how you are defining me in your typically nasty and venomous way.\n \n Interestingly enough, though, you yourself do often sound like what you call \"very Chardonney Set\"; that is, an arrogant, sniping, pretentious dilettante, unsurprisingly a former Pinochet supporter, and a disgusting chauvinist pig.\n\n \n You said that you belonged to the chattering classes, didn't you ? Do you like Chardonnay? I prefer dry white wines rather.\n \n You listed some of my qualities but not all of them. You are also arrogant, sniping, pretentious and a do nothing but chatter and sip chardonnay kind of person.\n Moi? I am not a dilettante, but simply a non-militaristic, non-intervionist, pacifist person.\n By the way not because I am not an abortion enthusiast, it means I am 'male chauvinist pig' on the contrary, I think that women should have the same rights and opportunities as me. \n So, I may be disgusting and a pig, nothing to be ashamed of, but I am not a male-chauvinist. \n \n I supported Pinochet economic policies, I supported the coup but I did not approve of torturing and murdering people.", 
   {}, 
   358136, 
   null, 
   1245585660.0
  ], 
  [
   358140, 
   null, 
   "Winston Smith", 
   "You know full well that the fascists were very tied up with the Church.\n\n \n \n8. Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government's policies or actions. \n\n \n XFourteen Defining Characteristics Of Fascism\n \n \n \nThis, assumedly, was because the Church had by this point relinquished its desires to be engaged politically in the country, preferring political subjugation that would hopefully lead to the spiritual control of the nation and financial reimbursement they had dreamed of since 1861\n.\n \n Pro Scribere: Fascism and The Catholic Church: 1922-1945\n \n As you can see from the above religion is subservient to the state in a fascist state.", 
   {}, 
   358137, 
   null, 
   1245586080.0
  ], 
  [
   358159, 
   null, 
   "antonia", 
   "You see me as arrogant and sniping because you're a male chauvinist and can't handle it when women don't speak to you as if they're inferior. Or massage or burp your puny insecure ego every time it gets gaaaasss.", 
   {}, 
   358140, 
   null, 
   1245613440.0
  ], 
  [
   358160, 
   null, 
   "antonia", 
   "Don't you have some steamy letters to write, Winston? Run along ...\n \n :one hand flapping:", 
   {}, 
   358159, 
   null, 
   1245613680.0
  ], 
  [
   358184, 
   null, 
   "antonia", 
   "A song for Neda\n \n YouTube - sade jezebel", 
   {}, 
   358160, 
   null, 
   1245623760.0
  ], 
  [
   358191, 
   null, 
   "Winston Smith", 
   "You see me as arrogant and sniping because you're a male chauvinist and can't handle it when women don't speak to you as if they're inferior. Or massage or burp your puny insecure ego every time it gets gaaaasss.\n\n \n I see you as you are. \n \n I have never said that women are inferior to me.\n \n I have no self (no Ich) and therefore no ego. id? yes\n \n I have never courted your adulation of me. I see it as I see it, and if you agree or don't agree with me so be it. I am not losing sleep over it.\n \n Why are you so antagonistic ? I don't know and I don't care.\n \n Chao", 
   {}, 
   358159, 
   null, 
   1245631680.0
  ], 
  [
   358231, 
   null, 
   "antonia", 
   "I see you as you are. \n\n \n Gee you sound like .... God, WinstonSmith.\n \n emoticon_rolleyes\n \n \nI have never said that women are inferior to me.\n\n \n I don't think George Wallace ever said as much about African Americans.\n \n \n I have no self (no Ich) and therefore no ego. id? yes\n\n \n Kind of like this guru known as Maharaji back in my youth.\n \n \nI have never courted your adulation of me. \n\n \n That's for sure!\n \n \n\n Chao\n\n \n emoticon_xbye", 
   {}, 
   358191, 
   null, 
   1245643440.0
  ], 
  [
   358246, 
   null, 
   "antonia", 
   "Getting back to the Iranian elections (and away from Winston's personal \"stuff\"), I think about 17 deaths have been recorded thus far, and now, the government is cracking down even more on the press, with at least 24 reporters arrested in Iran, including foreign journalists. Excerpt from AP article,\n \n -----------------\n \n Among those detained were the head of the Association of Iranian Journalists and a Canadian reporter for Newsweek. The British Broadcasting Corporation's correspondent has been ordered to leave the country.\n \n \"It's becoming more and more problematic for journalists,\" said Benoit Hervieu of Paris-based Reporters Without Borders, also known by its French acronym RSF.\n \n The group released the names of 23 Iranian journalists, editors and bloggers arrested since June 14, and says it has lost contact with several others believed detained or in hiding. Hervieu said RSF verified each arrest via its network of reporters and activists in Iran.\n \n Newsweek said in a statement later that its correspondent Maziar Bahari, a Canadian citizen, was detained without charge Sunday morning and has not been heard from since. Newsweek defended his coverage of Iran as \"fair and nuanced\" and called for his release.\n \n In most cases, the reasons behind the detentions remain unclear.\n \n t r u t h o u t | At Least 24 Reporters Arrested in Iran\n \n -----------------\n \n JoBennett, if you peek into healthcare, we've touched on the subject of conservatism in France. I think I have soundly defeated any notion that it's on the rise there, but I'd be interested in your response relative to that topic. Thinking back on what you've said (though it's gotten heated at moments and the sexist and pathetic WS quips haven't helped), I think France may have a tradition of militancy that may make a right-wing more unapologetically visible at times, though the country itself, for the most part, is fairly left. But again, I don't see this right wing as related to France's secularism. The French have their own way of dealing with diversity, just as we do in the U.S. (and I can't speak for the U.K.). I see us (U.S. and France, that is) as having similar goals, but perhaps approaches from different ends of a spectrum. With what France does, as likely best for France. As what the States attempts, best for us. After all, our countries are very different, too. But I will be curious to see how that develops because we have yet (and perhaps, never) to encounter some of the same issues in America. For example, I can only recall one time seeing a woman in a full burkha. And to tell you the truth, here in the U.S., it was a rather chilling sight. But then again, I am a female poster. And I take it, you are not. Years ago, too, during the Iranian hostage crisis, I knew an Iranian woman exiled here in the States. She was a pro-democracy person who adopted western ways, and was essentially a secular Muslim. Kind of the equivalent of a Christmas Christian in the U.S. Fortunately, she did not have to return. But that possibility, which loomed for a while, was a very serious issue. Because of the nature of her rights -- or lack thereof -- she did not have them in important ways -- under her government. Which is very, very different than France or America or the U.K. It is a religious theocracy. An authoritarian and nationalistic dictatorship. A fascist state. Where a young, beautiful and innocent female philosophy student, standing on a corner with her father, dressed in western clothing, can be shot through the heart by a government sniper and killed right there in the street. Ask WS what they did to women wearing certain clothing during Pinochet's military coup d'etat that he supported as a student in Chile because his father was a right-wing dilettante. If he is honest enough to tell you. And in the name of faith, not secularism. Ask him what one of Pinochet's first acts were, concerning women's right to choose, when abortion was already outlawed in Chile, except when the mother's life was in danger. In the name of faith, not secularism.", 
   {}, 
   358231, 
   null, 
   1245658140.0
  ], 
  [
   358279, 
   null, 
   "nemo", 
   "Washington is trying to use scandal around North Korea for destabilization situation in the district! Americans need to steal up to China by any chances! The main aim of Washington is stopping China's developing as a main economical enemy of USA in the world. To tell the truth the war against North Korea will be ideal chance to start anti china campaign. After the end of war with North Korea Americans will get the possibility to place military bases at the territory of South Korea 100% and in case of victory at the territory of North Korea! The rest is paperwork just! This part of American plan is off-the-shelf in Iraq and Afghanistan in time of invasion into Iran preparation!", 
   {
    "post_info": {
     "post_title": "Washington is trying to use scandal around North Korea for destabilization situation"
    }, 
    "unicode_changes_made": true
   }, 
   357269, 
   null, 
   1245685080.0
  ], 
  [
   358296, 
   null, 
   "simone", 
   "You said that you belonged to the chattering classes, didn't you ? Do you like Chardonnay? I prefer dry white wines rather.\n \n You listed some of my qualities but not all of them. You are also arrogant, sniping, pretentious and a do nothing but chatter and sip chardonnay kind of person.\n Moi? I am not a dilettante, but simply a non-militaristic, non-intervionist, pacifist person.\n By the way not because I am not an abortion enthusiast, it means I am 'male chauvinist pig' on the contrary, I think that women should have the same rights and opportunities as me. \n So, I may be disgusting and a pig, nothing to be ashamed of, but I am not a male-chauvinist. \n \n I supported Pinochet economic policies, I supported the coup but I did not approve of torturing and murdering people.\n\n Personally, I prefer a robust burgundy with a bit of spirit. I would prefer not to sip my wine while sitting opposite an ugly man unless he had intelligent and witty conversation with which to redeem himself. It's always possible to be charmed by a witty, intelligent man who truly loves women, even if he is ugly.\n \n Of course, he would also have to be a man who judges women by other things than merely focusing solely on whether or not a woman is visually attractive.", 
   {}, 
   358139, 
   null, 
   1245697560.0
  ], 
  [
   358354, 
   null, 
   "antonia", 
   "BBC is carrying a statement made by Neda Agha-Solton's fiancee (the young woman who was shot by militia). The family was not allowed by the authorities to have a memorial service. A number of witnesses confirm that she was intentionally aimed at and shot through the heart. I guess she wasn't with her father, but her music teacher, and had gotten out of a car during a traffic jam because it was so hot. The funeral was Sunday. If I follow this story correctly, it appears too that the government is digging graves for people they anticipate being killed. (There's a photograph at the website.) Apparently, the family felt kind of pressured, too, into having many of Neda's organs \"harvested\" for medical donations in order to bury her quickly. \n \n BBC NEWS | Middle East | Death video girl 'targeted by militia'\n \n Voice of America discusses the position of the Obama Administration, agreements and disagreements among Republicans and Democrats. A key factor in their approach appears to be avoiding allowing the Iranian government to use the U.S. as a foil.\n \n VOA News - Obama Administration Defends Stance on Iran Election Crisis", 
   {}, 
   358296, 
   null, 
   1245725040.0
  ], 
  [
   358359, 
   null, 
   "Winston Smith", 
   "Personally, I prefer a robust burgundy with a bit of spirit. I would prefer not to sip my wine while sitting opposite an ugly man unless he had intelligent and witty conversation with which to redeem himself. It's always possible to be charmed by a witty, intelligent man who truly loves women, even if he is ugly.\n \n Of course, he would also have to be a man who judges women by other things than merely focusing solely on whether or not a woman is visually attractive.\n\n \n intelligent : checked\n \n witty : checked\n \n ugly: checked\n \n truly loves women: checked\n \n Well, four out of five is not bad. I am sorry but I am a sucker not for classical beauties a la Grace Kelly but more of the Frances O'Connor type. She looked gorgeous, spirited and intelligent in \"Mansfield Park\"\n \n The Chardonnay set likes to lubricate its jaws with white wine while chattering for instance about the situation in Iran or whatever the flavor of the week is.\n Red wines are the preferred ones by the French. I don't know why in Australia they prefer to sip white wines. I think it is because of our warm weather where a chilled white is cool inspiration for their brains.", 
   {}, 
   358296, 
   null, 
   1245729600.0
  ], 
  [
   358361, 
   null, 
   "Winston Smith", 
   "Personally, I prefer a robust burgundy with a bit of spirit. I would prefer not to sip my wine while sitting opposite an ugly man unless he had intelligent and witty conversation with which to redeem himself. It's always possible to be charmed by a witty, intelligent man who truly loves women, even if he is ugly.\n \n Of course, he would also have to be a man who judges women by other things than merely focusing solely on whether or not a woman is visually attractive.\n\n \n Personally, I would prefer not to sip my wine while sitting opposite an ugly woman unless she had intelligent and witty conversation with which to redeem herself. It's always possible to be charmed by a witty, intelligent woman who truly loves men, even if she is ugly.\n \n Of course, she would also have to be a woman who judges men by other things than merely focusing solely on whether or not a man is visually attractive", 
   {}, 
   358296, 
   null, 
   1245729780.0
  ], 
  [
   358373, 
   null, 
   "antonia", 
   "I'm sure you're very interesting to yourself, Winston. But why don't you go start a thread on Entertainment about wines and sexual attractiveness?", 
   {}, 
   358361, 
   null, 
   1245737100.0
  ], 
  [
   358382, 
   null, 
   "Winston Smith", 
   "don't interrupt when your elders are talking.", 
   {}, 
   358373, 
   null, 
   1245755520.0
  ], 
  [
   358383, 
   null, 
   "Winston Smith", 
   "I'm sure you're very interesting to yourself, Winston. But why don't you go start a thread on Entertainment about wines and sexual attractiveness?\n\n \n You are sure? hmm .. I am sure you were against certainty before, voltaire and all that\n \n But now you have become a lobbyist and an armchair Amazon\n \n why don't you continue your 'mano a mano' with your sister symbiote?\n \n you chickened out, didn't you? emoticon_rolleyes", 
   {}, 
   358373, 
   null, 
   1245755760.0
  ], 
  [
   358390, 
   null, 
   "Winston Smith", 
   "I'm sure you're very interesting to yourself, Winston. But why don't you go start a thread on Entertainment about wines and sexual attractiveness?\n\n \n my mother told me: \"son, if a woman doesn't find you interesting, there is something seriously wrong with her\" \n In my life I have found countless women with something seriously wrong with them. emoticon_rolleyes\n what's seriously wrong with you, Antonia ?", 
   {}, 
   358373, 
   null, 
   1245763500.0
  ], 
  [
   358413, 
   null, 
   "simone", 
   "The fault lies in the eye of the beholder, possibly?", 
   {}, 
   358390, 
   null, 
   1245784620.0
  ], 
  [
   358467, 
   null, 
   "Winston Smith", 
   "for sure :p", 
   {}, 
   358413, 
   null, 
   1245809460.0
  ], 
  [
   358689, 
   null, 
   "Baron", 
   "[QUOTE=Winston Smith;357947]\n \n Make up your mind, am I a descendant of Conquistadores or convicts? You can't have it both way, sister Antonia.[QUOTE]\n \n Careful now Winston, we both know who you are a descendant of. In our country we had a different name for those who managed to get away. I also suggest that you ease up with your usual BS that impresses only certain type of ladies. I don't think Antonia is one of them.\n \n So how about bye bye Winston.", 
   {}, 
   357947, 
   null, 
   1245997140.0
  ], 
  [
   358690, 
   null, 
   "Baron", 
   "my mother told me: \"son, if a woman doesn't find you interesting, there is something seriously wrong with her\" \n In my life I have found countless women with something seriously wrong with them. emoticon_rolleyes\n what's seriously wrong with you, Antonia ?\n\n \n Winston, I think your mother told you: \"son, if a woman finds you interesting, there is something seriously wrong with her\"\n \n Ciao Winston Baby", 
   {}, 
   358390, 
   null, 
   1245997620.0
  ], 
  [
   359273, 
   null, 
   "chester", 
   "Winston, I think your mother told you: \"son, if a woman finds you interesting, there is something seriously wrong with her\"\n \n Ciao Winston Baby\n\n \n Don't mind Winston; he's a legend ion his own mind.emoticon_xclown", 
   {}, 
   358690, 
   null, 
   1246480200.0
  ], 
  [
   359918, 
   null, 
   "antonia", 
   "Don't mind Winston; he's a legend ion his own mind.emoticon_xclown\n\n \n A bit more than a mere clown, though. And legitimately minded by the reasoning.", 
   {}, 
   359273, 
   null, 
   1247044200.0
  ], 
  [
   359919, 
   null, 
   "antonia", 
   "It's starting to look like Latin America with the detained and disappeared;\n \n Iran election: faces of the dead and detained | World news | guardian.co.uk\n \n Clinton calls for stricter sanctions;\n \n AFP: Clinton calls for &#39;even stricter&#39; Iran sanctions", 
   {}, 
   359918, 
   null, 
   1247045340.0
  ], 
  [
   360948, 
   null, 
   "ObamaisNOSAVIOR", 
   "Iran TRUELY scares me......\n Given our less the GLORIOUS FEARLESS LEADER......\n Can ANYONE say HUNGARY 56??????????\n Thats what this is reminding me of.....", 
   {}, 
   359919, 
   null, 
   1247815680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Iranian Elections", 
  "url": "http://www.4forums.com/political/current-events-debates/12861-iranian-elections.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 12861, 
  "discussion_files": [
   [
    "27946.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-print.html"
   ], 
   [
    "27947.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-7-print.html"
   ], 
   [
    "27948.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-5-print.html"
   ], 
   [
    "27949.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-4-print.html"
   ], 
   [
    "27950.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-6-print.html"
   ], 
   [
    "27951.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-3-print.html"
   ], 
   [
    "27952.html", 
    "http://www.4forums.com/political/current-events-debates/12861-iranian-elections-2-print.html"
   ]
  ], 
  "identifier": 12861
 }
]