[
 [
  [
   357774, 
   null, 
   "foundit66", 
   "A Roman Catholic adoption agency which lost a battle to defend its pro-marriage ethos from new 'equality' regulations says it has been left with \"a big dent\" in its reserves.\n \n The Leeds-based charity, Catholic Care, was recently told it must consider gay couples as potential adopters under the Sexual Orientation Regulations (SORs), despite its belief that children need a mother and a father.\n \n Chief Executive Mark Wiggin said the charity had needed two barristers and five solicitors to help wade through the detail of the case.\n \n Things became even more complicated when the Equality and Human Rights Commission was allowed to intervene against the group.\n \n The case was one of the first to be heard by the new Charity Tribunal appeal system, which promised to make the process quicker and cheaper for groups to challenge decisions made by the Charity Commission.\n \n But Mr Wiggin said: \"The costs are prohibitive for most people; it has made a big dent in our reserves.\"\n \n Terry Sanderson, the President of the National Secular Society, said: \"This is the cost of bigotry. There could be absolutely no justification for the Equality Laws to be breached on the basis of religious dogma.\" \n\n Charity in gay adoption battle hit with legal bills | 2009 News | The Christian Institute\n \n A \"charity\" suffers because it can't justify discrimination. emoticon_rolleyes\n I think it shows where their REAL priorities lie...", 
   {
    "post_info": {
     "post_title": "Charity in gay adoption battle hit with legal bills"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1245281040.0
  ], 
  [
   357781, 
   null, 
   "chester", 
   "Charity in gay adoption battle hit with legal bills | 2009 News | The Christian Institute\n \n A \"charity\" suffers because it can't justify discrimination. emoticon_rolleyes\n I think it shows where their REAL priorities lie...\n\n \n I suppose they would rather the children languish in an institution or be shuffled among foster homes.", 
   {}, 
   357774, 
   null, 
   1245285300.0
  ], 
  [
   357786, 
   null, 
   "Lurch907", 
   "So basicly what they're saying is \" You can do this wonderful service for the community, you just can't do it in a way that stays in line with you religious beliefs.\"\n Tell me, who wins in this one? The Catholic church is not going to continue to run a charitable adoption agency if they have to adopt children to gay couples. So x number of children won't be adopted because somebody doesn't like their standards? \n The Catholic adoption agency in my area won't adopt children to people who are unmarried (or at least it was that way 5 years ago). I suppose they'll get sued for that now.\n Those damn Catholic bigots, who do they think they are thinking that a child is better off with a mother and a father.", 
   {}, 
   357781, 
   null, 
   1245292560.0
  ], 
  [
   357787, 
   null, 
   "Penfold", 
   "We all know that the church is obviously above the law. Wait a minute, they're not!emoticon_xangel", 
   {}, 
   357786, 
   null, 
   1245293520.0
  ], 
  [
   357797, 
   null, 
   "jyoshu", 
   "In terms of doing what's best for children, I generally agree with gay groups on the issue of gay adoption. But as a religious person I can also understand there can be a conflict of interest. So, what are you going to do... try to force religious groups to adopt to gays? Force people to go against their religion? I think people need to remember that work like this is often done as charity--meaning, over and above what would have been there otherwise--and if groups keep trying to demand religious charities go against their religion and provide charity that they feel legitimizes behaviors that (to them) goes against their religion, there's going to ultimately be a lot less opportunity out there for things like adoption, not more. If you want change, I think it's sometimes better to take the strategy of cultural change rather than legal challenge when one knows good and well such legal challenge is going to result in less adoptions, not more.", 
   {}, 
   357774, 
   null, 
   1245298440.0
  ], 
  [
   357804, 
   null, 
   "Symbiote", 
   "It's quite disgusting to gloat about putting a charity that helps children out of business since they weren't pro-gay enough for your likings.\n \n Perhaps next you can post videos of you beating up old ladies that oppose gay marriage.", 
   {}, 
   357797, 
   null, 
   1245301800.0
  ], 
  [
   357807, 
   null, 
   "foundit66", 
   "So basicly what they're saying is \" You can do this wonderful service for the community, you just can't do it in a way that stays in line with you religious beliefs.\"\n\n No. \n Basically, what is being said is \"You can do this wonderful service for the community, and you have to follow the law as you do it.\"\n \n Why should a religion be exempt from the law?\n Do you want special privileges for religion?\n \n \n \nTell me, who wins in this one? The Catholic church is not going to continue to run a charitable adoption agency if they have to adopt children to gay couples. So x number of children won't be adopted because somebody doesn't like their standards? \n\n You're missing a bigger context.\n The religion is picking their prejudice over the \"charity\".\n \n If a religion presented themselves saying \"we don't adopt to Jews or blacks\", and that is their religious belief, does that mean they should get to ignore the law because it happens to be their \"religious\" belief?\n \n \n \nThose damn Catholic bigots, who do they think they are thinking that a child is better off with a mother and a father.\n\n Considering all the research shows that a mother and a father vs two parents of the same gender produce similarly happy and healthy kids, I'm not sure what the point of your question is.\n Are you trying to cut the Catholics some leeway because they believe something that is proven false by research?", 
   {}, 
   357786, 
   null, 
   1245302580.0
  ], 
  [
   357808, 
   null, 
   "foundit66", 
   "It's quite disgusting to gloat about putting a charity that helps children out of business since they weren't pro-gay enough for your likings.\n Perhaps next you can post videos of you beating up old ladies that oppose gay marriage.\n\n emoticon_rolleyes\n There is no mention of them going \"out of business\".\n And they did it to themselves in refusing to follow the law.\n \n Furthermore, I am not \"gloating\" over anything.\n I am simply pointing out where their priorities are.\n \n \n \nSo, what are you going to do... try to force religious groups to adopt to gays? \n\n I am talking about adoption agencies being forced to follow the law.\n What are you talking about? Religious organizations being exempted from the law?\n \n \n \nForce people to go against their religion?\n\n :xbanghead\n We've been over this before.\n Muslims who don't want to wash their hands before surgery are \"forced\" to follow their hospital procedures. Or they can quit.\n Companies and governments have rules that people have to follow.\n \n \n \nI think people need to remember that work like this is often done as charity--meaning, over and above what would have been there otherwise--and if groups keep trying to demand religious charities go against their religion and provide charity that they feel legitimizes behaviors that (to them) goes against their religion, there's going to ultimately be a lot less opportunity out there for things like adoption, not more.\n\n Say whaaa?\n So if a prospective parent wants to adopt, and the Catholic agency isn't there, they won't go to the government agency?\n If a Catholic agency closes its doors, are those kids going to go on the streets? Or would they actually go to governmental facilities?\n emoticon_rolleyes\n \n And do religions get special privileges?\n If we have somebody working in a STATE adoption agency, and that person doesn't want to adopt out a white baby to black parents, or a baby to Jews, or a baby to gays, why is that person \"forced\" to go against their \"religious beliefs??? :xbanghead\n \n This is simple law.\n A law that requires equal treatment, and prohibits discrimination.\n \n \n \nIf you want change, I think it's sometimes better to take the strategy of cultural change rather than legal challenge when one knows good and well such legal challenge is going to result in less adoptions, not more.\n\n 1) There is no logic in the \"less adoptions\" claim.\n \n 2) Say whaaa???\n We've already got a \"cultural change\" whereby LAWS WERE PUT INTO OUR GOVERNMENT BY SOCIETY which dictate that adoption agencies can't discriminate.\n Do you want it unanimous?\n \n 3) Where does it end?\n There were plenty of laws preventing anti-black discrimination when obviously there were plenty of people who didn't like that.\n Was that decided wrong?\n \n 4) Ultimately, we're talking about catering to a religious prejudice AT THE EXPENSE OF THE ORPHAN in denying them a viable home cause it's \"gay\".\n I guess when it comes to religious discrimination, vs welfare of an orphan child, we know where you stand...", 
   {}, 
   357804, 
   null, 
   1245304020.0
  ], 
  [
   357818, 
   null, 
   "Accipiter", 
   "When a religious group decides to oppose something it always tends to tie things up with lots of debate and that costs time and money not to mention what it does to the people it hurts.", 
   {}, 
   357808, 
   null, 
   1245321960.0
  ], 
  [
   357824, 
   null, 
   "Symbiote", 
   "emoticon_rolleyes\n There is no mention of them going \"out of business\".\n And they did it to themselves in refusing to follow the law.\n\n \n The same way gays arrested for sodomy law violations \"did it to themselves\" when they were jailed right? Suddenly when \"the law\" backs being gay you convert into a totalitarian nutjob that thinks the government is always in the right.\n \n \nFurthermore, I am not \"gloating\" over anything.\n\n \n Seems to me you are taking joy in the fact an anti-gay charity was hit with legal bills\n \n \nI am simply pointing out where their priorities are.\n\n \n And where do yours lie, foundit? Would you rather an anti-gay charity for children continue its work, or would you rather sacrifice all the good they do because they don't agree with your views?\n \n \nI am talking about adoption agencies being forced to follow the law.\n\n \n The same way you support gays being forced to follow sodomy law, right? You believe ###### in texas should be locked up for having sex, if that's what the law says?\n \n \n \nMuslims who don't want to wash their hands before surgery are \"forced\" to follow their hospital procedures. Or they can quit.\n Companies and governments have rules that people have to follow.\n\n \n It's strange how in the space of a year you can transform from a gay rights activist demanding equal protection under the law, to a stereotypical fascist shill demanding mindless obedience to government edicts, equating demands enforced at the point of a gun to something your manager asks you to do at work.", 
   {}, 
   357808, 
   null, 
   1245330720.0
  ], 
  [
   357825, 
   null, 
   "Penfold", 
   "The same way gays arrested for sodomy law violations \"did it to themselves\" when they were jailed right? Suddenly when \"the law\" backs being gay you convert into a totalitarian nutjob that thinks the government is always in the right.\n \n \n \n Seems to me you are taking joy in the fact an anti-gay charity was hit with legal bills\n \n \n \n And where do yours lie, foundit? Would you rather an anti-gay charity for children continue its work, or would you rather sacrifice all the good they do because they don't agree with your views?\n \n \n \n The same way you support gays being forced to follow sodomy law, right? You believe ###### in texas should be locked up for having sex, if that's what the law says?\n \n \n \n \n It's strange how in the space of a year you can transform from a gay rights activist demanding equal protection under the law, to a stereotypical fascist shill demanding mindless obedience to government edicts, equating demands enforced at the point of a gun to something your manager asks you to do at work.\n\n \n \n All they need to do is obey the law.", 
   {}, 
   357824, 
   null, 
   1245331020.0
  ], 
  [
   357827, 
   null, 
   "Symbiote", 
   "You mean like how these two just needed to obey the law, and as Foundit put it, \"did it to themselves\"\n \n UK Gay News - Iran Executes Two Gay Teens In Public Hanging", 
   {}, 
   357825, 
   null, 
   1245331620.0
  ], 
  [
   357830, 
   null, 
   "Accipiter", 
   "UK Gay News - Iran Executes Two Gay Teens In Public Hanging\n\n \n That's why we don't want religious people taking over the government.", 
   {
    "unicode_changes_made": true
   }, 
   357827, 
   null, 
   1245332880.0
  ], 
  [
   357832, 
   null, 
   "Symbiote", 
   "What on earth do you mean! The government isn't doing anything wrong, they brought it on themselves.\n \n All they needed to do was obey the law, do you think gays are above the law?! Didn't you get the memo, that's what us pro-gayers believe now, government is always right.", 
   {}, 
   357830, 
   null, 
   1245333540.0
  ], 
  [
   357840, 
   null, 
   "jyoshu", 
   "Seriously folks, does anyone really think it's right to make churches do charitable actions in a certain way, when you know full well that way goes against their religion? We're not talking about what the government is doing here. Religion-based adoption charities simply make the arrangements. They don't provide the legal benefit ... that's the what the government does. This lawsuit is stupid, frankly, because the plantiffs surely know full well that the Catholic charity isn't going to be able to deal with the conflict of interest or the legal fees, and so they'll have to stop doing this charity altogether. In terms of the way it's a conflict of interest, it's like suing them for not giving to pro-choice clinics as readily as pro-life groups. I sometimes think people in these sorts of discussions don't understand the concept of charitable action. Someone giving something over and above what would be given OTHERWISE can discriminate all he or she wants in terms of who he wants to give to. If you're wanting to oppose discrimination from the LEGAL standpoint, then the GOVERNMENT is the entity you should be targeting. The charity doesn't provide the legal benefit. If someone is standing on a street corner pointing people toward the city soup kitchen, but ONLY sending the white homeless people and not black homeless people there, you have no grounds to sue them--getting a trip to the soup kitchen ARRANGED is NOT a right. And if you DO sue them, thereby taking their resources to help white homeless people, it's only going to ultimately mean NO ONE gets anything.\n \n Also, how is this any different than suing a church for not providing gay weddings? I thought gays were swearing up and down that sort of thing wasn't what they were out to do. I don't see how suing a religious group for refusing to facilitate an adoption to a gay couple is any different than suing a church for refusing to facilitate a wedding for a gay couple. Suing charity groups for not doing charity a certain way is a VERY bad idea.", 
   {}, 
   357832, 
   null, 
   1245339120.0
  ], 
  [
   357841, 
   null, 
   "Brigid", 
   " If you want change, I think it's sometimes better to take the strategy of cultural change rather than legal challenge when one knows good and well such legal challenge is going to result in less adoptions, not more.\n\n \n Ummmmmmm. There already WAS a cultural change, and that change ended up being codified into the law. It was this adoption agency that was BREAKING that law that was made. I'm sorry that you want to give religion some sort of special priveleges when they provide such a service, but simply put, they are not above the law.", 
   {}, 
   357797, 
   null, 
   1245339300.0
  ], 
  [
   357842, 
   null, 
   "Brigid", 
   "Seriously folks, does anyone really think it's right to make churches do charitable actions in a certain way, when you know full well that way goes against their religion? We're not talking about what the government is doing here. Religion-based adoption charities simply make the arrangements. \n\n \n Yes, I do. I would be just as angry about them if they weren't adopting to blacks or weren't adopting to Muslims or Jews. Religion is not above the law - they've got to follow it just like any other organization providing a service such as this. Sorry if you want to give them special treatment. :shrugs:", 
   {}, 
   357840, 
   null, 
   1245339480.0
  ], 
  [
   357843, 
   null, 
   "Accipiter", 
   "Seriously folks, does anyone really think it's right to make churches do charitable actions in a certain way, when you know full well that way goes against their religion?\n\n \n If their religion supports bigotry then yes we should.", 
   {}, 
   357840, 
   null, 
   1245339480.0
  ], 
  [
   357846, 
   null, 
   "jyoshu", 
   "Yes, I do. I would be just as angry about them if they weren't adopting to blacks or weren't adopting to Muslims or Jews. Religion is not above the law\n\n \n But they don't DO the 'adopting' to people--they are providing a charitable service by making some arrangements. The legal rights to adoption is provided by the government, not this group.\n Are you now saying we should also force churches to do gay weddings? \n \n What laws say religious charities have to go against their religion in providing charity?\n \n If a ministry is established to give medical treatment to Africans over and above what we be received otherwise, is it really right to sue them if they ONLY put their resources toward African people and not a couple of Europeans in the village?\n \n Should we FORCE Jews to feed people if pork is the only food around to feed the hungry?\n \n \nIf their religion supports bigotry then yes we should.\n\n \n And who's going to make THAT judgment call? You? No thanks.", 
   {}, 
   357842, 
   null, 
   1245339840.0
  ], 
  [
   357849, 
   null, 
   "Accipiter", 
   "And who's going to make THAT judgment call? You? No thanks.\n\n If you keep it up then it's inevitable, someone else will start making that judgment for you.\n \n It's an easy call because many religious people are bigots and everybody knows it except them.", 
   {}, 
   357846, 
   null, 
   1245340680.0
  ], 
  [
   357879, 
   null, 
   "foundit66", 
   "The same way gays arrested for sodomy law violations \"did it to themselves\" when they were jailed right? Suddenly when \"the law\" backs being gay you convert into a totalitarian nutjob that thinks the government is always in the right.\n\n You're comparing invoking prejudice (sodomy) vs preventing discrimination (preventing gay adoption).\n Would you hold the same position regarding those who discriminated against blacks?\n \n \n \nSeems to me you are taking joy in the fact an anti-gay charity was hit with legal bills\n\n Seems to me you are employing strawman tactics for a passive-aggressive ad hominem attack. emoticon_frazzled\n \n \n \nAnd where do yours lie, foundit? Would you rather an anti-gay charity for children continue its work, or would you rather sacrifice all the good they do because they don't agree with your views?\n\n Why do you presume only two options?\n I would rather they recognize the law, recognize the greater good being served in allowing gays to adopt instead of restricting gays and pointlessly limiting the potential parenting pool for their orphans.\n \n Do you think it's not possible for anti-gay people to recognize and follow the law?\n I have more faith in them than you, evidently...\n \n \n \nThe same way you support gays being forced to follow sodomy law, right? You believe ###### in texas should be locked up for having sex, if that's what the law says?\n\n You approach the issue with limited critical thought.\n Texas law violated the constitution. It violated privacy and equal rights. It was an unjust law.\n This law PROTECTS equal rights.\n \n You are blindly putting Jim Crow laws up in the same realm as Civil Rights Act of 1964, and pretending the violations are similar.\n emoticon_frazzled\n \n \n \nIt's strange how in the space of a year you can transform from a gay rights activist demanding equal protection under the law, to a ...\n\n Actually, I am the same person.\n I am still advocating for gay rights, demanding equal protection under the law.\n Your statement is absurd, as it ignores the fact that EVERYTHING I have said is thoroughly consistent.\n \n \n \n... to a stereotypical fascist shill demanding mindless obedience to government edicts, equating demands enforced at the point of a gun to something your manager asks you to do at work.\n\n \"mindless obedience\"?\n I am more than happy to discuss the issue in depth, with those capable.\n Or even, I guess with those not capable.\n \n You throw out the ad hominem accusation of \"fascist\". For wanting equal protection laws enforced.\n Were the people who wrote the Civil Rights Act of 1964 \"fascists\"?\n Were the people who stopped Jim Crow laws \"fascists\"?\n emoticon_frazzled\n \n I think it is you who provides the mindless approach, whereby preventing discrimination is automatically linked to \"fascism\"... emoticon_emb\n \n \n \nAll they needed to do was obey the law, do you think gays are above the law?! Didn't you get the memo, that's what us pro-gayers believe now, government is always right.\n\n \"government is always right\"??? I never said that.\n \n We can obviously defend why the government IS doing right in this case...\n \n I would love to hear ANY explanation from you as to why the government is doing wrong, that wouldn't also similarly apply to every previous law written against anti-black bigotry, or anti-Jewish bigotry, or anti-women bigotry.\n \n The funny thing about these discussions is that it's like reinventing the wheel all over again.\n Gays ask for the SAME discrimination protections that these other groups received in the past, but for THIS issue it's suddenly a new issue.\n Or at least, the people who want to perpetuate anti-gay discrimination think it's a new issue, ignoring what they are talking about regarding precedent to previous issues like anti-black bigotry, anti-Jewish bigotry, or anti-women bigotry.\n \n So I guess the question to the other side of the court is if you had a Baptist church running an adoption center that refused to adopt to blacks or Jews because of religious reasons, would you support them?\n Would you say that the government is \"fascist\" for preventing discrimination against blacks or Jews?\n \n Or is it just the anti-gay religious discrimination that gets a special privilege now?\n With the ULTIMATE REASON FOR the discrepancy being that you're more sympathetic towards THIS form of religious discrimination (anti-gay), but you don't support the OTHER HISTORICAL forms of religious discrimination (anti-Jewish, anti-black, anti-women)???", 
   {}, 
   357824, 
   null, 
   1245356400.0
  ], 
  [
   357883, 
   null, 
   "foundit66", 
   "Seriously folks, does anyone really think it's right to make churches do charitable actions in a certain way, when you know full well that way goes against their religion?\n\n We're talking about making churches FOLLOW THE LAW.\n Laws that businesses have to follow.\n Laws that people with prejudices against gays, based on non-religious reasons have to follow.\n \n A better question to you, which I see you're trying very hard to ignore, is why do religions get a special privilege here?\n Yes. It goes against their religion.\n When we had some types of anti-black racists, it went against their religion to behave in certain ways. Yet we did it anyways.\n \n This whole pretense that religion gets a special pass for discrimination is amusing.\n I can just imagine a court case where a bunch of people are brought before the court because they discriminated against blacks. Jyoshu would want the courts to ask the people \"Did any of you discriminate against gays for religious reasons?\"\n Some of them raise their hands, and Jyoshu wants the judge to tell them \"free to go\" while the others have to still stand trial.\n Then what of the other people in the room?\n A man raises his hand and says \"I want to discriminate against blacks, for religious reasons. Is that okay now?\" emoticon_wow\n \n \n \nWe're not talking about what the government is doing here. Religion-based adoption charities simply make the arrangements. They don't provide the legal benefit ... that's the what the government does.\n\n I hate to break it to you, but the government regulates a lot of business functions out there. Housing. Restaurants.\n And even adoption agencies.\n The government isn't providing the food or room/board, but they are requiring people to treat others fairly and equally in those endeavors.\n Your argument isn't relevant.\n \n \n \nThis lawsuit is stupid, frankly, because the plantiffs surely know full well that the Catholic charity isn't going to be able to deal with the conflict of interest or the legal fees, and so they'll have to stop doing this charity altogether.\n\n It's funny how you think \"the plantiffs\" know this.\n Actually, it's THE DEFENDANTS who would know this. Not the plantiffs.\n The Catholics have pretty deep pockets, and the article said NOTHING about them going broke or having to stop the service.\n \n Actually, I am now curious how YOU think you know what you just said.\n Or are you exaggerating to try to make the defendants look like victims here, when they aren't...\n \n \n \nIn terms of the way it's a conflict of interest, it's like suing them for not giving to pro-choice clinics as readily as pro-life groups.\n\n emoticon_wow\n What you just said made absolutely no sense.\n There is no legal protection for discrimination based on pro-choice vs pro-life opinion.\n \n \n \nI sometimes think people in these sorts of discussions don't understand the concept of charitable action. Someone giving something over and above what would be given OTHERWISE can discriminate all he or she wants in terms of who he wants to give to.\n\n I would love to see you substantiate that claim.\n Please. Provide any sort of proof of your claim.\n \n So if I were to go to the homeless shelter and hand out free hamburgers, I could say \"No Jews and no blacks\" and refuse to hand out hamburgers to Jews or blacks as I distribute?\n Is that what you think? emoticon_rolleyes\n \n \n \nAnd if you DO sue them, thereby taking their resources to help white homeless people, it's only going to ultimately mean NO ONE gets anything.\n\n So by your philosophy, we should allow discrimination to be practiced, in the name of \"charity\".\n As long as bigotry is being \"charitable\", it's okay?\n That's actually kinda funny....\n \n \n \nAlso, how is this any different than suing a church for not providing gay weddings?\n\n Doing weddings is a part of a biblically documented religious ceremony.\n I think the Catholics even list \"marriage\" as a sacrament.\n \n Not so for adoptions.\n \n \n \nI thought gays were swearing up and down that sort of thing wasn't what they were out to do.\n\n We aren't out to make churches perform marriage ceremonies.\n Making a religious adoption center follow the law on adoptions? I have never given anybody reason to think I would be for allowing religious organizations to discriminate in adoption.", 
   {}, 
   357840, 
   null, 
   1245357600.0
  ], 
  [
   357885, 
   null, 
   "foundit66", 
   "But they don't DO the 'adopting' to people...\n\n And when McDonald's serves a hamburger or Ramada provides a room, the government isn't providing that either.\n But we still have laws that say McDonald's and Ramada can't discriminate.\n \n \n \nThe legal rights to adoption is provided by the government, not this group.\n\n And this group is refusing that \"legal right\" to adoption.\n What is hard to understand about that?\n \n \n \nAre you now saying we should also force churches to do gay weddings? \n\n No.\n \n \n \nWhat laws say religious charities have to go against their religion in providing charity?\n\n The EXISTING laws that govern these issues.\n Perhaps you should go over the court case if you really want that question answered. Cause obviously the judge recognized a law DOES cover that.\n \n \n \nShould we FORCE Jews to feed people if pork is the only food around to feed the hungry?\n\n You've just left the argument.\n There are rules on religious, sexual orientation, gender, race, ... discrimination.\n There are no rules on food choice discrimination.\n \n \n \nAnd who's going to make THAT judgment call? You? No thanks.\n\n It's funny to watch you back-peddle.\n You started out asking that we wait for societal change.\n When you recognize that laws being enacted ARE A PART OF the societal change, suddenly you want to revoke the judgment call altogether. emoticon_frazzled\n \n Gays don't want anti-gay people making the \"judgment call\" when it comes to our rights, and you think we should get over it.\n YOU don't want people to make a \"judgment call\" when it comes to preventing discrimination, and want to say 'No thanks'.\n Again, your consistency is predictable even in the hypocritical approach you take to the issues... emoticon_xagree", 
   {}, 
   357846, 
   null, 
   1245358140.0
  ], 
  [
   357886, 
   null, 
   "Lurch907", 
   "No. \n Basically, what is being said is \"You can do this wonderful service for the community, and you have to follow the law as you do it.\"\n \n Why should a religion be exempt from the law?\n Do you want special privileges for religion?\n \n\n \n No, what I expect is freedom of religion and some common sense in the application of laws. Catholics believe homosexual acts are a sin, its stupid to expect a Catholic adoption agency to place children in an environment they consider moraly wrong. It would be akin to telling them they have to adopt a child to a couple of abortion providers. Its just not going to happen.\n \n \nYou're missing a bigger context.\n The religion is picking their prejudice over the \"charity\".\n\n \n Wrong, they are picking their beliefs over a law they find morally wrong, big difference. On the same token the people who put forth this regulation seem to be picking it over the charity. Nobody wins but the children lose, nice one.\n \n \nIf a religion presented themselves saying \"we don't adopt to Jews or blacks\", and that is their religious belief, does that mean they should get to ignore the law because it happens to be their \"religious\" belief?\n\n \n Blacks to gays, an apples to oranges comparison not worthy of discussion. The Jewish reference is more apt however, and no I wouldn't have a problem with it. Nor would I have a problem if they said we will only consider Catholic applicants. Nor would I have a problem if another religion did the same thing.\n \n \nConsidering all the research shows that a mother and a father vs two parents of the same gender produce similarly happy and healthy kids, I'm not sure what the point of your question is.\n Are you trying to cut the Catholics some leeway because they believe something that is proven false by research?\n\n \n You shouldn't use the word proof here. The research hasn't proven anything of the sort since there are not enough gay married parents for a sound basis to a study. I can show you studies that show same sex couples are not as good of parents, but I discount those for the same reason, not a large enough study base.", 
   {}, 
   357807, 
   null, 
   1245358740.0
  ], 
  [
   357890, 
   null, 
   "foundit66", 
   "No, what I expect is freedom of religion and some common sense in the application of laws. Catholics believe homosexual acts are a sin, its stupid to expect a Catholic adoption agency to place children in an environment they consider moraly wrong.\n\n Okay. Judaism is a sin, right?\n Buddhism? Not believing Christ came to die for your sins will get you sent to hell.\n Furthermore, the parents will obviously raise their kid AS A JEW or a BUDDHIST, so if the Catholics adopt out, without capability to discriminate based on religion, they are consigning a kid to potential hell, raised in a non-Christian religion.\n :xbanghead\n \n They have freedom of religion.\n Freedom to live THEIR lives according to THEIR religion.\n Freedom of religion HAS NEVER given people the power to overrule anti-discrimination laws.\n \n Some people have RELIGIOUS beliefs regarding segregation and racism. Does that mean THEY get a free pass?\n \n Furthermore, aren't ALL PEOPLE SINNERS?\n Yeah. The catholics would be putting a child in a home with sinners. They do that anyways. \n \n \n \nIt would be akin to telling them they have to adopt a child to a couple of abortion providers. Its just not going to happen.\n\n Considering there are no laws against discrimination based on \"providing abortions\", it's apples and oranges.\n They could conceivably discriminate legally today on that issue, if they wanted to.\n \n \n \nWrong, they are picking their beliefs over a law they find morally wrong, big difference.\n\n Not really...\n Since when do religious beliefs get a free ride to overrule the law?\n \n I would love to see this in action, so you can witness what you're actually describing.\n Two people in court. One is a racist who has \"religious beliefs\" against blacks.\n Another has no religious beliefs against gays, but doesn't want to serve them.\n \n You would give the racist \"religious beliefs\" guy a pass on his violation of the law, while the non-religious beliefs violator is still culpable?\n \n Again, we're back to NO SPECIAL PRIVILEGES for religious beliefs.\n \n \n \nOn the same token the people who put forth this regulation seem to be picking it over the charity.\n\n What I find amusing in such situations is that people refuse to acknowledge that the PEOPLE WHO PERPETUATED THE DISCRIMINATION chose to violate the law.\n So you blame the people \"who put forth this regulation\", but ignore the culpability of the people who broke the law.\n \n The charity could have easily CHOSEN THE CHARITY OVER their religious prejudice.\n They chose not to.\n I am simply noting which \"interest\" is stronger in their book.\n \n I think if you substitute \"gay\" with \"black\" in the story, you'd find a lot of people (including some of the people trying to support the charity here) a lot more understanding of the fact that THEY BROKE A LAW...\n \n \n \nBlacks to gays, an apples to oranges comparison not worthy of discussion.\n\n It's not a \"comparison\".\n If you want to give religion a free pass on observing discriminatory laws, then the standard needs to be applied ACROSS THE BOARD.\n \n There are religious beliefs regarding racism and segregation.\n You are ignoring them because it's not convenient for you to observe the implications of what you ask for.\n By your standards of letting religion get a free pass based on \"religious beliefs\", you would have to (for consistency sake) allow the religious racists the same \"religious freedom\".\n \n I think the reality is that you're just allowing discrimination based on the attributes you feel more sympathetic with. Allowing a subjective bias to ignore the overall consistent application of the standard you purport to uphold.\n \n \n \nThe Jewish reference is more apt however, and no I wouldn't have a problem with it. Nor would I have a problem if they said we will only consider Catholic applicants. Nor would I have a problem if another religion did the same thing.\n\n At least you're consistent there, although this is obviously becoming less and less about \"charity\" as you do so...\n \n \n \nYou shouldn't use the word proof here. The research hasn't proven anything of the sort since there are not enough gay married parents for a sound basis to a study. I can show you studies that show same sex couples are not as good of parents, but I discount those for the same reason, not a large enough study base.\n\n You're running the double-standard on the scientific classification of \"proof\" here, ignoring the fact that the evidence CLEARLY shows the conclusion I am talking about.\n \n And I would love to see you show the \"studies\" you claim. I have seen a variety of studies in my time, and NONE of them find any real deficiency against gays.\n Quite frankly, in my experience when people claim to be able to show me such studies, they are bluffing.\n So please. Show these \"studies\" you talk about... emoticon_rolleyes\n \n On the flip side of the aisle...As this summary will show, the results of existing research comparing lesbian and gay parents to heterosexual parents and children of lesbian and gay parents to children of heterosexual parents are quite clear: Common stereotypes are not supported by the data.http://www.apa.org/pi/lgbc/publications/lgpsummary.html\n There are MANY studies presented here, all with the same similar conclusion that children of gay parents are just as happy and healthy as children of straight parents.", 
   {}, 
   357886, 
   null, 
   1245360540.0
  ], 
  [
   357891, 
   null, 
   "jyoshu", 
   "We're talking about making churches FOLLOW THE LAW.\n Laws that businesses have to follow.\n \n I hate to break it to you, but the government regulates a lot of business functions out there. Housing. Restaurants.\n And even adoption agencies.\n\n \n Wow. emoticon_wow \"Business\"??? What part of the word \"CHARITY\" do you not understand, Foundit? Restaurants aren't the same as soup kitchens. Do you not get the difference?? Since you keep bringing up BUSIESS non-discrimination law, if a church or religious organization does adoption arrangements for no profit, you won't force them to go against their religion? You would THEN not be for legal action against them? You seem to be basing your argument here on the same concept as BUSINESS non-discrimination. The article clearly said \"charity.\" In fact, YOU said \"charity\" your title. You do know that charity is not the same thing as business, don't you??? That's the thing ... this ISN'T a case of a business. It's a case of a charity. And by ignoring that KEY point, you're completely trying to sweep the 900lb elephant here under the rug. It won't fit under there ... sorry.\n \n \nA better question to you, which I see you're trying very hard to ignore, is why do religions get a special privilege here?\n\n \n It's a religious CHARITY. What you're doing is like trying to dictate the terms of people giving handouts. Sorry, here's no RIGHT to a handout.\n \n \nSo if I were to go to the homeless shelter and hand out free hamburgers, I could say \"No Jews and no blacks\" and refuse to hand out hamburgers to Jews or blacks as I distribute?\n Is that what you think? emoticon_rolleyes\n\n \n Show me where I can't do that. Show me where it says I can't CHOOSE who I give a free hamburger to. \n \n \nSo by your philosophy, we should allow discrimination to be practiced, in the name of \"charity\".\n As long as bigotry is being \"charitable\", it's okay?\n\n \n We're talking about LEGALITY here. LAWSUITS Not whether it's \"okay\" (a moralistic point). I've already told you I think adoption to gay couples should be done. But I don't think religious groups should be FORCED to do it when it goes against their religion to do so.\n \n \nDoing weddings is a part of a biblically documented religious ceremony.\n I think the Catholics even list \"marriage\" as a sacrament.\n \n Not so for adoptions.\n\n \n Whoa ......\n \n Stop the presses a second ....\n \n You JUST argued that religion shouldn't have a special privilege. NOW you're arguing the fact that an action is religious that makes it different from ANOTHER action? ROTFLOL!!!! If you don't think religion should get a special privilege, then consistently you have no business saying you think churches should be able to get away with refusing gay weddings. emoticon_xangel It's pretty funny that you cite the fact one is a religious sacrament as a reason for your inconsistency.\n \n \nAnd when McDonald's serves a hamburger or Ramada provides a room, the government isn't providing that either.\n But we still have laws that say McDonald's and Ramada can't discriminate.\n\n \n McDonald's and Ramada Inn are BUSINESSES, and therefore subject to BUSINESS non-discrimination laws. They aren't giving hand outs. What you're doing is like trying to punish by lawsuit a religious charity founded to provide aid to battered women because they don't also help MEN.", 
   {}, 
   357883, 
   null, 
   1245360960.0
  ], 
  [
   357893, 
   null, 
   "Penfold", 
   "Rastafarians use cannabis as part of their religion, should they have a special exemption from the law applied to everyone else?", 
   {}, 
   357891, 
   null, 
   1245361680.0
  ], 
  [
   357898, 
   null, 
   "foundit66", 
   "Wow. emoticon_wow \"Business\"??? What part of the word \"CHARITY\" do you not understand, Foundit? Restaurants aren't the same as soup kitchens. Do you not get the difference??\n\n Do you seriously think that people can establish a \"whites only\" soup kitchen, and have it be legal?\n \n \n \nIt's a religious CHARITY. What you're doing is like trying to dictate the terms of people giving handouts. Sorry, here's no RIGHT to a handout.\n\n I never said there was a right to a handout.\n Is there a right to a hamburger at a restaurant? And based on that, discrimination automatically allowable? emoticon_rolleyes\n \n \n \nShow me where I can't do that. Show me where it says I can't CHOOSE who I give a free hamburger to. \n\n You as an individual, handing out an individual hamburger? You are quite free.\n A person setting up a public charity? Not so much.\n \n The thing that kills me about these discussions is often the anti-gay side loses track of reality.\n Here, the courts RULED AGAINST the charity.\n So obviously they saw that the laws DO APPLY to a charity...\n \n \n \nBut I don't think religious groups should be FORCED to do it when it goes against their religion to do so.\n\n So the same would go for religious views on gender discrimination, racial discrimination, religious discrimination, etc, etc...\n Right?\n \n \n \nYou JUST argued that religion shouldn't have a special privilege. NOW you're arguing the fact that an action is religious that makes it different from ANOTHER action?\n\n Yes.\n It's a separation of church and state issue.\n Adoption IS NOT an aspect of religion.\n \n \n \nIf you don't think religion should get a special privilege, then consistently you have no business saying you think churches should be able to get away with refusing gay weddings. emoticon_xangel It's pretty funny that you cite the fact one is a religious sacrament as a reason for your inconsistency.\n\n You have a serious problem with ignoring details, stripping them from positions, to try to pretend that one thing is just like another despite the significant distinctions pointed out.\n Furthermore, it's funny how you keep harping on \"it's a charity\" over and over above, but then you bring up \"wedding\" and pretend that wedding and adoption are the same thing...\n \n \n \nMcDonald's and Ramada Inn are BUSINESSES, and therefore subject to BUSINESS non-discrimination laws. They aren't giving hand outs. What you're doing is like trying to punish by lawsuit a religious charity founded to provide aid to battered women because they don't also help MEN.\n\n Well, a \"battered husband\" would have to bring that lawsuit in the first place... emoticon_rolleyes", 
   {}, 
   357891, 
   null, 
   1245366660.0
  ], 
  [
   357900, 
   null, 
   "Lurch907", 
   "Okay. Judaism is a sin, right?\n Buddhism? Not believing Christ came to die for your sins will get you sent to hell.\n Furthermore, the parents will obviously raise their kid AS A JEW or a BUDDHIST, so if the Catholics adopt out, without capability to discriminate based on religion, they are consigning a kid to potential hell, raised in a non-Christian religion.\n\n \n As I already said, I would have no problem w/ a religious adoption agency restricting its client base to people of that religion. I'm actually suprised more don't do it.\n \n \nThey have freedom of religion.\n Freedom to live THEIR lives according to THEIR religion.\n Freedom of religion HAS NEVER given people the power to overrule anti-discrimination laws.\n\n \n Except when it comes to running THEIR adoption agency. Apparently you only want freedom of religion to be up held until it violates what you believe is descrimination. \n \n \nSome people have RELIGIOUS beliefs regarding segregation and racism. Does that mean THEY get a free pass?\n\n \n Why not? If a religious adoption agency only worked with clients that attended their church would you be OK with that? If a muslim adoption agency only accepted muslim clients I see no problem. If you don't like it go to a different agency or start your own. Its called freedom.\n \n \nConsidering there are no laws against discrimination based on \"providing abortions\", it's apples and oranges.\n They could conceivably discriminate legally today on that issue, if they wanted to.\n\n \n So it's all about what the law says? So you add no problem with this until the ordinance was past? Come on.\n \n \nWhat I find amusing in such situations is that people refuse to acknowledge that the PEOPLE WHO PERPETUATED THE DISCRIMINATION chose to violate the law.\n So you blame the people \"who put forth this regulation\", but ignore the culpability of the people who broke the law.\n\n \n I never said they didn't break the law. What I'm saying is its a stupid law and the people who wrote aren't helping anyone, but they are doing harm.\n Let me put it this way, there is only one possible outcome if this is strictly enforced, the Catholic adoption agency will close. Who is helped by that?\n \n \nThe charity could have easily CHOSEN THE CHARITY OVER their religious prejudice.\n They chose not to.\n I am simply noting which \"interest\" is stronger in their book.\n\n \n On the flip side of the same coin the people drafting and enforcing this ordinance could have choosen the welfare of these children over what they preceive as discrimination.\n \n \nI think if you substitute \"gay\" with \"black\" in the story, you'd find a lot of people (including some of the people trying to support the charity here) a lot more understanding of the fact that THEY BROKE A LAW...\n\n \n Except substituting black for gay in the story is stupid because they are not even remotely comparable.\n \n \nThere are religious beliefs regarding racism and segregation.\n You are ignoring them because it's not convenient for you to observe the implications of what you ask for.\n By your standards of letting religion get a free pass based on \"religious beliefs\", you would have to (for consistency sake) allow the religious racists the same \"religious freedom\".\n\n \n I'm not ignoring anything, the topic isn't racial discrimination. But, if you think its important, I also think that most discrimination laws as they apply to individuals and private business are pointless and wrong. If I owned a business on private property and I only wanted to hire black people that should be my right. If you don't like it, don't do business w/ me. Gov't on the other hand is a different story.\n \n \nI think the reality is that you're just allowing discrimination based on the attributes you feel more sympathetic with. Allowing a subjective bias to ignore the overall consistent application of the standard you purport to uphold.\n\n \n Actually this is what your doing. You want to force anti-discrimination your sympathetic to down the throats of a charity that doesn't. At the same time your discriminating against them by not allowing them to conduct their live in accordance with their religion. I'll go one step further and say not all descrimination is a bad thing, without some discrimination against religion we might still have human sacrifice or something. But in this case they are passing anti-discrimination laws that hurt people and help nobody.\n \n You're running the double-standard on the scientific classification of \"proof\" here, ignoring the fact that the evidence CLEARLY shows the conclusion I am talking about.\n \n \nAnd I would love to see you show the \"studies\" you claim. I have seen a variety of studies in my time, and NONE of them find any real deficiency against gays.\n Quite frankly, in my experience when people claim to be able to show me such studies, they are bluffing.\n So please. Show these \"studies\" you talk about...\n\n \n Do your own research. The point is none of the studies are \"proof\" of anything because the study base is far too small. The era of same sex married couples is still in its infancy.\n \n Foundit, If you respond to nothing else in this post please answer this question. Who benifits from closing down this adoption agency?", 
   {}, 
   357890, 
   null, 
   1245368460.0
  ], 
  [
   357901, 
   null, 
   "Lurch907", 
   "Rastafarians use cannabis as part of their religion, should they have a special exemption from the law applied to everyone else?\n\n \n Yes, much like other religions are given a pass on blue laws and allowed to drink wine on sunday. As long as they're not hurting anyone, ie. geting stoned then driving, I don't see a problem.\n I also think the company they work for has the right to fire them monday morning when they fail the drug test.", 
   {}, 
   357893, 
   null, 
   1245368700.0
  ], 
  [
   357907, 
   null, 
   "foundit66", 
   "As I already said, I would have no problem w/ a religious adoption agency restricting its client base to people of that religion. I'm actually suprised more don't do it.\n\n Quite frankly, I think it helps show how \"special\" the anti-gay prejudice is in this country.\n How contradictory \"religion\" applies its discrimination towards gays, while ignoring similarly motivated discrimination towards other groups.\n \n \n \nExcept when it comes to running THEIR adoption agency. Apparently you only want freedom of religion to be up held until it violates what you believe is descrimination. \n\n ???\n Restricting gay marriages in churches is also discrimination.\n But it is PROTECTED under religious freedom.\n \n Restricting gays from the Boy scouts is discrimination.\n But it is PROTECTED under freedom of association.\n \n Your assessment is inaccurate.\n \n \n \nWhy not? If a religious adoption agency only worked with clients that attended their church would you be OK with that?\n\n Why is it that some people think attaching \"religious\" to the issue somehow invalidates the laws on the issue?\n \n \n \nIf a muslim adoption agency only accepted muslim clients I see no problem. If you don't like it go to a different agency or start your own. Its called freedom.\n\n That should be phrased as \"freedom to discriminate\". emoticon_rolleyes\n \n \n \nSo it's all about what the law says? So you add no problem with this until the ordinance was past? Come on.\n\n Do I seriously need to respond to every flimsy strawman / poor reading comprehension hyperbole you throw out there?\n My point was regarding the law. It points out the differences our society has on the issue you raise, and on the EXISTING issue.\n As such, it appears you are trying to create a weaker scenario analogy in order to attain a point.\n But the reality is that our society DOES (IMO) take restrictions upon people very seriously. I think that's one of the reasons the list of things you CAN discriminate based on is so much smaller than the list of things you CANNOT discriminate based on.\n \n It would conceivably be legal (in a lot of areas) for the organization to discriminate based on POLITICAL AFFILIATION, as that isn't covered.\n \n \n \nI never said they didn't break the law. What I'm saying is its a stupid law and the people who wrote aren't helping anyone, but they are doing harm.\n\n 1) Oh. I'm sorry.\n I didn't realize you considered the law \"stupid\".\n That's an overwhelming argument which shouldn't be ignored... emoticon_rolleyes\n \n 2) Again, why are you looking at it JUST from the \"the people who wrote this law are doing harm\" side of things.\n One side wrote the law.\n But the other side CHOSE TO BREAK the law.\n The other side chose to spend CHARITY MONEY to fight the law.\n \n You want to say that if the law didn't exist, this case would never have existed. I get that.\n But the law is valid. I see no good reason to give religion a free pass / special privilege here.\n You also need to recognize that if the charity decided NOT TO BREAK the law, and didn't decide to waste charity money on fighting the law, we also wouldn't have this situation.\n \n \n \nLet me put it this way, there is only one possible outcome if this is strictly enforced, the Catholic adoption agency will close. Who is helped by that?\n\n Again, you fixate on JUST what the government's actions involve.\n If the Catholic organization chose to follow the law, that would be preferable.\n You really demonstrate your bias in attempting to blame the law-breakers for nothing in this case.\n A \"religious belief\" automatically means \"free pass\" in your book, huh... emoticon_rolleyes\n \n \n \nOn the flip side of the same coin the people drafting and enforcing this ordinance could have choosen the welfare of these children over what they preceive as discrimination.\n\n 1) It is discrimination.\n Don't employ weasel words to try to ignore that.\n \n 2) I'm sorry, but this whole thing is pretty pathetic.\n Suppose some racist philanthropist said \"I want to give $1 million dollars to this orphanage, but only if it agrees not to adopt out to black parents.\"\n Would you then look at the situation and then insist \"OMG! Look at all the problems those people are causing by preventing racist discrimination!\"\n That's absurd!\n \n Oh wait. If the philanthropist's racism was motivated by RELIGION, would that somehow change everything? emoticon_rolleyes\n \n \n \nExcept substituting black for gay in the story is stupid because they are not even remotely comparable.\n\n Why? Because of your personal bias?\n \n From the perspective of the law, it typically simply lists a variety of characteristics by which an organization cannot discriminate on.\n Race, religion, gender, sexual orientation...\n \n The concept is the same. The REAL issue is that you want to say it's \"okay\" on the concept for discrimination against sexual orientation, but you refuse to address the issue on the basis of race.\n WHEN IT'S THE SAME LAW...\n \n \n \nI'm not ignoring anything, the topic isn't racial discrimination. But, if you think its important, I also think that most discrimination laws as they apply to individuals and private business are pointless and wrong. If I owned a business on private property and I only wanted to hire black people that should be my right. If you don't like it, don't do business w/ me. Gov't on the other hand is a different story.\n\n The topic is demonstrating PRECISELY what you're asking for.\n Against gay rights issues, some people often toss out mindless \"domino theory\" claims.\n However on this issue, I'm simply talking about EXACTLY how far what you're arguing for reaches.\n \n What people don't want to admit is that often they take up a position based on the biases THEY FEEL MORE COMFORTABLE with, and they don't want to admit that is the REAL distinction being drawn.\n \n \n \nActually this is what your doing. You want to force anti-discrimination your sympathetic to down the throats of a charity that doesn't. At the same time your discriminating against them by not allowing them to conduct their live in accordance with their religion.\n\n Not just me.\n SOCIETY. Laws don't exist just because I say so.\n And there is no \"discrimination\" against the charity.\n I find it funny that earlier you tried to talk about \"perceived\" discrimination, but here you want to claim the charity is being discriminated against.\n What is really going on is that if the \"religion gets a free pass\" situation were to exist, then it would be the NON-RELIGIOUS prejudice which would be discriminated against.\n \n That's the thing I have been pointing out over and over again in my posts, which you have consistently avoided.\n When the law applies the same to EVERYBODY, religious and non-religious, that isn't discrimination.\n YOU are talking about \"discrimination\" in demanding that the \"religious\" get a free pass that you don't give to those who don't have a religious excuse.\n \n \n \nI'll go one step further and say not all descrimination is a bad thing, without some discrimination against religion we might still have human sacrifice or something. But in this case they are passing anti-discrimination laws that hurt people and help nobody.\n\n We're back in the bigoted million dollar philanthropy example.\n People are hurt because the people of prejudice decide not to follow the law.\n \n \n \nDo your own research.\n\n I have.\n That's why I know you're either lying, or willfully delusional on the issue.\n Left and right, the studies comparing gay and straight parents show NO PROBLEM between the two. Kids are just as happy and healthy.\n \n I knew you couldn't follow through on your claim.\n \n \n \nThe point is none of the studies are \"proof\" of anything because the study base is far too small. The era of same sex married couples is still in its infancy.\n\n 1) First of all, THAT \"point\" regards YOUR specific claim on contradicting research.\n \n 2) Again, you're quibbling over a word.\n While they may not provide absolute proof, THEY ARE EVIDENCE that gays are just as good as straights in parenting.\n NOT A SINGLE STUDY has shown any real problem with gay parenting.\n And that link I provided showed TONS of studies, with cumulatively HUNDREDS upon HUNDREDS of gay and straight parents compared.\n That is pretty significant, whether you want to admit it or not.\n \n \n \nFoundit, If you respond to nothing else in this post please answer this question. Who benifits from closing down this adoption agency?\n\n It's the same benefits as when the situation were \"black\" or \"Jewish\" or \"gender\".\n If a business discriminates against gays and has to pay the government a fine, where is the sense in complaining about \"who benefits\"?\n \n It's JUSTICE we're talking about here.\n Just because bigotry can have a \"philanthropic\" approach doesn't mean it's any less of unjustifiable and illegal bigotry.", 
   {}, 
   357900, 
   null, 
   1245371400.0
  ], 
  [
   357929, 
   null, 
   "jitobear", 
   "Against their religion my XXX. I have read the Bible - every word. It instructs one not to engage in gay sex. It does not instruct people to hate gays. It does not say that gays can not love, raise or nurture a child.\n \n Its a clear case of the church wanting their bigotry protected and they are hiding that fact by saying its \"against their religion\".\n \n Sorry, not buying. Learned to spot the flim flam artists long ago.", 
   {}, 
   357907, 
   null, 
   1245389220.0
  ], 
  [
   357944, 
   null, 
   "Matthew S", 
   "So basicly what they're saying is \" You can do this wonderful service for the community, you just can't do it in a way that stays in line with you religious beliefs.\"\n Tell me, who wins in this one? The Catholic church is not going to continue to run a charitable adoption agency if they have to adopt children to gay couples. So x number of children won't be adopted because somebody doesn't like their standards? \n The Catholic adoption agency in my area won't adopt children to people who are unmarried (or at least it was that way 5 years ago). I suppose they'll get sued for that now.\n Those damn Catholic bigots, who do they think they are thinking that a child is better off with a mother and a father.\n\n \n The catholic charity is the one who went to court, no one sued them. So if they had not gone to court then there would be no legal bills draining their resources.", 
   {}, 
   357786, 
   null, 
   1245416220.0
  ], 
  [
   357963, 
   null, 
   "jyoshu", 
   "Do you seriously think that people can establish a \"whites only\" soup kitchen, and have it be legal?\n\n \n Go ahead and show what the law says about acts of charity if you're so sure of it. Show where it says religions have to go against their religion in terms of CHARITY.\n \n \nI never said there was a right to a handout.\n Is there a right to a hamburger at a restaurant? And based on that, discrimination automatically allowable? emoticon_rolleyes\n\n \n A restaurant is a for profit business. It's not a handout.\n \n \nYou as an individual, handing out an individual hamburger? You are quite free. A person setting up a public charity? Not so much.\n\n \n \"Not so much\"? Now THERE'S a vague phrase if I ever heard one. I guess you're not going to offer any specifics here in proving your claims that non-discrimination policies in BUSINESS applies here to charity. Likely because you don't even really know.\n \n \nThe thing that kills me about these discussions is often the anti-gay side loses track of reality.\n Here, the courts RULED AGAINST the charity.\n So obviously they saw that the laws DO APPLY to a charity...\n\n \n Oh yes, and we all know the courts have NEVER ruled wrong .... ;)\n \n Once again, Founit demonstrates his rather unbalanced blind faith in courts and judges.\n \n \nAdoption IS NOT an aspect of religion.\n\n \n Wrongo.  \n \n It's known as helping ORPHANS. And it's a well-known part of Christian teaching. It may not be as prevalent or emphasized as MARRIAGE, but to say it's not an aspect of religion is to demonstrate a lack of knowledge about Biblical teachings on your part. Heck, even that 'ol evil, dastardly Old Testament that people like yourself like to throw in the face of Christians by picking out examples of an angry God demands THAT. And I would HAPPY to provide Biblical references if you decide to make this one of your examples of disagreeableness. ;) More importantly, who are you to say someone's desire to help orphans by finding them homes isn't as aspect of THEIR religion? \n \n You're just being inconsistent here, by demanding churches provide to GAYS in the issue of care of orphans, but not provide to gays in the issue of marriage. That's your problem. But you'll never own up to that.", 
   {}, 
   357898, 
   null, 
   1245436800.0
  ], 
  [
   357968, 
   null, 
   "foundit66", 
   "Go ahead and show what the law says about acts of charity if you're so sure of it. Show where it says religions have to go against their religion in terms of CHARITY.\n\n Dude.\n COURT RULING.\n Go look it up yourself. I've already proven the law by a COURT RULING establishing agreement.\n \n \n \nA restaurant is a for profit business. It's not a handout.\n\n Forest for the trees.\n THAT IS THE POINT.\n A guy going to the restaurant being protected for discrimination is not about \"right to a handout\".\n NONE of this is about \"right to a handout\".\n \n You're trying to argue a strawman and I'm not interested... Too many times you have to be dragged kicking and screaming into discussing the REAL topic, and what people are REALLY saying about the topic.\n I tried to be nice in giving you more information to show you this \"right to a handout\" was specious, but you aren't interested.\n Next time, I just say \"No\" and let you inevitably whine that you don't understand what I'm saying cause none of your strawmen are working... emoticon_cool\n \n \n \n\"Not so much\"? Now THERE'S a vague phrase if I ever heard one. I guess you're not going to offer any specifics here in proving your claims that non-discrimination policies in BUSINESS applies here to charity. Likely because you don't even really know.\n\n Again, we're back to a court ruling on the subject.\n \n \n \nOh yes, and we all know the courts have NEVER ruled wrong .... ;)\n\n You think they ruled wrong.\n Show it.\n \n As of now, you're basically saying that you think they are wrong, and that's about all you've done.\n \n \n \nWrongo.  \n It's known as helping ORPHANS.\n\n Helping others is an aspect of charity. Charity is an aspect of religion.\n But that doesn't automatically make running an adoption agency as an aspect of religion.\n Show me the biblical precedent on the issue.\n Cause the precedent of religious marriage has a LONG history.\n \n \n \nAnd I would HAPPY to provide Biblical references if you decide to make this one of your examples of disagreeableness.\n\n Yes. Please provide biblical examples showing religious involvement in running an adoption agency.\n \n \n \nYou're just being inconsistent here...\n\n No. I am not.\n I have explained why not.\n The really stupid part of all this is again, THIS IS WHAT IS HAPPENING IN REAL LIFE.\n Court ruling establishing charities are not supposed to discriminate.\n The Catholics challenged it. They lost.\n You're scrabbling to find a toe-hold to do your favorite thing of sticking up for discrimination and bigotry, as you proclaim you're for equality... emoticon_emb", 
   {}, 
   357963, 
   null, 
   1245440280.0
  ], 
  [
   357974, 
   null, 
   "jyoshu", 
   "Forest for the trees.\n THAT IS THE POINT.\n A guy going to the restaurant being protected for discrimination is not about \"right to a handout\".\n NONE of this is about \"right to a handout\".\n\n \n So then tell us ... what is it about THIS case that\n \n a.) makes it different from a hand out, when helping people out of CHARITY to find babies IS a way of HANDING OUT services, and\n \n b.) makes it different from OTHER religious-service oriented matters like providing weddings? (And don't start in with the weddings-are-religious thing again because caring for ORPHANS is religious as well.)\n \n \nYou think they ruled wrong.\n Show it. As of now, you're basically saying that you think they are wrong, and that's about all you've done.\n\n \n The fact it's completely inconsistent with things like churches being able to refuse gay weddings should be a red flag, right there.\n \n Sorry, but courts aren't infallible. The Dred Scott descision was wrong as well in the sense of being unethical and morally wrong. \n \n \nHelping others is an aspect of charity. Charity is an aspect of religion. But that doesn't automatically make running an adoption agency as an aspect of religion.\n\n \n Well let's see ...\n \n a.) The Bible specifically says to take care of ORPHANS.\n \n b.) And here we have ... whadyaknow!... a Catholic Church group making adoption arrangements. Taking care of orphans.\n \n Good grief--you can't be serious. I guess next you'll be trying to claim Mother Teresa wasn't doing doing her work in Calcutta because of her religion .... emoticon_rolleyes\n \n You say it's not an aspect of religion, when I've already told you the Bible speaks clearly on the issue of ORPHANS. And I guess the fact it's a CATHOLIC charity is just completely lost on you. ;)\n \n \nYes. Please provide biblical examples showing religious involvement in running an adoption agency.\n\n \n Foundit, come on. Stop this obfuscating junk. \n \n You made the assertion that making adoption arrangements as a charitable act was not a religious matter, but marriage IS. There is support for RELIGIOUS marriage, and there is support for HELPING ORPHANS. Both are often done out of religious convictions, and I know you aren't so dense as to not realize that. You're in full obfuscation mode here. And you have no place to say whether THEY aren't doing out of religious convictions as well.\n \n Do you want Biblical references about HELPING ORPHANS, because THAT'S what's going on here.", 
   {}, 
   357968, 
   null, 
   1245445080.0
  ], 
  [
   357975, 
   null, 
   "foundit66", 
   "So then tell us ... what is it about THIS case that\n a.) makes it different from a hand out, when helping people out of CHARITY to find babies IS a way of HANDING OUT services, and\n\n It's the difference between having one hamburger, which you can only give to one guy...\n ... and having multiple hamburgers, where you DENY giving the hamburger to somebody cause of their race, gender, religion, etc. You have enough hamburgers so that the black guy could have gotten one in addition to everybody else.\n \n \n \nb.) makes it different from OTHER religious-service oriented matters like providing weddings? (And don't start in with the weddings-are-religious thing again because caring for ORPHANS is religious as well.)\n\n Already asked and answered.\n You don't like my answer? Tough.\n \n You claim \"caring for ORPHANS is religious as well\"?\n Not to the degree that weddings are...\n It is so firmly ingrained in the bible that the Catholics have recognized it as a sacrament.\n \n \n \nThe fact it's completely inconsistent with things like churches being able to refuse gay weddings should be a red flag, right there.\n\n emoticon_frazzled\n You say \"it's completely inconsistent\".\n I say \"it's completely consistent\".\n \n Do you want me to repeat everything I've already explained to you that you're cutting and pasting around?\n \n \n \nSorry, but courts aren't infallible.\n\n THEN PROVE THIS ONE WRONG.\n \"courts aren't infallible\" isn't an argument SHOWING WHERE this court was wrong.\n \n \n \nThe Dred Scott descision was wrong as well in the sense of being unethical and morally wrong. \n\n Ethically and morally? I would agree.\n As far as constitutionally? That is actually debatable considering the context of the decision.\n One could easily argue a \"full faith and credit\" argument on the issue.\n If one accepts the legal mind-set that a slave was a possession (which is one area where it is ethically and morally wrong), then one has to wonder about the ideology whereby a person takes his property to another state, and loses it just for crossing the state line.\n \n I see parallels on gay rights issues. If a gay man adopts a baby in Massachusetts, and then goes to Disneyland in Florida, would it be rational for Florida's laws to remove the baby from the gay man's custody?\n I would hope not.\n \n \n \nWell let's see ...\n\n Yeah. I'm \"seeing\" no bible passages...\n \n Look. This situation is simple.\n You're going to interpret things as BROAD AS POSSIBLE in order to give religion as much power as possible. Above and beyond any rational consideration that is out there.\n My position and requests were clear. I wanted BIBLE PASSAGES on the issue.\n So please don't pretend you're satisfying my challenges when you aren't.\n \n \n \na.) The Bible specifically says to take care of ORPHANS.\n\n Where?\n Deut 25:5-10 Says a brother must impregnate his sister-in-law if she becomes a barren widow.\n Does that make this \"religious\" too? emoticon_frazzled\n \n \n \nGood grief--you can't be serious. I guess next you'll be trying to claim Mother Teresa wasn't doing doing her work in Calcutta because of her religion .... emoticon_rolleyes\n\n Duplicitous as always.\n I didn't say they were not doing it \"because of their religion\".\n \n If you want to discuss what I'm actually arguing, I'm here.\n I'm not arguing your duplicitous strawmen.\n \n \n \nFoundit, come on. Stop this obfuscating junk. \n You made the assertion that making adoption arrangements as a charitable act was not a religious matter, but marriage IS.\n\n Funny how you criticize me for obfuscating, and then you pull this in your very next statement...\n \n Suppose a cop pulls over a man on his way to work.\n The man tells the cop \"You need to let me go because it is my religious belief that I must serve my employer dutifully and responsibly. You will make me late, violating my religion if you detain me.\"\n So, the man has a \"religious matter\"... emoticon_frazzled\n \n Marriage IS A SACRAMENT. An essential part of the religion.\n Orphans? Not so much.\n \n \n \nBoth are often done out of religious convictions, and I know you aren't so dense as to not realize that.\n\n But are you so dense as to think that is the real issue here?\n That is the real question...\n \n Doing something our of religious convictions IS NOT the same thing as an item being an essential tenant to the religion.\n And THAT is the distinction I am talking about.\n \n Look. I get the fact that you don't think that distinction is significant.\n I DO.\n So I am showing consistency in observing a factor, even if you personally don't think the factor is significant.\n \n \n \nYou're in full obfuscation mode here. And you have no place to say whether THEY aren't doing out of religious convictions as well.\n\n Again, irony in your words.\n BLOWI.\n Can you show where I supposedly said they aren't doing this \"out of their religious convictions\"???\n Nah. You're in full on BLOWI mode, aintcha...", 
   {}, 
   357974, 
   null, 
   1245446700.0
  ], 
  [
   358340, 
   null, 
   "jyoshu", 
   "Already asked and answered.\n You don't like my answer? Tough.\n\n \n [on difference between this and providing weddings] Wow. \"Tough\"? What a thorough defense of your position. emoticon_xangel When an answer doesn't cut the mustard and the deficiency is shown for all to see, that's the best you can do? Have you ever considered just saying \"you know, you may have a point.\" Nah, didn't think you'd ever done that.\n \n \nYou claim \"caring for ORPHANS is religious as well\"?\n Not to the degree that weddings are...\n\n \n So ... it's an issue of DEGREE to you? Do I really need to tell you the inherent problems with that position? \n \n If religious groups suddenly starting making adoption more a centerpiece of their religion, you'd suddenly be FINE with no longer forcing them to do it in a way that goes against their religion?\n \n Furthermore, there are other GLARING problems with you position. Eucharist is a sacrament of the Church as well. Some states have laws against serving wine to minors. But in your view, you seem to feel that if something is a sacrament--a big enough deal to the church--that apparently restrictions should not apply. So, on the basis that it's a sacrament, you'd be for putting exemptions in all states' laws that would allow the Church to serve wine to minors? \n \n See, I don't think the inconsistency you're demonstrating between caring-for-orphans and providing weddings is really due to one being considered more important by the CHURCH than the other. You've gone WELL out of your way, numerous times, to make clear that you oppose \"special privileges\" to religion. But now you're expecting people to believe that you would be for \"special privileges\" for religion in getting to choose who they provide wedding services for? Nah. Sorry Foundit; you're not passing the smell test here. I think what happened is that you just didn't consider the problem of inconsistency before you took such a stalwart stance on the adoption thing. You didn't THINK about the fact your position on THAT was inconsistent with your position on the allowing religion to discriminate in terms of providing weddings. And, let's face it, as a movement, you all can't (at THIS point) run the risk of looking like you're out to FORCE churches to marry gays. Too much effort has gone into trying to tell people \"no, no, that's not going to happen.\" :) But you'd do it in OTHER cases of charity where it would make people go against their religion, so surely you aren't so surprised when people doubt that--if you all had your way--you REALLY would do it in the case of weddings too. If you could get away with it, that is.  ;)\n \n \nYou say \"it's completely inconsistent\".\n I say \"it's completely consistent\".\n\n \n And you would be wrong.\n \n - Both are acts of charity.\n - Both are actions their religion holds as important\n - In both cases, preventing the 'discrimination' means forcing people to go against their religion.\n - Yet the main thing you hold up as REASON for the difference in your stance between them is the DEGREE of importance the religion places on them??? When you've been so determined NOT to give religion \"special priviledge\"? Riiiiiiiiiiiight ........ So at what point in this degree does something go from being a \"forceable\" issue to a \"non-forcible\" issue (e.g. providing gay weddings) onto churches?\n \n \nTHEN PROVE THIS ONE WRONG.\n \"courts aren't infallible\" isn't an argument SHOWING WHERE this court was wrong.\n\n \n (Shrug) Prove Dred Scott was morally wrong. See, making a moral statement is not an issue of \"proof\". It's an issue of opinion. I'm making MORAL statement about the ruling. Do you get that? What you're doing is USING the court case ITSELF as proof it was right in making the ruling. Circular reasoning.\n \n Imagine if we did that with the Dred Scott decision.\n \n No. A ruling can be wrong even though it was ruled a certain way. Again, the courts aren't infallible.\n \n \nYeah. I'm \"seeing\" no bible passages...\n\n \n Psalm 82:3 Give justice to the weak and the fatherless [orphans]; maintain the right of the afflicted and the destitute. \n \n Psalm 10:18  To do justice to orphans and the oppressed, so that man who is of the earth may strike terror no more. \n \n Malachi 3:5 &#8220;I will be a swift witness against the sorcerers, against the adulterers, against those who swear falsely, against those who oppress the hired worker in his wages, the widow, orphans, against those who thrust aside the sojourner, and do not fear me, says the Lord of hosts. \n \n Jeremiah 22:3 Thus says the Lord: Do justice and righteousness, and deliver from the hand of the oppressor him who has been robbed. And do no wrong or violence to the resident alien, orphans, and the widow, nor shed innocent blood in this place. \n \n James 1: 27 \"Religion that God our Father accepts as pure and faultless is this: to look after orphans and widows in their distress and to keep oneself from being polluted by the world.\" Taking care of orphans--as the Bible says--IS a reason many religious people who do that kind of work for charity, do it. It is part of their religion. That's WHY Christian adoption charities are relatively common.\n \n \nWhere?\n Deut 25:5-10 Says a brother must impregnate his sister-in-law if she becomes a barren widow.\n Does that make this \"religious\" too? emoticon_frazzled\n\n \n That idea existed because, at that time, it was a lot more necessary to hold men to ensuring a family line would continue. Surely you are aware of this.\n \n Interesting though that you brought up widows. That TOO is a big deal in scriptures, as you can see from the verses I provided. I would also be against forcing churches to go against their religion in the way they provide charity in THAT situation as well.\n \n \nI didn't say they were not doing it \"because of their religion\".\n\n \n You brought up the issue of DEGREE. At what point does something become RELIGIOUS ENOUGH in DEGREE to warrant not forcing churches to do it in a way that goes against their religion, Foundit? \n \n \nMarriage IS A SACRAMENT. An essential part of the religion.\n Orphans? Not so much.\n\n \n So if a given church decides taking care of orphans is a \"sacrament\", you'd change your view on this and not support forcing them to go against their religion???\n \n \nDoing something our of religious convictions IS NOT the same thing as an item being an essential tenant to the religion.\n And THAT is the distinction I am talking about.\n\n \n It's amazing to watch you do this. I mean .... breathtaking, in a way. In other threads you've gone out of your way to argue AGAINST solid positions in religion, pitting verses against each other. In fact, you've done that regarding their views on MARRIAGE. Now you're actually RESPECTING the Church's stance on marriage to keep from having to say you'd force churches to do gay weddings?\n \n Wow. Just ... wow! emoticon_frazzled\n \n What's that phrase you use .... \"Inconsistent much?\"", 
   {}, 
   357975, 
   null, 
   1245721680.0
  ], 
  [
   358346, 
   null, 
   "Penfold", 
   "No-one is \"forcing\" them to go against their religion. They are requiring them to stay within the law, like everyone else, and no more than that.", 
   {}, 
   358340, 
   null, 
   1245723540.0
  ], 
  [
   358349, 
   null, 
   "jyoshu", 
   "No-one is \"forcing\" them to go against their religion. They are requiring them to stay within the law, like everyone else, and no more than that.\n\n \n Sure they are. You may want to call it something different in order to water it down, but when a given action is against someone's religion, and they are forced to do it or stop providing a charity altogether, they're basically being forced to do it. Call a spade a spade.", 
   {}, 
   358346, 
   null, 
   1245723960.0
  ], 
  [
   358351, 
   null, 
   "foundit66", 
   "[on difference between this and providing weddings] Wow. \"Tough\"? What a thorough defense of your position. \n When an answer doesn't cut the mustard and the deficiency is shown for all to see, that's the best you can do?\n\n BLOWI.\n You weren't showing a deficiency.\n All you did was SIMPLY REPEAT THE QUESTION.\n \n So, if you want to \"show a deficiency\", then do so.\n But when you REPEAT YOUR QUESTION, it's idiotic to pretend you are \"showing a deficiency\" in my answer, cause you obviously ARE NOT ADDRESSING my answer by JUST repeating the question.\n Understand?\n \n \n \nSo ... it's an issue of DEGREE to you? Do I really need to tell you the inherent problems with that position? \n\n No. I can read your mind and I already recognize the flaws in your position.\n In fact, I have mentally informed the other readers of what those flaws are, so obviously there is no need for you to actually say what you think...\n emoticon_rolleyes\n < end sarcasm <\n \n \n \nIf religious groups suddenly starting making adoption more a centerpiece of their religion, you'd suddenly be FINE with no longer forcing them to do it in a way that goes against their religion?\n\n You fail to recognize what is actually going on here.\n Adoption agencies ARE NOT and NEVER HAS BEEN a major part of the religion.\n If these religious organizations want to CLAIM something otherwise, the truth is easily discernible by examining the history of the religion.\n \n What you are talking about is an attempt to CIRCUMVENT the law by a religion MAKING BIGOTRY more central to their religion. \n And, without a surprise, that is YET AGAIN you trying to get special privileges for religion which secular organizations do not have... emoticon_rolleyes\n \n \n \nFurthermore, there are other GLARING problems with you position. Eucharist is a sacrament of the Church as well. Some states have laws against serving wine to minors. But in your view, you seem to feel that if something is a sacrament--a big enough deal to the church--that apparently restrictions should not apply.\n\n I would be fascinated to learn more information on the subject.\n I was under the impression that the law simply looked the other way.\n If you think law organizations should crack down on churches dealing alcohol to minors, that is bizarre to me.\n \n Moreover, please don't be so brazen as to say \"in my view\".\n I have never talked on this issue, so it's improper for you to claim what my view is...\n \n \n \nSee, I don't think the inconsistency you're demonstrating between caring-for-orphans and providing weddings is really due to one being considered more important by the CHURCH than the other.\n\n That is your opinion.\n The law and the courts obviously feel otherwise.\n \n I recognize you won't feel comfortable until religion is granted all sorts of special privileges, but fortunately the law disagrees with you.\n \n \n \nYou've gone WELL out of your way, numerous times, to make clear that you oppose \"special privileges\" to religion. But now you're expecting people to believe that you would be for \"special privileges\" for religion in getting to choose who they provide wedding services for? Nah.\n\n ROFLMAO!\n OMG. Actual tears in my eyes.\n It still astonishes me when you have the gall to act this way.\n \n I have put myself on record numerous times stating that I do not think that churches should be forced to perform gay weddings. That is irrefutable.\n I have explained WHY I see a difference between church policies on gay weddings, a religious ceremony held within the church, and the issue of adoption which is NOT a religious ceremony.\n \n And now you turn around and doubt my position on gay weddings???\n I swear. You will go through all sorts of mental contortions to arrive at the most obviously FALSE conclusions.\n \n \n \nSorry Foundit; you're not passing the smell test here.\n\n You don't accept my position is genuine?\n I could care less.\n Please. Be my guest in stating over and over again that you don't believe my position on gay marriages in churches.\n I will happily inform the readers \"over and over again\" what my actual opinion is.\n \n It will be yet another demonstration of how far you will go to deny reality! emoticon_xagree\n \n \n \nI think what happened is that you just didn't consider the problem of inconsistency before you took such a stalwart stance on the adoption thing.\n\n There is no inconsistency.\n I have explained the difference.\n You refuse to appreciate the difference.\n \n If Jane likes Hondas and not Buicks, that distinction is important to her.\n So it doesn't matter how many times YOU PERSONALLY expound on how insignificant you think the difference is, it is NOT an inconsistency for her to like a Honda but not a Buick.\n You sticking your head in the sand is not an argument Jyoshu! emoticon_rolleyes\n \n \n \nAnd, let's face it, as a movement, you all can't (at THIS point) run the risk of looking like you're out to FORCE churches to marry gays.\n\n Jyoshu, you just really do not get it.\n Churches HAVE ALWAYS had weddings exempted from discrimination issues.\n The Catholics are not forced to marry Jews, or Jew/Catholic ceremonies in their church if they do not want to.\n \n But discrimination in marriage based on RELIGION is still illegal!\n And no matter how much you want to BLOWI, the truth is that most gays DO NOT want to force churches to perform a gay wedding if they don't want to.\n You can deceitfully insinuate otherwise, despite the evidence against you and without any real evidence to your claim, but doing so will continue to demonstrate your true nature to the readers.\n \n \n \nAnd you would be wrong.\n\n Jyoshu, it's funny how you TALK on other threads about \"time to realize that many people are going to disagree sometimes on controversial issues\", but your follow-through in ADHERING to that ideal is abysmal!\n I am talking about MY OPINION. Got it?\n It's an opinion I actually have, noting a distinction that I see as pertinent.\n You don't appreciate the distinction, but your refusal to appreciate the significance of the distinction to me IS NOT AN ARGUMENT.\n \n \n \n- Both are acts of charity.\n\n Can you document this claim?\n Show how Christianity treats MARRIAGE as a \"charity\"?\n \n \n \n- Both are actions their religion holds as important\n\n And this is where we get back to the \"you're just ignoring the distinction I see as important\".\n The religion \"holding it as important\" IS NOT THE ISSUE that I have.\n It is how YOU WANT to classify the two groups as similar, but in doing so you are brazenly ignoring the distinction I put forth.\n \n The really boring part about your reply is that you ARE NOT SHOWING HOW I am supposedly wrong when you IGNORE what I said...\n Seeing it as \"important\" is not a true test of a religious function.\n \n And like I said earlier, we are STILL BACK TO REALITY on the fact that the court agrees that the charity is acting improperly, yet churches are not forced to perform gay weddings... emoticon_rolleyes\n \n \n \n- In both cases, preventing the 'discrimination' means forcing people to go against their religion.\n\n Irrelevant.\n \"people\" are not protected from having to \"go against their religion\".\n That would be a special privilege for religion.\n \n \n \n- Yet the main thing you hold up as REASON for the difference in your stance between them is the DEGREE of importance the religion places on them???\n\n No.\n \n If you want to talk about my ACTUAL position, then please do so.\n If you want me to ELABORATE on my actual position, I am happy to oblige.\n But stop misrepresenting it.\n \n \n \nSo at what point in this degree does something go from being a \"forceable\" issue to a \"non-forcible\" issue (e.g. providing gay weddings) onto churches?\n\n Irrelevant.\n The issue has nothing to do with \"is it forceable\" or not.\n I have already explained the important distinction.\n You refuse to address the important distinction.\n \n \n \n(Shrug) Prove Dred Scott was morally wrong. See, making a moral statement is not an issue of \"proof\". It's an issue of opinion.\n\n ROFLMAO!\n At this point, it's rather obvious that you don't want to address anything real, and you're more than happy to issue meaningless challenges.\n \n You argued \"courts are not infallible\".\n And that's it.\n That's all the better you got?\n In disputed matters of opinion, rational and intelligent men (and women) can issue explanations as to WHY their opinion is superior.\n But not our \"special\" Jyoshu. He just simply says \"courts are not infallible\" and then argues \"it's an issue of opinion\"...\n Which in no way shows HOW the courts got the law wrong...\n \n Zero for effort.\n Zero for substance.\n \n \n \nI'm making MORAL statement about the ruling.\n\n You are OBJECTING to the statement.\n But time and time again, you fail to recognize the fact that the COURT GOT THE LAW RIGHT.\n Over and over again, it's like you fail to recognize the reality of what is going on.\n You want \"society\" to be persuaded, failing to recognize THAT THEY WERE persuaded into passing a law on this issue. emoticon_xagree\n You want to say the court got it wrong, but ultimately all you do is ignore the important distinctions and whine that it's the same.\n \n You disagree \"morally\". I get that.\n But you don't present any sort of REAL argument for why religion should get a special privilege here. None whatsoever.\n \n \n \nWhat you're doing is USING the court case ITSELF as proof it was right in making the ruling. Circular reasoning.\n\n Yawn. BLOWI.\n I am not doing that.\n I am using the court as an expert on the law, and insisting that if you want to show any fallacy with the law, then you'll have to do better than say \"infallible\" and ignore the important distinctions explained to you.\n \n \n \n Psalm 82:3 Give justice to the weak and the fatherless [orphans]; maintain the right of the afflicted and the destitute. \n Psalm 10:18  To do justice to orphans and the oppressed, so that man who is of the earth may strike terror no more. \n Malachi 3:5 \"I will be a swift witness against the sorcerers, against the adulterers, against those who swear falsely, against those who oppress the hired worker in his wages, the widow, orphans, against those who thrust aside the sojourner, and do not fear me, says the Lord of hosts. \n Jeremiah 22:3 Thus says the Lord: Do justice and righteousness, and deliver from the hand of the oppressor him who has been robbed. And do no wrong or violence to the resident alien, orphans, and the widow, nor shed innocent blood in this place. \n James 1: 27 \"Religion that God our Father accepts as pure and faultless is this: to look after orphans and widows in their distress and to keep oneself from being polluted by the world.\" \n\n ROFLMAO!\n What did you do? Type \"orphan\" into an online resource and spit out the results, ignoring the fact that NONE of them are relevant to what we're talking about???\n Give to orphans? Yes. I see a religious discussion on that.\n Run an adoption agency??? The actual topic!!!\n No. That's not there. emoticon_rolleyes\n \n So if somebody comes along and tells these Christians they can't donate to orphans emoticon_rolleyes , then talk to me about your complaints.\n Otherwise, you're still in a separate category.\n \n \n \nThat idea existed because, at that time, it was a lot more necessary to hold men to ensuring a family line would continue. Surely you are aware of this.\n\n Predictably, not answering the question...\n Deut 25:5-10 Says a brother must impregnate his sister-in-law if she becomes a barren widow.\n Does that make this \"religious\" too? \n \n Please answer the question...\n \n \n \nInteresting though that you brought up widows. That TOO is a big deal in scriptures, as you can see from the verses I provided. I would also be against forcing churches to go against their religion in the way they provide charity in THAT situation as well.\n\n You wanting to establish a BROAD base of areas by which the church can discriminate...\n Why am I not surprised... emoticon_rolleyes\n \n \n \nYou brought up the issue of DEGREE.\n\n Quote me, and then we'll talk.\n \n \n \nSo if a given church decides taking care of orphans is a \"sacrament\", you'd change your view on this and not support forcing them to go against their religion???\n\n If a church ACTUALLY HAD A LEGITIMATE CLAIM to RUNNING AN ADOPTION AGENCY as a sacrament, then we could talk.\n You're trying to move the goal-posts...\n \n \n \nIt's amazing to watch you do this. I mean .... breathtaking, in a way. In other threads you've gone out of your way to argue AGAINST solid positions in religion, pitting verses against each other. In fact, you've done that regarding MARRIAGE. Now you're actually RESPECTING the Church's stance on marriage to keep from having to say you'd force churches to do gay weddings?\n Wow. Just ... wow!\n What's that phrase you use .... \"Inconsistent much?\"\n\n ROFLMAO!\n Jyoshu, I have ALWAYS been against church's having to do gay weddings.\n You yourself RECOGNIZE that. You HAVE to have recognized that, otherwise you wouldn't have been able to try to pretend it is an \"inconsistency\" between gay adoption and gay weddings in church's.\n \n And now you turn around and proclaim I am \"inconsistent\" by saying \"Now you're actually RESPECTING the Church's stance on marriage to...\", like something I am \"NOW\" doing???\n \n I swear. At times you don't even try to make a cogent argument...", 
   {
    "unicode_changes_made": true
   }, 
   358340, 
   null, 
   1245724500.0
  ], 
  [
   358366, 
   null, 
   "jyoshu", 
   "No. I can read your mind and I already recognize the flaws in your position.\n In fact, I have mentally informed the other readers of what those flaws are, so obviously there is no need for you to actually say what you think...\n emoticon_rolleyes\n < end sarcasm <\n\n \n Umm, whatever dude. I have no idea what that was all about, and I seriously doubt anyone else does too.\n \n \nYou fail to recognize what is actually going on here. Adoption agencies ARE NOT and NEVER HAS BEEN a major part of the religion.\n\n \n It's interesting that you insist on using the phrase \"adoption agencies\" rather than what the ARTICLE used, which was \"CHARITY\". You seem to be avoiding the issue of charity here. The adoption charities here exist BECAUSE of the religion. If not for the religion, they wouldn't exist. It's a CATHOLIC charity. Read the actual article. \n \n \nWhat you are talking about is an attempt to CIRCUMVENT the law by a religion MAKING BIGOTRY more central to their religion. And, without a surprise, that is YET AGAIN you trying to get special privileges for religion which secular organizations do not have... emoticon_rolleyes\n \n I recognize you won't feel comfortable until religion is granted all sorts of special privileges, but fortunately the law disagrees with you.\n\n \n Well, you argue that because marriage is a sacrament, IT can have a special privilege of denying weddings to gay couples. So you really have no room to complain.\n \n \nThat is your opinion.\n The law and the courts obviously feel otherwise.\n\n \n Yes, it is my opinion. Just as my opinion is that the Dred Scott decision was wrong.\n \n \nOMG. Actual tears in my eyes.\n\n \n Dude, if you really do have 'tears' in your eyes, you're WAAAAAYYY too into these debates.\n \n \nI have put myself on record numerous times stating that I do not think that churches should be forced to perform gay weddings.\n\n \n That only means your inconsistency goes farther back. You allow for discrimination based on the fact something is a religious sacrament, but oppose it in the case where it's NOT, in terms of degree.\n \n \nBut discrimination in marriage based on RELIGION is still illegal!\n\n \n So.... when someone discriminates against a gay couple by not performing their wedding, BASED on religion, how is that not illegal? emoticon_wow\n \n \nAnd no matter how much you want to BLOWI, the truth is that most gays DO NOT want to force churches to perform a gay wedding if they don't want to.\n\n \n I realize that. \n \n Nevertheless, it's an inconsistency. Either it's discrimination or it's not. \n \n \nCan you document this claim?\n Show how Christianity treats MARRIAGE as a \"charity\"?\n\n \n Anytime a church doesn't charge for letting a couple tie the knot there, how is that not a charity?\n \n \nIrrelevant.\n \"people\" are not protected from having to \"go against their religion\".\n\n \n Actually, they ARE protected from it when it comes to performing gay weddings. If you don't think they are, show where a church is forced to perform gay weddings. But you SUPPORT this special privilege. Inconsistency, my friend. Inconsistency.\n \n \nYou are OBJECTING to the statement.\n But time and time again, you fail to recognize the fact that the COURT GOT THE LAW RIGHT.\n\n \n My argument is ENTIRELY a moral opinion. NOT a legal one. \n \n \nGive to orphans? Yes. I see a religious discussion on that.\n Run an adoption agency??? The actual topic!!!\n No. That's not there. emoticon_rolleyes\n\n \n Sorry, but 'giving to orphans' is at the heart of running an adoption CHARITY (what the ARTiCLE said, rather than what Foundit is saying)\n \n \nPredictably, not answering the question...\n Deut 25:5-10 Says a brother must impregnate his sister-in-law if she becomes a barren widow.\n Does that make this \"religious\" too? \n \n Please answer the question...\n\n \n No, not when you take cultural and sociological changes into effect. But the issue of orphans is still very much of a reality these days. So IT still applies.\n \n \nQuote me, and then we'll talk.\n\n \n \"You claim \"caring for ORPHANS is religious as well\"?\n Not to the degree that weddings are...\"\n \n \nJyoshu, I have ALWAYS been against church's having to do gay weddings.\n\n \n YES .... but that only reveals your inconsistency goes farther back ....", 
   {}, 
   358351, 
   null, 
   1245733680.0
  ], 
  [
   358374, 
   null, 
   "foundit66", 
   "It's interesting that you insist on using the phrase \"adoption agencies\" rather than what the ARTICLE used, which was \"CHARITY\". You seem to be avoiding the issue of charity here.\n\n BLOWI.\n I have not.\n I have explicitly stated that the law does not allow charities to discriminate in a variety of areas.\n I have explicitly stated that I do not believe public charities, or even public religious charities, should be able to discriminate.\n \n Have you forgotten already? emoticon_rolleyes\n \n \n \nThe adoption charities here exist BECAUSE of the religion. If not for the religion, they wouldn't exist. It's a CATHOLIC charity. Read the actual article.\n\n None of this is in dispute.\n In fact, either your honesty or your memory need help cause ALL of this has been acknowledged before.\n \n \n \nWell, you argue that because marriage is a sacrament, IT can have a special privilege of denying weddings to gay couples. So you really have no room to complain.\n\n emoticon_wow\n Do you need to take some notes here or what?\n I am not complaining about weddings, a sacrament, being exempted from discrimination laws.\n In fact, I think I WAS THE ONE who pointed out that weddings BEING a sacrament is one of the reasons I feel they SHOULD be exempted.\n A religious ceremony, performed IN A CHURCH.\n \n A religious charity adoption agency (did I leave out any words for you there? emoticon_rolleyes ) is neither a religious ceremony, a sacrament, or 'performed in a church'.\n \n \n \nYes, it is my opinion. Just as my opinion is that the Dred Scott decision was wrong.\n\n :xbanghead\n There you go again with selective cut-and-pasting.\n My point was that it is your opinion that it is inconsistent.\n \n The law recognizes distinctions which DO provide a means to put one thing in one category, and the other in a separate category.\n \n \n \nDude, if you really do have 'tears' in your eyes, you're WAAAAAYYY too into these debates.\n\n Dude, if you really think that some people should be assaulted based on comments in these debates, then YOU are the one who is \"WAAAAAYYY too into these debates\".\n Being able to find humor in something doesn't show that a person is too involved.\n Thinking another person could be assaulted is what fits in that category... emoticon_xgood\n \n \n \nThat only means your inconsistency goes farther back. You allow for discrimination based on the fact something is a religious sacrament, but oppose it in the case where it's NOT, in terms of degree.\n\n ROFLMAO!\n Honestly Jyoshu, I laugh cause I can't take you seriously.\n You claim it is inconsistent, as you REPEAT THE DISTINCTION WHICH MAKES IT NOT INCONSISTENT.\n One is a sacrament.\n The other is \"NOT\".\n \n And there is no \"terms of degree\". There is no \"degree\" by which an adoption agency (even a charity one) is a sacrament.\n \n \n \nSo.... when someone discriminates against a gay couple by not performing their wedding, BASED on religion, how is that not illegal? emoticon_wow\n\n Again, we're back to the fact that it has been ASKED AND ANSWERED.\n One is an inherent religious ceremony, performed in church.\n The other is not.\n \n Can you take notes cause me repeating myself over and over again is getting old.\n \n \n \nI realize that. \n Nevertheless, it's an inconsistency. Either it's discrimination or it's not.\n\n CLAFCLOW.\n I never denied it was discrimination.\n OF COURSE refusing to do gay weddings is discrimination.\n It is LEGAL discrimination. emoticon_rolleyes\n \n There are forms of legal discrimination.\n \n \n \nAnytime a church doesn't charge for letting a couple tie the knot there, how is that not a charity?\n\n First of all, most churches do charge.\n Quite frankly, I have never heard of a couple which got the pastor and the church for free.\n \n Second of all, even if it was done for free, we're still back at the REAL distinction here. Religious sacrament.\n \n \n \nActually, they ARE protected from it when it comes to performing gay weddings.\n\n I think you fail to recognize that is NOT ACTUALLY the item that is being protected there...\n If a pastor did both church weddings, and doubled as a marriage officiator at the county courthouse...\n ... then he could say \"no\" to a gay wedding in the church, but at the courthouse he could NOT say no.\n \n \n \nIf you don't think they are, show where a church is forced to perform gay weddings. But you SUPPORT this special privilege. Inconsistency, my friend. Inconsistency.\n\n LOL.\n Really. \"Inconsistency\" is evidently something you DO NOT understand.\n You evidently have enough room to think about ONE factor, and all the rest get thrown out the window.\n When people show you MULTIPLE issues of important distinction, you can't help but ignore the ones you feel are irrelevant.\n \n I explained it above. But seriously, try listening...\n \n \n \nMy argument is ENTIRELY a moral opinion. NOT a legal one. \n\n :xbanghead\n :xbanghead\n I don't think you appreciate the full the significance of what is being recognized in the court decision.\n Cause \"consistency\" would be one aspect of the case... \n \n If the courts recognized \"charity\" as protected under religious freedom, then in the interests of CONSISTENCY of protecting religious freedom, they would do so.\n So obviously they recognized a distinction.\n If the courts recognized \"marriage\" as an issue of \"charity\" and not validly covered under \"protecting religious freedom\", then you would see a court case with a judge saying that a church/pastor cannot discriminate against gay marriage.\n \n The fact that the courts are seen as they are DOES DEMONSTRATE a significant distinction. A RECOGNITION of a significant distinction.\n THAT is one point, amongst others, in pointing out \"the court ruling\".\n \n \n \nSorry, but 'giving to orphans' is at the heart of running an adoption CHARITY (what the ARTiCLE said, rather than what Foundit is saying)\n\n And again, you go for a mindless shot while ignoring what I was actually pointing out.\n I was saying YOUR BIBLE VERSES do not diminish the distinction I have made.\n THAT is the \"topical\" part I was referring to... emoticon_rolleyes\n \n \n \nNo, not when you take cultural and sociological changes into effect. But the issue of orphans is still very much of a reality these days. So IT still applies.\n\n All you are doing here is trying to allow the church the capability to stamp its feet and say \"But I really, really, really want to discriminate, as a form of my religion.\"\n \n A logical extension would have racists claiming that racism is a part of their religion.\n The reality is that charity adoption agencies ARE NOT a \"sacrament\", and churches SHOULD NOT have the power to abuse their situation by suddenly \"declaring\" it as such just cause they really hate gays (or some similar nonsense)...\n \n \n \n\"You claim \"caring for ORPHANS is religious as well\"?\n Not to the degree that weddings are...\"\n\n And along those lines, is a sacrament, like a wedding, at the same degree of running a gay adoption charity?", 
   {}, 
   358366, 
   null, 
   1245737640.0
  ], 
  [
   358420, 
   null, 
   "jyoshu", 
   "BLOWI.\n I have not.\n I have explicitly stated that the law does not allow charities to discriminate in a variety of areas.\n I have explicitly stated that I do not believe public charities, or even public religious charities, should be able to discriminate.\n \n Have you forgotten already? emoticon_rolleyes\n \n emoticon_wow\n Do you need to take some notes here or what?\n I am not complaining about weddings, a sacrament, ................\n \n\n \n You have gone WELL out of your way in these forums to make clear you \n don't believe religion should have special privileges. Yet here, you CLEARLY indicated churches should have the special privilege of discriminating by not performing gay ceremonies. They are both examples of discrimination. Yep ... inconsistency. Deal with it.", 
   {}, 
   358374, 
   null, 
   1245786300.0
  ], 
  [
   358421, 
   null, 
   "Steeeeve", 
   "Wow, what a lot of debate over something so simple. \n \n The people made a law about something they feel is wrong...the religious charity didn't like it and now has higher legal bills because of it. Well the charity should either pay the bills, try to change the law back, move out of the locality, or shut down. The entire purpose of having the majority of powers in local governments is so you can live in an area that fits your values and norms. It really is that easy.", 
   {}, 
   358374, 
   null, 
   1245786660.0
  ], 
  [
   358433, 
   null, 
   "foundit66", 
   "You have gone WELL out of your way in these forums to make clear you \n don't believe religion should have special privileges. Yet here, you CLEARLY indicated churches should have the special privilege of discriminating by not performing gay ceremonies. They are both examples of discrimination. Yep ... inconsistency. Deal with it.\n\n emoticon_rolleyesI have also gone WELL out of my way to demonstrate I believe in religious protection.\n It's two competing ideologies, as is evidenced by this thread.\n \n By your approach, one would declare \"You believe in right to gun ownership, but you oppose people owning automatic rifles? INCONSISTENT!\"\n \n A limit to an issue does not automatically create an \"inconsistency\"... emoticon_rolleyes\n \n Somebody could turn around and automatically claim YOUR approach is an \"inconsistency\" with the same single-minded blindness.\n You believe in gay rights, but you support churches being able to discriminate against gays. INCONSISTENT! emoticon_rolleyes", 
   {}, 
   358420, 
   null, 
   1245792660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Charity in gay adoption battle hit with legal bills", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12889-charity-gay-adoption-battle-hit-legal-bills.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12889, 
  "discussion_files": [
   [
    "14217.html", 
    "http://www.4forums.com/political/gay-rights-debates/12889-charity-gay-adoption-battle-hit-legal-bills-print.html"
   ], 
   [
    "14218.html", 
    "http://www.4forums.com/political/gay-rights-debates/12889-charity-gay-adoption-battle-hit-legal-bills-4-print.html"
   ], 
   [
    "14219.html", 
    "http://www.4forums.com/political/gay-rights-debates/12889-charity-gay-adoption-battle-hit-legal-bills-3-print.html"
   ], 
   [
    "14220.html", 
    "http://www.4forums.com/political/gay-rights-debates/12889-charity-gay-adoption-battle-hit-legal-bills-2-print.html"
   ]
  ], 
  "identifier": 12889
 }
]