[
 [
  [
   357829, 
   null, 
   "OldSarge", 
   "Gun, Cell Phone Credited With Saving Clerk's Life \n \n Wednesday, June 17, 2009 7:55 PM\n \n Article Font Size \n \n \n \n \n \n \n ROSWELL, Ga. -- A Georgia liquor store clerk credits his police officer son with giving him two life-saving gifts - a cell phone and a gun. \n \n \n Joseph Wescott says the phone he slipped into his shirt pocket stopped a knife to his chest when a robbery suspect attacked him at the store in a northern Atlanta suburb. He then reached under the counter for the .40-caliber handgun and shot the man. \n \n \n \"The knife that he had looked like it was about 10-foot long,\" the 67-year-old Wescott exclaimed. \n \n \n When the suspect lunged at Wescott, he fell back and the knife struck the battery area of the phone, the clerk said. He then fired one shot at the man Monday night. \n \n \n \"That was the first time I had ever fired that gun,\" he said. \n \n \n Police said Carlos JeanPeirre, 34, is recovering from non-life threatening wounds and faces multiple charges including aggravated assault and attempted robbery. \n \n \n Wescott's son, Jason, said he gave both gifts to his father to keep him safe. \n \n \n \"Something like that can happen in a split second and it's better to have it and not need it than need it and not have it,\" Jason Wescott said. \n \n \n After the attack, Joseph Wescot said he used his cell phone to call 911. \n \n \n \n \n \n © 2009 Associated Press", 
   {
    "post_info": {
     "post_title": "DGU, fact or fiction?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1245331800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  DGU, fact or fiction?", 
  "url": "http://www.4forums.com/political/gun-control-debates/12892-dgu-fact-fiction.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12892, 
  "discussion_files": [
   [
    "7024.html", 
    "http://www.4forums.com/political/gun-control-debates/12892-dgu-fact-fiction-print.html"
   ]
  ], 
  "identifier": 12892
 }
]