[
 [
  [
   358127, 
   null, 
   "foundit66", 
   "Polls show that the Bible remains the most popular book of all time, and almost all U.S. homes (93 percent) have at least one. Yet only half of U.S. adults can name a single Gospel, and most don't know that the first book of the Bible is Genesis. A 2000 survey showed that even 60 percent of those chapter-and-verse-quoting Evangelicals thought Jesus was born in Jerusalem rather than Bethlehem. Similarly, a 2004 survey of high school students found that 17 percent thought \"the road to Damascus\" was where Jesus was crucified and 22 percent thought Moses was either one of Jesus' 12 apostles or an Egyptian pharaoh or an angel. Half of high school seniors also thought Sodom and Gomorrah were married. \n \n But before you pile on the slacker generation, consider that one in 10 of all Americans believe that Joan of Arc was Noah's wife, and 60 percent can't name five of the Ten Commandments. Capitol Hill is no beacon of biblical scholarship, either. Another Georgia Republican (and co-sponsor of Broun's bill), Lynn Westmoreland, in 2006 pushed a bill to require the display of the Ten Commandments in the House and Senate, but then won the dubious immortality of video by going on the \"Colbert Report\" without brushing up on his Decalogue. Which led to this memorable exchange:\n Colbert: What are the Ten Commandments?\n Westmoreland: What are all of them?\n Colbert: Yes.\n Westmoreland: You want me to name them all?\n Colbert: Yes.\n Westmoreland: Uhhh. Don't murder. Don't lie. Don't steal. Ummmmm. I can't name 'em all.\n\n Why a Real 'Year of the Bible' Would Horrify Its Sponsors -- Politics Daily\n emoticon_frazzled\n Well. I guess I can't say I'm too shocked. A lot of times the bible thumpers turn out to be the most ignorant of the bible.\n \n I can't tell you how many discussions I've had where the \"Christian\" involved didn't know that the Old Testament god ordered genocide, slavery, and endorsed marrying the female virgin \"spoils of war\" from the country you just slaughtered.\n Not to mention knowing \"God is against homosexuality\" like a mantra, but not knowing a lot of the other archaic verses nearby which are similarly archaic (and modernly abandoned).\n \n And the above are the easy questions...", 
   {
    "post_info": {
     "post_title": "Bible Illiteracy"
    }
   }, 
   null, 
   null, 
   1245578700.0
  ], 
  [
   358150, 
   null, 
   "Accipiter", 
   "So most religious people are phonies, very interesting.\n \n Pseudoreligon to go with their pseudoscience.", 
   {}, 
   358127, 
   null, 
   1245604260.0
  ], 
  [
   358174, 
   null, 
   "jyoshu", 
   "I don't have a problem with the general point the article above is making, but I think it's a little ridiculous and unfair to hold proponents or apologists of something to being able to recite from memory every item it entails. Westmoreland has no doubt READ the Ten Commandments plenty of times; that he can't recite them from memory is irrelevant. Looks like a typical stunt by Colbert that's more about trying to make the guy look foolish rather than actually dealing with the merits and problems of the issue. This is exactly the sort of thing that keeps people like Colbert and Stewart from being actually taken seriously by a lot of people, except those that just like to see people made to look bad of foolish. To me, the fact that's the main schtick says VOLUMES about the liberals that get into these clowns so much.", 
   {}, 
   358127, 
   null, 
   1245617880.0
  ], 
  [
   358190, 
   null, 
   "foundit66", 
   "I don't have a problem with the general point the article above is making, but I think it's a little ridiculous and unfair to hold proponents or apologists of something to being able to recite from memory every item it entails.\n\n ROFLMAO!\n \n Let's look at the actual items named, okay???\n * Name ANY ONE Gospel book.\n * Name the first book of the bible.\n * What city was Jesus born in?\n * \"Road to Damascus\" is what?\n * Is Moses one of Jesus's 12 apostles or an Egyptian Pharaoh or an angel (or none of the above)?\n * Were Sodom and Gomorrah married?\n * Was Joan of Arc Noah's wife?\n * Name at least five of the ten commandments?\n \n I got the first three. \"Road to Damascus\" is something I knew wasn't associated with Jesus, but I couldn't remember it's association with Paul.\n Moses? That question/answer failure is a joke.\n The last three I passed on as well.\n \n This isn't \"every item it entails\".\n These are fairly simple items that most Christians SHOULD be able to get.\n \n Just out of curiousity Jyoshu, how many couldn't you get?\n Was it a lot? Is that why you've got this \"every little item\" idea of these polling questions?\n Or is this another example of you trying to understate how glaringly easy most of these questions are?\n \n \n \nWestmoreland has no doubt READ the Ten Commandments plenty of times; that he can't recite them from memory is irrelevant.\n\n Again, you pull this lame strawman response.\n It isn't that he \"couldn't recite them\".\n It's that he could name ONLY THREE of them.\n Only the three SECULAR ones, ironically.\n \n \n \nLooks like a typical stunt by Colbert that's more about trying to make the guy look foolish rather than actually dealing with the merits and problems of the issue.\n\n Looks like a typical reply by jyoshu that's more about misrepresenting what other people are saying, than recognizing the validity of the observations.\n \n What you don't seem to want to admit is that this guy was touting the importance of the Ten Commandments, insisting that they should be allowed as monuments in government buildings.\n For something this guy insisted was so important, he was pretty clueless as to what they entailed... emoticon_emb\n \n And that is the point of this article in the first place.\n Too many Christians long on demanding others comply, but precious little knowledge about some of the more basic ideals of their bible...\n \n \n \nThis is exactly the sort of thing that keeps people like Colbert and Stewart from being actually taken seriously by a lot of people, except those that just like to see people made to look bad of foolish.\n\n ROFLMAO!\n Talk about the pot calling the kettle black...\n \n And hypocrisy should look foolish.\n \n \n \nTo me, the fact that's the main schtick says VOLUMES about the liberals that get into these clowns so much.\n\n Meh.\n There have been polls on Stewart's viewership, and consistently they are ABOVE average in areas like income, education, and knowledge of key world events.\n I recognize that him exposing hypocrites may hit a sour spot with you, but his viewing audience is typically a cut above.", 
   {}, 
   358174, 
   null, 
   1245630780.0
  ], 
  [
   358214, 
   null, 
   "Zardoz", 
   "Ummm,\n \n Nothing new to me. Actually, I make this claim often when debating 'christians' here and elsewhwere.\n \n Most 'believers' simply don't know a damn thing about what their own holy book says.\n \n A few do read their bibles.\n Some read ONLY what they're directed to by their pulpit pimps.\n And, since many christians are stoopid, some don't comprehend what they do read. GIGO.\n \n I know the answers, in minute detail, to all the questions listed.\n \n But, then again, I AM ZARDOZ. Great AND Powerful!!!\n Wershup moi!", 
   {}, 
   358190, 
   null, 
   1245637980.0
  ], 
  [
   358223, 
   null, 
   "jyoshu", 
   "ROFLMAO!\n \n Let's look at the actual items named, okay???\n * Name ANY ONE Gospel book.\n * Name the first book of the bible.\n * What city was Jesus born in?\n * \"Road to Damascus\" is what?\n * Is Moses one of Jesus's 12 apostles or an Egyptian Pharaoh or an angel (or none of the above)?\n * Were Sodom and Gomorrah married?\n * Was Joan of Arc Noah's wife?\n\n \n Irrelevant--you're missing the point. Predictably, you still haven't answered how Westmoreland's inability to answer Colbert speaks to the MERITS of whether the 10 Commandments should be displayed in a courthouse. The WHOLE line of questioning was a strawman. Intended to try and make Westmoreland look bad, no doubt. The 10 commandments say what they say REGARDLESS of whether or not someone can recite all of them. The merits of the issue exist INDEPENDENT of whether someone can recite all of them. THAT'S what you aren't getting.\n \n \nAnd hypocrisy should look foolish.\n\n \n Yeah, they do have to make sure that happens, particularly when these clowns are getting rich off of it. Which of course is in part due to all the sadistic people that like to watch people get publicly embarrassed. The Clobert/Stewart fad is big bidness these days. \n \n \nThere have been polls on Stewart's viewership, and consistently they are ABOVE average in areas like income, education, and knowledge of key world events.\n I recognize that him exposing hypocrites may hit a sour spot with you, but his viewing audience is typically a cut above.\n\n \n [snicker] \"Look Ma ... I get my news from ... Comedy Central!!\"\n Would love to see these polls, by the way, and how they were done. Doubt you'll link to them.\n (Say, what's that sound? Oh ... it's Foundit feverishly starting to Google ...emoticon_xangel)", 
   {}, 
   358190, 
   null, 
   1245640980.0
  ], 
  [
   358233, 
   null, 
   "foundit66", 
   "Irrelevant--you're missing the point.\n\n I swear.\n Whenever you use that phrase, it's almost an automatic indicator for a reality of \"What you just said was entirely relevant. You just demonstrated Jyoshu's claims as false. But he's going to turn around, ignore what you actually said, and just repeat himself...\"\n \n \n \nPredictably, you still haven't answered how Westmoreland's inability to answer Colbert speaks to the MERITS of whether the 10 Commandments should be displayed in a courthouse.\n\n Say whaaa???\n How can you say \"I still haven't answered...\" a question THAT WAS NEVER ASKED IN THE FIRST PLACE. emoticon_frazzled\n \n You are missing the point.\n Westmoreland's inability to answer the question DOES NOT speak to the reasons why it should not be displayed in the courthouse. Those reasons lie along the lines of separation of church and state.\n What the questions DO is show HOW SHALLOW Westmoreland's claims are to his OWN perceived importance of the 10 commandments...\n \n It's like somebody pointing to a picture of John robbing the bank, and you want to ask how this proves John is poor.\n It doesn't talk about that.\n It shows JOHN IS A ROBBER...\n \n \n \nThe WHOLE line of questioning was a strawman. Intended to try and make Westmoreland look bad, no doubt.\n\n You are dodging the true point of this left and right.\n The point is that some Christians PROCLAIM that their religion has importance to them, and that it should have importance to others.\n But when it comes down to it, THESE SAME PEOPLE OFTEN KNOW LITTLE about what they insist is important.\n \n \n \nThe 10 commandments say what they say REGARDLESS of whether or not someone can recite all of them.\n\n And again, CLAFCLOW.\n The issue is not whether or not he can recite ALL of them.\n But if these are truly important to somebody, they should be able to name AT LEAST FOUR.\n Three should be an obvious give me cause they are the obvious secular ones.\n The guy couldn't name a fourth one, which is pretty pathetic.\n \n It's like we have a chain smoker who couldn't finish a mile in 20 minutes, and you complain that we shouldn't expect him to finish the mile in 4 minutes...\n emoticon_xdonno\n \n \n \nYeah, they do have to make sure that happens, particularly when these clowns are getting rich off of it.\n\n \"make sure that happens\"?\n Dude! Wake UP!\n Westmoreland HAD A SELF-PROCLAIMED ISSUE of making the Ten Commandments HIS political issue.\n Colbert didn't \"make sure\" anything happened.\n WESTMORELAND was ignorant of the subject he touted as important!\n \n And instead of recognizing Westmoreland as a phoney, you instead blame Colbert for exposing him???\n Man!\n \n \n \n[snicker] \"Look Ma ... I get my news from ... Comedy Central!!\"\n\n Speaking of strawmen...\n I never said they got their news from Colbert / Daily Show.\n I said they WATCH Colbert and the Daily Show.\n \n I swear. It's like you're repeating O'Reilly's talking points, ignoring the fact that O'Reilly was exposed as a fool for trying them months ago.\n Even Stewart OPENLY STATES that people SHOULD NOT TRY to get their \"news\" from his show.\n I sure as heck don't.\n \n But people who WATCH his show are obviously MORE INFORMED than other outlets.\n \n It's like having the Mensa members test higher on current events.\n These guys don't get their current events FROM their Mensa membership.\n But OTHER CHARACTERISTICS of the members lead to them being BETTER INFORMED.\n \n I swear. It is hilarious to watch you bash the guys who are better informed...\n \n \n \nWould love to see these polls, by the way, and how they were done. Doubt you'll link to them.\n\n Oh Jyoshu. Ever demonstrating how pathetic you are at predicting things...\n Here's one link on the issue.\n Bill O'Reilly Calls Viewers of 'The Daily Show With Jon Stewart' A Bunch of 'Stoned Slackers' and 'Dopey Kids' During Interview With Jon Stewart on 'The O'Reilly Factor'\n \n I've got my personal prediction as to what your next BLOWI move will be.\n PLEASE prove me wrong...\n \n \n \n(Say, what's that sound? Oh ... it's Foundit feverishly starting to Google ...emoticon_xangel)\n\n That's just stupid.\n Jyoshu doesn't think I\"ll link it, but then he turns around and admits that he realizes I'm going to google it for him?\n Contradictory much?", 
   {}, 
   358223, 
   null, 
   1245644760.0
  ], 
  [
   358234, 
   null, 
   "foundit66", 
   "Ummm,\n Nothing new to me. Actually, I make this claim often when debating 'christians' here and elsewhwere.\n Most 'believers' simply don't know a damn thing about what their own holy book says.\n A few do read their bibles.\n Some read ONLY what they're directed to by their pulpit pimps.\n And, since many christians are stoopid, some don't comprehend what they do read. GIGO.\n I know the answers, in minute detail, to all the questions listed.\n But, then again, I AM ZARDOZ. Great AND Powerful!!!\n Wershup moi!\n\n I swear.\n It's amazing watching some of them come to the realization that their Old Testament bible ADVOCATED slavery, genocide, etc, etc... emoticon_rolleyes\n \n And then again you'll come across a rare soul who will be shown the proof, and instead of the usual obfuscation ploy of dropping the subject or relying on the \"god, the mafia boss\" type response, they'll absolutely deny it without end...", 
   {}, 
   358214, 
   null, 
   1245644940.0
  ], 
  [
   358301, 
   null, 
   "jyoshu", 
   "Say whaaa???\n How can you say \"I still haven't answered...\" a question THAT WAS NEVER ASKED IN THE FIRST PLACE. emoticon_frazzled\n\n \n Considering the issue of the 10 commandments being displayed on courthouse walls WAS the issue, it's pretty silly to think it wasn't THE issue. Playing gotcha games with Westmoreland didn't get to the merits of the issue at all. But that's Colbert for ya. As if trying to make Westmoreland look bad proves ANYTHING, other than Westmoreland didn't know the 10 Commandments very well. Big freakin' deal. emoticon_rolleyes The whole thing of trying to make Westmoreland look bad was an aside. There are merits of the issue of displaying the 10 Commandments in courthouses. Hate ta' break it to ya: whether someone can remember 10, 7, 4, or 1 of them isn't among them.\n \n \nOh Jyoshu. Ever demonstrating how pathetic you are at predicting things...\n Here's one link on the issue.\n Bill O'Reilly Calls Viewers of 'The Daily Show With Jon Stewart' A Bunch of 'Stoned Slackers' and 'Dopey Kids' During Interview With Jon Stewart on 'The O'Reilly Factor'\n \n I've got my personal prediction as to what your next BLOWI move will be.\n PLEASE prove me wrong...\n\n \n (... Foundit waiting for next comment because he's already planned to claim prediction and make an accusation of a \"BLOWI\" no matter what the comment will be. ;) )\n \n Foundit, seriously. Did you even READ your links?\n \n The first refers to research BY Comedy Central. Doncha' think there's just a weee bit of conflict of interest there? Sorta like if a network got it's highest ratings from Rush Limbaugh doing it's own \"reasearch\" about viewers of the show ...\n \n The 2nd, from \"National Annenberg Election Survey\" says viewers of late night tv and the Jon Stewart show are more familiar with campaign issues. So ... how does this disprove ANYTHING I said that \"[making people look bad] says VOLUMES about the liberals that get into these clowns so much\"? It doesn't. It's another one of Foundit's famous strawman rabbit-hole excursions.", 
   {}, 
   358234, 
   null, 
   1245703140.0
  ], 
  [
   358305, 
   null, 
   "foundit66", 
   "Considering the issue of the 10 commandments being displayed on courthouse walls WAS the issue, it's pretty silly to think it wasn't THE issue.\n\n Um. LOOK AT THE THREAD TITLE Jyoshu.\n This thread is about bible illiteracy.\n \n I realize you want to change the topic to something else. But again, it's illogical to complain I didn't answer a question you hadn't asked before.\n \n \n \nPlaying gotcha games with Westmoreland didn't get to the merits of the issue at all.\n\n Yes. It did.\n I've explained twice now how it did. Twice now you have ignored it.\n The politician claims it is important, but as we can see from his response it's not important to him.\n emoticon_rolleyes\n \n \n \nBut that's Colbert for ya.\n\n This thread isn't about Colbert either...\n \n \n \nThere are merits of the issue of displaying the 10 Commandments in courthouses.\n\n And if you want to discuss them (when it seems you don't cause all you do is SAY there are merits to obfuscate the real point going on here), then start a separate thread.\n \n \n \nFoundit, seriously. Did you even READ your links?\n The first refers to research BY Comedy Central.\n\n Actually the research was done by \"National Annenberg Election Survey\".\n Comedy central may have sponsored the survey, but they didn't conduct it.\n This is similar to many survey techniques in the past. Like the Christian church conducting surveys.\n I don't think it's that much of a problem.\n \n \n \nSorta like if a network got it's highest ratings from Rush Limbaugh doing it's own \"reasearch\" about viewers of the show ...\n\n Comedy Central didn't DO the survey.\n They paid for it to be done by \"National Annenberg Election Survey\".\n Pay attention.\n \n \n \nThe 2nd, from \"National Annenberg Election Survey\" says viewers of late night tv and the Jon Stewart show are more familiar with campaign issues. So ... how does this disprove ANYTHING I said that \"[making people look bad] says VOLUMES about the liberals that get into these clowns so much\"? It doesn't. It's another one of Foundit's famous strawman rabbit-hole excursions.\n\n Wow. It's like somebody shows you a forest of cedars, and you snarl and snidely complain \"you didn't show me any tree\".\n You talked about the nature of the liberals.\n I responded by talking about the nature of the liberals.\n emoticon_rolleyes\n \n Look. I realize you are inherently comfortable with hypocrisy and you obviously have a problem understanding why others do.\n I find that fascinating considering your religious belief background. To me, it \"says volumes\" about you.\n But I guess when you make such ad hominem comments against others, you will probably want to insist that similar observations are not made about you???\n \n I get that you don't understand why others want hypocrisy in our politicians exposed. I get that you don't understand how a person CLAIMING the ten commandments are important, but only being able to name three is a problem.\n I get that.\n \n What YOU don't seem to get is that OTHERS ALSO have such interests, and it's not an inherently negative think to observe hypocrisy and point it out.\n Perhaps if some people were more REAL in their beliefs, and more concerned about observing what they proclaim is important in their own lives, they wouldn't have such a credibility problem when they proclaim it important in other people's lives.\n \n One of the things you don't get about Colbert, and you never will in your rush to summarily judge him, is that he is actually VERY CHRISTIAN.. He DOES take his Christianity seriously.\n He KNOWS the ten commandments.\n He just doesn't see an important in trying to export that into some sort of \"graven image\" for public display that is meaningless.\n Repeatedly he has had discussions where he brings up religious points. Religion IS a part of his life.\n He DOES think the Ten Commandments are important.\n Too bad you can't get that.", 
   {}, 
   358301, 
   null, 
   1245706800.0
  ], 
  [
   358307, 
   null, 
   "jyoshu", 
   "Um. LOOK AT THE THREAD TITLE Jyoshu.\n This thread is about bible illiteracy.\n\n \n I'm talking about COLBERT's stunt. It WAS the issue, yet Colbert chose to ignore it and try to make someone look bad instead. I already said I agree with the article. I took issue with what Colbert did. But you already know that, don't you? You just choose to go back and forth emphasizing what's convenient for yourself at the time.\n \n \nYes. It did.\n I've explained twice now how it did. Twice now you have ignored it.\n The politician claims it is important, but as we can see from his response it's not important to him.\n\n \n And that speaks to the issue of HIM. Not the merits of the issue.\n \n \nThis thread isn't about Colbert either...\n\n \n Foundit, I wish I had a dollar for every time you made a comment on an aside part of an issue rather than sticking a single narrow angle a thread involves. You act like you have no idea of the concept of someone commenting on something SPECIFIC besides the main thrust of the thread, when you in fact hypocritically bring up 'side notes' in threads all the time. If you don't want to talk about Colbert, then don't talk about him. No one is making you respond every time someone says something that doesn't follow EXACTLY the way you want the thread to progress.\n \n \nLook. I realize you are inherently comfortable with hypocrisy and you obviously have a problem understanding why others do.\n\n \n No, I'm not. And you're intentionally being disingenuous to make such a claim. BLOWI, I think you call it. Do you ENJOY hypocrisy witch hunts? Because a LOT of your posts attempt to talk about hypocrisy in people, including posters. Of course you never notice hypocritical things you do yourself ... And the fact you obviously enjoy shows like John Stewart's (which makes trying to make people look hypocritical a big part of his show) fits this obsession with it to a tee. Look, I don't take glee in watching people get publicly embarrassed on national television. It doesn't do anything for me. In fact, I often feel bad for them, to be honest. How could you actually enjoy watching the way Stewart treated Jim Cramer, for instance??? It's not something I enjoy seeing, as you seem to. I think sometimes people put WAAAAAY too much stock in the whole \"exposing hypocrisy\" as a way to embarrass people and make them look bad. There's nothing fun about that to me. I'm sure it makes people like Stewart and Colbert lots of $. Sometimes people do it to where they loose track of actually trying to deal with the merits of the issues at hand, like Colbert did in example you provided earlier. Everyone is 'hypocritical' at some point in their lives, Foundit. Including you. Me pointing this out to you is not \"being comfortable with hypocrisy\" as you disingenuously claim. It's pointing out what has become somewhat of an crusade on peoples' part (yours, it seems) to avoid having to actually debate the issues themselves. \n \n \nOne of the things you don't get about Colbert, and you never will in your rush to summarily judge him, is that he is actually VERY CHRISTIAN.. He DOES take his Christianity seriously.\n He KNOWS the ten commandments.\n\n \n No one here has claimed he wasn't a Christian or didn't know the commandments. It still doesn't speak to the merits of the issue to show that someone ELSE doesn't know them. That he knows them or that someone else does NOTHING--NADA--in terms of determining whether the 10 Commandments should be on courthouse walls or not.", 
   {}, 
   358305, 
   null, 
   1245708900.0
  ], 
  [
   358335, 
   null, 
   "foundit66", 
   "I'm talking about COLBERT's stunt. It WAS the issue, yet Colbert chose to ignore it and try to make someone look bad instead.\n\n emoticon_rolleyes\n The problem here is that you think Colbert's interest is in making people look bad, when the truth is that it's in exposing hypocrisy.\n Furthermore, I think your own bible recognizes the necessity to not have blind or empty faith, filled with openly loud statements that are empty...\n \n Mat 6:6 But thou, when thou prayest, enter into thy closet, and when thou hast shut thy door, pray to thy Father which is in secret; and thy Father which seeth in secret shall reward thee openly.\n Mat 6:7 But when ye pray, use not vain repetitions, as the heathen [do]: for they think that they shall be heard for their much speaking.\n Mat 6:8 Be not ye therefore like unto them: for your Father knoweth what things ye have need of, before ye ask him. \n \n \n \nI already said I agree with the article. I took issue with what Colbert did.\n\n It's funny how you do that.\n You say you are for something, but then when somebody acts towards that goal, you criticize it.\n You say you understand the problem of bible illiteracy (which from your opening statement is obviously false), but then you turn around and complain when people expose bible illiteracy.\n \n \n \nAnd that speaks to the issue of HIM. Not the merits of the issue.\n\n OMG!\n HIS BIBLE ILLITERACY IS the issue.\n How can you not get that?\n \n Stephen Colbert IS NOT the issue here.\n This is a thread about bible illiteracy in the religion thread.\n Not about Stephen Colbert in the Entertainment section.\n \n You are trying to obfuscate the issue.\n \n \n \nFoundit, I wish I had a dollar for every time you made a comment on an aside part of an issue rather than sticking a single narrow angle a thread involves.\n\n I've already explained this to you dozens of times.\n I STICK TO THE TOPIC at hand.\n Any \"comment on an aside part\" are SIDE comments.\n Not attempts to derail the topic, concentrating exclusively on non-topical minutia to the extent of ignoring the original topic.\n \n \n \nIf you don't want to talk about Colbert, then don't talk about him.\n\n And if you don't want to talk about you, then don't talk about yourself. emoticon_rolleyes\n < end sarcasm <\n Sad part is, you won't be able to recognize the inherent fallacy in your approach which I just pointed out ...\n \n \n \nNo, I'm not. And you're intentionally being disingenuous to make such a claim.\n\n I speak of past experience, although you'll never admit it.\n You have repeatedly shown a problem with understanding and appreciating the significance of hypocrisy.\n It's not disingenuous to observe something you repeatedly do...\n \n \n \nOf course you never notice hypocritical things you do yourself ...\n\n Show it (quote it), and we'll talk.\n Invariably, you make some flawed claim of an observation, and then refuse to admit your observation is fallacious.\n It's why I keep demanding you quote me when you make such claims. You have a serious problem with accurately relaying the position of others, almost regardless of how many times they are explained to you...\n \n \n \nSee, I don't take glee in watching people get publicly embarrassed.\n\n You are improperly categorizing the emotion of others in watching the show.\n What you just did is like assuming Limbaugh enjoys picking on the poor and downtrodden.\n \n \n \nHow could you actually enjoy watching the way Stewart treated Jim Cramer, for instance???\n\n It's amazing how you repeatedly try to paint things into your own passive-aggressive paradigm, to ignore the real significance of what happens.\n Stewart talked to Jim Cramer about a variety of elements of WHAT MADE this financial crisis. Elements Jim Cramer himself was actually repeating.\n \n It was good to see Stewart give Jim Cramer an opportunity to talk about the situation and discuss Stewart's observations.\n \n But for some inane reason, you want to fixate on Cramer being \"embarrassed\"???\n \n A lot of interesting things were said in that interview, and you ignore them all in favor of passive-aggressive attacks.\n \n \n \nI think sometimes people put WAAAAAY too much stock in the whole \"exposing hypocrisy\" as a way to embarrass people and make them look bad.\n\n That's part of your problem.\n You think the intent is \"to embarrass people and make them look bad\".\n That IS NOT the intent.\n \n If you think so, you are REALLY missing the point.\n \n \n \nSometimes people do it to where they loose track of actually trying to deal with the merits of the issues at hand, like Colbert did in example you provided earlier.\n\n I have already shown how Colbert was EXPLICITLY dealing with the merits of the issue at hand.\n What is more fundamental to showing a fallacy of the belief than demonstrating how THE PROPONENTS THEMSELVES don't take their belief seriously???\n \n What you don't seem to grasp is that putting that monument up MEANS NOTHING to actually getting somebody to understand and appreciate what the ten commandments are.\n \n But you go straight for taking offense and passive-aggressive attacks. emoticon_emb\n \n \n \nEveryone is 'hypocritical' at some point in their lives, Foundit. Including you. Me pointing this out to you is not \"being comfortable with hypocrisy\" as you disingenuously claim.\n\n BLOWI.\n I never justified your \"being comfortable with hypocrisy\" on what you just said.\n \n \n \nNo one here has claimed he wasn't a Christian or didn't know the commandments.\n\n CLAFCLO.\n I never claimed they did.\n You're using a false pretense to avoid the point...\n \n \n \nIt still doesn't speak to the merits of the issue to show that someone ELSE doesn't know them.\n\n And WHAT WOULD be the more relevant issue here Jyoshu???\n KNOWING the ten commandments?\n Or posting a graven image monument of the ten commandments?\n \n Which is more important?\n People like you routinely miss the big picture...", 
   {}, 
   358307, 
   null, 
   1245718920.0
  ], 
  [
   358363, 
   null, 
   "jyoshu", 
   "Let's clear something up right now ....\n \n exposing hypocrisy does NOT deal with the MERITS of a constitutional church and state issue. It does nothing--NADA--to determine if a given set of regulations should adorn courthouse walls (a separation of Church and State issue) to show anyone is a \"hypocrite\" or embarass them. Making the exposing of hypocrisy a goal isn't dealing with church and state, or the constitution. It does nothing more than showing a PERSON'S view, or inconsistencies on a given view. No, it doesn't speak to the issue. The ten commandments on courthouse walls is a legal, constitutional issue, INDEPENDENT of anyone's hypocrisy.", 
   {}, 
   358335, 
   null, 
   1245731580.0
  ], 
  [
   358364, 
   null, 
   "foundit66", 
   "Let's clear something up right now ....\n exposing hypocrisy does NOT deal with the MERITS of a constitutional church and state issue.\n\n emoticon_cool\n I never said it did.\n Quite frankly, I think it goes deeper than that, which is what I tried to explain to you REPEATEDLY.\n \n If John insists that there should be a 30 MPH zone in his neighborhood, but routinely rips through the area at 50 MPH, he is demonstrating a lack of seriousness for his own idea.\n Likewise, when this politician started talking about the importance of the 10 commandments, he is showing himself full of hot air when he shows how little regard he ACTUALLY has for them, in not knowing what they actually are.\n \n Quite frankly, I'm amazed you have such little regard on the issue. Considering how often you try to persuade gays that Democrats are just doing lip service for gay rights...\n ... I would think YOU YOURSELF would welcome somebody exposing a politician giving lip service for Christianity and the ten commandments. emoticon_frazzled\n \n I don't know if you saw the whole interview. One aspect that boggled my mind is when the CONGRESSMAN HIMSELF asks \n Congressman: \"Where better place could you have something like that than in a judicial building or in a court house?\"\n Colbert: \"That is a good question. Can you think of any better building to put the 10 commandments in than a public building?\"\n Congressman: \"No\"\n \n I have made a similar argument in the past, regarding the question of why Christians insist on placing these eye-sore monuments on GOVERNMENT property, instead of on their own religious ground...\n \n \n \nIt does nothing--NADA--to determine if a given set of regulations should adorn courthouse walls (a separation of Church and State issue) to show anyone is a \"hypocrite\" ...\n\n Jyoshu?\n Do yourself a favor and LOOK AT THE HEADLINE OF THIS THREAD.\n It is about BIBLE ILLITERACY.\n Not \"separation of church and state\".\n emoticon_frazzled\n \n If you want to discuss the issue of separation of church and state ON ANOTHER THREAD, let me know.\n I'm more than game. We'll be talking about the same subjects we have in the past, like the Lemon Test and other items.\n You should know by now that I have no problem with such a discussion, WHERE TOPICAL...\n \n But this thread is about BIBLE LITERACY, and quite frankly you have shown a cavalier disregard for the issue, down-playing SIMPLE ACTS of bible literacy as \"recite from memory every item it entails\".\n Quite frankly, you have obfuscated and down-played this issue (by analogy) by trying to confuse capability to read \"Run Spot Run\" with the capability to recite Shakespeare...\n \n Your bible has a lot to say about false pretense amongst Christianity, but you seem more concerned with making up emotions for the people who point it out...", 
   {}, 
   358363, 
   null, 
   1245733140.0
  ], 
  [
   358415, 
   null, 
   "simone", 
   "Let's look at the actual items named, okay???\n * Name ANY ONE Gospel book.\n\n I know this stuff, I don't need to refer to a bible: Matthew, Mark, Luke and John.\n \n* Name the first book of the bible.\n\n Genesis\n \n* What city was Jesus born in?\n\n Bethlehem\n \n* \"Road to Damascus\" is what?\n\n You may have me here, but I believe it refers to the spiritual experience of Paul as he was \"on the road to Damascus.\"\n \n* Is Moses one of Jesus's 12 apostles or an Egyptian Pharaoh or an angel (or none of the above)?\n\n None of the above. I don't believe he was one of the prophets, either, but I could be wrong. He figured in a number of Biblical stories, Old Testament.\n \n* Were Sodom and Gomorrah married?\n\n Biblical cities that figured in a tale of homosexual desires, incest, turning people into pillars of salt and so forth.\n \n* Was Joan of Arc Noah's wife?\n\n Nope. Centuries and nations apart.\n \n* Name at least five of the ten commandments?\n\n I might fail here:\n \n I am the Lord thy God. Thou shalt have no other gods before me.\n \n Do not bear false witness.\n \n Thou shalt not kill.\n \n Thou shalt not steal.\n \n Thou shalt not commit adultery, or words to that effect.\n \n I believe there also prohibitions against covetousness, thou shalt not covet thy neighbor's XXX, which made me giggle silently in Sunday school class.\n \n Simone, the atheist.", 
   {}, 
   358364, 
   null, 
   1245785460.0
  ], 
  [
   358417, 
   null, 
   "jyoshu", 
   "Jyoshu?\n Do yourself a favor and LOOK AT THE HEADLINE OF THIS THREAD.\n It is about BIBLE ILLITERACY.\n Not \"separation of church and state\".\n emoticon_frazzled\n\n \n So basically, you just wanted to show some people are illiterate about the Bible? That's it?? emoticon_frazzled I guess I gave you the benefit of the doubt too much that you were actually trying to talk about something that MATTERS. The issue Westmoreland was fighting for is the commandments on courthouse walls. That's a church and state issue. COLBERT made it an issue about Westmoreland. The issue of church and state exists INDEPENTLY whether or not some people know their Bible or not. That DOESN'T MATTER in terms of the merits of the issue. It's pointless.", 
   {}, 
   358364, 
   null, 
   1245786060.0
  ], 
  [
   358438, 
   null, 
   "trebor", 
   "So basically, you just wanted to show some people are illiterate about the Bible? That's it?? emoticon_frazzled I guess I gave you the benefit of the doubt too much that you were actually trying to talk about something that MATTERS. The issue Westmoreland was fighting for is the commandments on courthouse walls. That's a church and state issue. COLBERT made it an issue about Westmoreland. The issue of church and state exists INDEPENTLY whether or not some people know their Bible or not. That DOESN'T MATTER in terms of the merits of the issue. It's pointless.\n\n \n \n Close, but no cigar. What he is basically pointing out that many of the people that push the importance of the bible the most in public life often are the ones that are the most ignorant of it.", 
   {}, 
   358417, 
   null, 
   1245796560.0
  ], 
  [
   358444, 
   null, 
   "foundit66", 
   "I know this stuff\n .....\n Simone, the atheist.\n\n As compared to Jyoshu the Christian, who alleges these questions are \"...being able to recite from memory every item it entails\"\n And jyoshu refused to state how many of them he got right/wrong... emoticon_cool\n \n \n \nSo basically, you just wanted to show some people are illiterate about the Bible? That's it??\n\n No.\n Basically, I want to discuss the topic of the thread.\n It appears basically, you DO NOT WANT to discuss the topic of the thread.\n \n \n \n...actually trying to talk about something that MATTERS.\n\n Bible literacy doesn't matter??? emoticon_frazzled\n Wow dude.\n I guess we know how seriously you take the book.\n \n \n \nThe issue Westmoreland was fighting for is the commandments on courthouse walls. That's a church and state issue.\n\n That's part of the issue.\n \n Tell you what.\n I'm bored of your tricks here.\n You know (although I doubt you'll admit it) that I am more than happy to discuss separation of church and state. We've done it in the past.\n I'm starting a new thread here on that issue.\n If you are serious about discussing that, we can talk about it there.\n If you're just interested in obfuscating this issue, I guess you can demonstrate that as your true motive if you like...\n http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state.html#post358442\n \n \n \nThat DOESN'T MATTER in terms of the merits of the issue.\n\n I have already shown HOW IT DOES affect the merits of the issue.\n You have routinely refused to address how it DOES affect the merits of the issue.\n As I have already stated...\n What you don't seem to want to admit is that this guy was touting the importance of the Ten Commandments, insisting that they should be allowed as monuments in government buildings.\n For something this guy insisted was so important, he was pretty clueless as to what they entailed...\n \n And that is the point of this article in the first place.\n Too many Christians long on demanding others comply, but precious little knowledge about some of the more basic ideals of their bible...", 
   {}, 
   358415, 
   null, 
   1245797940.0
  ], 
  [
   358445, 
   null, 
   "foundit66", 
   "Close, but no cigar. What he is basically pointing out that many of the people that push the importance of the bible the most in public life often are the ones that are the most ignorant of it.\n\n emoticon_xagree\n \n I think Jyoshu gets that too.\n He just doesn't want to address it...", 
   {}, 
   358438, 
   null, 
   1245798060.0
  ], 
  [
   358451, 
   null, 
   "jyoshu", 
   "Close, but no cigar. What he is basically pointing out that many of the people that push the importance of the bible the most in public life often are the ones that are the most ignorant of it.\n\n \n Oh. I guess I assumed he would want to say something RELEVANT to the issue on the table, constitutionally. Figures. emoticon_xangel", 
   {}, 
   358438, 
   null, 
   1245800700.0
  ], 
  [
   358455, 
   null, 
   "foundit66", 
   "Oh. I guess I assumed he would want to say something RELEVANT to the issue on the table, constitutionally. Figures. emoticon_xangel\n\n You know I have no problem with that discussion.\n I DO have a problem with people obfuscating and ignoring the real point of a thread.\n \n The point of this thread is not \"constitutionality\".\n It's bible literacy. Something you evidently don't have much concern over... emoticon_emb\n \n What would Jesus say about somebody more concerned with SHOWING empty displays of public \"Christianity\", as opposed to actually BEING Christian?\n Oh yeah. I think I already quoted Jesus on the matter, and you ignored his words...\n \n Jyoshu ignoring the words of Jesus...\n Why doesn't that surprise me... emoticon_ic", 
   {}, 
   358451, 
   null, 
   1245801300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bible Illiteracy", 
  "url": "http://www.4forums.com/political/religion-debates/12901-bible-illiteracy.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12901, 
  "discussion_files": [
   [
    "13853.html", 
    "http://www.4forums.com/political/religion-debates/12901-bible-illiteracy-print.html"
   ], 
   [
    "13854.html", 
    "http://www.4forums.com/political/religion-debates/12901-bible-illiteracy-2-print.html"
   ]
  ], 
  "identifier": 12901
 }
]