[
 [
  [
   358403, 
   null, 
   "NATO 556", 
   "SoCal Churches go concealed carry.\n \n The genius of concealed carry of handguns is that would-be murders remain uncertain as to who is armed and who isn't. This is true for everyone interested in being as safe as they can be from future violence, because it comes to the realization of specific unalterable realities: you're on your own.\n \n This week some Southern California Church Leaders came to that very same conclusion, and took up a position advocating not only a very discreet security presence of professionals, but also took the advice of their consultants and adopted the policy of advocating concealed carry of handguns among the congregation.\n \n Realities are the core of solving the problem of church violence, and having the stomach to face those realities and to meet them. For too long, employers, churches, schools and others have said many different ways that they are sad to see things have to come to this, but this is a trap which serves not the people, but the killers. Fifteen Southern California church leaders refused to fall into that trap, and they sought out expert advice. It involves concealed carry of handguns in church, and they took it. Yes, concealed carry of handguns by the members who come to worship.\n \n This is huge. Especially in California.\n \n The Southern California churches' consultant is Interfaith Intruder Response, a security firm for churches to respect their worship and sanctuary deeply while elaborating specific realities the church needs to accept in these times where threat assessment is a new function. Some of those realities involve not only understanding how families fall apart or how political sentiment can act out, but how to meet it with action at the most critical moments, and some of that action may involve lethal force of their own.\n \n Other churches around the nation have their own story to tell on the subject of not only how they have become pro-active and prepared, as in Bring-Your-Gun-To-Church Day, but also real experience in stopping murderous assailants the moment the assault begins. It works. So does announcing it publicly. Very shrewd.\n \n Some of the most helpful components of the one-day course from Interfaith Intruder Response is how the church is urged to accept facts the entire nation must come to accept, such as the moments between a violent attack and the arrival of police not as incapacitating, but as opportunity to stop them. Cases of mass murder of congregants taught to offer no resistance didn't cut it, and instructions on how to hide or even to urge children to toss books at an active shooter do about as much and are so very counterintuitive. Yes, some have taught the kids to throw books.\n \n The answer is not to arm faculty who maybe present or not at the critical moment, or to have uniformed guards who are so easily recognized, but to do as these churches are now announcing: discreetly invite the armed citizen to join you.\n \n Killers can kill in moments before a request for aid can even be processed, much less dispatched and on-scene. Not all killers use guns. many have a knife, and a knife does not run out of ammunition. The law in nearly all states is on the side of the target when it comes to life-threatening danger and the use of lethal force in reasonable response. Individuals may use lethal force when in reasonable apprehension of grave danger. Individuals may come to the aid of another. For these churches, perhaps the authority and law were the easy part. The hard part was more likely understanding where their religious authority would lie in even consulting on the subject of violence. Actually, many liberty purists have commented on Christian authority in the righteous use of force. Some of that will be heard in the Gun Rights Policy Conference this September. [Please go to KeepAndbearArms.com for further details on this very important subject.]\n \n But violence is a political football more than a foe. This is because violence can be aggressive or it can resist. I differentiate that abuse and aggression are one side and a righteous response of resistance with force is the other side, and that it is simply not true that all violence is bad. I see that more and more are coming to that same conclusion.\n \n Let me emphasize my support and praise for any church, or school, or workplace who elects to go concealed carry on its premises: It took a lot of courage and faith to make it policy that armed members with concealed carry permits may attend church armed.\n \n It protects the innocent.", 
   {
    "post_info": {
     "post_title": "California churches favor concealed carry"
    }
   }, 
   null, 
   null, 
   1245778740.0
  ], 
  [
   358457, 
   null, 
   "Penfold", 
   "Other than for propaganda purposes, why do you and your playmates post this stuff? Who is it aimed at? Do you really expect to be changing anyones mind, or is it preaching to the converted?", 
   {}, 
   358403, 
   null, 
   1245802080.0
  ], 
  [
   358501, 
   null, 
   "Tither", 
   "Other than for propaganda purposes, why do you and your playmates post this stuff? Who is it aimed at? Do you really expect to be changing anyones mind, or is it preaching to the converted?\n\n Actually I did not know what Nato had posted. I found it quite interesting. I know that when I and my wife attended church, I thought about that possibility. Someone who Hates us just because we go to church, and I thought about bringing the problem up. \n \n I quickly dismissed the probability of something like this happening because right across the street, is the Fairview Police Station. However, this is exactly where things like this do happen. In places where one is not allowed to carry a concealed firearm.", 
   {}, 
   358457, 
   null, 
   1245852480.0
  ], 
  [
   358506, 
   null, 
   "Penfold", 
   "The latter, then.", 
   {}, 
   358501, 
   null, 
   1245856200.0
  ], 
  [
   358511, 
   null, 
   "Tither", 
   "The latter, then.\n\n \n Possibly. We I don't think we need only to cater to your interests. Kind of like this one.\n \n   Shooting a Hole in the Outlook for Gun Stocks \n While November background checks were 42% above the year-earlier level, last month&#8217;s were up just 15%. \n\n Now prices for ammo, and other supplies can come back down! emoticon_smile", 
   {}, 
   358506, 
   null, 
   1245864840.0
  ], 
  [
   358513, 
   null, 
   "Penfold", 
   "Apart from the lie in the title claim, (it was not ALL of California churches) Why should any rational being consider the judgement of sheeple who have demonstrably chosen to believe something patently untrue, anything but fatally flawed?", 
   {}, 
   358511, 
   null, 
   1245866040.0
  ], 
  [
   358519, 
   null, 
   "NATO 556", 
   "Apart from the lie in the title claim, (it was not ALL of California churches)\n\n \n I never said it was all of the churches in California. I never even tried to claim it was all of them.\n \n \nWhy should any rational being consider the judgement of sheeple who have demonstrably chosen to believe something patently untrue, anything but fatally flawed?\n\n \n Funny, that's the same kind of judgment we use when electing the PotUS and the House and Senate for the United States. Are you saying the election of Obama was fatally flawed?", 
   {}, 
   358513, 
   null, 
   1245870240.0
  ], 
  [
   358520, 
   null, 
   "NATO 556", 
   "Other than for propaganda purposes, why do you and your playmates post this stuff? Who is it aimed at? Do you really expect to be changing anyones mind, or is it preaching to the converted?\n\n \n Other than for propaganda purposes, why do you and your playmates harp on isolated and extremely rare instances where violence is the outcome? Who is it aimed at? Do you really expect to be changing anyone's mind, or is it preaching to the brainwashed and foolish?", 
   {}, 
   358457, 
   null, 
   1245870300.0
  ], 
  [
   358543, 
   null, 
   "zsu2357", 
   "Other than for propaganda purposes, why do you and your playmates post this stuff? Who is it aimed at? Do you really expect to be changing anyones mind, or is it preaching to the converted?\n\n \n \n Apparently its aimed at you since you bit on it.But I agree with NATO!here's to an unlikely ally!WELL DONE!!!!!", 
   {}, 
   358457, 
   null, 
   1245882060.0
  ], 
  [
   358564, 
   null, 
   "Penfold", 
   "I never said it was all of the churches in California. I never even tried to claim it was all of them. ...... \n\n \n \n What was the thread title again? \"SOUTHERN California churches favor concealed carry.\" ? No. \"SOME California churches.....\"? No. A FEW California churches\" ? No. \"HARDLY ANY \" ? No. None of those.\n \n Without a qualifier, the thread title suggests that all California churches support the change.\n \n It is only in the body of the text (link please) that we find that not only is it not all the churches, it is not any of the churches themselves, but only \"Some church leaders\"!", 
   {}, 
   358519, 
   null, 
   1245894540.0
  ], 
  [
   358570, 
   null, 
   "OldSarge", 
   "This week some Southern California Church Leaders came to that very same conclusion, and took up a position advocating not only a very discreet security presence of professionals, but also took the advice of their consultants and adopted the policy of advocating concealed carry of handguns among the congregation.\n \n \n second paragraph in, not to mention if you follow the link its the same title in news article.", 
   {}, 
   358564, 
   null, 
   1245897780.0
  ], 
  [
   358571, 
   null, 
   "NATO 556", 
   "What was the thread title again? \"SOUTHERN California churches favor concealed carry.\" ? No. \"SOME California churches.....\"? No. A FEW California churches\" ? No. \"HARDLY ANY \" ? No. None of those.\n\n \n Blah, blah, blah.\n \n You obviously can't come up with a good counterargument to the article itself and the fact that it's relating the truth, and the fact that more and more people are waking up and addressing real world facts. So what do you do? You go after the forum title and act as if it were improper and misleading and inaccurate.\n \n Your fellow freedom hater, Brady, posted a while back that a proposed law would let the children living in DC carry .50 caliber rifles and fully automatic machine guns, up and down the district streets, and there wouldn't be a single thing that the police could do about it because they'd be stripped of any and all powers that they had for fighting crime.\n \n I highly doubt my efforts to maintain a short, straight to the point title for my post is the same thing.", 
   {}, 
   358564, 
   null, 
   1245898980.0
  ], 
  [
   358576, 
   null, 
   "Penfold", 
   "The title is a lie. Wriggle away.", 
   {}, 
   358571, 
   null, 
   1245900060.0
  ], 
  [
   358578, 
   null, 
   "NATO 556", 
   "The title is a lie. Wriggle away.\n\n \n The article is plainly titled \"SoCal Churches go concealed carry\". The thread title here is \"California churches favor concealed carry\". Both titles say the exact same thing; that churches in the state of California are open to the idea of letting their members legally carry concealed firearms inside the church buildings.\n \n Spin it all you want, I didn't lie in the least. So either come back with some hard material to argue against the article, or leave and stop the trolling. Smacking you down like a mosquito is getting to be very boring.", 
   {}, 
   358576, 
   null, 
   1245900360.0
  ], 
  [
   358727, 
   null, 
   "NATO 556", 
   "It seems the movement for guns at church is now in Kentucky as well.\n \n The New York Times < Log In\n \n LOUISVILLE, Ky. - Ken Pagano, the pastor of the New Bethel Church here, is passionate about gun rights. He shoots regularly at the local firing range, and his sermon two weeks ago was on \"God, Guns, Gospel and Geometry.\" And on Saturday night, he is inviting his congregation of 150 and others to wear or carry their firearms into the sanctuary to \"celebrate our rights as Americans!\" as a promotional flier for the \"open carry celebration\" puts it.\n \n \"God and guns were part of the foundation of this country,\" Mr. Pagano, 49, said Wednesday in the small brick Assembly of God church, where a large wooden cross hung over the altar and two American flags jutted from side walls. \"I don't see any contradiction in this. Not every Christian denomination is pacifist.\"\n \n The bring-your-gun-to-church day, which will include a $1 raffle of a handgun, firearms safety lessons and a picnic, is another sign that the gun culture in the United States is thriving despite, or perhaps because of, President Obama's election in November.\n \n Last year, the National Rifle Association ran a multimillion-dollar advertising campaign against Mr. Obama, stoking fears that he would be the most antigun president in history and that firearms would be confiscated. One worry was that a Democratic president and Congress would reinstitute the assault-weapons ban, which expired in 2004.\n \n But there is little support for the ban. Mr. Obama and his party have largely ignored gun-control issues, and the president even signed a measure that will allow firearms in national parks.\n \n Still, the fear remains that Mr. Obama, and his attorney general, Eric H. Holder Jr., will crack down on guns sooner or later. That - along with the faltering economy, which gun sellers say has spurred purchases for self-defense - has fueled a record surge in gun sales.\n \n \"Every president wants to be re-elected, and gun bans are pretty much a nonstarter for getting re-elected,\" said Win Underwood, owner of the Bluegrass Indoor Range here. \"What I suspect is going to happen is, Obama's going to cool his jets until he can get re-elected, and then he'll start building his legacy in these hot-button areas.\"\n \n When Mr. Obama was elected in November, federal instant background checks, the best indicator of gun sales, jumped 42 percent over the previous November. Every month since then, the number of checks has been higher than the year before, although the postelection surge may be tapering off, as all surges eventually do. While the number of checks in April increased 30 percent from the year before, the number of checks in May (1,023,102) was only 15 percent higher than in May 2008.\n \n The National Rifle Association says its membership is up 30 percent since November. And several states have recently passed laws allowing gun owners to carry firearms in more places - bars, restaurants, cars and parks.\n \n \"We have a very active agenda in all 50 states,\" said Chris W. Cox, legislative director of the N.R.A., widely considered the country's most powerful lobby. \"We have right-to-carry laws in over 40 states; 20 years ago, it was in just six.\"\n \n Of the 40 states with right-to-carry laws, 20 allow guns in churches.\n \n Public attitudes also seem to be turning more sympathetic to gun owners. In April, the Pew Research Center found for the first time that almost as many people said it was more important to protect the rights of gun owners (45 percent) than to control gun ownership (49 percent). Just a year ago, Pew said, 58 percent said gun control was more important than the rights of gun owners (37 percent).\n \n Gun-control advocates say they feel increasingly ineffective, especially after a recent spate of high-profile shootings, including last month's murder, inside a church in Kansas, of a doctor who performed late-term abortions.\n \n \"We've definitely been marginalized,\" said Pam Gersh, a public relations consultant here who helped organize a rally in Louisville in 2000, to coincide with the Million Mom March against guns in Washington.\n \n \"The Brady Campaign and other similar organizations who advocate sensible gun responsibility laws don't have the money and the political power - not even close,\" she said. \"This pastor is obviously crossing a line here and saying 'I can even take my guns to church, and there is nothing you can do about it.' \"\n \n Ms. Gersh said she was not aware that a group of local churches and peace activists were staging a counterpicnic - called \"Bring your peaceful heart, leave your gun at home\" - at the same time as Mr. Pagano's event.\n \n But news media attention - some from overseas - has focused on Mr. Pagano, who has been planning the event for a year, in celebration of the Fourth of July. Cameras will not be allowed in the church, he said, to protect the congregation's privacy.\n \n The celebration will feature lessons in responsible gun ownership, Mr. Pagano said. Sheriff's deputies will be at the doors to check that openly carried firearms are unloaded, but they will not check for concealed weapons.\n \n \"That's the whole point of concealed,\" Mr. Pagano said, adding that he was not worried because such owners require training.\n \n Mr. Pagano said the church's insurance company, which he would not identify, had canceled the church's policy for the day on Saturday and told him that it would cancel the policy for good at the end of the year. If he cannot find insurance for Saturday, people will not be allowed in openly carrying their guns.\n \n Arkansas and Georgia recently rejected efforts to allow people to carry concealed weapons in church. Watching the debate in Arkansas was John Phillips, pastor of the Central Church of Christ in Little Rock. In 1986, Mr. Phillips was preaching in a different church there when a gunman shot him and a parishioner. Both survived, but Mr. Phillips, 51, still has a bullet lodged in his spine.\n \n In a telephone interview, he said he found the idea of \"packing in the pew\" abhorrent.\n \n \"There is a movement afoot across the nation, with the gun lobby pushing the envelope, trying to allow concealed weapons to be carried in places where they used to be prohibited - churches, schools, bars,\" Mr. Phillips said.\n \n \"I don't understand how any minister who is familiar with the teachings of the Bible can do this,\" he added. \"Jesus didn't say, 'Go ahead, make my day.' \"\n \n Mr. Pagano takes such comments as a challenge to his faith and says they make him more determined.\n \n \"When someone from within the church tells me that being a Christian and having firearms are contradictions, that they're incompatible with the Gospel - baloney,\" he said. \"As soon as you start saying that it's not something that Christians do, well, guns are just the foil. The issue now is the Gospel. So in a sense, it does become a crusade. Now the Gospel is at stake.\"", 
   {
    "unicode_changes_made": true
   }, 
   358403, 
   null, 
   1246038540.0
  ], 
  [
   358734, 
   null, 
   "sinjin", 
   "What Would Jesus Carry?emoticon_xclown", 
   {}, 
   358727, 
   null, 
   1246043220.0
  ], 
  [
   358738, 
   null, 
   "NATO 556", 
   "What Would Jesus Carry?emoticon_xclown\n\n \n A lot of people say that Jesus is the son of God. Others say that Jesus was actually God Himself, who came to Earth. Whichever way is the real case, Jesus didn't need to carry anything, because God had the ability to wipe two cities off the face of the map by raining down fire and brimstone.\n \n God has plenty of firepower at His disposal. And He never said \"lay down and die because it's wrong to protect yourselves from harm.\"", 
   {}, 
   358734, 
   null, 
   1246046340.0
  ], 
  [
   358747, 
   null, 
   "Penfold", 
   "He was big on \"Turn the other cheek\", the pacifist non-gunner.", 
   {}, 
   358738, 
   null, 
   1246050660.0
  ], 
  [
   358760, 
   null, 
   "NATO 556", 
   "He was big on \"Turn the other cheek\", the pacifist non-gunner.\n\n \n He also said \"he that has no sword, let him sell his garment and buy one.\" Back in biblical times, swords were the equivalents of guns. So obviously God wasn't telling his people to be unarmed, unable to protect themselves, unable to do anything but pray and die, etc.", 
   {}, 
   358747, 
   null, 
   1246057260.0
  ], 
  [
   358771, 
   null, 
   "Penfold", 
   "He also said \"he that has no sword, let him sell his garment and buy one.\" Back in biblical times, swords were the equivalents of guns. So obviously God wasn't telling his people to be unarmed, unable to protect themselves, unable to do anything but pray and die, etc.\n\n \n O ye of little faith.\n \n \" Christ was clearly talking about literal weapons. But He was not encouraging His disciples to defend themselves through violence, which would have contradicted His previous instruction, in Matthew 5:38-39, against harming others.\n \n In Luke 9:56, He had stated, \"For the Son of man is not come to destroy men's lives, but to save them.\" In Matthew 5:44, He had instructed, \"...Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.\"\n In Luke 22:37, Christ showed the meaning of His statement: \"For I say unto you, that this that is written must yet be accomplished in Me, And He was reckoned among the transgressors: for the things concerning Me have an end [they will be fulfilled].\"\n Why did Christ instruct His disciples to get swords? To assure the fulfillment of the prophecy in Isaiah 53:12 (which He had inspired and now quoted). He was to be considered a lawbreaker (\"transgressor\"). He was not endorsing the use of weapons for the purpose of harming other people (whether in self-defense or otherwise). In verse 51 of Luke 22, we see that when Peter drew a sword and strike the High Priest's servant, Christ chastised him for his actions. He then healed the man by re-attaching his ear, which Peter had cut off. \"", 
   {
    "unicode_changes_made": true
   }, 
   358760, 
   null, 
   1246062600.0
  ], 
  [
   358789, 
   null, 
   "zsu2357", 
   "O ye of little faith.\n \n \" Christ was clearly talking about literal weapons. But He was not encouraging His disciples to defend themselves through violence, which would have contradicted His previous instruction, in Matthew 5:38-39, against harming others.\n \n In Luke 9:56, He had stated, \"For the Son of man is not come to destroy men's lives, but to save them.\" In Matthew 5:44, He had instructed, \"...Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.\"\n In Luke 22:37, Christ showed the meaning of His statement: \"For I say unto you, that this that is written must yet be accomplished in Me, And He was reckoned among the transgressors: for the things concerning Me have an end [they will be fulfilled].\"\n Why did Christ instruct His disciples to get swords? To assure the fulfillment of the prophecy in Isaiah 53:12 (which He had inspired and now quoted). He was to be considered a lawbreaker (\"transgressor\"). He was not endorsing the use of weapons for the purpose of harming other people (whether in self-defense or otherwise). In verse 51 of Luke 22, we see that when Peter drew a sword and strike the High Priest's servant, Christ chastised him for his actions. He then healed the man by re-attaching his ear, which Peter had cut off. \"\n\n \n \n Only problem Comrade is that back in the day ,that turn the other cheek stuff \n and love your enemies business and pray for them don't cut it when they are out to do you in.So personally since it is doubtful I will rise from the dead;I'll\n put my faith in Luger, thank you very much.", 
   {
    "unicode_changes_made": true
   }, 
   358771, 
   null, 
   1246074480.0
  ], 
  [
   358855, 
   null, 
   "OldSarge", 
   "Render unto Caeser...", 
   {}, 
   358789, 
   null, 
   1246147800.0
  ], 
  [
   358899, 
   null, 
   "Penfold", 
   "Render unto Caeser...\n\n \n Please explain what you think that means, and how it is relevant to the present debate?", 
   {}, 
   358855, 
   null, 
   1246187880.0
  ], 
  [
   358900, 
   null, 
   "OldSarge", 
   "Please explain what you think that means, and how it is relevant to the present debate?\n\n \n It should be obvious. ", 
   {}, 
   358899, 
   null, 
   1246192320.0
  ], 
  [
   358901, 
   null, 
   "Penfold", 
   "Only obvious to a certain limited mindset.", 
   {}, 
   358900, 
   null, 
   1246197300.0
  ], 
  [
   358926, 
   null, 
   "OldSarge", 
   "Penfold;358901]Only not obvious to a certain limited mindset.", 
   {}, 
   358901, 
   null, 
   1246209300.0
  ], 
  [
   358933, 
   null, 
   "Penfold", 
   "It should be obvious. \n\n \n We'll try again, since it obviously isn't. We have no way of knowing the inner workings of your thought processes without your informing us. What do you find significant in what you said, \"Render unto Caeser[sic]\" and how does that relate to the topic in hand?", 
   {}, 
   358900, 
   null, 
   1246212300.0
  ], 
  [
   358938, 
   null, 
   "OldSarge", 
   "\nWe'll try again, since it obviously isn't. We have no way of knowing the inner workings of your thought processes without your informing us. What do you find significant in what you said, \"Render unto Caeser[sic]\" and how does that relate to the topic in hand?\n\n \n Oh but it is to even the most unenlightened. Scripture was brought into the thread. Do you follow now? You make a series of quotes of it. I merely took another admonition from scripture that if you were truely a student of it you should recognize. Render unto Caeser the things which belong to Caeser... emoticon_xhoho", 
   {}, 
   358933, 
   null, 
   1246214160.0
  ], 
  [
   358941, 
   null, 
   "Penfold", 
   "\n \n Oh but it is to even the most unenlightened. Scripture was brought into the thread. Do you follow now? You make a series of quotes of it. I merely took another admonition from scripture that if you were truely a student of it you should recognize. Render unto Caeser the things which belong to Caeser... emoticon_xhoho\n\n \n \n I am well aware of the full Caesar quotation, its proper spelling, and the backstory. An admonition to obey the civil law, that spiritual demands might supersede but not abolish earthly ones. Now to the second part. How do you relate that to the context of the discussion, since it supports my position?", 
   {}, 
   358938, 
   null, 
   1246218480.0
  ], 
  [
   358955, 
   null, 
   "Tither", 
   "Jesus' Disciples were Armed! \n \n Want proof? One of them, we think Peter, cut off the ear of the high priest's servant, with a sword in the Garden, when they came to arrest him! So your, he is not talking literally about selling your cloak to buy a sword is incorrect!\n \n Also he said, and was the living example, that, No greater love has any man then he lay down his life for anther. I think protection!\n \n Look at all of the examples of wars sanctioned by God! There is a place and a time for necessary killing. For instance, if I were armed while some terrorist or a loon with a grudge came into a crowed and starting shooting, my duty as a christian is to save lives, by dispatching the perp!", 
   {}, 
   358941, 
   null, 
   1246225680.0
  ], 
  [
   358958, 
   null, 
   "Tither", 
   "What Would Jesus Carry?emoticon_xclown\n\n \n A two edged sword! Revelations!", 
   {}, 
   358734, 
   null, 
   1246226160.0
  ], 
  [
   359036, 
   null, 
   "OldSarge", 
   "I am well aware of the full Caesar quotation, its proper spelling, and the backstory. An admonition to obey the civil law, that spiritual demands might supersede but not abolish earthly ones. Now to the second part. How do you relate that to the context of the discussion, since it supports my position?\n\n \n Perhaps unknowingly you answered your own question. An admonition to obey the civil law, that spiritual demands might supersede but not abolish earthly ones.", 
   {}, 
   358941, 
   null, 
   1246286220.0
  ], 
  [
   359075, 
   null, 
   "Penfold", 
   "Perhaps unknowingly you answered your own question. An admonition to obey the civil law, that spiritual demands might supersede but not abolish earthly ones.\n\n \n You seem to imagine this proves some point or other. The statement was a masterclass in avoiding the issue, being just vague and meaningless enough to be interpreted to mean whatever the hearer thought it did.", 
   {}, 
   359036, 
   null, 
   1246318260.0
  ], 
  [
   359088, 
   null, 
   "OldSarge", 
   "You seem to imagine this proves some point or other. The statement was a masterclass in avoiding the issue, being just vague and meaningless enough to be interpreted to mean whatever the hearer thought it did.\n\n \n And you being the hearer it sure did. ", 
   {}, 
   359075, 
   null, 
   1246328820.0
  ], 
  [
   359108, 
   null, 
   "Doc Jones", 
   "You seem to imagine this proves some point or other. The statement was a masterclass in avoiding the issue, being just vague and meaningless enough to be interpreted to mean whatever the hearer thought it did.\n\n \n Unless you can defeat any fact and reasoning of the FF when they told the gov't NO or NOT 24 times in the Articles of Confederation and 22 times in the BOR you cannot possibly make a point in favor of your position by pretending that it does not exist and you and your co-harts can manage to make and re-write the Constitution.\n \n Bill of Rights Transcript\n \n Note: if you hold your pointer over the top of the line above Bill Of Rights, you can see the evidence links pop up in proof of their line of reasoning. You can check them out by clicking on the link.\n \n The BOR has it's own preamble: \nThe Preamble to The Bill of Rights\n \n Congress of the United States\n begun and held at the City of New-York, on\n Wednesday the fourth of March, one thousand seven hundred and eighty nine.\n \n THE Conventions of a number of the States, having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best ensure the beneficent ends of its institution.\n \n RESOLVED by the Senate and House of Representatives of the United States of America, in Congress assembled, two thirds of both Houses concurring, that the following Articles be proposed to the Legislatures of the several States, as amendments to the Constitution of the United States, all, or any of which Articles, when ratified by three fourths of the said Legislatures, to be valid to all intents and purposes, as part of the said Constitution; viz.\n \n ARTICLES in addition to, and Amendment of the Constitution of the United States of America, proposed by Congress, and ratified by the Legislatures of the several States, pursuant to the fifth Article of the original Constitution.\n\n \n This is all free information from the National Archives and Records Administration and the original documents are available for downloading and/or viewing.\n \n Don't you find it difficult to try to debate without evidence or facts? emoticon_cry\n \n You jump around posting buzz words and kiddie stuff no serious citizen would bother to read and I have refrained until I became ashamed of your lack of knowledge and childish attempts to get someone to agree with your utter disruption of any topic up for discussion. :(", 
   {
    "post_info": {
     "post_title": "Let us talk about avoidance"
    }
   }, 
   359075, 
   null, 
   1246371300.0
  ], 
  [
   359112, 
   null, 
   "Penfold", 
   "I have as much difficulty with debate as you do with introducing irrelevance. No problem.", 
   {}, 
   359108, 
   null, 
   1246374240.0
  ], 
  [
   359113, 
   null, 
   "Doc Jones", 
   "I have as much difficulty with debate as you do with introducing irrelevance. No problem.\n\n \n that the law and the Constitution is irrelevant thereby giving you an excuse to avoid and ignore the law and the history and cold hard facts that dispute your very existance?", 
   {
    "post_info": {
     "post_title": "So this is your confession"
    }
   }, 
   359112, 
   null, 
   1246374780.0
  ], 
  [
   359116, 
   null, 
   "OldSarge", 
   "that the law and the Constitution is irrelevant thereby giving you an excuse to avoid and ignore the law and the history and cold hard facts that dispute your very existance?\n\n \n  Other than insult I haven't seen much in the way of debate.", 
   {}, 
   359113, 
   null, 
   1246379880.0
  ], 
  [
   359121, 
   null, 
   "Penfold", 
   "Then you need to offer more.", 
   {}, 
   359116, 
   null, 
   1246381680.0
  ], 
  [
   359124, 
   null, 
   "OldSarge", 
   "Then you need to offer more.\n\n \n A defense for insults perhaps?", 
   {}, 
   359121, 
   null, 
   1246382100.0
  ], 
  [
   359139, 
   null, 
   "Doc Jones", 
   "A defense for insults perhaps?\n\n \n Sarge, there is enough reading and historical documents on that single page from the official NARA page to keep him busy all day. You can't help the mentally crippled if they don't make an effort to help themselves. I just bounce things off of him for the lurkers so they can get educated about why our rights exist and how to exercise them. Trolls are a waste of time but they are excellent tools for education of those who want to learn emoticon_xhoho", 
   {}, 
   359124, 
   null, 
   1246389420.0
  ], 
  [
   359150, 
   null, 
   "Penfold", 
   "that the law and the Constitution is irrelevant thereby giving you an excuse to avoid and ignore the law and the history and cold hard facts that dispute your very existance?\n\n \n I think, therefore I am. What on earth are you trying to say?", 
   {}, 
   359113, 
   null, 
   1246392960.0
  ], 
  [
   359151, 
   null, 
   "Penfold", 
   "The irony of supposed Christ-followers flouting his teachings on the supremacy of god's/his law while pandering to mere man's flawed ones sails on by your towering intellects. :)", 
   {}, 
   359150, 
   null, 
   1246393200.0
  ], 
  [
   359154, 
   null, 
   "NATO 556", 
   "What on earth are you trying to say?\n\n \n That you lose.\n \n Ky. Pastor Holds Guns-In-Church Service\n \n Some gun owners proudly wore their weapons into a Louisville, Ky., church Saturday. The \"Bring Your Gun to Church Day\" was an idea to celebrate guns and God.\n \n Brian Thomas, like others at the church was in compliance with Kentucky law as he wore his 1911 Springfield Operator on his belt -- openly. He brought his family to join about 125 other gun owners to celebrate their second amendment rights inside New Bethel Assembly of God Church.\n \n \"They go together ... you need to protect yourself and God would want you to protect yourself,\" said Thomas. \"Unfortunately in this day and time, a firearm is an efficient way to protect yourself.\"\n \n Cliff Meadows knows that first hand. In 1998, he shot and wounded a bank robber who had pointed a gun at him. Police found the shooting was justifiable under Kentucky self-defense and concealed carry laws. At the service he carried a Kimber .45.\n \n \"They want to keep outlawing guns or ammunition or make the process so we can't afford them,\" said Meadows. \"It's the illegal ones we got to worry about, not the responsible ones.\"\n \n Leaders at New Bethel Assembly of God Church thought a \"Bring Your Gun to Church Day\" might attract new people to the congregation. Those who brought their firearms had to keep them unloaded and in the holster. Police officers checked people at the door.\n \n Rev. Ken Pagano, pastor of the church, said the idea was \"creative thinking\" mixed with worries about new gun control laws under the Obama administration.\n \n \"We find that not unbiblical. What we're doing is not illegal,\" said Rev. Pagano. \"This is something the Commonwealth of Kentucky says we can do, and it's nothing unconstitutional.\"\n \n The church raffled off safety lessons, a concealed carry class and also a brand new handgun. The person who won the new handgun was a Jefferson county sheriff's deputy.\n \n During the service, Rev. Pagano described his church \"as the safest place in Louisville.\" And he asked \"why should we have to act like we have to apologize for this?\"", 
   {}, 
   359150, 
   null, 
   1246393980.0
  ], 
  [
   359156, 
   null, 
   "NATO 556", 
   "The irony of supposed Christ-followers flouting his teachings on the supremacy of god's/his law while pandering to mere man's flawed ones sails on by your towering intellects. :)\n\n \n Nowhere in the Bible did God tell his people to just lay down and die. There's always tales of an eye for an eye, how it was legal to put a rapist to death for his crimes, how entire cities that worshipped false idols were wiped off the face of the map and the people fed to the wild animals by those that followed God.\n \n There's no pacifism in the Bible. There's no room for your interpretation of \"God didn't want his people to be armed and able to defend themselves, he wanted them to die for him by not fighting back\".", 
   {}, 
   359151, 
   null, 
   1246394100.0
  ], 
  [
   359160, 
   null, 
   "Doc Jones", 
   "The irony of supposed Christ-followers flouting his teachings on the supremacy of god's/his law while pandering to mere man's flawed ones sails on by your towering intellects. :)\n\n \n Had you bothered to read the links, you would have found this Republic was founded on Judeo Christian ethics, the Supreme Court has the ten Commandments posted on the walls. The common law followed these Commandments and are still as valid today as they were when unveiled.\n \n Much thought and deliberation by the FF went into forbidding the government from any but the enumerated powers and said hands off especially these BOR! You must be content in jolly old England or wherever you are in such a paradise where man's law is supreme and inalienable rights do not exist?\n \n I choose to keep the rights that are inalienable that existed before man's law and are protected today although some like yourself would like to set themselves up as the arbiter over all things and excuse yourself by flaunting God's law. Recall Sodom? No court has ever reversed a ruling that provides people exercising their Second Amendment rights. The courts have reversed rulings that deny people their Second Amendment rights. Any excuse you can come up with has been discredited...yet you persist in trying emoticon_frazzled", 
   {}, 
   359151, 
   null, 
   1246395420.0
  ], 
  [
   359161, 
   null, 
   "OldSarge", 
   "Sarge, there is enough reading and historical documents on that single page from the official NARA page to keep him busy all day. You can't help the mentally crippled if they don't make an effort to help themselves. I just bounce things off of him for the lurkers so they can get educated about why our rights exist and how to exercise them. Trolls are a waste of time but they are excellent tools for education of those who want to learn emoticon_xhoho\n\n \n Leftists never bother reading any thing since they are always correct. Now the lurkers are are different story. Of course you realize that in the rights area, conservatives need not apply. That is why you get leftist students shouting down or otherwise preventing conservative speakers from exercising free speech done in the name of free speech. It's only for the left. Yes trolls are a waste of time. Especially the ones that are a legend in their own mind. ", 
   {}, 
   359139, 
   null, 
   1246395480.0
  ], 
  [
   359163, 
   null, 
   "Penfold", 
   "Nowhere in the Bible did God tell his people to just lay down and die. There's always tales of an eye for an eye, how it was legal to put a rapist to death for his crimes, how entire cities that worshipped false idols were wiped off the face of the map and the people fed to the wild animals by those that followed God.\n \n There's no pacifism in the Bible. There's no room for your interpretation of \"God didn't want his people to be armed and able to defend themselves, he wanted them to die for him by not fighting back\".\n\n \n Wrong again. Get someone to read this to you, since you appear unable to absorb the content, or to respond to it. Post 20 in this very thread.\n \n \" Christ was clearly talking about literal weapons. But He was not encouraging His disciples to defend themselves through violence, which would have contradicted His previous instruction, in Matthew 5:38-39, against harming others.\n \n In Luke 9:56, He had stated, \"For the Son of man is not come to destroy men's lives, but to save them.\" In Matthew 5:44, He had instructed, \"...Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.\"\n In Luke 22:37, Christ showed the meaning of His statement: \"For I say unto you, that this that is written must yet be accomplished in Me, And He was reckoned among the transgressors: for the things concerning Me have an end [they will be fulfilled].\"\n Why did Christ instruct His disciples to get swords? To assure the fulfillment of the prophecy in Isaiah 53:12 (which He had inspired and now quoted). He was to be considered a lawbreaker (\"transgressor\"). He was not endorsing the use of weapons for the purpose of harming other people (whether in self-defense or otherwise). In verse 51 of Luke 22, we see that when Peter drew a sword and strike the High Priest's servant, Christ chastised him for his actions. He then healed the man by re-attaching his ear, which Peter had cut off. \"\n __________________", 
   {
    "unicode_changes_made": true
   }, 
   359156, 
   null, 
   1246396260.0
  ], 
  [
   359171, 
   null, 
   "Doc Jones", 
   "There was a battle.\n \n We fought.\n \n We won.\n \n Let's eat!\n \n Throughout the Bible God has commanded his people to fight. See if you can find any examples of that? Had they followed his commandments perfectly, we would not be having the problems we are today emoticon_wow", 
   {
    "post_info": {
     "post_title": "Every Jewish holiday and feast are based on:"
    }
   }, 
   359163, 
   null, 
   1246397520.0
  ], 
  [
   359176, 
   null, 
   "Tither", 
   "In Luke 9:56, He had stated, &#8220;For the Son of man is not come to destroy men&#8217;s lives, but to save them.&#8221; \n\n Yes! Absolutely. Eternal Life! For it is appointed for man to die then the judgment! If you don't make that one, the second death! Not everyone is going to be saved.\n \n \nIn Matthew 5:44, He had instructed, &#8220;&#8230;Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you.&#8221;\n\n I finally am reading stuff I love to hear from Antis! emoticon_smile \n \n Dispitefully using you is different then trying to kill you! But even then, he set up a system of justice with judges, who could put you to death.\n \n \nIn Luke 22:37, Christ showed the meaning of His statement: &#8220;For I say unto you, that this that is written must yet be accomplished in Me, And He was reckoned among the transgressors: for the things concerning Me have an end [they will be fulfilled].&#8221; \n\n Yes. Evey thing written about Jesus must be fulfilled, but show me the passages about Nato, or Doc or Sarge? \n \n \nWhy did Christ instruct His disciples to get swords? To assure the fulfillment of the prophecy in Isaiah 53:12 (which He had inspired and now quoted). He was to be considered a lawbreaker (&#8220;transgressor&#8221;). \n\n What does that have to do with the Disciples? \n \n \nHe was not endorsing the use of weapons for the purpose of harming other people (whether in self-defense or otherwise). In verse 51 of Luke 22, we see that when Peter drew a sword and strike the High Priest&#8217;s servant, Christ chastised him for his actions. He then healed the man by re-attaching his ear, which Peter had cut off. \"\n\n Yes again. He spoke of legions of Angles he could command to fight for him, but that would have prevented him from going to the cross and being the only sacrifice needed for the remission of sin! \n \n Don't get us wrong, We are not saying that we are commanded to violence, but Self Defense is hard wired into our Very Nature. Which God created. We are also permitted to stop violence against others, as well. We are not sheep to be led to the slaughter. God gives us dignity and the promise of Life, and that more abundant through Jesus Christ, here on Earth, as well an in Heaven! \n \n Otherwise, we would be immediately taken to heaven once we convert!\n \n What happens in Revelations to the soldiers arrayed against Israel? God kills but a sixth part of them. Then what happens at the battle of Armageddon? We are coming back to do battle, and we with Jesus kill how many? Everybody at the Valley! Jesus was the lamb of God, led to the slaughter, but when he comes back the 2nd time, he comes back as the lion of Judah! I wouldn't want to be arrayed against him! emoticon_smile", 
   {}, 
   359163, 
   null, 
   1246400040.0
  ], 
  [
   359179, 
   null, 
   "zsu2357", 
   "Sarge, there is enough reading and historical documents on that single page from the official NARA page to keep him busy all day. You can't help the mentally crippled if they don't make an effort to help themselves. I just bounce things off of him for the lurkers so they can get educated about why our rights exist and how to exercise them. Trolls are a waste of time but they are excellent tools for education of those who want to learn emoticon_xhoho\n\n \n \n Well put Doc,every time my dear Comrade opens his mouth I learn something\n Ididn't know.\n Once again, well put.emoticon_xdonno", 
   {}, 
   359139, 
   null, 
   1246400700.0
  ], 
  [
   359186, 
   null, 
   "NATO 556", 
   "Wrong again. Get someone to read this to you, since you appear unable to absorb the content, or to respond to it. Post 20 in this very thread.\n\n \n SNIP\n \n Not good enough. If you wanna try and prove some kind of point, then you're gonna have to show us the Bible verses where God is explicitly telling his people to never, never, never defend themselves, never to take any steps to protect themselves from those that would kill them for absolutely no reason, never lift a finger to save a loved one who's being stabbed to death in the middle of the street, etc.\n \n Show me the verses where God said \"If you truly love me then you will lay down and die when confronted with hostility by thy enemy.\"\n \n We have entire sections of the Bible reserved for telling us about how God punished those who violated his commands. Rapists were put to death outright. Entire cities of people who turned against God's will and worshipped false idols were wiped off the face of the map. The people of Egypt were best upon by plague after plague. And even Moses was punished by not being allowed to enter the Promised Land.\n \n And yet, despite all of this, we don't have a single verse where God punished even a single person for taking up arms and killing someone who tried to kill them first. No names mentioned, no reference to the evils of killing those that would kill you first, nothing.\n \n So unless you've got exact Bible verses that spell out how God doesn't want you to protect yourself and others, under any possible circumstances, post them now or lose the argument.", 
   {}, 
   359163, 
   null, 
   1246407420.0
  ], 
  [
   359197, 
   null, 
   "Penfold", 
   "SNIP\n \n Not good enough. If you wanna try and prove some kind of point, then you're gonna have to show us the Bible verses where God is explicitly telling his people to never, never, never defend themselves, never to take any steps to protect themselves from those that would kill them for absolutely no reason, never lift a finger to save a loved one who's being stabbed to death in the middle of the street, etc.\n \n Show me the verses where God said \"If you truly love me then you will lay down and die when confronted with hostility by thy enemy.\"\n \n We have entire sections of the Bible reserved for telling us about how God punished those who violated his commands. Rapists were put to death outright. Entire cities of people who turned against God's will and worshipped false idols were wiped off the face of the map. The people of Egypt were best upon by plague after plague. And even Moses was punished by not being allowed to enter the Promised Land.\n \n And yet, despite all of this, we don't have a single verse where God punished even a single person for taking up arms and killing someone who tried to kill them first. No names mentioned, no reference to the evils of killing those that would kill you first, nothing.\n \n So unless you've got exact Bible verses that spell out how God doesn't want you to protect yourself and others, under any possible circumstances, post them now or lose the argument.\n\n \n \n You predictable request for a strawman demand to be answered is so tired. \n Show me the verses where he says guns are desirable for the spreading of his love.", 
   {}, 
   359186, 
   null, 
   1246416720.0
  ], 
  [
   359210, 
   null, 
   "NATO 556", 
   "You predictable request for a strawman demand to be answered is so tired. \n Show me the verses where he says guns are desirable for the spreading of his love.\n\n \n Nice try at detouring the argument, but it's not gonna happen.\n \n You've already admitted to the fact that God told his disciples to be armed at all costs. Yet you're trying to claim that God didn't want his disciples to use their swords and other weapons for any purpose other than carrying out his direct orders.\n \n This is very much like your side's claims in the pre-Heller setting. You would claim that the Second Amendment only applied to members of official militia organizations, and only when they were involved in official militia duties. You basically argued that the Second Amendment was only about the soldiers in the United States Army and the National Guard, and only about enabling them to carry out their official duties of keeping the peace in the country, and once that task was done the Second Amendment no longer applied because there was no need for our soldiers any longer at the time.\n \n I'm not the one who started this holy war, you did. It's not for me to supply scripture to prove statements and positions I didn't make; that's for you to do. You made the claim that while God advocated his disciples being armed, it was only so they could carry out his orders, and not for any other purposes whatsoever.\n \n The task is yours. You have to prove beyond any doubt that, according to the Bible, when confronted by a gang of murderous individuals, God expected his disciples to lay down their arms and peacefully let themselves be murdered in a brutal and graphic fashion right in the middle of the street, because they had absolutely no right to do anything to protect themselves from harm.", 
   {}, 
   359197, 
   null, 
   1246426080.0
  ], 
  [
   359227, 
   null, 
   "Penfold", 
   "Your perverted interpretation of his \"love your enemies\" message would be laughable were it not toxically lethal.", 
   {}, 
   359210, 
   null, 
   1246448040.0
  ], 
  [
   359232, 
   null, 
   "OldSarge", 
   "\"I'm not the one who started this holy war, you did. It's not for me to supply scripture to prove statements and positions I didn't make; that's for you to do. You made the claim that while God advocated his disciples being armed, it was only so they could carry out his orders, and not for any other purposes whatsoever.\n \n The task is yours. You have to prove beyond any doubt that, according to the Bible, when confronted by a gang of murderous individuals, God expected his disciples to lay down their arms and peacefully let themselves be murdered in a brutal and graphic fashion right in the middle of the street, because they had absolutely no right to do anything to protect themselves from harm.\"\n \n \nYour perverted interpretation of his \"love your enemies\" message would be laughable were it not toxically lethal.\n\n \n Once upon a time there was an event on the old Army Physical Fitness Test known as the run, dodge and jump. We have an expert in the event here.", 
   {}, 
   359227, 
   null, 
   1246452840.0
  ], 
  [
   359236, 
   null, 
   "NATO 556", 
   "Your perverted interpretation of his \"love your enemies\" message would be laughable were it not toxically lethal.\n\n \n There was a really strange interpretation of \"love thy enemy\" back in biblical times. Back then if a village decided to stray from God and worship false idols, He would send in his disciples to destroy the city and kill everyone outright; no trials, no lawyers, no hearings, no nothing, just outright and blanket death.\n \n And anyone who wasn't put to death was made a slave and used for cheap labor, and worked to the point where they fell over dead.\n \n It's still yours to prove that God's orders to his disciple were to let themselves be killed by roving murderous gangs, because defending themselves against such threats were not what he wanted. So either start providing evidence that you're right, or admit defeat and shut up.", 
   {}, 
   359227, 
   null, 
   1246461180.0
  ], 
  [
   361388, 
   null, 
   "grizzly6626", 
   "Apart from the lie in the title claim, (it was not ALL of California churches) Why should any rational being consider the judgement of sheeple who have demonstrably chosen to believe something patently untrue, anything but fatally flawed?\n\n \n Hello again Penfold, I have been gone for a while but I see you have not changed any. You still dont believe in God, and you think people with guns should be classified as criminals. You are what I refer to as the \" me generation\", meaning you only care, or seem to anyhow, about yourself and what you want and believe, and would like the rest of us to be just like you. But people are not the same and they never will be, people have their own thoughts, their own belief systems, and their own opinions on things. Now I dont have a problem with anyone believing differently than I do about anything, but when they start trying to get laws passed that try to make me believe as they do, well thats not gona fly with me. So why is it so difficult for you to believe as you do and let others believe as they do. In lamens terms, people need to mind their own damn business and leave others alone.", 
   {}, 
   358513, 
   null, 
   1248123240.0
  ], 
  [
   361419, 
   null, 
   "Penfold", 
   "There was a really strange interpretation of \"love thy enemy\" back in biblical times. Back then if a village decided to stray from God and worship false idols, He would send in his disciples to destroy the city and kill everyone outright; no trials, no lawyers, no hearings, no nothing, just outright and blanket death.\n \n And anyone who wasn't put to death was made a slave and used for cheap labor, and worked to the point where they fell over dead.\n \n It's still yours to prove that God's orders to his disciple were to let themselves be killed by roving murderous gangs, because defending themselves against such threats were not what he wanted. So either start providing evidence that you're right, or admit defeat and shut up.\n\n \n You would be well advised to take your own advice. Your empty posturing merely underlines the vacuity of your argument.", 
   {}, 
   359236, 
   null, 
   1248135780.0
  ], 
  [
   361435, 
   null, 
   "NATO 556", 
   "You would be well advised to take your own advice. Your empty posturing merely underlines the vacuity of your argument.\n\n \n Using big, fancy or complicated words, and ridiculing another's grammar isn't going to help you win this argument, only your presenting of hard and undeniable facts will.\n \n God may have taught the concept of \"love thy enemies\" but He also orders his disciples to go off and kill anyone and everyone that strayed from him and struck out on their own. Worship a false god, bam you're dead and left in the street with the wild dogs to eat, and the entire village around you has been rendered a similar fate.", 
   {}, 
   361419, 
   null, 
   1248140700.0
  ], 
  [
   361438, 
   null, 
   "Penfold", 
   "Using big, fancy or complicated words, and ridiculing another's grammar isn't going to help you win this argument, only your presenting of hard and undeniable facts will.\n \n God may have taught the concept of \"love thy enemies\" but He also orders his disciples to go off and kill anyone and everyone that strayed from him and struck out on their own. Worship a false god, bam you're dead and left in the street with the wild dogs to eat, and the entire village around you has been rendered a similar fate.\n\n \n Ridiculing another's grammar? Your God's message is \"Love your enemies, but genocide is okay too!\" ? The world can never have enough psychotic megalomaniacs? emoticon_rolleyes", 
   {}, 
   361435, 
   null, 
   1248143040.0
  ], 
  [
   361445, 
   null, 
   "iangb", 
   "You have to prove beyond any doubt that, according to the Bible, when confronted by a gang of murderous individuals, God expected his disciples to lay down their arms and peacefully let themselves be murdered in a brutal and graphic fashion right in the middle of the street\nThis may be just me, but... isn't that more or less exactly what He told His Son to do? It's an accurate description apart from the location - we have Jesus and the disciples confronted in the Garden by a gang of soldiers sent to murder Jesus (by the proxy of Pilate and a cross on a hill), then God expected the disciples to lay down their arms and peacefully let their leader be murdered in a brutal and graphic fashion.\n \n Sounds like it fits the bill to me.", 
   {}, 
   361438, 
   null, 
   1248146400.0
  ], 
  [
   361455, 
   null, 
   "NATO 556", 
   "Ridiculing another's grammar? Your God's message is \"Love your enemies, but genocide is okay too!\" ? The world can never have enough psychotic megalomaniacs? emoticon_rolleyes\n\n \n Anyone who turned away from God became His enemy. What did God do with His enemies? He killed them. Why should we not follow the same set example?", 
   {}, 
   361438, 
   null, 
   1248149700.0
  ], 
  [
   361456, 
   null, 
   "NATO 556", 
   "This may be just me, but... isn't that more or less exactly what He told His Son to do? It's an accurate description apart from the location - we have Jesus and the disciples confronted in the Garden by a gang of soldiers sent to murder Jesus (by the proxy of Pilate and a cross on a hill), then God expected the disciples to lay down their arms and peacefully let their leader be murdered in a brutal and graphic fashion.\n \n Sounds like it fits the bill to me.\n\n \n No it's not. In this instance, Jesus was sent in order to save everyone, he had to be sacrificed in order for this to happen. If the disciples killed the soldiers then this wouldn't have been able to take place as it was intended to.\n \n Find a better example, one dealing with purely mortal men.", 
   {}, 
   361445, 
   null, 
   1248149760.0
  ], 
  [
   361473, 
   null, 
   "zsu2357", 
   "This may be just me, but... isn't that more or less exactly what He told His Son to do? It's an accurate description apart from the location - we have Jesus and the disciples confronted in the Garden by a gang of soldiers sent to murder Jesus (by the proxy of Pilate and a cross on a hill), then God expected the disciples to lay down their arms and peacefully let their leader be murdered in a brutal and graphic fashion.\n \n Sounds like it fits the bill to me.\n\n \n \n There are a few anti-gunners here that are on par with you, but I don't think \n they would go that far.\n Me personally; since I don't hold any false illusions about rising from the dead I'll\n pass on it, and do everything in my power to forestall it if that means shooting\n than shoot it is.\n \n \n And yes it is probably pretty much you. How do any other anti see it?\n \n emoticon_xkill", 
   {}, 
   361445, 
   null, 
   1248154620.0
  ], 
  [
   361490, 
   null, 
   "iangb", 
   "No it's not. In this instance, Jesus was sent in order to save everyone, he had to be sacrificed in order for this to happen. If the disciples killed the soldiers then this wouldn't have been able to take place as it was intended to.\n \n Find a better example, one dealing with purely mortal men. \nShifting again? You've exaggerated once, but that doesn't seem to have been enough...\n \n Pick your own. Large proportions of the list were killed, often gruesomely, because they knowingly walked into the homes and cities of their enemies and did not fight back. They didn't wait for the mob to find them, they 'lay down their arms' and went to find the mob.\n \n What did you expect? This is Christiantiy; you can argue pretty much anything and stay within it's bounds.", 
   {}, 
   361473, 
   null, 
   1248178620.0
  ], 
  [
   361514, 
   null, 
   "Penfold", 
   "Anyone who turned away from God became His enemy. What did God do with His enemies? He killed them. Why should we not follow the same set example?\n\n \n Perhaps because you are not God, and he forbids it. emoticon_xbangheadxbanghead", 
   {}, 
   361455, 
   null, 
   1248188880.0
  ], 
  [
   361524, 
   null, 
   "NATO 556", 
   "Perhaps because you are not God, and he forbids it. emoticon_xbangheadxbanghead\n\n \n He doesn't forbid protecting yourself against those that would do you harm.", 
   {}, 
   361514, 
   null, 
   1248192780.0
  ], 
  [
   361529, 
   null, 
   "iangb", 
   "Perhaps because you are not God, and he forbids it.\nHe doesn't forbid protecting yourself against those that would do you harm. \nI am reminded of the following:\n \nSusan soon learned that 'No one is to open the door of the Stationary Cupboard' was a prohibition that a seven-year-old simply would not understand. You had to think and rephrase it in more immediate terms, like, 'No one, Jason, no matter what, no, not even if they thought they heard someone shouting for help, no-one - are you paying attention, Jason? - is to open the door of the Stationary Cupboard, or accidentally fall on the door handle so that it opens, or threaten to steal Richenda's teddy bear unless she opens the door of the Stationary Cupboard, or be standing nearby when a mysterious wind comes out of nowhere and blows the door open all by itself, honestly, it really did, or in any way open, cause to open, ask anyone else to open, jump up and down on the loose floorboard to open or in any other way seek to obtain entry to the Stationary Cupboard. Jason!'\n\n Sound familiar?", 
   {}, 
   361524, 
   null, 
   1248194160.0
  ], 
  [
   361531, 
   null, 
   "Penfold", 
   "I am reminded of the following:\n \n Sound familiar?\n\n \n \n \n Excruciatingly so!emoticon_xgood emoticon_smile", 
   {}, 
   361529, 
   null, 
   1248196560.0
  ], 
  [
   361585, 
   null, 
   "Tither", 
   "Maybe you should take a good look to what happens in Revelations when Jesus Returns! I would not want to be on the opposite side in the Vally of Armageddon!\n \n However what do you do with the fact that at least one of them was armed. Peter, we think, cut the ear off of the High Priest servant with a sword.", 
   {}, 
   361531, 
   null, 
   1248209760.0
  ], 
  [
   361590, 
   null, 
   "Penfold", 
   "Maybe you should take a good look to what happens in Revelations when Jesus Returns! I would not want to be on the opposite side in the Vally of Armageddon!\n\n \n \"You cannot be serious!\" J McEnroe.\n \n \nHowever what do you do with the fact that at least one of them was armed. Peter, we think, cut the ear off of the High Priest servant with a sword.\n\n \n I think you should have taken a good look at the thread before inserting your 1/2 cent. That point was dealt with in post 20. Jesus chastised him, and healed the ear.", 
   {}, 
   361585, 
   null, 
   1248211740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  California churches favor concealed carry", 
  "url": "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12909, 
  "discussion_files": [
   [
    "18956.html", 
    "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry-print.html"
   ], 
   [
    "18957.html", 
    "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry-5-print.html"
   ], 
   [
    "18958.html", 
    "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry-4-print.html"
   ], 
   [
    "18959.html", 
    "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry-3-print.html"
   ], 
   [
    "18960.html", 
    "http://www.4forums.com/political/gun-control-debates/12909-california-churches-favor-concealed-carry-2-print.html"
   ]
  ], 
  "identifier": 12909
 }
]