[
 [
  [
   358442, 
   null, 
   "foundit66", 
   "Capitol Hill is no beacon of biblical scholarship, either. Another Georgia Republican (and co-sponsor of Broun's bill), Lynn Westmoreland, in 2006 pushed a bill to require the display of the Ten Commandments in the House and Senate, but then won the dubious immortality of video by going on the \"Colbert Report\" without brushing up on his Decalogue. Which led to this memorable exchange:\n Colbert: What are the Ten Commandments?\n Westmoreland: What are all of them?\n Colbert: Yes.\n Westmoreland: You want me to name them all?\n Colbert: Yes.\n Westmoreland: Uhhh. Don't murder. Don't lie. Don't steal. Ummmmm. I can't name 'em all. \n\n Why a Real 'Year of the Bible' Would Horrify Its Sponsors -- Politics Daily\n \nCongressman: \"Where better place could you have something like that than in a judicial building or in a court house?\"\n Colbert: \"That is a good question. Can you think of any better building to put the 10 commandments in than a public building?\"\n Congressman: \"No\"\n\n \n On the issue of separation of church and state, there are multiple issues at hand.\n First of all, separation of church and state is a concept that exists in our government. It prohibits religion from usurping government property, just like it prevents government from usurping religious property.\n It helps establish a NEUTRAL government environment, instead of showing favoritism to religion.\n \n Secondly, WHY are churches and religious people so intent on putting religious symbology on government property in the first place?\n As the second quoted section alludes to, RELIGIOUS MONUMENTS belong on CHURCH property.\n Does ANYBODY know of a multi-tonned ten commandments monument placed on CHURCH property? It's an eye-sore!\n If they refuse to put it on their OWN property, why should they be allowed to put it on GOVERNMENT property?\n \n Third, The first quoted section brings home an important aspect of this issue that I think SHOULD strike to the heart of the issue from the religious side.\n People putting up religious symbols as EMPTY SIGNS of display, when in their hearts they don't take the issue seriously.\n This politician CLAIMS that the ten commandments are important, but he only knows THREE SECULAR commandments??? emoticon_emb\n It shows how important the commandments are to him.\n The bible includes many comments about graven images. When the Ten Commandment monument (illegally placed) were removed from the Alabama courthouse, the reaction of people I saw on the news crying over it brought to mind exactly how close to \"graven images\" these people were treating the monument.", 
   {
    "post_info": {
     "post_title": "Posting Ten Commandments: Separation of Church and State"
    }
   }, 
   null, 
   null, 
   1245797760.0
  ], 
  [
   358448, 
   null, 
   "Easyrider", 
   "Tsk tsk. Here's what the Founding Fathers did:\n \n \n The Danbury Baptist Letter, as Originally Drafted\n \n The Library of Congress is grateful to the Federal Bureau of Investigation Laboratory for recovering the lines obliterated from the Danbury Baptist letter by Thomas Jefferson. He originally wrote \"a wall of eternal separation between church and state,\" later deleting the word \"eternal.\" He also deleted the phrase \"the duties of my station, which are merely temporal.\" Jefferson must have been unhappy with the uncompromising tone of both of these phrases, especially in view of the implications of his decision, two days later, to begin attending church services in the House of Representatives.\n \n emoticon_xbouncer\n \n Reserved Seats at Capitol Services\n \n Here is a description, by an early Washington \"insider,\" Margaret Bayard Smith (1778-1844), a writer and social critic and wife of Samuel Harrison Smith, publisher of the National Intelligencer, of Jefferson's attendance at church services in the House of Representatives: \"Jefferson during his whole administration was a most regular attendant. The seat he chose the first day sabbath, and the adjoining one, which his private secretary occupied, were ever afterwards by the courtesy of the congregation, left for him.\"\n \n The Old House of Representatives\n \n Church services were held in what is now called Statuary Hall from 1807 to 1857. The first services in the Capitol, held when the government moved to Washington in the fall of 1800, were conducted in the \"hall\" of the House in the north wing of the building. In 1801 the House moved to temporary quarters in the south wing, called the \"Oven,\" which it vacated in 1804, returning to the north wing for three years. Services were conducted in the House until after the Civil War. The Speaker's podium was used as the preacher's pulpit. \n \n A Millennialist Sermon Preached in Congress\n \n This sermon on the millennium was preached by the Baltimore Swedenborgian minister, John Hargrove (1750-1839) in the House of Representatives. One of the earliest millennialist sermons preached before Congress was offered on July 4, 1801, by the Reverend David Austin (1759-1831), who at the time considered himself \"struck in prophesy under the style of the Joshua of the American Temple.\" Having proclaimed to his Congressional audience the imminence of the Second Coming of Christ, Austin took up a collection on the floor of the House to support services at \"Lady Washington's Chapel\" in a nearby hotel where he was teaching that \"the seed of the Millennial estate is found in the backbone of the American Revolution.\"\n \n \n First Catholic Sermon in the House\n \n On January 8, 1826, Bishop John England (1786-1842) of Charleston, South Carolina, became the first Catholic clergyman to preach in the House of Representatives. The overflow audience included President John Quincy Adams, whose July 4, 1821, speech England rebutted in his sermon. \n \n Woman Preacher in the House (and call for revival!)\n \n In 1827, Harriet Livermore (1788-1868), the daughter and granddaughter of Congressmen, became the second woman to preach in the House of Representatives. The first woman to preach before the House (and probably the first woman to speak officially in Congress under any circumstances) was the English evangelist, Dorothy Ripley (1767-1832), who conducted a service on January 12, 1806. Jefferson and Vice President Aaron Burr were among those in a \"crowded audience.\" Sizing up the congregation, Ripley concluded that \"very few\" had been born again and broke into an urgent, camp meeting style exhortation, insisting that \"Christ's Body was the Bread of Life and His Blood the drink of the righteous.\"\n \n Communion Service in the Treasury Building\n \n Manasseh Cutler here describes a four-hour communion service in the Treasury Building, conducted by a Presbyterian minister, the Reverend James Laurie: \"Attended worship at the Treasury. Mr. Laurie alone. Sacrament. Full assembly. Three tables; service very solemn; nearly four hours.\" \n \n Adams's Description of a Church Service in the Supreme Court\n \n John Quincy Adams here describes the Reverend James Laurie, pastor of a Presbyterian Church that had settled into the Treasury Building, preaching to an overflow audience in the Supreme Court Chamber, which in 1806 was located on the ground floor of the Capitol. \n \n Church Services in the Old Supreme Court Chamber\n \n Description of church services in the Supreme Court chamber by Manasseh Cutler (1804) and John Quincy Adams (1806) indicate that services were held in the Court soon after the government moved to Washington in 1800.\n \n Church Services in Congress after the Civil War\n \n Charles Boynton (1806-1883) was in 1867 chaplain of the House of Representatives and organizing pastor of the First Congregational Church in Washington, which was trying at that time to build its own sanctuary. In the meantime the church, as Boynton informed potential donors, was holding services \"at the Hall of Representatives\" where \"the audience is the largest in town. . . .nearly 2000 assembled every Sabbath\" for services, making the congregation in the House the \"largest Protestant Sabbath audience then in the United States.\" The First Congregational Church met in the House from 1865 to 1868. \n \n House of Representatives, After the Civil War\n \n The House moved to its current location on the south side of the Capitol in 1857. It contained the \"largest Protestant Sabbath audience\" in the United States when the First Congregational Church of Washington held services there from 1865 to 1868. \n \n Compliments: U.S. Library of Congress\n \n Religion and the Federal Government: PART 2 (Religion and the Founding of the American Republic, Library of Congress Exhibition)\n \n So spare me the politically correct historical revisionism and liberal dysentary on the Separation of Church and State.", 
   {}, 
   358442, 
   null, 
   1245798780.0
  ], 
  [
   358450, 
   null, 
   "jyoshu", 
   "Third, The first quoted section brings home an important aspect\n\n \n No, not an important aspect. The fact is, whether or not the commandments are \"important to\" Westmoreland has absolutely no bearing on the merits of the constitutional issue of church and state. If everyone who wants the commandments displayed could name NONE of them--not a SINGLE one--it still wouldn't matter. It's either constitutional or not, completely independent of how important they are to proponents or opponents.", 
   {}, 
   358448, 
   null, 
   1245800220.0
  ], 
  [
   358453, 
   null, 
   "foundit66", 
   "Tsk tsk. Here's what the Founding Fathers did:\n\n On these issues, when people start quoting this junk, invariably it typically comes down to one flawed approach.\n Showing how a person who was a founding father also had religious beliefs.\n \n That isn't the same thing as refuting separation of church and state.\n A lot of these founding fathers CAME TO America because they RECOGNIZED HOW THEY THEMSELVES WERE VICTIMS of church exerting power over the state.\n \n \n \nThomas Jefferson: ... two days later, to begin attending church services in the House of Representatives.\n\n Him attending church services is not refutation of separation of church and state.\n MOST of the judges who UPHOLD separation of church and state are Christian... emoticon_emb\n \n And looking through a lot more of your quotes, I can't help but wonder if you seriously cannot recognize the distinction.\n Religious prayers and speeches held in the capitol are not a violation, as long as ALL faiths are accepted. Under the Bush administration, I know we had a variety of other faith representations that were invited to give opening invocations.\n \n You aren't even talking about the same issue that was brought up originally.\n The original point made above was about RELIGIOUS MONUMENTS placed in government facilities.\n \n You are trying to argue AGAINST separation of church and state, by pointing to a practice that I do not believe is seen as a violation of separation of church and state.\n \n That is like arguing \"There are no laws against firearms because you can buy a six-shooter\", ignoring the fact that there are laws against SOME firearms, like automatic weaponry. emoticon_frazzled\n \n But if you want to talk founding fathers...\n \n \nJames Madison:\n # The civil Government, though bereft of everything like an associated hierarchy, possesses the requisite stability, and performs its functions with complete success, whilst the number, the industry, and the morality of the priesthood, and the devotion of the people, have been manifestly increased by the total separation of the church from the State (Letter to Robert Walsh, Mar. 2, 1819).\n \n # Strongly guarded as is the separation between religion and & Gov't in the Constitution of the United States the danger of encroachment by Ecclesiastical Bodies, may be illustrated by precedents already furnished in their short history (Detached Memoranda, circa 1820).\n \n # Every new and successful example, therefore, of a perfect separation between the ecclesiastical and civil matters, is of importance; and I have no doubt that every new example will succeed, as every past one has done, in showing that religion and Government will both exist in greater purity the less they are mixed together (Letter to Edward Livingston, July 10, 1822). \n\n Madison on church and state\n \n \nThomas Jefferson:\n # Believing that religion is a matter which lies solely between man and his God, that he owes account to none other for his faith or his worship, that the legislative powers of government reach actions only, and not opinions, I contemplate with sovereign reverence that act of the whole American people which declared that their Legislature should \"make no law respecting an establishment of religion, or prohibiting the free exercise thereof,\" thus building a wall of separation between Church and State (Letter to the Danbury Baptists, 1802).\n # Religion is a subject on which I have ever been most scrupulously reserved. I have considered it as a matter between every man and his Maker in which no other, and far less the public, had a right to intermeddle (letter to Robert Rush, 1813).\n # I consider the government of the United States as interdicted by the Constitution from intermeddling in religious institutions, their doctrines, discipline, or exercises. This results not only from the provision that no law shall be made respecting the establishment or free exercise of religion, but from that also which reserves to the states the powers not delegated to the United States. Certainly, no power to prescribe any religious exercise or to assume authority in religious discipline has been delegated to the General Government. It must rest with the States, as far as it can be in any human authority (letter to Samuel Miller, Jan. 23, 1808).\n\n Thomas Jefferson on church and state\n \n Furthermore, I think the words of Rev John Leland are appropriate on the general issue regarding the motivation of violators of separation of church and state...\n \n \n. . . Disdain mean suspicion, but cherish manly jealousy; be always jealous of your liberty, your rights. Nip the first bud of intrusion on your constitution. Be not devoted to men; let measures be your object, and estimate men according to the measures they pursue. Never promote men who seek after a state-established religion; it is spiritual tyranny--the worst of despotism. It is turnpiking the way to heaven by human law, in order to establish ministerial gates to collect toll. It converts religion into a principle of state policy, and the gospel into merchandise. Heaven forbids the bans of marriage between church and state; their embraces therefore, must be unlawful. Guard against those men who make a great noise about religion, in choosing representatives. It is electioneering. If they knew the nature and worth of religion, they would not debauch it to such shameful purposes. If pure religion is the criterion to denominate candidates, those who make a noise about it must be rejected; for their wrangle about it, proves that they are void of it. Let honesty, talents and quick despatch, characterise the men of your choice. Such men will have a sympathy with their constituents, and will be willing to come to the light, that their deeds may be examined. . . . \n\n Rev. John Leland on the Ten Commandments, Judge Moore and other related things", 
   {}, 
   358448, 
   null, 
   1245800940.0
  ], 
  [
   358454, 
   null, 
   "foundit66", 
   "No, not an important aspect. The fact is, whether or not the commandments are \"important to\" Westmoreland has absolutely no bearing on the merits of the constitutional issue of church and state. If everyone who wants the commandments displayed could name NONE of them--not a SINGLE one--it still wouldn't matter. It's either constitutional or not, completely independent of how important they are to proponents or opponents.\n\n It is an important aspect.\n I think one of the prime importances of this aspect would be from a RELIGIOUS perspective, which is what I was trying to show you.\n Take a look at the final quoted section in my post from Rev Leland.\n http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state.html#post358453\n \n While you may not recognize the RELIGIOUS significance of this discrepancy, other Christians DO.\n \n In fact, I find it VERY telling that you prize the empty display of pretense religious fervor, over actually being concerned with it...\n \n Tell me Jyoshu.\n Do you worship the constitution?\n Or do you follow the bible?\n \n Regardless, your very response is an ineffectual one at best.\n I don't see anybody here claiming that Westmoreland not knowing the ten commandments disqualifies the issue constitutionally.\n The CONSTITUTION, and the courts application of it, are what disqualifies Westmoreland's desires.\n Your argument is like saying \"John wearing his seat belt doesn't mean he violated the speed limit\".\n No. John going 75 MPH in a 55 MPH zone is what had him violating the speed limit...\n \n http://www.cnn.com/2003/LAW/11/13/moore.tencommandments/\n \nU.S. District Judge Myron Thompson ruled the granite carving was an unconstitutional endorsement of religion. Moore refused to obey the order but was overruled by his eight colleagues on the state Supreme Court.\n\n THAT is what makes it unconstitutional...", 
   {}, 
   358450, 
   null, 
   1245801060.0
  ], 
  [
   358472, 
   null, 
   "jyoshu", 
   "In fact, I find it VERY telling that you prize the empty display of pretense religious fervor, over actually being concerned with it...\n\n \n Foundit, I don't \"prize\" that at all. It has nothing to do with \"concern\" of ANY kind; the bottom line is that what you're harping on here is IRRELEVANT in terms of constitutionality. Whether or not it's constitutional has nothing to do with what anyone is \"concerned\" with. \n \n \nYour argument is like saying \"John wearing his seat belt doesn't mean he violated the speed limit\".\n\n \n Huh??? emoticon_confused You OBVIOUSLY don't get what I'm saying at all, as your analogy doesn't even touch on ANYTHING I'm saying. I'm not making ANY argument about anyone not violating something. I'm simply saying that it's irrelevant to the issue of constitutionality here that someone can't remember any or some of the tem commandments. It doesn't speak to the CENTRAL issue of separation of C&S. \n \n \nThe CONSTITUTION, and the courts application of it, are what disqualifies Westmoreland's desires.\n\n \n Yep, NOW you're talking. emoticon_xgood It IS the constitution, and it applies WITH or WITHOUT Westmoreland being able to remember any of them. THAT'S what counts in terms of legality here, not whether someone knows his scriptures or not.", 
   {}, 
   358454, 
   null, 
   1245811680.0
  ], 
  [
   358473, 
   null, 
   "foundit66", 
   "Foundit, I don't \"prize\" that at all. It has nothing to do with \"concern\" of ANY kind\n\n emoticon_rolleyes\n Jesus had a big sticking point with it.\n You don't have any concern over it.\n Why am I not surprised...\n \n \n \nYour argument is like saying \"John wearing his seat belt doesn't mean he violated the speed limit\".\n\n \nHuh??? emoticon_confused You OBVIOUSLY don't get what I'm saying at all, as your analogy doesn't even touch on ANYTHING I'm saying.\n\n Actually, it does.\n And ironically, it has to deal with YOUR responses \"don't even touch on anything I'm saying\".\n When I am tossing out bible verses to prove a specific aspect of a point, do you really think I'm trying to make a point on constitutionality???\n \n When I am talking about John not wearing his seat belt, you come busting on the scene insisting we talk about speeding.\n When I am talking about bible literacy and/or empty shows of faith, you come busting on the scene trying to apply THAT discussion to \"constitutionality\".\n THAT is my point.\n \n I never applied those comments to constitutionality.\n \n \n \nIt doesn't speak to the CENTRAL issue of separation of C&S. \n\n Like I said, I'm talking about seat belts (bible literacy / empty shows of faith) and you insist on trying to apply that to speeding (separation of church and state).\n YOU want the central issue to be about constitutionality. But quite frankly, \"constitutionality\" IS NOT ALL there is to the issue of separation of church and state.\n There are RELIGIOUS aspects to it as well. RELIGIOUS aspects justifying a separation of church and state.\n \n \n \nYep, NOW you're talking. emoticon_xgood It IS the constitution, and it applies WITH or WITHOUT Westmoreland being able to remember any of them. THAT'S what counts in terms of legality here, not whether someone knows his scriptures or not.\n\n Bonus round.\n Can you quote WHERE I SAID that bible literacy or knowing the ten commandments were decisive issues in the constitutionality of the issue???\n emoticon_rolleyes\n Quit trying to misapply my points or obfuscate the issue.\n The only one you're confusing here is yourself.", 
   {}, 
   358472, 
   null, 
   1245812580.0
  ], 
  [
   358477, 
   null, 
   "jyoshu", 
   "emoticon_rolleyes\n Jesus had a big sticking point with it.\n You don't have any concern over it.\n Why am I not surprised...\n\n \n Jesus summed them all up in TWO commandments. And when a rich young ruler told him he's kept ALL the commandments since his youth, it didn't matter anyway in the end.\n You don't seem to realize that.\n Why am *I* not surprised?\n \n \nActually, it does.\n And ironically, it has to deal with YOUR responses \"don't even touch on anything I'm saying\".\n When I am tossing out bible verses to prove a specific aspect of a point, do you really think I'm trying to make a point on constitutionality???\n\n \n Frankly, at this point, I have no idea what your point is. You've been all over the place, after all. Your thread title would seem to indicate constitutionality MIGHT be what you want to deal with, but then the discussion you've taken part in since then would indicate you it's NOT something you care about here. So I guess I'm left playing your guessing game. Bugger me.\n \n \n\"constitutionality\" IS NOT ALL there is to the issue of separation of church and state.\n There are RELIGIOUS aspects to it as well. \n\n \n Not to someone who's made a big deal that they think religion shoudn't get extra privileges. If RELIGION is taken as part of the legal issue, it's getting special privilege. (Which, of course, I think is a good thing--in KEEPING with the constitution. The only reason I'm not letting you off the hook on this is because of the inconsistency it reveals on your part.)\n \n \nBonus round.\n Can you quote WHERE I SAID that bible literacy or knowing the ten commandments were decisive issues in the constitutionality of the issue???\n\n \n No, but I find it interesting that Colbert would only want to talk about issues unrelated to that, when it's the actual heart of the issue. Can't say I'm surprise though, as no doubt it's easier to pick on someone for not being able to remember the commandments than to actually have to argue the constitutional merits of displaying them. emoticon_xangel", 
   {}, 
   358473, 
   null, 
   1245818340.0
  ], 
  [
   358478, 
   null, 
   "foundit66", 
   "Jesus summed them all up in TWO commandments.\n\n No, No, No...\n You're trying to change the subject again.\n I'm not talking about that, and those \"two commandments\" have nothing (at face value) to do with this topic of separation of church and state. Those two commandments can't be used to ignore WHAT ELSE Jesus said.\n Quite frankly, if anything what I am talking about could be put under the FIRST commandment, as somebody utilizing vain and empty religious displays IS NOT loving god but serving his own selfish needs.\n \n Must you eternally obfuscate what other people say?\n \n \n \nFrankly, at this point, I have no idea what your point is.\n\n Cause you keep responding by insisting I have to talk about what YOU are talking about, IGNORING WHAT I AM SAYING.\n I don't think you have made ANY serious effort to try to figure out what I am saying.\n I EXPLICITLY STATED that my third comment was \"from the religious side\" in my very first post.\n But you IGNORED that and start responding like *Hey! This one has nothing to do with constitutionality*\n \n \n \nYour thread title would seem to indicate constitutionality MIGHT be what you want to deal with, but then the discussion you've taken part in since then would indicate you it's NOT something you care about here.\n\n Constitutionality IS part of what I dealt with.\n I dealt with it IN MY FIRST COMMENT in my first post.\n In my THIRD comment, I was not dealing with constitutionality. I was dealing with it religiously.\n \n \n \nSo I guess I'm left playing your guessing game.\n\n You know what's really pathetic about that comment jyoshu?\n OTHER PEOPLE HAVE NO PROBLEM recognizing what I am saying.\n \n \n \nIf RELIGION is taken as part of the legal issue, it's getting special privilege. (Which, of course, I think is a good thing--in KEEPING with the constitution. The only reason I'm not letting you off the hook on this is because of the inconsistency it reveals on your part.)\n\n Religion gets special privileges if the wall is only one-way.\n If ONLY the government is restricted from affecting religion, with NO LIKEWISE restriction against religion from affecting government, THAT is special privilege.\n \n A two-way wall is not a special privilege.\n \n \n \nNo, but I find it interesting that Colbert would only want to talk about issues unrelated to that...\n\n Wow. Again, you just refuse to get it.\n Colbert looked at it from the RELIGIOUS angle, recognizing the RELIGIOUS HYPOCRISY as more important than the \"constitutionality\" itself.\n He put the RELIGIOUS perspective above the \"constitutional\" one.\n \n I realize it may be hard for you to grasp somebody REALLY putting their religion first, instead of just using it as an excuse to discriminate or vainly garner attention and political power, but you really NEED to recognize that other people have different priorities than yours.\n \n \n \nCan't say I'm surprise though, as no doubt it's easier to pick on someone for not being able to remember the commandments than to actually have to argue the constitutional merits of displaying them. emoticon_xangel\n\n You are a laugh riot.\n YOU are trying to pick on Colbert OVER \"actually have to argue the constitutional merits of displaying\" the ten commandments.\n \n Since you started on this thread, NOT ONCE have you tried to actually refute the constitutional issue of separation of church and state. NOT ONCE have you proposed an argument for why the courts and judges are wrong in upholding separation of church and state.\n Instead, you are AGAIN GOING STRAIGHT FOR PASSIVE-AGGRESSIVE ATTACKS against people...\n \n Colbert was looking at the RELIGIOUS reasons for separation of church and state, and it says a LOT that you can't recognize that.\n Geez! I AM NOT A CHRISTIAN and I got that...", 
   {}, 
   358477, 
   null, 
   1245819660.0
  ], 
  [
   358484, 
   null, 
   "Accipiter", 
   "One of the problems I have with this kind of stuff is that it wastes government time and money on superfluous poop.\n \n It seams that the religious are fond of finding some ridiculous issue and then create argument over it which the government then has to deal with at our expense.", 
   {}, 
   358478, 
   null, 
   1245843420.0
  ], 
  [
   358491, 
   null, 
   "Archangel", 
   "If the founders and early Government leaders believed that the modern liberal interpretation of separation of Church and State is correct then why is the image of Moses carrying the Ten Commandments CARVED into the Supreme Court Building?\n Ten Commandments stunner: Feds lying at Supreme Court", 
   {}, 
   358484, 
   null, 
   1245847800.0
  ], 
  [
   358495, 
   null, 
   "Penfold", 
   "Moses, carrying BLANK tablets, is not alone, but between Confucius and Solon, surrounded by LAW_GIVERS from different races and creeds. Why on earth would they do that on a COURT building, do you think?", 
   {}, 
   358491, 
   null, 
   1245850080.0
  ], 
  [
   358505, 
   null, 
   "Brigid", 
   "If the founders and early Government leaders believed that the modern liberal interpretation of separation of Church and State is correct then why is the image of Moses carrying the Ten Commandments CARVED into the Supreme Court Building?\n \n\n \n UMMMMMMM, because it was built in 1932-1935, and has NOTHING WHATSOEVER to do with the founders or early government leaders, nor with what they believed was correct?\n \n You really are the master of the Art of SELF-PWN, Archie.", 
   {}, 
   358491, 
   null, 
   1245855300.0
  ], 
  [
   358507, 
   null, 
   "jyoshu", 
   "If the founders and early Government leaders believed that the modern liberal interpretation of separation of Church and State is correct then why is the image of Moses carrying the Ten Commandments CARVED into the Supreme Court Building?\n Ten Commandments stunner: Feds lying at Supreme Court\n\n \n Because when it was built, the left didn't treat religion with the paranoid idea of it being a big boogeyman like they do today. There wasn't this over-PC push to sterilize public life of any and all utterances of religion. And guess what .... the sky has never yet fallen due to that being carved in the wall. Nor has it fallen over \"in God we trust\" being on our currency. We seem to have survived just fine these awful, dastardly, examples of (GASP) actually adorning public halls of the people with things many of the people hold dear. Whoda thunk it? Personally, I really don't think the founders had paranoia over wall-hangings in mind when they wrote the 1st Amendment.", 
   {}, 
   358491, 
   null, 
   1245857160.0
  ], 
  [
   358522, 
   null, 
   "Archangel", 
   "UMMMMMMM, because it was built in 1932-1935, and has NOTHING WHATSOEVER to do with the founders or early government leaders, nor with what they believed was correct?\n \n You really are the master of the Art of SELF-PWN, Archie.\n\n \n My ruse was deliberate Brigid. You just showed all by yourself that it was much more recently that Americans of the so called progressive persuasion saw no conflict with placing religious symbolism on Government buildings. This whole drive to erase God and religion from the public square is a totally modern and very recent quest by atheists which is a total corruption of the historical interpretation of the separation of church and state. So thankyou for revealing that as recently as the mid 1930s when the Supreme Court Building was constructed, it was understood not to be crossing the line established by the Constitution.", 
   {}, 
   358505, 
   null, 
   1245871680.0
  ], 
  [
   358525, 
   null, 
   "Brigid", 
   "My ruse was deliberate Brigid. \n \n Yes, that is what most people claim when they get called on their BS, and wish to not look stupid or do not wish to own up to their BS..\n \n \nYou just showed all by yourself that it was much more recently that Americans of the so called progressive persuasion saw no conflict with placing religious symbolism on Government buildings. \n No, all I showed was that the people of the 1930's didn't have qualms about putting up friezes of lawgivers ranging from Moses to Muhammed to Hammurabi, etc.\n \n \n\n This whole drive to erase God and religion from the public square is a totally modern and very recent quest by atheists which is a total corruption of the historical interpretation of the separation of church and state. \n So you claim. And yet you claimed earlier that the Supreme Court building gave hint at the attitude of the founders/early government leaders, when it did no such thing, having been constructed ~150 years AFTER the founders/government leaders.\n \n Come back when you find something that actually CAN speak to them.\n \n Here's a good starting point: Look up the Treaty of Tripoli.\n \n \nSo thankyou for revealing that as recently as the mid 1930s when the Supreme Court Building was constructed, it was understood not to be crossing the line established by the Constitution.\n\n \n Which, unfortunately, was not your claim, as the people of the 1930's are not \"the founders and early government leaders\", which is what you claimed the decorations of the Supreme court building spoke to with regards to their feelings of SOC&S.\n \n I called you on that bovine defecation, and you have the gall to say it was a \"ruse\"?\n \n Be a real Christian and own up to your mistakes, little boy.", 
   {}, 
   358522, 
   null, 
   1245874800.0
  ], 
  [
   358532, 
   null, 
   "Accipiter", 
   "Moses, carrying BLANK tablets, is not alone, but between Confucius and Solon, surrounded by LAW_GIVERS from different races and creeds. Why on earth would they do that on a COURT building, do you think?\n\n \n lmao @ arch, again!", 
   {}, 
   358495, 
   null, 
   1245877080.0
  ], 
  [
   358533, 
   null, 
   "foundit66", 
   "Because when it was built, the left didn't ...\n\n Man.\n It's amazing how much of a victim some of you religious types are, in your own minds...\n It has already been pointed out that it is a demonstration of historic law, including multiple religious presentations.\n If you put up ONE SOLITARY ten commandments monument, that's religious favoritism. That's unconstitutional.\n \n If people allow you to ramble, you'll talk incessantly about how much you think religion is victimized, as you seek special privileges for it... emoticon_rolleyes\n \n \n \nAnd guess what .... the sky has never yet fallen due to that being carved in the wall.\n\n And you know what?\n The sky hasn't fallen either with the restrictions in place!\n I guess that sky is firmly in place up there, no matter how much God's followers (or they think they're god's followers) whine that they are being discriminated against...\n \n Tell me. If Democrats started putting up Democratic party symbology up all over the place, should the Republicans just be unconcerned over it?\n Or better yet, what would be the point in marking territory like that?\n What would be the point in ####### all over the area like an animal marking its territory? Does that serve government function?\n \n And can I just say, I am still less than surprised that you are not discussing the validity of separation of church and state... Not surprised at all...\n You complain others aren't addressing the \"constitutionality\" of it, but here you go COMPLETELY IGNORING the \"constitutionality\" of it...", 
   {}, 
   358507, 
   null, 
   1245877560.0
  ], 
  [
   358539, 
   null, 
   "simone", 
   "If you going to try to foist the ten commandments upon the citizenry of the U.S., what version is to be forced upon us?", 
   {}, 
   358533, 
   null, 
   1245880620.0
  ], 
  [
   363423, 
   null, 
   "ledbythespirit", 
   "Some of you may be wondering what Judge Roy Moore has been doing since he was removed from the bench for refusing to remove the Ten Commandments from his courtroom wall. Please read the poem he wrote.\n The following is a poem written by Judge Roy Moore from Alabama . Judge Moore was sued by the ACLU for displaying the Ten Commandments in his courtroom foyer. He has been stripped of his judgeship and now they are trying to strip his right to practice law in Alabama ! The judge's poem sums it up quite well.\n \n \n America the beautiful,\n or so you used to be.\n Land of the Pilgrims' pride;\n I'm glad they'll never see.\n \n Babies piled in dumpsters,\n Abortion on demand,\n Oh, sweet land of liberty;\n your house is on the sand.\n \n Our children wander aimlessly\n poisoned by cocaine\n choosing to indulge their lusts,\n when God has said abstain\n \n From sea to shining sea,\n our Nation turns away\n From the teaching of God's love\n and a need to always pray\n \n We've kept God in our\n temples, how callous we have grown.\n When earth is but His footstool,\n and Heaven is His throne.\n \n We've voted in a government\n that's rotting at the core,\n Appointing Godless Judges;\n who throw reason out the door,\n \n \n Too soft to place a killer\n in a well deserved tomb,\n But brave enough to kill a baby\n before he leaves the womb.\n \n You think that God's not\n angry, that our land's a moral slum?\n How much longer will He wait\n before His judgment comes?\n \n How are we to face our God,\n from Whom we cannot hide?\n What then is left for us to do,\n but stem this evil tide?\n \n If we who are His children,\n will humbly turn and pray;\n Seek His holy face\n and mend our evil way:\n \n Then God will hear from Heaven;\n and forgive us of our sins,\n He'll heal our sickly land\n and those who live within.\n \n But, America the Beautiful,\n If you don't - then you will see,\n A sad but Holy God\n withdraw His hand from Thee..\n \n ~~Judge Roy Moore~~", 
   {}, 
   358522, 
   null, 
   1249210740.0
  ], 
  [
   363433, 
   null, 
   "Accipiter", 
   "Some of you may be wondering what Judge Roy Moore has been doing since he was removed from the bench for refusing to remove the Ten Commandments from his courtroom wall. Please read the poem he wrote.\n The following is a poem written by Judge Roy Moore from Alabama . Judge Moore was sued by the ACLU for displaying the Ten Commandments in his courtroom foyer. He has been stripped of his judgeship and now they are trying to strip his right to practice law in Alabama ! The judge's poem sums it up quite well.\n \n \n America the beautiful,\n or so you used to be.\n Land of the Pilgrims' pride;\n I'm glad they'll never see.\n \n Babies piled in dumpsters,\n Abortion on demand,\n Oh, sweet land of liberty;\n your house is on the sand.\n \n Our children wander aimlessly\n poisoned by cocaine\n choosing to indulge their lusts,\n when God has said abstain\n \n From sea to shining sea,\n our Nation turns away\n From the teaching of God's love\n and a need to always pray\n \n We've kept God in our\n temples, how callous we have grown.\n When earth is but His footstool,\n and Heaven is His throne.\n \n We've voted in a government\n that's rotting at the core,\n Appointing Godless Judges;\n who throw reason out the door,\n \n \n Too soft to place a killer\n in a well deserved tomb,\n But brave enough to kill a baby\n before he leaves the womb.\n \n You think that God's not\n angry, that our land's a moral slum?\n How much longer will He wait\n before His judgment comes?\n \n How are we to face our God,\n from Whom we cannot hide?\n What then is left for us to do,\n but stem this evil tide?\n \n If we who are His children,\n will humbly turn and pray;\n Seek His holy face\n and mend our evil way:\n \n Then God will hear from Heaven;\n and forgive us of our sins,\n He'll heal our sickly land\n and those who live within.\n \n But, America the Beautiful,\n If you don't - then you will see,\n A sad but Holy God\n withdraw His hand from Thee..\n \n ~~Judge Roy Moore~~\n\n \n I read the poem but didn't find it particularly compelling or even good poetry, but hey it's as much a piece of art as that picture of Jesus you have hanging in your hallway at home.\n \n Seriously, if that guy gets fired for being stubborn about it then I think he's not very smart and probably shouldn't be a judge.", 
   {
    "unicode_changes_made": true
   }, 
   363423, 
   null, 
   1249213320.0
  ], 
  [
   363438, 
   null, 
   "ledbythespirit", 
   "I read the poem but didn't find it particularly compelling or even good poetry, but hey it's as much a piece of art as that picture of Jesus you have hanging in your hallway at home. \n Man If you have to insult my intelligence then just go back and bow down to your idol of mary and beg forgiveness!\n \n Seriously, if that guy gets fired for being stubborn about it then I think he's not very smart and probably shouldn't be a judge.\n Ahh! Based on this response I gather you dont know much at all. Pity.", 
   {
    "unicode_changes_made": true
   }, 
   363433, 
   null, 
   1249214700.0
  ], 
  [
   363440, 
   null, 
   "Accipiter", 
   "Ahh! Based on this response I gather you dont know much at all. Pity.\n\n \n That's not much of an argument.\n \n Instead of just a personal insult why not add something of topical substance to go with it?", 
   {
    "unicode_changes_made": true
   }, 
   363438, 
   null, 
   1249215420.0
  ], 
  [
   363449, 
   null, 
   "Easyrider", 
   "Archangel: This whole drive to erase God and religion from the public square is a totally modern and very recent quest by atheists which is a total corruption of the historical interpretation of the separation of church and state. \n \n \n\n \n So you claim. And yet you claimed earlier that the Supreme Court building gave hint at the attitude of the founders/early government leaders, when it did no such thing, having been constructed ~150 years AFTER the founders/government leaders.\n \n Come back when you find something that actually CAN speak to them.\n\n \n I get the impression you never seriously studied religion in early America and the founding fathers. How does this speak to you?\n \n JEFFERSON AND MADISON\n \n Within a year of his inauguration, Jefferson began attending church services in the House of Representatives. Madison followed Jefferson's example, although unlike Jefferson, who rode on horseback to church in the Capitol, Madison came in a coach and four. Worship services in the House--a practice that continued until after the Civil War--were acceptable to Jefferson because they were nondiscriminatory and voluntary. Preachers of every Protestant denomination appeared. (Catholic priests began officiating in 1826.) As early as January 1806 a female evangelist, Dorothy Ripley, delivered a camp meeting-style exhortation in the House to Jefferson, Vice President Aaron Burr, and a \"crowded audience.\" Throughout his administration Jefferson permitted church services in executive branch buildings. The Gospel was also preached in the Supreme Court chambers. \n \n Reserved Seats at Capitol Services\n \n Here is a description, by an early Washington \"insider,\" Margaret Bayard Smith (1778-1844), a writer and social critic and wife of Samuel Harrison Smith, publisher of the National Intelligencer, of Jefferson's attendance at church services in the House of Representatives: \"Jefferson during his whole administration was a most regular attendant. The seat he chose the first day sabbath, and the adjoining one, which his private secretary occupied, were ever afterwards by the courtesy of the congregation, left for him.\"\n \n The Old House of Representatives\n \n Church services were held in what is now called Statuary Hall from 1807 to 1857. The first services in the Capitol, held when the government moved to Washington in the fall of 1800, were conducted in the \"hall\" of the House in the north wing of the building. In 1801 the House moved to temporary quarters in the south wing, called the \"Oven,\" which it vacated in 1804, returning to the north wing for three years. Services were conducted in the House until after the Civil War. The Speaker's podium was used as the preacher's pulpit. \n \n A Millennialist Sermon Preached in Congress\n \n This sermon on the millennium was preached by the Baltimore Swedenborgian minister, John Hargrove (1750-1839) in the House of Representatives. One of the earliest millennialist sermons preached before Congress was offered on July 4, 1801, by the Reverend David Austin (1759-1831), who at the time considered himself \"struck in prophesy under the style of the Joshua of the American Temple.\" Having proclaimed to his Congressional audience the imminence of the Second Coming of Christ, Austin took up a collection on the floor of the House to support services at \"Lady Washington's Chapel\" in a nearby hotel where he was teaching that \"the seed of the Millennial estate is found in the backbone of the American Revolution.\"\n \n First Catholic Sermon in the House\n \n On January 8, 1826, Bishop John England (1786-1842) of Charleston, South Carolina, became the first Catholic clergyman to preach in the House of Representatives. The overflow audience included President John Quincy Adams, whose July 4, 1821, speech England rebutted in his sermon. \n \n Woman Preacher in the House (and call for revival!)\n \n In 1827, Harriet Livermore (1788-1868), the daughter and granddaughter of Congressmen, became the second woman to preach in the House of Representatives. The first woman to preach before the House (and probably the first woman to speak officially in Congress under any circumstances) was the English evangelist, Dorothy Ripley (1767-1832), who conducted a service on January 12, 1806. Jefferson and Vice President Aaron Burr were among those in a \"crowded audience.\" Sizing up the congregation, Ripley concluded that \"very few\" had been born again and broke into an urgent, camp meeting style exhortation, insisting that \"Christ's Body was the Bread of Life and His Blood the drink of the righteous.\"\n \n Communion Service in the Treasury Building\n \n Manasseh Cutler here describes a four-hour communion service in the Treasury Building, conducted by a Presbyterian minister, the Reverend James Laurie: \"Attended worship at the Treasury. Mr. Laurie alone. Sacrament. Full assembly. Three tables; service very solemn; nearly four hours.\" \n \n Adams's Description of a Church Service in the Supreme Court\n \n John Quincy Adams here describes the Reverend James Laurie, pastor of a Presbyterian Church that had settled into the Treasury Building, preaching to an overflow audience in the Supreme Court Chamber, which in 1806 was located on the ground floor of the Capitol. \n \n The Old Supreme Court Chamber\n \n Description of church services in the Supreme Court chamber by Manasseh Cutler (1804) and John Quincy Adams (1806) indicate that services were held in the Court soon after the government moved to Washington in 1800.\n \n Church Services in Congress after the Civil War\n \n Charles Boynton (1806-1883) was in 1867 chaplain of the House of Representatives and organizing pastor of the First Congregational Church in Washington, which was trying at that time to build its own sanctuary. In the meantime the church, as Boynton informed potential donors, was holding services \"at the Hall of Representatives\" where \"the audience is the largest in town. . . .nearly 2000 assembled every Sabbath\" for services, making the congregation in the House the \"largest Protestant Sabbath audience then in the United States.\" The First Congregational Church met in the House from 1865 to 1868. \n \n House of Representatives, After the Civil War\n \n The House moved to its current location on the south side of the Capitol in 1857. It contained the \"largest Protestant Sabbath audience\" in the United States when the First Congregational Church of Washington held services there from 1865 to 1868. \n \n Compliments: U.S. Library of Congress\n \n Religion and the Federal Government: PART 2 (Religion and the Founding of the American Republic, Library of Congress Exhibition)", 
   {}, 
   358525, 
   null, 
   1249218240.0
  ], 
  [
   363451, 
   null, 
   "Easyrider", 
   "\n \n Here's a good starting point: Look up the Treaty of Tripoli.\n \n\n \n You're grasping at straws, Brigid.\n \n Treaty of Tripoli\n \n \"As the Government of the United States of America is not, in any sense, founded on the Christian religion...\" --From Article 11 of the Treaty of Tripoli\n \n What you're missing is this:\n \n Article 11 merely says that the government of America is not founded on the Christian religion, as in a theocracy. This does not mean that the majority of Americans were not of the Christian faith, and it certainly doesn't address the numerous Judeo-Christian principles upon which our country was founded. In those respects, it falls short in describing America.", 
   {}, 
   358525, 
   null, 
   1249218420.0
  ], 
  [
   363478, 
   null, 
   "Penfold", 
   "\"Not in ANY sense founded\"?", 
   {}, 
   363451, 
   null, 
   1249227360.0
  ], 
  [
   363481, 
   null, 
   "Easyrider", 
   "\"Not in ANY sense founded\"?\n\n \n Well, consider these then, if you really want another opinion:\n \n Concerning the outcome of the American Revolution, John Quincy Adams noted, \"The highest glory won from the American Revolution was this: it connected, in one indissoluble bond, the principles of civil government with the principles of Christianity.\" \n \n In a letter to Thomas Jefferson dated June 28, 1813, John Adams wrote: \"The general principles on which the (founding) fathers achieved independence were....the general principles of Christianity.\"\n \n Founding father Noah Webster proclaimed much the same message when he said, \"The religion which has introduced civil liberty is the religion of Christ and His Apostles....This is genuine Christianity and to this we owe our free constitutions of government\" (History of the United States, 1832). \n \n Time after time, the founding fathers declared the same beliefs. From the archives of Patrick Henry's personal notes (handwritten on the back of his copy of the \"Stamp Act Resolutions,\" made public after his death) we read:\n \n \"Whether this (new government) will prove a blessing or a curse \n will depend upon the use our people make of the blessings which\n a gracious God hath bestowed on us. If they are wise they will be\n great and happy. If they are of a contrary character, they will be\n miserable. Righteousness alone can exalt them as a nation.\" \n \n There's tons more where those came from, so enough with this liberal swill that God is not to be referenced in the halls of government or in the public square. The only people who believe that are ignorant and don't know the early history of America. There ought to be a bounty on those spiritually and historically-stunted imbeciles.", 
   {}, 
   363478, 
   null, 
   1249228140.0
  ], 
  [
   363489, 
   null, 
   "foundit66", 
   "You're grasping at straws, Brigid.\n Treaty of Tripoli\n \"As the Government of the United States of America is not, in any sense, founded on the Christian religion...\" --From Article 11 of the Treaty of Tripoli\n\n What is so difficult to comprehend about \"in any sense\"?\n \n \n \nWhat you're missing is this:\n Article 11 merely says that the government of America is not founded on the Christian religion, as in a theocracy.\n\n No.\n As \"not in any sense\".\n Which includes \"theocracy\", but a WHOLE LOT MORE than that...\n \n \n \nThis does not mean that the majority of Americans were not of the Christian faith...\n\n emoticon_frazzled emoticon_frazzled emoticon_frazzled\n I really, really, really, REALLY wish Christian Americans (the ones who insist on trying to mark governmental territory) would be comfortable with that.\n If they were, things would go a whole lot smoother...\n \n But ...\n \n \n \n... and it certainly doesn't address the numerous Judeo-Christian principles upon which our country was founded. In those respects, it falls short in describing America.\n\n I swear.\n This is one of those claims that NEVER SEEMS TO DIE, but has ABSOLUTELY NO BASIS for the claim.\n You claim our country was founded on \"numerous Judeo-Christian principles\".\n \n Fine.\n QUOTE the constitution and tell me WHICH PRINCIPLES our government is founded upon that are \"Judeo-Christian\".\n emoticon_xdonno\n \n Can't do it, can you...\n \n And what's even more laughable is when some people try to answer that question, they simply reveal their own ignorance. Like I have seen several people try to answer that challenge by \"referencing\" imaginary references to Jesus / Bible in the constitution.\n Nope! Not a single reference.", 
   {}, 
   363451, 
   null, 
   1249229880.0
  ], 
  [
   363491, 
   null, 
   "Penfold", 
   "Judge Moore's rhyming doggerel\n Is moribund and dated\n He thinks his world's a living hell\n But then he's addlepated.\n \n He thought that as he was a judge\n His plans betrayed no flaw\n The home decor within his court\n Must be above the law\n \n He soon found out this was not so\n Despite his protestations\n His honour's idols had to go\n To shore up his foundations\n ;)", 
   {}, 
   363489, 
   null, 
   1249232220.0
  ], 
  [
   363511, 
   null, 
   "simone", 
   "The Ten Commandments are wrong!\n \n And no one has any business using my tax dollars to post them in public places.", 
   {}, 
   363491, 
   null, 
   1249240140.0
  ], 
  [
   363539, 
   null, 
   "Easyrider", 
   "\n \n Fine.\n QUOTE the constitution and tell me WHICH PRINCIPLES our government is founded upon that are \"Judeo-Christian\".\n emoticon_xdonno\n \n Can't do it, can you...\n\n \n Tsk tsk...\n \n Who says they have to be in the Constitution, Mr. Strawman?\n \n \"Of all the systems of morality, ancient or modern which have come under my observation, none appears to me so pure as that of Jesus.\" - Thomas Jefferson\n \n Many more like that in the link below.\n \n A nation founded on Christian principles...\n \n It became a nation based largely on Judeo-Christian principles, as in Thou shalt not murder, steal, commit adultery, and so on. It wasn't built on the throes of Sodom and Gomorrah. \n \n \n\n And what's even more laughable is when some people try to answer that question, they simply reveal their own ignorance. Like I have seen several people try to answer that challenge by \"referencing\" imaginary references to Jesus / Bible in the constitution.\n Nope! Not a single reference.\n\n \n You ignorance is showing and you just embarrassed yourself again.\n \n \"done in Convention by the Unanimous Consent of the States present the Seventeenth Day of September in the Year of our Lord one thousand seven hundred and Eighty seven...\"\n \n \"OUR LORD\"!! There's only one Lord that can be seriously attributed to - Jesus Christ.", 
   {
    "unicode_changes_made": true
   }, 
   363489, 
   null, 
   1249247760.0
  ], 
  [
   363544, 
   null, 
   "foundit66", 
   "Tsk tsk...\n Who says they have to be in the Constitution, Mr. Strawman?\n\n ROFLMAO!\n You say this country was FOUNDED on Christian principles.\n This country was FOUNDED on the constitution.\n So there should be some Christian principles IN the constitution if there is such a thing as \"this country was founded on Christian principles\".\n \n \n \n\"Of all the systems of morality, ancient or modern which have come under my observation, none appears to me so pure as that of Jesus.\" - Thomas Jefferson\n Many more like that in the link below.\n A nation founded on Christian principles...\n It became a nation based largely on Judeo-Christian principles, as in Thou shalt not murder, steal, commit adultery, and so on. It wasn't built on the throes of Sodom and Gomorrah. \n\n Are you kidding me?\n EVERY CULTURE has rules against \"murder\" and \"theft\". Those aren't specifically \"Judeo-Christian\" principles any more than any other culture or religion.\n \n Furthermore, politicians can CLAIM anything they like, but can you objectively prove your claim.\n Can you point to ANY REAL ASPECT of this country's foundation, and show how that aspect of this country's foundation is biblically based?\n \n As it is, communists don't like murder, theft, or adultery either.\n I guess we could just as legitimately say that this country was founded on communist principles, as long as we could find a few politicians to say that... emoticon_frazzled\n \n \n \nYou ignorance is showing and you just embarrassed yourself again.\n \"done in Convention by the Unanimous Consent of the States present the Seventeenth Day of September in the Year of our Lord one thousand seven hundred and Eighty seven...\"\n \"OUR LORD\"!! There's only one Lord that can be seriously attributed to - Jesus Christ.\n\n ROFLMAO!\n OMG! You want to claim that the fact that they mentioned \"Lord\" IN THE DATE somehow proves that this country was \"founded\" in Christianity.\n \n Here. I am saying that I am posting this \"in the year of the Lord, 2009\", so that must make me founded in Christianity then, huh...\n emoticon_frazzled\n \n The issue is not whether or not people who wrote the constitution WERE Christian.\n The issue is whether or not the COUNTRY WAS FOUNDED in Christianity...\n \n Can't you tell the difference?", 
   {
    "unicode_changes_made": true
   }, 
   363539, 
   null, 
   1249250040.0
  ], 
  [
   363552, 
   null, 
   "Easyrider", 
   "Hey - you want to stay in a perpetual state of denial that's fine with me. \n \n If it was all based on secularism then why have you God-deniers been wearing out so many ACLU lawyers for the past 50+ years trying to get all the vestiges of God and Biblical Christianity out of the government and the public square?", 
   {}, 
   363544, 
   null, 
   1249252380.0
  ], 
  [
   363557, 
   null, 
   "T.Q", 
   "If it was all based on secularism then why have you God-deniers been wearing out so many ACLU lawyers for the past 50+ years trying to get all the vestiges of God and Biblical Christianity out of the government and the public square?\n\n \n Can someone explain this pattern of thought to me? I always see this; \"If I'm so wrong, how come people keep telling me how wrong I am?\"\n \n It's ridiculous.", 
   {}, 
   363552, 
   null, 
   1249253940.0
  ], 
  [
   363569, 
   null, 
   "Archangel", 
   "Can someone explain this pattern of thought to me? I always see this; \"If I'm so wrong, how come people keep telling me how wrong I am?\"\n \n It's ridiculous.\n\n \n It's necessary because you obviously aren't smart enough to recognize how wrong you are. Just asking the question is evidence of that.", 
   {}, 
   363557, 
   null, 
   1249256820.0
  ], 
  [
   363571, 
   null, 
   "T.Q", 
   "Archie, we already know you're incapable of coherent thought. You don't have to keep proving it.\n \n Anyone want to actually answer the question?", 
   {}, 
   363569, 
   null, 
   1249257060.0
  ], 
  [
   363572, 
   null, 
   "Archangel", 
   "Archie, we already know you're incapable of coherent thought. You don't have to keep proving it.\n \n Anyone want to actually answer the question?\n\n \n A statement like this coming from you is strong evidence of just the opposite. Thanks for proving my point. emoticon_smileemoticon_xangelemoticon_rolleyes", 
   {}, 
   363571, 
   null, 
   1249257180.0
  ], 
  [
   363649, 
   null, 
   "jyoshu", 
   "Can someone explain this pattern of thought to me? I always see this; \"If I'm so wrong, how come people keep telling me how wrong I am?\"\n \n It's ridiculous.\n\n \n I think his point was more about the activism and crusading that goes on to do things like spending enormous legal resources and time toward forcing down a list of ancient laws on courthouse walls just because its source happens to be a (GASP!) religious one. (Never mind the fact that it would probably be very hard to find any ancient law code that old that wasn't tied in with the religions of the time.) If all you were doing was merely saying it was \"wrong\", I don't think there would be a problem here.", 
   {}, 
   363557, 
   null, 
   1249272660.0
  ], 
  [
   363669, 
   null, 
   "foundit66", 
   "Hey - you want to stay in a perpetual state of denial that's fine with me. \n\n ROFLMAO!\n You talk about \"perpetual state of denial\", but you can't answer a simple challenge.\n I'm asking you to show WHAT ASPECT of this country's \"founding\" is based on WHAT PART of the bible...\n \n You can quote people CLAIMING that, but that's rather hollow.\n The Treaty of Tripoli has also been quoted, and that was actually an OFFICIAL GOVERNMENT DOCUMENT.\n \n \n \nIf it was all based on secularism then why have you God-deniers been wearing out so many ACLU lawyers for the past 50+ years trying to get all the vestiges of God and Biblical Christianity out of the government and the public square?\n\n You really can't comprehend when one thing has nothing to do with the other.\n Christians want to mark territory that ain't theirs by putting religious monuments up on government property.\n That DOES NOT mean that the country is \"founded\" on Christianity.\n \n Moreover, you are exaggerating to a ridiculous degree.\n NEW monuments have been fought.\n Try to appreciate the difference between a MODERN movement amongst Christians to try to insinuate religious symbols where they don't belong, and the country's \"founding\" which happened centuries ago...\n \n \n \nI think his point was more about the activism and crusading that goes on to do things like spending enormous legal resources and time toward forcing down a list of ancient laws on courthouse walls just because its source happens to be a (GASP!) religious one.\n\n emoticon_xdonno\n In which case, the reply was obviously nonsense.\n Just because somebody spends money to remove something that should never have been there doesn't mean that the item had validity in being there in the first place.\n \n \n \nIf all you were doing was merely saying it was \"wrong\", I don't think there would be a problem here. \n\n You point to a specious difference with no real merit to the conclusion being made...\n HOW would the original point be any more invalidated if we just \"said\" it was wrong, instead of making a serious effort to get the unconstitutional item removed?\n \n If we just SAID it was wrong, would that somehow provide more proof that the country was not founded on Christianity, as opposed to fervent efforts to remove it?\n \n \n And just to clarify, my points actually have little (to nothing) to do with any fault in your interpretation.\n My points have to do with how the interpretation makes no sense as compared to how the original poster (Easyrider) was trying to apply them.\n Truth be told, I don't think Easyriders comments have ANY sense compared to how the original poster was trying to apply them anyways...\n (For example, if Easyrider said \"The barn is red, therefore the sun rises in the north\", a person could patiently explain what \"the barn is red\" means and it would provide no insight as to why Easyrider would think a red barn somehow means the sun rises in the north...)", 
   {}, 
   363552, 
   null, 
   1249287600.0
  ], 
  [
   363683, 
   null, 
   "jyoshu", 
   "HOW would the original point be any more invalidated if we just \"said\" it was wrong, instead of making a serious effort to get the unconstitutional item removed?\n\n \n Meh. \n The only reason an ancient list of laws adorning courthouse walls should a problem is if judges are referring to and using it it as legal code. Otherwise, such crusading to sterilize courthouses of any traces of religion is pretty silly. Not to mention a collosal waste of money. Religion is a real part of history that touched every part of life, you're never going to be able to get away from it, historically speaking.", 
   {}, 
   363669, 
   null, 
   1249311000.0
  ], 
  [
   363706, 
   null, 
   "ServantOfChrist", 
   "Tsk tsk...\n \n Who says they have to be in the Constitution, Mr. Strawman?\n \n \"Of all the systems of morality, ancient or modern which have come under my observation, none appears to me so pure as that of Jesus.\" - Thomas Jefferson\n \n Many more like that in the link below.\n \n A nation founded on Christian principles...\n \n\n \n If I were you, ER, I wouldn't quote Jefferson to prove anything. There are much better founding father quotes to show that we were founded on Christian principles than him.\n \n The thing about Jefferson is that (IIRC he was a deist) while he admired Jesus and his teachings, he thought the miracles and such in the NT were nonsense.\n \n Have you ever read the Jefferson Bible? It removes all supernatural from the gospels, and ends at Jesus death and doesn't include the ressurection, distilling it down to merely Jesus' teachings.\n \n I think using Jefferson to prove Christian founding is a bit self-refuting.\n \n Just a suggestion from a fellow Christian. :)", 
   {
    "unicode_changes_made": true
   }, 
   363539, 
   null, 
   1249321500.0
  ], 
  [
   363709, 
   null, 
   "Easyrider", 
   "If I were you, ER, I wouldn't quote Jefferson to prove anything. There are much better founding father quotes to show that we were founded on Christian principles than him.\n \n The thing about Jefferson is that (IIRC he was a deist) while he admired Jesus and his teachings, he thought the miracles and such in the NT were nonsense.\n \n Have you ever read the Jefferson Bible? It removes all supernatural from the gospels, and ends at Jesus death and doesn't include the ressurection, distilling it down to merely Jesus' teachings.\n \n I think using Jefferson to prove Christian founding is a bit self-refuting.\n \n Just a suggestion from a fellow Christian. :)\n\n \n I'm very familiar with all that, except it's a major reach to call Jefferson a deist. A deist in his day was someone who did not believe in revealed revelation, and one who believed that God did not involve himself in the affairs of men and nations. And Jefferson has quotes on record contrary to those two deist beliefs. But he still believed the moral framework of Jesus was the best around, so at least he got one thing right.", 
   {}, 
   363706, 
   null, 
   1249322700.0
  ], 
  [
   363711, 
   null, 
   "Easyrider", 
   "\n Truth be told, I don't think Easyriders comments have ANY sense compared to how the original poster was trying to apply them anyways...\n (For example, if Easyrider said \"The barn is red, therefore the sun rises in the north\", a person could patiently explain what \"the barn is red\" means and it would provide no insight as to why Easyrider would think a red barn somehow means the sun rises in the north...)\n\n \n You've lost it dude. I have a book to recommend so you can educate yourself on these issues:\n \n America's God and Country, Encyclopedia of Quotations.\n \n Try Amazon.com", 
   {}, 
   363669, 
   null, 
   1249322880.0
  ], 
  [
   363714, 
   null, 
   "Penfold", 
   ".......\n Truth be told, I don't think Easyriders comments have ANY sense compared to how the original poster was trying to apply them anyways...\n (For example, if Easyrider said \"The barn is red, therefore the sun rises in the north\", a person could patiently explain what \"the barn is red\" means and it would provide no insight as to why Easyrider would think a red barn somehow means the sun rises in the north...)\n\n \n It looks more like a lean-to shed beside the barn, with a transparent sky-blue pink saccharin coating, still waiting for the dawn to enlighten the darkness.", 
   {}, 
   363669, 
   null, 
   1249325220.0
  ], 
  [
   363716, 
   null, 
   "foundit66", 
   "You've lost it dude. I have a book to recommend so you can educate yourself on these issues:\n America's God and Country, Encyclopedia of Quotations.\n Try Amazon.com\n\n I have \"lost it\"?\n ROFLMAO!\n \n You're not even listening any more.\n I'm not asking for people who have an opinion that the country was founded on Christianity.\n I'm asking for ANY OBJECTIVE EVIDENCE of that claim.\n \n Show me some aspect of our country's foundation, and then show me the biblical basis thereof.\n It just does not exist.\n \n You insisting I look at a book of quotes, while refusing to satisfy a simple request, speaks volumes to the weakness of your position.", 
   {}, 
   363711, 
   null, 
   1249326180.0
  ], 
  [
   363718, 
   null, 
   "foundit66", 
   "Meh.\n The only reason an ancient list of laws adorning courthouse walls should a problem is if judges are referring to and using it it as legal code.\n\n That's funny.\n I remember a thread where a mannequin was in a store window, and a bunch of people were pitching a fit (and defending the people pitching a fit) because that mannequin was perceived to be \"dressed gay\".\n \n But I guess when it comes to people wanting to observe the CONSTITUTION and its requirement for no establishment of religion, we should only have a problem if it is being used as legal code... emoticon_xdonno\n \n \n \nOtherwise, such crusading to sterilize courthouses of any traces of religion is pretty silly. Not to mention a collosal waste of money.\n\n I would love to see a break-down of the anti-gay cause, and the anti-religious monument cause.\n Cause you SERIOUSLY have a myopic idea of what is a \"collosal\" waste of money...\n \n In aiding that effort, I have SEVERAL MULTI-MILLION dollar organizations that are anti-gay.\n To help balance things out, do you know of any \"anti-religious monument\" group that devotes a primary portion of their funding towards that cause for comparison?\n emoticon_wow\n \n \n \nReligion is a real part of history that touched every part of life, you're never going to be able to get away from it, historically speaking.\n\n Who says \"getting away from it\" is our intent?\n I urge people that if they want to put up such monuments, put them up on your OWN CHURCH PROPERTY or your own personal property.\n \n The government has separation of church and state.\n Respect that.", 
   {}, 
   363716, 
   null, 
   1249326480.0
  ], 
  [
   363727, 
   null, 
   "trebor", 
   "Meh. \n The only reason an ancient list of laws adorning courthouse walls should a problem is if judges are referring to and using it it as legal code. Otherwise, such crusading to sterilize courthouses of any traces of religion is pretty silly. Not to mention a collosal waste of money. Religion is a real part of history that touched every part of life, you're never going to be able to get away from it, historically speaking.\n\n \n That is entirely incorrect. The manner in which it was put in there , and the way it was displayed is not only promoting the Christian religion , which is against the constitution, but it is telling any Muslim, Hindu, taoist , or any other non-Christian person that they are second class citizens in that court room.\n \n The ironic thing is that when the conserative Christians had prayer meetings there, showing it to be a graven image, and breaking one of the commandments with their veneration of it.", 
   {}, 
   363683, 
   null, 
   1249329840.0
  ], 
  [
   363738, 
   null, 
   "MrWriteLA", 
   "For starters, \"How many of the Ten Commandemnts are against the law in the US?\"\n \n (Hint: two)", 
   {}, 
   363716, 
   null, 
   1249338660.0
  ], 
  [
   363748, 
   null, 
   "Easyrider", 
   "I have \"lost it\"?\n ROFLMAO!\n \n You're not even listening any more.\n I'm not asking for people who have an opinion that the country was founded on Christianity.\n I'm asking for ANY OBJECTIVE EVIDENCE of that claim.\n \n\n \n He's still in denial, folks.\n \n Here's a short list.\n \n America&#8217;s Christian Foundations \n \n America's Christian Foundation\n \n Of the 13 colonies, 9 had an official state church. *\n \n Thomas Jefferson [around 1802] recommended at one point that students at the University of Virginia be allowed to meet on campus to pray and worship together; and if need be, he said, to meet together with their professors and pray. *\n \n Thomas Jefferson was the author of the first plan of public education adopted for the city of Washington D.C., which included among other things, the Bible and Isaac Watts' Hymnal as the principle books that would be used to teach reading in the public schools of Washington D.C. *\n \n The Constitution of Delaware said this [paraphrased]: While recognizing that nobody should be compelled to attend religious worship...it is the duty of all men frequently to assemble together for public worship of the \"Author of the universe.\" *\n \n In virtually every state, public office holders were required to affirm their belief in Biblical teachings. The Delaware Constitution prescribes this formal oath, \"I do profess faith in God the Father, and in Jesus Christ, His only Son, and in the Holy Ghost, on God blessed forevermore; and I do acknowledge the Holy Scriptures in the Old and New Testament to be given by divine inspiration.\" *\n \n Maryland required an oath in the belief of the Christian religion for every state officer. *\n \n In 1777, the Continental Congress ordered 22,000 Bibles to be distributed in this country, \"so that the people would be well-supplied with the political textbook of this nation.\"*\n \n Notable Quotes \n \n \"Providence has given to our people the choice of their rulers, and it is the duty ... of our Christian nation to select and prefer Christians for their rulers.\" (1816) \n \n -- First chief justice of the U.S. Supreme Court, John Jay \n \n \"I believe no one can read the history of our country without realizing that the Good Book and the spirit of the Savior have from the beginning been our guiding geniuses ... Whether we look to the first Charter of Virginia ... or to the Charter of New England ... or to the Charter of Massachusetts Bay ... or to the Fundamental Orders of Connecticut ... the same objective is present ... a Christian land governed by Christian principles. I believe the entire Bill of Rights came into being because of the knowledge our forefathers had of the Bible and their belief in it: freedom of belief, of expression, of assembly, of petition, the dignity of the individual, the sanctity of the home, equal justice under law, and the reservation of powers to the people ... I like to believe we are living today in the spirit of the Christian religion. I like also to believe that as long as we do so, no great harm can come to our country.\"\n \n -- [Liberal] Supreme Court chief justice, Earl Warren \n \n \"... Let me live according to those holy rules which Thou hast this day prescribed in Thy holy word ... Direct me to the true object, Jesus Christ the way, the truth and the life. Bless, O Lord, all the people of this land.\" \n \n -- George Washington \n \n \"Reason and experience both forbid us to expect that national morality can prevail in exclusion of religious principle.\" \n \n -- George Washington \n \n \"Our Constitution was made only for a moral and religious people. It is wholly inadequate to the government of any other.\" \"We have no government armed with power capable of contending with passions unbridled by morality and religion.\" \"Statesmen may plan and speculate for liberty, but it is religion and morality alone, which can establish the principles upon which freedom can securely stand.\" \n \n -- John Adams \n \n \"Can the liberties of a nation be thought secure when we have removed their only firm basis, a conviction in the minds of the people that these liberties are of the gift of God?\"\n \n -- Thomas Jefferson \n \n \"No power over the freedom of religion [is] delegated to the United States by the Constitution.\" \n \n -- James Madison \n \n \"We have staked the whole future of American civilization, not on the power of government...[but] upon the capacity of each and every one of us to govern ourselves according to the Ten Commandments of God.\" \n \n -- John Quincy Adams \n \n \"All must admit that the reception of the teachings of Christ results in the purest patriotism, in the most scrupulous fidelity to public trust, and in the best type of citizenship.\" \n \n -- Grover Cleveland \n \n \"In this actual world, a churchless community, a community where men have abandoned and scoffed at, or ignored their religious needs, is a community on the rapid down-grade.\" \n \n -- Teddy Roosevelt \n \n \"America was born a Christian nation. America was born to exemplify that devotion to the elements of righteousness which are derived from the revelations of the Holy Scripture.\" \n \n -- Woodrow Wilson \n \n \"They [the Founding Fathers] were intent upon establishing a Christian commonwealth in accordance with the principle of self-government. They were an inspired body of men. It has been said that God sifted the nations that He might send choice grain into the wilderness ... Who can fail to see it in the hand of Destiny? Who can doubt that it has been guided by a Divine Providence?\" \n \n -- Calvin Coolidge \n \n * Based on both the notes from America: The First 350 Years, by Rev. J. Steven Wilkins, and personal notes taken while listening to America: The First 350 Years.\n \n The Founding Fathers on Jesus, Christianity and the Bible \n \n http://www.wallbuilders.com/LIBissuesArticles.asp?id=8755\n \n (This list is by no means exhaustive; many other Founders could be included, and even with those who appear below, additional quotes could have been used.)\n \n \n John Adams\n \n \n SIGNER OF THE DECLARATION OF INDEPENDENCE; JUDGE; DIPLOMAT; ONE OF TWO SIGNERS OF THE BILL OF RIGHTS; SECOND PRESIDENT OF THE UNITED STATES\n \n The general principles on which the fathers achieved independence were the general principles of Christianity. I will avow that I then believed, and now believe, that those general principles of Christianity are as eternal and immutable as the existence and attributes of God.1 \n \n The Holy Ghost carries on the whole Christian system in this earth. Not a baptism, not a marriage, not a sacrament can be administered but by the Holy Ghost. . . . There is no authority, civil or religious &#8211; there can be no legitimate government but what is administered by this Holy Ghost. There can be no salvation without it. All without it is rebellion and perdition, or in more orthodox words damnation.2 \n \n Without religion, this world would be something not fit to be mentioned in polite company: I mean hell.3 \n \n The Christian religion is, above all the religions that ever prevailed or existed in ancient or modern times, the religion of wisdom, virtue, equity and humanity.4 \n \n Suppose a nation in some distant region should take the Bible for their only law book and every member should regulate his conduct by the precepts there exhibited. . . . What a Eutopia &#8211; what a Paradise would this region be!5 \n \n I have examined all religions, and the result is that the Bible is the best book in the world.6 \n \n \n John Quincy Adams \n \n \n SIXTH PRESIDENT OF THE UNITED STATES; DIPLOMAT; SECRETARY OF STATE; U. S. SENATOR; U. S. REPRESENTATIVE; &#8220;OLD MAN ELOQUENT&#8221;; &#8220;HELL-HOUND OF ABOLITION&#8221; \n \n My hopes of a future life are all founded upon the Gospel of Christ and I cannot cavil or quibble away [evade or object to]. . . . the whole tenor of His conduct by which He sometimes positively asserted and at others countenances [permits] His disciples in asserting that He was God.7 \n \n The hope of a Christian is inseparable from his faith. Whoever believes in the Divine inspiration of the Holy Scriptures must hope that the religion of Jesus shall prevail throughout the earth. Never since the foundation of the world have the prospects of mankind been more encouraging to that hope than they appear to be at the present time. And may the associated distribution of the Bible proceed and prosper till the Lord shall have made &#8220;bare His holy arm in the eyes of all the nations, and all the ends of the earth shall see the salvation of our God&#8221; [Isaiah 52:10].8 \n \n In the chain of human events, the birthday of the nation is indissolubly linked with the birthday of the Savior. The Declaration of Independence laid the cornerstone of human government upon the first precepts of Christianity.9 \n \n \n Samuel Adams\n \n \n SIGNER OF THE DECLARATION OF INDEPENDENCE; &#8220;FATHER OF THE AMERICAN REVOLUTION&#8221;; RATIFIER OF THE U. S. CONSTITUTION; GOVERNOR OF MASSACHUSETTS\n \n I . . . [rely] upon the merits of Jesus Christ for a pardon of all my sins.10 \n \n The name of the Lord (says the Scripture) is a strong tower; thither the righteous flee and are safe [Proverbs 18:10]. Let us secure His favor and He will lead us through the journey of this life and at length receive us to a better.11\n \n I conceive we cannot better express ourselves than by humbly supplicating the Supreme Ruler of the world . . . that the confusions that are and have been among the nations may be overruled by the promoting and speedily bringing in the holy and happy period when the kingdoms of our Lord and Savior Jesus Christ may be everywhere established, and the people willingly bow to the scepter of Him who is the Prince of Peace.12 \n \n He also called on the State of Massachusetts to pray that . . . \n \n the peaceful and glorious reign of our Divine Redeemer may be known and enjoyed throughout the whole family of mankind.13 \n we may with one heart and voice humbly implore His gracious and free pardon through Jesus Christ, supplicating His Divine aid . . . [and] above all to cause the religion of Jesus Christ, in its true spirit, to spread far and wide till the whole earth shall be filled with His glory.14 \n with true contrition of heart to confess their sins to God and implore forgiveness through the merits and mediation of Jesus Christ our Savior.15 \n \n Josiah Bartlett \n \n MILITARY OFFICER; SIGNER OF THE DECLARATION OF INDEPENDENCE; JUDGE; GOVERNOR OF NEW HAMPSHIRE\n \n Called on the people of New Hampshire . . . to confess before God their aggravated transgressions and to implore His pardon and forgiveness through the merits and mediation of Jesus Christ . . . [t]hat the knowledge of the Gospel of Jesus Christ may be made known to all nations, pure and undefiled religion universally prevail, and the earth be fill with the glory of the Lord.16 \n \n Gunning Bedford\n \n \n MILITARY OFFICER; MEMBER OF THE CONTINENTAL CONGRESS; SIGNER OF THE CONSTITUTION; FEDERAL JUDGE\n \n To the triune God &#8211; the Father, the Son, and the Holy Ghost &#8211; be ascribed all honor and dominion, forevermore &#8211; Amen.17 \n \n \n Elias Boudinot\n \n \n PRESIDENT OF CONGRESS; SIGNED THE PEACE TREATY TO END THE AMERICAN REVOLUTION; FIRST ATTORNEY ADMITTED TO THE U. S. SUPREME COURT BAR; FRAMER OF THE BILL OF RIGHTS; DIRECTOR OF THE U. S. MINT\n \n Let us enter on this important business under the idea that we are Christians on whom the eyes of the world are now turned&#8230; [L]et us earnestly call and beseech Him, for Christ&#8217;s sake, to preside in our councils. . . . We can only depend on the all powerful influence of the Spirit of God, Whose Divine aid and assistance it becomes us as a Christian people most devoutly to implore. Therefore I move that some minister of the Gospel be requested to attend this Congress every morning . . . in order to open the meeting with prayer.18 \n \n A letter to his daughter: \n \n You have been instructed from your childhood in the knowledge of your lost state by nature &#8211; the absolute necessity of a change of heart and an entire renovation of soul to the image of Jesus Christ &#8211; of salvation through His meritorious righteousness only &#8211; and the indispensable necessity of personal holiness without which no man shall see the Lord [Hebrews 12:14]. You are well acquainted that the most perfect and consummate doctrinal knowledge is of no avail without it operates on and sincerely affects the heart, changes the practice, and totally influences the will &#8211; and that without the almighty power of the Spirit of God enlightening your mind, subduing your will, and continually drawing you to Himself, you can do nothing. . . . And may the God of your parents (for many generations past) seal instruction to your soul and lead you to Himself through the blood of His too greatly despised Son, Who notwithstanding, is still reclaiming the world to God through that blood, not imputing to them their sins. To Him be glory forever!19 \n For nearly half a century have I anxiously and critically studied that invaluable treasure [the Bible]; and I still scarcely ever take it up that I do not find something new &#8211; that I do not receive some valuable addition to my stock of knowledge or perceive some instructive fact never observed before. In short, were you to ask me to recommend the most valuable book in the world, I should fix on the Bible as the most instructive both to the wise and ignorant. Were you to ask me for one affording the most rational and pleasing entertainment to the inquiring mind, I should repeat, it is the Bible; and should you renew the inquiry for the best philosophy or the most interesting history, I should still urge you to look into your Bible. I would make it, in short, the Alpha and Omega of knowledge.20 \n \n \n Jacob Broom\n \n \n LEGISLATOR; SIGNER OF THE CONSTITUTION\n \n A letter to his son, James, attending Princeton University: \n \n I flatter myself you will be what I wish, but don&#8217;t be so much flatterer as to relax of your application &#8211; don&#8217;t forget to be a Christian. I have said much to you on this head, and I hope an indelible impression is made.21 \n \n Charles Carroll\n \n \n SIGNER OF THE DECLARATION OF INDEPENDENCE; SELECTED AS DELEGATE TO THE CONSTITUTIONAL CONVENTION; FRAMER OF THE BILL OF RIGHTS; U. S. SENATOR\n \n On the mercy of my Redeemer I rely for salvation and on His merits, not on the works I have done in obedience to His precepts.22 \n \n Grateful to Almighty God for the blessings which, through Jesus Christ Our Lord, He had conferred on my beloved country in her emancipation and on myself in permitting me, under circumstances of mercy, to live to the age of 89 years, and to survive the fiftieth year of independence, adopted by Congress on the 4th of July 1776, which I originally subscribed on the 2d day of August of the same year and of which I am now the last surviving signer.23 \n \n I, Charles Carroll. . . . give and bequeath my soul to God who gave it, my body to the earth, hoping that through and by the merits, sufferings, and mediation of my only Savior and Jesus Christ, I may be admitted into the Kingdom prepared by God for those who love, fear and truly serve Him.24 \n \n \n Congress, 1854\n \n The great, vital, and conservative element in our system is the belief of our people in the pure doctrines and the divine truths of the Gospel of Jesus Christ.25 \n \n \n Congress, U. S. House Judiciary Committee, 1854\n \n Had the people, during the Revolution, had a suspicion of any attempt to war against Christianity, that Revolution would have been strangled in its cradle... In this age, there can be no substitute for Christianity... That was the religion of the founders of the republic and they expected it to remain the religion of their descendants.26 \n \n \n \n More in the link above.", 
   {}, 
   363716, 
   null, 
   1249341060.0
  ], 
  [
   363749, 
   null, 
   "Easyrider", 
   "How Christians Started the Ivy League Schools\n \n Harvard, Yale, Princeton, Dartmouth-all owe their origins to the Christian Gospel. Probably no segment of American higher education has turned out a greater number of illustrious graduates than New England's Ivy League. Labels like Harvard, Yale, Princeton still carry their own mystique and a certain prestige. Yet perhaps it would surprise most folk to learn that almost every Ivy League school was established primarily to train ministers of the gospel- and to evangelize the Atlantic seaboard.\n \n Harvard, 1638\n It took only eighteen years from the time the Pilgrims set foot on Plymouth Rock until the Puritans, who were among the most educated people of their day, founded the first and perhaps most famous Ivy League school. Their story, in brief, is etched today in the record of Harvard: \"After God had carried us safely to New England, and we had built our houses, provided necessaries for our livelihood, reared convenient places for God's worship, and settled the civil government; one of the next things we longed for; and looked after was to advance learning and perpetuate it to posterity; dreading to leave an illiterate ministry to the churches, when our present ministers shall lie in the dust.\" Harvard College's first presidents and tutors insisted that there could be no true knowledge or wisdom without Jesus Christ, and but for their passionate Christian convictions, there would have been no Harvard. Harvard's \"Rules and Precepts\" adopted in 1646 included the following essentials: \"Every one shall consider the main end of his life and studies to know God and Jesus Christ which is eternal life. \"Seeing the Lord giveth wisdom, every one shall seriously by prayer in secret seek wisdom of Him. \"Every one shall so exercise himself in reading the Scriptures twice a day that they be ready to give an account of their proficiency therein, both in theoretical observations of languages and logic, and in practical and spiritual truths...\" According to reliable calculation, fifty-two percent of the seventeenth-century Harvard graduates became Ministers! \n \n Yale, 1701\n By the turn of the century Christians in the Connecticut region launched Yale as an alternative to Harvard. Many thought Harvard too far away and too expensive, and they also observed that the spiritual climate at Harvard was not what it once had been.\n \n Princeton, 1746\n This school, originally called \"The College of New Jersey\" sprang up in part from the impact of the First Great Awakening. It also retained its evangelical vigor longer than any other Ivy League school.\n \n Dartmouth, 1754\n A strong missionary thrust launched this school in New Hampshire. Its royal charter, signed by King George III of England, specified the school's intent to reach the Indian tribes, and to educate and Christianize English youths as well. Eleaxar Wheelock, a close friend of evangelist George Whitefield, secured the charter. \n \n Columbia, William and Mary, and other Christian Colleges\n The first president of New York's Columbia University, first known as \"King's College,\" at one time served as a missionary to America under the English-based \"Society for the Propagation of the Gospel in Foreign Parts.\" The Church of England established the College of William and Mary, near today's Colonial Williamsburg. Dutch Reformed revivalists founded Queen's College (later Rutgers University) in New Jersey. Brown University originated with the Baptist Churches scattered on the Atlantic seaboard. With the exception of the University of Pennsylvania, every collegiate institution founded in the colonies prior to the Revolutionary War was established by some branch of the Christian church. Even at Penn, and evangelist played a prominent part. When Philadelphia churches denied George Whitefield access to their pulpits, forcing him to preach in the open, some of Whitefield's admirers, among them Benjamin Franklin, decided to erect a building to accommodate the great crowds wanted to hear him. The structure they built became the first building of what is now the University of Pennsylvania and a statue of Whitefield stands prominently on that campus today.\n \n Though Ivy League schools eventually turned secular, they fed into the mainstream of society in those earlier days a great army of graduate who could claim Jesus Christ as personal Savior and Lord, and who left a strong impact on our nation. Their presidents and their faculties helped set a high spiritual tone, and at time their campuses in turn felt the impact of revival. The educators of early America clearly understood that the moral climate its schools, colleges and universities would shape its future generations, and could ultimately decide the course of the nation. \n \n Reprinted from \"The Rebirth of America,\" Copyright 1986, Arthur DeMoss Foundation\n \n How Christians Started the Ivy League", 
   {
    "unicode_changes_made": true
   }, 
   363748, 
   null, 
   1249341420.0
  ], 
  [
   363753, 
   null, 
   "Penfold", 
   "The Pilgrim Fathers myth rears its head. Less then half the passengers on the Mayflower were \"pilgrims\" and half of those fifty died the first winter. The majority of the migrants were there for pecuniary reasons. ;)", 
   {}, 
   363749, 
   null, 
   1249342500.0
  ], 
  [
   363760, 
   null, 
   "foundit66", 
   "He's still in denial, folks.\n Here's a short list.\n America's Christian Foundations \n America's Christian Foundation\n Of the 13 colonies, 9 had an official state church.\n\n OMG!\n You are PROVING MY POINT.\n It is UNCONSTITUTIONAL to have an \"official state church\".\n That CLEARLY violates the first amendment's rule on no establishment of religion.\n \n Ergo, when you quote something that was DONE IN THE PAST...\n ... and then the CONSTITUTION was enacted, EXPLICITLY PROHIBITING such an action.\n It shows that our government's ACTUAL FOUNDING DOCUMENTS PROHIBIT what you claim...\n I can't believe you don't get that....\n \n \n \nThomas Jefferson ...\n\n I've already said that people's OPINIONS are not the same thing as the country BEING FOUNDED on Christianity.\n \n Show me some aspect of our country's foundation, and then show me the biblical basis thereof.\n It just does not exist.\n \n INDIVIDUALS who believe in Christ? Sure!\n Country FOUNDED on Christianity? Not the same thing.\n \n \n \nThe Constitution of Delaware said this [paraphrased]: While recognizing that nobody should be compelled to attend religious worship...it is the duty of all men frequently to assemble together for public worship of the \"Author of the universe.\" *\n\n \n \n \n In virtually every state, public office holders were required to affirm their belief in Biblical teachings.\n\n AGAIN, you are showing how THIS COUNTRY (the United States of America) REJECTED a foundation in Christianity by EXPLICITLY putting something into the constitution which makes such things UNCONSTITUTIONAL.\n \n ...but no religious test shall ever be required as a qualification to any office or public trust under the United States.\n Article VI, section 3\n \n \n \nIn 1777, the Continental Congress ordered 22,000 Bibles to be distributed in this country, \"so that the people would be well-supplied with the political textbook of this nation.\"*\n\n Just out of curiousity, is it smart to point to people VIOLATING THE CONSTITUTION as somehow proof that our country is \"founded\" on an ideal?\n It's like saying \"our neighborhood community is founded on going over 30 MPH\" in a neighborhood that has signs everywhere FORBIDDING going faster than 30 MPH.\n \n \n \nNotable Quotes \n\n Irrelevant quotes.\n People who ARE CHRISTIAN does not mean that the country was FOUNDED on Christianity.\n \n Suppose we have a gay engineer who designs a widget.\n The engineer openly says he was gay.\n Does that mean the widget was \"founded\" on homosexuality???\n emoticon_xdonno\n \n \n \nI have examined all religions, and the result is that the Bible is the best book in the world.6 \n\n See, this is part of the problem.\n Some founder gives his opinion as to the best religion out there, and that is NOT EVIDENCE that the country was founded on Christianity...\n \n \n \nHow Christians Started the Ivy League Schools\n\n Do you not understand what the original issue ACTUALLY is?\n Do you understand that there is a difference between a person (who has characteristic_X) creating something...\n ... and that something BEING FOUNDED UPON characteristic_X???\n :xbanghead\n \n The very article is irrelevant cause it doesn't even address the issue...", 
   {
    "unicode_changes_made": true
   }, 
   363748, 
   null, 
   1249344900.0
  ], 
  [
   363766, 
   null, 
   "jyoshu", 
   "The government has separation of church and state.\n Respect that.\n\n \n emoticon_rolleyes\n Yeah .... \n \n cause we all know that wall-hangings and pieces of carved stone are the REAL dangers toward some 'state church', and the end of secularism as we know it ... [/sarcasm]\n \n I think what would respect it the most would be fighting for ACTUAL separation of church and state that MATTERS (as in policy issues), rather than making it into some excuse for a form of religious-phobic iconoclast witch hunt. \n \"Congress shall make no law ....\" ", 
   {}, 
   363718, 
   null, 
   1249346640.0
  ], 
  [
   363767, 
   null, 
   "trebor", 
   "emoticon_rolleyes\n Yeah .... \n \n cause we all know that wall-hangings and pieces of carved stone are the REAL dangers toward some 'state church', and the end of secularism as we know it ... [/sarcasm]\n \n\n I notice you are ignoring the response I made. I can only assume you can not counter it.", 
   {}, 
   363766, 
   null, 
   1249349400.0
  ], 
  [
   363768, 
   null, 
   "foundit66", 
   "emoticon_rolleyes\n Yeah .... \n cause we all know that wall-hangings and pieces of carved stone are the REAL dangers toward some 'state church', and the end of secularism as we know it ... [/sarcasm]\n\n You mean like \"gay marriage\" is the biggest \"danger\" to \"traditional\" marriage...\n Nah. Obviously not like that. Cause Separation of Church and State proponents pay attention to larger violations as well, whereas the \"traditional marriage\" proponents show little concern over fixing the divorce rate...\n emoticon_emb\n \n Your sardonic reply is pointless.\n \"wall-hangings\" are obviously not the largest dangers around, but they ARE VIOLATIONS of separation of church and state.\n Whether you like it or not, separation of church and state IS a constitutional ideal.\n Our government cannot be impartial to religion and not show a favoritism towards any religion...\n ... as it exclusively puts up one religion's monuments.\n \n \n \nI think what would respect it the most would be fighting for ACTUAL separation of church and state that MATTERS (as in policy issues), rather than making it into some excuse for a form of religious-phobic iconoclast witch hunt.\n\n Gee.\n I've got a similar opinion towards those opposing gay marriage claiming to \"protect traditional marriage\", but you obviously understand (and argue that it's \"their opinion\") how some people's opinions would fixate on gay marriage with little concern for the 50% divorce rate.\n \n But in the end, your \"respect\" for a constitutional ideal is irrelevant.\n Separation of church and state proponents fight for the constitution's ideal to be recognized at any level it is violated.\n \n It has nothing to do with an \"excuse for a form of religious-phobic iconoclast witch hunt\".\n Recognizing that the government land should be used for government purposes, instead of showing preference for Christianity, has nothing to do with religion bashing...\n \n \n \n\"Congress shall make no law ....\" \n\n And again we're back to the charade...\n You're talking about setting up a loop-hole\n When Congress creates legislation FUNDING a public, government building (or property), and somebody else puts up a religious monument on that property, that doesn't mean that somebody else can come along and put up their religious symbology on that property and have it all be hunky-dory.\n \n Otherwise, you're just bypassing the obvious intent of the first amendment.\n \n If we were to do things your way, the government puts up funding for a building.\n Religion comes in and \"marks\" it.\n And then the GOVERNMENT FUNDS (set up legislatively) maintain that religious property / monument...\n No.\n \n What is so difficult for you to understand about keeping your RELIGIOUS symbols on YOUR RELIGIOUS property, and leaving the PUBLIC land as impartial ground?", 
   {}, 
   363766, 
   null, 
   1249349820.0
  ], 
  [
   363792, 
   null, 
   "jyoshu", 
   "You mean like \"gay marriage\" is the biggest \"danger\" to \"traditional\" marriage...\n Nah. Obviously not like that. Cause Separation of Church and State proponents pay attention to larger violations as well, whereas the \"traditional marriage\" proponents show little concern over fixing the divorce rate...\n\n \n Now there's a conflating of issues. I have a lot more respect for the the idea of supporting separation of church and state in the context of the gay marriage debate than in the context of purging monuments. One is a legitimate debate of the issue of C&S. The other is just a witch hunt trying to sterilize government of anything that looks religious. I can't help it if you're paranoid.\n \n \n\"wall-hangings\" are obviously not the largest dangers around, but they ARE VIOLATIONS of separation of church and state. Whether you like it or not, separation of church and state IS a constitutional ideal.\n\n \n That's sorta like trying to fix a nick in the paint when the car has been totaled. Besides, I don't think religious sterilization is what the crafters of the 1st Amendment had in mind.\n \n \n...and not show a favoritism towards any religion...\n\n \n The 1st amendment says nothing about favoritism or avoiding it. If 'impartiality' was the issue, then a courtroom would only need to represent other religious legal codes as well to avoid partiality. Should we assume that you're happy then, as long as a courthouse covers other legal codes from other religions too? ;)\n \n \nBut in the end, your \"respect\" for a constitutional ideal is irrelevant. Separation of church and state proponents fight for the constitution's ideal to be recognized at any level it is violated.\n\n \n Absolute Bull. If they fought at ANY level, they would be challenging things like the imprint on our currency or the inclusion of prayers in official govt. events. More importantly, they would fight things like the prevention of gay marriage on GROUNDS that it was a violation of C&S. (Instead they usually use other grounds, like the 14th amendment.) Furthermore, they would make at least SOME--even MINIMAL--effort to fight to ensure RELIGION'S rights are protected too, or even act like they \"respect\" that ..... \n The issue here is that it's a waste of resources to \"fight\" for the sterilizing govt. buildings of all religious allusions when there are far, far more important issues of separation of C&S. I wonder how you'd think of someone putting millions of dollars into fighting for, say, left-handers' rights, when gay rights is a far more pertinent issue.\n \n \nIt has nothing to do with an \"excuse for a form of religious-phobic iconoclast witch hunt\".\n\n \n Sure it does, because there's no other feasible reason for the focus. Major POLICY issues exist that violate C&S. But people like yourself are fixated on purging courtrooms of stone carvings and wall hangings. emoticon_xdonno Go figure.\n \n \nRecognizing that the government land should be used for government purposes, instead of showing preference for Christianity, has nothing to do with religion bashing...\n\n \n BLOWI.. I said NOTHING of 'religion bashing.'\n \n \nAnd again we're back to the charade...\n You're talking about setting up a loop-hole\n When Congress creates legislation FUNDING a public, government building (or property)\n\n \n If govt. funds a govt. BUILDING, and then someone puts an painting on the wall, the govt. isn't funding the painting and there's NO difference in funding than there would be otherwise. The distinction you're making there is completely pointless.\n \n \nAnd then the GOVERNMENT FUNDS (set up legislatively) maintain that religious property / monument...\n No.\n\n \n Really? Can you PROVE that govt. was having to FUND all these cases of commandments in courthouses, such as providing for them, or maintaining them? I doubt it.\n \n \nWhat is so difficult for you to understand about keeping your RELIGIOUS symbols on YOUR RELIGIOUS property, and leaving the PUBLIC land as impartial ground?\n\n \n [QUOTE=foundit66;363768]That would be fine if you were consistent. But you aren't. You get up in arms over an HISTORICAL case of a legal code that happens to be religious (when pretty much everything was in ancient times), but never fight against things like what's printed on our currency. Then you have the audacity to cite gay marriage as such an issue, when rarely do gay marriage proponents use SoC&S state as the basis of their arguments. But a stone carving in a courthouse?? Wow. What a horrific thing. emoticon_rolleyes", 
   {}, 
   363768, 
   null, 
   1249355940.0
  ], 
  [
   363805, 
   null, 
   "foundit66", 
   "Now there's a conflating of issues. I have a lot more respect for the the idea of supporting separation of church and state in the context of the gay marriage debate than in the context of purging monuments. One is a legitimate debate of the issue of C&S. The other is just a witch hunt trying to sterilize government of anything that looks religious. I can't help it if you're paranoid.\n\n \"paranoid\"?\n What's that abbreviation that you use when a person makes an issue out of the poster instead of responding to the issue?\n Apply it to yourself.\n \n The point is simple. It's demonstrating how people have a belief in something and want to see it applied.\n The legitimacy of that point, and even-handedness at applying it at all levels.\n \n Furthermore, your claims of a \"witch hunt trying to sterilize government of anything that looks religious\" is pointlessly propagandic.\n The ten commandments monument is not \"anything that looks religious\". It IS religious.\n It is not a \"witch hunt\". It is an application of the constitutional mandate, which you are avoiding the legitimacy of by using such pointlessly propagandic language.\n \n \n \nThat's sorta like trying to fix a nick in the paint when the car has been totaled.\n\n Can you explain how that analogy has ANY relevance to the actual conversation we're having?\n Cause obviously you think removing the ten commandment monument is a \"nick in the paint\".\n So what would be the real life equivalent of \"the car has been totaled\"?\n \n \n \nBesides, I don't think religious sterilization is what the crafters of the 1st Amendment had in mind.\n\n \"religious sterilization\" is your propagandic buzz-phrase.\n Preventing a multi-ton ten commandment monument on religious property is not \"religious sterilization\".\n \n People can put their person religious items on their personal desks.\n The ten commandment monument is NOT an issue of \"sterilization\".\n \n \n \nThe 1st amendment says nothing about favoritism or avoiding it. If 'impartiality' was the issue, then a courtroom would only need to represent other religious legal codes as well to avoid partiality. Should we assume that you're happy then, as long as a courthouse covers other legal codes from other religions too?\n\n The PURPOSE of the 1st commandment separation of church and state is to avoid favoritism and preserve impartiality.\n \n And no. \"covering other legal codes from other religions\" is not viable.\n Reread the first amendment.\n It doesn't say \"establishment of any specific religion\".\n It says \"establishment OF religion\".\n Establishing a broad spectrum of religions IS STILL establishing religion...\n \n \n \nAbsolute Bull. If they fought at ANY level, they would be challenging things like the imprint on our currency or the inclusion of prayers in official govt. events.\n\n In principle, it shouldn't be there.\n But as I have explained to you before (and I'll probably have to explain to you again) there is an issue of historicity to the issues as well.\n Issues of religious involvement into the state that have a historicity are essentially \"grandfathered\" in.\n \n And if you think we're willing to add to that list, you're kidding yourself...\n \n \n \nMore importantly, they would fight things like the prevention of gay marriage on GROUNDS that it was a violation of C&S. (Instead they usually use other grounds, like the 14th amendment.)\n\n Dude.\n You seriously do not listen to ANYTHING anybody tells you, do you...\n You don't actually look at these issues in real life, do you...\n \n IF THE STATE ARGUED RELIGIOUS REASONS for preventing gay marriage, it would be a blatant violation of SofC&S.\n Ergo, the state recognizes they CANNOT argue religious reasons.\n And in cases like this, people habitually have to MAKE UP OTHER excuses for why gay marriage must be prevented.\n \n As for 14th amendment, you really don't recognize the bigger picture here...\n Arguing separation of church and state would be a way to strike down laws preventing same sex marriage.\n But logistically, it doesn't provide a REQUIREMENT for the government to recognize gay marriage.\n Logistically relying solely on SofC&S, we would be left in a situation where the government recognizes straight marriage, but has no impetus to mandate recognizing gay marriage.\n The 14th amendment provides a requirement for gay marriage to be recognized.\n \n \n \nFurthermore, they would make at least SOME--even MINIMAL--effort to fight to ensure RELIGION'S rights are protected too, or even act like they \"respect\" that ..... \n\n What the heck does this comment mean?\n You have been told REPEATEDLY that gays have NO PROBLEM with churches not having to perform gay marriages.\n So either you're ignoring that, or you're talking about something else...\n \n \n \nSure it does, because there's no other feasible reason for the focus. Major POLICY issues exist that violate C&S. But people like yourself are fixated on purging courtrooms of stone carvings and wall hangings. emoticon_xdonno Go figure.\n\n That has been explained to you before in historicity.\n \n \n \nBLOWI.. I said NOTHING of 'religion bashing.'\n\n You can't be serious.\n You make accusations of \"religious-phobic iconoclast witch hunt\", and then object to \"religion bashing\"?\n What is the significant difference between the two?\n \n \n \nIf govt. funds a govt. BUILDING, and then someone puts an painting on the wall, the govt. isn't funding the painting and there's NO difference in funding than there would be otherwise. The distinction you're making there is completely pointless.\n\n I'm not surprised you feel that way.\n Fortunately, your lack of judgment is not prevailing.\n Your refusal to accept the rational explanation is not an argument.\n \n \n \nReally? Can you PROVE that govt. was having to FUND all these cases of commandments in courthouses, such as providing for them, or maintaining them? I doubt it.\n\n I talked about funding the building.\n Not funding the religious item itself.\n \n Don't try to confuse the issue.\n \n \n \nWhat is so difficult for you to understand about keeping your RELIGIOUS symbols on YOUR RELIGIOUS property, and leaving the PUBLIC land as impartial ground?\n\n \nThat would be fine if you were consistent.\n\n It is consistent.\n \n Furthermore, \"consistency\" HAS NOTHING TO DO with the issue at all.\n I am talking about YOU UNDERSTANDING that you need to keep your religious items off of government property.\n YOU UNDERSTANDING that requirement has nothing to do with your claims of hypocrisy.\n \n But moving on to again address your confusion.\n \n \n \nYou get up in arms over an HISTORICAL case of a legal code that happens to be religious (when pretty much everything was in ancient times)...\n\n Say whaaa???\n What \"historical case of a legal code\" am I supposedly \"up in arms\" over?\n I have referenced Roy Moore's actions, and there was NO historicity to that issue.\n He put up the eye-sore, and it was addressed legally in short order.\n There was no \"history\" of that thing being established in that courthouse.\n \n \n \n... but never fight against things like what's printed on our currency.\n\n Already addressed.\n Item historicity. It has a court exclusion.\n \n \n \nThen you have the audacity to cite gay marriage as such an issue, when rarely do gay marriage proponents use SoC&S state as the basis of their arguments. But a stone carving in a courthouse?? Wow. What a horrific thing. emoticon_rolleyes\n\n Man-oh-man-oh-man-oh-man-oh-man...\n You really have a short memory.\n WE HABITUALLY state that religious arguments for preventing gay marriage are invalid.\n It has gotten to the stage that most people do not even try to say \"We shouldn't allow legal gay marriage cause the bible is against it\" anymore.\n \n They either try to say \"We've got enough people who want to restrict your rights\" (which brings up the 14th amendment) or they make up some incredibly absurd nonsense like RamFel recently tried.\n YOU YOURSELF have repeatedly tried to argue that the votes should matter, regardless of whether they are religiously justified.\n AND I HAVE ARGUED AGAINST that attempt to back-door religious justification into law. So YOU YOURSELF should recognize the absurd falseness of your claim, based on personal experience...\n \n When the \"gay marriage\" issue is argued in court, the anti-gay marriage side DOES NOT TRY to give religious justifications cause they know they would fail.\n So they make up other arguments...\n \n So we have to address the other arguments, and not raise an issue that most people don't try to raise cause they know they can't.\n \n To put this another way, SHOW ME A COURT CASE which said elimination of gay marriage was okay based on religious reasoning, and THEN I'll talk about how it's invalid because of SofC&S issues.\n Until then, you're asking us to joust at windmills, and complaining when we don't... emoticon_frazzled", 
   {}, 
   363792, 
   null, 
   1249360140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Posting Ten Commandments: Separation of Church and State", 
  "url": "http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12911, 
  "discussion_files": [
   [
    "31115.html", 
    "http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state-print.html"
   ], 
   [
    "31116.html", 
    "http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state-4-print.html"
   ], 
   [
    "31117.html", 
    "http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state-3-print.html"
   ], 
   [
    "31118.html", 
    "http://www.4forums.com/political/religion-debates/12911-posting-ten-commandments-separation-church-state-2-print.html"
   ]
  ], 
  "identifier": 12911
 }
]