[
 [
  [
   358828, 
   null, 
   "simone", 
   "God has mellowed. The God that most Americans worship occasionally gets upset about abortion and gay marriage, but he is a softy compared with the Yahweh of the Hebrew Bible. That was a warrior God, savagely tribal, deeply insecure about his status and willing to commit mass murder to show off his powers. But at least Yahweh had strong moral views, occasionally enlightened ones, about how the Israelites should behave. His hunter-gatherer ancestors, by contrast, were doofus gods. Morally clueless, they were often yelled at by their people and tended toward quirky obsessions. One thunder god would get mad if people combed their hair during a storm or watched dogs mate.\n \n In his brilliant new book, \"The Evolution of God,\" Robert Wright tells the story of how God grew up. He starts with the deities of hunter-gatherer tribes, moves to those of chiefdoms and nations, then on to the polytheism of the early Israelites and the monotheism that followed, and then to the New Testament and the Koran, before finishing off with the modern multinational Gods of Judaism, Christianity and Islam. Wright's tone is reasoned and careful, even hesitant, throughout, and it is nice to read about issues like the morality of Christ and the meaning of jihad without getting the feeling that you are being shouted at. His views, though, are provocative and controversial. There is something here to annoy almost everyone.\n\n http://www.nytimes.com/2009/06/28/books/review/Bloom-t.html\n \n Time to throw that old smite-em-all god away, folks.\n \n And, my goodness, only partially decent morals won't do for me.", 
   {
    "post_info": {
     "post_title": "God All Grown Up ... Maybe"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1246128480.0
  ], 
  [
   358913, 
   null, 
   "Archangel", 
   "God hasn't changed at all simone, but you go on and accept this secularized version of Him. See how far it gets you in your search for Gods eternal truth.", 
   {}, 
   358828, 
   null, 
   1246204680.0
  ], 
  [
   358920, 
   null, 
   "Penfold", 
   "The postulation of the early god as toddler, fits the profile of tantrums and hissy fits when denied instant gratification, selfish seeking of praise, unwarranted smiting and teasing, and occasionally kicking his ant farm, with the ants attempting to rationalise the psychopathology of the farmer........emoticon_xdonno", 
   {}, 
   358913, 
   null, 
   1246207260.0
  ], 
  [
   358922, 
   null, 
   "Archangel", 
   "And the atheists ignorant denials proceed unimpeded as he continues to rush toward destruction with his fingers in his ears. emoticon_wow", 
   {}, 
   358920, 
   null, 
   1246207860.0
  ], 
  [
   358935, 
   null, 
   "Penfold", 
   "Perhaps one of the parents came in and smacked it upside it's head, explaining the improved behaviour over the last millennium or so.", 
   {}, 
   358922, 
   null, 
   1246212600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God All Grown Up ... Maybe", 
  "url": "http://www.4forums.com/political/religion-debates/12924-god-all-grown-up-maybe.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12924, 
  "discussion_files": [
   [
    "29225.html", 
    "http://www.4forums.com/political/religion-debates/12924-god-all-grown-up-maybe-print.html"
   ]
  ], 
  "identifier": 12924
 }
]