[
 [
  [
   359082, 
   null, 
   "foundit66", 
   "Holy Land Experience doesn't want you to know when it schedules its required free day each year out of concern over a possible \"uncontrollable situation.\"\n \n At least that's the conclusion to be drawn by a letter the religion-based theme park sent to the office of Orange County Property Appraiser Bill Donegan.\n \n Donegan asked the park for documentation of its free days after I reported earlier this month that the park gave out conflicting information about the day.\n \n Holy Land, owned by Trinity Broadcasting Network, is required to drop its normal $35 ticket price and offer free admission one day each year in exchange for a property-tax exemption that saves it about $300,000 annually, according to a 2006 state law designed to guarantee the exemption.\n \n John Casoria, attorney for TBN and corporate secretary of Holy Land Experience Ministries Inc., said free days took place on Nov. 12, 2007, a Monday, and Feb. 5, 2008, a Tuesday.\n \n The date for 2009 has not been set, though Casoria said, \"it is our belief that it will occur sometime in the early fall.\"\n \n The only way to find out for sure is to watch the local TBN station, WTGL-TV58. Casoria touts the merits of using TBN's channel to advertise the day, which is supposed to act as the park's public service to the community because it is considered a church and not a business for tax purposes.\n \n \"TBN rarely, if ever, utilizes flyers or newspaper ads to conduct public advertising simply because of the expense and limited outreach of print media,\" Casoria wrote in the letter. \"On the other hand, WTGL-TV58 literally covers 100 percent of the greater Orlando area ... thus reaching more of the local community and increasing the potential for the local population to become aware of the free admission day.\"\n \n But he goes on to say that Holy Land is limited to a capacity of 1,700 and counters his earlier point by suggesting that further advertising could overwhelm the park.\n \n \"It simply does not have the parking, traffic control, comfort facilities and food service capabilities of other venues,\" he said. \"We trust that the city of Orlando does not want an uncontrollable situation to occur at the park on this day.\"\n \n What exactly would that be? People waiting in line? That would seem like a good problem to have for a theme park interested in raising its profile.\n \n Regardless, the situation goes to show the hazards of hastily written legislation. When former Rep. Fred Brummer, now an Orange County commissioner, and former Sen. Daniel Webster sponsored the bill to guarantee the park a tax exemption, I have to think they intended for the reach to be broader than that.\n \n Otherwise, this legislation smacks of the exact kind of catering to special interests that keeps property off the tax rolls while taxpayers get nothing in return.\n\n Orlando tourism: Theme park mum on free day -- OrlandoSentinel.com\n \n Yet another example of how this country can bend over backwards to give special privileges to religion.\n Giving a company a $300,000 property tax break, just because they go \"free\" to the public one day out of the year???\n \n Why can't non-religious theme parks get the same break???", 
   {
    "post_info": {
     "post_title": "Holy Land free day still a mystery"
    }
   }, 
   null, 
   null, 
   1246323300.0
  ], 
  [
   359086, 
   null, 
   "Symbiote", 
   "I'd be more concerned about the $300 billion citibank bailout.", 
   {}, 
   359082, 
   null, 
   1246327800.0
  ], 
  [
   359087, 
   null, 
   "foundit66", 
   "I'd be more concerned about the $300 billion citibank bailout.\n\n One of the great things about message boards is that you can have multiple threads with multiple issues.\n So MULTIPLE concerns can be shown, in the different, appropriate threads... emoticon_xagree\n And posting one thread on another topic hardly demonstrates any level of placed importance...\n \n \n Unless your real concern was just derailing this thread in the first place... emoticon_ic\n \n Since Florida has a significant budget deficit, such \"freebies\" should probably be re-examined to help reduce the deficit...", 
   {}, 
   359086, 
   null, 
   1246328640.0
  ], 
  [
   359089, 
   null, 
   "Symbiote", 
   "I'm just saying, $300,000 is peanuts, it really isn't worth worrying about at this point. It's literally 1 millionth of the bailout of a single bank, chump change.\n \n Obama currently uses a roll of million dollar bills to wipe his XXX in the morning, and general motors is building new smelters that run on benjies.", 
   {}, 
   359087, 
   null, 
   1246330080.0
  ], 
  [
   359090, 
   null, 
   "foundit66", 
   "I'm just saying, $300,000 is peanuts, it really isn't worth worrying about at this point. It's literally 1 millionth of the bailout of a single bank, chump change.\n\n By that logic, $25,000 toilet seats should also not be a concern...\n \n What you don't seem to recognize is that it all adds up.\n \n Bush's economic stimulus was simply $600 per individual taxpayer.\n But it added up to $120 billion.\n \n \n And more to the heart of the matter, it's the principal at hand.\n Otherwise, just give me the money if it's just \"chump change\" and it's all still okay, right? emoticon_cool\n \n \n You ever heard the phrase \"two wrongs don't make a right\"?\n Do you know what it means?", 
   {}, 
   359089, 
   null, 
   1246331100.0
  ], 
  [
   359097, 
   null, 
   "Zardoz", 
   "I'm just saying, $300,000 is peanuts, it really isn't worth worrying about at this point. It's literally 1 millionth of the bailout of a single bank, chump change.\n \n Obama currently uses a roll of million dollar bills to wipe his XXX in the morning, and general motors is building new smelters that run on benjies.\n\n \n You do know that this adds up over time...\n \n It's nickle and dimeing that causes a lot of financial problems too.", 
   {}, 
   359089, 
   null, 
   1246338240.0
  ], 
  [
   359103, 
   null, 
   "Jo Bennett", 
   "Definite case of \"if you look after the pennies, the pounds [or dollars] will look after themselves.\".", 
   {}, 
   359097, 
   null, 
   1246350060.0
  ], 
  [
   359195, 
   null, 
   "Easyrider", 
   "I'd be more concerned about the $300 billion citibank bailout.\n\n \n Well Pelosi, Obama, and company are just getting started. They've got trillions and trillions more to add to our deficits to further bankrupt this country. It should be considered treason.", 
   {}, 
   359086, 
   null, 
   1246415340.0
  ], 
  [
   359196, 
   null, 
   "Symbiote", 
   "Definite case of \"if you look after the pennies, the pounds [or dollars] will look after themselves.\".\n\n \n Yeah they'll \"look after themselves\" by being dumped straight in the hands of politically connected wall street hustlers, while we concern ourselves with screwing christian theme parks on property tax.", 
   {}, 
   359103, 
   null, 
   1246416480.0
  ], 
  [
   359223, 
   null, 
   "foundit66", 
   "I think it's a sign of how some people recognize the point of the thread has validity but they have no intelligible reply...\n ... when numerous people make a point of jumping on the thread and immediately try to derail it. emoticon_rolleyes\n \n This is the RELIGION thread.\n Talking about abuse of giving religion undeserved privileges.\n \n There's nothing stopping you from making your own thread to talk about your own issues in their appropriate sections... emoticon_rolleyes\n \n \n \nYeah they'll \"look after themselves\" by being dumped straight in the hands of politically connected wall street hustlers, while we concern ourselves with screwing christian theme parks on property tax.\n\n Say whaaa???\n They are no more getting \"screwed\" than any of the other property tax payers.\n Why should the Christians get the special benefit of getting out of it for some obviously sleazy and indefensible reason?", 
   {}, 
   359196, 
   null, 
   1246432740.0
  ], 
  [
   359239, 
   null, 
   "jyoshu", 
   "I think it's a sign of how some people recognize the point of the thread has validity but they have no intelligible reply...\n ... when numerous people make a point of jumping on the thread and immediately try to derail it. emoticon_rolleyes\n \n This is the RELIGION thread.\n Talking about abuse of giving religion undeserved privileges.\n \n There's nothing stopping you from making your own thread to talk about your own issues in their appropriate sections... emoticon_rolleyes\n\n \n Translation: 'Darn it, guys, you're ruining my negative story-o'-the-day 'bout a religious group. Stop it!'", 
   {}, 
   359223, 
   null, 
   1246463520.0
  ], 
  [
   359254, 
   null, 
   "foundit66", 
   "Translation: 'Darn it, guys, you're ruining my negative story-o'-the-day 'bout a religious group. Stop it!'\n\n emoticon_wow\n Translation: Jyoshu is enjoying the thread being side-tracked, and doesn't have anything topical to add either...", 
   {}, 
   359239, 
   null, 
   1246472880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Holy Land free day still a mystery", 
  "url": "http://www.4forums.com/political/religion-debates/12929-holy-land-free-day-still-mystery.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12929, 
  "discussion_files": [
   [
    "16178.html", 
    "http://www.4forums.com/political/religion-debates/12929-holy-land-free-day-still-mystery-print.html"
   ]
  ], 
  "identifier": 12929
 }
]