[
 [
  [
   359119, 
   null, 
   "simone", 
   "Protect the right of Republican Senators -- and Governors to be adulterers.\n \n Help pass this act. In order to solidify the Defense of Straight, Heterosexual, Republican Marriage Act, we must have the Defense of Adultery Act.\n \n So we can safely continue to use the false argument that gays being allowed to marriage is a threat to straight, not necessarily always Republican marriages. But, Republicans especially have a hard time honoring vows of fidelity and they need all the help they can get.", 
   {
    "post_info": {
     "post_title": "Ensign/Vitter Senate Defense of Adultery Act"
    }
   }, 
   null, 
   null, 
   1246381320.0
  ], 
  [
   359122, 
   null, 
   "ServantOfChrist", 
   "Protect the right of Republican Senators -- and Governors to be adulterers.\n \n Help pass this act. In order to solidify the Defense of Straight, Heterosexual, Republican Marriage Act, we must have the Defense of Adultery Act.\n \n So we can safely continue to use the false argument that gays being allowed to marriage is a threat to straight, not necessarily always Republican marriages. But, Republicans especially have a hard time honoring vows of fidelity and they need all the help they can get.\n\n \n How about a Clinton Defense of Presidential Adultery Act?\n \n Or an Edwards Defense of Presidential-Candidate Adultery Act?\n \n Get a life, hypocrite.", 
   {}, 
   359119, 
   null, 
   1246381800.0
  ], 
  [
   359138, 
   null, 
   "simone", 
   "Clinton never got a standing ovation from Republican Senators like both Ensign and Vitter did, speaking of hypocritical mocking of \"family values.\"\n \nWhen Sen. David Vitter, R-La., showed up in Washington, D.C., again last week after hiding with the equivalent of a paper bag on his head, he was welcomed back to a closed Republican Senate luncheon with a loud standing ovation.\n \n Vitter had fled after admitting that he was included on a private telephone list of johns made public by the so-called \"Washington madam,\" Deborah Jean Palfrey, whom law enforcement officials accuse of running a prostitution ring. Vitter didn't publicly deny anything, saying only that he had sinned and was sorry. He is refusing to discuss the subject further. Hmm.\n \n Judging by their enthusiastic greeting, his GOP chums didn't seem to mind that the hypocrisy level in the nation's capital - always high - just zoomed upwards into outer space.\n\n Republicans celebrate hypocrisy | recordonline.com\n \n \nSen. John Ensign (R-NV) reportedly received a \"round of applause\" from his GOP colleagues today at the weekly conference lunch, his \"first meeting with them since the sex scandal that cost him his leadership position.\" \"All I can say for sure is that it [Ensign's speech] was very, very sincere, very heartfelt and very well received in our caucus,\" said Sen. Bob Corker (R-TN), who was at the meeting. Ensign's welcome is similar to the reaction Sen. David Vitter (R-LA) received, when \"he was welcomed back to a closed Republican Senate luncheon with a loud standing ovation\" after admitting his involvement with an escort service run by the DC Madam. However, Sen. Larry Craig (R-ID) - who faced charges of \"lewd\" sexual conduct in a men's public restroom - faced calls to resign.\n \n Think Progress Ensign receives ?round of applause' from GOP colleagues.", 
   {
    "unicode_changes_made": true
   }, 
   359122, 
   null, 
   1246387800.0
  ], 
  [
   359209, 
   null, 
   "jyoshu", 
   "But, Republicans especially have a hard time honoring vows of fidelity and they need all the help they can get.\n\n \n Nah, that's a problem both sides have. No matter how \"torqued off\" at Republicans you are.", 
   {}, 
   359119, 
   null, 
   1246424100.0
  ], 
  [
   359221, 
   null, 
   "foundit66", 
   "Clinton never got a standing ovation from Republican Senators like both Ensign and Vitter did, speaking of hypocritical mocking of \"family values.\"\n Republicans celebrate hypocrisy | recordonline.com\n Think Progress Ensign receives ?round of applause' from GOP colleagues.\n\n Perhaps if Obama were to have an affair, they would applaud him too?\n Nah. Of course not.\n And too many Republicans would ignore the double-standard, swallow whole the claims of \"family values\", and then bash the Democrat that provided any opportunity... emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   359138, 
   null, 
   1246431360.0
  ], 
  [
   359248, 
   null, 
   "simone", 
   "Perhaps if Obama were to have an affair, they would applaud him too?\n Nah. Of course not.\n And too many Republicans would ignore the double-standard, swallow whole the claims of \"family values\", and then bash the Democrat that provided any opportunity... emoticon_rolleyes\n\n Maybe Republicans would applaud Obama for having an affair, but Democrats sure wouldn't.\n \n They'd be sore ashamed -- as they should be should something like that occur.", 
   {}, 
   359221, 
   null, 
   1246470300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Ensign/Vitter Senate Defense of Adultery Act", 
  "url": "http://www.4forums.com/political/politics-debates/12931-ensign-vitter-senate-defense-adultery-act.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12931, 
  "discussion_files": [
   [
    "31748.html", 
    "http://www.4forums.com/political/politics-debates/12931-ensign-vitter-senate-defense-adultery-act-print.html"
   ]
  ], 
  "identifier": 12931
 }
]