[
 [
  [
   359326, 
   null, 
   "foundit66", 
   "During a June 19 radio debate, Pennsylvania State Sen. John Eichelberger (R) repeatedly asserted that same-sex marriage is wrong, \"dysfunctional,\" and would lead to \"polygamy, marrying younger people.\" (Eichelberger is \"sponsoring a Constitutional amendment to redefine marriage as between a man and a woman.\") But perhaps his most shocking comments came when fellow lawmaker Sen. Daylin Leach (D) asked him how gay men and women should be treated:\n  Leach: Should our only policy towards [same-sex] couples be one of punishment, to somehow prove that they've done something wrong?\n Eichelberger: They're not being punished. We're allowing them to exist, and do what every American can do. We're just not rewarding them with any special designation.\n\n Think Progress Pennsylvania State Senator Refuses To Apologize For His Remarks About Gays: 'We're Allowing Them To Exist'\n \n The day is coming...\n \n We can look back at history and see all sorts of vile support for racism, which was applauded at the time the statements were made.\n 1963 George Wallace: \"segregation now, segregation tomorrow, segregation forever.\"\n \n Times are shifting. It was just a few years ago the right-wing was bemoaning the fact that sodomy was no longer illegal.\n While most rational people can shudder at such words, others will attempt to claim it's acceptable... emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "We\u0092re allowing them to exist"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1246530420.0
  ], 
  [
   359343, 
   null, 
   "jyoshu", 
   "Think Progress Pennsylvania State Senator Refuses To Apologize For His Remarks About Gays: &#8216;We&#8217;re Allowing Them To Exist&#8217;\n\n \n I know you'll start your antics as well as misrepresent what I'm saying here is 'putting him in a positive light' or some other disingenuous statement rather than just discussing the issue, but given that one of the more repeated rhetorical statements by gay pride proponents is \"we exist\", or \"we are persons\", it seems to me that saying \"we're allowing them to exist\" isn't that problematic of a statement to such a point as requiring an apology. We (as a society) ARE allowing gays to exist; they are indeed persons. I think some of the OTHER things he said are far worse (like calling gays dysfunctional), and if anything, those should be the things he should need to apologize over.", 
   {}, 
   359326, 
   null, 
   1246550160.0
  ], 
  [
   359346, 
   null, 
   "davenport15", 
   "I know you'll start your antics as well as misrepresent what I'm saying here is 'putting him in a positive light' or some other disingenuous statement rather than just discussing the issue, but given that one of the more repeated rhetorical statements by gay pride proponents is \"we exist\", or \"we are persons\", it seems to me that saying \"we're allowing them to exist\" isn't that problematic of a statement to such a point as requiring an apology. We (as a society) ARE allowing gays to exist; they are indeed persons. I think some of the OTHER things he said are far worse (like calling gays dysfunctional), and if anything, those should be the things he should need to apologize over.\n\n It's true. I allow Christians to exist, too, despite the fact that I find them to be dysfunctional.", 
   {}, 
   359343, 
   null, 
   1246555440.0
  ], 
  [
   359358, 
   null, 
   "jyoshu", 
   "It's true. I allow Christians to exist\n\n \n And if Christians were saying \"we do exist\" or \"we are persons\", I don't see that it would be an unfair thing for you to say.", 
   {}, 
   359346, 
   null, 
   1246564080.0
  ], 
  [
   359370, 
   null, 
   "foundit66", 
   "I know you'll start your antics as well as misrepresent what I'm saying here is 'putting him in a positive light' or some other disingenuous statement rather than just discussing the issue...\n\n Ahhh yes.\n Jyoshu starting in as normal with his passive-aggressive attacks... emoticon_rolleyes\n \n \n \n... but given that one of the more repeated rhetorical statements by gay pride proponents is \"we exist\", or \"we are persons\", it seems to me that saying \"we're allowing them to exist\" isn't that problematic of a statement to such a point as requiring an apology.\n\n Yes. It is.\n I'm sorry you can't recognize and/or admit that. But it is entirely different.\n \n One is acknowledging a statement of fact. We are gay.\n The other is talking about ALLOWING them to be gay, as if that were even a question that should be something that people should get credit for.\n \n If a father were to tell his son/daughter \"I allow you to live\", what kind of message would that send?\n \n \n \nAnd if Christians were saying \"we do exist\" or \"we are persons\", I don't see that it would be an unfair thing for you to say. \n\n Why does it matter if Christians admit an obvious statement, in order for \"I allow Christians to exist\" to be interpreted differently?", 
   {}, 
   359343, 
   null, 
   1246571760.0
  ], 
  [
   359376, 
   null, 
   "CUNxTime", 
   "Either we're reading too much into the statement or Gays need to purchase and maintain their firearms, or BOTH. Best to be prepared IMHO.", 
   {}, 
   359370, 
   null, 
   1246572300.0
  ], 
  [
   369305, 
   null, 
   "QuackAttack1887", 
   "Tell me this guy is on his way to a special hospital with special jackets. \n \n My Catholic, hateful and very straight parents have a more dysfunctional relationship than my gay friends. \n \n I can't believe people are still making such hateful remarks. \n \n If he was saying that they are allowing gay people to exist, what's wrong with us existing? As my friend says, the more extreme people think the world will be better without us, but it won't be. We make it interesting. We make life not so dull and boring. The world will be worse without us, because for me, that will take extreme violence. I tried being straight, but that was like asking a frog to fly. It won't work out.", 
   {}, 
   359326, 
   null, 
   1252739760.0
  ], 
  [
   369313, 
   null, 
   "jazyjason", 
   "Such hateful speeches echo of the tyranny and persecution of gays implemented under the Third Reich. \"Allowing\" us to exist? Sorry senator but I'm allowing your front teeth to \"exist\" until I become so angry I find you in a public square and knock them strait out of your hateful bigoted lips....", 
   {}, 
   369305, 
   null, 
   1252743360.0
  ], 
  [
   369314, 
   null, 
   "QuackAttack1887", 
   "Such hateful speeches echo of the tyranny and persecution of gays implemented under the Third Reich. \"Allowing\" us to exist? Sorry senator but I'm allowing your front teeth to \"exist\" until I become so angry I find you in a public square and knock them strait out of your hateful bigoted lips....\n\n \n *applauds*", 
   {}, 
   369313, 
   null, 
   1252743480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  We\u0092re allowing them to exist", 
  "url": "http://www.4forums.com/political/gay-rights-debates/12938-we-re-allowing-them-exist.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 12938, 
  "discussion_files": [
   [
    "11311.html", 
    "http://www.4forums.com/political/gay-rights-debates/12938-we-re-allowing-them-exist-print.html"
   ]
  ], 
  "identifier": 12938
 }
]