[
 [
  [
   359269, 
   null, 
   "DrNo", 
   "Wow! Looks like we have some Iranian style elections going on right here at home.\n \n Oh wait, I forgot...only Republicans steal elections, right? emoticon_rolleyes", 
   {
    "post_info": {
     "post_title": "Al Franken gets &quot;elected&quot;"
    }
   }, 
   null, 
   null, 
   1246478580.0
  ], 
  [
   359277, 
   null, 
   "Penfold", 
   "No, they resist progress. And respecting the law when they don't like it.", 
   {}, 
   359269, 
   null, 
   1246483380.0
  ], 
  [
   359308, 
   null, 
   "simone", 
   "Wow! Looks like we have some Iranian style elections going on right here at home.\n \n Oh wait, I forgot...only Republicans steal elections, right? emoticon_rolleyes\n\n Cribbing off the Wall Street Journal, No?", 
   {}, 
   359269, 
   null, 
   1246499040.0
  ], 
  [
   359311, 
   null, 
   "Bad Mojo", 
   "I'd sure like to see some evidence that Franken cheated. That is other than shouting \"Acorn, Acorn!\"", 
   {}, 
   359308, 
   null, 
   1246501740.0
  ], 
  [
   359380, 
   null, 
   "CUNxTime", 
   "I can't believe that ##### won. However, it seems he did, that's the law, we'll get what we deserve lol.", 
   {}, 
   359311, 
   null, 
   1246573140.0
  ], 
  [
   359381, 
   null, 
   "CUNxTime", 
   "WOW, you can't say Mor on anymore?", 
   {}, 
   359380, 
   null, 
   1246573200.0
  ], 
  [
   359386, 
   null, 
   "Bad Mojo", 
   "Why is Franken a mor.on?", 
   {}, 
   359381, 
   null, 
   1246574880.0
  ], 
  [
   359388, 
   null, 
   "Penfold", 
   "He's taken over Coleman's role completely?emoticon_xgood", 
   {}, 
   359386, 
   null, 
   1246575180.0
  ], 
  [
   359416, 
   null, 
   "CUNxTime", 
   "Just for starters\n \n http://www.frankenidiot.com/pdf/frankenfacts.pdf", 
   {}, 
   359388, 
   null, 
   1246592760.0
  ], 
  [
   359419, 
   null, 
   "Penfold", 
   "Just for starters\n \n http://www.frankenidiot.com/pdf/frankenfacts.pdf\n\n \n \n Knowing all that, a majority voted for him rather than face another term of the incumbent. Doesn't say much for his opponent, does it?", 
   {}, 
   359416, 
   null, 
   1246593120.0
  ], 
  [
   359422, 
   null, 
   "CUNxTime", 
   "Knowing all that, a majority voted for him rather than face another term of the incumbent. Doesn't say much for his opponent, does it?\n\n \n Can't disagree on that... to say that Frankin is the best we can find in an entire saddens me to the core and makes me wonder what our democracy has become.... They all suck, I guess.", 
   {}, 
   359419, 
   null, 
   1246593900.0
  ], 
  [
   359460, 
   null, 
   "Bad Mojo", 
   "Just for starters\n \n http://www.frankenidiot.com/pdf/frankenfacts.pdf\n\n \n A bunch of quotes taken way out of context and some kind of on the mark? For example, Franken calling Coleman Bush's butt boy...sounds about right and given your screen name I'm hard pressed to see that you would have a problem with that term. Also, to get your information you go to a site with Franken's picture next to a hammer & sickle?", 
   {}, 
   359416, 
   null, 
   1246646640.0
  ], 
  [
   359466, 
   null, 
   "Bad Mojo", 
   "Actually, let's got through some of these, shall we?\n \n First one:\n \n \nStar Tribune: \"There Are Few Political Celebrities On The National Scene As Divisive As Author, Actor, Radio Host And Possible Senate Candidate Al Franken.\"\n\n \n This is a portion of a review from the documentary on Al Franken. Here's where the sentence above comes from:\n \n \nThere are few political celebrities on the national scene as divisive as author, actor, radio host and possible Senate candidate Al Franken. Yet the revealing documentary \"Al Franken: God Spoke\" offers a portrait of this complex man that is - dare we say it? - fair and balanced. Neither a demolition job nor an artificially sweetened campaign biography, it should command the respect of fan and foe alike. You can leave the movie praising Franken's intelligence and pit-bull tenacity or shaking your head over his ego and vulgarity. The film follows Franken on a ... \n\n \n You can catch segments of the documentary on YouTube, or I believe you can rent it. It's worth the watch, certainly better than the guy who likes to compare an elected politiican to the former Soviet Union.\n \n \nFranken Attacked Senator Coleman As \"Butt Boy.\" \"Publicly, Franken says he won't announce until next year; privately, he's said to have decided already to stand against the Republican Norm Coleman... Coleman, says Franken bluntly, is 'one of the administration's leading butt boys.'\" (Sholto Byrnes, \"US Elections: Franken On The Airwaves, And The Hustings,\" New Statesman, October 30, 2006)\n\n \n Hmm, yeah...I really don't have a problem with any of this. Franken called Coleman Bush's butt boy before he was running for senate. It was either on his show or David Letterman, I have no idea. The sentiment is correct, I wouldn't condone a politician to necessarily use this language however it's nothing new and it's a far cry from Coulter calling Edwards, Gore and Clinton \"#######\". \n \n \nFranken Jokes About Executing Karl Rove & Scooter Libby. \"\"The President's father...has said that outing a CIA agent is treason....What it looks like is going to happen is that [Lewis] Libby and Karl Rove are going to be executed....I don't know how I feel about it because I'm basically against the death penalty, but they are going to be executed.\" (CBS's \"Late Show with David Letterman,\" October 21, 2005)\n\n \n Completely out of context and disingenuous. Franken is simply stating fact, outing a CIA agent is treason and treason is punishable by death. The joke is the hypocrisy of the republican party. Bush's father has stated (pre Plame) that outing spies is treason and that is basically what Libby, Rove and crew did. Franken didn't joke and say they should be executed nor did he make any threats. You can probably YouTube this as well, it's pretty funny.\n \n \nFranken To Karl Rove: \"I Hate You.\" \"At a black-tie dinner in Washington last spring, Franken says, Karl Rove ribbed him for standing when the president entered the room. But Rove remembers it differently. Franken, he says, came over to him and said, 'I'm Al Franken. I hate you and you hate me.' Rove says he was taken aback.\" (Weston Kosova, \"Live, From the Left, It's...\" Newsweek, March 29, 2004)\n\n \n Yes, let's use Karl Rove as a truthful source. it's obvious there is no love lost between the two and Rove has several issues with \"truthiness\". And, even if it were true, in what context was this conversation in? Believe it or not I don't remember Franken ever just beaming out \"I hate you\" to anyone, sure he makes fun of people but he's a tad more clever than that.\n \n \nFranken Hates Rush Limbaugh. Q: \"Do you really hate Limbaugh or is he just an easy target?\" A:\"Both.\" (Jennifer Senior, \"Al Franken, Democrats' Favorite Comic Is Politically Incorrect,\" The Hill, August 25, 1996)\n\n \n Uh, yeah. Most of this country hates Rush Limbaugh, so? He answered the question honestly, also 12 years before he ran for senator. The only people I know who don't hate Rush Limbaugh are folks like archangel.\n \n \nWatch Franken Lash Out At Film Critic Michael Medved. (\"'God Spoke\" Movie Trailer, http://www.godspokefilm.com/,Accessed February 13, 2007)\n\n \n Context? Any? No? Ok.\n \n Shall we go on?", 
   {
    "unicode_changes_made": true
   }, 
   359460, 
   null, 
   1246649280.0
  ], 
  [
   359467, 
   null, 
   "thelmoose", 
   "Just for starters\n \n http://www.frankenidiot.com/pdf/frankenfacts.pdf\n\n \n That stuff makes me want to vote for him. He ridicules the ridiculous. He is calling out liars. The charges of sexism and racism are not correct - he is mocking prejudice, not engaging in it.", 
   {}, 
   359416, 
   null, 
   1246649580.0
  ], 
  [
   359469, 
   null, 
   "CUNxTime", 
   "A bunch of quotes taken way out of context and some kind of on the mark? For example, Franken calling Coleman Bush's butt boy...sounds about right and given your screen name I'm hard pressed to see that you would have a problem with that term. Also, to get your information you go to a site with Franken's picture next to a hammer & sickle?\n\n \n Actually, I don't care that he said 'butt boy'. I've been watching and hearing Al Frankin for a LONG time. I'm certainly not going to go find every thing that makes him a Mor on...I simply Googled him and posted the first site that came up. If YOU'D like more info on why he's a Mor on you can do your own search and I'm sure you'll find PLENTY!!! lol", 
   {}, 
   359460, 
   null, 
   1246651380.0
  ], 
  [
   359470, 
   null, 
   "Bad Mojo", 
   "Actually, I don't care that he said 'butt boy'. I've been watching and hearing Al Frankin for a LONG time. I'm certainly not going to go find every thing that makes him a Mor on...I simply Googled him and posted the first site that came up. If YOU'D like more info on why he's a Mor on you can do your own search and I'm sure you'll find PLENTY!!! lol\n\n \n You seem like an OK guy but this is a complete cop out. You know Al Franken but you choose an incredibly unreliable source to quote because it's the first thing that popped up on a google search? Yeah, that's under par. You may not like Franken or his politics but a moran? Come on, that's weak.", 
   {}, 
   359469, 
   null, 
   1246652160.0
  ], 
  [
   359471, 
   null, 
   "CUNxTime", 
   "You seem like an OK guy but this is a complete cop out. You know Al Franken but you choose an incredibly unreliable source to quote because it's the first thing that popped up on a google search? Yeah, that's under par. You may not like Franken or his politics but a moran? Come on, that's weak.\n\n \n kk...let me put it like this. Over the years I've heard him and things related to him. I'm not gonna find everything. On Google, the first page that came up, I felt gave an ADEQUATE representation of some of the things that, IMHO, make him a Mor on. My opinion of his is he is a Mor on much in the same way GLENN BECK is a Mor on. That better lol?????", 
   {}, 
   359470, 
   null, 
   1246653960.0
  ], 
  [
   359473, 
   null, 
   "Bad Mojo", 
   "kk...let me put it like this. Over the years I've heard him and things related to him. I'm not gonna find everything. On Google, the first page that came up, I felt gave an ADEQUATE representation of some of the things that, IMHO, make him a Mor on. My opinion of his is he is a Mor on much in the same way GLENN BECK is a Mor on. That better lol?????\n\n \n \n Is that better? No, you have yet to come up with anything tangible. Glenn Beck is predicting a fascist-socialist-un whitie like take over of this country. Al Franken had a radio show and wrote a couple of (outstanding might I add) books about the hypocrisy of people just like Beck. It's actually too bad that he's a senator as I'd love to see him take on the cry-baby.", 
   {}, 
   359471, 
   null, 
   1246654200.0
  ], 
  [
   359474, 
   null, 
   "CUNxTime", 
   "AL FRANKEN, HYPOCRITE - New York Post\n \n kk one example and I gotta go to work.", 
   {}, 
   359473, 
   null, 
   1246654560.0
  ], 
  [
   359478, 
   null, 
   "Bad Mojo", 
   "Ok, so Franken didn't carry Worker's Compensation insurance while he hired some temporary help with his last book. He was not compliant with the state of New York and he has now paid it. \n \n Was it his error? Yeah, probably. Does that make him a mor on? No. Does that make him what the NY Post is implying? A hypocrite? Not really, this sort of thing happens quite often, it shouldn't but I don't see the big issue here. If something like this happened to Glenn Beck, George Bush, Karl Rove, I don't think I'd care, it's called an oversight.\n \n Eh, at least we aren't linking to the first item on a google search that turns out to be something you didn't bother to read.", 
   {}, 
   359474, 
   null, 
   1246656600.0
  ], 
  [
   359690, 
   null, 
   "jitobear", 
   "This Minnesotan is so glad this is over and is proud to say she didn't vote for either of these A-holes.", 
   {}, 
   359478, 
   null, 
   1246833720.0
  ], 
  [
   372022, 
   null, 
   "JesmanVA", 
   "What a joke.", 
   {}, 
   359469, 
   null, 
   1254347100.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Al Franken gets \"elected\"", 
  "url": "http://www.4forums.com/political/elections-debates/12937-al-franken-gets-elected.html", 
  "breadcrumbs": [
   "Elections"
  ], 
  "id_number": 12937, 
  "discussion_files": [
   [
    "17790.html", 
    "http://www.4forums.com/political/elections-debates/12937-al-franken-gets-elected-print.html"
   ], 
   [
    "17791.html", 
    "http://www.4forums.com/political/elections-debates/12937-al-franken-gets-elected-2-print.html"
   ]
  ], 
  "identifier": 12937
 }
]