[
 [
  [
   359485, 
   null, 
   "simone", 
   "America is liberated from the scourge of the Sarah Palin.\n \n Obviously, there must be some sort of investigation going on which will disclose something icky about Palin and she's getting out while the getting is good.", 
   {
    "post_info": {
     "post_title": "Palin Resigns"
    }
   }, 
   null, 
   null, 
   1246659240.0
  ], 
  [
   359556, 
   null, 
   "Zardoz", 
   "America is liberated from the scourge of the Sarah Palin.\n \n Obviously, there must be some sort of investigation going on which will disclose something icky about Palin and she's getting out while the getting is good.\n\n \n *sheds a tear*\n \n There's HOPE for the republican party.\n \n Here I was, all ready to flee the US due to the horrible turns it had made. Electing some corrupt demagogue from the most corrupt city on Earth. \n And the only opposition to that was in the hands of a babbling fool from the back woods...and she pulls a string of 'Hail Mary...full of grace, the lord is with thee' beeds...right out of her bung ('cause pentacostals mistake them too often for sex toys).\n I hope she left for mental illness reasons and not because she was a hypacritical nutter with Obamanesque ethics.\n \n Dance with me Simone.\n And then let us sacrific some unborn children that someone with vision, moral fortitude and scruples along with a cast iron back bone takes the reins of the GOP.\n I hear they have been working wonders on cloning and some vault must contain some genetic samples of the bestest little guy with a funny mustache that would fill that spot exactly.\n Someone who can actually be 'born' in America and would have ability to hold a Nuremberg style rally that would rival Obama's inauguration.\n And maybe, if we're lucky, we can get a dash of the genes of whoever can make the friggin' trains run on time. I always had a soft spot for those who promise effective mass transportation...and can deliver.\n \n :xbanghead", 
   {}, 
   359485, 
   null, 
   1246689420.0
  ], 
  [
   359681, 
   null, 
   "simone", 
   "You! You! \n \n I've just found out that Sarah Palin is the mysterious woman you were secretly meeting in Argentina!\n \n How dare you!", 
   {}, 
   359556, 
   null, 
   1246819740.0
  ], 
  [
   359739, 
   null, 
   "Another opinion", 
   "It is interesting to note that even conservatives are perplexed and critical of her decision to quit. From Conservatives taken aback by Palin's decision to resign - CNN.com :\n \nBy contrast, those on the political right acknowledged that they didn't know what to make of it.\n \n Karl Rove, the \"architect\" of George W. Bush's successful presidential campaigns, said the resignation left many of Palin's fellow Republicans \"a little perplexed.\"\n \n \"It's a risky strategy,\" Rove told \"Fox News Sunday.\"\n \n \"Astounding,\" was the pronouncement by Republican Sen. Chuck Grassley of Iowa, and conservative columnist George Will said Palin was declaring herself a quitter.\n\n \n Does this spell the end of her potential 2012 presidential run? I hope so. I would hate to see yet another Bush-like candidate run.\n \n Republicans have a difficult decision to make about whether to stick with their far-right platform and approach or whether to go more moderate. Going more moderate might win them more of the swing votes but might lose some of the core Religious Right constituency. The only chance they really have is what they seem to be trying to do now - grosely distort and exaggerate Obama's presidential activities. So far, it doesn't seem to be working particularly well since his popularity has not diminished since February, remaining at its over sixty percent job approval status. If the economy turns around, and no new major stimulus packages get pushed through, then the exaggerated rhetoric about this year's deficit will die down (given the short attention span of the American people). As for health care, polls show that most Americans support having a system that will offer health care to the poor and most support health care reforms. The majority may not support the US being purely government run health care but, since that is not what Obama is presenting, that will only be an issue among the far right conservatives who dwell on paranoia instead of reality.\n \n So, it doesn't look like the Republicans will come back into power anytime soon. Personally, I hope that they do turn more moderate (which is looking less probable as time goes on) since it would be nice to have a real choice again.", 
   {}, 
   359681, 
   null, 
   1246898100.0
  ], 
  [
   359751, 
   null, 
   "Steamroller", 
   "America is liberated from the scourge of the Sarah Palin.\n\n \n \"Scourge\"??? OMG she loves Alaska and the United States! She's only been married once! She believes that people should abstain from sex until they get married..., HOW COULD SHE?? \n \n AND IT GETS WORSE!!! She believes we should WORK for a living instead of waiting for the govt to spoon feed us!! emoticon_ic\n \n AND IT GETS WORSER!!! She doesn't like wasting tax payer dollars!!!!\n \n For crying out loud SHE'S THE ANTI-CHRIST!! Run! Hide the children! Grab the food-stamps and protect yourselves!!!!emoticon_ic\n \n \nIt is interesting to note that even conservatives are perplexed and critical of her decision to quit. From Conservatives taken aback by Palin's decision to resign - CNN.com :\n \n \n Does this spell the end of her potential 2012 presidential run? I hope so. I would hate to see yet another Bush-like candidate run.\n \n Republicans have a difficult decision to make about whether to stick with their far-right platform and approach or whether to go more moderate. Going more moderate might win them more of the swing votes but might lose some of the core Religious Right constituency. The only chance they really have is what they seem to be trying to do now - grosely distort and exaggerate Obama's presidential activities. So far, it doesn't seem to be working particularly well since his popularity has not diminished since February, remaining at its over sixty percent job approval status. If the economy turns around, and no new major stimulus packages get pushed through, then the exaggerated rhetoric about this year's deficit will die down (given the short attention span of the American people). As for health care, polls show that most Americans support having a system that will offer health care to the poor and most support health care reforms. The majority may not support the US being purely government run health care but, since that is not what Obama is presenting, that will only be an issue among the far right conservatives who dwell on paranoia instead of reality.\n \n So, it doesn't look like the Republicans will come back into power anytime soon. Personally, I hope that they do turn more moderate (which is looking less probable as time goes on) since it would be nice to have a real choice again.\n\n \n Take a look at her career, this is classic Palin. Will it work?? Don't ask me I spend hours posting on website that has zero consequence on the things that really matter, but I think it's a bit pre-mature to count her out.\n \n Do you really think the alarm over Obama's spending habits is \"exaggerated rhetoric\"??\n \n When Bush left office the federal deficeit was about 480 billion before the stimulus, Obama's first budget was 1.5 trillion in the red....\n \n Quick question..., 1 billion seconds is roughly 31 years..., How many years is a trillion seconds? Once you convert that to dollars..., do ya think there might be reason for concern???:(", 
   {}, 
   359739, 
   null, 
   1246912560.0
  ], 
  [
   359756, 
   null, 
   "Another opinion", 
   "Take a look at her career, this is classic Palin. Will it work?? Don't ask me I spend hours posting on website that has zero consequence on the things that really matter, but I think it's a bit pre-mature to count her out.\n\n I don't think that most people pay any attention to her earlier career habits. She gained popularity because of her personal attractiveness, charisma, and because she was saying the things that conservatives enjoyed hearing. Therefore, any mishaps she took in her career in the past were largely ignored by the public. However, now, she is very much in the public spotlight - especially with the possibility of her being a presidential contender in 2012. Any such mishaps are thus far more important than mishaps that she might have made in the past. It will be interesting to watch how the spin on Fox News progresses over the next days but I suspect that the Republican elite are starting to view her as more of a liability than an asset.\n \nDo you really think the alarm over Obama's spending habits is \"exaggerated rhetoric\"??\n \n When Bush left office the federal deficeit was about 480 billion before the stimulus, Obama's first budget was 1.5 trillion in the red....\n\n You are saying that Bush's deficit before the stimulus was 480 billion. That stimulus is the whole point. Both Bush and Obama introduced stimulus packages to try to shore up the US economy that likely would have done far worse without the stimulus packages. I don't like to see us go farther into debt. However, there is one type of situation where I view added debt as necessary - i.e. to try to get us out of Recession. That is precisely the situation we are in. I know that you probably don't believe in Keynesian economics but it did work to get us out of the Great Depression and it did work for Reagan to pull us out of the late 70s Recession. \n \nQuick question..., 1 billion seconds is roughly 31 years..., How many years is a trillion seconds? Once you convert that to dollars..., do ya think there might be reason for concern???:(\n\n A trillion dollars may seem like an enormous amount to you and me but we cannot compare a trillion dollars to our own finances. We need to compare them to the finances of the US. In other words, that added debt needs to be compared to US GDP. Compared to our over $14 trillion GDP, that $1 trillion is around seven percent. That is the equivalent of someone earning $30,000 a year borrowing $2100 - not a great thing to do but certainly sustainable.", 
   {}, 
   359751, 
   null, 
   1246915140.0
  ], 
  [
   359775, 
   null, 
   "marc9000", 
   "I don't think that most people pay any attention to her earlier career habits. She gained popularity because of her personal attractiveness, charisma, and because she was saying the things that conservatives enjoyed hearing. \n\n \n And she gained notoriety with Democrats for the same reasons. It's not like the running mates of past losing presidential candidates historically get much attention. How many people remember William Miller (Goldwater), or James Stockdale (Perot) or Geraldine Ferraro, (Mondale)? It's not like Palin was even the first woman VP candidate. Why has she gotten so much attention? \n \n It makes one wonder if she regrets accepting McCain's offer. Her situation as governor of Alaska changed completly after being named the VP candidate. \n \n Palin Falls into Legal Debt Fighting Ethics Charges | NBC Chicago\n \n I don't think she had much choice about resigning. If she'd tried to complete the term, the Democrat machine would have made her look far worse at the end of it, than she looks now. \n \n I'm sure she's got offers for speaking engagements etc that will pay far better than governors pay anyway. \n \n \n It will be interesting to watch how the spin on Fox News progresses over the next days but I suspect that the Republican elite are starting to view her as more of a liability than an asset. \n\n \n There will be some spin from other places as well. :) The Democrat elite aren't over their nervousness about her yet either. 2012 is a long way off.", 
   {}, 
   359756, 
   null, 
   1246930740.0
  ], 
  [
   359782, 
   null, 
   "T.Q", 
   "I would imagine the Dem's fondest dream is to have Palin declare herself in the running for 2012.", 
   {}, 
   359775, 
   null, 
   1246933020.0
  ], 
  [
   359785, 
   null, 
   "Archangel", 
   "America is liberated from the scourge of the Sarah Palin.\n \n Obviously, there must be some sort of investigation going on which will disclose something icky about Palin and she's getting out while the getting is good.\n\n \n Like the lying leftist bloggers who have slandered her since becoming a national personality, here we have simone assuming the very worst about her based on nothing at all. Especially since every one of the, what was it, 14 separate ethics investigations brought against her that have all been found to be false charges against her, personally costing her a million dollars to defend against and costing the State around 10 million dollars. \n \n In an unprecedented move, the FBI did something it never does and that is to give a press release declaring that they aren't investigating someone for wrongdoing of any kind. I can't imagine how threatened of her you are for you to lie and defame her at every turn as you do. Read it and weep slanderer. emoticon_xgood\n  FBI counters rumors, says Palin isn't under investigation\n RUMORS WRONG: Agent rebuts circulating allegations cited by Anchorage blogger.\n \n By SEAN COCKERHAM\n scockerham@adn.com\n \n (07/05/09 12:43:31) \n The FBI is taking the unusual step of declaring that Gov. Sarah Palin is not under investigation, as Palin herself left for Western Alaska and communicated to the world through her Twitter account.\n \n \n \"We are not investigating her,\" FBI spokesman Eric Gonzalez said on Sunday. \"Normally we don't confirm or deny those kind of allegations out there, but by not doing so it just casts her in a very bad light. There is just no truth to those rumors out there in the blogosphere.\"\n \n Palin has ignored requests for an interview since she abruptly announced Friday that she will be resigning as governor after two and a half years in office. She's used her Facebook page and Twitter account to speak for her and declare that she'll defend herself against attacks as she leaves office.\n \n \"Critics are spinning, so hang in there as they feed false info on the right decision made as I enter last yr in office to not run again,\" she said Sunday via the Internet social media Twitter. \"So I'll make attempt to keep up w/attaching corrected info.\"\n \n Palin \"tweeted\" that she would be going to two \"West AK\" villages on Sunday and indicated she'd soon be joining her family for a day of fishing at its commercial setnet site on the Nushagak River in Bristol Bay. That was the best indication of her whereabouts, as neither Palin's personal nor state spokeswomen responded to requests for comment. She remains the governor until July 26.\n \n There's been raging national speculation about why she is resigning. Palin, in her Friday speech announcing it, cited frustration over all the ethics complaints filed against her. She said she didn't want to be a \"lame duck\" with no plans to run for re-election, and intended to take on an unspecified new role advancing the values she supports.\n \n Palin's personal attorney, Thomas Von Flein, on Saturday denounced rumors that Palin resigned because she is under criminal investigation, and threatened legal action against anyone publishing such \"defamatory\" material about the governor. Van Flein specifically targeted Shannyn Moore, a blogger and radio talk show host in Anchorage.\n \n Moore fired back on Sunday by calling a press conference in front of the governor's downtown Anchorage office and calling Palin \"a coward and a bully.\" Moore said she only pointed out that rumors existed -- and she never claimed them to be fact.\n \n \"What kind of politician attacks an ordinary American on the Fourth of July for speaking her mind? What's wrong with her? The first amendment was designed to protect people like me from people like her. Our American revolution got rid of kings. And it got rid of queens, as well. Am I annoyed? You betcha,\" Moore said.\n \n She said that \"Shannyn Moore will not be muzzled.\"\n \n Van Flein responded Sunday that it is not about muzzling. Palin is entitled to respond to lies, he said.\n \n \"The Constitution allows anyone to print what they want, but it does not say you can do so with impunity and with a total disassociation from reality ... to be blunt: falsely implying that the governor, or her husband, are under federal investigation, is not free speech, \" Van Flein said.\n \n Such rumors were common on the Internet last fall when Palin was running for vice president, and they have surfaced on many Web sites in recent days. Moore apparently got Palin's attention when she spoke about it on the national television network MSNBC on Friday, the day Palin announced she would resign in three weeks. \n \n \"There is a scandal rumor here that there is a criminal investigation into some activities and that's been rumored for about, I don't know, probably six weeks or two months,\" Moore said on MSNBC, later commenting that Palin looked nervous and she believed the governor was doing damage control for news that would come out.\n \n Van Flein on Sunday also highlighted a message Moore sent Friday on her own Twitter account, saying \"yes, I know the nature of the scandal. Timing, baby timing.\" He said Moore has been cited as a source for reporting of a possible federal indictment. (The national \"Brad Blog\" quoted Moore as saying Palin resigned because a scandal was about to break. Moore said she was misquoted and can't control other blogs.)\n \n Moore said the governor's sudden resignation didn't make sense and has Alaskans wondering what is really going on. She said Palin had a \"massive overreaction\" to her comments.\n \n \"I think it's great that the FBI has come out and said the rumor isn't true. ... But the fact, that I reported, that there was a rumor, is true. There was a rumor and she dispelled the rumor and that's great,\" Moore said.\n \n Palin's reaction came Sunday via her Twitter account, which limits all messages to 140 characters.\n \n \"Trying to keep up w/getting truth to u, like proof there's no 'FBI scandal',\" the governor tweeted. FBI counters rumors, says Palin isn't under investigation: Gov. Sarah Palin | adn.com", 
   {}, 
   359485, 
   null, 
   1246934520.0
  ], 
  [
   359786, 
   null, 
   "Archangel", 
   "I would imagine the Dem's fondest dream is to have Palin declare herself in the running for 2012.\n\n \n Funny, it's the fondest dream of true conservatives also. :p And by 2012 she will look really good in comparison to havoc left in the wake of this leftist majority, led by their socialist messiah.", 
   {}, 
   359782, 
   null, 
   1246934820.0
  ], 
  [
   359789, 
   null, 
   "Penfold", 
   "Caribou Barbie couldn't beat Bo, let alone Barack Obama, so who is the far right's 2016 candidate?", 
   {}, 
   359786, 
   null, 
   1246936500.0
  ], 
  [
   359829, 
   null, 
   "CUNxTime", 
   "Caribou Barbie couldn't beat Bo, let alone Barack Obama, so who is the far right's 2016 candidate?\n\n \n Of course, this isn't trolling nor is it an attempt to perpetuate the Perpetual Non-Topical Obfuscation of these threads!", 
   {}, 
   359789, 
   null, 
   1246978320.0
  ], 
  [
   359834, 
   null, 
   "Penfold", 
   "Of course, this isn't trolling nor is it an attempt to perpetuate the Perpetual Non-Topical Obfuscation of these threads!\n\n \n It is a concise observation on the sad state of the American right, who see a step toward the extreme fringe as the way back to power. (unless they plan another rebellion/secession!)\n \n Her lawyer's comment that the blogospere is full of lies about federal investigations and houses, indicates that there is probably a federal indictment pending over her dubious house ownership shenanigans. She's toast.", 
   {}, 
   359829, 
   null, 
   1246981680.0
  ], 
  [
   359838, 
   null, 
   "CUNxTime", 
   "[QUOTE]\nIt is a concise observation on the sad state of the American right, who see a step toward the extreme fringe as the way back to power. (unless they plan another rebellion/secession!)\n\n \n \"Caribu Barbie\" must mean something different in your English then in mine.\n \n \nHer lawyer's comment that the blogospere is full of lies about federal investigations and houses, indicates that there is probably a federal indictment pending over her dubious house ownership shenanigans. She's toast.\n\n \n Well, at least now you're back on topic...lol. Actually, bro, I'm just giving you a hard time as a reminder about glass houses and stones.", 
   {}, 
   359834, 
   null, 
   1246984500.0
  ], 
  [
   359873, 
   null, 
   "Another opinion", 
   "And she gained notoriety with Democrats for the same reasons. It's not like the running mates of past losing presidential candidates historically get much attention. How many people remember William Miller (Goldwater), or James Stockdale (Perot) or Geraldine Ferraro, (Mondale)? It's not like Palin was even the first woman VP candidate. Why has she gotten so much attention? \n\n Ever since the mid-90s, the rhetoric between the two parties has become even more polarized. Sarah Palin, with her \"Obama is a socialist\", \"Obama pals around with terrorists\" and other such rhetoric is a very polarizing figure - unlike most Vice-Presidential candidates of the past. That, along with the added attention paid to her due to her popularity with the right wing, is why she is getting so much attention. To Democrats, she represents the same type of approach that Bush did (probably even worse) - something that, after eight years of having had to deal with Bush's policies, Democrats are very tired of putting up with. That situation did not exist during the campaigns of the other Vice-Presidential candidates that you mention.\n \nIt makes one wonder if she regrets accepting McCain's offer. Her situation as governor of Alaska changed completly after being named the VP candidate. \n \n Palin Falls into Legal Debt Fighting Ethics Charges | NBC Chicago\n \n I don't think she had much choice about resigning. If she'd tried to complete the term, the Democrat machine would have made her look far worse at the end of it, than she looks now. \n \n I'm sure she's got offers for speaking engagements etc that will pay far better than governors pay anyway. \n\n I get the impression that she didn't realize how much scrutiny she would have to put up with when she accepted the Vice Presidential nomination - which would have been quite naive of her. Also, given how polarizing she herself chose to be in her rhetoric against Obama, she should not have been surprised that the Democrats would then try to dig up whatever dirt they could on her. If you live in glass houses, you shouldn't throw stones.\n \n I don't know if she can recover from these mis-steps. She might not loose the support of some on the far right, but her current flakiness will make it much harder for her to gain sufficient numbers of swing voters if she does run for president in 2012.", 
   {}, 
   359775, 
   null, 
   1247008680.0
  ], 
  [
   359874, 
   null, 
   "Bad Mojo", 
   "\n \n \"Caribu Barbie\" must mean something different in your English then in mine.\n\n \n Does Caribu Barbie mean the same thing as soclialist messiah in your English?", 
   {}, 
   359838, 
   null, 
   1247009040.0
  ], 
  [
   359888, 
   null, 
   "antonia", 
   "http://www.youtube.com/watch?v=Xae2JNcSR4M\n \n If Sarah Palin runs for President, it will likely be a gift to the Democrats. She'll do far more damage to the Republican party than Ralph Nader ever did to Al Gore in Florida. Without winning, either.\n \n I don't think John McCain could have won anyway, but Sarah Palin was his kiss of death. She's too radical right and she was unqualified. Now, to boot, she'll be a quitter who doesn't see her commitments through. And doesn't even provide a clear reason why.\n \n The person who has a clear reason to leave (and leave the country, for that matter!) stays on. And the one who doesn't, abandons the governorship of an entire state (\"what me worry?\") ...\n \n YouTube - Elaine Paige- Don't Cry For Me Argentina(London 1998)\n \n emoticon_cry", 
   {
    "post_info": {
     "post_title": "In either case, neither felt they would be missed ..."
    }
   }, 
   359874, 
   null, 
   1247022660.0
  ], 
  [
   359893, 
   null, 
   "Archangel", 
   "If Sarah Palin runs for President, it will likely be a gift to the Democrats. She'll do far more damage to the Republican party than Ralph Nader ever did to Al Gore in Florida. Without winning, either.\n \n I don't think John McCain could have won anyway, but Sarah Palin was his kiss of death. She's too radical right and she was unqualified. Now, to boot, she'll be a quitter who doesn't see her commitments through. And doesn't even provide a clear reason why.\n \n The person who has a clear reason to leave (and leave the country, for that matter!) stays on. And the one who doesn't, abandons the governorship of an entire state (\"what me worry?\") ...\n \n YouTube - Elaine Paige- Don't Cry For Me Argentina(London 1998)\n \n emoticon_cry\n\n \n She isn't radical right at all. That is the unfair label the left has placed on her because they so feared her popularity. That is why they have attacked her and practiced the politics of personal destruction. She is common sense right, and after 4 years of Obamanation socialism, and the systematic deconstruction of America's uniqueness, she will be a true breath of fresh air.", 
   {}, 
   359888, 
   null, 
   1247025780.0
  ], 
  [
   359894, 
   null, 
   "antonia", 
   "She isn't radical right at all. That is the unfair label the left has placed on her because they so feared her popularity. That is why they have attacked her and practiced the politics of personal destruction. She is common sense right, and after 4 years of Obamanation socialism, and the systematic deconstruction of America's uniqueness, she will be a true breath of fresh air.\n\n \n Well don't say I didn't warn you. She's affiliated with Alaska secessionists and thinks women's right to choose should be curtailed even in rape cases. Her rhetorical attacks on Obama were extremist, too. \n \n Her political aptitude was sorely lacking as well. She did not have any common sense. She allowed a Kenyan witch-hunter to publicly cleanse her of evil spirits. She couldn't determine an obvious prank caller pretending to be the President of France. She equated foreign policy experience with looking out the window at a wilderness border populated by seals. She charged rape victims for rape kits. \n \n I didn't have much interest in her personal family life. I think politician's family business, right or left, are too closely scrutinized. Right or left, they go for each other's jugulars like dogs.", 
   {}, 
   359893, 
   null, 
   1247026980.0
  ], 
  [
   359897, 
   null, 
   "Archangel", 
   "Well don't say I didn't warn you. She's affiliated with Alaska secessionists and thinks women's right to choose should be curtailed even in rape cases. Her rhetorical attacks on Obama were extremist, too. \n \n Her political aptitude was sorely lacking as well. She did not have any common sense. She allowed a Kenyan witch-hunter to publicly cleanse her of evil spirits. She couldn't determine an obvious prank caller pretending to be the President of France. She equated foreign policy experience with looking out the window at a wilderness border populated by seals. She charged rape victims for rape kits. \n \n I didn't have much interest in her personal family life. I think politician's family business, right or left, are too closely scrutinized. Right or left, they go for each other's jugulars like dogs.\n\n \n You have just repeated the same old leftist talking points in order to demonize her once again. Especially the lie about the kenyan witch hunter (doctor) cleansing her of evil spirits. That is the most dishonest and racist accusation of all. That man is an African who has been saved, born again, and he prayed over her in Jesus name. But the left cannot get it right and must distort the truth in order to make her look stupid, even to the point of accusing an African brother in Christ of being some witch doctor.\n \n This is what I marvel at about the left as they condemn christians and all we represent. They don't understand, or care that we have a family of God through Christ from every single country on Earth. Just months ago, we had a Russian Pastor who traveled with a translator and spoke at our church about the work being done in Russia with drug addicts from within the church. We have missionaries is every country on Earth. God does NOT discriminate, but the so called free thinking leftists do at every turn if someone doesn't see the world through their rose colored glasses.", 
   {}, 
   359894, 
   null, 
   1247029740.0
  ], 
  [
   359904, 
   null, 
   "antonia", 
   "You have just repeated the same old leftist talking points in order to demonize her once again. Especially the lie about the kenyan witch hunter (doctor) cleansing her of evil spirits. That is the most dishonest and racist accusation of all. That man is an African who has been saved, born again, and he prayed over her in Jesus name. But the left cannot get it right and must distort the truth in order to make her look stupid, even to the point of accusing an African brother in Christ of being some witch doctor.\n\n \n Talk about playing the race card! Isn't that what you righties are forever weeping about? This has nothing to do with race, but reason and science, your twin evils!\n \n The Kenyan Witch Hunter is exactly that. Another superstitious nincompoop whatever the race, nationality, gender or creed. The equivalent of Colonial America's White Salem Witch burners. He riled up an entire town against an innocent, impoverished woman who was not doing anything more than trying to scrape by a subsistence living reading fortunes. He blamed the entire town's hard times on this one woman, that she was an evil witch, culminating with his further insane proposition that, because she lived near a dangerous intersection where some people had been run over, that she was responsible for their deaths too! This conclusively *Proved* her intimate relationship with evil and all evil that had befallen the town! Because she lived near the scene of the deaths! With his mad, irrational, illogical, unscientific, evil spirit rhetoric, he whooped up an insane lynch mob that went after this poor woman and drove her out of town! \n \n Now he comes to America and exploits the ignorant here, too. Bet you didn't consider that since the only ignorant fools in your book are in places like Africa! Not white Christian people too!\n \n Just because he throws in the name, \"Jesus\", doesn't mean a darn thing. I suppose you'd think if they were praying, \"In the Name of Jesus, Jesus,\" while they were burning people, it wouldn't be superstitious nonsense, either!\n \n \nThis is what I marvel at about the left as they condemn christians and all we represent.\n\n \n If that's what you call Christians and all Christians represent, I most certainly do condemn it!\n \n \n They don't understand, or care that we have a family of God through Christ from every single country on Earth. \n\n \n More like one can have a bunch of fools for the taking, in any nation, and for any unscrupulous, hate-mongering charlatan.\n \n And your Sarah Palin was so UNcommonsensical, she stepped right up to him to be blessed and cleansed of evil spirits, thinking, \"Isn't this groovy?\"\n \n Just what we need in a President!\n \n emoticon_rolleyes\n \n Wonder how they'd figure out (*divine* the causes to -- or *locus* of) America's problems!\n \n \nJust months ago, we had a Russian Pastor who traveled with a translator and spoke at our church about the work being done in Russia with drug addicts from within the church.\n\n \n Fine and well. But the subject is not helping drug addicts. No one has criticized such efforts. *Strawman*\n \n \nWe have missionaries is every country on Earth.\n\n \n I don't know who you mean by \"we\". I see that many people consider themselves Christians, but you don't include them in your book.\n \n They are not your fellow Christians. Obama, for instance, and all the evil the minister prayed to keep away from Missy Sarah. And what about the woman they drove out of town??\n \n \nGod does NOT discriminate, but the so called free thinking leftists do at every turn if someone doesn't see the world through their rose colored glasses.\n\n \n It never fails to me amaze me how easily you see yourself as speaking for God and God's side, Archangel.\n \n Just as this minister in Kenya did.", 
   {}, 
   359897, 
   null, 
   1247033400.0
  ], 
  [
   359914, 
   null, 
   "antonia", 
   "Just a side note, Archangel, and not to get off-topic, but it occurred to me, you know where you see this kind of crazed cause/effect thinking? In the Middle East debate, when you listen to, the left actually, talking about Israel. You might as well be listening to the Kenyan Witch Hunter divining the locus of evil and cause for the town's (now world's) problems. The thinking process, the illogical connections, believed to be rational, is similar. IMO.", 
   {}, 
   359904, 
   null, 
   1247041860.0
  ], 
  [
   359933, 
   null, 
   "Archangel", 
   "Talk about playing the race card! Isn't that what you righties are forever weeping about? This has nothing to do with race, but reason and science, your twin evils!\n\n \n Actually, NO. That's just another leftist false accusation designed to demonize the Right with unproven innuendoes. It has always been the democratic party which truly fought against racial equality in a dedicated and committed way. Even the 64 civil rights act was delayed and fought against by the so called free thinking democrats. Yet, somehow, they have proven the old adage that if you tell a lie enough time then it becomes true since they have claimed the mantle of working for the racial equality they actually fought against for so long.\n \n \nThe Kenyan Witch Hunter is exactly that. Another superstitious nincompoop whatever the race, nationality, gender or creed. The equivalent of Colonial America's White Salem Witch burners. He riled up an entire town against an innocent, impoverished woman who was not doing anything more than trying to scrape by a subsistence living reading fortunes. He blamed the entire town's hard times on this one woman, that she was an evil witch, culminating with his further insane proposition that, because she lived near a dangerous intersection where some people had been run over, that she was responsible for their deaths too! This conclusively *Proved* her intimate relationship with evil and all evil that had befallen the town! Because she lived near the scene of the deaths! With his mad, irrational, illogical, unscientific, evil spirit rhetoric, he whooped up an insane lynch mob that went after this poor woman and drove her out of town! \n\n \n Now let me offer the propaganda source for these lies. Notice at the end of this short video, the authors of it are Obamanites who, like you promote unsupported lies which are never proven by an objective source at all. YouTube - Sarah Palin IS De-Witched!\n \n \n Now he comes to America and exploits the ignorant here, too. Bet you didn't consider that since the only ignorant fools in your book are in places like Africa! Not white Christian people too!\n \n Just because he throws in the name, \"Jesus\", doesn't mean a darn thing. I suppose you'd think if they were praying, \"In the Name of Jesus, Jesus,\" while they were burning people, it wouldn't be superstitious nonsense, either!\n\n \n Here is what you have done antonia, and there is nothing at all honest about it. You have taken a talk given by a visiting evangelist and corrupted it to be an event which you have used to define a complete belief system, not to mention categorize and demonize Sarah Palin for being in the same church as that man. This man was saved out of an African culture which is rife with demonic influences. He knows and understands the power of darkness like we rarely see on this continent.\n \n You have defamed what he represents and lied about the christian beliefs which is all inclusive of all peoples from every land on Earth whatever the culture they come out of. Christ crosses all racial barriers to unite humanity under His banner of love. \n \n \nIf that's what you call Christians and all Christians represent, I most certainly do condemn it!\n \n More like one can have a bunch of fools for the taking, in any nation, and for any unscrupulous, hate-mongering charlatan.\n \n And your Sarah Palin was so UNcommonsensical, she stepped right up to him to be blessed and cleansed of evil spirits, thinking, \"Isn't this groovy?\"\n \n Just what we need in a President!\n \n emoticon_rolleyes\n \n Wonder how they'd figure out (*divine* the causes to -- or *locus* of) America's problems!\n \n Fine and well. But the subject is not helping drug addicts. No one has criticized such efforts. *Strawman*\n \n I don't know who you mean by \"we\". I see that many people consider themselves Christians, but you don't include them in your book.\n \n They are not your fellow Christians. Obama, for instance, and all the evil the minister prayed to keep away from Missy Sarah. And what about the woman they drove out of town??\n \n It never fails to me amaze me how easily you see yourself as speaking for God and God's side, Archangel.\n \n Just as this minister in Kenya did.\n\n \n Look at the hatred you represent and spew about this fellow woman just because she supports small Government and protecting the rights of the innocent unborn? You can't even see that you are condemning all women by dishonestly demonizing her. You are no better than the propagandists who have claimed to care about fair play as you lie about her at every single turn. Every single accusation you have made against her can be traced to a leftist propaganda source, but you repeat them anyway as if they are actually factual events or recollections.\n \n And all people who claim Christ, don't know Him at all. That is true and must be pointed out when liars attempt to profit from a perceived relationship they haven't a clue about in reality; like Obama.\n \n And using the judgement God gave is to discern the truth from a lie which your side propagates in every argument you endorse isn't speaking for God at all. I am speaking for myself. You just imply that I am speaking for God so as to attempt to marginalize my opinions. emoticon_angry emoticon_xdonno", 
   {}, 
   359904, 
   null, 
   1247057640.0
  ], 
  [
   359936, 
   null, 
   "Penfold", 
   "Rebuking every form of witchcraft......\n \n http://www.youtube.com/watch?v=gN7hJDS26rI&feature=related\n \n \n Aside from her whacky religious persuasion, her dubious ethics and her poor parenting skills, somebody needs to get out a book and read it to her, slowly.\n \"The Constitution for Dummies\" would seem like a good starter.\n (Unless the White House really does have a secret \"Department of Law\" which goes around silencing presidential critics.....)\n \n Sarah Palin Speaks to ABC News - ABC News", 
   {}, 
   359933, 
   null, 
   1247066400.0
  ], 
  [
   359937, 
   null, 
   "snakespit", 
   "This man was saved out of an African culture which is rife with demonic influences. He knows and understands the power of darkness like we rarely see on this continent.\n\n Can you define the term \"rife with demonic influences\"? \n \n \nYou have defamed what he represents and lied about the christian beliefs which is all inclusive of all peoples from every land on Earth whatever the culture they come out of. Christ crosses all racial barriers to unite humanity under His banner of love. \n\n Wow...2000 years and Christ has managed to unite only about 1/4 of the worlds population. No exactly a bell-ringer for the resume of a supreme being. \n \n \n \n \nAnd all people who claim Christ, don't know Him at all. That is true and must be pointed out when liars attempt to profit from a perceived relationship they haven't a clue about in reality; like Obama.\n \n And using the judgement God gave is to discern the truth from a lie which your side propagates in every argument you endorse isn't speaking for God at all. I am speaking for myself. You just imply that I am speaking for God so as to attempt to marginalize my opinions. emoticon_angry emoticon_xdonno\n\n \n All people? You included? \n \n What is interesting is that you claim to be speaking for yourself, but then pass judgement on Obama's relationship with \"god\" as if you were given some sort of divine insight. Only \"god\" and Obama know their true relationship, yet you seem perfectly comfortable in calling Obama a 'liar with a perceived relationship'. Do you see what I am getting at? Either you are speaking with some sort of divine knowledge, or you are orating out of your posterior.", 
   {}, 
   359933, 
   null, 
   1247067300.0
  ], 
  [
   359947, 
   null, 
   "antonia", 
   "Archangel,\n \n The point you evade is that not permitting rational criticicism of a person on the basis of their race is a fallacious argument.\n \n \nNow let me offer the propaganda source for these lies. Notice at the end of this short video, the authors of it are Obamanites who, like you promote unsupported lies which are never proven by an objective source at all. YouTube - Sarah Palin IS De-Witched!\n\n \n The scene is there for all to view on video. So I don't see how the authors being supporters of Obama falsifies the scene in any way whatsoever.\n \n Plus, the so-called \"propaganda\" source for this story was initially the Christian Science Monitor in 1999, among some other leading media sources. Hardly what you'd call biased, let alone against Christianity:\n \n US Elections - Times Online - WBLG: Palin linked electoral success to prayer of Kenyan witchhunter\n \n \nThis man was saved out of an African culture which is rife with demonic influences. \n\n \n That sounds like a white racist stereotype of African culture.\n \n \nHe knows and understands the power of darkness like we rarely see on this continent.\n\n \n Oh sure! emoticon_rolleyes Which is why he riled up a lynch mob that wanted to stone an innocent woman as a witch, and eventually drove her out of town.\n \n Sounds like some old time signs in Alabama, Mississippi, or Arkansas, AFAIC.\n \n \nChrist crosses all racial barriers to unite humanity under His banner of love\n\n \n That's not love described in that story, but hatred.\n \n \nYou just imply that I am speaking for God so as to attempt to marginalize my opinions. \n\n \n One does not need to imply anything. You consistently claim to be speaking for God and God's Truth, and now, on behalf of the Republican Party, which is pretty sad.", 
   {}, 
   359937, 
   null, 
   1247082840.0
  ], 
  [
   359954, 
   null, 
   "sinjin", 
   "...by 2012 she will look really good in comparison to havoc left in the wake of this leftist majority, led by their socialist messiah.\nSays the guy who predicted a resounding McCain victory.emoticon_cry", 
   {}, 
   359786, 
   null, 
   1247093040.0
  ], 
  [
   359961, 
   null, 
   "Steeeeve", 
   "Republicans have a difficult decision to make about whether to stick with their far-right platform and approach or whether to go more moderate. Going more moderate might win them more of the swing votes but might lose some of the core Religious Right constituency. \nThey tried having a \"moderate\" with McCain and that failed. This idea that moderates are the way to go is silly and has proven wrong time and time again. Obama is ultra left and moderates voted for him because Bush failed. When Obama fails, and it is looking like he will within 8 years, the moderates will vote for the right. Kerry is another example of someone trying to pull off being a moderate and failing.\n \n \nThe only chance they really have is what they seem to be trying to do now - grosely distort and exaggerate Obama's presidential activities. So far, it doesn't seem to be working particularly well since his popularity has not diminished since February, remaining at its over sixty percent job approval status\nThis isn't true and frankly they are only distorting his activities by not showing their true form which are facist like Bush.\n \n Furthermore, his approval rating has gone done: Rasmussen Reports: The Most Comprehensive Public Opinion Data Anywhere\n \n \nIf the economy turns around, and no new major stimulus packages get pushed through, then the exaggerated rhetoric about this year's deficit will die down (given the short attention span of the American people).\nI remember your argument about % of GDP for debt. You have to understand that a comparison like that is worthless and I'm not sure how you could see it as relevant. It certainly isn't exaggerated. The GAO has been warning of the dangers for the better part of the decade. These guys have been right about some of the most important aspects in our government yet we never listen to them. But you are right, the American people won't care because it doesn't have a consequence seen tomorrow.\n \n \n As for health care, polls show that most Americans support having a system that will offer health care to the poor and most support health care reforms. The majority may not support the US being purely government run health care but, since that is not what Obama is presenting, that will only be an issue among the far right conservatives who dwell on paranoia instead of reality.\nRead between the lines. He is clearly proposing this but starting with a baby step. No one can compete with a company that has unlimited funds. And since he plan keeps changing daily we can't even say that for sure.\n \n \nSo, it doesn't look like the Republicans will come back into power anytime soon. Personally, I hope that they do turn more moderate (which is looking less probable as time goes on) since it would be nice to have a real choice again.\nIs your definition of moderate a fascist state? These are certainly not moderate policies. You may think that is extreme but Bush and Obama have given us the same plan...more federal government less local government and freedom. The only difference is the excuse.", 
   {}, 
   359739, 
   null, 
   1247098020.0
  ], 
  [
   359967, 
   null, 
   "Archangel", 
   "Archangel,\n \n The point you evade is that not permitting rational criticicism of a person on the basis of their race is a fallacious argument.\n\n \n This coming from the Party which calls my side racists every time we dare criticize your messiah. And I have no problem at all with you criticizing this african evangelist with the truth. But how dishonest is it to refer to him as an african witch hunter when he is a born again pastor who has turned away from those demonic rituals long ago. You are directly attacking his character, intelligence and spiritual condition as you paint Sarah Palin with the same corrupted brush. None of it based in truth at all.", 
   {}, 
   359961, 
   null, 
   1247103420.0
  ], 
  [
   359968, 
   null, 
   "T.Q", 
   "This coming from the Party which calls my side racists every time we dare criticize your messiah.\n\n Oh?\n \nAnd I have no problem at all with you criticizing this african evangelist with the truth.\n\n Yes, you do.\n \nBut how dishonest is it to refer to him as an african witch hunter\n\n Is he African? Does he \"hunt\" witches? The answer to both is yes. Seems to me the one with the problem of racism is you. You seem to think the idea of calling him \"African\" somehow demeans him.\n \n \nwhen he is a born again pastor\n\n From Africa who hunts witches.\n \n \nwho has turned away from those demonic rituals long ago.\n\n See? He's turned away from those backwards demon-worshipping Africans and elevated himself.\n \n \nYou are directly attacking his character, intelligence and spiritual condition\n\n By pointing out he's from Africa?\n \n \nas you paint Sarah Palin with the same corrupted brush.\n\n Did she or did she not have him \"cleanse\" her of evil influences-call it whatever you want, doesn't make too much difference. \n \n \nNone of it based in truth at all.\n\n yeah, uh-huh...", 
   {}, 
   359967, 
   null, 
   1247104680.0
  ], 
  [
   359969, 
   null, 
   "Penfold", 
   "This coming from the Party which calls my side racists every time we dare criticize your messiah. And I have no problem at all with you criticizing this african evangelist with the truth. But how dishonest is it to refer to him as an african witch hunter when he is a born again pastor who has turned away from those demonic rituals long ago. You are directly attacking his character, intelligence and spiritual condition as you paint Sarah Palin with the same corrupted brush. None of it based in truth at all.\n\n \n \n Which \"demonic rituals\" are you referring to? The witchfinder's?", 
   {}, 
   359967, 
   null, 
   1247105520.0
  ], 
  [
   359970, 
   null, 
   "CUNxTime", 
   "According to the Christian Science Monitor, six months of fervent prayer and research identified the source of the witchcraft as a local woman called Mama Jane, who ran a \"divination\" centre called the Emmanuel Clinic.\n \n Her alleged involvement in fortune-telling and the fact that she lived near the site of a number of fatal car accidents led Pastor Muthee to publicly declare her a witch responsible for the town's ills, and order her to offer her up her soul for salvation or leave Kiambu.\n \n Says the Monitor, \"Muthee held a crusade that \"brought about 200 people to Christ\".\" They set up round-the-clock prayer intercession in the basement of a grocery store and eventually, says the pastor \"the demonic influence - the 'principality' over Kiambu -was broken\", and Mama Jane fled the town.\n \n According to accounts of the witchhunt circulated on evangelical websites such as Prayer Links Ministries, after Pastor Muthee declared Mama Jane a witch, the townspeople became suspicious and began to turn on her, demanding that she be stoned. Public outrage eventually led the police to raid her home, where they fired gunshots, killing a pet python which they believed to be a demon.\n \n After Mama Jane was questioned by police - and released - she decided it was time to leave town, the account says. \n\n \n \n US Elections - Times Online - WBLG: Palin linked electoral success to prayer of Kenyan witchhunter\n \n \n \n Is this article for real? Please tell me its a joke....", 
   {
    "unicode_changes_made": true
   }, 
   359968, 
   null, 
   1247105520.0
  ], 
  [
   359983, 
   null, 
   "antonia", 
   "This coming from the Party which calls my side racists every time we dare criticize your messiah.\n\n \n I am not \"the Party\". I am Antonia and I would appreciate you addressing as an individual instead of this absurdist labeling you get into. And I don't believe I've ever called you a racist simply because you've criticized Obama. I suggest you examine this tendency you have to turn a single person into the entire Democratic Party and all the evil you feel it represents.\n \n \n And I have no problem at all with you criticizing this african evangelist with the truth. But how dishonest is it to refer to him as an african witch hunter when he is a born again pastor who has turned away from those demonic rituals long ago. \n\n \n He may be a \"born again pastor\", but he is indeed a witch hunter from Africa. If the shoe fits, he should wear it. There is nothing whatsoever dishonest about saying so.\n \n \nYou are directly attacking his character, intelligence and spiritual condition \n\n \n Well, he deserves it for doing what he did to that poor woman, Mama Jane. Anyone who rounds up and riles up a lynch mob to go after a poor and innocent woman lacks character, lacks intelligence, and lacks a healthy spiritual condition.\n \n \nas you paint Sarah Palin with the same corrupted brush.\n\n \n She painted herself with the same brush; whether it's corruption or superstitious idiocy, she doesn't belong in the Presidency.\n \n \nNone of it based in truth at all.\n\n \n I provided articles and citations. So what you are saying is just broadstroked denial, Archangel.\n \n Stop stoning the messengers. It's not my fault Sarah Palin isn't what you thought she was. Along with her ritual demon cleanser.", 
   {}, 
   359967, 
   null, 
   1247110920.0
  ], 
  [
   359986, 
   null, 
   "Chuz Life", 
   " She painted herself with the same brush; whether it's corruption or superstitious idiocy, she doesn't belong in the Presidency.\n \n\n \n And Obummer does \"belong in the Presidency?\"\n \n emoticon_confused", 
   {
    "post_info": {
     "post_title": "A~nnnd,...."
    }
   }, 
   359983, 
   null, 
   1247112180.0
  ], 
  [
   359987, 
   null, 
   "antonia", 
   "And Obummer does \"belong in the Presidency?\"\n \n emoticon_confused\n\n \n If you mean by that, while Sarah Palin is dumb and unqualified, and likely as mean-spirited as the African witch-hunter, while he is extremely intelligent and well qualified, and not at all inclined to such cruelty like setting people up and rounding up lynch-mobs?\n \n Light years difference, and you know it.\n \n Besides the fact, that yes, he DOES belong in the Presidency if you understand our democracy, Chuzlife. He won by a historic landslide, remember?\n ;)", 
   {}, 
   359986, 
   null, 
   1247113440.0
  ], 
  [
   359988, 
   null, 
   "Chuz Life", 
   "If you mean by that, while Sarah Palin is dumb and unqualified, and likely as mean-spirited as the African witch-hunter, while he is extremely intelligent and well qualified, and not at all inclined to such cruelty like setting people up and rounding up lynch-mobs?\n \n Light years difference, and you know it.\n \n Besides the fact, that yes, he DOES belong in the Presidency if you understand our democracy, Chuzlife. He won by a historic landslide, remember? ;)\n\n \n Right (Ignoring Obummer's past transgressions for now) and by using the same logic, anyone who wins the election (landslide or not) \"belongs in the presidency.\"", 
   {
    "post_info": {
     "post_title": "R~iiiight,..."
    }
   }, 
   359987, 
   null, 
   1247113920.0
  ], 
  [
   359989, 
   null, 
   "antonia", 
   "Right (Ignoring Obummer's past transgressions for now) and by using the same logic, anyone who wins the election (landslide or not) \"belongs in the presidency.\"\n\n \n This is more of your semantic games, ChuzLife. There are two usages in play here. One is whether or not a person is qualified for the presidency. The other is whether or not they belong in the presidency having won the election fair and square. In both usages, President Obama belongs there. And in both usages, Sarah Palin lost by a long shot, and destroyed what was left of John McCain's campaign.\n \n Most of America doesn't see him, either, ITO of these *transgressions* that you fallaciously insert by unexamined, subjective assumption. \n emoticon_rolleyes\n \n But Sarah Palin, denier of women's right to choose, even in cases of brutal rape, is indeed seen that way by the majority of the American public, who shuddered at the thought of this individual in high office. \n \n All is not fair in love or war.\n \n Get over it. Your candidate was awful. And ours was great.\n \n (Now she's even quitting the governorship after one year, and without giving the voters a decent explanation. More credit to her sense of judgment, I'm sure, already evidenced to America before the exorcist witch-hunter.)\n \n Riiiiiiiiight.", 
   {}, 
   359988, 
   null, 
   1247114220.0
  ], 
  [
   359991, 
   null, 
   "Chuz Life", 
   "This is more of your semantic games, ChuzLife. There are two usages in play here. One is whether or not a person is qualified for the presidency. The other is whether or not they belong in the presidency having won the election fair and square. In both usages, President Obama belongs there. And in both usages, Sarah Palin lost by a long shot, and destroyed what was left of John McCain's campaign.\n \n Most of America doesn't see him, either, ITO of these *transgressions* that you fallaciously insert by unexamined, subjective assumption. \n emoticon_rolleyes\n\n \n In no certain order;\n \n No Birth Certificate, Reverend Wright, William Ayers, Tony Rescoe,.. to name a few \"transgressions\" that I feel disqualifies Obummer for the presidency.\n \n Bottom line,... it's entirely subjective. \n \n I actually believe that Sarah Palin would be a better steward of the country, National security, the borders, the people's money and resources and the many other powers of the office. \n \n I don't accept for you to shed your own and adopt my standards and expectations, Antonia. But, neither should you expect me to worship at your alter for Obummer.\n \n Different strokes and all that jazz.\n \n You know.", 
   {
    "post_info": {
     "post_title": "Does Obummer's qualifications include,....."
    }
   }, 
   359989, 
   null, 
   1247115060.0
  ], 
  [
   359992, 
   null, 
   "antonia", 
   "In no certain order;\n \n No Birth Certificate, Reverend Wright, William Ayers, Tony Rescoe,.. to name a few \"transgressions\" that I feel disqualifies Obummer for the presidency. \n\n \n Oh puleez, CL, I'm not going to relive this election again. \n \n Btw, notice that I call Sarah Palin by her name, while you don't even do your own President Obama the courtesy of calling him Obama.\n \n \nI don't accept for you to shed your own and adopt my standards and expectations, Antonia.\n\n \n I don't expect you to, either, CL. I just say what I think.\n \n \n But, neither should you expect me to worship at your alter for Obummer.\n\n \n \"Worship\" is your maligning mischaracterization. Though I think just simple courtesy to President Obama is due. \n \n It's very obvious I don't agree with President Obama on everything. I didn't vote him in the primaries, either. This was all discussed on the forums, here.\n \n So any intellectually honest reading and posting would take that into account, and not pretend otherwise.", 
   {}, 
   359991, 
   null, 
   1247116320.0
  ], 
  [
   359994, 
   null, 
   "Chuz Life", 
   "\"Worship\" is your maligning mischaracterization. Though I think just simple courtesy to President Obama is due. \n\n \n If only you were half as sceptical of Obummer that you are of Sarah Palin, that would be a very good thing.\n \n That one or two brushes with a questionable preacher can taint her character, yet 20 YEARS of listening to the hate filled rhetoric of reverend Wright doesn't taint Obummer's character or judgment in the least???\n \n Tells me all i need to know about YOUR own bias.", 
   {
    "post_info": {
     "post_title": "If only,..."
    }
   }, 
   359992, 
   null, 
   1247118000.0
  ], 
  [
   359996, 
   null, 
   "antonia", 
   "If only you were half as sceptical of Obummer that you are of Sarah Palin, that would be a very good thing.\n \n That one or two brushes with a questionable preacher can taint her character, yet 20 YEARS of listening to the hate filled rhetoric of reverend Wright doesn't taint Obummer's character or judgment in the least???\n \n Tells me all i need to know about YOUR own bias.\n\n \n Actually it speaks more to YOURS. I gave the Reverend Wright story a great deal more thought from various angles than you have given this story or any others about Sarah Palin, as far as I can discern.\n \n And the evidence for my consideration is right here on this forum on the election threads. Where there was one in particular that I participated on, sharing news articles, to boot.\n \n I daresay you'd never share a negative news article about Sarah Palin. Or venture one teeny weeny criticism. You must protect your dogma at all costs.", 
   {}, 
   359994, 
   null, 
   1247122560.0
  ], 
  [
   360011, 
   null, 
   "Brigid", 
   "America is liberated from the scourge of the Sarah Palin.\n \n Obviously, there must be some sort of investigation going on which will disclose something icky about Palin and she's getting out while the getting is good.\n\n \n Good, finally getting the STOOPID out of office. \n \n I'm glad the hypocrite decided to quit (although did you guys hear that she is now claiming to be a \"fighter\" and not a quitter? emoticon_xbangheadxbanghead ### you think you just did, Caribou Barbie?).\n \n I think this will be the Clencher if she ever tries to run for president like some think she might - all we need do is point out that things in a simple governer's position in one of the smallest population per mile states was too rough for her, and she quit - why would we want someone unable to hand such a simple pressure to be the President of the entire COUNTRY?\n \n Although, if she picked a good VP maybe we could vote for her and watch her quit in a few months and then get the VP in the office! emoticon_xhoho", 
   {}, 
   359485, 
   null, 
   1247153280.0
  ], 
  [
   360013, 
   null, 
   "Brigid", 
   " But how dishonest is it to refer to him as an african witch hunter when he is a born again pastor who has turned away from those demonic rituals long ago. \n \n What demonic rituals?\n \n Oh, and how is it dishonest to call an African man who hunts witches an \"African witch hunter\"?emoticon_xbangheadxbangheademoticon_rolleyesemoticon_rolleyes\n \nYou are directly attacking his character, intelligence and spiritual condition as you paint Sarah Palin with the same corrupted brush. None of it based in truth at all.\n\n \n Actually, that sounds rather racist on your part, claiming that it is \"attacking his character, intelligence and spiritual condition\" to call him African.............", 
   {}, 
   359967, 
   null, 
   1247153460.0
  ], 
  [
   360060, 
   null, 
   "trebor", 
   "US Elections - Times Online - WBLG: Palin linked electoral success to prayer of Kenyan witchhunter\n \n \n \n Is this article for real? Please tell me its a joke....\n\n \n I wish it was.", 
   {}, 
   359970, 
   null, 
   1247179920.0
  ], 
  [
   360102, 
   null, 
   "chester", 
   "Good, finally getting the STOOPID out of office. \n \n I'm glad the hypocrite decided to quit (although did you guys hear that she is now claiming to be a \"fighter\" and not a quitter? emoticon_xbangheadxbanghead ### you think you just did, Caribou Barbie?).\n \n I think this will be the Clencher if she ever tries to run for president like some think she might - all we need do is point out that things in a simple governer's position in one of the smallest population per mile states was too rough for her, and she quit - why would we want someone unable to hand such a simple pressure to be the President of the entire COUNTRY?\n \n Although, if she picked a good VP maybe we could vote for her and watch her quit in a few months and then get the VP in the office! emoticon_xhoho\n\n \n Stupid, no; ignorant, YES!!\n \n She's shrewd like a fox or a weasel.\n \n Among the many things that bother me about Bailin' Palin is her willful ignorance.\n \n Ignorance is cured by knowledge; Bailin' Palin refuses to educate herself.\n \n Does anyone here know her POV on Iran, Iraq, national security, the economy, global warming, Russia, the G-8, North Korea, SALT, or any of the other of the myriad of issues the country and any President faces in today's world?\n \n No, because she has none that she can articulate.\n \n The thought of the possibility that she might have been a heartbeat away from the Presidency is truly frightening.\n \n Hofstadter and Metzger warned us of her type many years ago in their book Anti-Intellectualism in American Life.", 
   {}, 
   360011, 
   null, 
   1247221020.0
  ], 
  [
   360126, 
   null, 
   "DrNo", 
   "If you mean by that, while Sarah Palin is dumb and unqualified, and likely as mean-spirited as the African witch-hunter, while he is extremely intelligent and well qualified, and not at all inclined to such cruelty like setting people up and rounding up lynch-mobs?\n \n Light years difference, and you know it.\n \n Besides the fact, that yes, he DOES belong in the Presidency if you understand our democracy, Chuzlife. He won by a historic landslide, remember?\n ;)\n\n \n The FACT is - Sarah Palin had more experience relating to the job of president of the US than Barack Obama. This is really not debatable, and you are being dishonest to claim otherwise. Even people who supported Obama were somewhat wary of his lack of experience.\n \n As for intelligence, that's debatable.", 
   {}, 
   359987, 
   null, 
   1247236860.0
  ], 
  [
   360136, 
   null, 
   "chester", 
   "The FACT is - Sarah Palin had more experience relating to the job of president of the US than Barack Obama. This is really not debatable, and you are being dishonest to claim otherwise. Even people who supported Obama were somewhat wary of his lack of experience.\n \n As for intelligence, that's debatable.\n\n \n So what?\n \n This President has just as much experience as another President from Illinois.\n \n I think you might recognize that President's name. \n \n He signed himself simply A. Lincoln.emoticon_xgood\n \n As to Caribou Barbie, she's had more than her 15 minutes, and she's in the process of sinking faster than the Titanic.", 
   {}, 
   360126, 
   null, 
   1247238600.0
  ], 
  [
   360146, 
   null, 
   "Chuz Life", 
   " I daresay you'd never share a negative news article about Sarah Palin. Or venture one teeny weeny criticism. You must protect your dogma at all costs.\n\n \n I daresay I don't ever post articles, period, Antonia. \n \n As far as criticisms for Sarah Palin, I have several. But they are criticisms that would not satisfy your want to tear her down.\n \n 1: I think she tries to hard to sell her ideas and ideals sometimes.... instead of letting good ideas and ideals and policies \"sell\" themselves.\n \n 2: I believe Sarah Palin when answerring questions comes off as a pagent contestant \"trying to say the right thing and sound intelligent\" instead of \n simply expressing her heart felt gut feelings (damn the :xcensored consequences) the way that Miss California did.\n \n 3: I believe that Sarah Palin should do a lot more in reaching out to women and working with them to reflect their images, needs and concerns by being more \"Sarah Palin\" the Mom, Wife, Hunter, Fisher, Home-maker, and hard working woman,... and less the professional executive administrater politician exchanging sniping quirky remarks about things that have little to no bearing on our lives at all. \n \n Alas, I'm a realist and I can accept that no one politician will ever be everything I would like them to be. I'm not everything I would like to be either. So, \"it is what it is.\"\n \n Same as it ever was! --Talking Heads", 
   {
    "post_info": {
     "post_title": "I never post articles period."
    }
   }, 
   359996, 
   null, 
   1247245800.0
  ], 
  [
   360154, 
   null, 
   "DrNo", 
   "So what?\n \n This President has just as much experience as another President from Illinois.\n \n I think you might recognize that President's name. \n \n He signed himself simply A. Lincoln.emoticon_xgood\n \n As to Caribou Barbie, she's had more than her 15 minutes, and she's in the process of sinking faster than the Titanic.\n\n \n Chester, do you ever look at an answer in the context of what was quoted above it?\n \n I am responding to Antonia's claim that Sarah Palin is unqualified and the hypocrisy of making such a statement when the candidate she supported was LESS qualified.", 
   {}, 
   360136, 
   null, 
   1247249760.0
  ], 
  [
   360165, 
   null, 
   "antonia", 
   "The FACT is - Sarah Palin had more experience relating to the job of president of the US than Barack Obama.\n\n \n I don't know what you mean by \"relating to the job\". There is no such \"fact\", and to assert otherwise shows that you have a serious hole in your fifth grade education when it comes to opinion and fact.\n \n \n This is really not debatable, and you are being dishonest to claim otherwise.\n\n \n Actually, what I am suggesting to you is not really debatable, and you are dishonest to accuse me of dishonesty, in addition to just plain ignorant.\n \n \n Even people who supported Obama were somewhat wary of his lack of experience.\n\n \n I was not talking about President Obama's experience but Caribou Barbi's. And regardless, other people's wariness or lack thereof isn't an argument based on evidence and logical reasoning.\n \n \nAs for intelligence, that's debatable.\n\n \n Only if your head is in the clouds, dear.", 
   {}, 
   360126, 
   null, 
   1247253060.0
  ], 
  [
   360166, 
   null, 
   "antonia", 
   "I daresay I don't ever post articles, period, Antonia. \n\n \n IMO, articles are useful as posting material for two reasons. (1) To generate discussion, (2) to back up a claim with a citation or reference.\n \n \nAs far as criticisms for Sarah Palin, I have several. But they are criticisms that would not satisfy your want to tear her down.\n\n \n Tear her down? She doesn't interest me that much, CL. I'm just responding to the tremendous defensiveness and denial exhibited on this board in response to the cited evidence concerning her involvement with the equivalent of a Colonial American Stone-Em-Burn-Em-At-The-Stake witch-hunter.\n \n \n1: I think she tries to hard to sell her ideas and ideals sometimes.... instead of letting good ideas and ideals and policies \"sell\" themselves.\n \n 2: I believe Sarah Palin when answerring questions comes off as a pagent contestant \"trying to say the right thing and sound intelligent\" instead of \n simply expressing her heart felt gut feelings (damn the :xcensored consequences) the way that Miss California did.\n \n 3: I believe that Sarah Palin should do a lot more in reaching out to women and working with them to reflect their images, needs and concerns by being more \"Sarah Palin\" the Mom, Wife, Hunter, Fisher, Home-maker, and hard working woman,... and less the professional executive administrater politician exchanging sniping quirky remarks about things that have little to no bearing on our lives at all. \n \n Alas, I'm a realist and I can accept that no one politician will ever be everything I would like them to be. I'm not everything I would like to be either. So, \"it is what it is.\"\n \n Same as it ever was! --Talking Heads\n\n \n As far as pure PR and public outreaach is concerned, I think Caribou Barbi has done all she can, and run a rather effective campaign in that regard.\n \n The problem, for her, is that American public sees her actual ability, her record on the issues, her flakiness, and her opinions for what they are. And all the down homesie Mom networking isn't going to do a thing about that.\n \n The problem for that portion of the Republican Party that likes and supports her, is that they don't want to deal with this reality. There's a certain percentage of Americans that like her, but if the Republican goes there, it's too far right for the majority of the country. \n \n To me, personally, go ahead and push Palin if that's your person. I think the country's too locked into its two parties anyway, and I would like more choices insofar as the so-called left is concerned. To keep the Democrats more honest.\n \n Whichever way you cut it, Sarah Palin running for President can only be a gift to people supporting issues traditionally espoused by the Democrats.", 
   {}, 
   360146, 
   null, 
   1247253900.0
  ], 
  [
   360167, 
   null, 
   "simone", 
   "The FACT is - Sarah Palin had more experience relating to the job of president of the US than Barack Obama. This is really not debatable, and you are being dishonest to claim otherwise. Even people who supported Obama were somewhat wary of his lack of experience.\n \n As for intelligence, that's debatable.\n\n Pray be so kind as to show a relatively lengthy tracking of her executive experience, responsible handling of finance, responsible attention to the welfare of the people she is supposed to serve.", 
   {}, 
   360126, 
   null, 
   1247253960.0
  ], 
  [
   360168, 
   null, 
   "antonia", 
   "Pray be so kind as to show a relatively lengthy tracking of her executive experience, responsible handling of finance, responsible attention to the welfare of the people she is supposed to serve.\n\n \n Must be the bridge to nowhere that appealed to him, the helicopter hunts across the frozen tundra after wolves, along with the fees for rape kits.\n \n Or her basketball reportage on television?\n \n Oh no - wait - I've got it -- it was her instant recognition of President Sarcozy's high pitched voice and genuineene French accent.\n \n Or the seals she barked with in Russian over yonder at the border.", 
   {}, 
   360167, 
   null, 
   1247254140.0
  ], 
  [
   360169, 
   null, 
   "antonia", 
   "Btw, young Levi is now talking to the press from his attorney's office and to the apologetic chagrin of the Palins. He says the reason why Palin is resigning is because she hears the lush and lucrative proceeds from a book deal calling out to her louder than the rest of her term as governor. When he stayed with them for a couple of weeks, he overheard her talking about it.", 
   {
    "post_info": {
     "post_title": "&quot;It's for the money, honeys&quot;"
    }
   }, 
   360168, 
   null, 
   1247254680.0
  ], 
  [
   360172, 
   null, 
   "CUNxTime", 
   "Couldn't she have written the book while still governor? I don't see how she'll get MORE money for a book just because she resigned...", 
   {}, 
   360169, 
   null, 
   1247256000.0
  ], 
  [
   360175, 
   null, 
   "Steamroller", 
   "Btw, young Levi is now talking to the press from his attorney's office and to the apologetic chagrin of the Palins. He says the reason why Palin is resigning is because she hears the lush and lucrative proceeds from a book deal calling out to her louder than the rest of her term as governor. When he stayed with them for a couple of weeks, he overheard her talking about it.\n\n \n Did your barge run into a bridge??emoticon_smile\n \n You're not going to hang your hat on a goomba who couldn't figure out how to have sex without producing an hier are you??\n \n BTW, you weren't going by Memphis Tues night were you??", 
   {}, 
   360169, 
   null, 
   1247256480.0
  ], 
  [
   360177, 
   null, 
   "antonia", 
   "Did your barge run into a bridge??emoticon_smile\n \n You're not going to hang your hat on a goomba who couldn't figure out how to have sex without producing an hier are you??\n \n BTW, you weren't going by Memphis Tues night were you??\n\n \n LOL. You have to admit he has a certain honesty in a dumb kind of way. And dumb would be an altogether other set of qualities if he'd had stayed with the govna's dauughta and keept hes mouut shet. (Though the article said he has his own book deal going, too.)\n \n Personally, I think his may be more interesting, if I get around to reading either (which I likely won't). He is more transparently real, in a young sort of way, that lives in many a town across America. Not good or bad, just more real.", 
   {
    "post_info": {
     "post_title": "What?  No shotgun for Levy?"
    }
   }, 
   360175, 
   null, 
   1247256900.0
  ], 
  [
   360180, 
   null, 
   "DrNo", 
   "Pray be so kind as to show a relatively lengthy tracking of her executive experience, responsible handling of finance, responsible attention to the welfare of the people she is supposed to serve.\n\n \n Why would it have to be relatively lengthy? ANY executive experience would immediately be more than Obama.\n \n She was mayor of a town.\n She was governor of a state.\n \n That's more experience than Obama. Period. It's not debatable. Even Chester, in his roundabout way, agreed with me by asking, \"so what?\"", 
   {}, 
   360167, 
   null, 
   1247257440.0
  ], 
  [
   360181, 
   null, 
   "antonia", 
   "Couldn't she have written the book while still governor? I don't see how she'll get MORE money for a book just because she resigned...\n\n \n I don't know, CU. The article's over at Huffingtonpost. If Levy is correct, maybe she's \"striking while the iron is hot\". Sees that she is a shooting star that will be fading fast in the sky, otherwise. (Or the publishers and consultants do.)\n \n It does speak further to her sense of responsibility, though. Pure crass materialism. Completely defeating this notion of her as anything other than what Washington already is. Even bringing the concept to new heights.", 
   {}, 
   360172, 
   null, 
   1247257440.0
  ], 
  [
   360183, 
   null, 
   "antonia", 
   "Why would it have to be relatively lengthy?\n\n \n Yes why? Hmmm.\n \n \n ANY executive experience would immediately be more than Obama.\n\n \n That's a bald-faced lie.\n \n \nShe was mayor of a town.\n\n \n Pretty small town. And she even s****d that up.\n \n \nShe was governor of a state.\n\n \n And she quit.\n \n \nThat's more experience than Obama. Period. It's not debatable.\n\n \n Wrong. Though you're correct that it's not debatable. Not to mention that the debate has long been over, with your side declared as losing.\n \n \nEven Chester, in his roundabout way, agreed with me by asking, \"so what?\"\n\n \n Who cares about some poster named Chester as a source and citation? Let alone you, chanting in mantra form, \"it's not debatable.\"", 
   {}, 
   360180, 
   null, 
   1247258280.0
  ], 
  [
   360185, 
   null, 
   "antonia", 
   "CUNxTime,\n \n One Republican doesn't leave office, when it comes to matters of the heart. Another Republican does, when it comes to matters of the purse.\n \n And now, another one has recently been scandalized for having a mistress, and, his parents apparently paid off the mistress' family grandly in hush money -- and in separate checks so that it could be reported under \"gifts\".\n \n Not that the Democrats aren't hypocrites, but the Republicans, in terms of their much espoused \"family values,\" boy, they distinguish themselves.\n \n Anyway, all things considered, you gotta give that kid, Levy, some credit. (Though wait 'til the publishers really get hold of him.)", 
   {}, 
   360183, 
   null, 
   1247259000.0
  ], 
  [
   360212, 
   null, 
   "Archangel", 
   "Why would it have to be relatively lengthy? ANY executive experience would immediately be more than Obama.\n \nThat's a bald-faced lie.\n\n She was mayor of a town.\n She was governor of a state.\n \n That's more experience than Obama. Period. It's not debatable. Even Chester, in his roundabout way, agreed with me by asking, \"so what?\"\n\n \n This is absolutely true. But the obamanites will deny it without exception. As if his community activism was any real preparation for the most important job in the free world. And we are seeing him play out his agenda in spite of the fact that attempting it while the nation is in the throws of a recession is the absolute worst thing an experienced leader would do for the sake of creating a successful recovery. \n \n But not this agenda driven socialist. He is committed to deconstructing this American Democratic Republic in favor of creating a European style of socialism which has failed for the past 2 decades and which Europe itself is turning away from. \n \n So what DrNo said isn't a bald faced lie antonia. If Obama knew what he was doing, he wouldn't be selling us out as he carries out an agenda he told us nothing about when he was campaigning for the job he has. He is evidence that dems will tell the unwashed masses anything they want to hear and then they will carry out their original agenda which inevitably will result in a welfare state with the only two classes of people. The super elite/wealthy and the paupers. And in case you're not smart enough to realize it, you will be one of the paupers who is dependent upon the Government for your support. That is the change that Obama offers us. emoticon_rolleyes", 
   {}, 
   360180, 
   null, 
   1247275320.0
  ], 
  [
   360213, 
   null, 
   "Easyrider", 
   "This is absolutely true. But the obamanites will deny it without exception. As if his community activism was any real preparation for the most important job in the free world. And we are seeing him play out his agenda in spite of the fact that attempting it while the nation is in the throws of a recession is the absolute worst thing an experienced leader would do for the sake of creating a successful recovery. \n \n But not this agenda driven socialist. He is committed to deconstructing this American Democratic Republic in favor of creating a European style of socialism which has failed for the past 2 decades and which Europe itself is turning away from. \n \n\n \n Amen.\n \n And people say Obama is brilliant? Are you kidding me? He hasn't got a lick of wisdom.", 
   {}, 
   360212, 
   null, 
   1247277120.0
  ], 
  [
   360215, 
   null, 
   "snakespit", 
   "Why would it have to be relatively lengthy? ANY executive experience would immediately be more than Obama.\n \n She was mayor of a town.\n She was governor of a state.\n \n That's more experience than Obama. Period. It's not debatable. Even Chester, in his roundabout way, agreed with me by asking, \"so what?\"\n\n The neighbor that I grew up next to has been the mayor of my home town for about 15 years now. I can assure you that this is no way qualifies the man to be president. And yeah...Palin served as gov for what...2.5 years and quit? Obama served 3 (almost 4) years in the US senate, and prior to that served almost 8 years as a state senator. \n \n They both have political experience, and I would venture as far as to say that Obama's political experience is probably far more valuable in preparing the man to be president. Keep in mind that I did not, would not, and will never vote for Obama.", 
   {}, 
   360180, 
   null, 
   1247279460.0
  ], 
  [
   360221, 
   null, 
   "antonia", 
   "Sounds to me like a lot more executive experience than many.\n \n Although I prefer his community organizing background.", 
   {}, 
   360215, 
   null, 
   1247288820.0
  ], 
  [
   360224, 
   null, 
   "Archangel", 
   "The neighbor that I grew up next to has been the mayor of my home town for about 15 years now. I can assure you that this is no way qualifies the man to be president. And yeah...Palin served as gov for what...2.5 years and quit? Obama served 3 (almost 4) years in the US senate, and prior to that served almost 8 years as a state senator. \n \n They both have political experience, and I would venture as far as to say that Obama's political experience is probably far more valuable in preparing the man to be president. Keep in mind that I did not, would not, and will never vote for Obama.\n\n \n \nSounds to me like a lot more executive experience than many.\n \n Although I prefer his community organizing background.\n\n \n Do either of you understand the difference between the Legislative and Executive Branches? Executive branch encyclopedia topics | Reference.com", 
   {}, 
   360221, 
   null, 
   1247290500.0
  ], 
  [
   360225, 
   null, 
   "antonia", 
   "\n But not this agenda driven socialist. \n\n \n He is not a socialist, Archangel. Whatever you think that is, a socialist is someone like Bernie Sanders or Albert Einstein or Helen Keller or Alice Walker or Susan B. Anthony or John Lennon.\n \n \nHe is committed to deconstructing this American Democratic Republic in favor of creating a European style of socialism which has failed for the past 2 decades and which Europe itself is turning away from.\n\n \n Not by the look of demonstrations in France and the U.K.\n \n \nSo what DrNo said isn't a bald faced lie antonia.\n\n \n You didn't establish a causative connection based on fact and leading to logical conclusion.\n \n \nIf Obama knew what he was doing, he wouldn't be selling us out as he carries out an agenda he told us nothing about when he was campaigning for the job he has. \n\n \n I am not surprised by anything Obama is doing. Except that, he surpasses my expectation in representing the U.S. so well at home and abroad. And, his military approach is even more strategically aggressive than anticipated. (Which I have mixed feelings about; I do NOT trust the military industrial complex.) My big \"wait and see\", however, is on health care, where they are not delivering on single payer, as hoped for and anticipated by many, but I can't say I'm surprised about that either. They will have to rally around the President, though, and a public option, if they don't want to completely destroy themselves and the ship, too, as the Republicans have done so well to themselves.\n \n \nHe is evidence that dems will tell the unwashed masses anything they want to hear and then they will carry out their original agenda which inevitably will result in a welfare state with the only two classes of people. The super elite/wealthy and the paupers. And in case you're not smart enough to realize it, you will be one of the paupers who is dependent upon the Government for your support. That is the change that Obama offers us. emoticon_rolleyes\n\n \n Well I don't agree with you that he is evidence of anything like this, but I do agree that Democrats would tell the unwashed masses (like myself) just about anything they want to hear, if they deign talking to them at all. As far as single payer was concerned, however, as you may have noticed, they did not tell us what we wanted to hear, they might as well have just kicked 65% of the American people out of the room, had them hauled away by the police. A point that evades you, too, AA, is that the Republicans are no different. They'll tell you what you want to hear, as well, and they will also unapologetically call the police to slam the door in your face. Both are bought and paid for by the lobbyists, Democrats and Republicans, for the rich to get richer and the poor to get poorer. What we need in this country is major campaign finance reform so that real representatives can be elected.\n \n Fat chance they'll have that happen.", 
   {}, 
   360212, 
   null, 
   1247290560.0
  ], 
  [
   360228, 
   null, 
   "antonia", 
   "Do either of you understand the difference between the Legislative and Executive Branches? Executive branch encyclopedia topics | Reference.com\n\n \n I understood you as using \"executive experience\" in the more generic sense.", 
   {}, 
   360224, 
   null, 
   1247293140.0
  ], 
  [
   360251, 
   null, 
   "snakespit", 
   "Do either of you understand the difference between the Legislative and Executive Branches? Executive branch encyclopedia topics | Reference.com\n\n \n Yes I do. What is your point?", 
   {}, 
   360224, 
   null, 
   1247328060.0
  ], 
  [
   360253, 
   null, 
   "simone", 
   "Why would it have to be relatively lengthy? ANY executive experience would immediately be more than Obama.\n \n She was mayor of a town.\n\n Woohoohoo! Leaving a town of under six thousand inhabitants $20 million in debt. Wow! That is real, real executiveness!\n \n \n.... as mayor of Wasilla, AK, Palin \"was not always the fiscal watchdog she has since boasted of being.\"\n \n During her term in office, Palin cut property taxes and other small taxes on business. But as the Anchorage Daily News points out, \"She wasn't doing this by shrinking government.\" During her tenure, the budget of Wasilla (population 5,469 in 2000) \"apart from capital projects and debt, rose from $3.9 million in fiscal 1996 to $5.8 million.\"\n \n Palin also successfully pushed through a sales tax increase in Wasilla, which went to fund a $15 million sports complex. However, a land dispute over the sight of the complex led to \"years of legal wrangling\" and cost Wasilla almost $1.7 million, \"a lot more than the roughly $125,000 the city would have paid in 1998 if it had closed a deal to buy the property outright.\" Wasilla is still facing budget shortfalls from the case today....\n \n When Palin left office in 2002, Wasilla had \"racked up nearly $20 million in long-term debt,\" or roughly $3,000 of debt per resident. \n\n Wonk Room As Mayor, &#8216;Hard-Core Fiscal Conservative&#8217; Sarah Palin Left Wasilla $20 Million In Debt\n \n Astounding! Absolutely astounding executiveness!\n \nShe was governor of a state.\n \n That's more experience than Obama. Period. It's not debatable. Even Chester, in his roundabout way, agreed with me by asking, \"so what?\"\n\n And her Alaskan experience?\n \nPalin fired the whole state Agriculture and Conservation board in July 2007, and replaced it with her loyalists. As a result, the dairy lost more money than it had in twenty years. The dairy, an Alaska icon, closed two months later. Millions of dollars in dairy equipment ended up, at a steep discount, in the hands of a local Palin ally. \n\n Sarah Palin's Corrupt Mis-Management of Dairy in Alaska", 
   {
    "unicode_changes_made": true
   }, 
   360180, 
   null, 
   1247337840.0
  ], 
  [
   360258, 
   null, 
   "antonia", 
   "Yeah George Bush and Dick Cheney have loads of executive experience by now.\n \n emoticon_rolleyes\n \n Just imagine what Sarah Palin could do with even more!\n \n : purplebarneydancing:", 
   {}, 
   360253, 
   null, 
   1247344080.0
  ], 
  [
   360375, 
   null, 
   "antonia", 
   "Peggy Noonan, who was heard off mic commenting on the Sarah Palin selection during the campaigns, has an article reflecting, in sum, on what Palin seemed to be all about.\n \n A Farewell to Harms - WSJ.com\n \n I guess some Republicans (like PN) are still trying to keep the boat afloat or salvage what's left, while the Democrats are now presently attempting to sink and waste theirs by opposing the President on health care.", 
   {}, 
   360258, 
   null, 
   1247480100.0
  ], 
  [
   360817, 
   null, 
   "Steamroller", 
   "The neighbor that I grew up next to has been the mayor of my home town for about 15 years now. I can assure you that this is no way qualifies the man to be president. And yeah...Palin served as gov for what...2.5 years and quit? Obama served 3 (almost 4) years in the US senate, and prior to that served almost 8 years as a state senator. \n \n They both have political experience, and I would venture as far as to say that Obama's political experience is probably far more valuable in preparing the man to be president. Keep in mind that I did not, would not, and will never vote for Obama.\n\n \n One can hardly count the two years he spent campaigning for president as part of his US Senate experience.\n \n Without axlerod and emanual, obama is an empty suit, incapable of rational thought and unable to speak without a telepromtor.\n \n This guy isn't thinking for himself,and every time he does they go out and spin for him.\n \n I'm convinced the liberal elite have been grooming him since they discovered his \"pretty\" smile in his early college years, and have been telling him what to think ever since.\n \n I don't despise him because he's black.., I despise him because he's RED, soviet/chinese style, and the damage he's doing to this country may very well be permanant.", 
   {}, 
   360215, 
   null, 
   1247769660.0
  ], 
  [
   360878, 
   null, 
   "Steamroller", 
   "Woohoohoo! Leaving a town of under six thousand inhabitants $20 million in debt. Wow! That is real, real executiveness!\n \n \n Wonk Room As Mayor, 'Hard-Core Fiscal Conservative' Sarah Palin Left Wasilla $20 Million In Debt\n \n Astounding! Absolutely astounding executiveness!\n \n And her Alaskan experience?\n \n Sarah Palin's Corrupt Mis-Management of Dairy in Alaska\n\n \n Simone, you failed to disclose that the site you quoted comes with a caveat that the story has been reported to have false information in it. I guess it's up to us to figure out where the story strays from the truth and how far!!\n \n Really Simone.., THE DAILYKOS????", 
   {
    "unicode_changes_made": true
   }, 
   360253, 
   null, 
   1247788020.0
  ], 
  [
   360880, 
   null, 
   "Bad Mojo", 
   "One can hardly count the two years he spent campaigning for president as part of his US Senate experience.\n\n \n So, that leaves 2 years of U.S. senatorial experience? Not enough? What does that do to Palin's experience? She was governor from December 2006 until she became McCain's Veep pick in August of 2008. Do the math.", 
   {}, 
   360817, 
   null, 
   1247788500.0
  ], 
  [
   360883, 
   null, 
   "Steamroller", 
   "So, that leaves 2 years of U.S. senatorial experience? Not enough? What does that do to Palin's experience? She was governor from December 2006 until she became McCain's Veep pick in August of 2008. Do the math.\n\n \n Senatorial experience does not equate with executive experience. As a member of a 100 person committee it's easy to hide and \"sacrifice\" vote. As an exec there is no place to hide. \n \n And try as they might, the Dailykos still has not come up with anything substantial against Palin.\n \n Is she the perfect candidate for President? Perhaps not, but neither was Mr. Telepromter and the average american voter was duped in 08.\n \n The big difference between Palin and Obama is that you will at least know what the heck she stands for and you will know why you hate her. The Axlerod puppet was a mystery and in large part still is.", 
   {}, 
   360880, 
   null, 
   1247789820.0
  ], 
  [
   360890, 
   null, 
   "Bad Mojo", 
   "Senatorial experience does not equate with executive experience. As a member of a 100 person committee it's easy to hide and \"sacrifice\" vote. As an exec there is no place to hide. \n\n \n I'm not concerned with \"executive\" experience as we've had presidents in the past who were never governors, it's a mistake to claim that it's necessary experience because in 4 years that same argument could be used against whomever you support.\n \n I'm just looking at time frames, you have a governor in office less than 2 years and before that she quit the Alaska Oil & Gas Commission after only a year, before that she was mayor of a town with a population of a sleepy hamlet and she managed to put them in $20 million in debt. Before that? Well, she went to 5 colleges in 4 years. She's a quitter, she can't answer the most basic questions in regards to the Bush Doctrine, what she reads, doesn't even understand that watching Putin fly over her worthless a** in an airplane is inconsequential. \n \n \nAnd try as they might, the Dailykos still has not come up with anything substantial against Palin.\n\n \n She's not very bright, do we really need more? If she were ever elected president will she declare war on Late Night talk show hosts? Because for whatever reason she seems unable to crawl out of irrelevency. Here's a hint, when David Letterman cracks jokes about your family, ignore it, be above it, don't be so petty.\n \n \nIs she the perfect candidate for President? Perhaps not, but neither was Mr. Telepromter and the average american voter was duped in 08.\n\n \n if there was an election held tomorrow between Palin and Obama after all that we know now....Obama would still win based on polling numbers. I don't think Obama is perfect either, far from it. I'm convinced that whatever \"perfect\" is, Palin is the exact opposite.\n \n \nThe big difference between Palin and Obama is that you will at least know what the heck she stands for and you will know why you hate her. The Axlerod puppet was a mystery and in large part still is.\n\n \n I don't even know why she resigned as governor. It's also not a matter of hate it's a matter of competence, she's not.", 
   {}, 
   360883, 
   null, 
   1247794740.0
  ], 
  [
   360927, 
   null, 
   "CUNxTime", 
   "As much as I DO want a plain speaking, conservative as a candidate I'll pray to a god I don't even believe in to make sure it AIN'T her!", 
   {}, 
   360890, 
   null, 
   1247804820.0
  ], 
  [
   360938, 
   null, 
   "Bad Mojo", 
   "As much as I DO want a plain speaking, conservative as a candidate I'll pray to a god I don't even believe in to make sure it AIN'T her!\n\n \n I think one of the best things that could happen is the GOP drops the religious right and gets back to fiscal conservative principals. \n \n Tired of the Science deniers and Jesus Freaks. (nothing against jesus, just the freaks who use his name)\n \n I don't fall along the conservative line, fiscal or otherwise but to have the debate is healthy and the Democrats are bound to screw everything up if there is no viable alternative to compete against.", 
   {}, 
   360927, 
   null, 
   1247806800.0
  ], 
  [
   360941, 
   null, 
   "T.Q", 
   "As much as I DO want a plain speaking, conservative as a candidate I'll pray to a god I don't even believe in to make sure it AIN'T her!\n\n \n Can we whip up a time machine and get the McCain from 9 years ago? He seemed to make some sense.", 
   {}, 
   360927, 
   null, 
   1247807100.0
  ], 
  [
   360943, 
   null, 
   "Archangel", 
   "As much as I DO want a plain speaking, conservative as a candidate I'll pray to a god I don't even believe in to make sure it AIN'T her!\n\n \n Even fter 11 months of being attacked mercilessly by the left with every conceivable kind of lie and exaggeration, Sarah Palin remains with a 72% popularity rating among Republicans. So don't you dare write her off yet and how dare you accept the Catie Couric type definition of who she is. You should be ashamed of yourself. What America needs right now beside a true and real conservative is a washington outsider. And that is what Sarah is. All she needs is your support. NOTE THE GALLUP POLL\n \n Conservatives4Palin.com: Gallup: 72% of Republicans Approve of Sarah Palin; UPDATE: Rush: Liberals and Drive-By Media Fear Palin the Most", 
   {}, 
   360927, 
   null, 
   1247807340.0
  ], 
  [
   360944, 
   null, 
   "Bad Mojo", 
   "Even fter 11 months of being attacked mercilessly by the left with every conceivable kind of lie and exaggeration, Sarah Palin remains with a 72% popularity rating among Republicans. So don't you dare write her off yet and how dare you accept the Catie Couric type definition of who she is. You should be ashamed of yourself. What America needs right now beside a true and real conservative is a washington outsider. And that is what Sarah is. All she needs is your support. NOTE THE GALLUP POLL\n \n Conservatives4Palin.com: Gallup: 72% of Republicans Approve of Sarah Palin; UPDATE: Rush: Liberals and Drive-By Media Fear Palin the Most\n\n \n I tell ya', if I wasn't so concerned about one party rule I would say that I dream of Palin picking up the 2012 ticket. \n \n Does Palin have ability to be an effective president?\n \n yes - 22%\n No - 65%\n Undecided - 13%\n \n \n Good luck!", 
   {}, 
   360943, 
   null, 
   1247807940.0
  ], 
  [
   360964, 
   null, 
   "CUNxTime", 
   "Even fter 11 months of being attacked mercilessly by the left with every conceivable kind of lie and exaggeration, Sarah Palin remains with a 72% popularity rating among Republicans. So don't you dare write her off yet and how dare you accept the Catie Couric type definition of who she is. You should be ashamed of yourself. What America needs right now beside a true and real conservative is a washington outsider. And that is what Sarah is. All she needs is your support. NOTE THE GALLUP POLL\n \n Conservatives4Palin.com: Gallup: 72% of Republicans Approve of Sarah Palin; UPDATE: Rush: Liberals and Drive-By Media Fear Palin the Most\n\n \n I'm most certianly NOT writing her off. That's the problem. She can't win. And I'm hoping that the Pubs realize that. I was a HUGE defender of Palin last year (as a VP). Now that I know her better and after she quit, I hope she stays up there, quietly.", 
   {}, 
   360943, 
   null, 
   1247843160.0
  ], 
  [
   360969, 
   null, 
   "T.Q", 
   "I was a HUGE defender of Palin last year (as a VP).\n\n \n What was it you liked about her CxT?", 
   {}, 
   360964, 
   null, 
   1247844240.0
  ], 
  [
   360973, 
   null, 
   "CUNxTime", 
   "What was it you liked about her CxT?\n\n \n Pretty much what I said I wanted in a candidate earlier... plain spoken, 'man' of the people, conservative, not beholden to special interests... that kind of thing. I had no idea at the time about the witch-hunters or speaking in tongues stuff. I had no idea she was a quitter. Plus, I was much more in support of her as a Vice President, till she got her feet wet.", 
   {}, 
   360969, 
   null, 
   1247845320.0
  ], 
  [
   360976, 
   null, 
   "Chuz Life", 
   "I'm most certianly NOT writing her off. That's the problem. She can't win. And I'm hoping that the Pubs realize that. I was a HUGE defender of Palin last year (as a VP). Now that I know her better and after she quit, I hope she stays up there, quietly.\n\n \n Everyone realizes that if Palin wanted to seek the GOP nomination that there would be an opportunity for others who want to run against her,.... don't you?\n \n What's the problem with that? \n \n I personally love Sarah Palin though I realize she's far from being ideal candidate. I think she's every bit as competent as Obummer has been. Maybe more-so. Who knows? \n \n The Presidency is more than one person running everything,... and if the world can survive a Stewart Smalley as a U.S. Senator, a Jimmy Carter or Blubba Klinton,.... we will do as good or better with Sarah Palin.\n \n Besides, I love the fact that the left hates her so much it hurts!\n \n That is to me a great sign indeed!", 
   {
    "post_info": {
     "post_title": "Everyone,...."
    }
   }, 
   360964, 
   null, 
   1247845680.0
  ], 
  [
   361003, 
   null, 
   "Bad Mojo", 
   "Besides, I love the fact that the left hates her so much it hurts!\n\n \n Hurts? Who does it hurt? Depending on what I think of Obama and assuming he doesn't completely #### me off, I would love to have Palin win the GOP nomination. You want to bring democrats out in a lackluster election? Ok, nominate Palin.", 
   {}, 
   360976, 
   null, 
   1247869620.0
  ], 
  [
   361033, 
   null, 
   "Chuz Life", 
   "Hurts? Who does it hurt? Depending on what I think of Obama and assuming he doesn't completely #### me off, I would love to have Palin win the GOP nomination. You want to bring democrats out in a lackluster election? Ok, nominate Palin.\n\n \n Same taunts thrown at every prospective candidate by all sides around the time of most elections.\n \n I don't sweat the small :xcensored .", 
   {
    "post_info": {
     "post_title": "Ooooh Scarey,...."
    }
   }, 
   361003, 
   null, 
   1247885220.0
  ], 
  [
   361034, 
   null, 
   "Bad Mojo", 
   "Same taunts thrown at every prospective candidate by all sides around the time of most elections.\n \n I don't sweat the small :xcensored .\n\n \n It's not a taunt, most people see her as completely incompetent. Eh, it's gonna' have to wait, first things first. I believe Obama has the political cover to rename Alaska, something like New Siberia, that would be cute.", 
   {}, 
   361033, 
   null, 
   1247888580.0
  ], 
  [
   361044, 
   null, 
   "Archangel", 
   "Everyone realizes that if Palin wanted to seek the GOP nomination that there would be an opportunity for others who want to rund against her,.... don't yoy?\n \n What's the problem with that? \n \n I personally love Sarah Palin though I realize she's far from being ideal candidate. I think she's every bit as competent as Obummer has been. Maybe more-so. Who knows? \n \n The Presidency is more than one person running everything,... and if the world can survive a Stewart Smalley as a U.S. Senator, a Jimmy Carter or Blubba Klinton,.... we will do as good or better with Sarah Palin.\n \n Besides, I love the fact that the left hates her so much it hurts!\n \n That is to me a great sign indeed!\n\n \n What's so interesting is that the left derided Reagan and both Bush's in many of the same ways that they went after Palin, although they weren't nearly as vile and personal back in the late 70s and 80s. What we have learned from this past election cycle is that the politics of personal destruction is alive and well in the democratic party today. While they simultaneously demand that the Right never go after their children, spouses or loved ones. \n \n I'm also saying that if 72% of Republicans currently support Sarah (as my gallup poll above shows) after stepping down from her job and all of the other personal attacks against her, and 22% of democrats with 13% undecided as mojos link reflects, and that's 3 years away from 2012, just imagine the army of supporters she could raise if she was actually campaigning and telling people what she hoped to accomplish for us as a political outsider. \n \n I firmly believe that by 2012, the vast majority of the american electorate will be frothing at the mouth to reverse the socialist policies this lying scumbag is imposing on the american people under the banner of CHANGE which he never ever dared be specific about or define in actual terms before being elected. Well now we are seeing what his vision is and my only concern is if we can survive 4 years under his leadership before getting a responsible adult in that office once again who truly cares about representing the interests and the welfare of the American People.", 
   {}, 
   360976, 
   null, 
   1247890620.0
  ], 
  [
   361045, 
   null, 
   "JPSartre12", 
   "Stupid, no; ignorant, YES!!\n \n She's shrewd like a fox or a weasel.\n \n Among the many things that bother me about Bailin' Palin is her willful ignorance.\n \n Ignorance is cured by knowledge; Bailin' Palin refuses to educate herself.\n \n Does anyone here know her POV on Iran, Iraq, national security, the economy, global warming, Russia, the G-8, North Korea, SALT, or any of the other of the myriad of issues the country and any President faces in today's world?\n \n No, because she has none that she can articulate.\n \n The thought of the possibility that she might have been a heartbeat away from the Presidency is truly frightening.\n \n Hofstadter and Metzger warned us of her type many years ago in their book Anti-Intellectualism in American Life.\n\n \n Sounds like somebody's been listening to too much National Propaganda Radio (NPR). I heard the same argument, but I refuse to drink the Obama Koolaid, so I'm immune to its effect. ;)", 
   {}, 
   360102, 
   null, 
   1247890680.0
  ], 
  [
   361051, 
   null, 
   "Bad Mojo", 
   "What's so interesting is that the left derided Reagan and both Bush's in many of the same ways that they went after Palin, although they weren't nearly as vile and personal back in the late 70s and 80s. What we have learned from this past election cycle is that the politics of personal destruction is alive and well in the democratic party today. While they simultaneously demand that the Right never go after their children, spouses or loved ones. \n\n \n Yes, politics have gotten rather nasty. For example, I can't remember how many times I had to hear about Hillary Clinton's fat calves, or how she had Vince Foster killed, or the pile of bodies the Clintons left behind.\n \n Obama? Why, he's a communist (I'm sure you will happily repeat that) and he wasn't born in this country and he befriends terrorists and he's going to take our guns away and Michelle Obama is fat by the way. Sure, never heard any of that before.\n \n \nI'm also saying that if 72% of Republicans currently support Sarah (as my gallup poll above shows) after stepping down from her job and all of the other personal attacks against her, and 22% of democrats with 13% undecided as mojos link reflects, and that's 3 years away from 2012, just imagine the army of supporters she could raise if she was actually campaigning and telling people what she hoped to accomplish for us as a political outsider. \n\n \n 22% of democrats? That was 22% of everybody. She has in that poll I posted the support of 22% of EVERYBODY. That's roughly the same number of dead enders Bush had at the end of his 2nd term.\n \n \nI firmly believe that by 2012, the vast majority of the american electorate will be frothing at the mouth to reverse the socialist policies this lying scumbag is imposing on the american people under the banner of CHANGE which he never ever dared be specific about or define in actual terms before being elected. Well now we are seeing what his vision is and my only concern is if we can survive 4 years under his leadership before getting a responsible adult in that office once again who truly cares about representing the interests and the welfare of the American People.\n\n \n We shall see, let's get through the first year first, before you have a heart attack.", 
   {}, 
   361044, 
   null, 
   1247891700.0
  ], 
  [
   361052, 
   null, 
   "Bad Mojo", 
   "Sounds like somebody's been listening to too much National Propaganda Radio (NPR). I heard the same argument, but I refuse to drink the Obama Koolaid, so I'm immune to its effect. ;)\n\n \n Yeah, it's silly to be skeptical of the conservative pundits when their kool aid has all the high fructose corn syrup you can handle.\n \n I have an idea, don't trust poliicians, Obama, Palin, McCain or any one of them. Man, I'm tired of people getting all jacked up about their favorite politician like they are some kind of rock star and yes, it happens on both sides.", 
   {}, 
   361045, 
   null, 
   1247891880.0
  ], 
  [
   361059, 
   null, 
   "obvious_child", 
   "LOL. Someone needs to Check archie's poll.\n \n Tell me, who has the highest unfavorable views of the three candidates? \n \n Not to mention that Palin is a Socialist.", 
   {}, 
   361044, 
   null, 
   1247895840.0
  ], 
  [
   361068, 
   null, 
   "JPSartre12", 
   "Yeah, it's silly to be skeptical of the conservative pundits when their kool aid has all the high fructose corn syrup you can handle.\n \n I have an idea, don't trust poliicians, Obama, Palin, McCain or any one of them. Man, I'm tired of people getting all jacked up about their favorite politician like they are some kind of rock star and yes, it happens on both sides.\n\n \n Unlike you, I have a deep skepticism for ALL pundits and politicians on both sides of the aisle. But even the most non-partisan observer has to see that the economy is still tanking despite Obama racking up a larger debt for our kids; the unemployment rate is HIGHER than Obama said it would be WITHOUT the stinulus package; there is NO transparency in government that he promised; national healthcare will NOT save money as Obama promised according to the unbiased CBO; the list goes on. Yet, the fruity drink sippers in the media continue their love affair with this first-term snake oil salesman.:xcensored", 
   {}, 
   361052, 
   null, 
   1247925600.0
  ], 
  [
   361077, 
   null, 
   "Archangel", 
   "I agree that it is a waste of time and energy placing any faith in politicians from either party. Not to mention a fools errand since they all answer to the powers that be if they hope to gain national attention and exposure from the main stream media which is also controlled by these unseen powers. \n \n That is why Sarah Palin is seen as such a grassroots hope, because she has been shown to be a true outsider by pundits on both sides of the aisle. And she is a classic conservative who promotes the idea of smaller Government intervention into our lives, lower taxes, a pro business and entrepreneurial spirit rather than big government, higher taxes and socialized medicine which will place americans on waiting lists where health services are doled out according to some mathematical formula.\n \n Ask yourself why President Berlosconi of Italy came to the USA for his heart bypass surgery if our system is so flawed and backwards. Could it be that he didn't want to wait for it to occur as he had to in Italy because of the waiting lists? Or could it have been the shoddy medical care since the best and newest technologies aren't even available in countries with socialized medicine? \n \n And do we want the Government telling us that if we are over 55 years old and need Dialysis, we don't qualify as is the case in Canada and Great Britain? The same age restrictions exist for quality of life afflictions such as Hip replacements, knee surgery, cancer treatments and many other medical issues which we take for granted here, but require lengthy waiting periods and even lottery systems in the hope of receiving treatments for in countries which practice this socialized form of medicine.\n \n Here from Obamas own mouth is his agenda which would prefer giving painkillers to seniors, and hospice care till they die rather than life saving treatment which restore quality of life. YouTube - President Obama's health plan for Senior Citizens\n \n And here are his talking heads selling his plan on TV, and what they are saying doesn't even pass the smell test, for anyone with half a brain that is. YouTube - Obama's Prescription for America\n \n This socialized plan should scare the life out of any american who expects to grow old one day and who has parents who are aging and much closer to the cut off points this heartless plan is committing us to if it is allowed to pass. Not to mention anyone who believes they deserve to receive immediate care if they get cancer rather than standing in a line of millions where the chances are good that the cancer will kill you before care is given. If that's the improved medical care you want, then by all means support the democrats plan for you.\n \n Remember during the campaign, Obama said that he wanted all americans to have the same quality health care which congress people currently have? Do you think this plan he is designing is anything near what they have? Do you actually believe that Ted Kennedy would have to wait in line for treatment for his brain tumors? Don't lie to yourselves and don't allow these criminals to lie to you. All this socialized healthcare will accomplish is making you slaves to a system which serves the government master as it sacrifices the little people through a statistical system of health care priorities.", 
   {}, 
   361068, 
   null, 
   1247929200.0
  ], 
  [
   361089, 
   null, 
   "T.Q", 
   "And do we want the Government telling us that if we are over 55 years old and need Dialysis, we don't qualify as is the case in Canada and Great Britain?\n\n \n Hey Archie, there's another lie to add to your list of transgressions.", 
   {}, 
   361077, 
   null, 
   1247935680.0
  ], 
  [
   361098, 
   null, 
   "antonia", 
   "\n Ask yourself why President Berlosconi of Italy came to the USA for his heart bypass surgery if our system is so flawed and backwards. \n\n \n Ask yourself why you care more about the President of Italy getting great service in America when so many of your fellow Americans are standing on line for cattle stalls in Wise, Virginia.\n \n How do you salute an American flag and sleep at night, Archangel?\n \n Who or what do you really worship and pray to?", 
   {}, 
   361077, 
   null, 
   1247939520.0
  ], 
  [
   361099, 
   null, 
   "Penfold", 
   "Two prevarications actually. Same misstatement, different countries.", 
   {}, 
   361089, 
   null, 
   1247939640.0
  ], 
  [
   361104, 
   null, 
   "T.Q", 
   "Two prevarications actually. Same misstatement, different countries.\n\n \n You're right. \n \n Sorry Archie, wouldn't want to dock you a point on your scorecard.", 
   {}, 
   361099, 
   null, 
   1247940600.0
  ], 
  [
   361111, 
   null, 
   "Penfold", 
   "It's unusual for him to be so concise with his untruths. ;)", 
   {}, 
   361104, 
   null, 
   1247943480.0
  ], 
  [
   361142, 
   null, 
   "CUNxTime", 
   "\n i have an idea, don't trust poliicians, obama, palin, mccain or any one of them. Man, i'm tired of people getting all jacked up about their favorite politician like they are some kind of rock star and yes, it happens on both sides.\n\n \n quoted for truth!!!!", 
   {}, 
   361052, 
   null, 
   1247979180.0
  ], 
  [
   361162, 
   null, 
   "Steamroller", 
   "It's not a taunt, most people see her as completely incompetent. Eh, it's gonna' have to wait, first things first. I believe Obama has the political cover to rename Alaska, something like New Siberia, that would be cute.\n\n \n Because of your boy Obama, we may not be renaming Alaska, instead we may have to forfeit the state to the Chinese to satisfy the mountain of debt he's put us under.\n \n Impossible you say??? Remember how we got it??\n \n Then they will Drill Baby Drill and the tree hugging commies won't be able to do a thing about it! Thanks for your support.emoticon_xgood", 
   {}, 
   361034, 
   null, 
   1247987940.0
  ], 
  [
   361377, 
   null, 
   "Bad Mojo", 
   "Unlike you, I have a deep skepticism for ALL pundits and politicians on both sides of the aisle.\n\n \n And that is unlike me, how? I tell you what, you post the name of your favorite national pundit that most people have heard of and I'll see how many lies and/or distortions they have told.\n \n Then, I'll name my favorite pundit and you do the same, deal?\n \n Anyway, I never made the claim that any pundit is necessarily trust worthy just because they are liberal or conservative. I'm just noting the height of untruthfulness that come from those like Rush Limbaugh, Glenn Beck and Sean Hannity. If you want to look at the left for those who go off the deep end then I can think of Randi Rhodes (can't stand her) and then there is Keith Olbermann who if anything lays it on a little too thick for my taste.\n \n \nBut even the most non-partisan observer has to see that the economy is still tanking despite Obama racking up a larger debt for our kids;\n\n \n That is true and untrue. Banks are now again able to loan money for which they couldn't before they were bailed out. However, I'm not necessarily a fan of the \"Too big to fail\" mentality. Personally I think the government should have temporarily OWNED the banks, fixed their #### and sold them back to the shareholders. Instead we gave them a blank check with no strings attached and while that did loosen up the credit, no real change took place to keep this from happening again. I hate to sound like an old fashioned liberal but, the economy needs to be regulated and it's a traditional conservative point of view to just let free markets be well....free. It doesn't work and Obama hasn't done much about it (yet).\n \n \nthe unemployment rate is HIGHER than Obama said it would be WITHOUT the stinulus package;\n\n \n That's true, they were way off on the unemployment figures. I think to honestly look at employment figures you have to figure out what they would be like now without any type of stimulus, lower or higher? I honestly don't know. I do know though that Obama had mentioned quite often that all of 2009 was going to be bad and we wouldn't see any real recovery until next year. So, I'm going to wait before I claim his presidency is a complete failure, it's only been 6 months.\n \n \nthere is NO transparency in government that he promised;\n\n \n That's very true and it bothers me very much. Not just with the economy but we still have a couple of secrets from the last administration (are you oblivious to those?) that have never been uncovered and that was also a promise of Obama, that no one would be above the law and here we are with many former high level government officials who have proven that they are above the law simply by no action taking place. Heck, it's not even that Obama isn't doing anything it's that the DOJ is now actively fighting the same court battles that the Bush administration did.\n \n \nnational healthcare will NOT save money as Obama promised according to the unbiased CBO;\n\n \n The CBO is nonpartisan and I'm sure you didn't realize that until just after Obama was sworn in. However, the CBO is only reporting additional expenditrues, they do not report savings. That's not them being partisan that's them doing specifically what they do, report spending and nothing more. They do not report the savings to families that will not have to face bankruptcy because of a serious illness in the family, they do not report the savings of preventitive care, etc...\n \n What did you think of the CBO when they pointed out a couple of rather blatant lies comeing from the Bush Administration?\n \n \nthe list goes on.\n\n \n As it always has.\n \n \nYet, the fruity drink sippers in the media continue their love affair with this first-term snake oil salesman.:xcensored\n\n \n Just like they did when not actually doing any real reporting on the reasons for going into Iraq. I agree, many (not all, maybe not even most) have a love affair with Obama in the media. I personally don't get it. I have no doubt that he is an intellegent man, I have questions about his political courage and to be honest, I never really bought the \"Change\" message. It's nothing more than a political campaign slogan, no reason to get upset over it, what was McCain's, \"Country First\". Sure, it was.", 
   {}, 
   361068, 
   null, 
   1248119700.0
  ], 
  [
   361379, 
   null, 
   "Bad Mojo", 
   "Because of your boy Obama, we may not be renaming Alaska, instead we may have to forfeit the state to the Chinese to satisfy the mountain of debt he's put us under.\n \n Impossible you say??? Remember how we got it??\n \n Then they will Drill Baby Drill and the tree hugging commies won't be able to do a thing about it! Thanks for your support.emoticon_xgood\n\n \n There you go, I joke about your irrational fears and what do you do? You demonstrate exctly what I am joking about, thanks for the schadenfreude, it made my morning. emoticon_smile", 
   {}, 
   361162, 
   null, 
   1248119940.0
  ], 
  [
   361381, 
   null, 
   "Bad Mojo", 
   "I agree that it is a waste of time and energy placing any faith in politicians from either party. Not to mention a fools errand since they all answer to the powers that be if they hope to gain national attention and exposure from the main stream media which is also controlled by these unseen powers. \n\n \n I'd believe you, but then you go on drooling about Palin again:\n \n \nThat is why Sarah Palin is seen as such a grassroots hope, because she has been shown to be a true outsider by pundits on both sides of the aisle. And she is a classic conservative who promotes the idea of smaller Government intervention into our lives, lower taxes, a pro business and entrepreneurial spirit rather than big government, higher taxes and socialized medicine which will place americans on waiting lists where health services are doled out according to some mathematical formula.\n\n \n Hmm, she was for the mother load of pork barrell projects before even Congress was finally against it. That doesn't sound like a conservative to me.\n \n She was for Cap and Trade befor she was against it. Why, she's flippin' John Kerry!! \n \n Her husband was a member of a separationist movement, that does sound like your type of conservative. Namely, the fanatical type. Lower taxes? All conservatives are for lower taxes, so? What makes her so special? Alaska is also a wellfare state, it takes in more federal dollars than it generates. \n \n I'm not going to get into the \"Socialized\" medicine aspect of it, we are simply going to disagree. But, you have to at least be aware that our current system doesn't work and one of the most powerful lobbyist groups is pouring in tons of money to keep it that way, right? Who's side is Palin really on? To be honest, I don't even know if she actually has an opinion.\n \n \nAsk yourself why President Berlosconi of Italy came to the USA for his heart bypass surgery if our system is so flawed and backwards. Could it be that he didn't want to wait for it to occur as he had to in Italy because of the waiting lists? Or could it have been the shoddy medical care since the best and newest technologies aren't even available in countries with socialized medicine? \n\n \n Odd, ask yourself how many Americans are treated like the Italian Prime Minister, in our own country? Yep, Americans have created quite a few advances in medicine, it's also those latest advancements that many insurance companies have trouble covering and is why medical expenses are the number one reason for bankruptcy in this country. We also have the most expensive health care system and we aren't even rated in the top 20.\n \n \nAnd do we want the Government telling us that if we are over 55 years old and need Dialysis, we don't qualify as is the case in Canada and Great Britain?\n\n \n Source?\n \n \nThe same age restrictions exist for quality of life afflictions such as Hip replacements, knee surgery, cancer treatments and many other medical issues which we take for granted here, but require lengthy waiting periods and even lottery systems in the hope of receiving treatments for in countries which practice this socialized form of medicine.\n\n \n Source?\n \n \nHere from Obamas own mouth is his agenda which would prefer giving painkillers to seniors, and hospice care till they die rather than life saving treatment which restore quality of life. YouTube - President Obama's health plan for Senior Citizens\n \n And here are his talking heads selling his plan on TV, and what they are saying doesn't even pass the smell test, for anyone with half a brain that is. YouTube - Obama's Prescription for America\n\n \n Can't view YouTube at the moment, I'll take a look later.\n \n \nThis socialized plan should scare the life out of any american who expects to grow old one day and who has parents who are aging and much closer to the cut off points this heartless plan is committing us to if it is allowed to pass. \n\n \n Proof? Also, you know you will be able to keep the insurance you currently have, right? And since you probably think government can't do anything right (mostly because you vote for people who think the same way) then won't the private insurance plans just beat the hell out of a public option? What's wrong with a little competition?\n \n \nNot to mention anyone who believes they deserve to receive immediate care if they get cancer rather than standing in a line of millions where the chances are good that the cancer will kill you before care is given. If that's the improved medical care you want, then by all means support the democrats plan for you.\n\n \n Millions? My mom died of cancer, she had to wait a month for surgery because her insurance company didn't want to pay for it. They put a dollar figure on my mom's life. \n \n \nRemember during the campaign, Obama said that he wanted all americans to have the same quality health care which congress people currently have? Do you think this plan he is designing is anything near what they have? Do you actually believe that Ted Kennedy would have to wait in line for treatment for his brain tumors? \n\n \n And still, Kennedy has better insurance (paid for by you and me) than we do, so I'm not exactly sure what your point is.\n \n \nDon't lie to yourselves and don't allow these criminals to lie to you. All this socialized healthcare will accomplish is making you slaves to a system which serves the government master as it sacrifices the little people through a statistical system of health care priorities.\n\n \n Slaves to a system? You mean like Medicare? You know that liberal plot to enslave grandma and grandpa.", 
   {}, 
   361077, 
   null, 
   1248120900.0
  ], 
  [
   361396, 
   null, 
   "JPSartre12", 
   "And that is unlike me, how? I tell you what, you post the name of your favorite national pundit that most people have heard of and I'll see how many lies and/or distortions they have told.\n \n Then, I'll name my favorite pundit and you do the same, deal?\n\n \n Bill O'Reilly\n \n \n\n Anyway, I never made the claim that any pundit is necessarily trust worthy just because they are liberal or conservative. I'm just noting the height of untruthfulness that come from those like Rush Limbaugh, Glenn Beck and Sean Hannity. If you want to look at the left for those who go off the deep end then I can think of Randi Rhodes (can't stand her) and then there is Keith Olbermann who if anything lays it on a little too thick for my taste.\n \n\n Don't forget Huffington, Maher, Larry King, and just about anybody on MSNBC or CNN while you're at it. \n \n \n\n That is true and untrue. Banks are now again able to loan money for which they couldn't before they were bailed out. However, I'm not necessarily a fan of the \"Too big to fail\" mentality. Personally I think the government should have temporarily OWNED the banks, fixed their #### and sold them back to the shareholders. Instead we gave them a blank check with no strings attached and while that did loosen up the credit, no real change took place to keep this from happening again. I hate to sound like an old fashioned liberal but, the economy needs to be regulated and it's a traditional conservative point of view to just let free markets be well....free. It doesn't work and Obama hasn't done much about it (yet).\n \n\n \n We might as well knickname him the Kerosene President because everything he touches burns worse afterwards. His stimulus plan spends more money between 2011-2019 than it does THIS year. ###!?\n \n\n That's true, they were way off on the unemployment figures. I think to honestly look at employment figures you have to figure out what they would be like now without any type of stimulus, lower or higher? I honestly don't know. I do know though that Obama had mentioned quite often that all of 2009 was going to be bad and we wouldn't see any real recovery until next year. So, I'm going to wait before I claim his presidency is a complete failure, it's only been 6 months.\n \n\n 6 months, $3Trillion in new debt, increased unemployment.......jury's in = Monumental FAIL.\n \n \n\n That's very true and it bothers me very much. Not just with the economy but we still have a couple of secrets from the last administration (are you oblivious to those?) that have never been uncovered and that was also a promise of Obama, that no one would be above the law and here we are with many former high level government officials who have proven that they are above the law simply by no action taking place. Heck, it's not even that Obama isn't doing anything it's that the DOJ is now actively fighting the same court battles that the Bush administration did.\n \n\n \n It bothers you enough to get off of his bandwagon? How much money was spent by THIS administration and Congress under the cover of darkness without ANY public hearings, minority input, etc.?\n \n\n The CBO is nonpartisan and I'm sure you didn't realize that until just after Obama was sworn in. However, the CBO is only reporting additional expenditrues, they do not report savings. That's not them being partisan that's them doing specifically what they do, report spending and nothing more. They do not report the savings to families that will not have to face bankruptcy because of a serious illness in the family, they do not report the savings of preventitive care, etc...\n\n You're wrong. The CBO factored in a savings of ~$500Billion or half of what the program would cost. That still leaves a shortfall of $500Billion.\n \n\n What did you think of the CBO when they pointed out a couple of rather blatant lies comeing from the Bush Administration?\n \n\n You, obviously don't know my feelings about Bush's economic record. I wouldn't trust him with YOUR wallet!\n \n \n\n As it always has.\n \n\n Unfortunately.\n \n\n Just like they did when not actually doing any real reporting on the reasons for going into Iraq. I agree, many (not all, maybe not even most) have a love affair with Obama in the media. I personally don't get it. I have no doubt that he is an intellegent man, I have questions about his political courage and to be honest, I never really bought the \"Change\" message. It's nothing more than a political campaign slogan, no reason to get upset over it, what was McCain's, \"Country First\". Sure, it was.\n\n \n Obama is the first puppet president. He's all show, no substance. He's lost without his teleprompter. It's the invisible hand that pulls his strings and makes his mouth move. emoticon_rolleyes", 
   {}, 
   361377, 
   null, 
   1248129720.0
  ], 
  [
   361436, 
   null, 
   "Bad Mojo", 
   "Bill O'Reilly\n\n \n Bill O'Reilly? The Culture Warrior? The Loofah king? Hey, there you go, he's already a hypocrite and I haven't even started.\n \n I don't know, here's a fun one. O'reilly has a real problem with porn on YouTube, so what does he do? He shows it on his PRIME time tv show. I'm telling you, this guy is so self unaware it's scary. Constantly go on about the hateful left and what does he do? He shouts people down, calls them pin head and other horrible names. Eh, don't want a rant, here's more:\n \n Bill O' falsely claiming that he never called Dr. Tiller, Dr. Killer. A newspaper in Seattle called him on it and of course Bill O' took the opportunity to bash the \"liberal media\" for lying about his words. I'm beginning to understand why you believe the media is overwhelmingly liberal.\n \n O'reilly claims that enhanced food stamps do not stimulate the economy. Guess who disagrees? (Hint: CBO) He doesn't know what he's talking about.\n \n Bill O' claims the army field manual bans any questioning that would make a suspect feel uncomfortable. Yep, it's a lie. In an attempt to make Obama appear weak on terror.\n \n O'reailly falsely claims that Norm Coleman was \"certified the winner\" in the Minnesota senate race. He then attacks and continues to lie when Media Matters points out the lie.\n \n O'reilly claims 60 minutes asked McCain but not Obama about the financial disaster and he is disastrously wrong.\n \n O'reilly claiming that Hurricane Katrina did not result in any oil spills. It's ok, he was only off by 70.\n \n O'reilly claimed only CNN's Anderson Cooper covered the Army Recruiter shooting. He was right, except for the other 15 shows that covered it.\n \n O'reilly claims John Edwards lied about the number of homeless veterans. Go ahead, take a guess...who do you think really lied?\n \n My favorite, Andrea Mackris and Bill O'reilly sticking a vibrator up his a** (I don't know if it was his a** or not, I just want to put that picture in your head)\n \n If you need me to, I can post more as there is plenty of material. \n \n Ok, my favorite pundit is Bob Morris. So, please go ahead and find all the lies you can that he has presented.\n \n Then when you are done with him, check out Jonathan Turley .\n \n \n \nDon't forget Huffington, Maher, Larry King, and just about anybody on MSNBC or CNN while you're at it. \n\n \n We are referring to the MSM, right? Huffington is a blogger and Maher has a late night show on HBO, I wouldn't count them otherwise I'm going to have to throw in the boys from the Blue Color Comedy Tour and I'm still trying to get the notion that Larry the Cable Guy is a millionaire. Larry King is a liberal? I have to say I don't know about his personal politics and I'm not really a big fan of his but whoever appears on his show is given plenty of time to speak. Larry King for the most part is a minimalist, doesn't have much to say himself. CNN and MSNBC both employ the likes of Pat Buchanan, Tucker Carlson, Joe Scarborough and that annoying wretch of a woman, Nancy Grace. None of these characters I would consider to be liberal. For that matter the owners of NBC being GE I would not consider to be liberal at all on many if not most subjects.\n \n What I think is difficult is to be able to figure out, given our own biases if the media bends in one direction or another. So, in the hopes of not overly simplifying things, if you are standing dead center in the political spectrum you would expect to agree with 50% of opinions expressed on the news and disagree with the other half. Now, stepping back a second if you realize you are on the conservative or liberal side then you are going to see more opinions that you do not agree with. For example, a public option for health care. It's clear to me that overwhelmingly the population of the U.S. wants this, something like over 70%, that's better than two to one for \"the evil socialized medicine.\" However the news still handles the issue pretty much down the line of 50/50 for or against. CNN certainly does this, MSNBC does this outside of their opinion shows which favor a public option. FOX? Outside of an occasional guest the entire network acts as if this is the most unpopular thing since New Coke. \n \n If we want to go another direction, let's say closing Gitmo. Even though at one time (before the election) that was the popular thing to do, it's not anymore. The reasons I believe are an unfounded fear of terrorists escaping from Super Max prisons but that's for another day. The news still covers this as a 50/50 story. I don't expect the news to carry my opinions through the day and I think you and many conservatives as well as liberals expect the them to. Confound that with the fact that the news (I'm mostly referring to cable news btw) now has a nasty habit of being extremely lazy, investigative reporting for the most part doesn't exist anymore, The days of Deep Throat, Woodward and Bernstein are gone forever and so now the left and right can look for this lazy attitude for finding facts and manipulate this into the notion that they are somehow covering up for their political ideology's. With the exception of political pundits I don't buy most arguments that the news is biased to anything but sensationalism and their bottom line. If it bleeds it leads.\n \n Another problem with the media is the groveling it goes through to get access to politicians. Did you see the David Gregory emails to Mark Sanford? He basically promised Sanford that he would have a really easy interview and give the opportunity for the governor to bring up whatever topic the trail blazer wanted to talk about and sweep his entire scandal under the carpet. Here is the email from David Gregory to Sanford's staff:\n \n \nLeft you a message. Wanted you to hear directly from me that I want to have the Gov on Sunday on Meet The Press. I think it's exactly the right forum to answer the questions about his trip as well as giving him a platform to discuss the economy/stimulus and the future of the party. You know he will get a fair shake from me and coming on MTP puts all of this to rest. \n ... So coming on Meet The Press allows you to frame the conversation how you really want to...and then move on. You can see (sic) you have done your interview and then move on. Consider it. \n\n Do you see that? David Gregory is giving up Meet The Press so that the governor can frame the conversation? Gregory is a real POS, not for any political bias, I honestly don't think Gregory gives a damn about Sanford, it's a sex scandal and he is going to promise Sanford anything he can in order to get him on and shoot the ratings up. Sex sells and that is where bias lays, these guys mostly don't care about politics, they care about ratings and if that means they have to have an opinion to get some then that's what they will do. Rush Limbaugh works very much in this fashion, he is not liked by most of the country but he has a large core audience that eats it up and so he does what he does best, be offensive and mislead his audience (my opinion). Randi Rhodes does the same thing on her end, she doesn't have as big of an audience because for whatever reason most liberals don't listen to the radio, we're more into the internet which has a higher liberal representation. \n \n \nWe might as well nickname him the Kerosene President because everything he touches burns worse afterwards. His stimulus plan spends more money between 2011-2019 than it does THIS year. ###!?\n\n \n What has he destroyed? I'm confused by this, you may not like what he is doing and because unemployment figures went up I still feel it's too early to call. This is Bush's recession and it's the biggest one since the Great Depression which took years to show signs that we were getting out of it, but you think this can be fixed in 6 months and for much of those 6 months the economy was still falling. It has stabilized a little, more jobs would be nice about now. \n \n \n6 months, $3Trillion in new debt, increased unemployment.......jury's in = Monumental FAIL.\n\n \n I think it's still too early, hasn't even been a year. But, I get the feeling we aren't going to agree on this anyway.\n \n \nIt bothers you enough to get off of his bandwagon? How much money was spent by THIS administration and Congress under the cover of darkness without ANY public hearings, minority input, etc.?\n\n \n Bandwagon? I don't play that way. I'm not on anyone's band wagon. Minority input? Were you concerned about minority input in 2002 or 2004? This is what elections are for and minority input on what? Republicans don't want hate crimes legislation, they don't want health care overhaul, they don't want to do anything about the environment and they disagree with the democrats about the economy to the point of calling the president a communist, I think bipartisanship is highly over rated. These aren't Obama band wagon issues, these are why progressives came out and voted for the democrats and not enough showed up to vote for republicans, it's an election the republicans lost, and if the majority finds they can't work with the minority then they move on and do it anyway. It's not a conspiracy, it's how our country works.\n \n \nYou're wrong. The CBO factored in a savings of ~$500Billion or half of what the program would cost. That still leaves a shortfall of $500Billion.\n\n \n No, I'm correct. The CBO takes into account savings for fraud and wasteful spending, not in what happens when a people actually receive preventive care. Also, I believe the CBO report was completed before the Rangel amendment which is the tax increase for upper income brackets which pay for the rest of the plan. I'm sure you're not going to like a tax increase but then again, it's what we have elections for, it's not a sign of treason. Me personally? I'd rather people not have to live and die based on pre existing conditions or whether your employer offers health insurance. Plus, heck, you can keep your own insurance if you want to, if anything this is a good opportunity to put public and private insurance schemes side by side and let the free market decide. \n \n \nObama is the first puppet president. He's all show, no substance. He's lost without his teleprompter. It's the invisible hand that pulls his strings and makes his mouth move. emoticon_rolleyes\n\n \n Let me get this straight. Reagan used a teleprompter, Clinton used a teleprompter, both Bush's used a teleprompter, Palin used a teleprompter, but Obama is a puppet president because he uses one better? A puppet president to who? George Soros? ACORN? China? This is all weird conspiracy stuff, Obama like any president is a puppet to special interests and to a much, much smaller extent those who voted him in. It was the same for Bush, we may disagree on whether trade unions are superior to The Scafe foundation, but whatever. To me this is just sore loserdom. Your side lost this one, deal with it, but do it rationally. We've already had a number of crazies go out and kill people.", 
   {}, 
   361396, 
   null, 
   1248141900.0
  ], 
  [
   361546, 
   null, 
   "JPSartre12", 
   "I'm skipping the pundit response becayse, quite frankly, I don't give a rat's rectum enough to discuss it, so let's go to the messiah himself.\n \n\n What has he destroyed? I'm confused by this, you may not like what he is doing and because unemployment figures went up I still feel it's too early to call. This is Bush's recession and it's the biggest one since the Great Depression which took years to show signs that we were getting out of it, but you think this can be fixed in 6 months and for much of those 6 months the economy was still falling. It has stabilized a little, more jobs would be nice about now. \n\n Obama warned that if NOTHING was done to spend our way into prosperity, the unemployment rate would hit 8%. Six months later, he quadrupled the deficit and the unemployment rate is over 10%. What has he destroyed? The future earnings of your kids and grandkids if nothing else. Another figure being bantied about is the total cost of Obama's bailout plan. It's $23Trillion!!!\n That's TWICE the current national debt!!!:xcensored\n \n \n I think it's still too early, hasn't even been a year. But, I get the feeling we aren't going to agree on this anyway.\n\n The quadrupling of the current deficit and the $3Trillion in additional debt isn't a debatable issue; it's a fact. We don't have to agree on anything. It's there in black and white.\n \n\n Bandwagon? I don't play that way. I'm not on anyone's band wagon. Minority input? Were you concerned about minority input in 2002 or 2004? This is what elections are for and minority input on what? Republicans don't want hate crimes legislation, they don't want health care overhaul, they don't want to do anything about the environment and they disagree with the democrats about the economy to the point of calling the president a communist, I think bipartisanship is highly over rated. These aren't Obama band wagon issues, these are why progressives came out and voted for the democrats and not enough showed up to vote for republicans, it's an election the republicans lost, and if the majority finds they can't work with the minority then they move on and do it anyway. It's not a conspiracy, it's how our country works.\n\n In 2002 and 2004, I was hoping that somebody sane in Congress would start to steer the leviathan back towards fiscal restraint. That didn't happen on either side of the aisle. And the reason that Obama won the election had almost zero to do with his grandiose socialist plans. McCain was painted as Bush III. A blind squirrel could have won the election for the DNC \n when the economy tanked just before the election. Obama won because of his timing, not his policies. To claim otherwise is to be disingenuous. \n \n\n No, I'm correct. The CBO takes into account savings for fraud and wasteful spending, not in what happens when a people actually receive preventive care. Also, I believe the CBO report was completed before the Rangel amendment which is the tax increase for upper income brackets which pay for the rest of the plan. I'm sure you're not going to like a tax increase but then again, it's what we have elections for, it's not a sign of treason. Me personally? I'd rather people not have to live and die based on pre existing conditions or whether your employer offers health insurance. Plus, heck, you can keep your own insurance if you want to, if anything this is a good opportunity to put public and private insurance schemes side by side and let the free market decide. \n\n The CBO took into account \"real\" factors. We've all seen the intangibles that weren't worth a fiddler's F@#k added in to try to make the plan palatable. In real numbers, NHC is at least a $500Billion loser.\n \n\n Let me get this straight. Reagan used a teleprompter, Clinton used a teleprompter, both Bush's used a teleprompter, Palin used a teleprompter, but Obama is a puppet president because he uses one better? A puppet president to who? George Soros? ACORN? China? This is all weird conspiracy stuff, Obama like any president is a puppet to special interests and to a much, much smaller extent those who voted him in. It was the same for Bush, we may disagree on whether trade unions are superior to The Scafe foundation, but whatever. To me this is just sore loserdom. Your side lost this one, deal with it, but do it rationally. We've already had a number of crazies go out and kill people.\n\n First, my side wasn't even in the contest. We lost before the election began. McCain was the lesser of two evils IMO, but the bottom line is both were evils. As for teleprompters, Obama is paralyzed without having a prepared text to read, even his VP joked about that fact. Bush and Reagan at least had the balls to speak extemporaneously.", 
   {
    "unicode_changes_made": true
   }, 
   361436, 
   null, 
   1248200340.0
  ], 
  [
   361572, 
   null, 
   "Bad Mojo", 
   "I&#8217;m skipping the pundit response becayse, quite frankly, I don&#8217;t give a rat&#8217;s rectum enough to discuss it, so let&#8217;s go to the messiah himself.\n\n \n I agree, if I were you I wouldn't want to defend Bill O'reilly either.\n \n \nObama warned that if NOTHING was done to spend our way into prosperity, the unemployment rate would hit 8%. Six months later, he quadrupled the deficit and the unemployment rate is over 10%. What has he destroyed? The future earnings of your kids and grandkids if nothing else. Another figure being bantied about is the total cost of Obama's bailout plan. It's $23Trillion!!!\n That's TWICE the current national debt!!!:xcensored\n\n \n That doesn't address my point. What would have happened if we did nothing compared to what Obama did do? Would it be worse? Who's bantied about the 23 trillion number? One of those pundits that you don't believe in or was it Bill O'reilly?\n \n \nThe quadrupling of the current deficit and the $3Trillion in additional debt isn&#8217;t a debatable issue; it&#8217;s a fact. We don&#8217;t have to agree on anything. It&#8217;s there in black and white.\n\n \n Then provide your fact.\n \n \nIn 2002 and 2004, I was hoping that somebody sane in Congress would start to steer the leviathan back towards fiscal restraint. That didn&#8217;t happen on either side of the aisle. And the reason that Obama won the election had almost zero to do with his grandiose socialist plans. McCain was painted as Bush III. A blind squirrel could have won the election for the DNC \n when the economy tanked just before the election. Obama won because of his timing, not his policies. To claim otherwise is to be disingenuous. \n\n \n McCain wasn't a blind squirrel he was a deer in the headlights of the massive recession that hit us all square in the face. The best he could come up with was 1) Suspend the campain and 2) Have the government buy up all the toxic bank assets. I'm not saying number 2 was all that bad, but it also would have been expensive and I don't think we'd have gotten our money back.\n \n \nThe CBO took into account &#8220;real&#8221; factors. We&#8217;ve all seen the intangibles that weren&#8217;t worth a fiddler&#8217;s F@#k added in to try to make the plan palatable. In real numbers, NHC is at least a $500Billion loser.\n\n \n Actually Rangel wrote a letter to the CBO asking their opinion of the cost of the health care plan if they added his amendment. They replied that the cost would be neutral. In other words, zero. However it wouldn't be zero for those with pre existing conditions or who have lost their employer provided benefits and those who do not currently have insurance, or those who have gone bankrupt because their insurance ran out due to an illness. What is the republican plan? Nothing because the health insurance lobbyists tell them everything is fine, we all know that's not true.\n \n \nFirst, my side wasn&#8217;t even in the contest. We lost before the election began. McCain was the lesser of two evils IMO, but the bottom line is both were evils.\n\n \n To a certain extent I agree with you, however I wouldn't expect a politician to agree with me on every major political argument, I'm a realist in that sense.\n \n \nAs for teleprompters, Obama is paralyzed without having a prepared text to read, even his VP joked about that fact. Bush and Reagan at least had the balls to speak extemporaneously.\n\n \n I don't know, I remember the public polling on the debates with McCain and Obama had won every single one of them. He's given a number of interviews where he has answered questions intellegently, you may not like the answers but compared to Bush he's a frickin' genius off the cuff. He does hem and haw when answering a question but I don't think it's because he doesn't have a clue, I think he appears to be actually considering the question. If you'd like to point out something differently where a majority or a large percentage of his non-teleprompter speeches are error proned then let me know. Otherwise it appears he's just giving answer that you don't like, nothing he can do about that. After all, he's a socialist in your eyes.", 
   {}, 
   361546, 
   null, 
   1248206040.0
  ], 
  [
   361588, 
   null, 
   "Penfold", 
   "The time to really worry is when an individual, for example President Reagan, makes errors when reading from a teleprompter. The fact that he started doing this before the end of his first term indicates that his incipient Alzheimers was accelerated by the trauma when he was shot. McCaine hows similar errors. Bush gets a pass, only because he was wired for sound, as evidenced by the famous box shape between his shoulderblades during the Presidential debates. He also parlayed his obvious flubs into an art form.", 
   {}, 
   361572, 
   null, 
   1248210960.0
  ], 
  [
   361608, 
   null, 
   "trebor", 
   "Because of your boy Obama, we may not be renaming Alaska, instead we may have to forfeit the state to the Chinese to satisfy the mountain of debt he's put us under.\n \n Impossible you say??? Remember how we got it??\n \n Then they will Drill Baby Drill and the tree hugging commies won't be able to do a thing about it! Thanks for your support.emoticon_xgood\n\n \n I would rather give them alabama..", 
   {}, 
   361162, 
   null, 
   1248216960.0
  ], 
  [
   361716, 
   null, 
   "simone", 
   "Because of your boy Obama, we may not be renaming Alaska, instead we may have to forfeit the state to the Chinese to satisfy the mountain of debt he's put us under.\n \n Impossible you say??? Remember how we got it??\n \n Then they will Drill Baby Drill and the tree hugging commies won't be able to do a thing about it! Thanks for your support.emoticon_xgood\n\n My goodness, Steamroller. I'd advise a quickie visit to your doc to deal with the rapidly encroaching senility.\n \n Our merry race down the road to massive indebtedness to China was accomplished largely under George W. Bush's aegis.", 
   {}, 
   361162, 
   null, 
   1248288000.0
  ], 
  [
   361735, 
   null, 
   "JPSartre12", 
   "I agree, if I were you I wouldn't want to defend Bill O'reilly either.\n\n O'Reilly's been on TV nightly for a decade. I have no doubt that he has made errors. So what?\n \n\n That doesn't address my point. What would have happened if we did nothing compared to what Obama did do? Would it be worse? \n\n Not according to Obama's own words. He said it would hit 8% if we did nothing.\n \n\n Who's bantied about the 23 trillion number? One of those pundits that you don't believe in or was it Bill O'reilly?\n \n\n Neil Barofsky, the special inspector general for the TARP. Wow! You sure ran into a right hook on that one Bad Mojo. You should check your facts before throwing me a softball like that. I'll knock it out of the park on you every time. ;)\n \n\n Then provide your fact.\n \n\n \n\n Congress says US budget deficit could quadruple\n Posted Sat Mar 21, 2009 8:10am AEDT \n The US budget deficit could swell to $US1.8 trillion ($2.7 trillion) in fiscal 2009, quadrupling last year's record shortfall, the budget arm of Congress has forecast.\n Congress says US budget deficit could quadruple - ABC News (Australian Broadcasting Corporation) \n \n\n CBO number. Another softball........smack......\n \n\n McCain wasn't a blind squirrel he was a deer in the headlights of the massive recession that hit us all square in the face. The best he could come up with was 1) Suspend the campain and 2) Have the government buy up all the toxic bank assets. I'm not saying number 2 was all that bad, but it also would have been expensive and I don't think we'd have gotten our money back.\n \n\n Hemlock or \"the rope\", same thing in the end. \n \n\n Actually Rangel wrote a letter to the CBO asking their opinion of the cost of the health care plan if they added his amendment. They replied that the cost would be neutral. In other words, zero. However it wouldn't be zero for those with pre existing conditions or who have lost their employer provided benefits and those who do not currently have insurance, or those who have gone bankrupt because their insurance ran out due to an illness. What is the republican plan? Nothing because the health insurance lobbyists tell them everything is fine, we all know that's not true.\n \n\n All the Rangel Amendment did was shift costs back onto the consumer by not allowing certain medical deductions. It didn't save a dime. It just took the cost of OTC meds and placed them back on the consumer directly without allowing the consumer to claim them on their pre-tax medical savings account. \n \n\n To a certain extent I agree with you, however I wouldn't expect a politician to agree with me on every major political argument, I'm a realist in that sense.\n \n\n I'd be happy with a president that has read and understands the Constitution's goal of \"limited government\".\n \n\n I don't know, I remember the public polling on the debates with McCain and Obama had won every single one of them. He's given a number of interviews where he has answered questions intellegently, you may not like the answers but compared to Bush he's a frickin' genius off the cuff. He does hem and haw when answering a question but I don't think it's because he doesn't have a clue, I think he appears to be actually considering the question. If you'd like to point out something differently where a majority or a large percentage of his non-teleprompter speeches are error proned then let me know. Otherwise it appears he's just giving answer that you don't like, nothing he can do about that. After all, he's a socialist in your eyes.\n\n \n He takes 10 minutes of meandering to answer a \"yes/no\" question. \n \n \nMy goodness, Steamroller. I'd advise a quickie visit to your doc to deal with the rapidly encroaching senility.\n \n Our merry race down the road to massive indebtedness to China was accomplished largely under George W. Bush's aegis.\n\n \n Bush was a spendthrift compared to this clown.", 
   {
    "unicode_changes_made": true
   }, 
   361716, 
   null, 
   1248296520.0
  ], 
  [
   361796, 
   null, 
   "CUNxTime", 
   "I'll throw my 2cents in here...\n \n O'Rielley... well, he gets some things wrong but he's no Beck lol. I'd say he's pretty fair but has a definite political/social philosophy and editorializes from that standpoint. And at least we know where he stands...\n \n On stimulus and whatnot... To say that 'doing something' isn't always right if that 'something' hurts more than helps. For instance...there's a saying that the cure is worse than the disease. I believe that the stimulus was a 'cure' that was worse than the disease. Now, I'm not saying that something couldn't be done to help. But I think that they passed something, without reading it, that didn't give us the proper bang for the buck.\n \n On healthcare... I'm for small govt. and personal responsibility. I feel that people should pay their own way. For emergency care, people should be able to receive it and pay what they can when they can even if it takes the rest of their lives. Even if the govt. could do it cheaply with no waste and no corruption (which they can't), I still feel its fundamentally wrong to take from someone to give to another in almost all cases. Someone who works, basically exchanging a large portion of their lives for money deserve to enjoy the rewards. Yes there should be a safety net and such, but no hammock.", 
   {}, 
   361735, 
   null, 
   1248316020.0
  ], 
  [
   361950, 
   null, 
   "Bad Mojo", 
   "O'Reilly's been on TV nightly for a decade. I have no doubt that he has made errors. So what?\n\n \n Not just errors, out right lies and when it's pointed out to him he keeps lying anyway. I can link to much, much more as he's made a career out of it. \n \n \nNot according to Obama's own words. He said it would hit 8% if we did nothing.\n\n \n As we've already covered this, you didn't answer my question.\n \n \nNeil Barofsky, the special inspector general for the TARP. Wow! You sure ran into a right hook on that one Bad Mojo. You should check your facts before throwing me a softball like that. I'll knock it out of the park on you every time. ;)\n\n \n See below, you don't even bother to look into anything.\n \n \n \nCBO number. Another softball........smack......\n\n \n softball? According to a preliminary CBO report dated July 17th, the cost is down to about $239 billion over 10 years. What you don't seem to get is that the CBO is not rating the bill as finalized, it's congress that is asking the CBO cost out the bill \"as is\", not in it's final version. But, as soon as you hear the magic \"1 trillion\" number I suppose you are going to forget about the rest. \n \n http://www.cbo.gov/ftpdocs/104xx/doc10464/hr3200.pdf\n According to CBO's and JCT's assessment, enacting H.R. 3200 would result in a net increase in the federal budget deficit of $239 billion over the 2010-2019 period.That estimate reflects a projected 10-year cost of the bill's insurance coverage provisions of $1,042 billion, partly offset by net spending changes that CBO estimates would save $219 billion over the same period, and by revenue provisions that JCT estimates would increase federal revenues by about $583 billion over those 10 years.\n \n\n And.....they are still working on the bill. The end goal is no increase to the federal deficit, not allowing health insurance companys to not insure you based on a pre-existing condition, not being dropped by your insurance when you really need it (major illness) which will have a nice side affect of reducing the number of bankruptcies (health reasons are the number 1 cause). To insure almost (if not all) Americans.\n \n \nHe takes 10 minutes of meandering to answer a \"yes/no\" question. \n\n \n In politics there are very few yes or no questions.\n \n Oh, and this:\n \n \nAnother figure being bantied about is the total cost of Obama's bailout plan. It's $23Trillion!!! That's TWICE the current national debt!!!\n\n \n you really just listen to what you want to hear, don't you? Here is what the guy who used the $23 trillion number had to say about TAARP:\n \"We're not suggesting that we're are looking at a potential loss to the government of $23 trillion,\" he said. \"Our goal is to bring transparency, to put things in context.\"\n \n Asked what he thought the maximum total cost could be, he replied that it was not his job to estimate that, and declined to give a figure. \n\n http://www.nytimes.com/2009/07/21/business/economy/21bailout.html?_r=1\n \n Here are some assumptions that go along with the 23 Trillion dollar scare fest:\n \n It assumes that every home mortgage backed by Fannie Mae and Freddie Mac goes into defualt\n It assumes that every bank in America fails\n It assumes that all of the assets held by money market mutual funds including treasurey bills have no value\n It assumes the Treasurry Department defaults on securities purchased by the Federal Reserve\n \n Come on, $23 Trillion and you don't even bother to look into it? 10 trillion in healthcare and you just assume anyone would sign onto that?", 
   {
    "unicode_changes_made": true
   }, 
   361796, 
   null, 
   1248401580.0
  ], 
  [
   362345, 
   null, 
   "Steamroller", 
   "My goodness, Steamroller. I'd advise a quickie visit to your doc to deal with the rapidly encroaching senility.\n \n Our merry race down the road to massive indebtedness to China was accomplished largely under George W. Bush's aegis.\n\n \n If you say that to yourself enough times you may actually start to believe it's true.\n \n Do your research before making comments that validate your ignorance. Go to the US Treasury website and see for yourself.\n \n BTW, if your statement WAS true..., does that make it right to continue the insanity???? emoticon_xbangheadxbanghead", 
   {}, 
   361716, 
   null, 
   1248649200.0
  ], 
  [
   363513, 
   null, 
   "keyztone", 
   "She claims she isn't a quitter.\n \n I suppose it all depends on what the meaning of quit is.", 
   {}, 
   362345, 
   null, 
   1249240800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Palin Resigns", 
  "url": "http://www.4forums.com/political/current-events-debates/12946-palin-resigns.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 12946, 
  "discussion_files": [
   [
    "17908.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-print.html"
   ], 
   [
    "17909.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-8-print.html"
   ], 
   [
    "17910.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-6-print.html"
   ], 
   [
    "17911.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-4-print.html"
   ], 
   [
    "17912.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-5-print.html"
   ], 
   [
    "17913.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-7-print.html"
   ], 
   [
    "17914.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-3-print.html"
   ], 
   [
    "17915.html", 
    "http://www.4forums.com/political/current-events-debates/12946-palin-resigns-2-print.html"
   ]
  ], 
  "identifier": 12946
 }
]