[
 [
  [
   359345, 
   null, 
   "Tither", 
   "Is this good legislation? \n \n   BATFE REFORM MOVING TOO SLOWLY IN HOUSE; SPACE CALLS ON COLLEAGUES TO STAND UP FOR GUN RIGHTS \n This legislation would:\n · Create a system to provide more flexibility in punishing those who are found to have violated gun sales laws.\n · Establish a solid legal requirement for determining the willful violation of the law.\n · Create specific sentencing guidelines for dangerous felons convicted of a gun offense.\n · Set limitations on the availability of electronic gun owner information to protect the privacy of law-abiding citizens.\n · Allow security companies and ammunition manufacturers to purchase machine guns for product testing and international security personnel training.\n · Ease the restriction on the importation of replacement parts for semiautomatic rifles.\n · Direct that a suspension or fine be vacated if a court determines a licensee did not willfully violate the law with attorney's fees awarded to cleared defendant.\n · Direct that the number of warnings, amount of fines, or suspensions or revocations shall not be a factor in firing, promoting, or transferring agents.\n Although not identical, this legislation is similar to a bill Congressmen Space and King introduced during the 110th Congress. \n", 
   {
    "post_info": {
     "post_title": "BATFE Reform!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1246554960.0
  ], 
  [
   359351, 
   null, 
   "NATO 556", 
   "It sounds good to me. I've actually read the bill and the proposed language, and it sounds to fix a lot of current mistakes.", 
   {}, 
   359345, 
   null, 
   1246560240.0
  ], 
  [
   359356, 
   null, 
   "OldSarge", 
   "Is this good legislation? \n \n   BATFE REFORM MOVING TOO SLOWLY IN HOUSE; SPACE CALLS ON COLLEAGUES TO STAND UP FOR GUN RIGHTS \n\n \n I don't think it will go any where because it doesn't fit the political agenda of the loony left, ie the Brady Bunch, VPC and others. It targets criminals among other things and reins in a rogue agency. It is good to see my dill weed among the cosponsors tho.", 
   {}, 
   359345, 
   null, 
   1246563120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  BATFE Reform!", 
  "url": "http://www.4forums.com/political/gun-control-debates/12941-batfe-reform.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 12941, 
  "discussion_files": [
   [
    "12328.html", 
    "http://www.4forums.com/political/gun-control-debates/12941-batfe-reform-print.html"
   ]
  ], 
  "identifier": 12941
 }
]