[
 [
  [
   359822, 
   null, 
   "flaja", 
   "Off and on over the past 20 years I have been designing a constitutional amendment that would enable America's churches to take a more active role in society without facing government interference. I do not wish to have either the Constitution or statutory law define religion, determine what doctrine is or make any commentary on the interrelationship between Christians, God and the Church. I will leave it to individual Christians to decide how they relate to God and what their church is and is not. I do not expect any church or religious organization to do all of the things that this amendment would let them do, but I do want church congregations to have the power to the things listed in this amendment without having to face constant court fights. The more vague the Constitution is, the more chance there will be for litigation.\n \n Church Enabling Amendment\n \n The purpose of this amendment is to expressly define what constitutes a church and by extension a synagogue, a mosque or any other religious community. This amendment is designed to grant churches a broad array of enumerated rights that will protect them from the encroachment of the government and allow them to take a more active role in American society without causing constant First Amendment disputes. And in recognizing these religious rights the public must have the constitutional assurance that churches meet certain qualifications that will insure that they are established for legitimate religious purposes.\n \n Section 1: The ability to freely exercise religion without the undue interference of the state being necessary for the preservation of their constitutional rights and liberties, the American People retain the right to establish churches in accordance with this amendment reserving unto the Congress and the several states the power to regulate and tax churches that may be otherwise established.\n \n Section 2: The Congress shall upon the application of not less than one hundred incorporators and without regard to doctrine or other qualifications, issue a charter for any organization hereby established as a church for the purpose of this amendment, and such charter shall set forth the bylaws and doctrine of the church and the qualifications necessary for the employees, members, clergy, trustees and officers thereof providing that no church may deny membership to any person on account of race or national origin or failure to provide monetary contributions to the church or any employee, member, clergy, trustee or officer thereof.\n \n Section 3: Each church established in accordance with this amendment shall designate not less than fifty persons to serve as trustees for the church as determined by the bylaws of the church and no more than one-half of the total number of trustees shall also be an incorporator, clergy or officer of the church.\n Each church established in accordance with this amendment shall designate as the bylaws of the church may direct persons to serve as corporate officers, but no more than one-half of such officers may also be a trustee of the church and no more than one-half of such officers may also be an incorporator of the church.\n \n Section 4: Any church established in accordance with this amendment shall retain the right to worship, to proselytize and to provide for the social welfare of the American People and thereby shall have the power to:\n (01) Establish and maintain orphanages and provide adoption services under the regulations which the separate states may devise by law; (02) Provide disability, retirement, unemployment, workers' compensation and survivors' pensions as the bylaws of the church may direct and under such regulations as its trustees may devise;\n (03) Insure real and chattel property against loss and damage as the bylaws of the church may direct and under such regulations as its trustees may devise;\n (04) Establish and maintain hospitals, pharmacies and other medical facilities under the regulations which the Congress and the separate states may devise by law; (05) Establish and maintain libraries, museums, schools, colleges and universities;\n (06) Provide nutritional, lodging and other dwelling services as the bylaws of the church may direct and under such regulations as its trustees may devise;\n (07) Provide assistance for the enforcement of the criminal laws of the United States and the several states upon the request of the Congress or the legislature of a state;\n (08) Establish and maintain banks and other financial institutions under the regulations which the Congress and the separate states may devise by law;\n (09) Provide as the bylaws of the church may direct and under such regulations as its trustees may devise, any other benefit to individual persons or associations thereof comparable to such benefits which the Congress or the legislatures of the several states may provide by law for the common welfare of the People of the United States or the People of any state;\n (10) Perform any other service or function for the benefit of the general welfare of the United States or any state upon the request of Congress or the legislature of a state;\n (11) Acquire private property for the purpose of performing any of the forgoing powers with the consent of and under such regulations as the Congress of the United States or the legislatures of the several states may devise;\n (12) Obtain the full faith and credit of the several states for such persons which the Congress of the United States may certify and which the church may employ to implement the foregoing powers- and\n (13) Take any action that is necessary and proper for the implementation of the foregoing powers to provide for the social welfare of the American People.\n \n Section 5: Churches established in accordance with this amendment shall retain the right to worship and proselytize without undue regulation of the United States or the several states and thereby shall have the power to:\n (01) Acquire, use and convey real property;\n (02) Acquire, use and convey chattel property subject to such taxation as may be determined by law;\n (03) Conduct lawful commerce subject to such taxation as may be determined by law; \n (04) Borrow money;\n (05) Exercise freedom of the press in both print and electronic forms under the complete editorial control of the trustees of the church and such persons as they may designate without restrictions as to the number of press enterprises that may be operated; \n (06) Petition the government of the United States and the governments of the several states for redress of grievances;\n (07) Petition the electors for any office of public trust under the United States and any of the several states;\n (08) Peaceably assemble its members and establish visual and audible displays in such places that are procured, established or otherwise maintained by tax revenue within the United States and which are open to the general public;\n (09) Conduct, in a manner determined by the bylaws of the church and under such regulations as the trustees thereof may devise, lotteries and other games of chance in any state wherein the government thereof conducts such games;\n (10) Acquire, hold and transfer stock in any corporation that may be chartered by the United States or by any one of the several states subject to such taxation as may be determined by law;\n (11) Establish for-profit, not-for-profit and non-profit corporations that are necessary and proper for exercising any of the foregoing powers and to peaceably have the full and absolute use of all real property owned by the church or by any corporation wholly established or owned thereby for the purpose of worship, proselytism and providing for the social welfare of the American People.\n (12) Exempt from taxation all property and income owned wholly by the church and by any corporation that is wholly established and owned by the church and exempt from taxation the income of any other corporation that may accrue to the church as a consequence of owning shares of stock therein.\n \n Section 6: No employee, member, clergy, trustee, director or officer of any church established in accordance with this amendment or any corporation that is established or owned wholly or in part by any such church shall receive any portion of the revenue, income or property of such church or corporation except as a social welfare benefit or as reasonable compensation for services rendered and no compensation for any individual person shall exceed the value of one-hundred thousand dollars per annum.\n The trustees of any church established in accordance with this amendment may require the employees of the church and the employees, directors and officers of any corporation established by the church or by any corporation, the majority of which is owned by the church, to be a member of the church or otherwise adhere to the doctrine thereof without consequence of any law.\n The judicial power of the United States and the judicial power of each state shall extend to suits in law or equity within their respective jurisdictions for which a church or any corporation established or owned wholly or in part thereby or any employee, member, clergy, trustee, director or officer thereof shall be a party, but no employee, member, clergy, trustee, director or officer of any such church or corporation shall be questioned in regard to the doctrine of the church except in a time and place which the trustees of the church may determine.\n \n Section 7: The American People and the corporations established thereby shall retain the right to contribute money to the churches that are established in accordance with this amendment for the purpose of securing a social welfare benefit for the contributors and such persons as they may designate and may in any year for which such contributions are made receive credit for any tax or fee that may otherwise be due as a consequence of any law implemented to provide a comparable benefit for the common welfare of the United States or any one of the several states.\n \n Section 8: No provision in this amendment shall be construed to indicate or apply to any religion to the exclusion of any other.", 
   {
    "post_info": {
     "post_title": "church and state"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1246972980.0
  ], 
  [
   359857, 
   null, 
   "simone", 
   "My God! What the devil are you talking about?\n \n Churches already have the right to own property.\n \n Furthermore, I fail to see why the government should take on the role of defining what church or other religious institution is. As it now stands, I believe those institutions have the right and liberty to define themselves.\n \n You are arguing for state interference into the separate realm of religion. The state has no business there.", 
   {}, 
   359822, 
   null, 
   1246992600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  church and state", 
  "url": "http://www.4forums.com/political/politics-debates/12958-church-state.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12958, 
  "discussion_files": [
   [
    "20820.html", 
    "http://www.4forums.com/political/politics-debates/12958-church-state-print.html"
   ]
  ], 
  "identifier": 12958
 }
]