[
 [
  [
   359658, 
   null, 
   "Jo Bennett", 
   "I was given a collection of C. S. Lewis' Christian writings for my Birthday, having wanted to read them for a while. I've been reading Mere Christianity, and finding it by turns, difficult, inspirational, challenging, provoking, interesting, dated and relevant.\n \n What did strike me is the similarity between Lewis' radio broadcasts and the letters of the Apostles in terms of communication with the church as a whole, and with those on the margins looking for instruction. This set me wondering whether it was reasonable that the church accepted a Biblical canon and then declared in to be finished, or whether since that time there have been writers and writings of equal value. There is no division in terms of having met Jesus on earth or not, as St. Paul had not, or in having life changing revelation, as both St. Paul and Lewis. The question, then, comes down to whether the writings are of value and whether the author was inspired by the Holy Spirit.\n \n So, what do others think of C. S. Lewis' work?", 
   {
    "post_info": {
     "post_title": "Mere Christianity - C. S. Lewis"
    }
   }, 
   null, 
   null, 
   1246787880.0
  ], 
  [
   359940, 
   null, 
   "jyoshu", 
   "I was given a collection of C. S. Lewis' Christian writings for my Birthday, having wanted to read them for a while. I've been reading Mere Christianity, and finding it by turns, difficult, inspirational, challenging, provoking, interesting, dated and relevant.\n \n What did strike me is the similarity between Lewis' radio broadcasts and the letters of the Apostles in terms of communication with the church as a whole, and with those on the margins looking for instruction. This set me wondering whether it was reasonable that the church accepted a Biblical canon and then declared in to be finished, or whether since that time there have been writers and writings of equal value. There is no division in terms of having met Jesus on earth or not, as St. Paul had not, or in having life changing revelation, as both St. Paul and Lewis. The question, then, comes down to whether the writings are of value and whether the author was inspired by the Holy Spirit.\n \n So, what do others think of C. S. Lewis' work?\n\n \n It's my understanding that one of the important tests of NT canonicity was for a book to have apostolic authorship, at least by traditional understanding.\n \n However, you're right that Lewis was a wonderful author. \n \n Have you read any of GK Chesterton's writings?", 
   {}, 
   359658, 
   null, 
   1247069220.0
  ], 
  [
   359944, 
   null, 
   "Jo Bennett", 
   "I haven't, no. Anything you'd recommend?\n \n My point really was who do we consider to be Apostles? The title was claimed by Paul, but has also been applied to other, later, Saints such as Patrick. An apostle is one sent forth as a messnger (or so wikipedia tells me), and I'm still looking for a reason why Paul is considered to be one and Lewis not, other than antiquity and Paul claiming to be one. Given the attitude Lewis had to his own importance and standing in the church (always being at pains to stress his status as a layman rather than a priest) it is no wonder that he had no wish to claim the title himself. \n \n I've focussed on Lewis here but there are no doubt others whose work might also enlarge our range of epistles, and I'm trying to come up with a sound reason why the canon shouldn't or couldn't be expanded, other than tradition and an inability for the church to agree on what was or wasn't inspired.", 
   {}, 
   359940, 
   null, 
   1247075220.0
  ], 
  [
   359965, 
   null, 
   "Symbiote", 
   "Wish I could comment but never read them.\n \n I did enjoy his fictional work and syllogisms...", 
   {}, 
   359944, 
   null, 
   1247102820.0
  ], 
  [
   359980, 
   null, 
   "Art Pigou", 
   "Just for the record, inspiration was not a criterion of canonicity in the early church.", 
   {}, 
   359965, 
   null, 
   1247109600.0
  ], 
  [
   363437, 
   null, 
   "ledbythespirit", 
   "What are we all Catholics? Then were all doomed.Theyre no diffrent than Satanist! Infact the rituals are eeriely identical to each other. I know I USED TO BE ONE BUT NOT ANYMORE!", 
   {}, 
   359980, 
   null, 
   1249214280.0
  ], 
  [
   363480, 
   null, 
   "trebor", 
   "What are we all Catholics? Then were all doomed.Theyre no diffrent than Satanist! Infact the rituals are eeriely identical to each other. I know I USED TO BE ONE BUT NOT ANYMORE!\n\n \n So, you are doomed. Your point?\n \n I would love to know how you know what a satanist ritual looks like. Hollywood maybe?", 
   {}, 
   363437, 
   null, 
   1249227600.0
  ], 
  [
   363508, 
   null, 
   "simone", 
   "Even though I am an Atheist, I would be thoroughly shocked to learn that all my Catholic relatives, colleagues and friends were SATANISTS?\n \n Where do people get these idiotic notions?", 
   {}, 
   363480, 
   null, 
   1249239900.0
  ], 
  [
   363652, 
   null, 
   "jyoshu", 
   "I haven't, no. Anything you'd recommend?\n\n \n Sorry I never did get back to you on this. I have a 'collected works' sort of book that has sections of a number of his works. \n \n Chesterton had a profound influence on Lewis. From what I understand his influence is part of the reason Lewis was persuaded away from atheism.\n \n \nMy point really was who do we consider to be Apostles? The title was claimed by Paul, but has also been applied to other, later, Saints such as Patrick.\n\n \n Isn't apostle status only for those whom the church holds to having been in the physical presence of Christ? That's what I've heard anyway. I guess it includes Paul by his Damascus road experience, but I agree that does seem a little iffy when others have had at least similar or more profound experiences.", 
   {}, 
   359944, 
   null, 
   1249273200.0
  ], 
  [
   363917, 
   null, 
   "Jo Bennett", 
   "From what I understand, the Roman Catholic church (and hence most other churches that share a common heritage with it) titles a number of saints apostles, mainly those responsible for first bringing Christianity to a particular place. St. Augustine, then, is \"Apostle to the English\", but there are also other New Testament apostles, such as Apollos, Andronicus, Junia and Silas, who are referred to in the Epistles as apostles.\n \n Lewis' own description of his conversion, Surprised by Joy, is a hugely interesting study of his struggle with atheism, and his supreme reluctance to admit the existence of God. For all his later carefully constructed logical argument for God, his own experience was of God pushing His way in and demanding to be heard, his logic and deduction only coming in when it came to deciding whether to believe in Christianity.", 
   {}, 
   363652, 
   null, 
   1249428600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mere Christianity - C. S. Lewis", 
  "url": "http://www.4forums.com/political/religion-debates/12951-mere-christianity-c-s-lewis.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 12951, 
  "discussion_files": [
   [
    "2949.html", 
    "http://www.4forums.com/political/religion-debates/12951-mere-christianity-c-s-lewis-print.html"
   ]
  ], 
  "identifier": 12951
 }
]