[
 [
  [
   359763, 
   null, 
   "foundit66", 
   "Audra Shay, vice chairman of the Young Republicans and the leading candidate to be elected its chairman on Saturday, is now the latest in a growing list of GOP officials learning this lesson the hard way, based on pictures of a now-deleted Facebook page obtained by The Daily Beast.\n \n On Wednesday, Shay-a 38-year-old Army veteran, mother, and event planner from Louisiana who has been endorsed by her governor, Bobby Jindal, ... initiating a political conversation by posting that \"WalMart just signed a death warrant\" by \"endorsing Obama's healthcare plan.\" At 1:52, a friend named listed as Eric S. Piker, but whose personal page says his actual name is Eric Pike, wrote \"It's the government making us commies... can't even smoke in my damn car... whats next they going to issue toilet paper once a month... tell us how to wipe our asses...\" \n \n Two minutes later, Piker posted again saying \"Obama Bin Lauden [sic] is the new terrorist... Muslim is on there side [sic]... need to take this country back from all of these mad coons... and illegals.\"\n \n Eight minutes after that, at 2:02, Shay weighed in on Piker's comments: \"You tell em Eric! lol.\"\n \n Shay now claims that she was only responding to Piker's first comments, not having noticed the second. The eight-minute gap between the second post and her response strains the credibility of this defense.\n \n It didn't take long for other posters on Shay's page to do the math. First, Derek Moss wrote \"What's disheartening is the use of the word 'coon' in 2009. Wow... I'm usually outnumbered about 500-to-1 on Audra's threads so go ahead, lemme have it, I deserve it.\" He apparently expected to be criticized as among this crowd for calling out the racist comment. \n \n Cassie Wallender, a national committeewoman from the Washington Young Republican Federation, then wrote: \"Someone please help a naïve Seattle girl out, is Eric's comment a racist slur?\" She answered her own question one minute later: \"Okay, why is this okay? I just looked it up. 'It comes from a term baracoons (a cage) where they used to place Africans who were waiting to be sent to America to be slaves.' THIS IS NOT OKAY AND IT'S NOT FUNNY.\"\n \n This was followed soon after by the chairman of the D.C. Young Republicans, Sean L. Conner, who wrote \"I'm really saddened that you would support this type of racial language. ..wow! Thanks Cassie for standing up...\"\n \n Shay was silent on this exchange, but soon word started spreading throughout the Young Republican circuit, open to GOP members under 40. Significantly, Shay then \"de-friended\" Wallender and Conner-in the world of Facebook, that means cutting off relations-after calling her out, but kept Piker as a \"friend\" (subsequently, it appears their profiles are no longer linked).\n \n \"If Audra really did find these remarks to be 'outright disgusting,' then why was her response to immediately de-friend those who made statements against Eric's blatant racism?\" Wallender wrote yesterday in a letter to the Young Republican National Committee. \"I was blocked for stating that Eric's racist comment was \"NOT OKAY. And it is not funny.\" Please take a moment look at the entire screenshot linked above, and ask yourself: which comment would lead you to de-friend someone, mine, or Eric's?\"\n \n In the face of the \"coons\" comment, Shay's main concern seems to have been damage control. She deleted the controversial exchanges from her page (but not before screenshots were taken) and tried to tamp down the fire internally. Almost eight hours after Piker's comments, and Shay's ensuing \"LOL\", Shay posted a Facebook status update stating that neither she-nor her Young Republican political slate-\"condones the use of racial slurs on my wall.... It is not right to nor appropriate to talk that way and will not be accepted!\"\n \n At 10:31 p.m., a friend named Dale Lawson raised the P.C. defense, writing \"the over reaction to it was a little amusing.\" Then her friend Piker came roaring back: \"I agree with dale... this is still America... freedom of speech and thought is still allowed... for now any ways... and the last time i checked I was a good ole southern boy... and if yur XXX is black don't let the sun set on it in a southern town...\"\n \n ....\n \n Taken by themselves, the exchanges on Shay's page might be dismissed as an isolated ugly incident. But there's a pattern emerging from the fringe of the GOP grassroots. Three weeks ago, former South Carolina State Election Director and Richmond County GOP Chairman Rusty DePass \"joked\" on his Facebook page that first lady Michelle Obama was descended from a gorilla which had gone missing from a local zoo. Days later, Tennessee state legislative aide Sherri Goforth emailed out an image labeled \"Historical Keepsake\"-showing august portraits of all the presidents of the United States, ending with a pair of googly-eyes peering out from a black background to symbolize President Obama. When confronted, the aide to State Senator Diane Black said only that she regretted sending the image to the wrong email list and from her government address. She was \"reprimanded\" by her supervisors but not otherwise punished (a forced furlough at Memphis's National Civil Rights Museum would have been an inspired penalty). And of course, all this has taken place after Chip Saltzman's bid to be RNC Chairman was derailed by his decision to mail out a parody CD featuring the song \"Barack the Magic Negro.\"\n \n \"It seems like some of us Republicans are taking our conservative message, mixing it with personal prejudices and racist views, and calling it patriotism,\" says McAllister. \"You can cover cyanide with chocolate, but you still can't call it candy.\"\n \n This pattern of racial remarks from grassroots Republican politicos highlights a real problem: As the party tacks right, it seems increasingly reluctant to challenge folks on its fringe for fear of offending the base-even, in this case, by failing to immediately rebuke racist supporters on a Facebook page. Let's say that Shay's \"LOL\" response was the online equivalent of nervous laughter, the kind of passive response to racist jokes that may have once been considered acceptable in pool halls and country clubs of the past. In the Internet era, it offers indelible evidence of acquiescing to something evil in our politics. There is a fear-based paralysis, a lack of moral clarity, which is in direct contradiction to their historic role as the Party of Lincoln.\n\n New GOP \"Racist\" Headache - The Daily Beast\n \n And some people wonder why blacks are predominantly voting Democrat... emoticon_ic\n \n The below picture was taken from a McCain/Palin rally.\n http://i26.photobucket.com/albums/c114/foundit66/Protestor_Allowed.jpg\n \n While I do not believe racism dominates the RNC, it is a problem that needs to be addressed by the RNC. Kudoes to those Republican posters in the above story who didn't let that one fly...", 
   {
    "post_info": {
     "post_title": "New GOP &quot;Racist&quot; Headache"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1246922220.0
  ], 
  [
   359771, 
   null, 
   "CUNxTime", 
   "Racism is bad. Slurs are bad. But I can tell ya that the Pubs have no monopoly on racism. Furthermore, the best thing for EVERYONE isn't breaking us into groups, its allowing the opportunity for all to excel. That's what I believe and that's why I'm a libertarian/conservative!\n \n BTW...\n Was it the actual Young Republican who made the slur or was it that person's acquaintance on facebook? I didn't quite get all that straight.", 
   {}, 
   359763, 
   null, 
   1246927320.0
  ], 
  [
   359774, 
   null, 
   "Easyrider", 
   "\n \n And some people wonder why blacks are predominantly voting Democrat... emoticon_ic\n \n\n \n I'm still wondering. Do they like massive taxes passed down to them? You know, the ones the Dems always levy on corporations that they pass down to the little guy in the form of increased prices for goods and services? Do they need a big daddy government for handouts? I don't think they do. I think they're quite capable of telling the government to go pound sand IF THEY WANT. But instead, the Dem leaders keep promising them goodies and they keep voting for the goodie providers.  Isn't God their provider, or aren't they supposed to take care of themselves? All the Dems want to do is keep them on the planatation so they can provide for them. In return, the blacks vote for them.\n \n And where is abortion approved in their Bibles (note Jeremiah 1:5; Psalm 139;19, etc.)? WHY AREN'T THEY LOOKING OUT FOR THE LITTLE BABIES AND VOTING AGAINST THE PRO-INFANTICIDE CROWD???  And they call themselves Christians?? Almost 70% of their children are born out of wedlock. WHERE'S THAT IN THEIR BIBLES, WHERE FORNICATION IS OK? AND THEY CALL THEMSELVES CHRISTIANS?? WHAT KIND OF CHRISTIANITY IS THAT??? Plus, they're ok with the Dems approving gay marriage? Where's that in their Bibles?  Have they never read Leviticus 18:22; Lev. 20:13; Romans 1:26-27; I Cor. 6:9-10; Jude 7, etc.? \n \n Not that there aren't a lot of white's and hispanics doing many of the same things. Frankly, they disgust me too when they vote for the party of carnal hedonism and trillion-dollar spending programs.", 
   {}, 
   359763, 
   null, 
   1246930680.0
  ], 
  [
   359778, 
   null, 
   "foundit66", 
   "I'm still wondering.\n\n When you can wonder something topical, let me know...\n \n \n \nRacism is bad. Slurs are bad. But I can tell ya that the Pubs have no monopoly on racism. Furthermore, the best thing for EVERYONE isn't breaking us into groups, its allowing the opportunity for all to excel. That's what I believe and that's why I'm a libertarian/conservative!\n BTW...\n Was it the actual Young Republican who made the slur or was it that person's acquaintance on facebook? I didn't quite get all that straight.\n\n \n That is true. They don't have a monopoly.\n They DO have a much higher rate of it as a problem though.\n \n I remember one poll that separated \"democrat / republican\" according to beliefs about racial minorities.\n ACROSS THE BOARD, Republicans had a ~ +10 percent points more negative assumptions / conclusions about blacks.\n \n As for the Democrat side, I can't help but wonder how many of the \"Hillary supporters for McCain\" actually jumped political lines because they didn't want a black president... emoticon_wow", 
   {}, 
   359771, 
   null, 
   1246931400.0
  ], 
  [
   360374, 
   null, 
   "foundit66", 
   "emoticon_wow\n I really don't know whether to be shocked and disgusted, or just disgusted (without shock).\n After that racist display, the group STILL ELECTED her...\n \n \n \nAudra Shay, the Young Republicans leader accused of endorsing racism on Facebook, was elected head of the group for GOP members under 40 this afternoon.\n \n Audra Shay, who became the subject of a national controversy after The Daily Beast uncovered racist comments she wrote on Facebook and other social-networking sites, won the race to become head of the Young Republicans by approximately 50 votes (out of about 950 voting delegates) at their national convention this afternoon in Indianapolis.\n \n Shay faced calls to remove herself from the election after appearing to laugh at a racial slur about President Barack Obama, The Daily Beast's John Avlon exclusively reported. The comments, in which Shay responded to a comment calling blacks \"coons,\" were quickly deleted, but prompted fellow Young Republicans to urge her to take her hat out of the ring for the national election. And though Shay issued a statement that neither she, nor her Young Republicans slate, \"condones the use of racial slurs on my wall,\" Avlon reports that Shay has a history of racial comments, encouraging extremism and partisan hate online.\n \n Before the election, Meghan McCain urged the group not to choose hate by electing Shay: \"What exactly do the Young Republicans expect to achieve by electing a 38-year-old woman who thinks racial epithets are acceptable?\"\n \n Young Republicans insiders had expected the vote to be \"very, very close\" and said that many delegates were urging unity no matter who the winner turned out to be.\n \n Shay defeated Rachel Hoff, who serves as the Young Republicans' Director of Media Relations. She ran on a five-point platform that emphasized education, technology, and community outreach. According to George P. Bush, son of Jeb Bush, \"Rachel's professionalism, hard work, and leadership will well-represent the GOP.\" Sarah Huckabee, daughter of Mike Huckabee, said, \"Rachel Hoff's approach to politics and life seems to be: 'Stand Up and Lead.'\"\n\n Young GOP Chooses Hate - The Daily Beast", 
   {
    "unicode_changes_made": true
   }, 
   359778, 
   null, 
   1247475780.0
  ], 
  [
   360397, 
   null, 
   "Steeeeve", 
   "Shay's explanation is actually fairly plausible. I'm not sure if you guys use facebook from time to time I do (ha, once every 3 months or so) and I've commented on something only to find it is many hours and many other comments after the one I am responding to. \n \n Also, do you know how often \"coons\" is used as a word in Iraq? Is the Daily Beast going to call many folks in the military racist? \n \n Third, is it really a shock that rednecks (another slur) are racists and that they are going to be republicans? The republicans cater to guns and (to them) anti-government. Don't worry democrats, you have your own racist group as well.\n \n Finally, what are the young republicans? I've heard of them at colleges but do they actually have a national organization? If so, what a rip.", 
   {}, 
   360374, 
   null, 
   1247499900.0
  ], 
  [
   360401, 
   null, 
   "jyoshu", 
   "This 'outrage' coming from people of a party that has consistently re-elected a past KKK member to the U.S. senate--and someone who still makes racist comments from time-to-tome. (Robert Byrd) The 'Young Republicans'? Give me a freaking break. emoticon_rolleyes", 
   {}, 
   360397, 
   null, 
   1247504580.0
  ], 
  [
   360413, 
   null, 
   "foundit66", 
   "\" I know now I was wrong. Intolerance had no place in America. I apologized a thousand times... and I don't mind apologizing over and over again. I can't erase what happened. \"\n\n Shary's actions, on the other hand, are quite current.\n \n \n \n Shay's explanation is actually fairly plausible. I'm not sure if you guys use facebook from time to time I do (ha, once every 3 months or so) and I've commented on something only to find it is many hours and many other comments after the one I am responding to. \n\n emoticon_xdonno\n The issue isn't \"it came after something else\".\n The issue is \"Hey. I found the comment you said 10 minutes ago amusing, but I'm going to ignore the racist comment you said 8 minutes ago.\"\n If you're talking at a party and somebody says a funny comment.\n Followed by a racist comment which was a show-stopper for everybody else, you don't suddenly start laughing at the amusing comment.\n \n Furthermore, even if it were just that, it would be more possible to being an honest mistake.\n But Shay then IMMEDIATELY DEFRIENDED her non-racist friends, KEEPING THE RACIST AS HER FRIEND.\n Quite frankly Steeeeve, you're responding to the issue that \"aroused suspicion\", and then ignoring the bigger thing that is really the smoking gun here...\n \n \n \nAlso, do you know how often \"coons\" is used as a word in Iraq? Is the Daily Beast going to call many folks in the military racist?\n\n emoticon_wow\n emoticon_xdonno\n Every once in a while, I come across a mind-boggling example of obfuscation.\n Coons, as used on that face-book page, was clearly racist.\n If you want to argue against that, then please do so.\n Otherwise, you're comments are meaningless.\n \n \n \nThird, is it really a shock that rednecks (another slur) are racists and that they are going to be republicans? The republicans cater to guns and (to them) anti-government. Don't worry democrats, you have your own racist group as well.\n\n Again, missing the big picture.\n If we were talking about some miscellaneous Republican commenting on another miscellaneous Republican's facebook page, I wouldn't be posting it.\n But this is Audra Shay. The NEWLY ELECTED CHAIRPERSON of the Young Republicans.\n A NATION-WIDE Republican organization.\n \n It would be like if McCain called Obama a \"coon\" before the primaries, and then Republicans across the nation continued to successfully make him their presidential choice anyways.\n \n \n \nFinally, what are the young republicans? I've heard of them at colleges but do they actually have a national organization? If so, what a rip.\n\n Yes. They are a national organization. Shay was elected as the national chairperson.\n As the previous article mentioned, they just had an election for Shay as the chairperson, and she won.", 
   {
    "unicode_changes_made": true
   }, 
   360401, 
   null, 
   1247510820.0
  ], 
  [
   360438, 
   null, 
   "jyoshu", 
   "Byrd: &#8220; I know now I was wrong. Intolerance had no place in America. I apologized a thousand times... and I don't mind apologizing over and over again. I can't erase what happened. &#8221;\n\n \n Wonder how apologetic he felt of his KKK roots while he was being the only senator to vote against BOTH of the only two African American SCOTUS justices ever nominated to the court, or while using racist terminology in news media interviews in 2001? :)", 
   {}, 
   360413, 
   null, 
   1247517720.0
  ], 
  [
   360453, 
   null, 
   "Steeeeve", 
   "The issue isn't \"it came after something else\".\n The issue is \"Hey. I found the comment you said 10 minutes ago amusing, but I'm going to ignore the racist comment you said 8 minutes ago.\"\n If you're talking at a party and somebody says a funny comment.\n Followed by a racist comment which was a show-stopper for everybody else, you don't suddenly start laughing at the amusing comment.\n \n Furthermore, even if it were just that, it would be more possible to being an honest mistake.\n But Shay then IMMEDIATELY DEFRIENDED her non-racist friends, KEEPING THE RACIST AS HER FRIEND.\n \nI'm saying it is plausible because I've done the same thing. Comments are formed in a list and you don't have to read them all the comment on it. It isn't a chat room.\n \n \nCoons, as used on that face-book page, was clearly racist.\n If you want to argue against that, then please do so.\n Otherwise, you're comments are meaningless.\nI just want to know if military that uses the term \"coons\" are racist. For example, if they are done so by a superior officer to his troops on official business. This kind of reminds me of the movie Three Kings. \n \n \nAgain, missing the big picture.\n If we were talking about some miscellaneous Republican commenting on another miscellaneous Republican's facebook page, I wouldn't be posting it.\n But this is Audra Shay. The NEWLY ELECTED CHAIRPERSON of the Young Republicans.\n A NATION-WIDE Republican organization.\nThat no one cares about... \n \n Would it be less racist if it was some miscellaneous republican? He may very well be racist but if saying \"right on\" on facebook makes you racist than we live in a sad society. \n \n \nIt would be like if McCain called Obama a \"coon\" before the primaries, and then Republicans across the nation continued to successfully make him their presidential choice anyways.\nOnly the chairperson of the young republicans is unknown by the vast majority of people and this guy never called anyone a coon. I didn't even know there was a national organization before you said something and I follow politics hardcore. \n \n Chalk this one up under who gives a rip.", 
   {}, 
   360413, 
   null, 
   1247526960.0
  ], 
  [
   360468, 
   null, 
   "Bad Mojo", 
   "Wonder how apologetic he felt of his KKK roots while he was being the only senator to vote against BOTH of the only two African American SCOTUS justices ever nominated to the court, or while using racist terminology in news media interviews in 2001? :)\n\n \n Oh yes, Robert Byrd's famous \"white nigg*ers quote.\n \n \n \nThey're much, much better than they've ever been in my lifetime... I think we talk about race too much. I think those problems are largely behind us... I just think we talk so much about it that we help to create somewhat of an illusion. I think we try to have good will. My old mom told me, 'Robert, you can't go to heaven if you hate anybody.' We practice that. There are white nigg*rs. I've seen a lot of white nigg*rs in my time, if you want to use that word. We just need to work together to make our country a better country, and I'd just as soon quit talking about it so much.\n\n \n We can infer many things from this quote. Those on the left will say that Robert Byrd was making an equation of equality between white and black by calling all race baiters \"nigg*ers\". Or, we can use the right's version of the phrase and just ignore everything else and focus on one word and completely forget about context. To me, I can understand (though not really agree) with what he is saying and regardless he had the decency to apologize for the above statement almost immediately. \n \n Did Byrd vote against both Marshall and Thomas? Yes, yes he did and for very different reasons. He voted against Marshall in 1967 because he was still very much of a racist at the time. He voted against Thomas (like most democrats did) because Thomas had some serious problems but to imply he voted against Thomas because of race is to simply over simplify.\n \n Did you know that Byrd endorsed Obama way back in May of last year?\n \n How does the NAACP rate Robert Byrd?\n \n \nIn the National Association for the Advancement of Colored People's (NAACP)[53] Congressional Report Card for the 108th Congress (spanning the 2003-2004 congressional session), Byrd was awarded with an approval rating of 100 percent for favoring the NAACP's position in all 33 bills presented to the United States Senate regarding issues of their concern. Only 16 other Senators of the same session matched this approval rating. In June 2005, Byrd[54] proposed an additional $10 million in federal funding for the Martin Luther King memorial in Washington, D.C., remarking that \"With the passage of time, we have come to learn that his Dream was the American Dream, and few ever expressed it more eloquently.\"\n\n \n Sheesh, couldn't even give 110%, what a bigot.\n \n Not that any of this matters, what do you think of the new leader of the Young Republicans? I can guess that as long as Robert Byrd has that (D) after his name you're never going to like the guy. What about the Young Republican that this thread is about? Yep, obfuscating......you're doing it wrong.\n \n Hey, Robert Byrd was a dixiecrat who changed his ways, what party took in the rest of the dixiecrats when the democratic party moved to the left? Think Stromm.", 
   {
    "unicode_changes_made": true
   }, 
   360438, 
   null, 
   1247530860.0
  ], 
  [
   360475, 
   null, 
   "foundit66", 
   "Wonder how apologetic he felt of his KKK roots while he was being the only senator to vote against BOTH of the only two African American SCOTUS justices ever nominated to the court, or while using racist terminology in news media interviews in 2001? :)\n\n emoticon_rolleyes\n Quite frankly, for the life of me I don't understand how Thomas got on the bench with his antics.\n \n Regarding Thurgood Marshall...\n How shall we put this...\n He opposed an integrationist judge. At that time, integration was obviously a controversial topic, with differing opinions. emoticon_rolleyes\n \n \n Funny that you don't quote the news media interview in 2001.\n \n \nIn a March 4, 2001 interview with Tony Snow, Byrd said of race relations:\n  They're much, much better than they've ever been in my lifetime... I think we talk about race too much. I think those problems are largely behind us... I just think we talk so much about it that we help to create somewhat of an illusion. I think we try to have good will. My old mom told me, 'Robert, you can't go to heaven if you hate anybody.' We practice that. There are white n-word. I've seen a lot of white n-word in my time, if you want to use that word. We just need to work together to make our country a better country, and I'd just as soon quit talking about it so much.[45]\n Byrd's use of the term \"white n-word\" created immediate controversy. When asked about it, Byrd responded,\n  I apologize for the characterization I used on this program... The phrase dates back to my boyhood and has no place in today's society... In my attempt to articulate strongly held feelings, I may have offended people.[45]\n\n Robert Byrd - Wikipedia, the free encyclopedia\n \n I have said it before. Some people (foolhardy IMO) attempt to strip the word \"n-word\" of its racial connotations/denotations. They utilize the word (in their own personal definitions) whereby the word IS NOT about race.\n They use the word in a racially neutral attempt like saying \"white trash\" would be applied regardless of race.\n \n I don't agree with it, but I would hope that some people would appreciate the REAL INTENT of the word.\n A parallel would be like people complaining that anti-gay Christians \"hate\" gays, when the truth can be something else.\n Here, I don't see Byrd's use as racially derogatory, but rather a misguided attempt to use a foul (IMO) word in a way that ignores races.\n \n And quite frankly, isn't ignoring the race of people something that we should want in the first place?\n \n \n I find your allegations amusing, especially considering how the NAACP looks at Byrd...\n \nIn the National Association for the Advancement of Colored People's (NAACP)[53] Congressional Report Card for the 108th Congress (spanning the 2003&#8211;2004 congressional session), Byrd was awarded with an approval rating of 100 percent for favoring the NAACP's position in all 33 bills presented to the United States Senate regarding issues of their concern. Only 16 other Senators of the same session matched this approval rating.\n\n Robert Byrd - Wikipedia, the free encyclopedia\n \n Also...\n \nCunningham and other Byrd backers note how local and national black politicians have rallied around him as he considers another run.\n\n http://www.usatoday.com/news/washington/2005-05-22-byrd-fight-GOP_x.htm\n \n Byrd is in an entirely different category from Shay, who not only praised the racist term, but also DEFRIENDED those who condemned the racial slur.", 
   {}, 
   360438, 
   null, 
   1247532240.0
  ], 
  [
   360481, 
   null, 
   "foundit66", 
   "I'm saying it is plausible because I've done the same thing. Comments are formed in a list and you don't have to read them all the comment on it. It isn't a chat room.\n\n Honestly?\n If it was JUST that, I wouldn't have posted the article...\n \n But like I have said, the fact that she DEFRIENDED the people who spoke out against racism was a smoking gun that cannot be ignored...\n \n \n \nI just want to know if military that uses the term \"coons\" are racist. For example, if they are done so by a superior officer to his troops on official business. This kind of reminds me of the movie Three Kings.\nMain Entry: coon Listen to the pronunciation of coon\n Pronunciation: \\&#712;kün\\ \n Function: noun \n Date: 1742\n 1: raccoon\n 2: usually offensive : black 4\n I honestly have no idea what you're talking about. You'll have to provide some background on the word... I haven't seen that movie.\n \n Regardless, words have different meanings. Like \"coons\" can both be applied as a racial slur, and as an abbreviation for \"raccoon\". If the military is simply using an alternative meaning (say, a definition #3 which merriam-webster has not listed), then your replies make as much sense as trying to point to a raccoon, calling it \"coon\", and thinking that somehow mitigates what actually happened on that facebook page.\n \n I googled, and came across this web-site giving military slang.\n Coon: A black soldier (racoon). \n Military Slang: \"Suzy Rottencrotch\" and \"Desert Niggers\"?\n \n So in your example, what is the word supposed to mean?\n Please. Give documentation if available.\n \n \n \nWould it be less racist if it was some miscellaneous republican?\n\n It would be less relevant.\n We both know that racist Republicans and racist Democrats exist.\n But they are typically expected to be few and far between.\n When you have a situation where people ELECT a racist, that demonstrates something rather disturbing.\n \n \n [quote=Only the chairperson of the young republicans is unknown by the vast majority of people and this guy never called anyone a coon. I didn't even know there was a national organization before you said something and I follow politics hardcore. [/quote]\n What is \"unknown\" is speculative and irrelevant.\n Only 53% of adults know how long it takes for the Earth to revolve around the Sun.\n Americans can't answer rudimentary science questions\n \n Not knowing about something is not an argument.\n The group is nation-wide.", 
   {}, 
   360453, 
   null, 
   1247533980.0
  ], 
  [
   360483, 
   null, 
   "Bad Mojo", 
   "I just want to know if military that uses the term \"coons\" are racist. For example, if they are done so by a superior officer to his troops on official business. This kind of reminds me of the movie Three Kings. \n\n \n Sorry, I just have to add my 2 cents to this as well. I'm not exactly sure what the point is but if someone calls a black person a \"coon\" then yes....it's racist.\n \n Where are you going with this? I can see 2 really horrible trainwreck possibilities you are going to delve into.\n \n 1) For the troops - You are going to take the opportunity to tell someone what a horrible person they are because they are \"broadbrushing\" the troops as racists.\n \n 2) Let's go after George Clooney - He's a liberal, he was in the Three Kings and if his character or anyone in that movie says something racist then of course by extension George Clooney (and all liberals?) are racist.\n \n I vote for option 3.\n \n 3) Stop, you're making a fool of yourself.", 
   {}, 
   360453, 
   null, 
   1247534580.0
  ], 
  [
   360485, 
   null, 
   "jyoshu", 
   "emoticon_rolleyes\n Quite frankly, for the life of me I don't understand how Thomas got on the bench with his antics.\n \n\n \n I think more to the point is that it is hard to understand how Byrd remained in the Senate all this time with HIS antics, until one considers that some are more apt to excuse past bigotry if they are in the same political party ....\n \n Michelle Malkin, a conservative writer, hit the nail on the head back in 2001 ...\n \"The ex-Klansman's admirers praise his historical knowledge, mastery of procedural rules, and outspokenness. They refer to the Senate's senior Democrat as the \"conscience of the Senate.\" They downplay his white-sheet-wearing days as a \"brief mistake\" -- as if joining the Klan were like knocking over a glass of water. Oopsy.\n \n This ex-Klansman wasn't just a passive member of the nation's most notorious hate group. According to news accounts and biographical information, Sen. Byrd was a \"Kleagle\" -- an official recruiter who signed up members for $10 a head.\"It's absolutely unfathomable that a man who was a member of the Klu Kux Klan would even be in the senate today. Ah, but Byrd says he's sorry--that makes it all better! So instead, let's get all bent out of shape over the racism of some newly elected leader of the \"young Republicans\" ....\n \n On another note, one figure uses the term \"white n*****\" and it's characterized by those in his party as not really being racist. Someone of much less importance uses the term \"coon\", and it's heavily condemned. The stark imbalance of reaction is striking. (I guess if Shay had said \"WHITE coon\" in the context of a discussion about race, it would suddenly be ok. emoticon_rolleyes )", 
   {}, 
   360475, 
   null, 
   1247535180.0
  ], 
  [
   360486, 
   null, 
   "Bad Mojo", 
   "I think more to the point is that it is hard to understand how Byrd remained in the Senate all this time with HIS antics, until one considers that some are more apt to excuse past bigotry if they are in the same political party ....\n\n \n Oh, please do list all of his antics.\n \n \nMichelle Malkin, a conservative writer, hit the nail on the head back in 2001 ...\n \"The ex-Klansman's admirers praise his historical knowledge, mastery of procedural rules, and outspokenness. They refer to the Senate's senior Democrat as the \"conscience of the Senate.\" They downplay his white-sheet-wearing days as a \"brief mistake\" -- as if joining the Klan were like knocking over a glass of water. Oopsy.\n \n This ex-Klansman wasn't just a passive member of the nation's most notorious hate group. According to news accounts and biographical information, Sen. Byrd was a \"Kleagle\" -- an official recruiter who signed up members for $10 a head.\"It's absolutely unfathomable that a man who was a member of the Klu Kux Klan would even be in the senate today. Ah, but Byrd says he's sorry--that makes it all better! So instead, let's get all bent out of shape over the racism of some newly elected leader of the \"young Republicans\" ....\n\n \n So says the women who wrote a book with glowing reviews of Japanese internment camps. Anyway, like it or not Byrd is a wealth of information, he's been honestly elected to the senate for decades and for the most part is very pro-civil rights. With the exception of same sex marriage. If you want to find his racist voting record for the past 30 years that would great, what a way to have a point rather than quoting Ms. Torture.\n \n \n So, you're more worried about the KKK of the 60s than the leader of the Young Republican's who is apparently a racist. Do you know who supports the Young Republicans? It's pretty simple...the big-boy Republican party...GOP. Which is what this thread is about, why not start a new thread about Robert Byrd if it's such a big deal?\n \n Do you think calling black people coons is racist? Why don't you and ArchAngel ever honestly answer a question? Regardless of what you think of Robert Byrd.", 
   {}, 
   360485, 
   null, 
   1247536080.0
  ], 
  [
   360487, 
   null, 
   "foundit66", 
   "I think more to the point is that it is hard to understand how Byrd remained in the Senate all this time with HIS antics, until one considers that some are more apt to excuse past bigotry if they are in the same political party ....\n\n Not at all.\n If he were pulling the stuff he pulled back then TODAY, I would whole-heartedly advocate him getting the boot.\n \n I seem to remember somebody talking about forgiveness and the capability to change.\n Hmmmm....\n Who was that...\n \n Oh yeah. That was YOU Jyoshu...\n \nOr showed that you really even care about forgiveness at all, even when people DO admit their errors and try to correct.\n\n http://www.4forums.com/political/politics-debates/12916-governor-family-values-sanford-south-carolina-3.html#post358862\n \n And as Byrd's voting record shows (as evidenced by NAACP grade), he truly has changed.\n \n So I guess the real question here would be why aren't you adhering to YOUR words Jyoshu?\n Is it cause Byrd's in a different political party?\n \n \n \nMichelle Malkin, a conservative writer, hit the nail on the head back in 2001 ...\n [I][INDENT][INDENT]\"The ex-Klansman's admirers praise his historical knowledge, mastery of procedural rules, and outspokenness. They refer to the Senate's senior Democrat as the \"conscience of the Senate.\" They downplay his white-sheet-wearing days as a \"brief mistake\" -- as if joining the Klan were like knocking over a glass of water. Oopsy.\n\n And that happened how many years ago?\n Tell me Jyoshu.\n What evidence is there that he isn't sincere in his comments on CHANGING???\n \n You give absolutely no evidence that he isn't sincere.\n In fact, you fail to even address his comments on him changing... \n \n \n \nOn another note, one figure uses the term \"white n*****\" and it's characterized by those in his party as not really being racist.\n\n :xbanghead\n Dude. How about you ADDRESS THE COMMENTS about what was really being said, okay?\n \n Oh wait. Then you'd have to quote me calling his statement \"fool-hardy\" and \"foul\", wouldn't you...\n Cause you can't debate the issue of whether or not it IS racist or not (as he used it).\n \n Perhaps you can elaborate on what YOU think \"white n*****\" means, as used by Byrd?\n Or just ignore it, and attempt to denigrate the issue without the capability to discuss it.... emoticon_xdonno\n \n \n \nSomeone of much less importance uses the term \"coon\", and it's heavily condemned. The stark imbalance of reaction is striking.\n\n Say huh???? emoticon_wow\n I DID CONDEMN Byrd's usage.\n \n \n \n(I guess if Shay had said \"WHITE coon\" in the context of a discussion about race, it would suddenly be ok. emoticon_rolleyes )\n\n I probably would have said something similar above regarding what I ACTUALLY SAID about Byrd's statement.\n You know. Me CONDEMNING it...", 
   {}, 
   360485, 
   null, 
   1247536320.0
  ], 
  [
   360502, 
   null, 
   "jyoshu", 
   "Not at all.\n If he were pulling the stuff he pulled back then TODAY, I would whole-heartedly advocate him getting the boot. I seem to remember somebody talking about forgiveness and the capability to change.\n Hmmmm....\n Who was that...\n \n Oh yeah. That was YOU Jyoshu...\n\n \n First, FOPIOI.\n \n Second, one of my whole reasons for the comparison is noting how EASILY some seem to forgive a person of their own party for things they will roundly condemn someone if in another party.\n \n This very thread is a PERFECT example. \n \n And since some hold Byrd's apologies as apparently all the basis they need to consider him a Senate-worthy ex Klansman, are we to assume that if Shay were to apologize for the statement made, suddenly there would be thorough forgiveness by Democrats? LOL\n \n Again, a lot of the issue is one of degree of influence. Election to the senate SHOULD require FAR, FAR more scrutiny than election to the \"young Republicans\". (which, like Steeeeve, is an organization I had never even heard of.) Yet Dems KEEP a man in the senate(!) all these years who took part in tremendous damage to the cause of black people, while being apparently eager to point fingers at the leader of the \"young Republicans.\"", 
   {}, 
   360487, 
   null, 
   1247538600.0
  ], 
  [
   360504, 
   null, 
   "Steeeeve", 
   "Honestly?\n If it was JUST that, I wouldn't have posted the article...\n \n But like I have said, the fact that she DEFRIENDED the people who spoke out against racism was a smoking gun that cannot be ignored...\nIf one of my friends called me a racist I'd de-friend them too. I'm not sure that proves anything.\n \n\n I googled, and came across this web-site giving military slang.\n Coon: A black soldier (racoon). \n \n So in your example, what is the word supposed to mean?\n Please. Give documentation if available.\n \nthat link basically talked about it. The military folks use all kinds of those racist slurs in normal speech including in briefings by officers. It just so happened to be highlighted in the movie Three Kings. I'm only wondering if this is equally as offensive an, perhaps, should people that use this term in the military be dismissed if used in official duty?\n \n I'm getting at that people are quick to jump on this guy for something I think is a nonissue but in very well known instances in the military you rarely see people make a big deal of it. I'm not saying you should of here either or that not calling it before makes you biased...I'm just asking if you find it offensive that the military uses those same words regularly in combat.\n \n \nIt would be less relevant.\n We both know that racist Republicans and racist Democrats exist.\n But they are typically expected to be few and far between.\n When you have a situation where people ELECT a racist, that demonstrates something rather disturbing.\nI think it takes more than that to be declared a racist. This is like Trent Lott racist where it is a lot about nothing.\n \n \nWhat is \"unknown\" is speculative and irrelevant.\n Only 53% of adults know how long it takes for the Earth to revolve around the Sun.\n Americans can't answer rudimentary science questions\n \n Not knowing about something is not an argument.\n The group is nation-wide.\nMy point is that they are more like your average republican than like John McCain in reference to what you were saying earlier.", 
   {}, 
   360481, 
   null, 
   1247539140.0
  ], 
  [
   360505, 
   null, 
   "Steeeeve", 
   "Sorry, I just have to add my 2 cents to this as well. I'm not exactly sure what the point is but if someone calls a black person a \"coon\" then yes....it's racist.\n \n Where are you going with this? I can see 2 really horrible trainwreck possibilities you are going to delve into.\n \n 1) For the troops - You are going to take the opportunity to tell someone what a horrible person they are because they are \"broadbrushing\" the troops as racists.\n \n 2) Let's go after George Clooney - He's a liberal, he was in the Three Kings and if his character or anyone in that movie says something racist then of course by extension George Clooney (and all liberals?) are racist.\n \n I vote for option 3.\n \n 3) Stop, you're making a fool of yourself.\n\n \n Check your tone...the admin doesn't like insults :)", 
   {}, 
   360483, 
   null, 
   1247539200.0
  ], 
  [
   360507, 
   null, 
   "Bad Mojo", 
   "Second, one of my whole reasons for the comparison is noting how EASILY some seem to forgive a person of their own party for things they will roundly condemn someone if in another party.\n\n \n It's more than just forgive. I don't know how often you can miss it but the NAACP is pleased as punch with Byrd's voting record. He didn't just apologize, he walked the talk. Stromm Thurmond was a democrat (until he found a party more to his liking) and I never approved of him. There were many southern racist democrats who I didn't care for. It's too bad the Republican Party picked them up in their great Southern Strategy. I know it's all lost on you, don't worry about it.\n \n \nThis very thread is a PERFECT example. \n\n \n Only because you want it to be. You see, this would be a perfect time for you to bring up Jesse \"Hymietown\" Jackson. (To save face I strongly reccomend you do)\n \n \nAnd since some hold Byrd's apologies as apparently all the basis they need to consider him a Senate-worthy ex Klansman, are we to assume that if Shay were to apologize for the statement made, suddenly there would be thorough forgiveness by Democrats? LOL\n\n \n What part of 100% NAACP approval do you not get?\n \n I bet you won't even address that.\n \n \nAgain, a lot of the issue is one of degree of influence. Election to the senate SHOULD require FAR, FAR more scrutiny than election to the \"young Republicans\". \n\n \n True. However Robert Byrd's old views were probably standard fair for West Virginia at the time. I wouldn't have wanted him out of office regardless of his party. But, here we are in 2009 (decades later) and Robert Byrd has a decent civil rights voting record. Why don't you compare his voting record to John McCain and see where you come out?\n \n \n \n(which, like Steeeeve, is an organization I had never even heard of.) Yet Dems KEEP a man in the senate(!) all these years who took part in tremendous damage to the cause of black people, while being apparently eager to point fingers at the leader of the \"young Republicans.\"\n\n \n Yeah, the KKK was pretty bad, awful and somehow Robert Byrd was able to see the light and now decades later after he has done quite a bit for civil rights you decide you don't want him in office anymore, all in the name of saving some sweet little innocent child who just happened to become the president of the Young Republicans and for some very odd reason you've never heard of them? I'm going to guess you don't get out much, they are a major recruiting tool for the GOP and are massively funded by them.", 
   {}, 
   360502, 
   null, 
   1247539800.0
  ], 
  [
   360508, 
   null, 
   "Bad Mojo", 
   "Check your tone...the admin doesn't like insults :)\n\n \n I didn't call you a fool, I said if you continue with this line of reasoning you then would be a fool.", 
   {}, 
   360505, 
   null, 
   1247539920.0
  ], 
  [
   360510, 
   null, 
   "foundit66", 
   "If one of my friends called me a racist I'd de-friend them too. I'm not sure that proves anything.\n\n Did you even look at what actually happened?\n THEY DID NOT CALL Shay a racist.\n They called THE ORIGINAL poster (the one who used the word \"coons\") out on his behavior and said it was unacceptable.\n \n It's more like Steeeeve is friends with Jack, Jill, and Karl.\n Jack uses a racist slur.\n Jill and Karl call Jack on his racist slur.\n Steeeeve turns around and removes friendship from Jill and Karl, AND KEEPS friendship with Jack.\n \n \n \nthat link basically talked about it. The military folks use all kinds of those racist slurs in normal speech including in briefings by officers.\n\n Um. Okay.\n So what's your question again?\n You're asking me if it's racist in that example too?\n Well, look at your description...\n \"The military folks use all kinds of those racist slurs ...\"\n \n I think you just answered your own question.\n \n \n \nIt just so happened to be highlighted in the movie Three Kings. I'm only wondering if this is equally as offensive an, perhaps, should people that use this term in the military be dismissed if used in official duty?\n\n What's the point of this question?\n To ask me about the severity of punishment for an admittedly racist slur?\n emoticon_rolleyes\n \n I certainly would not think automatic \"dismissal\" would be in order.\n But if I were an officer in charge of selecting somebody for a post that would be influential in setting military policy? I sure as heck wouldn't pick the racist for the job...\n \n \n \nI'm getting at that people are quick to jump on this guy for something I think is a nonissue but in very well known instances in the military you rarely see people make a big deal of it.\n\n :xbanghead\n Yeah. Cause electing somebody to be the head of a nation-wide young republicans organization IS EXACTLY like some peon corporal saying \"coon\"...\n \n If you want to show me a REAL LIFE example (not a movie...) of something analogous, that would be great.\n \n \n \nI'm not saying you should of here either or that not calling it before makes you biased...I'm just asking if you find it offensive that the military uses those same words regularly in combat.\n\n Yeah. Along with ####, ####, ####, ####, ####, ####, ####, and ####-####### ############.\n Now, I can't help but wonder if maybe there is a reason that we have phrases like \"curse like a sailor\", yet John McCain (Navy Veteran) doesn't run around cursing like a sailor in his political capacity...\n Surely there is some reason for that, right?\n \n \n \nI think it takes more than that to be declared a racist. This is like Trent Lott racist where it is a lot about nothing.\n\n I've explained the justification for the analysis repeatedly.\n It's more like Steeeeve is friends with Jack, Jill, and Karl.\n Jack uses a racist slur.\n Jill and Karl call Jack on his racist slur.\n Steeeeve turns around and removes friendship from Jill and Karl, AND KEEPS friendship with Jack.\n \n \n \nMy point is that they are more like your average republican than like John McCain in reference to what you were saying earlier.\n\n Why do you feel the need to compare to \"John McCain\" stature?\n I never said she was anything like John McCain stature.\n \n The comparison is nonsensical. If McCain would pull something like this, there would be hades to pay.\n That reality doesn't mean that somebody LOWER than him also wouldn't have significant fallout as well.\n \n Moreover, I think you're failing to grasp something huge here.\n She pulled this junk, favoring a racist over her other friends who denounced racism, AND SHE GOT ELECTED ANYWAYS.\n That's pretty significant. Having a scandal like that break, and the young Republicans decide they don't care about such an obvious err in judgment, and elect her anyways...\n \n \n This whole thing could have taken a \"turn for the better\" at several stages.\n The original poster could have made the racist comment, and then she called him on it.\n \n The original poster could have made the racist comment, others pointed it out, and then Shay called him on it.\n \n The original poster could have made the racist comment, others point it out and then Shay de-friended the racist poster.\n But no. It was her moral friends she axed...\n \n From all that, the Young Republicans could have recognized her of flawed moral character / judgment, and elected somebody else.\n But then a MAJORITY decided to elect her...\n \n Over and over again, where the right choice could have been made, the WRONG choice was made instead...", 
   {}, 
   360504, 
   null, 
   1247541060.0
  ], 
  [
   360521, 
   null, 
   "CUNxTime", 
   "This thread is a perfect example of the way som people from either 'side' will excuse one of their allies for nearly any transgression while blowing any perceived transgressions from the other 'side' out of all proportion. Sometimes I get very discouraged.", 
   {}, 
   360510, 
   null, 
   1247546940.0
  ], 
  [
   360522, 
   null, 
   "Steeeeve", 
   "Did you even look at what actually happened?\n THEY DID NOT CALL Shay a racist.\n They called THE ORIGINAL poster (the one who used the word \"coons\") out on his behavior and said it was unacceptable.\n \n It's more like Steeeeve is friends with Jack, Jill, and Karl.\n Jack uses a racist slur.\n Jill and Karl call Jack on his racist slur.\n Steeeeve turns around and removes friendship from Jill and Karl, AND KEEPS friendship with Jack.\n \nSurely you understand that facebook friends are not always true friends. I'm just not seeing the big deal here.\n \n Even if he was addressing that comment it still isn't a big deal.\n \n \n \nUm. Okay.\n So what's your question again?\n You're asking me if it's racist in that example too?\n Well, look at your description...\n \"The military folks use all kinds of those racist slurs ...\"\n \n I think you just answered your own question.\nI'm asking if you think the use of that word in the military is acceptable. The punishment is irrelevant to my point. \n \n The point is, just like in the military, it is not a big deal as it is made out to be here. People make those kinds of comments and they are offensive to some people but it deserves almost no attention.\n \n \nYeah. Cause electing somebody to be the head of a nation-wide young republicans organization IS EXACTLY like some peon corporal saying \"coon\"...\nNot even. The corporal saying it is much worse. \n \n \nThe comparison is nonsensical. If McCain would pull something like this, there would be hades to pay.\n That reality doesn't mean that somebody LOWER than him also wouldn't have significant fallout as well.\nOk, so if your friend called someone a \"coon\" would you make a thread about it? Probably not because no one knows your friend and no one really cares. The same applies here. \"Young Republicans\" is a joke that no one cares about... in fact, I care more about telling people no one cares than actually caring about the young republicans :). Yeah, if George Allen decided to say something stupid like..oh I dunno...macaca...than yes it is worthy of note. \n \n Frankly it is embarrassing that this is even news. \n \n \n \nMoreover, I think you're failing to grasp something huge here.\n She pulled this junk, favoring a racist over her other friends who denounced racism, AND SHE GOT ELECTED ANYWAYS.\n That's pretty significant. Having a scandal like that break, and the young Republicans decide they don't care about such an obvious err in judgment, and elect her anyways...\nHer, sorry, I thought it was a he for some reason (shows you how little I care about the young republicans). Yeah, facebook friends not being cared about is no big deal. I never talk to a least half the facebook \"friends\" I have. Honestly, how many people have 500 close friends?\n \n I think it is time people stop trying to find a replacement bunching bag now that Bush is gone. Honestly, we have gone from Limbaugh all the way down to young republicans chairman. I'm not saying this is you Foundit66 but I've been hearing a lot of complaints about the not in power republicans destroying America when it is the democrats who are in power. Time to man up.", 
   {}, 
   360510, 
   null, 
   1247547660.0
  ], 
  [
   360523, 
   null, 
   "Steeeeve", 
   "This thread is a perfect example of the way som people from either 'side' will excuse one of their allies for nearly any transgression while blowing any perceived transgressions from the other 'side' out of all proportion. Sometimes I get very discouraged.\n\n \n I hope you don't imply from my responses that I am supporting the republicans. I'm of the opinion that this doesn't matter at all. \n \n \n You tell 'em CUNxTime!", 
   {}, 
   360521, 
   null, 
   1247547900.0
  ], 
  [
   360527, 
   null, 
   "foundit66", 
   "Surely you understand that facebook friends are not always true friends. I'm just not seeing the big deal here.\n\n emoticon_frazzled\n It has nothing to do with \"true friends\".\n \n You're on the street. You see a guy yelling out racial slurs.\n Two other people rebuke him.\n You take an action which couples you with the racial slur yeller, and distances yourself from the people rebuking the racism.\n \n The action that Shay took was to REJECT those rebuking racism. They were worthy of her \"friend\" status BEFORE rebuking racism. AFTER rebuking racism, they were rejected.\n Shay KEPT the racist as a \"friend\".\n \n \n \nEven if he was addressing that comment it still isn't a big deal.\n\n Others obviously don't agree.\n \n \n \nI'm asking if you think the use of that word in the military is acceptable. The punishment is irrelevant to my point.\n\n I think the use of the racist slur word is not acceptable in any professional environment. Military or civilian employment.\n \n \n \nThe point is, just like in the military, it is not a big deal as it is made out to be here.\n\n Based on what?\n A movie?\n \n \n \nPeople make those kinds of comments and they are offensive to some people but it deserves almost no attention.\n\n In your opinion...\n I guess I am understanding your acceptance of racial slurs now.\n Others are not so accepting.\n \n \n \nNot even. The corporal saying it is much worse.\n\n I have to ask...\n Why do you say that?\n \n \n \nOk, so if your friend called someone a \"coon\" would you make a thread about it?\n\n It has already been established that the person's relative importance to the organization is an important factor of the situation.\n She was elected the head of the Young Republicans. A nation-wide organization.\n \n With that reminder repeated, I would say \"no\" to answer your question.\n \n \n \nProbably not because no one knows your friend and no one really cares. The same applies here. \"Young Republicans\" is a joke that no one cares about...\n\n I always have to chuckle at how much time and energy some people will spend to insist that an issue is not important...\n \n Okay. I get that YOU think this is not important.\n Nation-wide Republican organization. Demonstrating racism.\n The racist is elected anyways.\n Again, I am now coming to appreciate your acceptance for racial slurs and racism.\n \n Here's a question. If you had two qualified Republican candidates in front of you, but one was known to support people who utilized racial slurs and distance himself from people who rebuked such actions, would it matter in picking between them?\n \n \n \nin fact, I care more about telling people no one cares than actually caring about the young republicans :). Yeah, if George Allen decided to say something stupid like..oh I dunno...macaca...than yes it is worthy of note.\n\n First of all, it's not JUST that she did it.\n Like I pointed out, if she were a Joe Schmoe off the street, I wouldn't care.\n \n It's the fact that she supported the racist actions, and then people elected her anyways.\n I feel like we're at a slight disjoint, where you look at it as in a major \"elected position\", and I am looking at the fact that people STILL ELECTED her despite the action.\n \n I don't know about you, but if I had to elect a head to a menial Home Owner's Association, I wouldn't elect the racist. I would want fair and non-racist leadership.\n Evidently, you seem to think if the position gets small enough, racism doesn't matter.\n I disagree. \n \n \n \nHer, sorry, I thought it was a he for some reason (shows you how little I care about the young republicans). Yeah, facebook friends not being cared about is no big deal. I never talk to a least half the facebook \"friends\" I have. Honestly, how many people have 500 close friends?\n\n I really think you're looking at this backwards, cause you're missing the big picture here and failing to recognize how your \"observation\" HURTS Shay.\n \n Suppose John is on the street. He sees somebody he doesn't know acting racist. John supports that racist person.\n Now suppose Mark is on the street. He sees a FRIEND acting racist. Mark supports his racist friend.\n \n I can understand MARK'S actions more readily cause Mark has an ACTUAL FRIEND, that he may be supporting in the face of racism.\n John on the other hand? John risks nothing by cutting off somebody he doesn't know from Facebook.\n There's nothing there to salvage. \n \n If Shay didn't know this racist at all, the fact that she SUPPORTED HIM ANYWAYS is really, really bad.\n \n \n \nI think it is time people stop trying to find a replacement bunching bag now that Bush is gone. Honestly, we have gone from Limbaugh all the way down to young republicans chairman. I'm not saying this is you Foundit66 but I've been hearing a lot of complaints about the not in power republicans destroying America when it is the democrats who are in power. Time to man up.\n\n I think it's time for people to start manning up to the reasons why Republicans lost power.\n Some people complain that the Republicans get a bad rap when it comes to gays and blacks.\n I think those \"some people\" fail to recognize how the Republicans have EARNED that bad rap.\n \n This isn't about a \"bunching bag\".\n This is about a sincere belief in opposing racism.\n Please don't denigrate that belief by treating it so callously.", 
   {}, 
   360522, 
   null, 
   1247549880.0
  ], 
  [
   360529, 
   null, 
   "foundit66", 
   "This thread is a perfect example of the way som people from either 'side' will excuse one of their allies for nearly any transgression while blowing any perceived transgressions from the other 'side' out of all proportion. Sometimes I get very discouraged.\n\n Just for my two cents, regarding my feedback?\n If Byrd were pulling this sort of junk today, I would happily say \"Get rid of the racist\".\n \n I recognize a man who has changed. The NAACP gave Byrd, who some people want to declare as a racist, a perfect score.\n If somebody could point to anything like that from Shay, I would happily consider it.\n \n My real point is that I am disturbed by how some people take racism so cavalierly. Steeeeve openly demonstrates he doesn't think it's a big deal. A majority of the \"Young Republicans\" group didn't think it was a big deal.\n And they represent the 18-40 year old Republican party.\n \n I honestly don't think the Democrats have any real parallel.\n I WILL say that I had my doubts about the motivation for some of the \"Clinton supporters for McCain\", and I do recognize racism as a problem still in this country.\n But I seriously see no parallel between what happened with Shay, and what continues with the Democrat party.", 
   {}, 
   360521, 
   null, 
   1247550120.0
  ], 
  [
   360532, 
   null, 
   "CUNxTime", 
   "There are a number of demographics under the Democrat banner who hate whites. There are Rednecks in the Rep. party who have minorities. Neither side is innocent at all. But my point was that I see the excuses that people make for those on their team all the time and I see outrageous attacks people make on the opposing side as well. I've not said any names form people on the forum but I've called out Glenn Beck and Al Gore for examples in the past. Maybe its because I'm not just on one side 'Right or Left' but have strong beliefs that come from different sides depending on the issue that I see this happening so clearly. Anyway, never mind...have at it!", 
   {}, 
   360529, 
   null, 
   1247551380.0
  ], 
  [
   360574, 
   null, 
   "Brigid", 
   "I think more to the point is that it is hard to understand how Byrd remained in the Senate all this time with HIS antics, until one considers that some are more apt to excuse past bigotry if they are in the same political party ....\n \n Michelle Malkin, a conservative writer, hit the nail on the head back in 2001 ...\n \"The ex-Klansman's admirers praise his historical knowledge, mastery of procedural rules, and outspokenness. They refer to the Senate's senior Democrat as the \"conscience of the Senate.\" They downplay his white-sheet-wearing days as a \"brief mistake\" -- as if joining the Klan were like knocking over a glass of water. Oopsy.\n \n This ex-Klansman wasn't just a passive member of the nation's most notorious hate group. According to news accounts and biographical information, Sen. Byrd was a \"Kleagle\" -- an official recruiter who signed up members for $10 a head.\"It's absolutely unfathomable that a man who was a member of the Klu Kux Klan would even be in the senate today. Ah, but Byrd says he's sorry--that makes it all better! So instead, let's get all bent out of shape over the racism of some newly elected leader of the \"young Republicans\" ....\n \n On another note, one figure uses the term \"white n*****\" and it's characterized by those in his party as not really being racist. Someone of much less importance uses the term \"coon\", and it's heavily condemned. The stark imbalance of reaction is striking. (I guess if Shay had said \"WHITE coon\" in the context of a discussion about race, it would suddenly be ok. emoticon_rolleyes )\n\n \n \"In the National Association for the Advancement of Colored People's (NAACP)[53] Congressional Report Card for the 108th Congress (spanning the 2003-2004 congressional session), Byrd was awarded with an approval rating of 100 percent for favoring the NAACP's position in all 33 bills presented to the United States Senate regarding issues of their concern. Only 16 other Senators of the same session matched this approval rating.\"\n \n emoticon_xbangheadxbanghead", 
   {
    "post_info": {
     "post_title": "Since Jyoshu seems intent on ignoring that it is not just his apologies:"
    }, 
    "unicode_changes_made": true
   }, 
   360485, 
   null, 
   1247585940.0
  ], 
  [
   360575, 
   null, 
   "Brigid", 
   "First, FOPIOI.\n \n Second, one of my whole reasons for the comparison is noting how EASILY some seem to forgive a person of their own party for things they will roundly condemn someone if in another party.\n \n This very thread is a PERFECT example. \n \n And since some hold Byrd's apologies as apparently all the basis they need to consider him a Senate-worthy ex Klansman, are we to assume that if Shay were to apologize for the statement made, suddenly there would be thorough forgiveness by Democrats? LOL\n \n Again, a lot of the issue is one of degree of influence. Election to the senate SHOULD require FAR, FAR more scrutiny than election to the \"young Republicans\". (which, like Steeeeve, is an organization I had never even heard of.) Yet Dems KEEP a man in the senate(!) all these years who took part in tremendous damage to the cause of black people, while being apparently eager to point fingers at the leader of the \"young Republicans.\"\n\n \n Ho-hum.....emoticon_xbangheadxbanghead\n \n \"In the National Association for the Advancement of Colored People's (NAACP)[53] Congressional Report Card for the 108th Congress (spanning the 2003-2004 congressional session), Byrd was awarded with an approval rating of 100 percent for favoring the NAACP's position in all 33 bills presented to the United States Senate regarding issues of their concern. Only 16 other Senators of the same session matched this approval rating. \"", 
   {
    "unicode_changes_made": true
   }, 
   360502, 
   null, 
   1247586000.0
  ], 
  [
   360598, 
   null, 
   "foundit66", 
   "First, FOPIOI.\n\n BLOWI.\n That ENTIRE commentary was completely topical. I was focusing on the issue.\n You just don't like it cause I mentioned one of your previous statements, so you want to ignore it.\n \n I'm sorry, but pointing out your hypocrisy is not FOPIOI, and I will not just ignore it because you say \"FOPIOI\".\n \n \n \nSecond, one of my whole reasons for the comparison is noting how EASILY some seem to forgive a person of their own party for things they will roundly condemn someone if in another party.\n\n And this is where you prove my statement WAS NOT FOPIOI.\n FOPIOI: \"Focusing On Posters Instead Of the Issues.\"\n And then you point to the ISSUE aspect of my response???\n That PROVES I was concentrating on the issue.\n \n But moving beyond that, Byrd HAS CHANGED.\n There is no evidence of Shay \"changing\".\n There is no evidence of Sanford \"changing\".\n In fact, their actions are CONSISTENT with hiding and protecting their violations.\n \n \n \nThis very thread is a PERFECT example. \n\n Against you and Republicans? Yes. I agree! emoticon_xgood\n \n \n \nAnd since some hold Byrd's apologies as apparently all the basis they need ...\n\n BLOWI, BLOWI, BLOWI.\n BLATANT Lie, or Jyoshu is perpetuating grotesque willful ignorance on something MULTIPLE people have told him...\n \n It's not just his apology. His words alone don't just proclaim change.\n It IS HIS ACTIONS. His VOTING record was given a 100% by the NAACP. emoticon_xgood\n \n That's pretty powerful right there.\n And without surprise, some people refuse to acknowledge it.\n \n \n \n...are we to assume that if Shay were to apologize for the statement made, suddenly there would be thorough forgiveness by Democrats?\n\n Admitting it is the first step, isn't it.\n Shay has refused to take that first step.\n I can't really speculate on the hypotheticals. When I Washington went had his homophobic outburst, he went into counseling.\n Actually DOING something like that, with Shay, would go a long way, like Byrd's voting record ACTIONS have done so for Byrd.\n \n \n \nAgain, a lot of the issue is one of degree of influence. Election to the senate SHOULD require FAR, FAR more scrutiny than election to the \"young Republicans\". (which, like Steeeeve, is an organization I had never even heard of.) Yet Dems KEEP a man in the senate(!)\n\n And we're back to square one again.\n Some people espouse forgiveness for their own politicians, but REFUSE TO ACKNOWLEDGE it for others.\n And when the partisan hypocrisy (real point #2 of this) blocks acknowledging that Byrd has ACTUALLY CHANGED (real point #1 of this), that's sad.\n \n Here's an honest question Jyoshu.\n WHY do you insist on \"forgiveness\" for Sanford, but refuse it for Byrd?\n One is a state governor.\n One is a state senator.\n \n \n \nall these years who took part in tremendous damage to the cause of black people, while being apparently eager to point fingers at the leader of the \"young Republicans.\"\n\n 100% voting record by the NAACP.\n Where's the forgiveness Jyoshu?", 
   {}, 
   360502, 
   null, 
   1247597040.0
  ], 
  [
   360636, 
   null, 
   "jyoshu", 
   "I'm not sure when it was agreed by society that the NAACP is the defacto standard on judging racism. It certainly doesn't help the credibility of their 100% 'review' of his voting record that Byrd filabustered the 1964 Civil Rights Act, so it's clear that the NAACP has an awfully selective .... er, \"forgiving\" (cough, cough) ... memory when it comes to this particular racist.", 
   {}, 
   359763, 
   null, 
   1247612160.0
  ], 
  [
   360639, 
   null, 
   "foundit66", 
   "I'm not sure when it was agreed by society that the NAACP is the defacto standard on judging racism.\n\n As compared to your solitary, partisan voice?\n They have mounds more credibility and aptitude and legitimacy on the subject...\n emoticon_xgood\n \n So maybe the response should be, \"I'm not sure when it was agreed by society that jyoshu is the defacto standard on judging racism.\"\n \n Maybe, instead of mocking the situation, you would do better to TRY TO EXPLAIN WHY the NAACP is supposedly wrong in their assessment?\n Oh wait. Silly me. That would involve addressing WHAT their assessment is based on, and you want to ignore that, don't you...\n \n \n \nIt certainly doesn't help the credibility of their 100% 'review' of his voting record that Byrd filabustered the 1964 Civil Rights Act, so it's clear that the NAACP has an awfully selective .... er, \"forgiving\" (cough, cough) ... memory when it comes to this particular racist.\n\n And again, I am amused at how you recognize the truth, but refuse to take it to heart.\n YES! The NAACP IS \"forgiving\" .\n YOU YOURSELF have called for \"forgiveness\" of Sanford, whose \"crimes\" were so much more recent and without real sign of remorse.\n \n So HOW can you ask for Sanford to be forgiven, criticizing those who recognize his lack of remorse and his ongoing callous disregard for his father/husbandly duties, yet something that happened forty years ago you scoff at the idea of forgiveness???\n \n The NAACP is compose of BLACK people whose Byrd's history has held back.\n They have moved on. I've even quoted examples of some of his black support.\n \n So as a white man Jyoshu, who the heck are you to offer condemnation???\n emoticon_xdonno", 
   {}, 
   360636, 
   null, 
   1247614260.0
  ], 
  [
   360649, 
   null, 
   "Bad Mojo", 
   "I'm not sure when it was agreed by society that the NAACP is the defacto standard on judging racism. It certainly doesn't help the credibility of their 100% 'review' of his voting record that Byrd filabustered the 1964 Civil Rights Act, so it's clear that the NAACP has an awfully selective .... er, \"forgiving\" (cough, cough) ... memory when it comes to this particular racist.\n\n \n Well, I have to agree with foundit. \n \n Joyshu, why don't you find a better source than the NAACP when it comes to kkk racism? And, why are you bringing up the 1964 Civil Rights Act? It's already been established that Robert Byrd was a racist back then and the NAACP rating has nothing to do with that vote, it's Robert Byrd's recent voting record where he received the highest rating possible. And for the record. If the Robert Byrd of the 1960s were sitting in the senate today I'd be offended regardless of party.\n \n Why don't you google around and find something better than just harping for the sake of protecting some snotty nosed little racist republican? Why not harp on George Wallace or Strom Thurmond? They were both democrats, of course one of them changed his ways and the other one didn't and became a republican.", 
   {}, 
   360636, 
   null, 
   1247618700.0
  ], 
  [
   361464, 
   null, 
   "jyoshu", 
   "Well, I have to agree with foundit. \n \n \n That's ok ... you're free to be wrong as well. :)\n \n \nJoyshu, why don't you find a better source than the NAACP when it comes to kkk racism? \n\n \n A \"better\" source? The phrase \"that's not saying much\" is so overwhelmingly pertinent here, what you're saying is practically moot.\n \n The NAACP is a political organization. The very FACT they let a DNC senator off the hook who filabusted the 1964 civil rights act and was a KKK member pretty much automatically calls their credibility into question.\n \n \nAnd, why are you bringing up the 1964 Civil Rights Act? It's already been established that Robert Byrd was a racist back then and the NAACP rating has nothing to do with that vote\n\n \n That's like someone putting out a statement on the 9/11 perpetrators, and making sure that their statement DOESN'T take into account the fact they perpetrated 9/11. The point is that it SHOULD.\n \n \nWhy don't you google around and find something better than just harping for the sake of protecting some snotty nosed little racist republican? Why not harp on George Wallace or Strom Thurmond? They were both democrats, of course one of them changed his ways and the other one didn't and became a republican.\n\n \n Because Democrats turn the other way when it comes to Byrd, that's why. He has a \"(D)\" by his name, so suddenly it's ok that he was in the KKK. If their 'forgiveness' went beyond the confines of those in their own party, this wouldn't be an issue.", 
   {}, 
   360649, 
   null, 
   1248153000.0
  ], 
  [
   361476, 
   null, 
   "foundit66", 
   "A \"better\" source? The phrase \"that's not saying much\" is so overwhelmingly pertinent here, what you're saying is practically moot.\n\n :xbanghead\n Talk about a COMPLETE non-response...\n :xbanghead\n Jyoshu, you have offered YOUR OPINION on the issue, focusing on things that happened DECADES ago, and one quote that happened years ago...\n That's it.\n \n \n \nThe NAACP is a political organization. The very FACT they let a DNC senator off the hook who filabusted the 1964 civil rights act and was a KKK member pretty much automatically calls their credibility into question.\n\n OVER 40 YEARS AGO!\n For the love of Pete! Sanford STILL HAS NOT RECONCILED with his wife, and you insist people should forgive him.\n But Byrd's actions were 40 years ago, and you refuse to let it go.\n \n Byrd HAS CHANGED sine then.\n \n The NAACP is obviously concerned with racism. It wouldn't blindly cater to a racist.\n The article we showed you stated ONLY A HANDFUL of congress-people got \"perfect scores\".\n If I need to translate that for you, that means there are DEMOCRATS WHO DID NOT get perfect scores...\n \n If you want to pretend that the NAACP is just giving Byrd a thumbs up because he's a democrat, then HOW do you explain Byrd's ACTUAL RECORD?\n HOW do you explain the ACTUAL REASONS for why they gave Byrd a perfect score???\n \n Oh wait! You have REFUSED TO ADDRESS THAT in favor of harping ad nausieum on who he was 40 years ago.\n Don't even TRY to bring up \"forgiveness\" ever again Jyoshu.\n You've proven yourself indelibly unable to recognize it when it doesn't suit your political agenda.\n \n \n \nThat's like someone putting out a statement on the 9/11 perpetrators, and making sure that their statement DOESN'T take into account the fact they perpetrated 9/11. The point is that it SHOULD.\n\n BLOWI.\n WE ARE NOT talking about making sure that it doesn't account for his history.\n We are talking about recognizing that HE HAS CHANGED from his history.\n \n For your counter-example, in 40 years if some person who supported 9/11 has changed to be an ACTIVE ELEMENT OF PEACE between the U.S. and all Islamists?\n I wouldn't want to ignore that change.\n \n What the heck is your problem with ACTUALLY FORGIVING Jyoshu, when forgiveness is obviously warranted?\n It wasn't you (a white man) who Byrd slighted.\n The NAACP has moved past his history.\n What's your problem?\n \n \n \nBecause Democrats turn the other way when it comes to Byrd, that's why. He has a \"(D)\" by his name, so suddenly it's ok that he was in the KKK.\n\n This has already been addressed so many times that your refusal to acknowledge it has lost any attempt at humor.\n If he were a KKK member today, we WOULD REFUSE TO ACCEPT him.\n \n And let's make it clear that this is CLEARLY UNLIKE what is happening with this Republican representative.\n The Republicans ALSO elected a white racist (Dereck Black) to a seat on the Palm Beach County Republican Executive Committee.\n So as a reminder, your whole rant on Byrd IS A DISTRACTION for what the Republicans DID TODAY here...\n \n With that said, NOBODY is saying \"it's ok\" cause he had a \"D\".\n The fact that it was NOT okay is part of the reason why \"forgiveness\" is needed in the first place.\n \n I thought you were a Christian who understood such concepts.\n If little Jimmy steals a quarter, that's wrong.\n He REPENTS and changes (like Byrd has done).\n Then he goes out and changes his ways, forgiven.\n \n Forgiveness doesn't mean that it was \"ok\" to steal the quarter.", 
   {}, 
   361464, 
   null, 
   1248155520.0
  ], 
  [
   361480, 
   null, 
   "Bad Mojo", 
   "Wow just wow!\n \n Jyoshu, its ok if you don't like byrd because he is a democrat and usually votes with his party. Its ok not to like him because he gave one of the most impassioned speeches against the iraq war where he begged the american people to pay attention to what we were getting ourselves into and his vote against that fiasco if you disagree with him. However to make some claim that robert byrd is the same today as he was 40 years ago is insane. The naacp isn't just providing cover for byrd because he is a dem, they have very specific criteria in how they rate congress. All of congress rated by very specific votes regarding race and/or civil rights. if you wanted to find anyone in the naacp who would praise byrd of the 1960s then I invite you to do so. If you are claiming that they are being biased in their rating system then prove it.", 
   {}, 
   361476, 
   null, 
   1248159660.0
  ], 
  [
   361481, 
   null, 
   "foundit66", 
   "if you wanted to find anyone in the naacp who would praise byrd of the 1960s then I invite you to do so. If you are claiming that they are being biased in their rating system then prove it.\n\n \n We both know he can't, and he won't even try to justify his claim of bias beyond the implication of an accusation...\n \n Back to the real world...\n \n \nByrd has since explicitly renounced his earlier views on racial segregation.[46][47] Byrd said that he regrets filibustering and voting against the Civil Rights Act of 1964[18] and would change it if he had the opportunity. He has stated that joining the KKK was \"the greatest mistake I ever made\".[46] Byrd has also said that his views changed dramatically after his teenage grandson was killed in a 1982 traffic accident, which put him in a deep emotional valley. \"The death of my grandson caused me to stop and think,\" said Byrd, adding he came to realize that black people love their children as much as he does his.[48]\n ....\n In June 2005, Byrd[54] proposed an additional $10 million in federal funding for the Martin Luther King memorial in Washington, D.C., remarking that \"With the passage of time, we have come to learn that his Dream was the American Dream, and few ever expressed it more eloquently.\"\n\n Robert Byrd: Biography from Answers.com\n \n I can't help but wonder if Jyoshu is even capable of admitting that Byrd has REALLY CHANGED...\n \n I think this thread is starting to lean towards a REAL QUESTION of whether or not Jyoshu understands the concept of forgiveness...\n ... and if he can supply ANY explanation as to why Byrd should not be forgiven, and his change acknowledged...", 
   {}, 
   361480, 
   null, 
   1248160440.0
  ], 
  [
   361483, 
   null, 
   "Bad Mojo", 
   "Very true, its obvious that jyoshus consideration of forgiveness revolves around that (d) after byrds name which oddly enough is his made up gripe with the naacp. \n \n Next thing you know jyoshu is going to claim that byrd is a communist because he voted to \"spread the wealth\" of our tax dollars to the mlk memorial. \n \n I was going to ask what jyoshu thinks of strom thurmond because he keeps ignoring the racist elements of the republican party. Or, I wonder what jyoshu thinks of justice rheinquest who was steeped in the racism that existed in the 60s. \n \n However jyoshu has succeeded in one area, we are no longer talking about the racism that is apparent in the college gop farm team.", 
   {}, 
   361481, 
   null, 
   1248161340.0
  ], 
  [
   361542, 
   null, 
   "jyoshu", 
   "he keeps ignoring the racist elements of the republican party. \n\n \n Such as? The only two examples you've given are not even in government anymore and for that matter not even alive anymore. (Thurmond and Rhenquist.)\n \n And not the leader of the \"Young Republicans\" please. I mean national-government level cases rather than some group many of us haven't heard about. Rather cases like ..... er, Senator Byrd. emoticon_xangel", 
   {}, 
   361483, 
   null, 
   1248199740.0
  ], 
  [
   361562, 
   null, 
   "Bad Mojo", 
   "Such as? The only two examples you've given are not even in government anymore and for that matter not even alive anymore. (Thurmond and Rhenquist.)\n \n And not the leader of the \"Young Republicans\" please. I mean national-government level cases rather than some group many of us haven't heard about. Rather cases like ..... er, Senator Byrd. emoticon_xangel\n\n \n We could go over Tom Coburn's statements at the Sotomayer hearing where he wanted to know why she didn't automatically vote on a specific ruling because another Peruto Rican voted differently.\n \n We could go with in the last two presidential elections republian operatives handing out flyers in black communities that if parking tickets aren't paid they can't vote and could be subject to arrest if they show up at a polling location.\n \n In Ohio and Florida black voters were unable to vote because the Republican party had scrubbed their name from voting lists because they were \"similar\" to names of felons.\n \n Senator Sessions told a fellow attourney that he was a traitor to his race for representing a black client.\n \n Rush Limbaugh told a black caller to his show to \"Take the bone out of your nose and call me back\". \n \n Trent Lott praised Strom Thurmond's racist dixie-crat presidential run.\n \n The republican party allowed David Duke to run for office in Louisiana. He could have run as an independent but instead represented the GOP.\n \n Pat Buchanan claimed just a couple of days ago that whites built this country and therefore deserved to sit on the supreme court. He failed to recognize who actually did much of the labor. Maybe this is more of a knock against cultural conservatives then the republican party.\n \n Then we have all that nativist #### going on among cultural conservatives. For example a couple of months ago Sheriff Joe Arpaio attened a protest that was taking place (against his immigration stance) and guess who showed up? Skin Heads and neo nazis. They were happily giving nazi salutes, stepping on the Mexican flag and seig heiling their little hearts out and Joe stopped by to talk with his supporters. One of his \"fans\" even managed to have his picture taken with \"America's toughest sherrif\".\n \n Link to the picture:\n \n http://media.phoenixnewtimes.com/neo-nazis-and-extreme-right-wingers-love-joe-arpaio-and-there-s-evidence-that-the-mcso-keeps-them-close.3374849.51.jpg\n \n This is just off the top of my head and all of it took place after 1980.\n \n But, that means nothing. As the Young Republicans (who are funded by the GOP) just elected someone who sees humor in calling African Americans..and I quote \"coons\". You remember? The reason this thread was started?", 
   {}, 
   361542, 
   null, 
   1248203400.0
  ], 
  [
   361645, 
   null, 
   "foundit66", 
   "Another few examples?\n \n Rush Limbaugh's \"Barack the Magic Negro\" song.\n And then Chip Saltsman, a candidate for the RNC national chair, distributes it as a stocking stuffer...\n \n University of Kentucky's student body president Nick Phelps (Mitch McConnell protege) forwarding racist e-mails.\n \n Then there were the McCain / Palin rally issues. Racism found a bizarre \"tolerance\" within these rallies. \n Examples like this one...\n http://i26.photobucket.com/albums/c114/foundit66/Protestor_Allowed.jpg\n They shouldn't have been allowed in the front door, but they were allowed in without problem.\n That, and there were various articles about vendors selling racist t-shirts and similar items.\n http://i26.photobucket.com/albums/c114/foundit66/ObamaButton0001.jpg\n \n George Allens' \"macaca\" nonsense.\n \n And then you have polls like this one.\n It demonstrates racism exists in both parties. That I have no doubt on.\n But ACROSS THE BOARD, Republicans are more likely to support NEGATIVE stereo-types of blacks by a margin of about 10 points. Republicans are less likely to support POSITIVE statements of blacks by a margin of about 10 points.\n Political Pulse | The Associated Press-Yahoo! News Poll on Yahoo! News", 
   {}, 
   361562, 
   null, 
   1248240600.0
  ], 
  [
   361687, 
   null, 
   "jyoshu", 
   "Well there you go ... most of these examples aren't part of government at all. I specifically asked for people in positions like senator Byrd, who is at a very high levels of government. THAT'S why he should be held to a much higher standard than just 'oh, he's apologetic, so we'll just pretend that he didn't wear white sheets and was basically a terrorist at one time.' emoticon_rolleyes", 
   {}, 
   361645, 
   null, 
   1248275760.0
  ], 
  [
   361693, 
   null, 
   "Bad Mojo", 
   "Oh please. Even by by your own attempts to limit what is considered racist in the republican party you get it wrong. Mccain, thurmond and lott are/were senators. The gop allowed an un apoligetic racist to run for statewide office in a large southern state. Pat buchanon has been an icon and worked inside the whitehouse. Joe arpaio is rhe sherrif of the 4th largest county in the country and is a lightening rod among the nativist community. Then we still have the largest republican organization outside of the gop itself that thinks \"coons\" is so lol worthy. Or heck, what about members of congress saying that keith ellison basically can't be trusted because he is a muslim? \n \n Let's also not forget that it was the gop who used the racist aouthern strategy to attain the whitehouse and by the very nature of gop support is the only way they can win the presidency. But, apparently you are worried about an old man who has renounced his past racism from 40 years ago and you can't get over it simply because he's a democrat.", 
   {}, 
   361687, 
   null, 
   1248281940.0
  ], 
  [
   361790, 
   null, 
   "foundit66", 
   "emoticon_wow\n \n He goes after one guy for actions forty years ago, and then ignores multiple Republican congressmen examples that are far more current.\n And then tosses out this incredible accusation of \"... (Byrd) was basically a terrorist at one time\" emoticon_wow\n \n Still no explanation as to why Byrd shouldn't be forgiven.\n I guess Jyoshu's silence basically confirms it. A Republican should be \"forgiven\", despite the obvious callous treatment of his marriage and no perceivable sign of trying to rectify the situation with the wife who he continually insulted by referring to his mistress (openly) as his \"soulmate\"...\n \n ... but a Democrat's actions from forty years ago, with ACTUAL SIGNS of real change? That he ignores and refuses to forgive.\n \n Jyoshu has no real defense for the fact that he wants to \"forgive\" based on political affiliation...", 
   {}, 
   361693, 
   null, 
   1248314400.0
  ], 
  [
   361806, 
   null, 
   "trebor", 
   "emoticon_wow\n \n He goes after one guy for actions forty years ago, and then ignores multiple Republican congressmen examples that are far more current.\n And then tosses out this incredible accusation of \"... (Byrd) was basically a terrorist at one time\" emoticon_wow\n \n Still no explanation as to why Byrd shouldn't be forgiven.\n I guess Jyoshu's silence basically confirms it. A Republican should be \"forgiven\", despite the obvious callous treatment of his marriage and no perceivable sign of trying to rectify the situation with the wife who he continually insulted by referring to his mistress (openly) as his \"soulmate\"...\n \n ... but a Democrat's actions from forty years ago, with ACTUAL SIGNS of real change? That he ignores and refuses to forgive.\n \n Jyoshu has no real defense for the fact that he wants to \"forgive\" based on political affiliation...\n\n \n \n Considering his comments about orthodox Jews wanting to stone people, I have to say he has to start looking in the mirror when it comes to racism.", 
   {}, 
   361790, 
   null, 
   1248318600.0
  ], 
  [
   361850, 
   null, 
   "jyoshu", 
   "emoticon_wow\n \n He goes after one guy for actions forty years ago, and then ignores multiple Republican congressmen examples that are far more current.\n And then tosses out this incredible accusation of \"... (Byrd) was basically a terrorist at one time\" emoticon_wow\n\n \n \"Goes after\"? Puhlease. I think you need to review the thread, Foundit. This very thread exists because you decided to 'go after' someone--a young leader of a group many of us have never even heard of called the \"Young Republicans\". Byrd was dare brought up as counter example to show the double standard on your part, and you all did the online-rhetorical equivalent of freaking out over it.\n \n And yes, being in the KKK is a form of terrorism. Surely you can bring yourself to at least agree on that that.\n \n The issue isn't ME not forgiving anyone here. It's the double standard you go by in offering such easy forgiveness toward a guy with FAR worse sins, and then you jump at the chance to condemn someone (anything BUT forgiveness) with an \"(R)\" by their name, who isn't even a particularly important Republican anyway. Forgiving Byrd is fine with me; it's you who are being so condemning in this thread. It's breathtaking how you're twisting what this thread is even about to begin with.", 
   {}, 
   361790, 
   null, 
   1248361980.0
  ], 
  [
   361895, 
   null, 
   "CUNxTime", 
   "The Pubs aren't the only ones with race problems. Lets look at some on the Dem side.\n \n \n Jesse Jackson: remember \"hymietown'?\n \n \n Cragg Hines: remember 'cracker'?\n \n Al Sharpton: lol take your pick...\n \n Representative Dick Gephardt, D-MO: spoke to white supremacists' organization\n \n Andrew Cuomo: dropped out of Gov. race because of racist comments.\n \n Lee P. Brown; tried to suppress Hispanic vote.\n \n Mary Frances Berry: reverse racist\n \n - Donna Brazile; openly anti-white\n \n Even Bill Clinton and Pelosi have made racist comments.\n \n There are also many racist groups that have found a happy home within the Dem. party. La Raza, Nation of Islam, The New Black Panther Party, etc. etc...\n \n But I'm actually not trying to go tit for tat on racism. Racism is BAD whether espoused by a righty or a lefty. I'd like to think that race is playing a smaller and smaller factor in the country. There have been problems on either 'side' but the point should be to move past race and build a society where people are judged by the content of their character.", 
   {}, 
   361850, 
   null, 
   1248378420.0
  ], 
  [
   361911, 
   null, 
   "foundit66", 
   "\"Goes after\"? Puhlease. I think you need to review the thread, Foundit. This very thread exists because you decided to 'go after' someone--a young leader of a group many of us have never even heard of called the \"Young Republicans\". Byrd was dare brought up as counter example to show the double standard on your part, and you all did the online-rhetorical equivalent of freaking out over it.\n\n FOPIOI.\n You are making what you imagine my reaction to the issue THE issue, instead of the topic itself.\n \n Somebody \"going after\" somebody was not the point.\n That was not the real point of my comment before.\n \n \n \nAnd yes, being in the KKK is a form of terrorism. Surely you can bring yourself to at least agree on that that.\n\n :xbanghead\n Talk about guilt by association...\n I challenge you to show anything Byrd ACTUALLY DID which should be considered as \"terrorism\".\n Until then, you're making an unbased claim.\n \n \n \nThe issue isn't ME not forgiving anyone here. It's the double standard you go by ...\n\n ROFLMAO!\n Translation?\n Jyoshu has ABSOLUTELY NO JUSTIFICATION for his hypocrisy, so he wants to insist that other people are the hypocrites...\n \n \n \n...in offering such easy forgiveness toward a guy with FAR worse sins, and then you jump at the chance to condemn someone (anything BUT forgiveness) with an \"(R)\" by their name, who isn't even a particularly important Republican anyway. Forgiving Byrd is fine with me; it's you who are being so condemning in this thread.\n\n We've been over this REPEATEDLY Jyoshu.\n You can be honest in ADDRESSING the issue...\n Or you can continue to ignore it and blindly repeat these inaccurate claims of yours.\n \n Byrd deserves forgiveness CAUSE HE HAS CHANGED AND EARNED forgiveness.\n Sanford deserves NO forgiveness, cause he shows no real remorse for his actions.\n The woman that was the original topic of this thread has shown NO real remorse. No explanation as to why she continues to befriend racists yet distances herself from people who condemn racism.\n \n I thought as a Christian YOU could understand a concept of forgiveness AFTER REPENTANCE.\n But alas. Your ideals of forgiveness are obviously drowned in political partisanship.\n \n HOW MANY TIMES have I explained this to you now? emoticon_rolleyes", 
   {}, 
   361850, 
   null, 
   1248383820.0
  ], 
  [
   361918, 
   null, 
   "jyoshu", 
   "FOPIOI.\n You are making what you imagine my reaction to the issue THE issue, instead of the topic itself.\n\n \n No, not \"FOPIOI.\" You need to review what that term means. \"Instead of issues.\" My point about what you're doing here does pertain to the issues, because your original post \"goes after\" someone (your phrase, not mine). \n \n \nSomebody \"going after\" somebody was not the point. That was not the real point of my comment before.\n\n \n If it's not the point, then you had no business using that rhetoric to begin with. YOU came up with that phrase here. Take it up with yourself. (shrug)\n \n \n:xbanghead\n Talk about guilt by association...\n I challenge you to show anything Byrd ACTUALLY DID which should be considered as \"terrorism\".\n Until then, you're making an unbased claim.\n\n \n Are you SERIOUS?\n \n Wow! Just ... wow.\n \n If someone is IN Al queda, they are generally considered a terrorist.\n \n In the same vein, if someone is in a group that is historically dedicated to the terror of a given race, it's pretty amazing that anyone wouldn't consider them having been a terrorist.\n \n And \"guilt by association\"?? Well yeeeaaah, he was a member of the KKK. I'd call that a pretty darn significant \"association.\"\n \n Frankly, I think you're pretty much in grasping-at-straws mode here. Call the spade and spade and stop trying to sugarcoat this.\n \n \nByrd deserves forgiveness CAUSE HE HAS CHANGED AND EARNED forgiveness.\n\n \n I know you think he deserves what you CALL \"forgiveness.\" \n \n Forgiveness and re-electing a senator year-after-year, even RIGHT AFTER being in the KKK are hardly the same thing.\n \n That's not \"forgiveness\"; that's stupidly FORGETTING.\n \n This idea of putting someone in one of the highest public offices there is out of FORGIVENESS for something as grievous as being in a terrorist orgainzation is just silly. \n \n If a person was a member of Al Queda, then gets out and says he's sorry, you'd vote for him as a SENATOR?\n \n How about someone trying to get into the FBI and law enforcement agencies? Should they just FORGIVE past things people have done instead of screening people, and just let people in such agencies REGARDLESS, all on the basis of someone saying they are sorry ('remorse')? Becaise they look at EVERYTHING. Yet you'd throw such caution to the wind for something FAR more important--the U.S. SENATE. \n \n Forgiveness doesn't REQUIRE voting in a way that pretends it didn't happen.\n And frankly, when someone is running for something like the SENATE, or the presidency, I don't think we SHOULD forget it.\n \n And frankly, this tactic of yours of trying to pit this against my Christianity doesn't work either, as protecting the public against a KKK member is more Christ-like. What you're talking about--taking remorse and them electing someone to nearly the highest office there is--is far LESS, because it's so dangerous to take that approach. \n \n \nThe woman that was the original topic of this thread has shown NO real remorse. No explanation as to why she continues to befriend racists yet distances herself from people who condemn racism.\n\n \n And she shouldn't be elected. \n \n But then neither should Byrd have been.\n \n Both SHOULD be forgiven.\n \n Doesn't mean I'd want either of them as a U.S. SENATOR. (What Byrd did--being in a racist terror organization--makes what she's done look like a cakewalk. It's like comparing a person who called a Jew a bad term to someone who's actually been a member in an anti-semitic organization.) What you're arguing for is like someone erasing a police record out of \"forgiveness.\"\n \n I also seriously wonder if you'd be so eager to vote someone into high office out of forgiveness if they had been in a virulently anti-gay hate organization, and then expressed remorse .... emoticon_xangel", 
   {}, 
   361911, 
   null, 
   1248388200.0
  ], 
  [
   361956, 
   null, 
   "foundit66", 
   "No, not \"FOPIOI.\" You need to review what that term means. \"Instead of issues.\" My point about what you're doing here does pertain to the issues, because your original post \"goes after\" someone (your phrase, not mine). \n\n 1) The phrase \"goes after\" was irrelevant to my point, but you've ignored the real point to fixate on that...\n My point was on the CHOICE of the target of fixation.\n \n 2) You MADE ME the issue, instead of \"racism\", which is the issue.\n Your imagination regarding me doing an \"online-rhetorical equivalent of freaking out\" is not an issue.\n There was no point to that besides MAKING ME (and what you imagined my response to be) as a point of discussion.\n \n \n \nIf it's not the point, then you had no business using that rhetoric to begin with. YOU came up with that phrase here. Take it up with yourself. (shrug)\n\n emoticon_xdonno\n Jyoshu, if I say \"John drove the red car to the brothel\", and you fixate on the meaning of him having a red car, you are obviously missing the point.\n The phrase I used was irrelevant to the point I was making.\n You refuse to accurately address my point, and instead start quibbling over which verb is used... emoticon_cry\n \n \n \nAre you SERIOUS?\n Wow! Just ... wow.\n\n Yes. I am serious.\n Unless he ACTUALLY DID something that is worthy of being classified as a \"terrorist\", then you have no business slandering this person by \"considering\" him as a terrorist.\n \n Again, I can't help but think there is a glaring lack of actually utilizing some of those Christian concepts that some Christians are so fond of...\n If I were to say \"Jack is a homosexual\", some Christians would say that isn't a sin. The sin is to commit homosexual acts.\n But here, you \"consider\" Byrd as a terrorist for simply being in the KKK. emoticon_wow\n \n \n \nIn the same vein, if someone is in a group that is historically dedicated to the terror of a given race, it's pretty amazing that anyone wouldn't consider them having been a terrorist.\n\n Byrd has stated that he did so to improve his political position.\n I think that's an incredibly < insert expletive here < idea, but that doesn't make him a terrorist.\n \n \n \nAnd \"guilt by association\"?? Well yeeeaaah, he was a member of the KKK. I'd call that a pretty darn significant \"association.\"\n\n Way to ignore the FALLACY of \"guilt by association\" by emphatically insisting that you don't like the association...\n \n \n \nFrankly, I think you're pretty much in grasping-at-straws mode here. Call the spade and spade and stop trying to sugarcoat this.\n\n I'll happily refer to his history as racist. His ACTUAL actions were racist.\n \"Terrorist\"??? Feh.\n You can't even make that stick to any rational degree that would cause you to exclude the qualifier \"considered as\" from your assessment...\n \n \n \nI know you think he deserves what you CALL \"forgiveness.\" \n Forgiveness and re-electing a senator year-after-year, even RIGHT AFTER being in the KKK are hardly the same thing.\n\n Why don't you get it?\n If he acted as he did in the 1960's, TODAY, then yeah. I would say \"toss him out\".\n But HE HAS CHANGED with the times.\n \n \n \nThat's not \"forgiveness\"; that's stupidly FORGETTING.\n\n Electing him in the 1960's? Of course that's not \"forgiveness\".\n But can you FOR ONCE address the actual issue and talk about electing him TODAY and whether or not that involves \"forgiveness\" or \"forgetting\"?\n Which is more accurate?\n \n The man has remorse for his past, and IS MAKING AMENDS.\n Forgiveness is the accurate term.\n \n That term would obviously NOT be applicable to his history as he was STILL PERPETUATING the racism.\n But we're living in TODAY...\n \n \n \nThis idea of putting someone in one of the highest public offices there is out of FORGIVENESS for something as grievous as being in a terrorist orgainzation is just silly. \n\n CLAFCLOW.\n I never said anything like that.\n His CURRENT actions, like the CURRENT actions previously discussed SUPPORTING racial equality, make him CURRENTLY viable for the position.\n \n \n \nIf a person was a member of Al Queda, then gets out and says he's sorry, you'd vote for him as a SENATOR?\n\n Depends upon the history.\n If he had performed no terrorist actions, that would be one significant thing.\n \n \n \nHow about someone trying to get into the FBI and law enforcement agencies?\n\n You are firmly moving off into completely different territory.\n FBI and law enforcement are required to give testimony. In a position to perform racial profiling.\n A Senator, while more powerful, is also more public with his votes open to public scrutiny.\n \n \n \nShould they just FORGIVE past things people have done instead of screening people, and just let people in such agencies REGARDLESS, all on the basis of someone saying they are sorry ('remorse')? Becaise they look at EVERYTHING. Yet you'd throw such caution to the wind for something FAR more important--the U.S. SENATE. \n\n I don't recall anything in your Christian bible that puts conditions on forgiveness...\n I guess you just don't believe in it that much, eh? \n \n \n \nForgiveness doesn't REQUIRE voting in a way that pretends it didn't happen.\n\n Forgiveness means the slate is wiped clean.\n Like it didn't happen.\n It doesn't allow for holding a grudge.\n If a man says he forgives his girl-friend for an affair, but refuses to consider marrying her because of that affair, has he forgiven her?\n \n \n \nAnd frankly, when someone is running for something like the SENATE, or the presidency, I don't think we SHOULD forget it.\n\n Nobody here has talked about forgetting it.\n Remembering something doesn't automatically mean the person is excluded.\n \n \n \nAnd frankly, this tactic of yours of trying to pit this against my Christianity doesn't work either, as protecting the public against a KKK member is more Christ-like.\n\n :xbanghead\n HE IS NOT A KKK MEMBER.\n You are NOT PROTECTING the public against anything.\n His sins are in the past.\n \n But on another level, it's amusing how you abuse the religion to REFUSE forgiveness to a man, and pretend it's \"christian\"...\n \n \n \nWhat you're talking about--taking remorse and them electing someone to nearly the highest office there is--is far LESS, because it's so dangerous to take that approach. \n\n :xbanghead\n He should be elected based on what he CURRENTLY endorses.\n \n \n \nAnd she shouldn't be elected. \n\n OMG!\n You finally said something topical to the actual example of the thread!\n \n \n \nBut then neither should Byrd have been.\n\n I agree that the 1960's Byrd should not have been elected.\n The Byrd today is worthy of being elected.\n \n Your idea of \"forgiveness\" allows somebody to \"claim\" forgiveness, but a grudge is still held.\n Imagine if your God did that to you...\n \n \n \nDoesn't mean I'd want either of them as a U.S. SENATOR. (What Byrd did--being in a racist terror organization--makes what she's done look like a cakewalk. It's like comparing a person who called a Jew a bad term to someone who's actually been a member in an anti-semitic organization.) What you're arguing for is like someone erasing a police record out of \"forgiveness.\"\n\n And the actual actions you are discussing happened how many decades ago???\n :xbanghead\n \n The man HAS CHANGED.\n You don't even try to refute that.\n Yet you talk as if continuing to treat him as what he previously was is somehow in keeping with \"forgiveness\"...\n :xbanghead\n \n \n \nI also seriously wonder if you'd be so eager to vote someone into high office out of forgiveness if they had been in a virulently anti-gay hate organization, and then expressed remorse .... emoticon_xangel\n\n Again, depends upon the circumstances.\n If they were just a part of the organization, and then SHOWED HONEST REMORSE AND CHANGE, I would support them.", 
   {}, 
   361918, 
   null, 
   1248403800.0
  ], 
  [
   363916, 
   null, 
   "keyztone", 
   "And now we have the latest form of disguised racism.\n \n It's called THE BIRTHERS.", 
   {}, 
   359763, 
   null, 
   1249428360.0
  ], 
  [
   363956, 
   null, 
   "CUNxTime", 
   "And now we have the latest form of disguised racism.\n \n It's called THE BIRTHERS.\n\n \n I personally think the birthers are completely barking up the wrong tree. However, just because someone doesn't support your guy or agree with you doesn't mean its cause they're racist. It's just kinda ignorant.", 
   {}, 
   363916, 
   null, 
   1249441020.0
  ], 
  [
   364462, 
   null, 
   "jyoshu", 
   "1) The phrase \"goes after\" was irrelevant to my point\n\n \n YOU used it. If it was irrelevant to your point, why did you use an irrelevant phrase?\n \n \nYes. I am serious.\n Unless he ACTUALLY DID something that is worthy of being classified as a \"terrorist\", then you have no business slandering this person by \"considering\" him as a terrorist.\n\n \n I think you're pretty out of the mainstream on the idea that someone in a terrorist organization isn't necessarily a terrorist. That's what your stance there amounts to. \n \n \nAgain, I can't help but think there is a glaring lack of actually utilizing some of those Christian concepts that some Christians are so fond of...\n If I were to say \"Jack is a homosexual\", some Christians would say that isn't a sin. The sin is to commit homosexual acts.\n But here, you \"consider\" Byrd as a terrorist for simply being in the KKK. emoticon_wow\n\n \n Sorry, but by joining a terrorist organization (and recruiting, as in Byrd's case) one is aiding and abetting that organization. Just 'cause someone doesn't personally light the fire doesn't mean supporting an arsonist isn't wrong.\n \n \nWay to ignore the FALLACY of \"guilt by association\" by emphatically insisting that you don't like the association...\n\n \n the association is, ITSELF, a damning one. That's what you don't seem to get.\n \n \nWhy don't you get it?\n If he acted as he did in the 1960's, TODAY, then yeah. I would say \"toss him out\".\n But HE HAS CHANGED with the times.\n\n \n WHERE have I said he should be \"tossed out\"??? I'm not SAYING he should be \"tossed out.\" I'm pointing out a double standard here. People like yourself give someone like this a pass when he has a \"(D)\" by his name, but if it came to light that someone with an \"(R)\" by his name was in the KKK at one time, you'd be likely screaming for his head, politically speaking. \n \n It's the same way they give Ted Kennedy a pass for Chappaquiddick but will go after a Republican anytime they can.\n \n \nElecting him in the 1960's? Of course that's not \"forgiveness\".\n But can you FOR ONCE address the actual issue and talk about electing him TODAY and whether or not that involves \"forgiveness\" or \"forgetting\"?\n Which is more accurate?\n\n \n And I'd LOVE to know how long it takes for your 'statute of limitations' to run out for such things as this. But I know you won't specifically say.\n \n \nYou are firmly moving off into completely different territory.FBI and law enforcement are required to give testimony. In a position to perform racial profiling.\n A Senator, while more powerful, is also more public with his votes open to public scrutiny.\n\n \n No, not different territory, in any way that supports your distinction. A senator should be held to TIGHTER standards than the example I gave, not more lax.\n \n \nI don't recall anything in your Christian bible that puts conditions on forgiveness...\n I guess you just don't believe in it that much, eh?\n\n \n Even if you weren't holding to a party-line standard on this, forgiveness doesn't require one to be re-elected anyway. You're conflating issues here. The issue has never been whether someone should be \"forgiven\" or not. Of course he should be forgiven--that doesn't mean we have to elect the man to be a senator. I don't think Jesus meant for forgiveness to also be an exercise in stupidity in OTHER ways. \n \n \nYour idea of \"forgiveness\" allows somebody to \"claim\" forgiveness, but a grudge is still held.\n Imagine if your God did that to you...\n\n \n Nah, your point would mean something if you applied forgiveness beyond your political party affiliation. That's my point.", 
   {}, 
   361956, 
   null, 
   1249677300.0
  ], 
  [
   364500, 
   null, 
   "foundit66", 
   "YOU used it. If it was irrelevant to your point, why did you use an irrelevant phrase?\n\n Is this so difficult a concept to understand?\n Or is it more an issue that while you complain about the two words \"goes after\", you are avoiding DOZENS of more poignant questions to the topic...\n \n My point is that I could use a variety of synonyms on the issue, and your menial complaint is gone...\n \n \n \nI think you're pretty out of the mainstream on the idea that someone in a terrorist organization isn't necessarily a terrorist. That's what your stance there amounts to. \n\n I think you're pretty out of the mainstream on the allegation against Byrd, trying to smear him in this way.\n He has support FROM BLACKS, who he would have supposedly \"terrorized\" in your allegation of him having been \"basically a terrorist\"...\n \n Quite frankly, I think your position is more out of mainstream than mine.\n Mine is built on a recognition of a \"fallacy of guilt by association\".\n \n \n \nSorry, but by joining a terrorist organization (and recruiting, as in Byrd's case) one is aiding and abetting that organization. Just 'cause someone doesn't personally light the fire doesn't mean supporting an arsonist isn't wrong.\n\n And how does he \"support\" that arsonist?\n If a guy sells a burger to an arsonist, is that \"support\" for that arsonist?\n \n You throw out a pretty serious accusation of \"one is aiding and abetting\", that could NEVER be legitimized in a court of law.\n Like a lot of your accusations...\n Too much on talk.\n Not enough on legitimacy.\n \n \n \nthe association is, ITSELF, a damning one. That's what you don't seem to get.\n\n BLOWI\n I have repeatedly stated that if he were pulling the antics that he was pulling then, in today's world, I would not vote for him.\n \n It isn't that I don't recognize condemnation in the active, willful association.\n The point (that you are glibly bypassing) is that that occurred DECADES ago.\n The man has undergone HEARTFELT change, with serious remorse, which you don't even try to refute.\n \n \n \nWHERE have I said he should be \"tossed out\"???\n\n CLAFCLOW.\n I never said you said that.\n \n \n \nI'm not SAYING he should be \"tossed out.\" I'm pointing out a double standard here. People like yourself give someone like this a pass when he has a \"(D)\" by his name, but if it came to light that someone with an \"(R)\" by his name was in the KKK at one time, you'd be likely screaming for his head, politically speaking.\n\n And your assessment is a false one.\n It is really amazing how people can try to make an argument out of a pretense that you could predict my actions based on what YOU IMAGINE I would do if one factor was changed.\n \n I have already pointed out a SERIOUSLY significant factors in this case that obviously impact black people, WHO WOULD HAVE BEEN A VICTIM of your allegations.\n Time, and change.\n THAT is what makes Byrd different.\n Not the \"(D)\" behind his name.\n \n \n \nIt's the same way they give Ted Kennedy a pass for Chappaquiddick but will go after a Republican anytime they can.\n\n And now you have moved on from an accusation of what I would supposedly do, to what others do.\n Moving ever steadily off topic... emoticon_frazzled\n \n I give Kennedy no pass for that. None at all...\n \n \n \nAnd I'd LOVE to know how long it takes for your 'statute of limitations' to run out for such things as this. But I know you won't specifically say.\n\n Your funny.\n You just got finished complaining based on a BLATANTLY FALSE pretense that I was assigning a phrase to you, when the truth is that it was something I WAS SAYING and never intimidated it had any association to you...\n \n And here you pull something similar, except your association attempts to claim it is \"my 'statute of limitations'\"...\n emoticon_xdonno\n \n I never claimed I had such a statute of limitations.\n But to address the generic issue (without your false associations), each situation would have to be judged on each circumstances.\n If a man used to burn crosses in the front-yards of blacks, and buy the nooses, and his follow-on was to leave the KKK with no further perceived action, ...\n ... that would be completely different from ...\n ... Byrd, who used the KKK as a political starting point, and then SHOWS HEART-FELT REMORSE AND CHANGE, by repeatedly allying himself to black causes to the extent that the NAACP gives him a PERFECT score.\n \n The latter being a case where the man SHOWS his heart-felt change, and PROVES it.\n Isn't remorse part of the requirements for Christian dogma \"forgiveness\"???\n I am amazed I have to lecture you, who claim yourself a Christian, on this.\n \n \n \nYou are firmly moving off into completely different territory.FBI and law enforcement are required to give testimony. In a position to perform racial profiling.\n A Senator, while more powerful, is also more public with his votes open to public scrutiny.\n\n \nNo, not different territory, in any way that supports your distinction. A senator should be held to TIGHTER standards than the example I gave, not more lax.\n\n I give reasons why the standard should be different than your claim.\n You give no real response, other than to insist that your way should be followed.\n \n Perhaps I should refute your comment by simply saying....\n Yes. Yes, different territory, in significant ways (that I already pointed out) that supports my distinction. A senator should be held to (AND ACTUALLY IS HELD TO) looser standards than the example you gave, not more stringent.\n \n \n \nEven if you weren't holding to a party-line standard on this, forgiveness doesn't require one to be re-elected anyway.\n\n BLOWI.\n I am not holding to a party-line standard on this.\n The distinctions have been explained.\n \n This approach of yours is amusingly similar to the whole \"But the anti-gay Christians hate gays\" issue.\n You respond insisting that it's not necessarily hate.\n But here, you refuse to recognize that it is NOT a \"party-line standard\"...\n \n \n \nYou're conflating issues here. The issue has never been whether someone should be \"forgiven\" or not.\n\n Man. You are HILARIOUS.\n YOUR position on this issue \"has never been\" including on forgiveness. \n But then again, I would love to see you give a definition of \"forgiveness\" that YOU YOURSELF can use in this situation (with Byrd), that would be uniformly applied to you by your God...\n But we both know you'll never address that about your personal beliefs.\n \n \n \nOf course he should be forgiven--that doesn't mean we have to elect the man to be a senator. I don't think Jesus meant for forgiveness to also be an exercise in stupidity in OTHER ways. \n\n \"we have to elect the man to be a senator\"???\n No. Forgiveness shows that he is ELIGIBLE to be elected, and he should be elected based on his CURRENT merits.\n \n In Christian theology, isn't it an issue that God WIPES YOUR SLATE CLEAN if forgiven?\n Or is it more an issue that God says you're forgiven, but he still won't let you do certain things cause of your past actions...\n \n \n \nNah, your point would mean something if you applied forgiveness beyond your political party affiliation. That's my point.\n\n And that's your false allegation pretense that you can read my mind.\n You can't.\n This doesn't have to do with political party affiliation.\n But that won't stop you from making that false and thoroughly baseless allegation, will it... emoticon_xdonno", 
   {}, 
   364462, 
   null, 
   1249688460.0
  ], 
  [
   364619, 
   null, 
   "Steamroller", 
   "emoticon_wow\n I really don't know whether to be shocked and disgusted, or just disgusted (without shock).\n After that racist display, the group STILL ELECTED her...\n\n \n Foundit, I agree that racisim should not be accepted in any party.\n \n OK, you can get up from the floor now.emoticon_rolleyes\n \n Did you hear the flap about a whitehouse spokesperson blogging that any one hearing false accusations about healthcare reform should send the information to flag@whitehouse.gov ??\n \n I don't think it was exactly the attempt the right made it out to be, accusing the administration of creating an enemies list, however it merits a watchful eye.\n \n So too does this young woman who wishes to represent other people. Do you truly believe from this event that she is racist, or was she just placating one... I suppose it doesn't make a difference does it.", 
   {}, 
   360374, 
   null, 
   1249774080.0
  ], 
  [
   364644, 
   null, 
   "jyoshu", 
   "Foundit, I agree that racisim should not be accepted in any party.\n\n \n Of course you do. Everyone here feels that way. \n The thread is an exercise in the obvious--based on Foundit's history, you can bet the main reason he posted it was because it was something negative that had to do with the GOP. If it had been a DNC group that had been racist, there's not a chance he would have posted the article.", 
   {}, 
   364619, 
   null, 
   1249786560.0
  ], 
  [
   364657, 
   null, 
   "foundit66", 
   "Of course you do. Everyone here feels that way.\n The thread is an exercise in the obvious--based on Foundit's history you can bet the main reason he posted it was because it was something negative that had to do with the GOP. If it had been a DNC group that had been racist, there's not a chance he would have posted the article.\n\n Ahhh gee Jyoshu...\n What's that phrase you were using when somebody makes an issue out of a POSTER and not the issue?\n PFOPIOI or something?\n Cause I think you need to apply it to yourself. AGAIN... emoticon_xangel\n \n You want to make this about me, but it's not.\n Racism is much more welcome in the Republican party than the Democrat party.\n And to try to reach for a counter-example, you have to reach back DECADES for it...", 
   {}, 
   364644, 
   null, 
   1249792860.0
  ], 
  [
   364658, 
   null, 
   "Symbiote", 
   "Ahhh gee Jyoshu...\n [I][B][COLOR=&quot;Red&quot;]Racism is much more welcome in the Republican party than the Democrat party...\n\n \n I'm not sure that's true, see Simone's regular denounciations of \"whitey\", they seem to fit right in with the D party line at the moment. At least republican racism sneaks in the back door, many democrats are loud and proud about it right now.", 
   {}, 
   364657, 
   null, 
   1249793100.0
  ], 
  [
   364663, 
   null, 
   "foundit66", 
   "I'm not sure that's true, see Simone's regular denounciations of \"whitey\", they seem to fit right in with the D party line at the moment. At least republican racism sneaks in the back door, many democrats are loud and proud about it right now.\n\n Even if I accept your assessment at face value, TMK Simone's not in an elected position...\n emoticon_rolleyes\n \n Plus, I didn't say there is absolutely no racism amongst Democrats.\n I said: \"Racism is much more welcome in the Republican party than the Democrat party.\"", 
   {}, 
   364658, 
   null, 
   1249793700.0
  ], 
  [
   364679, 
   null, 
   "Symbiote", 
   "I said: \"Racism is much more welcome in the Republican party than the Democrat party.\"\n\n \n Oh in that case then.\n \n I'm not sure that's true, see Simone's regular denounciations of \"whitey\", they seem to fit right in with the D party line at the moment. At least republican racism sneaks in the back door, many democrats are loud and proud about it right now.", 
   {}, 
   364663, 
   null, 
   1249799820.0
  ], 
  [
   364681, 
   null, 
   "foundit66", 
   "Oh in that case then.\n I'm not sure that's true, see Simone's regular denounciations of \"whitey\", they seem to fit right in with the D party line at the moment. At least republican racism sneaks in the back door, many democrats are loud and proud about it right now.\n\n Wow. That's funny.\n You point to ONE PERSON and then make sweeping allegations about the whole party...\n \n First, let's address your absurd \"republican racism sneaks in the back door\" comment...\n Cause the truth is that it walks in the front door, and nobody cares...\n \n Rush Limbaugh's \"Barack the Magic Negro\" song.\n And then Chip Saltsman, a candidate for the RNC national chair, distributes it as a stocking stuffer...\n \n University of Kentucky's student body president Nick Phelps (Mitch McConnell protege) forwarding racist e-mails.\n \n Then there were the McCain / Palin rally issues. Racism found a bizarre \"tolerance\" within these rallies. \n Examples like this one...\n http://i26.photobucket.com/albums/c114/foundit66/Protestor_Allowed.jpg\n They shouldn't have been allowed in the front door, but they were allowed in without problem.\n That, and there were various articles about vendors selling racist t-shirts and similar items.\n http://i26.photobucket.com/albums/c114/foundit66/ObamaButton0001.jpg\n \n And then there is Derek Black in Florida. Republicans elected this white supremacist to a party position.\n George Allens' \"macaca\" nonsense.\n \n \n And for the issue in general, you have polls like this one.\n It demonstrates racism exists in both parties. That I have no doubt on.\n But ACROSS THE BOARD, Republicans are more likely to support NEGATIVE stereo-types of blacks by a margin of about 10 points. Republicans are less likely to support POSITIVE statements of blacks by a margin of about 10 points.\n Political Pulse | The Associated Press-Yahoo! News Poll on Yahoo! News", 
   {}, 
   364679, 
   null, 
   1249805820.0
  ], 
  [
   364683, 
   null, 
   "Symbiote", 
   "It demonstrates racism exists in both parties. That I have no doubt on.\n But ACROSS THE BOARD, Republicans are more likely to support NEGATIVE stereo-types of blacks by a margin of about 10 points. \n\n \n Seeing only racism towards blacks as important is racist in itself foundit. You see how latent racism permeates everything you say, even when you think you are being PC?", 
   {}, 
   364681, 
   null, 
   1249809000.0
  ], 
  [
   364684, 
   null, 
   "foundit66", 
   "Seeing only racism towards blacks as important is racist in itself foundit. You see how latent racism permeates everything you say, even when you think you are being PC?\n\n Who the heck said I only see racism towards blacks as important?\n Oh wait. That's another strawman you're making.\n \n And no. I don't \"see how latent racism permeates everything you say\".\n Please quote me and give examples, although I suspect they'll be more pathetic strawmen like your first comment here... emoticon_rolleyes", 
   {}, 
   364683, 
   null, 
   1249815840.0
  ], 
  [
   364692, 
   null, 
   "Symbiote", 
   "Not realising your comments will be construed as racist is one sure sign of a racist, just as nutjobs don't ever question their sanity.", 
   {}, 
   364684, 
   null, 
   1249820640.0
  ], 
  [
   364749, 
   null, 
   "foundit66", 
   "Please quote me and give examples, although I suspect they'll be more pathetic strawmen like your first comment here...\n\n \nNot realising your comments will be construed as racist is one sure sign of a racist, just as nutjobs don't ever question their sanity.\n\n That logic is sorely lacking.\n So either I realize my comments are racist, ...\n ... or automatically they are racist because I don't see them as racist?\n :xbanghead\n \n And for the record, \"nutjobs\" often do question their own sanity.\n There are plenty of people who seek therapists and commit themselves to psychiatric institutions for help.\n \n And beyond that?\n Not questioning your sanity doesn't make a person a nutjob.\n I could say \"cats afraid of the water never swim\", but if John doesn't swim, does that automatically make him a cat?\n \n You have obviously failed to show where I am supposedly racist, and are employing pathetically poor catch phrases to try to substantiate your false allegations ...\n \n Is your intent to try to obfuscate this thread with meaningless babble?", 
   {}, 
   364692, 
   null, 
   1249851420.0
  ], 
  [
   364763, 
   null, 
   "simone", 
   "Oh in that case then.\n \n I'm not sure that's true, see Simone's regular denounciations of \"whitey\", they seem to fit right in with the D party line at the moment. At least republican racism sneaks in the back door, many democrats are loud and proud about it right now.\n\n But I don't have a national platform comparable to the deplorably racist and sexist Rush Limbaugh and Glenn Beck and the numerous other who spew nasty garbage over the public airwaves that we are all supposed to own, but a toxic few have an absolute monopoly on what is broadcast.\n \n They have the regrettable freedom to spew their racist and sexist toxins upon millions of unsuspecting Americans, whereas I am only one voice and a small one, and you seem rather set upon shutting even me down.\n \n Are no voices of dissent allowed in America?", 
   {}, 
   364679, 
   null, 
   1249854480.0
  ], 
  [
   364799, 
   null, 
   "Symbiote", 
   "\n They have the regrettable freedom to spew their racist and sexist toxins upon millions of unsuspecting Americans\n\n \n That's because some people find their racism and sexism entertaining, whereas yours and foundits are simply boring.", 
   {}, 
   364763, 
   null, 
   1249863960.0
  ], 
  [
   364800, 
   null, 
   "foundit66", 
   "That's because some people find their racism and sexism entertaining, whereas yours and foundits are simply boring.\n\n Republicans find racism and sexism entertaining...\n Is that really what you are saying?\n That's quite the condemnation of some Republicans...\n \n I have yet to see any documentation of what you claim is my racism.\n The only thing you have mentioned for Simone is a \"whitey\" word usage...\n \n All you are doing is throwing out personal attacks, while ignoring the bigger issue...", 
   {}, 
   364799, 
   null, 
   1249864440.0
  ], 
  [
   364804, 
   null, 
   "simone", 
   "That's because some people find their racism and sexism entertaining, whereas yours and foundits are simply boring.\n\n Do you truly find racism and sexism \"entertaining\"?", 
   {}, 
   364799, 
   null, 
   1249868640.0
  ], 
  [
   364805, 
   null, 
   "Symbiote", 
   "Have you stopped beating your daughter?\n \n And foundit, I am only pointing out your hypocrisy in conveying racism yourself while complaining about racism.\n \n Although we shouldn't be surprised; just as many homophobes are latent homosexuals, many who complain loudly and vociferously about racism are simply projecting their own prejudices and fears onto others.", 
   {}, 
   364804, 
   null, 
   1249868940.0
  ], 
  [
   364809, 
   null, 
   "foundit66", 
   "Have you stopped beating your daughter?\n\n emoticon_rolleyes\n YOU were the one making the comment about people finding racism entertaining...\n ... AFTER Simone had commented on Rush Limbaugh and Glenn Beck being racist / sexist...\n \n We can't help it if you said something dumb, and later regretted it...\n \n \n \nAnd foundit, I am only pointing out your hypocrisy in conveying racism yourself while complaining about racism.\n\n You have \"pointed out\" nothing cause you still have shown NO WAY in which I am \"conveying racism\".\n My challenge still stands.\n QUOTE ME where I supposedly showed racism...\n \n Otherwise, you repeating your claim is just lame after you refuse to substantiate your claim.\n \n \n \nAlthough we shouldn't be surprised; just as many homophobes are latent homosexuals, many who complain loudly and vociferously about racism are simply projecting their own prejudices and fears onto others.\n\n emoticon_rolleyes\n Again, glaring logic errors...\n While some homophobes are latent homosexuals, obviously not all are...\n \n You keep trying to run in circles, avoiding the fact that you can't provide any single example of my supposed racism... emoticon_xbye", 
   {}, 
   364805, 
   null, 
   1249871460.0
  ], 
  [
   364811, 
   null, 
   "Symbiote", 
   "Short of employing a brain scanning device, there's no way to \"prove\" you are truly thinking racist thoughts, in the same way there's no way to \"prove\" a republican senator bent over in a public restroom is gay.\n \n But in both cases there is an overwhelming amount of circumstantial evidence - your overwhelming fixation and obsession with blacks, with other peoples' racism, the way you enjoy seeking out stories of racism and your utter denial of any racism yourself all point strongly in the direction of disgusting and shameful hypocrisy.\n \n Hell even your avatar seems to be some kind of stereotypical depiction of african americans as subhuman. I'm sure you'll have some excuse for it, the same way a closet gay seems to always have an excuse for a desk full of phallic symbols.\n \n All I will say is, it takes a lot more courage to come out of the closet and admit it than to deny your nature and save face. It's a lot healthier too.", 
   {}, 
   364809, 
   null, 
   1249872600.0
  ], 
  [
   364816, 
   null, 
   "foundit66", 
   "Short of employing a brain scanning device, there's no way to \"prove\" you are truly thinking racist thoughts, in the same way there's no way to \"prove\" a republican senator bent over in a public restroom is gay.\n\n emoticon_wow\n Which still leaves the question of WHY YOU MADE THE ACCUSATION IN THE FIRST PLACE...\n There's got to be some real reason, unless it's something silly like you don't want to admit that you're just trolling by insulting people with accusations of racism ...\n \n \n \nBut in both cases there is an overwhelming amount of circumstantial evidence - your overwhelming fixation and obsession with blacks, with other peoples' racism, the way you enjoy seeking out stories of racism and your utter denial of any racism yourself all point strongly in the direction of disgusting and shameful hypocrisy.\n\n Um. WHAT?\n I welcome you to COUNT the number of threads I have started on racism.\n COUNT the number of threads I have DISCUSSED racism on...\n \n It's going to be a small number, so it should be quick...\n \n You're still making junk up...\n \n \n \nHell even your avatar seems to be some kind of stereotypical depiction of african americans as subhuman.\n\n A POTATO HEAD character is a \"stereotypical depiction of african americans as subhuman\"...\n ROFLMAO!\n \n What really kills me about these discussions is that your desperation comes off so transparently with little effort from me.\n All I have to do is keep you talking, and you continue to say absurd thing after absurd thing, digging yourself in deeper, exposing yourself for the world to see...\n \n \n \nAll I will say is, it takes a lot more courage to come out of the closet and admit it than to deny your nature and save face. It's a lot healthier too.\n\n And on another level, your whole approach is laughable and ludicrous.\n White folks who talk about and don't like racism ARE THEMSELVES supposedly racist, just cause they fight against the social injustice???\n emoticon_xdonno\n So to put that in perspective, Symbiote thinks that the people who are AGAINST homosexuality are gay, cause they are latent homosexuals...\n ... and ALSO that people who FIGHT FOR gay equality are also gay, cause they're supposedly infatuated with it. emoticon_rolleyes\n \n Funny...\n But not in a \"laughing with you\" sort of way...", 
   {}, 
   364811, 
   null, 
   1249874700.0
  ], 
  [
   364818, 
   null, 
   "Symbiote", 
   "Um. WHAT?\n I welcome you to COUNT the number of threads I have started on racism.\n COUNT the number of threads I have DISCUSSED racism on...\n\n \n Here's a stat for you. You have around 4000 posts, and you have used the word \"black\" (not african american of course, you prefer a more insulting term) in 180 threads, many of them in multiple posts.\n \n As a rough guide I would say that you are talking about african americans, usually using a derogatory term, in about 20% of your posts.\n \n \nA POTATO HEAD character is a \"stereotypical depiction of african americans as subhuman\"...\n \n\n \n Undoubtedly you feel you chose it for some other reason, but latent racism is a bit like that, isn't it?\n \n I should add that it has been conclusively proven that everyone is racist in some way or another. Most people are able to admit they have these tendencies, reflect on them, and act to correct them - these people aren't the problem.\n \n The problem is people like yourself, that are so wrapped up in denying their racist tendencies that they fester, grow, and express themselves in unconscious and harmful ways.\n \n In cultures where homosexuality is taboo, gays often suppress their sexuality and this is harmful. It appears you live in an area or social group where racism is extremely frowned upon, as a result your racism is suppressed and is also coming out in harmful ways rather than being dealt with straightforwardly and honestly.\n \n A racist that thinks they are immune from bigotry is a far more dangerous and evil person than a racist that openly admits it.", 
   {}, 
   364816, 
   null, 
   1249875540.0
  ], 
  [
   364822, 
   null, 
   "CUNxTime", 
   "Even if I accept your assessment at face value, TMK Simone's not in an elected position...\n emoticon_rolleyes\n \n Plus, I didn't say there is absolutely no racism amongst Democrats.\n I said: \"Racism is much more welcome in the Republican party than the Democrat party.\"\n\n \n \n The Pubs welcome all into the party. I mean, the Republicans have a black party leader...How many have the Democrats had? The Dems have been hugely successful at labeling the Pubs as the party for rich white racists. While its true that there are way more Blacks in the Dem party, this is largely due to the preponderance of blacks in the cities (not to mention the perpetuation of the myth of Pubs hating Blacks probably stymied the recruitment drive lol). I mean think about it like this... obviously the Republicans didn't come out with a memo stating that they hated blacks so where did the belief come from. Well if it didn't come from the Republicans, it must have come from the democrats. Do the democrats have in interest in making the Pubs look bad? Obviously. \n \n I mean, the Pubs freed the slaves, fought the Dems in the south to stop reprisals against blacks. Pubs fought for the Civil Rights Amendment. Ford appointed blacks to the cabinet as did Regan, G H W Bush, G. W. Bush appointed like 6 and a Supreme Court Justice. And now there's a black LEADER of the Republican Party! I can't see where the Pubs turned into haters of blacks?!?!?!?!", 
   {}, 
   364663, 
   null, 
   1249876740.0
  ], 
  [
   364823, 
   null, 
   "foundit66", 
   "Here's a stat for you. You have around 4000 posts, and you have used the word \"black\" (not african american of course, you prefer a more insulting term) in 180 threads, many of them in multiple posts.\n\n ROFLMAO!\n That's cause I frequently examine the discrimination against gays by comparing / contrasting with the discrimination against blacks.\n And for that, I'm supposedly racist???\n \n You claimed, and I quote, that I had a \"fixation and obsession\" with \"with other peoples' racism, the way you enjoy seeking out stories of racism\".\n And instead of documenting all the threads I talk about \"other peoples' racism\" and where I \"enjoy seeking out stories of racism\", you blindly settle for how many times I have used the word \"black\"???\n \n \n \nAs a rough guide I would say that you are talking about african americans, usually using a derogatory term, in about 20% of your posts.\n\n As a rough guide, I would say that 80% of your statistics are made up, with no documentable basis for the claim.\n If a person searches for a more relevant term, like the word \"racism\", one can easily find that I only used the word 92 times out of 4,147 posts.\n That's a little over 2%.\n And to you, that supposedly shows I have a \"fixation and obsession with blacks, with other peoples' racism, the way you enjoy seeking out stories of racism\"????\n \n You're grasping at straws.\n You still can't show ONE SINGLE concrete example of where I am actually racist.\n \n Instead, you try to show this lame \"statistics\" XXXX whereby I am supposedly racist just cause I mention blacks... emoticon_rolleyes\n \n \n \nUndoubtedly you feel you chose it for some other reason, but latent racism is a bit like that, isn't it?\n\n Quite frankly, we're dealing more with a situation like an ink blot here...\n The fact that YOU SEE \"black\" in that picture has more to say about you than me...\n \n \n \nI should add that it has been conclusively proven that everyone is racist in some way or another. Most people are able to admit they have these tendencies, reflect on them, and act to correct them - these people aren't the problem.\n\n That's a funny claim.\n I would LOVE to see you show any poll as to how many people WILL ADMIT that they are racist...\n It would be an incredibly small minority, which by your way of thinking would mean that the majority consists of problematic racists... emoticon_rolleyes\n \n \n \nIn cultures where homosexuality is taboo, gays often suppress their sexuality and this is harmful. It appears you live in an area or social group where racism is extremely frowned upon, as a result your racism is suppressed and is also coming out in harmful ways rather than being dealt with straightforwardly and honestly.\n\n Again, I challenge you to PROVE YOUR CLAIMS.\n 1) HOW is my racism \"coming out\"?\n \n 2) HOW is my racism \"harmful\"?", 
   {}, 
   364818, 
   null, 
   1249877100.0
  ], 
  [
   364828, 
   null, 
   "Symbiote", 
   "ROFLMAO!\n I frequently examine the discrimination against gays by comparing / contrasting with the discrimination against blacks.\n\n \n The question has to be asked then, are you genuinely trying to support gay rights, or is the entire reason you talk about \"gays and blacks\" all the time simply because you are subconsciously trying to play down the suffering and hardship of African Americans?\n \n I could understand mentioning the link a couple of times, but to literally be talking about in HUNDREDS of posts to me and to probably most people says there's an underlying issue there.\n \n \nThat's a funny claim.\n I would LOVE to see you show any poll as to how many people WILL ADMIT that they are racist...\n\n \n Most people will in an ongoing discussion admit they have at least some racist tendencies. Racism is on a continuum, just like sexuality. Just because you aren't in the KKK doesn't mean you aren't a racist too.\n \n To outright deny racism in any aspect of your personality is seriously wrong and a major indication that you are suppressing something, especially when coupled with your other behaviours on this board.\n \n \n1) HOW is my racism \"coming out\"?\n\n \n I think I've shown several ways where it is coming out. I just hope you aren't in a position e.g. where you are in charge of employing people, because I think you would be rejecting people racially and not even realising you were doing it. As with many problems, the first thing you have to do is admit you have a problem.\n \n \n2) HOW is my racism \"harmful\"?\n\n \n ALL racism is harmful, yours especially so since you are in such denial about it you have no way of keeping it in check.", 
   {}, 
   364823, 
   null, 
   1249878780.0
  ], 
  [
   364836, 
   null, 
   "foundit66", 
   "I am copying this to above, just so the distinction is made clear before the bottom is reached...\n And to put this all in perspective, a LOT of what I posted below (IMO) isn't really addressing an assessment of \"a lot of Republicans are racist\".\n A LOT of what I posted below is a simple answer to the question of why Republicans are seen as being more racist, and not as much for the Democrats...\n (Although there are a variety of examples above that do address the issue of \"some Republicans being racist\")\n \n \n \nThe Pubs welcome all into the party. I mean, the Republicans have a black party leader...How many have the Democrats had?\n\n The Democrats put up a black president first...\n \n And then the Republicans put up a black chairman, whom they endlessly harp on and criticize...\n \n You try to foist Steele as meaningful, when the truth is quite the contrary...Michael Steele, meanwhile, had only a 28% favorability rating. A full 58% of Republicans said they do not know enough about the RNC chairman to register an opinion.Palin Is Most Popular GOP Figure, Romney Comes In Second: Poll\n \n Yeah. But congratz on electing a chair that most Republicans don't know anything about, and don't care to find out about either... emoticon_xdonno\n If you want an example of \"token\", this would be it... emoticon_wow\n \n \n \nThe Dems have been hugely successful at labeling the Pubs as the party for rich white racists. While its true that there are way more Blacks in the Dem party, this is largely due to the preponderance of blacks in the cities (not to mention the perpetuation of the myth of Pubs hating Blacks probably stymied the recruitment drive lol).\n\n I think you pay wayyy too little attention to details that most people notice.\n Like McCain voting against the MLK holiday, and that's the guy who is put up as the RNC candidate...\n \n I've also given REPEATED examples of racism in the Republican party.\n \n But on your \"preponderance of blacks in the cities\" comment, I would be really curious if there is any poll which shows a locational divide amongst blacks. Showing \"city\" blacks have a significantly higher percentage of Democrats than \"non-city\" blacks...\n I think your dividing comment is like saying \"the water evaporated because it was a hot day\", while failing to recognize that the water was sitting on top of the stove burner which was on high...\n \n \n \nI mean think about it like this... obviously the Republicans didn't come out with a memo stating that they hated blacks so where did the belief come from. Well if it didn't come from the Republicans, it must have come from the democrats.\n\n Wow. And there's the assumption it didn't come from the Republicans, just cause there wasn't a memo?\n Oh wait. There HAVE BEEN memoes. And e-mails. And public comments...\n \n This will be the third time I've posted the following...\n Rush Limbaugh's \"Barack the Magic Negro\" song.\n And then Chip Saltsman, a candidate for the RNC national chair, distributes it as a stocking stuffer...\n \n University of Kentucky's student body president Nick Phelps (Mitch McConnell protege) forwarding racist e-mails.\n \n Then there were the McCain / Palin rally issues. Racism found a bizarre \"tolerance\" within these rallies. \n Examples like this one...\n http://i26.photobucket.com/albums/c114/foundit66/Protestor_Allowed.jpg\n They shouldn't have been allowed in the front door, but they were allowed in without problem.\n That, and there were various articles about vendors selling racist t-shirts and similar items.\n http://i26.photobucket.com/albums/c114/foundit66/ObamaButton0001.jpg\n \n And then there is Derek Black in Florida. Republicans elected this white supremacist to a party position.\n George Allens' \"macaca\" nonsense.\n \n \n And for the issue in general, you have polls like this one.\n It demonstrates racism exists in both parties. That I have no doubt on.\n But ACROSS THE BOARD, Republicans are more likely to support NEGATIVE stereo-types of blacks by a margin of about 10 points. Republicans are less likely to support POSITIVE statements of blacks by a margin of about 10 points.\n Political Pulse | The Associated Press-Yahoo! News Poll on Yahoo! News\n \n And as I post that list, I keep thinking of more examples.\n Remember Colin Powell's endorsement of Obama? And Limbaugh turning around and making overtly racist comments about the endorsement???\n \n \n These are some of the reasons why blacks recognize an anti-black prejudice that is more dominant in the Republican party.\n \n And let's look at it from another perspective for a minute.\n Stop focusing on \"prejudice\" and talk about WHICH PARTY HELPS blacks more...\n The Republicans repeatedly fight against quotas to help mitigate past injustices which have held blacks back.\n What about the examples of Republicans trying to repeatedly make voting tougher in areas with predominantly black people? Quite frankly, I think this issue is more an issue of vote voiding for party favoritism. Gore pulled some similarly egregious junk with military ballots in 2000.\n But, while that's my assessment, a black person may see it differently, and thus another reason for why the RNC is frowned upon...\n \n \n \nI mean, the Pubs freed the slaves...\n\n Oh do not go there.\n The Republican party of Lincoln's time IS NOT the same RNC of today.\n \n \n \n... fought the Dems in the south to stop reprisals against blacks. Pubs fought for the Civil Rights Amendment. \n\n And that's another skewed perspective.\n PEOPLE IN THE NORTH (Democrats and Republicans) fought people in the SOUTH (Democrats and Republicans) on this issue...\n \n This can be seen in a variety of ways, like the vote for the Civil Rights Act of 1964...The original House version:\n \n * Southern Democrats: 7-87 (7%-93%)\n * Southern Republicans: 0-10 (0%-100%)\n \n * Northern Democrats: 145-9 (94%-6%)\n * Northern Republicans: 138-24 (85%-15%)\n \n The Senate version:\n \n * Southern Democrats: 1-20 (5%-95%) (only Senator Ralph Yarborough of Texas voted in favor)\n * Southern Republicans: 0-1 (0%-100%) (this was Senator John Tower of Texas)\n * Northern Democrats: 45-1 (98%-2%) (only Senator Robert Byrd of West Virginia opposed the measure)\n * Northern Republicans: 27-5 (84%-16%) (Senators Bourke Hickenlooper of Iowa, Barry Goldwater of Arizona, Edwin L. Mechem of New Mexico, Milward L. Simpson of Wyoming, and Norris H. Cotton of New Hampshire opposed the measure)\n Civil Rights Act of 1964 - Wikipedia, the free encyclopedia\n The clear dividing line IS NOT \"democrat vs republican\", but rather north vs south.\n And if you want to take it a step further, look at the comparison of SOUTHERN democrats vs SOUTHERN republicans.\n NORTHERN democrats vs NORTHERN republicans.\n \n The Republican percentage is worse than the Democrat percentage in both areas...\n \n \n \nFord appointed blacks to the cabinet as did Regan, G H W Bush, G. W. Bush appointed like 6 and a Supreme Court Justice. And now there's a black LEADER of the Republican Party! I can't see where the Pubs turned into haters of blacks?!?!?!?!\n\n See the above.\n Your comments make it seem like we should judge the party based on four people who have nominated blacks.\n But let's look at the Democrats, who are habitually FIRST in these efforts...\n The first Black U.S. cabinet member: Robert C. Weaver, 1966&#8211;1968, Secretary of the Department of Housing and Urban Development under Lyndon Johnson; the first black female cabinet minister was Patricia Harris, 1977, Secretary of the Department of Housing and Urban Development under Jimmy Carter.WikiAnswers - Who was the first US president to be appoint a black cabinet member\n With more than 30 appointments to his credit, President Bill Clinton has named more Black ambassadors than any other president in history.National Headliners.(African American ambassadors)(Brief Article) - Jet | Encyclopedia.com\n Where his predecessor, George Bush, could find only one qualified woman, one African-American and two Hispanics for his Cabinet, Clinton nominated three black men, a black woman and two Hispanic men to join nine white Cabinet nominees &#8212; three of them women. George W. Bush&#8217;s push for diversity in his own Cabinet this year can be seen as an affirmation of Clinton&#8217;s work on that front.Leaving diversity in his wake - The Clinton Years - MSNBC.com\n \n And to clarify, this doesn't prove anything (IMO) about party comparisons any more than your comments above about what four republican presidents did somehow proves something about the party in general.\n But as for perception, it helps to solidify why blacks are more comfortable voting for Democrats, as opposed to Republicans.\n \n Al Franken had an interesting comment in one of his books. He talked about a black Republican organization, whose \"chairpeople\" were PREDOMINANTLY WHITE. And he asked one of the blacks who was on the committee about the presence, and the guy DID NOT EVEN REALIZE he had been named to that committee... emoticon_xdonno\n \n \n And to put this all in perspective, a LOT of what I posted above (IMO) isn't really addressing an assessment of \"a lot of Republicans are racist\".\n A LOT of what I posted above is a simple answer to the question of why Republicans are seen as being more racist, and not as much for the Democrats...\n (Although there are a variety of examples above that do address the issue of \"some Republicans being racist\")", 
   {}, 
   364822, 
   null, 
   1249879680.0
  ], 
  [
   364837, 
   null, 
   "foundit66", 
   "The question has to be asked then, are you genuinely trying to support gay rights, or is the entire reason you talk about \"gays and blacks\" all the time simply because you are subconsciously trying to play down the suffering and hardship of African Americans?\n\n Wow dude.\n You are actually questioning my \"genuine\" commitment to gay equality?\n You know, I can discuss things with people who are obviously operating in the \"troll\" classification, but you stooped too low for even me to want to waste time with a serious reply to a ridiculously absurd allegation.\n You were mildly amusing for a while, but you're outliving that...\n \n You have refused to answer my questions with ACTUAL SUBSTANTIATION, and an ACTUAL QUOTE, so for now I am done with you...\n \n CUNxTime is providing much more stimulating discussion...", 
   {}, 
   364828, 
   null, 
   1249879920.0
  ], 
  [
   364840, 
   null, 
   "CUNxTime", 
   "[QUOTE]\nThe Democrats put up a black president first...\n \n And then the Republicans put up a black chairman, whom they endlessly harp on and criticize...\n \n You try to foist Steele as meaningful, when the truth is quite the contrary...Michael Steele, meanwhile, had only a 28% favorability rating. A full 58% of Republicans said they do not know enough about the RNC chairman to register an opinion.Palin Is Most Popular GOP Figure, Romney Comes In Second: Poll\n \n Yeah. But congratz on electing a chair that most Republicans don't know anything about, and don't care to find out about either... emoticon_xdonno\n\n \n Ok I'll take it slow... First you prove my point, if 58% of Pubs don't know enough about him, doesn't that mean that they're looking past his color and withholding judgment. Isn't the definition of racism basically judging someone by their color? And don't think I didn't notice that you left out the unfavorable rating... 58+28=86% so that means at MOST the unfavorable rating is 14%. Now, you've got to admit that some of that 14% have legit reasons for disliking him.\n \n \n\n If you want an example of \"token\", this would be it... emoticon_wow\n\n \n Wow? Yeah wow! What a way to denigrate the first Black Chairman of a national party. Shesh.\n \n \nI think you pay wayyy too little attention to details that most people notice.\n Like McCain voting against the MLK holiday, and that's the guy who is put up as the RNC candidate...\n \n I've also given REPEATED examples of racism in the Republican party.\n \n But on your \"preponderance of blacks in the cities\" comment, I would be really curious if there is any poll which shows a locational divide amongst blacks. Showing \"city\" blacks have a significantly higher percentage of Democrats than \"non-city\" blacks...\n I think your dividing comment is like saying \"the water evaporated because it was a hot day\", while failing to recognize that the water was sitting on top of the stove burner which was on high...\n\n \n And I could give a ton of racist examples of PEOPLE in the Dem. party. Is the Dem party inherently racist? No (now its history...). You can give racist examples of PEOPLE in the Pub party (but its history???). With any organization with that many people there are, UNDOUBTEDLY going to be some racists. But to say the PARTY is dirty? No way. Except, I'll give you one. Its not really 'race' but the Pubs stance on gay marriage is wrong. If there's one glaring fission in the Party its between the Religious Right and those (like me) of the Libertarian bent. I try to convince my fellow conservatives to leave the gay stuff alone but I'm not always very successful...\n \n gotta run... I'll get to the rest later...ow. And there's the assumption it", 
   {}, 
   364836, 
   null, 
   1249881060.0
  ], 
  [
   364846, 
   null, 
   "foundit66", 
   "Ok I'll take it slow... First you prove my point, if 58% of Pubs don't know enough about him, doesn't that mean that they're looking past his color and withholding judgment. Isn't the definition of racism basically judging someone by their color? And don't think I didn't notice that you left out the unfavorable rating... 58+28=86% so that means at MOST the unfavorable rating is 14%. Now, you've got to admit that some of that 14% have legit reasons for disliking him.\n\n First of all, I think we need to get some perspective on scope...\n I am not saying all, or even most of the RNC are racist.\n I actually think it's a small minority.\n \n During the last election there were a variety of polls. One asked if there was a generally qualified person with characteristic ____ who was nominated from your party, would you vote for them.\n ____ filled in with gay, black, woman, atheist, etc.\n \n I believe it was only 10% (depends on how accurate my memory is) said they would not vote for their own party's nominated, generally qualified person with the ONLY detracting feature being \"black\". I think this is a decent starting point for \"racist\".\n That's nowhere near all or most Americans.\n \n Now if we were to assume that all that 10% were filling just one party (a statement I do NOT agree with), and that party was roughly half of the country, that would make that party's percentage of \"racist\" as 20%.\n \n And I throw this figure out there as an upper bound, although obviously still ridiculously high for one party (not rational to assume all the racists are in one party).\n \n Now. With that said...\n My comment was essentially to address YOU trying to give praise to the Republican party for putting Steele as RNC chair.\n I think giving the Republican party credit for that is absurd because MOST REPUBLICANS DO NOT KNOW ANYTHING about Steele.\n That was the point of that statistic.\n \n Too many care more about which pundit they listen to than who is the RNC chair...\n \n \n \nNow, you've got to admit that some of that 14% have legit reasons for disliking him.\n\n Slightly off-topic, but relevant to your comment...\n I think the Republican party is in the stage of eating their own, and the people who are unphased by this trend are the people who WERE NOT ELECTED to their position and answer essentially to nobody. People who don't have to give solutions.\n Like Limbaugh and Beck.\n \n Just look what they did to Jindall. Jindall did decent for what he had to work with (which isn't much, but not his fault), and people like Coulter eat him up with mindless \"slum dog millionaire\" comments... emoticon_ic\n Look at Steele having to apologize to Limbaugh, when Steele's comment on Limbaugh being an entertainer was 100% accurate...\n \n So while some may have some reason they think is significant for disliking him, I don't think that's as important as most people just don't care about the man, or his position.\n \n Racism isn't always about \"I hate black people\". In fact, I believe it is RARELY about that.\n Most of the time it is believing that blacks should not be in a certain position because they are black.\n A racist white man will probably not care about a black mayor in a city he doesn't care about.\n And right now, I don't think enough people care about the RNC chair position to care about whether or not he is black or white.\n \n Here's a real question for you...\n Based on real votes, by real tax-payers.\n How many black Republican congress people are there?\n How many black Democrat congress people are there?\n African Americans in the United States Congress - Wikipedia, the free encyclopedia\n \n For the House of Representatives, during the \"modern era\" which starts as early as 1929, there are a measly THREE black Republican House of Representatives.\n The list of black DEMOCRAT Reps is very long...\n \n Now, these are people that are ELECTED by the people.\n Not \"selected\" by a committee ...\n \n \n \nWow? Yeah wow! What a way to denigrate the first Black Chairman of a national party. Shesh.\n\n emoticon_xdonno\n No.\n I use the word \"token\" to reference the reason WHY HE WAS SELECTED.\n Not to his credentials for the job...\n \n When most Republicans don't know enough about him to even form an opinion, does that sound like somebody who is in office because the voters want him there?\n emoticon_xdonno\n \n \n \nAnd I could give a ton of racist examples of PEOPLE in the Dem. party.\n\n And I have no doubt you could.\n Like I said at the start of my post, I was accomplishing a couple things...\n 1) To point out why some people PERCEIVE racism in the Republican party...\n \n 2) To point out why some people perceive MORE racism in the Republican party...\n \n The first point concentrating on perception.\n The second point concentrating on an actual justification of that perception...\n \n \n \nIs the Dem party inherently racist? No (now its history...).\n\n I've already addressed this.\n The actual issue of importance is the Northern / Southern divide.\n \n Some people argue that blacks are more violent and commit more crime.\n But in polls that examine race AND INCOME, it is shown that the crime is actually more closely related to LOWER INCOME with a black low income person having a similar criminal statistics as white low income person.\n And when blacks have higher income, they have similar criminal statistics as the corresponding white higher income.\n \n Unless you're reaching WAYYYYY back to Republican Lincoln, in which I think it's rather obvious that this is NOT Lincoln's party anymore...\n \n \n \nYou can give racist examples of PEOPLE in the Pub party (but its history???).\n\n Look at the 1964 civil rights vote.\n Dividing by area, republicans had a HIGHER PERCENTAGE of voting against the 1964 civil rights bill than Democrats.\n Comparing South with South, and North with North.\n \n It all depends on how far back you want to go. Both parties are continually evolving.\n \n \n \nWith any organization with that many people there are, UNDOUBTEDLY going to be some racists. But to say the PARTY is dirty? No way.\n\n My stance is that the percentage of racists in Republicans is higher than percentage of racists in Democrats.\n I think I proved that with the one poll I linked to, showing Repubs had about a 10 point increase in negative association for blacks...\n \n Now, with that said, I am ultimately talking about an issue of \"more\".\n As to saying \"the PARTY is dirty\"? I wouldn't make that claim. It's too generic, and doesn't give enough credit to the vast majority of the party who aren't...\n \n \n \nExcept, I'll give you one. Its not really 'race' but the Pubs stance on gay marriage is wrong. If there's one glaring fission in the Party its between the Religious Right and those (like me) of the Libertarian bent. I try to convince my fellow conservatives to leave the gay stuff alone but I'm not always very successful...\n\n The day is coming.\n The cracks are showing, although the people STRESSING the issue in the RNC just aren't there yet. I would agree that it's a \"fissure\", but it's not \"glaring\" by its own light.\n There are multiple polls showing that within JUST the Republican voter base, they APPROVE of allowing gays in the military, gay civil unions, ENDA, and gay hate crimes. But the Republican voter base is not holding their politicians responsible for reflecting their majority position on the gay issue.\n \n Politicians (on both sides) often do not follow the wishes of their ACTUAL base, but cater to lobbyist groups (including social issue lobby groups).\n In the preps for last election, EVERY RNC presidential candidate made it plain that they WOULD NOT want to end the ban on gays in the military. (At least while we are \"at war\", and bin Laden isn't going to surrender, so where does that leave us...)\n \n Other issues abound. Republicans stuck to calling Sotomayor \"racist\" and largely voting \"no\" on her Court seat. I don't think that will go unnoticed. Especially in a country with a rising Hispanic population.\n I heard one pundit mention McCain's Arizona seat as possibly having some future fall-out for his vote...\n I'll be curious how that turns out...\n \n The two sides are kind of funny in their issues.\n The Republicans often want government out of financial issues, but to get involved in social issues.\n The Democrats often want government IN financial issues, but to stay out of social issues.\n \n \n \ngotta run... I'll get to the rest later...ow. And there's the assumption it\n\n C you later... emoticon_xgood", 
   {}, 
   364840, 
   null, 
   1249887240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New GOP \"Racist\" Headache", 
  "url": "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 12955, 
  "discussion_files": [
   [
    "26635.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-print.html"
   ], 
   [
    "26636.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-6-print.html"
   ], 
   [
    "26637.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-4-print.html"
   ], 
   [
    "26638.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-5-print.html"
   ], 
   [
    "26639.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-3-print.html"
   ], 
   [
    "26640.html", 
    "http://www.4forums.com/political/politics-debates/12955-new-gop-racist-headache-2-print.html"
   ]
  ], 
  "identifier": 12955
 }
]