[
 [
  [
   360437, 
   null, 
   "simone", 
   "This tells the story so well:\n \nI know you well. I knew you from the time I was a black girl in the 5th grade who won the school spelling bee, and the white boy I defeated hid out after school one day to challenge me to a fist fight. (I weighed about 48 lbs...he at least 20lbs more) His dad, a grown white man, asked him how he could have lost to a nigger. What he would have asked him had he lost to any of the other finalists, all of whom were white, several of whom were female, I'll never know.\n \n I knew you when, in Jr. High, a white male teacher told me to my face I was taking the space of a boy, presumably a white one since I went to a predominantly white school, in an advanced math class that required teacher recommendation to get into. And then again in High School when I was a Teacher's Assistant who graded the quantitative portions of tests while the teacher ( a white male who wasn't scared) graded the qualitative portions and when another white male student's father found out, again brought race into the equation accusing me of being incapable of completing this task. Hint...even though I usually knew the answers, I had a legend to go by which my not scared white male teacher eloquently and emphatically made clear to my classmates father and I continued to grade tests.\n\n Daily Kos: Dear Scared White Men of America\n \n Oversized bullies jumping a smaller girl. Yeah, I am so impressed by these macho macho men...", 
   {
    "post_info": {
     "post_title": "Dear Scared White Men of America..."
    }
   }, 
   null, 
   null, 
   1247516880.0
  ], 
  [
   360441, 
   null, 
   "DrNo", 
   "You're a racist and a sexist.", 
   {}, 
   360437, 
   null, 
   1247518980.0
  ], 
  [
   360445, 
   null, 
   "gansao", 
   "This tells the story so well:\n \n Daily Kos: Dear Scared White Men of America\n \n Oversized bullies jumping a smaller girl. Yeah, I am so impressed by these macho macho men...\n\n \n \n Yawn.zzzzzzzz", 
   {}, 
   360437, 
   null, 
   1247523960.0
  ], 
  [
   360478, 
   null, 
   "simone", 
   "You're a racist and a sexist.\n\n Sez you.\n \n So, what you so scared of?", 
   {}, 
   360441, 
   null, 
   1247533500.0
  ], 
  [
   360480, 
   null, 
   "gansao", 
   "So what is the point that you are trying to make Simone?", 
   {}, 
   360478, 
   null, 
   1247533800.0
  ], 
  [
   360514, 
   null, 
   "Ryuuichi", 
   "So what is the point that you are trying to make Simone?\n\n \n I have to agree on the racist. Change white men to black men and all of a sudden its a problem *shakes head* Reverse racism is still racism.\n \n Also: Is there a point to this story? Stuff like this happens literally ALL THE TIME. So unless it has a point...", 
   {}, 
   360480, 
   null, 
   1247542560.0
  ], 
  [
   360579, 
   null, 
   "simone", 
   "Racist stuff like this SHOULD NOT be happening in America. We are better than that.", 
   {}, 
   360514, 
   null, 
   1247589900.0
  ], 
  [
   360581, 
   null, 
   "gansao", 
   "Racist stuff like this SHOULD NOT be happening in America. We are better than that.\n\n \n If you want to experience race hatred try being a white farmer in Zimbabwe or even South Africa.\n You say we are better than that. Who are you referring to?", 
   {}, 
   360579, 
   null, 
   1247590800.0
  ], 
  [
   360583, 
   null, 
   "simone", 
   "We Americans. \n \n Hmmm, Zimbabwe, the case of farmers in South Africa.\n \n The colonialists, the conquerors who stole the land of those who were there before they, the Europeans, marched in with their superior weaponry.\n \n The same thing happened in America. We are still dealing with that.", 
   {}, 
   360581, 
   null, 
   1247591220.0
  ], 
  [
   360587, 
   null, 
   "gansao", 
   "We Americans. \n \n Hmmm, Zimbabwe, the case of farmers in South Africa.\n \n The colonialists, the conquerors who stole the land of those who were there before they, the Europeans, marched in with their superior weaponry.\n \n The same thing happened in America. We are still dealing with that.\n\n \n The governments of those countries, particularly the zimbabwe government not only target the white farmers but the black people who live and work on the farms. They even drive the farmers out knowing that these farms invariably become wastelands. Thats why Zimbabwe has changed from being one of the most wealthy African countries to one of the poorest.The Zimbabwe government justify the persecution of the white farmers with near enough the very words that you state above. Do you not think that they are not racist?\n \n There is racism everywhere in the world Americans are no better or worse than anyone else.", 
   {}, 
   360583, 
   null, 
   1247592120.0
  ], 
  [
   360596, 
   null, 
   "simone", 
   "The curse of Zimbabwe is President Robert Mugabe whose rule has been characterized by economic mismanagement, hyperinflation, and widespread reports of human rights abuses.", 
   {}, 
   360587, 
   null, 
   1247596920.0
  ], 
  [
   360602, 
   null, 
   "gansao", 
   "The curse of Zimbabwe is President Robert Mugabe whose rule has been characterized by economic mismanagement, hyperinflation, and widespread reports of human rights abuses.\n\n \n \n Without any help from white men, scared or not but with much help from black men especially the ones from his tribe the Shona . They massacred quite a few Ndebele but perhaps thats o.k or can be ignored because they are not white people. \n He also gets a lot of help from China . I think they used be called yellow.", 
   {}, 
   360596, 
   null, 
   1247597700.0
  ], 
  [
   360604, 
   null, 
   "simone", 
   "China is very much a major player in Africa today, and its unified national structure gives it a great deal of clout in overcoming the disorganized tribalism of Africa.", 
   {}, 
   360602, 
   null, 
   1247597880.0
  ], 
  [
   360607, 
   null, 
   "gansao", 
   "China is very much a major player in Africa today, and its unified national structure gives it a great deal of clout in overcoming the disorganized tribalism of Africa.\n\n \n China will support any regime in Africa that gives it access to thier countries resources. the people within those countrie complain that they are treated like dirt by the Chinese.", 
   {}, 
   360604, 
   null, 
   1247598240.0
  ], 
  [
   360615, 
   null, 
   "snakespit", 
   "We are better than that.\n\n \n Apparently not everyone Simone, or you wouldn't have posted this.", 
   {}, 
   360579, 
   null, 
   1247600460.0
  ], 
  [
   360616, 
   null, 
   "CUNxTime", 
   "This tells the story so well:\n \n Daily Kos: Dear Scared White Men of America\n \n Oversized bullies jumping a smaller girl. Yeah, I am so impressed by these macho macho men...\n\n \n Well, I'll share a little of my personal history with you. We were very poor growing up. When I was eight, we moved from Columbia, MD on the western shore to the country, a backwoods plot on the Eastern Shore, 15 miles from the nearest place that could be considered even a hamlet. The nearest school to me was called Mt. Vernon School. It had 4 classrooms and served grades Pre-K thru 12. I was the only white boy enrolled in the school that year. I can tell you, being the only one of anything is tough and there are small minded people of all colors, races, and nationalities. Since my time at Mt. Vernon, I've had a wealth of life experiences that have brought me into contact with all walks of life, all 'types' of people, and many nationalities.\n \n I went to college and met the intellectual crowd. While in college I lived in the ghetto (since I paid for everything my self there weren't many other options) and met the people of the ghetto. I've been deeply involved with things that circumvent the law for recreational purposes and have met the people in that circle. I've hitched across the country with very little money and met people from many places in my extensive travels. I've hiked the Appalachian Trail and met tons of people that way.\n \n I've been married to a Muslim woman from Morocco. I'm currently married to a Mexican woman who I met here but went to Mexico to marry.\n \n I can definitively say that NO particular 'type' of person has a monopoly of hate. Having been at least an 'honorary' member of almost every segment of society you could think of, I can tell you that there are great people of every color and race but there is also the WORST of humanity spread throughout the color spectrum. \n \n As an aside, I'll also tell you that my conservative/libertarian views are formed and informed by these experiences. I've seen that most people know what the 'right' choices are but often ignore them for 'easier' fixes or instant gratification. This has proven true in almost every situation I've found myself in, from banging smack in a flophouse to dealing with owners of ocean front condos. However, the ABILITY to do what is right is there but I've seen that most people will let you do their work for them if you volunteer.", 
   {}, 
   360437, 
   null, 
   1247601000.0
  ], 
  [
   360738, 
   null, 
   "simone", 
   "CUNx, what an interesting background.\n \n When you were a minority, how were you treated?", 
   {}, 
   360616, 
   null, 
   1247682300.0
  ], 
  [
   360745, 
   null, 
   "chester", 
   "Well, I'll share a little of my personal history with you. We were very poor growing up. When I was eight, we moved from Columbia, MD on the western shore to the country, a backwoods plot on the Eastern Shore, 15 miles from the nearest place that could be considered even a hamlet. The nearest school to me was called Mt. Vernon School. It had 4 classrooms and served grades Pre-K thru 12. I was the only white boy enrolled in the school that year. I can tell you, being the only one of anything is tough and there are small minded people of all colors, races, and nationalities. Since my time at Mt. Vernon, I've had a wealth of life experiences that have brought me into contact with all walks of life, all 'types' of people, and many nationalities.\n \n I went to college and met the intellectual crowd. While in college I lived in the ghetto (since I paid for everything my self there weren't many other options) and met the people of the ghetto. I've been deeply involved with things that circumvent the law for recreational purposes and have met the people in that circle. I've hitched across the country with very little money and met people from many places in my extensive travels. I've hiked the Appalachian Trail and met tons of people that way.\n \n I've been married to a Muslim woman from Morocco. I'm currently married to a Mexican woman who I met here but went to Mexico to marry.\n \n I can definitively say that NO particular 'type' of person has a monopoly of hate. Having been at least an 'honorary' member of almost every segment of society you could think of, I can tell you that there are great people of every color and race but there is also the WORST of humanity spread throughout the color spectrum. \n \n As an aside, I'll also tell you that my conservative/libertarian views are formed and informed by these experiences. I've seen that most people know what the 'right' choices are but often ignore them for 'easier' fixes or instant gratification. This has proven true in almost every situation I've found myself in, from banging smack in a flophouse to dealing with owners of ocean front condos. However, the ABILITY to do what is right is there but I've seen that most people will let you do their work for them if you volunteer.\n\n \n CUNx,\n \n My life experiences closely parallel yours, with the exception that my growing up years were in a dying industrial city in the Northeast.\n \n My left/liberal/radical views were formed in the same crucible as yours.\n \n I came away with the firm conviction that the government has the right, duty, and obligation to ensure that no on else's children should have to experience what I did.", 
   {}, 
   360616, 
   null, 
   1247686980.0
  ], 
  [
   360763, 
   null, 
   "snakespit", 
   "CUNx- do you value your experiences growing up, and do you feel that they have been a positive or negative influence on your life?", 
   {}, 
   360745, 
   null, 
   1247704320.0
  ], 
  [
   360787, 
   null, 
   "CUNxTime", 
   "CUNx, what an interesting background.\n \n When you were a minority, how were you treated?\n\n \n I'm not sure how you mean. When I was Poor White Trash? When I was living in the ghetto? When I was in Mexico? When I was the only white student in a school that served grades pre-K - 12? I've been treated the gamut just depending on the situation.", 
   {}, 
   360738, 
   null, 
   1247734200.0
  ], 
  [
   360788, 
   null, 
   "CUNxTime", 
   "CUNx,\n \n My life experiences closely parallel yours, with the exception that my growing up years were in a dying industrial city in the Northeast.\n \n My left/liberal/radical views were formed in the same crucible as yours.\n \n I came away with the firm conviction that the government has the right, duty, and obligation to ensure that no on else's children should have to experience what I did.\n\n \n I believe in a social safety net, but I've seen people become so hooked on govt. 'help' so as to not be able to function in the real society. I've seen drug addicts figure out ways to make more in a day then I make in a week. I've seen potential and I've seen it squandered. There's a place for govt. but once it takes over the position of provider, people can become like children depending on govt. for everything. I've made so many HUGE mistakes in my life, and will not do those things again because I paid a price for my mistakes. That is how I learned. If you don't pay a price, you won't learn.", 
   {}, 
   360745, 
   null, 
   1247734560.0
  ], 
  [
   360789, 
   null, 
   "CUNxTime", 
   "CUNx- do you value your experiences growing up, and do you feel that they have been a positive or negative influence on your life?\n\n \n Oh man, super positive. Who else can feel as comfortable meeting with gang members in a crack house as they are meeting a real estate client? I feel I'm equipped to deal with any situation, anywhere. I've got stories that would blow your socks off. I'm so happy I've packed a lifetime in my first 30 years and I'm as glad for the education I got on the 'street' as the one I got in college.", 
   {}, 
   360763, 
   null, 
   1247734740.0
  ], 
  [
   360807, 
   null, 
   "snakespit", 
   "Interesting. CUNx gives us a personal history, and Chester states that his own personal history closely parallels it. Chester goes on to state:\n \n \nI came away with the firm conviction that the government has the right, duty, and obligation to ensure that no on else's children should have to experience what I did. \n\n \n While CUNx states: \n \n \nOh man, super positive. Who else can feel as comfortable meeting with gang members in a crack house as they are meeting a real estate client? I feel I'm equipped to deal with any situation, anywhere. I've got stories that would blow your socks off. I'm so happy I've packed a lifetime in my first 30 years and I'm as glad for the education I got on the 'street' as the one I got in college. \n\n \n Proof positive that some view the glass as half empty while others view it as half full. From a sociological standpoint, I found this to be a very interesting contrast.", 
   {}, 
   360789, 
   null, 
   1247765640.0
  ], 
  [
   360808, 
   null, 
   "Chuz Life", 
   "I believe in a social safety net, but I've seen people become so hooked on govt. 'help' so as to not be able to function in the real society. I've seen drug addicts figure out ways to make more in a day then I make in a week. I've seen potential and I've seen it squandered. There's a place for govt. but once it takes over the position of provider, people can become like children depending on govt. for everything.  I've made so many HUGE mistakes in my life, and will not do those things again because I paid a price for my mistakes. That is how I learned. If you don't pay a price, you won't learn.\n\n \n I too have a simular background to yours CUNx.\n \n And I agree with a lot of what you say.\n \n But I wanted to add,... I grew up in a house with 9 kids and we too were in and out of poverty. (mostly in)\n \n I learned to learn,... from the mistakes of those around me. I didn't have to steal a pack of cigarettes and get caught to learn the consequences of stealing and getting caught. I didn't have to get a girl pregnant at 15 to learn the lifelong problems it creates. etc. I can go on and on.\n \n I just wanted to add that paying a price is not the only way to \"learn.\"", 
   {
    "post_info": {
     "post_title": "Right on,.. right on"
    }
   }, 
   360788, 
   null, 
   1247765700.0
  ], 
  [
   360813, 
   null, 
   "CUNxTime", 
   "Of course you are correct. There are tons MORE mistakes I could have made but knew better. And most of the mistakes I DID make, I knew better at the time but just 'did my own thing' anyway. My point was that once you DO make a mistake or do something stupid, the quickest way to learn from it (and not repeat it) is to actually pay a price. I wasn't' trying to imply that that's the only way to learn how to behave...sry.\n \n \n As an aside... I'm very surprised a how ordinary that my background has turned out to be. I would have sworn that I'm the only PWT, only white boy, growing up poor, living in the ghetto, heroin shootin, cross country hitching, payin for his own college, marrying Moroccans, Appalachian Trail hiking, guy who ended up in Mexico with a Mexican wife.... I'll admit that I'm a bit miffed to find out that my story is so run of the mill emoticon_cry ...hehe", 
   {}, 
   360808, 
   null, 
   1247768340.0
  ], 
  [
   360818, 
   null, 
   "Chuz Life", 
   " As an aside... I'm very surprised a how ordinary that my background has turned out to be. I would have sworn that I'm the only PWT, only white boy, growing up poor, living in the ghetto, heroin shootin, cross country hitching, payin for his own college, marrying Moroccans, Appalachian Trail hiking, guy who ended up in Mexico with a Mexican wife.... I'll admit that I'm a bit miffed to find out that my story is so run of the mill emoticon_cry ...hehe\n\n \n And here I thought the book of PWT was little more than my own family's history.\n \n I assure you that you are no more-no less \"run of the mill\" than a \"motherless, raised by teenagers, living in poverty, inner city, public schooled, absent fathered, playing in the alley, bicycle and fort (club house) building (little rascals/ our gang) kind of character that would still be in that scene were it not for the love of electronics and the want to impress a farm girl (met at work- Mc'Donalds) who would later go to college and leave me there,... and marry another then die before I could ever impress her. Living in a \"party trailer\" and no choice but to join the Marine Corps for a chance to get out of the situations I was in.\n \n Looking back, I knew more people in my situation then than I know in my situation now. Like you I'm as much or more comfortable around \"poor white trash folk\" than I am around those who \"have\" and who don't have a background like ours.", 
   {
    "post_info": {
     "post_title": "The Book of PWT?"
    }
   }, 
   360813, 
   null, 
   1247769840.0
  ], 
  [
   360821, 
   null, 
   "CUNxTime", 
   "...one thing that does make me feel almost one-of-a-kind (in today's society) .... my parents are still married and they both did their best raising me...", 
   {}, 
   360818, 
   null, 
   1247770440.0
  ], 
  [
   360822, 
   null, 
   "Chuz Life", 
   "...one thing that does make me feel almost one-of-a-kind (in today's society) .... my parents are still married and they both did their best raising me...\n\n \n Very rare indeed, CUNx.\n \n My Father is oldest of 12. Eleven survive today. All eleven have been married. All eleven either have been or still are married. 19 marriages between them. Of those who have kids,... 9 divorces. Those who have kids and are still married to the mother or father of the kids? \n \n Two.", 
   {
    "post_info": {
     "post_title": "Very rare indeed!"
    }
   }, 
   360821, 
   null, 
   1247771100.0
  ], 
  [
   360825, 
   null, 
   "DrNo", 
   "You guys are getting way off topic here with all these stories of positive life experiences and how any person can be a victim or a perpetrator of racism.\n \n Can we please get back to bashing white males like Simone wants?", 
   {}, 
   360822, 
   null, 
   1247771340.0
  ], 
  [
   360828, 
   null, 
   "CUNxTime", 
   "Sry if I jacked the thread...I was just trying to illustrate that, due to the experiences I've had and the amount and 'types' of people I've met, I can definitively say that whites have no monopoly on racism and that most PEOPLE do not 'act' based on race. I'll grant, many (almost all) of us have stereo-types that we fall back on, intentionally or unintentionally. However, as long as you don't BEHAVE based on stereotypes, especially in a discriminative manner, the world should function pretty much as it should (as far as race is concerned anyway lol).", 
   {}, 
   360825, 
   null, 
   1247771760.0
  ], 
  [
   360833, 
   null, 
   "Steamroller", 
   "CUNx, what an interesting background.\n \n When you were a minority, how were you treated?\n\n \n \nCUNx,\n \n My life experiences closely parallel yours, with the exception that my growing up years were in a dying industrial city in the Northeast.\n \n My left/liberal/radical views were formed in the same crucible as yours.\n \n I came away with the firm conviction that the government has the right, duty, and obligation to ensure that no on else's children should have to experience what I did.\n\n \n Quit your whinning.emoticon_cry\n \n Take a GOOD look at that crutch you've been carrying around all your years and throw it away. That crutch and the desire to use it is the reason for your misery. The govt doesn't owe you anything!! Because the govt is ME, and the govt is my neighbor, and unless you are physically or mentally impaired you aren't owed a thing.\n \n You say you come from a dying industrial city in the Northeast, and this \"crucible\" caused you to become a left/liberal/radical. Go back and take a GOOD look at the left/liberal/radical policies that caused the death of your industrial city. Let's see.., I wonder if the UNIONS had anything to do with it?? I wonder if govt enforced taxation on the companies that left had anything to do with it??\n \n We all have reasons to grab a crutch, those with character \"just say NO!\"", 
   {}, 
   360821, 
   null, 
   1247772300.0
  ], 
  [
   360834, 
   null, 
   "Chuz Life", 
   "You guys are getting way off topic here with all these stories of positive life experiences and how any person can be a victim or a perpetrator of racism.\n \n Can we please get back to bashing white males like Simone wants?\n\n \n You are so right DR.No!\n \n Nevermind my bi-racial wife for the moment,.... I admit it. I have to work harder on hating and regretting my white roots. We must be punished!\n \n :xbanghead", 
   {
    "post_info": {
     "post_title": "Lmao!"
    }
   }, 
   360825, 
   null, 
   1247772840.0
  ], 
  [
   360836, 
   null, 
   "99%BEEF", 
   " I've made so many HUGE mistakes in my life, and will not do those things again because I paid a price for my mistakes. That is how I learned. If you don't pay a price, you won't learn.\n\n \n I wonder if people do learn from their mistakes.\n \n I myself don't think people do, for instance I can be very lazy and instead of thinking next time I will try harder I instead put myself into situations that I find more comfortable. It is possible that this may be an instance of me learning the \"wrong\" lesson from a situation.\n \n We have classes in our society and we say that people could improve their lives if they just learnt the lesson of hard work, planning ahead or chasing the dream and yet I think America and the UK have the lowest levels of social mobility in the western world.\n \n So essentially I am saying that I am not sure anyone learns anything but instead people have a behavioural type that they must follow. However if we can learn to improve ourselves what must we do to ensure the next generation receive this gift? \n \n Well I am going to go do reading about behaviour modification so I may have changed my mind completely by the time I come back to this thread,", 
   {}, 
   360828, 
   null, 
   1247773320.0
  ], 
  [
   360839, 
   null, 
   "CUNxTime", 
   "\n \n So essentially I am saying that I am not sure anyone learns anything but instead people have a behavioural type that they must follow. However if we can learn to improve ourselves what must we do to ensure the next generation receive this gift? \n \n \n\n \n If that's the case then anyone unhappy with thier lives right at this moment should just go ahead and blow thier brains out. Guess this will be my last post ever...bye all! emoticon_smile", 
   {}, 
   360836, 
   null, 
   1247773680.0
  ], 
  [
   360843, 
   null, 
   "99%BEEF", 
   "Is the fact that we don't commit mass suicide evidence that we have no control of our own actions? Many of us believe life to be pure chance and entirely pointless and many people do live a life that is mainly miserable. We have consciousness but no freewill.\n \n (With apologies to Tolstoy for probably missing the point)", 
   {}, 
   360839, 
   null, 
   1247774280.0
  ], 
  [
   360854, 
   null, 
   "chester", 
   "I believe in a social safety net, but I've seen people become so hooked on govt. 'help' so as to not be able to function in the real society. I've seen drug addicts figure out ways to make more in a day then I make in a week. I've seen potential and I've seen it squandered. There's a place for govt. but once it takes over the position of provider, people can become like children depending on govt. for everything. I've made so many HUGE mistakes in my life, and will not do those things again because I paid a price for my mistakes. That is how I learned. If you don't pay a price, you won't learn.\n\n \n And I have seen people so crushed by that capitalist system that they were harried into an early grave.\n \n That's a terrible way to learn a lesson.\n \n That is far more terrifying that dependency on the government which, as you must recognize, is a myth.\n \n Thanks to the welfare reform bill signed by President Clinton, no individual may stay on public assistance more than five years LIFETIME.\n \n My biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.", 
   {}, 
   360788, 
   null, 
   1247777940.0
  ], 
  [
   360859, 
   null, 
   "Chuz Life", 
   " My biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.\n\n \n That's a great philosophy if it serves you well.\n \n It's when you and others try to use the powers of government to impose that will onto others,... then it becomes a problem for the rest of us.\n \n You can't mandate charity, compassion and caring. In fact, the harder you try to do so, the harder the rebellion against it.\n \n \"I gave at the office\" as they say.\n \n If you want people to care more and help more with their fellow man,... Let everyone rich and poor alike KEEP more of what they earn. Then, reward charitable giving, compassion and other phianthropic contributions with further tax cuts and other incentives that actually REWARDS helping your fellow man. \n \n Of course, that would take the power and control away from the government,.... and well, we just can't have any of that.", 
   {
    "post_info": {
     "post_title": "Hey Kool AIDE!"
    }
   }, 
   360854, 
   null, 
   1247780400.0
  ], 
  [
   360861, 
   null, 
   "gansao", 
   "You guys are getting way off topic here with all these stories of positive life experiences and how any person can be a victim or a perpetrator of racism.\n \n Can we please get back to bashing white males like Simone wants?\n\n Exactly. I was abandoned as a baby and raised by badgers on the Essex marshes. Then I was caught in a gin trap by raggle taggle gypsies o and travelled with them as a side show freak. As a gypsy I was able to see a national health doctor on demand and before the people who pay taxes. I told them that I had a bad back and have lived off sickness benefits ever since. \n \n British white men pay more money into the British state than any other section of British people. Maybe they should be as scared as the American ones.", 
   {}, 
   360825, 
   null, 
   1247781720.0
  ], 
  [
   360875, 
   null, 
   "Steamroller", 
   "My biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.\n\n \n Chester, where in the world do you get this tribble??\n \n I am not responsible for you, no more than you are responsible for me! It does not take a village to raise a child, and I'll thank you AND the village to stay out of my business.\n \n By what law, constitutional or otherwise do you justify such a belief?", 
   {}, 
   360854, 
   null, 
   1247786580.0
  ], 
  [
   360936, 
   null, 
   "CUNxTime", 
   "[QUOTE]\nAnd I have seen people so crushed by that capitalist system that they were harried into an early grave.\n\n \n And these people, working 70-80 hrs a week drive innovation and production. Not only do they have to work so much to get what they want, you'd take 60% of what they do make (in effect, what they've traded their lives for) and give it to those who'd rather coast. People respond to incentive. If there's good incentive to work hard (ie make more money to buy a boat) they will. However, the vast majority of people will take the easy way out if offered. \n \n\n That's a terrible way to learn a lesson.\n\n \n Yes, and I fear we're about to learn it.\n \n \nThat is far more terrifying that dependency on the government which, as you must recognize, is a myth.\n\n \n \n Due, I know people who can't READ but can work the system better than a lawyer. Its not only dependency on the govt. its MULTI-GENERATIONAL govt. dependency!\n Thanks to the welfare reform bill signed by President Clinton, no individual may stay on public assistance more than five years LIFETIME.\n \n \nMy biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.\n\n \n Its great to feel a connection to your fellow man but people are wired to be self-sufficient.", 
   {}, 
   360854, 
   null, 
   1247806800.0
  ], 
  [
   360952, 
   null, 
   "chester", 
   "Chester, where in the world do you get this tribble??\n \n I am not responsible for you, no more than you are responsible for me! It does not take a village to raise a child, and I'll thank you AND the village to stay out of my business.\n \n\n \n Then go to your own desert island and play at being Robinson Crusoe.\n \n For myself, I am well pleased that my food is government inspected, my prescriptions meet government safety standards, my water is fit to drink due to government standards, that my house meets government building codes, that my taxes pay for fire protection and roads, that my doctor must meet government standards, and all the other things in life you take so for granted.\n \n Continue your mythologizing if you wish, but the reality is that you depend on others every day of your life, and you are well pleased that you are.\n \n Even Aristotle told us that man is a social animal.", 
   {}, 
   360875, 
   null, 
   1247835240.0
  ], 
  [
   360965, 
   null, 
   "CUNxTime", 
   "Then go to your own desert island and play at being Robinson Crusoe.\n \n For myself, I am well pleased that my food is government inspected, my prescriptions meet government safety standards, my water is fit to drink due to government standards, that my house meets government building codes, that my taxes pay for fire protection and roads, that my doctor must meet government standards, and all the other things in life you take so for granted.\n \n Continue your mythologizing if you wish, but the reality is that you depend on others every day of your life, and you are well pleased that you are.\n \n Even Aristotle told us that man is a social animal.\n\n \n I don't hear ANYONE saying there's no place for govt. and taxes. Hell, taxes are the price of civilization (emoticon_xangel). But you know as well as I that there can be too much of a big thing. We might see economy of size in nature but not in govt. Just because we want small govt. and efficient govt. doesn't mean we're anarchists (and I kinda think you knew that already).", 
   {}, 
   360952, 
   null, 
   1247843640.0
  ], 
  [
   360971, 
   null, 
   "Chuz Life", 
   "I don't hear ANYONE saying there's no place for govt. and taxes. Hell, taxes are the price of civilization (emoticon_xangel). But you know as well as I that there can be too much of a big thing. We might see economy of size in nature but not in govt. Just because we want small govt. and efficient govt. doesn't mean we're anarchists (and I kinda think you knew that already).\n\n \n \"Sooner or later there is going to be more people IN the wagon than there will be those willing to pull it\"-- Phil Graham", 
   {
    "post_info": {
     "post_title": "Like Senator Phil Graham once said,..."
    }
   }, 
   360965, 
   null, 
   1247844600.0
  ], 
  [
   360974, 
   null, 
   "CUNxTime", 
   "\"Sooner or later there is going to be more people IN the wagon than there will be those willing to pull it\"-- Phil Graham\n\n \n Exactly, tyranny of the majority is the wost kind there is.", 
   {}, 
   360971, 
   null, 
   1247845380.0
  ], 
  [
   360982, 
   null, 
   "snakespit", 
   "My biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.\n\n \n I need someone to watch the kids and help get the yard work done this weekend Chester, what time will you be here?", 
   {}, 
   360854, 
   null, 
   1247849460.0
  ], 
  [
   361018, 
   null, 
   "chester", 
   "I need someone to watch the kids and help get the yard work done this weekend Chester, what time will you be here?\n\n \n Why not start a coop in your area? \n For example, if you are savvy around cars, you could change someone's oil in exchange for what you need done.", 
   {}, 
   360982, 
   null, 
   1247874720.0
  ], 
  [
   361030, 
   null, 
   "snakespit", 
   "Why not start a coop in your area? \n For example, if you are savvy around cars, you could change someone's oil in exchange for what you need done.\n\n \n Nope. \n \n \nwe are all in this together - that each of us has a responsibility to all the rest of us\n\n \n I have decided that your responsibility to me is to watch my kids and cut my grass. emoticon_xclown I suspect however that I will be running the mower alone tomorrow. \n \n In all seriousness, there are several people in my neighborhood that change oil and perform other services on cars...they are called mechanics. I take my car to one on a somewhat regular basis. However when he is done, rather than go cut his grass or paint his fence, I give him money. \n \n Your theory of tit for tat sounds great until you really sit and think about it. While 90% of us who are able to contribute may be willing to trade service for service, there are always those who refuse to get off of their keisters and actually make their contribution. Now when I think about your coop/commune like system, I would say that the 10% who are able yet refuse to make a contribution could shrivel up and die. But based on many of our past conversations, I realize that you think it is part my job to help provide for these sloths anyway. This is where we part company.", 
   {}, 
   361018, 
   null, 
   1247881920.0
  ], 
  [
   361078, 
   null, 
   "Symbiote", 
   "I have a great idea, how about when we perform a service for others, we receive tokens which we can exchange for services for others. And the number of tokens exchanged can be voluntarily agreed upon by both parties. And we can call these tokens money.\n \n On a more serious note, it's nice to see that people have responded to a racist thread in a constructive way.", 
   {}, 
   361030, 
   null, 
   1247931240.0
  ], 
  [
   361168, 
   null, 
   "Steamroller", 
   "Then go to your own desert island and play at being Robinson Crusoe.\n \n For myself, I am well pleased that my food is government inspected, my prescriptions meet government safety standards, my water is fit to drink due to government standards, that my house meets government building codes, that my taxes pay for fire protection and roads, that my doctor must meet government standards, and all the other things in life you take so for granted.\n \n Continue your mythologizing if you wish, but the reality is that you depend on others every day of your life, and you are well pleased that you are.\n \n Even Aristotle told us that man is a social animal.\n\n \n Chester,Chester,Chester..., Have you ever been in a slaughterhouse where your govt inspector was checking out the beef you eat? Have you ever been in a Tyson chicken plant?\n \n If you had, I tell you in all sincerity, you would never eat chicken or beef again thaat you didn't raise and butcher yourself. \n \n I have been in both types of plants, the govt has about 1 inspector for three to five plants. They can't be in all places all the time. They do periodic inspections. That's why we have recalls.\n \n Lets talk about the Federal Highway Trust Fund. In your lifetime, assuming you are a car driving, 10 to 15,000 miles per year average consumer.. it will take you over 71 (driving) years for the direct taxes you pay in fuel tax to pay for 1 paved mile of highway. Thanks for your contribution.\n \n The govt rapes the trucking companies in highway and fuel-use taxes that are then deposited into the general fund and spent on everything but highway construction. \n \n Those \"shovel-ready\" projects were supposed to be paid for by the \"trust\" fund, not stimulus money.\n \n Don't talk to me about services I \"take for granted\". I don't get my taxes taken out of my check like I never earned the money. I have to write a check separate from my income every week. More than most I know exactly how much of \"my\" money gets donated to this govt that you want to expand!\n \n Social Security??? Estimated at 15 trillion dollars in the red. Do you realize that there are an estimated 70 million babyboomers currently entering SS at a rate of over 10,000 people per day. Estimates that the fund will last to 2012 are greatly exaggerated according to many experts, and this is the govt you are so pleased with, hmm???\n \n Come on.., what else you got?", 
   {}, 
   360952, 
   null, 
   1247992440.0
  ], 
  [
   361205, 
   null, 
   "chester", 
   "Steam,\n \n How about this?\n \n You tag says, \"To compel a man to subsidize with his taxes the propagation of ideas which he disbelieves and abhors is sinful and tyrannical.\n Thomas Jefferson\"\n \n OK let's take it at face value. I am unalterably opposed to the optional wars in Iraq and Afghanistan. Therefore, I should be exempt from paying the 50%+ of my taxes that go to support the military/industrial complex, correct?", 
   {}, 
   361168, 
   null, 
   1248020400.0
  ], 
  [
   361249, 
   null, 
   "antonia", 
   "Steamroller and Chester,\n \n I think both of you should consider that your meat may be coming from outside the United States. Meaning that it is even less regulated and inspected than America's Tyson's.\n \n There are American farmers, however, I trust more ITO meat products. You have to look for them, though, and not just accept some of these larger companies as a given.\n \n Good point on taxes and the military spending, Chester. One of your better posts.\n \n Snakespit, I hired sitters through the university, and paid the going rate, when I had to.", 
   {}, 
   361205, 
   null, 
   1248049980.0
  ], 
  [
   361255, 
   null, 
   "Steamroller", 
   "Steam,\n \n How about this?\n \n You tag says, \"To compel a man to subsidize with his taxes the propagation of ideas which he disbelieves and abhors is sinful and tyrannical.\n Thomas Jefferson\"\n \n OK let's take it at face value. I am unalterably opposed to the optional wars in Iraq and Afghanistan. Therefore, I should be exempt from paying the 50%+ of my taxes that go to support the military/industrial complex, correct?\n\n \n First of all the two largest expenditures of the fed are healthcare/entitlement and military. In addition, that doesn't take into account that nearly 1/3 of the deficeit is for interest on the debt, or the over 700 billion is due to Social Security tht is not even included in the buget. \n \n 50% plus for \"military/industrial\" complex, is disingenuous at best, or uninformed at worst.\n \n So in answer to your post in which you completely ignored my response to you, I would point out that nearly .75 cents out of every tax dollar I donate is spent on the things I abhor.\n \n The fact that the .25 cents for every tax dollar you donate for your freedom, is a portion that you abhor is dually noted. emoticon_xgood", 
   {}, 
   361205, 
   null, 
   1248051420.0
  ], 
  [
   361264, 
   null, 
   "Steamroller", 
   "Good comeback Steamroller. Shall be interesting to see what Chester does with that.\n \n Regardless, I don't think either of you are going to bring the American tax structure down.\n \n Wonder how much goes to education?\n\n \n I appreciate that.\n \n I respect the point of view that chester supports but the real numbers are truly surprising. Federal Budget Spending and the National Debt\n \n I know that alot of folks believe we give away a huge % of the buget for foreign aid but that figure very low relatively speaking.\n \n Education gets a whopping 80 billion, probably less than 2%.., +/- ?", 
   {}, 
   361255, 
   null, 
   1248053760.0
  ], 
  [
   361268, 
   null, 
   "antonia", 
   "I appreciate that.\n \n I respect the point of view that chester supports but the real numbers are truly surprising. Federal Budget Spending and the National Debt\n \n I know that alot of folks believe we give away a huge % of the buget for foreign aid but that figure very low relatively speaking.\n \n Education gets a whopping 80 billion, probably less than 2%.., +/- ?\n\n \n Interesting link, thanks for the backdrop.", 
   {}, 
   361264, 
   null, 
   1248055260.0
  ], 
  [
   361408, 
   null, 
   "grizzly6626", 
   "Racist stuff like this SHOULD NOT be happening in America. We are better than that.\n\n \n I must agree with this statement Simone, but unfortunately it is still happening. my take on it is that it seems ok for the black race to have their own tv show, to have organizations like the NAACP, their own history month, to be able to call white people names like cracker or honkey or whitebread and that is supposed to be ok, but when it is the white race who even remotely tries any of these, then its us who are the racist. The truth is that the word race is way to loosely used and everyone needs to realise that there is only one true race, and that is the human race. So if you detest racism as much as you say you do, then quit looking at white people only and start looking at everyone the same.", 
   {}, 
   360579, 
   null, 
   1248131760.0
  ], 
  [
   361418, 
   null, 
   "chester", 
   "I must agree with this statement Simone, but unfortunately it is still happening. my take on it is that it seems ok for the black race to have their own tv show, to have organizations like the NAACP, their own history month, to be able to call white people names like cracker or honkey or whitebread and that is supposed to be ok, but when it is the white race who even remotely tries any of these, then its us who are the racist. The truth is that the word race is way to loosely used and everyone needs to realise that there is only one true race, and that is the human race. So if you detest racism as much as you say you do, then quit looking at white people only and start looking at everyone the same.\n\n \n The post quoted above reveals just how perfectly named this thread really is.", 
   {}, 
   361408, 
   null, 
   1248135600.0
  ], 
  [
   361421, 
   null, 
   "antonia", 
   "There are scared white men in America, and scared, for good reason. There are scared brown men, scared black men, scared yellow men, scared red men, scared rainbow men, and scared men with polka dots. Scared for good reason.\n \n It's not about race, so much, IMO, as economics. Jobs are leaving, health care is a crisis, the economy is in a tumble, who is affected by these things? People of all ethnicities and backgrounds.\n \n The powers that be, however, love to see the *little people* scrabble around in the ditch, flinging mud at each other, so they can keep getting away with their garbage. Which is not doing anything about the basic problems in our country which are affecting people of all races and ethnicities. (In that case, how many of those courses are available ... I suppose ...?)\n \n It's interesting, though, to see what kind of crappy teachers they hire to teach these courses, and then, protect such incompetance, when there are so many people out of work, pounding the pavement, including qualified teachers they block out of jobs because of politics and bureaucracy. \n \n Can you imagine, a licensed public school teacher saying this kind of thing to a student, supported by your tax dollars, a union, a deluxe healthcare and retirement plan, and a wonderful summertime vacation (with other vacations and paid days off during the school year). Professionals should, indeed, be shocked.\n \n One would expect a teacher, of all people, to be able to rise above racial conflict and mud-flinging. But, one would expect their colleagues to immediately condemn them, as educators, not the \"scared white men\" of American society. As incompetents working with our children. He's taking the seat of someone who's better qualified.\n \n Why would a public school system protect them? Why would a public school system protect racists in teaching?", 
   {}, 
   360615, 
   null, 
   1248135900.0
  ], 
  [
   361424, 
   null, 
   "CUNxTime", 
   "Ahhhh yes, Race Baiting is the number 1, best way to address race issues in the US today. Bravo!", 
   {}, 
   361421, 
   null, 
   1248136440.0
  ], 
  [
   361425, 
   null, 
   "antonia", 
   "The post quoted above reveals just how perfectly named this thread really is.\n\n \n Actually, I think the thread would be better named, \"racist teachers in the public school system.\"\n \n Why do other teachers protect them?\n \n I accuse you of deceit and hypocrisy.\n \n J'accuse.", 
   {}, 
   361418, 
   null, 
   1248137160.0
  ], 
  [
   361427, 
   null, 
   "antonia", 
   "Ahhhh yes, Race Baiting is the number 1, best way to address race issues in the US today. Bravo!\n\n \n Thank you, that was the term that was eluding me: race baiting.", 
   {}, 
   361424, 
   null, 
   1248137400.0
  ], 
  [
   361433, 
   null, 
   "chester", 
   "Actually, I think the thread would be better named, \"racist teachers in the public school system.\"\n \n Why do other teachers protect them?\n \n I accuse you of deceit and hypocrisy.\n \n J'accuse.\n\n \n Why not cut the act.\n \n Whoever else you may be for the next few hours, you are not and never will be Victor Hugo.\n \n Although, come to think of it, the whole Dreyfus Affair was another example of scared white men who folded under a challenge by someone outside the power elite which thought it was entitled, as a matter of birth, to the top rung of the ladder, very much like today.\n \n If one is not AT the table, one must be content with the crumbs that fall FROM it, and that's not going to happen any more.\n \n I'm frankly enjoying the spectacle of elderly, white Southern reactionaries coming completely unhinged by the sight of a bi-racial man in the White House in a position other than that of a butler.emoticon_smile", 
   {}, 
   361425, 
   null, 
   1248140220.0
  ], 
  [
   361468, 
   null, 
   "CUNxTime", 
   "\n \n I'm frankly enjoying the spectacle of elderly, white Southern reactionaries coming completely unhinged by the sight of a bi-racial man in the White House in a position other than that of a butler.emoticon_smile\n\n \n That's right. Thank god there are finally blacks and Latinos in the whitehouse (besides the help, of course). We've got a black Sec. of Def. and a Black Sec. of State and a Latino Attorney General. Oh wait...those were appointed by those reactionary Republicans! Well, at least a black person is finally head of a national political party. Oh wait...He's HEAD of the Southern Red State Reactionary Republican Party...What gives?\n \n Your race baiting makes YOU look like the fool. You talk about Rush and his ilk spewing hate and misinformation. What do you call it when you purposely deny the achievements of people who gave great service to this country (who happen to belong to certain minority groups)? You act as if blacks haven't make great contributions to this country until Obama. Its disgusting. You are the racist sir. YOU!\n \n Now, if you'll excuse me, I've got to run. I live in the south and we have our mandatory 'keep minority people in servitude meeting' and we'll be voting on whether or not to fine ANY warning shots at brown people we see walking around (since they're probably illegals!).", 
   {}, 
   361433, 
   null, 
   1248153600.0
  ], 
  [
   361472, 
   null, 
   "antonia", 
   "Why not cut the act.\n\n \n I think you have the act. You are the frightened white man.\n \n \nWhoever else you may be for the next few hours, you are not and never will be Victor Hugo.\n\n \n I am, and will be, for the rest of my life, however long that may be (a few hours or many, many healthy years, God Willing), antonia, as I am called here on this forum. \n \n And you are the not the only allowed to quote famous writers or people.\n \n \nI'm frankly enjoying the spectacle of elderly, white Southern reactionaries coming completely unhinged by the sight of a bi-racial man in the White House in a position other than that of a butler.emoticon_smile\n\n \n I have a lot of confidence in President Obama, who he is as a human being and a leader. \n \n I realize there are racists who can't accept an African American president. I don't enjoy that \"spectacle\". I think it's sad and tragic. But I think your intellectually empty reverse racist supremacism is pretty pathetic, too.\n \n I see this as exactly the kind of brawl-in-the-mud the corporate take-over of America desires. I see you as serving their interests with this kind of dumb talk. I am more concerned, at present, with the delivery of humane and decent health care in this country, for example, and to every American, regardless of their ethnicity or background. Many of whom are scared white men.\n \n Go to some clinic in your town sometime. Try the general room or the dental, if they even have it. (And definitely go into more than one to see who's there in different neighborhoods.) Instead of whoever you see under your cushy healthcare plan as retired teacher. Take a look at the people standing on line. All the colors. All ages. Scared white men, too. \n \n Besides, the issue in the original article is an ignorant, racist public school teacher. Isn't that sad? Hired by the public school system. And as raised, how ignorant, bigoted, racist public school teachers are supported by other public school teachers, like yourself, who do not confront or denounce them as incompetent educators. Employing racism in a classroom. Or some other places ...\n \n By diverting against that issue, engaging in race baiting, (NTM other forms of ethnic and gender baiting you have a record of being attracted to), and failing to face the educational issue head on, you do more harm to efforts to end racism than the incompetant teacher who should have been fired.\n \n It's disheartening to read that you taught for so many years in the public school system as a supposedly \"progressive\" teacher, when you can't even call a racist teacher a racist who shouldn't be in front of a classroom. Who's taking the seat of someone who's a lot more qualified than him, but teachers like you, who should know better, and who are in a position to (not non-tenured, not even in a classroom anymore), don't have the cajones to say it at all.\n \n Pardon mois, if I express my literacy, ever-so-threatening-to-you, once more, J'accuse.\n \n I am sorry for any students if they had you as an encouraging and supportive, not to mention un-nasty, writing teacher. Or any of your encouraging and supportive, non-racist, and un-nasty teaching colleagues about the internet. One of whom is really into pitting one minority group against another, too. Keeps 'em in line, ya know. This race-baiting stuff. For the Glory of Walmart. Or was it the meat-packing company poisoning America? I feel like .. vomiting-now-in-slow-motion ... when I think of their Sus domesticus sizzling on a frying pan .. sprinkle pinch 'o' antibiotics, grease, cholesterol, sodium nitrates, hormones, piggie poo mixed with needles, ah the aroma ... but the name just -- a Famous American -- still -- momentarily escapes me. Peas in a pod, anyway, you two. Ka-choo!\n \n YouTube - Jimmy Cliff - The Lion Sleeps Tonight\n \n http://www.powersportskids.com/images/content/WomanDancing.jpg\n \n http://www.runswithdog.com/assets/images/tn_cow-tongue.jpg", 
   {}, 
   361433, 
   null, 
   1248154380.0
  ], 
  [
   361737, 
   null, 
   "chester", 
   "I think you have the act. You are the frightened white man. \n\n \n WOW!!\n \n Not one, not two, but THREE assumptions on one sentence.", 
   {}, 
   361472, 
   null, 
   1248296580.0
  ], 
  [
   361827, 
   null, 
   "Winston Smith", 
   "I am not white and I am not scared, maybe because I am not American. emoticon_xclown\n \n I think American women scare the poor men. We don't have that problem in Latin America. There is only one place we allow them to be on top, for a short or long while. emoticon_xclown", 
   {}, 
   361737, 
   null, 
   1248345300.0
  ], 
  [
   361933, 
   null, 
   "mae", 
   "Yes, your trade mark sexual innuendos.\n \n I have seen this countless times...first throw out a bait and see if any female poster bites, than if you get lucky and the bait is taken then get more sexually explicit. You are shameless - would you like your daughter to be a victim of this tactic?\n \n \n PS: Yes, I am waiting with bated breath for the \"poor me, victim of nasty mae\" response. Your usual defense when you get exposed for what you really are.", 
   {
    "post_info": {
     "post_title": "s"
    }
   }, 
   361827, 
   null, 
   1248394320.0
  ], 
  [
   361935, 
   null, 
   "Winston Smith", 
   "It is a pity that you do not get my humour. Perhaps it is too intelligent for you. Instead of answering wittily you resort to your old habit - bashing Europeans.", 
   {
    "unicode_changes_made": true
   }, 
   361933, 
   null, 
   1248396840.0
  ], 
  [
   361968, 
   null, 
   "Baron", 
   "I love that \"ignore list\". Just add a name and click okay.", 
   {}, 
   361935, 
   null, 
   1248409620.0
  ], 
  [
   362005, 
   null, 
   "snakespit", 
   "It is a pity that you do not get my humour. Perhaps it is too intelligent for you. Instead of answering wittily you resort to your old habit - bashing Europeans.\n\n \n Your location says Sydney, your previous post said Latin America, and then your last post said Europeans? Am I missing something?", 
   {
    "unicode_changes_made": true
   }, 
   361935, 
   null, 
   1248452580.0
  ], 
  [
   362106, 
   null, 
   "Winston Smith", 
   " Am I missing something?\n\n \n \n Yes, you are but \"mae' isn't.\n \n emoticon_xclown", 
   {}, 
   362005, 
   null, 
   1248492540.0
  ], 
  [
   362163, 
   null, 
   "Baron", 
   "Your location says Sydney, your previous post said Latin America, and then your last post said Europeans? Am I missing something?\n\n \n Whatever it is that Winston is blabbing about makes sense, but only to him.\n Like a chameleon changes color, depending on the topic he changes anything involving his background and beliefs at the drop of a hat. His other problem is a bad memory.", 
   {}, 
   362005, 
   null, 
   1248543780.0
  ], 
  [
   362208, 
   null, 
   "mae", 
   "Whatever it is that Winston is blabbing about makes sense, but only to him.\n Like a chameleon changes color, depending on the topic he changes anything involving his background and beliefs at the drop of a hat. His other problem is a bad memory.\n\n \n Yep, that describes Winston to a T in all the forums we have encountered him over the years. I believe the correct term for this kind of behviour is - pathological liar. I was especially amused by his tale of his Lebanese mechanic, almost shed tears till I remembered that he used to frequently hurl racial slurs when referring to Lebanese people.", 
   {}, 
   362163, 
   null, 
   1248586920.0
  ], 
  [
   362209, 
   null, 
   "Winston Smith", 
   "Your location says Sydney, your previous post said Latin America, and then your last post said Europeans? Am I missing something?\n\n \n sorry, snake. \n \n I was born in Chile and raised and educated there. I settled in Australia a long time ago and reside in Sydney.\n \n that intriguing posting of mine you referred to is a 'private' joke between 'mae' and I. she knows perfectly well what I was referring to. emoticon_xangel\n \n I call 'mae' and 'baron' my fan-club, my groupies who follow me wherever I go, saying nice things about me.\n \n emoticon_xclown", 
   {
    "post_info": {
     "post_title": "explanation follows"
    }
   }, 
   362005, 
   null, 
   1248588720.0
  ], 
  [
   362417, 
   null, 
   "Nebuchadnezzar", 
   "Expecting other humans to treat you as an equal is like expecting all food to taste amazing.", 
   {}, 
   360828, 
   null, 
   1248673860.0
  ], 
  [
   362423, 
   null, 
   "CUNxTime", 
   "You can't ultimately decide how someone's going to treat you. You CAN determine how you treat others...and you'll find that often, that's the most important thing.", 
   {}, 
   362417, 
   null, 
   1248675540.0
  ], 
  [
   362745, 
   null, 
   "chester", 
   "You can't ultimately decide how someone's going to treat you. You CAN determine how you treat others...and you'll find that often, that's the most important thing.\n\n \n Yes, and if Sgt. Crowley had acted in a way that he himself would have wanted to be treated instead of acting as a pig with a badge and a gun, the whole scene would have never gone down.\n \n He owes an apology to Professor Gates AND an acknowledgment that the President spoke the truth - that he did act stupidly.", 
   {}, 
   362423, 
   null, 
   1248828120.0
  ], 
  [
   362773, 
   null, 
   "CUNxTime", 
   "Yes, and if Sgt. Crowley had acted in a way that he himself would have wanted to be treated instead of acting as a pig with a badge and a gun, the whole scene would have never gone down.\n \n He owes an apology to Professor Gates AND an acknowledgment that the President spoke the truth - that he did act stupidly.\n\n \n Look brother, I've been on the wrong end of a night stick plenty of times but somehow I've managed to come through it with more sense then you've got about cops. You're viewing the world through tainted eyes. It's not logical. I've met \"bad' cops and met more good ones...Crowley is a good one and if you can't see that then you should probably admit your bias and we can all move on to something else.....", 
   {}, 
   362745, 
   null, 
   1248835800.0
  ], 
  [
   362830, 
   null, 
   "Winston Smith", 
   "You can't ultimately decide how someone's going to treat you. You CAN determine how you treat others...and you'll find that often, that's the most important thing.\n\n \n \n yes, but no matter how you treat a spider, it will bite you if it can. However I don't tread on them.\n \n The same applies to people, I don't get even or trade insults with those who insult me. I am not good at hating those such as 'mae' and 'baron' who hate me.\n \n I think there are two kind of people in this world: haters and lovers, 'mae' and 'baron' are life time members of the former group, mois belong to the latter.\n \n :)emoticon_love:)", 
   {}, 
   362423, 
   null, 
   1248865560.0
  ], 
  [
   362855, 
   null, 
   "chester", 
   "Look brother, I've been on the wrong end of a night stick plenty of times but somehow I've managed to come through it with more sense then you've got about cops. You're viewing the world through tainted eyes. It's not logical. I've met \"bad' cops and met more good ones...Crowley is a good one and if you can't see that then you should probably admit your bias and we can all move on to something else.....\n\n \n No, YOU look. There is no way in the world that the blame for this mess can be laid anywhere other than at the feet of this pig of a cop.\n \n Considering that the vast majority of cops do a dangerous job honestly, bravely, and honorably, this guy disgraces the badge with his racist, lying attitude.\n \n Why did you put the word BAD in quotes and not the word good? Words and their expression carry meaning, and yous speak volumes.\n \n BTW, you right, I am biased. I'm biased in that I believe that cops should treat everyone with dignity and respect, if for no other reason that they work for us and we pay them.", 
   {}, 
   362773, 
   null, 
   1248881880.0
  ], 
  [
   362862, 
   null, 
   "CUNxTime", 
   "No, YOU look. There is no way in the world that the blame for this mess can be laid anywhere other than at the feet of this pig of a cop.\n \n Considering that the vast majority of cops do a dangerous job honestly, bravely, and honorably, this guy disgraces the badge with his racist, lying attitude.\n \n Why did you put the word BAD in quotes and not the word good? Words and their expression carry meaning, and yous speak volumes.\n \n BTW, you right, I am biased. I'm biased in that I believe that cops should treat everyone with dignity and respect, if for no other reason that they work for us and we pay them.\n\n \n Unfortunately, you've picked a cop that teaches diversity, non-profiling, and is racked with guilt over not being able to save a black guy's life 16 years ago. You are a fanatic on this issue just as some others are on abortion and on Christianity. I'm trying to stop arguing with people where its pointless. We can just agree to disagree on this one.", 
   {}, 
   362855, 
   null, 
   1248884280.0
  ], 
  [
   362912, 
   null, 
   "Steeeeve", 
   "Unfortunately, you've picked a cop that teaches diversity, non-profiling, and is racked with guilt over not being able to save a black guy's life 16 years ago. You are a fanatic on this issue just as some others are on abortion and on Christianity. I'm trying to stop arguing with people where its pointless. We can just agree to disagree on this one.\n\n \n Hey! Don't lump those of us who have faith and are against abortion with the logic of chester...that's just wrong.", 
   {}, 
   362862, 
   null, 
   1248908460.0
  ], 
  [
   362955, 
   null, 
   "CUNxTime", 
   "Hey! Don't lump those of us who have faith and are against abortion with the logic of chester...that's just wrong.\n\n \n Its the same thing SOMETIMES... illogical fanaticism and intractability is impossible to reason with.....", 
   {}, 
   362912, 
   null, 
   1248920820.0
  ], 
  [
   363145, 
   null, 
   "Winston Smith", 
   "\n BTW, you right, I am biased. I'm biased in that I believe that cops should treat everyone with dignity and respect, if for no other reason that they work for us and we pay them.\n\n \n so a rent-a-cop cop can beat the sh*t out of you because he doesn't work for you and you don't pay him emoticon_rolleyes as long as it is free ...", 
   {}, 
   362855, 
   null, 
   1249004400.0
  ], 
  [
   363160, 
   null, 
   "antonia", 
   "I don't know why people are still arguing about this. Everyone's going to have a Budweiser together in Washington.", 
   {}, 
   363145, 
   null, 
   1249008000.0
  ], 
  [
   363165, 
   null, 
   "antonia", 
   "Excuse me,\n \n The beers:&#8232;\n POTUS: Bud Light&#8232;\n VPOTUS: Bucklers&#8232;\n Gates: Sam Adams Light&#8232;\n Crowley: Blue Moon\n \n http://www.projo.com/photos/20070523/fd0523_beer_05-23-07_O65JGDB.jpg", 
   {}, 
   363160, 
   null, 
   1249011120.0
  ], 
  [
   363170, 
   null, 
   "antonia", 
   "Why do the IMGs sometimes work and sometimes don't? Anyone know? Of any ethnicity, profession or class background?\n \n I thought they'd stopped working permanently. Then, I just used it o.k. on Archangel's avatar contest thread (since I saw it was working for him there), but now, it's not working again.\n \n I'm using the same typing; i.e. whatever the url for the photo is", 
   {
    "post_info": {
     "post_title": "Btw ..."
    }
   }, 
   363165, 
   null, 
   1249012020.0
  ], 
  [
   363282, 
   null, 
   "antonia", 
   "testing 123 123\n \n http://oldstersview.files.wordpress.com/2006/08/cup-of-coffee.jpg", 
   {}, 
   363170, 
   null, 
   1249111380.0
  ], 
  [
   363470, 
   null, 
   "CUNxTime", 
   "testing 123 123\n \n http://oldstersview.files.wordpress.com/2006/08/cup-of-coffee.jpg\n\n \n \nWhy do the IMGs sometimes work and sometimes don't? Anyone know? Of any ethnicity, profession or class background?\n \n I thought they'd stopped working permanently. Then, I just used it o.k. on Archangel's avatar contest thread (since I saw it was working for him there), but now, it's not working again.\n \n I'm using the same typing; i.e. whatever the url for the photo is\n\n \n \nExcuse me,\n \n The beers:&#8232;\n POTUS: Bud Light&#8232;\n VPOTUS: Bucklers&#8232;\n Gates: Sam Adams Light&#8232;\n Crowley: Blue Moon\n \n http://www.projo.com/photos/20070523/fd0523_beer_05-23-07_O65JGDB.jpg\n\n \n \nI don't know why people are still arguing about this. Everyone's going to have a Budweiser together in Washington.\n\n \n \n \n So which is it...stiffle the debate, derail the thread, or just post non-pertinent teacups? Hey, how about all 3!!!!", 
   {}, 
   363160, 
   null, 
   1249225680.0
  ], 
  [
   363475, 
   null, 
   "Chuz Life", 
   "Its the same thing SOMETIMES... illogical fanaticism and intractability is impossible to reason with.....\n\n \n Some of us who are passionate and admittedly fanatic about an issue are actually less stubborn than you may be willing to give us credit for, Cunx.", 
   {
    "post_info": {
     "post_title": "Some fanatics,..."
    }
   }, 
   362955, 
   null, 
   1249227060.0
  ], 
  [
   363492, 
   null, 
   "antonia", 
   "Hmm it looks like those who were hoping this incident would stir racial hatred and animosity throughout America, and denigrate the Obama administration as well, aren't going to get their way. \n \n Gates and Crowley are going to meet again for beers in Cambridge.\n \n Can the hater-mongers stand it? The ignoble moment these two gentlemen shared in the limelight is going to be turned into another one of America's blessings instead.\n \n With President Obama's beer diplomacy appearing to be working quite well.\n \n (Though certainly not recommended as a practice with all persons. Don't necessarily *do this at home* yourself. For example, stay away people bent on all types of sexist and racist profanity. Like men who call women names. Do not share a beer or conversation with such individuals without a police officer present.)", 
   {}, 
   363475, 
   null, 
   1249235040.0
  ], 
  [
   363523, 
   null, 
   "CUNxTime", 
   "Wow she's putting the train back on track. And she's even RIGHT!!! Gates didn't get his chance to be race baiting Hero. Unfortunately for him, he got the worst possible cop... a cop who's color blind. Gates has wanted for years to fan the fires of racial tension but missed his chance to throw gas on a fire of his own creation.", 
   {}, 
   363492, 
   null, 
   1249243800.0
  ], 
  [
   363536, 
   null, 
   "chester", 
   "Wow she's putting the train back on track. And she's even RIGHT!!! Gates didn't get his chance to be race baiting Hero. Unfortunately for him, he got the worst possible cop... a cop who's color blind. Gates has wanted for years to fan the fires of racial tension but missed his chance to throw gas on a fire of his own creation.\n\n \n I think there is a misprint in the last sentence of your post. You inadvertently substituted \"Gates\" for \"Crowley\".emoticon_idea", 
   {}, 
   363523, 
   null, 
   1249246620.0
  ], 
  [
   372274, 
   null, 
   "OldSarge", 
   "I think there is a misprint in the last sentence of your post. You inadvertently substituted \"Gates\" for \"Crowley\".emoticon_idea\n\n \n Raeding comporehension off a bit eh. Try reading the black part.", 
   {}, 
   363536, 
   null, 
   1254519540.0
  ], 
  [
   373242, 
   null, 
   "antonia", 
   "Well everyone is off. I was referring to neither Gates or Crowley, but those wishing to exploit this story for malevolent ends.\n \n Comatose company no exception.", 
   {}, 
   372274, 
   null, 
   1254965700.0
  ], 
  [
   375313, 
   null, 
   "OldSarge", 
   "Well everyone is off. I was referring to neither Gates or Crowley, but those wishing to exploit this story for malevolent ends.\n \n Comatose company no exception.\n\n \n Alas poor antonia I knew her well.", 
   {}, 
   373242, 
   null, 
   1256311140.0
  ], 
  [
   376177, 
   null, 
   "ImYY4U", 
   "This tells the story so well:\n \n Daily Kos: Dear Scared White Men of America\n \n Oversized bullies jumping a smaller girl. Yeah, I am so impressed by these macho macho men...\n\n \n That's the great thing about the anonymous internet - anyone can write anything he wants to and not have to back it up. The fact that this drivel came from the Daily Kos says all that needs to be said about the veracity of it. There are liberal whites infesting these forums who pretend to be black and telling lie after lie about how wonderful and great some other people who are considered by them to be \"disadvantaged,\" and \"underpriviledged.\"\n \n This little anecdote could have been written by any socialist, communist Kos staffer with the intention of promoting the \"poor underclass,\" and this writer has no doubt it was. There is a surfeit of would-be propagandists using the net for such dishonorable purposes, and it is so obvious it is laughable.\n \n As far as the gist of the \"story\" is concerned, how many poor, innocent little white children get beaten up and have their lunch money stolen from them on a daily basis by these \"minorities?\"", 
   {}, 
   360437, 
   null, 
   1257034740.0
  ], 
  [
   376180, 
   null, 
   "ImYY4U", 
   "Sez you.\n \n So, what you so scared of?\n\n \n I don't know what he may be scared of, if anything, but as far as myself, I am scared to death of being shot, stabbed, beaten or otherwise harmed by some \"minority\" whenever I am simply walking down the street in a blighted neighborhood that I must go into for business purposes.\n \n It is an uncontested fact that the males of the \"underclasses\" are much more prone to violence and are particularly vicious toward whites, when the opportunity presents itself, and that is part of the reason there are so many of them in our penitentiaries.", 
   {}, 
   360478, 
   null, 
   1257035160.0
  ], 
  [
   376181, 
   null, 
   "ImYY4U", 
   "Racist stuff like this SHOULD NOT be happening in America. We are better than that.\n\n \n Well, most of us are.", 
   {}, 
   360579, 
   null, 
   1257035340.0
  ], 
  [
   376182, 
   null, 
   "ImYY4U", 
   "We Americans. \n \n Hmmm, Zimbabwe, the case of farmers in South Africa.\n \n The colonialists, the conquerors who stole the land of those who were there before they, the Europeans, marched in with their superior weaponry.\n \n The same thing happened in America. We are still dealing with that.\n\n \n The Colonialists who brought civilization to the jungle? The ones who brought hospitals, schools, libraries, automobiles, medicines, newspapers, farms, etc. to an area that was sliding back into the primitive state it was in for eons before they came? Those Colonialists? The ones whose absence now is the cause of the hunger, wars, savagery, killing and corruption that now reigns? Oh, those.", 
   {}, 
   360583, 
   null, 
   1257035640.0
  ], 
  [
   376183, 
   null, 
   "ImYY4U", 
   "The curse of Zimbabwe is President Robert Mugabe whose rule has been characterized by economic mismanagement, hyperinflation, and widespread reports of human rights abuses.\n\n \n You forgot the encouragement of murder of the white settlers.", 
   {}, 
   360596, 
   null, 
   1257035760.0
  ], 
  [
   376185, 
   null, 
   "ImYY4U", 
   "CUNx,\n \n My life experiences closely parallel yours, with the exception that my growing up years were in a dying industrial city in the Northeast.\n \n My left/liberal/radical views were formed in the same crucible as yours.\n \n I came away with the firm conviction that the government has the right, duty, and obligation to ensure that no on else's children should have to experience what I did.\n\n \n And where in the Constitution will we find that right, duty, and obligation delineated, old pal?", 
   {}, 
   360745, 
   null, 
   1257036120.0
  ], 
  [
   376186, 
   null, 
   "ImYY4U", 
   "You guys are getting way off topic here with all these stories of positive life experiences and how any person can be a victim or a perpetrator of racism.\n \n Can we please get back to bashing white males like Simone wants?\n\n \n Hahahahahahahhah!!", 
   {}, 
   360825, 
   null, 
   1257036360.0
  ], 
  [
   376187, 
   null, 
   "ImYY4U", 
   "And I have seen people so crushed by that capitalist system that they were harried into an early grave.\n \n That's a terrible way to learn a lesson.\n \n That is far more terrifying that dependency on the government which, as you must recognize, is a myth.\n \n Thanks to the welfare reform bill signed by President Clinton, no individual may stay on public assistance more than five years LIFETIME.\n \n My biggest mistake was the failure to realize that we are all in this together - that each of us has a responsibility to all the rest of us, that it does take a village to raise a child, that we must all learn to live more simply in order that others may simply live, that John Galt is simply a character in a VERY bad novel.\n\n \n President Clinton is such a bleeding-heart, tax-and-spend, big government, liberal.", 
   {}, 
   360854, 
   null, 
   1257036540.0
  ], 
  [
   376189, 
   null, 
   "ImYY4U", 
   "Chester, where in the world do you get this tribble??\n \n I am not responsible for you, no more than you are responsible for me! It does not take a village to raise a child, and I'll thank you AND the village to stay out of my business.\n \n By what law, constitutional or otherwise do you justify such a belief?\n\n \n Good post, Steamroller!", 
   {}, 
   360875, 
   null, 
   1257036660.0
  ], 
  [
   376191, 
   null, 
   "ImYY4U", 
   "Then go to your own desert island and play at being Robinson Crusoe.\n \n For myself, I am well pleased that my food is government inspected, my prescriptions meet government safety standards, my water is fit to drink due to government standards, that my house meets government building codes, that my taxes pay for fire protection and roads, that my doctor must meet government standards, and all the other things in life you take so for granted.\n \n Continue your mythologizing if you wish, but the reality is that you depend on others every day of your life, and you are well pleased that you are.\n \n Even Aristotle told us that man is a social animal.\n\n \n Those things you mention that your taxes pay for are acceptable expenses for government, but not the billions that are wasted on the idle, indolent, lazy jerks who live off the taxpayer tit, and the trillions wasted buying the foreign lobbies who extort our taxes from a corrupt Congress. When all the waste is removed from government, the remaining taxes will be justified.", 
   {}, 
   360952, 
   null, 
   1257036960.0
  ], 
  [
   376192, 
   null, 
   "ImYY4U", 
   "Exactly, tyranny of the majority is the wost kind there is.\n\n \n That should read \"tyranny of the weak against the majority.\"", 
   {}, 
   360974, 
   null, 
   1257037020.0
  ], 
  [
   376193, 
   null, 
   "ImYY4U", 
   "I need someone to watch the kids and help get the yard work done this weekend Chester, what time will you be here?\n\n \n The best place to find a helping hand is at the end of your own arm.", 
   {}, 
   360982, 
   null, 
   1257037080.0
  ], 
  [
   376195, 
   null, 
   "ImYY4U", 
   "It is a pity that you do not get my humour. Perhaps it is too intelligent for you. Instead of answering wittily you resort to your old habit - bashing Europeans.\n\n \n What else can you do with them?", 
   {
    "unicode_changes_made": true
   }, 
   361935, 
   null, 
   1257037740.0
  ], 
  [
   376196, 
   null, 
   "Archangel", 
   "Those things you mention that your taxes pay for are acceptable expenses for government, but not the billions that are wasted on the idle, indolent, lazy jerks who live off the taxpayer tit, and the trillions wasted buying the foreign lobbies who extort our taxes from a corrupt Congress. When all the waste is removed from government, the remaining taxes will be justified.\n\n \n Welcome to the forum ImYY4U. Your input and perspective is greatly needed around here. emoticon_xgood", 
   {}, 
   376191, 
   null, 
   1257037860.0
  ], 
  [
   376197, 
   null, 
   "ImYY4U", 
   "sorry, snake. \n \n I was born in Chile and raised and educated there. I settled in Australia a long time ago and reside in Sydney.\n \n that intriguing posting of mine you referred to is a 'private' joke between 'mae' and I. she knows perfectly well what I was referring to. emoticon_xangel\n \n I call 'mae' and 'baron' my fan-club, my groupies who follow me wherever I go, saying nice things about me.\n \n emoticon_xclown\n\n \n But where were you allegedly educated? The correct grammar is \"... between 'mae' and \"ME\".", 
   {}, 
   362209, 
   null, 
   1257037860.0
  ], 
  [
   376198, 
   null, 
   "ImYY4U", 
   "Welcome to the forum ImYY4U. Your input and perspective is greatly needed around here. emoticon_xgood\n\n \n Thank you for the welcome. I will stay here as long as I am allowed to.", 
   {}, 
   376196, 
   null, 
   1257038100.0
  ], 
  [
   376260, 
   null, 
   "simone", 
   "Devoted worshiper of Ayn Rand?", 
   {}, 
   376198, 
   null, 
   1257101100.0
  ], 
  [
   376274, 
   null, 
   "OldSarge", 
   "Devoted worshiper of Ayn Rand?\n\n \n Devoted worshiper of Mao?", 
   {}, 
   376260, 
   null, 
   1257107220.0
  ], 
  [
   376277, 
   null, 
   "simone", 
   "You're far more familiar -- and comfortable -- with the teachings of of Mao than I, OS.", 
   {}, 
   376274, 
   null, 
   1257107400.0
  ], 
  [
   376284, 
   null, 
   "OldSarge", 
   "You're far more familiar -- and comfortable -- with the teachings of of Mao than I, OS.\n\n Yes like you would know baby. Its known as projection. Google it if you can.", 
   {}, 
   376277, 
   null, 
   1257107940.0
  ], 
  [
   376307, 
   null, 
   "Ethmi", 
   "I could imagine the reaction if someone started a thread called \"Dear Scared Black Men of America.\"", 
   {}, 
   376284, 
   null, 
   1257116340.0
  ], 
  [
   376309, 
   null, 
   "gansao", 
   "I could imagine the reaction if someone started a thread called \"Dear Scared Black Men of America.\"\n\n \n Dare ya:)......", 
   {}, 
   376307, 
   null, 
   1257116700.0
  ], 
  [
   376395, 
   null, 
   "ImYY4U", 
   "Devoted worshiper of Ayn Rand?\n\n \n Who is Ayn Rand?", 
   {}, 
   376260, 
   null, 
   1257186420.0
  ], 
  [
   376397, 
   null, 
   "gansao", 
   "Who is Ayn Rand?\n\n \n Try google\n Hope this helps", 
   {}, 
   376395, 
   null, 
   1257186540.0
  ], 
  [
   376399, 
   null, 
   "ImYY4U", 
   "Try google\n Hope this helps\n\n \n It was tongue in cheek, as in \"who is John Galt?\" Get it?", 
   {}, 
   376397, 
   null, 
   1257187140.0
  ], 
  [
   376401, 
   null, 
   "gansao", 
   "It was tongue in cheek, as in \"who is John Galt?\" Get it?\n\n \n Yeah...HA,HA HA HA HA", 
   {}, 
   376399, 
   null, 
   1257187440.0
  ], 
  [
   376416, 
   null, 
   "JPSartre12", 
   "Devoted worshiper of Ayn Rand?\n\n \n Simone,\n Since you started this thread and appear to have the need to demonize white males, maybe you can answer 2 questions for me.\n \n What color are the rulers of the most brutal regimes in Africa? \n How do they compare with the former/current white rulers in Africa?", 
   {}, 
   376260, 
   null, 
   1257189540.0
  ], 
  [
   407656, 
   null, 
   "LeeRain", 
   "Well everyone is off. I was referring to neither Gates or Crowley, but those wishing to exploit this story for malevolent ends.\n \n Comatose company no exception.", 
   {}, 
   373242, 
   null, 
   1279511520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Dear Scared White Men of America...", 
  "url": "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 12980, 
  "discussion_files": [
   [
    "4815.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-print.html"
   ], 
   [
    "4816.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-9-print.html"
   ], 
   [
    "4817.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-7-print.html"
   ], 
   [
    "4818.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-5-print.html"
   ], 
   [
    "4819.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-4-print.html"
   ], 
   [
    "4820.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-6-print.html"
   ], 
   [
    "4821.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-8-print.html"
   ], 
   [
    "4822.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-3-print.html"
   ], 
   [
    "4823.html", 
    "http://www.4forums.com/political/civil-rights-debates/12980-dear-scared-white-men-america-2-print.html"
   ]
  ], 
  "identifier": 12980
 }
]