[
 [
  [
   361822, 
   null, 
   "foundit66", 
   "Well, in a result that he will probably accept as downright apocalyptic for America, The Daily Show's Jon Stewart has been selected, in an online poll conducted by Time Magazine, as America's Most Trusted Newscaster, post-Cronkite. Matched up against Brian Williams, Katie Couric and Charlie Gibson, Stewart prevailed with 44 percent of the vote. Now, if we're being honest, he probably managed to prevail as the winner precisely because he was the odd man out in a field of network news anchors. Nevertheless, I think Jim Cramer should feel free to SNACK ON THAT.\n \n Brian Williams drew the second largest percentage of votes, with 29 percent. Gibson and Couric finished third and fourth, respectively, with 19 and 7 percent of the vote.\n \n Time has helpfully broken out the results, state-by-state, so if you want to muse on some anomalous results, feel free. Brian Williams won Arizona, Wyoming, Nebraska, North Dakota, Florida, South Carolina, Indiana, Delaware and Vermont, and tied in Kentucky and Alaska. Charlie Gibson was big in Tennessee and Montana. Katie Couric pulled off the Mondalian feat of winning one state: Iowa.\n \n Stewart finished no lower than second place in all states, except, curiously, Vermont. \n\n Online Poll: Jon Stewart Is America's Most Trusted Newsman\n Poll Results - Now that Walter Cronkite has passed on, who is America's most trusted newscaster? | TIME\n \n I think the first sentence is dead-on...\n But at the same time, there are reasons for the poll results.\n \n Just take the recent Governor Sanford thing. People sent Sanford letters kissing his posterior proclaiming they would help him get \"Sanford's message out\" if he would agree to come on their show.\n \n Jon Stewart is honest enough to criticize the media...\n He is also honest enough to admit what his show really is. You don't get that from too many anchors...", 
   {
    "post_info": {
     "post_title": "Jon Stewart Is America's Most Trusted Newsman"
    }
   }, 
   null, 
   null, 
   1248326700.0
  ], 
  [
   361891, 
   null, 
   "DrNo", 
   "Personally, I find network news anchors much more humorous than Jon Stewart because they are actually attempting to be serious.", 
   {}, 
   361822, 
   null, 
   1248376080.0
  ], 
  [
   361900, 
   null, 
   "CUNxTime", 
   "Colbert is better!", 
   {}, 
   361891, 
   null, 
   1248380700.0
  ], 
  [
   362630, 
   null, 
   "Steeeeve", 
   "Yeah, Stewart tries to be serious sometimes as well and it comes across annoying. He is nothing more than a liberal comic....which is odd because while the others are liberal they aren't comics :) Colbert is probably better because he is playing a character and never tries to be more than that. The right-wing ##### works for him and so you can just enjoy.\n \n Both offer no real news. What a sad poll.", 
   {}, 
   361900, 
   null, 
   1248794220.0
  ], 
  [
   363529, 
   null, 
   "keyztone", 
   "It's not Bill O'Reilly????????\n \n :p", 
   {}, 
   361822, 
   null, 
   1249245120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Jon Stewart Is America's Most Trusted Newsman", 
  "url": "http://www.4forums.com/political/news-forum/13016-jon-stewart-americas-most-trusted-newsman.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 13016, 
  "discussion_files": [
   [
    "30954.html", 
    "http://www.4forums.com/political/news-forum/13016-jon-stewart-americas-most-trusted-newsman-print.html"
   ]
  ], 
  "identifier": 13016
 }
]