[
 [
  [
   361721, 
   null, 
   "Superlite27", 
   "O.K. I thought banning guns was supposed to make Britain a shiny, happy place filled with rainbows and polka-dots.\n \n Evidently, there is now a problem with \"knife crime\".\n \n BBC NEWS | UK | Deaths up during anti-knife drive\n \n So they ban carrying knives.\n \n Since the criminals will soon have no knives to commit their crimes with, do you think Britain will ban pointy sticks next?\n \n After pointy sticks are banned, and the criminals start using rocks, will rocks be banned?\n \n After that, when the criminals (who will continue to break the law with WHATEVER INANIMATE OBJECT PROVIDES AN ADVANTAGE OVER UNARMED VICTIMS, hence: CRIMINALS) resort to using bare knuckles.....\n \n \n .....how will they ban fists?\n \n Hmmmmmmm. Do you think anyone there realizes that CRIMINALS are CRIMINALS regardless of the inanimate object they use?\n \n Or is it still the gun's fault? Because if it was the gun, it is now the knife.\n \n Soon to be the pointy stick, next the rock, and then the fist.\n \n Yup. Blame it on the object used (gun) and you will soon have to tranfer the blame to the next item.......\n \n ...until you run out of items to blame it on.\n \n Then what will anti-(insert inanimate object)'s blame crime on?", 
   {
    "post_info": {
     "post_title": "What can Britain ban next?"
    }
   }, 
   null, 
   null, 
   1248289680.0
  ], 
  [
   361722, 
   null, 
   "sinjin", 
   "I for one would prefer to face an attacker using his fists over one with a rock, a rock over a pointy stick, a pointy stick over a knife and a knife over a gun. \n Do you see the threat from each of these as equivalent?", 
   {}, 
   361721, 
   null, 
   1248290160.0
  ], 
  [
   361725, 
   null, 
   "Tither", 
   "His point is, that, bans are not working as crime control.\n \n \nThe number of knife deaths in areas targeted by an anti-knife crime scheme has risen, the Home Office has said.\n\n \n Remembering that if one wants to procure an illegal gun one can.\n \n   Weapons sell for just £50 as suspects and victims grow ever younger \n Senior police officers have been warning for several months that a growing number of teenagers in big cities are becoming involved in gun crime. \n \n The age of victims and suspects has fallen over the past three years as the availability of firearms in some cities has risen.\n \n \"Illegal firearms have become increasingly accessible to younger offenders who appear more likely to use these firearms recklessly,\" a report on gun crime commissioned by the Home Office cautioned last year.\n\n \n   Shotguns for £50: study reveals weapons culture  \n Sawn-off shotguns are still the weapon of choice for the more serious armed criminal and can now be bought illegally for between £50 and £200, according to Home Office research. A purpose-built 9mm handgun, which is easier to conceal than a shotgun, is available for £1,000-£1,400 on the back streets of Britain while those wanting \"a gangster image\" can buy a  machine gun  for £800.\n \n Even though those interviewed were in prison, many still viewed gun crime as a \"viable career option\" enabling them to overcome their deprived backgrounds to secure wealth and status. One man from Greater Manchester claimed he had earned £52,000 in a week from gun crime. The study shows that though Nottingham is dubbed Britain's gun crime capital, guns are far more available in Manchester, Liverpool, Birmingham and London.\n", 
   {
    "unicode_changes_made": true
   }, 
   361722, 
   null, 
   1248293100.0
  ], 
  [
   361749, 
   null, 
   "sinjin", 
   "His point is, that, bans are not working as crime control.\n\n \n There is no reason to expect gun control to reduce all crime, only the incidence of crimes where guns are used. Care to speak to the AIC data showing exactly that after their buy back? \n \n \nRemembering that if one wants to procure an illegal gun one can.\n \n   Weapons sell for just £50 as suspects and victims grow ever younger \n \n   Shotguns for £50: study reveals weapons culture  \n\"A purpose-built 9mm handgun, which is easier to conceal than a shotgun, is available for £1,000-£1,400 on the back streets of Britain.\"\n \n sinjin - That's between $1600 and $2300.\n \n How much do you suppose a 9mm fetches on the American black market?", 
   {}, 
   361725, 
   null, 
   1248300480.0
  ], 
  [
   361757, 
   null, 
   "Doc Jones", 
   "There is no reason to expect gun control to reduce all crime, only the incidence of crimes where guns are used. Care to speak to the AIC data showing exactly that after their buy back?\n\n \n http://www.ic-wish.org/McPhedran%20Baker%20Impact%20of%20Australias%20Gun%20Laws%20Executive%20Summary_180408.pdf", 
   {}, 
   361749, 
   null, 
   1248302700.0
  ], 
  [
   361764, 
   null, 
   "Doc Jones", 
   "Why is it sinjin that people like you who flout the laws of this Republic and repudiate them make claims like you have evidence that the giant Australian gun ban worked but no proof of your own?\n \n So you bluff hoping we haven't done research and crossed all the t and dotted the i in hopes we can't come up with research from a gun grabber country to refute what you hope would be true? FYI, Dr. Baker and several others used to correspond...it is a small world ain't it :)\n \n Meanwhile, you state something like it should be true and obvious with great hopes that it is when it is NOT! You talk much but do very little. Methinks you are out of your league like your other little buddies?\n \n Oh, I furnished the first page, you will have to purchase the rest for your reading pleasure :) emoticon_xhoho", 
   {}, 
   361757, 
   null, 
   1248303780.0
  ], 
  [
   361765, 
   null, 
   "sinjin", 
   "Well, I think it is best to use a real source. Like the Australian FBI, called the A.I.C.\n\n \n Australian Institute of Criminology - Homicide weapon statistics\n \n \n The International Coalition for Women in Shooting and Hunting (WiSH)\n \n Great source. Too funny.\n \n Talking with you always makes me feel like I need a shower afterwards.", 
   {}, 
   361764, 
   null, 
   1248303960.0
  ], 
  [
   361767, 
   null, 
   "Doc Jones", 
   "Australian Institute of Criminology - Homicide weapon statistics\n \n \n The International Coalition for Women in Shooting and Hunting (WiSH)\n \n Great source. Too funny.\n \n Talking with you always makes me feel like I need a shower afterwards.\n\n \n Yeah, laugh at that:\n The number of murder victims fluctuated slightly from 1993 to 2007, whereas manslaughter remained relatively stable. \n The number of murder victims peaked in 1999, at 344; the number of manslaughter victims peaked in 2002, at 48. \n The 253 murder and 29 manslaughter victims recorded in 2007 were the lowest annual number yet recorded. \n \n The percentage of homicides committed with a firearm continued a declining trend which began in 1969. In 2003, fewer than 16% of homicides involved firearms. The figure was similar in 2002 and 2001, down from a high of 44% in 1968. \n \n If you ever showered it would be golden :)", 
   {}, 
   361765, 
   null, 
   1248304800.0
  ], 
  [
   361769, 
   null, 
   "sinjin", 
   "\"The two academics who authored the study, Jeanine Baker and Samara McPhedran, made a point of noting their membership in different pro-gun organizations, to head off criticism they were hiding important personal information.\"", 
   {}, 
   361767, 
   null, 
   1248305280.0
  ], 
  [
   361772, 
   null, 
   "Doc Jones", 
   "\"The two academics who authored the study, Jeanine Baker and Samara McPhedran, made a point of noting their membership in different pro-gun organizations, to head off criticism they were hiding important personal information.\"\n\n \n So what is the big deal about that? When the truth comes out the nit pickers always hit the door screaming.\n \n Australia experiencing more violent crime despite gun ban\n \n I don't call a 45% rise in crime a victory just because of the absence of a few guns? I suppose you do.\n \n Why did you change from the UK topic to Australia? Want to talk about the massacre that led to the gun grab too?", 
   {}, 
   361769, 
   null, 
   1248306420.0
  ], 
  [
   361774, 
   null, 
   "iangb", 
   "O.K. I thought banning guns was supposed to make Britain a shiny, happy place filled with rainbows and polka-dots.\n \n Evidently, there is now a problem with \"knife crime\".\n \n BBC NEWS | UK | Deaths up during anti-knife drive\n \n So they ban carrying knives.\n\n Actually, carrying knives in the UK has pretty much been illegal apart from with 'good reason or lawfull authority' since 1988. You're out of date.", 
   {}, 
   361772, 
   null, 
   1248307080.0
  ], 
  [
   361777, 
   null, 
   "Tither", 
   "There is no reason to expect gun control to reduce all crime, only the incidence of crimes where guns are used. \n\n Um! I have to call foul on this one. Everyone who proposes gun control calls it crime control. Otherwise You and Every other gun controller would be laughed out of the debate forum. \n \n If Gun Control is not Crime Control, then what is its true purpose? To gain control? What?\n \n And Yes! I would Dearly Love to talk to the Australian Institute of Criminology. Can you arrange that or what?", 
   {}, 
   361749, 
   null, 
   1248308040.0
  ], 
  [
   361779, 
   null, 
   "sinjin", 
   "Um! I have to call foul on this one. Everyone who proposes gun control calls it crime control. Otherwise You and Every other gun controller would be laughed out of the debate forum. \nYou are the only one here repeating that mantra. \n I have many, many times told you I have never claimed gun control as crime control. \n Why would we expect gun control to reduce shoplifting, burglary, rape? \n OTOH you guys suggest regularly that removing guns from law-abiding citizens (something I do not support) \n would result in an increase of crimes perpetrated with guns, since criminals would be the only ones armed. \n AIC stats don't support that notion.", 
   {}, 
   361777, 
   null, 
   1248308700.0
  ], 
  [
   361780, 
   null, 
   "Tither", 
   "Well, I think it is best to use a real source. Like the Australian FBI, called the A.I.C.\n\n \nAustralian Institute of Criminology - Homicide weapon statistics\n\n Do you really think that a graph showing firearm murders going down while knife and sharp instruments murders go up exponentially is good for your cause? \n \n What? You aren't against murders per se? You are only against firearm murders? What? \n \n Man this debate has taken a turn for the surreal!\n \n Just for reference since you quoted what I said but have not linked my statement or the accompanying info. Here is a more complete picture of crime after the Australian Gun Ban.   Recorded assault increased again in 2007, to 840 per 100,000, compared with 623 per 100,000 in 1996. The 2007 rate was the highest recorded since 1996. \n \n Mr. & Mrs America. Is this what you are signing up for? I think if you knew that the only people who are disarmed is the law-abiding, you would say to heck with the Gun Banners! \n \n Here is another report produced by Australian Institute of Criminology here called   Weapons, drugs and crime Australian Institute of Criminology (AIC) \n \n And a article about is in the report here.\n Link  Australian Institute of Criminology study -- Tough new weapons laws 'miss hard core of criminal underworld' \nCANBERRA - The introduction of tough laws to control guns and knives appears to be failing to keep lethal weapons out of the hands of Australian criminals. .... reported that while new laws may have helped reduce the number of knives and guns in illicit circulation,  they have failed to deter hard-core criminals. It also pointed to a large firearms black market.  \n\n \n The only people disarmed by gun control are the law-abiding citizens who are not the problem.", 
   {
    "unicode_changes_made": true
   }, 
   361765, 
   null, 
   1248309000.0
  ], 
  [
   361781, 
   null, 
   "Tither", 
   "You are the only one here repeating that mantra. \n I have many, many times told you I have never claimed gun control as crime control. \n Why would we expect gun control to reduce shoplifting, burglary, rape? \n\n \n Total misdirection. The claim is murder and crimes of violence can't happen because you can just run away from a knife. Well murder in both England and Australia seems to remain the same except for fluctuations, but over all violent crime seems to be increasing. Why? Maybe because you cannot protect yourselves, and the Criminals know it! And what about murders? It appears that the only change is the method.", 
   {}, 
   361779, 
   null, 
   1248309600.0
  ], 
  [
   361783, 
   null, 
   "Superlite27", 
   "I for one would prefer to face an attacker using his fists over one with a rock, a rock over a pointy stick, a pointy stick over a knife and a knife over a gun. \n Do you see the threat from each of these as equivalent?\n\n \n Most criminals also prefer to face victims who use only their fists. Thanks to laws supported by people like you, their preferences are being met.\n \n I also would like to face an attacker using his fists over one with a rock, etc., etc.\n \n Unfortunately, if you have your way, I would be required to use my fists by law, while the criminal (who ignores the requirement, hence: criminal) uses his gun he obviously is in illegal posession of. (Which he would be anyway whether or not I was allowed to do so.)\n \n I agree. The threat is absolutely not equivelent. Why do you insist on requiring the law abiding to be on the short end of the inequity?", 
   {}, 
   361722, 
   null, 
   1248310380.0
  ], 
  [
   361802, 
   null, 
   "zsu2357", 
   "Most criminals also prefer to face victims who use only their fists. Thanks to laws supported by people like you, their preferences are being met.\n \n I also would like to face an attacker using his fists over one with a rock, etc., etc.\n \n Unfortunately, if you have your way, I would be required to use my fists by law, while the criminal (who ignores the requirement, hence: criminal) uses his gun he obviously is in illegal posession of. (Which he would be anyway whether or not I was allowed to do so.)\n \n I agree. The threat is absolutely not equivelent. Why do you insist on requiring the law abiding to be on the short end of the inequity?\n\n \n \n Probably because they have never been in that position to have to defend themselves,the first time they are(if)then I think they might have a different\n take on things.", 
   {}, 
   361783, 
   null, 
   1248316860.0
  ], 
  [
   361865, 
   null, 
   "sinjin", 
   "I agree. The threat is absolutely not equivelent. Why do you insist on requiring the law abiding to be on the short end of the inequity?\nI support your right to own firearms for your self-defense and the defense of freedom as spelled-out in the BOR. Always have. The power to grant CCW permits in my locality rests with the Police Chief and County Sheriff IIRC. Relatively few are issued given the immense population of my county and the surrounding counties. Not my call.", 
   {}, 
   361783, 
   null, 
   1248368760.0
  ], 
  [
   361869, 
   null, 
   "NATO 556", 
   "I support your right to own firearms for your self-defense and the defense of freedom as spelled-out in the BOR. Always have.\n\n \n And as ruled by the Supreme Court, that right includes personal defense and the ownership of modern weaponry. That means you can't be against ownership of particular types of weapons, ammo, or magazines.\n \n \nThe power to grant CCW permits in my locality rests with the Police Chief and County Sheriff IIRC. Relatively few are issued given the immense population of my county and the surrounding counties. Not my call.\n\n \n Or more accurately, very few permits are ever issued because the police chief is an anti-gun political figurehead who has elected himself as king. No good ever comes from may-issue standards with no oversight and the determination of one know-nothing is the final say of the law.", 
   {}, 
   361865, 
   null, 
   1248369600.0
  ], 
  [
   361870, 
   null, 
   "sinjin", 
   "And as ruled by the Supreme Court, that right includes personal defense and the ownership of modern weaponry. That means you can't be against ownership of particular types of weapons, ammo, or magazines.\nModern weaponry to \"any\" modern weaponry seems a leap. 30 round magazines for home defense or sport shooting? Just curious.\n \n \nOr more accurately, very few permits are ever issued because the police chief is an anti-gun political figurehead who has elected himself as king. No good ever comes from may-issue standards with no oversight and the determination of one know-nothing is the final say of the law.\nHe's quite popular and appears an effective leader thus far. YMMV.", 
   {}, 
   361869, 
   null, 
   1248370140.0
  ], 
  [
   361871, 
   null, 
   "Doc Jones", 
   "Modern weaponry to \"any\" modern weaponry seems a leap. 30 round magazines for home defense or sport shooting? Just curious.\n \n He's quite popular and appears an effective leader thus far. YMMV.\n\n \n What? You don't know about the 100 or 200 round drum magazines? Sure, full cap mags legal for sure, there are no restrictions in the BOR that I can see.\n \n Being \"popular\" and a \"leader\" is not law enforcement's job. Keeping the law is. Not issuing concealed carry permits by abuse of his office is a criminal offense and a 1983 violation. Rights do not exist on the whim of some elected official and his actions are above the law. The oath they take would do you good to read and you can make a better judgement other than to say you like the way he combs his hair.", 
   {}, 
   361870, 
   null, 
   1248370680.0
  ], 
  [
   361874, 
   null, 
   "Doc Jones", 
   "I am amazed that no one has brought up the fact that the Supreme Court has ruled multiple times that it is unConstitutional to license a right!\n \n I predict this is one of the challenges that will soon come before the court again.", 
   {}, 
   361871, 
   null, 
   1248372120.0
  ], 
  [
   361876, 
   null, 
   "NATO 556", 
   "Modern weaponry to \"any\" modern weaponry seems a leap.\n\n \n I don't think it is. The Supreme Court spelled out that there's no cutoff date on what qualifies as bearable arms. That means anything from the milsurp M1 Carbine, to today's AR-15, to whatever will eventually supersede the AR-15, is protected as being a bearable arm.\n \n \n30 round magazines for home defense or sport shooting? Just curious.\n\n \n For any and all lawful purposes. Hunting has magazine capacity limits, so that argument won't fly if brought up. And no honest person deserves to face a criminal that's armed in a superior manner to them.\n \n \nHe's quite popular and appears an effective leader thus far. YMMV.\n\n \n And Ray Nagin got reelected as mayor of New Orleans even after the total mismanagement he did in the aftermath of Katrina. That doesn't mean that he was popular with the people though.\n \n Being a leader isn't about popularity, it's about doing a job. And part of the job isn't letting your personal bias get in the way of the oath you swore to when taking office.\n \n Every state has its own oath of office that a policeman has to swear to protect, but they generally include the statement of swearing to uphold the Constitution of the United States. And upholding the Constitution of the United States, doesn't include getting to decide \"I don't like guns, I don't like people carrying guns, and as long as I'm boss, nobody will ever get a carry permit!\"", 
   {}, 
   361870, 
   null, 
   1248372300.0
  ], 
  [
   361917, 
   null, 
   "sinjin", 
   "William J. Bratton - Wikipedia, the free encyclopedia", 
   {}, 
   361876, 
   null, 
   1248387960.0
  ], 
  [
   361927, 
   null, 
   "Doc Jones", 
   "Constitution, Article 1, section 9,10\n \n No title of nobility shall be granted by the United States: and no person holding any office of profit or trust under them, shall, without the consent of the Congress, accept of any present, emolument, office, or title, of any kind whatever, from any king, prince, or foreign state. \n \n Section 10. No state shall enter into any treaty, alliance, or confederation; grant letters of marque and reprisal; coin money; emit bills of credit; make anything but gold and silver coin a tender in payment of debts; pass any bill of attainder, ex post facto law, or law impairing the obligation of contracts, or grant any title of nobility. \n ", 
   {}, 
   361917, 
   null, 
   1248391620.0
  ], 
  [
   361982, 
   null, 
   "Tither", 
   "Every state has its own oath of office that a policeman has to swear to protect, but they generally include the statement of swearing to uphold the Constitution of the United States. And upholding the Constitution of the United States, doesn't include getting to decide \"I don't like guns, I don't like people carrying guns, and as long as I'm boss, nobody will ever get a carry permit!\"\n\n Regardless of how this fits in this circumstance or not, some things just need to be said twice! And this needs to be said twice because it fits Rey Nagan perfectly! Either you obey the law or you are a criminal! As far as I know there is no provision that nullifies the Bill of Rights based upon population density, or discretion of an appointed law enforcement officer and or elected official, regardless of this or her credentials! \n \n Either you obey the law or you are a criminal!", 
   {}, 
   361876, 
   null, 
   1248438780.0
  ], 
  [
   362019, 
   null, 
   "grizzly6626", 
   "Australian Institute of Criminology - Homicide weapon statistics\n \n \n The International Coalition for Women in Shooting and Hunting (WiSH)\n \n Great source. Too funny.\n \n Talking with you always makes me feel like I need a shower afterwards.\n\n \n The proof is in the pudding, not the recipe. Are we supposed to believe that a bunch of gun grabbers who got their wish in Australlia are actually going to admit they were wrong, they arent going to admit to anything , just as you arent, even when proof is presented that you are wrong. Yalls attitude is that you are right no matter what.", 
   {}, 
   361765, 
   null, 
   1248456960.0
  ], 
  [
   362028, 
   null, 
   "Doc Jones", 
   "Constitution, Article 1, section 9,10\n \n No title of nobility shall be granted by the United States: and no person holding any office of profit or trust under them, shall, without the consent of the Congress, accept of any present, emolument, office, or title, of any kind whatever, from any king, prince, or foreign state. \n Section 10. No state shall enter into any treaty, alliance, or confederation; grant letters of marque and reprisal; coin money; emit bills of credit; make anything but gold and silver coin a tender in payment of debts; pass any bill of attainder, ex post facto law, or law impairing the obligation of contracts, or grant any title of nobility. \n \n\n \n This is why I posted what I did. Who is he really working for? Yesterday it wasn't stashed at the top of the article sinjin posted, it was in the middle with his supposed accomplishments. Notice honorary is even spelled the way the Brits do it.\n \n \nOn September 11, 2009, he will be awarded with the honourary title of Commander of the Most Excellent Order of the British Empire by Queen Elizabeth II.[2]\n and in doing so violate the Supreme Law of the Land!", 
   {}, 
   361927, 
   null, 
   1248458640.0
  ], 
  [
   362033, 
   null, 
   "JPSartre12", 
   "Most criminals also prefer to face victims who use only their fists. Thanks to laws supported by people like you, their preferences are being met.\n \n I also would like to face an attacker using his fists over one with a rock, etc., etc.\n \n Unfortunately, if you have your way, I would be required to use my fists by law, while the criminal (who ignores the requirement, hence: criminal) uses his gun he obviously is in illegal posession of. (Which he would be anyway whether or not I was allowed to do so.)\n \n I agree. The threat is absolutely not equivelent. Why do you insist on requiring the law abiding to be on the short end of the inequity?\n\n \n Personally, I'd rather be the one bringing a gun to the knife fight. emoticon_xkillemoticon_xgood", 
   {}, 
   361783, 
   null, 
   1248460920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What can Britain ban next?", 
  "url": "http://www.4forums.com/political/gun-control-debates/13013-what-can-britain-ban-next.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13013, 
  "discussion_files": [
   [
    "30115.html", 
    "http://www.4forums.com/political/gun-control-debates/13013-what-can-britain-ban-next-print.html"
   ], 
   [
    "30116.html", 
    "http://www.4forums.com/political/gun-control-debates/13013-what-can-britain-ban-next-2-print.html"
   ]
  ], 
  "identifier": 13013
 }
]