[
 [
  [
   361719, 
   null, 
   "simone", 
   "The Extremist Cult of right wing congressmen and senators who live at C Street and call themselves \"The Family\":\n \nI met the younger Coe when I lived for several weeks as a member of the Family. He's a surprising source of counsel, spiritual or otherwise. Attempting to explain what it means to be chosen for leadership like King David was -- or Mark Sanford, according to his own estimate -- he asked a young man who'd put himself, body and soul, under the Family's authority, \"Let's say I hear you raped three little girls. What would I think of you?\" The man guessed that Coe would probably think that he was a monster. \"No,\" answered Coe, \"I wouldn't.\" Why? Because, as a member of the Family, he's among what Family leaders refer to as the \"new chosen.\" If you're chosen, the normal rules don't apply.\n \n From The Family: The Secret Fundamentalism at the Heart of American Power by Jeff Sharlet.\n \n Adulterous affairs...\n \n Corruption...\n \n Senator John Ensign, Governor Mark Sanford...", 
   {
    "post_info": {
     "post_title": "If You're &quot;Chosen,&quot; the Normal Rules Don't Apply"
    }
   }, 
   null, 
   null, 
   1248288780.0
  ], 
  [
   361720, 
   null, 
   "JPSartre12", 
   "The Extremist Cult of right wing congressmen and senators who live at C Street and call themselves \"The Family\":\n \n From The Family: The Secret Fundamentalism at the Heart of American Power by Jeff Sharlet.\n \n Adulterous affairs...\n \n Corruption...\n \n Senator John Ensign, Governor Mark Sanford...\n\n \n No thanks. Got a book on the debauchery of the Kennedys instead, perchance? emoticon_rolleyes", 
   {}, 
   361719, 
   null, 
   1248289560.0
  ], 
  [
   361742, 
   null, 
   "Zardoz", 
   "I've got the Picture.\n \n I've got a picture of the Chosen Few\n It includes neither the Gentile nor the Jew\n Doesn't show me or you\n Nor the baby that goes coo-coo-cachoo.\n \n I've got a message from up on high\n Was delivered with a smile and a sigh\n To everyone who soon shall die\n No answers will ever come as to why.\n \n I've got my bible and I've got my sword\n I love them both like I love the lord\n I use them to convert the unclean hoards\n They get me off better than Tracy Lords.\n \n I got myself salvation from all my sins\n With a sip from my tonic and gin\n And with the whore who makes me grin\n Yes, Jesus and Harvey are both my friends.\n \n I go to Church every Sunday\n I know the lord just wants my pay\n For the time I took a roll in hay\n With a man but I am not gay.\n \n I love the lord and he loves me too\n Lets me know that I'm better than you\n But we all know that that's nothin' new\n But I'll beat you down 'til you're black and blue.\n \n I've got a picture of the Chosen Few\n It includes neither the Gentile nor the Jew\n Doesn't show me or you\n Nor the baby that goes coo-coo-cachoo.\n \n I've got a message from up on high\n Was delivered with a smile and a sigh\n You know your god is just a lie\n There's nothin' there when you die.\n \n -Z\n -Son Block.", 
   {}, 
   361720, 
   null, 
   1248297720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  If You're \"Chosen,\" the Normal Rules Don't Apply", 
  "url": "http://www.4forums.com/political/religion-debates/13012-if-youre-chosen-normal-rules-dont-apply.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13012, 
  "discussion_files": [
   [
    "26689.html", 
    "http://www.4forums.com/political/religion-debates/13012-if-youre-chosen-normal-rules-dont-apply-print.html"
   ]
  ], 
  "identifier": 13012
 }
]