[
 [
  [
   361979, 
   null, 
   "Accipiter", 
   "Is it a feeling you get that tells you your religion is true and that God exists?\n \n Did you see signs that convinced you?\n \n Were you born in to a family that was religious and are religious for that reason? \n \n Why do you believe what you believe?", 
   {
    "post_info": {
     "post_title": "The basis for religion?"
    }
   }, 
   null, 
   null, 
   1248435420.0
  ], 
  [
   363435, 
   null, 
   "ledbythespirit", 
   "Truthfully the basis for religion is to substitute for God's way.And it cannot save you ,but God's way can.", 
   {}, 
   361979, 
   null, 
   1249213740.0
  ], 
  [
   363439, 
   null, 
   "Accipiter", 
   "I am not interested in you preaching to me, what I want to know is how you came to believe.\n \n Did you have some kind of religious experience?\n \n Can you describe it?", 
   {}, 
   363435, 
   null, 
   1249215180.0
  ], 
  [
   363457, 
   null, 
   "unkerpaulie", 
   "In my case I grew up in a christian home and was very active in church from a very young age. My mom was the sunday school superintendant and I always had a knack for bible studies and trivia. As I grew up I just learned more and it felt natural in a way to continue serving God, telling others about jesus, teaching what I learned and all of that. Everything made sense. Even the obvious contradictions were perfectly logical to me. \n \n Its a major reason why I have a bit of epathy for people who defend the bible. Coming from the perspective of christianity, and the total mental reprogramming you undergo, its not as far fetched as some people may think that one can hold on to the bible as God's inerrant word even in the face of blaring errors.", 
   {}, 
   363439, 
   null, 
   1249219920.0
  ], 
  [
   363468, 
   null, 
   "Archangel", 
   "In my case I grew up in a christian home and was very active in church from a very young age. My mom was the sunday school superintendant and I always had a knack for bible studies and trivia. As I grew up I just learned more and it felt natural in a way to continue serving God, telling others about jesus, teaching what I learned and all of that. Everything made sense. Even the obvious contradictions were perfectly logical to me. \n \n Its a major reason why I have a bit of epathy for people who defend the bible. Coming from the perspective of christianity, and the total mental reprogramming you undergo, its not as far fetched as some people may think that one can hold on to the bible as God's inerrant word even in the face of blaring errors.\n\n \n How do you explain people like me who were never indoctrinated into the christian belief system at all, yet have had a personal experience with God apart from human intervention? Someone who claims not a religious experience but a born again experience which directly ties me with God through His Holy Spirit? \n \n Salvation doesn't lie in any building or through the words of any man, but only by way of the word of God. That is why with all of your alleged first hand religious training you are no more committed to Gods truths than the secular humanists as you defend their positions in so many debates. It is sad that you have no spiritual insights but can only intellectualize what the bible says, which is why it has no life changing impact on you.", 
   {}, 
   363457, 
   null, 
   1249225200.0
  ], 
  [
   363496, 
   null, 
   "pappillion001", 
   "How do you explain people like me who were never indoctrinated into the christian belief system at all, yet have had a personal experience with God apart from human intervention? Someone who claims not a religious experience but a born again experience which directly ties me with God through His Holy Spirit? \n \n Salvation doesn't lie in any building or through the words of any man, but only by way of the word of God. That is why with all of your alleged first hand religious training you are no more committed to Gods truths than the secular humanists as you defend their positions in so many debates. It is sad that you have no spiritual insights but can only intellectualize what the bible says, which is why it has no life changing impact on you.\n\n \n Not trying to make you wrong or devalue your belief but try and imagine what you would experience if there right now you knew without question there was no God. \n \n People find meaning for their lives, strength to endure or overcome, confidence, they don't feel alone and/or they find acceptance among a great many other possibilities. This doesn't make them weak or ignorant doesn't mean they can't face reality. For some religion and God fullfill a need that can't be found anyplace else. Some people find that fullfillment elsewhere and some just don't find it anywhere. \n \n So whatever would be unfullfilled within you at the loss of God is what keeps you with God. You know consciensly or sub-consiously that without God there is something missing from you and not experincing that feeling has enough value to you to keep your faith. \n \n People lose faith or never have it when for whatever reason the concept of God isn't able to fill that void for them. So try and understand some people just don't have the same experience as you do. Fiinding solace in God no more makes you right than the person who doesn't wrong. I don't think there is fault on the part of God nor on the part of the individual. \n \n At least that is my take on why some people have faith and others don't.", 
   {}, 
   363468, 
   null, 
   1249236660.0
  ], 
  [
   363512, 
   null, 
   "simone", 
   "How do you explain people like me who were never indoctrinated into the christian belief system at all, yet have had a personal experience with God apart from human intervention? Someone who claims not a religious experience but a born again experience which directly ties me with God through His Holy Spirit? \n \n Salvation doesn't lie in any building or through the words of any man, but only by way of the word of God. That is why with all of your alleged first hand religious training you are no more committed to Gods truths than the secular humanists as you defend their positions in so many debates. It is sad that you have no spiritual insights but can only intellectualize what the bible says, which is why it has no life changing impact on you.\n\n Drug-induced madness perhaps?", 
   {}, 
   363468, 
   null, 
   1249240200.0
  ], 
  [
   363518, 
   null, 
   "unkerpaulie", 
   "How do you explain people like me who were never indoctrinated into the christian belief system at all, yet have had a personal experience with God apart from human intervention? Someone who claims not a religious experience but a born again experience which directly ties me with God through His Holy Spirit? \n \n\n For the sake of this discussion I don't have to explain your case. That's for you to do. However, your experience doesn't differ from mine that much. I too felt God speaking to me, receiving split-second guidance and answers to questions that would pop into my head when I least expected it. I enjoyed fellowship with other christians and I would sit and read through bible passages like it was a best-seller novel. I really had God in my life, no doubt about it, just as you do. \n \n \nSalvation doesn't lie in any building or through the words of any man, but only by way of the word of God. That is why with all of your alleged first hand religious training you are no more committed to Gods truths than the secular humanists as you defend their positions in so many debates. It is sad that you have no spiritual insights but can only intellectualize what the bible says, which is why it has no life changing impact on you.\n\n Actually it did. It might be hard for you to digest, but believe it or not, I was just convicted and holy-ghost filled as you are. And as millions of christians all over the world are. The fact that I no longer am a christian and that in retrospect I can look back at my experiences from an atheist perspective doesn't cheapen the experience nor make it fake.", 
   {}, 
   363468, 
   null, 
   1249242780.0
  ], 
  [
   363540, 
   null, 
   "Archangel", 
   "For the sake of this discussion I don't have to explain your case. That's for you to do. However, your experience doesn't differ from mine that much. I too felt God speaking to me, receiving split-second guidance and answers to questions that would pop into my head when I least expected it. I enjoyed fellowship with other christians and I would sit and read through bible passages like it was a best-seller novel. I really had God in my life, no doubt about it, just as you do. \n \n \n Actually it did. It might be hard for you to digest, but believe it or not, I was just convicted and holy-ghost filled as you are. And as millions of christians all over the world are. The fact that I no longer am a christian and that in retrospect I can look back at my experiences from an atheist perspective doesn't cheapen the experience nor make it fake.\n\n \n If what you say is true, then how sad you are indeed for having tasted the fruits of the spirit and then rejected it. If you once really experienced fellowship with, and followed the Lord, then you know He is real and a personal God. How far into eternity do you think your intellectualism will get you in opposition to the living God? Remember, Jesus said:\n Mat 6:24 No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. You cannot serve God and man.", 
   {}, 
   363518, 
   null, 
   1249248480.0
  ], 
  [
   363550, 
   null, 
   "unkerpaulie", 
   "If what you say is true, then how sad you are indeed for having tasted the fruits of the spirit and then rejected it. If you once really experienced fellowship with, and followed the Lord, then you know He is real and a personal God. How far into eternity do you think your intellectualism will get you in opposition to the living God? Remember, Jesus said:\n Mat 6:24 No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. You cannot serve God and man.\n\n Experiencing something with real emotions and having it impact you for the rest of your life does not make it real. Just because a child learns that santa claus is make-believe doesn't mean that those first few christmases weren't filled with magic and wonder just the same. It happens all the time. \n \n I'm not interested in living happily ever after in heaven for all eternity with God. It doesn't appeal to me, and setting that as one of my life-time goals is going to distract me from things that are actually important. I can imagine how backwards that sounds to you, but the truth is that things are only as valuable as you make them in your mind. It doesn't change reality. You may be right about heaven, you may be totally deluded. The truth about it issue doesn't change. But I'm not convinced that God exists, and I've given that a heck of a lot of thought.", 
   {}, 
   363540, 
   null, 
   1249251840.0
  ], 
  [
   363554, 
   null, 
   "marc9000", 
   "In my case I grew up in a christian home and was very active in church from a very young age. My mom was the sunday school superintendant and I always had a knack for bible studies and trivia. As I grew up I just learned more and it felt natural in a way to continue serving God, telling others about jesus, teaching what I learned and all of that. Everything made sense. Even the obvious contradictions were perfectly logical to me. \n \n Its a major reason why I have a bit of epathy for people who defend the bible. Coming from the perspective of christianity, and the total mental reprogramming you undergo, its not as far fetched as some people may think that one can hold on to the bible as God's inerrant word even in the face of blaring errors.\n\n \n If you were a Christian from a very young age and no longer are, wouldn't you say that it was YOU who underwent a mental reprogramming? \n \n \nBut I'm not convinced that God exists, and I've given that a heck of a lot of thought. \n\n \n \"Thought\" - what were the sources of the thought, would you say they were within you and your.......materialistic life experiences, or were they the most influenced by other people, such as your parents & other Christian adults of your childhood / scientists of today?", 
   {}, 
   363457, 
   null, 
   1249252680.0
  ], 
  [
   363556, 
   null, 
   "marc9000", 
   "Is it a feeling you get that tells you your religion is true and that God exists? \n\n \n Yes\n \n \nDid you see signs that convinced you? \n\n \n Yes\n \n \nWere you born in to a family that was religious and are religious for that reason? \n\n \n Yes, partially for that reason, and partially because my life experiences have reinforced it. \n \n \nWhy do you believe what you believe?\n\n \n *Biblical prophesy is being fullfilled. \n \n *I don't see the stark contrast between good & evil as coming from evolutionary chance. \n \n *I see my own life being guided by something other than random chance. \n \n *Everything I see points to the timeline of written history of a few thousand years, not millions of years of random chance.", 
   {}, 
   361979, 
   null, 
   1249253340.0
  ], 
  [
   363562, 
   null, 
   "Archangel", 
   "Experiencing something with real emotions and having it impact you for the rest of your life does not make it real. Just because a child learns that santa claus is make-believe doesn't mean that those first few christmases weren't filled with magic and wonder just the same. It happens all the time. \n \n I'm not interested in living happily ever after in heaven for all eternity with God. It doesn't appeal to me, and setting that as one of my life-time goals is going to distract me from things that are actually important. I can imagine how backwards that sounds to you, but the truth is that things are only as valuable as you make them in your mind. It doesn't change reality. You may be right about heaven, you may be totally deluded. The truth about it issue doesn't change. But I'm not convinced that God exists, and I've given that a heck of a lot of thought.\n\n \n See the bolded? What you are in fact saying is that you will gladly trade an eternity with the maker of our souls, the God who created us in love, for fellowship; for the wisp of smoke this short lifetime represents in time as compared to what is to come. And your thinking also implies that we believers are somehow wasting our lives here by recognizing God and responding to His desire to have a personal relationship with us in this flesh.\n \n I am truly saddened for you paulie, and hope the day will come when you will relearn what you once had the child like faith to clearly see. Jesus also said this:\n \n Mat 18:3 And he said: \"I tell you the truth, unless you change and become like little children, you will never enter the kingdom of heaven.\n Mat 18:4 Therefore, whoever humbles himself like this child is the greatest in the kingdom of heaven.\n So you may scoff at child like faith we believers possess, but I understand that I am literally a child of God with finite vision as compared to His infinite perspective. How arrogant is it to think that because you have attained adulthood according to this worlds standards that you are no longer a child in our Gods eyes? Think about that paulie, it is eternal wisdom.", 
   {}, 
   363550, 
   null, 
   1249256040.0
  ], 
  [
   363576, 
   null, 
   "unkerpaulie", 
   "If you were a Christian from a very young age and no longer are, wouldn't you say that it was YOU who underwent a mental reprogramming? \n\n Yes, I had to be programmed into believing in God in the first place and then reprogrammed out of it. \n \n \n\"Thought\" - what were the sources of the thought, would you say they were within you and your.......materialistic life experiences, or were they the most influenced by other people, such as your parents & other Christian adults of your childhood / scientists of today?\n\n Are there any life experiences that aren't materialistic? What possible thought sources could there be that is different from the \"thought sources\" of anybody else? \n \n Actually, most of my transformation and discovery about abandoning theism happened right here on this forum. Of the 4000+ posts I've made here, especially among the threads I started myself, I've questioned the bible extensively. I've had a lot of discussions over more than 3 years here, in addition to those with my pastor and members of my church. And I gradually came to realize that God in the bible was simply too illogical and too inconsistent with reality to exist. God not existing made sense to me. Eventually I didn't fight it, I just accepted it and moved on. I never stop searching for answers, and I'm not really close-minded on the issue, but I have more reasons to believe what I do than to believe God exists.", 
   {}, 
   363554, 
   null, 
   1249258440.0
  ], 
  [
   363619, 
   null, 
   "marc9000", 
   "Yes, I had to be programmed into believing in God in the first place and then reprogrammed out of it. \n\n \n Hopefully we can agree that there is a lot of reprogramming going on! Today's scientific community is a powerful reprogrammer. Just a couple of hours ago I was watching the history channel giving a meticulous history lesson on what was going on on earth 700 million, 600 million, 500 million years ago. It wasn't making any effort to separate facts from atheist theories. \n \n \nAre there any life experiences that aren't materialistic? What possible thought sources could there be that is different from the \"thought sources\" of anybody else? \n\n \n I think so, I think there is a distinct division between one's own materalistic experiences vs an influence by other people. A smile from Richard Dawkins, or the very authoritative voice of the narrator of the above referenced history channel documentary, for example. I think the influence from other people can be more forceful - it stimulates an open mind into looking for reasons to reject God. \n \n \nActually, most of my transformation and discovery about abandoning theism happened right here on this forum. Of the 4000+ posts I've made here, especially among the threads I started myself, I've questioned the bible extensively. \n\n \n The archives don't go back far enough for me to easily look up your first posts - you've been here since late 2003, about 6 months longer than me. But since you've \"questioned the Bible extensively\", I suspect you didn't exactly start here from a completely neutral position. \n \n \nI've had a lot of discussions over more than 3 years here, in addition to those with my pastor and members of my church. And I gradually came to realize that God in the bible was simply too illogical and too inconsistent with reality to exist. God not existing made sense to me. Eventually I didn't fight it, I just accepted it and moved on. I never stop searching for answers, and I'm not really close-minded on the issue, but I have more reasons to believe what I do than to believe God exists.\n\n \n Please don't stop searching - things may change for you as you get older. Consider questioning evolution/atheism extensively.", 
   {}, 
   363576, 
   null, 
   1249266000.0
  ], 
  [
   363682, 
   null, 
   "unkerpaulie", 
   "Hopefully we can agree that there is a lot of reprogramming going on! Today's scientific community is a powerful reprogrammer. Just a couple of hours ago I was watching the history channel giving a meticulous history lesson on what was going on on earth 700 million, 600 million, 500 million years ago. It wasn't making any effort to separate facts from atheist theories. \n\n The earth being well over 700 million years old isn't an atheist theory. And the world only being a few thousand years old isn't fact. \n \n \nI think so, I think there is a distinct division between one's own materalistic experiences vs an influence by other people. A smile from Richard Dawkins, or the very authoritative voice of the narrator of the above referenced history channel documentary, for example. I think the influence from other people can be more forceful - it stimulates an open mind into looking for reasons to reject God. \n \n\n These weren't my reasons \n \n \nThe archives don't go back far enough for me to easily look up your first posts - you've been here since late 2003, about 6 months longer than me. But since you've \"questioned the Bible extensively\", I suspect you didn't exactly start here from a completely neutral position.\n \n Please don't stop searching - things may change for you as you get older. Consider questioning evolution/atheism extensively.\n\n Wow, its been that long? And you're right, I actually first came here arguing against evolution and in defense of creation. I even figured out where cain got his wife from, which didn't involve incest or God creating other humans outside of eden. I could even explain how the earth could be so old and dinosaurs could exist and still cater for a six-day creation. I was armed with great arguments and solid reasoning. And as I argued, I did more research both to back up my arguments and to better understand my enemies' position. For quite some time I railed against evolution and slammed atheists for their ignorance. The big bang seemed like the most ridculous notion ever! Dark matter? Red shift? Planets moving away from each other? Some real crackpot stuff! \n \n The more I learned about the subject, the more I realized that there was simply more real life evidence backing a spontaneous origin of existence than a god-created one. This was quite a journey, not an easy one, very uncomfortable at times, but one that I enjoyed nonetheless. I was truly interested in seeking the truth, even though I was already convinced that I had it. \n \n See my signature? That's a quote I made up myself. Its the sum of what I learned on my journey here. People who hold on to theism are people who resign to the quest of the truth. You hear believers chant like a mantra \"well some things about God are beyond finding out\" or \"how could we possibly hope to understand infinite wisdom with our finite minds?\" These are cop outs, excuses to stop seeking the truth. The fact is that believers fear the journey of trying to understand God because it will inevitably lead them to atheism. So they stop searching at the first major contradiction or serious question they encounter, admit to themselves that they rather be ignorant and trust that what they can't figure out is impossible to figure out, and the go right back to their comfortable seats of unquestioning and brainwashing. They stick their fingers in their ears and lalala at the blaring illogicalities in their face, hoping that if they squeeze their eyes shut tight enough the issue will go away. \n \n I don't even recommend that you honestly and openly seek the truth about God. Your fate will be the same as mine, and not everyone can handle the truth. For most people, I just let them stay in their comfort zone and do things they've always done so that they can continue to get the results they've always got. I mean, if you really want to go down that road, I'll be happy to share it with you, but the disclaimer is there.", 
   {}, 
   363619, 
   null, 
   1249310280.0
  ], 
  [
   363700, 
   null, 
   "Accipiter", 
   "Just a couple of hours ago I was watching the history channel giving a meticulous history lesson on what was going on on earth 700 million, 600 million, 500 million years ago. It wasn't making any effort to separate facts from atheist theories.\n\n \n Trying to draw any useful conclusions form what you see on the History Channel is going to be tough.\n \n I am surprised you would even say that.\n \n I have seen shows on the History Channel on the same subject contradict each other.\n \n I have also seen that most shows really push the drama and try to sensationalize everything.\n \n The History Channel is tabloid history and they never explain anything to the extent that you will actually learn something. \n \n Now if you told me you'd learned something from reading Scientific American then we can talk.", 
   {
    "unicode_changes_made": true
   }, 
   363619, 
   null, 
   1249319700.0
  ], 
  [
   363795, 
   null, 
   "Zardoz", 
   "I was doing excavating work on an archaeological site in Egypt several decades ago when I and my fellow looteerrrummm university professors came upon a lost tomb of a great pharoah of antiquity.\n \n Haveing been filled for the desire to cash in on lost artifacts...for the benefit of all mankind of course, we broke the seals and entered the undisturbed crypt.\n Instantly the dead air rustled with static discharge that set our hairs on end.\n And a dull wailing proceeded from the darkest reaches of the burial chambers.\n \n Within moments were were best upon by carniverous scarabs and the retched corpses of the pharoahs undead guard. Our bearers were rendered limb from limb and my collegues were devoured by the scuttling beasties.\n I fell to my knees and grasped randomly for the many superstitious trinkets I wore as the mummified corpse of the pharoah approached.\n At the last moment, I must had grabbed the right one and pushed the homing beacon for my personal god of choice...\n \n And TEAM AMERICA came bursting in, saving the day in a hail of fully automatic gunfire and deadly guided missile attacks. The scarabs and mummies were annihilated in cleansing flame and righteous pesticides.\n \n I've been a BIG believer in US every since.\n \n After all, who needs a god when you have US?\n \n **** YEAH!\n \n emoticon_xkill \n \n I only wished I'd have cashed in on the tale rather than let hollywood parasites hack it apart.", 
   {}, 
   363700, 
   null, 
   1249356720.0
  ], 
  [
   363811, 
   null, 
   "CUNxTime", 
   "Is it a feeling you get that tells you your religion is true and that God exists?\n \n Did you see signs that convinced you?\n \n Were you born in to a family that was religious and are religious for that reason? \n \n Why do you believe what you believe?\n\n \n IMO, the first religion started when some clever fellow convinced the rest of the tribe that he could do chants and spells to cause the hunt to be successful (and that he could keep evil spirits away). He promised that as long as they gave him extra meat and excused him from any other 'work' that the clan would be blesses. From there the franchises expanded in number and complexity but have continued to be cut from the same basic cloth.\n \n \n I've wished that I could believe in something supernatural but alas, he's just not in the cards.", 
   {}, 
   361979, 
   null, 
   1249363680.0
  ], 
  [
   363838, 
   null, 
   "unkerpaulie", 
   "IMO, the first religion started when some clever fellow convinced the rest of the tribe that he could do chants and spells to cause the hunt to be successful (and that he could keep evil spirits away). He promised that as long as they gave him extra meat and excused him from any other 'work' that the clan would be blesses. From there the franchises expanded in number and complexity but have continued to be cut from the same basic cloth..\n\n I would go a bit further back and suggest (imo) that religion first came about by accident. Man's curiousity about how things work around him must have been the spark that started religion. It was the easy conclusion to any hypothesis that couldn't be tested. Let's say a certain fisherman found that one day he came to his favorite fishing spot, but a branch had fallen in the water. Now all of a sudden he's catching more fish than usual in that area. He decides to test this and throws a branch into the water somewhere else. Again, more fish than he would normally catch at this spot. Ok, throwing bush in the water causes him to catch more fish there. But the reasoning wasn't scientific. He figured that the lake god favored him for his leaf offering. And of course he shared his secret with a few close friends, who came to him for advice about how to the gods of fishing could bless them. \n \n Then somewhere along the line it developed into what you're talking about.", 
   {}, 
   363811, 
   null, 
   1249400880.0
  ], 
  [
   363841, 
   null, 
   "Brigid", 
   "IMO, the first religion started when some clever fellow convinced the rest of the tribe that he could do chants and spells to cause the hunt to be successful (and that he could keep evil spirits away). He promised that as long as they gave him extra meat and excused him from any other 'work' that the clan would be blesses. From there the franchises expanded in number and complexity but have continued to be cut from the same basic cloth.\n \n \n I've wished that I could believe in something supernatural but alas, he's just not in the cards.\n\n \n There's a pretty well written book on this subject called \"The Evolution of God\" by Robert Wright\n \n Here's the review that John Loftus (an atheist - ex-evangelical preacher - author) posted there:\n \nThis new book from acclaimed author Robert Wright is a well-researched one covering a great deal of territory. It should be read in its entirety to be properly understood. In it he discusses the history of religion with a focus on western Abrahamic faiths, although not entirely neglecting eastern religions. He tells us in the Introduction that he's giving us a human \"materialistic\" account of it, although he thinks doing so \"actually affirms the validity of a religious worldview,\" though not a traditionalist one, but one nonetheless. Wright argues the gods arose as illusions and that \"the subsequent history of the idea of god is...the evolution of an illusion.\" This evolution points to the existence of a \"divinity,\" he argues, even though this god is not one that most believers currently accept. As it evolved it has \"moved closer to plausibility.\" (p.4). \n \n Wright begins with the five types of primitive hunter-gatherer supernatural beings: elemental spirits, puppeteers, organic spirits, ancestral spirits, and the high gods. These primitive gods were not always worshipped but treated as we would treat other human beings. In these societies the Shaman was the \"first step toward an archbishop or ayatollah\" who had contact with these otherwise hidden forces and could help focus their powers to heal, protect, and provide. \n \n As small tribes grew into larger societies the chiefdom was the next evolutionary stage where there was a need for a \"structural reliance on the supernatural.\" Chiefs in these agricultural societies were conduits through which divine power entered the social scale down to the lesser folk. If things went well for a society then the chief was doing a good job. Superstition reigned in these days. \n \n With the arrival of the city-states, kings needed divine legitimization and used the gods to solidify their rule over the people. The king was now the conduit of divine power. The character of the gods could differ between city-states, but many of them demanded human sacrifices or else there was chaos. Along with this development came moral obligations, which if they were not met caused sickness and death. In these city-states there was competition between rival cities and along with them rival gods. This had a tendency for these polytheistic people to elevate their god above others, which was a step toward monotheism. \n \n When Wright turns to a discussion of the emergence of Abrahamic monotheism it appears to me he is at his very best. In decoding the biblical texts from how we normally read them beginning with Genesis, he finds good evidence that behind what we see on the surface is a different story of Yahweh who was just one god in a pantheon of early gods. Yahweh starts out with a body, for instance, and was given the people of Israel to rule over by Elyon, the highest god in the pantheon. Originally Yahweh was probably one of the Canaanite deities, he argues. When it comes to the Israelites themselves, Wright argues from archeological evidence that they look more and more like Canaanites who originally worshipped Baal and Asherah, rather than some people who invaded Palestine after leaving Egypt. \n \n In a fascinating discussion Wright argues that this Hebrew god evolved into a monolatry, which was a \"way station on the road to full-fledge monotheism.\" Monolatry didn't deny the existence of other gods, it just affirmed that Yahweh was the highest of those gods in the pantheon. This was achieved mostly by King Josiah, who sought to solidify his reign and centralize worship in Jerusalem. Josiah even had his reforms written in much of the book of Deuteronomy. \n \n When Judah was carried away into captivity by the Babylonians the exiled Jewish theologians made the most of their disaster. Based on good reasoning and scholarship Wright shows how they thought about such a complete and utter disaster and why they came to the conclusion that Yahweh was the one and only God. If it was Yahweh's will to bring the mightiest empire of their day to so utterly destroy them for their sins, as they did, then Yahweh was bigger than they had ever thought. \"A god who governs the actions of the greatest known empire is a god who can govern history itself.\" (p. 171). \n \n But this God of theirs was not yet thought of as a good God. That was the next evolutionary stage to take place, and Wright sees this coming from the writings of Philo of Alexandria, who urged a tolerance for other gods at about the same time Jesus was preaching. \n \n But even Jesus did not think of his God as a loving God, Wright argues. In Mark's first gospel Jesus is portrayed as one who \"believes you should love your neighbors, but that isn't to be confused with loving all humankind. He believes you should love God, but there's no mention of God loving you.\" (p. 258). \n \n The Apostle Paul, however, is described by Wright as the \"apostle of love,\" not only because he penned I Corinthians 13, known as the \"Chapter of Love,\" but also from other things he wrote. It was Paul's version of Christianity that eventually won the day in Constantine's multiethnic empire because it favored ethnic harmony, Wright argues. \n \n Wright sees the same evolutionary trend in Islam. First Allah \"transcended tribal distinctions,\" as Yahweh did before him. Then he acquired the \"multinational perspective of an empire,\" even to the point when in places the Koran grants the possibility of salvation to people \"outside the fold.\" (p. 436) \n \n Wright concludes that in our day \"we've reached a stage in history where the movement toward moral truth has to become globally momentous.\" In short, God has some \"some growing to do,\" (p. 436), and Wright seems confident this will happen, given what he wrote in his previous book, Nonzero: The Logic of Human Destiny. Whether he can be this optimistic depends on the case he made there. \n \n In the end, traditionalists will not like this book, and he admits this. Wright's god seems to be an abstract god as \"the source of the moral order\" (p. 446), and in such a belief he finds his god, although he holds out hope this god is also a personal one. \n \n Other thinkers have argued God will become unnecessary and will evolve out of existence in the human mind, but whether or not that will happen is yet to be seen. In any case this is a judicious treatment that will surely provoke controversy. It's also enlightening. Hopefully his book will contribute to the ongoing evolution of the idea of God. And maybe it'll contribute to his evolution out of existence, too. \n \n", 
   {}, 
   363811, 
   null, 
   1249401540.0
  ], 
  [
   364001, 
   null, 
   "marc9000", 
   "The earth being well over 700 million years old isn't an atheist theory. And the world only being a few thousand years old isn't fact. \n\n \n The meticulous details they were giving about it was my point. It's always possible that the materials that the earth is made of are older than the earths present orbit around the sun. That seems to seldom be considered or speculated on by geologists, because their colleagues the evolutionists need the earths orbit around the sun to be old, or godless evolution can't work. \n \n \nThese weren't my reasons \n\n \n Throughout this thread, and others, you seem to imply that it's a shortcoming of/within Christianity only that causes you and others to reject it. My contention is that when one loses a previously held interest in Christianity, it's because it was replaced with something else - some type of \"freedom\" involved with atheism. Earlier in post #10, you said this;\n \n \nI'm not interested in living happily ever after in heaven for all eternity with God. It doesn't appeal to me, and setting that as one of my life-time goals is going to distract me from things that are actually important. \n\n \n What other things are important to you that Christianity interferes with? \n \n \nWow, its been that long? And you're right, I actually first came here arguing against evolution and in defense of creation. I even figured out where cain got his wife from, which didn't involve incest or God creating other humans outside of eden. I could even explain how the earth could be so old and dinosaurs could exist and still cater for a six-day creation. I was armed with great arguments and solid reasoning. And as I argued, I did more research both to back up my arguments and to better understand my enemies' position. For quite some time I railed against evolution and slammed atheists for their ignorance. The big bang seemed like the most ridculous notion ever! Dark matter? Red shift? Planets moving away from each other? Some real crackpot stuff! \n\n \n Could you link me to some evidence of your arguing in defense of creation when you first started posting here? I'm not calling you a liar, but it's clear to me you're exagerating. An individual posters archives don't go back more than a couple of years in most cases, but archives for complete forums (like the religion forum) go back to the beginning of this board, and I found a thread you started , only about 2 weeks after you started posting here. At that point you said (post #4) you lost faith in God, and \"didn't know where you were\". I agree that you posted from a somewhat different perspective then, than you do now, but I see no evidence that you ever confidently posted in defense of creation. I'll admit in big bold letters if I'm wrong, but you'll have to show me. \n \n \nThe more I learned about the subject, the more I realized that there was simply more real life evidence backing a spontaneous origin of existence than a god-created one. This was quite a journey, not an easy one, very uncomfortable at times, but one that I enjoyed nonetheless. I was truly interested in seeking the truth, even though I was already convinced that I had it. \n \n See my signature? That's a quote I made up myself. Its the sum of what I learned on my journey here. People who hold on to theism are people who resign to the quest of the truth. You hear believers chant like a mantra \"well some things about God are beyond finding out\" or \"how could we possibly hope to understand infinite wisdom with our finite minds?\" These are cop outs, excuses to stop seeking the truth. \n\n \n I don't agree, because I believe there is a huge separation between the scriptures and human conclusions. The scriptures themselves discourage \"putting God to the test\", and I think your posts indicate the reason for it. Equal, accurate testing of both humans and God isn't possible by humans. emoticon_idea\n \n I'll admit that I refrain from putting God/the Bible to the test, and am NEVER shy about putting anything involving human endeavors to the test. The implication from science/those who reject religion, is that they equally put everything to the test, and it's obvious to me that they do not. They claim that if something comes along to logically replace Darwinism, they would immediately accept it, but their actions to not match their words. I clearly see them accepting some human action without question, with a blind faith quite equal to my Christianity. The Apollo \"moon landings\" are one prime example. I fully believed them for 30 years ( I was 15 years old in 1969) but in about 1999 when I was encouraged to put them to the test, my belief easily crashed, as it would with most people if they would do some basic questioning of it. They don't. \n \n \nThe fact is that believers fear the journey of trying to understand God because it will inevitably lead them to atheism. \n\n \n That's simply untrue. There are many high-profile Christians, as well as countless retired pastors, who have spent their entire lives studying the Bible, and their faith continues to grow and flourish. Billy Graham, Henry Morris, James Dobson, Ravi Zacharias - many more, the list is long. Most biographys of Charles Darwin indicate that he lost his faith in God because of his bitterness of the early death of his daughter Anne. A similar thing happened to Henry Morris when he lost his son Andrew. No faith lost - you can read about it here. \n \n \n So they stop searching at the first major contradiction or serious question they encounter, admit to themselves that they rather be ignorant and trust that what they can't figure out is impossible to figure out, and the go right back to their comfortable seats of unquestioning and brainwashing. They stick their fingers in their ears and lalala at the blaring illogicalities in their face, hoping that if they squeeze their eyes shut tight enough the issue will go away. \n\n \n And that's the SAME EXACT THING millions of people do concerning the Apollo moon landings, and mnay other scientific proclamations. \n \n \nI don't even recommend that you honestly and openly seek the truth about God. Your fate will be the same as mine, and not everyone can handle the truth. For most people, I just let them stay in their comfort zone and do things they've always done so that they can continue to get the results they've always got. I mean, if you really want to go down that road, I'll be happy to share it with you, but the disclaimer is there.\n\n \n That can, and has, gone both ways. There are others (recently converted Christians) who would say the same about much of science. Different worldviews make the \"truth\" claims, but yours is no more valid than any Christians.", 
   {
    "unicode_changes_made": true
   }, 
   363682, 
   null, 
   1249481700.0
  ], 
  [
   364002, 
   null, 
   "marc9000", 
   "IMO, the first religion started when some clever fellow convinced the rest of the tribe that he could do chants and spells to cause the hunt to be successful (and that he could keep evil spirits away). He promised that as long as they gave him extra meat and excused him from any other 'work' that the clan would be blesses. From there the franchises expanded in number and complexity but have continued to be cut from the same basic cloth.\n \n \n I've wished that I could believe in something supernatural but alas, he's just not in the cards.\n\n \n So Jesus was just another \"clever fellow\"? He is the most written about person who has ever lived on earth. Religion was around before his existance - what extra cleverness do you think he may have possessed?", 
   {}, 
   363811, 
   null, 
   1249482060.0
  ], 
  [
   364010, 
   null, 
   "ShadowPikachu", 
   "So Jesus was just another \"clever fellow\"? He is the most written about person who has ever lived on earth. \n\n \n And? What about it? Are we (and by we I mean you) trying for a sly little argumentum ad populum and hoping no one sees it?", 
   {}, 
   364002, 
   null, 
   1249486980.0
  ], 
  [
   364057, 
   null, 
   "T.Q", 
   "I'm just posting to highlight the fact that \n Marc just stated the Appollo moon landings were a hoax\n \n that is all.", 
   {}, 
   364010, 
   null, 
   1249507080.0
  ], 
  [
   364093, 
   null, 
   "ShadowPikachu", 
   "The Apollo \"moon landings\" are one prime example. I fully believed them for 30 years ( I was 15 years old in 1969) but in about 1999 when I was encouraged to put them to the test, my belief easily crashed, as it would with most people if they would do some basic questioning of it. They don't. \n \n \n And that's the SAME EXACT THING millions of people do concerning the Apollo moon landings, and mnay other scientific proclamations. \n \n\n \n And what is it that convinced you that the Apollo moon landings did not occur?", 
   {
    "unicode_changes_made": true
   }, 
   364001, 
   null, 
   1249516020.0
  ], 
  [
   364101, 
   null, 
   "CUNxTime", 
   "So Jesus was just another \"clever fellow\"? \n\n \n Religion didn't really work out to well for Jesus, IMO. In fact, it made things rather unpleasant for him, so I'm not sure if clever is the right word. Now, if his goal was to get really famous after being tortured and killed then I guess it worked out for him.\n \n \nHe is the most written about person who has ever lived on earth.\n \n \n Maybe, but Christianity only makes up about a third of humanity. Seems to me that someone with an omnipitant being to back them up, there would be deeper market penetration. Ronald McDonald is more omnipresent than the 'son of god' in the world today. \n \n \n \n\n Religion was around before his existance\n \n \n Yes, and you can see its influences in most of what Jesus did. Really there wasn't much fresh material there. (though, he did have a great message which is valid even today, it unfortunately often gets distorted/ignored, for example...\n http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center.html#post363839 \n \n \n \n\n - what extra cleverness do you think he may have possessed?\n\n \n I'm not sure what you mean. If we're going by # of followers, I guess he's twice as 'clever' as Mohammad but a jewsworth less clever than Moses. If we're going by willingness to die for your god, he comes in way behind Mohammad. But if we go by 'willing to kill for your god,' he's only a few hundred million behind Mohammad..... .", 
   {}, 
   364002, 
   null, 
   1249518780.0
  ], 
  [
   364106, 
   null, 
   "CUNxTime", 
   "I don't blame Marc for not believing in the moon landings though. His stringent vetting requirements for evidence are legendary. He knows that in order for something to be believed, we require proof. And when he says proof, he means not just the pictures, the live recordings, the actual space-ship, the interviews with the people who were actually there, and the rocks that came off the moon's surface...he's talking about real evidence, of which, there's very little.", 
   {}, 
   364101, 
   null, 
   1249519740.0
  ], 
  [
   364125, 
   null, 
   "marc9000", 
   "And what is it that convinced you that the Apollo moon landings did not occur?\n\n \n Should be another thread - no time tonight. Maybe I'll start one in the coming days, or maybe someone here wants to start it. \n \n I'm only interested in what Unkerpaulie has to say in this thread.", 
   {}, 
   364093, 
   null, 
   1249523220.0
  ], 
  [
   364130, 
   null, 
   "unkerpaulie", 
   "The meticulous details they were giving about it was my point. It's always possible that the materials that the earth is made of are older than the earths present orbit around the sun. That seems to seldom be considered or speculated on by geologists, because their colleagues the evolutionists need the earths orbit around the sun to be old, or godless evolution can't work. \n \n\n Well its not a simple case of looking for reasons to exclude God. Science can only deal with what is observable. Observable phenomenon caused by unobservable agents isn't science. If God, or any aspect of God, was observable, then it would surely be included in science. \n \n \nThroughout this thread, and others, you seem to imply that it&#8217;s a shortcoming of/within Christianity only that causes you and others to reject it. My contention is that when one loses a previously held interest in Christianity, it&#8217;s because it was replaced with something else &#8211; some type of &#8220;freedom&#8221; involved with atheism. Earlier in post #10, you said this;\n \n What other things are important to you that Christianity interferes with? \n \n\n I didn't reject christianity because it didn't allow me to live a lifestyle I always fantasized about. I would never have rejected religion if there was real world evidence to validate it. I rejected not just christianity, but theism as a whole, because I had 2 major problems with the bible. One was that genesis could not be reconciled if taken as a literal historical record, and two, there is a very obvious lack of miraculous events, in the fashion of those described in the bible. The biblical God was my only god, so once he was out of the picture there was no god left so atheism was the only alternative. These are still legitimate issues that have not been resolved and create an insurmountable obstacle that stands between my currebt belief and returning to the christian faith. \n \n \nCould you link me to some evidence of your arguing in defense of creation when you first started posting here? I&#8217;m not calling you a liar, but it&#8217;s clear to me you&#8217;re exagerating. An individual posters archives don&#8217;t go back more than a couple of years in most cases, but archives for complete forums (like the religion forum) go back to the beginning of this board, and I found a thread you started , only about 2 weeks after you started posting here. At that point you said (post #4) you lost faith in God, and &#8220;didn&#8217;t know where you were&#8221;. I agree that you posted from a somewhat different perspective then, than you do now, but I see no evidence that you ever confidently posted in defense of creation. I&#8217;ll admit in big bold letters if I&#8217;m wrong, but you&#8217;ll have to show me. \n \n\n I went back to my earliest posts of the religion forum and c vs e forums and you're right. When I joined this forum I was actually past arguing against evolution and spontaneous origin, because I understood (had it beaten into me) exactly what these concepts were and how they came to be. That phase actually occured on a yahoo groups forum I used to post on before I found this one. And believe it of not, I was very vocal in the theist and christian camp in support of creation. The fact that the concepts that form the spontaneous origin theories collide head-on with the social giant that is religion doesn't make it any less valid. (Unfortunately \"science\" seems to meekly bow to the social giant that is the gay community, but that's another thread. ) Just like my religious beliefs, I tested every single concept about evolution thoroughly until they passed my personal validity test. Some still have not passed. \n \n If you have been following my other discussions around here you might find that I have been in many positions that have been unpopular. I spoke against invading iraq from day 1. I actually argued in support of the points made in farenheit 9/11. I still think that behavioral genetics is a load of #### and much more politics than science. I'm not convinced that the big bang theory is solid enough to be a real theory. And, like you, I'm not convinced that any humans actually landed on the moon, let alone 40 years ago. My method for selecting what I believe is a very rigorous one. Trust me, no smooth talking authorative character can get me to believe that stuff on that alone.", 
   {}, 
   364001, 
   null, 
   1249523880.0
  ], 
  [
   364135, 
   null, 
   "unkerpaulie", 
   "\n I don&#8217;t agree, because I believe there is a huge separation between the scriptures and human conclusions. The scriptures themselves discourage &#8220;putting God to the test&#8221;, and I think your posts indicate the reason for it. Equal, accurate testing of both humans and God isn't possible by humans. emoticon_idea\n \n\n First of all, and in contradiction to what you just said, the bible encourages us to test the scriptures, and in one of his letters the apostle Paul applauded the Bereans for their testing the scriptures, rather than taking his word for whatever he said. \n \n Where we also differ is in the idea that God cannot be rationalized by human reasoning. On numerous occassions its been established that God is not illogical, and cannot do the illogical (like create round squares or microwave burrittos too hot for him to eat). So what concepts about God are beyond human rationalization? Are there aspects about God that are indeed illogical? \n \n \nI&#8217;ll admit that I refrain from putting God/the Bible to the test, and am NEVER shy about putting anything involving human endeavors to the test. The implication from science/those who reject religion, is that they equally put everything to the test, and it&#8217;s obvious to me that they do not. They claim that if something comes along to logically replace Darwinism, they would immediately accept it, but their actions to not match their words. I clearly see them accepting some human action without question, with a blind faith quite equal to my Christianity. The Apollo &#8220;moon landings&#8221; are one prime example. I fully believed them for 30 years ( I was 15 years old in 1969) but in about 1999 when I was encouraged to put them to the test, my belief easily crashed, as it would with most people if they would do some basic questioning of it. They don't. \n \n\n You seem to be suggesting that because you feel that the scientific community doesn't really test their concepts in the face of new evidence (which they actually do) then you are justified in not testing the concepts you believe in in the face of new evidence. If a hypocritical standard is good enough for scientists, then its ok it should be ok for you too?\n \n \nThat&#8217;s simply untrue. There are many high-profile Christians, as well as countless retired pastors, who have spent their entire lives studying the Bible, and their faith continues to grow and flourish. Billy Graham, Henry Morris, James Dobson, Ravi Zacharias &#8211; many more, the list is long. Most biographys of Charles Darwin indicate that he lost his faith in God because of his bitterness of the early death of his daughter Anne. A similar thing happened to Henry Morris when he lost his son Andrew. No faith lost &#8211; you can read about it here. \n \n\n In my case the reasons had nothing to do with emotional incidents or personal life. It was a general and open observation about what is going on in the world around us. As for these people you've mentioned, I'd love to sit with them and chat at length on these topics. I'm sure that the results would be no different though. These christians essentially must accept the discrepancies without question in order to maintain their faith. There is no other way.\n \n \nAnd that&#8217;s the SAME EXACT THING millions of people do concerning the Apollo moon landings, and mnay other scientific proclamations. \n \n\n The moon landings were political proclamations, not scientific ones. \n \nThat can, and has, gone both ways. There are others (recently converted Christians) who would say the same about much of science. Different worldviews make the &#8220;truth&#8221; claims, but yours is no more valid than any Christians.\n\n That's why I say test it. Test my reasons. I can articulate quite concisely exactly why I believe what I believe, without emotional screens or defensive apologetics. Ask me anything about what I believe. Put your beliefs to the test as well. Question them. If the answers exist, then your reasons for believing is valid.", 
   {}, 
   364001, 
   null, 
   1249525920.0
  ], 
  [
   364139, 
   null, 
   "ShadowPikachu", 
   "Should be another thread - no time tonight. Maybe I'll start one in the coming days, or maybe someone here wants to start it. \n \n I'm only interested in what Unkerpaulie has to say in this thread.\n\n \n Fair enough - you're right, it would just get off-topic here.\n \n I started a thread in the Science and Math Section. Here's the link: http://www.4forums.com/political/science-math-debates/13074-apollo-moon-landings-didnt-happen.html", 
   {}, 
   364125, 
   null, 
   1249526520.0
  ], 
  [
   364312, 
   null, 
   "marc9000", 
   "Well its not a simple case of looking for reasons to exclude God. Science can only deal with what is observable. Observable phenomenon caused by unobservable agents isn't science. If God, or any aspect of God, was observable, then it would surely be included in science.\n\n \n I agree that science can only deal with what is observable. Most scientists today seem to see a difference in observability between God and their own speculations about what was happening on earth hundreds of millions of years ago. In the history channel presentation I referred to above, they were giving positions of continents, thicknesses of ice, etc. from hundreds of millions of years ago. I don't consider that type of speculation to be observable. \n \n \nI didn't reject christianity because it didn't allow me to live a lifestyle I always fantasized about. I would never have rejected religion if there was real world evidence to validate it. I rejected not just christianity, but theism as a whole, because I had 2 major problems with the bible. One was that genesis could not be reconciled if taken as a literal historical record, and two, there is a very obvious lack of miraculous events, in the fashion of those described in the bible. The biblical God was my only god, so once he was out of the picture there was no god left so atheism was the only alternative. These are still legitimate issues that have not been resolved and create an insurmountable obstacle that stands between my currebt belief and returning to the christian faith. \n\n \n Understood - you seek evidence, but to me the lack of physical evidence for God is no less than the lack of physical evidence for a mindless, spontanious generation of life. But your requirement for evidence still doesn't go far enough to address what you said earlier, and I'd like to look at that again;\n \n \nOrignially posted by unkerpaulie] I'm not interested in living happily ever after in heaven for all eternity with God. It doesn't appeal to me, and setting that as one of my life-time goals is going to distract me from things that are actually important. \n\n \n \"Setting that as one of my life-time goals is going to distract\" - I don't see how a Christian life is going to distract you from anything that's useful and important during your time on earth. What is distracting about accepting the free gift of salvation? My job and hobbies are all secular, and my Christianity doesn't affect them in the slightest. \n \n What's confusing about Christianity is the seeming contradictions between grace (salvation only by way of Jesus and the cross, and nothing of our own) vs. action of our own (works, acceptance of grace, following the ten commandments, etc.) Different Christians have different ideas of what our requirements are, indeed even if we are in control of them. But as I've said before, none of us asked to be born, so I don't think the requirements for salvation are all that much. I don't go to church every week because I feel like I have to, I go because I want to. Not to get something, but to say thanks for what I've already got. Because I am a Christian, I avoid being tempted by a few things I'd like to do, like partying a lot on weekends, going to casinos, drinking more, or even riding a motorcycle. I could probably do all those things and not lose my salvation, but I avoid them simply because I think they would be dispeasing to God in my case. \n \n I'm 54, you're 33, it seems like yesterday when I was 33, and you're going to be 54 before you know it. A couple more short decades and this short life on earth is over for me. What things are \"actually important\" for you to discard eternity with God? It's the only thing that's important to me - eternity is a really long time. And it's nothing I have to earn, it was earned for me 2000 years ago. So I can live like I feel like I need to live. Why can't you do that as well?\n \n \nI went back to my earliest posts of the religion forum and c vs e forums and you're right. When I joined this forum I was actually past arguing against evolution and spontaneous origin, because I understood (had it beaten into me) exactly what these concepts were and how they came to be. \n\n \n Satan does tend to beat things into people. To me, that is one of the clearest indicators that Christianity is true - so many non-Christians don't just shrug it off as would be expected, they go to a lot of trouble to oppose it. I'm not referring to you specifically, but those who beat it into you. \n \n \nThat phase actually occured on a yahoo groups forum I used to post on before I found this one. And believe it of not, I was very vocal in the theist and christian camp in support of creation. The fact that the concepts that form the spontaneous origin theories collide head-on with the social giant that is religion doesn't make it any less valid. (Unfortunately \"science\" seems to meekly bow to the social giant that is the gay community, but that's another thread. ) \n\n \n Science meekly bows to a lot of social giants, enough to make its opposition to religion a religion itself. \n \n \nJust like my religious beliefs, I tested every single concept about evolution thoroughly until they passed my personal validity test. Some still have not passed. \n \n If you have been following my other discussions around here you might find that I have been in many positions that have been unpopular. I spoke against invading iraq from day 1. I actually argued in support of the points made in farenheit 9/11. I still think that behavioral genetics is a load of #### and much more politics than science. I'm not convinced that the big bang theory is solid enough to be a real theory. And, like you, I'm not convinced that any humans actually landed on the moon, let alone 40 years ago. My method for selecting what I believe is a very rigorous one. Trust me, no smooth talking authorative character can get me to believe that stuff on that alone.\n\n \n I believe you, but you seem to be the exception to the rule. So many atheists faithfully accept almost anything a scientific source tells them, without verifying it any more than Christians verify what the Bible tells them. I brought up the moon thing because I faintly remembered getting grief in the past from others who obviously have no more scientific connection with it than I do, only because I was skeptical of it. It was the \"A challange for both sides\" thread of a couple of years ago. Check out posts #167 thru about 174 an emotional anger that is more faithful in nature than it is scientific. You could also check out post #198 and my #220 response to it also. Haha, sometimes reading through some old threads is a blast!", 
   {
    "unicode_changes_made": true
   }, 
   364130, 
   null, 
   1249609500.0
  ], 
  [
   364313, 
   null, 
   "marc9000", 
   "First of all, and in contradiction to what you just said, the bible encourages us to test the scriptures, and in one of his letters the apostle Paul applauded the Bereans for their testing the scriptures, rather than taking his word for whatever he said. \n \n Where we also differ is in the idea that God cannot be rationalized by human reasoning. On numerous occassions its been established that God is not illogical, and cannot do the illogical (like create round squares or microwave burrittos too hot for him to eat). So what concepts about God are beyond human rationalization? Are there aspects about God that are indeed illogical? \n\n \n Scriptures are to be tested not for their overall valididity, but for application to our personal lives. There is a difference between seeking to know God vs. seeking to reject him, or test him. \n \n What source has established that God is not illogical? I'd have to get back to you on that, I'm not sure if or how the word \"logic\" translates from the original languages of the Bible. \n \n \nYou seem to be suggesting that because you feel that the scientific community doesn't really test their concepts in the face of new evidence (which they actually do) then you are justified in not testing the concepts you believe in in the face of new evidence. If a hypocritical standard is good enough for scientists, then its ok it should be ok for you too? \n\n \n I'm simply claiming that there is an uncomparable difference in what humans do, vs what God does/ has done. Yet there is often no difference in how much testing non-religious scientists do, vs what Christians do, concerning what they want to believe. \n \n \nIn my case the reasons had nothing to do with emotional incidents or personal life. It was a general and open observation about what is going on in the world around us. As for these people you've mentioned, I'd love to sit with them and chat at length on these topics. I'm sure that the results would be no different though. These christians essentially must accept the discrepancies without question in order to maintain their faith. There is no other way. \n\n \n As scientists must accept their gaps. I'm about to buy a book by Dobson called \"When God Doesn't Make Sense\", I'm wondering what it says about \"logic\" - a word that may not even exist in the original Biblical languages. If you really want some mind exercise, do some youtubing of Ravi Zacharias. \n \n \nThe moon landings were political proclamations, not scientific ones. \n\n \n Whew, you'd better not let the previoulsy linked authors of posts 167 or 168 in the \"challange for both sides\" thread see that you said that! :p\n \n \nThat's why I say test it. Test my reasons. I can articulate quite concisely exactly why I believe what I believe, without emotional screens or defensive apologetics. Ask me anything about what I believe. Put your beliefs to the test as well. Question them. If the answers exist, then your reasons for believing is valid.\n\n \n Again, I believe you, and I hope you believe that I'm that way too. \n \n (I'll post in the latest moon thread tomorrow or over the weekend, no time tonight.)", 
   {
    "unicode_changes_made": true
   }, 
   364135, 
   null, 
   1249610400.0
  ], 
  [
   364365, 
   null, 
   "unkerpaulie", 
   "Scriptures are to be tested not for their overall valididity, but for application to our personal lives. There is a difference between seeking to know God vs. seeking to reject him, or test him. \n \n What source has established that God is not illogical? I'd have to get back to you on that, I'm not sure if or how the word \"logic\" translates from the original languages of the Bible. \n \n I&#8217;m simply claiming that there is an uncomparable difference in what humans do, vs what God does/ has done. Yet there is often no difference in how much testing non-religious scientists do, vs what Christians do, concerning what they want to believe. \n \n As scientists must accept their gaps. I&#8217;m about to buy a book by Dobson called &#8220;When God Doesn&#8217;t Make Sense&#8221;, I&#8217;m wondering what it says about &#8220;logic&#8221; &#8211; a word that may not even exist in the original Biblical languages. If you really want some mind exercise, do some youtubing of Ravi Zacharias. \n\n Can God, in his omnipotence, create a round square? Rhetorical question, but the point is that even with respect to God, the illogical cannot be done. Unless you believe that it can, but that's another discussion. \n \n Like I said, we differ fundamentally in the way we treat what we believe. You feel that when it comes to things concerning God, you cannot and should not attempt to test them, simply because they are things of God and should be treated as a special case. If that is so, then I should be able to tell you anything about God, and you shouldn't test it, even if it were something that contradicts what you already believe about God. You should just believe it unquestioningly, because it concerns God. Right?\n \nUnderstood &#8211; you seek evidence, but to me the lack of physical evidence for God is no less than the lack of physical evidence for a mindless, spontanious generation of life. But your requirement for evidence still doesn&#8217;t go far enough to address what you said earlier, and I&#8217;d like to look at that again;\n \n &#8220;Setting that as one of my life-time goals is going to distract&#8221; &#8211; I don&#8217;t see how a Christian life is going to distract you from anything that&#8217;s useful and important during your time on earth. What is distracting about accepting the free gift of salvation? My job and hobbies are all secular, and my Christianity doesn&#8217;t affect them in the slightest. \n \n What&#8217;s confusing about Christianity is the seeming contradictions between grace (salvation only by way of Jesus and the cross, and nothing of our own) vs. action of our own (works, acceptance of grace, following the ten commandments, etc.) Different Christians have different ideas of what our requirements are, indeed even if we are in control of them. But as I&#8217;ve said before, none of us asked to be born, so I don&#8217;t think the requirements for salvation are all that much. I don&#8217;t go to church every week because I feel like I have to, I go because I want to. Not to get something, but to say thanks for what I&#8217;ve already got. Because I am a Christian, I avoid being tempted by a few things I&#8217;d like to do, like partying a lot on weekends, going to casinos, drinking more, or even riding a motorcycle. I could probably do all those things and not lose my salvation, but I avoid them simply because I think they would be dispeasing to God in my case. \n \n I&#8217;m 54, you&#8217;re 33, it seems like yesterday when I was 33, and you&#8217;re going to be 54 before you know it. A couple more short decades and this short life on earth is over for me. What things are &#8220;actually important&#8221; for you to discard eternity with God? It&#8217;s the only thing that&#8217;s important to me &#8211; eternity is a really long time. And it&#8217;s nothing I have to earn, it was earned for me 2000 years ago. So I can live like I feel like I need to live. Why can&#8217;t you do that as well?\n\n I don't want the encumberment of a belief system that takes away my freedom, especially if I'm not sacrificing my freedom for anything in return. From my perspective, where there is no afterlife and no God and no eternal soul, there is absolutely no benefit in spending time pursuing things that pertain to them. Would you put out milk and cookies on the table on christmas eve, and make sure that the chimney was clear, and that you had empty stockings for everyone in the house with their names on it? No? Would you view it as a waste of my time if I was seriously preparing for santa claus to visit, to the point where I put that as a priority over, say, doing my laundry? Particularly when we both know that the laundermat is closed for the long weekend and I'd be out of clean clothes for at least 3 days? That's how I feel about religious things. Time is short. I intend to become ridiculously wealthy, pursue business, real estate and investment ventures, teach my son to be creative and entreprenuerial, and generally live a life that defies the status quo, the details I won't get into right now. But getting involved in activities that reap no returns and are simply a waste of time, I have no interest in putting time and effort towards them, just as you would towards santa claus visiting you.", 
   {}, 
   364313, 
   null, 
   1249637880.0
  ], 
  [
   364367, 
   null, 
   "Accipiter", 
   "I don't want the encumberment of a belief system that takes away my freedom to think and learn from science.\n \n Quitting religion clears the way for learning more about the world and yourself then just what is in the bible.\n \n Religion sets some people up as an adversary to science as in marc's case.\n \n I have seen this in many other people as well and I think it's a shame.", 
   {
    "unicode_changes_made": true
   }, 
   364365, 
   null, 
   1249643100.0
  ], 
  [
   364395, 
   null, 
   "CUNxTime", 
   "I don't want the encumberment of a belief system that takes away my freedom to think and learn from science.\n \n Quitting religion clears the way for learning more about the world and yourself then just what is in the bible.\n \n Religion sets some people up as an adversary to science as in marc's case.\n \n I have seen this in many other people as well and I think it's a shame.\n\n \n I agree. Science is fundamentally a why to explain the world around us. Religion's goal is fairly similar. However, Science is constantly changing to reflect new data that we acquire. That's one huge drawback of religion, it was developed thousands of years ago and does not incorporate new data. That's what baffles me most about the bible. It is so obviously written by men of a certain time period and everything about it reflects the worldview/knowledge of the men of its particular time period. How it could be mistaken for the literal word of an eternal, omnipresent god is beyond me.", 
   {
    "unicode_changes_made": true
   }, 
   364367, 
   null, 
   1249655700.0
  ], 
  [
   364542, 
   null, 
   "Archangel", 
   "I agree. Science is fundamentally a why to explain the world around us. Religion's goal is fairly similar. However, Science is constantly changing to reflect new data that we acquire. That's one huge drawback of religion, it was developed thousands of years ago and does not incorporate new data. That's what baffles me most about the bible. It is so obviously written by men of a certain time period and everything about it reflects the worldview/knowledge of the men of its particular time period. How it could be mistaken for the literal word of an eternal, omnipresent god is beyond me.\n\n \n What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.", 
   {}, 
   364395, 
   null, 
   1249743840.0
  ], 
  [
   364543, 
   null, 
   "Accipiter", 
   "What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.\n\n \n And all that is required is for us to intellectually cripple ourselves so that we may believe in fairytales?\n \n Sorry but I choose not to be an ignorant bigot.", 
   {}, 
   364542, 
   null, 
   1249744740.0
  ], 
  [
   364548, 
   null, 
   "Archangel", 
   "What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.\n\n \n \nAnd all that is required is for us to intellectually cripple ourselves so that we may believe in fairytales?\n \n Sorry but I choose not to be an ignorant bigot.\n\n \n By making this intellectually shallow and shortsighted statement, you have shown that you are already intellectually crippled and a spiritually ignorant bigot. I say this because my post above made clear that only spiritual truths are absolute and require no updating. That doesn't conflict with scientific truths at all. So the only ignorant bigots here are the atheists who ignore the spiritual aspects of their human construct. But you are obviously oblivious to that reality, right? emoticon_confused I am truly confused by your lack of spiritual insight. emoticon_rolleyes", 
   {}, 
   364543, 
   null, 
   1249746600.0
  ], 
  [
   364549, 
   null, 
   "Accipiter", 
   "By making this intellectually shallow and shortsighted statement, you have shown that you are already intellectually crippled and a spiritually ignorant bigot. I say this because my post above made clear that only spiritual truths are absolute and require no updating. That doesn't conflict with scientific truths at all. So the only ignorant bigots here are the atheists who ignore the spiritual aspects of their human construct. But you are obviously oblivious to that reality, right? emoticon_confused I am truly confused by your lack of spiritual insight. emoticon_rolleyes\n\n \n Ok fair enough I get my science plus I can believe in a god.\n \n Sure that would be good but problem is I know that is not going to keep me from burning in hell, so why bother?", 
   {}, 
   364548, 
   null, 
   1249747860.0
  ], 
  [
   364550, 
   null, 
   "Archangel", 
   "Ok fair enough I get my science plus I can believe in a god.\n \n Sure that would be good but problem is I know that is not going to keep me from burning in hell, so why bother?\n\n \n It is your belief which understands that just believing in a god wont keep you from burning in hell which is actually your saving grace. If you can only grasp that by accepting the one and only true and living God that you can escape that fate, then there is hope for you yet. emoticon_xgood", 
   {}, 
   364549, 
   null, 
   1249748340.0
  ], 
  [
   364565, 
   null, 
   "simone", 
   "Questionable wisdom from the font of fear.", 
   {}, 
   364550, 
   null, 
   1249758060.0
  ], 
  [
   364590, 
   null, 
   "Archangel", 
   "Questionable wisdom from the font of fear.\n\n \n Not fear at all simone, but out of a sense of love, respect and honor for a God who is worthy of our devotion.", 
   {}, 
   364565, 
   null, 
   1249768080.0
  ], 
  [
   364630, 
   null, 
   "simone", 
   "What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.\n\n Hmm, the \"Absolute Truth.\"\n \n The \"Absolute Truth\" as determined by whom?", 
   {}, 
   364542, 
   null, 
   1249779060.0
  ], 
  [
   364642, 
   null, 
   "Archangel", 
   "Hmm, the \"Absolute Truth.\"\n \n The \"Absolute Truth\" as determined by whom?\n\n \n Ultimately, as determined by God and only God. Whether you accept or deny His values, that has no bearing in the fact that His values and principles are eternal and absolute. That is where the great shock will be for you deniers of God and His truths. You will find that all of your mockery and denials of God were in fact you being deceived by a very intelligent enemy who played you like a cheap fiddle for the entirety of your life in this flesh. And you will realize for all eternity that you denied that which mattered the most in life and that you mocked, condemned and insulted those who were the only people who actually shared the eternal truth with you. That is what will make your futile and hopeless existence so utterly bitter and terrible. Because you will know full well that you truly did hate the truth and everyone who attempted to share it with you.", 
   {}, 
   364630, 
   null, 
   1249786140.0
  ], 
  [
   364648, 
   null, 
   "Accipiter", 
   "It is your belief which understands that just believing in a god wont keep you from burning in hell which is actually your saving grace. If you can only grasp that by accepting the one and only true and living God that you can escape that fate, then there is hope for you yet. emoticon_xgood\n\n \n I would not call it my belief, I would call it your belief which I just regurgitated back at you.\n \n The fact is I don't believe it, not one bit of it.", 
   {
    "unicode_changes_made": true
   }, 
   364550, 
   null, 
   1249787460.0
  ], 
  [
   364650, 
   null, 
   "marc9000", 
   "Can God, in his omnipotence, create a round square? Rhetorical question, but the point is that even with respect to God, the illogical cannot be done. Unless you believe that it can, but that's another discussion. \n \n Like I said, we differ fundamentally in the way we treat what we believe. You feel that when it comes to things concerning God, you cannot and should not attempt to test them, simply because they are things of God and should be treated as a special case. If that is so, then I should be able to tell you anything about God, and you shouldn't test it, even if it were something that contradicts what you already believe about God. You should just believe it unquestioningly, because it concerns God. Right? \n\n \n Of course not. Just because something CONCERNS God doesn't mean it's OF God. It doesn't matter if it's you telling me something about God, or Ravi Zacharias telling me something about God, it's a human that's telling me, so it's subject to a test. \n \n IMO, what is not subject to a test is the word of God. The text was inspired by God like nothing else ever written, and its arrangment of 66 books has stood the test of time. \n \n \n \nI don't want the encumberment of a belief system that takes away my freedom, especially if I'm not sacrificing my freedom for anything in return. From my perspective, where there is no afterlife and no God and no eternal soul, there is absolutely no benefit in spending time pursuing things that pertain to them. Would you put out milk and cookies on the table on christmas eve, and make sure that the chimney was clear, and that you had empty stockings for everyone in the house with their names on it? No? Would you view it as a waste of my time if I was seriously preparing for santa claus to visit, to the point where I put that as a priority over, say, doing my laundry? Particularly when we both know that the laundermat is closed for the long weekend and I'd be out of clean clothes for at least 3 days? That's how I feel about religious things. Time is short. I intend to become ridiculously wealthy, pursue business, real estate and investment ventures, teach my son to be creative and entreprenuerial, and generally live a life that defies the status quo, the details I won't get into right now. But getting involved in activities that reap no returns and are simply a waste of time, I have no interest in putting time and effort towards them, just as you would towards santa claus visiting you.\n\n \n You've made yourself clear, and that's where we have to leave it. You've described your upbringing in Christianity - only you know exactly how that did/didn't effect your beliefs today. But God loves you whether you like it or not - you're 33 and probably have a lot of years left. It may not happen soon, but I think someday God is going to get your attention again. Don't forget that someone told you that. (it doesn't matter who) emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   364365, 
   null, 
   1249789860.0
  ], 
  [
   364670, 
   null, 
   "CUNxTime", 
   "What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.\n\n \n Dude, the 'truth' changes thought the bible. God's telling people to kill one minute and saying 'thou shalt not' the next. The bible is so FULL of contradictions that I'm surprised your head doesn't spin around just for trying to eek out one eternal aspect of the bible. If you want eternal truth try this\n \n E=MC2\n Entropy increases\n and You only go around once!", 
   {}, 
   364542, 
   null, 
   1249796280.0
  ], 
  [
   364703, 
   null, 
   "Easyrider", 
   "Dude, the 'truth' changes thought the bible. God's telling people to kill one minute and saying 'thou shalt not' the next.\n\n \n You're confusing murder with divine justice again.\n \n \n\n The bible is so FULL of contradictions that I'm surprised your head doesn't spin around just for trying to eek out one eternal aspect of the bible. \n\n \n How about \"eeking\"-out one on the Resurrection, then? What have you got? If you can make my head spin around on one of those you get a French date.", 
   {}, 
   364670, 
   null, 
   1249825320.0
  ], 
  [
   364715, 
   null, 
   "CUNxTime", 
   "You're confusing murder with divine justice again.\n\n \n \n What about raping the virgins then? Or what he did to Job? How is killing someone including woman (non-virgins of course) then raping and 'marrying' their young virgin kids justice? And if it is it only proves my point about how fleeting god's whim is in the bible...\n \n \n How about \"eeking\"-out one on the Resurrection, then? What have you got? If you can make my head spin around on one of those you get a French date.\n\n \n LOL, you were supposed to answer all my questions on the other thread. You didn't make much headway. Furthermore, Jesus himself said OVER AND OVER that he wasn't the messiah. I'm gonna take his word for it (something a lot of Christians don't seem to want to do).", 
   {}, 
   364703, 
   null, 
   1249832700.0
  ], 
  [
   364721, 
   null, 
   "Easyrider", 
   " LOL, you were supposed to answer all my questions on the other thread. You didn't make much headway.\n\n \n You were the one shooting blanks. If there was one you were real proud of in the NT let's see it again.\n \n In the meantime I'll give you an example of your stunted Biblical understanding below.\n \n \n Furthermore, Jesus himself said OVER AND OVER that he wasn't the messiah. I'm gonna take his word for it (something a lot of Christians don't seem to want to do).\n\n \n From John chapter 4:\n \n 21Jesus declared, \"Believe me, woman, a time is coming when you will worship the Father neither on this mountain nor in Jerusalem. 22You Samaritans worship what you do not know; we worship what we do know, for salvation is from the Jews. 23Yet a time is coming and has now come when the true worshipers will worship the Father in spirit and truth, for they are the kind of worshipers the Father seeks. 24God is spirit, and his worshipers must worship in spirit and in truth.\" \n \n 25 The woman said, \"I know that Messiah\" (called Christ) \"is coming. When he comes, he will explain everything to us.\" \n \n 26 Then Jesus declared, \"I who speak to you am he.\"", 
   {}, 
   364715, 
   null, 
   1249836780.0
  ], 
  [
   364727, 
   null, 
   "Archangel", 
   "Furthermore, Jesus himself said OVER AND OVER that he wasn't the messiah. I'm gonna take his word for it (something a lot of Christians don't seem to want to do).\n\n \n Really? I must have missed that part of His gospel message. Let's compare scripture verses that support our claims, shall we? I'll go first.\n Jhn 14:6 Jesus said to him, \"I am the way, the truth, and the life. No one comes to the Father except through Me.\n Jhn 14:7 \"If you had known Me, you would have known My Father also; and from now on you know Him and have seen Him.\"\n Jhn 14:8 Philip said to Him, \"Lord, show us the Father, and it is sufficient for us.\"\n Jhn 14:9 Jesus said to him, \"Have I been with you so long, and yet you have not known Me, Philip? He who has seen Me has seen the Father; so how can you say, 'Show us the Father'?\n \n =================================================================================================\n \n Jhn 10:9 I am the door. If anyone enters by Me, he will be saved, and will go in and out and find pasture.\n \n Mat 11:27 All things have been delivered to Me by My Father, and no one knows the Son except the Father. Nor does anyone know the Father except the Son, and [the one] to whom the Son wills to reveal [Him].\n \n Act 4:12 Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved.\"\n \n Rom 5:2 through whom also we have access by faith into this grace in which we stand, and rejoice in hope of the glory of God.\n \n Eph 2:18 For through Him we both have access by one Spirit to the Father.\n \n Hbr 7:25 Therefore He is also able to save to the uttermost those who come to God through Him, since He always lives to make intercession for them.Now why don't you go ahead and quote scriptures where Jesus denies that He is the Messiah over and over.", 
   {}, 
   364715, 
   null, 
   1249841460.0
  ], 
  [
   364736, 
   null, 
   "simone", 
   "God and only God...\n\n And which god might that be? There are great numbers of gods (and goddesses) from which to choose.", 
   {}, 
   364727, 
   null, 
   1249844580.0
  ], 
  [
   364753, 
   null, 
   "Accipiter", 
   "Oh! Oh! I know this one:\n \n THE ONE TRUE GOD.", 
   {}, 
   364736, 
   null, 
   1249852920.0
  ], 
  [
   364791, 
   null, 
   "Archangel", 
   "And which god might that be? There are great numbers of gods (and goddesses) from which to choose.\n\n \n Jos 24:15 \"If it is disagreeable in your sight to serve the LORD, choose for yourselves today whom you will serve: whether the gods which your fathers served which were beyond the River, or the gods of the Amorites in whose land you are living; but as for me and my house, we will serve the LORD.\" ", 
   {}, 
   364736, 
   null, 
   1249860180.0
  ], 
  [
   364794, 
   null, 
   "simone", 
   "Jos 24:15? What book of the bible is that?\n \n I thought I knew the names of all the books of the bible used by Protestants but I don't recognize Jos.", 
   {}, 
   364791, 
   null, 
   1249862280.0
  ], 
  [
   364797, 
   null, 
   "Jo Bennett", 
   "Jos 24:15? What book of the bible is that?\n \n I thought I knew the names of all the books of the bible used by Protestants but I don't recognize Jos.\n\n \n Joshua, in between Deuteronomy and Judges if you're curious.\n \n Is it really beyond the wit of simone to cut and paste the quote in google and check?", 
   {}, 
   364794, 
   null, 
   1249862880.0
  ], 
  [
   364803, 
   null, 
   "simone", 
   "I am familiar with the book of Joshua, but God only knows Archie might have his own special bible with a book of Josephus or Joselina.\n \n What's wrong with spelling out Joshua?", 
   {}, 
   364797, 
   null, 
   1249868520.0
  ], 
  [
   364807, 
   null, 
   "T.Q", 
   "I am familiar with the book of Joshua, but God only knows Archie might have his own special bible with a book of Josephus or Joselina.\n \n What's wrong with spelling out Joshua?\n\n \n When you're God's goodbuddy like Archie is, you get to call Joshua by his nickname, Jos.", 
   {}, 
   364803, 
   null, 
   1249869660.0
  ], 
  [
   364812, 
   null, 
   "CUNxTime", 
   "You were the one shooting blanks. If there was one you were real proud of in the NT let's see it again.\n \n In the meantime I'll give you an example of your stunted Biblical understanding below.\n \n \n \n From John chapter 4:\n \n 21Jesus declared, \"Believe me, woman, a time is coming when you will worship the Father neither on this mountain nor in Jerusalem. 22You Samaritans worship what you do not know; we worship what we do know, for salvation is from the Jews. 23Yet a time is coming and has now come when the true worshipers will worship the Father in spirit and truth, for they are the kind of worshipers the Father seeks. 24God is spirit, and his worshipers must worship in spirit and in truth.\" \n \n 25 The woman said, \"I know that Messiah\" (called Christ) \"is coming. When he comes, he will explain everything to us.\" \n \n 26 Then Jesus declared, \"I who speak to you am he.\"\n\n \n \nReally? I must have missed that part of His gospel message. Let's compare scripture verses that support our claims, shall we? I'll go first.\n Jhn 14:6 Jesus said to him, \"I am the way, the truth, and the life. No one comes to the Father except through Me.\n Jhn 14:7 \"If you had known Me, you would have known My Father also; and from now on you know Him and have seen Him.\"\n Jhn 14:8 Philip said to Him, \"Lord, show us the Father, and it is sufficient for us.\"\n Jhn 14:9 Jesus said to him, \"Have I been with you so long, and yet you have not known Me, Philip? He who has seen Me has seen the Father; so how can you say, 'Show us the Father'?\n \n =================================================================================================\n \n Jhn 10:9 I am the door. If anyone enters by Me, he will be saved, and will go in and out and find pasture.\n \n Mat 11:27 All things have been delivered to Me by My Father, and no one knows the Son except the Father. Nor does anyone know the Father except the Son, and [the one] to whom the Son wills to reveal [Him].\n \n Act 4:12 Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved.\"\n \n Rom 5:2 through whom also we have access by faith into this grace in which we stand, and rejoice in hope of the glory of God.\n \n Eph 2:18 For through Him we both have access by one Spirit to the Father.\n \n Hbr 7:25 Therefore He is also able to save to the uttermost those who come to God through Him, since He always lives to make intercession for them.Now why don't you go ahead and quote scriptures where Jesus denies that He is the Messiah over and over.\n\n \n He continually states that he is the \"Son of Man\" he also says that 'God is greater than I\". I was going to go find all the verses but I found this piece which sums it up fairly well. (BTW: I don't believe any of the claims in the bible pertaining to supernatural stuff so your quotes will never mean anything to me. Using the bible quotes to \"prove\" the claims of the bible is rediculous. If this was how you find the truth, in trials they'd only put the accused on the stand. However, Jesus was a good man, with some good ideas about peace and love)................... \n \n Part 1 of 7 parts\n \n All of the writers of the Bible believed that God was not Jesus. The idea that Jesus is God did not become part of Christian belief until after the Bible was written, and took many centuries to become part of the faith of Christians.\n \n Matthew, Mark, and Luke, authors of the first three Gospels, believed that Jesus was not God (see Mark 10:18 and Matthew 19:17). They believed that he was the son of God in the sense of a righteous person. Many others too, are similarly called sons of God (see Matthew 23:1-9).\n \n Paul, believed to be the author of some thirteen or fourteen letters in the Bible, also believed that Jesus is not God. For Paul, God first created Jesus, then used Jesus as the agent by which to create the rest of creation (see Colossians 1:15 and 1 Corinthians 8:6). Similar ideas are found in the letter to the Hebrews, and also in the Gospel and Letters of John composed some seventy years after Jesus. In all of these writings, however, Jesus is still a creature of God and is therefore forever subservient to God (see 1 Corinthians 15:28).\n \n Now, because Paul, John, and the author of Hebrews believed that Jesus was God's first creature, some of what they wrote clearly show that Jesus was a pre-existent powerful being. This is often misunderstood to mean that he must have been God. But to say that Jesus was God is to go against what these very authors wrote. Although these authors had this later belief that Jesus is greater than all creatures, they also believed that he was still lesser than God. In fact, John quotes Jesus as saying: \"...the Father is greater than I.\" (John 14:28). And Paul declares that the head of every woman is her husband, the head of every man is Christ, and the head of Christ is God (see 1 Corinthians 11:3).\n \n Therefore, to find something in these writings and claim that these teach that Jesus is God is to misuse and misquote what those authors are saying. What they wrote must be understood in the context of their belief that Jesus is a creature of God as they have already clearly said.\n \n So we see then, that some of the later writers had a higher view of Jesus, but none of the writers of the Bible believed that Jesus is God. The Bible clearly teaches that there is only one true God, the one whom Jesus worshipped (see John 17: 3).\n \n \n The Bible Denies the Divinity of Jesus (part 1 of 7): Bible's writers - The Religion of Islam", 
   {
    "unicode_changes_made": true
   }, 
   364727, 
   null, 
   1249873020.0
  ], 
  [
   364814, 
   null, 
   "CUNxTime", 
   "Joshua, in between Deuteronomy and Judges if you're curious.\n \n Is it really beyond the wit of simone to cut and paste the quote in google and check?\n\n \n Us lowly peons find it easier to wait on those of superior intellect and wit to enlighten us in our ignorance. Thank you for being the smartest person in these forums (if not the world) for with your guiding wisdom we would all surely be lost.", 
   {}, 
   364797, 
   null, 
   1249873620.0
  ], 
  [
   364825, 
   null, 
   "Archangel", 
   "He continually states that he is the \"Son of Man\" he also says that 'God is greater than I\". I was going to go find all the verses but I found this piece which sums it up fairly well. (BTW: I don't believe any of the claims in the bible pertaining to supernatural stuff so your quotes will never mean anything to me. Using the bible quotes to \"prove\" the claims of the bible is rediculous. If this was how you find the truth, in trials they'd only put the accused on the stand. However, Jesus was a good man, with some good ideas about peace and love)................... \n \n Part 1 of 7 parts\n \n All of the writers of the Bible believed that God was not Jesus. The idea that Jesus is God did not become part of Christian belief until after the Bible was written, and took many centuries to become part of the faith of Christians.\n \n Matthew, Mark, and Luke, authors of the first three Gospels, believed that Jesus was not God (see Mark 10:18 and Matthew 19:17). They believed that he was the son of God in the sense of a righteous person. Many others too, are similarly called sons of God (see Matthew 23:1-9).\n \n Paul, believed to be the author of some thirteen or fourteen letters in the Bible, also believed that Jesus is not God. For Paul, God first created Jesus, then used Jesus as the agent by which to create the rest of creation (see Colossians 1:15 and 1 Corinthians 8:6). Similar ideas are found in the letter to the Hebrews, and also in the Gospel and Letters of John composed some seventy years after Jesus. In all of these writings, however, Jesus is still a creature of God and is therefore forever subservient to God (see 1 Corinthians 15:28).\n \n Now, because Paul, John, and the author of Hebrews believed that Jesus was God's first creature, some of what they wrote clearly show that Jesus was a pre-existent powerful being. This is often misunderstood to mean that he must have been God. But to say that Jesus was God is to go against what these very authors wrote. Although these authors had this later belief that Jesus is greater than all creatures, they also believed that he was still lesser than God. In fact, John quotes Jesus as saying: \"...the Father is greater than I.\" (John 14:28). And Paul declares that the head of every woman is her husband, the head of every man is Christ, and the head of Christ is God (see 1 Corinthians 11:3).\n \n Therefore, to find something in these writings and claim that these teach that Jesus is God is to misuse and misquote what those authors are saying. What they wrote must be understood in the context of their belief that Jesus is a creature of God as they have already clearly said.\n \n So we see then, that some of the later writers had a higher view of Jesus, but none of the writers of the Bible believed that Jesus is God. The Bible clearly teaches that there is only one true God, the one whom Jesus worshipped (see John 17: 3).\n \n \n The Bible Denies the Divinity of Jesus (part 1 of 7): Bible's writers - The Religion of Islam\n\n \n I was born into islam CxT, I know what islam thinks of Jesus humanity as opposed to His divinity. Simply put, they are raping the word of God and its true intent in their perverse interpretation of who Jesus is. Of course you are free to accept islams interpretation of the Judeo/christian bible, but that makes about as much sense as studying a science text book to learn math. But good luck with that. emoticon_confused", 
   {
    "unicode_changes_made": true
   }, 
   364812, 
   null, 
   1249878180.0
  ], 
  [
   364827, 
   null, 
   "Archangel", 
   "And which god might that be? There are great numbers of gods (and goddesses) from which to choose.\n\n \n \n\n Jos 24:15 \"If it is disagreeable in your sight to serve the LORD, choose for yourselves today whom you will serve: whether the gods which your fathers served which were beyond the River, or the gods of the Amorites in whose land you are living; but as for me and my house, we will serve the LORD.\" \n\n \n \nJos 24:15? What book of the bible is that?\n \n I thought I knew the names of all the books of the bible used by Protestants but I don't recognize Jos.\n\n \n \nJoshua, in between Deuteronomy and Judges if you're curious.\n \n Is it really beyond the wit of simone to cut and paste the quote in google and check?\n\n \n \nI am familiar with the book of Joshua, but God only knows Archie might have his own special bible with a book of Josephus or Joselina.\n \n What's wrong with spelling out Joshua?\n\n \n Nothing is wrong with spelling it out if I actually wrote out the verse for you. But since I copy and pasted it from the source, I saw no reason to. I obviously mistakenly figured you could figure out which book it was taken from. SORRY... emoticon_rolleyes\n Blue Letter Bible - Book of Joshua 24 (NKJV - New King James Version)", 
   {}, 
   364803, 
   null, 
   1249878720.0
  ], 
  [
   364953, 
   null, 
   "Easyrider", 
   "\n Part 1 of 7 parts\n \n All of the writers of the Bible believed that God was not Jesus. \n\n \n That's completely absurd.\n \n If Jesus never claimed to be God in John chapter 8, why then did the Jews pick up stones to stone him? \n \n The Jews therefore said to Him, \"You are not yet fifty years old, and have You seen Abraham?\" Jesus said to them, \"Truly, truly, I say to you, before Abraham was born, I am.\" Therefore they picked up stones to throw at Him; but Jesus hid Himself, and went out of the temple. (John 8:57-59) \n \n Seems to me the Jews knew exactly what Jesus was claiming, and this is verified again in the following passage by John:\n \n \"I and the Father are one.\" The Jews took up stones again to stone Him. Jesus answered them, \"I showed you many good works from the Father; for which of them are you stoning Me?\" The Jews answered Him, \"For a good work we do not stone You, but for blasphemy; and because You, being a man, make Yourself out to be God.\" (John 10:30-33)\n \n THE DEITY OF JESUS CHRIST\n \n 1. Jesus existed in the beginning (John 1:1; Philip 2:6; Rev. 19:13; Micah 5:2).\n 2. He was with God (John 1:1).\n 3. He is God, the Son (John 1:1; Rom. 9:5; Heb. 1:8, 10; I John 5:20).\n 4. He is God manifest in the flesh (John 20:28; I Tim. 3:16; Col. 2:9; Acts 20:28; Heb. 1:8).\n 5. He is God foretold (Isaiah 9:6; Psalm 45:6).\n 6. He is Immanuel, God with us (Isaiah 7:14; Matthew 1:23).\n 7. He is the true God (I John 5:20 with Titus 2:13; Romans 9:5).\n 8. He is the great God (Titus 2:13).\n 9. He is God our Savior (II Peter 1:1).\n 10. He existed in the form of God before His incarnation and was equal with God the Father \n (Philippians 2:5-7).\n 11. He is the only wise God (Jude 25).\n 12. He is omnipotent over disease. (Matthew 8:1-4; Luke 4:39)\n 13. He is omnipotent over demons. (Matthew 8:16-17; Luke 4:35)\n 14. He is omnipotent over nature. ((Matthew 8:26)\n 15. He is omnipotent over death. (Luke 7:14-15; John 11:25)\n 16. He is omniscient, knowing the hearts of the Pharisees. (Matthew 12:25;\n Luke 5:22; 6:8; 7:39-40)\n 17. He knew the thoughts of the scribes. (Matthew 9:3-4)\n 18. He knew the history of the Samaritan woman. (John 4:24)\n 19. He is omnipresent. (Matthew 18:20; 28:20; John 3:13; 14:20)\n 20. He was worshiped as God by the angels (Hebrews 1:6); worshiped as\n God by the wise men (Matthew 2:2); worshiped as God by the shepherds\n (Luke 2:15); worshiped as God by a ruler (Matthew 9:18); worshiped as\n God by Thomas (John 20:28); worshiped as God by the apostles (Matthew\n 14:33; 28:9).\n 21. He forgives sins. (Mark 2:5)\n 22. He saves. (Matthew 18:11; John 10:28).\n 23. He judges. (John 5:22)\n 24. Paul, Peter, Jude, James, and John called Him God. (Galatians 2:20; 1 Peter\n 3:22; Jude 25; James 2:1; I John 5:20; Revelation 1:18; 19:16)\n 25. He is God's Son, who was sent to bring us eternal life. (John 3:16)\n 26. He arose from death in the flesh (John 20:26-28; Luke 24:39-43; I John 4:2-3). \n 27. One with the Father (John 10:30).\n \n Did Jesus Claim to be God?\n \n Among the religious leaders who have attained a large following throughout history, Jesus Christ is unique in the fact that He alone claimed to be God in human flesh. A common misconception is that some or many of the leaders of the world's religions made similar claims, but this is simply not the case. \n \n Buddha did not claim to be God; Moses never said that he was Yahweh; Mohammed did not identify himself to be Ahura Mazda. Yet Jesus, the carpenter from Nazareth, said that he who has seen him (Jesus) has seen the Father (John 14:9). \n \n The claims of Christ are many and varied. He said that He existed before Abraham (John 8:58), and that He was equal with the Father (John 14:9). \n \n The New Testament equated Jesus as the creator of the universe (John 1:3), and that He is the one who holds everything together (Colossians 1:17). The apostle Paul says that God was manifest in the flesh (1 Timothy 3:16, KJV), and John the evangelist says that \"the Word was God\" (John 1:1). The united testimony of Jesus and the writers of the New Testament is that He was more than mere man; He was God. \n \n Not only did His friends notice that He claimed to be God, but so did His enemies as well. There may be some doubt today among the skeptics who refuse to examine the evidence, but there was no doubt on the part of the Jewish authorities. \n \n When Jesus asked them why they wanted to stone Him, they replied, \"For a good work we do not stone You, but for blasphemy; and because You, being a man, make Yourself out to be God\" (John 10:33, NASB). \n \n This fact separates Jesus from the other religious figures. In the major religions of the world, the teachings -- not the teacher -- are all-important. \n \n Confucianism is a set of teachings; Confucius is not important. Islam is the revelation of Allah, with Mohammed being the prophet, and Buddhism emphasizes the principles of the Buddha and not Buddha himself. This is especially true of Hinduism, where there is no historic founder. \n However, at the center of Christianity is the person of Jesus Christ. Jesus did not just claim to be teaching mankind the truth; He claimed that He was the truth (John 14:6). \n \n What Jesus taught is not the important aspect of Christianity, but what is important is who Jesus was. Was He the Son of God? Is He the only way a person can reach God? This was the claim He made for Himself.\n \n Suppose this very night the President of the United States appeared on all the major networks and proclaimed that \"I am God Almighty. I have the power to forgive sin. I have the authority to raise my life back from the dead.\" \n \n He would be quickly and quietly shut off the air, led away, and replaced by the Vice-President. Anybody who would dare make such claims would have to be either out of his mind or a liar, unless he was God.\n \n This is exactly the case with Jesus. He clearly claimed all these things and more. If He is God, as He claimed, we must believe in Him, and if He is not, then we should have nothing to do with Him. Jesus is either Lord of all or not Lord at all. \n \n Yes, Jesus claimed to be God. Why should anyone believe it? After all, merely claiming to be something does not make it true. Where's the evidence that Jesus is God? \n \n The Bible gives various reasons, including miracles and fulfilled prophecy, that are intended to convince us that Jesus is the one whom He said He was (John 20:30, 31). The main reason, or the sign which Jesus Himself said would demonstrate that He was the Son of God, was His resurrection from the dead. \n \n When asked for a sign from the religious leaders, Jesus replied, \"For as Jonah was three days and three nights in the belly of the whale, so will the Son of man be three days and three nights in the heart of the earth\" (Matthew 12:40, RSV).\n \n In another place He said, when asked for a sign, \"Destroy this temple, and in three days I will raise it up . . . but he spoke of the temple of his body\" (John 2:19, 21). The ability to raise His life back from the dead was the sign that separates Him not only from all other religious leaders, but also from anyone else who has ever lived. \n \n Anyone wishing to refute the case for Christianity must explain away the story of the resurrection. Therefore, according to the Bible, Jesus proves to be the Son of God by coming back from the dead (Romans 1:4). The evidence is overwhelming that Jesus did rise from the grave, and it is this fact that proves Jesus to be God. \n \n This is an excerpt from the book, \"Answers to Tough Questions,\" by Josh McDowell and Don Stewart.", 
   {}, 
   364812, 
   null, 
   1249953300.0
  ], 
  [
   364954, 
   null, 
   "Easyrider", 
   "More Claims to Deity by Jesus: \n \n Looking at the Bible, we find that Jesus referred to Himself as the Son of Man no less than 82 times. This title comes from Daniel 7, which speaks of the coming Messiah who will rule over the nations of the earth for all time. In that passage, we read that the Son of Man \"was given authority, glory and even sovereign power\" - things which God alone can hold and exercise - the One who said, \"I will not give my glory to another\" (Isa. 42:8; 48:11). Furthermore, we find that \"all peoples, and all nations and men of every language will worship\" the Son of Man, which would only make sense if the Son of Man is none other than God Himself. God sternly forbids the worship of anyone or anything other than Himself. We can thereby conclude that Jesus, in calling Himself the Son of Man, was indeed claiming to be God.\n \n The Jews tried to stone Him because in \"calling God His own Father, Jesus was making Himself equal with God\" (John 5:18). To this charge, Jesus merely replied, \"All are to honor the Son just as they honor the Father.\" In other words, Jesus claimed the honor due Him is equivalent to the honor due God. Such a statement is sheer blasphemy unless Jesus was, in fact, God.\n \n When Jesus paralleled His own name with that of God's, or when He applied to Himself the names and images associated with God, we can reasonably conclude that Jesus was, in fact, claiming to be God.\n \n For example, in the Great Commission (Matt. 28:18-20), Jesus placed His name as the Son on equal footing with the Father, who is God (v. 19) and with the Holy Spirit (who also is God - Acts 5). This passage also reveals certain attributes of the Son like omnipotence (v. 18; cf. Jer. 32:17, 27), and omnipresence, which can apply only to someone who is God. (v. 20; cf. Matt. 18:20; Ps. 139:7-12; Jer. 23:24). Furthermore, in claiming to be the only one who knows God (Matt. 11:27), Jesus implicitly admitted to being omniscient since the Father, of course, is Himself omniscient.\n \n Jesus also took for Himself several Old Testament metaphors reserved solely for God. He sometimes applied them directly to Himself, as in the case of the title, the Good Shepherd (John 10:11, 14; cf. Gen. 49:24; Ps. 23). Now in other times, Jesus took an indirect approach, referring to Himself in the parables as the Sower, the Bridegroom, the Vineyard Owner, and, in fact, the King - each of which can be traced back to Old Testament references to God.\n \n But of these titles, none angered the religious officials of His day as when Jesus said of Himself, \"I AM,\" thus asserting to be eternal in words echoing those of YHWH (John 8:58; cf. Ex. 3:14). Jesus' claim to be God in this instance was so clear and unmistakable that those who considered His assertion false, in fact blasphemous, tried to stone Him to death immediately (John 8:59; cf. Lev. 24:13-16). \n \n In another instance where He healed a paralytic (Mark 2:1-12; cf. Matt. 9:1-8); Luke 5:17-26), Jesus went on to forgive the man's sins as well - to which the \"teachers of the law\" rightly asked, \"Who can forgive sins but God alone?\" Jesus answered by reemphasizing His authority to forgive sins, and then proved it by healing the man. Jesus again claimed for Himself a prerogative reserved solely for God. Only if Jesus is God could He have actually forgiven sins the way He did. \n \n Jesus Claim To Be God\n \n Not note Matthew 23:34: \"Wherefore, behold, I send unto you prophets, and wise men, and scribes...\" In Jewish belief, it is God that is responsible for sending prophets. In saying that He will send prophets, Jesus is equating Himself with God - once again, assuming a role reserved for God alone. \n \n In Matthew 12:6, Jesus says to the Pharisees, \"I say to you, that something greater than the Temple is here.\" One would have to be on a divine footing to make that claim. Also look at verse 8. Referring to Himself, Jesus asserts, \"The Son of Man is Lord of the Sabbath.\" How can anyone be Lord of the Sabbath except God who instituted it? This is a direct claim to deity.", 
   {
    "unicode_changes_made": true
   }, 
   364953, 
   null, 
   1249953360.0
  ], 
  [
   364955, 
   null, 
   "Easyrider", 
   "Jesus Must Be God \n \n John 1:23 quotes Isaiah 40:3 as saying John the Baptist was to prepare the way of the LORD (Jehovah). John prepared the way before Jesus so Jesus must be LORD (Jehovah). \n \n In Isaiah 44:8 God is the only Rock. Psalm 18:31 says, \"Who is the Rock except our God\"? I Corinthians 10:4, identifies Jesus as the Rock. Jesus must also then be God the Rock. \n \n Isaiah 44:24 says that God (Jehovah) is the one who has made all things. Colossians 1:16, speaking of Christ, says that \"all things were created by Him and for him\". Jesus must therefore be Jehovah God. \n \n In Jeremiah 10:10 it says \"the LORD (Jehovah) is the true God\". I John 5:20 states that Jesus is the \"true God\". Jesus must be the true God.\n \n Isaiah 43:10,11 says that \"I, even I, am the LORD; and there is no savior besides Me. Jesus is the Savior (Matthew 1:21, Titus 2:13; 2 Peter 1:1, etc., etc.). Jesus must be God the Savior.\n \n Jehovah knows all things (Psalm 147:5). Jesus knows \"all things.\" (John 16:30). Jesus must be Jehovah.\n \n Jehovah alone is the only one who knows the hearts of all men. (1 Kings 8:39; Jeremiah 17:9-10). Jesus knows the hearts of all men. (John 2:24-25; Rev. 2:18, 23). Jesus must be God.\n \n Jehovah is our sanctifier. (Exodus 31:13). Jesus sanctifies us (Hebrews 10:10). Only God is the sanctifier of men. Jesus must be God.\n \n Jehovah is our peace (Judges 6:23). Jesus is our peace (Ephesians 2:14). Jesus must be Jehovah.\n \n Jehovah is our righteousness (Jeremiah 23:6). Jesus is our righteousness. (Romans 3:21-22; 1 Corinthians 1:30). Jesus must be Jehovah.\n \n Jehovah is the giver of life who will not allow His people to be delivered / snatched out of His hand (Deuteronomy 32:39). Jesus is the giver of life who will not allow His people to be \"snatched\" out of His hand. (John 10:28). Jesus must be Jehovah.\n \n Jehovah's voice is \"like the roar of rushing waters\" (Ezekiel 43:2). Jesus' \"voice was like the sound of rushing waters\" (Revelation 1:15). Jesus must be Jehovah.\n \n Jehovah is present everywhere.(Proverbs 15:3; Jeremiah 23:24; I Kings 8:27); Jesus is omnipresent (John 1:48; Matthew 18:20; 28:20). Jesus must be Jehovah.\n \n Jehovah's nature does not change (Malachi 3:6). Jesus' nature does not change. (Hebrews 13:8). \n \n Jehovah is the only God we are to \"serve\"(2 Kings 17:35); Jesus (identified as the Creator in Colossians 1:16-17) is to be served (Colossians 3:24). Jesus must be Jehovah. \n \n Jehovah the Lord is to be set apart as holy (Isaiah 8:12b-13). Jesus, as Lord, is to be set apart as holy (1 Peter 3:14b-15a).\n \n Jehovah's glory is not to be given to another (Isaiah 42:8). Jesus shares Jehovah's glory (John 17:5). Jesus must be Jehovah.\n \n God's name is Jehovah (or Yahweh-YHWH - Isaiah 42:8). Jesus has Jehovah's name (John 17:11; John 16:14-15). Jesus must be Jehovah.\n \n Jehovah is the \"mighty God\" (Jeremiah 32:17-18; Isaiah 10:20-21). Jesus is the \"mighty God\" \n (Isaiah 9:6) who is \"Almighty\" (Revelation 1:7-8).\n \n Jehovah is \"the first and the last\" (Isaiah 44:6; 48:12). Jesus is the \"first and the last\" (Revelation 1:17-18; 22:12-13, 20). Jesus must be Jehovah.\n \n Jehovah is the \"Alpha and the Omega\" (Revelation 1:8; Revelation 21:6-7). Jesus is the \"Alpha and the Omega\" (Revelation 22:12-13, 20). Jesus must be Jehovah.\n \n Jehovah's title is \"the Holy One\" (Isaiah 47:4). Jesus is \"the Holy One\" (Acts 3:14; John 6:69). Jesus must be Jehovah, the Holy One.\n \n Jehovah is the \"stumbling stone\" of Israel (Isaiah 8:13-15). Jesus is the \"stumbling stone\" of Israel (1 Peter 2:6-8). Jesus must be Jehovah.\n \n Jehovah is the great Judge who gives life to whom he wishes and who renders to each man \"according\" to his \"deeds\" (Psalm 98:9; Deuteronomy 32:39; Jeremiah 17:9-10). Jesus is the only judge who gives life to whom he wishes and renders to each man \"according\" to his \"deeds\" (John 5:21-22; Revelation 2:18, 23). Jesus must be Jehovah. \n \n Jehovah is the great \"shepherd\" who leads his people to \"the spring of the water of life\" (Psalm 23:1-2; Revelation 21:6-7). Jesus as the \"shepherd\" of His people, leads them \"to springs of the water of life\" (John 10:11-18; Revelation 7:17). THERE IS ONLY ONE SHEPHERD --John 10:16.\n \n Jehovah is \"Lord of Lords\" (Deuteronomy 10:17). Jesus is \"Lord of Lords.\" (Revelation 17:14; 19:16). The Father is Lord of all (Matthew 11:25; Acts 17:24). Jesus is \"Lord of all.\" (Acts 10:36). THERE IS ONLY ONE LORD (Jude 4) .\n \n Jehovah created the universe (Psalm 102:25-27). Jesus created the universe (John 1:3; Colossians 1:15-19; Hebrews 1:10-12). THERE IS ONLY ONE CREATOR. (Isaiah 44:24). Jesus must be Jehovah. \n \n Christian Ministry to Mormons and Jehovah's Witnesses - witforjesus.org, etc.", 
   {
    "unicode_changes_made": true
   }, 
   364954, 
   null, 
   1249953480.0
  ], 
  [
   364974, 
   null, 
   "unkerpaulie", 
   "What you atheists fail to appreciate or even consider is that some truths are eternal and need no updating. Nor do they change over time according to the whims of Man. Gods Spiritual Truths are absolute and fall into this category.\n\n And which truths are these \"some truths\" that are eternal and unchanging? Because in science they are called laws. As far as what are these God's spiritual truths, how do identify them from the clutter of other untruths that are found in the bible? \n \n Believers treat EVERYTHING in the bible as if they are eternal and irrevocable facts. Science does not.", 
   {}, 
   364542, 
   null, 
   1249961700.0
  ], 
  [
   364975, 
   null, 
   "unkerpaulie", 
   "Of course not. Just because something CONCERNS God doesn&#8217;t mean it&#8217;s OF God. It doesn&#8217;t matter if it&#8217;s you telling me something about God, or Ravi Zacharias telling me something about God, it&#8217;s a human that&#8217;s telling me, so it&#8217;s subject to a test. \n \n IMO, what is not subject to a test is the word of God. The text was inspired by God like nothing else ever written, and its arrangment of 66 books has stood the test of time. \n \n\n Dude, there is no difference between a guy who lived 5000 years ago writing something about God and telling you it was inspired by God, and me, telling you something about God, and claiming it was inspired by God. Every word in the bible was conceived by man, written by man, copied by man, edited by man, proofread by man, translated by man, canonized by man and published and distributed by man. And just as any man in those days could say he is being inspired by God, and write a bunch of stuff about God and have it accepted as absolute truth, why couldn't somebody today make the same claim and get the same reaction? I think it speaks volumes about your perception of God. Has God stopped inspiring man? And if he doesn't do it now, why would anybody believe he did it 5000 years ago, when there was 100 times more mythology and ignorance than today?\n \n \nYou&#8217;ve made yourself clear, and that&#8217;s where we have to leave it. You&#8217;ve described your upbringing in Christianity &#8211; only you know exactly how that did/didn&#8217;t effect your beliefs today. But God loves you whether you like it or not &#8211; you&#8217;re 33 and probably have a lot of years left. It may not happen soon, but I think someday God is going to get your attention again. Don&#8217;t forget that someone told you that. (it doesn&#8217;t matter who) emoticon_xangel\n\n Thank you for you kind words. I know you mean well", 
   {}, 
   364650, 
   null, 
   1249963080.0
  ], 
  [
   367069, 
   null, 
   "Workman", 
   "Every word in the bible was conceived by man, written by man, copied by man, edited by man, proofread by man, translated by man, canonized by man and published and distributed by man.\n\n \n Correct. But one of the biggest things IMO in the NT is to have faith. Now I take it as not just having faith that God inspired the writers to write the text, but also that he inspired the people to translate it, canonize it, etc. etc. And yes... for me to it's a bit hard to believe... but the main point for me is the faith part. Faith is as has always been one of the hardest things for people to do... some are better at it than others. And topics of faith are not just within the bounds of the Bible and God.\n \n I have faith that my daughter will grow up to be smart, good caring person. Now, if she doesn't turn out that way, is my faith in her in vain? \n \n If it doesn't mean anything why?", 
   {
    "post_info": {
     "post_title": "not sure what to title this reply... so I'll use - HMMMM"
    }
   }, 
   364975, 
   null, 
   1251410100.0
  ], 
  [
   367116, 
   null, 
   "unkerpaulie", 
   "Correct. But one of the biggest things IMO in the NT is to have faith. Now I take it as not just having faith that God inspired the writers to write the text, but also that he inspired the people to translate it, canonize it, etc. etc. And yes... for me to it's a bit hard to believe... but the main point for me is the faith part. Faith is as has always been one of the hardest things for people to do... some are better at it than others. And topics of faith are not just within the bounds of the Bible and God.\n \n I have faith that my daughter will grow up to be smart, good caring person. Now, if she doesn't turn out that way, is my faith in her in vain? \n \n If it doesn't mean anything why?\n\n Great points. Faith is important, whether it be religious based or not. There are many things we must depend on faith for. By definition, faith is the evidence for things that we hope for, and the example of your daughter is an excellent one. \n \n Where we differ is that I don't treat my faith-based beliefs as fact. As much as you may hope, believe and trust that your daughter will all those things, you're not going to make it a statement of absolute fact that she will be. I actually feel that the stronger and more convinced you are of a belief, the more likely it is to have it actually come true. But you know the difference between belief and fact. Having faith in something that isn't true cannot make it true. You cannot believe you bicycle is a bmw enough to make it so. And, I feel that believing in a blissful afterlife cannot make it a reality if it simply doesn't exist.", 
   {}, 
   367069, 
   null, 
   1251423000.0
  ], 
  [
   367238, 
   null, 
   "Workman", 
   "Great points. Faith is important, whether it be religious based or not. There are many things we must depend on faith for. By definition, faith is the evidence for things that we hope for, and the example of your daughter is an excellent one. \n \n Where we differ is that I don't treat my faith-based beliefs as fact. As much as you may hope, believe and trust that your daughter will all those things, you're not going to make it a statement of absolute fact that she will be. I actually feel that the stronger and more convinced you are of a belief, the more likely it is to have it actually come true. But you know the difference between belief and fact. Having faith in something that isn't true cannot make it true. You cannot believe you bicycle is a bmw enough to make it so. And, I feel that believing in a blissful afterlife cannot make it a reality if it simply doesn't exist.\n\n \n Ok I hear you. My view and maybe only my view is that my faith in something that I'm not really sure deep down really happen is me taking a huge leap over the cliff hoping that someone will catch me. Not based on any facts really. Just hoping that someone will be there. Just like believing in the bible, or the \"daughter\" example (which by the way I think most people who have kids want the best for there kids regardless, I was just using that as an example.... =)).\n \n Even if the facts are true or not... to me, the bible really makes more sense in the over all point of the bible. All of the OT/NT in my layman's view are good examples of how to live, a good reason as to why things are the way they are.\n \n For me, it's a better view of there being no God. I mean really, for me, I really can't believe that I am born.. for some unknown reason... I have this thing in my body that allows to me reason, think, choose, know the difference from blue and green (heck to even know what those are). and to have emotion, and at the end of it all... I die... thats it, no more... nothing else... 80+ years and nothing after? That to me just doesn't sound right.\n \n My faith in the unknown and that unknown being just that, will never have fact. The bible being the closest thing for me that makes even the most sense about how we became - is by far the best example we humans have been able to come up with so far as to who/what/where and why.\n \n Cheers.", 
   {
    "post_info": {
     "post_title": "faith or not to faith =)"
    }
   }, 
   367116, 
   null, 
   1251485700.0
  ], 
  [
   367240, 
   null, 
   "Workman", 
   "Ok I hear you. My view and maybe only my view is that my faith in something that I'm not really sure deep down really happen is me taking a huge leap over the cliff hoping that someone will catch me. Not based on any facts really. Just hoping that someone will be there. Just like believing in the bible, or the \"daughter\" example (which by the way I think most people who have kids want the best for there kids regardless, I was just using that as an example.... =)).\n \n Even if the facts are true or not... to me, the bible really makes more sense in the over all point of the bible. All of the OT/NT in my layman's view are good examples of how to live, a good reason as to why things are the way they are.\n \n For me, it's a better view of there being no God. I mean really, for me, I really can't believe that I am born.. for some unknown reason... I have this thing in my body that allows to me reason, think, choose, know the difference from blue and green (heck to even know what those are). and to have emotion, and at the end of it all... I die... thats it, no more... nothing else... 80+ years and nothing after? That to me just doesn't sound right.\n \n My faith in the unknown and that unknown being just that, will never have fact. The bible being the closest thing for me that makes even the most sense about how we became - is by far the best example we humans have been able to come up with so far as to who/what/where and why.\n \n Cheers.\n\n \n Wanted to point out the last few lines.\n \n when I said humans, I meant that being able to keep a written track record that far back is crazy to me... and people being able to translate 1 language from another 2k years ago is crazy to me. But, from all the scholars on both sides saying how and when that all happened is still for me a better view on the alternatives... which go back to -\"we don't know why we are here, or something outside our world blew up and we happened to be over millions of years..\" just doesn't cut it. Less proof there anyway...\n \n At the end of the day, I do wish that more people believed, or didn't loose there faith that they once had. It's sad, but, that's life as we know it. No one is going to know the real truth until they see it when it happens. And having faith in what the bible teaches and the outcome for the believer being a good one, I'd rather have the good outcome of that view point, than knowing for the rest of my life that I was here for no point really. No one is going to remember when I die, or the things that I did. To me that's pointlessness... what's the point of being? People have been arguing that for years, and yet no one has come up with something that everyone can agree with... \n \n sorry, I'm just rambling on...", 
   {
    "post_info": {
     "post_title": "my reasoning"
    }
   }, 
   367238, 
   null, 
   1251486840.0
  ], 
  [
   367292, 
   null, 
   "unkerpaulie", 
   "At the end of the day, I do wish that more people believed, or didn't loose there faith that they once had. It's sad, but, that's life as we know it. No one is going to know the real truth until they see it when it happens. And having faith in what the bible teaches and the outcome for the believer being a good one, I'd rather have the good outcome of that view point, than knowing for the rest of my life that I was here for no point really. No one is going to remember when I die, or the things that I did. To me that's pointlessness... what's the point of being? People have been arguing that for years, and yet no one has come up with something that everyone can agree with... \n \n sorry, I'm just rambling on...\n\n You're right about one thing, which is probably the most important thing of all. What really matters is one's self esteem, and what that esteem inspires one to achieve in life. For me, I feel a sense of freedom from that my decisions aren't going to cause some kind of eternal judgement to hang over my head, and I don't have to feel guilt about things that the bible considers sin. And yet I don't lose the sense of purpose and significance that you feel you would lose without God. In fact, as a christian I used to spend hours wondering what would be my divine calling, and waiting to hear from God, or for some osbcure sign to confirm what I should do with the rest of my life. I never found out. Now I know I can choose to take whatever path I desire. Failure in one venture doesn't mean its not God's will or success doesn't depend on God's favor. I prefer to decide my own destiny and act on my own intuition. \n \n However, I don't judge you or think of you in a condescending way for your decision to stay faithful. I understand very well the inspirational aspect of believing in God. And whether the promises of the bible are true or not, the value of the hope itself is enough to be worth the risk of being wrong. For this reason I encourage you to stay strong and faithful, if this is what you want. Because I truly feel that may well be what's best for you.", 
   {}, 
   367240, 
   null, 
   1251505080.0
  ], 
  [
   367298, 
   null, 
   "Workman", 
   "You're right about one thing, which is probably the most important thing of all. What really matters is one's self esteem, and what that esteem inspires one to achieve in life. For me, I feel a sense of freedom from that my decisions aren't going to cause some kind of eternal judgement to hang over my head, and I don't have to feel guilt about things that the bible considers sin. And yet I don't lose the sense of purpose and significance that you feel you would lose without God. In fact, as a christian I used to spend hours wondering what would be my divine calling, and waiting to hear from God, or for some osbcure sign to confirm what I should do with the rest of my life. I never found out. Now I know I can choose to take whatever path I desire. Failure in one venture doesn't mean its not God's will or success doesn't depend on God's favor. I prefer to decide my own destiny and act on my own intuition. \n \n However, I don't judge you or think of you in a condescending way for your decision to stay faithful. I understand very well the inspirational aspect of believing in God. And whether the promises of the bible are true or not, the value of the hope itself is enough to be worth the risk of being wrong. For this reason I encourage you to stay strong and faithful, if this is what you want. Because I truly feel that may well be what's best for you.\n\n \n \n Nice unkerpaulie thank you...\n \n btw, I'm sure you've notice I don't debate =)... I like listening and reading debates though... it's fun.\n \n thanks again", 
   {}, 
   367292, 
   null, 
   1251507540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The basis for religion?", 
  "url": "http://www.4forums.com/political/religion-debates/13021-basis-religion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13021, 
  "discussion_files": [
   [
    "3852.html", 
    "http://www.4forums.com/political/religion-debates/13021-basis-religion-print.html"
   ], 
   [
    "3853.html", 
    "http://www.4forums.com/political/religion-debates/13021-basis-religion-5-print.html"
   ], 
   [
    "3854.html", 
    "http://www.4forums.com/political/religion-debates/13021-basis-religion-4-print.html"
   ], 
   [
    "3855.html", 
    "http://www.4forums.com/political/religion-debates/13021-basis-religion-3-print.html"
   ], 
   [
    "3856.html", 
    "http://www.4forums.com/political/religion-debates/13021-basis-religion-2-print.html"
   ]
  ], 
  "identifier": 13021
 }
]