[
 [
  [
   362160, 
   null, 
   "foundit66", 
   "Top Bush administration officials in 2002 debated testing the Constitution by sending American troops into the suburbs of Buffalo to arrest a group of men suspected of plotting with Al Qaeda, according to former administration officials. \n \n Some of the advisers to President George W. Bush, including Vice President Dick Cheney, argued that a president had the power to use the military on domestic soil to sweep up the terrorism suspects, who came to be known as the Lackawanna Six, and declare them enemy combatants.\n \n Mr. Bush ultimately decided against the proposal to use military force.\n \n A decision to dispatch troops into the streets to make arrests has few precedents in American history, as both the Constitution and subsequent laws restrict the military from being used to conduct domestic raids and seize property.\n \n The Fourth Amendment bans \"unreasonable\" searches and seizures without probable cause. And the Posse Comitatus Act of 1878 generally prohibits the military from acting in a law enforcement capacity.\n \n In the discussions, Mr. Cheney and others cited an Oct. 23, 2001, memorandum from the Justice Department that, using a broad interpretation of presidential authority, argued that the domestic use of the military against Al Qaeda would be legal because it served a national security, rather than a law enforcement, purpose.\n \n \"The president has ample constitutional and statutory authority to deploy the military against international or foreign terrorists operating within the United States,\" the memorandum said.\n \n The memorandum - written by the lawyers John C. Yoo and Robert J. Delahunty - was directed to Alberto R. Gonzales, then the White House counsel, who had asked the department about a president's authority to use the military to combat terrorist activities in the United States. \n\n http://www.nytimes.com/2009/07/25/us/25detain.html?_r=2&amp;hp\n \n The very idea that Bush's closest advisers were telling Bush that he should use the military to arrest people in the U.S.\n :xbanghead", 
   {
    "post_info": {
     "post_title": "Bush Weighed Using Military in Arrests"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1248543120.0
  ], 
  [
   362167, 
   null, 
   "simone", 
   "Whew! At least that time he didn't listen to Cheney.", 
   {}, 
   362160, 
   null, 
   1248550020.0
  ], 
  [
   362189, 
   null, 
   "CUNxTime", 
   "So you're giving props to Bush? Cool...", 
   {}, 
   362167, 
   null, 
   1248572880.0
  ], 
  [
   362289, 
   null, 
   "simone", 
   "Bush has done at least a couple of decent things in his life:\n \n 1. Turning a deaf ear to Cheney and not violating Posse Comitatus.\n \n 2. Keeping his damned mouth shut (at least most of the time) after Obama assumed the presidency.", 
   {}, 
   362189, 
   null, 
   1248632400.0
  ], 
  [
   362290, 
   null, 
   "simone", 
   "Oh yeah.\n \n I'm probably going to have to concede that Bush can pitch a ball better than Obama.", 
   {}, 
   362160, 
   null, 
   1248632520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bush Weighed Using Military in Arrests", 
  "url": "http://www.4forums.com/political/politics-debates/13024-bush-weighed-using-military-arrests.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13024, 
  "discussion_files": [
   [
    "23314.html", 
    "http://www.4forums.com/political/politics-debates/13024-bush-weighed-using-military-arrests-print.html"
   ]
  ], 
  "identifier": 13024
 }
]