[
 [
  [
   362820, 
   null, 
   "MrWriteLA", 
   "And the list, it would appear, goes ever on:\n Paul Stanley, Tennessee State Senator, Quits After Affair With 22-Year-Old Intern\nPaul Stanley, Tennessee State Senator, Quits After Affair With 22-Year-Old Intern\n \n NASHVILLE, Tenn. - A Tennessee lawmaker resigned from the state Senate on Tuesday after his extramarital affair with a 22-year-old intern was revealed by an investigation into an extortion case.\n \n \"Due to recent events, I have decided to focus my full attention on my family and resign my Senate seat effective August 10,\" Republican Sen. Paul Stanley wrote in his resignation letter.\n \n Court records show that Stanley, 47, told agents investigating a blackmail case that he had a sexual relationship with intern McKensie Morrison. Her boyfriend, Joel Watts, is charged with trying to extort $10,000 from Stanley in April. Investigators say Watts demanded the money in exchange for not releasing to the media explicit photos of Morrison that Stanley had taken in what appears to be Stanley's apartment.\n \n The senator, a married father of two who represents suburban Memphis, had signaled he would remain in the legislature, but he said Tuesday that he decided to step down about an hour before submitting his resignation letter. Stanley, who was elected to the Senate in 2006 after serving six years in the state House, had resigned last week as chairman of the powerful Senate Commerce Committee.\n \n A special election will be held to fill the seat in the Republican-controlled Senate.\n \n Stanley's legislative proposals were largely focused on pro-business issues, but he also sponsored failed measures to ban gay couples from adopting children. He also spoke out against funding for Planned Parenthood because he said unmarried people should not have sex. \n \n \"Whatever I stood for and advocated, I still believe to be true,\" he said during an interview Tuesday with Memphis radio station WREC-AM. \"And just because I fell far short of what God's standard was for me and my wife, doesn't mean that that standard is reduced in the least bit.\"\n \n Morrison's phone numbers are redacted from her legislative internship application, and efforts to reach her were unsuccessful Tuesday. Her father said he didn't want to talk about the situation.\n \n \"It's a family matter, and I'm going to approach it that way,\" Will Morrison said.\n \n According to court records, Morrison is married to a man who is serving a seven-year prison sentence in Florida but that he has filed for divorce.\n \n Watts said in an interview with a Nashville TV station last week that he blamed Stanley for taking advantage of Morrison\nGee, and in Tennessee, too... emoticon_xangel", 
   {
    "post_info": {
     "post_title": "Another &quot;moral&quot; anti-gay Republican hypocrite exposed"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1248851940.0
  ], 
  [
   362856, 
   null, 
   "chester", 
   "Scopes's monkey is lloking down and grinning.:)", 
   {}, 
   362820, 
   null, 
   1248882000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another \"moral\" anti-gay Republican hypocrite exposed", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13040-another-moral-anti-gay-republican-hypocrite-exposed.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13040, 
  "discussion_files": [
   [
    "26091.html", 
    "http://www.4forums.com/political/gay-rights-debates/13040-another-moral-anti-gay-republican-hypocrite-exposed-print.html"
   ]
  ], 
  "identifier": 13040
 }
]