[
 [
  [
   363338, 
   null, 
   "jyoshu", 
   "From the thread http://www.4forums.com/political/religion-debates/13030-there-such-thing-morality-without-religion.html\n \n \nValue judgements change with changing culture, logic does not. \n\n \n How exactly do you arrive at the idea that logic is enough to make moral judgments? (That's the term you're using now, and if I'm misunderstanding you, please say so.) Logic can't tell you whether or not to apply ethical consideration to scientific work, or to what extent to do so. It can't tell the nuances of morality that determines when the needs of the few may be important than the needs of the many (to use a 'trek-ism'). Logic is objective, and you're talking about issues that are often subjective. I don't see how you can argue logic is sufficient. Call it reason, call it logic--whichever you think of it as--it needs morality to temper it. I simply don't want my morality dictated only by cold logic. you may feel differently for yourself, and that's your choice of course. I don't want to live that way. My points about this still stand even if you refer to it as \"logic.\" If everything were CLEARLY logical, there wouldn't be any controversies in our culture. These forums wouldn't exist because it would all be cut and dry and there would be no disagreement. Standards of logic are easy with things like mathematics; not so standardized when it comes to sociological issues. (Edit: reading down through your post further, it seems that you don't advocate logic-only after all, and so I think we may agree in some ways on this. If I'm understanding you correctly.)\n \n \nI gave my examples of what I thought was illogical about the Holocaust - examples which I repeat here in the hopes that you will address them this time:\n Where the Nazis and 6 million murdered Jews were concerned, they blamed Jews for all of the problems .... \n Please explain how those are not examples of lack of logic?\n\n \n Where I think you're misguided here is in assigning logic or lack thereof as a causality. If they had only applied benevolent morality to their logic, it wouldn't have happened, after all. Again, what they did was no doubt completely 'logical' in their own thinking. \n \n \nEven many of the most evil people in the world will think twice about their approach to a situation if they themselves are put in that situation. That is a type of reasoning that counters them - the reasoning of reciprocity of morality.\n\n \n IMO, that's not \"logic\" though. What you just described isn't 2+2=4, it's simply a way of conducting morality. It's no more than saying one should think of a situation with himself in the place, so if anything, it's an appeal to self-preservation emotion, in a sense. Not really logic.\n \n \nI think morality needs to be based on both, where it is mainly the difference in value judgements that make morality not fixed but relative to a culture.\n\n \n Alright. And I think if you review my points, that's largely what I'm saying too. After all, I've said quite clearly that logic needs to be tempered with morality. I think we're saying much the same thing here, just in different ways.\n \n \nReason and logic are not the same thing. Where morality is concerned, I would say that reason contains (or should contain) both logic and value judgement.\n\n \n Again, I think religious people do indeed use reason, and in that sense I have to agree, based on my observation and experience. \n \n \nIt is hard to exclude value judgment completely from moral reasoning\n\n \n I'd go farther than that and say it shouldn't be excluded. Again, logic needs to be tempered with morality. One can't feel cold hard logic toward their fellow human beings. But one can feel compassion, for instance.\n \n \nI have already said that there are many religious moral laws in which the reasoning is illucidated. So, any claim on your part that I do not aknowledge any reasoning in religion is disengenuous. \n\n \n I'm not making that point in rebuttal towards you. I'm simply making the point in general because I think it is an extremely important one. IMO religion is somewhat looked down upon in this forum, wrongly so, and so I think it needs to be emphasized that religious people generally use reason as well. It's not an either/or scenario.\n \n \nHowever, as I have stated, there are also examples of religious moral laws (that probably draw more attention since they are usually the most contraversial onces) where the reasoning behind a moral law is not illucidated but expected to be accepted on faith.\n\n \n I think your parenthetical statement hit the nail on the head. A religious nutcase gets far more PRESS than the many, many more who are reasonable people. Then we have some who think they champion reason who believe religion is bad in ANY case. Or that it's bad to have religion inform morality. That view in and of itself is unreasonable.\n \n \nFaith does not inherently contain reason. Faith, instead, expects one to accept something as true without question. \n\n \n I think there needs to be a distinction made here between the term \"faith\" and religious belief. Of course 'faith' is about accepting something--a leap of faith, after all. I've studied much of the evidence pro and con, for instance, in terms of the early church and New Testament writings. I don't NEED faith to believe they are legitimate; the evidence suggests they are, and there is a lack of evidence to disprove them. That's reason, not just faith. That's what I mean by saying you don't own reason. I may have come to different CONCLUSIONS than you have, but that doesn't mean I'm not thinking through it. \n \n \nReason is the very asking and answering of those questions, and further asking questions based on those answers, ad infinitum.\n\n \n Do you not think many religious people do this? I certainly do, as do most Christians I know. \n \n \nWhen something, such as gay rights, is accepted on faith without a full open-minded discussion being allowed, then I would say that very little or simply very faulty reasoning is being used. Again, when one uses reason, it means that one doesn't automatically assume truth but, instead, one tries to get at it through nested questions, answers and debate. \n\n \n So, if a debate takes place, and continues to take place, but someone comes to different CONCLUSIONS than you, you're ok with that? You're satisfied that reason has been utilized? Again, I think anyone who assumes religious people aren't wrestling with this issue in society has no idea what's really going on in religion. Trust me, there's PLENTY of debate and questioning going on about that subject. \n \n I'm sorry, but to be perfectly honest, I find the call from skeptics for more 'debate' and 'questioning' to be somewhat humorous, if not disingenuous. If you're satisfied with someone questioning and debating, but then coming out of it with conclusions DIFFERENT than yours, then very well. But most of the time, I find on such issues that calling for people to \"question\" and \"debate\" to more be code words for accepting the views of the one calling for questioning. IMO it's the height of arrogance for anyone to associate one side's views and conclusions with a lack of questioning. With all due respect, my religious views HAVE come about through questioning and debate, thank you, even if they are not the same views you have. \n \n \nVery well then, how about if we extend it to the last fifty years - which covers most of our lifetimes. That is the world we live in - the world that we have experienced in our lifetimes.\n\n \n Alright then ... the excesses of the sexual revolution, for example. It's not like STDs and the effects of drugs weren't well-known, and I think you'd be hard pressed to find religious motivation behind it. Logically, why NOT sleep around? It's fun and harmless when taking precautions. But wait .... it seemed to cause a lot of problems nonetheless. Apparently logic wasn't enough to ensure they WOULD take precautions.", 
   {
    "post_info": {
     "post_title": "Reason, religion, logic, and morality"
    }
   }, 
   null, 
   null, 
   1249165320.0
  ], 
  [
   363462, 
   null, 
   "unkerpaulie", 
   "\n IMO, that's not \"logic\" though. What you just described isn't 2+2=4, it's simply a way of conducting morality. It's no more than saying one should think of a situation with himself in the place, so if anything, it's an appeal to self-preservation emotion, in a sense. Not really logic.\n \n\n In a way it is logic. Its a conditional statement. If I like this done to me, I should do this to others. Determining what you like done to you may be subjective, but the overall rule is a logical one. \n \nSo, if a debate takes place, and continues to take place, but someone comes to different CONCLUSIONS than you, you're ok with that? You're satisfied that reason has been utilized? Again, I think anyone who assumes religious people aren't wrestling with this issue in society has no idea what's really going on in religion. Trust me, there's PLENTY of debate and questioning going on about that subject. \n \n I'm sorry, but to be perfectly honest, I find the call from skeptics for more 'debate' and 'questioning' to be somewhat humorous, if not disingenuous. If you're satisfied with someone questioning and debating, but then coming out of it with conclusions DIFFERENT than yours, then very well. But most of the time, I find on such issues that calling for people to \"question\" and \"debate\" to more be code words for accepting the views of the one calling for questioning. IMO it's the height of arrogance for anyone to associate one side's views and conclusions with a lack of questioning. With all due respect, my religious views HAVE come about through questioning and debate, thank you, even if they are not the same views you have. \n \n\n If you're approaching a debate with a conclusion iin mind already then you're there to preach, not to debate. You're not there to discover something new, you're there to defend what you already think is the truth. There's no debate there. Of course we all have preconcieved notions, but if you treat your notion as a fact, and not as a hypothesis, then you're missing what's best about debating.", 
   {}, 
   363338, 
   null, 
   1249222020.0
  ], 
  [
   363653, 
   null, 
   "jyoshu", 
   "unkerpaulie, thanks, but I created this thread to converse with Another Opinion, if he's still willing.", 
   {}, 
   363462, 
   null, 
   1249273380.0
  ], 
  [
   363699, 
   null, 
   "Another opinion", 
   "How exactly do you arrive at the idea that logic is enough to make moral judgments? (That's the term you're using now, and if I'm misunderstanding you, please say so.) Logic can't tell you whether or not to apply ethical consideration to scientific work, or to what extent to do so. It can't tell the nuances of morality that determines when the needs of the few may be important than the needs of the many (to use a 'trek-ism'). Logic is objective, and you're talking about issues that are often subjective. I don't see how you can argue logic is sufficient. Call it reason, call it logic--whichever you think of it as--it needs morality to temper it. I simply don't want my morality dictated only by cold logic. you may feel differently for yourself, and that's your choice of course. I don't want to live that way. My points about this still stand even if you refer to it as \"logic.\" If everything were CLEARLY logical, there wouldn't be any controversies in our culture. These forums wouldn't exist because it would all be cut and dry and there would be no disagreement. Standards of logic are easy with things like mathematics; not so standardized when it comes to sociological issues. (Edit: reading down through your post further, it seems that you don't advocate logic-only after all, and so I think we may agree in some ways on this. If I'm understanding you correctly.)\n\n As you noticed reading further in my post, I do indeed say that moral reasoning does need to include value judgments as well.\n \n Overall, I would say that morality needs to be composed of at least three things:\n 1. Value judgments\n 2. Logic\n 3. A full understanding of the facts underlying the situation about which a moral judgment is being made.\n \n Granted that point 3 can be considered related to point 1 but it is different enough that I put it in its own separate category. It is also a highly important point since moral judgments are VERY often made by people who do not have a full understanding of the facts underlying a case. It is far easier to broadly categorize people into good and bad and to jump to conclusions. Reality is rarely that simple.\n \n So, lets see if we at least have some starting point to discussion. Namely, do you agree that moral reasoning needs to be composed of at least those three aspects? If not, then what would you exclude. Otherwise, what else would you add?\n \nWhere I think you're misguided here is in assigning logic or lack thereof as a causality. If they had only applied benevolent morality to their logic, it wouldn't have happened, after all. Again, what they did was no doubt completely 'logical' in their own thinking. \n\n Again, how are the two points that I mentioned not a question of absolute logic: \n 1. The Nazis blamed Jews for all of the problems that the Germans had experienced between the wars - an unreasoned conclusion based on emotional scapegoating, not firm facts.\n 2. The Nazis assumed that all Jews were bad people - an unreasoned conclusion based on stereotyped generalizations from what might have been a few bad eggs to a whole population.\n \n What arguements could they have made to counter those logical points? I would argue that they didn't even bother making counterpoints or presented other unsupported points in defense (ex. stating anecdotal examples and pretending that that supports their point). Since anyone who was sufficiently outspoken against the Nazi policies risked getting killed, any real debate on the subject did not truly exist. My main point in bringing up these examples is to say that, if such a thorough debate had been allowed to exist, then these logical points and others would have decimated their position. That is why it is so critical to aknoweldge that logic does have to form a part of moral reasoning. Do you disagree? If so, why?\n \nIMO, that's not \"logic\" though. What you just described isn't 2+2=4, it's simply a way of conducting morality. It's no more than saying one should think of a situation with himself in the place, so if anything, it's an appeal to self-preservation emotion, in a sense. Not really logic.\n\n Well, it is one of the rules presented by many secular morality theories - ex. that of Kant - where he arrived at those rules through secular reasoning. Since I don't have the time to look up his reasoning to get to that rule, I can leave that for now.\n \nAlright. And I think if you review my points, that's largely what I'm saying too. After all, I've said quite clearly that logic needs to be tempered with morality. I think we're saying much the same thing here, just in different ways.\n\n Morality and logic are not opposites. I would agree that logic needs to be tempered by value judgments (or what you call morality). However, I would also claim that morality needs to be tempered with logic. Do you disagree?\n \nI'm not making that point in rebuttal towards you. I'm simply making the point in general because I think it is an extremely important one. IMO religion is somewhat looked down upon in this forum, wrongly so, and so I think it needs to be emphasized that religious people generally use reason as well. It's not an either/or scenario.\n\n Yes, religious people use reason as well. However, I would claim that the reason used is more compartamentalized than the reason used in discussions on secular morality. In a way it is a type of reason that is constrained in a box. Granted, all reason should be constrained within the box of logic (that determines certain limits), but religious reasoning also constrains it within the box of faith. There are some directions in reasoning that religious people just will not cross since it contradicts their faith - ex. questioning the very existence of God or the truth of the Bible. Some religious people are more open-minded in not having as strict walls of faith set up around their reasoning. However, there are others who are so fixed in their views, that no reasoning can shift their view - their box of faith surrounding their reason is very tight indeed. The proportion of religious people who hold such strictly confined views seems to be growing - which is part of the reason for the reaction of the left against such trends. That was not always the case.\n \nI think your parenthetical statement hit the nail on the head. A religious nutcase gets far more PRESS than the many, many more who are reasonable people. Then we have some who think they champion reason who believe religion is bad in ANY case. Or that it's bad to have religion inform morality. That view in and of itself is unreasonable.\n\n However, issues such as Gay Rights have helped swing elections. So, these are not just marginal issues that can be ignored. They are used by the religious right to energize their constituency to vote for far-right Republican candidates. If these issues did not effect politics, then they would be far less visible. \n \nI think there needs to be a distinction made here between the term \"faith\" and religious belief. Of course 'faith' is about accepting something--a leap of faith, after all. I've studied much of the evidence pro and con, for instance, in terms of the early church and New Testament writings. I don't NEED faith to believe they are legitimate; the evidence suggests they are, and there is a lack of evidence to disprove them. That's reason, not just faith. That's what I mean by saying you don't own reason. I may have come to different CONCLUSIONS than you have, but that doesn't mean I'm not thinking through it. \n\n I don't claim that you are not thinking through it. I would surmise, however, that you are not completely open minded in your thinking in that there are some barriers in reasoning that you just will not cross and will take on faith - such as the very existence of God. However, I do not know you well enough to know that for sure. I have just had enough experience with people of reasonably strong religious belief to see that they always stop the discussion at some point once it starts reaching into uncomfortable directions.\n \nSo, if a debate takes place, and continues to take place, but someone comes to different CONCLUSIONS than you, you're ok with that? You're satisfied that reason has been utilized? Again, I think anyone who assumes religious people aren't wrestling with this issue in society has no idea what's really going on in religion. Trust me, there's PLENTY of debate and questioning going on about that subject. \n\n I am only fully satisfied if a reasoned discussion is fully followed to its end. If, after everyone's points have been addressed in all of the nested loops of questions and answers, and we still end up disagreeing, then so be it. I have often agreed to disagree on issues. Most often, that happens when both opponents lack knowledge in a particular situation. I have even changed my mind on occasion on an issue during debate - usually, when the opponent presents a piece of evidence that I was unfamiliar with. However, if reason is only partly used in a discussion and the opponent, instead, ignores uncomfortable points, the I would remain unsatisfied.\n \nI'm sorry, but to be perfectly honest, I find the call from skeptics for more 'debate' and 'questioning' to be somewhat humorous, if not disingenuous. If you're satisfied with someone questioning and debating, but then coming out of it with conclusions DIFFERENT than yours, then very well. But most of the time, I find on such issues that calling for people to \"question\" and \"debate\" to more be code words for accepting the views of the one calling for questioning. IMO it's the height of arrogance for anyone to associate one side's views and conclusions with a lack of questioning. With all due respect, my religious views HAVE come about through questioning and debate, thank you, even if they are not the same views you have.\n\n Then you should have no problem in presenting your rational views when they do come under question, and you should have no problem, then, in giving rational rebuttles to all of your opponents points. However, if you ignore some of their points, then they have every right to criticize you for it. That is true for all of us. Our opponents have every right to criticize us if we ignore their points. \n \nAlright then ... the excesses of the sexual revolution, for example. It's not like STDs and the effects of drugs weren't well-known, and I think you'd be hard pressed to find religious motivation behind it. Logically, why NOT sleep around? It's fun and harmless when taking precautions. But wait .... it seemed to cause a lot of problems nonetheless. Apparently logic wasn't enough to ensure they WOULD take precautions.\n\n I would claim that they didn't even try to use logic. As I said in an earlier thread, there are many people who don't even bother thinking through their moral stance. These people exist both in the religous and secular sphere. When comparing religious to secular morality, then, I would think it only fair to compare the views of those who have actually thought through their respective morality. Otherwise, I could argue that suicide bombers, the Klu Klux Clan, even the Nazis all fall under religious morality since they all used distorted views of religious morality to justify their actions.", 
   {}, 
   363338, 
   null, 
   1249319400.0
  ], 
  [
   364415, 
   null, 
   "jyoshu", 
   "As you noticed reading further in my post, I do indeed say that moral reasoning does need to include value judgments as well.\n \n Overall, I would say that morality needs to be composed of at least three things:\n 1. Value judgments\n 2. Logic\n 3. A full understanding of the facts underlying the situation about which a moral judgment is being made.\n \n Granted that point 3 can be considered related to point 1 but it is different enough that I put it in its own separate category. It is also a highly important point since moral judgments are VERY often made by people who do not have a full understanding of the facts underlying a case.\n\n \n These sound like a good 3-point standard for arriving at a moral position to me too. Though I think realistically speaking, anything like this is more a matter of ideal than absolute. In other words, it's something to strive for, and because there's no definitive outside standard for what constitutes a 'full' understanding of facts, people can only do the best they can. I'd say rather the facts as they can know them up to that point at least.\n \n \nSo, lets see if we at least have some starting point to discussion. Namely, do you agree that moral reasoning needs to be composed of at least those three aspects? If not, then what would you exclude. Otherwise, what else would you add?\n\n \n Yes, I think those three are adequate in terms of something to strive for. I think religion fits under point one.\n \n \nAgain, how are the two points that I mentioned not a question of absolute logic: \n \n 2. The Nazis assumed that all Jews were bad people\n\n \n Because logic is an objective concept, and the example you gave is a subjective one. In reality, what you cited fits under the 'value judgment' category. How do you logically judge good and bad? How does one apply things like 2+2=4 to such an eye-of-the-beholder concept? I think logic (in any standardized sense) can't go very far in determining morality. it can help, which is why I have no problem with it being in your 3 points. But I think it very well may be the weakest of the three in being beneficial.\n \n \nMy main point in bringing up these examples is to say that, if such a thorough debate had been allowed to exist, then these logical points and others would have decimated their position. That is why it is so critical to aknoweldge that logic does have to form a part of moral reasoning. Do you disagree? If so, why?\n\n \n I can't agree that logic would have prevented their position. I think purely logically, it could very well might make sense for a people to wipe out another. that's why logic does need to be tempered with ethics. It's something beyond logic that tells us it's wrong to kill other people if it is beneficial to do so. I hate to use an example from a movie, but it does illustrate what I'm talking about. Have you ever seen 2001:A Space Odyssey\"? The computer in that movie--Hal--kills off most of the crew because it's the only way to logically complete its mission. Now, I realize AI like that is fictional, but a computer (something that runs COMPLETELY on logic) might determine that the best way to preserve society would be to eliminate its weakest members, for instance. (Indeed, this is actually an argument the Nazis used in killing handicapped people, for instance.) That might be logical, but it's not ethical, and it's not moral, because our morality is determined by far more than merely logic. But I think to some degree you've agreed with this, in that logic isn't the only one of your three variables for morality.\n \n \nMorality and logic are not opposites. I would agree that logic needs to be tempered by value judgments (or what you call morality). However, I would also claim that morality needs to be tempered with logic. Do you disagree?\n\n \n Yes, I can agree with that. However, I think the need for logic to be tempered with morality is the far more common problem of the two.\n \n \nYes, religious people use reason as well. However, I would claim that the reason used is more compartamentalized than the reason used in discussions on secular morality. In a way it is a type of reason that is constrained in a box. Granted, all reason should be constrained within the box of logic (that determines certain limits), but religious reasoning also constrains it within the box of faith. There are some directions in reasoning that religious people just will not cross since it contradicts their faith - ex. questioning the very existence of God or the truth of the Bible.\n\n \n I think that is less of the case that you may realize. I think most religious people do indeed question the existence of God; they may not do so publicly, but they do. I would be willing to venture there's not a religious person ALIVE that hasn't questioned God's existence, for instance. I can't prove that, but they are human, and humans aren't automatons. Even the most hardened fundamentalist has questioned it at some point.\n \n \nSome religious people are more open-minded in not having as strict walls of faith set up around their reasoning. However, there are others who are so fixed in their views, that no reasoning can shift their view - their box of faith surrounding their reason is very tight indeed.\n\n \n But such compartmentalized thinking exists the other way too--we see scientists, for example, that want to conduct logical science set apart from ethics. So I think what you're describing isn't so much a product of religion as it is a tendency of some in humanity to compartmentalize, as you say. \n \n \nThe proportion of religious people who hold such strictly confined views seems to be growing - which is part of the reason for the reaction of the left against such trends. That was not always the case.\n\n \n And yet society is getting more 'progressive' all the time, which suggests religion is actually moving somewhat in the other direction. Surely you realize that religion in general is far more tolerant of things like gay rights than it was 20-30 years ago. \n \n \nHowever, issues such as Gay Rights have helped swing elections.\n \n \n Well I never said that something being a matter of getting more press wasn't a powerful influence. If someone is in a produce department in a grocery store, the presence of one rotten potato in a bag of them is plenty enough to sway a buyer against grabbing that whole bag. But if we approach these issues as if the problem is just religion (rather than understanding it's NOT religion at large at all), we TOO have abandoned logic. So I emphasize the importance of avoiding generalities. \n \n \nI don't claim that you are not thinking through it. I would surmise, however, that you are not completely open minded in your thinking in that there are some barriers in reasoning that you just will not cross and will take on faith - such as the very existence of God.\n\n \n If I've weighed the issues, and come to the conclusion God exists, how is it that I've not been open? At what point do we change the phraseology here from 'not being open' to 'having concluded'? Because I certainly have been open to that. If you've concluded that the earth is round, is it really that crucial to 'be completely open' to the idea that might still be flat? I don't think so. I think you're elevating one conclusion over another here, and it's not really fair to associate one with the idea of lack-of-questioning.\n \n \nI am only fully satisfied if a reasoned discussion is fully followed to its end.\n\n \n But does that ever really happen with most moralistic issues? I think that if we put off making a moral judgment/stance until discussions are at their end, society is pretty much going to stall. The reason many such issues are controversial is exactly THAT it's a complex issue that isn't going to end anytime soon, and no one side owns it. Logic can go either way on it, such as the issue of abortion. It's logical both to avoid abortions AND to give women choice. So both sides can claim that.\n \n \nAs I said in an earlier thread, there are many people who don't even bother thinking through their moral stance. \n\n \n I agree with that. And we both agree that people should indeed think through things.", 
   {}, 
   363699, 
   null, 
   1249661940.0
  ], 
  [
   364891, 
   null, 
   "Another opinion", 
   "These sound like a good 3-point standard for arriving at a moral position to me too. Though I think realistically speaking, anything like this is more a matter of ideal than absolute. In other words, it's something to strive for, and because there's no definitive outside standard for what constitutes a 'full' understanding of facts, people can only do the best they can. I'd say rather the facts as they can know them up to that point at least.\n\n Yes, I would agree that one might never know everything significant about the situation underlying a moral judgment. I mainly listed this goal since many people don't even try to first ask about all the underlying circumstances and, instead, simply jump to conclusions. I would be happy if everyone at least tried to look into the details before making moral judgments - that would be progress over the current status quo. This can be true for all political spectra - more so for far right or far left but occasionally also from those at the center.\n \nYes, I think those three are adequate in terms of something to strive for. I think religion fits under point one.\n\n I would agree. Many religious laws are simply value judgements.\n \nBecause logic is an objective concept, and the example you gave is a subjective one. In reality, what you cited fits under the 'value judgment' category. How do you logically judge good and bad? How does one apply things like 2+2=4 to such an eye-of-the-beholder concept? I think logic (in any standardized sense) can't go very far in determining morality. it can help, which is why I have no problem with it being in your 3 points. But I think it very well may be the weakest of the three in being beneficial.\n\n I think there is a misunderstanding about what I was calling illogical in that statement - i.e. that Nazis thought that all Jews were bad. My point was that it was illogical to think that \"ALL\" Jews are bad, as opposed to a point about thinking that all Jews are BAD. Certainly, one can point to innumerable examples from any race of people who behave badly - Jews included. I am sure that the Nazis could name a number of individual Jews who did act badly. However, their illogic lies in the extention of that judgment to ALL Jews. It is illogical because they cannot have individually examined each and every Jew to come to this conclusion. Their pronouncement that all Jews were bad was completely unsupported by any evidence. If they said that some Jews are bad, then they would have been right (some portion of every race and ethnicity are bad just because of the spread of human personalities). If they had been forced to justify their pronouncement, then that pronouncement would have been easily shown to be false and could no longer have been used to draw support of the German people to their anti-Semitic cause.\n \nI can't agree that logic would have prevented their position. I think purely logically, it could very well might make sense for a people to wipe out another. that's why logic does need to be tempered with ethics. It's something beyond logic that tells us it's wrong to kill other people if it is beneficial to do so. I hate to use an example from a movie, but it does illustrate what I'm talking about. Have you ever seen 2001:A Space Odyssey\"? The computer in that movie--Hal--kills off most of the crew because it's the only way to logically complete its mission. Now, I realize AI like that is fictional, but a computer (something that runs COMPLETELY on logic) might determine that the best way to preserve society would be to eliminate its weakest members, for instance. (Indeed, this is actually an argument the Nazis used in killing handicapped people, for instance.) That might be logical, but it's not ethical, and it's not moral, because our morality is determined by far more than merely logic. But I think to some degree you've agreed with this, in that logic isn't the only one of your three variables for morality.\n\n Yes and no. I agree that one can have logical positions that are completely heartless - such as the desire of a group to kill all people of a particular group. Theoretically, such moral systems are possible. However, they do not work in reality without there existing some illogical pronouncement that is used as propaganda to convince the mass of supporters. That is because people, on average, are not completely heartless but do have a sense of compassion. If one were to state, without any such propaganda, that the state wanted to kill everyone of a particular group (ex. in order to take their land for the benefit of the people of that state), then such a stated goal would meet with a lot of opposition - even in totalitarian states. That is why propaganda has so often been used in history to support extreme acts - from the Nazi propaganda against the Jews, to the Hutus propaganda against the Tutsis, to propaganda that is always used in times of war to vilify the enemy (not just individuals in the enemy but all members of the enemy), to the propaganda about the savageness of Native Americans that was used to justify their mass slaughter, to propaganda about the abilities of people of African origin that was used to justify slavery. If one looks at every heartless act in human history, there is nearly always propaganda underlying the support for those actions. Propaganda can easily be countered with logic - as long as that honest discussion is allowed to happen and as long as both sides are forced to abide by the result of the discussion. Of course, those in power prevent such honest discussions from happening in the first place so that their propaganda remains unchallenged. That is why freedom of speech is so important. The Nazis propaganda about the Jews let them gain supporters to their cause. If that propaganda had been successfully challenged, then their cause might never have grown and/or the Holocaust might never have happened. \n \nI think that is less of the case that you may realize. I think most religious people do indeed question the existence of God; they may not do so publicly, but they do. I would be willing to venture there's not a religious person ALIVE that hasn't questioned God's existence, for instance. I can't prove that, but they are human, and humans aren't automatons. Even the most hardened fundamentalist has questioned it at some point.\n\n I might disagree with you about EVERYONE having questioned God's existence, but I would agree that a lot more people have questioned it than one may think. However, very few believers are willing to expose themselves to a full rigorous test of their faith in God by non-believers. It is just too uncomfortable to have such an honest discussion. I would admit, however, that, outside of rational arguements against certain beliefs in God, many non-believers are just too abnoxious in such discussions to let them happen (Their goal is to insult people of faith more than it is to discuss) so both sides can often be at fault there. \n \nBut such compartmentalized thinking exists the other way too--we see scientists, for example, that want to conduct logical science set apart from ethics. So I think what you're describing isn't so much a product of religion as it is a tendency of some in humanity to compartmentalize, as you say.\n\n Where scientists are concerned in conducting science apart from ethics, I think that is a matter of passing on responsibility. If a technology they develop is misused, then they blame those that misused that technology - not they themselves, who developed it. I would say that they are partly right and partly wrong. The responsibility over a particular dangerous technology is spread numerous ways - including both those that use it and those that develop it. In not recognising that they ALSO carry that responsibility, they do indeed demonstrate compartamentalized thinking. \n \n When I encounter compartamentlized thinking on either side, I try to counter it. One cannot say that one side should be allowed to use compartamentlized thinking because the other side occasionally engages in it. The goal should be to block compartamentalized thinking WHEREVER one sees it. \n \n So, I am also against compartamentalized thinking when I see it in the secular sphere. Are you against compartamentalized thinking when you see it in the religious sphere or is your criticism of compartamentlized thinking directed only one way?\n \nAnd yet society is getting more 'progressive' all the time, which suggests religion is actually moving somewhat in the other direction. Surely you realize that religion in general is far more tolerant of things like gay rights than it was 20-30 years ago. \n\n I would say that there are two trends. The first is that society in general (on average) is moving in a more \"progressive\" direction. However, at the same time, there is an ever growing minority of the population - that now constitute about 30% of the US population - that are labelled the religious right that hold on tightly to older less progressive views and that often use distorted claims to try to convince moderates of their cause. That is the minority that largely disrupted President Clinton's presidency, that were able to gain power through the Bush administration, and who are trying to cause havoc through exagerrated or distorted arguments now during the Obama administration. It is the tactics of that 30% minority in their quest for power that leaves many on the left cynical and angry. Many Democrats I know regret these changes in the Republican party - a party that used to be more moderate and which used to have spokesemen such as William Buckley, where now Rush Limbaugh is a major spokesman - big difference.\n \n Unfortately, many people who resent the tactics of the religious right let that resentment and anger spill over into criticism of ALL religious people. They are blind to the fact that there are a wide range of religious views and, given that the great majority of the people of the US call themselves religious, that means that most are far more moderate in their views than are the religious right. In trying to paint all religious people with the same critical brush, they are not only wrong but they risk alienating the very moderate religious groups that should otherwise form their allies on many issues. So, this is my warning to those who are strongly non-religious to be more selective and politically savy in their attacks.\n \n ---On Edit---\n As an example of more moderate religious groups potentially forming alliances with Democrats on political issues, here is an article about religious groups that support health care reform and wish to counter the strong anti-health care reform rhetoric from the far right: Faith groups launch campaign in favor of health care reform - CNN.com . I am sure that there are many social and political issues on which moderate religious groups could form strong alliances with the center-left.\n \nReligious groups in favor of health care reform have launched a national campaign to offset the loud opposition to President Obama's plan to overhaul the nation's health care system, organizers announced.\n \n \"This is as much a crisis of faith as it is a crisis of health care,\" said the Rev. John Hay Jr., senior pastor of West Morris Street Free Methodist Church in Indianapolis, Indiana.\n \n \"We just believe there is a better way.\"\n \n He and others spoke in a telephone news conference Monday announcing the campaign.\n \n \"As a pastor, I believe access to health care is a profoundly moral issue,\" said the Rev. Stevie Wakes of Olivet Institutional Baptist Church in Kansas City, Kansas.\n \n The campaign, called \"40 days for Health Reform,\" includes a national television advertisement, a \"sermon weekend,\" prayer meetings and a nationwide call-in with Obama on August 19, organizers said.\n \n Prayer meetings emphasizing health care as a moral issue were taking place Tuesday in 45 cities across 18 states, organizers said. They expected about 4,000 people to participate.\n\n --------------\n \nWell I never said that something being a matter of getting more press wasn't a powerful influence. If someone is in a produce department in a grocery store, the presence of one rotten potato in a bag of them is plenty enough to sway a buyer against grabbing that whole bag. But if we approach these issues as if the problem is just religion (rather than understanding it's NOT religion at large at all), we TOO have abandoned logic. So I emphasize the importance of avoiding generalities. \n\n The issues of gay rights and abortion help drive the power of the far-right - both of which are issues that are very often argued in a religious light. I can't see how one can not see these issues as being driven by the religious right. However, I would agree that these issues are not the ONLY ones that define religion (if that was your point) and that is something that the left has to be more careful about.\n \nIf I've weighed the issues, and come to the conclusion God exists, how is it that I've not been open? At what point do we change the phraseology here from 'not being open' to 'having concluded'? Because I certainly have been open to that. If you've concluded that the earth is round, is it really that crucial to 'be completely open' to the idea that might still be flat? I don't think so. I think you're elevating one conclusion over another here, and it's not really fair to associate one with the idea of lack-of-questioning.\n\n Like I said in a previous post, I do not know you well enough to know how open you are to thinking outside of the box of faith. So, you might well have been open to questioning the existence of God. However, I find many religious people only partly open to such questioning and often back away once arguements start being presented that test their faith too strongly (even if those arguements are presented in a respectful, non-flaming way). That may not be the case with you, I just don't know. Perhaps you are willing to fully sit through a thorough debate about the existence of God. \n \n As for the flat earth arguement, there is so much evidence surrounding a spherical earth that I would be perfectly happy conducting a full discussion about a flat vs round earth - as long as it stays both rational and respectable. There have occasionally been discussions on certain uncomfortable topics where I myself have opted out but, in nearly all these examples, it was because I needed to verify for myself the evidence presented to me before continuing with the discussion. Otherwise, I often even enjoy discussions that challenge my beliefs - as long as they are respectable and rational - and have often enough changed my mind.\n \nBut does that ever really happen with most moralistic issues? I think that if we put off making a moral judgment/stance until discussions are at their end, society is pretty much going to stall. The reason many such issues are controversial is exactly THAT it's a complex issue that isn't going to end anytime soon, and no one side owns it. Logic can go either way on it, such as the issue of abortion. It's logical both to avoid abortions AND to give women choice. So both sides can claim that.\n\n I am not saying that people should wait to have moral views until all discussions are complete. Indeed, I think people have every right to hold moral opinions. However, before they try to impose those opinions on others through law, then I think it should be their responsibility to at least partly test out those moral views through debate with those on the opposition. I believe this should be the case for both sides of the political spectrum.", 
   {}, 
   364415, 
   null, 
   1249924860.0
  ], 
  [
   365213, 
   null, 
   "jyoshu", 
   "AO, I'll try to respond soon; tonight if possible. \n Thanks for the patience.", 
   {}, 
   364891, 
   null, 
   1250109840.0
  ], 
  [
   365304, 
   null, 
   "Another opinion", 
   "If you post early enough today, I might still be able to respond. Otherwise, I am going away for a long weekend and might not be able to respond until Monday.", 
   {}, 
   365213, 
   null, 
   1250179860.0
  ], 
  [
   365366, 
   null, 
   "jyoshu", 
   "I think there is a misunderstanding about what I was calling illogical in that statement - i.e. that Nazis thought that all Jews were bad. My point was that it was illogical to think that \"ALL\" Jews are bad, as opposed to a point about thinking that all Jews are BAD. Certainly, one can point to innumerable examples from any race of people who behave badly - Jews included. I am sure that the Nazis could name a number of individual Jews who did act badly. However, their illogic lies in the extention of that judgment to ALL Jews. It is illogical because they cannot have individually examined each and every Jew to come to this conclusion.\n\n \n I agree, but to play devil's advocate, I've heard people make similar generalizations about religion right here in there forums. Is there EVER a case where the actions of some speak to the whole? This is particularly the case on behavioral based issues. If a neo-nazi says something racist, is it bad to assume neo-nazism is a bad thing in general? Neo-nazis might say no. \n \n I only use this analogy to point out the problems with associating lacl-of-logic with Nazism here. There's no outside overarching standard that says logic supports the point of view you're taking. Why should we assume that logic wouldn't support the idea of generalizing the actions of some to the whole?\n \n I think the better approach is to more go by benevolence and compassion, rather than logic, in terms of morality. I think it's a safer bet. Compassion would have prevented the holocaust, and with it, it doesn't matter what standards of logic one uses.\n \n \nYes and no. I agree that one can have logical positions that are completely heartless - such as the desire of a group to kill all people of a particular group. Theoretically, such moral systems are possible. However, they do not work in reality without there existing some illogical pronouncement that is used as propaganda to convince the mass of supporters. That is because people, on average, are not completely heartless but do have a sense of compassion.\n\n \n Then that only supports my point, that logic has to be tempered with compassion. If not for compassion, logic could be a dangerous thing.\n \n \nI might disagree with you about EVERYONE having questioned God's existence, but I would agree that a lot more people have questioned it than one may think. However, very few believers are willing to expose themselves to a full rigorous test of their faith in God by non-believers.\n\n \n With all due respect, it seems to me you're slowly moving the goalposts here. Now we're not just talking about questioning, but a \"full rigorous test of their faith in God by non-believers\"? What constitutes a \"full rigorous test\" here? What does that MEAN? And why should we assume \"non-believers\" are better equipped to provide the test anyway? There's nothing that says non-believers provide a better standard here.\n \n \nI would admit, however, that, outside of rational arguements against certain beliefs in God, many non-believers are just too abnoxious in such discussions to let them happen (Their goal is to insult people of faith more than it is to discuss) so both sides can often be at fault there. \n\n \n I appreciate you making that point. Sometimes religious people can certainly be insulting too.\n \n [QUOTE=Another opinion;364891]When I encounter compartamentlized thinking on either side, I try to counter it. One cannot say that one side should be allowed to use compartamentlized thinking because the other side occasionally engages in it. The goal should be to block compartamentalized thinking WHEREVER one sees it. \n \n \nSo, I am also against compartamentalized thinking when I see it in the secular sphere. Are you against compartamentalized thinking when you see it in the religious sphere or is your criticism of compartamentlized thinking directed only one way?\n\n \n Like I said, I think logic should be tempered by compassion (both are present). And value judgments should be tempered by logic, though I think the need for the former is usually far greater.\n \n \nI would say that there are two trends. The first is that society in general (on average) is moving in a more \"progressive\" direction. However, at the same time, there is an ever growing minority of the population - that now constitute about 30% of the US population - that are labelled the religious right that hold on tightly to older less progressive views and that often use distorted claims to try to convince moderates of their cause.......... Many Democrats I know regret these changes in the Republican party - a party that used to be more moderate and which used to have spokesemen such as William Buckley, where now Rush Limbaugh is a major spokesman - big difference.\n\n \n I don't think Rush Limbaugh is an example of the \"religious right.\" He may be on the 'right', but he's not religious, and the phrase encompasses both aspects. The RR may be growing (I don't know for sure if that's so or not), but I think it's safe to say that it's influence is waning. Its heyday was back in the 1980s. Bush wasn't nearly as controlled by the RR as his critics tend to portray him as. He certainly didn't mind wearing his religion on his sleeve, but that's not the same thing IMO.\n \n \nAs an example of more moderate religious groups potentially forming alliances with Democrats on political issues, here is an article about religious groups that support health care reform and wish to counter the strong anti-health care reform rhetoric from the far right: Faith groups launch campaign in favor of health care reform - CNN.com . I am sure that there are many social and political issues on which moderate religious groups could form strong alliances with the center-left.\n\n \n FWIW, in my experience, everyone wants health-care reform of SOME kind. It's really more of a question of whether or not we want govt. intrusive into the issue. As someone said on television recently--people complain about govt. being in their bedrooms, but some of those same people don't seem to mind the idea if the govt. being by peoples' deathbeds. IOW, healthcare reform isn't only a 'left' issue. Government-controlled healthcare is, however. \n \n \nLike I said in a previous post, I do not know you well enough to know how open you are to thinking outside of the box of faith. So, you might well have been open to questioning the existence of God. However, I find many religious people only partly open to such questioning and often back away once arguements start being presented that test their faith too strongly (even if those arguements are presented in a respectful, non-flaming way). That may not be the case with you, I just don't know. Perhaps you are willing to fully sit through a thorough debate about the existence of God.\n\n \n Yes, I am, but I don't consider it something that is needed for religious people to be considered open. Would you consider it equally as important for atheists to be open to thinking outside their box? To an equally important extent? \n Besides, at some point, one has to consider themselves convinced. Again, I see no reason to continue to be 'open' to the idea of a flat earth.\n \n \nAs for the flat earth arguement, there is so much evidence surrounding a spherical earth that I would be perfectly happy conducting a full discussion about a flat vs round earth - as long as it stays both rational and respectable.\n\n \n I think you may have missed my point. I'm saying that one may get to the point where there is compelling evidence to the point that the discussion really is not necessary. It's not because I haven't considered the existence of God that I have become convinced He's real. It's because I HAVE considered it and gone through that process.\n \n \nI am not saying that people should wait to have moral views until all discussions are complete. Indeed, I think people have every right to hold moral opinions. However, before they try to impose those opinions on others through law, then I think it should be their responsibility to at least partly test out those moral views through debate with those on the opposition. I believe this should be the case for both sides of the political spectrum.\n\n \n But that's the first time you've brought that up. Imposing and believing are two very different things. In my experience, often in these forums when someone is challenged on the issue of believing religious BELIEF is irrational, they switch to defending imposing belief. That's otherwise known as moving the goalposts. \n \n \nIf you post early enough today, I might still be able to respond. Otherwise, I am going away for a long weekend and might not be able to respond until Monday.\n\n \n Sorry, it took longer than I hoped. Hope your weekend is well.", 
   {}, 
   365304, 
   null, 
   1250216280.0
  ], 
  [
   365728, 
   null, 
   "Another opinion", 
   "I agree, but to play devil's advocate, I've heard people make similar generalizations about religion right here in there forums. Is there EVER a case where the actions of some speak to the whole? This is particularly the case on behavioral based issues. If a neo-nazi says something racist, is it bad to assume neo-nazism is a bad thing in general? Neo-nazis might say no.\n \n I only use this analogy to point out the problems with associating lacl-of-logic with Nazism here. There's no outside overarching standard that says logic supports the point of view you're taking. Why should we assume that logic wouldn't support the idea of generalizing the actions of some to the whole?\n \n I think the better approach is to more go by benevolence and compassion, rather than logic, in terms of morality. I think it's a safer bet. Compassion would have prevented the holocaust, and with it, it doesn't matter what standards of logic one uses.\n\n I would say that generalizations are nearly always wrong. One almost never encounters someone who is all bad or all good, or an organization or group that is all bad or all good. Lets take a look at the Nazis. Prior to World War II, the rise of the Nazi party was praised by a very wide range of American and European politicians. After World War I, Germany was a country that was in desperate poverty due to that war and due to the repression that was imposed on it by the winning powers - it had tremendous unemployment, inflation - its society and economy were in shambles. Despite all of their future horrors, one thing that the Nazis did which was beneficial was to pull their country out of those deep economic problems - which is why it was so praised abroad at the time. Of course, those politicians were naive since they didn't see the evil that loomed around the corner, but that still doesn't subtract from the fact that there was something that the Nazis did that was good, not just bad. Also, when you compare individual Nazis, many of those of higher rank were forced to join the Nazi party, despite not holding true to their ideology. They were simply soldiers trying to defend their country. So, not all Nazis were bad. That is why the Nurembourg trials, and those like it, only concentrated on the ringleaders who committed war crimes, not on the rank and file Nazis or on those higher up who did not commit war crimes. So, even where the most evil organization of the 20th century is concerned, there are many shades of gray. One cannot fully generalize (ex. saying that ALL Nazis where bad, or that Naziism was ALL bad). \n \n When people generalize, it means that they haven't bothered looking into the details and, instead, take the illogical easy way out by painting everyone with the same brush. Logic can counter such generalizations and, by doing so, can help reduce the great majority of evils in this world - as long as such logic is followed and respected.\n \nThen that only supports my point, that logic has to be tempered with compassion. If not for compassion, logic could be a dangerous thing.\n\n I think that you seperate the two too much. Logic and compassion can work together. As in the point I made in my last post, logic can be used to combat the propaganda that forms the basis to nearly all acts of evil - propaganda that would not be necessary if not for the compassion that people do occasionally feel. Compassion on its own can also be used to combat propaganda but it is often not as successful since people have to be open to feeling compassionate - which is very difficult to do when discussing a group which has individuals who have hurt your group. If someone from a particular group killed your family, it would be very hard for you to feel compassionate to anyone from that group and you (or at least most people) would very likely hate everyone from that group. However, it might be more successful for someone to sit down with you and point out all the inconsistencies in your logic in thinking that ALL the people in that group are evil. \n \n Logic is a universal tool that is independent of mindset - as long as it is given an honest hearing. Most people know when they are being illogical. That is why the most frequent tactic of those that hold at least partly irrational views is to avoid the logical points being addressed - so that they will not have to face or admit to the illogic of their views. Even the most angry person can realize when someone has outmaneuvered him with logic, though he might never admit it. Compassion, on the other hand, more often works with minds that are calm enough to feel it. You cannot force someone to feel compassion - especially if they are angry. Nevertheless, despite its limited enforceability, I think that compassion is an important thing to try to teach, along with logic, as a general guiding moral principle. Most people are capable of feeling empathy. With compassion and logic working together, a lot can be accomplished in using that empathy to combat evil acts.\n \n I would, however, want to bring up one point about compassion. Namely, sometimes there are opposite beneficiaries to compassion that continue to lead to conflicts. For example, take the issue of abortion. Generally speaking, those that are pro-choice have compassion for the woman who is pregnant with an unwanted pregnancy while those that are pro-life have compassion for the fetuses (a.k.a. pre-born, etc.). Many on the pro-life side don't have compassion for the women who are pregnant with unwanted pregnancies since they view them as being immoral for having the sex leading up to that pregnancy (which is why they only support rape and incest as exceptions, since it was not the woman's fault). Meanwhile, many pro-choice proponents don't have compassion to early fetuses since those early fetuses don't yet have any minds, cannot suffer, etc. My main point here is that compassion itself is not the only answer since there can be vast differences in how one directs that compassion that leads to major differences in moral rules.\n \nWith all due respect, it seems to me you're slowly moving the goalposts here. Now we're not just talking about questioning, but a \"full rigorous test of their faith in God by non-believers\"? What constitutes a \"full rigorous test\" here? What does that MEAN? And why should we assume \"non-believers\" are better equipped to provide the test anyway? There's nothing that says non-believers provide a better standard here.\n\n Then let me expand that to believers being able to accept a full-rigorous test by anyone ready to challenge their beliefs - be they believers or unbelievers. My main point was that, in my experience, believers nearly always stop short of full debate once it starts being uncomfortable (even when the debate contains no flaming or otherwise rude behavior). Granted, that is true of many people on both the secular and religious sphere - they stop the debate once the opponent starts introducing very difficult to counter points. However, though I have found such closed-minded people in both secular and religious spheres, strongly religious people seem to have a much higher percentage of closed-mindedness than moderate or non-religious people. When you couple that with the political power that the strongly religious have wielded in the last couple of decades, one can understand the anger of the left and left-of center moderates. \n \nI appreciate you making that point. Sometimes religious people can certainly be insulting too.\n\n That is why I think it is important for all sides to try to calm down and actually talk, not flame. Even if there is no resolution, at least one benefits by gaining a better, truer understanding of the opposite side. Rarely do entire groups fully fit a particular characature.\n \nI don't think Rush Limbaugh is an example of the \"religious right.\" He may be on the 'right', but he's not religious, and the phrase encompasses both aspects. The RR may be growing (I don't know for sure if that's so or not), but I think it's safe to say that it's influence is waning. Its heyday was back in the 1980s. Bush wasn't nearly as controlled by the RR as his critics tend to portray him as. He certainly didn't mind wearing his religion on his sleeve, but that's not the same thing IMO.\n\n I think that there are nuances to the power of the religious right. I suspect that, to some extent, the religious right is being used by the far right ideologues to get those far-right ideologues into power. All those far-right politicians have to do is claim that they are pro-life, pro-gun and use distorted propaganda against the left, and many on the religious right will see them as leaders that they can follow and vote for them. Meanwhile, with their emphasis on deregulation, reduction of taxes on the wealthy, etc. - they vote against the economic best interest of the majority of their supporters while supporters are largely concentrating on the social issues. \n \nFWIW, in my experience, everyone wants health-care reform of SOME kind. It's really more of a question of whether or not we want govt. intrusive into the issue. As someone said on television recently--people complain about govt. being in their bedrooms, but some of those same people don't seem to mind the idea if the govt. being by peoples' deathbeds. IOW, healthcare reform isn't only a 'left' issue. Government-controlled healthcare is, however. \n\n (Note: I suspect that we could get into deep discussions on this issue alone so, if you want to reply in a lengthy way, then it might be worth joining or starting another thread on health care. That being said, I will add my lengthy answer...) \n What is frustrating for those of us who are left-of-center to hear is the gross distortion about the current health care plans. There are no death panels planned that would \"kill Grannies\" - there are just options to pay for VOLUNTARY counceling of the elderly on end-of-life issues (ex. do they want to have a living will) while they are still in their right mind. Why is that a bad thing? Also, the number of Democrats that actually want REAL Socialism is a tiny minority - I personally have only met three in my life. As for a government beaurocrat deciding what health procedures will be funded, I don't see that as being much worse - and likely would be far better - than the current status quo of insurance beaurocrats deciding what health procedures will be funded. At least the government beaurocrat is not trying to make a profit off of you. As for efficiency, Medicare is more efficient (less overhead) than any private insurance company. Also, people on the right so often forget that this health care plan will NOT replace their current work-sponsored insurance. If you have insurance that you are happy with, you get to keep it.\n \n However, given the fear (rational or not) of people on the right about any government run health care (though they forget that Medicare and military health care are all government run), then I hear that the health care reforms might concentrate on introducing some not-for-profit insurance carriers instead of a government plan. At least that is the main proposal that is being worked on in the Senate. I would be fine with that. I mostly want to know that everyone in the US can have access to health care - including the poor and those with pre-existing conditions, and I want to feel very confident that, when I eventually get sick, that I will be able to count on my health insurance paying for that and not denying any of my reasonable claims. I have little trust in the system as it is.\n \nYes, I am, but I don't consider it something that is needed for religious people to be considered open. Would you consider it equally as important for atheists to be open to thinking outside their box? To an equally important extent? \n\n Yes, I think that atheists need to be open to anyone who comes in with a rational arguement - especially if they have evidence to back it up. I bemoan the current state of affairs where any real discussion on the supernatural is considered taboo in most scientific circles. If any evidence did surface, then I would suspect that it would be ignored because of that taboo. However, many people try to make claims without a rigid rational basis and without any evidence. I think that atheists have every right to ignore such unsupported claims. Everything comes down to the rationality and support in evidence that someone brings to the table. Rational, supported arguements on either side should not be ignored.\n \nBesides, at some point, one has to consider themselves convinced. Again, I see no reason to continue to be 'open' to the idea of a flat earth.\n\n Yes, since it is extremely unlikely that the flat earth theorists could come up with anything to counter the mountains of evidence about a spherical earth. However, if the nearly-impossible did happen and they did come up with such evidence, then they would deserve a hearing.\n \nI think you may have missed my point. I'm saying that one may get to the point where there is compelling evidence to the point that the discussion really is not necessary. It's not because I haven't considered the existence of God that I have become convinced He's real. It's because I HAVE considered it and gone through that process.\n\n I think, however, that we always have to remain at least partly open minded on any of our views since the rational process that we have gone through on any issue might be flawed in that we might have left something out. That is why we must always be open to rational debate. This is true for all of us - those who are strongly religious, moderately religious, agnostics, or atheists. We are all imperfect in our reasoning skills so our views should never be COMPLETELY final but open to new rational arguements (as opposed to irrational arguements that it makes sense to ignore). \n \nBut that's the first time you've brought that up. Imposing and believing are two very different things. In my experience, often in these forums when someone is challenged on the issue of believing religious BELIEF is irrational, they switch to defending imposing belief. That's otherwise known as moving the goalposts.\n\n I don't know of many people who resent those who hold strongly religious views but who don't impose those strongly religious views on others. Yes, I have met some people who are secular purists that would try to convert all people away from religion for principles sake. However, the great majority of the people I have met who argue against those who are strongly religious argue against it because of their fear and/or resentment about strict religious practitioners trying to impose their morality on the rest of us or on innocent victims of their own inner societies (ex. children of bigamists Mormons or women in particularly strict Muslim societies). Those are just my observations. It is the anger and/or fear about the power that these groups have in imposing their views on others that is the main drive of the left. I personally think that everyone has a right be untormented in keeping to their own view. However, when that view comes into the public sphere (in determing laws, etc.), then those that hold views need to be able to defend them.", 
   {}, 
   365366, 
   null, 
   1250532060.0
  ], 
  [
   367288, 
   null, 
   "MrWriteLA", 
   "Hmm... eleven days and no response to the last post.\n \n Looks like we can declare a winner on this debate.", 
   {}, 
   365728, 
   null, 
   1251503220.0
  ], 
  [
   367416, 
   null, 
   "Another opinion", 
   "Hmm... eleven days and no response to the last post.\n \n Looks like we can declare a winner on this debate.\n\n To be honest, I prefer to think of this more as a discussion than as a debate. My goal here is not as much to \"win\" as it is to have a discussion with someone of a different worldview in order to better understand their point of view, whether or not I agree with it. \n \n I do enjoy trying to present a solid rational argument supporting my views, and then debating it. However, I also enjoy hearing new rational arguments that I might not have previously heard or considered and have often enough adapted my own views to take such new rational arguments into account. Also, even if nothing new is presented, I feel that I gain from such discussions in better understanding where the other person is coming from.\n \n So, I hope that jyoshu does decide to continue this discussion since I think that it would benefit us both.", 
   {}, 
   367288, 
   null, 
   1251566220.0
  ], 
  [
   367584, 
   null, 
   "MrWriteLA", 
   "I also enjoy hearing new rational arguments that I might not have previously heard or considered...\nAn admirable attitude, to be sure, and one much to be lauded.\nSo, I hope that jyoshu does decide to continue this discussion since I think that it would benefit us both.\nI hope so, too. But frankly, given his history here (and possibly a belated realization on his part that his stance is insupportable), I wouldn't hold my breath.\n \n \"Those who invalidate reason ought seriously to consider whether they argue against reason with or without reason; if with reason, then they establish the principles that they are laboring to dethrone: but if they argue without reason (which, in order to be consistent with themselves they must do), they are out of reach of rational conviction, nor do they deserve a rational argument.\"--Ethan Allen, \"Reason, the Only Oracle of Man\"", 
   {}, 
   367416, 
   null, 
   1251658440.0
  ], 
  [
   367729, 
   null, 
   "jyoshu", 
   "I would say that generalizations are nearly always wrong.\n\n \n Well that's pretty much my point. I think the fact that generalization is nearly always wrong also shows us that there is no over-arching standard for reason, and that it's not really valid to only associate it wth good. Where do we get the standard that says Nazism is generally a bad thing? We get it simply because the Nazis did bad things--if they hadn't, Nazism wouldn't be associated thus.\n \n The idea that reason equates to good rather than possibly also bad is a form of the no-true-scottsman fallacy. What I'm trying to get you to tell me is ... why should we assume reason is to be equated to good and not potentially bad? From whence comes the idea that if something good happens, we should chalk it up to reason, but other things like religion may be NOT be thus? You base your idea of reason = good on nothing more solid than your opinion of what reason should constitute. And that's subjective, not objective. Unless, of course, you can adequately explain the objective basis for that view. \n \n \nI think that you seperate the two too much. Logic and compassion can work together. As in the point I made in my last post, logic can be used to combat the propaganda that forms the basis to nearly all acts of evil\n\n \n I don't separate them so much as I think logic needs compassion. Moreso than the other way around. At least compassion is, well, compassion. Logic may tell us the solution to a math problem, but it can't FEEL for the plight of people. I can feasibly imagine a world of compassion without much logic. I cannot feasibly imagine a world of logic without much compassion. \n \n Re. your point about propaganda ... I agree that's a good ideal role for 'logic', although if logic ALONE was employed, I'm not sure it could do any more than say whether something is truly correct or incorrect. Remember, propaganda isn't automatically a falsehood simply on the basis of being propaganda. (There's nothing in its definition that requires the word to refer to something false.) So that's only valuable, IMO, in the case of false propaganda (that can be logically disproven). I think propaganda is often subjective, and therefore by nature difficult to disprove, to begin with. That's exactly WHY it's propagandist--people who create propaganda naturally aren't going to create something that logic can just shoot down. It's usually stuff that's not really 'disprovable' to begin with--you know, 'beat-your-wife' type allegations.\n \n \nI would, however, want to bring up one point about compassion. Namely, sometimes there are opposite beneficiaries to compassion that continue to lead to conflicts. For example, take the issue of abortion. Generally speaking, those that are pro-choice have compassion for the woman who is pregnant with an unwanted pregnancy while those that are pro-life have compassion for the fetuses (a.k.a. pre-born, etc.). Many on the pro-life side don't have compassion for the women who are pregnant with unwanted pregnancies since they view them as being immoral for having the sex leading up to that pregnancy\n \n (which is why they only support rape and incest as exceptions, since it was not the woman's fault). Meanwhile, many pro-choice proponents don't have compassion to early fetuses since those early fetuses don't yet have any minds, cannot suffer, etc.\n\n \n It strikes me that we seem to see this differently--I think you may be taking more of a glass-half-empty approach here in arguing these examples as cases of not-showing-compassion, when I'd say they both do show them, and therefore see it as a glass-half-full perspective. In my experience, both sides do tend to be compassionate. They just have different areas of focus. (choice versus life) Which may be another way of saying what you're saying, so I don't say this in disagreement necessarily. However, the allegation that many on the pro-life side or pro-choice side don't show compassion sounds exactly like the sort of thing that comes from propaganda--the very thing you've talked at great length about here. I have no interest in debating abortion here, but I tend to think it's a little unfair when people argue that either side isn't being compassionate. It's sort of like saying that anti-death penalty advocates aren't being compassionate toward crime-victims'-families.\n \n \nMy main point here is that compassion itself is not the only answer since there can be vast differences in how one directs that compassion that leads to major differences in moral rules.\n\n \n I have not argued at ALL that compassion should be the answer without logic. I think I've made clear, multiple times, that both are necessary. The thing is here, that proponents of \"logic\" and \"reason\" tend to think that there's some SET standard to those concepts or the way they are applied. As if those standards don't vary from person to person. As if there's some over-arching standard there. There's not. We accept, I think, that compassion is subjective. But people throw around terms like \"reason\", with their Jefferson quotes (often without qualification) and what not, as if that too is not nebulous and inconcrete. Has logic really done anything to resolve the abortion issue? I don't think so--the abortion controversy is as alive as ever. Every side thinks logic is theirs. Every side thinks theirs is the logical approach. Such controversies as abortion tend to be unsolvable by compassion OR logic, but for sure whatever side one takes, they naturally think both is on their side! So my point is that logic is really subjective TOO, because there's no overarching standard for how logic can apply in situations like these. It's easy to say we should apply logic to something like abortion, but it gets much more sticky in society coming to consensus on what that means. Why? Because not everyone applies logic the same way.\n \n \nThen let me expand that to believers being able to accept a full-rigorous test by anyone ready to challenge their beliefs - be they believers or unbelievers. My main point was that, in my experience, believers nearly always stop short of full debate once it starts being uncomfortable\n\n \n So? In cases where such a debate pertained to harmful behavior, I would find the point pertinent, but that's not the case with most religious belief. I also think that often tends to happen because they see little point in carrying on. There comes a point in such debates where it becomes clear that neither side is going to budge--the issues get boiled down to the levels that people can't retreat from. And frankly, I suspect religious people just tend to less feel the need to question in the first place. Unless it can be shown a belief is truly harmful, there's little need to question it. And I think anyone is pretty hard pressed to show where most religious belief is truly harmful.\n \n \nWhen you couple that with the political power that the strongly religious have wielded in the last couple of decades, one can understand the anger of the left and left-of center moderates.\n\n \n Then it seems to me what should be opposed or debated is whether or not one should use religion for harm from a position of power, not religion in and of itself. Like most anything, there's ideology, and then there's harmful ideology. It's the harmful that should be questioned.\n \n \nThat is why I think it is important for all sides to try to calm down and actually talk, not flame.\n\n \n Sounds good.\n \n \nI think that there are nuances to the power of the religious right. I suspect that, to some extent, the religious right is being used by the far right ideologues to get those far-right ideologues into power. All those far-right politicians have to do is claim that they are pro-life, pro-gun and use distorted propaganda against the left, and many on the religious right will see them as leaders that they can follow and vote for them. \n\n \n What you just described is what happens all the time in politics, religious or not. IOW, it's a political reality, not so much a religious one.\n \n \nI think, however, that we always have to remain at least partly open minded on any of our views since the rational process that we have gone through on any issue might be flawed in that we might have left something out.\n\n \n I think there comes a point where it's practically an exercise in wasting time. The flat-earth thing, again. I'm sorry, but there really is no point in giving that the time of day.\n \n I also think part of the problem is that you're applying empirical standards to things that aren't empirical questions, to begin with. The existence of God, for instance, isn't in the realm of the provable/disprovable. It's not a scientific question, IMO.\n \n \nThat is why we must always be open to rational debate. This is true for all of us - those who are strongly religious, moderately religious, agnostics, or atheists. We are all imperfect in our reasoning skills so our views should never be COMPLETELY final but open to new rational arguements (as opposed to irrational arguements that it makes sense to ignore). \n\n \n I do think I need to point out that you're moving your goalposts here. We've gone from questioning to being open to rational debate. I think everyone questions, and I think everyone thinks they are being rational. And that's largely my point. You say you think people need to be open to rational debate ... but by who's standards for what's rational?\n \n \nI don't know of many people who resent those who hold strongly religious views but who don't impose those strongly religious views on others.\n\n \n I was wondering how long it would take before the \"imposing\" thing came up. Again, I think you're moving the goalposts. Of course people shouldn't \"impose\" on others, for religious reasons or otherwise. You're talking to a libertarian for the most part, so you're not going to get any argument from me about people imposing. But I'm encouraged in this discussion by the fact you're now focusing on 'imposing' rather than just religious belief.", 
   {}, 
   365728, 
   null, 
   1251771540.0
  ], 
  [
   367733, 
   null, 
   "jyoshu", 
   "To be honest, I prefer to think of this more as a discussion than as a debate.\n\n \n Same here. It seems someone here must seriously have a need to go and get them some prize-fight tickets. This isn't an 'out-to-win discussion from either of us in that I think we're both simply trying to have a conversation. I appreciate your discussion.", 
   {}, 
   367416, 
   null, 
   1251772080.0
  ], 
  [
   368075, 
   null, 
   "Another opinion", 
   "I hope so, too. But frankly, given his history here (and possibly a belated realization on his part that his stance is insupportable), I wouldn't hold my breath.\n \n \"Those who invalidate reason ought seriously to consider whether they argue against reason with or without reason; if with reason, then they establish the principles that they are laboring to dethrone: but if they argue without reason (which, in order to be consistent with themselves they must do), they are out of reach of rational conviction, nor do they deserve a rational argument.\"--Ethan Allen, \"Reason, the Only Oracle of Man\"\n\n You see, people can surprise you in a positive way. \n \n I think that the hyped up rhethoric between the two sides often leads to mistrust. When discussions so often degenerate into flames, it is understandable that people will be wary of those with opposing views. However, I have often enough found that, if ones goal is to have a calm, respectful, rational discussion and one approaches a debater of opposing views with that attitude (not a disrespectful one), then most people of opposing views will soon recognize that and join in on a much better discussion than one would have had otherwise.\n \n I don't know of the details of your previous experiences with jyoshu, but my guess is that he was probably being flamed (not necessarily by you but by others) in those discussions and that that may have led to mutual flaming, or at least hesitancy in engaging in full debate. I have had good discussions with jyoshu in the past so I was optimistic in approaching this discussion that it would turn out to be a fruitful one. That cannot be said of all debaters. One just has to judge case by case.\n \nSame here. It seems someone here must seriously have a need to go and get them some prize-fight tickets. This isn't an 'out-to-win discussion from either of us in that I think we're both simply trying to have a conversation. I appreciate your discussion.\n\n As I mentioned to MrWriteLA, I think that the flaming that so often goes on between the two sides leads to mistrust. This mistrust works both ways. More people need to recognize that the tone of a discussion can make a world of difference in how it is conducted so that, instead of a debate full of flaming, one can have a real discussion. Though I have encountered some people who were just a misery to debate, I have had many good discussions with people of different world views because I do have respect for a wide range of views, whether or not I agree with them. Even on those occasions when I find it hard to respect an opponents view, I have found that nothing good gets accomplished by showing that disrespect (though it can be awfully tempting at times). Disrespect from either side is a sure killer of good discussions.", 
   {}, 
   367584, 
   null, 
   1251997440.0
  ], 
  [
   368100, 
   null, 
   "Another opinion", 
   "Well that's pretty much my point. I think the fact that generalization is nearly always wrong also shows us that there is no over-arching standard for reason, and that it's not really valid to only associate it wth good. Where do we get the standard that says Nazism is generally a bad thing? We get it simply because the Nazis did bad things--if they hadn't, Nazism wouldn't be associated thus.\n\n Reason must, by definition, include logic. Just because someone claims to be using reason in a discussion doesn't mean that they are using it well. For example, when an arguement is presented saying that ALL members of a group are bad just because some can be shown to be bad, that is an illogical statement. One would have to individually verify each and every member to be able to say that. That doesn't mean that we cannot make general conclusions about groups. Though the Nazis did some things that were good, the bad that they did far outweighed the good so, in general, one condemns that group - but one cannot condemn EVERYONE from that group or EVERYTHING that the Nazis did. Do you see the difference? The difference lies in the fact that our judgments are very rarely pure. Our heroes are almost never perfectly good, and our villains are almost never perfectly bad yet, nevertheless, we need to judge - so we judge by the balance of good and bad, not by absolutes. When people try to think in absolutes, it very often leads to injustice.\n \nThe idea that reason equates to good rather than possibly also bad is a form of the no-true-scottsman fallacy. What I'm trying to get you to tell me is ... why should we assume reason is to be equated to good and not potentially bad? From whence comes the idea that if something good happens, we should chalk it up to reason, but other things like religion may be NOT be thus? You base your idea of reason = good on nothing more solid than your opinion of what reason should constitute. And that's subjective, not objective. Unless, of course, you can adequately explain the objective basis for that view. \n \n I don't separate them so much as I think logic needs compassion. Moreso than the other way around. At least compassion is, well, compassion. Logic may tell us the solution to a math problem, but it can't FEEL for the plight of people. I can feasibly imagine a world of compassion without much logic. I cannot feasibly imagine a world of logic without much compassion. \n\n As I mentioned in a previous post, I think that moral reasoning includes at least three aspects:\n 1. value judgements\n 2. logic\n 3. a full understaning of the facts underlying a moral judgment\n \n I agree that logic purely on its own can just as easily lead to bad moral rules as to good ones - depending on the value judgments underlying it. For example, if one takes a value judgment that the most important thing in a civilization is to improve on the wellbeing of all people, while respecting rights of minorities, then logic can largely lead to good moral rules. However, if one takes a value judgment that the most important thing in a civilization is to maximize the capabilities of the population, then one can find logic supporting things such as Eugenics - to kill off very underperforming parts of the population in support of improving the net result (from certain standards of judgment). So, from that point of view, logic in itself can be used for both bad and good.\n \n However, I would argue that people are not blank slates on which logic acts, since the sense of empathy is built in to most of us. That is why the Eugenics movement never took off from the minority that supported it and, in those groups such as Nazi Germany where there was an organized effort at implementing Eugenics, it was only partly implemented (since even Nazi officers occasionally had relatives who were very mentally deficient) and, also, had to be supported by strong propaganda campaigns to try to dull the population's sense of empathy.\n \n As long as a population's sense of empathy has not been dulled by something like the horrors of war, then fully engaging in logic will far more often work toward good than toward ill. I don't think that you really recognize this and that, therefore, you don't give logic enough credit.\n \n Appeals for compassion, pretty much by definition, are appeals to that sense of empathy. I think that appeals for compassion can be useful in many situations - especially when there aren't large obstacles to people feeling that compassion (ex. hatred for a group that killed ones family). However, when there are large enough obstacles to compassion, then appeals for compassion are far more effective if coupled with logic.\n \nRe. your point about propaganda ... I agree that's a good ideal role for 'logic', although if logic ALONE was employed, I'm not sure it could do any more than say whether something is truly correct or incorrect. Remember, propaganda isn't automatically a falsehood simply on the basis of being propaganda. (There's nothing in its definition that requires the word to refer to something false.) So that's only valuable, IMO, in the case of false propaganda (that can be logically disproven). I think propaganda is often subjective, and therefore by nature difficult to disprove, to begin with. That's exactly WHY it's propagandist--people who create propaganda naturally aren't going to create something that logic can just shoot down. It's usually stuff that's not really 'disprovable' to begin with--you know, 'beat-your-wife' type allegations.\n\n Yes, propaganda can often be subjective but, in my experience of viewing it, most of the propaganda that leads to evil or nasty acts is either blatantly false, a great exaggeration of reality, or a distortion of reality. Again, look at the examples I mentioned in a previous post: \"from the Nazi propaganda against the Jews, to the Hutus propaganda against the Tutsis, to propaganda that is always used in times of war to vilify the enemy (not just individuals in the enemy but all members of the enemy), to the propaganda about the savageness of Native Americans that was used to justify their mass slaughter, to propaganda about the abilities of people of African origin that was used to justify slavery\". These were all examples of propaganda that was based on exaggerations or distortions of reality in that they often generalized bad characteristics that might have been true of some in their vilified group, but not all. Or, as in the case of Native Americans, they might have also failed to present the fact that most violence against white settlers that was being carried out by Native Americans at the time was due to those white settlers stealing their land. Do you claim that any of those examples of propaganda can be fully justified in logic?\n \nIt strikes me that we seem to see this differently--I think you may be taking more of a glass-half-empty approach here in arguing these examples as cases of not-showing-compassion, when I'd say they both do show them, and therefore see it as a glass-half-full perspective. In my experience, both sides do tend to be compassionate. They just have different areas of focus. (choice versus life) Which may be another way of saying what you're saying, so I don't say this in disagreement necessarily. However, the allegation that many on the pro-life side or pro-choice side don't show compassion sounds exactly like the sort of thing that comes from propaganda--the very thing you've talked at great length about here. I have no interest in debating abortion here, but I tend to think it's a little unfair when people argue that either side isn't being compassionate. It's sort of like saying that anti-death penalty advocates aren't being compassionate toward crime-victims'-families.\n\n I agree that, for many people, the choice of pro-life or pro-choice is not a one sided choice where they feel compassion for the fetus but not the woman, or vice versa. For them, it is a balance between those considerations that lead them to prefer the pro-life or pro-choice stand. I just find that many people on the extremes of the debate (which often end up being overly represented in forums such as this), rarely if ever display any sense of compassion for women with unwanted pregnancies (pro-life), or fetuses (pro-choice). I agree that most probably do look at a balance. However, you would have to agree that there are some people who do look at a moral situation in purely black and white terms - in absolutes of good and bad - so not everyone has as balanced an outlook as you would like to portray.\n \nI have not argued at ALL that compassion should be the answer without logic. I think I've made clear, multiple times, that both are necessary. The thing is here, that proponents of \"logic\" and \"reason\" tend to think that there's some SET standard to those concepts or the way they are applied. As if those standards don't vary from person to person. As if there's some over-arching standard there. There's not. We accept, I think, that compassion is subjective. But people throw around terms like \"reason\", with their Jefferson quotes (often without qualification) and what not, as if that too is not nebulous and inconcrete. Has logic really done anything to resolve the abortion issue? I don't think so--the abortion controversy is as alive as ever. Every side thinks logic is theirs. Every side thinks theirs is the logical approach. Such controversies as abortion tend to be unsolvable by compassion OR logic, but for sure whatever side one takes, they naturally think both is on their side! So my point is that logic is really subjective TOO, because there's no overarching standard for how logic can apply in situations like these. It's easy to say we should apply logic to something like abortion, but it gets much more sticky in society coming to consensus on what that means. Why? Because not everyone applies logic the same way.\n\n Lets differentiate between logic and reasoning. Logic is a set of rules of thought and existence. The rules of logic represent a method of thinking in a structured way that helps avoid false conclusions. However, logical reasoning nearly always starts with some initial assumptions that are not necessarily based on logic but are based on value judgements, world view, etc. That is where different reasoning leads to different conclusions. An analogy can be a house of cards. Logic is the equivalent of the way one constructs a house of cards from a given base, based on the rules of gravity. The base represents the various assumptions and value judgements one starts with. Different value judgments and assumptions (base) lead to different reasoned conclusions (the house of cards) which can often all be equally valid. However, one has to be very careful that the base on which one builds that house of cards is valid. Otherwise, the whole arguement can fall apart like an unstable house of cards. For example, the Nazis built their logical arguements on the false premise of the superiority of everyone of the Arian race over everyone of other races. Their logical house of cards could easily be toppled by pointing out the inaccuracy of the assumption of racial superiority that their logic was built on.\n \n So, my main point is that logic itself is just a tool of thinking but that reasoning contains more than just logic. It contains value judgements and assumptions where, often times, bad reasoning results from initial assumptions that can be proven false. However, in situations where initial assumptions can all be verified as true, justifiable differences in well implemented, logical reasoning can result from different value judgements. That is why I agree that reasoning doesn't all lead to the same conclusions. Nevertheless, though reason is not absolute, that doesn't mean that its conclusions aren't limited in scope or structure since they must be limited by logic and by the validity of initial assumptions.\n \nSo? In cases where such a debate pertained to harmful behavior, I would find the point pertinent, but that's not the case with most religious belief. I also think that often tends to happen because they see little point in carrying on. There comes a point in such debates where it becomes clear that neither side is going to budge--the issues get boiled down to the levels that people can't retreat from. And frankly, I suspect religious people just tend to less feel the need to question in the first place. Unless it can be shown a belief is truly harmful, there's little need to question it. And I think anyone is pretty hard pressed to show where most religious belief is truly harmful.\n \n Then it seems to me what should be opposed or debated is whether or not one should use religion for harm from a position of power, not religion in and of itself. Like most anything, there's ideology, and then there's harmful ideology. It's the harmful that should be questioned.\n \n\n I would agree that, as long as a belief remains harmless, then there is no need for a sense of responsibility for someone of religious or any other belief to justify themselves to others. \n \n The devil is in the details, though, and I know you will accuse me of moving the goalpost but I would say that there are some beliefs that are viewed as harmful by those of other worldviews when those beliefs are imposed on others through law. No, I am not saying that all religious people try to impose their views on others and I am also not saying that, from those that do, they try to impose all their religious views. I am just saying that some (a non-insignificant minority) do try to impose certain moral beliefs on others and, when they do, they should be obligated to fully support those views. That is true for non-religious people as well. If they want to impose their views on others, they need to be able to fully support them.\n \n That being said, I will again agree that many, even possibly most, religious people are not trying to impose their views on others so their participation in debates about their views should not be held as mandatory.\n \nI also think part of the problem is that you're applying empirical standards to things that aren't empirical questions, to begin with. The existence of God, for instance, isn't in the realm of the provable/disprovable. It's not a scientific question, IMO.\n\n I think that there are two issues here to address:\n (1) Does God exist? I agree that this cannot be answered either way by Science. There is no way to disprove the existence of any form of supernatural, as one can never prove a negative.\n \n (2) Does God exist in a specific way that is defined by a particular religion, which includes specifics in His role in creating the world, directly acting in human affairs, etc.? There, Science can have much more of a say since it can directly challenge those specifics - ex. how the earth came to be.\n \n There is a lot of room for spiritual beliefs that are not directly disproven by Science. I personally tend to fluctuate between agnosticism and some version of Christianity. I suppose that, when I do occasionally try to hold on to some spiritual beliefs myself, I do try to fit them within these not-falsified regions of scientific knowledge. For example, I have full trust in the theory of Evolution so I do not view God as having created Man, at least not in a direct way. However, one would be hardpressed to scientifically disprove the existence of a personal God that does not act on a grand scale but only on a personal scale to help us in our lives - influencing our directions.", 
   {}, 
   367729, 
   null, 
   1252012620.0
  ], 
  [
   368682, 
   null, 
   "jyoshu", 
   "I think, in large part, it's apparent we tend to agree on a lot of this. So for the sake of brevity I'll focus on areas where we at least have different focus (and possibly some disagreement) rather than rehash conversation where we don't ....\n \n \nI think that there are two issues here to address:\n (1) Does God exist? I agree that this cannot be answered either way by Science. There is no way to disprove the existence of any form of supernatural, as one can never prove a negative.\n\n \n Agreed, and as I said, it's an issue that's not in the real of the empirical to begin with.\n \n \nLets differentiate between logic and reasoning. Logic is a set of rules of thought and existence. The rules of logic represent a method of thinking in a structured way that helps avoid false conclusions. However, logical reasoning nearly always starts with some initial assumptions that are not necessarily based on logic but are based on value judgements, world view, etc. That is where different reasoning leads to different conclusions. An analogy can be a house of cards. Logic is the equivalent of the way one constructs a house of cards from a given base, based on the rules of gravity. The base represents the various assumptions and value judgements one starts with. Different value judgments and assumptions (base) lead to different reasoned conclusions (the house of cards) which can often all be equally valid. However, one has to be very careful that the base on which one builds that house of cards is valid. Otherwise, the whole arguement can fall apart like an unstable house of cards. For example, the Nazis built their logical arguements on the false premise of the superiority of everyone of the Arian race over everyone of other races. Their logical house of cards could easily be toppled by pointing out the inaccuracy of the assumption of racial superiority that their logic was built on.\n\n \n But was that really logic? And if it was, does it not validate what I said about logic being something that is subjective in how it can be applied? Obviously they tooks some great liberties in how they applied logic. What I'd like you to show is what standard exists that shows they were wrong logically. I agree they were wrong, but IMO it was not a logical question to begin with. It's not like it was a 2+2=4 sort-of issue. I think it's a value-judgment sort-of issue. What over-arching standard of logic addresses this matter? And who set up that standard?\n \n \n(2) Does God exist in a specific way that is defined by a particular religion, which includes specifics in His role in creating the world, directly acting in human affairs, etc.? There, Science can have much more of a say since it can directly challenge those specifics - ex. how the earth came to be.\n\n \n How so? How can science disprove that the Christian God (for instance) is the right one? How can Christians prove it is? How can science disprove the Hindo gods are not valid, or how could a Hindu apologist prove they are?\n Frankly, I think it TOO is in the realm of the not-provable/not-disprovable. \n \n That there are multiple religions competing by claiming validity is irrelevant here--science can't prove one as invalid or valid. \n \n \nThere is a lot of room for spiritual beliefs that are not directly disproven by Science. I personally tend to fluctuate between agnosticism and some version of Christianity.\n\n \n I agree. (I guess I am deviating from my statement of focusing on areas of differing focus.) IMO the conflict thesis is certainly not a given--religion and science are not automatically juxataposed at all, depending on the area of belief.\n \n \nI suppose that, when I do occasionally try to hold on to some spiritual beliefs myself, I do try to fit them within these not-falsified regions of scientific knowledge. For example, I have full trust in the theory of Evolution so I do not view God as having created Man, at least not in a direct way.\n\n \n I myself lean to theistic evolution. Religion should not ignore the obvious when it comes to evidence in the natural world, after all. But most Bible adherents have no problem holding to the idea of a figurative interpretation when it comes to many passages in the Bible. I see no reason why the same cannot be applied to the creation account in Genesis. \n \n There is a LOT to this topic, and creationism exists in many forms, from young-earth-creationism to progressive-creationism, to theistic evolution. This topic could easily afford its own thread.", 
   {}, 
   368100, 
   null, 
   1252380540.0
  ], 
  [
   369010, 
   null, 
   "Another opinion", 
   "I think, in large part, it's apparent we tend to agree on a lot of this. So for the sake of brevity I'll focus on areas where we at least have different focus (and possibly some disagreement) rather than rehash conversation where we don't ....\n\n I'm fine with that...\n \nBut was that really logic? And if it was, does it not validate what I said about logic being something that is subjective in how it can be applied? Obviously they tooks some great liberties in how they applied logic. What I'd like you to show is what standard exists that shows they were wrong logically. I agree they were wrong, but IMO it was not a logical question to begin with. It's not like it was a 2+2=4 sort-of issue. I think it's a value-judgment sort-of issue. What over-arching standard of logic addresses this matter? And who set up that standard?\n\n As I said before, generalizing racial or group characteristics from anectodal examples to the whole of that group is logically wrong. One would have to analyze each and every member of that group to be able to logically make the statement that every member of that group meets that criteria. We know that the Nazis did not analyze each and every member of other races and their own race, so their claim that the Arian race is automatically superior (by the very standards that they listed of intelligence, athletic prowess, etc.) was not supportable. There are various rules of logic regarding statements one can make about groups (ex. if all A are B and all B are C, then all A are C. However, all C are not necessarily A, etc.....). These are rules of logic that are universal and can be shown and explained - usually graphically. The Nazis violated those specific rules of logic pertaining to groups by making their vast generalizations. If they had, instead, made claims about averages, not absolutes, then their position might have been far more supportable (though still would have had many vulnerabilities to other arguements). Also, if human groups were not as widely spread in capabilities as experience and testing has shown us, then they also might have been right (in that alternate fictional universe of purely homogenous groups of identical people). \n \n The bottom line is that the logical rule that they violated is the logical rule against generalizing from a small subset of a group to the whole group. What is it about this arguement that you specifically dispute? Do you claim that they did not violate that logical rule or that the logical rule that I mentioned is not an absolute (like 1 + 1 = 2)?\n \nHow so? How can science disprove that the Christian God (for instance) is the right one? How can Christians prove it is? How can science disprove the Hindo gods are not valid, or how could a Hindu apologist prove they are?\n Frankly, I think it TOO is in the realm of the not-provable/not-disprovable. \n \n That there are multiple religions competing by claiming validity is irrelevant here--science can't prove one as invalid or valid. \n\n You seem to be missing the point. I am not arguing that Science is here to prove or disprove one religion over another. I am saying that there are specific claims that many religions make - mainly about the creation of man and the world - that are directly countered by vast amounts of scientific evidence. So, in order to remain unchallenged by such scientific evidence, such religions would either have to drop those claims about the creation of man and the world (and other such claims that are opposed by strong scientific evidence) or alter them to fit within the gaps of science.\n \n Do you disagree that there are specific claims that many religions make (ex. that God created earth, the stars, man, etc. in seven literal days a few thousand years ago) that science cannot counter?\n \nI agree. (I guess I am deviating from my statement of focusing on areas of differing focus.) IMO the conflict thesis is certainly not a given--religion and science are not automatically juxataposed at all, depending on the area of belief.\n\n Yes, I agree that there are some areas of belief that science cannot directly counter / disprove and, therefore, religion and science are not in conflict in those areas. However, it sounds like you agree that there are also other areas where science does conflict with particular religious beliefs. Agreed?\n \nI myself lean to theistic evolution. Religion should not ignore the obvious when it comes to evidence in the natural world, after all. But most Bible adherents have no problem holding to the idea of a figurative interpretation when it comes to many passages in the Bible. I see no reason why the same cannot be applied to the creation account in Genesis. \n \n There is a LOT to this topic, and creationism exists in many forms, from young-earth-creationism to progressive-creationism, to theistic evolution. This topic could easily afford its own thread.\n\n In some ways, I would like to believe in theistic evolution. The things that bothers me about it, though, is how extremely inefficient it would be as an indirect means of creation. Also, divine intervention is not necessary for evolution to happen. So, though I occasionally entertain that belief, I more often tend to think that, if God exists, He did not create man and the universe. Why, after all, do we need to think that belief in divine creation is a requirement for religious belief?", 
   {}, 
   368682, 
   null, 
   1252598040.0
  ], 
  [
   371065, 
   null, 
   "jyoshu", 
   "There are various rules of logic regarding statements one can make about groups (ex. if all A are B and all B are C, then all A are C. However, all C are not necessarily A, etc.....). These are rules of logic that are universal and can be shown and explained - usually graphically. The Nazis violated those specific rules of logic pertaining to groups by making their vast generalizations.\n\n \n But logically--ONLY logically--one could indeed say that someone who has no handicap is more useful to society in terms of work and being able to actively contribute than someone who is, say, unable to walk, or someone who is 'special needs'. (And in fact, these were examples of people that the Nazis killed.) So logic alone can indeed be dangerous, in fact. But I can agree that it would be useful in terms of simply helping determine something to be factually false or not, as your propaganda example shows.\n \n \nThe bottom line is that the logical rule that they violated is the logical rule against generalizing from a small subset of a group to the whole group. What is it about this arguement that you specifically dispute? Do you claim that they did not violate that logical rule or that the logical rule that I mentioned is not an absolute (like 1 + 1 = 2)?\n\n \n I don't dispute that. My main point was simply to argue that logic alone is insufficient in terms of morality. In fact, it could be a dangerous thing to not add comapssion into it's equation. My impression of our discussion at this point is that you agree with that for the most part.\n \n Again, a lot of this comes down to emphasis. \"Rationalists\" may feel that logic should be championed. \"Religionists\" may feel that ideology should be what's championed. To some extent both probably employ some of both, but each feels their emphasis between the two is the more needed. Maybe you and I both hold to more of a balanced view.\n \n \nYou seem to be missing the point. I am not arguing that Science is here to prove or disprove one religion over another. I am saying that there are specific claims that many religions make - mainly about the creation of man and the world - that are directly countered by vast amounts of scientific evidence.\n\n \n I think that's only the case when religious belief steps into the realm of the empirically quantifiable. When the church resisted the directly empirical evidence that disproved the Ptolemaic universe, it was messing around in a realm that wasn't that of religion, and that was the problem. But many religious issues aren't in that realm. It's a different sort of question as to whether God exists or not, or if people should forgive their enemies, or even if there's an afterlife. These aren't in the realm of the provable/disprovable to begin with.\n \n \nDo you disagree that there are specific claims that many religions make (ex. that God created earth, the stars, man, etc. in seven literal days a few thousand years ago) that science cannot counter?\n\n \n Young Earth Creationism. \n Of course I don't disagree it exists as a view. \n \n \nHowever, it sounds like you agree that there are also other areas where science does conflict with particular religious beliefs. Agreed?\n\n \n Again, only when it pertains to issues that one crosses into the other's realm.\n \n \nIn some ways, I would like to believe in theistic evolution. The things that bothers me about it, though, is how extremely inefficient it would be as an indirect means of creation.\n\n \n But if we take that view about divine action, we could say that about pretty much anything that doesn't involve some sort of instantaneous-finger-snapping action. The same sort of argument is sometimes made against religion pertaining to the concept of atonement and sinful action. ('Why would God have let us sin in the first place?') But without it, people wouldn't have freedom of choice, and we'd all be automatons. \n \"Efficiency\" seems to me to be a rather relative concept. Life coming about in the relatively short and quick time span of some millions of years on a canvas of billions of years seems pretty efficient to me.\n \n In the end, when evidence shows that life took that long to come to where it is, then that's what it shows. So clearly, God DID take that long to do it. If one believes in God, and one acknowledges that evolution is reality, then theistic evolution is really the only possibility. It seems to me it's pretty cut and dried.\n \n Logic, as you say. :)\n \n \nAlso, divine intervention is not necessary for evolution to happen.\n\n \n How could you possibly know that? You're making an emphatic philosophical statement there, not a scientific one.", 
   {}, 
   369010, 
   null, 
   1253663340.0
  ], 
  [
   371416, 
   null, 
   "Another opinion", 
   "But logically--ONLY logically--one could indeed say that someone who has no handicap is more useful to society in terms of work and being able to actively contribute than someone who is, say, unable to walk, or someone who is 'special needs'. (And in fact, these were examples of people that the Nazis killed.) So logic alone can indeed be dangerous, in fact. But I can agree that it would be useful in terms of simply helping determine something to be factually false or not, as your propaganda example shows.\n\n Yes and no. I would agree that logical reasoning would lead to the conclusion that, on average, someone who has no handicap is more useful to society in terms of work and being able to actively contribute than someone who is unable to walk or someone who is 'special needs'. However, human beings vary so widely that variations within groups are usually much wider than variations between groups. This is a point that is clear when one does logical analysis. In this case, in analysing such variation, one could point to countless examples of people with handicaps that were very useful on a world-class level scale - from handicapped artists like Stevie Wonder and Itzhak Perlman, to handicapped scientists such as Stephen Hawkings - and compare that to countless examples of perfectly healthy and sufficiently intelligent but lazy people who are very unproductive (which words make me feel a bit guilty for writing this during working hours...). As for the \"special needs\" people, granted, I can think of no example of ones that were gifted on a world-class level scale but there are large numbers of special needs people who do fairly menial jobs much better than many perfectly healthy and mentally competent people - mainly because they do these jobs with more enthusiasm. \n \n However, that being said, as I mentioned in a previous post, I agree with the overall point that logic, when used to support certain heartless value judgements, can indeed bypass any sense of compassion all together and, thus, can be instrumental in leading to rules and actions that most people would consider bad. In the case of your example, I would agree that, once you get low enough on the mental deficiency scale, then there is nothing useful that an extremely mentally deficient person could do and then he is kept alive purely out of a sense of charity and compassion that would not exist if such compassion was not stressed.\n \nI don't dispute that. My main point was simply to argue that logic alone is insufficient in terms of morality. In fact, it could be a dangerous thing to not add comapssion into it's equation. My impression of our discussion at this point is that you agree with that for the most part.\n \n Again, a lot of this comes down to emphasis. \"Rationalists\" may feel that logic should be championed. \"Religionists\" may feel that ideology should be what's championed. To some extent both probably employ some of both, but each feels their emphasis between the two is the more needed. Maybe you and I both hold to more of a balanced view.\n\n Here, I would like to step back and bring up a differentiation that I touched upon indirectly but should expound upon more directly. Namely, when speaking about how one should address moral issues, I would note that people are not blank slates on which moral rules or moral arguements work. Nearly everyone has some inherent levels of capability in both logic and empathy built in. How much they use these capabilities depend on the situation they are in (ex. comfortable position in a prosperous society vs survival-mode in a war-zone; expectations of the use of logic taught them through education, their upbringing, peer pressure, etc.) Any new moral arguement that is brought up has to take this biological and psychological background into account. I would claim that it is this background, of the audience to which one addresses the moral arguement, that determines how much one stresses logic vs. compassion. To me, the bottom line in how much one stresses each aspect (compassion or logic) depends on how much each aspect is deficient in the audience to which one addresses ones moral arguement. For example, to those who might espouse a purely utilitarian view that supports Eugenics, one might stress compassion coupled with arguements such as \"how would you like to be treated if you had a brain injury that caused you to be greatly mentally deficient\" - i.e. arguements of empathy. For other groups that acknowledge need for compassion but are illogical in how they apply that compassion (which many would accuse certain religious groups of doing), then it is important to stress logic. Before going farther in this arguement, would you agree with it?\n \nI think that's only the case when religious belief steps into the realm of the empirically quantifiable. When the church resisted the directly empirical evidence that disproved the Ptolemaic universe, it was messing around in a realm that wasn't that of religion, and that was the problem. But many religious issues aren't in that realm. It's a different sort of question as to whether God exists or not, or if people should forgive their enemies, or even if there's an afterlife. These aren't in the realm of the provable/disprovable to begin with.\n ...\n Again, only when it pertains to issues that one crosses into the other's realm.\n\n Yes, but I get the impression that you underestimate how much religion does cross into the realm of science and the empircally quantifiable - especially the more fundamentalist religions. I will grant that there are general trends in religion away from dogmatic beliefs to more open spiritual beliefs - where I would recommend Harvey Cox's new book \"The Future of Faith\" that addresses these trends. However, in the last couple of decades, the religious views that are most prominent in the news and in the halls of power are those religious views that are more dogmatic and that certainly intrude on the empirically quanitifiable due to their insistence on literal interpretations of their religious texts. I hope that there is indeed a real trend away from such dogmatic views.\n \nBut if we take that view about divine action, we could say that about pretty much anything that doesn't involve some sort of instantaneous-finger-snapping action. The same sort of argument is sometimes made against religion pertaining to the concept of atonement and sinful action. ('Why would God have let us sin in the first place?') But without it, people wouldn't have freedom of choice, and we'd all be automatons. \n \"Efficiency\" seems to me to be a rather relative concept. Life coming about in the relatively short and quick time span of some millions of years on a canvas of billions of years seems pretty efficient to me.\n \n In the end, when evidence shows that life took that long to come to where it is, then that's what it shows. So clearly, God DID take that long to do it. If one believes in God, and one acknowledges that evolution is reality, then theistic evolution is really the only possibility. It seems to me it's pretty cut and dried.\n \n Logic, as you say. :)\n\n Well, first, it may be logic but it is logic built on an assumption that you might not even realize that you are making and that I touched upon in my last post. Namely, you seem to be making the assumption that belief in God requires a belief that God created man and the universe. I would contest that assumption.\n \n As for efficiency, life first started on this planet over 3.5 BILLION years ago - where, for the great majority of that time, life consisted only of single celled organisms. I would consider that quite inefficient. All God would have had to do is to introduce DNA for multi-celled organisms earlier on to greatly speed up the process of Evolution. What would have been gained by non-interference in such a slow process?\n -----On edit------\n In further thinking about this issue, the possibility occured to me that one could have a belief in God being only partially involved in Creation - so that it is not a choice of existence being completely independent of God or completely dependent on Him, but a middle path in between. For example, one could hold a belief that the Big Bang, the development of galaxies, stars and planets, abiogenesis, and the earliest stages of Evolution were all done purely by natural laws, but that God inserted influence part-way into natural Evolution to help re-direct its paths. This essential idea was touched upon in Arthur C. Clark's \"Space Odyssey 2001\" series of books and movies with the rectangular monolith representing a sort of divine redirection of the paths of evolution. Anyway, that is another interesting direction of belief that people rarely contemplate.\n ------------------\n \nHow could you possibly know that? You're making an emphatic philosophical statement there, not a scientific one.\n\n Yes, I would agree that, to be scientifically accurate, I should not phrase my statements in such absolute terms. Instead, I will re-phrase to state that, so far, science has shown various plausible purely natural theories describing all the stages of Evolution - as well as various plausible but still unverifiable purely-natural theories explaining the original stages of abiogenesis from organic compounds. So, all stages that span from non-life to complex life can be explained by purely natural theories - with various levels of support in evidence. This does not prove that God did not play a role in Evolution and Abiogenesis but does show that there is as yet no reason to think that such a role was necessary and, indeed, the scientific evidence and theories so far support the idea that it was not necessary. Again, one can try to fit God's role in the cracks of science in trying to add a role for God in those steps in the process of life where evidence is very limited (ex. in the original abiogenesis). However, that gets back to the issue of efficiency. If the inefficiency of such an involvment does not bother you, then by all means hold onto that belief. It bothers me enough that I most often cannot hold onto such a religious view and doubt that God, if He exists, created man and the universe.", 
   {}, 
   371065, 
   null, 
   1253827860.0
  ], 
  [
   371863, 
   null, 
   "jyoshu", 
   "Here, I would like to step back and bring up a differentiation that I touched upon indirectly but should expound upon more directly. Namely, when speaking about how one should address moral issues, I would note that people are not blank slates on which moral rules or moral arguements work. Nearly everyone has some inherent levels of capability in both logic and empathy built in. How much they use these capabilities depend on the situation they are in (ex. comfortable position in a prosperous society vs survival-mode in a war-zone; expectations of the use of logic taught them through education, their upbringing, peer pressure, etc.) Any new moral arguement that is brought up has to take this biological and psychological background into account. I would claim that it is this background, of the audience to which one addresses the moral arguement, that determines how much one stresses logic vs. compassion. To me, the bottom line in how much one stresses each aspect (compassion or logic) depends on how much each aspect is deficient in the audience to which one addresses ones moral argument. For example, to those who might espouse a purely utilitarian view that supports Eugenics, one might stress compassion coupled with arguements such as \"how would you like to be treated if you had a brain injury that caused you to be greatly mentally deficient\" - i.e. arguements of empathy. For other groups that acknowledge need for compassion but are illogical in how they apply that compassion (which many would accuse certain religious groups of doing), then it is important to stress logic. Before going farther in this arguement, would you agree with it?\n\n \n At the risk of over-simplifying what you're saying, are you basically trying to point out that compassion is relevant, depending on the background and circumstances? I think there are some overarching moralistic standards that probably cross most if not any sociological boundary--for example, there has to be some sense of compassion in any culture to avoid murder and to help the helpless. Even the Nazis cared for their own children at least. \n More importantly how is the relativistic nature of compassion all that relevant? The standards are there, and IMO logic can't really settle those issues. It can perhaps help determine their value which I realize is some of what you've been arguing. I think you've brought up a good point in the value of logic. I just think it can only do so much. We don't seem to be in that much disagreement over this, frankly.\n \n \nYes, but I get the impression that you underestimate how much religion does cross into the realm of science and the empircally quantifiable - especially the more fundamentalist religions. I will grant that there are general trends in religion away from dogmatic beliefs to more open spiritual beliefs - where I would recommend Harvey Cox's new book \"The Future of Faith\" that addresses these trends. However, in the last couple of decades, the religious views that are most prominent in the news and in the halls of power are those religious views that are more dogmatic and that certainly intrude on the empirically quanitifiable\n\n \n Here I have to disagree and say that I think fundamentalism has always been there, and in the past was simply considered mainstream rather than \"fundamentalist\". The values espoused by what would (today) be called the religious right have been around far longer than the Religious Right. In fact, in some ways they were MORE prevalent in government in the past than todayn and so the trend has actually been the OTHER way. Can you imagine, for example, a movement today to add religious language to the pledge of allegiance? It would cause such an uproar by critics of religion that it wouldn't stand a chance! It would be an impossbility NOWadays. Or imprinting acknowledgment of theism on monetary currency when it wasn't there to begin with? These are very overt examples of religion intruding into the public sphere, but they weren't frowned upon at the time. They were accepted. If such changes were attempted today? No way.\n \n Which direction has the creation/evolution controversy gone? 50 years ago, the acceptance of evolution wasn't nearly as prevalent as it is today. Even 20 years ago.\n \n I could go on into areas that have heavier implications ...\n \n Anti-sodomy laws (which we could easily say would have been created out of religion's influence) were MORE prevalent in the past, not less. I'd say the last couple of decades have moved away from the values of fundamentalist religion in terms of government and policy--IMO the evidence for that is clear. Abortion was illegal throughout most of the US in much of the 20th century in state laws, up until 1973 when that TOO changed. So if it's true that the most prominent religious groups in power are fundamentalist, they certainly aren't being very effective. I suspect this is because religion usually isn't as out to control things as those who are against them sometimes make them out to be. \n \n And I think that really gets to a point I want to make: that our system largely protects itself from too much religious influence, in that it leaves open the option of opposing movements to work as well. While the religious right became well-known in the 1980s, it wasn't long before other movements counter-balanced it. And so I think there's a little too much paranoia out there over fundamentalism having too much power, in the U.S. anyway. Clearly we see it wielding less and less power over the past 50 years, to where any paranoia over it is largely misplaced IMO. \n \n Where I think you are spot on though, is in saying that fundamentalists are often in the news. But that is not due to media bias or due to there being more fundamentalists than mainstream religious people--rather it's because what is outside the mainstream simply tends to be what makes the news. If someone is acting outlandishly, naturally it's going ot make the news before someone who acting rather normally. It draws attention. And so I think people who are against conservative religion tend to think fundamentalism is a lot more widespread than it really is. They assume that because they see it more, because, well, it's what makes the news. \n \n \nWell, first, it may be logic but it is logic built on an assumption that you might not even realize that you are making and that I touched upon in my last post. Namely, you seem to be making the assumption that belief in God requires a belief that God created man and the universe. I would contest that assumption.\n\n \n Really?? It seems to me that one can't really have a concept of GOD in any meaningful sense without it being creator or at least a first cause of some sort. \n If the universe is outside of its control (whether voluntarily or involuntarily) then it is either a.) an impotent GOD, or b.) an apathetic GOD. It seems to me neither scenario fits. I think that when we view how creation took place, we're observing, basically, how it took place. Just because it happened differently than how traditional religion says it took place doesn't mean God wasn't in the event. We can observe someone's sprinkler coming on to water their lawn, yet we may have seen no one actually walking around the lawn or doing anything with the sprinklerhead. Should we assume there was no one who either a.) directly turned it on, or b.) at least set it to where it would come on? To take a third option and assume no intervention or cause took place becomes the LEAST plausible possibility. It seems to me the same approach can be taken with the 'beginning' of the universe ....\n \n \nAs for efficiency, life first started on this planet over 3.5 BILLION years ago\n\n \n You are correct; my mistake.\n \n \n - where, for the great majority of that time, life consisted only of single celled organisms. I would consider that quite inefficient. All God would have had to do is to introduce DNA for multi-celled organisms earlier on to greatly speed up the process of Evolution. What would have been gained by non-interference in such a slow process?\n\n \n Or even more efficiently: just snap his fingers and make it all appear. (And of course, that's almost what traditional religion thought for a long time.) So again, one could say that anything other than instantaneous action would be 'inefficient'. Religion doesn't seem to have any problem whatsoever with the idea that God doesn't do everything instantly. We have to reconcile what we observe in nature with belief in God, and I really don't think religion has so much a problem with this as does science, to be honest. My experience is that religious people generally accept the the way nature operates--they can see what happens. They can observe, for instance, the effect of changes in air pressure and therefore wind. Could God (if he is so powerful) have made wind-germinating plants just 'magically' germinate rather than using the wind to do it? I suppose, but to me the whole concept gets a little silly there. The process we observe clearly IS what was put in place. I see no reason to assume that God would have wanted a world that things don't sometimes take some time. This may sound trite, but maybe it (GOD) simply likes to take his time with things. I just don't see a problem there.\n \n One other thing before I end this post, I'd like to quickly address abiogenesis, which you brought up.\n \n There are scientific theories that have been tested and for which there is much evidence, and then there are theories which are more in the conjecture realm. Abiogenesis in the sense of how life somehow appeared is, to my understanding, still a relatively conjecturous area. Certainly, there is not consensus on how that took place specifically--some will speculate organic compounds came from space, others will speculate they did not, for instance. That's not a bad thing, but I do think we need to be careful here and not put that in the same category as theories for which there is much evidence.", 
   {}, 
   371416, 
   null, 
   1254186780.0
  ], 
  [
   372041, 
   null, 
   "Another opinion", 
   "At the risk of over-simplifying what you're saying, are you basically trying to point out that compassion is relevant, depending on the background and circumstances? I think there are some overarching moralistic standards that probably cross most if not any sociological boundary--for example, there has to be some sense of compassion in any culture to avoid murder and to help the helpless. Even the Nazis cared for their own children at least. \n More importantly how is the relativistic nature of compassion all that relevant? The standards are there, and IMO logic can't really settle those issues. It can perhaps help determine their value which I realize is some of what you've been arguing. I think you've brought up a good point in the value of logic. I just think it can only do so much. We don't seem to be in that much disagreement over this, frankly.\n\n The message I was trying to convey was different than what you understood, so let me rephrase. First of all, I think that, by now, we both agree that both compassion and logic need to be included in any moral system. There are differences that can still arise in how one balances those two (ex. in how one treats criminals), but we both agree that both of these need to be incorporated in moral systems. \n \n What I was trying to address in my previous post was that people vary widely in how much logic and compassion they ALREADY incorporate in their personal moral systems, so that if they are to be convinced of a particular moral arguement, then their already existing outlooks need to be taken into account. In other words, people are not blank slates on which one pitches ones moral arguement. They already have pre-existing tendencies towards compassion and logic. When one pitches a moral arguement to someone, one therefore has to take this into account - i.e. know your audience. \n \n Therefore, if you are addressing someone who seems to lack logic in their moral view, you concentrate your arguements on logic. Conversely, if you are addressing someone who seems to lack compassion in their moral view, then you concentrate your arguements on compassion. If you are pitching your moral arguements to someone who has a limited grasp on both compassion and logic, then you stress both in your arguements. Agreed?\n \nHere I have to disagree and say that I think fundamentalism has always been there, and in the past was simply considered mainstream rather than \"fundamentalist\". The values espoused by what would (today) be called the religious right have been around far longer than the Religious Right. In fact, in some ways they were MORE prevalent in government in the past than todayn and so the trend has actually been the OTHER way. Can you imagine, for example, a movement today to add religious language to the pledge of allegiance? It would cause such an uproar by critics of religion that it wouldn't stand a chance! It would be an impossbility NOWadays. Or imprinting acknowledgment of theism on monetary currency when it wasn't there to begin with? These are very overt examples of religion intruding into the public sphere, but they weren't frowned upon at the time. They were accepted. If such changes were attempted today? No way.\n \n Which direction has the creation/evolution controversy gone? 50 years ago, the acceptance of evolution wasn't nearly as prevalent as it is today. Even 20 years ago.\n \n I could go on into areas that have heavier implications ...\n \n Anti-sodomy laws (which we could easily say would have been created out of religion's influence) were MORE prevalent in the past, not less. I'd say the last couple of decades have moved away from the values of fundamentalist religion in terms of government and policy--IMO the evidence for that is clear. Abortion was illegal throughout most of the US in much of the 20th century in state laws, up until 1973 when that TOO changed. So if it's true that the most prominent religious groups in power are fundamentalist, they certainly aren't being very effective. I suspect this is because religion usually isn't as out to control things as those who are against them sometimes make them out to be. \n \n And I think that really gets to a point I want to make: that our system largely protects itself from too much religious influence, in that it leaves open the option of opposing movements to work as well. While the religious right became well-known in the 1980s, it wasn't long before other movements counter-balanced it. And so I think there's a little too much paranoia out there over fundamentalism having too much power, in the U.S. anyway. Clearly we see it wielding less and less power over the past 50 years, to where any paranoia over it is largely misplaced IMO. \n \n Where I think you are spot on though, is in saying that fundamentalists are often in the news. But that is not due to media bias or due to there being more fundamentalists than mainstream religious people--rather it's because what is outside the mainstream simply tends to be what makes the news. If someone is acting outlandishly, naturally it's going ot make the news before someone who acting rather normally. It draws attention. And so I think people who are against conservative religion tend to think fundamentalism is a lot more widespread than it really is. They assume that because they see it more, because, well, it's what makes the news. \n\n I think it is a somewhat complicated picture. To some extent, you are right that fundamentalist views were more commonly accepted many decades ago (anti-sodomy laws, etc.) than today. This seems to largely be due to the fact that views that fundamentalists hold that were once commonly accepted are much less accepted today. Polls consistently show that the majority of Americans are more liberal in their social views (PollingReport.com being a good summary of polls) - views on gay marriage being a noteable exception to that trend. Indeed, on social issues, time and time again, it is around 30% of Americans (presumably representing the ~30% of Americans that are religious right) that are the ones that hold the conservative views in these polls. \n \n The Republican party count the religious right as their base so they speak up to many of these social issues in order to gain the votes of the religious right that they count on, being careful not to stray so far right that they alienate the centrists and independents. So, we do hear a lot of news about the views of the religious right, but not only because the media wants to sensationalize but also because the Republicans do give at minimum a lot of lip service to the religious right. \n \n When the left sees the political antics and distorted rhethoric that the Republicans have been up to since the 80s, then they see the religious right being behind it - something which is true but gives an admittedly misleading picture. The NeoConservatives did get into power because of the religious right, but ultimately their agenda was often more purely secularly right (lower taxes, smaller government, decreased regulation, decreased social services, etc.) than it was religiously conservative. The actual accomplishments that they had in this secularly right direction are far greater than they had in the religiously right direction. That is a distinction (religious right vs secular right) that I also admittedly too often mix up - mainly because it is generally the same people that hold both types of views. \n \n So, it is a complicated issue since it is ultimately secular right politics that have most negatively influenced the lives of moderates and liberals where the religious right politics has had few successes and has been more bluster than real threat while also being the conduit by which the secular right leaders get into power. The main complication in discussing this is that it is generally the same people who form both the religious right and the secular right, at least where the electorate is concerned.\n \nReally?? It seems to me that one can't really have a concept of GOD in any meaningful sense without it being creator or at least a first cause of some sort. \n If the universe is outside of its control (whether voluntarily or involuntarily) then it is either a.) an impotent GOD, or b.) an apathetic GOD. It seems to me neither scenario fits. I think that when we view how creation took place, we're observing, basically, how it took place. Just because it happened differently than how traditional religion says it took place doesn't mean God wasn't in the event. We can observe someone's sprinkler coming on to water their lawn, yet we may have seen no one actually walking around the lawn or doing anything with the sprinklerhead. Should we assume there was no one who either a.) directly turned it on, or b.) at least set it to where it would come on? To take a third option and assume no intervention or cause took place becomes the LEAST plausible possibility. It seems to me the same approach can be taken with the 'beginning' of the universe ....\n\n I think you are addressing a different issue here. I am not disputing the possibility that God might have played some role - direct or indirect - in bringing about man and the universe. I would say that the jury is still out on the final answer to that question since there are still enough gaps in science (ex. the very limited evidence surrounding abiogenesis) that this leaves room for religious beliefs in indirect creation (i.e. creation that also made use of the laws and processes of nature).\n \n However, the assumption of yours that I was challenging in the section that you quoted was not whether it is possible that God had a role in creation, but whether one can still consider a supernatural being as \"God\" if they did not play a role in creation. The history of religion has had many gods that had no role in creation - usually in polytheistic religions where some gods were involved in creation and others weren't. Why do you think that God also needs to be Creator to be considered God?\n \nOr even more efficiently: just snap his fingers and make it all appear. (And of course, that's almost what traditional religion thought for a long time.) So again, one could say that anything other than instantaneous action would be 'inefficient'. Religion doesn't seem to have any problem whatsoever with the idea that God doesn't do everything instantly. We have to reconcile what we observe in nature with belief in God, and I really don't think religion has so much a problem with this as does science, to be honest. My experience is that religious people generally accept the the way nature operates--they can see what happens. They can observe, for instance, the effect of changes in air pressure and therefore wind. Could God (if he is so powerful) have made wind-germinating plants just 'magically' germinate rather than using the wind to do it? I suppose, but to me the whole concept gets a little silly there. The process we observe clearly IS what was put in place. I see no reason to assume that God would have wanted a world that things don't sometimes take some time. This may sound trite, but maybe it (GOD) simply likes to take his time with things. I just don't see a problem there.\n \n One other thing before I end this post, I'd like to quickly address abiogenesis, which you brought up.\n \n There are scientific theories that have been tested and for which there is much evidence, and then there are theories which are more in the conjecture realm. Abiogenesis in the sense of how life somehow appeared is, to my understanding, still a relatively conjecturous area. Certainly, there is not consensus on how that took place specifically--some will speculate organic compounds came from space, others will speculate they did not, for instance. That's not a bad thing, but I do think we need to be careful here and not put that in the same category as theories for which there is much evidence.\n\n Yes, as I noted in an earlier post, there are cracks in science where there is very little evidence, as in abiogenesis, into which one can indeed make the leap of faith in God's role in creation without being able to be challenged by scientific evidence. We seem to differ in how we view the resulting lengths of time it would then take for God to indirectly create man. The inefficiencies of those lengths of time bother me but you hold a different view. I suppose we will just have to agree to disagree there since we simply have different views on what bothers us in belief.", 
   {}, 
   371863, 
   null, 
   1254350220.0
  ], 
  [
   376385, 
   null, 
   "ImYY4U", 
   "Reason must, by definition, include logic. Just because someone claims to be using reason in a discussion doesn't mean that they are using it well. For example, when an arguement is presented saying that ALL members of a group are bad just because some can be shown to be bad, that is an illogical statement. One would have to individually verify each and every member to be able to say that. That doesn't mean that we cannot make general conclusions about groups. Though the Nazis did some things that were good, the bad that they did far outweighed the good so, in general, one condemns that group - but one cannot condemn EVERYONE from that group or EVERYTHING that the Nazis did. Do you see the difference? The difference lies in the fact that our judgments are very rarely pure. Our heroes are almost never perfectly good, and our villains are almost never perfectly bad yet, nevertheless, we need to judge - so we judge by the balance of good and bad, not by absolutes. When people try to think in absolutes, it very often leads to injustice.\n \n As I mentioned in a previous post, I think that moral reasoning includes at least three aspects:\n 1. value judgements\n 2. logic\n 3. a full understaning of the facts underlying a moral judgment\n \n I agree that logic purely on its own can just as easily lead to bad moral rules as to good ones - depending on the value judgments underlying it. For example, if one takes a value judgment that the most important thing in a civilization is to improve on the wellbeing of all people, while respecting rights of minorities, then logic can largely lead to good moral rules. However, if one takes a value judgment that the most important thing in a civilization is to maximize the capabilities of the population, then one can find logic supporting things such as Eugenics - to kill off very underperforming parts of the population in support of improving the net result (from certain standards of judgment). So, from that point of view, logic in itself can be used for both bad and good.\n \n However, I would argue that people are not blank slates on which logic acts, since the sense of empathy is built in to most of us. That is why the Eugenics movement never took off from the minority that supported it and, in those groups such as Nazi Germany where there was an organized effort at implementing Eugenics, it was only partly implemented (since even Nazi officers occasionally had relatives who were very mentally deficient) and, also, had to be supported by strong propaganda campaigns to try to dull the population's sense of empathy.\n \n As long as a population's sense of empathy has not been dulled by something like the horrors of war, then fully engaging in logic will far more often work toward good than toward ill. I don't think that you really recognize this and that, therefore, you don't give logic enough credit.\n \n Appeals for compassion, pretty much by definition, are appeals to that sense of empathy. I think that appeals for compassion can be useful in many situations - especially when there aren't large obstacles to people feeling that compassion (ex. hatred for a group that killed ones family). However, when there are large enough obstacles to compassion, then appeals for compassion are far more effective if coupled with logic.\n \n Yes, propaganda can often be subjective but, in my experience of viewing it, most of the propaganda that leads to evil or nasty acts is either blatantly false, a great exaggeration of reality, or a distortion of reality. Again, look at the examples I mentioned in a previous post: \"from the Nazi propaganda against the Jews, to the Hutus propaganda against the Tutsis, to propaganda that is always used in times of war to vilify the enemy (not just individuals in the enemy but all members of the enemy), to the propaganda about the savageness of Native Americans that was used to justify their mass slaughter, to propaganda about the abilities of people of African origin that was used to justify slavery\". These were all examples of propaganda that was based on exaggerations or distortions of reality in that they often generalized bad characteristics that might have been true of some in their vilified group, but not all. Or, as in the case of Native Americans, they might have also failed to present the fact that most violence against white settlers that was being carried out by Native Americans at the time was due to those white settlers stealing their land. Do you claim that any of those examples of propaganda can be fully justified in logic?\n \n I agree that, for many people, the choice of pro-life or pro-choice is not a one sided choice where they feel compassion for the fetus but not the woman, or vice versa. For them, it is a balance between those considerations that lead them to prefer the pro-life or pro-choice stand. I just find that many people on the extremes of the debate (which often end up being overly represented in forums such as this), rarely if ever display any sense of compassion for women with unwanted pregnancies (pro-life), or fetuses (pro-choice). I agree that most probably do look at a balance. However, you would have to agree that there are some people who do look at a moral situation in purely black and white terms - in absolutes of good and bad - so not everyone has as balanced an outlook as you would like to portray.\n \n Lets differentiate between logic and reasoning. Logic is a set of rules of thought and existence. The rules of logic represent a method of thinking in a structured way that helps avoid false conclusions. However, logical reasoning nearly always starts with some initial assumptions that are not necessarily based on logic but are based on value judgements, world view, etc. That is where different reasoning leads to different conclusions. An analogy can be a house of cards. Logic is the equivalent of the way one constructs a house of cards from a given base, based on the rules of gravity. The base represents the various assumptions and value judgements one starts with. Different value judgments and assumptions (base) lead to different reasoned conclusions (the house of cards) which can often all be equally valid. However, one has to be very careful that the base on which one builds that house of cards is valid. Otherwise, the whole arguement can fall apart like an unstable house of cards. For example, the Nazis built their logical arguements on the false premise of the superiority of everyone of the Arian race over everyone of other races. Their logical house of cards could easily be toppled by pointing out the inaccuracy of the assumption of racial superiority that their logic was built on.\n \n So, my main point is that logic itself is just a tool of thinking but that reasoning contains more than just logic. It contains value judgements and assumptions where, often times, bad reasoning results from initial assumptions that can be proven false. However, in situations where initial assumptions can all be verified as true, justifiable differences in well implemented, logical reasoning can result from different value judgements. That is why I agree that reasoning doesn't all lead to the same conclusions. Nevertheless, though reason is not absolute, that doesn't mean that its conclusions aren't limited in scope or structure since they must be limited by logic and by the validity of initial assumptions.\n \n I would agree that, as long as a belief remains harmless, then there is no need for a sense of responsibility for someone of religious or any other belief to justify themselves to others. \n \n The devil is in the details, though, and I know you will accuse me of moving the goalpost but I would say that there are some beliefs that are viewed as harmful by those of other worldviews when those beliefs are imposed on others through law. No, I am not saying that all religious people try to impose their views on others and I am also not saying that, from those that do, they try to impose all their religious views. I am just saying that some (a non-insignificant minority) do try to impose certain moral beliefs on others and, when they do, they should be obligated to fully support those views. That is true for non-religious people as well. If they want to impose their views on others, they need to be able to fully support them.\n \n That being said, I will again agree that many, even possibly most, religious people are not trying to impose their views on others so their participation in debates about their views should not be held as mandatory.\n \n I think that there are two issues here to address:\n (1) Does God exist? I agree that this cannot be answered either way by Science. There is no way to disprove the existence of any form of supernatural, as one can never prove a negative.\n \n (2) Does God exist in a specific way that is defined by a particular religion, which includes specifics in His role in creating the world, directly acting in human affairs, etc.? There, Science can have much more of a say since it can directly challenge those specifics - ex. how the earth came to be.\n \n There is a lot of room for spiritual beliefs that are not directly disproven by Science. I personally tend to fluctuate between agnosticism and some version of Christianity. I suppose that, when I do occasionally try to hold on to some spiritual beliefs myself, I do try to fit them within these not-falsified regions of scientific knowledge. For example, I have full trust in the theory of Evolution so I do not view God as having created Man, at least not in a direct way. However, one would be hardpressed to scientifically disprove the existence of a personal God that does not act on a grand scale but only on a personal scale to help us in our lives - influencing our directions.\n\n \n When will this come out in paperback?", 
   {}, 
   368100, 
   null, 
   1257182340.0
  ], 
  [
   391396, 
   null, 
   "Freedom", 
   "I don't see how you could live with subjective morality. Logic is a tool for deriving knowledge with the correct premises it can conclude anything.\n \n Anyone who does not wish to seek an objective rational morality has only two possible motivations for not doing so (as it is the normal action for mentally healthy humans to seek the truth not convince one's self it doesn't exist except as far as you want it to); they do not want to live by the principles of that morality, or they want their emotion and whim to control those most important of judgements.", 
   {}, 
   367733, 
   null, 
   1266651060.0
  ], 
  [
   391591, 
   null, 
   "Another opinion", 
   "I don't see how you could live with subjective morality. Logic is a tool for deriving knowledge with the correct premises it can conclude anything.\n\n The key point in your statement is \"with the correct premises\". With issues of the physical workings of the universe, one can test whether a premise is correct and use a combination of observation (experiment) and logic to come to reasoned conclusions about a great many physical phenomenon. However, even then, even if the logic used is perfect, we are often constrained by practical limitations of our ability to observe. For example, we currently have very limited resources with which to examine the question of life on other planets. Either way, I would agree that, at least for physical traits of the universe, there is A \"truth\" that is out there that we may or may not understand or have access to observing and that, in general, Science has simply led us down a road that has gotten us closer and closer to that full truth - a very useful set of tools, even if we never completely get there.\n \n However, where morality is concerned, there is no reason to think that there is a single TRUTH out there that applies to everyone. That is because humans have a wide variety of psychological approaches to life and what is good for one is not good for another. For example, some people place the highest value on individual happiness. Others place high value on individual sacrifice for maximizing group happiness. Still others place the highest value on maximizing the capabilities, skills and knowledge of a population. These are all different goals that would lead to different moral and social approaches. Why is one approach automatically superior to another?\n \n I suspect that you think that, if a morality is not asolute then it is completely arbitrary. That is an illogical conclusion. Moral reasoning can be consistent and logical and still lead to different conclusions when one starts with different value judgements - as I had mentioned in the last paragraph.\n \n One thing that I do think is important, though, and I think that you agree with me here, is that one needs to truly include reasoning and logic in ones morality. Far too many people don't think through their moral stances - on both side of the secular / religious spectrum. Many people either don't think of the long-term consequences of their moral stances, don't realize that the same moral rules they apply would also have to be applied to themselves, don't recognize the unintended consequences of their moral stance, or simply don't think about morality at all. That is why moral discussions are so useful. Rational moral discussions, as long as they are followed through, greatly limit the range of moral stances that one can find out there. The greatest evils occur from moral approaches that can clearly be proven wrong through reason and logic - as with the Nazis illogical assumptions about the automatic superiority of the Arian race, or the Hutus (in Rwanda) assumptions about the automatic evil and inferior natures of the Tutsis.\n \n \nAnyone who does not wish to seek an objective rational morality has only two possible motivations for not doing so (as it is the normal action for mentally healthy humans to seek the truth not convince one's self it doesn't exist except as far as you want it to); they do not want to live by the principles of that morality, or they want their emotion and whim to control those most important of judgements.\n\n That is a proclamation that has no rational support in reality. If you think it does, then please explain how you came to those conclusions.", 
   {}, 
   391396, 
   null, 
   1266790020.0
  ], 
  [
   391593, 
   null, 
   "Freedom", 
   "The key point in your statement is \"with the correct premises\". With issues of the physical workings of the universe, one can test whether a premise is correct and use a combination of observation (experiment) and logic to come to reasoned conclusions about a great many physical phenomenon. However, even then, even if the logic used is perfect, we are often constrained by practical limitations of our ability to observe. For example, we currently have very limited resources with which to examine the question of life on other planets. Either way, I would agree that, at least for physical traits of the universe, there is A \"truth\" that is out there that we may or may not understand or have access to observing and that, in general, Science has simply led us down a road that has gotten us closer and closer to that full truth - a very useful set of tools, even if we never completely get there.\n\n Why would you think that concept disappears for any reason?\n \nHowever, where morality is concerned, there is no reason to think that there is a single TRUTH out there that applies to everyone.\n\n Then you have not thought about it.\n \n \nThat is because humans have a wide variety of psychological approaches to life and what is good for one is not good for another. For example, some people place the highest value on individual happiness. Others place high value on individual sacrifice for maximizing group happiness. Still others place the highest value on maximizing the capabilities, skills and knowledge of a population. These are all different goals that would lead to different moral and social approaches.\n\n No morality should be based on these goals.\n \nWhy is one approach automatically superior to another?\n\n The approach of freedom states that each man may approach life as he wishes, that is superior to forcing values on anyone.\n \n \nI suspect that you think that, if a morality is not asolute then it is completely arbitrary.\n\n It is when one considers the arbiters.\n \nThat is an illogical conclusion. Moral reasoning can be consistent and logical and still lead to different conclusions when one starts with different value judgements - as I had mentioned in the last paragraph.\n\n No premises which are not universal or absolute throughout all humanity should be used when formulating a morality, I consider their usage a fallacy, and their result an opinion that means nothing to me.\n \ndon't realize that the same moral rules they apply would also have to be applied to themselves\n\n How could their rules apply to anyone but themselves if they are unique to the individual?\n \nThe greatest evils occur from moral approaches that can clearly be proven wrong through reason and logic - as with the Nazis illogical assumptions about the automatic superiority of the Arian race, or the Hutus (in Rwanda) assumptions about the automatic evil and inferior natures of the Tutsis.\n\n Under the axiom of integrated non-contradictory liberty of the entire human race, all moral approaches except mine can be clearly proven wrong through reason and logic.\n \n I don't care to live with someone who rejects this axiom, they are as an animal to me.\n \nThat is a proclamation that has no rational support in reality. If you think it does, then please explain how you came to those conclusions.\n\n By observing those who argue against objective morality, they attack the consequences, or the premises.\n \n The consequence means they are 'shackled' by something they may not want, the premises are freedom and rational morality. One rejects freedom because one is a tyrant and has taken as an axiom that their subjective judgement is superior to others, one rejects rational morality because they believe in irrational morality(emotion).", 
   {}, 
   391591, 
   null, 
   1266794820.0
  ], 
  [
   391995, 
   null, 
   "Another opinion", 
   "Why would you think that concept disappears for any reason?\n\n The concept that there is a single truth has to be one that is verifiable. In the hard sciences - physics, chemistry, etc., experiments (as long as they are well controlled) give repeatable and largely predictable results. This gives evidence of there being a single truth in the physical realm.\n \n That is not the case with morals and psychology in general. If you think that there is a single truth out there about morality, the burden of proof is on you to prove it. So far, all I have heard from you is unsupported proclamations - for example \"No morality should be based on these goals.\" in reference to a list of goals that people have used for morality.\n \nThe approach of freedom states that each man may approach life as he wishes, that is superior to forcing values on anyone.\n\n Does that mean that you have the right to rape, torture and kill children if you like? After all, if society stops you, isn't that infringing on your freedom? Otherwise, if you start putting conditions on your freedom (ex. your freedom should not encroach on someone else's freedom), then you already set up a situation of non-absolute freedom which has to be constrained by rules - rules that different individuals would choose differently based on their own value judgements - i.e. subjective morality.\n \nNo premises which are not universal or absolute throughout all humanity should be used when formulating a morality, I consider their usage a fallacy, and their result an opinion that means nothing to me.\n\n Yet another unsupported proclamation. If you only are stating you opinion, then such proclamations can stand unsupported. However, if you wish to convince others to follow similar views, then it is your responsibility to support them with underlying reasoning.\n \nHow could their rules apply to anyone but themselves if they are unique to the individual?\n\n We humans share very similar psychological traits that lead us to have very similar psychological reactions to a wide range of experiences - ex. reactions of anger and pain if we or our loved ones are hurt. Because of these great similarities, we can make a very good prediction that what hurts others will generally hurt us as well, in most circumstances. That is why many moral rules derived from both secular and religious reasoning are based on the basic premise of \"Do unto others what you would have them do unto you\" or similar variations. When people treat others as they themselves would expect to be treated, then that leads to far less suffering for everyone, on average, than your anything goes morality of absolute freedom to do anything you want.\n \n Also, there is the simple fact that, if you treat me badly, then I have no motivation to treat you well whereas, if you treat me reasonably, I will treat you reasonably with the ultimate goal of making our interaction work best for both of us.\n \nUnder the axiom of integrated non-contradictory liberty of the entire human race, all moral approaches except mine can be clearly proven wrong through reason and logic.\n\n Then go ahead and prove it. Don't just make proclamations.\n \nBy observing those who argue against objective morality, they attack the consequences, or the premises.\n \n The consequence means they are 'shackled' by something they may not want, the premises are freedom and rational morality. One rejects freedom because one is a tyrant and has taken as an axiom that their subjective judgement is superior to others, one rejects rational morality because they believe in irrational morality(emotion).\n\n Again, how widely do you define freedom? Do you claim the freedom to rape, torture and kill children? If not, then you are \"shackling\" this absolute freedom that you seem to worship. And, if you make ANY constraints on your freedom, then it is no longer absolute and we are back to the case of value judgements determining which actions one constrains and which one does not - i.e. subjective morality.", 
   {}, 
   391593, 
   null, 
   1266955920.0
  ], 
  [
   392149, 
   null, 
   "Freedom", 
   "The concept that there is a single truth has to be one that is verifiable. In the hard sciences - physics, chemistry, etc., experiments (as long as they are well controlled) give repeatable and largely predictable results. This gives evidence of there being a single truth in the physical realm.\n\n Correct\n \nThat is not the case with morals and psychology in general.\n\n It is the case.\n \nIf you think that there is a single truth out there about morality, the burden of proof is on you to prove it.\n\n That is a premise I will not accept. I do not need to prove that truth exists, I cannot prove truth exists.\n \nSo far, all I have heard from you is unsupported proclamations - for example \"No morality should be based on these goals.\" in reference to a list of goals that people have used for morality.\n\n The support is definitive.\n \nDoes that mean that you have the right to rape, torture and kill children if you like? After all, if society stops you, isn't that infringing on your freedom? \n\n No\n \nOtherwise, if you start putting conditions on your freedom (ex. your freedom should not encroach on someone else's freedom), then you already set up a situation of non-absolute freedom which has to be constrained by rules\n\n Incorrect analysis of liberty has led you to this errant belief.\n \nrules that different individuals would choose differently based on their own value judgements - i.e. subjective morality.\n\n You are wrong to think you can make a rule based on anything but the encroachment of freedom.\n \n \nYet another unsupported proclamation. If you only are stating you opinion, then such proclamations can stand unsupported.\n\n You deny the concept of proclamations that aren't opinions; I cannot support an absolute to someone who does not believe there are absolutes.\n \n \nHowever, if you wish to convince others to follow similar views, then it is your responsibility to support them with underlying reasoning.\n\n Any morality that is based on anything but freedom is a lie that contradicts the nature of man. That is the support.\n \n \nWe humans share very similar psychological traits that lead us to have very similar psychological reactions to a wide range of experiences - ex. reactions of anger and pain if we or our loved ones are hurt. Because of these great similarities, we can make a very good prediction that what hurts others will generally hurt us as well, in most circumstances. That is why many moral rules derived from both secular and religious reasoning are based on the basic premise of \"Do unto others what you would have them do unto you\" or similar variations. When people treat others as they themselves would expect to be treated, then that leads to far less suffering for everyone, on average, than your anything goes morality of absolute freedom to do anything you want.\n\n You did not answer the question.\n \n \nThen go ahead and prove it. Don't just make proclamations.\n\n No you prove that morality is subjective, you have said there is no single truth for morality, what is your support for that?\n \n \nAgain, how widely do you define freedom? Do you claim the freedom to rape, torture and kill children? If not, then you are \"shackling\" this absolute freedom that you seem to worship. And, if you make ANY constraints on your freedom, then it is no longer absolute and we are back to the case of value judgements determining which actions one constrains and which one does not - i.e. subjective morality.\n\n I define freedom as all that one could do if they were alone, and rights freedom which is not destroyed by other men.\n \n You have committed the fallacy of burden of proof, I do not need to prove that the concept of truth is real, truth is an axiom of proof. I do not need to prove that fact is something that is known to be true it is defined as such. I do not need to prove that something is objective, if I use objective premises to reach it; that makes it objective. The burden of proof is with you, why is it incorrect to base morality on objective fact?", 
   {}, 
   391995, 
   null, 
   1266975000.0
  ], 
  [
   392166, 
   null, 
   "Another opinion", 
   "Correct\n \n It is the case.\n \n That is a premise I will not accept. I do not need to prove that truth exists, I cannot prove truth exists.\n \n The support is definitive.\n \n No\n \n Incorrect analysis of liberty has led you to this errant belief.\n \n You are wrong to think you can make a rule based on anything but the encroachment of freedom.\n \n \n You deny the concept of proclamations that aren't opinions; I cannot support an absolute to someone who does not believe there are absolutes.\n \n \n Any morality that is based on anything but freedom is a lie that contradicts the nature of man. That is the support.\n\n You seem to think that simply making a proclamation is the support. That makes no sense. If I say \"All people with brown hair are superior to all people with red hair\", that is a proclamation that people have no reason to believe if that proclamation is not supported by evidence and/or detailed reasoning. The same is true for your proclamations.\n \nNo you prove that morality is subjective, you have said there is no single truth for morality, what is your support for that?\n\n There is a wide range of evidence that a variety of people have a variety of systems of morality. If you wish evidence for that, I can present it but I haven't here since it seems to be an obvious point. I am not the one saying that some of those moralities are automatically wrong, that is a claim that you are making. These are my only claims - that morality has to be self consistent (what applies to you applies to me) if there is to be any practical chance that others will respect it and do likewise, and morality has to be logical in that all consequences are thought out and accepted by the holder of that moral view before he should personally consider it valid. \n \n You are the one that is making a claim that all of the systems of morality besides your own are wrong. Anybody who makes a claim needs to defend it with supporting evidence and/or detailed reasoning - not just more unsupported claims. I would be willing to defend my claims but only if you defend your claims, outside of simply layering proclamation on top of proclamation and claiming yours is true simply because you believe it to be so. I don't feel like going through the trouble of digging up evidence if you are not going through the trouble. If I am to continue this discussion, then it has to be a two-way street where supporting views is concerned.\n \nI define freedom as all that one could do if they were alone, and rights freedom which is not destroyed by other men.\n\n It is not clear what you meant by defining rights as \"freedom which is not destroyed by other men\". However, as to the first part, the great majority of morality deals with how we behave toward other people. It is only a small minority of moral views that deals with things we do when on our own.\n \nYou have committed the fallacy of burden of proof, I do not need to prove that the concept of truth is real, truth is an axiom of proof. I do not need to prove that fact is something that is known to be true it is defined as such. I do not need to prove that something is objective, if I use objective premises to reach it; that makes it objective. The burden of proof is with you, why is it incorrect to base morality on objective fact?\n\n You may claim that your view is based on fact and is the truth - that doesn't make it so. That is why you need to defend it if you want anybody to believe you. Anybody who makes a claim needs to defend it.", 
   {}, 
   392149, 
   null, 
   1266982380.0
  ], 
  [
   392171, 
   null, 
   "Freedom", 
   "You seem to think that simply making a proclamation is the support.\n \n You seem to think argument by definition is unsound.\n \n \nThere is a wide range of evidence that a variety of people have a variety of systems of morality.\n\n There is a wide range of evidence that a variety of people believe in a variety of moral systems.\n \n \nIf you wish evidence for that, I can present it but I haven't here since it seems to be an obvious point.\n\n You need only say you disagree with me on any given moral issue to make the corrected version true.\n \nI am not the one saying that some of those moralities are automatically wrong\n\n No, I am\n \nthat is a claim that you are making.\n\n Yes\n \nThese are my only claims - that morality has to be self consistent (what applies to you applies to me) \n\n I am now having a similar experience to what I just had in arguing evolution in another thread, it at first appears as if the opponent is unable to understand any of the material presented then they say something that proves otherwise.\n \n How can morality which you claim is subject to change with the individual apply to more than the individual?\n \n \nif there is to be any practical chance that others will respect it and do likewise, and morality has to be logical in that all consequences are thought out and accepted by the holder of that moral view before he should personally consider it valid. \n\n Yes\n \nYou are the one that is making a claim that all of the systems of morality besides your own are wrong.\n\n Yes\n \nAnybody who makes a claim needs to defend it with supporting evidence and/or detailed reasoning - not just more unsupported claims.\n\n The evidence is exceedingly short and the reasoning is simple, I shall present it at the end of this post but it will mean nothing to you for the reasons I have already responded to.\n \n \nI would be willing to defend my claims but only if you defend your claims, outside of simply layering proclamation on top of proclamation and claiming yours is true simply because you believe it to be so.\n\n The great irony here is that I am rejecting your system of thought by which something is true simply because one believes it to be true.\n \n I don't feel like going through the trouble of digging up evidence if you are not going through the trouble.\n\n You can have no evidence, arguing about global warming or evolution is difficult to sort out the data collected here it is easy. \n \nIf I am to continue this discussion, then it has to be a two-way street where supporting views is concerned.\n\n Then the first step is to admit there is a street, and that for one to argue about the truth; the truth must exist.\n \n You want to argue about morality? You must then assume that the argument can be won or lost, you take as an axiom that there is a moral truth that can be found by reason even though there are two of us.\n \n \nIt is not clear what you meant by defining rights as \"freedom which is not destroyed by other men\".\n\n I shall elaborate once I am sure you are disillusioned of any moral perspectivism you may have.\n \n However, as to the first part, the great majority of morality deals with how we behave toward other people. It is only a small minority of moral views that deals with things we do when on our own.\n\n Yes\n \nYou may claim that your view is based on fact and is the truth - that doesn't make it so.\n\n You may claim that fact and truth doesn't exist in morality - that doesn't make it so.\n \nThat is why you need to defend it if you want anybody to believe you. Anybody who makes a claim needs to defend it.\n\n I claim that moral truth exists and it is objective.\n \n This is the combination of those definitions:\n actuality or actual existence of, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong\n not influenced by personal feelings, interpretations, or prejudice; based on facts\n \n To deny this one must say that both right and wrong do not exist, or that they are influenced by personal feelings, interpretations, or prejudice, not based on facts.\n \n Do not make the mistake of talking about what people think, people used to believe you could sneeze your soul out, I am talking about what IS.\n \n How much evidence do you think I will be able to find where someone's personal feelings, interpretations, or prejudices caused something to be right or wrong?\n \n Nazi's thought it was right, was it right? you disagree? Just a difference of opinion what right have you to tell them they are wrong?", 
   {
    "unicode_changes_made": true
   }, 
   392166, 
   null, 
   1266984600.0
  ], 
  [
   392464, 
   null, 
   "Another opinion", 
   "How can morality which you claim is subject to change with the individual apply to more than the individual?\n\n Because, as I said before, individuals are very similar in their internal emotional reactions to situations and to each other because they are all human beings and human beings, by biological nature, have very similar responses. Therefore, any moral rules set up by humans are bound to have great similarities because of that human nature. Culture and religion can distort human nature - sometimes in a good way and sometimes in a harmful way - away from biological impulses but those impulses are, nevertheless, always there so that even the most extreme cultures and religions cannot attract vast followings if they stray too far from human nature in their expectations. So, it is the similarity of the moral rules based on common human nature that allows for the reciprocical nature of morality.\n \nThe great irony here is that I am rejecting your system of thought by which something is true simply because one believes it to be true.\n\n I certainly don't think that my moral rules are true in an metaphysically absolute sense, as you seem to about your moral view. I find any such claim about absolute truth of a moral rule delusionally arrogant - especially if not supported by detailed reasoning, which you still don't present, even having read your last section.\n \nThen the first step is to admit there is a street, and that for one to argue about the truth; the truth must exist.\n \n You want to argue about morality? You must then assume that the argument can be won or lost, you take as an axiom that there is a moral truth that can be found by reason even though there are two of us.\n\n Why must a single truth exist, where moral reasoning is concerned? Not everything has a single truth behind it. It is as if one asked \"Which style of music is superior?\" . How would you prove that there is one superior style. Conversely, given the absurd challenge you have posed to me, how would you prove that there is no single superior style of music if pointing to various people's preferences is not, in your eyes, sufficient?\n \nI shall elaborate once I am sure you are disillusioned of any moral perspectivism you may have.\n\n I never found arguements from arrogant ignorance convincing.\n \nYou may claim that fact and truth doesn't exist in morality - that doesn't make it so.\n \n I claim that moral truth exists and it is objective.\n \n This is the combination of those definitions:\n actuality or actual existence of, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong\n not influenced by personal feelings, interpretations, or prejudice; based on facts\n \n To deny this one must say that both right and wrong do not exist, or that they are influenced by personal feelings, interpretations, or prejudice, not based on facts.\n \n Do not make the mistake of talking about what people think, people used to believe you could sneeze your soul out, I am talking about what IS.\n \n How much evidence do you think I will be able to find where someone&#8217;s personal feelings, interpretations, or prejudices caused something to be right or wrong?\n \n Nazi's thought it was right, was it right? you disagree? Just a difference of opinion what right have you to tell them they are wrong?\n\n Nazi's thought they were right but their assumptions were based on a false premise of racial superiority that could easily be disproven by scientific or observational evidence, since they did not claim that Arians were superior ON AVERAGE but claimed that every Arian was superior to everyone else on things such as intelligence, physical prowess, etc. - which observation could easily refute. The rest of their philosophy seemed to be a logical house of cards built on this faulty base - a house of cards that could be easily toppled by disproving that base assumption.\n \n All this says is that, as I said before, morality needs to be reasoned out. However, since value judgements from individual to individual vary, that reasoning often leads to different moral systems. So logic and reason do not lead to a single absolute truth on morality, just as they would not for the question \"which musical style is superior\".", 
   {}, 
   392171, 
   null, 
   1267129320.0
  ], 
  [
   392503, 
   null, 
   "Freedom", 
   "Because, as I said before, individuals are very similar in their internal emotional reactions to situations and to each other because they are all human beings and human beings, by biological nature, have very similar responses. Therefore, any moral rules set up by humans are bound to have great similarities because of that human nature. Culture and religion can distort human nature - sometimes in a good way and sometimes in a harmful way - away from biological impulses but those impulses are, nevertheless, always there so that even the most extreme cultures and religions cannot attract vast followings if they stray too far from human nature in their expectations. So, it is the similarity of the moral rules based on common human nature that allows for the reciprocical nature of morality.\n\n Very eloquent, but it did not answer the question. I did not ask how most of someones morality can apply to others.\n \n \nI find any such claim about absolute truth of a moral rule delusionally arrogant\n\n What argument against it do you have?\n \n \nWhy must a single truth exist, where moral reasoning is concerned?\n\n Because contradiction is the sign of falsehood.\n \n \nNot everything has a single truth behind it. It is as if one asked \"Which style of music is superior?\"\n\n That is subjective, there is not a single truth, there are not many truths. Simply opinion.\n \n If you are attempting to lure me into saying everything is objective you will fail.\n \n Now if one found an objective manner of determining the superior music, then there would be truth.\n \n \nI never found arguements from arrogant ignorance convincing.\n\n I don't find conjecture convincing either.\n \n \nAll this says is that, as I said before, morality needs to be reasoned out. However, since value judgements from individual to individual vary, that reasoning often leads to different moral systems.\n\n The only value morality should hold is freedom, you are operating at a level lower than that.\n \nSo logic and reason do not lead to a single absolute truth on morality, just as they would not for the question \"which musical style is superior\".\n\n You have stated that people have different value judgements.\n \n (I might add that they can be the same sometimes)\n \n That is a premise you set forth, I accept it.\n \n \"let each man make his own value judgements\" is a logical result of that premise, that is morality.\n \n It is absolute and universal for the exception would be a multi-being a mind composed of multiple minds.\n \n Most issues are far more complicated do not look for my support farther than this, it's simplicity does not grant it insignificance.", 
   {}, 
   392464, 
   null, 
   1267151400.0
  ], 
  [
   392560, 
   null, 
   "Another opinion", 
   "Very eloquent, but it did not answer the question. I did not ask how most of someones morality can apply to others.\n \n \n What argument against it do you have?\n \n \n Because contradiction is the sign of falsehood.\n \n \n That is subjective, there is not a single truth, there are not many truths. Simply opinion.\n \n If you are attempting to lure me into saying everything is objective you will fail.\n \n Now if one found an objective manner of determining the superior music, then there would be truth.\n \n \n I don't find conjecture convincing either.\n \n \n The only value morality should hold is freedom, you are operating at a level lower than that.\n \n You have stated that people have different value judgements.\n \n (I might add that they can be the same sometimes)\n \n That is a premise you set forth, I accept it.\n \n \"let each man make his own value judgements\" is a logical result of that premise, that is morality.\n \n It is absolute and universal for the exception would be a multi-being a mind composed of multiple minds.\n \n Most issues are far more complicated do not look for my support farther than this, it's simplicity does not grant it insignificance.\n\n I've grown tired and impatient with this discussion since you expect me to go through a detailed defense of my views, without feeling the least bit obliged to go through a detailed defense of yours outside of simply layering unsupported claim upon unsupported claim, with self-righteous statements thrown in as well to make the discussion even more of a waste of time for me.\n \n So, since you seem to be insisting that the great majority of effort be mine and wish to only take the offense without making any significant effort at defense, I find such a lop-sided discussion not worth my time. I have little enough time to debate on these forums as it is. I would prefer to participate in a debate where both sides make a genuine effort to defend their views, not just one.\n \n Neither of us will convince the other - I will not convince you since you are so clearly set in your views, and you will not convince me since you don't even bother defending your views. It is up to the readers what they will take out of this discussion, if anything.\n \n So, my side of this discussion is at an end. If I encounter you in another debate, then I hope you will be willing to make more of an effort at defending your views...", 
   {}, 
   392503, 
   null, 
   1267208940.0
  ], 
  [
   392577, 
   null, 
   "Freedom", 
   "I've grown tired and impatient with this discussion since you expect me to go through a detailed defense of my views, without feeling the least bit obliged to go through a detailed defense of yours outside of simply layering unsupported claim upon unsupported claim, with self-righteous statements thrown in as well to make the discussion even more of a waste of time for me.\n \n So, since you seem to be insisting that the great majority of effort be mine and wish to only take the offense without making any significant effort at defense, I find such a lop-sided discussion not worth my time. I have little enough time to debate on these forums as it is. I would prefer to participate in a debate where both sides make a genuine effort to defend their views, not just one.\n \n Neither of us will convince the other - I will not convince you since you are so clearly set in your views, and you will not convince me since you don't even bother defending your views. It is up to the readers what they will take out of this discussion, if anything.\n \n So, my side of this discussion is at an end. If I encounter you in another debate, then I hope you will be willing to make more of an effort at defending your views...\n\n As I suspected you may have missed my defense due to it's simplicity:\n \n You have stated that people have different value judgements.\n \n (I might add that they can be the same sometimes)\n \n That is a premise you set forth, I accept it.\n \n \"let each man make his own value judgements\" is a logical result of that premise, that is morality.\n \n It is absolute and universal for the exception would be a multi-being a mind composed of multiple minds.\n \n Most issues are far more complicated do not look for my support farther than this, it's simplicity does not grant it insignificance.", 
   {}, 
   392560, 
   null, 
   1267216980.0
  ], 
  [
   392637, 
   null, 
   "Another opinion", 
   "As I suspected you may have missed my defense due to it's simplicity:\n\n It is simple for you since you do not recognize the complications since you seem to be used to reasoning by layering unsupported claims. However, I will give it one last shot to see if you are willing to go into any more detail. Otherwise, a discussion simply based on unsupported claims is not worth my time. So, I await your defense of the following challenges to your view...\n \n[B]You have stated that people have different value judgements.\n \n (I might add that they can be the same sometimes)\n \n That is a premise you set forth, I accept it.\n \n \"let each man make his own value judgements\" is a logical result of that premise, that is morality.\n\n Explain the logical reasoning that you came to in this judgement since it is far from clear. As I mentioned before, if one person claims a morality that allows them to rape, torture and murder children then, sure, he can hold that morality but the great majority of people will fight against someone of that moral view because of their sympathy for children. Indeed, your morality seems to be one that allows for anyone to claim an \"anything goes\" morality which is essentially no morality at all - i.e. no control over ones actions in the interest of human interaction. \n \n Indeed, since you claim to like arguement by definition, Merriam Webster online dictionary defines morality as:\n \nMain Entry: mo·ral·i·ty \n ...\n 1 a : a moral discourse, statement, or lesson b : a literary or other imaginative work teaching a moral lesson\n 2 a : a doctrine or system of moral conduct b plural : particular moral principles or rules of conduct\n 3 : conformity to ideals of right human conduct\n 4 : moral conduct : virtue\n\n Though 1a and b are less relevant to this discussion, the rest of the definitions suggest that morality must have rules or otherwise a system that determines conduct. Your view seems to be one that places no constraints except those that a person might set on themselves which, for many, would be no constraints at all - so no morality. Absolute freedom can, in this way, lead to terrible consequences - as it would for someone who would be exercising their absolute freedom by raping, torturing and killing children. So, your \"logical conclusion\" is far from logical since it could so easily lead to terrible consequences.\n \nIt is absolute and universal for the exception would be a multi-being a mind composed of multiple minds.\n\n Please explain what you mean by a \"mind composed of multiple minds\" in the context of this discussion, and why you think that this is the only alternative to letting everyone have their own morality completely free from external constraints?\n \nMost issues are far more complicated do not look for my support farther than this, it's simplicity does not grant it insignificance.\n\n Does this mean that you will let your unsupported claims rest as they are and are unwilling to go into any detail in supporting those claims, as in responding to my challenges? If so, then, as I said before, it is not worth my time to continue a discussion with all effort at reasoning being on one side. Hopefully, you are willing to make some effort outside of simply posting unsupported claims. Perhaps you might even be able to convince some readers if you go into more detail...\n \n One last thing, as other debaters have found when debating you, it is very difficult to hold a debate when you mainly respond in one sentence responses, so please respond in paragraphs or longer responses, as I have done and which you have been willing to do in this last response. Keeping to such structures keeps the mutual responses from getting hopelessly fragmented into unmanageable numbers of quotes.", 
   {}, 
   392577, 
   null, 
   1267232820.0
  ], 
  [
   392644, 
   null, 
   "Freedom", 
   "Explain the logical reasoning that you came to in this judgement since it is far from clear.\n\n If the premise is that men hold different values, the axiom of that premise is that each man holds his own values.\n \n The only moral conclusion you can make about every single man is that he holds his own values and by his own choice it is right for him to do so.\n \n Do you have trouble going from the premise to conclusion? The alternative is might makes right.\n \n If your morality changes from one individual to another than the fact of disagreement can only be resolved by compulsion. There is no reason for either party to change their minds if neither is wrong.\n \n You have said men have different values you are correct, you are incorrect that each man's values are what dictates his morality, that he holds them is what does.\n \n Ayn Rand has described morality more as you have, as not a thing that only exists in a society but individual to each man. In that case what I am talking about are rights.\n \nAs I mentioned before, if one person claims a morality that allows them to rape, torture and murder children then, sure, he can hold that morality but the great majority of people will fight against someone of that moral view because of their sympathy for children. Indeed, your morality seems to be one that allows for anyone to claim an \"anything goes\" morality which is essentially no morality at all - i.e. no control over ones actions in the interest of human interaction. \n\n Strawman\n \n \nThough 1a and b are less relevant to this discussion, the rest of the definitions suggest that morality must have rules or otherwise a system that determines conduct. Your view seems to be one that places no constraints except those that a person might set on themselves which, for many, would be no constraints at all - so no morality. Absolute freedom can, in this way, lead to terrible consequences - as it would for someone who would be exercising their absolute freedom by raping, torturing and killing children. So, your \"logical conclusion\" is far from logical since it could so easily lead to terrible consequences.\n\n Strawman\n \n \nPlease explain what you mean by a \"mind composed of multiple minds\" in the context of this discussion, and why you think that this is the only alternative to letting everyone have their own morality completely free from external constraints?\n\n That is what would make my morality non-universal.\n \nDoes this mean that you will let your unsupported claims rest as they are and are unwilling to go into any detail in supporting those claims, as in responding to my challenges?\n\n They are supported by reality, what is not supported is the concept of subjective truth.\n \nIf so, then, as I said before, it is not worth my time to continue a discussion with all effort at reasoning being on one side. Hopefully, you are willing to make some effort outside of simply posting unsupported claims. Perhaps you might even be able to convince some readers if you go into more detail\n\n Then do not continue it, I don't mean to be rude but this is like arguing about mathematics and someone is saying \"no you can't have parenthesis to multiply a term you need an X that's how they taught me.\"\n \n You not only haven't begun to attack my position you aren't even presenting an opposition in my view.", 
   {}, 
   392637, 
   null, 
   1267234440.0
  ], 
  [
   392814, 
   null, 
   "Another opinion", 
   "If the premise is that men hold different values, the axiom of that premise is that each man holds his own values.\n \n The only moral conclusion you can make about every single man is that he holds his own values and by his own choice it is right for him to do so.\n \n Do you have trouble going from the premise to conclusion? The alternative is might makes right.\n \n If your morality changes from one individual to another than the fact of disagreement can only be resolved by compulsion. There is no reason for either party to change their minds if neither is wrong.\n \n You have said men have different values you are correct, you are incorrect that each man's values are what dictates his morality, that he holds them is what does.\n \n Ayn Rand has described morality more as you have, as not a thing that only exists in a society but individual to each man. In that case what I am talking about are rights.\n\n I get the impression that you are under the illusion that there are only two types of morality - 1) your view that claims that anyone can have any morality they like, and 2) absolutist moral systems where society dictates all the details of a morality that all member should hold. \n \n Most Western societies hold a view that is in between the two extremes, as mine is. Namely, people can largely determine their own morality but within LIMITED constraints imposed by society, usually reflected in rule of law. Since most Western societies function this way, it is absurd to claim that such a middle ground is not an alternative, as you seem to claim. If I am wrong about my assumption of your holding such two-sided views of morality, then please demonstrate that you do indeed aknowledge that there exists a middle road of individual morality which is mainly free but only with limited constraints imposed by society.\n \n\n Strawman\n \n \n Strawman\n \n\n An arguement is, by definition, a Strawman arguement only if it makes a purposely false claim about the opponent's view. Do you claim that I am wrong in my arguement that your view would allow someone to claim moral right to rape, torture and murder children? After all, it is a logical conclusion from your claim that people should have absolute freedom to choose the morality they like.\n \n So, just to clarify, do you or do you not claim that people should have ABSOLUTE freedom in their choice of morality ? If you do so claim, then I was simply stating an extreme but accurate and logical consequence of your view of morality.", 
   {}, 
   392644, 
   null, 
   1267383840.0
  ], 
  [
   392830, 
   null, 
   "Freedom", 
   "I get the impression that you are under the illusion that there are only two types of morality - 1) your view that claims that anyone can have any morality they like, and 2) absolutist moral systems where society dictates all the details of a morality that all member should hold. \n\n You get the impression incorrectly.\n \nMost Western societies hold a view that is in between the two extremes, as mine is. Namely, people can largely determine their own morality but within LIMITED constraints imposed by society, usually reflected in rule of law. Since most Western societies function this way, it is absurd to claim that such a middle ground is not an alternative, as you seem to claim. If I am wrong about my assumption of your holding such two-sided views of morality, then please demonstrate that you do indeed aknowledge that there exists a middle road of individual morality which is mainly free but only with limited constraints imposed by society.\n\n A compromise between good and evil is evil.\n \n\n An arguement is, by definition, a Strawman arguement only if it makes a purposely false claim about the opponent's view. \n\n It is not necessary to be purposefully, only false.\n \n \nDo you claim that I am wrong in my arguement that your view would allow someone to claim moral right to rape, torture and murder children?\n\n Yes\n \nAfter all, it is a logical conclusion from your claim that people should have absolute freedom to choose the morality they like.\n\n People should have absolute freedom within the sphere of themselves, morality speaks of the right and wrong of overlapping spheres.\n \n Ethics is a science and a study, one you claim does not exist for what motivations I doubt you would like to discover.\n \n These when these spheres overlap is where rights are concerned, rights are the enumeration of morality. Only a man who claims the right to rape could consider it moral.\n \n The logic of morality is very clear, all rights can be identified.\n \n Morality is not applicable for a castaway, yet you know that castaway chooses values.\n \n Morality is not the values of any given individual but the proper conduct between individuals with values.\n \n You claim that values are subjective you are right, in fact the value of the human life is axiomatic which is even more impossible to prove objectively. Morality is not subjective, morality makes no claims about values only that they should be held free of coercion if at all.\n \n \nSo, just to clarify, do you or do you not claim that people should have ABSOLUTE freedom in their choice of morality ?\n\n They have no choice in morality, except to mistake it for something else.\n \n If you do so claim, then I was simply stating an extreme but accurate and logical consequence of your view of morality.\n\n You have ignored my view on morality.", 
   {}, 
   392814, 
   null, 
   1267395360.0
  ], 
  [
   392833, 
   null, 
   "Symbiote", 
   "Another Opinion, I think the reason you and Freedom are talking past each other is because you conceive of morality as (inherently?) founded on value judgements, which are subjective.\n \n However there are ethics of action, deontology, which completely ignore that, and can lay claim to objectivity.\n \n Deontological ethics - Wikipedia, the free encyclopedia\n \n When you say \"Murder is wrong\", all you mean by it is \"I generally have a low preference for murder, although a circumstance could arise where I felt it was the best option, in which case it would be right. And I accept there could be people who preferred it in more circumstances than I\".\n \n When someone talking about act-ethics makes such a claim, they aren't expressing a preference, so when you turn around and say \"well that's just your subjective view\", it isn't exactly as obvious as you think it is. It seems to me that act-ethical claims can only be correct or incorrect, calling them subjective would appear to be a category mistake.", 
   {}, 
   392830, 
   null, 
   1267397580.0
  ], 
  [
   392924, 
   null, 
   "Another opinion", 
   "Another Opinion, I think the reason you and Freedom are talking past each other is because you conceive of morality as (inherently?) founded on value judgements, which are subjective.\n\n I view morality as a combination of:\n 1) objective rules - such as Kant's categorical imperative which essentially states that moral rules must be reciprocal\n 2) value judgments\n 3) logic - For example, that one cannot start with easily disprovable theories such as automatic racial superiority, and that one needs to make the best effort at using logic to draw conclusions from a combination of the value judgments and observation / science of human nature.\n \n That is a lot more detailed than simply conceiving of morality as purely based on value judgments . However, I cannot see how one can avoid the subjectivity inherent in value judgments when making any moral system for oneself or for society. After all, even the idea that &#8220;suffering is generally a bad thing, to be avoided&#8221; can be thought of as a value judgment. \n \n As to Freedom and I talking past each other, I have to say that I find his arguments very difficult to follow since they are often so vague, cryptic and/or indirect, in that he often makes grand statements without going into any supporting detail. Indeed, Freedom has not indicated any SPECIFIC constraints that he would place on people's personal morality, as you seem to through your act-ethics or structures ethics. I am pretty much ready to give up on Freedom since it is just too much of a pain to hold a discussion with him, given the lack of detail. However, if you claim to understand his view, then I would be fine continuing the discussion with you, since you offer more detailed support ...\n \nHowever there are ethics of action, deontology, which completely ignore that, and can lay claim to objectivity.\n Deontological ethics - Wikipedia, the free encyclopedia\n When you say \"Murder is wrong\", all you mean by it is \"I generally have a low preference for murder, although a circumstance could arise where I felt it was the best option, in which case it would be right. And I accept there could be people who preferred it in more circumstances than I\".\n When someone talking about act-ethics makes such a claim, they aren't expressing a preference, so when you turn around and say \"well that's just your subjective view\", it isn't exactly as obvious as you think it is. It seems to me that act-ethical claims can only be correct or incorrect, calling them subjective would appear to be a category mistake.\n\n What do you mean when you say &#8220;preference&#8221; in this context? For example, I believe that, under most circumstances in which it happens, murder is wrong but I personally think it is wrong because of the general rule of reciprocity (essentially Kant&#8217;s categorical imperative) that I try to follow. Namely, I would not kill in the great majority of cases because I would expect not to be killed myself in those circumstances. However, there are other circumstances in which case I would have to admit others would have a right to kill me &#8211; ex. if I became a soldier in war, or if I went insane and went on a killing rampage, etc. It is the reciprocity rule, which one might call an objective rule, which drives my moral repulsion to killing. However, subjective preference does nevertheless come into play since, after all, now wanting to be killed is a type of subjective preference that would not be shared by a masochist or someone wishing suicide.", 
   {}, 
   392833, 
   null, 
   1267468920.0
  ], 
  [
   393018, 
   null, 
   "Freedom", 
   "I view morality as a combination of:\n 1) objective rules - such as Kant's categorical imperative which essentially states that moral rules must be reciprocal\n 2) value judgments\n 3) logic - For example, that one cannot start with easily disprovable theories such as automatic racial superiority, and that one needs to make the best effort at using logic to draw conclusions from a combination of the value judgments and observation / science of human nature.\n \n That is a lot more detailed than simply conceiving of morality as purely based on value judgments . However, I cannot see how one can avoid the subjectivity inherent in value judgments when making any moral system for oneself or for society. After all, even the idea that \"suffering is generally a bad thing, to be avoided\" can be thought of as a value judgment. \n\n I say that anything that is subjective should not be considered in morality, that because if it is subjective it cannot be used as a code of proper behavior towards others.\n \n \n\n As to Freedom and I talking past each other, I have to say that I find his arguments very difficult to follow since they are often so vague, cryptic and/or indirect, in that he often makes grand statements without going into any supporting detail. Indeed, Freedom has not indicated any SPECIFIC constraints that he would place on people's personal morality, as you seem to through your act-ethics or structures ethics. I am pretty much ready to give up on Freedom since it is just too much of a pain to hold a discussion with him, given the lack of detail. However, if you claim to understand his view, then I would be fine continuing the discussion with you, since you offer more detailed support ...\n\n \n If you want to get into hypothetical scenarios that sounds great, I believe however that you will at some point back out and say \"But you can't make that decision for other people, morality is subjective\"\n \n I can come to a conclusion about a scientific hypothesis given data and I don't have to make anyone else's choice to do it. Morality is not subjective. just as you would attempt to say that it is simply because you can disagree with me I say it is objective simply because I do not use subjective concepts in any part of it.", 
   {
    "unicode_changes_made": true
   }, 
   392924, 
   null, 
   1267507140.0
  ], 
  [
   393064, 
   null, 
   "Another opinion", 
   "I say that anything that is subjective should not be considered in morality, that because if it is subjective it cannot be used as a code of proper behavior towards others.\n \n \n \n If you want to get into hypothetical scenarios that sounds great, I believe however that you will at some point back out and say \"But you can't make that decision for other people, morality is subjective\"\n \n I can come to a conclusion about a scientific hypothesis given data and I don't have to make anyone else's choice to do it. Morality is not subjective. just as you would attempt to say that it is simply because you can disagree with me I say it is objective simply because I do not use subjective concepts in any part of it.\n\n I find it very difficult continuing a discussion with you since your arguements are so sorely lacking in supporting detail. For example, if you claim that morality can be determined purely logically with no subjectivity involved, then go ahead and make some DETAILED arguements showing that is true or, if that is too much effort, at least point to a web site that outlines that reasoning. \n \n As I said before, if you don't want to go through the effort to support your claims with more detail, then I don't feel like going through the effort with you either and would prefer to deal with people who DO at least try to support their views, such as Symbiote. This is my last appeal. After this, if I see no detail in your posts, I will silently jump out of this discussion and it will be left as it is - you making claims without supporting them with more detailed arguements, and my unsuccessful attempts at trying to get you to describe your view in some reasonable detail.", 
   {}, 
   393018, 
   null, 
   1267561380.0
  ], 
  [
   393095, 
   null, 
   "Freedom", 
   "I find it very difficult continuing a discussion with you since your arguements are so sorely lacking in supporting detail. For example, if you claim that morality can be determined purely logically with no subjectivity involved, then go ahead and make some DETAILED arguements showing that is true or, if that is too much effort, at least point to a web site that outlines that reasoning. \n \n As I said before, if you don't want to go through the effort to support your claims with more detail, then I don't feel like going through the effort with you either and would prefer to deal with people who DO at least try to support their views, such as Symbiote. This is my last appeal. After this, if I see no detail in your posts, I will silently jump out of this discussion and it will be left as it is - you making claims without supporting them with more detailed arguements, and my unsuccessful attempts at trying to get you to describe your view in some reasonable detail.\n\n \n You have said it is difficult several times. This is the second time I have seen such a fallacy it seems rare. The opponent argues that support given may be invalid because it is not specific.\n \n Individual Rights &mdash; AynRand Lexicon this is morality in the social context I speak of, it is derived from the reciprocal rule you identified.\n \n I will have you know that I believe it is you that must support the idea that morality is subjective, I do not need to argue with you for my own belief I am already sure that I am right. Therefore if you wish to stop arguing do so and stop wasting my time.", 
   {}, 
   393064, 
   null, 
   1267576140.0
  ], 
  [
   393099, 
   null, 
   "Another opinion", 
   "I will have you know that I believe it is you that must support the idea that morality is subjective, I do not need to argue with you for my own belief I am already sure that I am right. Therefore if you wish to stop arguing do so and stop wasting my time.\n\n It is surprising for me to hear that you thought that the goal of this discussion was for me to try to convince you of my views and that this was the reason for you putting all the burden of proof on me. As with the great majority of discussions on this forum, my goals are mainly two-fold: 1) to be a propopent of my views to the more general audience of readers, often in the context of also arguing against opposing views and 2) with those opponents who are open to actual full discussion, to try to reason out the truth or compromise, as best we can, despite differences. \n \n If you think that these debates are all about others making efforts at convincing you whenever you participate, then you are doomed to be very often disappointed and you will also never convince others. However, if your goal is simply to express your opinion and you don't care about convincing readers, then fine - go ahead. Such mere expressions of opinion without full effort at support are posts that I will now happily ignore....", 
   {}, 
   393095, 
   null, 
   1267578600.0
  ], 
  [
   393106, 
   null, 
   "Freedom", 
   "It is surprising for me to hear that you thought that the goal of this discussion was for me to try to convince you of my views and that this was the reason for you putting all the burden of proof on me. As with the great majority of discussions on this forum, my goals are mainly two-fold: 1) to be a propopent of my views to the more general audience of readers, often in the context of also arguing against opposing views and 2) with those opponents who are open to actual full discussion, to try to reason out the truth or compromise, as best we can, despite differences. \n \n If you think that these debates are all about others making efforts at convincing you whenever you participate, then you are doomed to be very often disappointed and you will also never convince others. However, if your goal is simply to express your opinion and you don't care about convincing readers, then fine - go ahead. Such mere expressions of opinion without full effort at support are posts that I will now happily ignore....\n\n emoticon_xhoho emoticon_xbye", 
   {}, 
   393099, 
   null, 
   1267586940.0
  ], 
  [
   402400, 
   null, 
   "winklemarie", 
   "what 're u saying dear?\n b.s is a better way of saying it!!!!", 
   {}, 
   393106, 
   null, 
   1274335140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Reason, religion, logic, and morality", 
  "url": "http://www.4forums.com/political/challengers-corner/13054-reason-religion-logic-morality.html", 
  "breadcrumbs": [
   "Challengers Corner"
  ], 
  "id_number": 13054, 
  "discussion_files": [
   [
    "7563.html", 
    "http://www.4forums.com/political/challengers-corner/13054-reason-religion-logic-morality-print.html"
   ], 
   [
    "7564.html", 
    "http://www.4forums.com/political/challengers-corner/13054-reason-religion-logic-morality-4-print.html"
   ], 
   [
    "7565.html", 
    "http://www.4forums.com/political/challengers-corner/13054-reason-religion-logic-morality-3-print.html"
   ], 
   [
    "7566.html", 
    "http://www.4forums.com/political/challengers-corner/13054-reason-religion-logic-morality-2-print.html"
   ]
  ], 
  "identifier": 13054
 }
]