[
 [
  [
   363606, 
   null, 
   "jazyjason", 
   "By Ali Davis, Contributing writer 08.01.2009 5:10pm EDT\n News & Politics\n \n A gunman wearing black began shooting at a Tel Aviv gay and lesbian center called Café Noir Saturday night, killing three people and wounding at least eight more - other reports put the number of wounded as high as 15.\n \n The shooter walked into the center during a meeting for LGBT teens. Most of the victims were very young, and many were not yet out to their families.\n \n Police are searching for the gunman, and believe the incident was a homophobic attack rather than a part of the ongoing Israel-Palestine conflicts.\n \n Tel Aviv has an active LGBT scene, but several conservative groups in Israel frown on homosexuality.\n \n The Jerusalem Post reports that police have ordered the closing of gay clubs all over the city as a safety precaution, and that one of the people killed was a youth counselor.\n \n There is a short version of the story up at Reuters.\n \n A story on Ynet News indicates that the attack took place during a regular meeting for LGBT teenagers. At least one witness says the gunman was masked.", 
   {
    "post_info": {
     "post_title": "Three Dead After Shooting at Tel Aviv LGBT Youth Center"
    }
   }, 
   null, 
   null, 
   1249263540.0
  ], 
  [
   363608, 
   null, 
   "jazyjason", 
   "Once again the violence escalates and young LGBT teens are slaughtered... Just another sign of the ongoing struggle even for our very right to live...", 
   {}, 
   363606, 
   null, 
   1249263660.0
  ], 
  [
   363703, 
   null, 
   "ServantOfChrist", 
   "Once again the violence escalates and young LGBT teens are slaughtered... Just another sign of the ongoing struggle even for our very right to live...\n\n \n Oh, puh-leeeeze. emoticon_xdonnoemoticon_xdonno\n \n Get a grip, jazy - there is no evidence whatsoever that this was in any way motivated by the people he shot being sodomists. \n \n They haven't even caught the dang killer yet, let alone learned his motives (far more likely it was someone who hated Jews given the area we're talking about!), and here you are moaning about your poor little fellows in your degenerate lifestyles \"struggling\" for your \"right to live\". Give me a break. emoticon_xdonnoemoticon_xdonnoemoticon_xdonno", 
   {}, 
   363608, 
   null, 
   1249320780.0
  ], 
  [
   363720, 
   null, 
   "foundit66", 
   "Oh, puh-leeeeze. emoticon_xdonnoemoticon_xdonno\n Get a grip, jazy - there is no evidence whatsoever that this was in any way motivated by the people he shot being sodomists. \n\n He goes to a GAY AND LESBIAN CENTER, and you refuse to admit his motivation is based on anti-gay prejudice???\n \n None are so blind as those that refuse to see....\n \n With things like that, people like you do more damage to your own cause ...", 
   {}, 
   363703, 
   null, 
   1249326900.0
  ], 
  [
   363722, 
   null, 
   "CUNxTime", 
   "Oh, puh-leeeeze. emoticon_xdonnoemoticon_xdonno\n \n Get a grip, jazy - there is no evidence whatsoever that this was in any way motivated by the people he shot being sodomists. \n \n They haven't even caught the dang killer yet, let alone learned his motives (far more likely it was someone who hated Jews given the area we're talking about!), and here you are moaning about your poor little fellows in your degenerate lifestyles \"struggling\" for your \"right to live\". Give me a break. emoticon_xdonnoemoticon_xdonnoemoticon_xdonno\n\n \n Wow, jesus must be smiling down upon you, Servant of Christ. For you certainly exemplify all the virtue and splendor befitting of a disciple of the son of man. What empathy! What righteousness! You should be held up as a great example of the teachings of Christ to all of his followers. Such compassion and humility! ER is right, without the moral leadership of people like yourself, humanity would be lost indeed. I'm sure there is a special place set aside for ones such as you. Amen!", 
   {}, 
   363703, 
   null, 
   1249328040.0
  ], 
  [
   363723, 
   null, 
   "Lurch907", 
   "Who gives a damn why this maniac did what he did. I, for one, couldn't care less why he did it. This person needs to be found, tried, then if found guilty punished to the full extent of the law (my preference would be execution, leads to an amazingly low reviticizm (sp) rate). \n This is why \"hate crime legislation\" is so stupid. A human life is a human life, the bs justification someone uses to unjustly harm another person shouldn't matter in the slightest. Punish all of them as harshly as possible.", 
   {}, 
   363722, 
   null, 
   1249328580.0
  ], 
  [
   363725, 
   null, 
   "foundit66", 
   "Who gives a damn why this maniac did what he did. I, for one, couldn't care less why he did it. This person needs to be found, tried, then if found guilty punished to the full extent of the law (my preference would be execution, leads to an amazingly low reviticizm (sp) rate). \n This is why \"hate crime legislation\" is so stupid. A human life is a human life, the bs justification someone uses to unjustly harm another person shouldn't matter in the slightest. Punish all of them as harshly as possible.\n\n And thus prison overcrowding reaches all time highs...\n emoticon_frazzled\n \n The justification for hate crimes (which is where I assume you want to change the topic of this thread to) has been repeatedly explained. Our courts have LONG (back to the common law system) utilized motive as a factor in sentencing.\n Some people seem to have NO PROBLEM with motive being used as a factor in sentencing, until it comes to \"hate crimes\". A partisanship I find rather fascinating...\n \n With hate crimes, the crime is not just committed against the individual, but rather a message is being sent (and received) to the community which shares the characteristic that was targeted in the attack.\n \n A hate crime was committed on September 11th.\n That message was received loud and clear, and we reacted accordingly.\n By the lack of logic espoused by some here, should we have simply treated that attack as a multiple murder count?\n emoticon_xdonno\n \n Hate crime legislation is based on a simple recognition throughout American history that the MOTIVE OF A CRIME should be considered during sentencing.\n The people democratically tell the government that they recognize the terroristic message being sent to blacks, whites, Jews, Christians, gays, etc, and they want the sentence increased appropriately.", 
   {}, 
   363723, 
   null, 
   1249329180.0
  ], 
  [
   363732, 
   null, 
   "Lurch907", 
   "And thus prison overcrowding reaches all time highs...\n emoticon_frazzled\n\n \n Actually if you read my post you will notice I advocated not putting this maniac in jail, at least not for long.\n \n \nThe justification for hate crimes (which is where I assume you want to change the topic of this thread to) has been repeatedly explained. Our courts have LONG (back to the common law system) utilized motive as a factor in sentencing.\n\n \n I didn't change a thing, JJ's post was clearly about a \"hate crime\". The only reason motive is considered is because judges are given latitude on sentencing within a range prescribed by penal code. This in my opinion is a problem, it leads to judges increasing or decreasing sentences based on their oopinion of the crime. Our penal code should be more stringent in this regard. But I agree that motive has been used in the past during sentencing, I disagree that it should be.\n \n \nSome people seem to have NO PROBLEM with motive being used as a factor in sentencing, until it comes to \"hate crimes\". A partisanship I find rather fascinating...\n\n \n While this may be true for \"some people\" who ever they are, it does not apply to me.\n \n \nWith hate crimes, the crime is not just committed against the individual, but rather a message is being sent (and received) to the community which shares the characteristic that was targeted in the attack.\n\n \n If a message is intended or not is irrelevent unless that person has made direct threats against someone. Making direct threats is against the law and should be punished accordingly. However, you cannot punish someone for what they think. This person may well have hated gay people, thats not criminal. Shooting people is criminal.\n \n \nA hate crime was committed on September 11th.\n That message was received loud and clear, and we reacted accordingly.\n By the lack of logic espoused by some here, should we have simply treated that attack as a multiple murder count?\n\n \n Seriously?? Are you really trying to compare this crime to an act of war on par with pearl harbor? This isnt even close enough to be an apples to oranges comparison, your comparing apples to elephants.\n \n \nHate crime legislation is based on a simple recognition throughout American history that the MOTIVE OF A CRIME should be considered during sentencing.\n The people democratically tell the government that they recognize the terroristic message being sent to blacks, whites, Jews, Christians, gays, etc, and they want the sentence increased appropriately. \n\n \n All hate crime legislation does is make certain people worth more as victims than others. It determines that a criminal that kills a room full of gays is worse than a criminal that kills a room full of school children. This type of thinking is wrong at the most basic level. All people's well being should have the same value in a justice system.\n \n Tell me this foundit, should this maniac be punished less if had shot up a random room of people?", 
   {}, 
   363725, 
   null, 
   1249332840.0
  ], 
  [
   363735, 
   null, 
   "foundit66", 
   "Actually if you read my post you will notice I advocated not putting this maniac in jail, at least not for long.\n\n I refer to the reality that we actually live in.\n Any execution sentence is automatically appealed, ad nausieum. \n \n \n \nI didn't change a thing, JJ's post was clearly about a \"hate crime\".\n\n JJ's post was clear as to the MOTIVE.\n Where did he say \"hate crime\"???\n \n \n \nThe only reason motive is considered is because judges are given latitude on sentencing within a range prescribed by penal code.\n\n ROFLMAO!\n The reason motive is considered is because SOCIETY WANTS motive considered, based on a long-standing tradition of doing so.\n We don't \"give latitude\".\n Historical precedent shows society WANTS it considered...\n \n \n \nThis in my opinion is a problem, it leads to judges increasing or decreasing sentences based on their oopinion of the crime.\n\n Not all crimes are created equal.\n We even have \"X killed Y\" charges that vary extremely based on aspects of the crime, like motive.\n Difference between manslaughter and murder, but I guess you would want them treated identically?\n \n \n \nOur penal code should be more stringent in this regard. But I agree that motive has been used in the past during sentencing, I disagree that it should be.\n\n Our society has always operated using motive as a reason.\n Why is it that people like you are ONLY seen speaking out against it when it comes to hate crimes?\n Why don't we see people like you demanding every manslaughter charge be treated regardless of motive =< treated as murder?\n \n \n \nIf a message is intended or not is irrelevent unless that person has made direct threats against someone.\n\n Irrelevant to you.\n People on the receiving end of those threats, and the vast majority of society who sympathize and recognize the heinous nature of that \"directed threat\", disagree...\n \n \n \nMaking direct threats is against the law and should be punished accordingly. However, you cannot punish someone for what they think. This person may well have hated gay people, thats not criminal. Shooting people is criminal.\n\n And out parades this tired fallacy.\n People are punished FOR THEIR ACTIONS.\n If John hates a gay person, but does not assault, that's not illegal.\n If John hates a gay person and commits assault, that's illegal.\n \n It's the ASSAULT which is illegal\n Mitigating factors looked at during SENTENCING are not made illegal.\n \n \n \nSeriously?? Are you really trying to compare this crime to an act of war on par with pearl harbor? This isnt even close enough to be an apples to oranges comparison, your comparing apples to elephants.\n\n And obviously you do understand and sympathize with the underlying element of hate crimes, when it's directed at a group like Americans....\n \n I think you failed to recognize my point.\n My point is that UNDER YOUR ideology that all murders are committed equally, the issues should be treated the same.\n \n \n \nAll hate crime legislation does is make certain people worth more as victims than others. It determines that a criminal that kills a room full of gays is worse than a criminal that kills a room full of school children. This type of thinking is wrong at the most basic level. All people's well being should have the same value in a justice system.\n\n Another fallacy routinely employed by those opposed to hate crimes...\n How does it make \"certain people worth more as victims\" when EVERYBODY IS COVERED?\n Anti-white hate crimes exist.\n Anti-black hate crimes exist.\n Anti-gay hate crimes exist.\n Anti-straight hate crimes exist.\n \n ANYBODY who has a race, gender, sexual orientation, religion, etc can be a victim of a hate crime.\n So if Jack attacks a straight guy because he is straight, and John attacks a gay guy because the gay guy took his parking spot, does that mean that Jack's straight guy is \"worth more\"?\n \n Your commentary on \"worth more\" shows a bizarre look at crime and punishment...\n \n \n \nTell me this foundit, should this maniac be punished less if had shot up a random room of people?\n\n He should be punished for a hate crime against gays the same way he should be punished for a hate crime against straights.\n Our society already \"punishes less\" for different victims that are just as dead.\n For some reason, you want to treat that as some crime against reason... emoticon_xdonno\n \n If the crime is shooting up a random room of people, then there is no targeted terroristic threat. Ergo, less of a crime.", 
   {}, 
   363732, 
   null, 
   1249336260.0
  ], 
  [
   363744, 
   null, 
   "Lurch907", 
   "I refer to the reality that we actually live in.\n Any execution sentence is automatically appealed, ad nausieum.\n\n \n Agreed, an area of our justice system that does need reform.\n \n \nThe reason motive is considered is because SOCIETY WANTS motive considered, based on a long-standing tradition of doing so.\n We don't \"give latitude\".\n Historical precedent shows society WANTS it considered...\n\n \n Do you have some poll or study that backs this or is it only your opinion? Also, just because \"society\" wants something doesn't make it just, at one point \"society\" thought slavery was a good idea.\n \n \nNot all crimes are created equal.\n We even have \"X killed Y\" charges that vary extremely based on aspects of the crime, like motive.\n Difference between manslaughter and murder, but I guess you would want them treated identically?\n\n \n Wrong, the difference between manslaughter and murder has nothing to do with motive. In simple terms the difference is premeditation. The only major crime I am aware of where motive is a determining factor, in the charges, are \"hate crimes\".\n \n \nWhy is it that people like you are ONLY seen speaking out against it when it comes to hate crimes?\n\n \n Don't use the term \"people like you\" when you obviously don't know me. I've already said I don't think motive should be used as a factor in sentencing, in any crime.\n \n \nWhy don't we see people like you demanding every manslaughter charge be treated regardless of motive =< treated as murder?\n\n \n Because these are two different crimes. Differenciated by the how and when, not the why. For example, if a drunk driver gets in an accident and some one is killed its manslaughter, he was negligent but there is no intent to kill or premeditation. If someone executes a plan to hunt down the man that deflowered his daughter its murder, intent to kill and premeditation.\n \n \nPeople are punished FOR THEIR ACTIONS.\n If John hates a gay person, but does not assault, that's not illegal.\n If John hates a gay person and commits assault, that's illegal.\n \n It's the ASSAULT which is illegal\n Mitigating factors looked at during SENTENCING are not made illegal.\n\n \n Thank you for repeating what I already said. However, as I've also already said, I don't think motive should be one of those mitigating factor. I agree that it is one, but I don't think it should be. Hence, I don't support hate crime legislation.\n \n \n \nI think you failed to recognize my point.\n My point is that UNDER YOUR ideology that all murders are committed equally, the issues should be treated the same.\n\n \n Yes, that is what I'm saying, however your comparison didn't point that out. Let me give you a better one. It is my opinion that a nutbar that walks into a room full of gay people and starts shooting should get the exact same punishment as a nutbar that walks into a room of school children and starts shooting.\n \n \nIf the crime is shooting up a random room of people, then there is no targeted terroristic threat. Ergo, less of a crime.\n\n \n This statement pretty much sums up the problem with hate crime legislation. I challenge you to explain to a victims family why the person that murdered their child deserves less punishment because of the reason they killed. Might I suggest you wear a helmet w/ a facemask. Murder is murder is murder the why is irrelevant.\n \n Also, why isn't this a terroristic threat? Isn't it a threat against random people? Isn't every strong armed robbery a terroristic threat against people with valuable things? Under that theory every crime is a hate crime.", 
   {}, 
   363735, 
   null, 
   1249339200.0
  ], 
  [
   363756, 
   null, 
   "jazyjason", 
   "Oh, puh-leeeeze. emoticon_xdonnoemoticon_xdonno\n \n Get a grip, jazy - there is no evidence whatsoever that this was in any way motivated by the people he shot being sodomists. \n \n They haven't even caught the dang killer yet, let alone learned his motives (far more likely it was someone who hated Jews given the area we're talking about!), and here you are moaning about your poor little fellows in your degenerate lifestyles \"struggling\" for your \"right to live\". Give me a break. emoticon_xdonnoemoticon_xdonnoemoticon_xdonno\n\n \n \n It was at an LGBT youth center! What else do you think the motivation was? Oh I get it, because they were all ###### you don't give two shits about the lives lost due to senseless hate. I just love how your such an ideal spitting image of the teachings of Christ... what a joke..", 
   {}, 
   363703, 
   null, 
   1249343460.0
  ], 
  [
   363758, 
   null, 
   "foundit66", 
   "Agreed, an area of our justice system that does need reform.\n\n We agree on the circumstances, not on the \"need\" for reform.\n There is a justice adage that it is better that ten guilty men go free than one innocent man go to prison.\n I feel that this adage needs to be hiked up by another factor of ten before we can even CONSIDER executing somebody...\n \n \n \nDo you have some poll or study that backs this or is it only your opinion?\n\n I'll go you one step further.\n I'll show you a poll showing that the SPECIFIC HATE CRIMES APPLICATION of considering motive during the sentencing phase of a trial has majority support.\n 78% favor hate crimes legislation.\n Public Favors Expansion of Hate Crime Law to Include Sexual Orientation\n \n \n \nAlso, just because \"society\" wants something doesn't make it just, at one point \"society\" thought slavery was a good idea.\n\n In a democratic society, unless you can show how hate crimes legislation is unconstitutional, it is our American mandate that the public should get their way.\n Slavery is obviously a violation of MANY declaration of independence and constitutional mandates.\n Hate crimes? Not a violation.\n \n Look. You can introduce your values all you want. That's a good thing.\n But if all you've got is repeating your values, the fact that the government is enacting a different policy because MOST Americans have different values is going to be a legitimate point.\n \n \n \nWrong, the difference between manslaughter and murder has nothing to do with motive. In simple terms the difference is premeditation.\n\n And what is premeditation if not the thoughts that go into the MOTIVE of the crime???\n emoticon_wow\n Dude. You are talking about PEOPLE'S THOUGHTS in committing the crime.\n Either you want them to be considered, or you don't.\n Make up your mind.\n \n \n \nThe only major crime I am aware of where motive is a determining factor, in the charges, are \"hate crimes\".\n\n emoticon_xdonno\n Bypassing your error on \"manslaughter v murder\" for the moment, you are ignoring the issues of murder one vs murder two (etc)\n Voluntary vs Involuntary manslaughter.Manslaughter is a legal term for the killing of a human being, in a manner considered by law as less culpable than murder.\n \n The law generally differentiates between levels of criminal culpability based on the mens rea, or state of mind. This is particularly true within the law of homicide, where murder requires either the intent to kill, a state of mind called malice, or malice aforethought, which may involve an unintentional killing but with a willful disregard for life.Manslaughter - Wikipedia, the free encyclopedia\n \n We're still talking about the state of mind =< MOTIVE.\n \n \n \nDon't use the term \"people like you\" when you obviously don't know me. I've already said I don't think motive should be used as a factor in sentencing, in any crime.\n\n I use it cause it's 100% accurate.\n I have never seen you speak out against motive being used during sentencing.\n As I mentioned, the practice has a LONG history in the U.S. It is a standard practice.\n Judges use it MORE OFTEN as a standard practice, then they ever use it for \"hate crime\" purposes...\n \n I know what \"you've already said\".\n It doesn't address the issue of WHY you are only seen to \"say\" it when it comes to hate crimes issues, but there is never seen a thread on the HISTORICAL and MUCH MORE COMMON practice which violates your ideology...\n It's a bit like saying \"I don't think neighbors should have fences\", and then you complain about the BLACK neighbor having a fence, as you ignore NUMEROUS other fences in your neighborhood.\n \n \n \nBecause these are two different crimes. Differenciated by the how and when, not the why. For example, if a drunk driver gets in an accident and some one is killed its manslaughter, he was negligent but there is no intent to kill or premeditation. If someone executes a plan to hunt down the man that deflowered his daughter its murder, intent to kill and premeditation.\n\n Gee. Aren't you differentiating based on THOUGHT.\n MOTIVE.\n Is my MOTIVE to kill a person, or is it that the killing happened without the motive to kill a person?\n \n \n \nThank you for repeating what I already said.\n\n Dude. If you \"already said\" that, then you obviously failed to comprehend the meaning behind your own words.\n My point is that your claim of \"you cannot punish someone for what they think\" is obviously flawed.\n \n Earlier you talked about PREMEDITATION....\n Hmmm. That WOULD BE an example of WHAT PEOPLE THINK.\n Something YOU CLAIM people \"cannot\" be punished for.\n \n Yet you UPHOLD a distinction for punishing people for \"premeditation\" thought (to use your approach you showed in that section)...\n emoticon_xdonno\n \n \n \nYes, that is what I'm saying, however your comparison didn't point that out.\n\n It's interesting to note how you cut and paste around poignant parts of my post, to respond to snippets that build upon the point you redact...\n The point was obviously that when AMERICANS are the target, we recognize the terrorism.\n We DO NOT treat it as multiple killings, but rather it is ESCALATED in importance.\n \n \n \nLet me give you a better one. It is my opinion that a nutbar that walks into a room full of gay people and starts shooting should get the exact same punishment as a nutbar that walks into a room of school children and starts shooting.\n\n And I believe in giving a judge room to assign judgment for himself, guided by the observations and judgments of society.\n \n Let me guess.\n You state \"your opinion\", but when I point to many other people's opinion, suddenly it being an \"opinion\" doesn't matter as much?\n \n \n \nThis statement pretty much sums up the problem with hate crime legislation. I challenge you to explain to a victims family why the person that murdered their child deserves less punishment because of the reason they killed. Might I suggest you wear a helmet w/ a facemask. Murder is murder is murder the why is irrelevant.\n\n And you can explain to the community involved why the terrorism committed in the crime should be overlooked.\n Why Jack getting into a barroom fight and getting killed should be treated the same as people targeting John cause he's black and hanging him from a noose in front of a black church.\n \n Your argument is made out of emotional sensationalism.\n I can make the same counter-argument back at you.\n So when can I schedule you to speak at that black church?\n \n \n \nAlso, why isn't this a terroristic threat? Isn't it a threat against random people? Isn't every strong armed robbery a terroristic threat against people with valuable things? Under that theory every crime is a hate crime.\n\n You love to parade out the habitual fallacies...\n \"every crime is a hate crime\"...\n \n By that lack of logic, \"greenhouse gases\" must be good for the planet cause \"greenhouses\" are good for plants...\n emoticon_xdonno\n \n The issue you talk about there is the difference inbetween being in the wrong place at the wrong time...\n ... and being the \"wrong color\" ...\n \n If a guy goes to the post office and shoots people, it's not going to have the same reaction upon society as a guy who hates gays who goes to a gay center to shoot people...", 
   {}, 
   363744, 
   null, 
   1249343880.0
  ], 
  [
   363771, 
   null, 
   "ServantOfChrist", 
   "It was at an LGBT youth center! What else do you think the motivation was? Oh I get it, because they were all ###### you don't give two shits about the lives lost due to senseless hate. I just love how your such an ideal spitting image of the teachings of Christ... what a joke..\n\n \n IT WAS IN ISRAEL, PUNK! Have you not heard of the ISRAELI-PALESTINIAN CONFLICT going in IN THAT COUNTRY?!?!??!\n \n Until they catch the killer, nothing can be said about his motivation. If I go and shoot up a bowling alley when a bowling club is meeting, does that mean I'm committing a hate crime against bowlers? If I go shoot up a bank, I am commiting a hate crime because peopel are bankers? THINK ABOUT IT. Why do the Sodomists get special treatment when it comes to something like this? It's absolutely disgusting! :xcensoredemoticon_xbangheadxbanghead:xbanghead", 
   {}, 
   363756, 
   null, 
   1249352220.0
  ], 
  [
   363773, 
   null, 
   "ServantOfChrist", 
   " \n If a guy goes to the post office and shoots people, it's not going to have the same reaction upon society as a guy who hates gays who goes to a gay center to shoot people...\nWhy not? What if the guy going to the post office hates postal workers or people that don't send their mail by FedEx? What if his reason for shooting it up is to create fear among postal workers and patrons? Are they not as good and worthy as the Sodomists? Is that it?\n \n So in other words, from your statement here, we should give special treatment to the Sodomists, to hell with what the ACTUAL motivations of the shooter may be. :xcensoredemoticon_xbangheadxbanghead", 
   {}, 
   363758, 
   null, 
   1249352400.0
  ], 
  [
   363775, 
   null, 
   "Penfold", 
   "It truly is disgusting. We are repulsed by the actions of religious extremists everywhere.", 
   {}, 
   363771, 
   null, 
   1249352460.0
  ], 
  [
   363780, 
   null, 
   "CUNxTime", 
   "IT WAS IN ISRAEL, PUNK! Have you not heard of the ISRAELI-PALESTINIAN CONFLICT going in IN THAT COUNTRY?!?!??!\n \n Until they catch the killer, nothing can be said about his motivation. If I go and shoot up a bowling alley when a bowling club is meeting, does that mean I'm committing a hate crime against bowlers? If I go shoot up a bank, I am commiting a hate crime because peopel are bankers? THINK ABOUT IT. Why do the Sodomists get special treatment when it comes to something like this? It's absolutely disgusting! :xcensoredemoticon_xbangheadxbanghead:xbanghead\n\n \n Ok, even with your divine wisdom, Servant, you must be a bit distracted, I know perfecting your Christiness must be a full time job, so I can maybe help you out a bit. The killer attacked a group of gays at a gay hang out and they haven't caught him yet. Isn't it best to err on the side of caution and assume that there might still be someone out there trying to kill gays? Doesn't it make sense to you to assume that there's a good chance that the guy killed exactly the kind of person he wanted to and that he (or they may try again?). If a group of pastors got shot, I'm fairly sure you'd be on here talking about the heathen, amoral atheists and their quest to kill all the innocent, tolerant, loving sheppards....", 
   {}, 
   363771, 
   null, 
   1249354020.0
  ], 
  [
   363797, 
   null, 
   "foundit66", 
   "Why not? What if the guy going to the post office hates postal workers or people that don't send their mail by FedEx? What if his reason for shooting it up is to create fear among postal workers and patrons? Are they not as good and worthy as the Sodomists? Is that it?\n\n :xbanghead\n My gawd!\n The FBI DOCUMENTS how many people who hate gays commit crimes victimizing gays each year.\n I have NEVER heard of anybody killing people just cause they are postal workers.\n Can you give me any statistics on how many people are killed, motivated by prejudice against the post office?\n \n The two issues are NOT equal, nor should we blindly pretend that anti-post office hatred is as prominent as anti-gay hatred.", 
   {}, 
   363773, 
   null, 
   1249358160.0
  ], 
  [
   363813, 
   null, 
   "ServantOfChrist", 
   ":xbanghead\n My gawd!\n The FBI DOCUMENTS how many people who hate gays commit crimes victimizing gays each year.\n And that means that the guy that shot these Sodomizers in Israel (not the US sos your \"statistics\" are worthless) hated gays?\n \n I see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses. Couldn't be because they're, say, black, or jewish, or because the gunner :xcensored ing felt like killing someone. No, they're SPESHUL.\n \n Use some logic. emoticon_xbangheadxbanghead\n \n \nI\n have NEVER heard of anybody killing people just cause they are postal workers.\n \n \n\n Never heard of the phrase \"going postal\"? Never wonder what that phrase came from? You really are clueless, aren't you?\n \n\n Can you give me any statistics on how many people are killed, motivated by prejudice against the post office?\n \n The two issues are NOT equal, nor should we blindly pretend that anti-post office hatred is as prominent as anti-gay hatred.\n\n \n You're so full of BS, your teeth are brown.\n \n List of postal killings - Wikipedia, the free encyclopedia\n Just one from there: \nJuly 10, 1995, City of Industry, California: Bruce Clark, current employee and a postal clerk with twenty-five years employment with the USPS, subsequent to an argument, punched his supervisor in the back of the head at the City of Industry, California, mail processing center and left the work area. About ten minutes later, he returned to the work area with a brown paper bag in his hand. Upon being asked by his supervisor what was in the bag, he reportedly pulled out a .38 revolver and at close range fatally shot the supervisor twice, once in the upper body and once in the face. Two employees reportedly took the gun away from Bruce Clark and held him down until the police came. Seventy-five postal employees reportedly witnessed the shooting.\n\n \n In ANY case, I brought up the postal worker thing becuase it was the first thing that popped into my mind. IT WAS AN ANALOGY! It was to show how retarded it is to assume, with no evidence, that a particular shooting is targeting a group of people with \"hate\" just because it happened in a particular place.", 
   {}, 
   363797, 
   null, 
   1249366260.0
  ], 
  [
   363815, 
   null, 
   "foundit66", 
   "And that means that the guy that shot these Sodomizers in Israel (not the US sos your \"statistics\" are worthless) hated gays?\n\n Wow dude.\n I was giving an example. I thought that was obvious that since I was talking \"FBI\".\n \n Here's one article about Israel anti-gay violence / sentiment.\n Anti-Gay Riots in Israel\n \n \n \nI see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses. Couldn't be because they're, say, black, or jewish, or because the gunner :xcensored ing felt like killing someone. No, they're SPESHUL.\n\n My gawd man.\n I didn't say anything about the weight of the crime versus anything else.\n I just RECOGNIZED THE PROBABLE MOTIVE.\n \n And there you go with your whining routine, reading all sorts of b.s. into a simple recognition of what the probable motive was.\n \n \n \nNever heard of the phrase \"going postal\"? Never wonder what that phrase came from? You really are clueless, aren't you?\n\n Yes. I have heard of the phrase.\n What YOU don't seem to grasp is the TRUTH of my words.\n The \"going postal\" was an issue of WORK-place rage.\n It exists in numerous professions. I can show you some examples of military men \"going postal\".\n \n It includes killing co-workers, and the \"phrase\" root comes from an example that happens to involve co-workers who happened to be postal workers.\n \n \n \nIn ANY case, I brought up the postal worker thing becuase it was the first thing that popped into my mind. IT WAS AN ANALOGY! It was to show how retarded it is to assume, with no evidence, that a particular shooting is targeting a group of people with \"hate\" just because it happened in a particular place.\n\n I'm sorry, but your actions as \"retarded\" (as you put it) do not diminish the obvious connection.\n You don't go to a gay center to gun down postal workers.\n You don't go to a post office to gun down gays.\n \n You go to a gay center to gun down gays.\n \n \n In the big picture, some people react like SoC is reacting here to anti-gay violence.\n Instead of admitting how vile the action is, they immediately lash out at the victims.\n Kind of reminds me of Fred Phelps, who ironically considers himself a \"ServantOfChrist\" as well...", 
   {}, 
   363813, 
   null, 
   1249367160.0
  ], 
  [
   363816, 
   null, 
   "T.Q", 
   "Psst, SoC, your hatred is showing...", 
   {}, 
   363815, 
   null, 
   1249370880.0
  ], 
  [
   363819, 
   null, 
   "jazyjason", 
   "IT WAS IN ISRAEL, PUNK! Have you not heard of the ISRAELI-PALESTINIAN CONFLICT going in IN THAT COUNTRY?!?!??!\n \n Until they catch the killer, nothing can be said about his motivation. If I go and shoot up a bowling alley when a bowling club is meeting, does that mean I'm committing a hate crime against bowlers? If I go shoot up a bank, I am commiting a hate crime because peopel are bankers? THINK ABOUT IT. Why do the Sodomists get special treatment when it comes to something like this? It's absolutely disgusting! :xcensoredemoticon_xbangheadxbanghead:xbanghead\n\n \n Yes I have BREEDER, but in case you have not noticed both orthodox jews and radical Muslims in Isreal look down upon gays and condone such violence. Have you not heard of the same mindset by the same group of people in Iraq? Where gay Iraqi's are having their anuses shut with a surgical glue and being forced to eat laxatives until they die?\n \n Or maybe the ones shot execution style in the head? \n \n And thanks for calling me a sodomite you hypocritical bastard. It's people like you that undermine the true intentions of religion with your blatant hatred of others especially gays. The only sodomy committed here is your sodomizing of the true message of Christ which is to love your neighbor as yourself, to forgive, and help those less fortunate. \n \n But forgive me! I know it must be horrible having a ### tell you how to practice your own so called faith..", 
   {}, 
   363771, 
   null, 
   1249378680.0
  ], 
  [
   363822, 
   null, 
   "Accipiter", 
   "And that means that the guy that shot these Sodomizers in Israel (not the US sos your \"statistics\" are worthless) hated gays?\n \n I see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses. Couldn't be because they're, say, black, or jewish, or because the gunner :xcensored ing felt like killing someone. No, they're SPESHUL.\n \n Use some logic. emoticon_xbangheadxbanghead\n \n \n Never heard of the phrase \"going postal\"? Never wonder what that phrase came from? You really are clueless, aren't you?\n \n \n You're so full of BS, your teeth are brown.\n \n List of postal killings - Wikipedia, the free encyclopedia\n Just one from there: \n \n In ANY case, I brought up the postal worker thing becuase it was the first thing that popped into my mind. IT WAS AN ANALOGY! It was to show how retarded it is to assume, with no evidence, that a particular shooting is targeting a group of people with \"hate\" just because it happened in a particular place.\n\n If you want to learn something about yourself just google, homophobia repressed homosexuality.", 
   {}, 
   363813, 
   null, 
   1249384980.0
  ], 
  [
   363823, 
   null, 
   "Big_Bear_Scot", 
   "IT WAS IN ISRAEL, PUNK! Have you not heard of the ISRAELI-PALESTINIAN CONFLICT going in IN THAT COUNTRY?!?!??!\n \n Until they catch the killer, nothing can be said about his motivation. If I go and shoot up a bowling alley when a bowling club is meeting, does that mean I'm committing a hate crime against bowlers? If I go shoot up a bank, I am commiting a hate crime because peopel are bankers? THINK ABOUT IT. Why do the Sodomists get special treatment when it comes to something like this? It's absolutely disgusting! :xcensoredemoticon_xbangheadxbanghead:xbanghead\n\n \n \n Well the police in Israel have said this was not a Nationalist crime, so that this precludes that it is to do with the Israeli/Palestinian conflict.\n \n BBC NEWS | Middle East | Police hunt killer of Israel gays\n \n \nA police spokesman described the attack as \"criminal rather than nationalistic\". \n\n \n Also the fact that the target was a gay support centre, if the killer just wanted kill anyone he could have went to a bar or a shopping centre where there would be far more people.\n \n I am actually disgusted about your attitude here, some human beings have been killed. Instead of empathising with the victims and wanting justice, you have instead attacked Homosexuals for supposedly wanting 'special treatment'. How very 'Christian' of you, remember that Jesus said\n \n 'You shall love the Lord your God with all your heart, with all your soul, and with all your mind. This is the first and great commandment. And the second is like it: You shall love your neighbor as yourself'\n \n It seems your posts are dripping with hate for your neighbour.", 
   {}, 
   363771, 
   null, 
   1249386900.0
  ], 
  [
   363830, 
   null, 
   "Penfold", 
   "And that means that the guy that shot these Sodomizers in Israel (not the US sos your \"statistics\" are worthless) hated gays?\n \n I see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses. Couldn't be because they're, say, black, or jewish, or because the gunner :xcensored ing felt like killing someone. No, they're SPESHUL \n .....\n \n You're so full of BS, your teeth are brown.\n \n\n ......\n \n 7. Bigoted, racist, prejudiced or broad-brushed statements are not allowed.", 
   {}, 
   363813, 
   null, 
   1249394340.0
  ], 
  [
   363837, 
   null, 
   "ServantOfChrist", 
   "Well the police in Israel have said this was not a Nationalist crime, so that this precludes that it is to do with the Israeli/Palestinian conflict.\n \n BBC NEWS | Middle East | Police hunt killer of Israel gays\n \n \n The article also says: \"Tel Aviv has in the past been targeted in attacks by Palestinian militants but there was no suggestion that Saturday's attack had a political motive.\"\n \n \n There's no suggestion that it isn't either. The police here are doing the same thing you are: jumping to conclusions when they don't even know who DID IT.\n \n\n Also the fact that the target was a gay support centre, if the killer just wanted kill anyone he could have went to a bar or a shopping centre where there would be far more people.\n And would it have been called a hate crime \"targeting\" shoppers or drinkers? No? Then that merely shows the double standard you gays have for yourselves, thinking you're something special.\n \n \n\n I am actually disgusted about your attitude here, some human beings have been killed. Instead of empathising with the victims and wanting justice, you have instead attacked Homosexuals for supposedly wanting 'special treatment'. How very 'Christian' of you, remember that Jesus said\n \n 'You shall love the Lord your God with all your heart, with all your soul, and with all your mind. This is the first and great commandment. And the second is like it: You shall love your neighbor as yourself'\n \n It seems your posts are dripping with hate for your neighbour.\n\n \n I empathize with the victims - when this person is caught I expect him to be brought to full justice. What I DON'T agree with is the ### community telling us this is a hate crime by the mean old heterosexuals. We don't know the motive here.\n \n How do we know it wasn't a jilted butt-lover of one of the gays at the center? According to your article, they supposedly had pretty good knowledge of exactly where this place was and how to get into it. Sounds like some inside knowledge maybe. Perhaps they should look to their own gay friends.", 
   {}, 
   363823, 
   null, 
   1249400700.0
  ], 
  [
   363839, 
   null, 
   "ServantOfChrist", 
   "Yes I have BREEDER, \n Was that supposed to be an insult? How sad, and yet telling, that the Sodomisers would consider procreation and the continuation of the human race, (and the following of the Lord's commands to be fruitful and multiply) to be something that would be an \"insult\":xbanghead emoticon_xdonno\n \n \nbut in case you have not noticed both orthodox jews and radical Muslims in Isreal look down upon gays and condone such violence. Have you not heard of the same mindset by the same group of people in Iraq? Where gay Iraqi's are having their anuses shut with a surgical glue and being forced to eat laxatives until they die?\n \n Or maybe the ones shot execution style in the head? \nIn case you have not noticed, jews and palestinians kill each other constantly. Rather more likely than your conclusions.\n \n And in that case, how do you know it wasn't the jilted lover of one of the sodomizers at the club, getting revenge over getting tossed away for a different piece of butt-meat?\n \n You don't - and that's the whole point. you people are ascribing a motive before we have any facts or have even CAUGHT the guy. \n \n \nAnd thanks for calling me a sodomite you hypocritical bastard. It's people like you that undermine the true intentions of religion with your blatant hatred of others especially gays. The only sodomy committed here is your sodomizing of the true message of Christ which is to love your neighbor as yourself, to forgive, and help those less fortunate. \n \n But forgive me! I know it must be horrible having a ### tell you how to practice your own so called faith..\n\n \n I'm sorry, atheist, but you are in no position to be telling ME about Christ.", 
   {}, 
   363819, 
   null, 
   1249401120.0
  ], 
  [
   363840, 
   null, 
   "ServantOfChrist", 
   "......\n \n 7. Bigoted, racist, prejudiced or broad-brushed statements are not allowed.\n\n \n \"broad-brushedstatements\" - hmmm, so that's exactly what you people have been doing here..........", 
   {}, 
   363830, 
   null, 
   1249401180.0
  ], 
  [
   363845, 
   null, 
   "Brigid", 
   "The article also says: \"Tel Aviv has in the past been targeted in attacks by Palestinian militants but there was no suggestion that Saturday's attack had a political motive.\"\n \n \n There's no suggestion that it isn't either. The police here are doing the same thing you are: jumping to conclusions when they don't even know who DID IT.\n And would it have been called a hate crime \"targeting\" shoppers or drinkers? No? Then that merely shows the double standard you gays have for yourselves, thinking you're something special.\n \n \n \n I empathize with the victims - when this person is caught I expect him to be brought to full justice. What I DON'T agree with is the ### community telling us this is a hate crime by the mean old heterosexuals. We don't know the motive here.\n \n How do we know it wasn't a jilted butt-lover of one of the gays at the center? According to your article, they supposedly had pretty good knowledge of exactly where this place was and how to get into it. Sounds like some inside knowledge maybe. Perhaps they should look to their own gay friends.\n\n \n Run along and go play with your toys, Breeder.", 
   {}, 
   363837, 
   null, 
   1249403460.0
  ], 
  [
   363847, 
   null, 
   "MrWriteLA", 
   "Allow me to jump on the bandwagon here... \n \n I find it very telling that religiously-handled posters (who shall be nameless, but you know who you are) seem universally to be the most UN-christlike, nasty, sexually repressed, a-holes that post here. I mean, as soon as I see a handle like \"God's servant\" or \"Doing His duty,\" don't you just know he's going to be damning us all to hell in the next few posts? It's SO predictable. Get a life or a megaphone and stand out on the street! We're NOT BUYING IT! NO ONE LIKES YOU!! NO ONE IS GOING \"WOW, AM I CONVINCED! THANK GOD FOR THAT MAN!\"\n \n No. Really. Truly.\n \n Yeah, and Archangel? Do you not know that you are the longest-running joke here? Really? After all this time? Get a clue, dude.", 
   {}, 
   363840, 
   null, 
   1249404600.0
  ], 
  [
   363855, 
   null, 
   "foundit66", 
   "The article also says: \"Tel Aviv has in the past been targeted in attacks by Palestinian militants but there was no suggestion that Saturday's attack had a political motive.\"\n There's no suggestion that it isn't either. The police here are doing the same thing you are: jumping to conclusions when they don't even know who DID IT.\n\n And based on a LACK of evidence, you make assumptions...\n emoticon_xdonno\n \n \n \nAnd would it have been called a hate crime \"targeting\" shoppers or drinkers? No? Then that merely shows the double standard you gays have for yourselves, thinking you're something special.\n\n You are blind.\n If they had targeted a mosque, or a Jewish temple, or a Christian church, or a woman's center, then you would also be hearing declarations of \"hate crime\".\n If there was evidence that it was a Muslim who wanted to kill Jews, that would also be recognized as a hate crime.\n It is NOT JUST gays who are victims of hate crimes.\n \n Either you don't want to know that, or you don't want to honestly admit that.\n \n \n \nI empathize with the victims - when this person is caught I expect him to be brought to full justice. What I DON'T agree with is the ### community telling us this is a hate crime by the mean old heterosexuals. We don't know the motive here.\n\n What's funny is how much effort you have expended complaining about the gays calling it a \"hate crime\" like everybody else...\n ... as compared to ANY comment of sympathy towards the victims.\n \n ONLY WHEN YOUR LACK OF COMPASSION is pointed out do you put on a sad face...\n ... but in your very next breath, you continue to lash out at the gays.\n emoticon_xdonno\n Your crocodile tears fool noone.\n \n \n \nHow do we know it wasn't a jilted butt-lover of one of the gays at the center?\n\n Seriously dude.\n These \"butt-lover\" comments are needlessly derogatory, pointing to how much negative emotion you have in your heart towards gays.\n And your scenario would obviously lead to ONE VICTIM.\n This guy SHOT UP the center, trying to kill as many as he could.\n \n You deride gays for coming to the obvious conclusion, while you hatch half-baked alternative ideas that are just plain absurd!\n \n \n \nAccording to your article, they supposedly had pretty good knowledge of exactly where this place was and how to get into it. Sounds like some inside knowledge maybe. Perhaps they should look to their own gay friends.\n\n emoticon_wow\n emoticon_wow\n Within a minute, I was able to find out the contact info for this Tel Aviv GLBT center.\n Municipal GLBT Community Center, The City of Tel Aviv-Yafo in Tel-Aviv, Israel :: Directory Listing | CenterLink - The Community of LGBT Centers\n \n And \"how to get into\"????\n :xbanghead\n They're called DOORS. Do you think that GLBT centers are created like mazes with secret doors and secret rooms so you have to decipher your way in?\n :xbanghead\n \n Each time you open your mouth, you show how irrational you need to be in order to deny the obvious.", 
   {}, 
   363837, 
   null, 
   1249409400.0
  ], 
  [
   363899, 
   null, 
   "jazyjason", 
   "Was that supposed to be an insult? How sad, and yet telling, that the Sodomisers would consider procreation and the continuation of the human race, (and the following of the Lord's commands to be fruitful and multiply) to be something that would be an \"insult\":xbanghead emoticon_xdonno\n \n \n Umm yeah it was an insult because you called me a punk... Get a clue sherlock. As far as this BS of procreation etc. The world is over populated, and once again call the dead teens sodomites because their gay. Because it's not just living gays your insulting but those who have been murdered...\n Oh and the \"lords\" command that you stated, some gays and lesbians have done so and are raising families, but you would never dare give them any sort of rights or freedoms.\n \n \nIn case you have not noticed, jews and palestinians kill each other constantly. Rather more likely than your conclusions.\n \n And in that case, how do you know it wasn't the jilted lover of one of the sodomizers at the club, getting revenge over getting tossed away for a different piece of butt-meat?\n \n \n You just denying that the murdered occured because the victims were gay. Because you don;t want to shed one ounce of simpathy toward them at all. And as far as the butt meat comment well all I gotta say is if thats the best you can come up with as \"Insults\" to fags, better try a little harder mr kkkristian.\n \n \nYou don't - and that's the whole point. you people are ascribing a motive before we have any facts or have even CAUGHT the guy. \n \n \n \n I'm sorry, atheist, but you are in no position to be telling ME about Christ.\n Atheist? I happen to believe in god, and yeah I do have a position to be telling you about the true meaning of Christ's teachings. Your motives and brash comments scream that of a hypocritical hatemonger who loves nothing more that to feed their own ego's by branding a group of people as weak and the scourge of the earth to feed their own weak self esteem and lack of conscience. \n \n And for the record even though I am a brash, blunt flaming queen with a tiara and stiletto's, I still believe in the main teachings that christ put forth. Obviously you wear the name christian like a label. Doesn't mean you really are one... Remember actions speak louder than words, and umm what have you given as an example of your great faith? look back at your previous posts and tell us that's what christ would say in this situation...", 
   {}, 
   363839, 
   null, 
   1249424460.0
  ], 
  [
   363904, 
   null, 
   "jazyjason", 
   "I see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses. Couldn't be because they're, say, black, or jewish, or because the gunner :xcensored ing felt like killing someone. No, they're SPESHUL.\n \n You're so full of BS, your teeth are brown.\n\n \n \n Butt pirate hmm? maybe someone should steal your booty, it would probably make you lighten up a hell of alot more!!! As far as liking to rut with other men's anuses well I know you think being gay is all about the sex but sad to say it's not.\n \n Oh and just a question. Since you have been so graphic and detailed in your description of what gays like to do, or what is perceived as what we like to do. Is this like some sort of hint that you have a fantasy or something?\n \n Just asking cause I mean you obviously know so much about this sort of thing that I'm pretty sure you may have had some hands on experience maybe? I'm just shooting in the dark (boy for a nickel everytime I did that) but I\"m guessing that mr kkristian here might just be a repressed homosexual closet case who just needs to be shown a good time to shut him up..", 
   {}, 
   363813, 
   null, 
   1249425720.0
  ], 
  [
   363908, 
   null, 
   "chester", 
   "Butt pirate hmm? maybe someone should steal your booty, it would probably make you lighten up a hell of alot more!!! As far as liking to rut with other men's anuses well I know you think being gay is all about the sex but sad to say it's not.\n \n Oh and just a question. Since you have been so graphic and detailed in your description of what gays like to do, or what is perceived as what we like to do. Is this like some sort of hint that you have a fantasy or something?\n \n Just asking cause I mean you obviously know so much about this sort of thing that I'm pretty sure you may have had some hands on experience maybe? I'm just shooting in the dark (boy for a nickel everytime I did that) but I\"m guessing that mr kkristian here might just be a repressed homosexual closet case who just needs to be shown a good time to shut him up..\n\n \n I can't help but wonder if the SoC Puppet might just turn out to be a certain former Senator from a Rocky Mountain state.", 
   {}, 
   363904, 
   null, 
   1249426440.0
  ], 
  [
   363911, 
   null, 
   "jazyjason", 
   "I can't help but wonder if the SoC Puppet might just turn out to be a certain former Senator from a Rocky Mountain state.\n\n \n If it is then I feel embarrassed! Debating against such a high profile political figure? oh my! emoticon_emb", 
   {}, 
   363908, 
   null, 
   1249426920.0
  ], 
  [
   363929, 
   null, 
   "CUNxTime", 
   "\n And would it have been called a hate crime \"targeting\" shoppers or drinkers? No? \n\n \n \n Actually, the OP didn't even bring up RETRIBUTION for the murder at all, let alone asking for some sort of harsher than normal punishment. I find it telling that the OP was lamenting that people were killed and your holieness jumped in with demening insults all the while railing against special treatment. You've got to be one of the most ignorant SoBs on here.\n \n \n\n Then that merely shows the double standard you gays have for yourselves, thinking you're something special.\n\n \n \n I thought that Christ taught that we are all special?\n \n \n \nI empathize with the victims - when this person is caught I expect him to be brought to full justice. What I DON'T agree with is the ### community telling us this is a hate crime by the mean old heterosexuals. We don't know the motive here.\n\n \n Yes, you sound so empathetic esp. whilst calling the victims butt pirates and such.\n \n \n \n \n \nHow do we know it wasn't a jilted butt-lover of one of the gays at the center? .\n \n getting tossed away for a different piece of butt-meat?\n \n I'm sorry, atheist, but you are in no position to be telling ME about Christ.\n \n I see - anytime someon kills one of your fellow butt-pirates, it is such a travesty, and it HAS to be because they like to rut with other men's anuses\n\n \n \n I'm not a Christian, but I have studied the bible. However, maybe I missed something, so I'd like to ask someone who DOES (maybe Arch or ER) consider themselves a Christian if this is in keeping with Christ? Is this what the NT teaches the followers of Jesus? If I were to begin attending church, would I be told that this is the way I should think of my fellow humans (some of whom were just murdered in their youth? Is hatred and ridicule the SOP for Christ and his followers?", 
   {}, 
   363839, 
   null, 
   1249431540.0
  ], 
  [
   363939, 
   null, 
   "foundit66", 
   "I'm not a Christian, but I have studied the bible. However, maybe I missed something, so I'd like to ask someone who DOES (maybe Arch or ER) consider themselves a Christian if this is in keeping with Christ? Is this what the NT teaches the followers of Jesus? If I were to begin attending church, would I be told that this is the way I should think of my fellow humans (some of whom were just murdered in their youth? Is hatred and ridicule the SOP for Christ and his followers?\n\n \n Mat 5:22 But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment: and whosoever shall say to his brother, Raca, shall be in danger of the council: but whosoever shall say, Thou fool, shall be in danger of hell fire. \n \n Those are words from Jesus himself...", 
   {}, 
   363929, 
   null, 
   1249434720.0
  ], 
  [
   364020, 
   null, 
   "ServantOfChrist", 
   "Umm yeah it was an insult because you called me a punk... Get a clue sherlock. As far as this BS of procreation etc. The world is over populated, \n Well it wasn't very effective, as I do not consider it insulting in the least.\n \n \nand once again call the dead teens sodomites because their gay. Because it's not just living gays your insulting but those who have been murdered...\n I believe the term I sued was sodomists, not sodomites. Learn to read. And yes I did call them sodomists, becuase that's what they do.\n \n \nOh and the \"lords\" command that you stated, some gays and lesbians have done so and are raising families, but you would never dare give them any sort of rights or freedoms.\n\n Gays and lesibians, by definition, do not Follow the Lord's commands.\n \n \n\n You just denying that the murdered occured because the victims were gay. Because you don;t want to shed one ounce of simpathy toward them at all. And as far as the butt meat comment well all I gotta say is if thats the best you can come up with as \"Insults\" to fags, better try a little harder mr kkkristian.\nNo, I am denying hte CLAIM that the murders occured because the victims were gay because we DON'T KNOW the reason for them.\n \n \n \n Atheist? I happen to believe in god, and yeah I do have a position to be telling you about the true meaning of Christ's teachings. Your motives and brash comments scream that of a hypocritical hatemonger who loves nothing more that to feed their own ego's by branding a group of people as weak and the scourge of the earth to feed their own weak self esteem and lack of conscience. \nThere is no way you could be Christian with your unnatural lifestyle completely in denial of anything Christ-like. \n \n \nAnd for the record even though I am a brash, blunt flaming queen with a tiara and stiletto's,  I still believe in the main teachings that christ put forth. Obviously you wear the name christian like a label. Doesn't mean you really are one... Remember actions speak louder than words, and umm what have you given as an example of your great faith? look back at your previous posts and tell us that's what christ would say in this situation...\n\n This speaks quite clearly as to what you really are, and that, my friend, is not Christian.", 
   {}, 
   363899, 
   null, 
   1249493880.0
  ], 
  [
   364021, 
   null, 
   "ServantOfChrist", 
   "Actually, the OP didn't even bring up RETRIBUTION for the murder at all, let alone asking for some sort of harsher than normal punishment. I find it telling that the OP was lamenting that people were killed and your holieness jumped in with demening insults all the while railing against special treatment. You've got to be one of the most ignorant SoBs on here.\n \n \n\n \n Nor did I say that it brought up retribution for the murder. emoticon_xbouncer", 
   {}, 
   363929, 
   null, 
   1249494000.0
  ], 
  [
   364022, 
   null, 
   "ServantOfChrist", 
   "Butt pirate hmm? maybe someone should steal your booty, it would probably make you lighten up a hell of alot more!!! As far as liking to rut with other men's anuses well I know you think being gay is all about the sex but sad to say it's not.\n \n Oh and just a question. Since you have been so graphic and detailed in your description of what gays like to do, or what is perceived as what we like to do. Is this like some sort of hint that you have a fantasy or something?\n \n Just asking cause I mean you obviously know so much about this sort of thing that I'm pretty sure you may have had some hands on experience maybe? I'm just shooting in the dark (boy for a nickel everytime I did that) but I\"m guessing that mr kkristian here might just be a repressed homosexual closet case who just needs to be shown a good time to shut him up..\n\n \n As usual, anyone that points out the physical fact of what Gays do and criticises them is called a \"closet\" homosexual.\n \n I'm sorry, Jason, but despite what you may want to fantasize about me, I have not had gay sex nor will I ever have gay sex. Besides the fact that it is an abomination to the Lord, I consider it personally one of the most disgusting things one could ever do.", 
   {}, 
   363904, 
   null, 
   1249494120.0
  ], 
  [
   364023, 
   null, 
   "ServantOfChrist", 
   "And based on a LACK of evidence, you make assumptions...\n emoticon_xdonno\n \n \n \n You are blind.\n If they had targeted a mosque, or a Jewish temple, or a Christian church, or a woman's center, then you would also be hearing declarations of \"hate crime\".\n If there was evidence that it was a Muslim who wanted to kill Jews, that would also be recognized as a hate crime.\n It is NOT JUST gays who are victims of hate crimes.\n \n Either you don't want to know that, or you don't want to honestly admit that.\n \n \n \n What's funny is how much effort you have expended complaining about the gays calling it a \"hate crime\" like everybody else...\n ... as compared to ANY comment of sympathy towards the victims.\n \n ONLY WHEN YOUR LACK OF COMPASSION is pointed out do you put on a sad face...\n ... but in your very next breath, you continue to lash out at the gays.\n emoticon_xdonno\n Your crocodile tears fool noone.\n \n \n\n \n Alright then: Four dead, including gunman, in gym shooting - CNN.com\n \n Let us all take a moment to empathize with these victims of gym-attender hate.\n \n Once again the violence escalates and young, athletic, gym attending people are slaughtered... Just another sign of the ongoing struggle even for our very right to live...\n \n So. Will you join me, foundit, in proclaiming this hate crime against gym-goers to the world?", 
   {}, 
   363855, 
   null, 
   1249494360.0
  ], 
  [
   364025, 
   null, 
   "ServantOfChrist", 
   "\n \n Also the fact that the target was a gay support centre, if the killer just wanted kill anyone he could have went to a bar or a shopping centre where there would be far more people.\n \n\n \n Four dead, including gunman, in gym shooting - CNN.com\n \n Obviously this was a hate crime against gym-goers. The fact is the target was a gym building - if the killer wanted to kill anyone he would have went to a bar or to a shopping center where there would be far more people.\n \n Will you join me, Big_Bear_Scott, in proclaiming the outrage of this hate crime to the world?", 
   {}, 
   363823, 
   null, 
   1249494540.0
  ], 
  [
   364039, 
   null, 
   "foundit66", 
   "Alright then: Four dead, including gunman, in gym shooting - CNN.com\n Let us all take a moment to empathize with these victims of gym-attender hate.\n\n emoticon_frazzled\n It's amazing how you actually mock the idea of empathizing with murder victims...\n Guh-REAT Christianity you got going there!\n < end sarcasm <\n \n \n \nOnce again the violence escalates and young, athletic, gym attending people are slaughtered... Just another sign of the ongoing struggle even for our very right to live...\n So. Will you join me, foundit, in proclaiming this hate crime against gym-goers to the world?\n\n You ever heard of Occam's Razor?\n When you have SIGNIFICANT STATISTICS showing a large number of hate crimes against gays occurring on a DAILY basis, the prevalence of an anti-gay motive to crime is obvious.\n Can you point me to ANY such statistics for an \"anti-gym-goer hate crime\"?\n Can you point me to any sign that there even exists such a thing????\n \n You want to pretend the circumstances are similar, but they aren't.\n When you live in an area which has REPEATEDLY seen anti-gay violence, and you see more violence involving gay victims, the conclusion is obvious.\n If you can point to ANY violence that is MOTIVATED cause people hate gym-goers, THEN we can talk...", 
   {}, 
   364023, 
   null, 
   1249502940.0
  ], 
  [
   364045, 
   null, 
   "simone", 
   "Four dead, including gunman, in gym shooting - CNN.com\n \n Obviously this was a hate crime against gym-goers. The fact is the target was a gym building - if the killer wanted to kill anyone he would have went to a bar or to a shopping center where there would be far more people.\n \n Will you join me, Big_Bear_Scott, in proclaiming the outrage of this hate crime to the world?\n\n Another twisted Christian who hated women.", 
   {}, 
   364025, 
   null, 
   1249506000.0
  ], 
  [
   364115, 
   null, 
   "Big_Bear_Scot", 
   "Four dead, including gunman, in gym shooting - CNN.com\n \n Obviously this was a hate crime against gym-goers. The fact is the target was a gym building - if the killer wanted to kill anyone he would have went to a bar or to a shopping center where there would be far more people.\n \n Will you join me, Big_Bear_Scott, in proclaiming the outrage of this hate crime to the world?\n\n \n Unlike you I won't use a recent spate of killings as a debate tactic. It could be a hate crime because all the victims where women and the attacker talked about how he could not form relationships with Women\n \n BBC NEWS | Americas | US gym gunman's 'internet plans'\n \n Again I notice you did not show remorse for the victims, strange.", 
   {}, 
   364025, 
   null, 
   1249521600.0
  ], 
  [
   364128, 
   null, 
   "CUNxTime", 
   "Four dead, including gunman, in gym shooting - CNN.com\n \n Obviously this was a hate crime against gym-goers. The fact is the target was a gym building - if the killer wanted to kill anyone he would have went to a bar or to a shopping center where there would be far more people.\n \n Will you join me, Big_Bear_Scott, in proclaiming the outrage of this hate crime to the world?\n\n \n Don't try to drag others down into your hate-filled cesspool. I'd always operated under the misconception that Christianity was all about love for you fellow man and turning the other cheek. I guess I was wrong. Since you obviously live your life according to the teachings of Christ, I have to assume that he teaches hate, meanness, and torment of the weak. Jesus, I'm sure, would use the deaths of innocent women to mock others. You are a true and shining example for all to see. Amen!", 
   {}, 
   364025, 
   null, 
   1249523640.0
  ], 
  [
   364132, 
   null, 
   "jazyjason", 
   "Well it wasn't very effective, as I do not consider it insulting in the least.\n\n \n Well that's fine because I don't really listen to lunatics insult me too much either...\n \n \nI believe the term I sued was sodomists, not sodomites. Learn to read. And yes I did call them sodomists, becuase that's what they do.\n Learn to read? Oh ok because it came up as a typing error and right clicked it and used the top option.. I can read SoC, I have an above average college reading level so please don;t even try to to insult my intellect...\n \n \n \nGays and lesbians, by definition, do not Follow the Lord's commands.\n Really? Go to soulforce.org if you dare and see there are thousands of gay Christians. And by who's definition? Yours? Well according to your mind choked with delusions of grandeur and self righteousness, I would assume that would be the definition. Not the definition of clergy and ministers who support the LGBT community and embrace us as another one of gods creation.... \n \n \nNo, I am denying hte CLAIM that the murders occured because the victims were gay because we DON'T KNOW the reason for them.\n Yes we do SoC.... Why? Because sadly the LGBT community has been a target of violence and hate for decades.. \n \n \n \n There is no way you could be Christian with your unnatural lifestyle completely in denial of anything Christ-like.\n Actually this may shock you but I am a Christian. I was baptized at age nine of my own will, and I value the teachings of Christ and have accepted him as my lord and saviour. However, I know two sides to the faith and one is that of the original message of Christ which was empowered through his miracles which was love,forgiveness, hope, and the beatitudes.\n \n The other side I have seen is your side and the side of those drunk with power and self infatuation. Those that take the message of Christ and throw it out the window. Those that seek to slander and hurt, and judge. Those that use their so called faith in a corrupted state to demonize and ridicule, to prey upon a group of people they truly know nothing about.\n \n \n \nThis speaks quite clearly as to what you really are, and that, my friend, is not Christian.\n Well then judge lest ye be judged.... I may have a blunt attitude and even a rude demeanour, but that is because I have developed a catalyst to the sneers, and the insults, and the lies about me and other gays and lesbians. It is because I don't play games SoC and I know what it's like fighting for your life because I had to.\n \n Because I know that I could have ended up like SN Provost or Matthew Sheppard. I could have ended up dead. Dead because of blind ignorant hate becuase I am gay. Because I am slightly different yet not really at all. I love. I feel. I have compassion. I have hopes and dreams just like any other human alive. And thats the one connection you fail to see. The one connection that has been removed from your realization. were all Human. Were all here. Now struggling to make sense of this chaotic universe. To answer the why question.\n \n Thats why I don't judge others beliefs. Thats why I don;t call judism wrong or hinduism or islam wrong. They are all beliefs that are tied to one simple realization. That humans have hope. And it is hope that spurs us on in our daily lives.\n \n That things will get better, that tomorrow will shine a little brighter. Thats why I fight against the lies and the ignorance and the sheer indomitrable walls people put up against us. Because I do have hope that one day I can walk down the street holding my husbands hand and not be harassed. Or that I can even marry! \n \n Here is an excerpt from a speech given by Harvey Milk:\n \n You see there is a major difference-and it remains a vital difference-between a friend and a gay person, a friend in office and a gay person in office. Gay people have been slandered nationwide. We've been tarred and we've been brushed with the picture of pornography. In Dade County, we were accused of child molestation. It's not enough anymore just to have friends represent us. No matter how good that friend may be.\n \n The black community made up its mind to that a long time ago. That the myths against blacks can only be dispelled by electing black leaders, so the black community could be judged by the leaders and not by the myths or black criminals. The Spanish community must not be judged by Latin criminals or myths. The Asian community must not be judged by Asian criminals or myths. The Italian community should not be judged by the mafia myths. And the time has come when the gay community must not be judged by our criminals and myths.\n \n Like every other group, we must be judged by our leaders and by those who are themselves gay, those who are visible. For invisible, we remain in limbo-a myth, a person with no parents, no brothers, no sisters, no friends who are straight, no important positions in employment. A tenth of a nation supposedly composed of stereotypes and would-be seducers of children-and no offense meant to the stereotypes. But today, the black community is not judged by its friends, but by its black legislators and leaders. And we must give people the chance to judge us by our leaders and legislators. A gay person in office can set a tone, can command respect not only from the larger community, but from the young people in our own community who need both examples and hope.\n \n The first gay people we elect must be strong. They must not be content to sit in the back of the bus. They must not be content to accept pablum. They must be above wheeling and dealing. They must be-for the good of all of us-independent, unbought. The anger and the frustrations that some of us feel is because we are misunderstood, and friends can't feel that anger and frustration. They can sense it in us, but they can't feel it. Because a friend has never gone through what is known as coming out. I will never forget what it was like coming out and having nobody to look up toward. I remember the lack of hope-and our friends can't fulfill that.\n \n I can't forget the looks on faces of people who've lost hope. Be they gay, be they seniors, be they black looking for an almost-impossible job, be they Latins trying to explain their problems and aspirations in a tongue that's foreign to them. I personally will never forget that people are more important than buildings. I use the word \"I\" because I'm proud. I stand here tonight in front of my gay sisters, brothers and friends because I'm proud of you. I think it's time that we have many legislators who are gay and proud of that fact and do not have to remain in the closet. I think that a gay person, up-front, will not walk away from a responsibility and be afraid of being tossed out of office. After Dade County, I walked among the angry and the frustrated night after night and I looked at their faces. And in San Francisco, three days before Gay Pride Day, a person was killed just because he was gay. And that night, I walked among the sad and the frustrated at City Hall in San Francisco and later that night as they lit candles on Castro Street and stood in silence, reaching out for some symbolic thing that would give them hope. These were strong people, people whose faces I knew from the shop, the streets, meetings and people who I never saw before but I knew. They were strong, but even they needed hope.\n \n And the young gay people in the Altoona, Pennsylvanias and the Richmond, Minnesotas who are coming out and hear Anita Bryant on television and her story. The only thing they have to look forward to is hope. And you have to give them hope. Hope for a better world, hope for a better tomorrow, hope for a better place to come to if the pressures at home are too great. Hope that all will be all right. Without hope, not only gays, but the blacks, the seniors, the handicapped, the us'es, the us'es will give up. And if you help elect to the central committee and more offices, more gay people, that gives a green light to all who feel disenfranchised, a green light to move forward. It means hope to a nation that has given up, because if a gay person makes it, the doors are open to everyone.\n \n So if there is a message I have to give, it is that if I've found one overriding thing about my personal election, it's the fact that if a gay person can be elected, it's a green light. And you and you and you, you have to give people hope. Thank you very much.\n \n ", 
   {
    "unicode_changes_made": true
   }, 
   364020, 
   null, 
   1249524480.0
  ], 
  [
   364140, 
   null, 
   "foundit66", 
   "I'm betting SoC slinks back under his rock after this one...\n (Or maybe he won't, if he can't figure out that he should know better...)\n \n You know that \"gym\" shoot-up he keeps touting on. Claiming that we should say that the shooter was targeting \"gym-goers\"???\n \n Well, he didn't just target any \"gym-goer\".\n He specifically choose a WOMEN'S dance class to start his shooting spree in...\n \n And lo and behold, what is his motivation?\n HE HATES WOMEN!!!!\n Police found two typed notes in Sodini's bag at the scene, each reflecting his extreme frustration and depression with women. He complained of \"never having spent a weekend with a woman\" -- a theme shared in chilling blog posts reportedly written by the shooter. \n ....\n Sodini had apparently targeted the \"Latin impact\" dance class that was under way when he opened fire. \"He had the class schedule with that class circled,\" Moffat said. \n ....\n \"If you look at the blogs; this gentleman had severe mental problems. He had a deep and abiding hatred for women,\" Rendell said. Pennsylvania LA Fitness Gym Shooter Kept Online Diary in Plotting the Attack - ABC News\n \n So yes, ServantofChrist.\n That WAS a hate-crime too.\n He chose a WOMEN'S dance class to go shooting in, cause he hates women.\n And the guy who went to a GLBT center? Yeah. Probably cause he hates gays...\n \n ==========================================================\n \n As an add-on, another gem from the killer's profile...\n \n \n\"Maybe soon, I will see God and Jesus. At least that is what I was told. Eternal life does NOT depend on works. If it did, we will all be in hell,\" Sodini apparently wrote, before adding later, \"I was reading the Bible and The Integrity of God beginning yesterday, because soon I will see them.\" \n\n \n I guess by Archie's mentality, this helps establish \"a history\" of the Christian community in killing women...", 
   {}, 
   364132, 
   null, 
   1249527780.0
  ], 
  [
   364143, 
   null, 
   "jazyjason", 
   "I'm betting SoC slinks back under his rock after this one...\n (Or maybe he won't, if he can't figure out that he should know better...)\n\n \n \n I assumed that all cockroaches scatter when the lights turn on but I guess there is always some exception....", 
   {}, 
   364140, 
   null, 
   1249531680.0
  ], 
  [
   364855, 
   null, 
   "Matthew S", 
   "As usual, anyone that points out the physical fact of what Gays do and criticises them is called a \"closet\" homosexual.\n \n I'm sorry, Jason, but despite what you may want to fantasize about me, I have not had gay sex nor will I ever have gay sex. Besides the fact that it is an abomination to the Lord, I consider it personally one of the most disgusting things one could ever do.\n\n \n May I remind you that eating lobster is also an abomination to the Lord, but many christianists tend to over look that. Besides I thought you would cheer on the killer since according to the Jewish fairy tale book you call the bible, your God is calling for the death of gays and he was only doing as your God commands.", 
   {}, 
   364022, 
   null, 
   1249903080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Three Dead After Shooting at Tel Aviv LGBT Youth Center", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13061, 
  "discussion_files": [
   [
    "18129.html", 
    "http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center-print.html"
   ], 
   [
    "18130.html", 
    "http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center-4-print.html"
   ], 
   [
    "18131.html", 
    "http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center-3-print.html"
   ], 
   [
    "18132.html", 
    "http://www.4forums.com/political/gay-rights-debates/13061-three-dead-after-shooting-tel-aviv-lgbt-youth-center-2-print.html"
   ]
  ], 
  "identifier": 13061
 }
]