[
 [
  [
   364871, 
   null, 
   "OldSarge", 
   "Published by the LearnAboutGuns.com Author on Tuesday, July 22nd, 2008\n There is a lot of misinformation out there about gun control, gun rights, self defense, \"assault weapons,\" and the like. This article is intended to briefly set the record straight:\n \n Myth #1: Gun control stops criminals from having guns.\n Fact: Gun control laws do not keep guns out of criminals' hands.\n Gun control laws don't stop criminals from having guns, any more than the laws against murder stop criminals from committing that crime. A criminal who wants a gun will get a gun, whether they smuggle it in to the country, steal it, or buy it on the black market. The rampant gun related crime in cities such as Chicago and District of Columbia show that handgun bans and other strict gun control laws do not stop criminals from having guns, but instead only disarm the law abiding citizens.\n \n Myth #2: Guns are ineffective for self defense.\n Fact: Guns are the most effective means of self defense yet devised by human kind.\n A gun is able to effectively stop an attacker at a safe distance, before that attacker can injure or kill the law abiding citizen. A gun can be used by a small woman to stop a large man from attacking her, or by an elderly grandma to fend off a home invader. No other tool of self defense is as reliable, effective, and easy to use. Indeed I have seen people fire a gun for the first time, and consistently hit the target on their very first few shots. it is true that gun owners should seek training and practice to gain maximum proficiency with their firearm of choice, however this training is easily acquired at one's local gun store or range.\n \n Myth #3: Gun ownership is not an constitutional right.\n Fact: The Supreme Court of the United States has conclusively declared gun ownership for self defense to be an individual right.\n In the D.C. v. Heller case, the United States Supreme Court made clear that gun ownership for self defense is a right of law abiding, non mentally ill, Americans. This right is independent of service in the military or militia. This ruling is in keeping with the text of the constitution, and the intent of this country's founders.\n \n Myth #4: Guns are not needed since the police can be called.\n Fact: The police simply cannot get there quickly enough, or at all in some situations.\n Even for citizens that live right next door to the police station, the police can't respond quickly enough. That is because it takes less time for a criminal, who is already entering the home, to kill or seriously harm a home owner than it takes for the police to get to the home and stop the criminal. Natural disasters or civil unrest can also stretch a police department's resources to the breaking point, leaving citizens with no option but self defense.\n \n Myth #5: Only violent and uneducated people want to own guns.\n Fact: Gun ownership is a right that between one third and one half of all Americans exercise.\n This author is a well educated and peaceful gun owner, as are a great many gun owners. Law abiding citizens own guns for a variety of reasons, ranging from self defense to target shooting. Indeed it is the mark of an intelligent and peace loving person to make themselves ready and able to defend their home against criminals, while hoping that they never need to act in self defense.\n \n Myth #6: A home owner is 43 times more likely to be killed by their own gun than to kill an intruder.\n 65 lives are protected for every 2 lives lost.\n The long since discredited myth that gun ownership is more dangerous than beneficial was started by a Mr. Kellermann, in his flawed study \"Protection or Peril? An Analysis of Firearms-Related Deaths in the Home.\" There were numerous flaws in the study, including the fact that it only counted deaths, which are not a measure of self defense, any more than the number of suspected criminals shot dead by the police is a measure of police effectiveness. The fact is that 65 lives are protected for every 2 lives lost, which means that gun ownership is overwhelmingly safe and beneficial, both to the individual and to society. See Dr. Suter's paper \"Guns in the Medical Literature - A Failure of Peer Review.\" Journal of the Medical Association of Georgia. Published March 1994.\n \n Myth #7: Banning so called \"assault weapons\" will stop crime, since these guns are especially dangerous.\n Fact: The ban on so called \"assault weapons\" only pointlessly targets safety and cosmetic features of these ordinary guns.\n So-called \"assault weapons\" are no more dangerous than any other gun, and are used by criminals in well under 1% of crimes. A gun is defined as an assault weapon if it has certain cosmetic and safety features, and the presence of these features does not in any way make the gun more dangerous or useful to criminals. Bans on \"assault weapons\" are merely a way of eroding gun rights and further complicating gun laws, making it difficult for law abiding citizens to know and obey the law. It is also important to note that the so called \"assault weapons\" are NOT fully automatic machine guns, which have been very tightly regulated by the federal government since before World War II.", 
   {
    "post_info": {
     "post_title": "Gun Control Myths and Facts"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1249912680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun Control Myths and Facts", 
  "url": "http://www.4forums.com/political/gun-control-debates/13097-gun-control-myths-facts.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13097, 
  "discussion_files": [
   [
    "8036.html", 
    "http://www.4forums.com/political/gun-control-debates/13097-gun-control-myths-facts-print.html"
   ]
  ], 
  "identifier": 13097
 }
]