[
 [
  [
   365273, 
   null, 
   "jazyjason", 
   "Obama Honors Harvey Milk, 15 Others, with Highest Civilian Honor - Towleroad, More than gay news. More gay men\n \n \n I think it's time we all reflect on the sacrifice of Harvey Milk and stand proud that such a person of character and vision fought for our rights and paid the ultimate price. I will post a comment I made on towelroad ealier. Hope you all enjoy.\n \n \n \n I for one am very moved and touched that Harvey Milk has been honored and recognized as a pioneer and visionary for equal rights in this country. It does not matter if this is some sort of \"gesture\" toward the gay community. What matters most is that because of Harvey, because of his sacrifice, we now have a movement that has grown not just in the Castro or in San Fransisco, but all over the world.\n \n We owe it to Harvey and those who stood by him and shared his vision and beliefs to stop this pointless bickering amongst ourselves! Harvey himself said it is not about one man or power or any of that, but what matters the most is the movement and the US's.\n \n Have we forgotten that we are the US's? We have seen such advances in the last forty years on equal rights it is staggering. We have forgotten our past. We have forgotten about who we are. How much we had and still have to lose for being out and who we are.\n \n Instead of rallying and uniting for equal rights not just for gays but for all peoples, we have splintered and split into cliches and groups and classes amongst ourselves.\n \n We need to view this as a great honor to Mr. Milk. Because just think that 4 decades ago we wouldn't even dream of such a thing happening.\n \n I remember taking my first trip to San Fransisco earlier this year. I toured the Castro and the shops, and saw Milk in Castro theater on Harvey's birthday actually. And of course after crying at the end realizing how much some of us have sacrificed for the better good of all, I stepped onto Castro street and it kind of struck me that I was looking into history.\n \n We are making history today. We are living breathing proof of the movement that Harvey saw. We need to set aside our differences and our ego's and our opinions and see the bigger picture here.\n \n Hope. Hope is the key. Have we forgotten what Harvey charged us with? We have to give those out there hope. We have to give the gay Iraqi's and the young people and other minorities hope for a better tomorrow.\n \n That is our task appointed to us as part of this movement. I may only be 21, but I take Harvey's message to heart and am proud to say I am part of this movement as should everyone else. Honor Milk's legacy and be the better person in our struggle for equality for the benefit of all.\n \n Posted by: Jason | Aug 13, 2009 5:56:27 AM", 
   {
    "post_info": {
     "post_title": "Harvey Milk awarded Presidential Medal Of Freedom"
    }
   }, 
   null, 
   null, 
   1250166540.0
  ], 
  [
   365275, 
   null, 
   "jazyjason", 
   "Here is an excerpt from a speech given by Harvey Milk:\n \n You see there is a major difference-and it remains a vital difference-between a friend and a gay person, a friend in office and a gay person in office. Gay people have been slandered nationwide. We've been tarred and we've been brushed with the picture of pornography. In Dade County, we were accused of child molestation. It's not enough anymore just to have friends represent us. No matter how good that friend may be.\n \n The black community made up its mind to that a long time ago. That the myths against blacks can only be dispelled by electing black leaders, so the black community could be judged by the leaders and not by the myths or black criminals. The Spanish community must not be judged by Latin criminals or myths. The Asian community must not be judged by Asian criminals or myths. The Italian community should not be judged by the mafia myths. And the time has come when the gay community must not be judged by our criminals and myths.\n \n Like every other group, we must be judged by our leaders and by those who are themselves gay, those who are visible. For invisible, we remain in limbo-a myth, a person with no parents, no brothers, no sisters, no friends who are straight, no important positions in employment. A tenth of a nation supposedly composed of stereotypes and would-be seducers of children-and no offense meant to the stereotypes. But today, the black community is not judged by its friends, but by its black legislators and leaders. And we must give people the chance to judge us by our leaders and legislators. A gay person in office can set a tone, can command respect not only from the larger community, but from the young people in our own community who need both examples and hope.\n \n The first gay people we elect must be strong. They must not be content to sit in the back of the bus. They must not be content to accept pablum. They must be above wheeling and dealing. They must be-for the good of all of us-independent, unbought. The anger and the frustrations that some of us feel is because we are misunderstood, and friends can't feel that anger and frustration. They can sense it in us, but they can't feel it. Because a friend has never gone through what is known as coming out. I will never forget what it was like coming out and having nobody to look up toward. I remember the lack of hope-and our friends can't fulfill that.\n \n I can't forget the looks on faces of people who've lost hope. Be they gay, be they seniors, be they black looking for an almost-impossible job, be they Latins trying to explain their problems and aspirations in a tongue that's foreign to them. I personally will never forget that people are more important than buildings. I use the word \"I\" because I'm proud. I stand here tonight in front of my gay sisters, brothers and friends because I'm proud of you. I think it's time that we have many legislators who are gay and proud of that fact and do not have to remain in the closet. I think that a gay person, up-front, will not walk away from a responsibility and be afraid of being tossed out of office. After Dade County, I walked among the angry and the frustrated night after night and I looked at their faces. And in San Francisco, three days before Gay Pride Day, a person was killed just because he was gay. And that night, I walked among the sad and the frustrated at City Hall in San Francisco and later that night as they lit candles on Castro Street and stood in silence, reaching out for some symbolic thing that would give them hope. These were strong people, people whose faces I knew from the shop, the streets, meetings and people who I never saw before but I knew. They were strong, but even they needed hope.\n \n And the young gay people in the Altoona, Pennsylvanias and the Richmond, Minnesotas who are coming out and hear Anita Bryant on television and her story. The only thing they have to look forward to is hope. And you have to give them hope. Hope for a better world, hope for a better tomorrow, hope for a better place to come to if the pressures at home are too great. Hope that all will be all right. Without hope, not only gays, but the blacks, the seniors, the handicapped, the us'es, the us'es will give up. And if you help elect to the central committee and more offices, more gay people, that gives a green light to all who feel disenfranchised, a green light to move forward. It means hope to a nation that has given up, because if a gay person makes it, the doors are open to everyone.\n \n So if there is a message I have to give, it is that if I've found one overriding thing about my personal election, it's the fact that if a gay person can be elected, it's a green light. And you and you and you, you have to give people hope. Thank you very much.\n \n People don't talk like this anymore... So bold and encouraging. We could use another leader like Harvey right about now...", 
   {
    "unicode_changes_made": true
   }, 
   365273, 
   null, 
   1250166840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Harvey Milk awarded Presidential Medal Of Freedom", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13112-harvey-milk-awarded-presidential-medal-freedom.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13112, 
  "discussion_files": [
   [
    "9135.html", 
    "http://www.4forums.com/political/gay-rights-debates/13112-harvey-milk-awarded-presidential-medal-freedom-print.html"
   ]
  ], 
  "identifier": 13112
 }
]