[
 [
  [
   24546, 
   null, 
   "montalban", 
   "Evolutionaries have made many mistakes in the past. Is this another one?\n \n \"Human Evolution: The Most Recent Find\n In July 2002, anthropologists announced the discovery of a skull in Chad with \"an unusual mixture of primitive and humanlike features.\" The find was dubbed \"Toumai\" (the name give to children in Chad born close to the dry season) and was immediately hailed as \"the earliest member of the human family found so far.\" By October 2002, a number of scientists went on record to criticize the premature claim -- declaring that the discovery is merely the fossil of an ape. \"\n \n http://www.human--evolution.com/", 
   {
    "post_info": {
     "post_title": "Another mistake?"
    }
   }, 
   null, 
   null, 
   1070114760.0
  ], 
  [
   24635, 
   null, 
   "wja", 
   "Evolutionaries have made many mistakes in the past. Is this another one?\n \n \"Human Evolution: The Most Recent Find\n In July 2002, anthropologists announced the discovery of a skull in Chad with \"an unusual mixture of primitive and humanlike features.\" The find was dubbed \"Toumai\" (the name give to children in Chad born close to the dry season) and was immediately hailed as \"the earliest member of the human family found so far.\" By October 2002, a number of scientists went on record to criticize the premature claim -- declaring that the discovery is merely the fossil of an ape. \"\n \n http://www.human--evolution.com/\n\n monty, this source seems to be even dodgier than your previous one - Richard Milton. \n \n There is lively scientific discussion on the fossil and, because reality is not fairytale simplistic like creationism, it is difficult to make definitive linkages with limited evidence. But the scientists are arguing from the evidence, not from their religious beliefs.\n \n Does it matter if Toumai is not a direct ancestor of humans? No. It demonstrates that organisms existed at that time that possessed some features which are indicative of human and some which are indicative of ape. This is not surprising if one understands the theory of evolution but impossible to explain for creationism.\n \n Of course the source is playing very loosely with the truth. \"the fossil of an ape\". No one is saying that it is identical to modern extant apes, if it was so it would be immediately identifiable and there would be no controversy. So it might be an ancestor of modern apes. This is interesting because apes have also evolved, they have not remained in their present form over millions of years - something which creationists usually don't understand.\n \n So the incontrovertible story is that a skull has been discovered aged between 6 and 7 million years old which is uniquely different to all extant and extinct species but displays hominid and ape features.\n \n So monty, what's the creationist position on this fossil? Is it an ape fossil or a human fossil or some extinct \"kind\"? Try and give some evidence to support your assertion.\n \n And do you support the other errors and misrepresentations that your unnamed source from the webpage makes?", 
   {}, 
   24546, 
   null, 
   1070154600.0
  ], 
  [
   24637, 
   null, 
   "montalban", 
   "I neither support nor condemn them - unlike you, as I don't know enought about them.\n \n I was interested in more information about this find. I thank you for the reading material.\n \n (and I won't even point out all your spelling mistakes :) )\n \n I hope someone else might contribute a different point of view on it.", 
   {}, 
   24635, 
   null, 
   1070154780.0
  ], 
  [
   24638, 
   null, 
   "wja", 
   "I neither support nor condemn them - unlike you, as I don't know enought about them.\n \n I was interested in more information about this find. I thank you for the reading material.\n \n (and I won't even point out all your spelling mistakes :) )\n \n I hope someone else might contribute a different point of view on it.\n\n As you seem to have some difficult dealing with content rather than spelling mistakes, I will correct the spelling and typos. \n \n Now, are you going to engage in substantive debate or run away when your bluff is called. Are you going to offer the creationist position on the Toumai fossil. If creationism offers no explanation then it is useless, nothing more than \"goddunit\".", 
   {}, 
   24637, 
   null, 
   1070155980.0
  ], 
  [
   24666, 
   null, 
   "montalban", 
   "As you seem to have some difficult dealing with content rather than spelling mistakes, I will correct the spelling and typos. \n \n Now, are you going to engage in substantive debate or run away when your bluff is called. Are you going to offer the creationist position on the Toumai fossil. If creationism offers no explanation then it is useless, nothing more than \"goddunit\".\n\n \n a) I concentrate on spelling mistakes as you concentrate on other insults\n b) I am reading the content. I even thanked you for the information. \n \n What bluff? You hate me even when I'm being nice? honi soit qui mal y pense.", 
   {}, 
   24638, 
   null, 
   1070161200.0
  ], 
  [
   24716, 
   null, 
   "wja", 
   "Is this monty's peculiar way of saying that he doesn't want to seriously discuss an issue which he has raised?", 
   {}, 
   24666, 
   null, 
   1070183340.0
  ], 
  [
   24720, 
   null, 
   "montalban", 
   "Is this monty's peculiar way of saying that he doesn't want to seriously discuss an issue which he has raised?\n\n \n Why are you determined to read more into it. I said why. If you have reason to doubt, then that's more a reflection of your current state of mind.\n \n Look, I can understand you're upset, no one wants to talk to you about your beloved pseudo gene. I'll talk to you about pseudo echo, if you want. How's that sound?", 
   {}, 
   24716, 
   null, 
   1070194140.0
  ], 
  [
   24724, 
   null, 
   "wja", 
   "monty, you seem to have great difficulty keeping things straight. I have not mentioned pseudogenes in this thread. I have responded to the Toumai fossil and the stupid / dishonest article which you parroted. \n \n So, how does creationism explain the existence of the Toumai fossil? You do believe in creationism, don't you?", 
   {}, 
   24720, 
   null, 
   1070194980.0
  ], 
  [
   24726, 
   null, 
   "montalban", 
   "monty, you seem to have great difficulty keeping things straight. I have not mentioned pseudogenes in this thread. I have responded to the Toumai fossil and the stupid / dishonest article which you parroted. \n\n \n Yes you have responded. Big deal. Is it dishonest a site? So far I've only heard from you. The tone of your post - using 'parrotted' instead of quoted speaks volumes about your inability to have a discussion - which is what I was trying to promote.\n \n You don't want to discuss it -then don't. I've told you my stance. Deal with it.\n \n \nSo, how does creationism explain the existence of the Toumai fossil? You do believe in creationism, don't you?\n\n \n I don't know. What part of the bit where I said I'm trying to find these out escapes you? As I said, you're reading too much into this... When I've been firm in something -e.g. Darwin's Finch, Lurch being a loser, I've said so.", 
   {}, 
   24724, 
   null, 
   1070195280.0
  ], 
  [
   24883, 
   null, 
   "SLP", 
   "Creationaries have made many more mistakes than any evolutionist ever has. This is documented nearly daily, each and every time a creationary opens their mouth/types on a keyboard. Recently, a creationist (with a degree!) reported in a local 'seminar' in a church, of course, that the appendix is not vestigial because it secretes enzymes.\n \n The appendix secretes nothing, but the pew-warmers know no better and of course gobbled up the incompetence/lies of the creationist without question.\n \n Much as, I suspect, Monty does when he reads silly sites like the one mentioned or Milton the journalist and his paid membership to some geology-hobbyist organization...", 
   {}, 
   24726, 
   null, 
   1070291700.0
  ], 
  [
   25156, 
   null, 
   "lurch", 
   "When I've been firm in something -e.g. Darwin's Finch, Lurch being a loser, I've said so.\n \n A sure sign that I kicked your butt around the barn and that you are aware of it. Too bad you can't stand up and take it like a man.", 
   {}, 
   24883, 
   null, 
   1070396040.0
  ], 
  [
   25202, 
   null, 
   "montalban", 
   "Creationaries have made many more mistakes than any evolutionist ever has. This is documented nearly daily, each and every time a creationary opens their mouth/types on a keyboard. Recently, a creationist (with a degree!) reported in a local 'seminar' in a church, of course, that the appendix is not vestigial because it secretes enzymes.\n \n The appendix secretes nothing, but the pew-warmers know no better and of course gobbled up the incompetence/lies of the creationist without question.\n \n Much as, I suspect, Monty does when he reads silly sites like the one mentioned or Milton the journalist and his paid membership to some geology-hobbyist organization...\n\n \n \n If your theory is that because you guys have made mistakes, it's okay because we've made mistakes then you're actually dealing with another issue from the one I started here on this post... I'd be happy to debate it at another point in time.\n \n I wanted to know something about said fossil find. Only WJA posted anything to do with it... and even then he suspects some kind of Montalban-plot. :)", 
   {}, 
   24883, 
   null, 
   1070406540.0
  ], 
  [
   25209, 
   null, 
   "wja", 
   "If your theory is that because you guys have made mistakes, it's okay because we've made mistakes then you're actually dealing with another issue from the one I started here on this post... I'd be happy to debate it at another point in time.\n \n I wanted to know something about said fossil find. Only WJA posted anything to do with it... and even then he suspects some kind of Montalban-plot. :)\n\n \n No monty, I suspect you have nothing to offer in suppor tof your creationist position. You're only tactic is to try and discredit the theory of evolution in the mistaken belief that this will somehow support creationism - the logical error of the false dichotomy.\n \n There is no mistaking the fact that the Toumai fossil is not identical to extant humans or apes and shows a combination of features of the two groups. This is inconsistent with creationism but consistent with the theory of evolution.", 
   {}, 
   25202, 
   null, 
   1070411460.0
  ], 
  [
   25247, 
   null, 
   "montalban", 
   "No monty, I suspect you have nothing to offer in suppor tof your creationist position. You're only tactic is to try and discredit the theory of evolution in the mistaken belief that this will somehow support creationism - the logical error of the false dichotomy.\n .\n\n \n Well said. You're able to seek beyond your computer and know me too well. Well done WJA. Your abilities to perceive things is amazing. Truly amazing", 
   {}, 
   25209, 
   null, 
   1070425500.0
  ], 
  [
   25279, 
   null, 
   "wja", 
   "Well said. You're able to seek beyond your computer and know me too well. Well done WJA. Your abilities to perceive things is amazing. Truly amazing\n\n I have made a conjecture based on the observation of your behaviour.\n \n I note you have nothing of substance to say on the topic which you started.\n \n Co-incidentally I ran across an email debate on human fossils between Jim Foley and monty's hero, and sometimes source of dubious information, Richard Milton. The debate can be seen here . Monty's sources of information such as Milton and the website in his first post are so ignorant or dishonest that it is no wonder that monty holds such erroneous views about evolution. However monty also resists any attempt to educate himself when provided with the explanations and supporting references. Is such willful ignorance bliss?", 
   {}, 
   25247, 
   null, 
   1070429580.0
  ], 
  [
   25416, 
   null, 
   "montalban", 
   "I have made a conjecture based on the observation of your behaviour.\n \n I note you have nothing of substance to say on the topic which you started.\n \n\n \n congrats wja, I've been foiled again", 
   {}, 
   25279, 
   null, 
   1070511000.0
  ], 
  [
   25447, 
   null, 
   "Priscilla2", 
   "\n So, how does creationism explain the existence of the Toumai fossil? You do believe in creationism, don't you?\n\n \n I am only going to make one reply in this forum and then I am dropping it.\n \n First, I want to point out that no complete humanoid/ape fossils have ever been found. This is also the case here where we only have a skull.\n I also point out that DNA cannot be preserved through the fossil record, so we really have no way other than bone structure of identifying/classifying humanoid/ape remains. \n Finally, all dating relies on a constant state of decay (as well as an initial amount of radioactivity in the air). I further add to this that the amount of radioactivity in the air today has changed so much since the amount found in 1950 that all dating methods are based on the radioactivity in the air in 1950. Yet, scientists still assume that there was a constant rate from the first fossil until 1950. \n \n That aside, you ask what do creationists have to say about bones that are discovered that display both human and ape features to them (specifically skulls). Remember that for the longest time, evolutionists felt that people from Africa were more closely related to apes because of their facial structure. Humans like to classify, and we like to find things that are similar to us. :-0 looks like a persons face with his mouth open when it is really a colon, a hyphen, and a zero. This is the reason I believe scientists find skulls that are fossilized with both ape and human features. \n Creationists have also said that since people lived longer, they developed different features. I am not familiar with the research on this, but I believe that it is possible (at least to be researched). \n A final theory is based on the verse that states the &#8220;sons of God were breeding with the daughters of men&#8221;. We have lost what the true meaning of this verse is although there are many interpretations. It is very possible that the offspring of these unions were deformed to some extent (or maybe at that time they were considered more beautiful). Could they have been purposely doing a form of purifying the race through breeding? (Hitler was not the first with this idea). Alternatively, were they possibly trying to make bigger stronger humans? \n I do not necessarily believe the last two theories. My theory is based on what I have observed and the information I gave before it is from the evolutionary scientists&#8217; mouths. If you have research (in book or journal form) that disproves either of the Christian theories, feel free to let me know about it, I will check back from time to time. You will not find scientific information that can debate my theory since it is based on evolutionary science and psychology (which in my opinion is all the same thing).", 
   {
    "post_info": {
     "post_title": "You guys do gang up on Montalban!"
    }
   }, 
   24724, 
   null, 
   1070534700.0
  ], 
  [
   25454, 
   null, 
   "wja", 
   "I am only going to make one reply in this forum and then I am dropping it.\n\n \n Why? Because you know that your mistakes will be exposed? Yes, you are right.\n \n \nFirst, I want to point out that no complete humanoid/ape fossils have ever been found. \n\n Really? Do you assert this from your extensive knowledge of the topic? How about  Turkana Boy? Oh, the hands and feet are missing. Does that mean that all of the other anatomical evidence can be ignored for a 1.6 million year old fossil of a different humanoid species? How about Lucy, a 3.6 million year old humanoid fossil of a different Genus?\n \n \nThis is also the case here where we only have a skull.\n\n Duh! Oh, you mean there are no complete fossil skulls. Well there's plenty of near complete skulls here.\n \nI also point out that DNA cannot be preserved through the fossil record, so we really have no way other than bone structure of identifying/classifying humanoid/ape remains. \n\n A small amount of Neanderthal material has been recovered and analysis shows that they were a different species to Homo sapiens sapiens, with little or no interbreeding. Strange, only material from the youngest fossils can be recovered, not from the much older fossils. How do creationists explain that pattern?\n \nFinally, all dating relies on a constant state of decay (as well as an initial amount of radioactivity in the air). \n\n There is no evidence of any change in rate of radioactive decay rates (except in some extreme conditions for a couple of isotopes which are not used for radiometric dating). The assumption of nil initial daughter isotope in K-Ar and Ar-Ar dating has been tested on numerous occassions and found to be a reliable assumption. The isochron dating method does not rely on the initial concentrations of parent and daughter isotopes.\n \nI further add to this that the amount of radioactivity in the air today has changed so much since the amount found in 1950 that all dating methods are based on the radioactivity in the air in 1950. Yet, scientists still assume that there was a constant rate from the first fossil until 1950. \n\n You don't know much about this, do you? You appear to be referring to radiocarbon dating because the amount of atomspheric C14 increased mid-20th century from atomic bombs. However the method is calibrated with older material of known age. Other radiometric dating techniques are not affected by atmospheric radioisotopes.\n \n \nThat aside, you ask what do creationists have to say about bones that are discovered that display both human and ape features to them (specifically skulls). Remember that for the longest time, evolutionists felt that people from Africa were more closely related to apes because of their facial structure.\n\n Strange, I thought it was christians who thought they were closer to apes and this justified enslaving them.\n \nHumans like to classify, and we like to find things that are similar to us. :-0 looks like a persons face with his mouth open when it is really a colon, a hyphen, and a zero. This is the reason I believe scientists find skulls that are fossilized with both ape and human features. \n\n What nonsense. Could you tell the difference between a human and an ape skull? Why are there skulls with a mixture of characteristic features? Do you want me to find the article which shows how creationists who insist that all fossil skulls are either human or ape can't agree amongst themselves which ones are human and which are apes?\n \nCreationists have also said that since people lived longer, they developed different features. I am not familiar with the research on this, but I believe that it is possible (at least to be researched).\n\n Well, I wouldn't believe it just because a creationist says it. Where is the supporting evidence? Or do you simply accept any make-believe story becuase it confirms your religious beliefs?\n \nA final theory is based on the verse that states the \"sons of God were breeding with the daughters of men\". We have lost what the true meaning of this verse is although there are many interpretations. It is very possible that the offspring of these unions were deformed to some extent (or maybe at that time they were considered more beautiful). Could they have been purposely doing a form of purifying the race through breeding? (Hitler was not the first with this idea). Alternatively, were they possibly trying to make bigger stronger humans? \n\n Oh, do you accept make-believe stories? You aren't serious, are you?\n \nI do not necessarily believe the last two theories. My theory is based on what I have observed and the information I gave before it is from the evolutionary scientists' mouths. \n\n If it is from the mouths of evolutionary scientists then you can provide citations, can't you?\n \nIf you have research (in book or journal form) that disproves either of the Christian theories, feel free to let me know about it, I will check back from time to time. \n\n Well I believe it was all done by the fairies at the bottom of the garden. Show me a book or journal which disproves my theory.\n \nYou will not find scientific information that can debate my theory since it is based on evolutionary science and psychology (which in my opinion is all the same thing).\n\n You are sadly deluded.", 
   {
    "unicode_changes_made": true
   }, 
   25447, 
   null, 
   1070546580.0
  ], 
  [
   25457, 
   null, 
   "Mr Jack", 
   "Look at these skulls.\n \n http://www.talkorigins.org/faqs/comdesc/images/hominids_horiz.jpg\n \n Now, tell me, which are human and which are ape?", 
   {}, 
   25454, 
   null, 
   1070552700.0
  ], 
  [
   25503, 
   null, 
   "montalban", 
   "Why? Because you know that your mistakes will be exposed? Yes, you are right.\n\n \n \n Brilliant, WJA. Wow! What a mind! I don't know how any of us creationists thought we could match you.\n \n \n \n \n \n \n \n \n Even someone who's not traded insults with you, you just can't help it!", 
   {}, 
   25454, 
   null, 
   1070578260.0
  ], 
  [
   25522, 
   null, 
   "wja", 
   "Brilliant, WJA. Wow! What a mind! I don't know how any of us creationists thought we could match you.\n \n Even someone who's not traded insults with you, you just can't help it!\n\n monty, if you've got nothing worth saying, don't say it.\n \n Priscilla cites her own knowledge and personal opinion in support of her assertions on evolution and creationism. I see no evidence that he knowledge is correct or her opinions worthwhile. Now, any comment on the substance of the thread or will you run away again?", 
   {}, 
   25503, 
   null, 
   1070583540.0
  ], 
  [
   25610, 
   null, 
   "montalban", 
   "monty, if you've got nothing worth saying, don't say it.\n \n Priscilla cites her own knowledge and personal opinion in support of her assertions on evolution and creationism. I see no evidence that he knowledge is correct or her opinions worthwhile. Now, any comment on the substance of the thread or will you run away again?\n\n \n \n As you seem to know me so well, and answer for me, you decide oh great one.\n \n \n Can we still be friends?", 
   {}, 
   25522, 
   null, 
   1070627580.0
  ], 
  [
   25664, 
   null, 
   "SLP", 
   "As you seem to know me so well, and answer for me, you decide oh great one.\n \n \n Can we still be friends?\n\n \n it would appear that WJA was right....", 
   {}, 
   25610, 
   null, 
   1070653020.0
  ], 
  [
   25694, 
   null, 
   "montalban", 
   "it would appear that WJA was right....\n\n \n \n Would it?\n \n \n Let's go over this for the dummies. (maths! :) ) I raised a topic. Only one person provided information, and he's dead-set on the idea that this was some kind of trap.\n \n I said it wasn't\n \n He didn't believe me then accused me of a whole heap of things.\n \n Because I haven't said anything more on the original post he's said I've had nothing else to say... indeed I don't, neither do you. We've now got to the state of bickering, not arguing.\n \n This stems from WJA's baseless assertion of this being a trap. I'm in two minds whether to debate this attack, which must be what you like to do, or not.\n \n At present, because I feel so sorry for you (so biased you're willing to leap in and join this stupid attack), that I'm taking the time to set things straight (again, for the public record).\n \n If, anytime I raise an issue and ask for contributions then you're going to be quite willing to be a name caller, rather than actually 'discuss' things, that's entirely up to you. WJA has contributed both information - which I've thanked him for, and a set of weird 'studies' he has made based on how he 'knows' I think. You seem to agree with him. Congrat on getting WJA's super-powers.\n \n So much for debate.", 
   {}, 
   25664, 
   null, 
   1070667000.0
  ], 
  [
   25725, 
   null, 
   "wja", 
   "monty, your connection with reality is becoming even more tenuous.\n \n \nI raised a topic.\n\n You provided a label to the topic which had the appearance of a rhetorical device to cast aspersions on the theory of evolution. You are well known for being an evolution denier. You provide a cut'n'paste which gives the impression that the Toumai fossil is the fossil of an ape. You cite a website which presents the usual collection of creationist errors, misrepresentations and untruths. Then, when challenged, you innocently claim that you don't have a position because you don't have enough information. How disingenuous!\n \n If you were so interested in obtaining more information on the status of the Toumai fossil you could have researched it yourself. Or are you incapable of using other than creationist sources?\n \n \nOnly one person provided information, and he's dead-set on the idea that this was some kind of trap.\n\n \n So, despite starting the topic you refuse to give any substantial discussion on the topic. Ideas of a trap are fantasies in your own mind.\n \nHe didn't believe me then accused me of a whole heap of things.\n \n\n Of what? Not wanting to debate your own topic? The accusation is verified by your behaviour.\n \nBecause I haven't said anything more on the original post he's said I've had nothing else to say... indeed I don't, neither do you. We've now got to the state of bickering, not arguing.\n\n Not much left to do if you refuse to engage in discussion and instead offer snide comments as your only contribution.\n \nThis stems from WJA's baseless assertion of this being a trap. I'm in two minds whether to debate this attack, which must be what you like to do, or not.\n\n Try rereading the thread and connecting with reality. I don't view your habit of posting an item and then running away from discussion as a trap or plot and have never said so. You introduce the idea of a \"Montalban-plot\" in post #12. Now you continue your fantasy. Feel free to debate this \"attack\", you are lacking in evidence as are your evolution debates.\n \nAt present, because I feel so sorry for you (so biased you're willing to leap in and join this stupid attack), that I'm taking the time to set things straight (again, for the public record).\n\n You seem to have overlooked the fact that the public record is open to all and does not support your fantasy.\n \nIf, anytime I raise an issue and ask for contributions then you're going to be quite willing to be a name caller, rather than actually 'discuss' things, that's entirely up to you. \n\n monty, spell projection.\n \nWJA has contributed both information - which I've thanked him for, and a set of weird 'studies' he has made based on how he 'knows' I think. \n\n Priscilla also presented \"information\". You failed to respond to it, positively or negatively. Mr Jack provided a link to further information relevent to the topic. You failed to respond. I commented on your behaviour, based on observation, logic, experience and supporting evidence. This is the only thing that you responded to...endlessly.\n \nYou seem to agree with him. Congrat on getting WJA's super-powers.\n Not superpowers at all. If you think so then it helps explain why you need a supernatural being to explain things in the real world which others can explain be the application of observation, logic, knowledge and supporting evidence.\n \n \nSo much for debate.\n The pathos! It is obvious that you never wanted to debate the topic in the first place and have avoided subsequent opportunities to debate.", 
   {}, 
   25694, 
   null, 
   1070671740.0
  ], 
  [
   25738, 
   null, 
   "montalban", 
   "Actually I have been reading about it - due in part because hardly anyone one else is actually willing to address the actual issue; you have, good on ya! But you're more interested in ad hominem attacks, and I am interested in setting my side.\n \n Yes, it is a loaded topic heading. Big deal. It's supposed to catch people's eye and provoke thought. Like most of the other threads.\n \n Everyone who's a regular already knows my stance, so how is there any 'trickery' involved unless you suspect your fellow evolutionaries to be thick as two short planks.\n \n That you insist that you can read my mind despite the fact I've now gone over my motives is quite strange of you. It seems you're rather obsessed with me at present as you want to make so many personal observations about me.", 
   {}, 
   25725, 
   null, 
   1070683260.0
  ], 
  [
   26169, 
   null, 
   "Priscilla2", 
   "[QUOTE=wja]1. Why? Because you know that your mistakes will be exposed? \n 2.Really? Do you assert this from your extensive knowledge of the topic? How about Turkana Boy? How about Lucy? Duh! Oh, you mean there are no complete fossil skulls. Well there's plenty of near complete skulls \n 3.A small amount of Neanderthal material has been recovered \n 4. Strange, only material from the youngest fossils can be recovered, not from the much older fossils. How do creationists explain that pattern?\n 5.There is no evidence of any change in rate of radioactive decay rates.\n 6.You don't know much about this, do you? You appear to be referring to radiocarbon dating because the amount of atmospheric [sic] C14 increased mid-20th century from atomic bombs. Other radiometric dating techniques are not affected by atmospheric radioisotopes.\n 7.Strange, I thought it was Christians who thought they were closer to apes and this justified enslaving them.\n 8. Could you tell the difference between a human and an ape skull? Why are there skulls with a mixture of characteristic features? \n 9. Do you want me to find the article which shows how creationists who insist that all fossil skulls are either human or ape can't agree amongst themselves which ones are human and which are apes?\n 10.Where is the supporting evidence? Or do you simply accept any make-believe story because [sic] it confirms your religious beliefs?\n 11. If it is from the mouths of evolutionary scientists then you can provide citations, can't you?\n [QUOTE]\n 1. Actually, the only free time I have is between the hours of midnight and 7:30a.m. I usually like to use that to get sleep and get other work done, but unfortunately, I was drawn into this debate to help fellow Christians. Believe me, I only joined the forums to get something published quickly (on a different topic). I (unlike the rest of you) do not have time to post 300 messages here in a week in a half. \n 2. No, I mean there has never been any entirely complete fossilized specimens found (let me specify in the man/ape line lest you tell me there have been millions of complete worms found.). Something is always missing and most of the bones for one specimen are not laid out in a nice little row. Archaeologists often make molds of the missing bones of fossils to complete the skeleton. You can use the recent book by the archeologist who discovered Sue. He goes into detail on the process of finding, labeling, etc. fossils.\n 3. Has it? Are you saying they have found DNA fossilized? What book are you looking at? &#8220;The Field Guide to Prehistoric Life&#8221; tells us that DNA does not fossilize. Perhaps you should write the authors and tell them they are wrong. \n 4. What exactly is this \"material\" you are talking about?\n 5.There is no evidence of any change in rate of radioactive decay rates. Did I anywhere in my e-mail say there was (although Encarta alludes that their may be under certain circumstances, at least I read it that way the same way you read what I said in that way)?\n 6.I cannot find the reference I read that stated this, but if I come across it again, I will not lose it. (Perhaps it was the book on Sue again &#8211; you really should read it, it contains very interesting information not only on fossils, but also on the legal process.) As to C-14, A-bombs went off before 1950. I would think they would have set the freeze before that date if that was what was effecting the change. However, if you read Encarta (again) it seems to allude that all the tens of different ways of dating never seem to collaborate with each other. I also know that U dating is based on the amounts in seawater &#8211; you do not think all the nuclear subs that have crashed recently have changed this?\n 7.Actually, most Christians tried to free slaves &#8211; read &#8220;Out of this Nettle&#8221; (if it is still in print). After you have finished with that, you can read H.G. Well&#8217;s &#8220;An Outline of World History&#8221;. I will provide you with a quote in case the 1000+ pages are too much for you to read since no one has condensed them into a 2 &#8211; 3 page website &#8211; &#8220;Possibly the more ancient of races were all dusky or black, and fairness is new.&#8221; Well&#8217;s was a stanch evolutionist.\n 8. If we are talking about fossils, absolutely not! Especially not from website pictures! It takes scientists many years of study to determine the differences between fossils and classify them (Once again, see Sue). That is why some fossils go for years being labeled as one thing and then are changed after further examination by others. Anyone who claims to be able to tell the difference between two fossils just by a glance or a picture is lying. \n 9. Why? I highly doubt they have taken the time or effort to specialize in this field of fossilization and since regular scientists often have trouble determining the difference between two different species of humanoid, why should I be surprised that people who only have seen pictures cannot figure it out?\n 10.I did not say I agreed with either of the two Christian theories. You asked what other Christians said, and I told you what they have said. The scientist who said our skulls change as we age said so based on skull measurements from a current lifespan and multiplying them, I believe. I do not read creationists works, I only get the information from my husband who does. (How else would scientists be able to determine how old certain animals/humanoids supposedly were when they died if they didn&#8217;t know there were differences in skeletal structure &#8211; see the National Geographic articles on the Iceman they found. They even know how he died and what serious wounds he had recovered from).\n 11. I believe I have provided some citations for you, and all of them are from those who believe in an evolutionary view.\n Now, three final things, if we did not tend to make non-human things human, we would not need the word &#8220;personification&#8221; would we? \n The reason you will find no scientific material debating your fairy theory because fairies are supernatural and no one can form a scientific theory about supernatural things. This is why scientists cannot disprove God exists because He is also in the realm of supernatural. However, scientists can observe changes in n people as they age. They also can theoretically make people live very much longer than what we currently do and are working on it as we speak. So in the future, we could possibly test the age theory more accurately (although the way our life would be prolonged would be quite artificial in my view and not really an accurate judge of it). I also see nothing unscientific about selective breeding. Science already has observed selective breeding in animals, why not in prehistoric humans? \n I realize that I believe in creation, so you are naturally suspicious of everything I write but try not to make assumptions (especially by inserting &#8220;Evolution is wrong because&#8230;&#8221; before every one of my statements when I have never put it there). Also, try to stick to the subject. When I say &#8220;No complete fossil of humanoids has been found&#8221; your statement that &#8220;well this one has been found almost complete&#8221; does nothing to disprove it. The statement still stands. Almost complete is not complete. You could say, &#8220;that doesn&#8217;t make them any less authentic.&#8221; And that would be a good argument, except that I never said anything about it making them any less authentic. I only stated the obvious and let you figure out for yourselves if a missing hand here or there makes a difference. I do find it more interesting though that the hands were missing from an apelike fossil, since the African practice of using the hands of apes in medicine and voodoo had to of originated somewhere. Well, I had better not speculate or you will tell me my theory is impossible even though an evolutionist (with a PhD) might look at my theory in a different light. The main reason I do not reply is not only because I do not have time, but I especially do not have time explaining science to those of you who claim to be Evolutionists but know nothing of science except what your high school and the internet has taught you. I do not like websites simply because I believe in the publication process &#8211; anyone can set up a website, not anyone can be published in a scientific journal.", 
   {}, 
   25454, 
   null, 
   1070874780.0
  ], 
  [
   26170, 
   null, 
   "Priscilla2", 
   "Look at these skulls.\n Now, tell me, which are human and which are ape?\n\n See my post 27 above. Since you probably won't want to read the whole thing I specifically address your response in section 8 and the final few paragraphs.", 
   {}, 
   25457, 
   null, 
   1070874900.0
  ], 
  [
   26173, 
   null, 
   "Priscilla2", 
   "monty, if you've got nothing worth saying, don't say it.\n \n Priscilla cites her own knowledge and personal opinion in support of her assertions on evolution and creationism. I see no evidence that he knowledge is correct or her opinions worthwhile. Now, any comment on the substance of the thread or will you run away again?\n\n \n Sorry, I do not cite information unless asked (especially when it is what I consider general knowledge). I just assume that people who say they believe in Evolution and are willing to talk about fossils have at least read a field guide on the subject. I should have realized that you spend so much time on-line that you really do not read anything but what someone wants you to believe on a website. Also, if you could see the hundreds of books on the shelves in my office and note the boxes of notebooks that contain further citings from books that I have not been able to put into the computer yet, you would also understand that asking me for a reference is sometimes asking me to spend hours trying to find what you are asking for. If I was rich, I would buy almost every book I read (since those I own are actually catagorized) and then I would always have the reference at my fingertips. As it is I have to rely on Encarta too much, but although it is only a condensed version, you can find further references through it.", 
   {}, 
   25522, 
   null, 
   1070875620.0
  ], 
  [
   26176, 
   null, 
   "Priscilla2", 
   "Do you really want to be friends with these people Montalban? \n I find it funny that the only reason I joined the debate was because I felt that you were trying to see what both sides felt about the story, and you so far had only had bashing responses from those on an evolutionary side mainly asking you to defend a position that you (in my mind) had clearly stated you knew little about. So I figured I could at least give a Christian point of view. Sadly, I have had to explain science all over again in this thread and back it up with citations. Unfortunately evolution is a two edged sword. The creationist cannot read creationist material and use it to defend his position. In order to read the evoutionist material though, it forces you to subject yourself to a different religion in almost the same way that reading the Nag Hammadi or the Vedas does. And the worst thing is that the only people you ever have a chance of saving are those who are Christians but became swayed by evolutionary thought. Even most of them have digressed into the world and liked the forbidden fruit too much to be redeemed again. By the way, if you decide to drop this thread, let me know, because I really do not see the purpose of debating it unless you are getting anything from my posts. I find it odd how few people on here are willing to learn anything and how many are willing to debate over subjects for 50 or so posts that even my old Evolution prof. has said are irrelevent.", 
   {}, 
   25738, 
   null, 
   1070876580.0
  ], 
  [
   26199, 
   null, 
   "wja", 
   "1. Actually, the only free time I have is between the hours of midnight and 7:30a.m. I usually like to use that to get sleep and get other work done, but unfortunately, I was drawn into this debate to help fellow Christians. Believe me, I only joined the forums to get something published quickly (on a different topic). I (unlike the rest of you) do not have time to post 300 messages here in a week in a half. \n\n This is no problem if you are genuine, rather than a drive-by preacher.\n \n \n2. No, I mean there has never been any entirely complete fossilized specimens found (let me specify in the man/ape line lest you tell me there have been millions of complete worms found.). Something is always missing and most of the bones for one specimen are not laid out in a nice little row. Archaeologists often make molds of the missing bones of fossils to complete the skeleton. \n\n \n So, why is the Turkana Boy fossil invalid as evidence? What diagnostic anatomical components is it missing? Do you simply ignore the whole skeleton because the feet and hands are missing? Please explain your logic.\n \n \nYou can use the recent book by the archeologist who discovered Sue. He goes into detail on the process of finding, labeling, etc. fossils.\nSue, a Tyrannosaurus rex? \n \n \n3. Has it? Are you saying they have found DNA fossilized? What book are you looking at? \"The Field Guide to Prehistoric Life\" tells us that DNA does not fossilize. Perhaps you should write the authors and tell them they are wrong. \n\n \n Perhaps you should update yourself. You could start with  this Nature item and  this article. \n \n \n4. What exactly is this \"material\" you are talking about?\n\n See above.\n \n \n5.There is no evidence of any change in rate of radioactive decay rates. Did I anywhere in my e-mail say there was (although Encarta alludes that their may be under certain circumstances, at least I read it that way the same way you read what I said in that way)?\n\n Then what did you mean by \"Finally, all dating relies on a constant state of decay\"? You seem to imply that this is an invalid assumption which leaves all radiometric dating invalid.\n \n \n6.I cannot find the reference I read that stated this, but if I come across it again, I will not lose it. (Perhaps it was the book on Sue again - you really should read it, it contains very interesting information not only on fossils, but also on the legal process.) \n\n What are you referring to?\n \nAs to C-14, A-bombs went off before 1950. I would think they would have set the freeze before that date if that was what was effecting the change. \n\n Radiocarbon dating takes into account atomic bomb effects and the industrial effect resulting from the burning of fossil fuels. Refer to  this page for more detail of how 1890 wood is extrapolated to 1950 decay levels and used as the standard. And you do realise that radiocarbon dating is not useable for material more than about 50,000 years old, don't you?\n \n \nHowever, if you read Encarta (again) it seems to allude that all the tens of different ways of dating never seem to collaborate with each other. \n I think you better give specific quotes and references from Encarta because this is completely wrong. It is contradicted by such examples as  the Fen complex and Madagascar samples. \n \nI also know that U dating is based on the amounts in seawater - you do not think all the nuclear subs that have crashed recently have changed this?\n U dating is also done from igneous rocks containing uranium. Are these affected by nuclear subs? And where is your evidence that anomolies in Thorium 230 are seen from recent contamination?\n \n \n7.Actually, most Christians tried to free slaves - read \"Out of this Nettle\" (if it is still in print). After you have finished with that, you can read H.G. Well's \"An Outline of World History\". I will provide you with a quote in case the 1000+ pages are too much for you to read since no one has condensed them into a 2 - 3 page website - \"Possibly the more ancient of races were all dusky or black, and fairness is new.\" Well's was a stanch evolutionist.\n\n \n Refer to scientific creatinist Henry Morris' argument on the divine curse on Ham's descendents to be slaves.\n \n \n8. If we are talking about fossils, absolutely not! Especially not from website pictures! It takes scientists many years of study to determine the differences between fossils and classify them (Once again, see Sue). That is why some fossils go for years being labeled as one thing and then are changed after further examination by others. Anyone who claims to be able to tell the difference between two fossils just by a glance or a picture is lying. \n\n You completely fail to explain why fossils have been uncovered and determined to contain a mixture of human and ape features.\n \n \n9. Why? I highly doubt they have taken the time or effort to specialize in this field of fossilization and since regular scientists often have trouble determining the difference between two different species of humanoid, why should I be surprised that people who only have seen pictures cannot figure it out?\n\n \n The lack of expertise by creationist \"scientists\" does not stop them from declaring that there are no common ancestors between Homo sapiens and other apes and that all humanoid fossils are either human or ape. Here's  an interesting article on the different conclusions that different creationists have come to. And wouldn't the credibility of these creationists be called into question if they have offered their opinions without doing more than looking at pictures? The simple explanation is that there exist numerous fossils which are different from Homo sapies and apes, but have a mixture of features of the two.\n \n \n10.I did not say I agreed with either of the two Christian theories. You asked what other Christians said, and I told you what they have said. The scientist who said our skulls change as we age said so based on skull measurements from a current lifespan and multiplying them, I believe. \n\n Any reference to cite? Cuozzo?\n \nI do not read creationists works, I only get the information from my husband who does. \n\n So why is this a reliable source of information? \n \n(How else would scientists be able to determine how old certain animals/humanoids supposedly were when they died if they didn't know there were differences in skeletal structure - see the National Geographic articles on the Iceman they found. They even know how he died and what serious wounds he had recovered from).\n\n So where is the scientific data which allows the measurements to be extrapolated to individuals who are supposed by creationists to be hundreds of years old? \n \n \n11. I believe I have provided some citations for you, and all of them are from those who believe in an evolutionary view.\n\n \n Not from what I have seen. So I will insist that you provide references when you assert that something is an \"evolutionary\" view.\n \n I will continue later.", 
   {
    "unicode_changes_made": true
   }, 
   26169, 
   null, 
   1070890320.0
  ], 
  [
   26338, 
   null, 
   "scott7", 
   "Evolutionaries have made many mistakes in the past. Is this another one?\n \n \"Human Evolution: The Most Recent Find\n In July 2002, anthropologists announced the discovery of a skull in Chad with \"an unusual mixture of primitive and humanlike features.\" The find was dubbed \"Toumai\" (the name give to children in Chad born close to the dry season) and was immediately hailed as \"the earliest member of the human family found so far.\" By October 2002, a number of scientists went on record to criticize the premature claim -- declaring that the discovery is merely the fossil of an ape. \"\n \n http://www.human--evolution.com/\n\n Monty\n \n What you fail to realize is that another evolutionist found the mistake, not God or a creationist. Or am I wrong? Why are you so quick to talk about the mistakes, but not all of the fossils that have time and time again been proven the be real?", 
   {}, 
   24546, 
   null, 
   1070938380.0
  ], 
  [
   26340, 
   null, 
   "scott7", 
   "I am only going to make one reply in this forum and then I am dropping it.\n \n First, I want to point out that no complete humanoid/ape fossils have ever been found. This is also the case here where we only have a skull.\n I also point out that DNA cannot be preserved through the fossil record, so we really have no way other than bone structure of identifying/classifying humanoid/ape remains. \n Finally, all dating relies on a constant state of decay (as well as an initial amount of radioactivity in the air). I further add to this that the amount of radioactivity in the air today has changed so much since the amount found in 1950 that all dating methods are based on the radioactivity in the air in 1950. Yet, scientists still assume that there was a constant rate from the first fossil until 1950. \n \n That aside, you ask what do creationists have to say about bones that are discovered that display both human and ape features to them (specifically skulls). Remember that for the longest time, evolutionists felt that people from Africa were more closely related to apes because of their facial structure. Humans like to classify, and we like to find things that are similar to us. :-0 looks like a persons face with his mouth open when it is really a colon, a hyphen, and a zero. This is the reason I believe scientists find skulls that are fossilized with both ape and human features. \n Creationists have also said that since people lived longer, they developed different features. I am not familiar with the research on this, but I believe that it is possible (at least to be researched). \n A final theory is based on the verse that states the \"sons of God were breeding with the daughters of men\". We have lost what the true meaning of this verse is although there are many interpretations. It is very possible that the offspring of these unions were deformed to some extent (or maybe at that time they were considered more beautiful). Could they have been purposely doing a form of purifying the race through breeding? (Hitler was not the first with this idea). Alternatively, were they possibly trying to make bigger stronger humans? \n I do not necessarily believe the last two theories. My theory is based on what I have observed and the information I gave before it is from the evolutionary scientists' mouths. If you have research (in book or journal form) that disproves either of the Christian theories, feel free to let me know about it, I will check back from time to time. You will not find scientific information that can debate my theory since it is based on evolutionary science and psychology (which in my opinion is all the same thing).\n\n I find it so funny that when science benefits you, you believe in it. But when it contradicts your beliefs you just write it off as a \"theory\" and not fact. Maybe all of your babbeling about the radioactivity is just a \"theory\" and not fact. Please don't just rely on science when it appears to be in your favor", 
   {
    "post_info": {
     "post_title": "You are so funny"
    }, 
    "unicode_changes_made": true
   }, 
   25447, 
   null, 
   1070938620.0
  ], 
  [
   26411, 
   null, 
   "wja", 
   "Part 2 of my response to Priscilla's post no.17\n \n\n 11. I believe I have provided some citations for you, and all of them are from those who believe in an evolutionary view.\n\n Look again. You had not provided one citation on this thread prior to post #17, nor in post #17, but you assert that \"the information I gave before it is from the evolutionary scientists' mouths.\" \n \n \nNow, three final things, if we did not tend to make non-human things human, we would not need the word \"personification\" would we? \n Don't you mean \"anthropomorphism\"? Not a good argument to use. Why do scientists say that, for example, Homo habilis skulls are distiguishable from Homo sapiens skulls? Using your argument, wouldn't scientists call them all the same skulls?\n \n \nThe reason you will find no scientific material debating your fairy theory because fairies are supernatural and no one can form a scientific theory about supernatural things. This is why scientists cannot disprove God exists because He is also in the realm of supernatural. \n\n And this is why there will be no scientific journal articles on the breeding habits and genetics of sons of god either. \n \n \nHowever, scientists can observe changes in people as they age. \n\n Been reading Cuozzo, have you? Unfortunately for creatioists, using scientific data to try and show that Neanderthals are very old Homo sapiens doesn't work. As Colin Groves describes:\n \n Actually, how many hundreds of years old were La Chapelle and La Ferrassie? You get different answers from different measurements. From near-maturity (Le Moustier's age) into old age, modern human cranial length increases at 0.06mm per year, according to the figures Cuozzo quotes and which I see no reason to doubt; La Ferrassie's cranial length is 16mm greater than Le Moustier's, so this represents 267 years of growth. Total facial height, on the contrary, grows at 0.18mm/yr, giving only 137 years' growth between Le Moustier and La Ferrassie; while lower facial height grows at 0.063mm/yr, giving 278 years' growth; basal skull length grows at 0.052mm/year, giving 365 years' growth; and so on. There is, in other words, variability. Moreover, calculating the growth from Le Moustier to La Chapelle, you find using some measurements that La Chapelle is older than La Ferrassie, but using others that it is younger.\n \n from http://www.talkorigins.org/faqs/homs/cuozzo_cg.html\n \n \nThey also can theoretically make people live very much longer than what we currently do and are working on it as we speak. So in the future, we could possibly test the age theory more accurately (although the way our life would be prolonged would be quite artificial in my view and not really an accurate judge of it).\n\n Don't hold you breath for this to help the creationist argument.\n \n \n I also see nothing unscientific about selective breeding. Science already has observed selective breeding in animals, why not in prehistoric humans? \n Any evidence for it occurring in any human societies?\n \nI realize that I believe in creation, so you are naturally suspicious of everything I write but try not to make assumptions (especially by inserting \"Evolution is wrong because...\" before every one of my statements when I have never put it there). \n You're talking nonsense.\n \nAlso, try to stick to the subject. When I say \"No complete fossil of humanoids has been found\" your statement that \"well this one has been found almost complete\" does nothing to disprove it. The statement still stands. Almost complete is not complete. You could say, \"that doesn't make them any less authentic.\" And that would be a good argument, except that I never said anything about it making them any less authentic. I only stated the obvious and let you figure out for yourselves if a missing hand here or there makes a difference. \n\n This is nonsense. Detail the features which are diagnostic for distinguishing between humans and apes. \n \nI do find it more interesting though that the hands were missing from an apelike fossil, since the African practice of using the hands of apes in medicine and voodoo had to of originated somewhere. \n\n So, is Turkana Boy an ape now based on this anecdotal evidence?\n \nWell, I had better not speculate or you will tell me my theory is impossible even though an evolutionist (with a PhD) might look at my theory in a different light. \n\n Well why don't you find a citation from a PhD paleontologist which supports your assertion?\n \nThe main reason I do not reply is not only because I do not have time, but I especially do not have time explaining science to those of you who claim to be Evolutionists but know nothing of science except what your high school and the internet has taught you.\n\n I hope you are not referring to me because, if so, you are sadly mistaken.\n \n I do not like websites simply because I believe in the publication process - anyone can set up a website, not anyone can be published in a scientific journal.\n\n Hopefully any websites I provide will have references to original publications in scientific journals. Will you do the same?", 
   {
    "unicode_changes_made": true
   }, 
   26169, 
   null, 
   1070959020.0
  ], 
  [
   26604, 
   null, 
   "iamthetruth", 
   " The main reason I do not reply is not only because I do not have time, but I especially do not have time explaining science to those of you who claim to be Evolutionists but know nothing of science except what your high school and the internet has taught you.\n\n \n Not a single one of your delusional assertions has the basis of scientific fact and yet you think that you are explaining science to evolutionists?\n It's pretty clear that the only science you have learned has been gleaned form AiG, ICR, Hovind et al.\n Your education is sadly lacking.", 
   {}, 
   26169, 
   null, 
   1071045180.0
  ], 
  [
   26649, 
   null, 
   "Hank", 
   "I don't know. What part of the bit where I said I'm trying to find these out escapes you? As I said, you're reading too much into this... When I've been firm in something -e.g. Darwin's Finch, Lurch being a loser, I've said so.\n\n \n Everyone can see that Lurch presented carefully laid out evidence that showed the Finch were a very good example of speciation. I guess it nice to be blissfully unaware of the fact that you can't present a logical response.", 
   {
    "unicode_changes_made": true
   }, 
   24726, 
   null, 
   1071087240.0
  ], 
  [
   29474, 
   null, 
   "Hank", 
   "I don't know. What part of the bit where I said I'm trying to find these out escapes you? As I said, you're reading too much into this... When I've been firm in something -e.g. Darwin's Finch, Lurch being a loser, I've said so.\n\n \n I noticed on the &#8216;Answers in genesis&#8217; board in the &#8216;Arguments we think creationists should NOT use&#8217; section they have the following:\n \n \nNo new species have been produced.&#8217; This is not true&#8212;new species have been observed to form. In fact, rapid speciation is an important part of the creation model. But this speciation is within the &#8216;kind&#8217;, and involves no new genetic information.\n\n \n And inside that section is the following quote:\n \n \nThirteen species of finches live on the Galápagos, the famous island group visited by Charles Darwin in the 1830s. The finches have a variety of bill shapes and sizes, all suited to their varying diets and lifestyles. The explanation given by Darwin was that they are all the offspring of an original pair of finches, and that natural selection is responsible for the differences.\n \n Surprisingly to some, this is the explanation now held by most modern creationists. It would not need to be an &#8216;evolutionary&#8217; change at all, in the sense of giving any evidence for amoeba-to-man transformation. No new genetic information would have been introduced. If the parent population has sufficient created variability (genetic potential) to account for these varied features in its descendants, natural selection could take care of the resulting adaptation, as a simplistic example will show.\n\n \n Seems like you are behind the times monty. Even the creationists are now saying there is speciation because of the necessity in not overflowing the ark. And of all things, they are using Darwin&#8217;s finches to prove it. HAHAHAHAHAHA", 
   {}, 
   24726, 
   null, 
   1072756980.0
  ], 
  [
   29479, 
   null, 
   "montalban", 
   "I noticed on the 'Answers in genesis' board in the 'Arguments we think creationists should NOT use' section they have the following:\n \n And inside that section is the following quote:\n \n \n \n Seems like you are behind the times monty. Even the creationists are now saying there is speciation because of the necessity in not overflowing the ark. And of all things, they are using Darwin's finches to prove it. HAHAHAHAHAHA\n\n \n \n You're a bit slow. Ages ago I posted a number of creationist sites that believe in speciation. I stated that I don't agree with them. So it's take you all this time to catch up?\n \n You yourself recognise that some Christians take literal views of Genesis, and some don't. I take what information I like as do you.\n \n At least I don't change my position entirely as you do here...\n \n Recently you have been defending the concept of \"Survival of the Fittest\", against my 'lucky turtle' theory but Hank, on post 227 of \"Grudgingly conceding some points\"\n You quoted \n \nFrom talk orgins\n \n \"Survival of the fittest\" is a poor way to think about evolution. Darwin himself never used the phrase. What Darwin said is that heritable variations lead to differential reproductive success. It is a prediction which can be, and has been, experimentally verified.\n\n \n You actually claimed Evolutionaries don't even use the phrase, then! Now you've changed tact.\n \n See 332 of said for a rebuttal.", 
   {
    "unicode_changes_made": true
   }, 
   29474, 
   null, 
   1072759980.0
  ], 
  [
   29500, 
   null, 
   "Hank", 
   "You're a bit slow. Ages ago I posted a number of creationist sites that believe in speciation. I stated that I don't agree with them. So it's take you all this time to catch up?\n\n \n I see you still think my goal in life is to go back and read every post you ever made. LOL\n \n As stated in Answers in Genesis, creationaries have to admit to speciation. Otherwise the ark won&#8217;t hold all the animals. Something&#8217;s got to give, which do you want to give up, no speciation or the ark. LOL", 
   {}, 
   29479, 
   null, 
   1072794720.0
  ], 
  [
   29528, 
   null, 
   "montalban", 
   "I see you still think my goal in life is to go back and read every post you ever made. LOL\n\n \n But it makes you look a fool that you make comments without knowing. Doesn't it.\n \n So you think that just because you enter a debate half-way, you can still give an uninformed opinion? Weren't you the one ready to laugh at me?\n \n I won't laugh at you. I am only saddened by your personal attacks.\n \n \nAs stated in Answers in Genesis, creationaries have to admit to speciation. Otherwise the ark won't hold all the animals. Something's got to give, which do you want to give up, no speciation or the ark. LOL\n\n \n Yes, repeating yourself. I know what they say, you know what they say. I don't agree with them, on these points. Answers in Genesis are 'right' by your account on this occasion - see my previous post about us both being 'selective' in the information we use; again a lack of insight into your own thought processes.\n \n I disagree with them.\n \n Do you agree with their claim that speciation in fact disproves evolution? I bet you've been very selective here too!", 
   {
    "unicode_changes_made": true
   }, 
   29500, 
   null, 
   1072824600.0
  ], 
  [
   29563, 
   null, 
   "montalban", 
   "\"Survival of the Fittest\" was a term first coined by pioneer sociologist Herbert Spencer 1 and later used by evolutionaries 2 as theories of race, and hence racism developed (of which many exist).3\n \n By its very nature it suggest that life is about an acrimonious fight for survival, culminating in Nazi scientific theologies. 4 It has helped promote our modern capitalist world. 5\n \n It is thus an historical inevitability that evolution would emerge.\n \n \n 1 http://www2.truman.edu/~rgraber/cultev/spencer.html\n 2 \"Darwin came to employ the expression in later editions of the Origin of Species\"\n http://www.utm.edu/research/iep/s/spencer.htm\n 3 http://human-nature.com/nibbs/02/graves.html\n 4 http://www.answersingenesis.org/docs/4162.asp see also http://www.pbs.org/wgbh/evolution/darwin/nameof/index.html\n 5 http://www.icr.org/pubs/imp/imp-333.htm", 
   {
    "post_info": {
     "post_title": "Survival of the Fittest in an historical context"
    }, 
    "unicode_changes_made": true
   }, 
   29528, 
   null, 
   1072834620.0
  ], 
  [
   29597, 
   null, 
   "Hank", 
   "But it makes you look a fool that you make comments without knowing. Doesn't it.\n \n So you think that just because you enter a debate half-way, you can still give an uninformed opinion? Weren't you the one ready to laugh at me?\n \n I won't laugh at you. I am only saddened by your personal attacks. \n\n \n You think someone looks like a fool because they don&#8217;t go back and read hours and hours of your dumb post? Man you are arrogant. \n \n \nYes, repeating yourself. I know what they say, you know what they say. I don't agree with them, on these points. Answers in Genesis are 'right' by your account on this occasion - see my previous post about us both being 'selective' in the information we use; again a lack of insight into your own thought processes.\n \n I disagree with them.\n \n Do you agree with their claim that speciation in fact disproves evolution? I bet you've been very selective here too!\n\n \n Baby steps, baby steps monty. I&#8217;m sure the church leaders said the earth only rotated around the sun during the night at first. LOL\n \n I couldn&#8217;t find any creationary web sites that said speciation doesn&#8217;t happen. Since the creationaries say all the species can't fit on the ark, how does monty think they all fit? :)", 
   {}, 
   29528, 
   null, 
   1072845720.0
  ], 
  [
   29611, 
   null, 
   "montalban", 
   "You think someone looks like a fool because they don't go back and read hours and hours of your dumb post? Man you are arrogant. \n\n \n Really, and it's not to just wade into an argument, make silly statments and then blame everyone else because you don't know what you talk about.\n \n \nBaby steps, baby steps monty. I'm sure the church leaders said the earth only rotated around the sun during the night at first. \n\n \n \"I'm sure...\" makes a fine argument. Devastating me with personal opinion based on what, again?\n \n \nI couldn't find any creationary web sites that said speciation doesn't happen. Since the creationaries say all the species can't fit on the ark, how does monty think they all fit? \n\n \n That's not what I said. I said that answersingenesis don't believe in evolution. They believe in speciation within kinds, that for instance a proto-dog type creature can branch out into all the creatures in the dog family.\n \n They deny that a single-cell animal can, over billions of years become a human.\n \n Again, you show a complete unwillingess to read what they say. Must be there fault too, hey?\n \n Time and time again I've suggested that you take time before posting. You don't, then cry when I point out your errors, and then blame me for pointing them out.", 
   {
    "unicode_changes_made": true
   }, 
   29597, 
   null, 
   1072851480.0
  ], 
  [
   29647, 
   null, 
   "Hank", 
   "Really, and it's not to just wade into an argument, make silly statments and then blame everyone else because you don't know what you talk about. \n\n \n Sorry monty, my brain just can&#8217;t handle hours and hours of intense boredom. LOL\n \n \n\"I'm sure...\" makes a fine argument. Devastating me with personal opinion based on what, again? \n\n \n I can&#8217;t help it if you don&#8217;t have a sense of humor monty. When I make rational arguments you start screaming about some offense you feel I have made against you and tuck tail and run. So it&#8217;s more fun to just point out your idiotic statements. LOL\n \n \nThat's not what I said. I said that answersingenesis don't believe in evolution. They believe in speciation within kinds, that for instance a proto-dog type creature can branch out into all the creatures in the dog family.\n\n \n And apparently so do all the other creationary sites. You&#8217;re becoming a lone wolf crying in the wilderness monty. LOL\n \n You&#8217;re still avoiding telling me how they got all those species on the ark. Come on monty, give it up. You know it can&#8217;t be done.", 
   {}, 
   29611, 
   null, 
   1072882860.0
  ], 
  [
   29690, 
   null, 
   "montalban", 
   "Sorry monty, my brain just can?t handle hours and hours of intense boredom. LOL\n\n \n Anyone can make mistakes (excepting you). Not everyone has to read every debate. What you've done is waded in, made a smart comment about me, (recall 'ha ha ha'). I pointed out you were wrong, and you give this big excuse how it's still my fault that you're talking about something you're ignorant of. Now you give another excuse about not wanting to be bored. It still did not stop you commenting on something you know little about. He who laughs last...\n \n \nI can?t help it if you don?t have a sense of humor monty. When I make rational arguments you start screaming about some offense you feel I have made against you and tuck tail and run. So it?s more fun to just point out your idiotic statements. LOL\n\n \n I can't help it if you are nevr wrong in your own mind. That even when you make silly comments about earth being 'egg-shaped' you want to argue it. Then you say \"Survival of the Fittest\" is a poor statement, but when I agree by calling it a tautology, you turn around to defend it, calling me an idiot.\n \n Frankly, you're just never wrong.\n \n And you are doing what now? Putting it down to lack of sense of humour on my part? Wow. You project everything back on me and grin like you're never wrong.\n \n \nAnd apparently so do all the other creationary sites. You?re becoming a lone wolf crying in the wilderness monty. LOL\n\n \n Am I? Still avoiding the issue that they don't believe in evolution. I like the mixed metaphor, by the way :)\n \n \nYou?re still avoiding telling me how they got all those species on the ark. Come on monty, give it up. You know it can?t be done.\n\n \n Ah the selective memory of Hank.", 
   {}, 
   29647, 
   null, 
   1072916040.0
  ], 
  [
   29727, 
   null, 
   "Hank", 
   "Still avoiding the issue that they don't believe in evolution.\n\n \n Everyone knows that for now they only believe in evolution below the 'kind'. But the evidence has become too overwhelming to not believe in speciation, if for no other reason than so they can fit all the animals on the ark.\n \n So the question continues to be, for someone like you that doesn't believe speciation happens, how did they get all those animals on the ark monty? :)", 
   {}, 
   29690, 
   null, 
   1072972440.0
  ], 
  [
   29734, 
   null, 
   "montalban", 
   "Everyone knows that for now they only believe in evolution below the 'kind'. But the evidence has become too overwhelming to not believe in speciation, if for no other reason than so they can fit all the animals on the ark.\n \n So the question continues to be, for someone like you that doesn't believe speciation happens,\n\n \n The question is, you used them as a source against me without reading what they argue - why?\n \n They actually state that speciation disproves Evolution - because it shows rapid speciation, not slow gradual speciation like the majority of evolutionaries.\n \n Which do you believe, anyway?\n \n The egg-shaped earth?\n \n That \"Survival of the Fittest\" is a good example of evolution - or not; I suppose it depends on what day it is your answering.\n \n \n \n how did they get all those animals on the ark monty?\n\n \n Again selective memory.", 
   {}, 
   29727, 
   null, 
   1072996920.0
  ], 
  [
   29735, 
   null, 
   "Hank", 
   "Again selective memory.\n\n \n I guess so although I don't know what you are talking about.\n \n But how did they get all those animals on the ark?", 
   {}, 
   29734, 
   null, 
   1072997160.0
  ], 
  [
   29736, 
   null, 
   "montalban", 
   "I guess so although I don't know what you are talking about.\n \n But how did they get all those animals on the ark?\n\n \n Why do you keep asking me to debate you on an issue I've already suggested I'm not going to debate you on?\n \n Selective memory.\n \n How do you explain your egg-shaped earth theory?\n \n Selective memory.\n \n Which version of the \"Survival of the Fittest\" stance will you take today.\n \n Selective memory.", 
   {}, 
   29735, 
   null, 
   1072997820.0
  ], 
  [
   29741, 
   null, 
   "Hank", 
   "Why do you keep asking me to debate you on an issue I've already suggested I'm not going to debate you on?\n\n \n There is no debate. Everyone knows it can't be done and you do too. That's the reason you won't answer the question. I'm just advertizing it. LOL\n \n \nSelective memory.\n \n How do you explain your egg-shaped earth theory?\n \n Selective memory.\n \n Which version of the \"Survival of the Fittest\" stance will you take today.\n \n Selective memory.\n\n \n Not wasting any more time to just have you turn tail and run when you get cornered, remember? You've got a lot of stuff you've left hanging.", 
   {}, 
   29736, 
   null, 
   1073002500.0
  ], 
  [
   29742, 
   null, 
   "montalban", 
   "There is no debate. Everyone knows it can't be done and you do too. That's the reason you won't answer the question. I'm just advertizing it. \n\n \n What you are advertising is that you want someone to talk to, and no one, other than me will do so.\n \n Look at the amount of things I'm already posting. I've got you with your spurrious views on evolution,* a gun-debtate, many on religion etc. You are upset that I'm not spending enough time with you in debating this pet subject of yours. I understand that. But I have too much on my plate already.\n \n \n \n *That you don't even know which version of evolution you want to follow at a particular time is laughable, or sad.", 
   {}, 
   29741, 
   null, 
   1073004180.0
  ], 
  [
   29752, 
   null, 
   "Hank", 
   "What you are advertising is that you want someone to talk to, and no one, other than me will do so.\n \n Look at the amount of things I'm already posting. I've got you with your spurrious views on evolution,* a gun-debtate, many on religion etc. You are upset that I'm not spending enough time with you in debating this pet subject of yours. I understand that. But I have too much on my plate already.\n \n \n \n *That you don't even know which version of evolution you want to follow at a particular time is laughable, or sad.\n\n \n Obviously what you have stated is a lie. But I'm still wondering how you think they got all those animals on the ark monty? LOL", 
   {}, 
   29742, 
   null, 
   1073008260.0
  ], 
  [
   29754, 
   null, 
   "montalban", 
   "Obviously what you have stated is a lie. But I'm still wondering how you think they got all those animals on the ark monty? \n\n \n What part of the \"I'm not going to discuss this\" don't you understand?\n \n The arrogance that you claim that this means I can't is certainly endemic of Americans\n \n PS, I have no more to say on this particular thread - until such time as something new comes up.\n \n I'll be waiting to read your proud claims of victory though.", 
   {}, 
   29752, 
   null, 
   1073009160.0
  ], 
  [
   29761, 
   null, 
   "Hank", 
   "What part of the \"I'm not going to discuss this\" don't you understand?\n\n \n The part where you keep replying. LOL\n \n \nThe arrogance that you claim that this means I can't is certainly endemic of Americans\n \n\n \n Well it's obvious you can't answer or you would have.", 
   {}, 
   29754, 
   null, 
   1073010240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another mistake?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1314-another-mistake.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1314, 
  "discussion_files": [
   [
    "24082.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1314-another-mistake-print.html"
   ], 
   [
    "24083.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1314-another-mistake-4-print.html"
   ], 
   [
    "24084.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1314-another-mistake-3-print.html"
   ], 
   [
    "24085.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1314-another-mistake-2-print.html"
   ]
  ], 
  "identifier": 1314
 }
]