[
 [
  [
   365742, 
   null, 
   "unkerpaulie", 
   "Before I start, I just want to point out the reason I put this thread in here and not in religion debates. I would like this thread to remain on topic and fairly self-moderated. Challenging religious and biblical doctrines tend to get very emotional and often hostile, especcially lately in the religion forum, myself included as guilty of attacks. I want to break away from that trend on this particular issue. I'm hereby refraining from attacks, emotional reactions and unnecessary tangent during this discussion,and I'm asking that everyone else who participates please do the same. \n \n This thread is for the most part in response a challenge I put toward Archangel and Easyrider. Its also something I am personaly and genuinely interested in. Archangel particularly requested that arguments be based on historical, scientific and theological evidence. Since theological evidence wasn't defined by arch, I will define it as scriptural reference based on the literal english meaning on the quoted scripture. \n \n John 14:12 \"Truly, truly, I say to you, he who believes in me will also do the works that I do; and greater works than these will he do, because I go to the Father.\"\n \n From my experience, there are no \"greater works\" than what Jesus did taking place today, nor last year, nor in the last, say 200 years or even longer. The miracles that Jesus performed according to the bible were logic and science defying. They were truly supernatural. Feeding over 5000 people by miraculously multiplying the food, walking on water, speaking to the weather, restoring withered and deformed limbs to full strength and size, and so on. If anyone could possibly perform these feats or greater, there would be without doubt worldwide coverage. In fact, miraculous works should be a very common thing by now. I think christianity is still on the rise, believers are praying to God all over the world non-stop. Yet for some reason there is an undeniable lack of anything that could possibly be even in the same zone as the works that the bible said Jesus did. \n \n So, did Jesus lie? If Jesus really did do the acts described in the gospels, and Jesus made that statement, and there are people believing in him alive today, then we should be seeing these greater works being performed. Since this is not the case, then either:\n Jesus lied when he made these statements;\n John lied by quoting statements Jesus never made; or\n Nobody in the world today believes in Jesus. \n \n Which is it?", 
   {
    "post_info": {
     "post_title": "John 14:12 ... Did Jesus lie?"
    }
   }, 
   null, 
   null, 
   1250537100.0
  ], 
  [
   365743, 
   null, 
   "JPSartre12", 
   "Acts 19:12; and all spake with various tongues. But the converting one sinner is a greater work than all these. Because I go to my Father - To send you the Holy Ghost.", 
   {}, 
   365742, 
   null, 
   1250537880.0
  ], 
  [
   365774, 
   null, 
   "Archangel", 
   "Before I start, I just want to point out the reason I put this thread in here and not in religion debates. I would like this thread to remain on topic and fairly self-moderated. Challenging religious and biblical doctrines tend to get very emotional and often hostile, especcially lately in the religion forum, myself included as guilty of attacks. I want to break away from that trend on this particular issue. I'm hereby refraining from attacks, emotional reactions and unnecessary tangent during this discussion,and I'm asking that everyone else who participates please do the same. \n \n This thread is for the most part in response a challenge I put toward Archangel and Easyrider. Its also something I am personaly and genuinely interested in. Archangel particularly requested that arguments be based on historical, scientific and theological evidence. Since theological evidence wasn't defined by arch, I will define it as scriptural reference based on the literal english meaning on the quoted scripture. \n \n John 14:12 \"Truly, truly, I say to you, he who believes in me will also do the works that I do; and greater works than these will he do, because I go to the Father.\"\n \n From my experience, there are no \"greater works\" than what Jesus did taking place today, nor last year, nor in the last, say 200 years or even longer. The miracles that Jesus performed according to the bible were logic and science defying. They were truly supernatural. Feeding over 5000 people by miraculously multiplying the food, walking on water, speaking to the weather, restoring withered and deformed limbs to full strength and size, and so on. If anyone could possibly perform these feats or greater, there would be without doubt worldwide coverage. In fact, miraculous works should be a very common thing by now. I think christianity is still on the rise, believers are praying to God all over the world non-stop. Yet for some reason there is an undeniable lack of anything that could possibly be even in the same zone as the works that the bible said Jesus did. \n \n So, did Jesus lie? If Jesus really did do the acts described in the gospels, and Jesus made that statement, and there are people believing in him alive today, then we should be seeing these greater works being performed. Since this is not the case, then either:\n Jesus lied when he made these statements;\n John lied by quoting statements Jesus never made; or\n Nobody in the world today believes in Jesus. \n \n Which is it?\n\n \n Noting the bolded, I must agree that Jesus accomplished supernatural acts which nobody since has equalled. Even though we see that the Apostles commanded amazing feats in His name. If we take that verse on its own and apply it universally, what it tells me, and I can speak for myself here, human beings have the potential to do the things Jesus did, but we neither have the faith or the discipline to command the authority He makes available to us. \n \n But in order to exercise the power and authority which Jesus possessed, it takes a well rounded spirit of discipline and commitment to the ways of God which are laid out in His hand book, the bible. We call them spiritual laws and it requires faithfully practicing these principles in our daily walk in order to really have not only the authority but the confidence to even attempt what Jesus commanded during His lifetime. Here's what I mean.\n \n But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, faithfulness, self-control (Gal. 5:22).\n \n For God has not given us a spirit of timidity, but of power and love and discipline (2 Tim. 1:7 NASB).\n \n There are many verses which when put together in practice empower us to realize these supernatural abilities. But how many human beings truly encompass these spiritual disciplines? Very few if any have ever truly reflected what jesus represented as the perfect example for us.\n \n Christian disciplines need not be looked upon as unpleasant, or as a legalistic obligation. When practiced meaningfully they become sources of strength and joy. Neither should we think of the spiritual disciplines as some dull drudgery aimed at exterminating laughter from the face of the earth. Joy is the keynote of spiritual discipline. Spiritual discipline may well be considered as a joyful response to the grace of God. \n \n Prayer can actually become a hunger, meditation a time of resting, and reflection a time of pulling oneself together again. These are the unrealized realities which I have failed to practice in my daily walk which is why I'm not a perfect reflection of the example Jesus set for us. Even though Jesus made it very clear that we have the capability to accomplish such things. I haven't exercised the personal commitment, will or discipline to attain such spiritual accomplishments.\n \n But I have both witnessed and experienced miracles such as supernatural healings and angelic interventions. These experiences are undeniable and speak to Gods grace and faithfulness rather than my spiritual insight.", 
   {}, 
   365742, 
   null, 
   1250557560.0
  ], 
  [
   365786, 
   null, 
   "Easyrider", 
   "\n \n So, did Jesus lie? If Jesus really did do the acts described in the gospels, and Jesus made that statement, and there are people believing in him alive today, then we should be seeing these greater works being performed. Since this is not the case, then either:\n Jesus lied when he made these statements;\n John lied by quoting statements Jesus never made; or\n Nobody in the world today believes in Jesus. \n \n Which is it?\n\n \n You ask too soon. It is believed when the 144 thousand witnesses for Christ (mentioned in the Book of Revelation) receive their anointing, then you will see what Christ spoke about.\n \n Here's a link that lightly touches on it:\n \n http://www.wake-up.org/daystar/ds1998/FEB98A.htm\n \n By the way, if you carefully study up on the following man, it is said he raised more people from the dead than did Jesus during his ministry.\n \n Smith Wigglesworth\n \n http://www.lit4ever.org/smith4.html", 
   {}, 
   365742, 
   null, 
   1250559540.0
  ], 
  [
   365802, 
   null, 
   "unkerpaulie", 
   "Archangel, remember when Peter walked out on the water to meet Jesus? Peter wasn't the most righteous man with the most christian discipline, neither was he a faithful and pious believer all his life. Yet in that one moment, with his eyes on Jesus, he had enough faith and put it into action and actually walked on water. \n \n What you're telling me is that nobody, not one believer, in all the years each of them have believed in christ, in the entire modern world history, has had enough faith and belief that they could perform a single supernatural act even for a few moments of their lifetime? Are you telling me that nobody has had enough faith to even surpass that of Peter? I find that very hard to believe. I know many christians personally, just as sincere as you are in their genuine faith. And I've been around them for years. I myself have had moments where I was totally convinced that I had God backing me 100%. Yet I have never seen a true miraculous feat, nor know anyone who has, nor know anyone who knows anyone who has.", 
   {}, 
   365786, 
   null, 
   1250567520.0
  ], 
  [
   365807, 
   null, 
   "unkerpaulie", 
   "Easyrider, I don't know if you realize this but your 2 points actually contradict each other. If the power to do the miraculous is reserved for the chosen 144000 after the rapture, then Smith Wigglesworth's ministry shouldn't be possible. The other problem with the miraculous 144k is that Jesus himself performed miracles, as did many of his disciples after his death, including John, the author of Revelation.", 
   {}, 
   365802, 
   null, 
   1250569140.0
  ], 
  [
   365809, 
   null, 
   "Archangel", 
   "Archangel, remember when Peter walked out on the water to meet Jesus? Peter wasn't the most righteous man with the most christian discipline, neither was he a faithful and pious believer all his life. Yet in that one moment, with his eyes on Jesus, he had enough faith and put it into action and actually walked on water.\n\n \n Very true. Peter was a perfect example of what someone can do by faith when they keep their eyes on Jesus. Just as I have experienced moments of miraculous insight, my life isn't a steady flow of a perfect reflection of Jesus perfect faith, as much as I wish it was. And so it was for Peter on that day.\n \n \n What you're telling me is that nobody, not one believer, in all the years each of them have believed in christ, in the entire modern world history, has had enough faith and belief that they could perform a single supernatural act even for a few moments of their lifetime? Are you telling me that nobody has had enough faith to even surpass that of Peter? I find that very hard to believe. I know many christians personally, just as sincere as you are in their genuine faith. And I've been around them for years. I myself have had moments where I was totally convinced that I had God backing me 100%. Yet I have never seen a true miraculous feat, nor know anyone who has, nor know anyone who knows anyone who has.\n\n \n I didn't say what you're implying I said at all paulie. I stated miracles I myself have experienced including Angelic interventions in order to guide or protect me at the time. Easyrider posted solid testimony of a man who has been credited with raising the dead. And in churches around the world, their are miracles and supernatural healing testimonies on a regular basis. So often that we believers take them for granted.\n \n But these don't make it into the national or even the local news since the world doesn't embrace the light of Gods work but rejects it as foolishness so you unbelievers wont be exposed to these realities. So I don't know how you could have read my first post and said the bolded statement in your post. That is just a complete misrepresentation of what I said.\n \n What I am saying is that the consistently righteous and holy man is a rarity in this corrupted and perverse world. But in no way is he non-existent.", 
   {}, 
   365802, 
   null, 
   1250569560.0
  ], 
  [
   365810, 
   null, 
   "unkerpaulie", 
   "Acts 19:12; and all spake with various tongues. But the converting one sinner is a greater work than all these. Because I go to my Father - To send you the Holy Ghost.\n\n Acts 19:12 so that even handkerchiefs and aprons that had touched him were taken to the sick, and their illnesses were cured and the evil spirits left them.", 
   {}, 
   365743, 
   null, 
   1250569680.0
  ], 
  [
   365816, 
   null, 
   "unkerpaulie", 
   "\n I didn't say what you're implying I said at all paulie. I stated miracles I myself have experienced including Angelic interventions in order to guide or protect me at the time. Easyrider posted solid testimony of a man who has been credited with raising the dead. And in churches around the world, their are miracles and supernatural healing testimonies on a regular basis. So often that we believers take them for granted.\n \n\n I wouldn't consider it solid testimony. I didn't do an indepth research on Wigglesworth, but wikipedia also mentions his claims of raising the dead without going into details. Its something I will try to get more info on. \n \n What I would consider solid testimony is neutral third party witnesses, some kind of testable demonstration, some kind of independent documentation, something like that. \n \nBut these don't make it into the national or even the local news since the world doesn't embrace the light of Gods work but rejects it as foolishness so you unbelievers wont be exposed to these realities. So I don't know how you could have read my first post and said the bolded statement in your post. That is just a complete misrepresentation of what I said.\n \n What I am saying is that the consistently righteous and holy man is a rarity in this corrupted and perverse world. But in no way is he non-existent.\n\n That's an unfair assumption. Wouldn't real miraculous feats be the best defense against skeptics? You can't make a general statement like the whole world would reject real tangible evidence of a supernatural phenomenon. \n \n You say that works such as what the bible says Jesus did are so commonplace among believers that they are sometimes taken for granted. What exactly are the miracles you are talking about? Give me an example or two if you will.", 
   {}, 
   365809, 
   null, 
   1250586480.0
  ], 
  [
   365822, 
   null, 
   "Archangel", 
   "I wouldn't consider it solid testimony. I didn't do an indepth research on Wigglesworth, but wikipedia also mentions his claims of raising the dead without going into details. Its something I will try to get more info on.\n \n What I would consider solid testimony is neutral third party witnesses, some kind of testable demonstration, some kind of independent documentation, something like that. \n\n \n You are making my point for me paulie. You would think that miracle workers like wigglesworth would be household names in a world hungry for the supernatural. But you fail to grasp that we live in a world which is steeped in spiritual darkness and which is dedicated blocking any recognition of that which reveals the true God or the light of His spiritual truths in this world.\n http://enrichmentjournal.ag.org/199801/070_wigglesworth.cfm\n \n \n That's an unfair assumption. Wouldn't real miraculous feats be the best defense against skeptics? You can't make a general statement like the whole world would reject real tangible evidence of a supernatural phenomenon. \n\n \n Actually, I can. It is the nature of the spiritual battle which is defined so clearly in the bible and is evidenced everyday in the real world. The world system will attack and attempt to destroy any reference to miracles or miracle workers in their mention of them by reporting them as questionable flukes if they are real at all. Never do they report on them as actually happening, even when the recipient declares how true it is.\n \n Use me as an example. I have repeatedly told you of my own miraculous experiences yet you have completely ignored them or avoided acknowledging them at all as valid.\n \n \nYou say that works such as what the bible says Jesus did are so commonplace among believers that they are sometimes taken for granted. What exactly are the miracles you are talking about? Give me an example or two if you will.\n\n \n A visiting Pastor who spoke to our church on sunday said that as a brick mason he had had constant pain in his back and shoulder for months. It was just something he was living with. He said that when he was in prayer, God had reminded him of it and asked how he was feeling. He acknowledged that he didn't even ask for healing but his shoulder and back are fixed, pain free. He had been healed a couple of days before even realizing it. I myself laid hands on my infant daughter who had a 103 degree temp. I claimed healing for her in Jesus name and before we walked from the living room to the kitchen, she went from listless to wide awake and smiling as she said mommy emoticon_xangel, at seeing her mother. My mother was shocked since she had just called us and demanded that we pick her up and rush her to the hospital based on her high temp and listless appearance. \n \n Like I say, we take such healings for granted since we ask and receive Gods intervention on such a regular basis. I admit that the pastor didn't even consciously ask for healing, but God knew the desire of his heart and surprised him with it.", 
   {}, 
   365816, 
   null, 
   1250601960.0
  ], 
  [
   365883, 
   null, 
   "Easyrider", 
   "Easyrider, I don't know if you realize this but your 2 points actually contradict each other. If the power to do the miraculous is reserved for the chosen 144000 after the rapture, then Smith Wigglesworth's ministry shouldn't be possible.\n\n \n I didn't say it was JUST reserved for the 144,000. But I'll bet you that's where you'll see a ton of it.\n \n \n\n The other problem with the miraculous 144k is that Jesus himself performed miracles, as did many of his disciples after his death, including John, the author of Revelation.\n\n \n See above.", 
   {}, 
   365807, 
   null, 
   1250636400.0
  ], 
  [
   365884, 
   null, 
   "Easyrider", 
   "Originally Posted by unkerpaulie : I wouldn't consider it solid testimony. I didn't do an indepth research on Wigglesworth, but wikipedia also mentions his claims of raising the dead without going into details. Its something I will try to get more info on.\n \n I was in a Benny Hinn service in Orlando once and we had this real old visiting preacher who knew Smith Wigglesworth. He told us how he witnessed a number of his miracles. \n \n There's a lot of books about Wigglesworth. I've read many of them. He's the real thing. What you'll come to find out is that he was a man highly dedicated to God. He wouldn't even let a visitor bring a regular newspaper into his house because it would often contain ungodly material.", 
   {}, 
   365883, 
   null, 
   1250636700.0
  ], 
  [
   365905, 
   null, 
   "unkerpaulie", 
   "You are making my point for me paulie. You would think that miracle workers like wigglesworth would be household names in a world hungry for the supernatural. But you fail to grasp that we live in a world which is steeped in spiritual darkness and which is dedicated blocking any recognition of that which reveals the true God or the light of His spiritual truths in this world.\n The Revival Legacy of Smith Wigglesworth\n \n\n You keep insisting that the\n re is some global conspiracy to intentionally supress anything that resemble legitimate supernatural phenomenon. I don't see that as a legitimate reason for the lack of evidence for miracle works. Yes, there are those that deliberately fight against and attack religion, then there are the skeptics and on-the-fence believers who are actively seeking signs and evidence, and there are actual believers who already are convinced and use these examples to reinforce their faith. Demographically, the anti-religious crowd are in the far minority. If a believer with the power to do the miraculous at will, as Jesus did, wanted to demonstrate to the world that the power of God was real and could be manifested through the hands of a man, there would be very little, if anything, that the anti-christian group could do to to stop him from reaching the other 2 groups. \n \n \nActually, I can. It is the nature of the spiritual battle which is defined so clearly in the bible and is evidenced everyday in the real world. The world system will attack and attempt to destroy any reference to miracles or miracle workers in their mention of them by reporting them as questionable flukes if they are real at all. Never do they report on them as actually happening, even when the recipient declares how true it is.Use me as an example. I have repeatedly told you of my own miraculous experiences yet you have completely ignored them or avoided acknowledging them at all as valid.\n \n A visiting Pastor who spoke to our church on sunday said that as a brick mason he had had constant pain in his back and shoulder for months. It was just something he was living with. He said that when he was in prayer, God had reminded him of it and asked how he was feeling. He acknowledged that he didn't even ask for healing but his shoulder and back are fixed, pain free. He had been healed a couple of days before even realizing it. I myself laid hands on my infant daughter who had a 103 degree temp. I claimed healing for her in Jesus name and before we walked from the living room to the kitchen, she went from listless to wide awake and smiling as she said mommy emoticon_xangel, at seeing her mother. My mother was shocked since she had just called us and demanded that we pick her up and rush her to the hospital based on her high temp and listless appearance. \n \n Like I say, we take such healings for granted since we ask and receive Gods intervention on such a regular basis. I admit that the pastor didn't even consciously ask for healing, but God knew the desire of his heart and surprised him with it.\n\n Forgive me if I'm not terribly awestruck by your pastor's recovery from his severe back pain, or your daughter getting over her high fever quickly. Its no surprise that this may seem like clear and undeniable evidence that miracles occur, to you. However, you cannot tell me that non-believers don't ever recover from ailments unexpectedly or without medical aid. There are more testimonies of people practicing alternative forms of healing, which often includes meditation, affirmations, yoga and physical exercises, which actually seem to give positive results on a more consistent basis than prayer. \n \n Where is the evidence of miracles that are third-party verifiable or can be tested objectively? Where are the grand works of manipulation of the laws of physics? How can recovering from back pain compare to converting water to wine? Remember, we are trying to determine if its true that those who believe in Jesus should be doing GREATER works than he did, if the statement in John 14:12 was a lie or not.", 
   {}, 
   365822, 
   null, 
   1250654280.0
  ], 
  [
   365948, 
   null, 
   "Archangel", 
   "You keep insisting that the\n re is some global conspiracy to intentionally supress anything that resemble legitimate supernatural phenomenon. I don't see that as a legitimate reason for the lack of evidence for miracle works.\n\n \n I keep insisting that because it is the absolute truth regarding the spiritual battle we are in between the forces of Good and Evil which the bible speaks so clearly about. It wasn't until I possessed the Holy Spirit that this battle became so evident to me though. So I understand you being blind to its reality. But that blindness doesn't negate the reality of this battle.\n \n \n Yes, there are those that deliberately fight against and attack religion, then there are the skeptics and on-the-fence believers who are actively seeking signs and evidence, and there are actual believers who already are convinced and use these examples to reinforce their faith. Demographically, the anti-religious crowd are in the far minority. If a believer with the power to do the miraculous at will, as Jesus did, wanted to demonstrate to the world that the power of God was real and could be manifested through the hands of a man, there would be very little, if anything, that the anti-christian group could do to to stop him from reaching the other 2 groups.\n\n \n All I can say in response to this statement, since I agree with it in principle is to say that we can't change the mind of anyone as human beings. All the skeptic of any level of disbelief can and must do is what I have said hundreds of times on this forum, and that is to take NO MANS word for anything spiritual as an absolutely reliable truth. I have encouraged everyone who seeks the eternal truth to actually grope out into the spiritual darkness of this world and seek God personally who will convict the person who sincerely seeks HIM. \n \n He promises that \"if you grope out into the darkness, I will find you.\" This world is the place of spiritual darkness but there is spiritual light which the world cannot comprehend. And only God can overcome that darkness and give us spiritual insight.\n Thus Jesus came to the Galilee of the Gentiles. In Him was Life, and the Life was the Light of men. \n The Light shines in the darkness and the darkness has not overcome It ... not grasped It ... not \n understood It ... not comprehended It (John 1:4-5). \n Forgive me if I'm not terribly awestruck by your pastor's recovery from his severe back pain, or your daughter getting over her high fever quickly. Its no surprise that this may seem like clear and undeniable evidence that miracles occur, to you. However, you cannot tell me that non-believers don't ever recover from ailments unexpectedly or without medical aid. There are more testimonies of people practicing alternative forms of healing, which often includes meditation, affirmations, yoga and physical exercises, which actually seem to give positive results on a more consistent basis than prayer. \n \n Where is the evidence of miracles that are third-party verifiable or can be tested objectively? Where are the grand works of manipulation of the laws of physics? How can recovering from back pain compare to converting water to wine? Remember, we are trying to determine if its true that those who believe in Jesus should be doing GREATER works than he did, if the statement in John 14:12 was a lie or not.\n\n \n Have you done a search for independently verified miracles in the modern age paulie? You obviously won't respect or trust any links rider or I post so do a search yourself and then post the results with any questions you have. Fair enough?", 
   {}, 
   365905, 
   null, 
   1250701140.0
  ], 
  [
   365965, 
   null, 
   "unkerpaulie", 
   "I didn't say it was JUST reserved for the 144,000. But I'll bet you that's where you'll see a ton of it.\n \n See above.\n\n Look at John 14:12 again. Jesus is addressing his disciples in front of him, and makes the statement that anyone who believes in him shall do the works he did, and greater. Nowhere does he indicate that this applies doesn't apply to ANYONE, nor that it applies to a certain group more than any other group. Anyone means anyone, and unless you can demonstrate that it doesn't, then how can I accept this argument?", 
   {}, 
   365883, 
   null, 
   1250706000.0
  ], 
  [
   365972, 
   null, 
   "unkerpaulie", 
   "I keep insisting that because it is the absolute truth regarding the spiritual battle we are in between the forces of Good and Evil which the bible speaks so clearly about. It wasn't until I possessed the Holy Spirit that this battle became so evident to me though. So I understand you being blind to its reality. But that blindness doesn't negate the reality of this battle.\n \n\n I'm afraid I can't take your word for it on this issue. Remember that a premise of this entire discussion is that our arguments are based on historical, scientific and theological evidence. And I specified in the previous thread that spiritual discernment and \n supernatural experiences could not be accepted as forms of theological evidence, only written scripture we can refer to and discuss. For the sake of this discussions, your claims of this ongoing spiritual battle is a personal assertion. \n \n \nAll I can say in response to this statement, since I agree with it in principle is to say that we can't change the mind of anyone as human beings. All the skeptic of any level of disbelief can and must do is what I have said hundreds of times on this forum, and that is to take NO MANS word for anything spiritual as an absolutely reliable truth. I have encouraged everyone who seeks the eternal truth to actually grope out into the spiritual darkness of this world and seek God personally who will convict the person who sincerely seeks HIM. \n \n He promises that \"if you grope out into the darkness, I will find you.\" This world is the place of spiritual darkness but there is spiritual light which the world cannot comprehend. And only God can overcome that darkness and give us spiritual insight.\n Thus Jesus came to the Galilee of the Gentiles. In Him was Life, and the Life was the Light of men. \n The Light shines in the darkness and the darkness has not overcome It ... not grasped It ... not \n understood It ... not comprehended It (John 1:4-5). \n\n Again, as the premise of my dilema, I'm relying on what I can objectively observe around me, and what the bible says that Jesus did and said, both pertaining to his \n disciples and the jews who walked with him, and to believers in general, including those alive throughout history up to today. My topic has nothing to do with relying on anybody's word. \n \n \nHave you done a search for independently verified miracles in the modern age paulie? You obviously won't respect or trust any links rider or I post so do a search yourself and then post the results with any questions you have. Fair enough?\n\n There you go assuming again. I haven't ignored your case of Wigglesworth, nor have I indicated that your links are going to be automatically invalidated solely because you're the one providing them. However, I haven't found any unbiased information concerning the work of Higglesworth, although I'm still looking. And even though I still contend that miracle working should be a commonplace event among believers, one single concrete example will definitely be proof that God-caused miracles exist. \n \n I'll reply shortly with the results of a search exercise and we can continue from there.", 
   {}, 
   365948, 
   null, 
   1250709300.0
  ], 
  [
   365993, 
   null, 
   "unkerpaulie", 
   "I did google searches for \"performing miracles\", \"evidence for miracles\" and \"miracle workers\". The search for miracle workers was the least productive. Apparently its both a song and movie title. \n \n Miracles\n One of the most well-written and interesting articles I've read on the subject. It addresses this very issue directly. However, the points aren't anything new. The argument is that \"greater\" could mean \"more significant pertaining to the kingdom of God\", then doesn't complete the argument because can we really point anyone who had greater significance to the christian movement than Jesus? This argument doesn't make sense. \n \n The Man with No Heart: Miracles and Evidence\n This article kinda argues from my side. \n \n Miracle Worker (Mark 6: 1-6)\n More or less argues that miracles are occuring around us, but you can't identify them unless you have faith to see the miracles everyday (similar to Archangel's argument). In other words, believing that miracles occur is a prerequisite for believing that miracles occur, and then everything that occurs is evidence that miracles occur. \n \n There's a 6 part article from doxa.com, but I didn't read it all yet. \n \n And none of these search results really gave any examples of actual miracles occuring, except for a few healings and physical cures. But nothing that are undeniably supernatural, nor could they be considered \"greater\" than what Jesus did\".\n \n Any suggestions on how to better find more examples of miracles greater than what Jesus did?", 
   {}, 
   365972, 
   null, 
   1250720880.0
  ], 
  [
   366114, 
   null, 
   "unkerpaulie", 
   "This is probably pointless. The more I search for evidence that miracles occur in the modern era, the more evidence I find that there are no miracles occurring. Only more excuses for the absence of miracles, more apologies for the statement Jesus made, more reasons why we shouldn't expect miracles anyway. In short, the promise was a lie, and while most christians won't admit it, they cover at the question whenever it is raised. \n \n I've been down this road before guys. I actually thought this thread would last longer than this, but it is what it is. We can settle it here.", 
   {}, 
   365993, 
   null, 
   1250798460.0
  ], 
  [
   366136, 
   null, 
   "JPSartre12", 
   "This is probably pointless. The more I search for evidence that miracles occur in the modern era, the more evidence I find that there are no miracles occurring. Only more excuses for the absence of miracles, more apologies for the statement Jesus made, more reasons why we shouldn't expect miracles anyway. In short, the promise was a lie, and while most christians won't admit it, they cover at the question whenever it is raised. \n \n I've been down this road before guys. I actually thought this thread would last longer than this, but it is what it is. We can settle it here.\n\n \n I hate to admit it, but I guess I'm a poor example of Christianity. While I should be trying to convert the great unwashed masses, I take the pragmatic approach and figure the lines will be shorter when I get to the Pearly Gates if I don't. emoticon_rolleyes", 
   {}, 
   366114, 
   null, 
   1250809560.0
  ], 
  [
   366142, 
   null, 
   "Easyrider", 
   "This is probably pointless. The more I search for evidence that miracles occur in the modern era, the more evidence I find that there are no miracles occurring. Only more excuses for the absence of miracles, more apologies for the statement Jesus made, more reasons why we shouldn't expect miracles anyway. In short, the promise was a lie, and while most christians won't admit it, they cover at the question whenever it is raised. \n \n I've been down this road before guys. I actually thought this thread would last longer than this, but it is what it is. We can settle it here.\n\n \n Nonsense. There's healing services all over America virtually every week. Just get off your butt and take a trip around America and start calling and visiting churches. You can start with the Assemblies of God. Some have it and some don't. You just have to check around.\n \n You probably won't find God on the internet.", 
   {}, 
   366114, 
   null, 
   1250814540.0
  ], 
  [
   366159, 
   null, 
   "unkerpaulie", 
   "Nonsense. There's healing services all over America virtually every week. Just get off your butt and take a trip around America and start calling and visiting churches. You can start with the Assemblies of God. Some have it and some don't. You just have to check around.\n \n\n If you're referring to the tele-evangelists or visiting church speakers or outdoor speakers that proclaim healing in Jesus name, then say something like \"there's someone here tonight with a backpain/toothache/lost job, and the Lord is telling you right now to get out of you seat and come forward and receive your healing.\" Then he lays his hands on your head, prays at the top of his voice and pushes you backward in Jesus' name. When you fall over in shock and filled with the holy ghost and forget all about your ailment, and yay! You're healed! Hallelujah!\n \n Yeah, I know all about these healers. I used to help set them up. I was on both ends, both receiving healing and laying hands. A lot of noise, sleight of hands and effort to get you to really really really believe that God has healed you. They even tell you that if you still feel the same pain its the devil playing tricks on you. \n \n Please come better than that ez. And how is healing some vague anonymous pain comparable to the works Jesus did?\n \n \nYou probably won't find God on the internet.\n\n Thanks for contributing to the very long list of places I WON'T find miracles at. You've been very helpful.", 
   {}, 
   366142, 
   null, 
   1250827800.0
  ], 
  [
   366338, 
   null, 
   "Easyrider", 
   "If you're referring to the tele-evangelists or visiting church speakers or outdoor speakers that proclaim healing in Jesus name, then say something like \"there's someone here tonight with a backpain/toothache/lost job, and the Lord is telling you right now to get out of you seat and come forward and receive your healing.\" Then he lays his hands on your head, prays at the top of his voice and pushes you backward in Jesus' name. When you fall over in shock and filled with the holy ghost and forget all about your ailment, and yay! You're healed! Hallelujah!\n \n Yeah, I know all about these healers. I used to help set them up. I was on both ends, both receiving healing and laying hands. A lot of noise, sleight of hands and effort to get you to really really really believe that God has healed you. They even tell you that if you still feel the same pain its the devil playing tricks on you. \n \n Please come better than that ez. And how is healing some vague anonymous pain comparable to the works Jesus did?\n \n \n Thanks for contributing to the very long list of places I WON'T find miracles at. You've been very helpful.\n\n \n \n You're confusing the charlatans with the real thing. Typical superficial judgment.\n \n What is it about Hell that you find attractive?", 
   {}, 
   366159, 
   null, 
   1250968380.0
  ], 
  [
   366342, 
   null, 
   "unkerpaulie", 
   "Well, ez, other than the ministry of Wigglesworth, a miracle worker from 100 years ago, your examples of the \"real thing\" are non-existant, not surprising, since by your own theory (which you haven't supported whatsoever, don't where you got it from), the supernatural performances won't really manifest until the 144000 chosen arrive. If you think about it, you should be thanking the charlatans, because they're the only ones that are attempting to keep the miracle lies alive. \n \n What's so appealing about hell? You're the one obsessed with hell, not me. You mention hell more than anyone on this forum, statistically. I don't waste my time fantasizing about imaginary afterlife consequences that are going to be levied by an imaginary being after I die.", 
   {}, 
   365742, 
   null, 
   1250972340.0
  ], 
  [
   366383, 
   null, 
   "obvious_child", 
   "unkerpaulie, you forget. The real Hell is eternity with people like arch and ez. Hell is just a small white room where you never get tried or hungry. There is no physical torture. You just have to listen to people like archie and ez forever. ", 
   {}, 
   366342, 
   null, 
   1250988960.0
  ], 
  [
   366392, 
   null, 
   "JPSartre12", 
   "unkerpaulie, you forget. The real Hell is eternity with people like arch and ez. Hell is just a small white room where you never get tried or hungry. There is no physical torture. You just have to listen to people like archie and ez forever. \n\n \n I'll make you a deal. I won't mock your lack of intelligence if you don't mock their religion. Deal?", 
   {}, 
   366383, 
   null, 
   1250993940.0
  ], 
  [
   366411, 
   null, 
   "obvious_child", 
   "I'll make you a deal. I won't mock your lack of intelligence if you don't mock their religion. Deal?\n\n \n On the contrary, I suffer from no lack of intelligence. Lack of knowledge on a great many things like quantum mechanics, but intelligence as a general notion no. And I'm not mocking their religion per se. I am mocking their interpretations as well as defense of their interpretations. If I was mocking their religions, I would give shooter and Mathew the same kind of XXXX I give Archie and Ez. Notice I do not do that. Just because I have nothing but contempt for Ez and Arch does not mean I attack their religion in criticizing them.", 
   {}, 
   366392, 
   null, 
   1251011760.0
  ], 
  [
   366419, 
   null, 
   "Easyrider", 
   "On the contrary, I suffer from no lack of intelligence. Lack of knowledge on a great many things like quantum mechanics, but intelligence as a general notion no.\n\n \n A lot of smart people are going to wind up in hell because like you, they lack Godly WISDOM.\n \n \n\n And I'm not mocking their religion per se. I am mocking their interpretations as well as defense of their interpretations. If I was mocking their religions, I would give shooter and Mathew the same kind of XXXX I give Archie and Ez. Notice I do not do that. Just because I have nothing but contempt for Ez and Arch does not mean I attack their religion in criticizing them.\n\n \n You can attack all day long, but so far you haven't made even a small dent in the traditional truths of the Bible. \n \n As for the Biblical notion of Hell:\n \n In Luke 16, Jesus Christ gives a frightening picture of hell: \n \n 22 . . . the rich man also died, and was buried; \n 23 And in hell he lift up his eyes, being in torments, and seeth Abraham afar off, and Lazarus in his bosom. \n 24 And he cried and said, Father Abraham, have mercy on me, and send Lazarus, that he may dip the tip of his finger in water, and cool my tongue; for I am tormented in this flame. \n 25 But Abraham said, Son, remember that thou in thy lifetime receivedst thy good things, and likewise Lazarus evil things: but now he is comforted, and thou art tormented.\n 26 And beside all this, between us and you there is a great gulf fixed: so that they which would pass from hence to you cannot; neither can they pass to us, that would come from thence. \n 27 Then he said, I pray thee therefore, father, that thou wouldest send him to my father's house:\n 28 For I have five brethren; that he may testify unto them, lest they also come into this place of torment. (Luke 16:22-28)\n \n In Matthew 13:42, Jesus says: \"And shall cast them into a FURNACE OF FIRE: there shall be wailing and gnashing of teeth.\"\n \n In Matthew 25:41, Jesus says: \"Depart from me, ye cursed, into everlasting FIRE,. . .\"\n Jesus Christ says in Mark 9:43-47, \n \n 43 And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, into the fire that never shall be quenched:\n 45 And if thy foot offend thee, cut it off: it is better for thee to enter halt into life, than having two feet to be cast into hell, into the fire that never shall be quenched:\n 47 And if thine eye offend thee, pluck it out: it is better for thee to enter into the kingdom of God with one eye, than having two eyes to be cast into hell fire:\n \n WHAT JESUS CHRIST SAYS ABOUT HELL! \"fire\" Matt 7:19, 13:40, 25:41 \"everlasting fire\" Matt 18:8, 25:41 \"eternal damnation\" Mark 3:29 \"hell fire\" Matt 5:22, 18:9, Mark 9:47 \"damnation\" Matt 23:14, Mark 12:40, Luke 20:47 \"damnation of hell\" Matt 23:33 \"resurrection of damnation\" John 5:29 \"furnace of fire\" Matt 13:42, 50 \"the fire that never shall be quenched\" Mark 9:43, 45 \"the fire is not quenched\" Mark 9:44, 46, 48 \"Where their worm dieth not\" Mark 9:44, 46, 48 \"wailing and gnashing of teeth\" Matt 13:42, 50 \"weeping and gnashing of teeth\" Matt 8:12, 22:13, 25:30 \"torments\" Luke 16:23 \"tormented in this flame\" Luke 16:24 \"place of torment\" Luke 16:28 \"outer darkness\" Matt 8:12, 22:13 \"everlasting punishment\" Matt 25:46\n \n Jesus Christ gave a solemn warning in Matthew 7:21-23:\n \n \"Not every one that saith unto me, Lord, Lord, shall enter into the kingdom of heaven. . . MANY will say to me in that day, Lord, Lord, have we not prophesied in thy name? and in thy name have cast out devils? and in thy name done many wonderful works? And then will I profess unto them, I never knew you: depart from me, ye that work iniquity.\" \n \n Repent!", 
   {
    "unicode_changes_made": true
   }, 
   366411, 
   null, 
   1251034680.0
  ], 
  [
   366423, 
   null, 
   "Archangel", 
   "On the contrary, I suffer from no lack of intelligence. Lack of knowledge on a great many things like quantum mechanics, but intelligence as a general notion no. \n\n \n ONE, just one of the massive blind spots/knowledge gaps you have is your complete ignorance of a true interpretation of Gods word. Yet you log on here and attack our interpretation of it as if you are basing your perversion of it on anything more than your own corrupted brain. And you then have the audacity to insist that you suffer from no lack of intelligence? If your self assessment wasn't so pathetic, it would be hilarious.\n \n \nAnd I'm not mocking their religion per se. I am mocking their interpretations as well as defense of their interpretations. If I was mocking their religions, I would give shooter and Mathew the same kind of XXXX I give Archie and Ez. Notice I do not do that. Just because I have nothing but contempt for Ez and Arch does not mean I attack their religion in criticizing them.\n\n \n You see the bolded, here is the bottom line regarding the true nature and character of this obnoxious child; you constantly prove that it is the literal and scriptural interpretation of Gods word which offends you and which you attack because Rider, me and marc defend it. But when secularists like shooter and Matthew, to name just two here, compromise and water down Gods truths with their own personal and self serving interpretation, you have no problem at all with them. \n \n The reason for this my ignorant and spiritually dead friend is because you prefer the lie to the truth. You embrace the darkness over the light and you hate anyone who speaks that truth in opposition to the lie which you and your ilk wallow in. Here's how God says it.\n \n Jhn 8:44 You are of [your] father the devil, and the desires of your father you want to do. He was a murderer from the beginning, and does not stand in the truth, because there is no truth in him. When he speaks a lie, he speaks from his own [resources], for he is a liar and the father of it.\n \n \n Rom 1:22 Professing to be wise, they became fools,\n Rom 1:23 and changed the glory of the incorruptible God into an image made like corruptible man--and birds and four-footed animals and creeping things.\n Rom 1:24 Therefore God also gave them up to uncleanness, in the lusts of their hearts, to dishonor their bodies among themselves,\n Rom 1:25 who exchanged the truth of God for the lie, and worshiped and served the creature rather than the Creator, who is blessed forever. Amen.\n This is what you represent when you lie about who God is. You are so deceived and ignorant you don't even realize that when you reject Gods truths, you are in fact calling Him a liar and making yourself an enemy of His. How smart is the person who attacks the eternal God of life, child? What chance does he have to win against such a being? Yet you hold yourself up as an example of intelligent thought? Can you see why I call you self deluded and irrational, now? Because you define that condition.", 
   {}, 
   366411, 
   null, 
   1251038820.0
  ], 
  [
   366425, 
   null, 
   "unkerpaulie", 
   "Whoa whoa whoa!!! Ok this is not the thread for this. I specifically placed this thread in the \"formal debates\" forum because I wanted to prevent this discussion from turning into a theist-atheist slugfest, like most religious thread do as of late. Obvious child, please don't post here unless its on topic. There are lots of threads to take jabs at archangel, not this one. And archangel, don't get pulled off course by obvious child trying to push your buttons, at least let's keep this thread focused. Thanks guys.", 
   {}, 
   366423, 
   null, 
   1251039960.0
  ], 
  [
   366428, 
   null, 
   "Archangel", 
   "Whoa whoa whoa!!! Ok this is not the thread for this. I specifically placed this thread in the \"formal debates\" forum because I wanted to prevent this discussion from turning into a theist-atheist slugfest, like most religious thread do as of late. Obvious child, please don't post here unless its on topic. There are lots of threads to take jabs at archangel, not this one. And archangel, don't get pulled off course by obvious child trying to push your buttons, at least let's keep this thread focused. Thanks guys.\n\n \n Keep that hate mongering troll off of the thread and it wont get derailed. But you can be sure that if he does post, he will derail it with his ignorant and personal attacks.", 
   {}, 
   366425, 
   null, 
   1251040620.0
  ], 
  [
   366458, 
   null, 
   "GiantOreo", 
   "Keep that hate mongering troll off of the thread and it wont get derailed. But you can be sure that if he does post, he will derail it with his ignorant and personal attacks.\n\n \n Am I missing something here? Unkerpaulie is really the admin? No? then how is he supposed to \"keep that hate mongering troll off of the thread\"?emoticon_emb", 
   {}, 
   366428, 
   null, 
   1251053520.0
  ], 
  [
   366465, 
   null, 
   "unkerpaulie", 
   "Am I missing something here? Unkerpaulie is really the admin? No? then how is he supposed to \"keep that hate mongering troll off of the thread\"?emoticon_emb\n\n No I'm not the admin or anything like that. And I'm not going to call the admin to moderate threads like this either. I trust that if I respectfully ask obvious child, or anybody else, to not post unless it pertains to whether miracles occur or an alternative interpretation to john 14:12, he will respect my request. \n \n As far as the topic goes, it still stands that miracles don't occur, and never did. And that the statement made in john 14:12, quoted by Jesus, is a lie.", 
   {}, 
   366458, 
   null, 
   1251056820.0
  ], 
  [
   366526, 
   null, 
   "obvious_child", 
   "Whoa whoa whoa!!! Ok this is not the thread for this. I specifically placed this thread in the \"formal debates\" forum because I wanted to prevent this discussion from turning into a theist-atheist slugfest, like most religious thread do as of late. Obvious child, please don't post here unless its on topic. There are lots of threads to take jabs at archangel, not this one. And archangel, don't get pulled off course by obvious child trying to push your buttons, at least let's keep this thread focused. Thanks guys.\n\n \n The funny thing is, I'm not an atheist and second both ez and arch immediately try to tie their personal interpretations of Christanity to all of what Christanity represents. Rejecting the views of Ez and Archie in a sane, logical view does not mean rejecting Christanity. Only dishonest cast their interpretations as the only interpretations. And you know it is impossible for archie to stay on topic when he's losing and he loses all of the time.", 
   {}, 
   366425, 
   null, 
   1251109860.0
  ], 
  [
   366532, 
   null, 
   "Archangel", 
   "The funny thing is, I'm not an atheist and second both ez and arch immediately try to tie their personal interpretations of Christanity to all of what Christanity represents. Rejecting the views of Ez and Archie in a sane, logical view does not mean rejecting Christanity. Only dishonest cast their interpretations as the only interpretations. And you know it is impossible for archie to stay on topic when he's losing and he loses all of the time.\n\n \n This is another misrepresentation by the obnoxious child of my position. I don't claim to represent the position of all of christianity at all. I represent the traditional scriptural interpretation of the bible according to an historical theological perspective. A view many modern churches have abandoned in favor of a more secular, or politically correct interpretation which traditionalists like me reject. \n \n To reinterpret the bible in order to erase the condemnation of homosexuality and to accept evolution as a plausible interpretation of Genesis is to corrupt the basic morality of God and the teachings of creation theology in the bible. \n \n It also needs to be stated that we are dealing with an arrogant egotist who will constantly claim victory in debates in which he cannot support his corrupted positions in any way, shape or form. Unless this troll misrepresents what another says, he is incapable of even responding to it. emoticon_ic", 
   {}, 
   366526, 
   null, 
   1251119220.0
  ], 
  [
   366602, 
   null, 
   "Easyrider", 
   "This is another misrepresentation by the obnoxious child of my position. I don't claim to represent the position of all of christianity at all. I represent the traditional scriptural interpretation of the bible according to an historical theological perspective. A view many modern churches have abandoned in favor of a more secular, or politically correct interpretation which traditionalists like me reject. \n \n To reinterpret the bible in order to erase the condemnation of homosexuality and to accept evolution as a plausible interpretation of Genesis is to corrupt the basic morality of God and the teachings of creation theology in the bible. \n \n It also needs to be stated that we are dealing with an arrogant egotist who will constantly claim victory in debates in which he cannot support his corrupted positions in any way, shape or form. Unless this troll misrepresents what another says, he is incapable of even responding to it. emoticon_ic\n\n \n Amen, brother. For Obvious Child to refer to himself as sane and logical is hysterical. emoticon_xbouncer", 
   {}, 
   366532, 
   null, 
   1251158640.0
  ], 
  [
   366644, 
   null, 
   "obvious_child", 
   "This is another misrepresentation by the obnoxious child of my position. I don't claim to represent the position of all of christianity at all.\n\n \n Yeah, you just call everyone who disagrees with you, including fellow Christians to be atheists. If you didn't do exactly what I said you did, you wouldn't have threw huge amounts of insults and Shooter and Mathew because they disagreed with your interpretation. If you didn't think that only your interpretation was correct you wouldn't go around calling everyone who disagreed with you Godless heathens. \n \n \nI represent the traditional scriptural interpretation of the bible according to an historical theological perspective.\n\n \n Keep pretending you do that. Just like you keep pretending you don't call everyone who disagrees with you an atheist. \n \n \nA view many modern churches have abandoned in favor of a more secular, or politically correct interpretation which traditionalists like me reject.\n\n \n Like a view that accepts evolution on the mountain of its evidence? A view that doesn't consider math to be atheism? A view that doesn't fall for a myriad of hoaxes? A view that knows oil is a hydrocarbon?\n \n \nTo reinterpret the bible in order to erase the condemnation of homosexuality and to accept evolution as a plausible interpretation of Genesis is to corrupt the basic morality of God and the teachings of creation theology in the bible.\n\n \n Not according to many Christians. Oh wait. I forgot, if they disagree, they are atheists!!! Too bad their views don't make their God out to be a liar like your view does. Tell me, how does your view not corrupt morality of God and the teachings of creation theology in the bible when you believe your God is the King of Liars? emoticon_xgood\n \n \nIt also needs to be stated that we are dealing with an arrogant egotist who will constantly claim victory in debates in which he cannot support his corrupted positions in any way, shape or form. Unless this troll misrepresents what another says, he is incapable of even responding to it. emoticon_ic\n\n \n That's hysterical coming from you. See my signature for more evidence.", 
   {}, 
   366532, 
   null, 
   1251178080.0
  ], 
  [
   366645, 
   null, 
   "obvious_child", 
   "Amen, brother. For Obvious Child to refer to himself as sane and logical is hysterical. emoticon_xbouncer\n\n \n Really? Tell me, can you answer this post?\n \n http://www.4forums.com/political/366413-post81.html\n \n Sane and logical dictate that I have lied in both. Your friend Archie believes otherwise. Tell me, who's logical and sane now? \n \n Sane and logical dictate that tv props cannot prove YEC. Your friend Archie believes otherwise. Tell me, who's logical and sane now? \n \n Sane and logical dictate that math is not atheism. Your friend Archie believes otherwise. Tell me, who's logical and sane now? \n \n You really want to go down this path? \n \n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13107-effective-arguments-disproving-biblical-creation-7.html#post366525", 
   {}, 
   366602, 
   null, 
   1251178200.0
  ], 
  [
   366662, 
   null, 
   "Archangel", 
   "Amen, brother. For Obvious Child to refer to himself as sane and logical is hysterical. emoticon_xbouncer\n\n Yeah, and he's a legend in his own mind too. He rants and rages against us while never making even the most basic degree of rational sense, yet to him it's us who is wrong. He personifies the passage.\n Rom 11:7 What then? Israel has not obtained what it seeks; but the elect have obtained it, and the rest were blinded.\n Rom 11:8 Just as it is written: \"God has given them a spirit of stupor, Eyes that they should not see And ears that they should not hear, To this very day.\" [fn]\n Rom 11:9 And David says: \"Let their table become a snare and a trap, A stumbling block and a recompense to them.\n Rom 11:10 Let their eyes be darkened, so that they do not see, And bow down their back always.\" [fn]\n I mean, in post 37 just above this one, he links to the same post of his TWICE, just to make it look like there are two points you aren't responding to since he knows that people don't bother clicking on his links. I only did it out of curiosity only to find the same post linked to twice. What sane person even thinks to do that?", 
   {}, 
   366602, 
   null, 
   1251186540.0
  ], 
  [
   366664, 
   null, 
   "obvious_child", 
   "Yeah, and he's a legend in his own mind too. He rants and rages against us while never making even the most basic degree of rational sense, yet to him it's us who is wrong. He personifies the passage.\n \n I mean, in post 37 just above this one, he links to the same post of his TWICE\n\n \n While I fully realize you can't do math and thus why you consider it atheism, but post #96 and post #81 are not the same post. But then again, you were the one who argued that post 113 came before 106 so maybe you do think that complete failure to understand math and linear thinking is sane? \n \n \njust to make it look like there are two points you aren't responding to since he knows that people don't bother clicking on his links. I only did it out of curiosity only to find the same post linked to twice. What sane person even thinks to do that?\n\n \n Huh. Tell me, is post #96 and post #81 the same post? Hell post #81 and #96 aren't even on the same page. \n \n Good god. Did you even go to elementary school?", 
   {}, 
   366662, 
   null, 
   1251189660.0
  ], 
  [
   366670, 
   null, 
   "T.Q", 
   "\n I mean, in post 37 just above this one, he links to the same post of his TWICE, just to make it look like there are two points you aren't responding to since he knows that people don't bother clicking on his links. I only did it out of curiosity only to find the same post linked to twice. What sane person even thinks to do that?\n\n \n Uh, no, he didn't.", 
   {}, 
   366662, 
   null, 
   1251195900.0
  ], 
  [
   366689, 
   null, 
   "Archangel", 
   "When I click on both links on this post: http://www.4forums.com/political/366645-post37.html post 81 comes up twice. Of this there is no doubt. If you want to quote to a specific post, then quote the number rather than the permalink which copies a page section rather than a specific post. Some of us have chosen a different number of posts per page rather than the default of 10. emoticon_xdonno", 
   {}, 
   366670, 
   null, 
   1251217800.0
  ], 
  [
   366728, 
   null, 
   "admin", 
   "The software does not handle this kind of link well.\n http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13107-effective-arguments-disproving-biblical-creation-7.html#post366525 which looks like this\n 4forums.com/political/creation-intelligent-design-vs-evolution/13107-effective-arguments-disproving-biblical-creation-7.html#post366525\n \n to get to the right post you should remove the page number \"-7\"\n to get \n 4forums.com/political/creation-intelligent-design-vs-evolution/13107-effective-arguments-disproving-biblical-creation.html#post366525\n \n I'm sorry its this way but there is nothing I can do about it.", 
   {}, 
   366689, 
   null, 
   1251226620.0
  ], 
  [
   366741, 
   null, 
   "Workman", 
   "Hi All,\n \n I'm really new to this forum. Been reading alot of the religion debates and have found them very interesting.\n \n Here is 2 cents on this topic or more over most I guess when you have 2 oposite sides bebating God,Jesus, the Bible.\n \n 1. For the non believer the Bible is false, untrue, crazy\n 2. for the non believer the Believer is either nuts, crazy, whatever, who cares\n 3. For the believer, they should in all ways (which is really hard), do everything in love.\n \n For the non believer (I used to be one not so long ago). You want facts, proof, physical, or otherwise from some scholar that \"you\" trust and a valid source. \n \n For the believer - the facts and proof are in the bible. Everything else to back up the bible as proof like, geology, archaeology, are added to the foundation of belief in the bible, jesus, etc. etc.\n \n So my point is this I guess. The bebates will never end, no 1 side will \"win\". \n \n I found this in Isaiah - and for the most part, it sums up for me (and alot of christians), what we as believers are up against in a world and currupt and evil as ours.\n \n saiah 55:8-9 (New International Version)\n \n 8 \"For my thoughts are not your thoughts,\n neither are your ways my ways,\"\n declares the LORD.\n \n 9 \"As the heavens are higher than the earth,\n so are my ways higher than your ways\n and my thoughts than your thoughts.\n \n I didn't believe this passage a few years ago, nor did I believe much about the bible. But, once I opened my mind up a bit and took at the closed view from our America society and the world at large with all it's really messed up problems. I Read, and read and at first I did try to take thing literally, but after time, and talking to other believers and non believers it was very apparent to me that no matter how are any of us tries to disprove, or discount either the believer or non believer the above versus just seems to sum it all up.\n \n Ok... I guess you can now pick apart my comment.... waiting.. =)\n \n ps. please excuse the typos or grammar mistakes.... thank you.", 
   {
    "post_info": {
     "post_title": "my take"
    }
   }, 
   365965, 
   null, 
   1251229920.0
  ], 
  [
   366746, 
   null, 
   "Archangel", 
   "Hi All,\n \n I'm really new to this forum. Been reading alot of the religion debates and have found them very interesting.\n \n Here is 2 cents on this topic or more over most I guess when you have 2 oposite sides bebating God,Jesus, the Bible.\n \n 1. For the non believer the Bible is false, untrue, crazy\n 2. for the non believer the Believer is either nuts, crazy, whatever, who cares\n 3. For the believer, they should in all ways (which is really hard), do everything in love.\n \n For the non believer (I used to be one not so long ago). You want facts, proof, physical, or otherwise from some scholar that \"you\" trust and a valid source. \n \n For the believer - the facts and proof are in the bible. Everything else to back up the bible as proof like, geology, archaeology, are added to the foundation of belief in the bible, jesus, etc. etc.\n \n So my point is this I guess. The bebates will never end, no 1 side will \"win\". \n \n I found this in Isaiah - and for the most part, it sums up for me (and alot of christians), what we as believers are up against in a world and currupt and evil as ours.\n \n saiah 55:8-9 (New International Version)\n \n 8 \"For my thoughts are not your thoughts,\n neither are your ways my ways,\"\n declares the LORD.\n \n 9 \"As the heavens are higher than the earth,\n so are my ways higher than your ways\n and my thoughts than your thoughts.\n \n I didn't believe this passage a few years ago, nor did I believe much about the bible. But, once I opened my mind up a bit and took at the closed view from our America society and the world at large with all it's really messed up problems. I Read, and read and at first I did try to take thing literally, but after time, and talking to other believers and non believers it was very apparent to me that no matter how are any of us tries to disprove, or discount either the believer or non believer the above versus just seems to sum it all up.\n \n Ok... I guess you can now pick apart my comment.... waiting.. =)\n \n ps. please excuse the typos or grammar mistakes.... thank you.\n\n \n Hi workman, and welcome to the forum. You are right of course in everything you say. A consensus will never be agreed upon regarding this subject. I mean, you posting the wisdom of Isaiah was a wasted effort since it means nothing to the spiritually dead here. And if in following my posts you find me harsh in my responses, remember just 2 things until you have been here for a while. 1) The truth I share with these unbelievers in shared in love by the very fact that I am sharing eternal truths which lead to salvation if they will only listen with sincere hearts. And 2) Just wait until you have been rebuffed repeatedly with the most inane and ridiculous arguments which reject any and all scriptural evidence as backward thinking mind control, and see how patient you remain when faced with such foolishness by so many people who insist they are insightful intelligent people.", 
   {}, 
   366741, 
   null, 
   1251230580.0
  ], 
  [
   366757, 
   null, 
   "unkerpaulie", 
   "Hi All,\n \n I'm really new to this forum. Been reading alot of the religion debates and have found them very interesting.\n \n Here is 2 cents on this topic or more over most I guess when you have 2 oposite sides bebating God,Jesus, the Bible.\n \n 1. For the non believer the Bible is false, untrue, crazy\n 2. for the non believer the Believer is either nuts, crazy, whatever, who cares\n 3. For the believer, they should in all ways (which is really hard), do everything in love.\n \n For the non believer (I used to be one not so long ago). You want facts, proof, physical, or otherwise from some scholar that \"you\" trust and a valid source. \n \n For the believer - the facts and proof are in the bible. Everything else to back up the bible as proof like, geology, archaeology, are added to the foundation of belief in the bible, jesus, etc. etc.\n \n So my point is this I guess. The bebates will never end, no 1 side will \"win\". \n \n\n I disagree. I used to be a believer and I argued passionately against atheists and their beliefs. I never assume I have all the answers, that's why I ask questions. Look back at the thread, before obvious child totally derailed it. \n \n The question is: do miracles occur? Didn't Jesus promise to grant the power to do miracles to those that believed in him, in John 14:12? I'm not assuming they don't occur, or that Jesus lied. I'm just stating that I've never seen any miracles being performed today, or even heard of any. Its really a yes or no question. For believers, this should be an easy question to answer, shouldn't it?\n \n \nI found this in Isaiah - and for the most part, it sums up for me (and alot of christians), what we as believers are up against in a world and currupt and evil as ours.\n \n saiah 55:8-9 (New International Version)\n \n 8 \"For my thoughts are not your thoughts,\n neither are your ways my ways,\"\n declares the LORD.\n \n 9 \"As the heavens are higher than the earth,\n so are my ways higher than your ways\n and my thoughts than your thoughts.\n \n I didn't believe this passage a few years ago, nor did I believe much about the bible. But, once I opened my mind up a bit and took at the closed view from our America society and the world at large with all it's really messed up problems. I Read, and read and at first I did try to take thing literally, but after time, and talking to other believers and non believers it was very apparent to me that no matter how are any of us tries to disprove, or discount either the believer or non believer the above versus just seems to sum it all up.\n \n Ok... I guess you can now pick apart my comment.... waiting.. =)\n \n ps. please excuse the typos or grammar mistakes.... thank you.\n\n This is truly the cause of the great divide between theists and atheists. Based on this verse (and others that are similar) christians abandon the pursuit of knowledge, because they are preconditioned to believe that they have an inferior intellect. You feel uncomfortable when asked questions that may challenge what you believe, because you don't know the answer, don't want to know the answer, and believe that you are incapable of knowing the answer. Not only that, but you combine this verse with other scriptures that talk about God being supreme, authoratative, and always right. So you feel that you already know everything you need to know, and you bluntly refuse to learn anything new. Whether you hate knowledge or fear knowledge I can't say, but you avoid knowledge at all costs. \n \n People who end up being atheists are the ones that are open to questions. We seek new information, test it, question it, test it some more, and then build our beliefs based of knowledge that can be questioned and tested, and still prevail. We challenge old beliefs in the face of new evidence. We allow old beliefs, that we might have held closely, to die and make way for beliefs that are better supported by evidence in reality. \n \n I cannot accept the idea that God cannot be comprehended, just because the bible that tells us about this God says so. This is a lame excuse to remain ignorant. Do you really feel that your God requires you to remain ignorant? If the bible says one thing, such as believers will do greater miracles than Jesus did in his time, then why shouldn't we look at real life to see if this is true? Isn't this how you accept everything else you read in the bible? That's all I'm doing.", 
   {}, 
   366741, 
   null, 
   1251235800.0
  ], 
  [
   366758, 
   null, 
   "unkerpaulie", 
   "Hey admin, since you're checking out this thread anyway, could you possibly delete the side arguments between obvious child, archangel and easyrider please? At least throw it in a ringside thread or something so they can take their fight elsewhere. Thanks", 
   {
    "post_info": {
     "post_title": "Back on track please..."
    }
   }, 
   366458, 
   null, 
   1251235980.0
  ], 
  [
   366760, 
   null, 
   "obvious_child", 
   "When I click on both links on this post: http://www.4forums.com/political/366645-post37.html post 81 comes up twice. Of this there is no doubt.\n\n \n Aside from the fact you are obviously lying by your own admission. \n \n \nIf you want to quote to a specific post, then quote the number rather than the permalink which copies a page section rather than a specific post. Some of us have chosen a different number of posts per page rather than the default of 10. emoticon_xdonno\n\n \n Which proves you are lying. How can the same post come up when one is a thread link that starts on post #96 and the other is a specific post link to #81?\n \n You FIRST claim that they both show post #81, but then you state that one is a permalink which links to a PAGE SECTION. Tell me Liar, how is a specific post link and a permalink the same thing? Btw, the forum default is 15. Good job on constant fail there. Or maybe you think that 10=15? \n \n Good God you never even got past 2nd grade did you?", 
   {}, 
   366689, 
   null, 
   1251238140.0
  ], 
  [
   366777, 
   null, 
   "Archangel", 
   "Aside from the fact you are obviously lying by your own admission. \n \n \n \n Which proves you are lying. How can the same post come up when one is a thread link that starts on post #96 and the other is a specific post link to #81?\n \n You FIRST claim that they both show post #81, but then you state that one is a permalink which links to a PAGE SECTION. Tell me Liar, how is a specific post link and a permalink the same thing? Btw, the forum default is 15. Good job on constant fail there. Or maybe you think that 10=15? \n \n Good God you never even got past 2nd grade did you?\n\n \n You're rambling incoherently again obnoxious child. And are lying also in your deluded belief that every member here can't go to their own \"Edit Option\" page and see exactly how many posts per page they can show. emoticon_rolleyes:xbanghead And I invite everyone to do just that in order to prove which of us is the epic liar as the child likes to say. In fact, the show posts option doesn't even have a choice for 15 which the liar asserts is the only other option. Go figure huh! It allows for 5,10, 20, 30 and 40, but no 15. emoticon_xbye \n \n Number of Posts to Show Per Page\n Use this option to set the number of posts to show in a thread before splitting the display into multiple pages.Show 40 posts per page\n \n Here's the edit options page link: http://www.4forums.com/political/profile.php?do=editoptions", 
   {}, 
   366760, 
   null, 
   1251246300.0
  ], 
  [
   366782, 
   null, 
   "T.Q", 
   "You're rambling incoherently again obnoxious child. And are lying also in your deluded belief that every member here can't go to their own \"Edit Option\" page and see exactly how many posts per page they can show. emoticon_rolleyes:xbanghead And I invite everyone to do just that in order to prove which of us is the epic liar as the child likes to say. In fact, the show posts option doesn't even have a choice for 15 which the liar asserts is the only other option. Go figure huh! It allows for 5,10, 20, 30 and 40, but no 15. emoticon_xbye \n \n Number of Posts to Show Per Page\n Use this option to set the number of posts to show in a thread before splitting the display into multiple pages.Show 40 posts per page\n \n Here's the edit options page link: http://www.4forums.com/political/profile.php?do=editoptions\n\n \n The default is 15-which is exactly what he said...", 
   {}, 
   366777, 
   null, 
   1251248940.0
  ], 
  [
   366793, 
   null, 
   "Archangel", 
   "The default is 15-which is exactly what he said...\n\n \n Really? Go to the thread display options box, then to number of posts displayed box and click on it. It offers 5. 10, 20 30 and 40 posts per page. There is no option for 15. I mean, are you guys too ignorant to read plain english? It's the third big box category down on the page and the 3rd box down in that box. Check it out if you can read. \n http://www.4forums.com/political/profile.php?do=editoptions", 
   {}, 
   366782, 
   null, 
   1251252720.0
  ], 
  [
   366794, 
   null, 
   "T.Q", 
   "Really? Go to the thread display options box, then to number of posts displayed box and click on it. It offers 5. 10, 20 30 and 40 posts per page. There is no option for 15. I mean, are you guys too ignorant to read plain english? It's the third big box category down on the page and the 3rd box down in that box. Check it out if you can read. \n http://www.4forums.com/political/profile.php?do=editoptions\n\n \n Speaking of ignorant...\n \n The default is 15, which is what he said.", 
   {}, 
   366793, 
   null, 
   1251252780.0
  ], 
  [
   366804, 
   null, 
   "Archangel", 
   "Speaking of ignorant...\n \n The default is 15, which is what he said.\n\n \n I see it now, but since I have never used the default setting, and it doesn't mention a number, I thought it was 10 since it is 10 on other forums. And I still have no evidence that it is 15 since it doesn't say a number and I have never used it. But since it allows for 5, 10 and 20, it makes sense that 15 would be the default number of posts per page.", 
   {}, 
   366794, 
   null, 
   1251255780.0
  ], 
  [
   366815, 
   null, 
   "obvious_child", 
   "You're rambling incoherently again obnoxious child.\n\n \n Oh really? \n \n Care to explain to me how a single view post view and a thread permalink link to the same post? Or are you just going to pretend that I never said that despite everyone clearly seeing that you argued something that clearly shows you to be a liar. \n \n \nAnd are lying also in your deluded belief that every member here can't go to their own \"Edit Option\" page and see exactly how many posts per page they can show. emoticon_rolleyes:xbanghead And I invite everyone to do just that in order to prove which of us is the epic liar as the child likes to say. In fact, the show posts option doesn't even have a choice for 15 which the liar asserts is the only other option. Go figure huh! It allows for 5,10, 20, 30 and 40, but no 15. emoticon_xbye\n\n \n Huh. Let's see. I'm on default and my threads show 15 per page. If you think I'm lying go change back to default and see how many you got. In fact I suspect most people are on default right now and merely need to go to a thread with more than a page to see you are completely as usual full of **** and absolutely nothing you say can ever be trusted under any circumstances. You constantly accuse me of lying but you don't even bother to fact check. You wonder why we have nothing but contempt for you? THAT'S WHY. \n \n Pray tell, tell me, on a 15 per page option, are post #81 and post #96 on the same page? Try for a change. \n \n You won't answer. \n \n And you won't admit you are wrong. I see absolutely no retraction of your accusations. \n \n What a tool you are.\n \n EDIT: XXX.\n \n On a 40 per post, you are STILL WRONG as 96 is on page 3 and 81 on page 2. \n \n Thanks for providing information you are on a 40 views. There is no way you could have mixed up #81 and #96 on a 40 post per page. Only on a 20 and 30 count are they on the same page. \n \n You are such a bad liar.", 
   {}, 
   366777, 
   null, 
   1251259620.0
  ], 
  [
   366817, 
   null, 
   "T.Q", 
   "I still have no evidence that it is 15 since it doesn't say a number and I have never used it.\n\n \n Here's a thought braniac-try it. Wouldn't that be simpler than continuing to accuse me and O_C of lying? \n \n And, wouldn't actually reading what we wrote have avoided you making an XXX of yourself in the first place?", 
   {}, 
   366804, 
   null, 
   1251260160.0
  ], 
  [
   366823, 
   null, 
   "obvious_child", 
   "Here's a thought braniac-try it. Wouldn't that be simpler than continuing to accuse me and O_C of lying? \n \n And, wouldn't actually reading what we wrote have avoided you making an XXX of yourself in the first place?\n\n \n I got a question TQ. How are we lying when Archie himself has absolutely no idea about what the actual facts are? After all, for even an accusation of lying, Archie would first need to know what the facts are. Based on his sheer ignorance of everything as shown in this thread and his utter incompetence on checking any facts whatsoever, he just tosses out liar hoping something will stick. \n \n If I accuse you of lying about quantum physics when I have absolutely no knowledge of it, am I an XXXXX for doing so? \n \n Liar is code word in Archie speak for \"saying SOMETHING, it doesn't have to make sense.\"", 
   {}, 
   366817, 
   null, 
   1251261540.0
  ], 
  [
   367591, 
   null, 
   "Brigid", 
   "I see it now, but since I have never used the default setting, and it doesn't mention a number, I thought it was 10 since it is 10 on other forums. And I still have no evidence that it is 15 since it doesn't say a number and I have never used it. But since it allows for 5, 10 and 20, it makes sense that 15 would be the default number of posts per page.\n\n \n Well then freakin' try it out, and count how many posts appear on each page!!!!!! :xcensoredemoticon_xbangheadxbanghead:xbanghead\n \n It's not their fault you have no evidence!\n \n I'm on the default right now and there are 15 posts on each page. emoticon_xbangheadxbanghead", 
   {}, 
   366804, 
   null, 
   1251665040.0
  ], 
  [
   381212, 
   null, 
   "brd2dth", 
   "look i am new but wut it means is with christ you can do anything with his help", 
   {
    "post_info": {
     "post_title": "get it right"
    }
   }, 
   366757, 
   null, 
   1259771820.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John 14:12 ... Did Jesus lie?", 
  "url": "http://www.4forums.com/political/formal-open-debate/13142-john-14-12-did-jesus-lie.html", 
  "breadcrumbs": [
   "Formal Open Debate"
  ], 
  "id_number": 13142, 
  "discussion_files": [
   [
    "7659.html", 
    "http://www.4forums.com/political/formal-open-debate/13142-john-14-12-did-jesus-lie-print.html"
   ], 
   [
    "7660.html", 
    "http://www.4forums.com/political/formal-open-debate/13142-john-14-12-did-jesus-lie-4-print.html"
   ], 
   [
    "7661.html", 
    "http://www.4forums.com/political/formal-open-debate/13142-john-14-12-did-jesus-lie-3-print.html"
   ], 
   [
    "7662.html", 
    "http://www.4forums.com/political/formal-open-debate/13142-john-14-12-did-jesus-lie-2-print.html"
   ]
  ], 
  "identifier": 13142
 }
]