[
 [
  [
   365904, 
   null, 
   "obvious_child", 
   "\"The people of Samaria must bear their guilt, because they have rebelled against their God. They will fall by the sword; their little ones will be dashed to the ground, their pregnant women ripped open.\" (Hosea 13:16)\n \n \"And Hazael said, Why weepeth my lord? And he answered, Because I know the evil that thou wilt do unto the children of Israel: their strong holds wilt thou set on fire, and their young men wilt thou slay with the sword, and wilt dash their children, and rip up their women with child\" (2 Kings 8:12)\n \n Well, was God correct when he commanded his followers to perform abortions?\n \n emoticon_xgood\n \n Following the logic of several people here, whatever God says is morally correct, therefore abortions are morally correct because God said so. Let's see who's going to be consistent about their beliefs.", 
   {
    "post_info": {
     "post_title": "Was God wrong when he commanded the Israelites to perform abortions?"
    }
   }, 
   null, 
   null, 
   1250653500.0
  ], 
  [
   365911, 
   null, 
   "Archangel", 
   "No more need be said. http://www.4forums.com/political/365910-post53.html", 
   {}, 
   365904, 
   null, 
   1250655720.0
  ], 
  [
   365912, 
   null, 
   "Archangel", 
   "No more need be said except this: http://www.4forums.com/political/365910-post53.html\n\n \n And this:\n \"Speak up for those who cannot speak for themselves; \n ensure justice for those who are perishing.\" Proverbs 31:8\n Also...\n \n Exodus 21\n 22 \"If men who are fighting hit a pregnant woman and she gives birth prematurely but there is no serious injury, the offender must be fined whatever the woman's husband demands and the court allows. 23 But if there is serious injury, you are to take life for life, 24 eye for eye, tooth for tooth, hand for hand, foot for foot, 25 burn for burn, wound for wound, bruise for bruise.\n \n 1) If a woman gives birth prematurely, but there is no serious injury--i.e. the baby lives without harm, \n then a fine results to compensate for the assault.\n \n 2) If a woman gives birth prematurely, and the baby dies, then the assailant is to be given the death penalty. This point is HUGE!!! What God is saying here is that the value and worth of an adult man is equal to the value and worth of an unborn fetus who was young enough, or injured enough, to die. God equates the loss of an unborn baby as the loss of a life, for He says, \"you are to take life for life,...\" This point cannot be emphasized too strongly. God considers the unborn baby alive, and the loss of that life is considered murder. This murder is punishable with the death penalty. This verse demonstrates three truths:\n a) The unborn's life is equivalent in value to an adult's life in God's sight\n b) This also outlines God's Law against criminal feticide. \n c) The killing of the unborn is murder \n Bible and abortion : The Biblical case against abortion", 
   {}, 
   365911, 
   null, 
   1250656140.0
  ], 
  [
   365916, 
   null, 
   "obvious_child", 
   "No more need be said. http://www.4forums.com/political/365910-post53.html\n\n \n Wrong.\n \n http://www.4forums.com/political/365915-post54.html\n \n Tell me, when God commands the Israelites to exterminate the Medianites, did he make an exception for pregnant women? emoticon_xhoho emoticon_xgood", 
   {}, 
   365911, 
   null, 
   1250658540.0
  ], 
  [
   365918, 
   null, 
   "Archangel", 
   "Wrong.\n \n http://www.4forums.com/political/365915-post54.html\n \n Tell me, when God commands the Israelites to exterminate the Medianites, did he make an exception for pregnant women? emoticon_xhoho emoticon_xgood\n\n \n He wasn't discussing abortion nor was He promoting it. He was declaring war on an unclean people whom He commanded the Jews to wipe out in a time of WAR. Again you rip an event out of context and attempt to imply God was endorsing abortion. :xbanghead emoticon_rolleyes", 
   {}, 
   365916, 
   null, 
   1250660820.0
  ], 
  [
   365924, 
   null, 
   "obvious_child", 
   "He wasn't discussing abortion nor was He promoting it.\n\n \n And you fail to answer the question. \n \n \n \nHe was declaring war on an unclean people whom He commanded the Jews to wipe out in a time of WAR.\n\n \n And if God was so against killing the unborn, why did he fail to make an exception for the pregnant women? \n \n If you alleged that the Biblical God is totally against killing the unborn, why did he tell him to kill all of the non-virgin women?\n \n I bet you won't answer the question and just rely on insults as an attempt to cover up your argumentative failures as you always do. See my signature for examples. \n \n \nAgain you rip an event out of context and attempt to imply God was endorsing abortion. :xbanghead emoticon_rolleyes\n\n \n So telling someone to kill all of the women including the pregnant women which would kill their unborn children means I'm against abortion.\n \n Care to explain 2 Kings 15:16 and why Menahem isn't punished for ripping open the bellies of pregnant women? emoticon_rolleyes\n \n Huh. Great logic there oh Mr. \"magical shift in physics left no trace.\"", 
   {}, 
   365918, 
   null, 
   1250666160.0
  ], 
  [
   365931, 
   null, 
   "iangb", 
   "Exodus 21\n 22 \"If men who are fighting hit a pregnant woman and she gives birth prematurely but there is no serious injury, the offender must be fined whatever the woman's husband demands and the court allows. 23 But if there is serious injury, you are to take life for life, 24 eye for eye, tooth for tooth, hand for hand, foot for foot, 25 burn for burn, wound for wound, bruise for bruise.\n \n 1) If a woman gives birth prematurely, but there is no serious injury--i.e. the baby lives without harm,\n then a fine results to compensate for the assault.\n \n 2) If a woman gives birth prematurely, and the baby dies, then the assailant is to be given the death penalty. This point is HUGE!!! What God is saying here is that the value and worth of an adult man is equal to the value and worth of an unborn fetus who was young enough, or injured enough, to die. God equates the loss of an unborn baby as the loss of a life, for He says, \"you are to take life for life,...\" This point cannot be emphasized too strongly. God considers the unborn baby alive, and the loss of that life is considered murder. This murder is punishable with the death penalty. This verse demonstrates three truths:\n a) The unborn's life is equivalent in value to an adult's life in God's sight\n b) This also outlines God's Law against criminal feticide.\n c) The killing of the unborn is murder \n\n I'd quite like to see the original translation of this, because that verse is one of the (many) more ambiguous ones in the bible. \n \n Firstly, the most literal translation I can find of the first half says this: \n \"22 And when men strive, and have smitten a pregnant woman, and her children have come out, and there is no mischief,\".\n The KJV has similar wording: \n \"22 If men strive, and hurt a woman with child, so that her fruit depart from her, and yet no mischief follow:\".\n Several further translations of this verse take this to mean 'gives birth prematurely', as you have, but several others (1, 2, 3, 4) all have variants on the theme of \"if a pregnant woman is hit so that she miscarries\". This drastically changes your implied meaning of the passage.\n \n Secondly (and related to the first point), the verses don't specify to whom they are applying - is it the baby who must be injured for 'an eye for an eye' to apply, or is it the mother? There are several things here which imply that it is the mother. \n 1. Several of the various translations refer specifically to the mother being injured - eg \n \"When there's a fight and in the fight a pregnant woman is hit so that she miscarries but is not otherwise hurt\"\n or \n \"Suppose a pregnant woman suffers a miscarriage as the result of an injury caused by someone who is fighting. If she isn't badly hurt, the one who injured her must pay whatever fine her husband demands and the judges approve. 23But if she is seriously injured, the payment will be life for life\". \n No translations that I could find referred specifically to the baby in this way.\n 2. Judging by the 'miscarriage' translations, it makes no sense to refer to the infant; it has already miscarried. The only alternative is that it refers to the woman.\n 3. The verse later specifically mentions 'tooth for tooth'. Seeing as a newborn baby (especially a premature one!) doesn't have any visible teeth, this makes no sense to apply it to the infant. Again, the only alternative is the woman.\n \n You have one interpretation. I have another. The two interpretation vastly change the implications of the passage.\n Your turn.", 
   {}, 
   365924, 
   null, 
   1250687760.0
  ], 
  [
   365933, 
   null, 
   "Accipiter", 
   "He wasn't discussing abortion nor was He promoting it. He was declaring war on an unclean people whom He commanded the Jews to wipe out in a time of WAR. Again you rip an event out of context and attempt to imply God was endorsing abortion. :xbanghead emoticon_rolleyes\n\n \n Ok you convinced me, god is not endorsing abortion.\n \n God is only endorsing mass murder and I feel much better about that.", 
   {}, 
   365918, 
   null, 
   1250691540.0
  ], 
  [
   365938, 
   null, 
   "Archangel", 
   "You can hem and haw all you like Iangb, the fact is though that the OT laws of reciprocation, you know, an eye for an eye kicked in if the pregnant woman's unborn child died. This places a value to the unborn which you must accept when considering Gods perspective of the value of the unborn. And all of the rationalizing in the world wont change that fact. Beside that, the link goes on to give much more scriptural support for this claim, so take all of the info into consideration before arguing that God is in favor of abortion.", 
   {}, 
   365931, 
   null, 
   1250693700.0
  ], 
  [
   365950, 
   null, 
   "Steeeeve", 
   "Following the logic of several people here, whatever God says is morally correct, therefore abortions are morally correct because God said so. Let's see who's going to be consistent about their beliefs.\nthis statement isn't logical.\n \n It does not follow that if the person who creates the laws has to therefore follow them or can't change them...or even that they apply to him. If a teacher says \"no talking in the classroom\" it doesn't apply to the teacher now does it.", 
   {}, 
   365904, 
   null, 
   1250701680.0
  ], 
  [
   365956, 
   null, 
   "iangb", 
   "You can hem and haw all you like Iangb, the fact is though that the OT laws of reciprocation, you know, an eye for an eye kicked in if the pregnant woman's unborn child died.\n\n This is not the case, though. Judging by the alternative translations, they only kicked in if the woman was harmed - the only repercussions of the child's death by miscarriage (or, by some translations, it's premature birth) being that the 'smiter' must pay a fine determined by the husband and the judges.\n \n I would guess that the translation could just about be expanded to include repercussions if the child was born disabled as a result of the smiting. But even with that expansion, all the indications are that the injuries (or 'mischief') following on that cause the 'eye for an eye' law to be invoked are either those that occur to the woman, or only to her child if it survives. If the child dies (is miscarried) but the woman survives unharmed, there is no severe penalty beyond the fine.\n \n \nThis places a value to the unborn which you must accept when considering Gods perspective of the value of the unborn. And all of the rationalizing in the world wont change that fact.\nHowever, considering the alternative translation vastly skews this 'value' - it is minimal at best. Going purely on this chapter, God doesn't seem to consider the unborn as very worthy.\n \n \nBeside that, the link goes on to give much more scriptural support for this claim, so take all of the info into consideration before arguing that God is in favor of abortion.\nI read it. Would you really like me to go through all of them?\n \n \"God created us in our mother's womb\": This uses quotes that say just this. However, it doesn't mean that the contents of a womb are alive - I create cakes in my kitchen, but that doesn't mean that a tub of cake mix has all the properties of a cake.\n \n \"The Bible tells us that life begins at conception\": This is based on two quotes - David saying \"Surely I was sinful at birth, sinful from the time my mother conceived me\" and repetition of the phrase \"she shall conceive and give birth to a son\". David's quote is metaphorical language at it's best - I've heard people saying similar phrases like \"You were destined to do well since you were a twinkle in your fathers eye\". The repeated quote doesn't really show that conception is the start of life - as I said earlier, I could conceive and then follow a tasty recipe to make the cake in my kitchen, but that says nothing about condition of the ingredients when I started cooking.\n \n \"The Bible uses the term \"Baby\" whether he/she is born or unborn\": So do we. What of it?\n \n \"The Bible specifically condemns partial birth abortion as against God's will\": Firstly, this is simply a misunderstanding of the term 'partial birth abortion'. A partial birth abortion is not one where the doctor waits for the foetus to naturally be born and then kills it, it is one where the doctor pulls the foetus halfway out prematurely before dissection.\n Secondly, I have just as much issue as the midwives in the quote about killing babies as they are being naturally born. My 'line' is drawn just before partial birth abortion is mainly performed, so I'm not too fussed about how much support the bible gives to that area. What this quote does not do, however, is address the 'starting point'.\n \n \"God tells us to choose His ways, instead of our own ways; shameful acts done secretly do not please Him.\": The argument here is that, because there is something of a social stigma about abortion, this implies that it is sinful. However, this stigma only exists because of the pro-life movement. It's a self-fulfilling prophecy.\n \n \"A society that hates God, loves death\": Surely if this were the case then people who had abortions would go home and feel, not relief, but joy that they have killed someone? Surely every abortion-providing doctor would also be pro-death sentence?\n This is only true (and half-true, at that!) if abortion is 'killing'. Thats kinda the main crux of the argument anyway.", 
   {}, 
   365938, 
   null, 
   1250703480.0
  ], 
  [
   365961, 
   null, 
   "Archangel", 
   "This is not the case, though. Judging by the alternative translations, they only kicked in if the woman was harmed - the only repercussions of the child's death by miscarriage (or, by some translations, it's premature birth) being that the 'smiter' must pay a fine determined by the husband and the judges.\n \n I would guess that the translation could just about be expanded to include repercussions if the child was born disabled as a result of the smiting. But even with that expansion, all the indications are that the injuries (or 'mischief') following on that cause the 'eye for an eye' law to be invoked are either those that occur to the woman, or only to her child if it survives. If the child dies (is miscarried) but the woman survives unharmed, there is no severe penalty beyond the fine.\n \n However, considering the alternative translation vastly skews this 'value' - it is minimal at best. Going purely on this chapter, God doesn't seem to consider the unborn as very worthy.\n \n I read it. Would you really like me to go through all of them?\n \n \"God created us in our mother's womb\": This uses quotes that say just this. However, it doesn't mean that the contents of a womb are alive - I create cakes in my kitchen, but that doesn't mean that a tub of cake mix has all the properties of a cake.\n \n \"The Bible tells us that life begins at conception\": This is based on two quotes - David saying \"Surely I was sinful at birth, sinful from the time my mother conceived me\" and repetition of the phrase \"she shall conceive and give birth to a son\". David's quote is metaphorical language at it's best - I've heard people saying similar phrases like \"You were destined to do well since you were a twinkle in your fathers eye\". The repeated quote doesn't really show that conception is the start of life - as I said earlier, I could conceive and then follow a tasty recipe to make the cake in my kitchen, but that says nothing about condition of the ingredients when I started cooking.\n \n \"The Bible uses the term \"Baby\" whether he/she is born or unborn\": So do we. What of it?\n \n \"The Bible specifically condemns partial birth abortion as against God's will\": Firstly, this is simply a misunderstanding of the term 'partial birth abortion'. A partial birth abortion is not one where the doctor waits for the foetus to naturally be born and then kills it, it is one where the doctor pulls the foetus halfway out prematurely before dissection.\n Secondly, I have just as much issue as the midwives in the quote about killing babies as they are being naturally born. My 'line' is drawn just before partial birth abortion is mainly performed, so I'm not too fussed about how much support the bible gives to that area. What this quote does not do, however, is address the 'starting point'.\n \n \"God tells us to choose His ways, instead of our own ways; shameful acts done secretly do not please Him.\": The argument here is that, because there is something of a social stigma about abortion, this implies that it is sinful. However, this stigma only exists because of the pro-life movement. It's a self-fulfilling prophecy.\n \n \"A society that hates God, loves death\": Surely if this were the case then people who had abortions would go home and feel, not relief, but joy that they have killed someone? Surely every abortion-providing doctor would also be pro-death sentence?\n This is only true (and half-true, at that!) if abortion is 'killing'. Thats kinda the main crux of the argument anyway.\n\n \n This is a perfect example of why debating spiritual issues with someone who has a preconceived agenda to defend rather than an open and searching mind in understanding the truth of what the bible is saying is a waste of time. You will read your preferred outcome into the bible no matter what it actually says. \n \n Just think, you are arguing that as God allows a new life to form in an innocent woman's womb, He credits that new life with no value at all before it has even had a chance to live. It doesn't even pass the smell test, yet you will argue it ad-infinitum. emoticon_xdonno", 
   {}, 
   365956, 
   null, 
   1250704740.0
  ], 
  [
   365973, 
   null, 
   "iangb", 
   "This is a perfect example of why debating spiritual issues with someone who has a preconceived agenda to defend rather than an open and searching mind in understanding the truth of what the bible is saying is a waste of time. You will read your preferred outcome into the bible no matter what it actually says.\nBefore you accuse people of 'having agendas', bear in mind that you've just posted, as pretty much the entirety of your argument, a link to a site that is third on the list when you google 'bible against abortion'. My agenda is no greater than yours, if not less so.\n \n How does whether I have an agenda or not affect the validity of my arguments?\n \n \nJust think, you are arguing that as God allows a new life to form in an innocent woman's womb, He credits that new life with no value at all before it has even had a chance to live. It doesn't even pass the smell test, yet you will argue it ad-infinitum.\nLife in the process of being formed is not yet life. You even say this, inadvertantly contradicting yourself: \"He credits that new life with no value ... before it has even had a chance to live\".\n Which is it? Is a zygote alive, or has it yet to live?", 
   {}, 
   365961, 
   null, 
   1250712840.0
  ], 
  [
   366012, 
   null, 
   "Archangel", 
   "Before you accuse people of 'having agendas', bear in mind that you've just posted, as pretty much the entirety of your argument, a link to a site that is third on the list when you google 'bible against abortion'. My agenda is no greater than yours, if not less so.\n \n\n \n Here's the difference Iangb, you aren't looking at what the bible says with an objective mind at all. You are attempting to force the bible to agree with your preferred beliefs not only about abortion, but about the value of the unborn child. Every argument you are offering is just as it is in a secular based debate. Only now you're applying to the bible when nothing the bible says is even close to your interpretation of it.\n \n I'm not attempting to force the bible to accept my personal beliefs about abortion. My personal beliefs about abortion are shaped by what the bible says about it and by Gods character traits which permeate the bible. And I have no problem admitting that at all since it's the truth. See the difference? If the bible actually endorsed abortion, I would be the staunchest defender of it on this forum.\n \n \nHow does whether I have an agenda or not affect the validity of my arguments?\n\n \n SEE ANSWER ABOVE:\n \n \nLife in the process of being formed is not yet life. You even say this, inadvertantly contradicting yourself: \"He credits that new life with no value ... before it has even had a chance to live\".\n Which is it? Is a zygote alive, or has it yet to live?\n\n \n And here we have more of your personal opinion which has nothing at all to do with what the bible actually says about God condemning or supporting abortion. \n \n And no I don't say that life in the process of forming is not yet life. I say that once the egg and the seed are fertilized and it begins to grow, that is the most fundamental evidence of life we could possibly imagine. Especially since we have more than 5 BILLION completed examples of this process on earth today, you being one of those proofs of what becomes of that simple little fertilized egg. In spite of that overwhelming personal and universal evidence, and despite the fact that you pseudo scientists have argued that same point in every single debate on biology we have ever had here regarding simple biological life. \n \n But when it comes to the life of human beings, you insist that the unborn think or breathe before admitting they are actually alive. It is the most dishonest debating tactic imaginable. Yet you will argue it until you drive off every rational thinker who attempts to reason with you. And you have never answered my repeated question of how this fertilized egg grows at all if it isn't actually alive.", 
   {}, 
   365973, 
   null, 
   1250725080.0
  ], 
  [
   366023, 
   null, 
   "obvious_child", 
   "this statement isn't logical.\n \n It does not follow that if the person who creates the laws has to therefore follow them or can't change them...or even that they apply to him. If a teacher says \"no talking in the classroom\" it doesn't apply to the teacher now does it.\n\n \n That's not what I was talking to. The logic is whatever God does is morally just and even if the act independent of God is evil, the fact that God did it makes it morally just because God did it. People like Arch would call Pol Pot's extermination evil, but when God does the same to millions in the flood, it's morally just despite being extermination both ways. Thus, because God is the one killing people, the act of killing that would normally be immoral becomes moral. \n \n Thus, whatever God does in the eyes of people like Arch is morally just independent of what the act actually is.", 
   {}, 
   365950, 
   null, 
   1250728920.0
  ], 
  [
   366031, 
   null, 
   "Archangel", 
   "That's not what I was talking to. The logic is whatever God does is morally just and even if the act independent of God is evil, the fact that God did it makes it morally just because God did it. People like Arch would call Pol Pot's extermination evil, but when God does the same to millions in the flood, it's morally just despite being extermination both ways. Thus, because God is the one killing people, the act of killing that would normally be immoral becomes moral. \n \n Thus, whatever God does in the eyes of people like Arch is morally just independent of what the act actually is.\n\n \n Exactamundo, finally the ignoramus gets something right. emoticon_xgood", 
   {}, 
   366023, 
   null, 
   1250731680.0
  ], 
  [
   366037, 
   null, 
   "iangb", 
   "Here's the difference Iangb, you aren't looking at what the bible says with an objective mind at all. You are attempting to force the bible to agree with your preferred beliefs not only about abortion, but about the value of the unborn child. Every argument you are offering is just as it is in a secular based debate. Only now you're applying to the bible when nothing the bible says is even close to your interpretation of it.\n \n I'm not attempting to force the bible to accept my personal beliefs about abortion. My personal beliefs about abortion are shaped by what the bible says about it and by Gods character traits which permeate the bible. And I have no problem admitting that at all since it's the truth. See the difference? If the bible actually endorsed abortion, I would be the staunchest defender of it on this forum.\nThe problem here is that you have looked at the bible, decided that it supports the pro-life stance and are now searching for all the biblical evidence you can find which supports that conclusion. Your mind is now shut firmly to all other possibilities, regardless of how open it may once have been. Why else would you dismiss out of hand arguments which disagree with you, despite the fact that they are based directly on translations of the bible that are currently (presumably) in circulation? \n \n You need to show arguments to prove why your translations are the ones which should be used, and not mine. You must have had those arguments internally yourself at one point when you were deciding which stance to take - what convinced you at that point to go pro-life rather than pro-choice; to believe in the 'premature birth' translation rather than the 'miscarries' translation?\n \n Furthermore, I have less of an agenda that you are implying. I'm throwing problems at your arguments (or rather, at the website you linked to's arguments) not to prove my arguments on abortion, but to test how strong yours are. Personally, I don't consider the bible to be at all relevant as a guiding point for the start of 'life', wherever it may claim it to be - but I'm interested in finding out why you think it is, and forcing you to expound upon your initial arguments helps me to do so. Speaking honestly, I have always thought that the exodus verse was a prime example of the potential errors in translation that the bible can suffer from; I believe I've referenced it before (if not in this forum, then certainly in others).\n \n \nSEE ANSWER ABOVE\nThat's not really a response. The intentions behind an argument don't affect the validity of the argument itself - for example, 2+2=4, and just if I bet you that this is the case doesn't suddenly mean that my reasons why 2+2=4 are suddenly less true.\n \n To put it another way - let's pretend we were arguing about what colour your new iphone is. You (correctly, for the sake of the analogy) claim that it's mostly black, whereas I claim that it's mostly bright orange. It would be a silly argument for me to make that \"of course you'd say it's black, black is your favourite colour - your agenda is that it's black, so all your arguments that it's not orange are automatically invalid\". However, in this thread that's exactly what you've done. You've just said the equivalent of \"of course you'd say it supports abortion, you support abortion - your agenda is that it supports abortion, so all your arguments that it's not pro-life are automatically invalid\".\n \n Why are my arguments - for example, that the Exodus passage can and as been interpreted to say \"if a woman is caused to miscarry but is not further harmed, her attacker need only pay a fine\" - invalid? You have yet to answer this question.\n \n \nAnd no I don't say that life in the process of forming is not yet life. I say that once the egg and the seed are fertilized and it begins to grow, that is the most fundamental evidence of life we could possibly imagine. Especially since we have more than 5 BILLION completed examples of this process on earth today, you being one of those proofs of what becomes of that simple little fertilized egg. In spite of that overwhelming personal and universal evidence, and despite the fact that you pseudo scientists have argued that same point in every single debate on biology we have ever had here regarding simple biological life.\nYou said, just earlier, that a zygote 'has not yet had a chance to live'. That's pretty darn close.\n Forming life is not life. You have not presented any evidence that this is not the case - all you've done is re-enforce your first part, that it becomes life.\n \n \nBut when it comes to the life of human beings, you insist that the unborn think or breathe before admitting they are actually alive. It is the most dishonest debating tactic imaginable. Yet you will argue it until you drive off every rational thinker who attempts to reason with you. And you have never answered my repeated question of how this fertilized egg grows at all if it isn't actually alive.\n\n ...Uh, correct me if I'm wrong, but isn't this the first time in this thread that you have asked this question?\n You're going the way of Chuz here, and assuming somehow that because a zygote is alive as a cell it means that it is alive as a person. However, a zygote is a living cell - but it isn't an alive person. The distinction is a key one - for example your skin cells are alive cells, but they aren't alive as 'people'; if you cut yourself you aren't arrested for multiple manslaughter, despite the fact that you are killing living human cells.\n The argument here is that at some point during pregnancy an alive foetus becomes an alive person. The emergence of the mind is a handy place to draw the line - personally, I'd go for that or for the point where the foetus can viably survive outside the womb, as the two are fairly closely linked.", 
   {}, 
   366023, 
   null, 
   1250737860.0
  ], 
  [
   366067, 
   null, 
   "Matthew", 
   "Regarding the Exodus passage: Why should men fighting each other, hitting a pregnant woman, and thereby causing her to miscarry or give birth prematurely (take your pick on which is the better translation) be considered \"abortion\" in the first place? It seems to me the position of the woman is rather different in the two scenarios!\n \n I'm not saying abortion is always morally acceptable, not by a longshot. But I'm also not saying it never is, either.", 
   {}, 
   366037, 
   null, 
   1250752380.0
  ], 
  [
   366091, 
   null, 
   "Steeeeve", 
   "That's not what I was talking to. The logic is whatever God does is morally just and even if the act independent of God is evil, the fact that God did it makes it morally just because God did it. People like Arch would call Pol Pot's extermination evil, but when God does the same to millions in the flood, it's morally just despite being extermination both ways. Thus, because God is the one killing people, the act of killing that would normally be immoral becomes moral. \nStill doesn't follow. You assume God to be under his own authority which isn't the case and doesn't logically derive. Like the teacher with students the teacher can do what she wants but can impose rules on the students. So if the teacher chews gum she/he can certainly \"morally\" tell the students they cannot. It isn't hypocritical if you make the rules to begin with.", 
   {}, 
   366023, 
   null, 
   1250789940.0
  ], 
  [
   366108, 
   null, 
   "Archangel", 
   "Regarding the Exodus passage: Why should men fighting each other, hitting a pregnant woman, and thereby causing her to miscarry or give birth prematurely (take your pick on which is the better translation) be considered \"abortion\" in the first place? It seems to me the position of the woman is rather different in the two scenarios!\n \n I'm not saying abortion is always morally acceptable, not by a longshot. But I'm also not saying it never is, either.\n\n \n It isn't offered to make that assertion at all. It is offered to show that God values the life of the unborn if He will demand that a man responsible for causing its death in the womb be held accountable by paying the ultimate price.", 
   {}, 
   366067, 
   null, 
   1250796600.0
  ], 
  [
   366116, 
   null, 
   "iangb", 
   "As Archie has given up on me...\n \n \nIt isn't hypocritical if you make the rules to begin with.\n\n And it isn't illegal when the President does it, as Nixon and Clinton showed. \n \n Waitasec....\n \n Speaking as a teacher, one of the key things about good classroom management is consistency. You obey your own rules whenever possible, or are (quite justifiably, in some cases) called out on hypocrisy. I don't know any teacher who would consider it good practice to let a student see them breaking the general rules.\n \n I agree that God is something of a special case, though. But it does follow that if you look to god for good examples of moral behaviour to follow, that's not all you're going to get. Whether this is hypocritical or not is something of a personal matter - moral relativisticly speaking, at least.", 
   {}, 
   366108, 
   null, 
   1250800380.0
  ], 
  [
   366123, 
   null, 
   "Archangel", 
   "As Archie has given up on me...\n \n \n And it isn't illegal when the President does it, as Nixon and Clinton showed. \n \n Waitasec....\n \n Speaking as a teacher, one of the key things about good classroom management is consistency. You obey your own rules whenever possible, or are (quite justifiably, in some cases) called out on hypocrisy. I don't know any teacher who would consider it good practice to let a student see them breaking the general rules.\n \n I agree that God is something of a special case, though. But it does follow that if you look to god for good examples of moral behaviour to follow, that's not all you're going to get. Whether this is hypocritical or not is something of a personal matter - moral relativisticly speaking, at least.\n\n \n First off, God is completely consistent in His moral compass and following His own established laws. It's just that you deniers/critics/unbelievers corrupt and pervert every comparison and standard you hold him up to. an example is you all taking his command to kill unclean enemies of Israel in WAR TIME and comparing it to justifying the killing of innocents via abortion. There is no comparison between the two situations but that doesn't stop you folks from making it anyway. \n \n Point in fact, here's child doing exactly that, yet you don't hold him to any standard of truthfulness or honesty at all. And that is because your position is no more truthful or honest than his is. http://www.4forums.com/political/365924-post6.html\n \n God is against abortion and He does value the unborn as He does all life. But there are enemies of truth and goodness in life and God will allow a people to rise together or fall together. \n \n This is why we traditional moralists constantly fight against what you liberal secular humanist leftists want for our society as you fight for immoral values at every turn. We understand that we will rise or fall together as a people and the good will surely suffer with the evil when God judges this Nation finally. And that judgement is coming Iangb. But just as you can't see that a fertilized egg is a human being at a less developed stage of LIFE with the same value in Gods eyes, you are completely blind to the inevitable judgement which is coming to this country, as surely as my name is ALI.", 
   {}, 
   366116, 
   null, 
   1250805420.0
  ], 
  [
   366169, 
   null, 
   "unkerpaulie", 
   "Still doesn't follow. You assume God to be under his own authority which isn't the case and doesn't logically derive. Like the teacher with students the teacher can do what she wants but can impose rules on the students. So if the teacher chews gum she/he can certainly \"morally\" tell the students they cannot. It isn't hypocritical if you make the rules to begin with.\n\n It would be bad enough if it was just the teacher chewing gum and telling the students don't chew gum. But it doesn't stop there. The teacher makes the rule no gum chewing in class. Then later that same day she instructs Billy and Sally to chew gum. Johnny sees this and decides to chew gum too, thinking that its ok. Of course, he gets expelled from school for breaking the rules. In this case the teacher isn't just breaking her own rules, she also commands some of her students to break the rules as well, yet still penalizes those who break the exact rule if they weren't commanded to do so.", 
   {}, 
   366091, 
   null, 
   1250845620.0
  ], 
  [
   366195, 
   null, 
   "Steeeeve", 
   "It would be bad enough if it was just the teacher chewing gum and telling the students don't chew gum. But it doesn't stop there. The teacher makes the rule no gum chewing in class. Then later that same day she instructs Billy and Sally to chew gum. Johnny sees this and decides to chew gum too, thinking that its ok. Of course, he gets expelled from school for breaking the rules. In this case the teacher isn't just breaking her own rules, she also commands some of her students to break the rules as well, yet still penalizes those who break the exact rule if they weren't commanded to do so.\n\n \n Those who set the rules can do with them as they please. It isn't illogical nor hypocritical. It IS illogical to assume you can chew gum if the rule is \"you cant chew gum\" and the teacher allows one student to chew gum.", 
   {}, 
   366169, 
   null, 
   1250871000.0
  ], 
  [
   366199, 
   null, 
   "Matthew", 
   "Those who set the rules can do with them as they please.\n\n \n \"Can,\" sure. But what about \"should?\" Just because someone can disregard the laws he makes, doesn't mean he should. \n \n \nIt isn't illogical nor hypocritical.\n\n \n Under what bizarre definition of \"hypocrisy\" is demanding that others consistently follow a rule that you yourself will not follow not hypocritical?!?\n \n As to \"illogic\"...\n \n \nIt IS illogical to assume you can chew gum if the rule is \"you cant chew gum\" and the teacher allows one student to chew gum.\n\n \n I disagree. It's perfectly reasonable to assume that the rule in question is not going to be enforced. -- Unless, of course, the rule-maker also clarifies why an exception is being allowed for a given individual under given conditions. Absent such justification, it would not only be illogical to punish the other rule-breaker, but both the exception and the punishment would be utterly arbitrary.\n \n Of course, I tend to think that most religious conservatives have exactly that sort of view of God: an arbitrary cosmic tyrant whom they perversely describe as \"loving.\" And their politics displays no less authoritarianism, despite their equally perverse self-description as lovers of \"freedom.\"", 
   {}, 
   366195, 
   null, 
   1250879040.0
  ], 
  [
   366259, 
   null, 
   "unkerpaulie", 
   "Obvious child, I think we've gathered enough info and opinions to conclusively answer your question. God doesn't endorse abortions. In fact, as a rule God commands against murder of all kinds. \n \n However, as Matt pointed out, the verses you use to bring forward your point can't really be compared to or considered as abortion. When you rip open the bellies of pregnant women, particularly in the violent way described in the scripture, you indeed kill the unborn baby, but you also kill the mother in the process. Even though God was commanding this fate upon the samarians, it doesn't imply that he is ok with his people killing the unborn baby and leaving the mother intact. Apples and oranges really. \n \n The bottom line is that God is against all forms of murder, killing and violence. This is an absolute and eternal truth, since it is written in the bible, which is the unfallible word of God. In addition, God loves us and only wants what's in our best interest. God is not willing that any should perish but that all should come to repentance. That's why we have so few examples of God unleashing his wrath on people, especially in the old testament. God is a merciful and gracious God, obviously. \n \n However, as steeeeve so clearly pointed out his teacher's rules analogy, God reserves the right override his absolute and eternal truths by doing the contrary, since he is the author of the rules. Since God is several levels above our human interpretation of absolute and unchangeable, he can change his mind about his absolute morality, make exceptions to his rules, and still be morally consistent. But bear in mind that this distinction only applies to God. Even though the teacher in our analogy was both illogical and hypocritical, that teacher isn't God, so she can't be inconsistent with her rules and consistent with her rules at the same time. Only God can pull that off. \n \n So, to answer your question: was God wrong when he commanded the israelites to perform abortions? (Abortions in this case included the peril of the mother as well.) The answer is no. \n \n And for future reference, whenever you're wondering what the answer is to a question hat begins with the phrase \"was God wrong...\" the answer is always no. It doesn't matter what follows the elipsis.", 
   {}, 
   365904, 
   null, 
   1250913900.0
  ], 
  [
   366314, 
   null, 
   "Steamroller", 
   "Under what bizarre definition of \"hypocrisy\" is demanding that others consistently follow a rule that you yourself will not follow not hypocritical?!?\n\n \n Matthew, If I own a Harley-Davidson dealership and I direct an employee to \"give\" you a hooded sweat shirt, is that theft? I think not.\n \n If that same employee gives a hooded sweatshirt to one of his friends, without my knowledge or permission, is that theft? I think it is.\n \n I believe this is the \"bizarre\" definition you were seeking, the question remains.., will you accept it??", 
   {
    "post_info": {
     "post_title": "Inquiring minds wanted to know..."
    }
   }, 
   366199, 
   null, 
   1250955960.0
  ], 
  [
   366345, 
   null, 
   "Matthew", 
   "Obvious child, I think we've gathered enough info and opinions to conclusively answer your question. God doesn't endorse abortions. In fact, as a rule God commands against murder of all kinds.\n\n \n Indeed. Many people don't realize that the commandment is not \"thou shalt not kill,\" but \"thou shalt not murder.\" The important question then becomes, when is killing murder?\n \n I have no doubt that God cares for the lives of fetuses. But I also have no doubt that God cares for the lives of pregnant women.\n \n The reason I brought up the Exodus passage is that it's often taken to establish that abortion is murder, and that performing an abortion should be punished accordingly. But the passage isn't talking about abortion at all. Which just leaves us with the question of when it is or isn't acceptable to take a life, and the passage doesn't provide guidance to that general question, either.", 
   {}, 
   366259, 
   null, 
   1250976120.0
  ], 
  [
   366348, 
   null, 
   "Matthew", 
   "Matthew, If I own a Harley-Davidson dealership and I direct an employee to \"give\" you a hooded sweat shirt, is that theft? I think not.\n \n If that same employee gives a hooded sweatshirt to one of his friends, without my knowledge or permission, is that theft? I think it is.\n \n I believe this is the \"bizarre\" definition you were seeking, the question remains.., will you accept it??\n\n \n No, I won't. The employee has done two very different things: made a gift with the boss's knowledge and permission, and a gift without the boss's knowledge or permission. That difference explains why the second case is theft, but the first is not. No reason to find any hypocrisy on the part of the employee, just two different actions on two different occasions.\n \n Nor has the owner been hypocritical. He hasn't taken a rule and applied it differently to himself than to others. Now, if he routinely gives away sweatshirts to friends for any whim that strikes him, but never lets the employees do so even when they ask him if they may do so for a special occasion (like a birthday, say) -- that would be hypocrtical. It wouldn't be illegal, nor should it be. But it would be hypocritical. I wouldn't take such a person as a paragon of generosity.\n \n To return to the substantive point. If God commands people to obey his laws, but then breaks them himself, then God is a hypocrite. Frankly, that's exactly the sort of behavior so-called \"conservatives\" condemn as tyranny in the realm of temporal politics. But many of them don't seem to mind at all if God -- as they conceive of him, anyway -- acts in such tryannical fashion.", 
   {}, 
   366314, 
   null, 
   1250977320.0
  ], 
  [
   366350, 
   null, 
   "Archangel", 
   "Indeed. Many people don't realize that the commandment is not \"thou shalt not kill,\" but \"thou shalt not murder.\" The important question then becomes, when is killing murder?\n \n I have no doubt that God cares for the lives of fetuses. But I also have no doubt that God cares for the lives of pregnant women.\n \n The reason I brought up the Exodus passage is that it's often taken to establish that abortion is murder, and that performing an abortion should be punished accordingly. But the passage isn't talking about abortion at all. Which just leaves us with the question of when it is or isn't acceptable to take a life, and the passage doesn't provide guidance to that general question, either.\n\n \n How is that conclusion derived at? The passage is speaking to the consequences to a man who's actions cause the death of an unborn child. And the proscribed consequence is death according to OT Law. So although the passage isn't speaking to abortion at all, it is making a very clear statement regarding the value of the unborn, as it is requiring a life for a life just as for any other sentient being according to the OT Law. So these arguments I get from the likes of you and Iangb which argue that until a child shows mental awareness, it isn't actually a person deserving of human rights is a bogus and shortsighted position according to the scriptural point of view. Of that, there is no question.", 
   {}, 
   366345, 
   null, 
   1250979240.0
  ], 
  [
   366371, 
   null, 
   "Easyrider", 
   "Obama and the pro-abortion crowd have a lot of blood on their hands that one day they will have to answer for.\n \n Stop killing the innocent babies!", 
   {}, 
   366350, 
   null, 
   1250988000.0
  ], 
  [
   366374, 
   null, 
   "obvious_child", 
   "Exactamundo, finally the ignoramus gets something right. emoticon_xgood\n\n \n Which makes your view of God exponentially disturbing. If man kills it's wrong. If God exterminates millions, it's morally just.", 
   {}, 
   366031, 
   null, 
   1250988240.0
  ], 
  [
   366378, 
   null, 
   "obvious_child", 
   "Still doesn't follow. You assume God to be under his own authority which isn't the case and doesn't logically derive.\n\n \n Then how do we morally judge God? \n \n \n Like the teacher with students the teacher can do what she wants but can impose rules on the students. So if the teacher chews gum she/he can certainly \"morally\" tell the students they cannot. It isn't hypocritical if you make the rules to begin with.\n\n \n It is hypocritically if you tell your people to judge others on such standards. \n \n God telling man that killing is wrong and then exterminating millions isn't hypocritical? \n \n The notion that whatever God does is morally just because it's God makes no rational or moral sense. Furthermore, as Archangel proves, that view is exceptionally disturbing. God can commit murder on millions and it's okay, God can command the death of fetuses and it's okay but man does it and it's wrong. They are the same acts. God's presence suddenly eliminates the moral wrong? That view is fracked up.", 
   {}, 
   366091, 
   null, 
   1250988540.0
  ], 
  [
   366381, 
   null, 
   "obvious_child", 
   "As Archie has given up on me.\n\n \n Remember, according to Archie:\n \n If God....\n 1) Exterminates millions on his own account\n 2) Commands the indirect murder of fetuses\n 3) Commands the act of genocide\n 4) Commands his people to enslave others\n ....\n It's all morally just and good.\n \n And people wonder why I abandoned Christanity years ago. Morally bankrupt system through and through.", 
   {}, 
   366116, 
   null, 
   1250988660.0
  ], 
  [
   366407, 
   null, 
   "Archangel", 
   "Then how do we morally judge God? \n\n \n That's the point ignoramus, you DON'T morally judge God. You, the creature have no right at all to morally judge the Creator of all that is. Does the pot tell the potter how he will make it? Of course not. Does the building tell the architect how it will look? It never happened. Yet here you are, an ignorant little wisp of smoke compared to Gods eternal being which has no beginning and no end, yet you are arrogant and ignorant enough to believe you are qualified to, or justified in any way to judge Him morally? If the idea of it wasn't so pathetic, it would be funny. But why would we expect anything more from the likes of you and your ilk. emoticon_xdonno", 
   {}, 
   366378, 
   null, 
   1251004920.0
  ], 
  [
   366410, 
   null, 
   "obvious_child", 
   "And as expected, just insults. No actual argument from Archie. At least he's being implicitly silent that he accepts that whatever God does is okay.\n \n Stalin = Murdered millions and absolute evil\n Hitler = Murdered millions and absolute evil\n God = Murdered millions and absolutely good\n \n Wait....\n \n There's archie's logic for you. God extermination people is morally just because it's God!", 
   {}, 
   366407, 
   null, 
   1251011640.0
  ], 
  [
   366416, 
   null, 
   "unkerpaulie", 
   "Get it through your head. The ONLY deciding factor of what is morally right is if you claim that God told you to do it. Look at the bible, and the absolutely factual records of actual history within. Remember when the israelites \"borrowed\" gold and jewelry from the egyptians, fully aware that they would be out of there the next day? Well its not stealing if moses told you to do it. Remember when abraham knocked up his maid. Well its not adultery if abraham did it. \n \n You see, God is so far above morality, morals don't even apply to him. And if you're in his inner circle, you also enjoy above-moral status as well. God can make up the rules about right and wrong as he goes. In fact, he changed the rules several times. Like slavery used to be ok, but God made it wrong afterward. Also when God created marriage, the rule was one man and one woman, but later, when israel had kings, the limit of wives a man could marry was removed by God, then more recently he changed it back to monogamy as the right thing. \n \n That's why God is always right and never wrong. He's God. And he never changes. He is the same forever, and his word is eternal and true. Always remember that.", 
   {}, 
   366410, 
   null, 
   1251019440.0
  ], 
  [
   366420, 
   null, 
   "Archangel", 
   "You're no better than the obnoxious child in your ignorant perversion of Gods character, paulie. And just like the obnoxious child, it's a waste of time attempting to reason with you/correct your misconceptions since your mind is made up. So wallow in your ignorance as it isn't my place to perpetually attempt to reason with the unreasonable, which you and your ilk define so perfectly. emoticon_xbye", 
   {}, 
   366416, 
   null, 
   1251035940.0
  ], 
  [
   366421, 
   null, 
   "Easyrider", 
   "Remember when the israelites \"borrowed\" gold and jewelry from the egyptians, fully aware that they would be out of there the next day? Well its not stealing if moses told you to do it. \n\n \n Nowhere does the Bible say the Israelites \"borrowed\" the gold and jewelry. It says they asked the Egyptians for it and it was given to them (as plunder). It was a judgment by God for the way they screwed over the Israelites. \n \n \n\n Like slavery used to be ok, but God made it wrong afterward.\n\n \n Does God Approve of Slavery in the Bible?\n \n Does God Approve of Slavery According to the Bible?\n \n You really need to work on your theology, it's soooo screwed up.", 
   {}, 
   366416, 
   null, 
   1251036000.0
  ], 
  [
   366431, 
   null, 
   "Penfold", 
   "Nowhere does the Bible say the Israelites \"borrowed\" the gold and jewelry. It says they asked the Egyptians for it and it was given to them (as plunder). ........... \n\n \n \"Main Entry: plun·der \n Pronunciation: \\&#712;pl&#601;n-d&#601;r\\\n Function: verb\n Inflected Form(s): plun·dered; plun·der·ing \\-d(&#601;-)ri&#331;\\\n Etymology: German plündern\n Date: 1632\n transitive verb\n 1 a : to take the goods of by force (as in war) : pillage, sack <invaders plundered the town< b : to take by force or wrongfully : steal, loot <plundered artifacts from the tomb<\n 2 : to make extensive use of as if by plundering : use or use up wrongfully <plunder the land<\n intransitive verb\n : to commit robbery or looting\n \n So they stole on their god's orders. QED.", 
   {}, 
   366421, 
   null, 
   1251041340.0
  ], 
  [
   366444, 
   null, 
   "Easyrider", 
   "\"Main Entry: plun·der ...\n \n So they stole on their god's orders. QED.\n\n \n \n You guys still don't get it. \n \n It was a JUDGMENT on the Egyptians.", 
   {}, 
   366431, 
   null, 
   1251046620.0
  ], 
  [
   366448, 
   null, 
   "Penfold", 
   ".....\n It was a JUDGMENT on the Egyptians.\n\n \n \n According to the plunderers, we know. Why do you not get that? Thieves are always pleading innocence for their plundering, and blaming others.", 
   {}, 
   366444, 
   null, 
   1251048420.0
  ], 
  [
   366449, 
   null, 
   "gansao", 
   "According to the plunderers, we know. Why do you not get that? Thieves are always pleading innocence for their plundering, and blaming others.\n\n \n \n Come on Penfold. The man ment reparations. We are not all wordsmiths like you.", 
   {}, 
   366448, 
   null, 
   1251050040.0
  ], 
  [
   366452, 
   null, 
   "Archangel", 
   "Come on Penfold. The man ment reparations. We are not all wordsmiths like you.\n\n \n If pinfold is such a wordsmith, then why does he interpret what others say so discriminately while misrepresenting what they are actually saying? True wordsmiths don't purposely corrupt what others say. emoticon_xdonno", 
   {}, 
   366449, 
   null, 
   1251051840.0
  ], 
  [
   366455, 
   null, 
   "Penfold", 
   "Those who support corrupt practices have no space to point accusing fingers anywhere but at themselves. If he meant \"reparations\" then why did he say \"plunder\"? Is he so ignorant as to not know the meaning of a commonly used word? As for his apologists...............It was their god who allegedly used the word \"plunder\", Easy was simply repeating the mantra.", 
   {}, 
   366452, 
   null, 
   1251052980.0
  ], 
  [
   366457, 
   null, 
   "Easyrider", 
   "According to the plunderers, we know. Why do you not get that? Thieves are always pleading innocence for their plundering, and blaming others.\n\n \n Well in this case the Egyptians were the guilty parties for enslaving the Israelites, so they deserved what they got via God's judgment. You do get that part, don't you?", 
   {}, 
   366448, 
   null, 
   1251053400.0
  ], 
  [
   366459, 
   null, 
   "gansao", 
   "Those who support corrupt practices have no space to point accusing fingers anywhere but at themselves. If he meant \"reparations\" then why did he say \"plunder\"? Is he so ignorant as to not know the meaning of a commonly used word? As for his apologists...............It was their god who allegedly used the word \"plunder\", Easy was simply repeating the mantra.\n\n \n \n I cant be an apologist because I did not excuse what he said. I stated that he used the wrong word(the definition plunder was not applicable to the rest of his post ) and to think I called you a wordsmith..:)", 
   {}, 
   366455, 
   null, 
   1251053820.0
  ], 
  [
   366460, 
   null, 
   "Penfold", 
   "I cant be an apologist because I did not excuse what he said. I stated that he used the wrong word(the definition plunder was not applicable to the rest of his post ) and to think I called you a wordsmith..:)\n\n \n His word was correct, your apology for his use of it was not. Simples! ;)\n \n I will draw a veil over Arch's purposive misspelling of my name. I got over such attacks in kindergarten. He? More to be pitied than scolded.", 
   {}, 
   366459, 
   null, 
   1251054240.0
  ], 
  [
   366461, 
   null, 
   "Penfold", 
   "Well in this case the Egyptians were the guilty parties for enslaving the Israelites, so they deserved what they got via God's judgment. You do get that part, don't you?\n\n \n Who said the Egyptians were guilty? The plunderers. And you choose to believe the robbers.", 
   {}, 
   366457, 
   null, 
   1251054360.0
  ], 
  [
   366462, 
   null, 
   "gansao", 
   "His word was correct, your apology for his use of it was not. Simples! ;)\n \n I will draw a veil over Arch's purposive misspelling of my name. I got over such attacks in kindergarten. He? More to be pitied than scolded.\n\n \n Define apology", 
   {}, 
   366460, 
   null, 
   1251054840.0
  ], 
  [
   366463, 
   null, 
   "unkerpaulie", 
   "Well in this case the Egyptians were the guilty parties for enslaving the Israelites, so they deserved what they got via God's judgment. You do get that part, don't you?\n\n Thank you easyrider. Please explain to penfold and the rest of these unbelievers that when you claim that your God says something is ok, then you're right no matter what it is you do. If somebody does something bad to you, you have a God-given right to get even, whether it be stealing their goods, abducting their virgins, or slaughtering their unborn. Don't ever question the justification of divine justice.", 
   {}, 
   366457, 
   null, 
   1251055800.0
  ], 
  [
   366467, 
   null, 
   "Easyrider", 
   "Thank you easyrider. Please explain to penfold and the rest of these unbelievers that when you claim that your God says something is ok, then you're right no matter what it is you do. If somebody does something bad to you, you have a God-given right to get even, whether it be stealing their goods, abducting their virgins, or slaughtering their unborn. \n\n \n You still don't get it. That was God's Judgment, not something man made up. Did the Egyptians enslave the Israelites and mistreat them or not? Yes or no? If they did, do they deserve justice or retribution?\n \n From Exodus 3: \n \n 19 But I know that the king of Egypt will not let you go unless a mighty hand compels him. 20 So I will stretch out my hand and strike the Egyptians with all the wonders that I will perform among them. After that, he will let you go. \n \n 21 &#8220;And I will make the Egyptians favorably disposed toward this people, so that when you leave you will not go empty-handed. 22 Every woman is to ask her neighbor and any woman living in her house for articles of silver and gold and for clothing, which you will put on your sons and daughters. And so you will plunder the Egyptians.&#8221;\n \n It was from God, Paulie, not something some guy made up to get even. \n \n \nDon't ever question the justification of divine justice.\n\n \n Have you read the entire Bible, Paulie? You always seem to miss the basic reasons for why various things happen.", 
   {}, 
   366463, 
   null, 
   1251057180.0
  ], 
  [
   366468, 
   null, 
   "Easyrider", 
   "Who said the Egyptians were guilty? The plunderers. And you choose to believe the robbers.\n\n \n Did the Egyptians enslave the Israelites and mistreat them or not? Yes or no? \n \n Have you read the Bible?", 
   {}, 
   366461, 
   null, 
   1251057420.0
  ], 
  [
   366469, 
   null, 
   "gansao", 
   "Did the Egyptians enslave the Israelites and mistreat them or not? Yes or no? \n \n Have you read the Bible?\n\n \n \n Penfolds read everything.\n Except How to make friends and influence people.", 
   {}, 
   366468, 
   null, 
   1251058020.0
  ], 
  [
   366471, 
   null, 
   "Steeeeve", 
   "Then how do we morally judge God? \n That's kind of the point...to morally judge would mean they that being is on the same level or beneath you. It doesn't make sense for the servant to such a thing.\n \n \n\n It is hypocritically if you tell your people to judge others on such standards. \nNo it isn't.\n \n \nGod telling man that killing is wrong and then exterminating millions isn't hypocritical? \nNo. Mostly because God never said that. It was instructions to man not to Himself. If you set the rules you can set them how you want.\n \n \nThe notion that whatever God does is morally just because it's God makes no rational or moral sense.\nIt does if you believe God creates morality. \n \n \nGod can commit murder on millions and it's okay, God can command the death of fetuses and it's okay but man does it and it's wrong. They are the same acts. God's presence suddenly eliminates the moral wrong? That view is fracked up.\nThe idea is you are not above, or equal to God...not even close. A parent can set up a rule that says \"when you are 16 your bed time is 10pm but when you are 15 and below it is 9pm\". The parent can stay up until midnight and yet that is not hypocritical. So if the 16 year old stays up until midnight and gets in trouble but the wife doesn't (for example) this is the same act where one is right and one wrong.", 
   {}, 
   366378, 
   null, 
   1251061800.0
  ], 
  [
   366472, 
   null, 
   "unkerpaulie", 
   "You still don't get it. That was God's Judgment, not something man made up. Did the Egyptians enslave the Israelites and mistreat them or not? Yes or no? If they did, do they deserve justice or retribution?\n \n From Exodus 3: \n \n 19 But I know that the king of Egypt will not let you go unless a mighty hand compels him. 20 So I will stretch out my hand and strike the Egyptians with all the wonders that I will perform among them. After that, he will let you go. \n \n 21 &#8220;And I will make the Egyptians favorably disposed toward this people, so that when you leave you will not go empty-handed. 22 Every woman is to ask her neighbor and any woman living in her house for articles of silver and gold and for clothing, which you will put on your sons and daughters. And so you will plunder the Egyptians.&#8221;\n \n It was from God, Paulie, not something some guy made up to get even. \n \n Have you read the entire Bible, Paulie? You always seem to miss the basic reasons for why various things happen.\n\n How is what you said different from what I said? The israelites were justified in robbing the egyptians of their gold and goods. The bible says that stealing was right because God told them to do so (the justification is actually irrelevant). And regardless of if God actually told them to do so or not (which neither of us can prove), it is enough that the author of the scripture claims that God told them to do so, for us, in retrospect and third person view, to conclude that they were morally right in their actions. We are both saying the same thing. \n \n And it sounds just as hyprocritical and demented coming from you as it does coming from me. \n \n It is inevitable that as a believer you must subscribe to what is clearly illogical. Yet you are also so brainwashed that you don't even realize that you are exposing the folly of your doctrine with your own words, but only when mirrored back to you by me you start defending and arguing against the same original points you made. This constant switching of positions is no surprise, after all, you're a follower of God, so no less is to be expected. You must constantly rearrange in your mind which of the myriad of contradictory arguments you must support at any given time to try to justify your baseless theories. I've pointed on too many times to count instances where you've had back to back posts of arguments that you offer that are mutually exclusive. In fact lately you've been posting contradictory arguments in the same post. Now you're arguing against your own posts. Great. \n \n And I notice you're using the same \"lack of spiritual understanding\" escape clause that archie is using. Could you come up with something original please?", 
   {}, 
   366467, 
   null, 
   1251064560.0
  ], 
  [
   366483, 
   null, 
   "Easyrider", 
   "How is what you said different from what I said? The israelites were justified in robbing the egyptians of their gold and goods. The bible says that stealing was right because God told them to do so (the justification is actually irrelevant). And regardless of if God actually told them to do so or not (which neither of us can prove), it is enough that the author of the scripture claims that God told them to do so, for us, in retrospect and third person view, to conclude that they were morally right in their actions. We are both saying the same thing. \n \n And it sounds just as hyprocritical and demented coming from you as it does coming from me. \n \n It is inevitable that as a believer you must subscribe to what is clearly illogical. Yet you are also so brainwashed that you don't even realize that you are exposing the folly of your doctrine with your own words, but only when mirrored back to you by me you start defending and arguing against the same original points you made. This constant switching of positions is no surprise, after all, you're a follower of God, so no less is to be expected. You must constantly rearrange in your mind which of the myriad of contradictory arguments you must support at any given time to try to justify your baseless theories. I've pointed on too many times to count instances where you've had back to back posts of arguments that you offer that are mutually exclusive. In fact lately you've been posting contradictory arguments in the same post. Now you're arguing against your own posts. Great. \n \n And I notice you're using the same \"lack of spiritual understanding\" escape clause that archie is using. Could you come up with something original please?\n\n \n <Flush<\n \n The difference between you and I is that you think what they and God did was wrong. That's ONE of the reasons why your thinking is so screwed up on the Bible.\n \n That's also one of the identifiers of far left liberal radicals: They call good evil and evil good, and they don't know how to deal with evil.\n \n I recommend you get born again and give your life to Christ so you can further your understanding of all these things.", 
   {}, 
   366472, 
   null, 
   1251071820.0
  ], 
  [
   366486, 
   null, 
   "Penfold", 
   "Born again? I got it right the first time. Like Arch, you fail to see the massive disconnect in using the Bible to prove the truth of what the Bible says. You discount the Koran, or the Egyptian Book of the Dead, or the Mahabarat.They are no less valid than your book of lies.\n The bible records what the Israelites recorded about themselves. They are bound to badmouth their enemies while painting themselves as proud champions of goodness and rectitude. You suck up this propaganda wholesale, despite the fact that they stole from their alleged oppressors, but claim that their god said robbery was fine, nothing like a little looting among friends.....", 
   {}, 
   366483, 
   null, 
   1251073020.0
  ], 
  [
   366490, 
   null, 
   "Mosheh Thezion", 
   "dashing babies to the ground, and ripping pregnant women open...\n \n IS NOT ABORTION... its murder. (Which abortion is as well)\n \n -Mosheh thezion", 
   {
    "post_info": {
     "post_title": "ummm"
    }
   }, 
   366486, 
   null, 
   1251077580.0
  ], 
  [
   366528, 
   null, 
   "obvious_child", 
   "No it isn't.\n\n \n Simply because it's God? That's poor reasoning. \n \n \nNo. Mostly because God never said that. It was instructions to man not to Himself. If you set the rules you can set them how you want.\n\n \n So the measure upon which God judges man is not something it is bound to?\n \n \nIt does if you believe God creates morality.\n\n \n What kind of being engages in moral acts which it has deemed to be immoral? \n \n \nThe idea is you are not above, or equal to God...not even close. A parent can set up a rule that says \"when you are 16 your bed time is 10pm but when you are 15 and below it is 9pm\". The parent can stay up until midnight and yet that is not hypocritical. So if the 16 year old stays up until midnight and gets in trouble but the wife doesn't (for example) this is the same act where one is right and one wrong.\n\n \n Wait? Huh. God telling man not to murder but then God murdering is okay? \n \n Explain to me how God engaging in the same evils acts as man no longer makes them evil. \n \n Archie and Ez seem to think that God exterminating millions is morally just but man exterminating millions is not.\n \n How can anyone reasonably place faith in a being that disregards its own moral code?", 
   {}, 
   366471, 
   null, 
   1251110280.0
  ], 
  [
   366531, 
   null, 
   "Archangel", 
   "Simply because it's God? That's poor reasoning. \n \n So the measure upon which God judges man is not something it is bound to?\n \n What kind of being engages in moral acts which it has deemed to be immoral? \n \n Wait? Huh. God telling man not to murder but then God murdering is okay? \n \n Explain to me how God engaging in the same evils acts as man no longer makes them evil. \n \n Archie and Ez seem to think that God exterminating millions is morally just but man exterminating millions is not.\n \n How can anyone reasonably place faith in a being that disregards its own moral code?\n\n \n That's the point ignoramus, you DON'T morally judge God. You, the creature have no right at all to morally judge the Creator of all that is. Does the pot tell the potter how he will make it? Of course not. Does the building tell the architect how it will look? It never happened. Yet here you are, an ignorant little wisp of smoke compared to Gods eternal being which has no beginning and no end, yet you are arrogant and ignorant enough to believe you are qualified to, or justified in any way to judge Him morally? If the idea of it wasn't so pathetic, it would be funny. But why would we expect anything more from the likes of you and your ilk. emoticon_xdonno emoticon_rolleyes", 
   {}, 
   366407, 
   null, 
   1251117960.0
  ], 
  [
   366534, 
   null, 
   "Penfold", 
   "Your god was imagined into being by wisps of smoke such as yourself. In fact they were more rational, since they did not have access to the superior knowledge that we do today.", 
   {}, 
   366531, 
   null, 
   1251120000.0
  ], 
  [
   366535, 
   null, 
   "iangb", 
   "Is a pot or a building sentient? When you find me one that is, even before it is created, then your analogies will be half-valid.\n \n People, however, are sentient. And while I accept that (from your POV) you can't morally judge God, you should be able to look at Him for examples of good moral behaviour - at all times. That's what you have been arguing for half of the time anyway - that God is absolutely moral in everything that He does, which conflicts nicely with the other half of your argument that 'we can't judge if God is being immoral (or not)'. But I digress.\n \n Going by this line, murder is perfectly justified - if you believe that God commands it. So is deliberately killing innocents if they are part of a community which has been deemed by God as 'wicked'.\n \n Incidentally, I was intrigued by this notion. Would God punish the many for the acts of the few - or even for the acts of the majority? Clearly this is your fear, but on what basis does God seek to harm the innocent?\n \n \nThe difference between you and I is that you think what they and God did was wrong. That's ONE of the reasons why your thinking is so screwed up on the Bible.\nRight and wrong aside for a minute... how does the opinion of the person writing the words affect the meaning of the words themselves? Unker was quite right - what he said and what you said were remarkably identical, but you disagreed with his version. This implies either that you didn't read it properly, or that - somewhere - you're being inconsistent.\n \n Looking back at the 'right and wrong' issue - the morality of the Old Testament peoples (God included) is definitely questionable. Take Genesis 34 for example - Jacobs daughter is raped in the fields then her rapist (Shechem) falls in love with her and asks for her hand in marriage, so his father meets Jacob to propose a bonding between the tribes. Jacob agrees - on the condition that every man in Shechem's city be circumcised. The city agrees. Three days later \"while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male. 26 They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left. 27 The sons of Jacob came upon the dead bodies and looted the city where [d] their sister had been defiled. 28 They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields. 29 They carried off all their wealth and all their women and children, taking as plunder everything in the houses.\"\n \n Another example, concerning a prophet of God - Elisha. It kinda speaks for itself.\n \" 23 From there Elisha went up to Bethel. As he was walking along the road, some youths came out of the town and jeered at him. \"Go on up, you baldhead!\" they said. \"Go on up, you baldhead!\" 24 He turned around, looked at them and called down a curse on them in the name of the LORD. Then two bears came out of the woods and mauled forty-two of the youths.\"", 
   {}, 
   366531, 
   null, 
   1251121440.0
  ], 
  [
   366537, 
   null, 
   "Archangel", 
   "God never commanded murder. He commanded killing the enemies of Israel in wartime. Enemies who would have done the same or worse to the children of God had the opportunity availed itself to them. Just because you and your ilk constantly pervert what actually happened in its proper context does nothing to justify your position.", 
   {}, 
   366535, 
   null, 
   1251122460.0
  ], 
  [
   366540, 
   null, 
   "iangb", 
   "God never commanded murder. He commanded killing the enemies of Israel in wartime. Enemies who would have done the same or worse to the children of God had the opportunity availed itself to them. Just because you and your ilk constantly pervert what actually happened in its proper context does nothing to justify your position.\n\n Regarding the bold...\n How does this include the (as yet unborn) foetuses in the wombs of the pregnant women?\n How does this include the 42 youths who God killed more or less personally, for insulting one of His prophets?\n How does this include Lot's wife, killed for looking back at her home as it was destroyed?", 
   {}, 
   366537, 
   null, 
   1251123600.0
  ], 
  [
   366542, 
   null, 
   "Penfold", 
   "God never commanded murder. He commanded killing the enemies of Israel in wartime. Enemies who would have done the same or worse to the children of God had the opportunity availed itself to them. Just because you and your ilk constantly pervert what actually happened in its proper context does nothing to justify your position.\n\n \n Moral relativity anyone? Your behaviour should depend on your morality, not that of those you label \"enemy\".", 
   {}, 
   366537, 
   null, 
   1251125100.0
  ], 
  [
   366543, 
   null, 
   "Steeeeve", 
   "So the measure upon which God judges man is not something it is bound to?\nCorrect. But God would always be moral and just. That is what God is. \n \n I'm not going to get into an argument about whether or not God exists but all I am saying is if you believe God is good, moral, and just (and by is I mean literally is) than this is not hypocritical at all...in fact, it is just. I feel your position is always to assume God equal to or beneath you.\n \n \nWhat kind of being engages in moral acts which it has deemed to be immoral? \nDeemed immoral for some. \n \n \nWait? Huh. God telling man not to murder but then God murdering is okay? \nWouldn't be murder then now would it. But yes.\n \n \nExplain to me how God engaging in the same evils acts as man no longer makes them evil. \nI've been over this before. You can't get around how common this is and how non hypocritical it is. Parents make rules for their kids that they don't apply to themselves. Perfectly reasonable and not hypocritical. Same basic idea applies to God. If He creates morality and justice and is those things than how could God be beneath them?\n \n \nHow can anyone reasonably place faith in a being that disregards its own moral code?\nThere is no disregard.", 
   {}, 
   366528, 
   null, 
   1251126180.0
  ], 
  [
   366544, 
   null, 
   "unkerpaulie", 
   "God never commanded murder. He commanded killing the enemies of Israel in wartime. Enemies who would have done the same or worse to the children of God had the opportunity availed itself to them. Just because you and your ilk constantly pervert what actually happened in its proper context does nothing to justify your position.\n\n Awesome response to iangb's post, particularly immediately after he points out 2 famous biblical instances when the \"children of God\" killed others at times of no war, and where the victims were clearly not in a position to harm them or even fight back. I actually thought it was clever of Jacob to use the circumcision tactic, a sign of the covenant between God and his people, to lure them into false trust just before they were killed in their sleep by these \"children of God\". That was sweet. \n \n But you're right, I'm sure you can invent a twisted interpretation to show us that in both these examples israel was at war, and these people were the enemy, intending to kill God's people at the first opportunity.", 
   {}, 
   366537, 
   null, 
   1251129060.0
  ], 
  [
   366550, 
   null, 
   "Matthew", 
   "How is that conclusion derived at? The passage is speaking to the consequences to a man who's actions cause the death of an unborn child.\n\n \n It is in the first place unclear to whom the \"further harm\" is done. But even granting that the fetus dies, it is not clear how the situation is analogous to abortion, because the intentions of not only the man but even more importantly of the pregnant woman are completely different.\n \n \nAnd the proscribed consequence is death according to OT Law. So although the passage isn't speaking to abortion at all, it is making a very clear statement regarding the value of the unborn, as it is requiring a life for a life just as for any other sentient being according to the OT Law.\n\n \n But of course, the laws of the Old Testament neither are nor should be the laws of 21st-century America. We are a religiously pluralistic society, and our political laws need to reflect that. If you note my earlier comments today on Roe, I think the decision is brilliant on this score: the court did not step in and decide a metaphysical question (When does life begin?) that neither it nor any other branch of governnment is qualified to do.\n \n \nSo these arguments I get from the likes of you and Iangb which argue that until a child shows mental awareness, it isn't actually a person deserving of human rights is a bogus and shortsighted position according to the scriptural point of view. Of that, there is no question.\n\n \n Actually, there is a great deal in question, even in the passage at issue. It continues to amaze me how little you distinguish \"the scriptural point of view\" from your view of scripture.", 
   {}, 
   366350, 
   null, 
   1251133980.0
  ], 
  [
   366551, 
   null, 
   "Mosheh Thezion", 
   "The definition of murder, is to kill with malace, and with forethought.. to do so intentionally.\n \n as different from manslaughter... which is to kill by accident.\n \n war time or not... commanded by god or not.\n \n if you planned on doing it, it is murder.\n \n its then a question of whether it is justified.\n \n -Mosheh Theion", 
   {
    "post_info": {
     "post_title": "excuse me.."
    }
   }, 
   366550, 
   null, 
   1251134820.0
  ], 
  [
   366552, 
   null, 
   "Matthew", 
   "If you set the rules you can set them how you want.\n\n \n And in the absence of an intelligible reason, that means these rules are arbitrary.\n \n \nThe idea is you are not above, or equal to God...not even close. A parent can set up a rule that says \"when you are 16 your bed time is 10pm but when you are 15 and below it is 9pm\". The parent can stay up until midnight and yet that is not hypocritical. So if the 16 year old stays up until midnight and gets in trouble but the wife doesn't (for example) this is the same act where one is right and one wrong.\n\n \n And if the child asks for an explanation of the rule and the exception, yet receives none, then again that's arbitrary. If the parent then invokes his or her own authority as justification -- \"Because I said so, that's why\" -- that's authoritarian. I do realize that small children cannot be reasoned with, of course. But adolescents deserve explanations.\n \n To say nothing of adults. You don't set the rules simply because you can. You set the rules you believe you should. Collapsing the distinction on the basis of power is a recipe for disaster -- in family life, in politics, in religion, in anything.", 
   {}, 
   366471, 
   null, 
   1251134820.0
  ], 
  [
   366553, 
   null, 
   "Steeeeve", 
   "And in the absence of an intelligible reason, that means these rules are arbitrary.\nNo it doesn't. You'd have to explain how this is true.\n \n \nAnd if the child asks for an explanation of the rule and the exception, yet receives none, then again that's arbitrary. If the parent then invokes his or her own authority as justification -- \"Because I said so, that's why\" -- that's authoritarian. I do realize that small children cannot be reasoned with, of course. But adolescents deserve explanations.\nA kid doesn't deserve an explanation and neither do adolescents. You aren't owed anything. You are kind of thinking the same way obvious_child is thinking in that you are the supreme being. This isn't the case. \n \n \nTo say nothing of adults. You don't set the rules simply because you can. You set the rules you believe you should. Collapsing the distinction on the basis of power is a recipe for disaster -- in family life, in politics, in religion, in anything.\nI'm not arguing this point. I'm simply saying the person that sets the rules can do so as they please. Certainly in the case of morality when that being creates morality, logic, and everything else.", 
   {}, 
   366552, 
   null, 
   1251137100.0
  ], 
  [
   366571, 
   null, 
   "Matthew", 
   "No it doesn't. You'd have to explain how this is true.\n\n \n \"arbitrary\" adj. 2 based on one's preferences, notion, whim, etc.: capricious\n \n If the only \"reason\" that you give for why someone should behave a certain way is that you want them to -- which really doesn't tell them anything they didn't already know, ergo my scare quotes -- then you're being arbitrary.\n \n And it's not a trait we citizens of modern democracies tend to like in our rulers, rightly identifying that sort of decision-making with authoritarianism. Some religious believers appear not to mind it in the supreme ruler, however....\n \n Kind of ironic, I'd say!\n \n \nA kid doesn't deserve an explanation and neither do adolescents. You aren't owed anything.\n\n \n This isn't about what's \"owed.\" It's about the way someone in a position of authority ought to behave toward those over whom he possesses authority, and has nothing to do with whether they \"deserve\" it.\n \n But while we're on the subject of what's owed and what isn't -- let me just push the envelope here for a moment -- why aren't we owed reasons from God? I mean seriously. Take the typical, traditional, conservative view of the afterlife: eternal reward, or eternal damnation. The stakes are very high. And yet, we are to make our choices, without any reasoned explanation whatsoever to demonstrate that one choice is \"really\" the one more likely to win the reward and avoid the punishment. Which leaves us in rather a pickle.\n \n Of course, strictly speaking, this isn't quite how it works, since -- as any good Augustinian or Lutheran or Calvinist can tell you -- nothing you do, no matter how good, can compel God to reward you, nor can anything you do, no matter how bad, compel God to punish you. God makes his choices about whom to reward and whom to punish, and we cannot influence his will.\n \n Which, as I see it, throws two strikes at traditional notions of the afterlife. We are in the dark, forced to make arbitrary choices on the basis of a faith that is, under that circumstance, truly blind -- and that wouldn't have any impact on the outcomes anyway, despite what pop theology says. Worse, God is rendered completely arbitrary as well, choosing the saved and the damned for allegedly inscrutable \"reasons,\" which we therefore have no reason (!) to describe as \"reasons\" at all. One might justifiably fear such a celestial monster, but it would be insane to love him, or to describe him as loving.\n \n \nYou are kind of thinking the same way obvious_child is thinking in that you are the supreme being. This isn't the case.\n\n \n Indeed it isn't. I am not the supreme being. I merely request that if we conceive of God as a supreme being we recognize that for him to act in such authoritarian ways -- \"I owe you nothing! Do what I tell you!\" -- is a mockery of his supremacy. Theologians have recognized this since the days of the Church Fathers, which is why they ever bothered to attempt rational explanations of theistic metaphysical and moral concepts in the first place.\n \n \nI'm not arguing this point. I'm simply saying the person that sets the rules can do so as they please. Certainly in the case of morality when that being creates morality, logic, and everything else.\n\n \n And I'm simply saying that either that being has a reason for creating the rules, or he doesn't. If the latter, then that being is creating arbitrarily. But virtually every theology ascribes the former view to God: he creates for a reason. The thing is, if those reasons are ultimately inscrutable to those to whom they apply, then as far as they're concerned, God is still arbitrary.", 
   {}, 
   366553, 
   null, 
   1251149460.0
  ], 
  [
   366575, 
   null, 
   "Archangel", 
   "It is in the first place unclear to whom the \"further harm\" is done. But even granting that the fetus dies, it is not clear how the situation is analogous to abortion, because the intentions of not only the man but even more importantly of the pregnant woman are completely different.\n\n \n Didn't I make this statement in the very next sentence which you quoted? {Archangel Said}So although the passage isn't speaking to abortion at all, it is making a very clear statement regarding the value of the unborn, as it is requiring a life for a life just as for any other sentient being according to the OT Law. So of what value is your statement that the situation isn't analogous to abortion? Here is the link I posted earlier in this debate which has been largely ignored thus far. Maybe reading it in context will help you understand the arguments being made. Bible and abortion : The Biblical case against abortion\n \n \nBut of course, the laws of the Old Testament neither are nor should be the laws of 21st-century America. We are a religiously pluralistic society, and our political laws need to reflect that. If you note my earlier comments today on Roe, I think the decision is brilliant on this score: the court did not step in and decide a metaphysical question (When does life begin?) that neither it nor any other branch of governnment is qualified to do.\n\n \n Here's the rub Matthew, I only made the statement to show the moral standing of Gods position. It is constantly argued by your side that God had no special concern for the unborn. This verse shows that God does value the life of the unborn according to OT Law just as He valued the life of any sentient being.\n \n If you, as a declared christian as you claim to be care about living up to Gods moral standards and principles, then how can you say that our 21st century laws shouldn't reflect Gods values since He clearly says throughout His word that He is the same yesterday, today and forever. In other words, if God valued the unborn 4,000 years ago, do you actually believe He values them any less today? \n \n Of course He doesn't. So how can you defend abortion on demand when it is snuffing out the life of an innocent healthy child which has done absolutely nothing to deserve the death penalty before he has even had a chance to live? It makes no sense for someone who claims to have a consistent spiritual perspective on life. \n \n \nActually, there is a great deal in question, even in the passage at issue. It continues to amaze me how little you distinguish \"the scriptural point of view\" from your view of scripture.\n\n \n I don't understand your confusion at all. How am I to distinguish the scriptural point of view from my view of scripture? That statement sounds redundant to me, as if you're saying the same thing 2 different ways. So please clarify what you mean by this statement if you can.", 
   {}, 
   366550, 
   null, 
   1251151080.0
  ], 
  [
   366586, 
   null, 
   "Steeeeve", 
   "\"arbitrary\" adj. 2 based on one's preferences, notion, whim, etc.: capricious\n \n If the only \"reason\" that you give for why someone should behave a certain way is that you want them to -- which really doesn't tell them anything they didn't already know, ergo my scare quotes -- then you're being arbitrary.\n \n And it's not a trait we citizens of modern democracies tend to like in our rulers, rightly identifying that sort of decision-making with authoritarianism. Some religious believers appear not to mind it in the supreme ruler, however....\n \n Kind of ironic, I'd say!\nYou assume God has no reason, has to convince you of the reason, and is beneath something he created. Nothing here is arbitrary. \n \n \nThis isn't about what's \"owed.\" It's about the way someone in a position of authority ought to behave toward those over whom he possesses authority, and has nothing to do with whether they \"deserve\" it.\nAgain you assume the servant is above the master. \n \n \nBut while we're on the subject of what's owed and what isn't -- let me just push the envelope here for a moment -- why aren't we owed reasons from God? I mean seriously. Take the typical, traditional, conservative view of the afterlife: eternal reward, or eternal damnation. The stakes are very high. And yet, we are to make our choices, without any reasoned explanation whatsoever to demonstrate that one choice is \"really\" the one more likely to win the reward and avoid the punishment. Which leaves us in rather a pickle.\nSee above. \n \n \nIndeed it isn't. I am not the supreme being. I merely request that if we conceive of God as a supreme being we recognize that for him to act in such authoritarian ways -- \"I owe you nothing! Do what I tell you!\" -- is a mockery of his supremacy.\nNot only is it not a mockery but it is true. God owes you nothing and you owe everything to God is basically a Christian truth. \n \n \nAnd I'm simply saying that either that being has a reason for creating the rules, or he doesn't. If the latter, then that being is creating arbitrarily. But virtually every theology ascribes the former view to God: he creates for a reason. The thing is, if those reasons are ultimately inscrutable to those to whom they apply, then as far as they're concerned, God is still arbitrary.\nand my point is that there is no contradiction if God doesn't want to follow rules He creates for others.", 
   {}, 
   366571, 
   null, 
   1251154080.0
  ], 
  [
   366587, 
   null, 
   "Easyrider", 
   "\n \n Looking back at the 'right and wrong' issue - the morality of the Old Testament peoples (God included) is definitely questionable. Take Genesis 34 for example - Jacobs daughter is raped in the fields then her rapist (Shechem) falls in love with her and asks for her hand in marriage, so his father meets Jacob to propose a bonding between the tribes. Jacob agrees - on the condition that every man in Shechem's city be circumcised. The city agrees. Three days later \"while all of them were still in pain, two of Jacob's sons, Simeon and Levi, Dinah's brothers, took their swords and attacked the unsuspecting city, killing every male. 26 They put Hamor and his son Shechem to the sword and took Dinah from Shechem's house and left. 27 The sons of Jacob came upon the dead bodies and looted the city where [d] their sister had been defiled. 28 They seized their flocks and herds and donkeys and everything else of theirs in the city and out in the fields. 29 They carried off all their wealth and all their women and children, taking as plunder everything in the houses.\"\n \n Another example, concerning a prophet of God - Elisha. It kinda speaks for itself.\n \" 23 From there Elisha went up to Bethel. As he was walking along the road, some youths came out of the town and jeered at him. \"Go on up, you baldhead!\" they said. \"Go on up, you baldhead!\" 24 He turned around, looked at them and called down a curse on them in the name of the LORD. Then two bears came out of the woods and mauled forty-two of the youths.\"\n\n \n The moral of that last story is: Don't screw with baldy.\n \n That aside, where did God tell these folks to do what they did? Just curious.", 
   {}, 
   366535, 
   null, 
   1251154080.0
  ], 
  [
   366591, 
   null, 
   "iangb", 
   "The moral of that last story is: Don't screw with baldy.\n \n That aside, where did God tell these folks to do what they did? Just curious.\nMorals are what you make them to be. For example, \"It's OK to kill youths if they've insulted your prophets\" is another possible one.\n \n The ones in my Joshua example? He doesn't tell them, nor did I say that he told them. Look at what I said: \"the morality of the Old Testament peoples (God included) is definitely questionable.\". However, in the next chapter He does immediately reward them, by protecting them from the angry reprisals of the neighbouring villages: \"5 Then they set out, and the terror of God fell upon the towns all around them so that no one pursued them.\"\n \n Note that in the other examples, God is either commanding it (through the proxy of a speaker) or directly doing it (pillar of salt, bears etc).", 
   {}, 
   366587, 
   null, 
   1251155880.0
  ], 
  [
   366599, 
   null, 
   "Easyrider", 
   "Morals are what you make them to be. For example, \"It's OK to kill youths if they've insulted your prophets\" is another possible one.\n \n The ones in my Joshua example? He doesn't tell them, nor did I say that he told them. Look at what I said: \"the morality of the Old Testament peoples (God included) is definitely questionable.\". However, in the next chapter He does immediately reward them, by protecting them from the angry reprisals of the neighbouring villages: \"5 Then they set out, and the terror of God fell upon the towns all around them so that no one pursued them.\"\n \n Note that in the other examples, God is either commanding it (through the proxy of a speaker) or directly doing it (pillar of salt, bears etc).\n\n \n OK, so in your two examples, God didn't command either assault. And as a Christian I'm not about to call them \"Godly people,\" since God himself called them a rebellious and stiff-necked people, amongst other things.\n \n As for the blessing in Genesis 35, as far as I can see that was arguably the result of the Covenant God had made with Abraham (Jacob's grandfather), and not specifically tied to the actions in your example. \n \n My conclusion on those two examples, then, is that you can't hold God responsible for ungodly acts committed by a people he characterizes as rebellious and stiff-necked. Fair enough?", 
   {}, 
   366591, 
   null, 
   1251158100.0
  ], 
  [
   366605, 
   null, 
   "Steamroller", 
   "Why don't you atheists quit pussyfooting around. Just ask the \"dumb\" christians this one and be done with it.\n \n If God can do anything, can he create a rock so big that He can not lift it?\n \n There..., YOU WIN!! Debate concluded.., no need to go on. emoticon_xhoho\n \n As for my Christian brothers and sisters...., \"Pearls before SWINE...\"\n \n These people have absolutely no interest in knowing God or finding truthful answers to the preposterous questions they pose.\n \n Not one of them has ever truly sought God, though they know enough to fear the hell that may await them. From what little knowledge they possess comes the wellspring of hatred for the God they refuse to acknowledge and continue to deny through vein attempts by winning word games in the battlefields of thier own minds.\n \n There comes a time to shake the dust from your feet and move to a field whose harvest awaits you.", 
   {}, 
   366599, 
   null, 
   1251160080.0
  ], 
  [
   366606, 
   null, 
   "Matthew", 
   "Didn't I make this statement in the very next sentence which you quoted? {Archangel Said}So although the passage isn't speaking to abortion at all, it is making a very clear statement regarding the value of the unborn, as it is requiring a life for a life just as for any other sentient being according to the OT Law. So of what value is your statement that the situation isn't analogous to abortion?\n\n \n My first point was that it's not clear whether harm to the mother or to the prematurely delivered fetus is what's at issue. The text is ambiguous.\n \n But my larger point is that the statement is not nearly as general as you're making it out to be. It is, in fact, a specific legal recommendation about what to do in a very specific situation of wrongdoing, similar to what we might describe as involuntary manslaughter of a fetus.\n \n I have no doubt that a more general moral principle of value for prenatal life animates this specific law. But what you're trying to do is take the specific punishment recommended here and then apply it back to anything that falls within the scope of that general principle. And that's what I object to.\n \n Suppose that theft of an automobile is punishable by ten years in prison. Suppose that we say the general principle animating this law is respect for private property. It would be absurd to infer from this that other forms of disrespect for private property --stealing a t-shirt or embezzling a million dollars or even perpetrating an arson -- should also receive the same punishment. Cases could clearly be made for different punishments, despite the same animating principle.\n \n Meanwhile, my point about the irrelevance of the passage to abortion still stands. Even the Bible does not place an absolute prohibition on killing: we are commanded not to murder, and per the Bible, not all instances of killing are ipso facto \"murder.\" The question then becomes, when is killing murder? The passage certainly indicates that when two people fighting cause the death of a pregnant woman or her unborn child (like I said, ambiguity), the penalty would be death according to Old Testament law: it is essentially murder. But since the passage in question does not refer to abortion at all, the passage does not establish that abortion is murder. That is what I've been getting at.\n \n \nHere is the link I posted earlier in this debate which has been largely ignored thus far. Maybe reading it in context will help you understand the arguments being made.\n\n \n For what it's worth, the Exodus passage simply does not establish the author's entirely overgenal point \"c) The killing of the unborn is murder.\" Even assuming that the \"serious harm\" or \"further harm\" in the passage refers to the fetus rather than or in addition to the mother (there's that ambiguity again), all that the passage shows is that this sort of killing of the unborn is murder. But since that sort of killing of the unborn is, as you yourself have acknowledged more than once, not an abortion, it does not establish that abortion is murder. He is making the same mistake you do, as I described above.\n \n The rest of the passages are likewise irrelevant. Just to take the next couple sets, the passages about God creating us in the womb merely establish that the general principle, not anything specific. And the passages about life beginning at conception are flimsy inferences at best. Read that full Psalm or that portion of the story in Judges and tell me that what we're supposed to take away from either is that life begins at conception. Preposterous.\n \n This is what I hate about so-called fundamentalist \"systematic theology,\" a la Grudem: it starts with a concept, and then looks for a passage to support it, no matter how ridiculous it is to lift that passage from its context.\n \n \nI only made the statement to show the moral standing of Gods position. It is constantly argued by your side that God had no special concern for the unborn.\n\n \n I have claimed more than once on this thread that God does care about prenatal life. So this point in your argument is simply not relevant to me.\n \n \nIf you, as a declared christian as you claim to be care about living up to Gods moral standards and principles, then how can you say that our 21st century laws shouldn't reflect Gods values since He clearly says throughout His word that He is the same yesterday, today and forever.\n\n \n Love the \"as you claim to be!\" Still think I'm not really a Christian, because I disagree with you, eh?\n \n Anyway, the reason why I don't think our civil laws should coincide with my religious views is that not everybody thinks about religion as I do. There are Jews and Muslims, Hindus and Buddhists, atheists and agnostics -- even other Christians who don't interpret scripture the way I do, like you. I have no right to force them to do things as I would.\n \n I do my best to live my life according to Christian principles. I encourage others to do the same by example (and some of the principles are generalizable beyond Christianity, of course). Sometimes I even invite a non-religious friend to worship, and sometimes they take me up on the offer.\n \n But what I will not do is use the force of government to impose Christian principles on those who are not Christians. At best, this would compel nothing more than outward behavior, not a change of heart. At worst, it displays more will to control than to love.\n \n \n In other words, if God valued the unborn 4,000 years ago, do you actually believe He values them any less today?\n \n Of course He doesn't.\n\n \n No doubt true. But as the passage doesn't state what God thinks about abortion, it's not relevant to the specific point at hand.\n \n Once again, you are confusing the general point (God cares for all prenatal life) with a specific point (abortion is murder).\n \n \nSo how can you defend abortion on demand--\n\n \n Now you're just pretending I said something I didn't say. I did not defend abortion on demand. Nor will I.\n \n Nor, as far as I can tell, will anyone. I think that \"abortion on demand\" is a phrase without a referent. No pregnant decides to abort her pregnancy lightly, nor should she. Treating the situation as if women get abortions like they buy a cup of coffee or go for a jog is a ridiculous distortion.\n \n In any event, to reiterate, I do not support abortion on demand. For what it's worth, I also oppose late-term abortions. Although... If a woman finds out in the third trimester that her baby has a lethal birth defect, then I don't think she should be compelled to carry her pregnancy to term.\n \n I would generally counsel against abortion even in earlier terms, except in cases where the baby will never survive (e.g. anencephaly), the mother's life is in danger, or where her long-term health will be jeopardized. Barring such circumstances, I don't think abortion is a moral way to go.\n \n But the fact is, just because I think something is immoral, that doesn't mean it should be illegal for everyone. I would counsel against abortion, but I would not legally prohibit it -- not until the third trimester, and with a reasonable exception made for the safety of the mother.\n \n On the other hand, I also support improved adoption practices; improved prenatal care; improved sex education; and childcare assistance for poor, unwed, or teenaged mothers. It shouldn't always be illegal to abort, but we should do everything we can to make the decision not to abort more manageable. That's pretty consistent with my moral view, I think.\n \n \n...when it is snuffing out the life of an innocent healthy child which has done absolutely nothing to deserve the death penalty before he has even had a chance to live?\n\n \n And of course, the question is, Is it \"snuffing out a life?\" You might think so, even I might think so, and we might cite our religious views in support of this -- but this is ultimately a metaphysical question. It is a matter of conscience about which none of us can be absolutely certain.\n \n Which is probably why even the official views change over time. In the middle ages, believers who were far more theologically conservative than most theological conservatives today believed that abortion prior to quickening was acceptable -- 40 days for a male fetus, 80 for a female. The Catholic Church adopted its present position in the early 20th century.\n \n Edit: I'd be very interested in knowing what were the ancient Jewish practices concerning abortion. I haven't been able to find much.\n \n \nIt makes no sense for someone who claims to have a consistent spiritual perspective on life.\n\n \n Sure it does. If you make a distinction between your own religiously based moral principles and governmentally enforced laws that will apply to everyone, whether they share your views or not. And if you recognize that it's possible for you to be mistaken about those very principles.\n \n It's called humility. And it's quite consistent with an active spiritual life.\n \n \nI don't understand your confusion at all. How am I to distinguish the scriptural point of view from my view of scripture?\n\n \n By acknowledging that your view of scripture could be wrong, and someone else's could be right. Again, humility.\n \n You believe that the scriptures prohibit abortion. But you could be wrong about that. I certainly think you are. But I could be wrong about that: maybe they do prohibit abortion, and you're right after all.\n \n What we need to do is look at what the scriptures say, and try to understand them. And we should acknowledge from the outset that we might still disagree even after that examination, that neither of us has a direct hotline into the mind of God, and we should proceed accordingly.\n \n \n \nThat statement sounds redundant to me, as if you're saying the same thing 2 different ways. So please clarify what you mean by this statement if you can.\n\n \n It's like the difference between saying \"God exists\" and \"I believe that God exists.\" One of them incorporates the subjectivity of the agent making the statement into the statement itself.\n \n When you understand this point, then you will finally understand my religious outlook, Archie!", 
   {}, 
   366605, 
   null, 
   1251160860.0
  ], 
  [
   366607, 
   null, 
   "iangb", 
   "OK, so in your two examples, God didn't command either assault. And as a Christian I'm not about to call them \"Godly people,\" since God himself called them a rebellious and stiff-necked people, amongst other things.\n\n No, in only one of the two, God didn't command the attack; he just protected Jacobs tribe from it's repercussions. If they aren't 'Godly people', they are certainly 'Gods people' and they are the certainly seen as heroes of the tale; after all, it's their tale! The moral here could be 'You can get away with anything you want if you are under Gods protection'.\n I'm not 'holding God responsible' for the attack (unlike all the others), but I am saying that it's another bad example of moral behaviour, coming from the heroes of the time, God's Chosen People. Not responsible for, perhaps, but certainly unwisely associated with (and unpunishing of). It's the modern-day equivalent of God harbouring (read: protecting) a known terrorist.\n \n However, in the other example (Elisha), God doesn't just command the attack - he practically kills the youths Himself, unless Elisha was secretly an attack bear trainer. Furthermore; of the other examples in this thread, God commands one (the OP) and carries out the other (Lots wife). That's still not the best example of moral behaviour, even if you were to discard Joshua.", 
   {}, 
   366599, 
   null, 
   1251160920.0
  ], 
  [
   366610, 
   null, 
   "Easyrider", 
   "No, in only one of the two, God didn't command the attack; he just protected Jacobs tribe from it's repercussions. If they aren't 'Godly people', they are certainly 'Gods people' and they are the certainly seen as heroes of the tale; after all, it's their tale! The moral here could be 'You can get away with anything you want if you are under Gods protection'.\n\n \n That's not true. Israel as a whole was under God's protection, weren't they? But when they screwed up, one judgment after another befell them. Just read the book of Judges and the remainder of the OT to see that.\n \n \n\n I'm not 'holding God responsible' for the attack (unlike all the others), but I am saying that it's another bad example of moral behaviour, coming from the heroes of the time, God's Chosen People. Not responsible for, perhaps, but certainly unwisely associated with (and unpunishing of). It's the modern-day equivalent of God harbouring (read: protecting) a known terrorist.\n\n \n See above. How many judgments and sackings of Israel and Judah, etc., etc. can you count occurred to \"God's Chosen People,\" BY GOD'S HAND, in the OT? Dozens? Scores? \n \n \nHowever, in the other example (Elisha), God doesn't just command the attack - he practically kills the youths Himself, unless Elisha was secretly an attack bear trainer.\n\n \n You must be reading a different Bible than I am. In 2 Kings God does not command the attack. Elisha calls for it in the name of the Lord. There's no evidence the Lord agreed with that. The bears coming out was probably a coincidence. But even if it weren't, we don't know the previous history of this gang of hoodlums, and what blood they might have previously shed to come under such a judgment.", 
   {}, 
   366607, 
   null, 
   1251162060.0
  ], 
  [
   366615, 
   null, 
   "Matthew", 
   "You assume God has no reason...\n\n \n I make no such assumption. I believe in God, and that God does things for reasons.\n \n \n...has to convince you of the reason...\n\n \n Nor this assumption. I merely say that if some pseudo-theologian claims that God's reasons are unintelligible, they aren't actually reasons, as the notion of an unintelligible reason is utterly incoherent.\n \n \n...and is beneath something he created.\n\n \n Nope. Three strikes.\n \n But as long as we're using metaphors of position to describe our relationship to a creator who is beyond space and time, I believe that God resides neither above nor below but with his creation. See Matthew 1:23 for details.\n \n \nNothing here is arbitrary.\n\n \n And I repeat. If you want someone to do something, and the only reason you can give them for doing it is that you want them to, then you are being arbitrary.\n \n \nAgain you assume the servant is above the master.\n\n \n Strike four!\n \n \nNot only is it not a mockery but it is true. God owes you nothing and you owe everything to God is basically a Christian truth.\n\n \n Of course it is -- and a Jewish and Islamic truth as well, maybe even a Hindu truth. But that's not the issue. Authoritarianism was.\n \n Frankly, whenever I hear someone demand adherence to one of God's laws, even though the demander himself can't explain it, the voice I hear is authoritarian -- and it belongs to the person demanding, not to God.\n \n \nand my point is that there is no contradiction if God doesn't want to follow rules He creates for others.\n\n \n Nope, no contradiction. Just hypocrisy.\n \n I refuse to accept that God creates a lawful universe and then violates those laws whenever he sees fit. It seems to run directly counter to his power, his foresight, and his goodness.\n \n Of course, I also don't regard Biblical narratives as literally true. When I see a passage that depicts God doing or advocating horribly immoral things, I tend to see that as an all-too-human moment. Hence I don't try to explain away the alleged immorality as really being moral since God can do whatever he wants. Instead, I try to use a bit of discernment to see what spiritual insights the text reveals in spite of the human failings that are also expressed. A story for another time perhaps.", 
   {}, 
   366586, 
   null, 
   1251163380.0
  ], 
  [
   366618, 
   null, 
   "Matthew", 
   "As for my Christian brothers and sisters...., \"Pearls before SWINE...\"\n\n \n True. That's why Jesus gave up on the prostitutes and tax collectors. Er, waitaminnit....\n \n \nThese people have absolutely no interest in knowing God or finding truthful answers to the preposterous questions they pose.\n\n \n I'll leave it to \"these people\" to decide what they are or aren't interested in finding. But speaking as a Christian, I think their questions are entirely legitimate, and one can learn a lot by taking their questions seriously instead of dismissing them as uninterested in the truth.\n \n \nNot one of them has ever truly sought God...\n\n \n How do you know that?\n \n Indeed, how do you know that some haven't truly found him?\n \n Have you considered the possibility that maybe you are the one who isn't looking very hard? or that maybe, whatever you may think you've found, you are mistaken?\n \n \n...though they know enough to fear the hell that may await them.\n\n \n I confess that I'm not sure \"they\" are the ones who fear that hell may awaith them....", 
   {}, 
   366605, 
   null, 
   1251164280.0
  ], 
  [
   366620, 
   null, 
   "Accipiter", 
   "Why don't you atheists quit pussyfooting around. Just ask the \"dumb\" christians this one and be done with it.\n\n \n we don't ask because we already know what they will say.\n \n I can't remember ever being surprised by what a religious person says.", 
   {
    "unicode_changes_made": true
   }, 
   366605, 
   null, 
   1251164400.0
  ], 
  [
   366625, 
   null, 
   "iangb", 
   "That's not true. Israel as a whole was under God's protection, weren't they? But when they screwed up, one judgment after another befell them. Just read the book of Judges and the remainder of the OT to see that.\nUh, kinda. From the very next chapter after Jacob's boys did their pillaging: \" 9 After Jacob returned from Paddan Aram, [c] God appeared to him again and blessed him. 10 God said to him, \"Your name is Jacob, [d] but you will no longer be called Jacob; your name will be Israel. [e] \" So he named him Israel.\n \n 11 And God said to him, \"I am God Almighty [f] ; be fruitful and increase in number. A nation and a community of nations will come from you, and kings will come from your body. 12 The land I gave to Abraham and Isaac I also give to you, and I will give this land to your descendants after you.\"\"\n \n Things, as you say, changed later on as the tribe went their separate ways. But at that point, they were most definitely the Chosen Ones.\n \n \nSee above. How many judgments and sackings of Israel and Judah, etc., etc. can you count occurred to \"God's Chosen People,\" BY GOD'S HAND, in the OT? Dozens? Scores? \nA fair few. However, not at this point in the story. \n \n The irony is that later, you are pointing out that God carries on with exactly what you are denying he does at this point in the story - commit atrocities against those who cross Him.\n \n \nYou must be reading a different Bible than I am. In 2 Kings God does not command the attack. Elisha calls for it in the name of the Lord. There's no evidence the Lord agreed with that. The bears coming out was probably a coincidence. But even if it weren't, we don't know the previous history of this gang of hoodlums, and what blood they might have previously shed to come under such a judgment.\nSo your assumption now tuns to \"well, God killed them, they must have done something wrong\". However, there isn't any evidence of this. The only thing that singles out these youths, apart from all the other sinners in the area, is that they happened to call names at the wrong guy.", 
   {}, 
   366620, 
   null, 
   1251165780.0
  ], 
  [
   366627, 
   null, 
   "unkerpaulie", 
   "OK, so in your two examples, God didn't command either assault. And as a Christian I'm not about to call them \"Godly people,\" since God himself called them a rebellious and stiff-necked people, amongst other things.\n \n As for the blessing in Genesis 35, as far as I can see that was arguably the result of the Covenant God had made with Abraham (Jacob's grandfather), and not specifically tied to the actions in your example. \n \n My conclusion on those two examples, then, is that you can't hold God responsible for ungodly acts committed by a people he characterizes as rebellious and stiff-necked. Fair enough?\n\n When did God ever refer to either jacob or elisha as stiff-necked and rebellious? We are talking about 2 specific and prominent men of God, not the nation of israel as a whole. \n \n In the Elisha example, God didn't command the assault, he executed it himself. And in the Jacob example, it was obvious that continued to bless them and never reprimanded them or made them repent. \n \n Don't be disingenious. According to the bible, in both these examples Jacob and his sons and Elisha were morally right in the sight of God.", 
   {}, 
   366599, 
   null, 
   1251167580.0
  ], 
  [
   366630, 
   null, 
   "Steamroller", 
   "True. That's why Jesus gave up on the prostitutes and tax collectors. Er, waitaminnit....\n\n \n Matthew 10:13-15 (New International Version)\n 13If the home is deserving, let your peace rest on it; if it is not, let your peace return to you. 14If anyone will not welcome you or listen to your words, shake the dust off your feet when you leave that home or town. 15I tell you the truth, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town.\n \n \n \nI'll leave it to \"these people\" to decide what they are or aren't interested in finding. But speaking as a Christian, I think their questions are entirely legitimate, and one can learn a lot by taking their questions seriously instead of dismissing them as uninterested in the truth.\n\n \n You are very eloquent in your use of words and arguementation so it is not in my best interest to get into a jousting match with you. However, if you can not see the spirit behind these \"questions\" then perhaps you should look into your own vanity that motivates you to show everyone how smart you are??\n \n \n \nHave you considered the possibility that maybe you are the one who isn't looking very hard? or that maybe, whatever you may think you've found, you are mistaken?\n\n \n Again I refer you to the spirit behind the \"questions\"\n \n \n \n \nI confess that I'm not sure \"they\" are the ones who fear that hell may awaith them....\n\n \n Perhaps you should look into that...,", 
   {}, 
   366618, 
   null, 
   1251168000.0
  ], 
  [
   366631, 
   null, 
   "Steamroller", 
   "But as long as we're using metaphors of position to describe our relationship to a creator who is beyond space and time, I believe that God resides neither above nor below but with his creation. See Matthew 1:23 for details.\n\n \n CONTEXT!!!emoticon_xbangheadxbanghead:xbanghead", 
   {}, 
   366615, 
   null, 
   1251168720.0
  ], 
  [
   366632, 
   null, 
   "Easyrider", 
   "\n \n The irony is that later, you are pointing out that God carries on with exactly what you are denying he does at this point in the story - commit atrocities against those who cross Him.\n \n So your assumption now tuns to \"well, God killed them, they must have done something wrong\". However, there isn't any evidence of this. The only thing that singles out these youths, apart from all the other sinners in the area, is that they happened to call names at the wrong guy.\n\n \n Didn't you know that all have sinned and fallen short of the Glory of God?\n \n Don't screw with God or Baldy. Don't you folks get it yet?\n \n p.s. It gets worse. Without Christ as their Lord and Savior for the remission of their sins, people are very likely going to roast with the devil for all eternity.", 
   {}, 
   366625, 
   null, 
   1251169980.0
  ], 
  [
   366647, 
   null, 
   "obvious_child", 
   "Correct. But God would always be moral and just. That is what God is.\n\n \n That is disturbing. Whatever God does is morally just. So by such reasoning, God killing millions of innocent people is just because it's God. \n \n \nI'm not going to get into an argument about whether or not God exists but all I am saying is if you believe God is good, moral, and just (and by is I mean literally is) than this is not hypocritical at all...in fact, it is just. I feel your position is always to assume God equal to or beneath you.\n\n \n How can a being be good moral and just when it commits acts that it has deemed to be evil? \n \n \nDeemed immoral for some.\n\n \n More like immoral by its own word. \n \n \nWouldn't be murder then now would it. But yes.\n\n \n And the more we talk the more the Christian God looks increasingly evil. \n \n \nI've been over this before. You can't get around how common this is and how non hypocritical it is. Parents make rules for their kids that they don't apply to themselves. Perfectly reasonable and not hypocritical. Same basic idea applies to God. If He creates morality and justice and is those things than how could God be beneath them?\n\n \n You have not in a way that makes any sense. Parents do not make rules that determine where one spends eternity. Furthermore, parents make rules that are essentially temporary. Thus why your analogy fails. You try to compare a situation that bears no resembles to what we are talking about. One does not go to Hell for disobeying a parent's rule by the parent. One does for disobeying God's rule. For God to ignore the moral guidelines for which it has set the rules around is hypocritical.", 
   {}, 
   366543, 
   null, 
   1251178620.0
  ], 
  [
   366649, 
   null, 
   "obvious_child", 
   "Why don't you atheists quit pussyfooting around. Just ask the \"dumb\" christians this one and be done with it.\n\n \n Atheists? Since when did disagreeing with messed up views on God equate to atheism? \n \n \nIf God can do anything, can he create a rock so big that He can not lift it?\n \n There..., YOU WIN!! Debate concluded.., no need to go on. emoticon_xhoho\n\n \n Incorrect. That is actually a discussion about a trait of God or quite frankly any being that has such a power. Clearly you are exceedingly ignorant of the myriad of other Gods that lack such a power.\n \n Omnipotence alone makes no sense. Attaching it to any being by association makes that being nonsensical. But God is not necessarily bound by sense. Omnipotence is a being an illogical God can have. Merely having omnipotence does not equate to God not being able to exist. \n \n And there you fail. Just as Archie and Ez do on a regular basis. \n \n \nThese people have absolutely no interest in knowing God or finding truthful answers to the preposterous questions they pose.\n\n \n This is far more of a discussion about what people believe about God rather than God itself. And as it is shown, the evanglicals here believe that mass murder is morally just if God is the one killing. \n \n \nThere comes a time to shake the dust from your feet and move to a field whose harvest awaits you.\n\n \n Learn the flaws of Pascal's Wager. You are no more saved than anyone else.", 
   {}, 
   366605, 
   null, 
   1251178800.0
  ], 
  [
   366654, 
   null, 
   "Steamroller", 
   "Atheists? Since when did disagreeing with messed up views on God equate to atheism? \n \n \n \n Incorrect. That is actually a discussion about a trait of God or quite frankly any being that has such a power. Clearly you are exceedingly ignorant of the myriad of other Gods that lack such a power.\n \n Omnipotence alone makes no sense. Attaching it to any being by association makes that being nonsensical. But God is not necessarily bound by sense. Omnipotence is a being an illogical God can have. Merely having omnipotence does not equate to God not being able to exist. \n \n And there you fail. Just as Archie and Ez do on a regular basis. \n \n \n \n This is far more of a discussion about what people believe about God rather than God itself. And as it is shown, the evanglicals here believe that mass murder is morally just if God is the one killing. \n \n \n \n Learn the flaws of Pascal's Wager. You are no more saved than anyone else.\n\n \n <YAWN< Matthew 10:39", 
   {}, 
   366649, 
   null, 
   1251179280.0
  ], 
  [
   366655, 
   null, 
   "obvious_child", 
   "<YAWN< Matthew 10:39\n\n \n Joining the XXXXX crowd I see? \n \n Not going to answer any questions eh? Or maybe you think that only one religion exists on this planet. \n \n Watch: You disagree with my religion, therefore you are an atheist. emoticon_xgood", 
   {}, 
   366654, 
   null, 
   1251179460.0
  ], 
  [
   366671, 
   null, 
   "iangb", 
   "Didn't you know that all have sinned and fallen short of the Glory of God?\n \n Don't screw with God or Baldy. Don't you folks get it yet?\n \n p.s. It gets worse. Without Christ as their Lord and Savior for the remission of their sins, people are very likely going to roast with the devil for all eternity.\nHow very moral of them both.\n \n Archangels problem remains. You have a god whose every act is considered to be 'morally just': ordering, committing and rewarding atrocities. Something doesn't match up.", 
   {}, 
   366655, 
   null, 
   1251196140.0
  ], 
  [
   366683, 
   null, 
   "Archangel", 
   "What doesn't match up is the arrogance of you atheists who think you are qualified or justified in any way to judge the Creator God of all that is, actions in any way.", 
   {}, 
   366671, 
   null, 
   1251212040.0
  ], 
  [
   366699, 
   null, 
   "Matthew", 
   "Matthew 10:13-15 (New International Version)\n 13If the home is deserving, let your peace rest on it; if it is not, let your peace return to you. 14If anyone will not welcome you or listen to your words, shake the dust off your feet when you leave that home or town. 15I tell you the truth, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town.\n\n \n Fair enough. If you feel debate is pointless, don't bother.\n \n \nYou are very eloquent in your use of words and arguementation so it is not in my best interest to get into a jousting match with you.\n\n \n Why not? You'll either come up with more rigorous ways of thinking about what you already believe, or you'll change your mind. Either way, you will be improved by the debate.\n \n \nHowever, if you can not see the spirit behind these \"questions\" then perhaps you should look into your own vanity that motivates you to show everyone how smart you are??\n\n \n -sigh-\n \n I have no doubt that some posters here have an antipathy toward religion. But of course, I think that is largely because so many religious people in this country refuse to take their questions seriously. Such religious believers attack the motives of the questioners (and of anyone who takes their questions seriously, of course -- as here). It is my contention that this thoroughly ad hominem tactic provokes the antipathy.\n \n If you choose to dismiss rather than to engage, and if you (erroneously) suggest that you're really not cut out for engagement, yet you nonetheless request that others acquiesce to your beliefs in the public arena -- well, I'm sorry but that is bound to get a strong reaction. And it's the sort of thing that has been happening in this country for decades.\n \n Instead of saying that you can't hack it with \"words and argumentation,\" why not give it a go? What are you afraid of?", 
   {}, 
   366630, 
   null, 
   1251220260.0
  ], 
  [
   366700, 
   null, 
   "iangb", 
   "What doesn't match up is the arrogance of you atheists who think you are qualified or justified in any way to judge the Creator God of all that is, actions in any way.\n\n I'm not 'judging Him'. It's your claim, your repeated judgement that 'God is perfectly moral in everything He does' - and it's that judgement which I am questioning.\n \n You've got several options. Explain how each of God's murderous actions in the Old Testament are examples of 'moral behaviour', deny that none of the examples given are historically accurate, or stop claiming that God is moral in everything He does. Something of a dilemma, I imagine.\n \n Have a go.", 
   {}, 
   366683, 
   null, 
   1251220260.0
  ], 
  [
   366701, 
   null, 
   "Matthew", 
   "CONTEXT!!!\n\n \n Not sure what you're getting at here. If you're suggesting that I've taken the passage out of context -- which would be rather hyporcritical of me, given my criticism of \"systematic theology\" -- I would respond by saying that I have included exactly the context necessary.\n \n Jesus is the one who is called \"Emmanuel,\" and \"Emmanual\" means \"God is with us.\" Not above us, out there. With us, here. The reason I referred to a single verse is that this single verse contains that definition.\n \n The life of Jesus, as depicted in each of the four Gospels, is a testament to the implications of that. But if you think I've radically misunderstood the point of \"Emmanuel,\" based on the context of the passage -- or in relation to other passages in scripture that I should've been more attentive to -- feel free to explain why. I will be more than happy to listen.\n \n (Give \"words and argumentation\" a try! :) )", 
   {}, 
   366631, 
   null, 
   1251220740.0
  ], 
  [
   366706, 
   null, 
   "Archangel", 
   "I'm not 'judging Him'. It's your claim, your repeated judgement that 'God is perfectly moral in everything He does' - and it's that judgement which I am questioning.\n \n You've got several options. Explain how each of God's murderous actions in the Old Testament are examples of 'moral behaviour', deny that none of the examples given are historically accurate, or stop claiming that God is moral in everything He does. Or, find a way out that I have yet to think of. \n \n Have a go.\n\n \n Wrong again. I needn't explain, justify or defend God in any way at all since I'm neither His apologist nor His defender in any way. God needs no defense or justification at all since He is God, after all. You continue to try to make me responsible for His actions when nothing I say or do is relevant in determining that God is a holy and perfect God. And neither do I believe that God is responsible for committing murder, genocide's or atrocities in any way so why would I continue to attempt to defend against such spurious assertions.", 
   {}, 
   366700, 
   null, 
   1251221700.0
  ], 
  [
   366707, 
   null, 
   "Steeeeve", 
   "That is disturbing. Whatever God does is morally just. So by such reasoning, God killing millions of innocent people is just because it's God. \n \n \n \n How can a being be good moral and just when it commits acts that it has deemed to be evil? \n \n \n \n More like immoral by its own word. \n \n \n \n And the more we talk the more the Christian God looks increasingly evil. \n \n \n \n You have not in a way that makes any sense. Parents do not make rules that determine where one spends eternity. Furthermore, parents make rules that are essentially temporary. Thus why your analogy fails. You try to compare a situation that bears no resembles to what we are talking about. One does not go to Hell for disobeying a parent's rule by the parent. One does for disobeying God's rule. For God to ignore the moral guidelines for which it has set the rules around is hypocritical.\nYour objections to the analogy don't kill the logic behind it. You can still set rules and not follow them yourself..that is the point.\n \n Look, you can't really convince someone about God who already assumes they are greater than God and this seems to be the case in how you are arguing here. You assume morality exists and God follows it but ultimately this means you feel God show follow what you say morality is. I'm of a different opinion.", 
   {}, 
   366647, 
   null, 
   1251221820.0
  ], 
  [
   366744, 
   null, 
   "Workman", 
   "this statement isn't logical.\n \n It does not follow that if the person who creates the laws has to therefore follow them or can't change them...or even that they apply to him. If a teacher says \"no talking in the classroom\" it doesn't apply to the teacher now does it.\n\n \n saiah 55:8-9 (New International Version)\n \n 8 \"For my thoughts are not your thoughts,\n neither are your ways my ways,\"\n declares the LORD.\n \n 9 \"As the heavens are higher than the earth,\n so are my ways higher than your ways\n and my thoughts than your thoughts.", 
   {}, 
   365950, 
   null, 
   1251230460.0
  ], 
  [
   366752, 
   null, 
   "iangb", 
   "Wrong again. I needn't explain, justify or defend God in any way at all since I'm neither His apologist nor His defender in any way. God needs no defense or justification at all since He is God, after all.\nI found this post of yours while searching on another topic. Irony incoming: \n \"If he knew and loved the Lord personally, he would defend him, PERIOD!!!\"~Archangel.\n \n \nAnd neither do I believe that God is responsible for committing murder, genocide's or atrocities in any way so why would I continue to attempt to defend against such spurious assertions.\nWell, it would certainly be unusual if you (or anyone else, come to that) were to argue against an assertion that you did believe. I was rather hoping that you would argue against it because you didn't believe it - and both wanted and was able to try and convince others that they shouldn't believe it either. However, if you are unwilling and/or unable to show that God is entirely moral in His behaviour, that's your call to make.\n \n Just to clarify here, my question is - how was God:[*]Turning Lot's wife into a pillar of salt [*]Causing bears to kill ('maim') 42 youths[*]Commanding His people to kill pregnant women and children[*]Protecting His people from the repercussions of deviously attacking and plundering a village[*]Sending the Angel of Death to kill the firstborn in every house in Egypt (new one, although I think I've mentioned it before in this thread)not examples of God acting immorally?\n \n In-post edit: Come to that, if you are going to deny that God has murdered etc at all (even where a case could be half-made that it was justified), what about Sodom, Gommorah, the Flood and countless others? You may call them justified atrocities, but they were atrocities, none the less.\n \n \nYou assume morality exists and God follows it but ultimately this means you feel God show follow what you say morality is. I'm of a different opinion.\nI think if you assume both that morality exists and that God follows it, the question then becomes - looking at the Old Testament, what examples from God can we take as good moral examples? The answer to that question clashes horribly with or perceived notions of today's morality - so either we must be wrong, God must be wrong, God is a moral relativist as civilisation changes (or, indeed, on a 'human morality vs Gods morality' level) or the Old Testament is not an accurate portrayal of God.\n \n Personally, I'd prefer a mixture of the last two of those options (as the Christian side of my agnosticism). There's an excellent Pratchett quote: \"The New Testament is basically about what happened when God found religion\".\n \n \nsaiah 55:8-9 (New International Version)\n \n 8 \"For my thoughts are not your thoughts,\n neither are your ways my ways,\"\n declares the LORD.\n \n 9 \"As the heavens are higher than the earth,\n so are my ways higher than your ways\n and my thoughts than your thoughts. \n\n True - however, the preceding verses adds a little context.\n \n 6 Seek the LORD while he may be found;\n call on him while he is near.\n \n 7 Let the wicked forsake his way\n and the evil man his thoughts.\n Let him turn to the LORD, and he will have mercy on him,\n and to our God, for he will freely pardon.\n \n Here is God saying that he will be kind to those who turn to him even if they are wicked people, because He is not wicked. It's not God saying that His ways and thoughts are different from saints, just from sinners.", 
   {}, 
   366707, 
   null, 
   1251233280.0
  ], 
  [
   366768, 
   null, 
   "Easyrider", 
   "\n \n I think if you assume both that morality exists and that God follows it, the question then becomes - looking at the Old Testament, what examples from God can we take as good moral examples? \n\n \n Whose morality are you basing God's actions on, your morality or God's? \n \n If all men have sinned and fallen short of the Glory of God, and if the wages of sin is death, as the Bible says, then no more need be said.\n \n Recommend you read Deuteronomy chapter 28 (The blessings of obedience and the curses of disobedience) to get a feel for God's sense of accountability.\n \n One other thing. It's not necessarily what you agree with that's going to determine your eternal place of abode. If this Biblical God is real, then you have to pick heaven or hell, Jesus or political correctness; life or death. That's reality. Don't blow it.", 
   {}, 
   366752, 
   null, 
   1251241620.0
  ], 
  [
   366778, 
   null, 
   "iangb", 
   "Whose morality are you basing God's actions on, your morality or God's?\nI need some clarification here, as you could have meant two different things - who's defining 'my morality' and 'Gods morality'; me or God? I'll answer them both.\n \n If you meant \"your morality or God's\" as in 'things that God considers moral for you to do, as opposed to things that God considers moral for Himself to do': this is the moral relativism which I mentioned in my previous post, where God gets one set of morals and Man gets another. I don't think that you (or Archangel) are fans of this, so I assume you meant the other possible meaning - see below. Let me know if this assumption is false, though.\n \n I suspect that you meant \"your morality or God's\" as in \"things that you personally consider moral, as opposed to things God personally considers moral\". My point based on this was that, using the Old Testament to gain a viewpoint of God's morality (by assuming that everything God does is moral), you get a massive disconnect between 'Gods morality' (that is, everything God considers to be moral) and 'my morality' (everything that I and most of the population consider to be moral). For example, God orders the killing of pregnant woman and children, and protects mass murderers from the repercussions of their actions, both of which are highly counter to 'morality' as most people today would describe it.\n \n This results in one of the conclusions as listed in my previous post. From the looks of the rest of your post, it looks like you've gone with what I put as 'we must be wrong' - that is, man's current moral standards are incorrect. However, this has repercussions...\n \n \nIf all men have sinned and fallen short of the Glory of God, and if the wages of sin is death, as the Bible says, then no more need be said.\n \n Recommend you read Deuteronomy chapter 28 (The blessings of obedience and the curses of disobedience) to get a feel for God's sense of accountability.\nThis implies that every single non-Christian who dies by whatever circumstances 'had it coming to them'. It rationalises, excuses and practically encourages suicide bombers, jihads, lynch mobs, sites like God Hates The World (looks like Fred Phelps has set his targets a little higher...) and vigilante killings against people like George Tiller - heck, vigilante killings against all non-Christians. After all, God did it - why shouldn't you be just as moral as Him?\n \n If you start to think that it is moral to kill people on Gods orders, or that people deserve death for such arbitrary reasons as mocking prophets or living in a 'sinful' country... you're starting to sound remarkably like the more violent sort of Muslim fundamentalist. \n \n I read the Deuteronomy. There were a lot of unfulfilled threats in there, considering the number of people who have broken the rules - they are set up in the previous chapter, and include \"Cursed is the man who moves his neighbor's boundary stone\", \"Cursed is the man who carves an image or casts an idol-a thing detestable to the LORD, the work of the craftsman's hands-and sets it up in secret\" and \"Cursed is the man who dishonors his father or his mother.\" \n \n The other issue with this stance is also probably the reason why the Deuteronomy curse is less present today (assuming it was real in the first place, that is). God's behaviour in the Old Testament is immoral by 'todays standards', but it is also almost directly contradicted by Jesus. No more 'eye for an eye', but more 'turn the other cheek'. No more 'live by the sword', but more 'love thy neighbour'. Forgiveness and reconciliation became the main theme - understandably, given the bigger picture - hence my quote above, \"the New Testament is basically about what happened when god found religion\".\n \n If you're looking for a God to emulate, I'd pick Jesus over his more vengeful father. However, this returns us to the problem of opposing moral values - do you forgive the sinner, or attack him with bears; and how can the bible be consistent with both?\n \n \nOne other thing. It's not necessarily what you agree with that's going to determine your eternal place of abode. If this Biblical God is real, then you have to pick heaven or hell, Jesus or political correctness; life or death. That's reality. Don't blow it.\nIndeed. However - it still isn't clear, once you do believe, of what the morals you should live your life actually are.\n \n Re-reading this looks like I've rambled a fair amount. Oh well. I hope I've said what I meant to say.", 
   {
    "unicode_changes_made": true
   }, 
   366768, 
   null, 
   1251246420.0
  ], 
  [
   366792, 
   null, 
   "Matthew", 
   "What doesn't match up is the arrogance of you atheists who think you are qualified or justified in any way to judge the Creator God of all that is, actions in any way.\n\n \n --But do keep in mind that it is not necessarily a judgement of God to criticize what another human being believes or says about God, of course.", 
   {}, 
   366683, 
   null, 
   1251252240.0
  ], 
  [
   366985, 
   null, 
   "Steamroller", 
   "Joining the XXXXX crowd I see? \n \n Not going to answer any questions eh? Or maybe you think that only one religion exists on this planet. \n \n Watch: You disagree with my religion, therefore you are an atheist. emoticon_xgood\n\n \n As a matter of fact, I do believe in One true God and His Son.\n \n John 14:6 (New International Version)\n \n 6Jesus answered, \"I am the way and the truth and the life. No one comes to the Father except through me.\n \n Jesus made the distinction between belief in Him, His Father and the Holy Spirit, and ALL other belief systems. He drew the line in the sand. With Him there is life, without Him there is not.\n \n I cannot disagree with your religion at this time because I don't know what it is. All I have seen you do is bash Christians.., which is your right.", 
   {}, 
   366655, 
   null, 
   1251373860.0
  ], 
  [
   366986, 
   null, 
   "Steamroller", 
   "Incorrect. That is actually a discussion about a trait of God or quite frankly any being that has such a power. Clearly you are exceedingly ignorant of the myriad of other Gods that lack such a power.\n \n Omnipotence alone makes no sense. Attaching it to any being by association makes that being nonsensical. But God is not necessarily bound by sense. Omnipotence is a being an illogical God can have. Merely having omnipotence does not equate to God not being able to exist. \n \n And there you fail. Just as Archie and Ez do on a regular basis.\n\n \n Were you stoned when you wrote this???\n \n \n \n \nThis is far more of a discussion about what people believe about God rather than God itself. And as it is shown, the evanglicals here believe that mass murder is morally just if God is the one killing. \n\n \n This is exactly the type of conclusion you can expect to draw as long as you continue to attempt to put God into the restaints of your own understanding and logic. The same applies to any of us mere mortals.", 
   {}, 
   366649, 
   null, 
   1251374700.0
  ], 
  [
   366991, 
   null, 
   "Steamroller", 
   "True. That's why Jesus gave up on the prostitutes and tax collectors. Er, waitaminnit....\n\n \n This was your response to my comment about casting pearls before swine...\n \n \n \nMatthew 10:13-15 (New International Version)\n 13If the home is deserving, let your peace rest on it; if it is not, let your peace return to you. 14If anyone will not welcome you or listen to your words, shake the dust off your feet when you leave that home or town. 15I tell you the truth, it will be more bearable for Sodom and Gomorrah on the day of judgment than for that town.\n\n \n This is my comment about prostitutes and tax collectors...\n \n And then your response...\n \n \nFair enough. If you feel debate is pointless, don't bother.\n\n \n Debate is not pointless when there is an audience to convince, regardless of the topic. The audience may be a judge, an onlooker, or one of the participants. If you have a \"red letter\" Bible, you will find the scripture above writte in red. In other words Jesus Himself instructed His disciples, (who would later become apostles), not to waste their time in pointless debate. Then He punctuated His statment with a curse. \n \n As I stated earlier about your use of words and your ability to argue, I don't have the time nor the patience the play word games or play with symatics. I never said Jesus \"gave up\" on anybody, nor was my comment concerning pearls, advising anyone to give up on a \"seeker\". \n \n The comment WAS, however, directed at those who continually bash Christians whether the topic is abortion, homosexuality, or Sarah Palin. There comes a time to just walk away.", 
   {}, 
   366699, 
   null, 
   1251377940.0
  ], 
  [
   366993, 
   null, 
   "Steamroller", 
   "I have no doubt that some posters here have an antipathy toward religion.\n\n \n Lets call a horse, a horse, and a dog, a dog. The other side of the isle in this thread does not have an \"antipathy toward religion\". What you call antipathy..., I call a vile disdain. And it is not directed in most cases \n just at religion, instead it is directed directly at Christianty. I suppose it's because Jesus made no bones about taking names and pointing fingers.\n \n \n \nBut of course, I think that is largely because so many religious people in this country refuse to take their questions seriously.\n\n \n There is a HUGE difference between a question, and mocking/disparaging your God. He can handle it, sometimes I cannot.\n \n \nSuch religious believers attack the motives of the questioners (and of anyone who takes their questions seriously, of course -- as here). It is my contention that this thoroughly ad hominem tactic provokes the antipathy.\n\n \n It is my contention that the attack against the person was provoked BY the antipathy, or vile disdain. The motives of the questioners are clear.., we call it discernment.", 
   {}, 
   366699, 
   null, 
   1251379440.0
  ], 
  [
   367028, 
   null, 
   "Matthew", 
   "...In other words Jesus Himself instructed His disciples, (who would later become apostles), not to waste their time in pointless debate. Then He punctuated His statment with a curse.\n\n \n Right. According to the author of Matthew, who was not an eyewitness to the life of Jesus, who wrote these words approximately fift years after Jesus' death, and who seems to have had liturgical purposes in mind as the Christian movement began to break away from Judaism and sought non-Jewish ways of understanding and expressing traditional Jewish ideas.\n \n \nAs I stated earlier about your use of words and your ability to argue, I don't have the time nor the patience the play word games or play with symatics.\n\n \n Who's playing word games or semantics? Not me. To the contrary, I'd say that so-called \"conservative Christianity\" has been playing games with the Bible for over a hundred years now.\n \n \nI never said Jesus \"gave up\" on anybody, nor was my comment concerning pearls, advising anyone to give up on a \"seeker\".\n \n The comment WAS, however, directed at those who continually bash Christians whether the topic is abortion, homosexuality, or Sarah Palin. There comes a time to just walk away.\n\n \n Criticizing conservative Christianity is not equivalent to \"bashing Christians.\" As a practicing Christian myself, I assure you that this is last thing I want.\n \n Meanwhile, since when is Sarah Palin a \"Christian\" issue?", 
   {}, 
   366991, 
   null, 
   1251396900.0
  ], 
  [
   367029, 
   null, 
   "Matthew", 
   "Lets call a horse, a horse, and a dog, a dog. The other side of the isle in this thread does not have an \"antipathy toward religion\". What you call antipathy..., I call a vile disdain.\n\n \n But why is your term any more accurate than mine? I think that all your term does is demonize the other side as \"vile.\" I don't consider that constructive.\n \n \nAnd it is not directed in most cases just at religion, instead it is directed directly at Christianty.\n\n \n Actually, I have found that when one engages atheists with respect, they tend to be much more respectful. Go figure. Come to think of it, that might be a rather human reaction, not limited to atheists....\n \n \nI suppose it's because Jesus made no bones about taking names and pointing fingers.\n\n \n Yeah, all that stuff about \"judge not\" and casting the first stone is pretty accusatory....\n \n Come on. The Bible is a complicated text. It's not always consistent. It's frequently ambiguous. Treating it as if it had some \"obvious\" meaning -- where Jesus simply \"makes no bones\" about topic X -- is a big problem I have with conservative approaches to scripture.\n \n \nThere is a HUGE difference between a question, and mocking/disparaging your God. He can handle it, sometimes I cannot.\n\n \n Well, we are called to emulate Him, are we not?...\n \n \nIt is my contention that the attack against the person was provoked BY the antipathy, or vile disdain. The motives of the questioners are clear.., we call it discernment.\n\n \n And it is my contention that somebody else's motives might explain their behavior, but cannot excuse our own. Let's accept your characterization is right and it is \"vile disdain\" for Christianity. My question is... so what? We are called to love them anyway, and we should interact with them accordingly.", 
   {}, 
   366993, 
   null, 
   1251397620.0
  ], 
  [
   367091, 
   null, 
   "Matthew", 
   "John 14:6 (New International Version)\n \n 6Jesus answered, \"I am the way and the truth and the life. No one comes to the Father except through me.\"\n \n Jesus made the distinction between belief in Him, His Father and the Holy Spirit, and ALL other belief systems. He drew the line in the sand. With Him there is life, without Him there is not.\n\n \n By the way, although this comment wasn't directed my way, I just wanted to add that the interpretation you offer here is only one interpretation of what that passage says.\n \n It has been used by \"conservative\" interpreters to claim exclusivity for Christianity, as you do here. On the other hand, more \"liberal\" interpreters construe the passage more inclusively, as indicating that those who live the moral and (broadly) religious precepts that Jesus embodied do, in fact, come to the father, whether they are professedly Christian or not. For a variety of reasons, I think the liberal interpretation is more justifiable.\n \n In any event, whatever the passage does mean, these two possibilities are instances of a couple more general points. First, in whole and in part, the Bible admits of multiple interpretations. Second, it is therefore not effective to cite scripture in order to prove a point, unless your audience already shares your basic interpretive outlook.\n \n Just something to keep in mind.", 
   {}, 
   366985, 
   null, 
   1251416820.0
  ], 
  [
   367488, 
   null, 
   "Steamroller", 
   "Second, it is therefore not effective to cite scripture in order to prove a point, unless your audience already shares your basic interpretive outlook.\n \n Just something to keep in mind.\n\n \n And this is where the rubber meets the road. You are smooth, I'll give you that. I hadn't even checked out your other posts and I was on to you.\n \n From your posts, I'm sure Adam and Eve heard words just as cunning. Of course one would have to believe that the scriptures were literal in order to believe that Sunday school tale.\n \n I do not doubt you believe Christ did as He said He did. As for being a \"Christian\" that will be between you and Him.\n \n Your posts demonstrate one of two things. \n \n a) you have no faith in God and His ability to keep His word intact just as He wanted to through time and space. And you fancy yourself superior to Him and His ability to communicate with the masses over time. Or..,\n \n b) Like the serpant you speak with a split tongue. You claim to be a \"christian\" but then toss the scriptures aside and consider them folly. You seem to be seeking those whom you may devour.\n \n I would advise you to hit your knees and seek truth.., but I get the feeling that you would prefer to rely on your own understanding.", 
   {}, 
   367091, 
   null, 
   1251600420.0
  ], 
  [
   367491, 
   null, 
   "Archangel", 
   "And this is where the rubber meets the road. You are smooth, I'll give you that. I hadn't even checked out your other posts and I was on to you.\n \n From your posts, I'm sure Adam and Eve heard words just as cunning. Of course one would have to believe that the scriptures were literal in order to believe that Sunday school tale.\n \n I do not doubt you believe Christ did as He said He did. As for being a \"Christian\" that will be between you and Him.\n \n Your posts demonstrate one of two things. \n \n a) you have no faith in God and His ability to keep His word intact just as He wanted to through time and space. And you fancy yourself superior to Him and His ability to communicate with the masses over time. Or..,\n \n b) Like the serpant you speak with a split tongue. You claim to be a \"christian\" but then toss the scriptures aside and consider them folly. You seem to be seeking those whom you may devour.\n \n I would advise you to hit your knees and seek truth.., but I get the feeling that you would prefer to rely on your own understanding.\n\n \n Good post Steamroller, you have pegged Matthew in short order. You may not be aware of this since you're new but I went through this 6 months ago with him as I called him on his constant siding with the humanists and atheists in every single debate against any and all christian principles, values and doctrines. And all the while insisting he's a believer. Weird huh? How a guy can so completely lie and deceive himself as he ignores what he is by insisting he believes one thing yet he defends the exact opposite.", 
   {}, 
   367488, 
   null, 
   1251601500.0
  ], 
  [
   367492, 
   null, 
   "Steamroller", 
   "Good post Steamroller, you have pegged Matthew in short order. You may not be aware of this since you're new but I went through this 6 months ago with him as I called him on his constant siding with the humanists and atheists in every single debate against any and all christian principles, values and doctrines. And all the while insisting he's a believer. Weird huh? How a guy can so completely lie and deceive himself as he ignores what he is by insisting he believes one thing yet he defends the exact opposite.\n\n \n I find it interesting that people like Matthew forget that when Jesus was tempted, His \"sword of truth\" were the scriptures! \n \n By discounting them, Matthew attempts to disarm. The movie, The Devinci Code did the same, no doubt with measurable success.\n \n Welp, back to the battle, Peace to You!", 
   {}, 
   367491, 
   null, 
   1251601920.0
  ], 
  [
   367496, 
   null, 
   "Archangel", 
   "I find it interesting that people like Matthew forget that when Jesus was tempted, His \"sword of truth\" were the scriptures! \n \n By discounting them, Matthew attempts to disarm. The movie, The Devinci Code did the same, no doubt with measurable success.\n \n Welp, back to the battle, Peace to You!\n\n \n You are right again, and you make an important point. When Jesus was tempted by the devil He relied solely on quoting the word in order to repel him. Here is some wisdom which the world cannot fathom, but is life to those who believe.\n 1Cr 1:18 For the word of the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God.\n 1Cr 1:19 For it is written, \"I WILL DESTROY THE WISDOM OF THE WISE, AND THE CLEVERNESS OF THE CLEVER I WILL SET ASIDE.\"\n 1Cr 1:20 Where is the wise man? Where is the scribe? Where is the debater of this age? Has not God made foolish the wisdom of the world?\n 1Cr 1:21 For since in the wisdom of God the world through its wisdom did not {come to} know God, God was well-pleased through the foolishness of the message preached to save those who believe.\n 1Cr 1:22 For indeed Jews ask for signs and Greeks search for wisdom;\n 1Cr 1:23 but we preach Christ crucified, to Jews a stumbling block and to Gentiles foolishness,\n 1Cr 1:24 but to those who are the called, both Jews and Greeks, Christ the power of God and the wisdom of God.\n 1Cr 1:25 Because the foolishness of God is wiser than men, and the weakness of God is stronger than men. ", 
   {}, 
   367492, 
   null, 
   1251603900.0
  ], 
  [
   367502, 
   null, 
   "Matthew", 
   "And this is where the rubber meets the road. You are smooth, I'll give you that. I hadn't even checked out your other posts and I was on to you.\n\n \n I'm sure you honestly believe that.\n \n \nFrom your posts, I'm sure Adam and Eve heard words just as cunning.\n\n \n And I thank you for proving exactly my point about how you're tactic is simply to demonize the opposition. Well done!\n \n \nOf course one would have to believe that the scriptures were literal in order to believe that Sunday school tale.\n\n \n Not at all. I believe that the scriptures reveal profound truths, about God, about morality, and -- what's most pertinent to the story in question -- about human nature.\n \n But one need not hold that the scriptures are literally true in order to believe this. And I don't.\n \n \nYour posts demonstrate one of two things. \n \n a) you have no faith in God and His ability to keep His word intact just as He wanted to through time and space. And you fancy yourself superior to Him and His ability to communicate with the masses over time. Or..,\n \n b) Like the serpant you speak with a split tongue. You claim to be a \"christian\" but then toss the scriptures aside and consider them folly. You seem to be seeking those whom you may devour.\n\n \n With regard to (a), I don't think it is possible for anyone who takes scripture \"literally\" to understand them. By the time you get into the second chapter of Genesis, you'd already have to affirm the manifest contradiction of God creating humanity last among the animals and creating humanity (Adam at least) first. Contradictions cannot be understood, period. Moreover, no \"literalist\" I've ever met understands diddly about the history of the scriptures themselves. Personally, I find that history utterly fascinating -- the way the books are so very much of their time, even as the authors try to express timeless truths.\n \n Moreover, I don't consider myself superior to God, so if you're going to make such a baseless accusation I'd appreciate a more specific breakdown of the charges. I do consider the Bible to be frequently unclear and ambiguous -- but that's because it's a book written by human beings, and whatever divine inspiration the authors felt, it didn't relieve them of their human fallibility.\n \n As to (b), well, there I'd like to hear how you know enough about my life off this board to make such a presumption.\n \n \nI would advise you to hit your knees and seek truth.., but I get the feeling that you would prefer to rely on your own understanding.\n\n \n And I would advise you to recognize your human finitude and fallibility, and their consequences for conduct, far more than you have in this post.", 
   {}, 
   367488, 
   null, 
   1251606840.0
  ], 
  [
   367505, 
   null, 
   "Matthew", 
   "Good post Steamroller, you have pegged Matthew in short order. You may not be aware of this since you're new but I went through this 6 months ago with him as I called him on his constant siding with the humanists and atheists in every single debate against any and all christian principles, values and doctrines. And all the while insisting he's a believer. \n\n \n I am a believer, and I don't always side with humanists and atheists. It's just that the issues I prefer to debate on these boards are the ones where I do.\n \n As to \"any and all Christian principles, values and doctrines\" -- well, I think conservative Christianity has done a bang-up job wrecking those. Consider the quote in your signature from Durant. Apply it to religion. That is my view of conservative Christianity.\n \n \nWeird huh? How a guy can so completely lie and deceive himself as he ignores what he is by insisting he believes one thing yet he defends the exact opposite.\n\n \n I hate to burst your bubble, but I am defending exactly what I believe.\n \n When you figure out how that works, then and only then will you have me \"pegged.\" You may not agree with me. But at least you'll get it.", 
   {}, 
   367491, 
   null, 
   1251607920.0
  ], 
  [
   367506, 
   null, 
   "Matthew", 
   "I find it interesting that people like Matthew forget that when Jesus was tempted, His \"sword of truth\" were the scriptures! \n \n By discounting them, Matthew attempts to disarm.\n\n \n I don't discount them at all. As I've said on multiple occasions, I believe that the scriptures express all sorts of profound truths concerning God and his relationship to humanity and the world. I just don't think one must believe they are \"literal\" in order to grasp this.\n \n Ironically, I think it is religious conservatives who discount the scriptures.", 
   {}, 
   367492, 
   null, 
   1251608700.0
  ], 
  [
   367509, 
   null, 
   "obvious_child", 
   "Were you stoned when you wrote this???\n\n \n Explain why it does not make sense. Omnipotence is an illogical trait independent of the being that has it. \n \n The trait allows whatever has it to completely cease to exist and then exist again. That makes absolutely no sense but is possible. Explain to me how that is logical. \n \n \nThis is exactly the type of conclusion you can expect to draw as long as you continue to attempt to put God into the restaints of your own understanding and logic. The same applies to any of us mere mortals.\n\n \n Some of us try to make sense out of such a being rather than blindly accept it without reason.", 
   {}, 
   366986, 
   null, 
   1251609780.0
  ], 
  [
   367510, 
   null, 
   "obvious_child", 
   "Your objections to the analogy don't kill the logic behind it. You can still set rules and not follow them yourself..that is the point.\n\n \n Which deems you a hypocrite. \n \n \nLook, you can't really convince someone about God who already assumes they are greater than God and this seems to be the case in how you are arguing here.\n\n \n I'm just saying that God should at least follow its own word. \n \n \nYou assume morality exists and God follows it but ultimately this means you feel God show follow what you say morality is. I'm of a different opinion.\n\n \n Come again? God told us not to murder. But then it goes and murders. C'mon. Can I get some consistency here?", 
   {}, 
   366707, 
   null, 
   1251609840.0
  ], 
  [
   367511, 
   null, 
   "Archangel", 
   "I am a believer, \n\n \n Sure you are. emoticon_confused emoticon_xgood emoticon_rolleyes\n \n \nand I don't always side with humanists and atheists. \n\n \n Sure you do. emoticon_xdonno\n \n \nIt's just that the issues I prefer to debate on these boards are the ones where I do.\n\n \n That's weird, since I follow Jesus and His word, I find myself disagreeing with secular humanists on every major issue discussed. Isn't it strange that you agree with them on all of the important issues? I guess you're just an open minded and tolerant believer, huh!\n \n \nAs to \"any and all Christian principles, values and doctrines\" -- well, I think conservative Christianity has done a bang-up job wrecking those. Consider the quote in your signature from Durant. Apply it to religion. That is my view of conservative Christianity.\n\n \n How consistent of you Matthew, you consider our standing up for and defending the literal and traditional values which the bible espouses to be harmful to our society. That fits right in line with your defense of all of the secular humanist principles you defend around here as you claim to be a believer. \n \n \nI hate to burst your bubble, but I am defending exactly what I believe.\n\n \n I know you are Matt. That's exactly what I said above. You may claim to be a believer but you DO in fact defend exactly what you believe which is a complete and total secular humanist world view. That's why I said you defend the exact opposite of what you claim to believe. Get it now? I'm calling you a hypocrite. \n \n \nWhen you figure out how that works, then and only then will you have me \"pegged.\" You may not agree with me. But at least you'll get it.\n\n \n Oh I've got you figured out, and apparently Steamroller pegged you for the hypocrite you are in short order also. You can't claim to love the Lord and then reject Him at every turn when dealing with true believers, and expect to con us, it just doesn't work that way Matthew.", 
   {}, 
   367505, 
   null, 
   1251609960.0
  ], 
  [
   367512, 
   null, 
   "obvious_child", 
   "Lets call a horse, a horse, and a dog, a dog. The other side of the isle in this thread does not have an \"antipathy toward religion\". What you call antipathy..., I call a vile disdain. And it is not directed in most cases just at religion, instead it is directed directly at Christianty. I suppose it's because Jesus made no bones about taking names and pointing fingers.\n\n \n Tell me, why is it then that the disdain is against interpretations like Archie's? Why it is against views that make God look incredibly evil? Why is it always in the context of someone else's interpretation? \n \n Furthermore, you ignore how we bash Muslims as well. \n \n Just because we reject your interpretation doesn't mean that we hate Christanity. Or you're a dishonest POS who thinks only your interpretation is correct.", 
   {}, 
   366993, 
   null, 
   1251610080.0
  ], 
  [
   367533, 
   null, 
   "Matthew", 
   "Sure you are.\n\n \n Gee, thanks!\n \n \nSure you do.\n\n \n On this board? Absolutely. Off it? Well, I'm curious as to how you know.\n \n \nThat's weird, since I follow Jesus and His word --\n\n \n Your loveless and contemptful treatment of those with whom you disagree on this board renders that an open question, as I see it.\n \n (Have my \"rebukes\" convinced you yet? Aren't they effective?)\n \n \n-- I find myself disagreeing with secular humanists on every major issue discussed. Isn't it strange that you agree with them on all of the important issues? I guess you're just an open minded and tolerant believer, huh!\n\n \n I don't agree with them on all the important issues. Perhaps most obviously, on the issue of whether God exists or not, I disagree with every atheist on these boards. I just don't feel like arguing the point with them here.\n \n On the other hand, when I consider the political activity of the Christian right -- economically, socially, militarily -- I worry that there's a fair amount of \"practical atheism\" at work in the contemporary church. So for what it's worth, feel free to construe what I'm doing on this very board as fighting atheism after all.\n \n \nHow consistent of you Matthew, you consider our standing up for and defending the literal and traditional values which the bible espouses to be harmful to our society.\n\n \n Which values are those, exactly? Because I will defend Christian love with my life.\n \n \nThat fits right in line with your defense of all of the secular humanist principles you defend around here as you claim to be a believer.\n\n \n Most of those principles are far broader than \"secular humanism\" and can in fact be found at work in all the world's major religions. So I really don't have a problem defending them at all.\n \n On the other hand, a great deal that is narrow and chauvinistic can also be found in all the world's major religions, as well. And I think those of us who are religious would do a lot more for religion if we devoted ourselves to cleaning up those stains instead of hopelessly trying to explain why they aren't stains in the first place, let alone elevating those stains into sacred principles.\n \n \nI know you are Matt. That's exactly what I said above. You may claim to be a believer but you DO in fact defend exactly what you believe which is a complete and total secular humanist world view.\n\n \n Please. I'm a theist. I'm just not a theocrat, as you seem to think a \"true\" Christian must be.\n \n \nThat's why I said you defend the exact opposite of what you claim to believe. Get it now? I'm calling you a hypocrite.\n\n \n Oh, yeah. I've got it. emoticon_xgood\n \n \nOh I've got you figured out, and apparently Steamroller pegged you for the hypocrite you are in short order also.\n\n \n No, you don't. Nor does he. In fact, I would say your misunderstanding of me is near total. Sadly, you don't seem even slightly interested in correcting it, preferring instead to declare me a hypocrite so you don't have to take me seriously.\n \n In the perfect prison, the prisoner thinks he's free.\n \n \nYou can't claim to love the Lord and then reject Him at every turn when dealing with true believers...\n\n \n Where does it come from, this need to think of oneself as a \"true believer?\" I think it's all part of the same primordial tribal psychology that leads this or that group to think of itself as \"chosen by God\" or \"favored by the Gods.\"\n \n Not every culture has had a religion like this, of course. But I don't think it's a coincidence that no culture has ever had a religion in which some other culture ranks higher in the celestial hierarchy than their own.\n \n \n...and expect to con us, it just doesn't work that way Matthew.\n\n \n No con involved, Arch. I have never been anything but honest on this forum. And your only reason for thinking otherwise is that I don't agree with your view of religion, whereas obviously any \"true\" believer would.", 
   {}, 
   367511, 
   null, 
   1251619080.0
  ], 
  [
   367650, 
   null, 
   "Steeeeve", 
   "Which deems you a hypocrite. \n \nNo it doesn't. This isn't hard to follow....I called you on it just man up and admit it. I gave you numerous examples and none of which are hypocritical.\n \n I can give others...For example, do you have to follow the same rules you give to your dog? \n \n \nI'm just saying that God should at least follow its own word. \nNo, you are implying you are above God.", 
   {}, 
   367510, 
   null, 
   1251695160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was God wrong when he commanded the Israelites to perform abortions?", 
  "url": "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 13147, 
  "discussion_files": [
   [
    "25562.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-print.html"
   ], 
   [
    "25563.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-9-print.html"
   ], 
   [
    "25564.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-7-print.html"
   ], 
   [
    "25565.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-5-print.html"
   ], 
   [
    "25566.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-4-print.html"
   ], 
   [
    "25567.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-6-print.html"
   ], 
   [
    "25568.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-8-print.html"
   ], 
   [
    "25569.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-3-print.html"
   ], 
   [
    "25570.html", 
    "http://www.4forums.com/political/abortion-debates/13147-god-wrong-when-he-commanded-israelites-perform-abortions-2-print.html"
   ]
  ], 
  "identifier": 13147
 }
]