[
 [
  [
   24548, 
   null, 
   "montalban", 
   "It seems a number of Christians believe also in evolution.\n \n To those of you out there who believe in both I'd like to know a few things...\n \n a) Did we evolve a soul?\n \n b) Why did Jesus come to save us? (when did the first sin happen?)", 
   {
    "post_info": {
     "post_title": "How do Christians reconcile themselves with evolution?"
    }
   }, 
   null, 
   null, 
   1070115000.0
  ], 
  [
   263763, 
   null, 
   "Archangel", 
   "It seems a number of Christians believe also in evolution.\n \n To those of you out there who believe in both I'd like to know a few things...\n \n a) Did we evolve a soul?\n \n b) Why did Jesus come to save us? (when did the first sin happen?)\n\n \n Good questions. Questions that evolution believing christians can never answer using the bible. Which means that in order to accept evo, one can not also claim to be a christian as the two belief systems don't now mesh nor will they ever.", 
   {}, 
   24548, 
   null, 
   1179548880.0
  ], 
  [
   263793, 
   null, 
   "johnhanks", 
   "Good questions..\n\n ... but three-and-a-half years after posting them, I don't think montalban is reading your answers. Why the sudden desire to resurrect dead threads?", 
   {}, 
   263763, 
   null, 
   1179566100.0
  ], 
  [
   263794, 
   null, 
   "Symbiote", 
   "I thought Christianity forbade necromancy...", 
   {}, 
   263793, 
   null, 
   1179566220.0
  ], 
  [
   263819, 
   null, 
   "Matthew S", 
   "Good questions. Questions that evolution believing christians can never answer using the bible. Which means that in order to accept evo, one can not also claim to be a christian as the two belief systems don't now mesh nor will they ever.\n\n \n That is not true you can believe in both. You can not believe in both if you believe in the literalness of the bible.", 
   {}, 
   263763, 
   null, 
   1179577740.0
  ], 
  [
   264053, 
   null, 
   "peteratwar", 
   "That is not true you can believe in both. You can not believe in both if you believe in the literalness of the bible.\n\n \n Good Heavens!! I am actually in agreement with you !!!!!", 
   {}, 
   263819, 
   null, 
   1179740100.0
  ], 
  [
   264617, 
   null, 
   "Zardoz", 
   "That is not true you can believe in both. You can not believe in both if you believe in the literalness of the bible.\n\n \n Well, why need Jesus then?\n For salvation from sin.\n \n Well, where did this sin originate?\n From Adam and Eve starting the fall of man from grace.\n \n Well, they never existed...", 
   {}, 
   263819, 
   null, 
   1180104000.0
  ], 
  [
   264647, 
   null, 
   "Jo Bennett", 
   "You don't have to believe in 6 day creationism (or even any version that lengthens the \"days\") to believe that there was a point at which humanity became human, and that with consciousness came the ability to commit sin, and early humans disobeyed God, as have all their descendants.", 
   {}, 
   264617, 
   null, 
   1180119840.0
  ], 
  [
   264905, 
   null, 
   "Jill White", 
   "You don't have to believe in 6 day creationism (or even any version that lengthens the \"days\") to believe that there was a point at which humanity became human, and that with consciousness came the ability to commit sin, and early humans disobeyed God, as have all their descendants.\n\n \n Define sin.", 
   {}, 
   264647, 
   null, 
   1180269900.0
  ], 
  [
   264913, 
   null, 
   "gman", 
   "Good questions. Questions that evolution believing christians can never answer using the bible. Which means that in order to accept evo, one can not also claim to be a christian as the two belief systems don't now mesh nor will they ever.\n\n \n Being a \"Christian\" has to do with accepting Christ as God's son. Hence the word \"Christ\"ian. \n \n Having the courage to accept the fact that the bible was written by men \"inspired\" by God, not \"dictated\" to, in fact allows common sense to help clarify the many contradictions and impracticalities. Not to mention the many translations that may have changed to even less practicality some events. The blind refusal to allow Christians to use common sense that we are blessed with, by control freaks leaves us defenseless in debate against people who are driven by common sense. Many differences are created by leadership whose goal it is to \"rule\" versus explain. They have taken the faith in God by people and turned it into a whip of slavery. They have caused good people, by their love of God to be murderers for their own agendas. To refuse to face the facts concerning the twisting of religion by manipulators leaves us incapable of standing against future tyrants who need us to be unquestioning of statements that discourage us to \"think\". Breeding a hatred of Christians that will likely never be repaired. \n This condemnation of Christians to be thinkers does not give the haters of Christianity a pass. They are guilty of blind faith as well. They refuse to see that manipulators, (people who claim belief, and are adept at control) Their actions and disregard for innocence or guilt exposing them as non-believers in a God who demands reason of us. Thus allowing them to paint with a broad brush Christians who actually care about their fellow man and love God as hate filled evil people. In essence hating people for their association versus their character.", 
   {}, 
   263763, 
   null, 
   1180277940.0
  ], 
  [
   264915, 
   null, 
   "Jo Bennett", 
   "Define sin.\n\n \n To disobey God, or to knowingly commit acts that cause suffering to others.", 
   {}, 
   264905, 
   null, 
   1180278960.0
  ], 
  [
   264917, 
   null, 
   "Jill White", 
   "To disobey God, or to knowingly commit acts that cause suffering to others.\n\n \n To disobey God?\n \n How do you know when you do this?\n \n Does god speak to you?\n \n Or do you refer to some antiquated and out dated book of myth?", 
   {}, 
   264915, 
   null, 
   1180279980.0
  ], 
  [
   264922, 
   null, 
   "Archangel", 
   "Being a \"Christian\" has to do with accepting Christ as God's son. Hence the word \"Christ\"ian. \n \n Having the courage to accept the fact that the bible was written by men \"inspired\" by God, not \"dictated\" to, in fact allows common sense to help clarify the many contradictions and impracticalities. Not to mention the many translations that may have changed to even less practicality some events. The blind refusal to allow Christians to use common sense that we are blessed with, by control freaks leaves us defenseless in debate against people who are driven by common sense. Many differences are created by leadership whose goal it is to \"rule\" versus explain. They have taken the faith in God by people and turned it into a whip of slavery. They have caused good people, by their love of God to be murderers for their own agendas. To refuse to face the facts concerning the twisting of religion by manipulators leaves us incapable of standing against future tyrants who need us to be unquestioning of statements that discourage us to \"think\". Breeding a hatred of Christians that will likely never be repaired. \n This condemnation of Christians to be thinkers does not give the haters of Christianity a pass. They are guilty of blind faith as well. They refuse to see that manipulators, (people who claim belief, and are adept at control) Their actions and disregard for innocence or guilt exposing them as non-believers in a God who demands reason of us. Thus allowing them to paint with a broad brush Christians who actually care about their fellow man and love God as hate filled evil people. In essence hating people for their association versus their character.\n\n \n I understand what you're saying gman, but what appears to be, according to our earthly and very limited perspective isn't necessarily as it is in reality. Evo is based on what appears to be, in the physical World around us. The dating of the Earth based on either erosion or sedimentary build ups actually defy our ability to determine real age accurately, yet science proposes to do just that. The alleged changes that take place in life forms that is referred to as evo, dating fossils based on different dating systems, and accurately tracing one species that allegedly evolves into another is total speculation on the part of science.\n \n Unless we know what actually took place in the beginning and how it all came to be, specifically and precisely, then all of science pertaining to the physical World is one big assumption based on what we think happened and not based on what we know happened.\n \n Just think, we have a valid theory called the Young Earth Theory that dates everything at between 6000 and 25000 years old. And an Old Earth Theory that goes back 5.4 Billion Years by some estimates. And both sides insist they are right! You must admit that in this day of scientific and technological enlightenment, we are no further along in settling this debate than we were when Darwin wrote his first book. \n \n Creation scientists read the sedimentary record of the placement of Strata as evidence of the Great Flood while evo scientists read the same evidence very differently, as evidence of an Old Earth. Obviously we can't both be right and most probably the truth lies somewhere in between what both sides believe. You must understand that I don't claim to have all the answers as this information is unknowable in my opinion, at least for now. But what I do know for certain is that evolution, abiogenisis, and the assumptions made by Geologists about the age of the Earth and biologists about macro-evolution is very wrong and unreliable. That much I do know and can not compromise on.", 
   {}, 
   264913, 
   null, 
   1180281780.0
  ], 
  [
   264967, 
   null, 
   "Winston Smith", 
   "The debate has been settled a long time ago. and also about dragons!", 
   {}, 
   264922, 
   null, 
   1180321440.0
  ], 
  [
   264973, 
   null, 
   "Archangel", 
   "The debate has been settled a long time ago. and also about dragons!\n\n \n Only in the mind of small men with no imaginations will the debate on the existence of Dragons be settled. Here are some stories of sightings right here in the Americas going back just a few centuries. Are they myths ? Are they reliable accounts by sober men ? You decide. But I believe they are reliable accounts by sober men. It is unexplainable, using common sense that so many separate and unique accounts of so called mythical sightings of Dragons could be recorded in so many diverse locations on Earth, at a time when communication was limited, and over such a large span of time. It is totally irrational to believe all of the stories are of a non existent creature. But that's just my opinion which I proudly share. \n \n http://survive2012.com/dragon_myths_3.php", 
   {}, 
   264967, 
   null, 
   1180323720.0
  ], 
  [
   265025, 
   null, 
   "Ripskar", 
   "ROFLMHO!\n Stand by for TV props posted as \"evidence\"...\n Or are you claiming that Native American mythology is true now?\n AA obviously doesn't know the first thing about the dating of the Earth/fossils etc. which is why you get the self contradictory posts, he's just too ignorant to spot the logical dead ends he walks into.\n He also fails to spot that the dragon descriptions don't describe anything like the same creature in different places or different times.", 
   {}, 
   264973, 
   null, 
   1180346940.0
  ], 
  [
   265035, 
   null, 
   "obvious_child", 
   "I understand what you're saying gman, but what appears to be, according to our earthly and very limited perspective isn't necessarily as it is in reality.\n\n \n Yeah, it's so limited that you use a huge amount of it on a daily basis and you deny that evolution happens and the Earth is a few billions years old at the same time you fill your car with gas found through geology and take drugs produced through evolutionary biology. Literal creationists are living lies. \n \n But it's just easier to put the scary man who blows holes the size of Antares in your belief system in the ignore list\n \n \nEvo is based on what appears to be, in the physical World around us.\n\n \n Well, assume God not to be a giant liar...your belief requires God to practice deception, which contradicts is benevolent and perfect nature: Again why you put me on the ignore list. I highlight your theological contradictions. \n \n \nThe dating of the Earth based on either erosion or sedimentary build ups actually defy our ability to determine real age accurately, yet science proposes to do just that.\n\n \n And like usual, you're wrong\n \n How were those pictures you ordered from Fox? You know the civil war ones with the dinosaur prop for the TV show \"Freaky Links\"? Did they cost a lot? \n \n \nThe alleged changes that take place in life forms that is referred to as evo, dating fossils based on different dating systems, and accurately tracing one species that allegedly evolves into another is total speculation on the part of science.\n\n \n http://www.icons.org.uk/theicons/collection/white-cliffs-of-dover/biography/how-they-formed\n \n Yeah, because scaling the White Cliffs of dover and seeing a vertical increase in complexity is SO hard to figure out. \n \n \"Honey, why is it as we rise the cliffs the fossils become more complex?\"\n \"I don't know honey, maybe angels did it?\n \"That's a good reason!\"\n \n Welcome to ignoran...I mean Creationist's thinking. \n \n \nUnless we know what actually took place in the beginning and how it all came to be, specifically and precisely, then all of science pertaining to the physical World is one big assumption based on what we think happened and not based on what we know happened.\n\n \n Yeah because practical applications from sciences that support evolution and evolution itself don't actually exist because they are based on a assumption that might not be true. I guess that gasoline you put in your car doesn't exist since it's found using a science that makes a assumption that can't truly be known. Then again, I can't prove I actually exist. Oh heaven what will we do? \n \n \nJust think, we have a valid theory called the Young Earth Theory that dates everything at between 6000 and 25000 years old.\n\n \n Too bad that you can't refute a single one of these arguments against that claim and entirely distracted the thread from them\n \n You say that theory is valid yet you deliberately avoid discussing its merits. Fishy no?\n \n \nAnd an Old Earth Theory that goes back 5.4 Billion Years by some estimates. And both sides insist they are right!\n\n \n And one side actually uses science. Guess which side doesn't.\n \n \nYou must admit that in this day of scientific and technological enlightenment, we are no further along in settling this debate than we were when Darwin wrote his first book.\n\n \n Only if I was the Amish who had no experience or exposure to the various products and effects of the sciences that say evolution and a old Earth is true. Now, those who claim the Earth is young and use gasoline are just hypocrites. \n \n \nCreation scientists read the sedimentary record of the placement of Strata as evidence of the Great Flood while evo scientists read the same evidence very differently, as evidence of an Old Earth.\n\n \n And Creationists who can't tell the difference between cats and nuclear reactors don't understand fluid mechanics. \n \n \nYou must understand that I don't claim to have all the answers as this information is unknowable in my opinion, at least for now.\n\n \n You claimed that before with your villager art and TV show props....\n \n \nBut what I do know for certain is that evolution, abiogenisis, and the assumptions made by Geologists about the age of the Earth and biologists about macro-evolution is very wrong and unreliable. That much I do know and can not compromise on.\n\n \n So you're going to live with the Amish eh?", 
   {}, 
   264922, 
   null, 
   1180351500.0
  ], 
  [
   265036, 
   null, 
   "obvious_child", 
   "Only in the mind of small men with no imaginations will the debate on the existence of Dragons be settled.\n\n \n Explain to me how a dragon would get off the ground and fly. The sheer necessary muscle would be more then the available mass of the organism as similar to the necessary requirements to merely RUN for a T-rex. \n \n How many several ton animals can fly on thermals? \n \n Please, if you think you understand anything in the realm of reason, explain to us how a dragon weighing several tons could fly. \n \n or does he need a jet engine strapped to his butt? \n \n hahha. You're never going to hear the end of that one.", 
   {}, 
   264973, 
   null, 
   1180351800.0
  ], 
  [
   265042, 
   null, 
   "pappillion001", 
   "Define sin.\n\n \n One way to define it that you don't come across very often and there are are a few things about this that make you say ummmm\n \n Sin \n (West Asian mythology)\n \n The moon god of Ur and first son of Enlil, the Sumerian god of earth and air. As 'lord of the calendar', his cult exhibited monotheistic tendencies, since it was Sin 'who determines the destinies of distant days' and whose 'plans no god knows'. According to Genesis, Abraham hailed from Ur by way of Harran, both cities devoted to the moon god. In Arabia, Sin was also worshipped under various titles and it is likely that Mount Sinai, first mentioned in Hebrew texts about 1000 BC, was connected with moon-worship.\n \n Other names for Sin were Suen and Nanna. Addressed in prayer as 'perfect in lordiness', Sin was associated with fertility, 'lord of the cowherders', the nether world, and kingship. A myth of Nanna's wooing of Ningal, the mother of goddess Inanna, relates how the god is repulsed until he has filled the rivers with the early flood, made the grain grow in the field, and caused fishes to be in the marshes, reeds along the banks of rivers, stags in the forest, plants in the desert, honey and wine in the orchards, cress in the garden, and long life in the palace. Only when all this bounty occurs is Ningal prepared to come and live with Nanna in his lofty dwelling on top of the ziggurat in Ur.", 
   {
    "unicode_changes_made": true
   }, 
   264905, 
   null, 
   1180355100.0
  ], 
  [
   265044, 
   null, 
   "Jill White", 
   "Only in the mind of small men with no imaginations will the debate on the existence of Dragons be settled. Here are some stories of sightings right here in the Americas going back just a few centuries. Are they myths ? Are they reliable accounts by sober men ? You decide. But I believe they are reliable accounts by sober men. It is unexplainable, using common sense that so many separate and unique accounts of so called mythical sightings of Dragons could be recorded in so many diverse locations on Earth, at a time when communication was limited, and over such a large span of time. It is totally irrational to believe all of the stories are of a non existent creature. But that's just my opinion which I proudly share. \n \n http://survive2012.com/dragon_myths_3.php\n\n This does not say anything good about your thinking.\n \n Ridiculous is the word that jumps to mind.", 
   {}, 
   264973, 
   null, 
   1180355460.0
  ], 
  [
   265047, 
   null, 
   "pappillion001", 
   "I understand what you're saying gman, but what appears to be, according to our earthly and very limited perspective isn't necessarily as it is in reality. Evo is based on what appears to be, in the physical World around us. The dating of the Earth based on either erosion or sedimentary build ups actually defy our ability to determine real age accurately, yet science proposes to do just that. The alleged changes that take place in life forms that is referred to as evo, dating fossils based on different dating systems, and accurately tracing one species that allegedly evolves into another is total speculation on the part of science.\n \n Unless we know what actually took place in the beginning and how it all came to be, specifically and precisely, then all of science pertaining to the physical World is one big assumption based on what we think happened and not based on what we know happened.\n \n Just think, we have a valid theory called the Young Earth Theory that dates everything at between 6000 and 25000 years old. And an Old Earth Theory that goes back 5.4 Billion Years by some estimates. And both sides insist they are right! You must admit that in this day of scientific and technological enlightenment, we are no further along in settling this debate than we were when Darwin wrote his first book. \n \n Creation scientists read the sedimentary record of the placement of Strata as evidence of the Great Flood while evo scientists read the same evidence very differently, as evidence of an Old Earth. Obviously we can't both be right and most probably the truth lies somewhere in between what both sides believe. You must understand that I don't claim to have all the answers as this information is unknowable in my opinion, at least for now. But what I do know for certain is that evolution, abiogenisis, and the assumptions made by Geologists about the age of the Earth and biologists about macro-evolution is very wrong and unreliable. That much I do know and can not compromise on.\n\n \n Wow that is scary. You are incorrect about the accuracy of the science used to date the earth. Carbon dating is very accurate just as the other methods used that that were in agreement carbon dating. Although you are correct that after a few million years it does start to lose some of that accuracy, but not even in the same universe as 6 - 25k. \n \n Science is based on what is beleived, that can then be repeated and that can withstand independent review. Christians (by the way his last name was not Christ, you would believe him to be The Christ) have faith, theirs is a science of belief. I have never heard one referred to as being of the Christian fact or having facts in religion. I do hear Christian Faith and religious belief.\n \n Why could you not believe science to be at least more accurate if not just plain right? Would that shake your belief structure a little to much? Is insisting to remain ignorant your interpretation of what God desires for mankind? You do God no justice by doing so. Believing to know without question the will of God and in what way that will is carried out is well you know, your smarter than your giving yourself credit for. Accepting valid science does not mean rejecting God. \n \n But I can see where you are coming from, everybody is a little disappointed when someone tells you how the rabbit was pulled out of the hat. Praise the magician who wowed you into logical reasoning to discover how smart he was to come up with a trick like that. \n \n What if at some point you found out God couldn't do half of what you thought he could, but by the time you found out he had gotten you to where you needed to be?", 
   {}, 
   264922, 
   null, 
   1180357620.0
  ], 
  [
   265128, 
   null, 
   "obvious_child", 
   "This does not say anything good about your thinking.\n \n Ridiculous is the word that jumps to mind.\n\n \n I'm glad you are joining the club of reason Jill. \n \n Perhaps Arch believes that Dragons had jet engines built into their behinds, after all he questioned how planes flew if they didn't flap their wings.", 
   {}, 
   265044, 
   null, 
   1180385220.0
  ], 
  [
   265159, 
   null, 
   "Archangel", 
   "Wow that is scary. You are incorrect about the accuracy of the science used to date the earth. Carbon dating is very accurate just as the other methods used that that were in agreement carbon dating. Although you are correct that after a few million years it does start to lose some of that accuracy, but not even in the same universe as 6 - 25k.\n\n \n Carbon dating is said to be accurate going back only around 50,000 years. And though Argon Dating is said to be more accurate for a much longer time period, there are so many ways to misinterpret the results we are guessing anyway, first with the presumptions made with the items tested, then with the results derived from the faulty readings. My point is, we know nothing for certain if the assumptions we start with are wrong. \n \n \nScience is based on what is beleived,\n \n \n Exactly, I'm surprised you would admit it.\n \n \nthat can then be repeated and that can withstand independent review.\n\n \n But if the repeated tests just confirm the same errors or misinterpretations of the results, all of the independent reviews in the World wont make a difference.\n \n \nChristians (by the way his last name was not Christ,\n \n \n Duh... He was Jesus, the Christ, otherwise known as Messiah.\n \n \nyou would believe him to be The Christ) have faith, theirs is a science of belief. I have never heard one referred to as being of the Christian fact or having facts in religion. I do hear Christian Faith and religious belief.\n\n \n I realize this is where I leave you in the dust with my explanation. But my evidence of Christ's reality is from personally meeting Him within my heart and soul. His presence in my life is more real than most people I meet. \n \n \nWhy could you not believe science to be at least more accurate if not just plain right? Would that shake your belief structure a little to much?\n \n If we truly understood the foundation upon which all scientific assumptions and presumptions are made, then I would have more faith in it. But I understand all too well how limited and flawed your human perspective is. I understand that mans need to answer unknowable questions while ignoring our spiritual roots makes evo the only reasonable avenue for answers. But that doesn't make those answers the right ones. And NO, nothing can shake my belief structure at all.\n \n \nIs insisting to remain ignorant your interpretation of what God desires for mankind? You do God no justice by doing so. Believing to know without question the will of God and in what way that will is carried out is well you know, your smarter than your giving yourself credit for. Accepting valid science does not mean rejecting God.\n\n \n True enough. Accepting valid science does not mean rejecting God at all. Not in any way. If science answered these questions for us with actual supportable documentable evidence that didn't change every month, then i would gladly embrace them with great enthusiasm and joy. But i wont accept or believe a lie just to please men of little or no faith. \n \n \nWhat if at some point you found out God couldn't do half of what you thought he could, but by the time you found out he had gotten you to where you needed to be?\n\n \n The only cold hard reality anyone will eventually find out around here is when you learn that God can do anything He wills to be accomplished. And that he is the God of all that is. I truly hope for your sake that by then, He has gotten you where you need to be. emoticon_xangel", 
   {}, 
   265047, 
   null, 
   1180391340.0
  ], 
  [
   265161, 
   null, 
   "Jill White", 
   "Accepting valid science does not mean rejecting God at all. Not in any way.\n\n I don't think anyone has a problem with people believing in god it's the bible that is the problem.", 
   {
    "unicode_changes_made": true
   }, 
   265159, 
   null, 
   1180392840.0
  ], 
  [
   265169, 
   null, 
   "Archangel", 
   "I don't think anyone has a problem with people believing in god it's the bible that is the problem.\n\n \n The bible is Gods Word Jill. It teaches us His character, His will, His plan for the World and every other aspect of His interactions with Humanity. His bible is also a supernatural book in that those who possess His Holy Spirit understand it easily where as to those who don't, it's a book of gibberish. So I understand your problems with it, but to me it's, well, an open book. emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   265161, 
   null, 
   1180399380.0
  ], 
  [
   265179, 
   null, 
   "GiantOreo", 
   "The bible is Gods Word Jill. It teaches us His character, His will, His plan for the World and every other aspect of His interactions with Humanity. His bible is also a supernatural book in that those who possess His Holy Spirit understand it easily where as to those who don't, it's a book of gibberish. So I understand your problems with it, but to me it's, well, an open book. emoticon_xangel\n\n \n Yes, \"God\" certainly teachis us his character - something which I think Dawkins says best: \"The God of the Old Testament is arguably the most unpleasant character in all fiction: jealous and proud of it; a petty, unjust, unforgiving control-freak; a vindictive, bloodthirsty ethnic cleanser; a misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully.\"", 
   {}, 
   265169, 
   null, 
   1180401300.0
  ], 
  [
   265184, 
   null, 
   "Archangel", 
   "Yes, \"God\" certainly teachis us his character - something which I think Dawkins says best: \"The God of the Old Testament is arguably the most unpleasant character in all fiction: jealous and proud of it; a petty, unjust, unforgiving control-freak; a vindictive, bloodthirsty ethnic cleanser; a misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully.\"\n\n \n You are right in that you have described quite accurately the god of this World who is called satan. But I feel so sorry for you that this is how you envision the God of Abraham, Isaac and jacob, who is the God of the Patriarchs of Israel and King David who were the forbearers of Jesus Christ the Messiah who died for your sins. Love was His motivation for making such a sacrifice, and nothing more than His desire to know and fellowship with you whom He made in His image was His agenda. How sad that you can't see that.", 
   {}, 
   265179, 
   null, 
   1180404060.0
  ], 
  [
   265194, 
   null, 
   "Jill White", 
   "I'm glad you are joining the club of reason Jill.\n\n \n Would you worry if I were on their side?", 
   {}, 
   265128, 
   null, 
   1180408260.0
  ], 
  [
   265195, 
   null, 
   "Jill White", 
   "You are right in that you have described quite accurately the god of this World who is called satan. But I feel so sorry for you that this is how you envision the God of Abraham, Isaac and jacob, who is the God of the Patriarchs of Israel and King David who were the forbearers of Jesus Christ the Messiah who died for your sins. Love was His motivation for making such a sacrifice, and nothing more than His desire to know and fellowship with you whom He made in His image was His agenda. How sad that you can't see that.\n\n The only place that I see satan is in the religious for it was the religious who invented satan after all.", 
   {}, 
   265184, 
   null, 
   1180408440.0
  ], 
  [
   265208, 
   null, 
   "obvious_child", 
   "Would you worry if I were on their side?\n\n \n A bit. You seemed like a rational person with a education. It would worry me that someone like you would go to the side of irrationality, ignorance and a general distrust and hostility towards education.\n \n Arch has me on ignore because it's easier for him to pretend that I and the Antares sized holes I've punched in his theological framework simply don't exist. \n \n A ever increasing number of people are joining his ignore list the more he gets around here.", 
   {}, 
   265194, 
   null, 
   1180414920.0
  ], 
  [
   265212, 
   null, 
   "obvious_child", 
   "Carbon dating is said to be accurate going back only around 50,000 years. And though Argon Dating is said to be more accurate for a much longer time period, there are so many ways to misinterpret the results we are guessing anyway, first with the presumptions made with the items tested, then with the results derived from the faulty readings. My point is, we know nothing for certain if the assumptions we start with are wrong.\n\n \n Except with you, you assume everything you don't like is false. Furthermore, you refuse to deal with the contradictions in your belief systems. You fill your car with gasoline no? That gasoline was found through dating specific rocks to determine the likely hood of finding oil. The same method for dating the Age of the Earth. Yet you stand here saying it's all false because it contradicts your belief system yet you use the practical applications of it. \n \n You live a lie, and it is simply easier to pretend your framework isn't swiss cheese then it is to examine how problematic it truly is\n \n Creationism at work: deny everything that makes you think.\n \n \nExactly, I'm surprised you would admit it.\n\n \n Isn't it obvious? Why bother researching something if one doesn't believe in it or at least its corollaries? Furthermore, your belief is different in that yours is faith. Science is actual evidence. \n \n \nBut if the repeated tests just confirm the same errors or misinterpretations of the results, all of the independent reviews in the World wont make a difference.\n\n \n Hence why one has to examine the source. You cited Answers in Genesis before who have a long record of using heterogeneous samples as proof of why dating doesn't work. Too bad they deliberatively omit that they used such samples. Repeated tests on a sample know to break the model just proves that certain dating doesn't work on certain samples, aka samples that are made of various different era materials. Dishonesty is a creationists' best friend. \n \n \nI realize this is where I leave you in the dust with my explanation. But my evidence of Christ's reality is from personally meeting Him within my heart and soul. His presence in my life is more real than most people I meet. \n\n \n Normal people consider that a mental disorder. Furthermore, you cannot prove your 'meeting' was indeed a act of God more so then a series of chemical reactions. Even worse, Osama Bin Laden says the same of his rational as to kill Americans. Who's right? Or are you both delusional? I'm going with the least complicated answer: you're both hearing things and need to be committed. \n \n \nIf we truly understood the foundation upon which all scientific assumptions and presumptions are made, then I would have more faith in it.\n\n \n This is why you have been utterly annihilated in every science thread you entered in to. Science is not founded on faith. We have no faith that something will come out one way. We may predict it, but we are doing so on the basis of history as well as known chemical interactions. There is no faith there. We aren't praying that the solution will turn yellow instead of blue. And these so called assumptions are hardly what you make them out to be as they are foundation of practical products you use every day yet somehow can't connect the two.\n \n You deny evolution yet accept the drugs it helps produce. You claim geology is true, yet deny the methods that prove the Earth is billions of years old as you fill you car with gasoline found with those methods. You live a lie and everything and everyone can see it. \n \n \nBut that doesn't make those answers the right ones. And NO, nothing can shake my belief structure at all.\n\n \n That is obvious as you accepted known frauds as proof of creation. How did those Fox's tv props turn out for you? How about the villagers and their comic book art? You have absolutely no credibility here whatsoever. \n \n \nTrue enough. Accepting valid science does not mean rejecting God at all. Not in any way. If science answered these questions for us with actual supportable documentable evidence that didn't change every month, then i would gladly embrace them with great enthusiasm and joy.\n\n \n Pray tell can you provide a single piece of evidence that shows science has reversed itself in the past month? \n \n This is exactly the kind of lies that creationist propagate. Sure there is no evidence every day but it only strengthens the current theory. Refinement is not the same as abandonment. \n \n \nBut i wont accept or believe a lie just to please men of little or no faith.\n\n \n Except you already do every time you turn the light switch on and your belief requires God to be a liar. \n \n \nThe only cold hard reality anyone will eventually find out around here is when you learn that God can do anything He wills to be accomplished. And that he is the God of all that is. I truly hope for your sake that by then, He has gotten you where you need to be. emoticon_xangel\n\n \n And this is what Literal Creationism boils down to threats about eternal punishments.\n \n Pathetic.", 
   {}, 
   265159, 
   null, 
   1180415760.0
  ], 
  [
   265226, 
   null, 
   "pappillion001", 
   "Carbon dating is said to be accurate going back only around 50,000 years. And though Argon Dating is said to be more accurate for a much longer time period, there are so many ways to misinterpret the results we are guessing anyway, first with the presumptions made with the items tested, then with the results derived from the faulty readings. My point is, we know nothing for certain if the assumptions we start with are wrong. \n \n Just to get along with this I will say sure why not. Even though the science has been proven succesfully numerous times by numerous people on numerous objects under numerous conditions. The last half of your statement though would be accurate when stated about religion as well as science. The significant difference is science accepts what the facts show to true regardless of the answer or if the answer has yet to be discovered they say as much as can be supported by fact. Religion has the answer already and then determines what evidence will support their position. If their is no evidence to support their position then it becomes a matter of faith, or the unknown mind of God. \n Exactly, I'm surprised you would admit it.\n \n This is probably the most pathetic statement I have come across. Why don't you cut and past individual words from my posts, then put them together to say whatever you want and then you can say but they are your words. \n \n But if the repeated tests just confirm the same errors or misinterpretations of the results, all of the independent reviews in the World wont make a difference.\n \n Seems perfectly acceptable to Christians. Again science isn't in the business of rubber stamping the validity of tradition. Science is sometimes wrong, but they discover that because they continue to test and validate everything from the most accepted to the most obscure. The ability and methods are constantly improving, giving science the ability to grow and learn a little more each time. Religion can only stagnate. Any insight or discovery must conform the established position. If it does not it is rejected, disregarded or hidden. The worst is when Christians simply make it up and and then pass it off as legitimate.\n \n Duh... He was Jesus, the Christ, otherwise known as Messiah.\n \n Right back at you big guy. Read your posts other than above where else do you refer to Jesus and the Christ as two distinct names for the same person as opposed to one name. What I think is crazy is how many Christians don't know that. \n \n \n I realize this is where I leave you in the dust with my explanation. But my evidence of Christ's reality is from personally meeting Him within my heart and soul. His presence in my life is more real than most people I meet. \n \n I think you should work on your realization skills. Having one or more moments, however long or often, only provides answers to you. It does not prove or disprove the existance or validity of God or the Christian faith, except to you and people willing to stop looking for alternative explainations. You have just confirmed what I have always thought was true. When asked why can't Christians accept anything different, my response would always be because it's all they have. Their lives would fall apart without that belief that there was someone who was there for them, who was looking out for them, who cared about them, who was proud of them and so on and so on. Without stating one way or the other about the existance of God, what do you suppose your life would be like without God? So of course anything that may try to take that away from you you going to fight, just as you are, even against overwhelming evidence, just as you are. \n \n If we truly understood the foundation upon which all scientific assumptions and presumptions are made, then I would have more faith in it. But I understand all too well how limited and flawed your human perspective is. I understand that mans need to answer unknowable questions while ignoring our spiritual roots makes evo the only reasonable avenue for answers. But that doesn't make those answers the right ones. And NO, nothing can shake my belief structure at all.\n \n Again apply your statement to religion and then compare to science. And again you prove my point. As long as you are unwilling accept the truth (not saying that that truth is there is no God) then your stuck. I think the smart religious people are the ones who are out there bring religion and science together or approach their religion from a scientific point of view. They listened to thier mother when she said because is not an answer.\n \n True enough. Accepting valid science does not mean rejecting God at all. Not in any way. If science answered these questions for us with actual supportable documentable evidence that didn't change every month, then i would gladly embrace them with great enthusiasm and joy. But i wont accept or believe a lie just to please men of little or no faith. \n \n But you will for men of faith. Funny how the evidence you will accept for your position is word of mouth, circumstantial, because we always do it that way, but there isn't any evidence possible that you will accept that is contrary to what you think is real. \n \n The only cold hard reality anyone will eventually find out around here is when you learn that God can do anything He wills to be accomplished. And that he is the God of all that is. I truly hope for your sake that by then, He has gotten you where you need to be. emoticon_xangel\n\n \n You could have at least tried to answer the question, but we already know why you didn't.", 
   {}, 
   265159, 
   null, 
   1180438440.0
  ], 
  [
   265353, 
   null, 
   "Winston Smith", 
   "archangel is right in calling himself an unworthy servant. For he has given religion a bad name.\n \n and why does he calls himself an archangel? Did jesus appointed him one?\n \n Archangel is one of those persons so afraid of dying that he clutches to his beliefs like a drowning man to a lifesaver. Pathetic really.", 
   {}, 
   265226, 
   null, 
   1180488720.0
  ], 
  [
   265363, 
   null, 
   "Archangel", 
   "archangel is right in calling himself an unworthy servant. For he has given religion a bad name.\n\n \n What have I said that offended you Winston ? Is the truth so offensive to you ?\n \n \nand why does he calls himself an archangel? Did jesus appointed him one?\n\n \n Archangel is an internet handle winston, it isn't my real name. I thought that was obvious. My real name is ALI dontya know :) . Now, Angels are a created species of supernatural beings created to serve God and Man. They are servants with no free will so being human, I mortal to their immortal. But thanks for thinking I'm more than human, but I'm not.\n \n \nArchangel is one of those persons so afraid of dying that he clutches to his beliefs like a drowning man to a lifesaver. Pathetic really.\n\n \n Now why would you interpret my confidence in Christ as clutching to beliefs like a drowning man winston ? Do I really come off as afraid of life or anything to you ? Are my values motivated by fear or do I freely and openly share what God has done for me ? Wouldn't one who is acting from fear also be afraid to share his beliefs for fear of them being disproved ? But as I've said, no man can disprove the personal experiences I have had with my Heavenly Father and Savior. His Holy Spirit dwells within me and i am His as He is mine. We are one winston. Read my siggy again as it says it best and very concisely.", 
   {}, 
   265353, 
   null, 
   1180494300.0
  ], 
  [
   265414, 
   null, 
   "Jill White", 
   "Is the truth so offensive to you ?\n\n \n How is it that the religious have the truth but no facts?", 
   {}, 
   265363, 
   null, 
   1180532940.0
  ], 
  [
   265539, 
   null, 
   "obvious_child", 
   "How is it that the religious have the truth but no facts?\n\n \n Or that science has plenty of fact but no truth?", 
   {}, 
   265414, 
   null, 
   1180562580.0
  ], 
  [
   265572, 
   null, 
   "gaetano", 
   "[QUOTE=Archangel;265363] Is the truth so offensive to you ?\n \n \n \n \n \n Gaetano:\n The truth is not offensive, but what is offensive is your bold assumption that you know what it is. Your \"truth\" is a belief, and while that belief may be your reality it is not your place to insist that it is a reality for others as well. It is a complete and utter lack of respect for your fellow human beings who happen to hold beliefs that are different from yours. As beauty is in the eye of the beholder, so truth is in the mind of those who believe they have found it. When you become secure with your belief, the need to denounce and/or belittle the beliefs of others should subside.", 
   {}, 
   265363, 
   null, 
   1180571400.0
  ], 
  [
   265643, 
   null, 
   "peteratwar", 
   "[QUOTE=gaetano;265572]\n Is the truth so offensive to you ?\n \n \n \n \n \n Gaetano:\n The truth is not offensive, but what is offensive is your bold assumption that you know what it is. Your \"truth\" is a belief, and while that belief may be your reality it is not your place to insist that it is a reality for others as well. It is a complete and utter lack of respect for your fellow human beings who happen to hold beliefs that are different from yours. As beauty is in the eye of the beholder, so truth is in the mind of those who believe they have found it. When you become secure with your belief, the need to denounce and/or belittle the beliefs of others should subside.\n\n \n \n Very fair remarks BUT having seen many threads I don't think they apply only to Archangel. There are many more on this forum to whom they could also apply.", 
   {}, 
   265572, 
   null, 
   1180603200.0
  ], 
  [
   265743, 
   null, 
   "obvious_child", 
   "[QUOTE=peteratwar;265643]\n\n \n Very fair remarks BUT having seen many threads I don't think they apply only to Archangel. There are many more on this forum to whom they could also apply.\n\n \n Perhaps, but many of their 'truths' are based upon testable evidence and not reliant upon what amounts to \"I say so, disagree and you'll pay\" arguments that Arch building everything he says on. Show these people evidence that proves their beliefs to be wrong and you'll see them change. Furthermore, they don't around saying their beliefs are the absolute truth. There's a considerable difference there that must be acknowledged.", 
   {}, 
   265643, 
   null, 
   1180645920.0
  ], 
  [
   265851, 
   null, 
   "peteratwar", 
   "Beliefs especially religious beliefs or atheistic beliefs etc aren't by their nature testable. Each has their vigorous adherents 'I'm right and you are wrong'.\n \n Even scientific debate has different interpretations generating equally entrenched ideas.\n \n Bu I agree it is nice when you see the occasional gem of acceptance.", 
   {}, 
   265743, 
   null, 
   1180701720.0
  ], 
  [
   265898, 
   null, 
   "obvious_child", 
   "Beliefs especially religious beliefs or atheistic beliefs etc aren't by their nature testable. Each has their vigorous adherents 'I'm right and you are wrong'.\n\n \n It's just a pity that these people can't see that they haven't moved past the 3rd grade \"I'm right because I say so!\"\n \n \nEven scientific debate has different interpretations generating equally entrenched ideas.\n\n \n True, but these are based upon differing outcomes of a set of peer reviewed experiments. Actual data, procedure etc is used. That does not exist with the religious \"agree or burn\" attitude. If scientists disagree, they go back to the lab and run tests, not threaten eternal damnation as Arch has done repeatively.", 
   {}, 
   265851, 
   null, 
   1180718940.0
  ], 
  [
   265909, 
   null, 
   "Jill White", 
   "You know when it comes right down to it everything is faith.\n \n We all could be trapped away from reality in some Cartesian way.\n \n Science, the popular media, Satan or whoever could be manipulating us into believing things that are not true.\n \n Information could be in accurate or not fully understood and when it comes right down to it none of us really really know the truth. \n \n I guess the difference is that if I have to buy a car I would rather buy it from a guy who is not wearing a plaid suit.", 
   {}, 
   265898, 
   null, 
   1180721040.0
  ], 
  [
   265947, 
   null, 
   "obvious_child", 
   "You know when it comes right down to it everything is faith.\n\n \n Depends what you mean by faith.\n \n Faith that some eye in the sky is watching out for you and if you do his little dance you go to Heaven or Faith that the sun will rise tomorrow and that my extremely reliable coworker will get that damn report done in time for the 8 am meeting on thursday? Which faith are you talking about? \n \n \nScience, the popular media, Satan or whoever could be manipulating us into believing things that are not true.\n\n \n Has the thought ever crossed your mind that we could be in fact worshiping Satan? That the greatest deceiver managed to trick everyone into believing they were worshiping God when they actually worship him and our moral system is completely opposite of what God actually wants? Creepy thought isn't it?", 
   {}, 
   265909, 
   null, 
   1180730220.0
  ], 
  [
   266014, 
   null, 
   "Archangel", 
   "I'm right because God says so. And my relationship with Him may not be provable to you, but it has been confirmed for me and within me too many times to count. God is not a scientific experiment that can be proven in a lab, and neither will He perform for the vanity of faithless people who insist that unless He puts on a show for them, they are too smart to believe in him. But neither will He be mocked. Of this you can be sure.", 
   {}, 
   265947, 
   null, 
   1180747620.0
  ], 
  [
   266015, 
   null, 
   "GiantOreo", 
   "I'm right because God says so. And my relationship with Him may not be provable to you, but it has been confirmed for me and within me too many times to count. God is not a scientific experiment that can be proven in a lab, and neither will He perform for the vanity of faithless people who insist that unless He puts on a show for them, they are too smart to believe in him. But neither will He be mocked. Of this you can be sure.\n\n \n And god said ths directly to you, right? Or is it the old tired argument that the Bible is God's Word (and therefor what he says), and the reason you know it is his word is because it says so. Circular arguments just don't work, Archie.", 
   {}, 
   266014, 
   null, 
   1180747800.0
  ], 
  [
   266022, 
   null, 
   "obvious_child", 
   "I'm right because God says so.\n\n \n My God says you're wrong. Prove me wrong.\n \n Your debate skills are so lacking. No one who had any real understanding would rely upon arguments you do. \n \n And my relationship with Him may not be provable to you, but it has been confirmed for me and within me too many times to count. God is not a scientific experiment that can be proven in a lab, and neither will He perform for the vanity of faithless people who insist that unless He puts on a show for them, they are too smart to believe in him. But neither will He be mocked. Of this you can be sure.\n \n BAM Didn't need to change a single word to turn it right at you.", 
   {}, 
   266014, 
   null, 
   1180748400.0
  ], 
  [
   266032, 
   null, 
   "ShadowPikachu", 
   "It seems a number of Christians believe also in evolution.\n \n To those of you out there who believe in both I'd like to know a few things...\n \n a) Did we evolve a soul?\n \n b) Why did Jesus come to save us? (when did the first sin happen?)\n\n \n Well, I'm a Christian who believes that evolution is a fact.\n \n a) my personal view is that all sentient beings have souls, and that souls are intricately linked with mental awareness/cognisance (Dolphins, monkeys, apes, octopuses, parrots, etc.). So, I'd say yes we evolved it (I think god \"attaches\" it to us when our minds develop), and it occured with the dawn of sentience.\n \n b) The \"first sin\" is something that has always existed ever since death existed. I don't view it as a particular event (Adam and Eve myth is a sort of metaphor or way of talking about it). Jesus came to take that sin away, allowing us to overcome death in eternity.", 
   {}, 
   24548, 
   null, 
   1180749300.0
  ], 
  [
   266054, 
   null, 
   "Shooterandproud", 
   "Good questions. Questions that evolution believing christians can never answer using the bible. Which means that in order to accept evo, one can not also claim to be a christian as the two belief systems don't now mesh nor will they ever.\n\n \n What about God creating evolution?", 
   {}, 
   263763, 
   null, 
   1180754820.0
  ], 
  [
   266475, 
   null, 
   "obvious_child", 
   "How do literal creationists reconcile their lives with reality? After all, if their beliefs were indeed true, this wouldn't wouldn't exist as we see it today.", 
   {}, 
   266054, 
   null, 
   1180921620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  How do Christians reconcile themselves with evolution?", 
  "url": "http://www.4forums.com/political/religion-debates/1315-how-do-christians-reconcile-themselves-evolution.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1315, 
  "discussion_files": [
   [
    "17162.html", 
    "http://www.4forums.com/political/religion-debates/1315-how-do-christians-reconcile-themselves-evolution-print.html"
   ], 
   [
    "17163.html", 
    "http://www.4forums.com/political/religion-debates/1315-how-do-christians-reconcile-themselves-evolution-4-print.html"
   ], 
   [
    "17164.html", 
    "http://www.4forums.com/political/religion-debates/1315-how-do-christians-reconcile-themselves-evolution-3-print.html"
   ], 
   [
    "17165.html", 
    "http://www.4forums.com/political/religion-debates/1315-how-do-christians-reconcile-themselves-evolution-2-print.html"
   ]
  ], 
  "identifier": 1315
 }
]