[
 [
  [
   367189, 
   null, 
   "Mosheh Thezion", 
   "from my exploritory campaign website.... Mosheh Thezion's Exploratory Committee for U.S. Senate (R) | EDUCATION\n \n -------------------\n \n \n Education : If you go and ask a Junior and or High school teacher, what is their job, really, if they are honest they will tell you, that their job, literally, IS TO TEACH THE STUDENTS WHAT IS IN THE BOOKS, because it is a fact, that most American students, WONT READ THE BOOKS, and the teachers job is to make up for the students laziness, and teach what is in the books, and to drum it in, over and over again, because often, even if the students read the books, they generally do not use proper study methods, and SO, do NOT retain the information. \n (not reading + a lack of study skills = a need for a teacher!)\n \n \n \n Proposed solutions for Education : \n \n a) Since it a fact that most students, dont read the books, and do not employ proper study technics, the main solution to our failing school system nation wide, is to fundamentally change the goals and efforts of the schools, to teach one thing above all else, which is to teach the ability to self teach, in other words, teach the students to teach themselves, via reading, note taking, and proper study technics so as to actually retain the knowledge.\n \n Our modern school system, is literally training students to believe that if they ever want to learn something, that they MUST be taught it, directly by someone else, when in fact they need only have the will to acquire the books, and read and study them properly, so as to gain the knowledge quickly in short order, and then to apply that knowledge so as to gain applicable skills in using it. As such, the teachers job, should be only to lead those application efforts, run testing, answer questions, and to help students who are having difficulty grasping what can often be a badly written book. \n \n \n \n \n b) The brain, and its function and operation as memory is well established in the sciences, which is to say... We as humans, each day we see and experience many thousands of things and details, 99% of which are not worth remembering, and are easily forgotten, but it is those things and details, which for whatever reason, WE remember several times a day, and several times in a week, that causes the info we placed into the center brain (short term memory), to be moved into the larger outer brain (long term memory). Such that ONLY if an image or idea is re-examined several times a day, and then recalled and re-examined the next day, and the next, then and only then does the brain recognizes this detail, image,or idea, as being worth storage in the long term memory, and then it does so, automatically, simply because that information was re-examined and refreshed an adequate number of times during a day or week.\n \n That is how the brain function of memory works, and has little to do with a childs intellegence, and has everything to do with the study technic the child uses in attempting to retain information. Such that reading a book once, DOES NOT WORK, in fact reading in itself will not allow for the storage of the information for longer than a week, which is why our students in America are suffering so badly, and our schools are failing left and right.\n \n \n I would put forward a Bill or Amendment, demanding that our school systems nation wide change fundamentally their methods and teaching effort, such that it should be made mandatory that the focus from early elementary school, be the teaching of students to make as an unforgettable habit, the use of a proper study technic, and that technic is as follows.\n \n \n \n \n 1) You must be willing to read. And do so.\n \n \n \n \n 2) As you read each paragraph of text, you take notes, in a notebook, and you write down in summary form, every detail from that paragraph which is worth remembering, such as names, dates, reasons, and details. Then you read the next paragraph and do the same, adding more notes. (note the stuff you want to remember.)\n \n (And use different note books, for different subjects and books)\n \n \n \n \n 3) With each day, before you read more of the same book, you go over your old notes, and re-examine each detail you choose to record, and you ask yourself, if you remember this? What it means? Why you wrote it down? And if you understand it? And if you don't, then you go back through the book, and refresh the data. THEN, and only then, do you continue to read more, and add more notes to your note book. (Daily refreshing)\n \n \n \n \n 4) With each passing day, you re-read your notes, and do self testing to question your retention of the information, and you question your understanding of it, and what those notes mean, and you continue to do this, each day until, your note book, is literally a summary of all the valuable and worthwhile information in any given book.\n \n \n \n \n 5) Then by re-examining those notes, daily, and weekly, you force the brain to literally record ALL that information as being very important, and worth long term storage, and it happens automatically. And the more you re-examine your old notes, monthly, and yearly, the greater the level of retention and the easier it is to recall that information when needed.\n \n \n \n \n This method works, and it is what is missing in our nations schools, and if applied and demanded of our students, we can be sure our students could be the best and brightest on earth, by applying proper study methods which make the effort of retention simple and natural and literally an automatic function, instead of a difficult task..\n \n \n \n \n The only difference between genius children, and normal kids, is how many times they must refresh the information before it becomes a long term memory.\n \n \n \n \n Some will argue, that this is not practical, and that most students simply will not do so, but last time I checked, students were not in charge of the schools. And it behooves the school system to, at an early age, make this method a daily practice, by running each class in this way, where during the first half of class, students are required to read and take notes, and then during the second half, they are required to discuss and compare their notes, and ask questions of the teacher based on these notes, everyday, year after year, such that by High School, the students will not be allowed to avoid these methods, and they will instead be empowered to progress over time, such that by the time they graduate High school, they should be completely free of the need for a teacher, and be fully prepared for College.\n \n \n \n \n Straight A students do this this method already, and it is the only difference between them, and C, and D, and F students. These good and bad habits are learned, and if a student does not develop these A student study methods, then the school system is to blame.\n \n \n \n \n Give a man a fish, and he will be hungry the next day.\n Teach a man to fish, and he can feed himself everyday.\n \n \n \n Teach a student, and the student becomes dependant on teachers.\n Teach a student to teach themselves, and there is no limit to their potential success.\n \n \n -Mosheh Thezion emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "solutions for education in the USA"
    }
   }, 
   null, 
   null, 
   1251452460.0
  ], 
  [
   367200, 
   null, 
   "Penfold", 
   "Your misunderstanding of memory and the physiology of the process is global in its extent, and the promotion of rote learning, which does nothing but fill the student's head with useless discrete factoids without a conception of the reasoning behind, or the relationships between the memorised items, is a massively retrograde idea. Other than that, just more gibberish.", 
   {}, 
   367189, 
   null, 
   1251459900.0
  ], 
  [
   367339, 
   null, 
   "Mosheh Thezion", 
   "Your misunderstanding of memory and the physiology of the process is global in its extent, and the promotion of rote learning, which does nothing but fill the student's head with useless discrete factoids without a conception of the reasoning behind, or the relationships between the memorised items, is a massively retrograde idea. Other than that, just more gibberish.\n\n \n if your going to argue... please try alittle harder.. if you want my respect.\n \n -Mosheh Thezion", 
   {}, 
   367200, 
   null, 
   1251538740.0
  ], 
  [
   367393, 
   null, 
   "jitobear", 
   "if your going to argue... please try alittle harder.. if you want my respect.\n \n -Mosheh Thezion\n\n \n The point is that memorization does not inspire imagination or critical thinking skills. If all people ever did was memorize, we never would have made it out of the caves.", 
   {}, 
   367339, 
   null, 
   1251559200.0
  ], 
  [
   367430, 
   null, 
   "Penfold", 
   "if your going to argue... please try alittle harder.. if you want my respect.\n \n -Mosheh Thezion\n\n \n If all you are going to offer is retrogression and failed policy, why should anyone seek your respect?", 
   {}, 
   367339, 
   null, 
   1251574500.0
  ], 
  [
   367530, 
   null, 
   "Mosheh Thezion", 
   "The point is that memorization does not inspire imagination or critical thinking skills. If all people ever did was memorize, we never would have made it out of the caves.\n\n \n i never said... all kids need to do is memorize...\n \n but facts are facts... kids fail tests... because they dont remember... a dah..\n \n and please... go and ask the teachers... I already have..\n \n they need to teach... and repeat.. and repeat... over and over each week, so as to serve this basic function.. so that the kids will remember...\n \n they do this... because they know.. most American students.. just wont read the books... hence the need for teachers....\n \n \n \n this is simple fact... it is why our schools are failing.. because our students are taught... that they must be taught... rather than being taugh to be able to read.. and study effectively.\n \n it is the lack of study skills in america.. which is why our schools suck.\n \n \n Argue with that simple fact, before you critisize this.\n \n study skills are everything... every A student.. does this... uses proper study skills.... the c, D, and F.. student dont.\n \n Thats the difference... \n \n \n comprehension.. and understanding comes from interaction and contemplation with regards to the teachers guided sessions based on information which the student should of learned all on their own.... by reading and study.\n \n but since the students dont bother to read... or use a proper study method the teachers... end up frustrated trying to teach kids.. things they dont want to learn in the first place.\n \n \n I offer solution... please argue with it... or agree...\n \n -Mosheh Thezion", 
   {}, 
   367393, 
   null, 
   1251618240.0
  ], 
  [
   367699, 
   null, 
   "iangb", 
   "Rote learning may lead to greater recall, but it rarely allows students to use that information once they have recalled it. It's rote-style learning that leads students to reach for a calculator when asked to find the square route of 574^2 - they may be able to tell you what 10*10 is instantly, but they don't necessarily understand why it is.\n \n You argue that pupils need to be taught better study methods - this may well be true. Rote learning, however, is generally not a good study method for them to be taught.", 
   {}, 
   367530, 
   null, 
   1251745500.0
  ], 
  [
   367740, 
   null, 
   "Mosheh Thezion", 
   "Rote learning may lead to greater recall, but it rarely allows students to use that information once they have recalled it. It's rote-style learning that leads students to reach for a calculator when asked to find the square route of 574^2 - they may be able to tell you what 10*10 is instantly, but they don't necessarily understand why it is.\n \n You argue that pupils need to be taught better study methods - this may well be true. Rote learning, however, is generally not a good study method for them to be taught.\n\n \n you presume... students need to be taught.\n \n Students should be taught to teach themselves... self teach.\n \n And as far as math is concerned.. skill... is a matter of a similar process of repetition, so that in the process of doing, they have such an established network of memorycells, as to allow the function of doing without requiring the need to think about it..\n this requires indepth memorization.. associated with long habits of doing, which developes skill.\n \n \n to quote my first post...\n \n \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"Our modern school system, is literally training students to believe that if they ever want to learn something, that they MUST be taught it, directly by someone else, when in fact they need only have the will to acquire the books, and read and study them properly, so as to gain the knowledge quickly in short order, and then to apply that knowledge so as to gain applicable skills in using it. As such, the teachers job, should be only to lead those application efforts, run testing, answer questions, and to help students who are having difficulty grasping what can often be a badly written book. \"\"\"\"\"\"\"\"\"\n \n But thankyou... I should expand on the points concerning the application and development of trained skills.. in actually doing.\n \n Yes.. thank you indeed... this is why I posted this.. so as to get intelegent feedback... \n \n \n -Mosheh Thezion", 
   {}, 
   367699, 
   null, 
   1251773640.0
  ], 
  [
   367760, 
   null, 
   "jitobear", 
   "i never said... all kids need to do is memorize...\n \n but facts are facts... kids fail tests... because they dont remember... a dah..\n \n and please... go and ask the teachers... I already have..\n \n they need to teach... and repeat.. and repeat... over and over each week, so as to serve this basic function.. so that the kids will remember...\n \n they do this... because they know.. most American students.. just wont read the books... hence the need for teachers....\n \n \n \n this is simple fact... it is why our schools are failing.. because our students are taught... that they must be taught... rather than being taugh to be able to read.. and study effectively.\n \n it is the lack of study skills in america.. which is why our schools suck.\n \n \n Argue with that simple fact, before you critisize this.\n \n study skills are everything... every A student.. does this... uses proper study skills.... the c, D, and F.. student dont.\n \n Thats the difference... \n \n \n comprehension.. and understanding comes from interaction and contemplation with regards to the teachers guided sessions based on information which the student should of learned all on their own.... by reading and study.\n \n but since the students dont bother to read... or use a proper study method the teachers... end up frustrated trying to teach kids.. things they dont want to learn in the first place.\n \n \n I offer solution... please argue with it... or agree...\n \n -Mosheh Thezion\n\n \n Please don't lecture me. I have a child in the school system and am a product of it myself. Instead, why not practice what you preach and go work on some basic writing skills. Your posts are painful to get through.", 
   {}, 
   367530, 
   null, 
   1251778860.0
  ], 
  [
   367767, 
   null, 
   "Mosheh Thezion", 
   "Please don't lecture me. I have a child in the school system and am a product of it myself. Instead, why not practice what you preach and go work on some basic writing skills. Your posts are painful to get through.\n\n \n \n well as a good parent...have you trained you child to study in this fashion?\n \n eh???\n \n or do you leave that up to the schools... which are failing kids left and right.?\n \n eh?\n \n Rememeber... i may be stating the obvious... but often the obvious is forgotten and ignored because parents.. and kids get lazy.\n \n forgive me... for reminding you.. of the basics of how to study.\n \n maybe... you can try alittle harder for your kid.. or is your kid an A student?\n \n if not.. then maybe you should consider this seriously.\n \n -Mosheh Thezion", 
   {}, 
   367760, 
   null, 
   1251787680.0
  ], 
  [
   367777, 
   null, 
   "Jo Bennett", 
   "And as far as math is concerned.. skill... is a matter of a similar process of repetition, so that in the process of doing, they have such an established network of memorycells, as to allow the function of doing without requiring the need to think about it..\n this requires indepth memorization.. associated with long habits of doing, which developes skill.\n\n \n Rubbish, mathematical skills are a matter of thought process, deductive and inductive reasoning. What you're suggesting is that writing a novel is about getting the full stops in the right place. I teach maths and the last thing we want is children to just memorise individual techniques, as research shows that they do not develop any clear understanding of connections in mathematics, and historically such an approach has led to barely a quarter of students being mathematically competent.", 
   {}, 
   367740, 
   null, 
   1251793740.0
  ], 
  [
   367800, 
   null, 
   "Steeeeve", 
   "In the hundreds of years the US has been teaching students why do we always feel the need to change styles? You know what style really works...teaching the damn kids. \n \n How do you fix the USA education system? Hire teachers that teach the student and not to some standard applied as a blanket to all kids. Sorry, but not every kid is going to be an astronaut when they grow up.", 
   {}, 
   367777, 
   null, 
   1251824760.0
  ], 
  [
   367904, 
   null, 
   "Mosheh Thezion", 
   "Rubbish, mathematical skills are a matter of thought process, deductive and inductive reasoning. What you're suggesting is that writing a novel is about getting the full stops in the right place. I teach maths and the last thing we want is children to just memorise individual techniques, as research shows that they do not develop any clear understanding of connections in mathematics, and historically such an approach has led to barely a quarter of students being mathematically competent.\n\n \n \n which is why students.. should be taught to teach themselves all the memorizing.. so that they can focus on the skills.. and understanding being taught by wonderful teachers like you. (when in class)\n \n eh?\n \n wouldnt that make your job eaiser? if students could remember the details??\n And actually do their homework.. or do that work.. on their own during the first half of class??? so.. YOU... dont have to drum it in.. over and over???\n \n you.. cannot deny.. this will advance learning and memory... and with it.. free up time for you... YOU... to actually teach skills and understanding.\n \n eh??\n \n look... i ask you.. can you provide a good paragraph desription for what you advise.. as addition to what ive presented.. to add.. the aspects of training.. as you describe... that i can use to make a clearer argument?\n \n because i dont disagree with you... but you.. are mis undertanding me.\n \n -Mosheh Thezion :xbanghead", 
   {}, 
   367777, 
   null, 
   1251877440.0
  ], 
  [
   367905, 
   null, 
   "Mosheh Thezion", 
   "I added this... yesturday.. on the page for education...\n \n Mosheh Thezion's Exploratory Committee for U.S. Senate (R) | EDUCATION\n \n \n \n \n This same methodology applies to developing the working skills as well, as is well known it is the application of repetition in doing and practicing the skill over and over again, that in time allows the person to make use of that skill without requiring to think about it, due to the preseting of detailed neural net pathways established to be able to handle that skill as a well trained habit, and so, it can be done with ease, if, and only if the student is trained daily over long periods of time, to use and develop those skills, which follows the same parameters as learning and memorization of bulk knowledge, where the goal is to establish working networks of brain cells associated with those skills or habits of thinking.. \n \n \n how does that sound?\n \n -Mosheh Thezion", 
   {}, 
   367904, 
   null, 
   1251877560.0
  ], 
  [
   367942, 
   null, 
   "jitobear", 
   "well as a good parent...have you trained you child to study in this fashion?\n \n eh???\n \n or do you leave that up to the schools... which are failing kids left and right.?\n \n eh?\n \n Rememeber... i may be stating the obvious... but often the obvious is forgotten and ignored because parents.. and kids get lazy.\n \n forgive me... for reminding you.. of the basics of how to study.\n \n maybe... you can try alittle harder for your kid.. or is your kid an A student?\n \n if not.. then maybe you should consider this seriously.\n \n -Mosheh Thezion\n\n \n Me, his dad, teachers, tutors, grandparents, step-dads, cousins, aunts, uncles and friends have all helped him learn a variety of things in a variety of ways. He is a wiz at some subjects, has to work harder at others. He is at the VERY least as good at writing and communication as you.\n \n And I don't need you to remind me of anything. I am college graduate who parented, did a double course load, worked multiple jobs and still ended up on the Dean's list more often than not. You, on the other hand, have the grammatical skills of a 7th grader.\n \n By the way, you insinuate that I am a poor parent again and I will report you to the admin, something I have only ever done once before on this forum in the MANY years I have been on it.", 
   {}, 
   367767, 
   null, 
   1251917640.0
  ], 
  [
   367995, 
   null, 
   "Mosheh Thezion", 
   "Me, his dad, teachers, tutors, grandparents, step-dads, cousins, aunts, uncles and friends have all helped him learn a variety of things in a variety of ways. He is a wiz at some subjects, has to work harder at others. He is at the VERY least as good at writing and communication as you.\n \n And I don't need you to remind me of anything. I am college graduate who parented, did a double course load, worked multiple jobs and still ended up on the Dean's list more often than not. You, on the other hand, have the grammatical skills of a 7th grader.\n \n By the way, you insinuate that I am a poor parent again and I will report you to the admin, something I have only ever done once before on this forum in the MANY years I have been on it.\n\n \n \n I never insunuated any such thing.\n \n I asked you a simple question.. and offer some constructive advice.\n \n I only discuss this, at all, in an effort to help Americas students.\n \n If you are so wrapped up in your own mind and ways of thinking, thats not my fault.\n \n You child, either does these things.. study methods.. or doesnt.\n \n In the end, for him, it maybe greatly beneficial to make it a habit.\n \n I learned this method, because I was trying to study.. but could not reatin the info, and by doing this method, I could retain anything, and it works.\n \n Sorry, for trying to be helpful.\n \n -Mosheh Thezion", 
   {}, 
   367942, 
   null, 
   1251939360.0
  ], 
  [
   368449, 
   null, 
   "simone", 
   "Students are not encouraged to be curious. They are encouraged to be exactly like George W. Bush, a worthless bum who was never in the least curious.", 
   {}, 
   367995, 
   null, 
   1252263300.0
  ], 
  [
   368524, 
   null, 
   "Mosheh Thezion", 
   "Students are not encouraged to be curious. They are encouraged to be exactly like George W. Bush, a worthless bum who was never in the least curious.\n\n \n ???? \n \n emoticon_xdonno", 
   {}, 
   368449, 
   null, 
   1252287660.0
  ], 
  [
   368634, 
   null, 
   "simone", 
   "True scholarship evolves from awe and simple curiosity.", 
   {}, 
   368524, 
   null, 
   1252358760.0
  ], 
  [
   368716, 
   null, 
   "Mosheh Thezion", 
   "True scholarship evolves from awe and simple curiosity.\n\n \n \n and???????????????????????", 
   {}, 
   368634, 
   null, 
   1252395120.0
  ], 
  [
   371460, 
   null, 
   "QuackAttack1887", 
   "MT, this is a flawed plan. I've tried all that and I graduate by the skin of my teeth. One of my brothers tried that, they put him in a program for stoners. He dropped out and got his GED six months earlier than his classmates.", 
   {}, 
   368716, 
   null, 
   1253858880.0
  ], 
  [
   385491, 
   null, 
   "TheRage", 
   "Please don't lecture me. I have a child in the school system and am a product of it myself. Instead, why not practice what you preach and go work on some basic writing skills. Your posts are painful to get through.\n\n \n You apparently chaff at not only the truth but discipline as well. Rote learning establishes BASIC applicable knowledge. When you hear a kid say \"I know...I know\". MAKE them prove it by application on-the-spot. If they can't do say simple math OR remember one thing out of the Constituition, then they haven't been made to memorize AND apply.. \n \n Memorization IS discipline. Those that can't memorize suffer from too many distractions/disharmony in their formative years. You may try to explain or drug it away BUT it's basically being a \"scatter brain\". \n \n A kid always looks for \"The easy way out\". Parents AND teachers from an early age need to make a kid sit at the dinner table and DO their homework, checking on what they're doing every so often NOT retire to the bedroom where I can tell you from my OWN experience, I didn't do my homework. \n \n Kids need strict STRUCTURE from a 2-parent household to establish certain methods of learning that involves MORE than what's just in some text book...\n They need to be encouraged to read all sorts of literature..But if they don't have the basics of multiplication \"drilled\" into their heads until they finally \"get it\", then we will continue with kids reaching for calculators who STILL can't make correct change.\n \n My mother came from the OLD ways and could STILL do math \"in her head\" into her 80's..Now you've got these LAZY kids raised by LAZY PARENTS who make Beavis and Butthead look like genuis'..\n \n You need a bit of discipline yourself as you \"chaff\" at the idea it might require not a little BUT a LOT of scrutiny and actual WORK...\n OR, let things go as they are, the schools warehousing/babysitting your kid, while you care more about your own selfish and might I add, CHILDISH whims!\n \n We put a Man on the Moon with a SLIDE RULE and a piece of paper. Parochial schools by and large do not have computer labs as a rule and YET their students lead in garnering ACADEMIC SCHOLARSHIPS..\n \n What do we need to \"fix\" our public schools?. Draconian Budget cuts like the state of Iowa enacted forcing all their schools to \"get back to basics\" (while eliminating multiple levels of bloated administration). Guess what, less money to support \"The System\" wound up meaning MORE money in the actual classroom to pay for GREAT TEACHERS that PUSHED kids to excel..\n But if they don't have the basics drilled into them to where it's second nature, they'll keep saying \"I know\" when they don't actually know anything except how to be a good \"sheeple\". \n \n The kids of today need a good ole dose of PRE-1940's education techniques. \n Yea, they'll whine and some will feign crumbling, but they'll ultimately THANK you for it!..The nations of the world are using old techniques to replace/beat our brains out in the economic market. AND parents need to grow up and BE THE PARENT. Everytime a kid whines, PUNISH, don't reward it!. But when they excell, even a little bit, PRAISE them for it. Expect more from your kids, the next generation, and this world will be left in good hands when we're gone.\n \n Anything else is just undermining gobblegook!", 
   {}, 
   367760, 
   null, 
   1263218760.0
  ], 
  [
   418318, 
   null, 
   "fzgrums", 
   "The point is that memorization does not inspire imagination", 
   {}, 
   367942, 
   null, 
   1291360260.0
  ], 
  [
   423827, 
   null, 
   "Lumena", 
   "I'll ignore the above bickering about who is more right than who. I simply want to ask this question: what inspires a person to learn? Is it being told to read, when the student see a good reason to read? Is is repetition with the hopes that something will stick or click? In my opinion, no. When I am inspired by someone, I want to know more. What is the purpose of teaching kids about world history? Do they understand this purpose? What is the purpose of teaching math or science? Do kids fully grasp the sheer power that this information gives them?\n \n Instead of asking our kids to care so that they succeed, why don't we design avenues for them to be inspired so that they care? When I was a 2nd grader, my teacher set up pen pal relationships for our class to correspond with kids in China. This established a CARING relationship between me and a REAL person in a country I knew nothing about. I got a photo, a biography and a personalized letter once a month. This inspired me to learn more about China and in 7th grade I traveled to China on a short exchange program as an American Ambassador. Exposing our kids, whose minds are like sponges, to real issues and concepts that impact REAL people, might inspire them to CARE to learn, not just learn because they HAVE to. \n \n My second point is that not just any person can inspire someone. Are teachers tested for that before they are certified? No. They are evaluated on their knowledge of subject matter, their ability to design curriculum and their abilities to deliver it. If they complete these benchmarks, they are allowed to teach. Are they tested on monotony? Are they evaluated on how much they care about students futures? What if instead of asking kids the basic question \"what do you want to be when you grow up?\" and funneling kids through various pathways to that end, you asked simply \"what is the change you want to see in the world?\" An ultimate goal and OWNERSHIP over that goal is what kids need. A thirst for knowledge and a hunger to be involved is what will make learning fun and easy... not learning techniques. Every child learns differently. I still struggle to read a text book and retain the information... and I'm taking 400 level science courses. But the beauty of the 21st century and technology is that we don't HAVE to teach the same monotonous ways we once did. The possibilities of teaching methods grow daily (research digital blackboards, for example). Why aren't we reforming education to meet the learning needs and diversity of the modern child instead of blaming the kids for not wanting to learn?\n \n So this being said, you, reader, what is the change that YOU want to see in this world?", 
   {
    "post_info": {
     "post_title": "Not what makes you learn, what makes you WANT to learn"
    }
   }, 
   418318, 
   null, 
   1297069260.0
  ], 
  [
   423872, 
   null, 
   "signelect", 
   "Teachers can't teach because they are too busy controlling unruly students who don't mind at home and have parents that tell them if the teacher get in their face they will come to school and take care of the teacher. Parents are not doing their job, education is not doing its job. If both don't change we are screwed. Try getting change at the store if the computer register doesn't give them the exact amount. I just heard that 50% of the people living in Detroit are unable to read, write and add. This is the state where the unions have ruined the economics of business but can't educate their kids.\n \n Education starts at home.", 
   {}, 
   367942, 
   null, 
   1297360260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  solutions for education in the USA", 
  "url": "http://www.4forums.com/political/education-debates/13209-solutions-education-usa.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 13209, 
  "discussion_files": [
   [
    "1170.html", 
    "http://www.4forums.com/political/education-debates/13209-solutions-education-usa-print.html"
   ], 
   [
    "1171.html", 
    "http://www.4forums.com/political/education-debates/13209-solutions-education-usa-2-print.html"
   ]
  ], 
  "identifier": 13209
 }
]