[
 [
  [
   367544, 
   null, 
   "Jo Bennett", 
   "It's the first anniversary of my Godson's baptism tomorrow, so I've got him a 1st birthday card.\n \n I'd like to put a relevant Bible quote in, I thought about 1 Peter 1:23, but I'd like to know if anyone has any better ideas.", 
   {
    "post_info": {
     "post_title": "Biblical quotations suggestions - baptism"
    }
   }, 
   null, 
   null, 
   1251627360.0
  ], 
  [
   367576, 
   null, 
   "Easyrider", 
   "Here's some info to pick from:\n \n BAPTISM\n \n Baptism: 1: A Christian sacrament marked by ritual use of water and admitting the recipient to the Christian community; 2: an act, experience, or ordeal by which one is purified, sanctified, initiated or named. (Webster's 88)\n \n Baptism of fire: 1: A spiritual baptism by a gift of the Holy Spirit - often used in allusion to Acts 2:3-4 and Matthew 3:11; 2: An introductory or initial experience that is a severe ordeal (a soldier's first exposure to enemy fire). (Webster's 88)\n \n Hastings Bible dictionary identifies baptism as, \"an outward sign and pledge of inward repentance on their (man's) part, and of their forgiveness on the part of God. Baptism is related to repentance as the outward act in which the inward change finds expression\" (Hastings 82). \n \n In his book, The Glorious Journey, Pastor Charles Stanley defines baptism as, \"An act of obedience whereby the believer publicly identifies through immersion (in water) with Jesus' death, burial, and resurrection\" (Stanley 6).\n \n Baptize: Originates from the Greek word baptizo; to make whelmed (i.e. fully wet); of ceremonial ablution. (Zodhiates 18)\n \n I would give this definition of baptism for the true believer in Christ: \"A willful, conscious, outward act of immersion in water that signifies the inner working of Christ and the Holy Spirit whereby the believer, by an act of God's grace, is cleansed from impurity and identified in the death, burial, and resurrection of Jesus Christ.\" No doubt there are many definitions of baptism, depending on the various disciplines of Christianity.\n \n \"Baptism and the (Lord's) Supper are for the saved alone, and only the saved can scripturally observe either ordinance\" - George W. Truett (Stanley 5).\n \n I have heard it said that there's not much in the New Testament that isn't alluded to in the Old Testament. Accordingly, there should likely be some Old Testament scripture(s) that look forward to the sacrament of baptism. I submit Ezekiel 36:25-26:\n \n \"I will sprinkle clean water on you and you will be clean; I will\n cleanse you from all your impurities and from all your idols. I\n will give you a new heart and put a new spirit in you.\"\n \n Concerning the above verse, the Geneva Study Bible provides this commentary:\n \n \"The sprinkling or pouring of water refers to the ritual purifications for removing religious defilement (Exodus 30:17-21; Leviticus 14:52; Numbers 19:17-19). It is also used as a symbol for the gift of God's (Holy) Spirit, in the anointing of kings and priests and in the prophetic call (Joel 2:28, 29). The outpouring of God's Spirit is a sign of the messianic age (37:14; 39:29; Isaiah 42:1; 44:3; 59:21). This rich symbolism attaches to baptism in the New Testament. The language of vs. 25-27 is closely paralleled in Psalm 51:7-11\" (Geneva Study Bible 1309).\n \n A related New Testament verse is found in John 3:5: \"Jesus answered, 'I tell you the truth, no one can enter the kingdom of God unless he is born of water and the Spirit.\" And yet another related verse is found in Titus 3:5: \"He saved us, not because of righteous things we had done, but because of His mercy. He saved us through the washing of rebirth and renewal by the Holy Spirit.\" This being said, I think it should also be noted that the apostle Paul referenced Jesus in this same context:\n \n \"Husbands, love your wives, just as Christ loved the church and\n gave Himself up for her, to make her holy, cleansing her by the\n washing with water through the word.\" (Ephesians 5:25-26)\n \n The Geneva Study Bible makes this comment regarding the above: \"Paul outlines in these verses the entire process to which Christ has committed Himself in His relationship with the church. He has washed her from sin and is preparing her for a glorious destiny with Himself\" (Geneva Study Bible 1869). Of course the \"word\" (washing with water through the word) is directly connected to John 1 - \"the word became flesh,\" speaking of Christ. It is at this juncture that we see that both Christ and the Holy Spirit are involved in spiritual cleansing (Titus 3:5; Ephesians 5:25-26). To further this point I submit I John 1:7 (KJV):\n \n \"But if we walk in the light, as He is in the light, we have\n fellowship with one another, and the blood of Jesus Christ\n His Son cleanseth us from all sin.\"\n \n These foundational verses support the proposition that (1) By a work of God's grace believers are cleansed from their impurities; and (2) Christ and the Holy Spirit are both clearly identified as being instrumental in this process.\n \n JOHN THE BAPTIST\n \n The advent of John the Baptist was not just happenstance - he was clearly foretold in the Old Testament (note Isaiah 40:3, 5 in conjunction with Matthew 3:1-3, and also Malachi 4:5-6 in conjunction with Luke 1:17). His mission from God was to prepare the way for the coming Messiah. \"Repent, for the kingdom of heaven is near,\" he cried out. \"I baptize you with water for repentance. But after me will come one who is more powerful than I, whose sandals I am not fit to carry. He will baptize you with the Holy Spirit and with fire\" (Matthew 3:2, 11). \n \n The first thing we note is that John's baptism is a baptism of repentance, which is a preparatory work of God in man's heart. I say that repentance is a work of God, for if it were a work of man, than man could boast of this \"work.\" And Ephesians 2:8-9 states clearly that man is saved solely by God's grace through faith in Jesus Christ. And also, John 6:44 states, \"No one can come to me unless the God who sent me first draws him...\" \n \n Next, if John's baptism is a baptism of repentance, then the individual engaged needs to have sufficient maturity and cognitive acumen to be able to understand right from wrong, sin from proper behavior, and be able to understand this in light of God's word. Repentance then, as a prerequisite for John's baptism, is not possible for newborn infants. Along these lines, there are no instances mentioned in the Bible where infants are either commanded to be baptized, or are baptized apart from such commandments. And although I don't see anything wrong with parents baptizing their newborn children, I would recommend that the child be instructed in the ways of the Lord and then later, at the proper time, of their own accord, again undergo the baptismal sacrament. \n \n In the last chapter of Mark (v. 16) we read:\n \n \"Whoever believes (in Christ) and is baptized will be saved, but\n whoever does not believe will be condemned.\"\n \n Belief in Christ (by the gift of faith) and repentance both originate from God. Once a person is convicted of their sins by the Holy Spirit, repentance, along with a believing faith in Christ, is normally not far behind. I believe they are both a work of God, and both are normative in the salvation process.\n \n As a ritual, water baptism is also seen as a public demonstration of one's faith in Christ. In some cultures, such as China and even Saudi Arabia, a public profession of Christ along with the water baptism can result in the individual being severely disciplined, and in extreme cases put to death. Yet the public pronouncement of one's identification with Christ seems to say, \"I am no longer under the domain of Satan or the secular influences of this world. I am a blood-bought child of God, and from this day forward my allegiance to Him comes first.\" Water baptism is a commandment of Christ, and is therefore our first act of obedience to Him. \n \n It is at this point that I feel the need to state that the ritual of water baptism is not a necessity for salvation. A good case in point would be the thief on the cross next to Jesus, who could not come down from the cross in order to be baptized. Yet Jesus told him that \"today, you will be with me in paradise.\" \n \n Water baptism is not a prerequisite for salvation - believing faith in Christ is (John 3:16). Spiritual baptism, resulting from a true, believing faith in Jesus Christ, is a necessity for salvation. \n \n People can say they believe in Christ and even undergo water baptism and still not be saved. The important thing is the condition of the person's heart, and if their faith in Christ is genuine. Outward ceremonial rituals do not save a person. Inward spiritual cleansing must occur, resulting from saving faith, and many people in the church tend to confuse this issue. \n \n No outward act, or work of man, can bring him salvation - salvation is totally a work of God in a persons heart and mind.\n \n BURIED WITH CHRIST\n \n \"Or don't you know that all of us who were baptized into Christ\n Jesus were baptized into His death? We were therefore buried\n with Him through baptism into death in order that, just as Christ\n was raised from the dead through the glory of the Father, we\n too may live a new life.\" (Romans 6:3-4)\n \n Paul went on to say that our \"old self\" (old carnal nature) was crucified with Christ at Calvary so that \"the body of sin might be done away with.\" Concerning the previous verse, Wayne Grudem remarks,\n \n \"Now this truth is clearly symbolized in baptism by immersion. When the candidate for baptism goes down into the water it is a picture of going down into the grave and being buried (with Christ). Coming up out of the water is then a picture of being raised with Christ to walk in newness of life. Baptism thus very clearly pictures death to one's old way of life and rising to a new kind of life in Christ\" (Grudem 968).\n \n I can't let this pass without contrasting this to the Israelites passing from their old life of bondage in Egypt, across the water of the River Jordan, into their new life in the \"promised land.\" And we can't forget the typology of Noah's flood:\n \n \"...God waited patiently in the days of Noah while the ark was\n being built. In it only a few people, eight in all, were saved\n through water, and this water symbolizes baptism that now\n saves you...\" (I Peter 3:20)\n \n BAPTIZED INTO ONE BODY\n \n First Corinthians 12, relating to spiritual gifts, goes on provide a good illustration of the diversification of the many believers in the \"body\" of Christ - His church. Paul further elaborates on this in I Corinthians 12:12-13:\n \n \"The body is a unit, though it is made up of many parts; and\n though all its parts are many, they form one body. So it is with\n Christ. For we are all baptized by one Spirit into one body...\"\n \n BAPTISM WITH FIRE\n \n In Luke 3:16 John the Baptist said, \"I baptize you with water....but He (Christ) will baptize you with the Holy Spirit and with fire.\" Note the \"Refiner's fire\" in Malachi 3:2. This, of course, is the hand of the Lord that is working in our lives to refine us from dead works, sin, and anything else that God doesn't think we should have in our lives. I am reminded of the friends of Daniel - Shadrach, Meshach, and Abednego, who were cast into the fiery furnace. King Nebuchadnezzar looked into the furnace and exclaimed, \"LOOK! I see four men walking around in the fire, unbound and unharmed, and the fourth looks like a son of the gods\" (Daniel 3:25). Two points I'd like to make: (1) We never go through the \"fire\" alone. Christ is always with us; (2) When we come out of the fire, we come out \"unbound.\" \n \n \n PENTECOSTAL BAPTISM\n \n Acts chapter 1 records Jesus' prophecy to the disciples concerning their coming baptism with the Holy Spirit: \"For John baptized with water, but in a few days you will be baptized with the Holy Spirit.....You will receive power when the Holy Spirit comes on you, and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth\" (Acts 1:5, 8). The coming of the Holy Spirit with power came shortly thereafter:\n \n \"When the day of Pentecost came, they were all together in one\n place. Suddenly a sound like the blowing of a violent wind\n came from heaven and filled the whole house where they were\n sitting. They saw what seemed to be tongues of fire that sep-\n arated and came to rest on each of them. All of them were filled\n with the Holy Spirit and began to speak in other tongues as the\n Spirit enabled them.\" (Acts 2:1-4)\n \n Shortly thereafter Peter addressed the crowd that had gathered and told them that the prophecy of Joel 2:28-32 had been fulfilled. That day three thousand people were saved through the Spirit. Interestingly, in Exodus 32:28, Moses had just received the Ten Commandments (the law) on Mount Sinai, and in the ensuing melee at the foot of the mountain, three thousand people died. I think Paul might well have spoken of what this meant in II Corinthians 3:6: \"He has made us competent as ministers of a new covenant - not of the letter (of the law) but of the Spirit; for the letter kills, but the Spirit gives life.\" \n \n What happened at Pentecost has fueled debates in the church over a number of related issues, the first of which involves the baptism of the Holy Spirit. In the Acts 2:4 verse it says that the disciples were \"filled with the Holy Spirit.\" Almost fifty days previously Jesus had risen from the dead and appeared to the disciples saying, \"Peace be with you! As the Father has sent me, so I am sending you.' And with that He breathed on them and said, 'Receive the Holy Spirit\" (John 20:21-22). Of course the question is, \"If the disciples received the Holy Spirit at the time Jesus was resurrected, then what was it they received at Pentecost?\" The answer to this is usually a matter of either private or denominational interpretation, but I would look at Acts 1:8 as providing the answer - \"You will receive power when the Holy Spirit comes on you.\" It was during this period of time that the disciples went from being a collection of whimps and misfits to the dynamic apostles that we look up to in admiration.. The Holy Spirit is a Spirit of power. \"For God hath not given us the spirit of fear; but of power, and of love, and of a sound mind\" (II Timothy 1:7 - KJV). Also consider Judges 14:6:\n \n \"The Spirit of the Lord came upon him (Samson) in power so\n that he tore the lion apart with his bare hands.\" \n \n We see the same thing in the life of Saul (1 Samuel 10:10) and with David (I Samuel 16:13). The Greek word for power in Acts 1:8 is dunamis, which means, \"miraculous power, ability, abundance, mighty deeds (worker of miracles), and strength\" (Zodhiates New Testament Dictionary 24). If I recall correctly dunamis is the Greek word from which we derive the word 'dynamite.' So whereas in the Gospel of John the disciples had received the witness of the Holy Spirit, in Acts they received Him with power. \n \n A second issue that is constantly debated in the church addresses the issue of whether being \"filled\" with the Holy Spirit always includes speaking in \"tongues.\" I know that at one time (and perhaps even now) the Pentecostal Church and also the Assemblies of God maintain that if you don't speak in tongues you aren't filled with the Holy Spirit. I've also heard Pastor Benny Hinn preach about the \"three types (levels)\" of baptism. The first is the \"Leper's anointing,\" which is salvation by faith. The second involves surrendering one's will to the Lord, which provides the \"Kingly anointing\" (speaking in tongues). And the third is the \"Priestly anointing,\" (which comes through obedience), and results in the manifestation of spiritual gifts such as healing, miracles, etc. I suspect this doctrine is more experiential than scriptural, for Ephesians 4:4-5 states,\n \n \"There is one body and one Spirit - just as you were called to\n one hope when you were called - one Lord, one faith, one\n baptism; one God and Father of all.\"\n \n Anyway, getting back to the issue of tongues as the evidence of the Holy Spirit at baptism, it seems that those who speak in tongues are mostly in favor of this doctrine, while those who don't speak in tongues, but consider themselves saved, oppose it. Two of the most well respected Christian leaders of today are the Reverend Billy Graham and Dr. Charles Stanley of the First Baptist Church in Atlanta, neither of whom speaks in tongues. I would go on record as saying that tongues, while a legitimate Christian phenomenon, is not always an evidence of spiritual baptism, nor is it always a work of God. Pastor Roy Harthern of Orlando Christian Center has stated that speaking in tongues is not always a work of the Holy Spirit. Hank Hanigraff of the Christian Research Institute says much the same thing. There is 'glossalalia,' or an attempt by man to utter convincing sounds so that others might accept him in charismatic circles. And Harthern has told of several instances where he perceived that a particular person was speaking in tongues that came from a demonic spirit. So just because a person speaks in tongues, it is not always evidence that it is a gift of God.\n \n I Corinthians 12:30 states, \"Do all have gifts of healing? Do all speak in tongues?\" The question is a rhetorical question to which the implied answer is. \"no, not everyone speaks in tongues.\" A counter-argument back against this is that in the above verse, Paul is speaking of spiritual gifts, not the normative \"speaking in tongues.\" And so the debate rages on. I have seen numerous works that seem to effectively argue both positions rather eloquently. I would just respond with 1 Corinthians 13:1:\n \n \"Though I speak with the tongues of men and of angels, but have\n not love, than I am become as sounding brass or a clanging cymbal.\"\n \n I think in the long run, love for God and one's fellow man is a more sure indicator of salvation and baptism than is tongues. \n \n Now, concerning whether the \"infilling\" of the Holy Spirit at Pentecost was the point in time wherein the disciples were effectually \"saved,\" Wayne Grudem makes these points:\n \n \"But how, then, do we understand the references to baptism in the Holy Spirit in Acts 1:5 and 11:16, both of which refer to the day of Pentecost? Were these not instances where the disciples, having previously been regenerated by the Holy Spirit, now experienced a new empowering from the Holy Spirit that enabled them to minister effectively? It is true that the disciples were \"born again\" long before Pentecost, and in fact probably long before Jesus breathed on them and told them to receive the Holy Spirit in John 20:22. Jesus had said, 'No one can come to me unless the Father who sent me draws him' (John 6:44), but the disciples certainly had come to Jesus and followed Him (even though their understanding of who He was gradually increased over time). Certainly when Peter said to Jesus, 'You are the Christ, the Son of the living God' (Matthew 16:16), it was evidence of some kind of regenerating work of the Holy Spirit in his heart. Jesus told him, 'Flesh and blood has not revealed this to you, but my Father who is in heaven' (Matthew 16:17). And Jesus had said to the Father regarding His disciples, 'I have given them the words which you gave me, and they have received them and know in truth that I came from you; and they have believed that you sent me....I have guarded them, and none of them is lost but the son of perdition...' The disciples had 'little faith' (Matthew 8:26) at times, but they did have faith. Certainly they were regenerated long before the day of Pentecost.\" (Grudem 769)\n \n GOD'S SOVEREIGNTY IN GIVING THE HOLY SPIRIT\n \n There are those in the Christian community that teach that at the moment of water baptism, the Holy Spirit then indwells the believer for the rest of their life. And while I'm sure there are many instances of that occurring in just that way, scripture also records that God may give His Holy Spirit to someone either before or after water baptism. In Acts 8:15-16 we see an example of this:\n \n \"When they (Peter and John) arrived, they prayed for them that\n they might receive the Holy Spirit, because the Holy Spirit had\n not yet come upon any of them; they had simply been baptized\n into the name of the Lord Jesus.\"\n \n Water baptism alone does not save a person. The Holy Spirit, given to an individual by Christ, is the \"Seal of Redemption\" (Ephesians 1:13-14) that signifies who belongs to God. So in Acts 8:15-16 we see an example where people received the Holy Spirit subsequent to baptism.\n \n Now, in Acts 10:46-48, we see an example where people were speaking in tongues and where they had received the Holy Spirit prior to baptism:\n \n \"For they heard them speaking in tongues and praising God.\n Then Peter said, 'Can anyone keep these people from being\n baptized with water? They have received the Holy Spirit just\n as we have.' So he ordered that they be baptized in the name\n of Jesus Christ.\"\n \n Scripture seems clear in this regard - God alone is sovereign, and He decides who is to receive the indwelling presence of the Holy Spirit and when they are to receive Him. He alone knows who belong to Him and who don't.\n \n CONCLUDING REMARKS\n \n In the Old Testament, it was a covenant requirement that those who would be identified as God's people would undergo circumcision. And even in those instances it was still faith in God that justified a person righteous, not the ritual of circumcision (note Genesis 15:6). In Romans 4:11 Paul elaborates on this point:\n \n \"And he (Abraham) received the sign of circumcision, a seal\n of the righteousness that he had by faith while he was still\n uncircumcised.\"\n \n Later, in Galatians chapter three, we find much the same thing:\n \n \"Did you receive the (Holy) Spirit by observing the law, or by\n believing what you heard.....Does God give you His Spirit and\n work miracles among you because you observe the law, or\n because you believe what you heard?\" (Galatians 3:2, 5)\n \n The points I wish to make are these: (1) Circumcision was only an outward ritual, or \"seal\" of what had already occurred in the heart of Abraham. He was justified by faith. In the New Testament, the ritual of water baptism is only meant to be symbolic of what God has already done, or is doing, in a person's heart - the \"circumcised heart\" - which is then \"sealed\" by the indwelling presence of the Holy Spirit; (2) The important issue is the inner working of God in man's heart. Remember, In Ezekiel 36 God said, \"I will give you a new heart and put a new spirit in you...I will move you to follow my decrees and be careful to keep my laws.\" It is God that is sovereignly working in the hearts of man, and no amount of works or personal cleansing or dunking on man's part will alone provide him with salvation or the Holy Spirit. This clearly speaks of the sovereignty of God condescending to sinful man and extricating him from the pit of iniquity, reconciling him to his creator. God is a covenant God, and throughout the Old and New Testaments He is consistent in keeping His covenant promises. Baptism is a two part work - one is the work of man through immersion in water, but the greater work is the work of God in the process of regeneration and infilling with the Holy Spirit. The work of man does not get him into heaven, but the work of God will.\n \n \"....not by works, so that no one can boast.\" (Ephesians 2:8-9)", 
   {}, 
   367544, 
   null, 
   1251646200.0
  ], 
  [
   367579, 
   null, 
   "Penfold", 
   "I'd stick with the first idea if I were you. emoticon_xgood", 
   {}, 
   367576, 
   null, 
   1251649440.0
  ], 
  [
   367679, 
   null, 
   "Art Pigou", 
   "I always thought Hebrews 10.22-25 was nice:\n \n ...let us draw near with a true heart in full assurance of faith, with our hearts sprinkled [clean] from an evil conscience and our bodies having been washed with pure water. Let us firmly hold onto the confession of our hope, for he who promised is faithful. And let us watch over one another in order to stir us to love and good works, not neglecting our gatherings as is the habit of some, but encouraging one another, and all the more as you see day nearing.", 
   {}, 
   367579, 
   null, 
   1251713700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Biblical quotations suggestions - baptism", 
  "url": "http://www.4forums.com/political/religion-debates/13218-biblical-quotations-suggestions-baptism.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13218, 
  "discussion_files": [
   [
    "6296.html", 
    "http://www.4forums.com/political/religion-debates/13218-biblical-quotations-suggestions-baptism-print.html"
   ]
  ], 
  "identifier": 13218
 }
]