[
 [
  [
   368016, 
   null, 
   "99%BEEF", 
   "According to the WWF there are less than 4000 tigers living in the wild.\n \n WWF - Tiger - Overview\n \n According to the below report China has allowed, through the backdoor, the use of products extracted from endangered animals. The report expresses the fear that it may lead to the end of wild tigers.\n \n Fears for Indian tiger after Chinese green light for sale of animal products - Times Online\n \n It also mentions that China has tiger farms that combined, contain around 5000 tigers.\n \n Therefore, is the best way to ensure tiger survival the legalisation of tiger products and are we willing to have a somewhat domesticated version of the big cat.", 
   {
    "post_info": {
     "post_title": "Tiger whine"
    }
   }, 
   null, 
   null, 
   1251943980.0
  ], 
  [
   368024, 
   null, 
   "Archangel", 
   "I didn't know that the \"World Wrestling Federation\" was involved in Tiger Conservation. emoticon_wow", 
   {}, 
   368016, 
   null, 
   1251947280.0
  ], 
  [
   368025, 
   null, 
   "Penfold", 
   "I didn't know that the \"World Wrestling Federation\" was involved in Tiger Conservation. emoticon_wow\n\n \n \n \n That's no surprise, it isn't.", 
   {}, 
   368024, 
   null, 
   1251948240.0
  ], 
  [
   368026, 
   null, 
   "Symbiote", 
   "From memory their shared TLA resulted in a lawsuit some time ago.", 
   {}, 
   368025, 
   null, 
   1251948720.0
  ], 
  [
   368027, 
   null, 
   "Archangel", 
   "From memory their shared TLA resulted in a lawsuit some time ago.\n\n \n I wonder who won?", 
   {}, 
   368026, 
   null, 
   1251948840.0
  ], 
  [
   368051, 
   null, 
   "gansao", 
   "I wonder who won?\n\n \n \n World Wide Fund for nature but I say it was a fix!", 
   {}, 
   368027, 
   null, 
   1251979620.0
  ], 
  [
   368066, 
   null, 
   "Archangel", 
   "World Wide Fund for nature but I say it was a fix!\n\n \n Very interesting... Until the chinese people evolve enough to stop using animal organs and ground up bones of exotic animals as ancient medicinal cures, any hope of curbing this underground industry is hopeless since the profits are so massive and killing an animal costs no more than the expense of the bullet which killed it.", 
   {}, 
   368051, 
   null, 
   1251993480.0
  ], 
  [
   368070, 
   null, 
   "gansao", 
   "I went to a Chinese traditional medicine doctor a few years ago for a skin complaint that could not be cured by my own doctor.\n He was from mainland China and could speak very little English( the Chinese herb store owner acted as an interpreter).\n He diagnosed my problem by looking at my tongue and feeling my pulse, from thart he told me what my skin problem was and also told me that I had a chronic bowel problem...I have had ulcerative colitis since I was 22 but I did not tell him anything about myself prior to his 'examination'.\n He gave me some herbs and told me how to prepare them, which I did.\n after a couple of weeks I had a tremendous attack of colitis and told him so when I went to his clinic( I was going to ask my doctor for some steriods to calm down the inflammation and I knew thar steriods cancel out the effect of many other medicines).\n He told me not to take the steroids but to try his remedy...wasps nests...small ones from China.\n He also gave me dead bee husks to boil up with the nests and the rest of the herbs.\n \n Within two weeks my bowel pain subsided and after another couple of months my unsightly skin condition went and never returned.\n I have not suffered from my skin condition since and my crippling bowel complaint became manageable and has since not returned...this was about 15 years ago.\n This man was utterly charming and used to give me oolong tea and chat via the store manager.\n He told me of the effectiveness of such things as tiger bones when used in chinese traditional medicine.\n Curiously he said that he thought rhino horn was not a great aphrodisiac as legend would have it!\n \n Also Archangel I was only joking about the World Wide Fund for nature and it being a fix...playing on the WWF matches ,allerged to be fixed..not sure if you understood my lame attempt at levity", 
   {}, 
   368066, 
   null, 
   1251995340.0
  ], 
  [
   368080, 
   null, 
   "Archangel", 
   "Your levity did go right over my head :p , but your personal experience with chinese medicine is very interesting. I had no idea these methods were valid or anything more than ancient traditions based on superstitions. I have read stories about poachers of bears in this country selling the internal organs of their illegal quarry on the underground chinese black market, so this illegal industry is world wide and stretches from North America to Africa, and back to Asia where these by-products of rare and exotic animals ultimately end up.", 
   {}, 
   368070, 
   null, 
   1252000020.0
  ], 
  [
   368083, 
   null, 
   "gansao", 
   "I dont know if you are aware of the harvesting of bile from captive bears in China. Truly horrific!", 
   {}, 
   368080, 
   null, 
   1252001640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tiger whine", 
  "url": "http://www.4forums.com/political/environmental-debates/13225-tiger-whine.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 13225, 
  "discussion_files": [
   [
    "5422.html", 
    "http://www.4forums.com/political/environmental-debates/13225-tiger-whine-print.html"
   ]
  ], 
  "identifier": 13225
 }
]