[
 [
  [
   367778, 
   null, 
   "foundit66", 
   "You may have seen the headline a few years ago - \"Republicans have more Nightmares than Democrats.\" The study by Kelly Bulkeley, Ph.D. was presented at the conference of the Association for the Study of Dreams, held at the University of California, Santa Cruz in July of 2001. He didn't set out to study nightmares. His study simply looked at male and female college students who strongly identified themselves as either liberal (left) or conservative (right), and analyzed many different characteristics of their dreams.\n \n Bulkeley collected \"recent dream reports\" from over 400 college students between 1996 and 2001. The students provided information about their political views as a part of a survey that asked several different questions about political beliefs. Most college students did not identify a strong affiliation with any political ideology, but some did. Bulkeley wanted to study the dreams of equal numbers of male conservatives, female conservatives, male liberals, and female liberals. Only 14 males identified themselves as conservatives, so 14 students from each of the other groups were randomly chosen for the study. Dreams were \"coded using the Hall and Van de Castle content analysis categories for characters, social interactions, emotions, settings, misfortunes, and good fortunes.\" Bulkeley further notes that \"each dream was coded by myself and one or two additional researchers who were blind to the political affiliation of the dreamers and the overall purpose of the study.\"\n \n Here are some of the results that did not make the headlines:\n \n * People on the left were more likely to have females as characters in their dreams, while people on the right dreamed twice as much about male characters as about female characters.\n * People on the left had fewer familiar characters, fewer friends, more family members, and fewer animals; people on the right had more familiar characters, more friends, fewer family members, and more animals.\n * People on the left were less often the initiator of aggressive interactions in their dreams, and their aggression was less physical in nature; people on the right were more often the aggressors in their dreams, and their aggression was more often physical.\n * People on the left had a greater number of dreams involving friendliness and good fortune, and fewer dreams involving misfortune; people on the right had a greater number of dreams with misfortunes, and fewer dreams with friendliness and good fortune.\n * Male rights had the lowest percentage of family members and instances of sexuality, and the highest percentage of animal characters and being the aggressor.\n * Male lefts had the highest frequency of female characters, and the fewest instances of aggression.\n * Female lefts had the lowest percentage of being the aggressor in their dreams, and the highest frequency of friendliness and good fortunes.\n * Female rights had the highest frequency of sexual interactions and physical aggression. (Bulkeley, 2001) \n \n Bulkeley goes on to summarize his results in the following manner:\n \n People on the right had more nightmares and dreams in which they lacked power. They had a greater frequency of lifelike dreams. Female rights were especially anxious about family relationships, and male rights had dreams almost devoid of girlfriends. People on the left had fewer nightmares and more dreams in which they had power. They had a greater frequency of good fortunes and bizarre elements in their dreams. Female lefts had an especially high frequency of good fortunes, and male lefts had an unusually high percentage of female characters. (Bulkeley, 2001) \n\n Why do Conservatives have more Nightmares?\n \n Maybe they spend too much time on fear issues in the first place.\n Everybody's got to be afraid of Obama cause he's a socialist / nazi / coming for your guns / secret Muslim / paling around with terrorists / ....", 
   {
    "post_info": {
     "post_title": "Why do Conservatives have more Nightmares?"
    }
   }, 
   null, 
   null, 
   1251802020.0
  ], 
  [
   367779, 
   null, 
   "foundit66", 
   "In an interview last week, U.S. vice presidential candidate Sarah Palin talked a lot about blinking.\n \n \"You can't blink\" and \"we must not blink,\" Republican John McCain's nominee told ABC News anchor Charles Gibson in response to questions about her readiness for office and the fight against terrorism.\n \n But a new study in the prestigious journal Science says that people with right wing views blink and flinch far harder than liberals when confronted with startling stimuli.\n \n In the first study to directly link politics and physiology, the University of Nebraska led study suggests that people who hold conservative views on things like foreign policy and gun control, are more frightened than those with a more left-leaning bent on those issues.\n\n TheStar.com | sciencetech | Liberals flinch less, conservatives more, study finds", 
   {}, 
   367778, 
   null, 
   1251802080.0
  ], 
  [
   367865, 
   null, 
   "Symbiote", 
   "Interesting result.\n \n \nMaybe they spend too much time on fear issues in the first place.\n\n \n That's a rather ignorant conjecture, especially considering when the study took place. Do you have any evidence that \"spending too much time on fear issues\" causes these symptoms? Of course not, you just mean it as a petty insult.\n \n If we adopt moral relativism, it's important that we don't substitute morality with pop-psychology, and start calling everyone we disagree with crazy or casting aspersions on their mental condition in place of argument. It's stupid and it's dishonest.", 
   {}, 
   367779, 
   null, 
   1251856560.0
  ], 
  [
   367895, 
   null, 
   "foundit66", 
   "Interesting result.\n That's a rather ignorant conjecture, especially considering when the study took place. Do you have any evidence that \"spending too much time on fear issues\" causes these symptoms? Of course not, you just mean it as a petty insult.\n If we adopt moral relativism, it's important that we don't substitute morality with pop-psychology, and start calling everyone we disagree with crazy or casting aspersions on their mental condition in place of argument. It's stupid and it's dishonest.\n\n Hmmm.\n \"petty insult\"\n \"pop-psychology\"\n \"crazy\"\n \"casting aspersions on their mental condition\"\n \"stupid\"\n \"dishonest\"\n \n First of all, these are two separate studies, which you in no way even attempt to invalidate, although you toss around plenty of negative comments about how you don't like them.\n I didn't call anybody \"crazy\".\n And there is nothing \"stupid\" or \"dishonest\" about my hypothesis.\n \n You don't even try to offer any competing theories to explain the phenomenon...", 
   {}, 
   367865, 
   null, 
   1251874860.0
  ], 
  [
   367900, 
   null, 
   "Symbiote", 
   "\n First of all, these are two separate studies, which you in no way even attempt to invalidate, although you toss around plenty of negative comments about how you don't like them.\n\n \n Thankyou for your failure to read, but I have no problem with the studies themselves. I said the results are \"interesting\". I do have a problem with your attempt to project your own disgusting biases onto the results.\n \n \nAnd there is nothing \"stupid\" or \"dishonest\" about my hypothesis.\n\n \n Right - so undoubtedly when you find a study showing gay youths suffer from mental illness at higher rates than the rest of the population, you'll interpret this as indicative that gay youths have personal and moral deficiencies.\n \n \nYou don't even try to offer any competing theories to explain the phenomenon...\n\n \n I can think of about 500 alternative possibilities. Until you have some actual evidence for one of those, giving priority to an alternative which casts conservatives as personally deficient only highlights your own hatefulness.", 
   {}, 
   367895, 
   null, 
   1251876240.0
  ], 
  [
   367913, 
   null, 
   "Jo Bennett", 
   "Right - so undoubtedly when you find a study showing gay youths suffer from mental illness at higher rates than the rest of the population, you'll interpret this as indicative that gay youths have personal and moral deficiencies.\n\n \n Except in that case persecution is a far more watertight alternative hypothesis. Doesn't really work for conservatives. After all, no-one's trying to prevent them getting married.", 
   {}, 
   367900, 
   null, 
   1251878520.0
  ], 
  [
   367914, 
   null, 
   "Symbiote", 
   "It would be hypocritical to look at \"alternative hypotheses\" for gays and not conservatives, and we know foundit would never be a hypocrite, so he will be compelled to avoid doing that for gays, just as he has in this case.", 
   {}, 
   367913, 
   null, 
   1251879960.0
  ], 
  [
   367919, 
   null, 
   "foundit66", 
   "Except in that case persecution is a far more watertight alternative hypothesis. Doesn't really work for conservatives. After all, no-one's trying to prevent them getting married.\n\n Very true.\n And still, we have no viable alternative hypothesis...\n \n Moreover in the \"gay\" case, the experts have acknowledged the root cause.\n All I have to do there is agree with them.\n \n I happily admit that my comment was merely a \"hypothesis\" here.\n And regardless of how some people claim they can come up with numerous alternatives, it's obvious that their first one was shot down right out of the gate without any effort.\n emoticon_rolleyes", 
   {}, 
   367913, 
   null, 
   1251888660.0
  ], 
  [
   367927, 
   null, 
   "jyoshu", 
   "Oh no doubt, from Foundit if it's a hypothesis about conservatives or Republicans in particular, it will be something negative.\n \n Maybe conservatives do indeed \"fear\" more than liberals, because a country that gives government too much control is something to be more fearful of, to begin with. ;)", 
   {}, 
   367919, 
   null, 
   1251904980.0
  ], 
  [
   367956, 
   null, 
   "foundit66", 
   "Oh no doubt, from Foundit if it's a hypothesis about conservatives or Republicans in particular, it will be something negative.\n\n The general conclusion of the studies was a negative one in the first place.\n While you are trying your usual POFIOI, maybe you can try to explain a hypothesis to explain the conclusions of the studies, which is serious.\n \n \n \nMaybe conservatives do indeed \"fear\" more than liberals, because a country that gives government too much control is something to be more fearful of, to begin with. ;)\n\n In which case, I can't help but wonder why conservatives have such a habit of seeking the government to interfere in our private lives.\n Conservatives seeking governmental action / discrimination against gays, for example.\n Conservatives seeking governmental action / control on issues like abortion.\n \n And moreover, \"too much control\"?\n How is that actually happening?\n Like with healthcare, the government is not \"controlling\" which insurance we pick. They are simply giving us a governmental OPTION, which we can choose to decline.\n \n The fears of Republicans are overblown, and too often based on partisanship.\n Like with Palin's \"death panels\". She HERSELF advocated such government funded counseling, but when a democrat does it she spreads fear...", 
   {}, 
   367927, 
   null, 
   1251922260.0
  ], 
  [
   367975, 
   null, 
   "Steeeeve", 
   "This is smelling like a correlation causation fallacy", 
   {}, 
   367956, 
   null, 
   1251933420.0
  ], 
  [
   367983, 
   null, 
   "foundit66", 
   "This is smelling like a correlation causation fallacy\n\n Even with \"correlative\" situations, there is often a \"causal\" relationship with other factors.\n Like with race and crime, it's a pseudo-\"correlative\" situation with blacks having a higher crime rate.\n But, the actual CAUSAL relationship is with INCOME and crime, and blacks have a higher percentage of lower income that puts them more \"susceptible\" to crime problems.\n \n But then the question remains as to why blacks have a typically lower income, and you come into issues of racism and similar problems...\n A causal chain exists...\n \n So, even if there is a correlative factor here, that doesn't really provide an end to the issue.\n The question would then arise as to WHAT ACTUAL causal factor would exist to cause this phenomenon within this group.\n Again, no attempt to provide a different causal factor....", 
   {}, 
   367975, 
   null, 
   1251937080.0
  ], 
  [
   367999, 
   null, 
   "Easyrider", 
   "I can't help but wonder why conservatives have such a habit of seeking the government to interfere in our private lives.\n Conservatives seeking governmental action / discrimination against gays, for example....\n\n \n There is a God. And he doesn't approve of gay sex. And bad things happen to sinful nations and people.\n \n \nConservatives seeking governmental action / control on issues like abortion.\n\n \n See above, and stop murdering the innocent unborn for the sins of their parents.\n \n \n \n Like with healthcare, the government is not \"controlling\" which insurance we pick. They are simply giving us a governmental OPTION, which we can choose to decline.\n\n \n Horse drip. When all the private insurance companies drop out because of continued government involvement, then we get Obama Care shoved down our throats.\n \n You people need to quit bankrupting the country. Government can't run a dog kennel without screwing things up. Every major entitlement they're in charge of is bankrupt or close to it. What's the matter with you people? \n \n I have a message for you and the pro-Obama imbeciles: Stay the hell out of our lives. Go away. Get a job and support yourselves. Provide for your own healthcare. Quit raising taxes and bankrupting this country. Take your socialism and put it where the moon doesn't shine. Take your flaky liberal congress people and put them on a shrimp boat to Antartica. Stay out of Washington. Get your grubby hands off of OUR money. Tell Obama he may be smart but he's a full quart low on wisdom. Get him off our TV's. We already have Howdy Doody on DVD if we want.", 
   {}, 
   367956, 
   null, 
   1251940140.0
  ], 
  [
   368019, 
   null, 
   "Steeeeve", 
   "So, even if there is a correlative factor here, that doesn't really provide an end to the issue.\n The question would then arise as to WHAT ACTUAL causal factor would exist to cause this phenomenon within this group.\n Again, no attempt to provide a different causal factor....\nBefore we get to randomly naming different causal factors that are not provable, answer me this. How many people were in this study? I'm very tired so I might be reading this incorrectly but here is what I see:\n \n\n Bulkeley collected \"recent dream reports\" from over 400 college students between 1996 and 2001. \n \n Only 14 males identified themselves as conservatives,\nIt goes on to say 14 were used from each group. Doesn't that make it 56 college students? Am I wrong or does that stick out to anyone besides me? Fifty-six people all around the same age is the sample. This is of course stated as the last few sentences in the link given. \n \n Seems a little premature to start with the bigotry.", 
   {}, 
   367983, 
   null, 
   1251945060.0
  ], 
  [
   368033, 
   null, 
   "Archangel", 
   "Before we get to randomly naming different causal factors that are not provable, answer me this. How many people were in this study? I'm very tired so I might be reading this incorrectly but here is what I see:\n It goes on to say 14 were used from each group. Doesn't that make it 56 college students? Am I wrong or does that stick out to anyone besides me? Fifty-six people all around the same age is the sample. This is of course stated as the last few sentences in the link given. \n \n Seems a little premature to start with the bigotry.\n\n \n You're absolutely right steeeve, the studies conclusions seem slanted to me or at least coming to a premature conclusion based on the size of the subject group. Here's what foundits article says and it seems incredible that he would publish results based on only 14 students from each group.\n Most college students did not identify a strong affiliation with any political ideology, but some did. Bulkeley wanted to study the dreams of equal numbers of male conservatives, female conservatives, male liberals, and female liberals. Only 14 males identified themselves as conservatives, so 14 students from each of the other groups were randomly chosen for the study.", 
   {}, 
   368019, 
   null, 
   1251952980.0
  ], 
  [
   368040, 
   null, 
   "foundit66", 
   "Before we get to randomly naming different causal factors that are not provable, answer me this. How many people were in this study? I'm very tired so I might be reading this incorrectly but here is what I see:\n It goes on to say 14 were used from each group. Doesn't that make it 56 college students? Am I wrong or does that stick out to anyone besides me? Fifty-six people all around the same age is the sample. This is of course stated as the last few sentences in the link given. \n Seems a little premature to start with the bigotry.\n\n You label this as \"bigotry\"?\n \n Wow.\n I advocated no discrimination.\n All I did was comment on the observed phenomenon.\n \n I wonder if you would be so quick to classify it as \"bigotry\" if somebody were to do something like, I don't know, maybe criticize homosexuality?\n \n And before you start in with a strawman or false allegations, I have always held that \"bigotry\" is demonstrated by a desire to discriminate against a group.\n Mere criticism is not \"bigotry\".", 
   {}, 
   368019, 
   null, 
   1251960600.0
  ], 
  [
   368043, 
   null, 
   "Symbiote", 
   "You label this as \"bigotry\"?\n \n Wow.\n I advocated no discrimination.\n All I did was comment on the observed phenomenon.\n\n \n You showed off your irrational prejudice. To be a bigot doesn't require discrimination, only prejudice, intolerance and narrow mindedness.", 
   {}, 
   368040, 
   null, 
   1251962100.0
  ], 
  [
   368044, 
   null, 
   "foundit66", 
   "Seems a little premature to start with the bigotry.\n\n \nYou showed off your irrational prejudice. To be a bigot doesn't require discrimination, only prejudice, intolerance and narrow mindedness.\n\n Just out of curiousity Steeeeve....\n \n Why is it that the personal attacks against me habitually show up when you do?\n emoticon_xdonno", 
   {}, 
   368043, 
   null, 
   1251963480.0
  ], 
  [
   368046, 
   null, 
   "foundit66", 
   "For people who feel psychologically all at sea, the conservative values of authority, order and tradition provide a comforting anchor. That's according to psychologists who further argue that a psychological threat, for example in the form of injustice or reminders of mortality, can even turn a liberal-minded person temporarily into a conservative - a response they call \"defensive conservatism\".\n \n Across three studies, Paul Nail and colleagues tested the conservatism and liberalism of students before and after subjecting them to a threat. Their consistent finding was that a threat turned liberal students into conservatives.\n \n In the first study, 68 students were categorised as liberal or conservative based on their political attitudes. Next they read about a fraudulent senior executive at Enron who was either jailed (the control condition) or who escaped punishment due to a legal loophole (the injustice condition). Afterwards, the students gave their opinion of an anti-USA essay written by a foreign exchange student. As expected, conservative students in the control condition rated the essay more harshly than liberal students. In the injustice condition, by contrast, the liberal students rated the essay just as harshly as the conservative students - that is, they'd started to think like a conservative.\n \n As well as being measured politically, conservatism and liberalism can also be measured psychologically, for example, by gauging people's \"preference for consistency\" (as indicated by agreement with a series of statements like \"I typically prefer to do things the same way\").\n \n A second study with 58 undergrad students involved them thinking about their own death or, as a control condition, thinking about TV. As expected, psychologically conservative students in the control condition held beliefs about issues such as capital punishment and abortion with more conviction than liberal-minded students. By contrast, of the students in the death condition, those who were identified as psychologically liberal subsequently expressed just as much conviction as their conservative minded peers. Once again, threat had made the liberal students resemble their conservative class mates.\n \n A third and final study used a measure that captured both political and psychological conservatism. This time, liberally minded students who were asked to think about their own death, subsequently took a homophobic stance in relation to an employment issue (rights for a gay employee's partner) and said they thought there would be widespread consensus for this opinion. In other words, they behaved liked the conservative minded students from the control and threat conditions.\n \n A key feature of these studies was that the outcome measures of conservative thinking were not directly linked to the threats, so it's not the case that the liberal students were simply responding to the threats in a pragmatic fashion.\n \n \"We believe that political conservatism has psychological properties that make it particularly appealing when vulnerability is dispositionally or situationally salient,\" the researchers said. \"Moreover, defensive conservatism appears to be a general psychological response to vulnerability that is not necessarily strategically linked to the eliciting threats.\"\n\n BPS RESEARCH DIGEST: How to turn a liberal into a conservative\n \n It's not like the above two studies I mentioned are the only ones out there.\n Here are three more...", 
   {}, 
   368044, 
   null, 
   1251963960.0
  ], 
  [
   368047, 
   null, 
   "Symbiote", 
   "It wasn't Steeve who made that comment, it was me. \n \n And personally I just have a problem with hypocrisy, so when I see someone who often complains about bigotry and hate and prejudice baselessly cast aspersions on a large group of people in such a hateful way, it just gets to me.\n \n It'd almost be funny to see you coming to such bizarre conclusions from these articles if it wasn't so sad.", 
   {}, 
   368044, 
   null, 
   1251964200.0
  ], 
  [
   368053, 
   null, 
   "Archangel", 
   "It wasn't Steeve who made that comment, it was me. \n \n And personally I just have a problem with hypocrisy, so when I see someone who often complains about bigotry and hate and prejudice baselessly cast aspersions on a large group of people in such a hateful way, it just gets to me.\n \n It'd almost be funny to see you coming to such bizarre conclusions from these articles if it wasn't so sad.\n\n \n Just imagine how apoplectic foundit would become if a study BASED ON ONLY 14 PARTICIPANTS IN EACH GROUP CONCLUDED THAT ALL PEDOPHILES WERE ALSO PRACTICING HOMOSEXUALS. Do you think he would accept it as valid then? Of course not. Yet he has no problem apparently with this study which comes to outrageous conclusions which fit with his preferred opinion of conservatives.", 
   {}, 
   368047, 
   null, 
   1251982680.0
  ], 
  [
   368087, 
   null, 
   "ServantOfChrist", 
   "Why do Conservatives have more Nightmares?\n \n Maybe they spend too much time on fear issues in the first place.\n Everybody's got to be afraid of Obama cause he's a socialist / nazi / coming for your guns / secret Muslim / paling around with terrorists / ....\n\n \n How hilarious, Foundit, that you'd start this bigoted little tirade when you only posted ONE PAGE from that link.\n \n Let's have a little look at the second page, and see just how ironic your little hate-fest was here.\n \n \nBulkeley speculated on the reasons for his results in his original paper. He offered two very different scenarios that would both account for his data. He speculates that both interpretations probably have some merit. \n \n Scenario I:The dreams of the people on the political right reveal them to be insecure, anxious, conflict-ridden, and emotionally repressed. When they are not terrified of imaginary threats they cling to the comforts of the status quo. They seek a kind of power through their political views that they lack within their deeper selves. By contrast, the dreams of people on the political left show them to be creative, progressive, and imaginative. They are confident in their abilities and willing to think beyond the boundaries of the present to envision new possibilities for the future. (Bulkeley, 2001)\n \n Scenario II:The dreams of people on the political right reveal them to be highly attuned to the actual dangers and threats of the waking world. These people are realistic, grounded, honest about the frailties of human nature in the face of danger, and appreciative of the good things in present-day life. By contrast, the dreams of people on the political left show them to be irrational, naïve, utopian, and deluded by their own fantasies. These people are out of touch with the real world, and they wish for powers they do not have in actuality. (Bulkeley, 2001)\n \n Since the press reported the 'nightmare' portion of the study many different people have reacted to the results. Bulkeley recently reported the following reactions to his study:\n \n To my surprise and amusement, this little research factoid-\"Republicans have more nightmares than Democrats\"-was quickly seized by political partisans on both sides who did not hesitate to assert their interpretation of my findings. Terry McAuliffe, Democratic National Committee chairman [left], declared \"If George W. Bush were the leader of my party, I'd have trouble sleeping at night, too.\" Not to be outdone in the game of \"dream spinning,\" Kevin Sheridan of the Republican National Committee [right] quickly replied, \"What do you expect after eight years of William Jefferson Clinton?\" The reaction was not limited to politicians in the U.S.: Alexa McDonough, leader of Canada's New Democratic Party (on the left side of the political spectrum), said she was not surprised by the findings of my study because true liberals follow their dreams to find creative solutions for problems: \"The very essence of building a better world starts with dreaming.... Until we get politics being about chasing dreams again, we're going to be causing people a lot of nightmares, and we're mostly going to be implementing right-wing nightmares.\" (Bulkeley, 2001, personal communication). \n \n It's important that we see this study for what it is - an interesting pilot study that suggests some surprising relationships between political ideology and dreams. It makes some sense to me that the worldviews of conservatives and liberals would result in differences in their dreams. It is also possible that the findings of this study are random occurrences - that these only represent the odd dreams of this particular set of people. Until the appropriate statistics can be used on a larger sample, we can't interpret these results beyond these particular 56 people. \n\n \n Perhaps you should read your own source a bit more thoroughly, foundit. emoticon_xbounceremoticon_xbounceremoticon_xbouncer emoticon_embemoticon_emb", 
   {
    "unicode_changes_made": true
   }, 
   367778, 
   null, 
   1252004040.0
  ], 
  [
   368098, 
   null, 
   "foundit66", 
   "Just imagine how apoplectic foundit would become if a study BASED ON ONLY 14 PARTICIPANTS IN EACH GROUP CONCLUDED THAT ALL PEDOPHILES WERE ALSO PRACTICING HOMOSEXUALS.\n\n The article said nothing about \"ALL\" conservatives.\n It just noted a relational comparison.\n One group had a higher correspondence of a trait than another.\n \n And while I have an armada of studies to refute your claim...\n ... I haven't seen anybody try to present any study to refute this situation I am talking about.\n I just presented THREE MORE STUDIES on the issue.\n And I haven't even really tried to dig on the issue yet.\n \n So don't even try to compare your bigoted lunacy, in trying to put pedophilia and homosexuality together, with my position which has no bigotry.\n Your allegations regarding gays and pedophilia are an obvious slur. Political Campaigns have been waged in order to deny gays rights and equality based on such allegations.\n Mine is simply an observation with no such impact.\n \n \n \nDo you think he would accept it as valid then? Of course not. Yet he has no problem apparently with this study which comes to outrageous conclusions which fit with his preferred opinion of conservatives.\n\n Archie, it would be invalid because the BASE CLAIM ITSELF is invalid.\n I have already presented you with TONS of research that shows that gays are no more likely to be pedophiles than straights are.\n Research that shows that adult sexual orientation has NOTHING to do with the gender of a child molestation victim.\n Research that shows that the vast majority of men who molest boys are actually STRAIGHT in their adult sexual interaction.\n \n To date, not a single person has shown any conflicting research on this thread's issue.\n \n \n \nPerhaps you should read your own source a bit more thoroughly, foundit.\n\n And I have presented four other studies on top of that.", 
   {}, 
   368053, 
   null, 
   1252009800.0
  ], 
  [
   368102, 
   null, 
   "Steeeeve", 
   "You label this as \"bigotry\"?\n \n Wow.\n I advocated no discrimination.\n All I did was comment on the observed phenomenon.\n \n I wonder if you would be so quick to classify it as \"bigotry\" if somebody were to do something like, I don't know, maybe criticize homosexuality?\n \n And before you start in with a strawman or false allegations, I have always held that \"bigotry\" is demonstrated by a desire to discriminate against a group.\n Mere criticism is not \"bigotry\".\nI'm sorry, did you wish to comment on what I posted or no?", 
   {}, 
   368040, 
   null, 
   1252014480.0
  ], 
  [
   368105, 
   null, 
   "snakespit", 
   "There is a God. And he doesn't approve of gay sex. And bad things happen to sinful nations and people.\n\n \n How \"Phelpsian\" of you. emoticon_wow\n \n And here I was thinking that your god didn't approve of people who were intolerant and judgemental of others. Silly me. But you must be right...thank god for IED's, and AIDS, and hurricaine Katrina, and dead kids, and dead soldiers, terrorism, etc etc. Cuz...none of these things are bad in and of themselves, they are all simply punishment from god on all of us for the behavior of gays. I guess if we just get rid of all the fags, the rest will take care of itself, and all will be right with the world.", 
   {}, 
   367999, 
   null, 
   1252016700.0
  ], 
  [
   368140, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider:  There is a God. And he doesn't approve of gay sex. And bad things happen to sinful nations and people.\n \n \nHow \"Phelpsian\" of you. \n\n \n No, it's how \"Biblical\" of me. You apparently are ignorant of what the Bible says about gay sex being sinful, and you obviously are totally clueless of the difference between what the Bible teaches and what Phelps teaches. \n \n \nAnd here I was thinking that your god didn't approve of people who were intolerant and judgemental of others. Silly me.\n\n \n Yes, silly you for propagating that revisionist liberal nonsense. Have you never read such passages as John 8:44 (Jesus speaking)?\n \n \"You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.\"\n \n How \"tolerant\" is that, snakespit?\n \n \n But you must be right...thank god for IED's, and AIDS, and hurricaine Katrina, and dead kids, and dead soldiers, terrorism, etc etc. Cuz...none of these things are bad in and of themselves, they are all simply punishment from god on all of us for the behavior of gays. I guess if we just get rid of all the fags, the rest will take care of itself, and all will be right with the world.\n\n \n You're the one calling gays names, not me. Where do you get off doing that?\n \n And there's enough judgments of God on wicked men and nations in the Bible to where you don't need to dream up your own. Just be aware of how he operates. Reading the Book of Judges might help you out.\n \n Now go read Leviticus 18:22; Leviticus 20:13; Romans 1:26-27; 1 Corinthians 6:9-10, and Jude 7, etc., so you won't be as spiritually stunted as Barney Franks.", 
   {}, 
   368105, 
   null, 
   1252022100.0
  ], 
  [
   368141, 
   null, 
   "Brigid", 
   "There is a God. And he doesn't approve of gay sex. And bad things happen to sinful nations and people.\n \n \n\n Bad things happen to EVERYONE, dip****.\n \n I'm sorry that it is your belief that your sadistic God is the one that does all that, and yet very happy I do not believe in such a sadistic, hateful deity. Most people are more moral than your little \"god\".\n \n Dawkins said it best: \"The God of the Old Testament is arguably the most unpleasant character in all fiction: jealous and proud of it; a petty, unjust, unforgiving control-freak; a vindictive, bloodthirsty ethnic cleanser; a misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully\"", 
   {}, 
   367999, 
   null, 
   1252022100.0
  ], 
  [
   368147, 
   null, 
   "Easyrider", 
   "Bad things happen to EVERYONE, dip****.\n\n \n More liberal name-calling. First it was your spiritual brother calling gays fags and now another sewer-mouth exhibition from the land of Oz.\n \n \nI'm sorry that it is your belief that your sadistic God is the one that does all that, and yet very happy I do not believe in such a sadistic, hateful deity. Most people are more moral than your little \"god\".\n\n \n Well, your pagan \"goddess\" Brigid is sitting up there on her broom letting all these things play out so where do you get off? At least God saves everyone who comes to him and gives them eternal life. You and \"Brigid the ficticious pagan goddess harlot\" (who, at best, is just a demon in disguise) just lead people down the road to perdition with your silly \"anything carnal goes\" hedonism.\n \n \nDawkins said it best: \n\n \n Dawkins is a spiritual imbecile who will no doubt spend eternity in hell. How smart is that?", 
   {}, 
   368141, 
   null, 
   1252023720.0
  ], 
  [
   368171, 
   null, 
   "foundit66", 
   "I'm sorry, did you wish to comment on what I posted or no?\n\n I could ask you the same thing...\n I asked you a question you are obviously ignoring: \"Why is it that the personal attacks against me habitually show up when you do?\"\n \n But to your comment, didn't you realize that me giving you THREE MORE STUDIES was actually a comment?\n Study after study after study showing consistent results...\n \n \n \nDawkins said it best: \"The God of the Old Testament is arguably the most unpleasant character in all fiction: jealous and proud of it; a petty, unjust, unforgiving control-freak; a vindictive, bloodthirsty ethnic cleanser; a misogynistic, homophobic, racist, infanticidal, genocidal, filicidal, pestilential, megalomaniacal, sadomasochistic, capriciously malevolent bully\"\n\n And yet, if people even bother to respond to these observations, it's typically a quaint insistence that we assume that God has our best interests at heart and loves us, and that anything to the contrary must be beyond our capability to understand...\n \n ... which has about as much sensibility as saying that God has our worst interests at heart and hates us, and that anything to the contrary must be beyond our capability to understand...", 
   {}, 
   368102, 
   null, 
   1252035060.0
  ], 
  [
   368184, 
   null, 
   "Steeeeve", 
   "I could ask you the same thing...\n I asked you a question you are obviously ignoring: \"Why is it that the personal attacks against me habitually show up when you do?\"\nIs that a no?\n \n \nBut to your comment, didn't you realize that me giving you THREE MORE STUDIES was actually a comment?\n Study after study after study showing consistent results...\nYou didn't show me anything...not on this thread. I just looked and can't find 3 more studies to show conservatives have more nightmares. It is late and I am tired so I'm going to give you the benefit of the doubt that somewhere in these two pages these studies exist so please just put them all together in your next post. Thanks!", 
   {}, 
   368171, 
   null, 
   1252039680.0
  ], 
  [
   368189, 
   null, 
   "foundit66", 
   "Is that a no?\n\n 1) You obviously ducked my question. AGAIN...\n Let me repeat it for you...\n \"Why is it that the personal attacks against me habitually show up when you do?\"\n \n 2) emoticon_xdonno\n That is NOT a \"no\".\n \n I explained within a few sentences that me offering THREE MORE STUDIES was a clear refutation of your whining...\n \n \n \nYou didn't show me anything...not on this thread.\n\n emoticon_xdonno\n Are you pulling that thing where the person puts their fingers in their ears and says \"nah-nah-nah! I can't hear you\" ??\n Or did you just miss the post I am talking about...\n \n Never mind.\n Here it is.\n http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-2.html#post368046\n \n \n \nI just looked and can't find 3 more studies to show conservatives have more nightmares.\n\n Wow.\n Way to take things WAYYYY too literally.\n But I guess you're doing that to, once again, arbitrarily ignore things that are shown to you...\n \n The five studies I have shown now all have a common theme.\n If you want to ignore the common theme, there is no point in me trying to get you to look at them.", 
   {}, 
   368184, 
   null, 
   1252043160.0
  ], 
  [
   368231, 
   null, 
   "Steeeeve", 
   "1) You obviously ducked my question. AGAIN...\n Let me repeat it for you...\nYou mean like you ducking mine?\n \n \nThe five studies I have shown now all have a common theme.\n If you want to ignore the common theme, there is no point in me trying to get you to look at them.\nUp to five now? Good for you!\n \n Common theme? Hmmm, that conservatives are more likely to be conservative in nature?\n \n This bigotry is unreal.", 
   {}, 
   368189, 
   null, 
   1252080060.0
  ], 
  [
   368240, 
   null, 
   "jyoshu", 
   "Uh, oh ... look ...\n \n Women Have More Nightmares Than Men, Study Shows\n \n Guess women just 'spend too much time on fear issues in the first place'. emoticon_rolleyes\n \n (gee, these glaring causality/associative fallacies of Foundit are kinda fun!) emoticon_xangel", 
   {}, 
   367778, 
   null, 
   1252083120.0
  ], 
  [
   368263, 
   null, 
   "simone", 
   "Conservatives are sissified fraidycats who believe every demned lie that comes their way.", 
   {}, 
   367778, 
   null, 
   1252090140.0
  ], 
  [
   368270, 
   null, 
   "Steeeeve", 
   "Uh, oh ... look ...\n \n Women Have More Nightmares Than Men, Study Shows\n \n Guess women just 'spend too much time on fear issues in the first place'. emoticon_rolleyes\n \n (gee, these glaring causality/associative fallacies of Foundit are kinda fun!) emoticon_xangel\nThey also happen more with kids than with adults!!!! If you are 8yr old female conservative you sit in a room shaking with no windows holding a gun at the door. \n \n We should make being a conservative illegal! Think of the kids jyoshu!", 
   {}, 
   368240, 
   null, 
   1252092060.0
  ], 
  [
   368298, 
   null, 
   "Easyrider", 
   "Conservatives are sissified fraidycats who believe every demned lie that comes their way.\n\n \n <Flush<\n \n We're the ones who fight the wars while you live off our sacrifices. \n \n Now be a good little bed-wetting liberal and bow down to Obama.", 
   {}, 
   368263, 
   null, 
   1252105140.0
  ], 
  [
   368347, 
   null, 
   "JPSartre12", 
   "Conservatives are sissified fraidycats who believe every demned lie that comes their way.\n\n \n No, WE'RE the ones waving the BS flag at Obamacare. ;)\n We, obviously, don't believe that lie.", 
   {}, 
   368263, 
   null, 
   1252119000.0
  ], 
  [
   368412, 
   null, 
   "snakespit", 
   "Originally Posted by Easyrider:  There is a God. And he doesn't approve of gay sex. And bad things happen to sinful nations and people.\n\n First off, you can offer no proof of this statement. None. \n \n \nNo, it's how \"Biblical\" of me. You apparently are ignorant of what the Bible says about gay sex being sinful, and you obviously are totally clueless of the difference between what the Bible teaches and what Phelps teaches. \n \n Yes, silly you for propagating that revisionist liberal nonsense. Have you never read such passages as John 8:44 (Jesus speaking)?\n \n \"You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.\"\n \n How \"tolerant\" is that, snakespit?\n \n You're the one calling gays names, not me. Where do you get off doing that?\n \n And there's enough judgments of God on wicked men and nations in the Bible to where you don't need to dream up your own. Just be aware of how he operates. Reading the Book of Judges might help you out.\n \n Now go read Leviticus 18:22; Leviticus 20:13; Romans 1:26-27; 1 Corinthians 6:9-10, and Jude 7, etc., so you won't be as spiritually stunted as Barney Franks.\n\n \n Actually, I have read the bible cover to cover. So before you accuse me of ignorance again and give me a list of suggested reading...please remember that I have already read it. I doubt that I will find it any more enlightening or interesting the second time than I did the first time. \n \n And all of your biblical citations don't change the fact that you believe in god as Phelps does, you believe that god does not approve of gay sex as Phelps does, and you believe that bad things happen to sinful nations and people as Phelps does. Perhaps you choose to paint it in a color slightly more appealing than Phelps does, but in the end you are still using god as an excuse for your narrow-minded bigotry...just like Phelps. So when I said \"how Phelpsian of you\", I meant it. \n \n And I am so sorry if my use of the word \"XXX\" bothers you so much. It was used for emphasis, and being Phelp's favorite term...I found it appropriate. I myself don't associate the word XXX with a negative connotation as others seem to do. What bothers me are the bigots like Phelps and those who share his views of intolerance...not innocent words. Sadly, no matter what word I use to refference homosexuals...you still view it in a negative connotation, which is your problem...not mine.", 
   {}, 
   368140, 
   null, 
   1252216800.0
  ], 
  [
   368413, 
   null, 
   "snakespit", 
   "Conservatives are sissified fraidycats who believe every demned lie that comes their way.\n\n \n \n<Flush<\n \n We're the ones who fight the wars while you live off our sacrifices. \n \n Now be a good little bed-wetting liberal and bow down to Obama.\n \n \n And seriously you two...grow up. \n \n Isn't it a funny paradox that the use of sweeping generalizations only goes to show how narrow minded and myopic one is?", 
   {}, 
   368263, 
   null, 
   1252217220.0
  ], 
  [
   368444, 
   null, 
   "simone", 
   "<Flush<\n \n We're the ones who fight the wars while you live off our sacrifices. \n \n Now be a good little bed-wetting liberal and bow down to Obama.\n\n No!\n \n You are the bedwetting cons who get five deferments from military service like Richard Bruce Cheney, or get into the cushy and very safe Champagne Corps of the Air National Guard in Texas like George Walker Bush whose daddy's pull saved him from serving in Vietnam.\n \n Scratch just about any conservative and you'll find a scaredycat who never did a lick of military service.\n \n While liberals were in uniform and battle.\n \n Stop the stupid hypocrisy!", 
   {}, 
   368298, 
   null, 
   1252262400.0
  ], 
  [
   368472, 
   null, 
   "foundit66", 
   "You mean like you ducking mine?\n\n Are you still incapable of cognizantly recognizing that my response to your criticism of my study was to give you MORE studies with the same general observation?\n That supported my conclusion.\n \n No. You're just ducking my ADDITIONAL proof with this pointless behavior whereas you continue to duck BOTH my question, AND the answer to your question.\n \n \n \nUp to five now? Good for you!\n Common theme? Hmmm, that conservatives are more likely to be conservative in nature?\n This bigotry is unreal.\n\n How is it \"bigotry\"?\n All I am doing is criticizing one aspect of some conservatives' approach.\n And the conclusion from the other study was NOT \"that conservatives are more likely to be conservative in nature\", unless you think showing how fear factors into making one a conservative is an innate part of conservatism... emoticon_wow\n \n \n \nUh, oh ... look ...\n Women Have More Nightmares Than Men, Study Shows\n Guess women just 'spend too much time on fear issues in the first place'.\n (gee, these glaring causality/associative fallacies of Foundit are kinda fun!) \n\n I can't help but wonder if a lack of logic is one common failing for some conservatives.\n Just because for one group characteristic_A lead to B doesn't mean that for another group that has B, it has to be \"characteristic_A\" again.\n \n That's like saying \"John arrived in Buffalo. He went by train\".\n \"Mark arrived in Buffalo. He must have gone by train as well.\"\n There is no logic in your approach jyoshu.", 
   {}, 
   368231, 
   null, 
   1252269960.0
  ], 
  [
   368586, 
   null, 
   "Easyrider", 
   "I can't help but wonder if a lack of logic is one common failing for some conservatives.\n\n \n Hey - your liberal California is the place going down the tubes, not Texas or anyplace that practices conservative values.\n \n In fact, it's worse out in Zombieland than most people realize. As reported by By JUDY LIN of the Associated Press - September 6, 2009, and the Democratic Underground:\n \n Two out of five working-age Californians jobless, study says\n \n Two out of five working-age Californians jobless, study says - Democratic Underground\n \n That's 40% of working age Californians out of work.\n \n So it's not conservatives who are a full quart low on logic, but the liberal left, who in addition to having a stunted understanding of how things work, are also woefully lacking in GODLY WISDOM on top of that.\n \n You liberals are bankrupting America. Go home and stay there.", 
   {}, 
   368472, 
   null, 
   1252325340.0
  ], 
  [
   368612, 
   null, 
   "jyoshu", 
   "... but the liberal left, who in addition to having a stunted understanding of how things work, are also woefully lacking in GODLY WISDOM on top of that.\n\n \n What?? You mean fallaciously ascribing unfounded causalities to begin with is lacking in wisdom? Whoda thunk that?? [/sarcasm] emoticon_xangel", 
   {}, 
   368586, 
   null, 
   1252342080.0
  ], 
  [
   368644, 
   null, 
   "JPSartre12", 
   "No!\n \n You are the bedwetting cons who get five deferments from military service like Richard Bruce Cheney, or get into the cushy and very safe Champagne Corps of the Air National Guard in Texas like George Walker Bush whose daddy's pull saved him from serving in Vietnam.\n \n Scratch just about any conservative and you'll find a scaredycat who never did a lick of military service.While liberals were in uniform and battle.\n Stop the stupid hypocrisy!\n\n \n If that's true, then why is it always the Democrats who continuously try to block the counting of military votes every election cycle?", 
   {}, 
   368444, 
   null, 
   1252361760.0
  ], 
  [
   368666, 
   null, 
   "foundit66", 
   "Hey - your liberal California is the place going down the tubes, not Texas or anyplace that practices conservative values.\n\n Way to try to change the subject, in a way that is completely not obvious at all... emoticon_rolleyes\n \n But to briefly address (and refute) your complaint, let me put this obvious problem (mentioned in the article) forth...Asked to explain the difference between her unemployment figure and the government's, Ross said the government's official jobless rate does not factor in working-age Californians who stay out of the work force by choice, such as stay-at-home parents, or those who have simply given up searching for work.\n That's right.\n The \"40%\" figure you are trumpeting includes Californians who CHOOSE to stay home and raise the kids, and in a variety of other ways are SELF-DESIRED unemployed...\n That would also conceivably include people going to school. So if a college kid is concentrating on schooling without a job, they count him as unemployed.\n An absurd way to count those numbers, and of course you endorse it heartily!\n \n \n \nSo it's not conservatives who are a full quart low on logic, but the liberal left, who in addition to having a stunted understanding of how things work, are also woefully lacking in GODLY WISDOM on top of that.\n You liberals are bankrupting America. Go home and stay there.\n\n See the above.\n You embrace obviously flawed logic.\n If we employed the same standards to ANY RED STATE, the numbers would similarly jump for every housewife that stays at home.\n For every mother who homeschools her kid.\n \n You think you are exposing the logical problems of liberals, but it is your own thinking problems which you expose...\n ROFLMAO!\n \n \n \nWhat?? You mean fallaciously ascribing unfounded causalities to begin with is lacking in wisdom? Whoda thunk that?? [/sarcasm] \n\n First, I'm not surprised that you didn't catch Easyrider's obvious error either.\n Instead, you obviously started cheer-leading away... emoticon_rolleyes\n \n Secondly? I have repeatedly explained that my comment is a HYPOTHESIS.\n You claim \"unfounded\", yet you offer NO CONTRADICTORY EXPLANATION.\n You offer no refutation of my assessment.\n Instead, like you often do, you simply whine that I made the assessment in the first place...\n \n Do you understand what a \"hypothesis\" is?\n Do you see any actual PROBLEM with the hypothesis, other than your emotional outbursts of not liking what it is?\n Nah. Didn't think so...", 
   {}, 
   368586, 
   null, 
   1252372500.0
  ], 
  [
   368670, 
   null, 
   "jyoshu", 
   "LOL ... \n \n A \"hypothesis\"? \n \n Ok.\n \n Here's a hypothesis (certainly a no less plausible one) .... Foundit has a hate problem toward conservatives, so he trolls Google as well as a plethora of left-wing blogs and websites for anything he can dredge up that he can try to use and spin into something negative about conservatives. Like an article on nightmares that he can theorize is due to spending \"too much time on fear issues\".\n \n (Now, before he gets all hot and bothered, folks, it IS a hypothesis, after all. (ahem) Just like F admitted the basis of this silly thread is.)", 
   {}, 
   368666, 
   null, 
   1252375320.0
  ], 
  [
   368674, 
   null, 
   "foundit66", 
   "LOL ... \n A \"hypothesis\"? \n Ok.\n Here's a hypothesis (certainly a no less plausible one) .... Foundit has a ...\n\n This \"hypothesis\" of yours is completely unrelated to the point of the thread...\n \n In fact, I believe YOUR term for the tactic you are currently employing is \"FOPIOI\".\n Focusing\n On\n Posters\n Instead\n Of\n Issues\n \n That is something you often complain about, but then again you're often guilty of it as well...\n Perhaps you could start a \"Foundit66\" thread and post this comment of yours there???\n \n As for my actual hypothesis regarding the outcome of these studies and the causal issue behind them, you offer no topical response on that. Instead, you go about attacking me some more...\n Not surprised... emoticon_xdonno", 
   {}, 
   368670, 
   null, 
   1252376340.0
  ], 
  [
   368680, 
   null, 
   "jyoshu", 
   "Calm down; it's just a hypothesis. emoticon_xangel\n \n My point was to make you realize the offensiveness and unfounded nature of your \"hypothesis.\"\n \n Obviously it went right over your head. You keep wanting someone to try and deal with something unfounded to begin with.\n It's like someone saying \"hey, the planet is flat. What? No, you need to provide evidence that it's not flat!\"\n \n Give some proof of causality to begin with, and then we'll talk.", 
   {}, 
   368674, 
   null, 
   1252379400.0
  ], 
  [
   368683, 
   null, 
   "foundit66", 
   "Calm down; it's just a hypothesis. emoticon_xangel\n\n And again you try to make your imagination of my emotional state a topic of discussion, INSTEAD OF THE ACTUAL TOPIC.\n \n I am calm.\n Calmly recognizing your hypocrisy and refusal to stick to your own standards.\n \n \n \nMy point was to make you realize the offensiveness and unfounded nature of your \"hypothesis.\"\n\n Huh???\n You provide a PERSONAL focus on me, as opposed to a generic observation about SOME conservatives...\n And you automatically think the two are equitable???\n \n And moreover, note how you fail to address the VERACITY of the observation.\n Instead, you try to complain about how much you are \"offended\" by it...\n \n Oh my.\n If this were the gay threads it would be about time for you to ask if it was possible for anybody to criticize homosexuality... emoticon_wow\n \n \n \nYou keep wanting someone to try and deal with something unfounded to begin with.\n\n \"unfounded\"?\n Why is it unfounded?\n It's an obvious correlation. Conservatives are clearly more involved in issues of \"fear-mongering\". One could easily note that there are pundits who make a living off of such approaches.\n \n \n \nIt's like someone saying \"hey, the planet is flat. What? No, you need to provide evidence that it's not flat!\"\n\n I happily admit it's just at the hypothesis stage.\n But it does seem to be a rather obvious conclusion.\n \n On the issue of \"planet is flat\", we already have evidence that statement is true so your analogy is decidedly false, unless you can provide evidence that my hypothesis is somehow proven false...\n \n Nah.\n You want people to ASSUME it false, ignoring how it all fits and you have no viable retort except for you to start throwing out personal comments you admit are \"offensive\"... emoticon_xdonno\n \n \n \nGive some proof of causality to begin with, and then we'll talk.\n\n Do you understand what a \"hypothesis\" is in the first place?\n As it is, it is the most viable hypothesis. It fits the observations of the situation.\n \n If somebody wants to ignore the viable hypothesis that makes sense, in order of favoring somebody's opinion who starts out with personal offensive comments and refuses to broach the actual issue, that's their prerogative...", 
   {}, 
   368680, 
   null, 
   1252380600.0
  ], 
  [
   368686, 
   null, 
   "Symbiote", 
   "As it is, it is the most viable hypothesis. It fits the observations of the situation.\n\n \n There are an almost infinite number of hypothesis that fit the situation. What makes this one \"most viable\"?\n \n Oh I know, the fact that it fits with your bigoted attitude.\n \n Confirmation bias is an irrational tendency to search for, interpret or remember information in a way that confirms one's preconceptions or working hypotheses. It is a type of cognitive bias and a systematic error of inductive reasoning. These biases in information processing are distinguished from the behavioral confirmation effect (also called self-fulfilling prophecy), in which a person's expectations influence their own behavior.[1]\n \n http://en.wikipedia.org/wiki/Confirmation_bias\n \n I gather from your responses you have never actually studied science or statistics - you didn't appear to understand the correlation/causation fallacy and continue to repeat it here \"It's an obvious correlation\"", 
   {}, 
   368683, 
   null, 
   1252383900.0
  ], 
  [
   368690, 
   null, 
   "foundit66", 
   "There are an almost infinite number of hypothesis that fit the situation.\n\n I have yet to hear any but the one I have thrown out there.\n Instead, people have attempted to attack the messenger instead of looking at the actual message.\n \n Your reply, as is predictable based on most of your posts, is more of that same.\n \n \n \nI gather from your responses you have never actually studied science or statistics - you didn't appear to understand the correlation/causation fallacy and continue to repeat it here \"It's an obvious correlation\"\n\n As you often do, you fail to comprehend my point.\n My attempt with that statement was to move past the \"causation\" issue, which you guys can't seem to address competitively in the first place, to simply getting people to admit there is at least a correlation.\n \n Evidently you understood the difference between \"correlation / causation\", but then failed to accurately recognize the reason why I chose the former word instead of repeating (as I have shown in a long list of posts in the past) the \"causation\" term which causes too many to flip out and go on the offensive.\n \n Can you at least admit there is a correlation between the conservative fear-mongering and the observations that these studies have demonstrated?", 
   {}, 
   368686, 
   null, 
   1252385160.0
  ], 
  [
   368693, 
   null, 
   "Symbiote", 
   "So you admit you have no education in science or statistics and are creatively interpreting these results based on nothing but your own pre-existing biases?\n \n \nadmit there is at least a correlation.\n\n \n A correlation between what? The studies you have linked to have shown many different correlations... you seem to want to blend these into a single \"theme\"... that isn't how science works.\n \n \nCan you at least admit there is a correlation between the conservative fear-mongering and the observations that these studies have demonstrated?\n\n \n I don't know, and I don't know if that even makes sense. Can you define \"conservative fear-mongering\" in a measurable way? Correlations can only exist between things with numerical properties.\n \n I don't think you even know what a hypothesis is. \"Republicans are more fearful than Democrats on average\" is a potential hypothesis. A bit broad, so it may be difficult to test, but a hypothesis nevertheless.\n \n \"Republicans spend too much time on fear-based issues\" isn't a hypothesis, it isn't even a truth claim. It's a bigoted value judgement that is inherently unscientific. \"Too much\" has no scientific meaning. This isn't a claim that demands \"alternative hypotheses\", it's a childish prejudice that deserves nothing but contempt.", 
   {}, 
   368690, 
   null, 
   1252385940.0
  ], 
  [
   368696, 
   null, 
   "foundit66", 
   "So you admit you have no education in science or statistics and are creatively interpreting these results based on nothing but your own pre-existing biases?\n\n You are one of those people whereby you saying a phrase like \"So you admit ...\" inevitably is followed by something the other person NEVER EVEN HINTED AT.\n No. I admit no such thing.\n I actually have a bachelors in engineering and a masters in applied math.\n \n You obviously never passed fifth grade reading to gain even the most rudimentary form of reading comprehension.\n \n \n \nA correlation between what? The studies you have linked to have shown many different correlations... you seem to want to blend these into a single \"theme\"... that isn't how science works.\n\n Again, I only talked about a HYPOTHESIS.\n Nothing tested by science.\n Do you understand the word \"hypothesis\"???\n \n Moreover, I can't help but notice you have failed to answer my question, AND at the same time you have demonstrated another failure in your reading comprehension...\n \n You ask this question, and then YOU FULLY QUOTE the answer to your question...\n \nCan you at least admit there is a correlation between the conservative fear-mongering and the observations that these studies have demonstrated?\n\n \nI don't know, and I don't know if that even makes sense. Can you define \"conservative fear-mongering\" in a measurable way? Correlations can only exist between things with numerical properties.\n\n ROFLMAO!\n Sweetie?\n LOOK AT THE STUDY they are working on, which talked about \"conservative\" and \"liberal\".\n Are those defined by numbers???\n \n You obviously fail at even a rudimentary example of trying to apply abstract reasoning, and instead you need things in numbers....\n \n \n \nI don't think you even know what a hypothesis is. \"Republicans are more fearful than Democrats on average\" is a potential hypothesis. A bit broad, so it may be difficult to test, but a hypothesis nevertheless.\n \"Republicans spend too much time on fear-based issues\" isn't a hypothesis, it isn't even a truth claim.\n\n Please. Quote me where I claimed THAT was my hypothesis.\n \n Nope. You can't do it.\n You are AGAIN working on a strawman argument.\n \n It is painfully obvious you lack even the rudimentary skills of reading comprehension, and you make up for it by endlessly guessing as to what other people are saying, with the intent of making their arguments weaker by postulating absurd and unbased allegations of their position.", 
   {}, 
   368693, 
   null, 
   1252386960.0
  ], 
  [
   368701, 
   null, 
   "Symbiote", 
   "Did you ever do a statistics course in those degrees? Or a subject that employed the experimental method? It doesn't seem so...\n \n For something to be a scientific hypothesis it has to be testable, at least theoretically. Value judgements are not testable. The idea that conservatives are \"too\" anything is not a hypothesis.\n \n All correlations are mathematical. Someone can be mathematically coded as \"conservative\" or \"liberal\", they are coded as 1 of 2 values, typically 1 or 0, and you can then run a correlation between those values and other numerical values.\n \n Alternatively they might rank themselves on a scale of 1 to 10, either way, it has to be in numbers to correlate.\n \n You can't correlate \"Conservative fearmongering\" with \"nightmares\" unless you have some way of turning \"conservative fearmongering\" into numbers.\n \n Please consult your local library for more on statistics. With your background in maths I'm sure you would be capable of picking it up, if you were actually interested in anything other than expressing your bigoted views.", 
   {}, 
   368696, 
   null, 
   1252387500.0
  ], 
  [
   368704, 
   null, 
   "foundit66", 
   "Did you ever do a statistics course in those degrees? Or a subject that employed the experimental method? It doesn't seem so...\n\n You keep avoiding simple responses to your arguments, as you toss off assessments that you give no real basis for.\n And actually, you keep avoiding my questions as you toss out more of your own that have no real point other than demonstrating your reading comprehension difficulties.\n Yes. I have taken statistics courses.\n \n \n \nFor something to be a scientific hypothesis it has to be testable, at least theoretically. Value judgements are not testable. The idea that conservatives are \"too\" anything is not a hypothesis.\n\n And again we get back to your reading comprehension failure.\n WHAT YOU CLAIMED was my hypothesis WAS NOT my hypothesis.\n How many times do I have to repeat that before you grasp it?\n \n \n \nAll correlations are mathematical. Someone can be mathematically coded as \"conservative\" or \"liberal\", they are coded as 1 of 2 values, typically 1 or 0, and you can then run a correlation between those values and other numerical values.\n\n My gawd.\n You would actually attempt to provide a \"correlation\" to a binary condition, ignoring shades of the political spectrum...\n And you accuse me of being unscientific for your lack of reading comprehension...\n \n The really pathetic part of this is that one of my variables was obviously defined IN THE ACTUAL STUDIES I discussed.\n I almost said \"we\" discussed, but then I realized that to date you have refused to make any cogent comment on them.\n \n The other factor could easily be quantified by asking participants questions about their fears on current conditions and prospective future conditions. Rating different potential attitudes on a scale from afraid to not a concern.\n \n The really pathetic part of this?\n I am talking about something psychologists routinely do, but you evidently seem to think it's impossible and unquantifiable!\n \n \n \nAlternatively they might rank themselves on a scale of 1 to 10, either way, it has to be in numbers to correlate.\n You can't correlate \"Conservative fearmongering\" with \"nightmares\" unless you have some way of turning \"conservative fearmongering\" into numbers.\n\n And the really sad part here is that it only takes a smidgen of intellectual awareness to recognize that the previous studies OBVIOUSLY DID turn \"nightmares\" into a quantitative comparison metric.\n Duh!\n \n And as for \"conservative fear-mongering\", that is also easily achievable.", 
   {}, 
   368701, 
   null, 
   1252388220.0
  ], 
  [
   368705, 
   null, 
   "Symbiote", 
   "My gawd.\n You would actually attempt to provide a \"correlation\" to a binary condition\n ignoring shades of the political spectrum...\n And you accuse me of being unscientific\n\n \n That isn't what I \"would\" do, it's what the article you're talking about did do. Smart move calling the study you are citing unscientific, you're onto a winner there.\n \n Ironically it is actually scientific to use a binary code, so you are wrong on that too.\n \n You're only going to make yourself look like a fool arguing about stats with me.\n \n \nWHAT YOU CLAIMED was my hypothesis WAS NOT my hypothesis.\n\n \n Sorry what was your hypothesis again? I keep forgetting with all the backpedalling you are doing. You began talking about \"your hypothesis\" in your third post in this thread, the only things you had said previously were\n \n a)Maybe they spend too much time on fear issues in the first place.\n \n b) Everybody's got to be afraid of Obama cause he's a socialist / nazi / coming for your guns / secret Muslim / paling around with terrorists / ....\n \n I figured a) was your hypothesis, but maybe it's really b)\n \n You tell me.", 
   {}, 
   368704, 
   null, 
   1252388400.0
  ], 
  [
   368710, 
   null, 
   "foundit66", 
   "That isn't what I \"would\" do, it's what the article you're talking about did do. Smart move calling the study you are citing unscientific, you're onto a winner there.\n\n Wow. Again with your reading comprehension problems.\n I never called the study I cited unscientific.\n I mentioned YOUR comment as unscientific.\n \n \n \nIronically it is actually scientific to use a binary code, so you are wrong on that too.\n\n Again, you fail at reading comprehension...\n My point was clearly given as \"ignoring shades of the political spectrum...\"\n \n \n \nYou're only going to make yourself look like a fool arguing about stats with me.\n\n Your failures in reading comprehension make a lot of \"other\" people look foolish.\n \n \n \nSorry what was your hypothesis again? I keep forgetting with all the backpedalling you are doing. You began talking about \"your hypothesis\" in your third post in this thread, the only things you had said previously were\n a)Maybe they spend too much time on fear issues in the first place.\n b) Everybody's got to be afraid of Obama cause he's a socialist / nazi / coming for your guns / secret Muslim / paling around with terrorists / ....\n I figured a) was your hypothesis, but maybe it's really b)\n You tell me.\n\n I explained my hypothesis.\n You ignore my questions.\n You misrepresent a variety of things that I NEVER ALLEGED were hypotheses...\n \n And now you insist you want my hypothesis. Again.\n \n Time for you to start bucking up and answering some questions of your own.\n Without quid pro quo, this discussion is useless...\n Well... More useless than a conversation with you should be...\n \n Show me WHERE I said either of the above were a \"hypothesis\".\n Cause until you start taking the care to READ what is being said, I'm just going to waste time repeating things to you...", 
   {}, 
   368705, 
   null, 
   1252390080.0
  ], 
  [
   368711, 
   null, 
   "Symbiote", 
   "I never called the study I cited unscientific.\n\n \n Well you said binary coding of political perspectives and then correlating those would be unscientific... but that's what the study you cited does...\n \n \nShow me WHERE I said either of the above were a \"hypothesis\".\n\n \n You never said anything was your hypothesis, so it would be stupid to distinguish what is and isn't your hypothesis on this basis... \n \n Are you sure you have studied statistics, I really can't believe it..", 
   {}, 
   368710, 
   null, 
   1252391400.0
  ], 
  [
   368712, 
   null, 
   "foundit66", 
   "You never said anything was your hypothesis, so it would be stupid to distinguish what is and isn't your hypothesis on this basis... \n\n And so that means you lied and claimed I said something was my hypothesis...\n Thanks for proving my point.\n \n \n \nAre you sure you have studied statistics, I really can't believe it..\n\n You spend wayyyy too much time and energy misrepresenting people's statements to the extent that nothing resembles what they actually said.\n So what you \"can't believe\" is endless...", 
   {}, 
   368711, 
   null, 
   1252392180.0
  ], 
  [
   368745, 
   null, 
   "jyoshu", 
   "Please. Quote me where I claimed THAT was my hypothesis. [the part everyone is taking issue with here and the part that Foundit now won't own up to]\n\n \n \n Wow. Symbiote has your number on this one.\n You're in full-out back-pedal mode here, huh?\n \n Again, give some proof of causality about THAT claim, and then we'll talk. Not whatever you're shifting to as your \"hypothesis\" to avoid having to back up the claim you made in your first post.", 
   {}, 
   368696, 
   null, 
   1252422360.0
  ], 
  [
   368750, 
   null, 
   "JPSartre12", 
   "Let's look at some of the other correlations that were found in the study:\n \n People on the left were more likely to have females as characters in their dreams, while people on the right dreamed twice as much about male characters as about female characters. \n \n = more homosexuals on the Left.\n \n People on the left had fewer familiar characters, fewer friends, more family members, and fewer animals; people on the right had more familiar characters, more friends, fewer family members, and more animals.  \n \n = Nobody likes Leftists but their mothers. Even dogs don't like them. \n \n People on the left were less often the initiator of aggressive interactions in their dreams, and their aggression was less physical in nature; people on the right were more often the aggressors in their dreams, and their aggression was more often physical. \n \n = Leftists are pansies that rely on people on the right to protect them.\n \n \n People on the left had a greater number of dreams involving friendliness and good fortune, and fewer dreams involving misfortune; people on the right had a greater number of dreams with misfortunes, and fewer dreams with friendliness and good fortune. \n \n = Leftists are inherently delusional. Reality sucks\n \n Male rights had the lowest percentage of family members and instances of sexuality, and the highest percentage of animal characters and being the aggressor. \n \n = Leftists have more wet dreams. \n \n Male lefts had the highest frequency of female characters, and the fewest instances of aggression. \n \n = like I said above, pansies.\n \n \n Female lefts had the lowest percentage of being the aggressor in their dreams, and the highest frequency of friendliness and good fortunes. \n \n = Lefty women are teases\n \n Female rights had the highest frequency of sexual interactions and physical aggression.\n \n = Right women like sex with men. \n \n There, now tell me why my explanations are any more/less valid than the bozo that did the original study. \n \n Tomorrow, I'm going to give a hypothesis for the correlation between full moons and hemmorhoids. emoticon_rolleyes", 
   {}, 
   368745, 
   null, 
   1252427160.0
  ], 
  [
   368808, 
   null, 
   "foundit66", 
   "Wow. Symbiote has your number on this one.\n\n And Jyoshu is in full cheer-leader mode...\n \n \n \nYou're in full-out back-pedal mode here, huh?\n\n What the heck did I supposedly back-peddle on?\n Please. Be explicit.\n \n No wait. You're not going to answer that, are you...\n \n \n \nAgain, give some proof of causality about THAT claim, and then we'll talk. Not whatever you're shifting to as your \"hypothesis\" to avoid having to back up the claim you made in your first post.\n\n ROFLMAO!\n Symbiote runs around proclaiming all sorts of things (falsely) as my supposed hypothesis, and you pretend that me refusing to take up her strawman approach is somehow \"back-peddling\"?\n \n More like the blind leading the blind, walking in circles and thinking they are travelling quickly!\n \n As for proof, do you understand what \"hypothesis\" means in the first place?\n Look it up.", 
   {}, 
   368745, 
   null, 
   1252452660.0
  ], 
  [
   368809, 
   null, 
   "foundit66", 
   "There, now tell me why my explanations are any more/less valid than the bozo that did the original study.\n \n Tomorrow, I'm going to give a hypothesis for the correlation between full moons and hemmorhoids. \n\n The original study actually asked about the number of conservatives and liberals.\n On the flip side, you assume that having more girls in a GUYS dream means he's gay.\n On the flip side, you think a person having animals absent in that man's dream somehow means the animals hate him.\n \n NOTHING you said made sense.\n The study's comments were quantified.\n \n \n In the big picture, you have said absolutely nothing to give a competing theory ON THE TOPIC.", 
   {}, 
   368750, 
   null, 
   1252453020.0
  ], 
  [
   368832, 
   null, 
   "foundit66", 
   "Look, foundit got called on being a bigot...those of us who normally are rational and can call out folks we often agree with(archy) will see this for what it is.\n\n Ad hominem?\n \n Or am I giving you to much credit in recognizing that is PRECISELY what this is...", 
   {}, 
   368809, 
   null, 
   1252466820.0
  ], 
  [
   368840, 
   null, 
   "Symbiote", 
   "Use the edit button, there's no need to triple post.", 
   {}, 
   368832, 
   null, 
   1252471260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why do Conservatives have more Nightmares?", 
  "url": "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13223, 
  "discussion_files": [
   [
    "20226.html", 
    "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-print.html"
   ], 
   [
    "20227.html", 
    "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-5-print.html"
   ], 
   [
    "20228.html", 
    "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-4-print.html"
   ], 
   [
    "20229.html", 
    "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-3-print.html"
   ], 
   [
    "20230.html", 
    "http://www.4forums.com/political/politics-debates/13223-why-do-conservatives-have-more-nightmares-2-print.html"
   ]
  ], 
  "identifier": 13223
 }
]