[
 [
  [
   369012, 
   null, 
   "Tither", 
   "  Federal judge rules police cannot detain people for openly carrying guns \n On September 8, 2009, United States District Judge Bruce D. Black of the United States District Court for New Mexico entered summary judgment in a civil case for damages against Alamogordo, NM police officers.X The Judge's straight shootin' message to police:X Leave open carriers alone unless you have \"reason to believe that a crime [is] afoot.\"\n \n The facts of the case are pretty simple.X Matthew St. John entered an Alamogordo movie theater as a paying customer and sat down to enjoy the movie. XHe was openly carrying a holstered handgun, conduct which is legal in 42 states, and requires no license in Mexico and twenty-five other states.\n \n XIn response to a call from theater manager Robert Zigmond, the police entered the movie theater, physically seized Mr. St. John from his seat, took him outside, disarmed him, searched him, obtained personally identifiable information from his wallet, and only allowed him to re-enter the theater after St. John agreed to secure his gun in his vehicle.XXMr. St. John was never suspected of any crime nor issued a summons for violating any law.X\n \n On these facts, Judge Black concluded as a matter of law that the police violated Matthew St. John's constitutional rights under the Fourth AmendmentXbecause they seized and disarmed himXeven though there was not \"any reason to believe that a crime was afoot.\"X Judge Black's opinion is consistent with numerous high state and federal appellate courts, e.g., the United States Supreme Court in Florida v. J.L. (2000) (detaining man on mere report that he has a gun violates the Fourth Amendment) and the Washington Appeals Court in State v. Casad (2004) (detaining man observed by police as openly carrying rifles on a public street violates the Fourth Amendment).\n \n Notably, Judge Black denied the police officers' requested \"qualified immunity,\" a judicially created doctrine allowing government officials acting in good faith to avoid liability for violating the law where the law was not \"clearly established.\"X In this case, Judge Black concluded that\n \n \"[r]elying on well-defined Supreme Court precedent, the Tenth Circuit and its sister courts have consistently held that officers may not seize or search an individual without a specific, legitimate reason. . . . The applicable law was equally clear in this case. Nothing in New Mexico law prohibited Mr. St. John from openly carrying a firearm in the Theater.X Accordingly, Mr. St. John's motion for summary judgment is granted with regard to his Fourth Amendment and New Mexico constitutional claims. Defendants' motion for summary judgment is denied with regard to the same and with regard to qualified immunity.\"\n\n Cities in Ohio, and other places where tarry stops are common, take notice. YOU are the law breakers. Not people Open Carrying firearms. \n \n Sorry but, Ignorance of the law is no excuse! emoticon_smile", 
   {
    "post_info": {
     "post_title": "Federal judge rules police cannot detain people for openly carrying guns"
    }
   }, 
   null, 
   null, 
   1252600980.0
  ], 
  [
   369013, 
   null, 
   "Penfold", 
   "What price activist judges?", 
   {}, 
   369012, 
   null, 
   1252601460.0
  ], 
  [
   369014, 
   null, 
   "Tither", 
   "What price activist judges?\n\n \n I think you may have missed this part of the article. \nHe was openly carrying a holstered handgun, conduct which is legal in 42 states, and requires no license in Mexico and twenty-five other states.\n\n \n It is the law, and our state's Constitutions. All we Americans ask is for everyone to Obey the Law! I think even you would have to agree with that statement. emoticon_smile", 
   {}, 
   369013, 
   null, 
   1252602120.0
  ], 
  [
   369018, 
   null, 
   "sinjin", 
   "The theatre is private property. They can disallow guns on the premises. \n Escorting him out was likely legal and they let him back in without his gun.\n Only detaining him outside and searching him seems to have been a violation of his rights.", 
   {}, 
   369014, 
   null, 
   1252608600.0
  ], 
  [
   369021, 
   null, 
   "NATO 556", 
   "What price activist judges?\n\n \n Judicial activism? What brand of stupid is it that you use? What judicial activism do you see here; the judge stating that open carry is legal and has been, and that you can't be arrested when you haven't committed a crime? Or that the police can be sued for damages when they choose to break the law to persecute an innocent bystander?", 
   {}, 
   369013, 
   null, 
   1252608840.0
  ], 
  [
   369022, 
   null, 
   "NATO 556", 
   "The theatre is private property. They can disallow guns on the premises. \n Escorting him out was likely legal and they let him back in without his gun.\n Only detaining him outside and searching him seems to have been a violation of his rights.\n\n \n Well if the theater has the right to have patrons forcibly removed by the police for doing something they don't like, then they should be required to post signs at their entrances, listing practices that they won't tolerate you doing while on their property.", 
   {}, 
   369018, 
   null, 
   1252608900.0
  ], 
  [
   369023, 
   null, 
   "sinjin", 
   "Well if the theater has the right to have patrons forcibly removed by the police for doing something they don't like, then they should be required to post signs at their entrances, listing practices that they won't tolerate you doing while on their property.\n\n \n Question: If I have my gun holstered in &#8220;plain view&#8221; on my belt will I be breaking the law?\n \n Answer: New Mexico is an Open Carry State, meaning it is legal to carry a loaded weapon as long as it is not concealed. However, it is not legal to carry any firearm in any federal building, school, state building, or licensed liquor establishment. It is the responsibility of the person carrying the firearm to be informed as to when/where carrying is prohibited.\n New Mexico DPS | Concealed & Carry Information", 
   {}, 
   369022, 
   null, 
   1252610100.0
  ], 
  [
   369024, 
   null, 
   "NATO 556", 
   "Question: If I have my gun holstered in \"plain view\" on my belt will I be breaking the law?\n \n Answer: New Mexico is an Open Carry State, meaning it is legal to carry a loaded weapon as long as it is not concealed. However, it is not legal to carry any firearm in any federal building, school, state building, or licensed liquor establishment. It is the responsibility of the person carrying the firearm to be informed as to when/where carrying is prohibited.\n New Mexico DPS | Concealed & Carry Information\n\n \n You can't be informed when it comes to private businesses that're open to the public, unless they choose to post signs explaining their position. So if the theater and other places don't want people carrying guns in their establishments, then they should be required by law to post notices at the entrances.", 
   {
    "unicode_changes_made": true
   }, 
   369023, 
   null, 
   1252610880.0
  ], 
  [
   369025, 
   null, 
   "Tither", 
   "Question: If I have my gun holstered in &#8220;plain view&#8221; on my belt will I be breaking the law?\n \n Answer: New Mexico is an Open Carry State, meaning it is legal to carry a loaded weapon as long as it is not concealed. However, it is not legal to carry any firearm in any federal building, school, state building, or licensed liquor establishment. It is the responsibility of the person carrying the firearm to be informed as to when/where carrying is prohibited.\n New Mexico DPS | Concealed & Carry Information\n\n Well Duh! And yes the Theater owner had the right to ask him to leave. The dispatcher, who should be up on the law, could have and should have informed the owner of his options. \n \n The point is, that the man carrying a gun, which is lawful, rights, were violated by the LOE's actions.\n \n This is the same treatment that Legal Open Carriers of Ohio have received. Tarry stops for someone Openly Carrying are Illegal! So says the Ohio AG, as well as this Federal judge.\n \n Just because one has a Right does not automatically mean that they get to enjoy it, and or it's immunities. Often times you have to fight your own town, state, government, or whoever, in a court of law in order to secure your Right to do something.", 
   {}, 
   369023, 
   null, 
   1252610940.0
  ], 
  [
   369027, 
   null, 
   "Penfold", 
   " .. What brand of stupid is it that you use?..... \n\n \n I don't know, yours is overwhelming, who gave it to you?", 
   {}, 
   369021, 
   null, 
   1252611480.0
  ], 
  [
   369028, 
   null, 
   "sinjin", 
   "You can't be informed when it comes to private businesses that're open to the public, unless they choose to post signs explaining their position. So if the theater and other places don't want people carrying guns in their establishments, then they should be required by law to post notices at the entrances.\nOne should call ahead to make sure you can carry. Bet those calls would be fun to take.", 
   {}, 
   369024, 
   null, 
   1252611900.0
  ], 
  [
   369030, 
   null, 
   "Tither", 
   "One should call ahead to make sure you can carry. Bet those calls would be fun to take.\n\n Not really necessary. I'll bet a ton of Police departments all over this country are informing their dispatchers on the law because of this case! \n \n If you are an business owner, and you don't like Open Carry, you can ask someone to leave or post. But that could be a risky decision since dollar bills are walking out of your store, with the request! emoticon_smile", 
   {}, 
   369028, 
   null, 
   1252612200.0
  ], 
  [
   369032, 
   null, 
   "sinjin", 
   "If you are an business owner, and you don't like Open Carry, you can ask someone to leave or post. But that could be a risky decision since dollar bills are walking out of your store, with the request! emoticon_smile\nHow many patrons would get up and walk out if they noticed the man sitting next to them was strapped? \n If I was there with my kids I might. \n What's with them gunslinger at the mall fantasy anyway?", 
   {}, 
   369030, 
   null, 
   1252612560.0
  ], 
  [
   369033, 
   null, 
   "Tither", 
   "I live in a really good community, and since most people who try Open Carry do so with tape recorders, and I did not want my police department to be caught unaware that if they act, well, not exactly in accordance with the law, that they might end up in a Jackpot. \n \n Our Chief made it a point to instruct our offices and dispatchers on the law regarding Open carry, and one would not have an unpleasant experience since our Chief said he and his department intend to Obey the Law! \n \n Man! What an excellent concept! What a great community I live in! I wish I could say that for all.", 
   {}, 
   369030, 
   null, 
   1252612680.0
  ], 
  [
   369036, 
   null, 
   "Tither", 
   "How many patrons would get up and walk out if they noticed the man sitting next to them was strapped? \n If I was there with my kids I might. \n What's with them gunslinger at the mall fantasy anyway?\n\n Sinjin, it is really simple as far as I am concerned. All we are asking is for everyone to obey the law. You are welcome to do what you wish, but why do fear law abiding citizens being armed, and acting in an extremely lawful way? \n \n My advice is, If you don't like the laws, try and get your laws changed, otherwise, please obey them! That is my thoughts.", 
   {}, 
   369032, 
   null, 
   1252613040.0
  ], 
  [
   369039, 
   null, 
   "sinjin", 
   "...but why do fear law abiding citizens being armed, and acting in an extremely lawful way?\nI worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n \nMy advice is, If you don't like the laws, try and get your laws changed, otherwise, please obey them! That is my thoughts. \nIn California we ask that you leave your gun at home when taking the kiddies to the movies. Silly us.", 
   {}, 
   369036, 
   null, 
   1252613700.0
  ], 
  [
   369048, 
   null, 
   "Doc Jones", 
   "I worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n In California we ask that you leave your gun at home when taking the kiddies to the movies. Silly us.\n\n \n Are you ashamed of your other rights enshrined in the BOR also? No worry about blowing up your free speech rights by claiming \"wearing a sidearm and making veiled threats of assassination\". I believe the conspiracy will be exposed before long and your fears for the dear great leader will no longer exist.\n http://canadafreepress.com/index.php/article/14583\n \n In kalifornia? Here is your sign :)\n \n BTW, you still getting to work a couple of days a week in that liberal bastion of no freedoms?", 
   {}, 
   369039, 
   null, 
   1252616340.0
  ], 
  [
   369049, 
   null, 
   "NATO 556", 
   "I worry about armed people with such poor judgement. People willing to frighten people to make a point.\n\n \n Then why don't you show the same fear of people who drive cars? What's to keep them from driving into a crowd full of children as school lets out? What makes motor vehicle operators any safer or more trustworthy?\n \n \nPeople who stand where the President will pass wearing a sidearm and making veiled threats of assassination.\n\n \n And exactly what threats are you accusing gun owners of making?\n \n Do you really think that any gun owner would actually make attempts to assassinate Obama? The last time there was a high-profile assassination, we got the Gun Control Act of 1968, it nearly wiped us out of existence. No honest gun owner is going to try and implement a plan to bring about the next mass gun control law being passed, we're too smart for that.\n \n If anyone would benefit from Obama getting killed, it'd be the liberal side of the debate, then they would have room to play the blame game all they wanted and pass whatever retaliatory law they wanted. If anybody's gonna kill the presidents it's likely going to be his own political party.", 
   {}, 
   369039, 
   null, 
   1252616460.0
  ], 
  [
   369051, 
   null, 
   "Doc Jones", 
   "Then why don't you show the same fear of people who drive cars? What's to keep them from driving into a crowd full of children as school lets out? What makes motor vehicle operators any safer or more trustworthy?\n\n \n I wonder what he will do when he is making a photo op amoung our armed troops in foreign lands? How does a politician get elected and take an oath to the Constitution then deny rights for anyone but himself?", 
   {}, 
   369049, 
   null, 
   1252616940.0
  ], 
  [
   369054, 
   null, 
   "Tither", 
   "In California we ask that you leave your gun at home when taking the kiddies to the movies. Silly us.\n\n All right! Now THAT is the way to do it! Make a law! \n \n Now That's Legal!\n \n You just don't put someone down on the ground and point your guns at someone because you don't like the law, even though what the perp. is perpatrating is, in fact, 100% legal, and in some states like Ohio, a Constitutional Right!\n \n Where is anyone's wold is that Fair? \n \n OK Sinjin, we don't like your Computer use! Up against the Wall Matha Freeka! \n \n But its my Right! \n \n Not today Scum Bag! emoticon_smile\n \n Sorry. Too many old cop shows! emoticon_smile", 
   {}, 
   369039, 
   null, 
   1252618620.0
  ], 
  [
   369055, 
   null, 
   "Doc Jones", 
   "All right! Now THAT is the way to do it! Make a law! \n \n Now That's Legal!\n \n You just don't put someone down on the ground and point your guns at someone because you don't like the law, even though what the perp. is perpatrating is, in fact, 100% legal, and in some states like Ohio, a Constitutional Right!\n \n Where is anyone's wold is that Fair? \n \n OK Sinjin, we don't like your Computer use! Up against the Wall Matha Freeka! \n \n But its my Right! \n \n Not today Scum Bag! emoticon_smile\n \n Sorry. Too many old cop shows! emoticon_smile\n\n \n He could solve all his problems if people like him would accept my simple compromise. Then he wouldn't have to admit his childish fears to his wife and children. It would be a Utopia for his type. Gee, they could go hand in hand together and maybe even round up enough to take every seat in a movie theater so they could watch without p**** their pants. It must get old to have your 10 yr. old ask, \"Daddy, did you mess your pants again?\" emoticon_xgood", 
   {}, 
   369054, 
   null, 
   1252619100.0
  ], 
  [
   369056, 
   null, 
   "Doc Jones", 
   "He could solve all his problems if people like him would accept my simple compromise. Then he wouldn't have to admit his childish fears to his wife and children. It would be a Utopia for his type. Gee, they could go hand in hand together and maybe even round up enough to take every seat in a movie theater so they could watch without p**** their pants. It must get old to have your 10 yr. old ask, \"Daddy, did you mess your pants again?\" emoticon_xgood\n\n \n Maybe the theater could put aside a separate group of chairs for those who do not exercise their 2A rights? One day a week where the real mall ninjas, the unarmed tough guys, can go without seeing the signs of freedom on people's hips or wherever? King George would have loved that too.", 
   {}, 
   369055, 
   null, 
   1252619580.0
  ], 
  [
   369057, 
   null, 
   "sinjin", 
   "He could solve all his problems if people like him would accept my simple compromise. Then he wouldn't have to admit his childish fears to his wife and children. It would be a Utopia for his type. Gee, they could go hand in hand together and maybe even round up enough to take every seat in a movie theater so they could watch without p**** their pants. It must get old to have your 10 yr. old ask, \"Daddy, did you mess your pants again?\" emoticon_xgood\nWill you put a sign on your lawn saying \"I have thousands in guns stored unsecured inside\"?\n \n I never said I feared people with guns on their hips Durward, only that they worry me.", 
   {}, 
   369055, 
   null, 
   1252620420.0
  ], 
  [
   369058, 
   null, 
   "sinjin", 
   " I believe the conspiracy will be exposed before long and your fears for the dear great leader will no longer exist.\n http://canadafreepress.com/index.php/article/14583\nYou're a \"Birther\" too Doc? Why am I not surprised.", 
   {}, 
   369048, 
   null, 
   1252620540.0
  ], 
  [
   369059, 
   null, 
   "Doc Jones", 
   "Will you put a sign on your lawn saying \"I have thousands in guns stored unsecured inside\"?\n \n I never said I feared people with guns on their hips Durward, only that they worry me.\n\n \n You said: Quote:\n Originally Posted by sinjin \n I worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n Slipped in your own slime there bubba! Frighten isn't fear in kalifornia?\n \n Nope, no signs for me! You people are the believers and all problems will be solved when you post the signs that you have no firearms and don't believe in violence. Why the criminals will just pass you by and go to the next house where they know they can score a cheap .38 or better. No worries mate.", 
   {}, 
   369057, 
   null, 
   1252620960.0
  ], 
  [
   369060, 
   null, 
   "Doc Jones", 
   "You're a \"Birther\" too Doc? Why am I not surprised.\n\n \n Heck, I got more documentation on my goats than he does. You astroturfers might be in for a bit more than you bargained for? Got milk?emoticon_xgood", 
   {}, 
   369058, 
   null, 
   1252621140.0
  ], 
  [
   369061, 
   null, 
   "OldSarge", 
   "I don't know, yours is overwhelming, who gave it to you?\n\n \n The comic relief doesn't even recognize it has passed in on, or attempted to!", 
   {}, 
   369027, 
   null, 
   1252621380.0
  ], 
  [
   369062, 
   null, 
   "sinjin", 
   "You said: Quote:\n Originally Posted by sinjin \n I worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n Slipped in your own slime there bubba! Frighten isn't fear in kalifornia?\nThose who might be frightened need not include myself.\n \n \nNope, no signs for me! You people are the believers and all problems will be solved when you post the signs that you have no firearms and don't believe in violence.\nI'm a big fan of violence.", 
   {}, 
   369059, 
   null, 
   1252621440.0
  ], 
  [
   369063, 
   null, 
   "OldSarge", 
   "Will you put a sign on your lawn saying \"I have thousands in guns stored unsecured inside\"?\n \n I never said I feared people with guns on their hips Durward, only that they worry me.\n\n \n In your case I believe that means the same. Why else would you go on with the same tired drivel that has been beaten into the dirt over and over.", 
   {}, 
   369057, 
   null, 
   1252621740.0
  ], 
  [
   369064, 
   null, 
   "zsu2357", 
   "You said: Quote:\n Originally Posted by sinjin \n I worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n Slipped in your own slime there bubba! Frighten isn't fear in kalifornia?\n \n Nope, no signs for me! You people are the believers and all problems will be solved when you post the signs that you have no firearms and don't believe in violence. Why the criminals will just pass you by and go to the next house where they know they can score a cheap .38 or better. No worries mate.\n\nhttp://www.4forums.com/political/images/smilies/msn%2013.gif\n \n \n Think maybe all the bad guys will leave Oregon for the DPRK?lot safer there\n :)", 
   {}, 
   369059, 
   null, 
   1252621800.0
  ], 
  [
   369066, 
   null, 
   "Doc Jones", 
   "Those who might be frightened need not include myself.\n\n \n You write about it so much and now admit it is all propaganda? You make statements for others on their behalf too which is known as (wait for it) a lie!\n \n [QUOTEI'm a big fan of violence.[/QUOTE]\n \n I have found most people that are violent and want disarmed victims are inclined toward illegal acts and tyranny. That is the way it always is and has been in the past. Maybe NATO can put your quote in right below BRADY?", 
   {}, 
   369062, 
   null, 
   1252622100.0
  ], 
  [
   369067, 
   null, 
   "sinjin", 
   "Heck, I got more documentation on my goats than he does.\nLike this no doubt:\n World Net Daily, Free Republic Post Forged Obama Birth Certificate From Kenya | Crooks and Liars", 
   {}, 
   369060, 
   null, 
   1252622280.0
  ], 
  [
   369069, 
   null, 
   "Doc Jones", 
   "http://www.4forums.com/political/images/smilies/msn%2013.gif\n \n \n Think maybe all the bad guys will leave Oregon for the DPRK?lot safer there\n :)\n\n \n \n Depends! (just that one word for the DPRK) Buy them in boxes :)\n \n Kalifornia is so broke they are letting felons out on the street and the libs got taxes so high already poor old sinjin got to take script IOU's. They better make a law in a hurry to cover theft of IOU's :) \"He stole my script\" OK \"we will put him in jail overnight then he can leave\"", 
   {}, 
   369064, 
   null, 
   1252622580.0
  ], 
  [
   369071, 
   null, 
   "sinjin", 
   "You write about it so much and now admit it is all propaganda?\nAbout what? I've never said guns scare me. They don't as a matter of fact. Now people that think like you are another matter.\n \n \nYou make statements for others on their behalf too which is known as (wait for it) a lie!\nActually it's not. It's called advocacy.\n \n \nI have found most people that are violent and want disarmed victims are inclined toward illegal acts and tyranny.\nI have found most armchair patriots to be maladjusted loners and cowards with persecution complexes.", 
   {}, 
   369066, 
   null, 
   1252622760.0
  ], 
  [
   369072, 
   null, 
   "sinjin", 
   "...the libs got taxes so high already poor old sinjin got to take script IOU's.\nOur Governor ain't a lib and I've not gotten any IOU's as of yet.", 
   {}, 
   369069, 
   null, 
   1252622880.0
  ], 
  [
   369074, 
   null, 
   "Doc Jones", 
   "Like this no doubt:\n World Net Daily, Free Republic Post Forged Obama Birth Certificate From Kenya | Crooks and Liars\n\n \n \n I checked the properties and it is from your prime reading class assignment as an Acorn member. world-nut-daily ...LOL I wonder if old Van is going to work there now? :)\n \n We got more czars now than the Romonov dynasty. Et Tu Brute?", 
   {}, 
   369067, 
   null, 
   1252623060.0
  ], 
  [
   369075, 
   null, 
   "zsu2357", 
   "And to think crazies like this help run(or ruin)the U.S.government this is scary.\n \n \n More From The Guns Center...\n Anti-Gun Radical Cass Sunstein Could Ban Hunting\n \n By Gun Owners of America , A No-Compromise Gun Rights Organization - September 08, 2009\n Icoemail3\n Comments(47) | (0)\n Cass-sunstein-250x200_300wide_240high\n Related Articles\n \n * \"Radical\" Cass Sunstein Will Try to Get U.S. to Give Up Meat\n * Keep Anti-Hunting Cass Sunstein Out of the White House\n * After Cops Shot, Columbus Proves Assault Weapons Ban Was Smart\n * New Brady Campaign Report Shows Danger of Gun Shows\n \n Just when you thought the news about the Obama administration couldn't get any worse, gun owners find themselves needing to rally the troops once again.\n \n This time it's the proposed \"Regulatory Czar\" who will be coming to a vote this week in the U.S. Senate.\n \n His name is Cass Sunstein, and he holds some of the kookiest views you will ever hear.\n \n For starters, Sunstein believes in regulating hunting out of existence. He told a Harvard audience in 2007 that \"we ought to ban hunting.\" And in The Rights of Animals: A Very Short Primer (2002), he said:\n \n I think we should go further ... the law should impose further regulation on hunting, scientific experiments, entertainment, and (above all) farming to ensure against unnecessary animal suffering. It is easy to imagine a set of initiatives that would do a great deal here, and indeed European nations have moved in just this direction. There are many possibilities.\n \n If that's all Sunstein believed, he would be dangerous and extreme, but not necessarily kooky. Unfortunately, when you look at WHY he wants to restrict hunting, this is where he goes beyond extreme.\n \n In Sunstein's world, animals should have just as many rights as people ... and they should be able to sue humans in court!\n \n \"We could even grant animals a right to bring suit without insisting that animals are persons, or that they are not property,\" Sunstein said on page 11 of Animal Rights: Current Debates and New Directions (2004).\n \n Well, that's a relief ... he is at least willing to concede that animals are not persons! But he would still have animals suing humans, apparently, with more enlightened humans representing the cuddly critters.\n \n Imagine returning from a successful hunting trip ... only to find out that you've been subpoenaed for killing your prize. Who knows, maybe Sunstein would have the family of the dead animal serving as witnesses in court!\n \n By the way, if you're wondering what he thinks about the Second Amendment right to keep and bear arms, you won't be surprised to know that Sunstein is a huge supporter of gun control.\n \n In Radicals in Robes: Why Extreme Right-Wing Courts are Wrong for America (2005), Sunstein says:\n \n Almost all gun control legislation is constitutionally fine.... [O]n the Constitution's text, fundamentalists [that is, gun rights supporters] should not be so confident in their enthusiasm for invalidating gun control legislation.\n \n Hmm, what part of \"shall not be infringed\" does Sunstein not understand?\n \n Imagine the power that Sunstein could have as the Regulatory Czar -- the nickname for the person heading the Office of Information and Regulatory Affairs (OIRA) in the White House.\n \n As the Regulatory Czar, he could bring about changes in the regulations that affect hunting, gun control and farming. In short, he could make your life hell.\n \n Senator Saxby Chambliss (R-GA) objected to his nomination several weeks ago, preventing him from being unanimously confirmed.\n \n That means that the Senate will now need to garner 60 votes to confirm this radical, kooky choice to the OIRA.\n \n No doubt, many of the people our President wants to associate with are radical kooks. First, there was the Rev. Jeremiah Wright ... then there was the self-avowed communist (Van Jones) who was nominated for the Green Jobs Czar ... now, there's an extreme animal rights activist who wants to take away our guns and get Bambi to sue us in court.\n \n It's time to take a STRONG STAND against this radical administration. \n \n emoticon_icemoticon_xdonnoemoticon_wow", 
   {
    "post_info": {
     "post_title": "What a goon ball."
    }
   }, 
   369072, 
   null, 
   1252623240.0
  ], 
  [
   369076, 
   null, 
   "Doc Jones", 
   "Well sinjin, you can emoticon_cry and moan and rip your garments and wail but it will not change that judge's decision! The 9th Circuit is even getting some sense. You can gripe all day but it is all for naught. The 2A is finally getting treated as the right it is and there is nothing you can do about it short of a revolution and I don't think you have many followers? Your being a loner and hoping for a benevolent dictator doesn't appear to be in the cards. You can always eat cake :)", 
   {}, 
   369074, 
   null, 
   1252623420.0
  ], 
  [
   369077, 
   null, 
   "sinjin", 
   "Well sinjin, you can emoticon_cry and moan and rip your garments and wail but it will not change that judge's decision! The 9th Circuit is even getting some sense. You can gripe all day but it is all for naught. The 2A is finally getting treated as the right it is and there is nothing you can do about it short of a revolution and I don't think you have many followers? Your being a loner and hoping for a benevolent dictator doesn't appear to be in the cards. You can always eat cake :)\nOne problem. I support the 2A.", 
   {}, 
   369076, 
   null, 
   1252623840.0
  ], 
  [
   369078, 
   null, 
   "sinjin", 
   "I checked the properties and it is from your prime reading class assignment as an Acorn member. world-nut-daily ...LOL I wonder if old Van is going to work there now? :)\n \n We got more czars now than the Romonov dynasty. Et Tu Brute?\nAcorn member? Me?", 
   {}, 
   369074, 
   null, 
   1252623900.0
  ], 
  [
   369079, 
   null, 
   "Doc Jones", 
   "One problem. I support the 2A.\n\n \n \n OH YEAH! That is very evident emoticon_xbouncer Certainly a good thing you aren't an outright gun control freak huh? You fell off that fence on the left side long ago with a sore crotch.\n \n It has been fun but I got chores to do. :bye", 
   {}, 
   369077, 
   null, 
   1252624140.0
  ], 
  [
   369085, 
   null, 
   "sinjin", 
   "And exactly what threats are you accusing gun owners of making?\n\"It is time to water the tree of liberty\" is not a quote, it's a threat.", 
   {}, 
   369049, 
   null, 
   1252625700.0
  ], 
  [
   369086, 
   null, 
   "sinjin", 
   "All right! Now THAT is the way to do it! Make a law! \n \n Now That's Legal!\nSo you are not of the opinion that all gun regulations are infringement of your Constitutional rights?", 
   {}, 
   369054, 
   null, 
   1252625820.0
  ], 
  [
   369093, 
   null, 
   "NATO 556", 
   "\"It is time to water the tree of liberty\" is not a quote, it's a threat.\n\n \n No, that's based on a statement made by the Founders of this nation, the ones who made it great; before it got ruined.\n \n An actual threat would be people showing up with torches and pitchforks and a rope. Or a sign stating \"It's time for lynchin' the Ni**er!\" or something along those lines. But those who are tired of government intrusion and growing, and carrying guns while attending public debates, don't amount to threats of any sort.\n \n And when a British guy is telling you that something isn't a threat, when we have a history of making a mountain out of a molehill, that says something.", 
   {}, 
   369085, 
   null, 
   1252628160.0
  ], 
  [
   369095, 
   null, 
   "NATO 556", 
   "One problem. I support the 2A.\n\n \n One problem. I've never seen you voicing support for anything pro-Second Amendment related. You've never denounced a single gun control law of any sort, you just say how great they are and how much good we'd get from them.", 
   {}, 
   369077, 
   null, 
   1252628220.0
  ], 
  [
   369096, 
   null, 
   "sinjin", 
   "One problem. I've never seen you voicing support for anything pro-Second Amendment related. You've never denounced a single gun control law of any sort, you just say how great they are and how much good we'd get from them.\nSupport for the RKBA does not require me to agree with your opinion on any particular law.", 
   {}, 
   369095, 
   null, 
   1252628820.0
  ], 
  [
   369099, 
   null, 
   "NATO 556", 
   "Support for the RKBA does not require me to agree with your opinion on any particular law.\n\n \n Perhaps not, but it does require you to disagree with some of these inane laws that try and get passed into law. Like registration of ammunition, or a bullet tax, or a ban on firearm designs that've been around since the start of the 20th century, or any of these other jack@$$ standards that'll never do any good.", 
   {}, 
   369096, 
   null, 
   1252631640.0
  ], 
  [
   369103, 
   null, 
   "sinjin", 
   "I hereby denounce any gun law found unConstitutional by SCOTUS.\n \n Which existing laws do you support Nato? You must agree with some.", 
   {}, 
   369099, 
   null, 
   1252634940.0
  ], 
  [
   369123, 
   null, 
   "NATO 556", 
   "I hereby denounce any gun law found unConstitutional by SCOTUS.\n\n \n So you're going to stop advocating mandatory storage laws?\n \n \nWhich existing laws do you support Nato? You must agree with some.\n\n \n I support the laws that maximize judicial punishment for criminals that're caught while in possession of a firearm. I support the laws that would effectively lock up gun traffickers for the rest of their lives. I support laws that prevent people from being intoxicated while being armed.\n \n I agree with laws, but only if they'll be used against genuine criminals exclusively. Anything else and their only purpose is to harass innocent, law-abiding people and punish them for technicalities and paperwork errors.", 
   {}, 
   369103, 
   null, 
   1252645620.0
  ], 
  [
   369135, 
   null, 
   "Nozza1", 
   "One problem. I support the 2A.\n\n \n Wow I think we must just be confused by the fact you openly abuse those who support guns in the hands of law abiding citizens.\n \n Stop saying that gun control works then when the facts show it does not.", 
   {}, 
   369077, 
   null, 
   1252648320.0
  ], 
  [
   369198, 
   null, 
   "Tither", 
   "So you are not of the opinion that all gun regulations are infringement of your Constitutional rights?\n\n You misunderstand, and probably on purpose. At least if it is a law prohibiting such, one does not go out expecting to be treated like the law-abiding citizen that they are! \n \n When one has a Ohio Supreme Court decision, Klein v. Leis, which was incidentally referenced by the Supreme Court in Heller, plus the Ohio AG's memo going to every police station in the state stating that Open Carry is a Right of Ohioans recognized by our Constitution, that is PROOF Positive that one is absolutely in the Right. And now we have a Federal Court decision stating the obvious. \n \n No one should be made to feel shame for following both our laws, and Ohio's Constitution. When they do, something must be wrong that needs to be fixed. This Federal Court decision, tells us exactly who the wrong are! And it ain't us! emoticon_smile \n \n All we ask is for everyone to obey the laws and our Constitutions! Tarry stops are illegal. \n   Color of Law \n Preventing abuse of this authority, however, is equally necessary to the health of our nation's democracy. That's why it's a federal crime for anyone acting under \"color of law\" willfully to deprive or conspire to deprive a person of a right protected by the Constitution or U.S. law. \"Color of law\" simply means that the person is using authority given to him or her by a local, state, or federal government agency. \n\n All we ask is for everyone to obey the laws and our Constitutions! Otherwise we have anarchy!", 
   {
    "unicode_changes_made": true
   }, 
   369086, 
   null, 
   1252685580.0
  ], 
  [
   369201, 
   null, 
   "sinjin", 
   "So you're going to stop advocating mandatory storage laws?\nNot for unattended firearms. I do not support storage requirements that would deny reasonably quick access for self-defense.", 
   {}, 
   369123, 
   null, 
   1252688220.0
  ], 
  [
   369203, 
   null, 
   "NATO 556", 
   "Not for unattended firearms. I do not support storage requirements that would deny reasonably quick access for self-defense.\n\n \n the Supreme Court allowed for no such standard of exception, such as unattended firearms. Their ruling was that mandatory storage was unconstitutional, thus illegal. Not under certain circumstances, but outright.", 
   {}, 
   369201, 
   null, 
   1252689420.0
  ], 
  [
   369204, 
   null, 
   "JPSartre12", 
   "I don't know, yours is overwhelming, who gave it to you?\n\n \n Another drive-by troll....\n \n \nI worry about armed people with such poor judgement. People willing to frighten people to make a point. People who stand where the President will pass wearing a sidearm and making veiled threats of assassination. \n \n In California we ask that you leave your gun at home when taking the kiddies to the movies. Silly us.\n\n \n That's because you live in a state full of pantywaistes, fruits and nuts. Here in the Midwest, we don't fear law-abiding citizens carrying guns. Silly me, but I feel safer knowing that there are law-abiding citizens packing heat and not just criminals doing so.", 
   {}, 
   369039, 
   null, 
   1252689480.0
  ], 
  [
   369207, 
   null, 
   "sinjin", 
   "the Supreme Court allowed for no such standard of exception, such as unattended firearms. Their ruling was that mandatory storage was unconstitutional, thus illegal. Not under certain circumstances, but outright.\nSimply untrue. Their ruling was that safe storage that denies access for self-defense is unConstitutional. Not all safe storage laws. That's why storage laws in various states are still in effect. CA for instance.", 
   {}, 
   369203, 
   null, 
   1252689780.0
  ], 
  [
   369208, 
   null, 
   "sinjin", 
   "That's because you live in a state full of pantywaistes, fruits and nuts.\nBe that as it may...\n We've got much better chicks. \n And weather.\n \n \nHere in the Midwest, we don't fear law-abiding citizens carrying guns. Silly me, but I feel safer knowing that there are law-abiding citizens packing heat and not just criminals doing so. \nApparently some New Mexico theater operators do not share your sentiments.", 
   {}, 
   369204, 
   null, 
   1252690200.0
  ], 
  [
   369209, 
   null, 
   "Doc Jones", 
   "Be that as it may...\n We've got much better chicks. \n And weather.\n \n Apparently some New Mexico theater operators do not share your sentiments.\n\n \n Apparently they haven't gotten the message that we don't have to ride in the back of the bus anymore nor use the exit for an entrance. What part of a civil right are you struggling with?\n \n Still mad because you didn't get your 40 acres and a mule? emoticon_xclown", 
   {}, 
   369208, 
   null, 
   1252691220.0
  ], 
  [
   369210, 
   null, 
   "Doc Jones", 
   "Apparently they haven't gotten the message that we don't have to ride in the back of the bus anymore nor use the exit for an entrance. What part of a civil right are you struggling with?\n \n Still mad because you didn't get your 40 acres and a mule? emoticon_xclown\n\n \n \n We can also use the same water fountain as you and your kids, go shopping in the same stores, drive the same roads and go to political rallies and even form special interest groups.\n \n You getting the idea yet?", 
   {}, 
   369209, 
   null, 
   1252692060.0
  ], 
  [
   369211, 
   null, 
   "Doc Jones", 
   "We can also use the same water fountain as you and your kids, go shopping in the same stores, drive the same roads and go to political rallies and even form special interest groups.\n \n You getting the idea yet?\n\n \n Quit encouraging discrimination! Stop teaching your kids to be afraid of us \"darkies\". Old prejudices die hard and it is time you stopped!", 
   {}, 
   369210, 
   null, 
   1252692360.0
  ], 
  [
   369219, 
   null, 
   "JPSartre12", 
   "Be that as it may...\n We've got much better chicks. \n And weather.\n\n \n Fake tits, droughts, forest fires. And if you've ever ridden a farmer's daughter, you'd know that CA chicks got no staying power. Once their nails are dry, you have to get off. ;)\n \n \n\n Apparently some New Mexico theater operators do not share your sentiments.\n\n \n Maybe they fear too many illegals will be openly carrying in their theaters? You border states can't seem to do anything right. ;)", 
   {}, 
   369208, 
   null, 
   1252694160.0
  ], 
  [
   369227, 
   null, 
   "sinjin", 
   "Apparently they haven't gotten the message that we don't have to ride in the back of the bus anymore nor use the exit for an entrance. What part of a civil right are you struggling with?\nNone really. Seems a hassle to me to have to constantly be putting my sidearm in the trunk every time I want to enter a private establishment that asks that I not bring a pistol inside. You do as you wish.\n \nStill mad because you didn't get your 40 acres and a mule? emoticon_xclown \n \nI'm not sure I qualified for that one.", 
   {}, 
   369209, 
   null, 
   1252695780.0
  ], 
  [
   369228, 
   null, 
   "sinjin", 
   "We can also use the same water fountain as you and your kids, go shopping in the same stores, drive the same roads and go to political rallies and even form special interest groups.\n \n You getting the idea yet?\nThe idea I'm getting is \"local ordinance\".", 
   {}, 
   369210, 
   null, 
   1252696080.0
  ], 
  [
   369229, 
   null, 
   "Doc Jones", 
   "None really. Seems a hassle to me to have to constantly be putting my sidearm in the trunk every time I want to enter a private establishment that asks that I not bring a pistol inside. You do as you wish.\n I'm not sure I qualified for that one.\n\n \n You would be more happy if everyone wore a sheet with eyeholes in it?\n \n A civil right is a civil right!", 
   {}, 
   369227, 
   null, 
   1252696200.0
  ], 
  [
   369230, 
   null, 
   "sinjin", 
   "Fake tits, droughts, forest fires. And if you've ever ridden a farmer's daughter, you'd know that CA chicks got no staying power. Once their nails are dry, you have to get off. ;)\n \n \n \n Maybe they fear too many illegals will be openly carrying in their theaters? You border states can't seem to do anything right. ;)\nGod bless you JP. \n We need more people like you need more snow.", 
   {}, 
   369219, 
   null, 
   1252696260.0
  ], 
  [
   369231, 
   null, 
   "Doc Jones", 
   "The idea I'm getting is \"local ordinance\".\n\n \n Yeah, they tried that at Selma, Alabama too.", 
   {}, 
   369228, 
   null, 
   1252696320.0
  ], 
  [
   369234, 
   null, 
   "sinjin", 
   "You would be more happy if everyone wore a sheet with eyeholes in it?\nI seem to be able to pick them out even when they're out of uniform. Thanks anyway.emoticon_xclown", 
   {}, 
   369229, 
   null, 
   1252696680.0
  ], 
  [
   369235, 
   null, 
   "sinjin", 
   "Yeah, they tried that at Selma, Alabama too.\nTombstone too if the movies don't lie.:)", 
   {}, 
   369231, 
   null, 
   1252696800.0
  ], 
  [
   369237, 
   null, 
   "Doc Jones", 
   "I seem to be able to pick them out even when they're out of uniform. Thanks anyway.emoticon_xclown\n\n \n I am certain you can! Thanks for the admission but it was plain without it. You can't deny it is a civil right any longer. Keep on keeping on emoticon_xclown", 
   {}, 
   369234, 
   null, 
   1252697220.0
  ], 
  [
   369238, 
   null, 
   "Doc Jones", 
   "I am certain you can! Thanks for the admission but it was plain without it. You can't deny it is a civil right any longer. Keep on keeping on emoticon_xclown\n\n \n Well, ol' doc gotta go doctor some more sick puppies. Been fun dispelling myths and prejudice here today emoticon_xgood", 
   {}, 
   369237, 
   null, 
   1252697460.0
  ], 
  [
   369242, 
   null, 
   "Bryan", 
   "  Federal judge rules police cannot detain people for openly carrying guns \n Cities in Ohio, and other places where tarry stops are common, take notice. YOU are the law breakers. Not people Open Carrying firearms. \n \n Sorry but, Ignorance of the law is no excuse! emoticon_smile\n\n \n \n Let me interject a little 4th. Amendment primer here....\n \n The terms \"Terry stops\" and \"Terry frisks\" come from the landmark case of Terry v. Ohio, 392 U.S. 1 (1968). Cases often hinge on the particular facts involved, and the facts in Terry were: \n \n \"A Cleveland detective (McFadden), on a downtown beat which he had been patrolling for many years, observed two strangers (petitioner and another man, Chilton) on a street corner. He saw them proceed alternately back and forth along an identical route, pausing to stare in the same store window, which they did for a total of about 24 times. Each completion of the route was followed by a conference between the two on a corner, at one of which they were joined by a third man (Katz) who left swiftly. Suspecting the two men of \"casing a job, a stick-up,\" the officer followed them and saw them rejoin the third man a couple of blocks away in front of a store. The officer approached the three, identified himself as a policeman, and asked their names. The men \"mumbled something,\" whereupon McFadden spun petitioner around, patted down his outside clothing, and found in his overcoat pocket, but was unable to remove, a pistol. The officer ordered the three into the store. He removed petitioner's overcoat, took out a revolver, and ordered the three to face the wall with their hands raised. He patted down the outer clothing of Chilton and Katz and seized a revolver from Chilton's outside overcoat pocket. He did not put his hands under the outer garments of Katz (since he discovered nothing in his pat-down which might have been a weapon), or under petitioner's or Chilton's outer garments until he felt the guns. The three were taken to the police station. Petitioner and Chilton were charged with carrying concealed weapons. The defense moved to suppress the weapons.\" \n \n From these facts we developed the law involving temporary stops and pat downs of citizens. The law regarding \"Terry stops\" can be best summarized as follows:\n \n \"[A]n officer who has a reasonable, articulable suspicion that criminal activity is afoot may conduct a brief, investigatory stop. While \"reasonable suspicion\" is a less demanding standard than probable cause, there must be at least a minimal level of objective justification for the stop.... The officer must be able to articulate more than an \"inchoate and unparticularized suspicion or 'hunch'\" of criminal activity\". Illinois v. Wardlow, 528 U.S. 119, 119 and 123-124 (2000)\n \n Therefore, a \"Terry stop\" is a \"seizure\" under the 4th. Amendment, but it is not a full arrest. The detention and questioning must be brief. Taking a man out of a theater and questioning him would be a \"Terry stop\" which would require \"reasonable, articulable suspicion\" of criminal activity. From the article it appears the judge has ruled at a preliminary motions hearing that the officers did not have the required level of suspicion to detain the man.\n \n A \"Terry frisk\" is a \"weapons frisk\" or \"pat down.\" It requires an additional reasonable and articulable suspicion of danger to justify this \"frisk\" or \"pat down\" search. In Terry the suspicion of armed danger arose from the type of suspected criminal activity (planning a robbery) in which it is reasonable expect that one or more of the three men involved would be armed with a weapon.\n \n Note, however, that a 'Terry frisk\" is limited to the outer layers of clothing. The hands cannot penetrate pockets, for example. The \"frisk\" is a search for weapons only. If the officer feels what he reasonably believes is or could be a weapon then he is allowed to penetrate the pocket, for example, to get the object out. But this is allowed only where it is \"immediately apparent\" from the \"frisk\" that the object is or could be a weapon. \n \n If the article is correct, then the search involved in the theater case went far beyond a weapons \"pat down.\" Absent some exigent circumstance (and the article does not mention that any existed) the level of search done in this case required \"probable cause\"-which is the standard of proof needed to justify a full arrest for a crime. \n \n It is possible that both the detention and the search will be held unconstitutional-but the violation is of the 4th and not necessarily the 2nd. Amendment. \n \n (Both of which read \"the right of the people\", in case anyone has forgotten. Will anyone here suggest the armed man cannot sue because the phrase \"The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures\" guarantees only a \"collective\" and not an individual right?)\n \n I also want to address the article's brief mention of Florida v. J.L. because it is misleading: \n \n \"United States Supreme Court in Florida v. J.L. (2000) (detaining man on mere report that he has a gun violates the Fourth Amendment).\" \n \n This gives the impression that SCOTUS has ruled the police cannot detain someone who is reported as having a gun-which is not the case. \"J.L.\" was a 16 year old juvenile and it was illegal for him to have a handgun. That Florida law was not in dispute, nor was the ability of the officer to make a \"Terry stop\" and conduct a \"pat down\" for a weapon if he had the required level of \"reasonable, articulable suspicion\" that J.L. had a gun. The issue was not whether the police could detain and frisk a man on a report of having a gun, but on whether the anonymous report in that case claiming he had a gun was credible enough to be relied upon to provide \"reasonable, articulable suspicion\": \n \n \"An anonymous tip that a person is carrying a gun is not, without more, sufficient to justify a police officer's stop and frisk of that person. An officer, for the protection of himself and others, may conduct a carefully limited search for weapons in the outer clothing of persons engaged in unusual conduct where, inter alia, the officer reasonably concludes in light of his experience that criminal activity may be afoot and that the persons in question may be armed and presently dangerous. Terry v. Ohio, 392 U.S. 1, 30. Here, the officers' suspicion that J. L. was carrying a weapon arose not from their own observations but solely from a call made from an unknown location by an unknown caller. The tip lacked sufficient indicia of reliability to provide reasonable suspicion to make a Terry stop: It provided no predictive information and therefore left the police without means to test the informant's knowledge or credibility.\" Florida v. J. L., 529 U.S. 266 (2000)\n \n As I said, cases hinge on the particular facts involved. In my experience news reporters often make broad assumptions without understanding how each individual fact fits into the legal puzzle.", 
   {
    "post_info": {
     "post_title": "4th. Amendment law"
    }, 
    "unicode_changes_made": true
   }, 
   369012, 
   null, 
   1252702140.0
  ], 
  [
   369247, 
   null, 
   "Tither", 
   "Bryan. How is this statement then.\n \n Terry Stops are not warranted just because a policeman, police chief, mayor, complainent, (Read Sinjin emoticon_smile) or even Governor does not like the fact that the citizens of that state have the legal Right to Open Carry. And, In Fact, are harassment and poor citizenship for it's lack of respect for the laws of this country and or that state? emoticon_smile\n \n Overreaching?", 
   {}, 
   369242, 
   null, 
   1252708380.0
  ], 
  [
   369251, 
   null, 
   "zsu2357", 
   "Not for unattended firearms. I do not support storage requirements that would deny reasonably quick access for self-defense.\n\n \n What do you consider \"reasonably quick access\"?Up on pegs,trigger locks,cables?", 
   {}, 
   369201, 
   null, 
   1252711800.0
  ], 
  [
   369253, 
   null, 
   "sinjin", 
   "What do you consider \"reasonably quick access\"?Up on pegs,trigger locks,cables?\nYou would do well to investigate available technology for yourself. I would not support gun storage laws that would require guns to be locked away while you're home. The one exception would be when children, other than your own, are likely to be in your home.", 
   {}, 
   369251, 
   null, 
   1252712640.0
  ], 
  [
   369256, 
   null, 
   "zsu2357", 
   "You would do well to investigate available technology for yourself. I would not support gun storage laws that would require guns to be locked away while you're home. The one exception would be when children, other than your own, are likely to be in your home.\n\n \n Personally it is of no concern to me,but it seems to be to you though,so I have noting to look up o n the matter.I use good old common sense.\n \n My 5 year old grandson just got here awhile ago;what was the first thing I did?\n I dropped the clip out of my 9mil.about 10 minutes before he got here.the chances he could even get the safety off let alone rack one are so far out\n there it would almost never happen(notice the use of almost never?),however\n common sense.emoticon_ideaemoticon_ideaemoticon_idea\n \n P.S.not asking for myself.", 
   {}, 
   369253, 
   null, 
   1252714020.0
  ], 
  [
   369258, 
   null, 
   "NATO 556", 
   "You would do well to investigate available technology for yourself. I would not support gun storage laws that would require guns to be locked away while you're home. The one exception would be when children, other than your own, are likely to be in your home.\n\n \n It would be more effective to simply not let neighborhood children play on your property. Post signs warning that children who venture into your yard will be reported to the police for aggravated trespassing. That way you're covered as nobody has permission to access your guns, meaning you're without fault and at the same time not hindered by cumbersome third party security features.", 
   {}, 
   369253, 
   null, 
   1252716780.0
  ], 
  [
   369267, 
   null, 
   "zsu2357", 
   "Our Governor ain't a lib and I've not gotten any IOU's as of yet.\n\n \n As far as guns go he's about a HYPOCRITICAL LIB. FART.all his violent run and gun movies now he's one of them.emoticon_xkillemoticon_xkillemoticon_xkillemoticon_xkill", 
   {}, 
   369072, 
   null, 
   1252724820.0
  ], 
  [
   369272, 
   null, 
   "zsu2357", 
   "It would be more effective to simply not let neighborhood children play on your property. Post signs warning that children who venture into your yard will be reported to the police for aggravated trespassing. That way you're covered as nobody has permission to access your guns, meaning you're without fault and at the same time not hindered by cumbersome third party security features.\n\n \n \n Heck just post CHILDREN KEEP AWAY trespassers will be shot, survivors will be shot again. \n \n  PHYSIC saw that one time.\n that should get some of the anti's going! ", 
   {}, 
   369258, 
   null, 
   1252725900.0
  ], 
  [
   369298, 
   null, 
   "Nozza1", 
   "Sinjin you want me to go though thousands of pages of goverment documents to find the exact wordings of our thousands of gun laws however all you have to do is look through the constitution. I want you to tell me which amendment says \"The right of the citizens to keep and bear arms shall not be infringed, unless your childrens friends are on a sleepover in which case all firearms must be stored in a locked safe preventing you from using them in defence of your life\" I honestly have not read that one recently and I would like you to tell me which one it is!\n \n Out of personal interest, what exaclty is a storage method that gives \"reasonably quick access\"? BTW how many criminals give you \"reasonable\" time to retreive your firearm for personal protection?", 
   {}, 
   369272, 
   null, 
   1252736700.0
  ], 
  [
   369300, 
   null, 
   "Bryan", 
   "Bryan. How is this statement then.\n \n Terry Stops are not warranted just because a policeman, police chief, mayor, complainent, (Read Sinjin emoticon_smile) or even Governor does not like the fact that the citizens of that state have the legal Right to Open Carry. And, In Fact, are harassment and poor citizenship for it's lack of respect for the laws of this country and or that state? emoticon_smile\n \n Overreaching?\n\n \n \n Nope. \n \n I don't think it goes far enough.\n \n It's unconstitutional, and therefore a civil rights violation. Stopping a man who is acting lawfully merely because he has a gun is no less a civil rights violation than stopping a man acting lawfully merely because he is black. The only difference between the two is this: The first cop's irrational fear is of a man who dares to exercise a protected right he does not like, while the latter's irrational fear is based upon the color of another man's skin. \n \n Lawfully carrying a firearm is no more a crime than driving while black is. Period.\n \n People who call themselves \"liberals\" are traditionally considered defenders of individual liberty. Yet gun control is traditionally a \"liberal\" issue, while protecting individual gun rights is traditionally a \"conservative\" issue. How in God's name have so many \"liberals\" strayed so far from their otherwise guiding principles that on the issue of gun control they let drop the torch of individual liberty only to have it picked up and re-lit by \"conservatives\"? These are strange times indeed when we see \"liberals\" having to be lectured by \"conservatives\" about the value of individual liberty. \n \n Let me gently remind my otherwise \"liberal\" but gun control loving friends: The end you seek cannot justify the means.\n \n --- \n \n \"The great ideals of liberty and equality are preserved against the assaults of opportunism, the expediency of the passing hour, the erosion of small encroachments, the scorn and derision of those who have no patience with general principles, by enshrining them in constitutions, and consecrating to the task of their protection a body of defenders.\" Justice Benjamin Cardozo, The Nature of the Judicial Process, Lecture II, 1921.\n \n \"Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding.\"-- Justice Brandeis, Olmstead v. United States, 277 U.S. 438, 485 (1928) (dissenting opinion).", 
   {
    "post_info": {
     "post_title": "civil rights violation"
    }, 
    "unicode_changes_made": true
   }, 
   369247, 
   null, 
   1252737060.0
  ], 
  [
   369329, 
   null, 
   "Brady", 
   "Its good to see the senate isnt agreeing.\n \n Dangerous legislation that would have forced states to allow dangerous individuals to carry loaded guns in public was defeated in the U.S. Senate.\n \n This outrageous legislation was introduced as the Thune Amendment (No. 1618) to the Defense Authorization bill (S. 1390).\n \n It would have allowed the carrying of loaded, concealed firearms outside a person's home state, even by persons legally barred from possessing guns in the state where the carrying occurs. It would have allowed the weaker concealed carry laws of one state to nullify the restrictions on gun carrying of other states.\n \n We applaud those Senators who stood firm for the public's safety and rejected the gun lobby's dangerous legislation.", 
   {}, 
   369300, 
   null, 
   1252755060.0
  ], 
  [
   369348, 
   null, 
   "NATO 556", 
   "Its good to see the senate isnt agreeing.\n\n \n Isn't agreeing with what? The senate hasn't passed any laws that would restrict right to carry anymore than it already is.\n \n \nDangerous legislation that would have forced states to allow dangerous individuals to carry loaded guns in public was defeated in the U.S. Senate.\n\n \n Defeated? You call a margin of two votes, a defeat? That's more like a narrow escape.\n \n \nThis outrageous legislation was introduced as the Thune Amendment (No. 1618) to the Defense Authorization bill (S. 1390).\n\n \n What's so outrageous about it?\n \n \nIt would have allowed the carrying of loaded, concealed firearms outside a person's home state, even by persons legally barred from possessing guns in the state where the carrying occurs. It would have allowed the weaker concealed carry laws of one state to nullify the restrictions on gun carrying of other states.\n\n \n I suppose you'd like to see a system where a California state driver's license isn't accepted in the other 49 states, right?\n \n \nWe applaud those Senators who stood firm for the public's safety and rejected the gun lobby's dangerous legislation.\n\n \n Many states already have reciprocity. You can get a Utah concealed carry permit, and carry in two thirds of the country, no questions asked. All the Thune Amendment would do would provide uniformity.", 
   {}, 
   369329, 
   null, 
   1252767240.0
  ], 
  [
   369379, 
   null, 
   "Doc Jones", 
   "Its good to see the senate isnt agreeing.\n \n Dangerous legislation that would have forced states to allow dangerous individuals to carry loaded guns in public was defeated in the U.S. Senate.\n \n This outrageous legislation was introduced as the Thune Amendment (No. 1618) to the Defense Authorization bill (S. 1390).\n \n It would have allowed the carrying of loaded, concealed firearms outside a person's home state, even by persons legally barred from possessing guns in the state where the carrying occurs. It would have allowed the weaker concealed carry laws of one state to nullify the restrictions on gun carrying of other states.\n \n We applaud those Senators who stood firm for the public's safety and rejected the gun lobby's dangerous legislation.\n\n \n \"restrictions\" of an inalienable right is something to be proud of? Most would call it treason. Are you an advocate of treason? Of course you are!\n \n Whatever are you going to do when the SCOTUS reaffirms and incorporates the right in every State Constitution as has already been done in every civil rights case and even in Roe V. Wade?\n \n The clock is ticking so rant and propagandize all you want because it will not stop a right clearly stated in the Constitution.", 
   {}, 
   369329, 
   null, 
   1252788300.0
  ], 
  [
   369396, 
   null, 
   "JPSartre12", 
   "God bless you JP. \n We need more people like you need more snow.\n\n \n No worry about me ever moving to Kalifornia. I hate fake worlds. Hell, you go into a bar in LALALand and you don't know if the chick next to you is sporting a sausage between \"her\" legs. ;)", 
   {}, 
   369379, 
   null, 
   1252799160.0
  ], 
  [
   369411, 
   null, 
   "Nozza1", 
   "Its good to see the senate isnt agreeing.\n \n Dangerous legislation that would have forced states to allow dangerous individuals to carry loaded guns in public was defeated in the U.S. Senate.\n \n This outrageous legislation was introduced as the Thune Amendment (No. 1618) to the Defense Authorization bill (S. 1390).\n \n It would have allowed the carrying of loaded, concealed firearms outside a person's home state, even by persons legally barred from possessing guns in the state where the carrying occurs. It would have allowed the weaker concealed carry laws of one state to nullify the restrictions on gun carrying of other states.\n \n We applaud those Senators who stood firm for the public's safety and rejected the gun lobby's dangerous legislation.\n\n \n \n Arr so having your god given rights resticted or taken away is a success? How about you get out of a coutry that gives you rights and move to North Korea.\n \n Brady this is the first post i have read of yours on the new forum and I can already tell that i will be SICKENED by the rest.", 
   {}, 
   369329, 
   null, 
   1252803840.0
  ], 
  [
   369436, 
   null, 
   "zsu2357", 
   "[QUOTE=Nozza1;369411]Arr so having your god given rights resticted or taken away is a success? How about you get out of a coutry that gives you rights and move to North Korea.\n \n \n[Brady this is the first post i have read of yours on the new forum and I can already tell that i will be SICKENED by the rest.\n\n \n Well Nozz I think he wants to see how fast they start taking other rights, if they get there way with the guns, then watch him scream.assuming he's from here.\n \n Maybe your on to something about the Democratic Peoples Republic of Korea.", 
   {}, 
   369411, 
   null, 
   1252812900.0
  ], 
  [
   369449, 
   null, 
   "Bryan", 
   "Arr so having your god given rights resticted or taken away is a success? How about you get out of a coutry that gives you rights and move to North Korea.\n \n Brady this is the first post i have read of yours on the new forum and I can already tell that i will be SICKENED by the rest.\n\n \n Well I don't know about getting out of the country Nozza, but Brady knows how to get out of this forum when challenged. I've caught him making stuff up before, and when you call him out on his lies he gets irritated and runs away for a while only to sneak back as though nothing happened. \n \n The interesting thing about blogging is you don't start off knowing who you're dealing with. You could be debating a future Nobel laureate, or you could just as easily be debating some guy who still lives in his parent's basement who spends too much time yelling at his computer screen because his own family won't listen to him or take his rants seriously anymore. You have to deal with them for a while to get a sense of where they fit on the scale. I've been dealing with Brady for a while now. \n \n Actions speak louder than words here. Or, to put it another way, people do not always believe what you say but they will always believe what you do. Brady shows up occasionally to carpet bomb the board with several cuts and pastes of things he read from the VPC, and sometimes he will post something that looks original to him. But in the end you can always believe in what he does best-run away. If you want to know whether he believes what he says enough to stand by it then just challenge him on it. \n \n Either he does not believe what he says, or he does not want to admit he does not understand the ideas of others he copies here, or he lacks the confidence in himself to handle a debate. Whatever the cause, every time I have challenged him in the past the coward always voted with his feet-as he will do again when he reads this post.\n \n Challenge him as well and he will do the same with you.\n \n But lest you think too ill of me let me say that I still believe in showing everyone here the respect they have earned-including Brady.", 
   {
    "post_info": {
     "post_title": "Run Brady, run!"
    }, 
    "unicode_changes_made": true
   }, 
   369411, 
   null, 
   1252816500.0
  ], 
  [
   369463, 
   null, 
   "zsu2357", 
   "Well Bryan i take it you don't respect Brady very much,and you are right;on the internet you can be anyone you want to be, and have done everything there is to do.Must be Brady's week to be a horse's a##.emoticon_xgood", 
   {}, 
   369449, 
   null, 
   1252819380.0
  ], 
  [
   369471, 
   null, 
   "Nozza1", 
   "Bryan let another well put together responce and thanks for that. I will respect anybody that decides to put together coherent arguement however from what i have seen and read from Brady he is quite possibley the worst offender when it comes to moronic statments and untrue \"facts\"\n \n i just get angry when people spend their entire time abusing one of their god given rights with the freedom of another not realising the only way they got their freedom and keep it to this day is because of the amendment they attack!", 
   {}, 
   369463, 
   null, 
   1252821180.0
  ], 
  [
   369474, 
   null, 
   "zsu2357", 
   "Bryan let another well put together responce and thanks for that. I will respect anybody that decides to put together coherent arguement however from what i have seen and read from Brady he is quite possibley the worst offender when it comes to moronic statments and untrue \"facts\"]\n\n Nozz in all fairness to Brady,(I don't believe I said that)when it comes to moronic statments and gibberish,I know a couple that just might have him beat,or run a real close second.(and you know who you are to). \n \n \n]quote]i just get angry when people spend their entire time abusing one of their god given rights with the freedom of another not realising the only way they got their freedom and keep it to this day is because of the amendment they attack!\n\n\n \n So do I ,so doe's everyone here but there's only so much you can do,and you can't do know more,unless you just want to beat your head on the wall, and \n try to figure it out.If you do let me know.\n \n Only thing I can think of is its a debate,and hope they are beating their heads against the wall.emoticon_xbangheadxbanghead:xbanghead", 
   {}, 
   369471, 
   null, 
   1252823040.0
  ], 
  [
   372262, 
   null, 
   "Tither", 
   "Hey Sinjin do you know, or what might you think happened to that case, or to the guy at the movie theater in N.M. for carrying a gun into it? Or to the Cop?", 
   {}, 
   369474, 
   null, 
   1254515460.0
  ], 
  [
   372267, 
   null, 
   "Doc Jones", 
   "Hey Sinjin do you know, or what might you think happened to that case, or to the guy at the movie theater in N.M. for carrying a gun into it? Or to the Cop?\n\n \n I think sinjin already said they made him leave his gun in the car or else? Don't recall if he said he was arrested or not? He was definitely against a citizen carrying a gun \"where his children might be\".", 
   {}, 
   372262, 
   null, 
   1254516660.0
  ], 
  [
   372460, 
   null, 
   "zsu2357", 
   "How many patrons would get up and walk out if they noticed the man sitting next to them was strapped? \n If I was there with my kids I might. \n What's with them gunslinger at the mall fantasy anyway?\n\n \n Probably not as many as you may think,reason:If they got their weapon \"strapped\"out in plain sight not making any effort to conceal it odds are they are\n fine,however you take the guy(girl)got one stuck in their waist band more or less out of sight then I might wonder.\n \n I mean you can tell an IWB, from just being shoved in your pants,or a shoulder holster.;)", 
   {}, 
   369032, 
   null, 
   1254618360.0
  ], 
  [
   372511, 
   null, 
   "Tither", 
   "How many patrons would get up and walk out if they noticed the man sitting next to them was strapped? \n If I was there with my kids I might. \n What's with them gunslinger at the mall fantasy anyway?\n\n In Concealed Carry states we do it all of the time and never even know that we did. Showing that your Gunslinger fantasy remark is nothing but hype. emoticon_smile", 
   {}, 
   369032, 
   null, 
   1254670800.0
  ], 
  [
   372548, 
   null, 
   "Doc Jones", 
   "In Concealed Carry states we do it all of the time and never even know that we did. Showing that your Gunslinger fantasy remark is nothing but hype. emoticon_smile\n\n \n My bet is that when open carry and concealed carry become widespread and the brainwashing done by the liberals the last two decades will decline from role playing their fears of a civil, Constitutional right. Your time is up!\n \n Just as hippies and drug use were fashionable and got lots of attention, the kids raised by these malcontents and social outcasts will have to find a new gig. This one is broken and the bones are showing from beating a dead horse. These malcontents of the Spock raised generation probably don't realize that Dr. Spock's own son committed suicide from a poor upbringing while children raised with discipline and learned to accept responsibility turned out to be normal and accept social mores and realistic situations instead of role playing induced by a liberal education and carried over to the present generation. I ignored such foolishness when rearing my childen and they turned into succesful professionals well able to handle their own business. Reminds me of a teen age boy sharing a bus stop bench with an elder while eating candy bar after candy bar. The older man questioned the benefits and dangers of eating candy for his health. The boy responded saying that his grandfather had lived to be 107 years old. The man asked if he ate candy bar after candy bar. The boy retorted saying, \"no, he minded his own business\".\n \n I approve of this message! :)", 
   {}, 
   372511, 
   null, 
   1254680820.0
  ], 
  [
   372720, 
   null, 
   "sinjin", 
   "Hey Sinjin do you know, or what might you think happened to that case, or to the guy at the movie theater in N.M. for carrying a gun into it? Or to the Cop?\nLandmark decision? - Alamogordo Daily News", 
   {}, 
   372262, 
   null, 
   1254762120.0
  ], 
  [
   372722, 
   null, 
   "Tither", 
   "Thanks for helping us bump this right, back up to the first page. Much appreciated! emoticon_smile", 
   {}, 
   372720, 
   null, 
   1254762900.0
  ], 
  [
   372725, 
   null, 
   "sinjin", 
   "Thanks for helping us bump this right, back up to the first page. Much appreciated! emoticon_smile\nLooks like he made out. Seems a stand up guy. Good for him.", 
   {}, 
   372722, 
   null, 
   1254763080.0
  ], 
  [
   372761, 
   null, 
   "Doc Jones", 
   "Looks like he made out. Seems a stand up guy. Good for him.\n\n \n Amen! After 7 pages of fear mongering and foot stomping you have a lot of crow to eat. Enjoy emoticon_smile\n \n Don't suppose you will be traveling through NM and Texas or even Nevada with your family now huh? Pretty soon I suppose you will be looking for a refuge somewhere in kalifornia, the first failed State. With the current crop of politicians it probably won't be alone when the economy is sorted out and we may finally get less government which is a good thing from my point of view.", 
   {}, 
   372725, 
   null, 
   1254772080.0
  ], 
  [
   372768, 
   null, 
   "sinjin", 
   "Amen! After 7 pages of fear mongering and foot stomping you have a lot of crow to eat. Enjoy emoticon_smile\nWas that what I was doing? Notice how Mr. St. John avoids certain restaurants because they prefer their diners unarmed. \n The theatre's policy is perfectly legal. Mr. St. John didn't break any laws.\n \n \nDon't suppose you will be traveling through NM and Texas or even Nevada with your family now huh?\nWhy not? I plan on seeing Zion Nat'l Park next summer with the family. \n I don't expect any of my fellow Park visitors to be sportin' hog legs.", 
   {}, 
   372761, 
   null, 
   1254773340.0
  ], 
  [
   372770, 
   null, 
   "OldSarge", 
   "Amen! After 7 pages of fear mongering and foot stomping you have a lot of crow to eat. Enjoy emoticon_smile\n \n Don't suppose you will be traveling through NM and Texas or even Nevada with your family now huh? Pretty soon I suppose you will be looking for a refuge somewhere in kalifornia, the first failed State. With the current crop of politicians it probably won't be alone when the economy is sorted out and we may finally get less government which is a good thing from my point of view.\n\n \n Doc you should know by now that is not in the leftist playbook. It failed either because it didn't get enough money or they weren't doing enough of it. If its not getting enough money crank up the taxes until they bleed. If that doesn't work then more gov!", 
   {}, 
   372761, 
   null, 
   1254773520.0
  ], 
  [
   372771, 
   null, 
   "Doc Jones", 
   "Was that what I was doing? Notice how Mr. St. John avoids certain restaurants because they prefer their diners unarmed. \n The theatre's policy is perfectly legal. Mr. St. John didn't break any laws.\n\n \n You going to be eating that crow with your gun on or off. emoticon_xgood\n \n \nWhy not? I plan on seeing Zion Nat'l Park next summer with the family. \n I don't expect any of my fellow Park visitors to be sportin' hog legs.\n\n \n Don't bet on it :) If they are, you going to hightail it to where?", 
   {}, 
   372768, 
   null, 
   1254773700.0
  ], 
  [
   372776, 
   null, 
   "sinjin", 
   "Don't bet on it :) If they are, you going to hightail it to where?\nThe saloon.", 
   {}, 
   372771, 
   null, 
   1254774480.0
  ], 
  [
   372779, 
   null, 
   "Doc Jones", 
   "The saloon.\n\n \n Not hardly a proper place for children? You going to abandon them amoung all those guns while you drink?", 
   {}, 
   372776, 
   null, 
   1254774900.0
  ], 
  [
   372782, 
   null, 
   "sinjin", 
   "Not hardly a proper place for children? You going to abandon them amoung all those guns while you drink?\nI'll send them to the hotel pool. You guys don't open carry while swimming, do you? \n Sounds risky. What if you're assaulted just when someone splashes water in your eyes?", 
   {}, 
   372779, 
   null, 
   1254775260.0
  ], 
  [
   372784, 
   null, 
   "OldSarge", 
   "I'll send them to the hotel pool. You guys don't open carry while swimming, do you? \n Sounds risky. What if you're assaulted just when someone splashes water in your eyes?\n\n \n Yea some libtard is going to splash you while you have a hogleg in the pool!", 
   {}, 
   372782, 
   null, 
   1254775440.0
  ], 
  [
   372792, 
   null, 
   "JPSartre12", 
   "I'll send them to the hotel pool. You guys don't open carry while swimming, do you? \n Sounds risky. What if you're assaulted just when someone splashes water in your eyes?\n\n \n emoticon_confused Glocks don't rust. ;)", 
   {}, 
   372782, 
   null, 
   1254776760.0
  ], 
  [
   372805, 
   null, 
   "sinjin", 
   "Yea some libtard is going to splash you while you have a hogleg in the pool!\nNot me. I'll catch you later in the bar when you're sans pistola.", 
   {}, 
   372784, 
   null, 
   1254780060.0
  ], 
  [
   372806, 
   null, 
   "OldSarge", 
   "Not me. I catch you later in the bar when you're sans pistola.\n\n \n And receive a lesson in the fine art of I cheat.", 
   {}, 
   372805, 
   null, 
   1254780180.0
  ], 
  [
   372824, 
   null, 
   "sinjin", 
   "And receive a lesson in the fine art of I cheat.\nGuess you ain't law-abiding afterall.", 
   {}, 
   372806, 
   null, 
   1254783600.0
  ], 
  [
   372831, 
   null, 
   "NATO 556", 
   "Guess you ain't law-abiding afterall.\n\n \n The last time I checked this was a misdemeanor, otherwise known as a non-felony crime that earns you less than a year in jail.\n \n The old saying goes \"better to be judged before 12, rather than carried by 6\". Too many times innocent people have died in these \"no guns allowed\" zones, because they obeyed the rules, and the killer didn't, putting them at a disadvantage.", 
   {}, 
   372824, 
   null, 
   1254784500.0
  ], 
  [
   372834, 
   null, 
   "sinjin", 
   "The last time I checked this was a misdemeanor, otherwise known as a non-felony crime that earns you less than a year in jail.\nOtherwise known as a \"law\" by which you're expected to abide or be otherwise known as a criminal. Petty maybe, most most of you were that already. \n \n \nThe old saying goes \"better to be judged before 12, rather than carried by 6\". Too many times innocent people have died in these \"no guns allowed\" zones, because they obeyed the rules, and the killer didn't, putting them at a disadvantage.\nGot an example where someone(a real person) followed the law and left their gun at home, only to wind up shot in a \"no guns allowed\" zone?", 
   {}, 
   372831, 
   null, 
   1254785760.0
  ], 
  [
   372835, 
   null, 
   "OldSarge", 
   "Guess you ain't law-abiding afterall.\n\n \n Nope just said I cheat when aggressed upon. 30 years of playing grunt taught me a lot of nasty tricks. ", 
   {}, 
   372824, 
   null, 
   1254785760.0
  ], 
  [
   372836, 
   null, 
   "OldSarge", 
   "Got an example where someone(a real person) followed the law and left their gun at home, only to wind up shot in a \"no guns allowed\" zone?\n\n \n Luby's cafeteria, Suzanna Gratia Hupp, left her licensed pistol in her truck and saw her parents murdered. Luby's massacre - Wikipedia, the free encyclopedia\n Next ", 
   {}, 
   372834, 
   null, 
   1254786000.0
  ], 
  [
   372841, 
   null, 
   "NATO 556", 
   "Otherwise known as a \"law\" by which you're expected to abide or be otherwise known as a criminal. Petty maybe, most most of you were that already.\n\n \n It's impossible for anyone to live perfectly within every single law. But this is a non-issue. We're not going around breaking serious laws, robbing and raping and killing and terrorizing. So there's no grounds for us to be a target for further harassment and prosecution. Arguing for such would be like us insisting you face increased scrutiny because you might have the same name as a known sex offender.\n \n \nGot an example where someone(a real person) followed the law and left their gun at home, only to wind up shot in a \"no guns allowed\" zone?\n\n \n Of course not, because those people don't get interviewed; they're usually dead after being shot. However there's the Lubby's Cafe incident that Sarge mentioned. Or the Trolley Square Mall shooting over in Utah. This was a known NGA \"no guns allowed\" zone because it had signs posted at all the entrances. The only thing that stopped the massacre was was off duty police officer was illegally armed while at the mall. He broke the law, he committed a crime by being armed, because Utah law makes no exception for police officers in the concealed carry law.", 
   {}, 
   372834, 
   null, 
   1254787260.0
  ], 
  [
   372925, 
   null, 
   "sinjin", 
   "Luby's cafeteria, Suzanna Gratia Hupp, left her licensed pistol in her truck and saw her parents murdered. Luby's massacre - Wikipedia, the free encyclopedia\n Next \nFrom what I read, Ms. Hupp left the gun in her car because she didn't have a CCW, \n not because the restaurant had a policy against firearms. \n I support the legislation she later got enacted.", 
   {}, 
   372836, 
   null, 
   1254850860.0
  ], 
  [
   372960, 
   null, 
   "Doc Jones", 
   "From what I read, Ms. Hupp left the gun in her car because she didn't have a CCW,,<snip<\n\n \n There was no CCW in Texas at the time, That law she got passed was the CCW law that Ma Richards refused to sign, she would rather burn women and children in the Davidian Church and illegally allow violation of posse commitatus and allowing other State Guards into Texas. You 9 years old now, mentally?\n \n \nnot because the restaurant had a policy against firearms. \n I support the legislation she later got enacted.\n\n \n The cafeteria had no policy such as you mention. There was a law enforcement convention going on right next door and they were unaware of it so more proof that cops can't protect you! :xcensored", 
   {}, 
   372925, 
   null, 
   1254860520.0
  ], 
  [
   372962, 
   null, 
   "Doc Jones", 
   "There was no CCW in Texas at the time, That law she got passed was the CCW law that Ma Richards refused to sign, she would rather burn women and children in the Davidian Church and illegally allow violation of posse commitatus and allowing other State Guards into Texas. You 9 years old now, mentally?\n \n \n \n The cafeteria had no policy such as you mention. There was a law enforcement convention going on right next door and they were unaware of it so more proof that cops can't protect you! :xcensored\n\n \n BTW, GWB beat her on the campaign promise to sign the bill into law. Dr. Hupp was elected on the promise she would carry and support such a bill and she did! The rest is history.", 
   {}, 
   372960, 
   null, 
   1254860700.0
  ], 
  [
   372964, 
   null, 
   "OldSarge", 
   "There was no CCW in Texas at the time, That law she got passed was the CCW law that Ma Richards refused to sign, she would rather burn women and children in the Davidian Church and illegally allow violation of posse commitatus and allowing other State Guards into Texas. You 9 years old now, mentally?\n \n \n \n The cafeteria had no policy such as you mention. There was a law enforcement convention going on right next door and they were unaware of it so more proof that cops can't protect you! :xcensored\n\n \n The difference between policy and law is rather moot when you are in a gun free zone. Ma Richards got a mudhole hole stomped in her butt by the hated criminal Bush. Who then added insult to injury by signed into law the CCW bill. Didn't that create a blood bath down there?", 
   {}, 
   372960, 
   null, 
   1254860820.0
  ], 
  [
   372965, 
   null, 
   "Doc Jones", 
   "The difference between policy and law is rather moot when you are in a gun free zone. Ma Richards got a mudhole hole stomped in her butt by the hated criminal Bush. Who then added insult to injury by signed into law the CCW bill. Didn't that create a blood bath down there?\n\n \n Oh hell yeah! All crime dropped by double digits the first year of operation and haven't looked back since. emoticon_xagree", 
   {}, 
   372964, 
   null, 
   1254861060.0
  ], 
  [
   372967, 
   null, 
   "sinjin", 
   "There was no CCW in Texas at the time, That law she got passed was the CCW law that Ma Richards refused to sign, she would rather burn women and children in the Davidian Church and illegally allow violation of posse commitatus and allowing other State Guards into Texas. You 9 years old now, mentally?\nI don't know the history but that's a gut full of vitrol there Doc. What has this to do with my mental age? \n \n \nThe cafeteria had no policy such as you mention.\nAnd as such is not an example of a \"no guns allowed\" zone.\n \n \nThere was a law enforcement convention going on right next door and they were unaware of it so more proof that cops can't protect you! :xcensored \nI'm not expecting them to protect me. I've never suggested that I did. You guys love a red herring.", 
   {}, 
   372960, 
   null, 
   1254861720.0
  ], 
  [
   372973, 
   null, 
   "OldSarge", 
   "\"And as such is not an example of a \"no guns allowed\" zone.\"\n \n No just the whole state of which the cafeteria was part of, but you knew that.", 
   {}, 
   372967, 
   null, 
   1254862320.0
  ], 
  [
   372975, 
   null, 
   "Doc Jones", 
   "I don't know the history but that's a gut full of vitrol there Doc. What has this to do with my mental age? \n\n \n Wasn't that you spewing \"facts\" that had no content and were incorrect? gee, what do you wanna be when you grow up? \n \n \nAnd as such is not an example of a \"no guns allowed\" zone.\n\n \n Oh, and you said it was 'retaurant policy' ? Slick trying to wiggle out of that. Truth is, you could legally carry a handgun in plain view on the dash or seat until ccw passed. Now that handgun can be carried concealed in the car by anyone who does not have a felony conviction nor belong to a gang. You are welcome!\n \n \nI'm not expecting them to protect me. I've never suggested that I did. You guys love a red herring.\n\n \n We do a much better job of it! We are there when it happens! emoticon_xclown", 
   {}, 
   372967, 
   null, 
   1254863100.0
  ], 
  [
   372984, 
   null, 
   "sinjin", 
   "Wasn't that you spewing \"facts\" that had no content and were incorrect?\nI read she thought to leave the gun in her car since she didn't have a CCW. Ain't that a fact?", 
   {}, 
   372975, 
   null, 
   1254868440.0
  ], 
  [
   372986, 
   null, 
   "sinjin", 
   "No just the whole state of which the cafeteria was part of, but you knew that.\nAll Texas a \"no guns allowed\" zone? Too funny.", 
   {}, 
   372973, 
   null, 
   1254868560.0
  ], 
  [
   372990, 
   null, 
   "Doc Jones", 
   "I read she thought to leave the gun in her car since she didn't have a CCW. Ain't that a fact?\n\n \n \n A LIE! The Luby incident happened in 1991 and the CCW law did not take effect until 1996. CCW was non-existent. \n \n Spewing facts not in evidence_____________________ emoticon_xclown", 
   {}, 
   372984, 
   null, 
   1254868920.0
  ], 
  [
   372992, 
   null, 
   "sinjin", 
   "A LIE! The Luby incident happened in 1991 and the CCW law did not take effect until 1996. CCW was non-existent.\n\n \n \"She had left her handgun in her car to comply with Texas state law at the time which forbade carrying a concealed weapon.\"\n http://en.wikipedia.org/wiki/Suzanna_Hupp\n \n sinjin - My mistake. I stand corrected.", 
   {}, 
   372990, 
   null, 
   1254869160.0
  ], 
  [
   372994, 
   null, 
   "Doc Jones", 
   "If it is it's not mine.\n\n \n Yes it is. The wiki page was posted as evidence. You ignored that and proceeded to create your own assumptions and try to admit them as factual evidence. That is impeachable!", 
   {}, 
   372992, 
   null, 
   1254869400.0
  ], 
  [
   372995, 
   null, 
   "OldSarge", 
   "All Texas a \"no guns allowed\" zone? Too funny.\n\n \n As far as CCW at the time ha ha. So far the ignorance you have demonstrated has been staggering. But then understanding your indoctrination I can understan why. ", 
   {}, 
   372986, 
   null, 
   1254869400.0
  ], 
  [
   372996, 
   null, 
   "sinjin", 
   "Yes it is. The wiki page was posted as evidence. You ignored that and proceeded to create your own assumptions and try to admit them as factual evidence. That is impeachable!\nActually I just misread.", 
   {}, 
   372994, 
   null, 
   1254869580.0
  ], 
  [
   372998, 
   null, 
   "Doc Jones", 
   "As far as CCW at the time ha ha. So far the ignorance you have demonstrated has been staggering. But then understanding your indoctrination I can understan why. \n\n \n IF, he spoke about only things he knew, he would have very little to say!", 
   {}, 
   372995, 
   null, 
   1254869700.0
  ], 
  [
   373000, 
   null, 
   "OldSarge", 
   "IF, he spoke about only things he knew, he would have very little to say!\n\n \n Damn Doc I was just about to take a drink when I read that! emoticon_xhoho", 
   {}, 
   372998, 
   null, 
   1254869940.0
  ], 
  [
   373005, 
   null, 
   "sinjin", 
   "Damn Doc I was just about to take a drink when I read that! emoticon_xhoho\nThat explains a lot.emoticon_xhoho", 
   {}, 
   373000, 
   null, 
   1254870240.0
  ], 
  [
   373014, 
   null, 
   "Doc Jones", 
   "Damn Doc I was just about to take a drink when I read that! emoticon_xhoho\n\n \n \n Sorry about that Sarge. Be aware that I have a strict no return policy. :)", 
   {}, 
   373000, 
   null, 
   1254870780.0
  ], 
  [
   373020, 
   null, 
   "OldSarge", 
   "Sorry about that Sarge. Be aware that I have a strict no return policy. :)\n\n \n I should know better than to drink at the computer but then I am addicted to coffee.", 
   {}, 
   373014, 
   null, 
   1254871320.0
  ], 
  [
   373024, 
   null, 
   "Doc Jones", 
   "I should know better than to drink at the computer but then I am addicted to coffee.\n\n \n Add a tea spoon of Paregoric and it will sooth the nerves :)", 
   {}, 
   373020, 
   null, 
   1254871680.0
  ], 
  [
   373029, 
   null, 
   "OldSarge", 
   "Add a tea spoon of Paregoric and it will sooth the nerves :)\n\n \n Doesn't that cause impacted feces as well as ruin the flavor?", 
   {}, 
   373024, 
   null, 
   1254872400.0
  ], 
  [
   373065, 
   null, 
   "Doc Jones", 
   "Doesn't that cause impacted feces as well as ruin the flavor?\n\n \n I don't remember? You could buy drugs over the counter that contained opium, cocaine and other popular drugs well into the 1900s. Sometime during that period folks similar to the gun grabbers started actively campaigning against those drugs and that is why now, most people who use drugs challenge us to \"stand for their rights to use drugs\" when people like themselves continue to oppose the 2A.\n \n They ask us if we don't stand up for all rights, meaning the ones they like and ignore the Second. Interestingly enough, all the other rights in the BOR are incorporated, all except the most important one, the 2A.\n \n Good example of hypocrisy was how I would describe it!", 
   {}, 
   373029, 
   null, 
   1254910500.0
  ], 
  [
   373073, 
   null, 
   "OldSarge", 
   "Cleveland court decides to control guns, not criminals\n According to the Cleveland Plain Dealer, the Cleveland Municipal Court has launched a program that they think will help clear up some 25,000 outstanding warrants and get guns out of criminal hands. The scheme calls for known, wanted criminals to walk into a police station, turn in a gun, and walk out without posting bail for their outstanding warrants. \n \n Far be it from us to rain on anyone's parade, but we thought it would be helpful to point out a few problems with this idea. \n \n First, 25,000 outstanding warrants? Has the entire Cleveland Court and Police Department called in sick or are they waiting in line for their American Idol tryout? Even if each car on each shift of the police department worked just one warrant per day, and were successful just 25% of the time, they would clear more warrants in a month than this \"guns for bail\" program could ever possibly hope to clear. \n \n Second, any person with an outstanding warrant is under disability due to R.C. 2923.13(A)(1), which makes it a third degree felony for a fugitive from justice to posses a firearm. Plus, Cleveland has several local ordinances banning guns and requiring other government approval to own firearms in Cleveland. So the gist of the program is that the Cleveland Municipal Court has made a policy decision to relieve the administrative burden of someone with a warrant for disorderly conduct, for example, than prosecute a scofflaw felon for illegally having a gun.\n \n Third, the Cleveland Municipal Court is really just publicizing an existing loophole in Ohio's law in an effort to get these people off their docket: Under Ohio law, specifically R.C. 2923.23(A), a person who is under disability to posses a firearm may avoid prosecution for possessing the firearm by \"voluntarily\" turning it in. So even if someone has a murder warrant out for 10 years, they can voluntarily surrender a firearm and avoid a third degree felony for possessing the firearm.\n \n Fourth, if a concealed carry license holder walked into the same police station with a handgun, the license holder would be guilty of committing a felony. So the court apparently trusts known criminals more than trained license holders. Which leads to a logical absurdity: If they trust criminals more than license holders, why ask for the guns in the first place? \n \n In summary, if someone commits a crime in Cleveland, and then has a warrant issued because they fail to appear in court, then they commit another crime by possessing a firearm while the warrant is outstanding, they can now walk into a police station with a firearm, surrender it to the police, avoid charges for having the firearm, and have the outstanding warrant cancelled. They simply have to promise (pretty please) to go to court and answer the charges they failed to answer previously. \n \n In the gun control debate, those who support gun rights often point out the basic fallacy of gun control: criminals, by definition, do not follow laws, so gun control laws won't impact criminals. Gun control proponents essentially concede this fact when they focus their efforts on anti-gun laws and gun reduction policies rather than increased sentencing or enforcement of existing laws.\n \n The Cleveland Municipal Court program clearly illustrates the true intent of gun control proponents. The government, by and through the Cleveland Municipal Court, has made a policy decision that prefers controlling guns over controlling the criminals who wield them. \n \n But if 25,000 of Cleveland's most wanted fugitive criminals have guns to turn into bail, doesn't it simply prove that criminals still possess guns despite all the other gun control schemes and all the many Federal, State, and Home Rule ordinances? Yes. And Cleveland law enforcement knows it.", 
   {
    "post_info": {
     "post_title": "Tither territory"
    }, 
    "unicode_changes_made": true
   }, 
   373065, 
   null, 
   1254919740.0
  ], 
  [
   373118, 
   null, 
   "Tither", 
   "Yeah, Cleveland thinks they are special, and do not have to obey the laws. We have preemption, but Cleveland wants to be special. The Mayor said Cleveland will not be following the preemption laws, and will be enforcing all of the illegal gun control that Cleveland wants to make. However, and much to the dismay of the Mayor, The Cleveland Police Department said No they won't. emoticon_smile\n \n Ohioans for Concealed Carry have beat them several times in court already. The last time was over a man Open Carrying in Cleveland. The cops tried to say he was Concealed Carrying, but was asked if the gun was actually concealed, how come you were called. He had it predominantly displayed on his hip in a flap holster for safety reasons, in the middle of summer. Meaning just a shirt and shorts. Cleveland postponed several times then finally dropped the case because they knew what everyone else already knew. They were going to lose and look pretty foolish in the bargain.\n \n Ohioans for Concealed Carry members then went to Cleveland and opened carried right in front of the Police Department, and Cleveland Police even had to send a motorcycle detachment to stop traffic for us! Of course they paraded us past the Mayor's office first. So much for even powerful cities getting there way, and breaking the law! Right there Cleveland! emoticon_xgood\n \n Right there Cleveland several times as a matter of fact! emoticon_smile All anyone is asking is, for everyone to obey the laws of this nation! Why is that so much for a citizen owner to ask? emoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonno", 
   {}, 
   373073, 
   null, 
   1254932700.0
  ], 
  [
   373167, 
   null, 
   "OldSarge", 
   "Yeah, Cleveland thinks they are special, and do not have to obey the laws. We have preemption, but Cleveland wants to be special. The Mayor said Cleveland will not be following the preemption laws, and will be enforcing all of the illegal gun control that Cleveland wants to make. However, and much to the dismay of the Mayor, The Cleveland Police Department said No they won't. emoticon_smile\n \n Ohioans for Concealed Carry have beat them several times in court already. The last time was over a man Open Carrying in Cleveland. The cops tried to say he was Concealed Carrying, but was asked if the gun was actually concealed, how come you were called. He had it predominantly displayed on his hip in a flap holster for safety reasons, in the middle of summer. Meaning just a shirt and shorts. Cleveland postponed several times then finally dropped the case because they knew what everyone else already knew. They were going to lose and look pretty foolish in the bargain.\n \n Ohioans for Concealed Carry members then went to Cleveland and opened carried right in front of the Police Department, and Cleveland Police even had to send a motorcycle detachment to stop traffic for us! Of course they paraded us past the Mayor's office first. So much for even powerful cities getting there way, and breaking the law! Right there Cleveland! emoticon_xgood\n \n Right there Cleveland several times as a matter of fact! emoticon_smile All anyone is asking is, for everyone to obey the laws of this nation! Why is that so much for a citizen owner to ask? emoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonnoemoticon_xdonno\n\n \n Maybe its from drinking out of the Cuyahoga. I remember back in 68 when it caught on fire and burned for 3 days!emoticon_xhoho", 
   {}, 
   373118, 
   null, 
   1254943560.0
  ], 
  [
   373178, 
   null, 
   "Tither", 
   "Maybe its from drinking out of the Cuyahoga. I remember back in 68 when it caught on fire and burned for 3 days!emoticon_xhoho\n\n Na. Probably from smokin the Bovine Excrement they are trying to pedal! emoticon_smile", 
   {}, 
   373167, 
   null, 
   1254950280.0
  ], 
  [
   373209, 
   null, 
   "OldSarge", 
   "Na. Probably from smokin the Bovine Excrement they are trying to pedal! emoticon_smile\n\n \n Yea its kind of hard to light while its wet!", 
   {}, 
   373178, 
   null, 
   1254955020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Federal judge rules police cannot detain people for openly carrying guns", 
  "url": "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13254, 
  "discussion_files": [
   [
    "25778.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-print.html"
   ], 
   [
    "25779.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-10-print.html"
   ], 
   [
    "25780.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-8-print.html"
   ], 
   [
    "25781.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-6-print.html"
   ], 
   [
    "25782.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-4-print.html"
   ], 
   [
    "25783.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-5-print.html"
   ], 
   [
    "25784.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-7-print.html"
   ], 
   [
    "25785.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-9-print.html"
   ], 
   [
    "25786.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-3-print.html"
   ], 
   [
    "25787.html", 
    "http://www.4forums.com/political/gun-control-debates/13254-federal-judge-rules-police-cannot-detain-people-openly-carrying-guns-2-print.html"
   ]
  ], 
  "identifier": 13254
 }
]