[
 [
  [
   369091, 
   null, 
   "Easyrider", 
   "As those saved in Christ, Christians are not called out to appease a lost and sinful society, but to give them the Word of God. You have to remember that, generally speaking, the world hated Jesus. He often made people feel uncomfortable. Like the prophets before him, He exposed sin and rebuked unrighteousness. He wouldn't compromise the word of God to make friends with the world. He was looked upon as a radical; he was accused of having demons, and he was rejected by his own people and nailed to the cross. Now we like to think that Jesus came into the world to bring peace and tranquility, and certainly those who receive him receive an inner peace and tranquility, but what was it that Jesus said in the Gospel of Luke?\n \n \"Do you think I have come to bring peace on earth? No, but\n division. From now on there will be five in one family divided\n against each other - three against two and two against three.\n They will be divided, father against son and son against father,\n mother against daughter, and mother-in law against daughter-\n in law.\" (Luke 12:51-53)\n \n It's a confrontation of good against evil, light against darkness; the doctrine of God versus the doctrine of man. What does the Gospel of John say?\n \n \"In the beginning was the Word, and the Word was with God, and \n the Word was God.....In him was life, and that life was the light of\n men. The light shines in the darkness, but the darkness has not\n understood it. He came to those which were his own, but his own\n did not receive him.\" (John 1)\n \n Why didn't the world receive him? Because he often preached a confrontational message. And what is a confrontational message? It's a message that preaches Jesus Christ, exposes sin, superficial faith, and lets people know that unless they have Christ as their savior they're lost. It's a message that in many ways is in conflict with worldly thinking. \n \n Over one hundred years ago, Catherine Booth said, \"It is a bad sign for the Christianity of this day when it provokes so little opposition from the world. When the Church and the world can jog along together side by side comfortably, you may be sure there is something wrong.\" \n \n Remember what Jesus said in John 15:18 - \"If the world hates you, remember that it hated Me first. If you belonged to the world, it would love you as it's own. As it is, you do not belong to the world, but I have chosen you out of the world. That is why the world hates you.\"\n \n In addition, an old English preacher by the name of Smith Wigglesworth once said, \"If you leave people as you found them, God is not speaking through you. If you are not making people either mad or glad, there is something wrong with your ministry. If there's not a war going on, you're not doing your job.\"\n \n Another commentator, a guy by the name of Arthur Wallis, speaking on the Apostolic style of preaching that we see in the Book of Acts, said, \"Such preaching makes indifference to the word of God impossible - it sets the hearers into one of two camps. It's calculated to either produce a revival or a riot.\"\n \n Why was John the Baptist beheaded? Was he a reed swayed by the breeze of political correctness? Was John one of those guys who wanted everyone to be his buddy? Was he someone who sought after his own well being and personal enhancement? John the Baptist spoke out strongly against the corrupt pharisees and leaders of his day. He went after King Herod and reminded him he was living in sin for taking his brother's wife and making her his own. He wasn't playing the world's game and looking out for his own welfare. He was preaching the word of God, trying to turn someone to repentance and salvation, and for that he was labeled a troublemaker and eventually put to death. Why was Paul persecuted? Why was James put to death with the sword? Why were the prophets and the apostles martyred? It wasn't for patting sinners on their backs on the way down to perdition. They preached the word of God and the Gospel of Jesus Christ, and called people to repentance. And when that happens, then that's when the world recoils and the wussy, milquetoast Christians go after the messenger.\n \n Discussion...", 
   {
    "post_info": {
     "post_title": "God's Little TroubleMakers"
    }
   }, 
   null, 
   null, 
   1252627440.0
  ], 
  [
   369092, 
   null, 
   "Easyrider", 
   "You may remember God's little troublemaker, Stephen. You see him in Acts chapters six and seven. Stephen was \"a man full of God's grace and power, and he did great wonders and miraculous signs among the people.\" But the Bible says that opposition arose against him. Why? Because his message was a threat to the religious establishment of his day - an establishment that rejected Jesus Christ and those who proclaimed his message. Here again was a man who would not compromise with the things of the world. He was wholly and totally committed to God. He was on fire for the Lord. And he was brought into the council of the Sanhedrin to account for his testimony. And I'll read to you what happened next: After a long littany of historic review, Stephen said to the members of the Sandhedrin,\n \n \"You stiff-necked people with uncircumcised hearts and ears!\n You always resist the Holy Spirit. Was there ever a prophet\n your fathers did not persecute? They even killed those who\n predicted the coming of the Righteous One. And now you\n have betrayed and murdered him - you who have received the\n law that was put into effect through angels, but have not\n obeyed it!' \n \n When the members of the Sanhedrin heard this\n they were furious, and gnashed their teeth at him. But Stephen,\n full of the Holy Spirit, looked up to heaven and saw the glory\n of God, and Jesus standing at the right hand of God. 'Look,'\n he said, 'I see heaven open and the Son of Man standing at\n the right hand of God.' At this they covered their ears, and \n yelling at the top of their voices, they all rushed him....and\n they dragged him outside and stoned him to death.\" \n (Acts 7:51-58)\n \n They were furious! They gnashed their teeth and screamed at the top of their lungs. The council was in an uproar! One of God's little troublemakers had struck again! And looked at what happened when Stephen rebuked those obstinate people for their sins - the Glory of God appeared! Imagine if Stephen were standing here tonight and spoke out against the unregenerate, and said, \"You stiff-necked and rebellious people - you, who continue to resist the Holy Spirit and reject Christ. What hope can there possibly be for you? When are you going to get yourselves right with the Lord?\" How popular would that be?", 
   {}, 
   369091, 
   null, 
   1252627560.0
  ], 
  [
   369147, 
   null, 
   "Mosheh Thezion", 
   "We need more of this... not less.\n \n Jesus is lord.\n \n -Mosheh Thezion", 
   {}, 
   369092, 
   null, 
   1252651320.0
  ], 
  [
   369255, 
   null, 
   "Easyrider", 
   "Has the Christ-denying stiff-necked crowd repented yet?", 
   {}, 
   369147, 
   null, 
   1252713360.0
  ], 
  [
   369317, 
   null, 
   "jazyjason", 
   "Has the Christ-denying stiff-necked crowd repented yet?\n Sorry I was a little too busy shopping at Abercrombie And Fitch, let alone partaking of that horrible \"carnal\" gay sex sin you keep ranting about. Oh and fyi, I think that if it is anyone who is stiff necked let alone as hollow in the head as a plank of wood it is you...", 
   {}, 
   369255, 
   null, 
   1252744140.0
  ], 
  [
   369326, 
   null, 
   "Mosheh Thezion", 
   "Sorry I was a little too busy shopping at Abercrombie And Fitch, let alone partaking of that horrible \"carnal\" gay sex sin you keep ranting about. Oh and fyi, I think that if it is anyone who is stiff necked let alone as hollow in the head as a plank of wood it is you...\n\n \n just rememeber... when you are dead.. it will be too late to repent.\n \n and gay sex... is not listed as a sin in the bible.. it is listed as an abomination... and Jesus said.. abominations like food, and dirty hands, etc... have nothing to do with salvation.\n and it is what comes out of your mouth that defiles you.\n \n and since you defile religion, and god, and Jesus.. what hope can there be for you?\n \n I ask you to consider that repentance is available to you as well as anyone.\n \n -Mosheh Thezion", 
   {}, 
   369317, 
   null, 
   1252753860.0
  ], 
  [
   369410, 
   null, 
   "jazyjason", 
   "just rememeber... when you are dead.. it will be too late to repent.\n \n and gay sex... is not listed as a sin in the bible.. it is listed as an abomination... and Jesus said.. abominations like food, and dirty hands, etc... have nothing to do with salvation.\n and it is what comes out of your mouth that defiles you.\n \n and since you defile religion, and god, and Jesus.. what hope can there be for you?\n \n I ask you to consider that repentance is available to you as well as anyone.\n \n -Mosheh Thezion\n\n \n You don't ask you DEMAND repentance and acceptance of your hair brained fantasy! You don;t care about the fact that hundreds of gay Iraqi's have died and been tortured, or the gay centers or Rome being firebombed, or the murder of openly gay sailors in our military, or the shocking suicide rate of young gay teens, or the epidemic of gays being tossed out of their homes by families only to remain destitute and wretched by the hate and ignorance of others.\n You could care less! All you care about is hitting others over the head with your religion, painting yourself as some kind of loud mouthed saint hoping in your lack of knowledge and compassion that you will some how be rewarded for your dooms day message upon others...", 
   {}, 
   369326, 
   null, 
   1252803780.0
  ], 
  [
   369426, 
   null, 
   "Accipiter", 
   "EZ I want you to know that I have learned the dark arts with the express intent to do harm to Christians.\n \n Be prepared for tonight I summon Satan, many Christians will fall.", 
   {}, 
   369410, 
   null, 
   1252808640.0
  ], 
  [
   369485, 
   null, 
   "Mosheh Thezion", 
   "You don't ask you DEMAND repentance and acceptance of your hair brained fantasy! You don;t care about the fact that hundreds of gay Iraqi's have died and been tortured, or the gay centers or Rome being firebombed, or the murder of openly gay sailors in our military, or the shocking suicide rate of young gay teens, or the epidemic of gays being tossed out of their homes by families only to remain destitute and wretched by the hate and ignorance of others.\n You could care less! All you care about is hitting others over the head with your religion, painting yourself as some kind of loud mouthed saint hoping in your lack of knowledge and compassion that you will some how be rewarded for your dooms day message upon others...\n\n \n ha... I demand nothing... you can burn in hell if thats what you want.\n \n It is totally up to you bro... you do as you please.. as i believe in freedom... and if you want to embrace satan.. you go right ahead..\n \n But I will still want to save you... if I can... because I care.\n \n \n \n and let me say... im no saint.. ive lived as a foul sinner, and I have crawled from the gutter to tell you... you can crawl from that gutter too.\n \n you seem so full of hate for religion, and for God...\n \n God loves you bro.. and I never said you would burn for being gay.\n \n There is still room for even you... but its up to you of course.\n \n \n -Mosheh Thezion", 
   {}, 
   369410, 
   null, 
   1252830360.0
  ], 
  [
   369513, 
   null, 
   "Iuris", 
   "Well, now that we have that out, I'd just like to know one thing, Moshe:\n \n Why is your god good?", 
   {}, 
   369485, 
   null, 
   1252843320.0
  ], 
  [
   369520, 
   null, 
   "Easyrider", 
   "EZ I want you to know that I have learned the dark arts with the express intent to do harm to Christians.\n \n Be prepared for tonight I summon Satan, many Christians will fall.\n\n \n You're only storing up wrath for yourself, Accipiter.", 
   {}, 
   369426, 
   null, 
   1252846980.0
  ], 
  [
   369524, 
   null, 
   "Accipiter", 
   "You're only storing up wrath for yourself, Accipiter.\n\n \n don't you see my post as being somewhat far fetched?", 
   {
    "unicode_changes_made": true
   }, 
   369520, 
   null, 
   1252847580.0
  ], 
  [
   369562, 
   null, 
   "jazyjason", 
   "ha... I demand nothing... you can burn in hell if thats what you want.\n \n It is totally up to you bro... you do as you please.. as i believe in freedom... and if you want to embrace satan.. you go right ahead..\n \n But I will still want to save you... if I can... because I care.\n \n \n \n and let me say... im no saint.. ive lived as a foul sinner, and I have crawled from the gutter to tell you... you can crawl from that gutter too.\n \n you seem so full of hate for religion, and for God...\n \n God loves you bro.. and I never said you would burn for being gay.\n \n There is still room for even you... but its up to you of course.\n \n \n -Mosheh Thezion\n\n \n Bro? what is this some kind of debate based in Orange County? Anyways, I do not hate religion. And once again there you go with that Satan thing of yours. So quick to point out pointy eared people in red with tails aren't you?\n \n If you must know Moseh I accept and embrace the teachings of Christ and do believe in the validity of him being the Messiah. I however take the entire bible with a grain of salt, looking into it from a scientific and historic viewpoint.\n \n And I am a Unitarian Universalist myself. However I do not bring my personal belief into debate because I deem it unnecessary to wield my belief as a weapon on those who's views may differ from mine on spirituality. Each man is allowed the freedom of religion and fromcreligion in this country and I respect that.\n \n I do however wield my knowledge and opinion in fact and common sense, and a unyielding desire for civil rights for all peoples, not just gays in the nation. But those who are still oppressed and hurting, those who cry out for aid but are silenced, and those who's lives depend on others taking a stand and exposing those charlotans who will stop at nothing to hamper and hinder peoples rights.", 
   {}, 
   369485, 
   null, 
   1252865820.0
  ], 
  [
   369568, 
   null, 
   "trebor", 
   "don't you see my post as being somewhat far fetched?\n\n \n The ultra conservatives are humor deficient. The humor they have tends to be very cruel and sadistic.", 
   {
    "unicode_changes_made": true
   }, 
   369524, 
   null, 
   1252869480.0
  ], 
  [
   369617, 
   null, 
   "Mosheh Thezion", 
   "Well, now that we have that out, I'd just like to know one thing, Moshe:\n \n Why is your god good?\n\n \n \n ha... god is not good.. or evil.. since he created both.\n \n god is god... the creator.. and as such.. he can do anything he wants to, and it is niether good nor evil... and is mearly the will of god.. for reasons we, as mear humans can never precieve.\n \n if he destroyed the whole world today... it would not be evil.\n \n It would simply be the way it is.\n \n It is we.. as humans... who can do evil... or good.\n \n \n -Mosheh Thezion", 
   {}, 
   369513, 
   null, 
   1252897260.0
  ], 
  [
   369618, 
   null, 
   "smiley", 
   "ha... god is not good.. or evil.. since he created both.\n \n god is god... the creator.. and as such.. he can do anything he wants to, and it is niether good nor evil... and is mearly the will of god.. for reasons we, as mear humans can never precieve.\n \n if he destroyed the whole world today... it would not be evil.\n \n It would simply be the way it is.\n \n It is we.. as humans... who can do evil... or good.\n \n \n -Mosheh Thezion\n\n Then what makes him worthy of worship?", 
   {}, 
   369617, 
   null, 
   1252897380.0
  ], 
  [
   369619, 
   null, 
   "Mosheh Thezion", 
   "Bro? what is this some kind of debate based in Orange County? Anyways, I do not hate religion. And once again there you go with that Satan thing of yours. So quick to point out pointy eared people in red with tails aren't you?\n \n If you must know Moseh I accept and embrace the teachings of Christ and do believe in the validity of him being the Messiah. I however take the entire bible with a grain of salt, looking into it from a scientific and historic viewpoint.\n \n And I am a Unitarian Universalist myself. However I do not bring my personal belief into debate because I deem it unnecessary to wield my belief as a weapon on those who's views may differ from mine on spirituality. Each man is allowed the freedom of religion and fromcreligion in this country and I respect that.\n \n I do however wield my knowledge and opinion in fact and common sense, and a unyielding desire for civil rights for all peoples, not just gays in the nation. But those who are still oppressed and hurting, those who cry out for aid but are silenced, and those who's lives depend on others taking a stand and exposing those charlotans who will stop at nothing to hamper and hinder peoples rights.\n\n \n wow...\n \n so why do your oppose repentance?\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   369562, 
   null, 
   1252897380.0
  ], 
  [
   369672, 
   null, 
   "Iuris", 
   "Then what makes him worthy of worship?\n\n \n Apparently, the ability to inflict eternal agony...", 
   {}, 
   369619, 
   null, 
   1252920540.0
  ], 
  [
   369674, 
   null, 
   "Mosheh Thezion", 
   "Then what makes him worthy of worship?\n\n \n Because there is nothing else worth worshipping.\n \n there can be only one creator.... and we are the creation.\n \n -Mosheh Thezion", 
   {}, 
   369618, 
   null, 
   1252921920.0
  ], 
  [
   369676, 
   null, 
   "Mosheh Thezion", 
   "Apparently, the ability to inflict eternal agony...\n\n \n god.. according to religion.. does not inflict eternal agony.. and it is we who reject god... and so.. cannot be collected into heaven to be with god .. and as such... we are lost to purgatory... or suffer entropic demise.. which is where energy... is coverted.. over time.. into lower and lower forms of energy.. as it is converted... into heat...\n \n which is just like burning in hell.. isnt it?\n \n -Mosheh Thezion", 
   {}, 
   369672, 
   null, 
   1252922100.0
  ], 
  [
   369680, 
   null, 
   "Penfold", 
   "No, it isn't", 
   {}, 
   369676, 
   null, 
   1252926600.0
  ], 
  [
   369731, 
   null, 
   "simone", 
   "War! War! Blood and gore!\n \n That is what your wretched Christ brings!", 
   {}, 
   369091, 
   null, 
   1252952160.0
  ], 
  [
   369735, 
   null, 
   "JPSartre12", 
   "War! War! Blood and gore!\n \n That is what your wretched Christ brings!\n\n \n So I shouldn't hold a spot in line for YOU at the Pearly Gates, then? ;)", 
   {}, 
   369731, 
   null, 
   1252953960.0
  ], 
  [
   369736, 
   null, 
   "trebor", 
   "War! War! Blood and gore!\n \n That is what your wretched Christ brings!\n\n \n I disagree. Jesus, if he existed at all, is now deceased.\n \n It is the followers of Jesus that bring the war. And, if the \n \"Christ\" concept did not exist, they would find another \n justification.", 
   {}, 
   369731, 
   null, 
   1252954140.0
  ], 
  [
   369745, 
   null, 
   "simone", 
   "Trebor, nevertheless, the idolaters have created a Jesus in armor, carrying all the vestments of war:\n \nMilitant Jesus\n The main character, the hero of the Left Behind novels, is Jesus Christ, the militant warrior messiah returning to conquer evil and bring a utopian paradise to the world. Upon his return tens of thousands of non-believing soldiers are struck dead. Here is LaHaye and Jenkins describing that final battle:\n \n Their innards and entrails gushed to the desert floor, and those around them turned to run, they too were slain, their blood pooling and rising in the unforgiving brightness of the glory of Christ.\n \n The Jesus the authors have created, with all his destruction and lust for power, often seems no better than the Satan he is fighting. \"This vision of Christ, who eviscerates his human foes and drops them to the desert floor, is fast becoming the Savior for our times,\" writes Paul O'Donnell at Beliefnet in a review of The Glorious Appearing. Hofstadter offers another thought: \"Very often the fantasies of true believers reveal strong sadomasochistic outlets, vividly expressed.... \n\n Militant Jesus", 
   {
    "unicode_changes_made": true
   }, 
   369736, 
   null, 
   1252956300.0
  ], 
  [
   369950, 
   null, 
   "Easyrider", 
   "War! War! Blood and gore!\n \n That is what your wretched Christ brings!\n\n \n \n Once again you confuse murder with justice. You'd let the unlawful bloodsuckers run amock to kill tens of thousands of more people. Kill the unborn but let the bad guys off scott free. \n \n That's another reason there ought to be a bounty on liberals.", 
   {}, 
   369731, 
   null, 
   1253055420.0
  ], 
  [
   369969, 
   null, 
   "trebor", 
   "Once again you confuse murder with justice. You'd let the unlawful bloodsuckers run amock to kill tens of thousands of more people. Kill the unborn but let the bad guys off scott free. \n \n That's another reason there ought to be a bounty on liberals.\n\n \n \n You confuse your personal bigotry with justice.\n \n You confuse your hatred with 'God's word'.", 
   {}, 
   369950, 
   null, 
   1253061720.0
  ], 
  [
   369981, 
   null, 
   "Easyrider", 
   "You confuse your personal bigotry with justice.\n \n You confuse your hatred with 'God's word'.\n\n \n No, you're full of nonsense (besides being spiritually stunted).", 
   {}, 
   369969, 
   null, 
   1253068080.0
  ], 
  [
   370047, 
   null, 
   "jazyjason", 
   "wow...\n \n so why do your oppose repentance?\n \n -Mosheh Thezion emoticon_xbouncer\n\n \n \n \n Repentance? of what? Oh you mean not being gay? Well for one thing it's something you cannot change and most who have been \"cured\" end up killing themselves.\n \n And also, contrary to what you may think I am strictly monogamous in a relationship and value being with someone. It's not all about sex unlike what some other people here may try to spin...", 
   {}, 
   369619, 
   null, 
   1253107020.0
  ], 
  [
   370048, 
   null, 
   "jazyjason", 
   "Once again you confuse murder with justice. You'd let the unlawful bloodsuckers run amock to kill tens of thousands of more people. Kill the unborn but let the bad guys off scott free. \n \n That's another reason there ought to be a bounty on liberals.\n\n \n \n Your a nut plain and simple. A bounty on free thinking persons who don't pander to the radical GOP controlled by Boss Limbaugh and Glen Beck. Whats next after that bounty Easy? put us in concentration camps?\n \n Gas those who are unrepentant and don't grovel like loyal dogs to your beliefs and unrelenting hatred of others? Oh wait I forgot gays HAVE already suffered at the hands of monsters called the Nazi's or did you forget that it was not only Jews who payed the price for who they were?", 
   {}, 
   369950, 
   null, 
   1253107200.0
  ], 
  [
   370051, 
   null, 
   "JPSartre12", 
   "Your a nut plain and simple. A bounty on free thinking persons who don't pander to the radical GOP controlled by Boss Limbaugh and Glen Beck. Whats next after that bounty Easy? put us in concentration camps?\n \n Gas those who are unrepentant and don't grovel like loyal dogs to your beliefs and unrelenting hatred of others? Oh wait I forgot gays HAVE already suffered at the hands of monsters called the Nazi's or did you forget that it was not only Jews who payed the price for who they were?\n\n \n Wow! Maybe there needs to be a bounty on the humorless. emoticon_xkill", 
   {}, 
   370048, 
   null, 
   1253110380.0
  ], 
  [
   370180, 
   null, 
   "trebor", 
   "Wow! Maybe there needs to be a bounty on the humorless. emoticon_xkill\n\n \n If Easyrider was joking, he was doing what is known as 'inappropriate humor'.\n \n I notice many people who are humor defective and have a lack of compassion do that.", 
   {}, 
   370051, 
   null, 
   1253160600.0
  ], 
  [
   370216, 
   null, 
   "jazyjason", 
   "Wow! Maybe there needs to be a bounty on the humorless. emoticon_xkill\n\n \n If it was a jest it is too bitter for laughter.", 
   {}, 
   370051, 
   null, 
   1253193540.0
  ], 
  [
   370265, 
   null, 
   "JPSartre12", 
   "If Easyrider was joking, he was doing what is known as 'inappropriate humor'.\n \n I notice many people who are humor defective and have a lack of compassion do that.\n\n \n \nIf it was a jest it is too bitter for laughter.\n\n \n Sorry, but Easy isn't responsible for your sensitive hides NOR lack of humor. If you're unable to see that a call for a bounty on liberals isn't to be taken seriously, then I suggest you stay away from horror films, the WWE, video games, etc., emoticon_rolleyes", 
   {}, 
   370216, 
   null, 
   1253211960.0
  ], 
  [
   370282, 
   null, 
   "trebor", 
   "Sorry, but Easy isn't responsible for your sensitive hides NOR lack of humor. If you're unable to see that a call for a bounty on liberals isn't to be taken seriously, then I suggest you stay away from horror films, the WWE, video games, etc., emoticon_rolleyes\n\n \n Nope, Easy is responsible for his lack of compassion, his insulting comments, and the way he makes Christianity look like a bigoted, backwards religion.", 
   {}, 
   370265, 
   null, 
   1253214300.0
  ], 
  [
   370308, 
   null, 
   "gansao", 
   "Would helping starving Hindus have any merit to a Christian God?", 
   {}, 
   370282, 
   null, 
   1253220600.0
  ], 
  [
   370318, 
   null, 
   "JPSartre12", 
   "Would helping starving Hindus have any merit to a Christian God?\n\n \n Only if the loaf of bread came with a sermon on the mount. ;)", 
   {}, 
   370308, 
   null, 
   1253224860.0
  ], 
  [
   370324, 
   null, 
   "Easyrider", 
   "Nope, Easy is responsible for his lack of compassion, his insulting comments, and the way he makes Christianity look like a bigoted, backwards religion.\n\n \n Your cyber-Tourette's Syndrome is acting up again. \n \n And you're still not saved, are you? John 3:36!", 
   {}, 
   370282, 
   null, 
   1253227080.0
  ], 
  [
   370326, 
   null, 
   "gansao", 
   "Would helping starving Hindus have any merit to a Christian God?\n\n \n I'll ask it again", 
   {}, 
   370308, 
   null, 
   1253227320.0
  ], 
  [
   370371, 
   null, 
   "trebor", 
   "Your cyber-Tourette's Syndrome is acting up again. \n \n And you're still not saved, are you? John 3:36!\n\n \n Nope.. I see no need to be Saved.\n \n Of course, Not all who cry Lord Lord shall enter into the kingdom of heaven.", 
   {}, 
   370324, 
   null, 
   1253247660.0
  ], 
  [
   370416, 
   null, 
   "Easyrider", 
   "Nope.. I see no need to be Saved.\n \n Of course, Not all who cry Lord Lord shall enter into the kingdom of heaven.\n\n \n Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.", 
   {}, 
   370371, 
   null, 
   1253283180.0
  ], 
  [
   370419, 
   null, 
   "JPSartre12", 
   "I'll ask it again\n\n \n The answer is undoubtedly \"yes\".", 
   {}, 
   370326, 
   null, 
   1253284980.0
  ], 
  [
   370423, 
   null, 
   "trebor", 
   "Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n\n \n And you, you have already passed into the lake of fire.", 
   {}, 
   370416, 
   null, 
   1253286540.0
  ], 
  [
   370426, 
   null, 
   "JPSartre12", 
   "And you, you have already passed into the lake of fire.\n\n \n \" I fell into a burning ring of fire. I went down, down down and the flames went higher.....\" ;)", 
   {}, 
   370423, 
   null, 
   1253286780.0
  ], 
  [
   370433, 
   null, 
   "gansao", 
   "The answer is undoubtedly \"yes\".\n\n \n So the Christian God would see merit in making the unbelievers journey to hell a little more comfortable.", 
   {}, 
   370419, 
   null, 
   1253289960.0
  ], 
  [
   370439, 
   null, 
   "JPSartre12", 
   "So the Christian God would see merit in making the unbelievers journey to hell a little more comfortable.\n\n \n There's always the chance that the unbeliever will become a believer as long as the person's alive.", 
   {}, 
   370433, 
   null, 
   1253291040.0
  ], 
  [
   370441, 
   null, 
   "gansao", 
   "There's always the chance that the unbeliever will become a believer as long as the person's alive.\n\n \n Clutching on to straws here!", 
   {}, 
   370439, 
   null, 
   1253291340.0
  ], 
  [
   370449, 
   null, 
   "Easyrider", 
   "Clutching on to straws here!\n\n \n Indeed. And as Dr. Charles Stanley notes, the longer they say 'no' now, the harder it is to say 'yes' later.", 
   {}, 
   370441, 
   null, 
   1253296140.0
  ], 
  [
   370452, 
   null, 
   "JPSartre12", 
   "Clutching on to straws here!\n\n \n Not me. I'm a pragmatic Christian. The less converts, the shorter the line at the gate. ;)", 
   {}, 
   370441, 
   null, 
   1253296740.0
  ], 
  [
   370457, 
   null, 
   "gansao", 
   "JP and EZ I salute you!\n If I were a crusader at the gates of Jerusalem I would want to be next to you two when the slaughter startsemoticon_xgood", 
   {}, 
   370452, 
   null, 
   1253299020.0
  ], 
  [
   370463, 
   null, 
   "JPSartre12", 
   "JP and EZ I salute you!\n If I were a crusader at the gates of Jerusalem I would want to be next to you two when the slaughter startsemoticon_xgood\n\n \n Remember the motto \" Kill a commie for Christ.\" ;)", 
   {}, 
   370457, 
   null, 
   1253299920.0
  ], 
  [
   370465, 
   null, 
   "gansao", 
   "Remember the motto \" Kill a commie for Christ.\" ;)\n\n \n \n :):):):)emoticon_xkill", 
   {}, 
   370463, 
   null, 
   1253300160.0
  ], 
  [
   370467, 
   null, 
   "JPSartre12", 
   ":):):):)emoticon_xkill\n\n \n Now, there's the spirit. Can I get an \"AMEN!\" emoticon_xgood", 
   {}, 
   370465, 
   null, 
   1253300460.0
  ], 
  [
   370471, 
   null, 
   "gansao", 
   "Now, there's the spirit. Can I get an \"AMEN!\" emoticon_xgood\n\n \n AMEN to that brother! lol!", 
   {}, 
   370467, 
   null, 
   1253301120.0
  ], 
  [
   370481, 
   null, 
   "trebor", 
   "Remember the motto \" Kill a commie for Christ.\" ;)\n\n \n I thought that was '\n \n Kill Christ, he is a commie!", 
   {}, 
   370463, 
   null, 
   1253308620.0
  ], 
  [
   370483, 
   null, 
   "JPSartre12", 
   "I thought that was '\n \n Kill Christ, he is a commie!\n\n \n See you in Hell.", 
   {}, 
   370481, 
   null, 
   1253308860.0
  ], 
  [
   370642, 
   null, 
   "trebor", 
   "See you in Hell.\n\n \n Why, if hell exists, yes you will, merrily roasting away with me.", 
   {}, 
   370483, 
   null, 
   1253419080.0
  ], 
  [
   370666, 
   null, 
   "jazyjason", 
   "Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n\n \n \n Funny but didn't Paul say that as long as your saved by grace circumcision is no longer needed?", 
   {}, 
   370416, 
   null, 
   1253449380.0
  ], 
  [
   370667, 
   null, 
   "jazyjason", 
   "See you in Hell.\n\n \n Why are you quoting Han Solo? Are you a Star Wars fan too? emoticon_smile", 
   {}, 
   370483, 
   null, 
   1253449440.0
  ], 
  [
   371448, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider:  Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n \n \nFunny but didn't Paul say that as long as your saved by grace circumcision is no longer needed?\n\n \n \"No, a man is a Jew if he is one inwardly; and circumcision is circumcision of the heart, by the (Holy) Spirit, not by the written code.\" Paul - Romans 2:29 \n \n \"For in Christ all the fullness of the Deity lives in bodily form, 10and you have been given fullness in Christ, who is the head over every power and authority. In him you were also circumcised, in the putting off of the sinful nature, not with a circumcision done by the hands of men but with the circumcision done by Christ...\" - Apostle Paul - Colossians chapter 2", 
   {}, 
   370666, 
   null, 
   1253846700.0
  ], 
  [
   371450, 
   null, 
   "jazyjason", 
   "Originally Posted by Easyrider:  Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n \n \n \n \"No, a man is a Jew if he is one inwardly; and circumcision is circumcision of the heart, by the (Holy) Spirit, not by the written code.\" Paul - Romans 2:29 \n \n \"For in Christ all the fullness of the Deity lives in bodily form, 10and you have been given fullness in Christ, who is the head over every power and authority. In him you were also circumcised, in the putting off of the sinful nature, not with a circumcision done by the hands of men but with the circumcision done by Christ...\" - Apostle Paul - Colossians chapter 2\n\n \n And you put that as a form of an insult?", 
   {}, 
   371448, 
   null, 
   1253849400.0
  ], 
  [
   371479, 
   null, 
   "JPSartre12", 
   "Why, if hell exists, yes you will, merrily roasting away with me.\n\n \n I hope not, but one never knows. ;)\n \n \nFunny but didn't Paul say that as long as your saved by grace circumcision is no longer needed?\n\n \n Why are gay men so fixated on circumcision? It seems that on every board I post to gay men argue vehemently against being converted to a sporting model. ;)\n \n \nWhy are you quoting Han Solo? Are you a Star Wars fan too? emoticon_smile\n\n \n Not really. I thought it was John Lithgow's line in Bucharoo Banzai. ;)", 
   {}, 
   371450, 
   null, 
   1253892120.0
  ], 
  [
   371529, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider: Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n \n \"No, a man is a Jew if he is one inwardly; and circumcision is circumcision of the heart, by the (Holy) Spirit, not by the written code.\" Paul - Romans 2:29 \n \n \"For in Christ all the fullness of the Deity lives in bodily form, 10and you have been given fullness in Christ, who is the head over every power and authority. In him you were also circumcised, in the putting off of the sinful nature, not with a circumcision done by the hands of men but with the circumcision done by Christ...\" - Apostle Paul - Colossians chapter 2\n \n \nAnd you put that as a form of an insult?\n\n \n Nope. \n \n Romans 1:26-27", 
   {}, 
   371450, 
   null, 
   1253919660.0
  ], 
  [
   371560, 
   null, 
   "jazyjason", 
   "Originally Posted by Easyrider: Circumcise your heart and get the 75 lbs of foreskin off of it, before you perish.\n \n \"No, a man is a Jew if he is one inwardly; and circumcision is circumcision of the heart, by the (Holy) Spirit, not by the written code.\" Paul - Romans 2:29 \n \n \"For in Christ all the fullness of the Deity lives in bodily form, 10and you have been given fullness in Christ, who is the head over every power and authority. In him you were also circumcised, in the putting off of the sinful nature, not with a circumcision done by the hands of men but with the circumcision done by Christ...\" - Apostle Paul - Colossians chapter 2\n \n \n \n Nope. \n \n Romans 1:26-27\n\n \n Thanks. It refers to spiritual purity and an inward manifestation of the holy spirit and the fruits of the spirit Easy. The circumcision meaning to the liking of accepting Christ as your savor which if you did not know there are many openly gay people who are Christian and have done just that..", 
   {}, 
   371529, 
   null, 
   1253962380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God's Little TroubleMakers", 
  "url": "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13256, 
  "discussion_files": [
   [
    "21120.html", 
    "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers-print.html"
   ], 
   [
    "21121.html", 
    "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers-5-print.html"
   ], 
   [
    "21122.html", 
    "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers-4-print.html"
   ], 
   [
    "21123.html", 
    "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers-3-print.html"
   ], 
   [
    "21124.html", 
    "http://www.4forums.com/political/religion-debates/13256-gods-little-troublemakers-2-print.html"
   ]
  ], 
  "identifier": 13256
 }
]