[
 [
  [
   368901, 
   null, 
   "jyoshu", 
   "As if the cost of healthcare without insurance is not enough .....\n \n \"WASHINGTON (AP) - Americans would be fined up to $3,800 for failing to buy health insurance under a plan that circulated in Congress on Tuesday as President Barack Obama met Democratic leaders to search for ways to salvage his health care overhaul.\n \n In advance of what Obama hopes will be a game-changing speech to lawmakers, the one idea that most appeals to the Democrats' liberal base lost ground in Congress. Prospects for a government-run plan to compete with private insurers sank as a leading moderate said he could no longer support the idea.\"\n And this sort of thing reveals the real situation with many of the left-wing proponents of \"healthcare reform.\" \n They like to put on a nice face that says we want to provide healthcare for all, but would actually severely PUNISH people who don't want to rely on the government teat.\n More at My Way News - Fines proposed for going without health insurance", 
   {
    "post_info": {
     "post_title": "Fines proposed for going without health insurance"
    }
   }, 
   null, 
   null, 
   1252511700.0
  ], 
  [
   368903, 
   null, 
   "Steeeeve", 
   "I heard about this on the news this morning because my senator (Warner) seems to like the idea.\n \n It is a proposal by Senator Baucus and is the reform idea I've seen other than every other proposal come up with. \n \n Give Baucus some credit, it moves in the right direction but at the end of the day it does little.", 
   {}, 
   368901, 
   null, 
   1252512780.0
  ], 
  [
   368914, 
   null, 
   "simone", 
   "Baucus is a corporatist BlueDog. He's putting out a honeyfall for the health insurance industry.\n \n I don't consider Baucus to be a Democrat, nor a decent American. He's just like the Republicans.", 
   {}, 
   368901, 
   null, 
   1252523220.0
  ], 
  [
   368937, 
   null, 
   "unkerpaulie", 
   "I heard about this on the news this morning because my senator (Warner) seems to like the idea.\n \n It is a proposal by Senator Baucus and is the reform idea I've seen other than every other proposal come up with. \n \n Give Baucus some credit, it moves in the right direction but at the end of the day it does little.\n\n I don't want to get a bias about this because all I've heard concerning this is how oppressive this law is for people who already can't pay for health insurance. I'd love to hear the benefits of charging fines for not having health insurance.", 
   {}, 
   368903, 
   null, 
   1252536780.0
  ], 
  [
   368939, 
   null, 
   "foundit66", 
   "As if the cost of healthcare without insurance is not enough .....\n \n \"WASHINGTON (AP) - Americans would be fined up to $3,800 for failing to buy health insurance under a plan that circulated in Congress on Tuesday as President Barack Obama met Democratic leaders to search for ways to salvage his health care overhaul.\n \n In advance of what Obama hopes will be a game-changing speech to lawmakers, the one idea that most appeals to the Democrats' liberal base lost ground in Congress. Prospects for a government-run plan to compete with private insurers sank as a leading moderate said he could no longer support the idea.\"\n And this sort of thing reveals the real situation with many of the left-wing proponents of \"healthcare reform.\" \n\n You say \"many\"...\n How many?\n \n This article is a completely pathetic example of journalism.\n They take the header from something that is talked about VAGUELY in the first paragraph, and that's it...\n MANY more paragraphs. NO real elaboration on WHO floated this idea, HOW MANY people liked it or didn't like it, or anything really significant.\n \n I think it's a horrid idea.\n \n \n \nI'd love to hear the benefits of charging fines for not having health insurance. \n\n I would to out of idle curiousity.\n I think it's an awful idea and it would be an uphill battle to persuade me, but I am curious as to what they think are the \"pros\" of this idea...", 
   {}, 
   368901, 
   null, 
   1252540080.0
  ], 
  [
   368977, 
   null, 
   "Mosheh Thezion", 
   "none of the working class of america... will ever be able to afford such a fine... its a joke, which borders on criminal madness.\n \n the following is how i say we fix the problem...\n \n with price controls.. across the board.. and subsidies...\n Mosheh Thezion's Exploratory Committee for U.S. Senate (R) | HEALTH CARE\n \n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   368939, 
   null, 
   1252559400.0
  ], 
  [
   368982, 
   null, 
   "jyoshu", 
   "\n I think it's a horrid idea.\n\n \n Assuming you're telling the truth, I have to say, I'm surprised. I truly thought you'd support something like this.\n I'd be interested in hearing you elaborate on your reasons for why you join with any conservative that thinks it's a bad idea.", 
   {}, 
   368939, 
   null, 
   1252560360.0
  ], 
  [
   368986, 
   null, 
   "Jo Bennett", 
   "This is the problem with trying to satisfy the health insurance lobby and their shills in congress. Unless there is a public system funded through general taxation free at the point of use you will always get these injustices.", 
   {}, 
   368982, 
   null, 
   1252563420.0
  ], 
  [
   369008, 
   null, 
   "unkerpaulie", 
   "Assuming you're telling the truth, I have to say, I'm surprised. I truly thought you'd support something like this.\n I'd be interested in hearing you elaborate on your reasons for why you join with any conservative that thinks it's a bad idea.\n\n Again, please tell us what possible benefit could be derived from such a proposal like this, other than the health insurance businesses making money whether they provide service or not. And you have given no reason why foundit, or any of us, should support such a proposal, except for the fact that you're surprised that he would join with a conservative who think its a bad idea. Do we judge ideas based on the political affiliation of the ones that proposed the idea?", 
   {}, 
   368982, 
   null, 
   1252597080.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fines proposed for going without health insurance", 
  "url": "http://www.4forums.com/political/health-debates/13250-fines-proposed-going-without-health-insurance.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13250, 
  "discussion_files": [
   [
    "14274.html", 
    "http://www.4forums.com/political/health-debates/13250-fines-proposed-going-without-health-insurance-print.html"
   ]
  ], 
  "identifier": 13250
 }
]