[
 [
  [
   369346, 
   null, 
   "Accipiter", 
   "Religious people, what are your most effective arguments for proving biblical creation?", 
   {
    "post_info": {
     "post_title": "Effective Arguments For Proving Biblical Creation"
    }
   }, 
   null, 
   null, 
   1252766880.0
  ], 
  [
   369427, 
   null, 
   "Accipiter", 
   "Yeah, that's what I though, you guys got NOTHING.", 
   {
    "unicode_changes_made": true
   }, 
   369346, 
   null, 
   1252808880.0
  ], 
  [
   369454, 
   null, 
   "obvious_child", 
   "Because Biblical Creation has only one mode of argumentation: false dichotomy. It is a known fact (and simple experiment) that when placed in competition with another religious creation story, Biblical Creation has absolutely no arguments because it cannot produce the same kind of false dichotomy without first completely collapsing on its own logic. \n \n Several people here have tried to create threads about actual evidence for YEC, and as to date, no YECs have tried. \n \n The underlying argument YEC has is if the sky is not orange with black stripes, it is white with pink dots.", 
   {}, 
   369427, 
   null, 
   1252817580.0
  ], 
  [
   369588, 
   null, 
   "Mosheh Thezion", 
   "ha...\n \n do you really want to get me started?\n \n see...< Theory\n \n how about all modern evidence derived from science?\n \n Which in essence supports the idea of the application of energy from an outside source...\n \n And for lack of a better term... that would be a god of some kind.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   369454, 
   null, 
   1252893120.0
  ], 
  [
   369592, 
   null, 
   "T.Q", 
   "Sure, get started. Post concise points, not a link to a rambling website, yours or not. Preferably in modern, standard english.", 
   {}, 
   369588, 
   null, 
   1252894680.0
  ], 
  [
   369601, 
   null, 
   "Mosheh Thezion", 
   "Sure, get started. Post concise points, not a link to a rambling website, yours or not. Preferably in modern, standard english.\n\n \n that is my website.. and i wrote it all. and drew the pictures..\n \n And if you cannot read it.. then there is no point in arguing, because you will probubly not read what I post here either.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   369592, 
   null, 
   1252895520.0
  ], 
  [
   369605, 
   null, 
   "T.Q", 
   "if you cannot read it.. then there is no point in arguing, because you will probubly not read what I post here either.\n\n \n I can, but I won't. If you have a point to make, make it on this board. Feel free to link back to your website and quote passages if you want.", 
   {}, 
   369601, 
   null, 
   1252896000.0
  ], 
  [
   369610, 
   null, 
   "Mosheh Thezion", 
   "I can, but I won't. If you have a point to make, make it on this board. Feel free to link back to your website and quote passages if you want.\n\n \n \n \n key word... is ... \"wont\"\n \n so.. no thanks, Ill argue with someone else.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   369605, 
   null, 
   1252896480.0
  ], 
  [
   369622, 
   null, 
   "smiley", 
   "key word... is ... \"wont\"\n \n so.. no thanks, Ill argue with someone else.\n \n -Mosheh Thezion emoticon_xbouncer\n\n Actually, the key word was \"won't\" (as in \"will not\"), not \"wont\" (as in \"habit\").", 
   {}, 
   369610, 
   null, 
   1252897740.0
  ], 
  [
   369625, 
   null, 
   "Mosheh Thezion", 
   "Actually, the key word was \"won't\" (as in \"will not\"), not \"wont\" (as in \"habit\").\n\n \n thank you... very helpful.\n \n emoticon_xbouncer", 
   {}, 
   369622, 
   null, 
   1252898040.0
  ], 
  [
   369627, 
   null, 
   "smiley", 
   "thank you... very helpful.\n \n emoticon_xbouncer\n\n Sorry for the nit-picking, but your website has a few errors in it too. That's what brought on my 'evil eye'.", 
   {}, 
   369625, 
   null, 
   1252899900.0
  ], 
  [
   369631, 
   null, 
   "Accipiter", 
   "ha...\n \n do you really want to get me started?\n \n see...< Theory\n \n how about all modern evidence derived from science?\n \n Which in essence supports the idea of the application of energy from an outside source...\n \n And for lack of a better term... that would be a god of some kind.\n \n -Mosheh Thezion emoticon_xbouncer\n\n \n Where's your proof?", 
   {
    "unicode_changes_made": true
   }, 
   369588, 
   null, 
   1252900980.0
  ], 
  [
   369663, 
   null, 
   "Mosheh Thezion", 
   "Sorry for the nit-picking, but your website has a few errors in it too. That's what brought on my 'evil eye'.\n\n \n i can appreciate that... but I'm a one man team so far... so based on that i hope you can forgive a few errors... as the site is huge.\n \n -Mosheh Thezion", 
   {}, 
   369627, 
   null, 
   1252915680.0
  ], 
  [
   369664, 
   null, 
   "Mosheh Thezion", 
   "Where's your proof?\n\n \n proof... would be the abundance of empirical evidence...\n \n which is confirmable... such as the motion of all heavenly bodies.. the nature of matter, gravity and electircal forces... the evidence..\n \n and if we put all that provable evidence onto one sheet of paper...\n \n we will find that it suggests a pattern.. and that pattern suggests an original outside source of energy... which would be a god.\n \n the evidence.. cannot explain god.. since god exists outside our space and time.. but it can expain for gods creation... \n \n \n as decribed in that link.\n \n did you bother to read it?\n \n -Mosheh Thezion emoticon_xbouncer", 
   {
    "unicode_changes_made": true
   }, 
   369631, 
   null, 
   1252915860.0
  ], 
  [
   369668, 
   null, 
   "T.Q", 
   "... the site is huge...did you bother to read it?\n\n \n Gee, that might be a good reason to actually post your arguments concisely instead of expecting people to wade through a \"huge\" site to try and discern what the hell your point might be.\n \n Just a thought.", 
   {}, 
   369663, 
   null, 
   1252917600.0
  ], 
  [
   369675, 
   null, 
   "Iuris", 
   "Mosheh, I already did read your site. Writing style is unnecessarily complex and the theories often show a lack of comprehension regarding what science knows and claims.\n \n Also, if you are unable to summarize it down to a scale appropriate to a forum discussion, it's a very bad sign.", 
   {}, 
   369668, 
   null, 
   1252921980.0
  ], 
  [
   369677, 
   null, 
   "Mosheh Thezion", 
   "Mosheh, I already did read your site. Writing style is unnecessarily complex and the theories often show a lack of comprehension regarding what science knows and claims.\n \n Also, if you are unable to summarize it down to a scale appropriate to a forum discussion, it's a very bad sign.\n\n \n \n what you need to understand, is that the level of detail and evidence to consider is huge... as all evidence.. is considerable and there is mountains of it...\n \n To do as you request... will require that we break it down...\n \n And since this is a consideration of biblical creation..\n \n We can start with this...< createvolutionism\n \n which is a nice summary... which can be expanded by reading the entire book as presented online.\n \n first we need to contemplate what are dimensions...\n \n and what progressions of the first.. 1,2,3 dimensions would be like.\n \n \n We quickly.. see that for formation to occur.. we would have to follow a progressive development... ie... frst as one.. then two.. and then three.\n \n this sets up the basic idea of a dimensional progressive pattern..\n \n as discussed here... Theory\n \n from a zero point.. to one dimensional extention.. to two dimensional plane extention... to 3D space formation....\n \n which is actually.. 4 dimensions... zero=< one =< two =< three...\n \n and each dimension can be seen as having a start and end...\n .0001 zero D... =< to =< .9999 zero D... where one begins....\n \n etc... until... 3.99999 D... where 3d is fully formed.\n \n \n now..\n \n if this is clear.. we can move forward.\n \n -Mosheh Thezion", 
   {}, 
   369675, 
   null, 
   1252922760.0
  ], 
  [
   369679, 
   null, 
   "Penfold", 
   "An amateurish attempt at obscurantist mysticism using half-grasped concepts clarifies nothing.", 
   {}, 
   369677, 
   null, 
   1252926480.0
  ], 
  [
   369721, 
   null, 
   "Databed", 
   "Mosheh,\n \n There is some merit to a church that can change it's views based on scientific advances and discoveries. I could actually see something similar being the next big religious movement. A purely God religion, where we can actually admit that we have no understanding of God whatsoever. \n \n However, attempting to incorporate Biblical interpretation into your religion will never be very satisfying to a true scientist. Science will continue to make it increasingly difficult to create an interpretation of the Bible that agrees with what we actually see happening in the world. \n \n What I don't get, if you're diverging so far from classical Christianity, why not just go ahead and take the next step to create your own genesis instead of relying on an extremely primitive view of the world as depicted in Genesis 1 and 2?", 
   {}, 
   369679, 
   null, 
   1252943580.0
  ], 
  [
   369817, 
   null, 
   "marc9000", 
   "Science will continue to make it increasingly difficult to create an interpretation of the Bible that agrees with what we actually see happening in the world. \n\n \n Does this mean that science will continue to make it increasingly easy for athieists to use it as a weapon against religion?", 
   {}, 
   369721, 
   null, 
   1252971780.0
  ], 
  [
   369824, 
   null, 
   "Accipiter", 
   "proof... would be the abundance of empirical evidence...\n \n which is confirmable... such as the motion of all heavenly bodies.. the nature of matter, gravity and electircal forces... the evidence..\n \n and if we put all that provable evidence onto one sheet of paper...\n \n we will find that it suggests a pattern.. and that pattern suggests an original outside source of energy... which would be a god.\n \n the evidence.. cannot explain god.. since god exists outside our space and time.. but it can expain for gods creation...\n\n \n Is this a joke?", 
   {}, 
   369664, 
   null, 
   1252973220.0
  ], 
  [
   369826, 
   null, 
   "Accipiter", 
   "Does this mean that science will continue to make it increasingly easy for athieists to use it as a weapon against religion?\n\n \n It's only a weapon if you are paranoid.", 
   {
    "unicode_changes_made": true
   }, 
   369817, 
   null, 
   1252973340.0
  ], 
  [
   369833, 
   null, 
   "marc9000", 
   "It's only a weapon if you are paranoid.\n\n \n So if I go to a website that promotes atheism, I won't really see any references to science?", 
   {
    "unicode_changes_made": true
   }, 
   369826, 
   null, 
   1252974360.0
  ], 
  [
   369834, 
   null, 
   "Accipiter", 
   "So if I go to a website that promotes atheism, I won't really see any references to science?\n\n \n Are you saying that your paranoid delusions have something to do with an effective argument for proving biblical creation?", 
   {}, 
   369833, 
   null, 
   1252974780.0
  ], 
  [
   369835, 
   null, 
   "T.Q", 
   "If science is easily used as a weapon by atheists against religion, that's not a strike against science, it's a strike against religion.", 
   {}, 
   369833, 
   null, 
   1252974960.0
  ], 
  [
   369846, 
   null, 
   "trebor", 
   "Does this mean that science will continue to make it increasingly easy for athieists to use it as a weapon against religion?\n\n \n Science is not a weapon against religion in a general sense. It is only a weapon against the red necked ignorant form of fundamentalism that denies reality. This extreme form of ignorance is a self defeating concept, and people who hold do it should be ashamed of themselves for their self deceit.\n \n One item that Creationists just can't get in their attempts to disprove any scientific theory, and that is , even in the unlikely event that the mainstream theory is proven false, that does not mean that their belief in creationism is true. That is the logical fallacy of a false dichotomy. \n \n One reason the creationist resorts to trying attacking science is they have no positive evidence of their claims outside their specific literal interpretation of their religious texts.", 
   {}, 
   369817, 
   null, 
   1252988880.0
  ], 
  [
   369852, 
   null, 
   "obvious_child", 
   "So if I go to a website that promotes atheism, I won't really see any references to science?\n\n \n Can you inform me as to how Science is a weapon against Buddhism or Deism?\n \n Please. Try. If you can. Which you won't. Because you can't. \n \n Stop pretending that only your interpretation of you religion is the only religion.", 
   {}, 
   369833, 
   null, 
   1252993560.0
  ], 
  [
   369858, 
   null, 
   "Mosheh Thezion", 
   "Mosheh,\n \n There is some merit to a church that can change it's views based on scientific advances and discoveries. I could actually see something similar being the next big religious movement. A purely God religion, where we can actually admit that we have no understanding of God whatsoever. \n \n However, attempting to incorporate Biblical interpretation into your religion will never be very satisfying to a true scientist. Science will continue to make it increasingly difficult to create an interpretation of the Bible that agrees with what we actually see happening in the world. \n \n What I don't get, if you're diverging so far from classical Christianity, why not just go ahead and take the next step to create your own genesis instead of relying on an extremely primitive view of the world as depicted in Genesis 1 and 2?\n\n \n my friend...\n \n it was never my intention to support biblical creation... never at all..\n \n but when i developed this concept.. of a dimensional progression.. i discovered... low and behold.. that Genesis.. says the same thing.. but in more primitive terms...\n \n I did not try to fit the bible into this..\n \n I developed the concept... and then... was shocked to see that it fit perfectly..\n \n so... do you see.. it was not my intention... and is just the way it is.\n \n \n -Mosheh Thezion", 
   {}, 
   369721, 
   null, 
   1252999500.0
  ], 
  [
   369859, 
   null, 
   "Mosheh Thezion", 
   "ha..\n \n only one of you had the balls to attempt to discuss the issue. and that was..... Databed..\n \n now..\n \n If we are done arguing about nonsence..\n \n lets get back to creation...\n \n my theory as presented... is based on the evidence...\n \n of the heavens.. namely... galaxies...\n \n All matter in the universe.. is found to be in very organized forms..(not chaos)\n \n first as quasars and superclusters....\n \n and superclusters.. are giant galaxies.. made up of many galaxies...\n \n and galaxies.. are spirally orbiting bodies of stars.. which are expanding...\n \n and stars.. have planets.. etc...\n \n The first key issue...\n \n is that galaxies... are expanding... and the farther back we look.. the smaller and more compact galaxies apear to be.. (hubble evidence)\n \n meaning the evidence... suggest galaxies... are expanding bodies of stars... where the stars... apear to be projected outward from a central location in the galaxy... and that some various forces... projected those stars.. and that some force.. continues to provide for the expansion to this day.\n \n of course...\n \n big bang... suggests.. galaxies.. formed by collapsing clouds... of gases... which anyone with half a brain... can see.. that the evidence... does not support... as far back as 13 billon years....\n \n the earliest galaxies.. are expanding spirals..\n \n \n now... if we can except this... we can move on.\n \n can we?\n \n -Mosheh Thezion", 
   {}, 
   369858, 
   null, 
   1253000160.0
  ], 
  [
   369976, 
   null, 
   "marc9000", 
   "If science is easily used as a weapon by atheists against religion, that's not a strike against science, it's a strike against religion.\n\n \n But what is it for atheists? Databed's statement was that \"Science will continue to make it increasingly difficult\" [for religion]. If it does, it cannot help but make it increasingly easy for opponents of religion. If we have two glasses of water, each half full, we can't pour some from one into the other without losing something and increasing something. If science evolves into something that makes it increasingly difficult for religion, atheism isn't going to stay the same, it's going to increase in power and influence. Then the relationship between evolution and atheism reaches the point where it starts having political problems. \n \n The only solution to the problem is for you, and child, and trebor, and who knows who else, to zero in on the fact that Databed only referred to the Bible, not religon, as if there are plenty of legitimate religions that don't involve the Bible. But are there? It's something that I don't remember ever being explored here, and I think it would be worth a look. \n \n \nScience is not a weapon against religion in a general sense. It is only a weapon against the red necked ignorant form of fundamentalism that denies reality. This extreme form of ignorance is a self defeating concept, and people who hold do it should be ashamed of themselves for their self deceit. \n\n \n It appears there are really only two classifications of religion. One (the red necked, ignorant form I guess) would be the class that actually has a God that is currently involved in the world, and has at least a few guidelines in how its followers are supposed to live. Biblical Christianity, Islam, Mormon, would fall into that catagory. The other classification, the evolution friendly one, Deism for example, does not have an involved god, and does not have any guidelines for how to live. \n \n It would be interesting to see a list - religions with a God and rules, and religions with no active god and no rules. It's easy to see how religions with no active god and no rules would be evolutionists. Atheists have no god and no rules either. The evolutionist religions, with bendable, shapable guidelines (without the Bible as a guideline) could make any changes atheists tell them to make. Atheists love them and need them, provided atheists get to lead the way. \n \n \nCan you inform me as to how Science is a weapon against Buddhism or Deism?\n \n Please. Try. If you can. Which you won't. Because you can't. \n\n \n You're absolutely right, I can't. Deism, and Buddhism (as far as I know) and many other religions, both real and recently invented, have no active god, and no guidelines, just like atheism. Could you inform me what differences there are in behavior, in worldview, between yourself (a Deist, right) and an atheist? An atheist gets up in the morning - no devotion reading. You get up in the morning - your god is dead - so no devotion reading right? The atheist doesn't think about God all day, just a luck and chance day. Since your god is dead, your day is luck and chance too. The atheist sits down to dinner, no prayer, you sit down to dinner, your god is dead, so no...........do you see a pattern here? \n \n So tell me what differences there are between you and athiests. Please. Try. If you can. Which you won't. Because you can't.\n \n \nStop pretending that only your interpretation of you religion is the only religion. \n\n \n Since it's about the only religion evolutionists constantly attack, it puts it in a class by itself, doesn't it?", 
   {}, 
   369835, 
   null, 
   1253064780.0
  ], 
  [
   369990, 
   null, 
   "Databed", 
   "Then the relationship between evolution and atheism reaches the point where it starts having political problems. \n\n \n This is speaking of atheism becoming more popular due to the fact that people are losing faith in religion. I see that, but can you elaborate on how this will cause political problems? I don't think I follow since atheism does not (cannot) in any way be in opposition to evolution. I think I missed what you are trying to say.\n \n \n\n Since it's about the only religion evolutionists constantly attack, it puts it in a class by itself, doesn't it? \n \n\n \n Christianity seems to be the only religion that is represented on this forum, yes. Is that enough to make your interpretation of Christianity better? \n \n This actually brings up a point. Sometimes it is difficult to argue with a creationist because there are so many angles they could represent. Some believe in a 6000 year old Earth, some believe in a Big Bang, some believe that evolution is guided by God, some believe that galaxies expand out of a zero dimensional point; it is wide open. \n \n On the other, any scientist in the world is going to have the same views. There may be arguments over small aspects of the science, but once a scientific idea has enough evidence, there is only one interpretation and it is shared by all. \n \n How can something (religion) that is so inconsistent possibly have a single correct answer as everyone claims theirs is?", 
   {}, 
   369976, 
   null, 
   1253071800.0
  ], 
  [
   370002, 
   null, 
   "Mosheh Thezion", 
   "cough... cough,,.. the elephant in the room will not be ignored.\n \n Theory\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   369990, 
   null, 
   1253084340.0
  ], 
  [
   370042, 
   null, 
   "Penfold", 
   "Thousands of contradictory sole true theories are not convincing anyone. Creationists of whatever stripe are more often than not hamstrung by their poor understanding of that to which they are objecting. They emit noises which mimic science, but are in fact supernaturalist mumbo-jumbo dressed up. Lipstick on a pig.", 
   {}, 
   370002, 
   null, 
   1253104260.0
  ], 
  [
   370122, 
   null, 
   "obvious_child", 
   "You're absolutely right, I can't. Deism, and Buddhism (as far as I know) and many other religions, both real and recently invented, have no active god, and no guidelines, just like atheism.\n\n \n Seriously? You just stated that Buddhism has no guidelines. \n \n Perhaps you should educate yourself for a change:\n Buddhism - Wikipedia, the free encyclopedia \n \n \nCould you inform me what differences there are in behavior, in worldview, between yourself (a Deist, right) and an atheist? An atheist gets up in the morning - no devotion reading. You get up in the morning - your god is dead - so no devotion reading right?\n\n \n 1. A Deist God is not dead, merely absent. \n \n And what does this have to do with science as a weapon against rleigion? \n \n \nThe atheist doesn't think about God all day, just a luck and chance day. Since your god is dead, your day is luck and chance too.\n\n \n Hardly. What makes you think a Deist God did not know how things would turn out? Your assumptions are large and unfounded. \n \n \nThe atheist sits down to dinner, no prayer, you sit down to dinner, your god is dead, so no...........do you see a pattern here? \n\n \n How about you stop assuming what other religions believe and actually educate yourself as to what they are? \n \n BTW, Shinto doesn't have a problem with evolution and that religion is chock full of religious ceremonies. What's your take on that? \n \n \nSo tell me what differences there are between you and athiests. Please. Try. If you can. Which you won't. Because you can't.\n\n \n You're right. I can't when you redefine religions and assume what they believe without actually understanding what they are. The fact that you said Buddhism has no guidelines is hysterical, but entirely in line with your ignorance. \n \n \nSince it's about the only religion evolutionists constantly attack, it puts it in a class by itself, doesn't it?\n\n \n Did you fail to notice the bashing that Muslims get when they talk about creationism?\n \n Huh. How can you walk around with blinders that weight 10 tons each?\n \n Btw, thanks for explicitly admitting that you believe that YEC is the only interpretation of Christanity.", 
   {}, 
   369976, 
   null, 
   1253138040.0
  ], 
  [
   370172, 
   null, 
   "marc9000", 
   "This is speaking of atheism becoming more popular due to the fact that people are losing faith in religion. I see that, but can you elaborate on how this will cause political problems? I don't think I follow since atheism does not (cannot) in any way be in opposition to evolution. I think I missed what you are trying to say. \n\n \n My fault - I've been over much of the evolution/atheism relationship many times before here on 4forums. If you're new here, you may not have read much of it. Increasing proof of my position on the matter just keeps coming up. \n \n To sum it up, everyone knows that atheists support evolution, and that evolution supports atheism. Evolution has been called \"the greatest engine of atheism ever invented.\" The percentage of evolutionary biologists who are atheists are somewhere in the ninety percent range. Many popular books have been written by scientists claiming that science \"shows that God does not exist\" (Victor Stenger) One movie, and a book (unrelated to the movie) have documented how religious people are discriminated against in evolutionary study in academia and other places. It's simply obvious that atheists control most of evolutionary study and application. Yet if anyone claims that evolution is atheistic, it brings howls of rage and anger from the most militant of atheists! There is a reason for it of course - much of evolutionary study concerns ancient history, and it can't be studied in a way that brings a direct profitable product, so it can't support itself in free markets. The 90+ percent of atheists in evolution must get support/funding from a general population that has far less than 50% of its population with the atheist worldview. It has to convince them that evolution is compatable with religion. Atheists in evolutionary academia need any and all religions they can find to be compatable with evolution, so they can shout from the rooftops that evolution isn't just about atheism, hoping that mainstream Christians will be fooled enough to help provide them with funding. Amazingly enough, it works for them somewhat - it is not politically correct to speculate on atheistic aspect of evolution too much. As obvious_child has made clear, one of their mainstays is ancient religions of the far east. Religions of course, that don't get in their way when it comes to atheist opinions on things like abortion, embryonic stem cell research, the 10 commandments, and a host of other things, including writing childrens science textbooks from an atheist perspective. In addition to the ancient far east religions, the most recent successes have come to atheism through the more modern, western religions that are religious by name only. Such as, Christianity without the Bible. This is a really popular one - a person claims to be a Christian, yet disregards much, or all of God's word. They can then make Christianity anything they want it to be! When it comes to politics that support an atheistic agenda, those modern Christians always seem to fall right in line. \n \n \nChristianity seems to be the only religion that is represented on this forum, yes. Is that enough to make your interpretation of Christianity better?\n\n \n There are two distinct divisions of Christianity on this forum. Only one is attacked by evolutionists - the Biblical one. The non-Biblical one seldom is - it does have variations. As I said, it can be anything a person wants it to be, if they disregard the Bible. \n \n \nThis actually brings up a point. Sometimes it is difficult to argue with a creationist because there are so many angles they could represent. Some believe in a 6000 year old Earth, some believe in a Big Bang, some believe that evolution is guided by God, some believe that galaxies expand out of a zero dimensional point; it is wide open. \n\n \n You think that's tough, you ought to try figuring out evolutionists! Especially the Christian ones! Some believe creationists shouldn't be in politics, and agree with atheists on everything! \n \n \nOn the other, any scientist in the world is going to have the same views. There may be arguments over small aspects of the science, but once a scientific idea has enough evidence, there is only one interpretation and it is shared by all. \n\n \n I don't agree, there are many good evolutionary biologists who aren't Darwinists. They're just shouted down to the point where they're not noticed much. \n \n \nHow can something (religion) that is so inconsistent possibly have a single correct answer as everyone claims theirs is?\n\n \n In Christianity (the only true one) there are inconsistencies in minor details only. That God created, and that he \"so loved the world that he sent his only begotten Son\" is consistent in all traditional denominations. Much of the new 'anything goes' Christianity is atheists in disguise playing games.", 
   {
    "unicode_changes_made": true
   }, 
   369990, 
   null, 
   1253155380.0
  ], 
  [
   370174, 
   null, 
   "marc9000", 
   "Seriously? You just stated that Buddhism has no guidelines. \n \n Perhaps you should educate yourself for a change:\n Buddhism - Wikipedia, the free encyclopedia \n\n \n A quick glance through that didn't show any list, that would disagree with an atheist agenda, like the 10 commandments would. But I'll have to study it more, as I said, I don't think it's had a detailed look here before. \n \n \n \n1. A Deist God is not dead, merely absent. \n\n \n So there's a huge difference between a dead god and an absent god? \n \n \nAnd what does this have to do with science as a weapon against rleigion? \n\n \n If the god is dead or absent, science doesn't even have a religion to oppose! emoticon_idea\n \n \nHardly. What makes you think a Deist God did not know how things would turn out? Your assumptions are large and unfounded. \n\n \n What relevance does an absent god have with a godless political agenda? \n \n \nHow about you stop assuming what other religions believe and actually educate yourself as to what they are? \n\n \n I'm going to do that - I'm not an expert on them like you. So far, you've taught me that a big part of Deism is to study far eastern religions, or any religion that doesn't oppose atheism, and try to show how similarly they all oppose Christianity. \n \n \nBTW, Shinto doesn't have a problem with evolution and that religion is chock full of religious ceremonies. What's your take on that? \n\n \n That atheists love far eastern religions, as long as they don't clash with evolution? \n \n \nYou're right. I can't when you redefine religions and assume what they believe without actually understanding what they are. The fact that you said Buddhism has no guidelines is hysterical, but entirely in line with your ignorance. \n\n \n What MY beliefs are prevent you from proving something? \n \n \nDid you fail to notice the bashing that Muslims get when they talk about creationism? \n\n \n Where? On 4forums? Yes I failed to notice. Do you have a link? \n \n \nHuh. How can you walk around with blinders that weight 10 tons each?\n \n Btw, thanks for explicitly admitting that you believe that YEC is the only interpretation of Christanity.\n\n \n Thank you for making a straw man. Please refer me, by post number, to exactly where I said anything about \"YEC\".", 
   {}, 
   370122, 
   null, 
   1253156340.0
  ], 
  [
   370181, 
   null, 
   "unkerpaulie", 
   "\n To sum it up, everyone knows that atheists support evolution, and that evolution supports atheism. Evolution has been called &#8220;the greatest engine of atheism ever invented.&#8221; The percentage of evolutionary biologists who are atheists are somewhere in the ninety percent range. Many popular books have been written by scientists claiming that science &#8220;shows that God does not exist&#8221; (Victor Stenger) One movie, and a book (unrelated to the movie) have documented how religious people are discriminated against in evolutionary study in academia and other places. It&#8217;s simply obvious that atheists control most of evolutionary study and application.\n\n I have to disagree. As obvious child and others have pointed out, evolution is not the basis for atheism, neither is religion and evolution mutually exclusive. However, evolution is specifically mutually exclusive to the biblical creation account, which happens to be the foundation of christianity. Other religions that don't have this foundation, and versions of christianity that don't perceive genesis as the foundation of christianity (How this is possible I have yet to see), do not perceive evolution as a threat to the validity of their religion. \n \n I would suggest that you just say that evolution opposes the concept of creation, which it does, not the idea of religion as a whole, nor God himself.", 
   {}, 
   370172, 
   null, 
   1253160720.0
  ], 
  [
   370182, 
   null, 
   "obvious_child", 
   "A quick glance through that didn't show any list, that would disagree with an atheist agenda, like the 10 commandments would. But I'll have to study it more, as I said, I don't think it's had a detailed look here before.\n\n \n Seriously? You clearly did not look at that link. \n \n \nSo there's a huge difference between a dead god and an absent god?\n\n \n How can atheists declare God dead when they reject the entire notion of a higher power? \n \n \nIf the god is dead or absent, science doesn't even have a religion to oppose! emoticon_idea\n\n \n Come again? Since when does an absent God equate to no religion? \n \n \nWhat relevance does an absent god have with a godless political agenda?\n\n \n None, but not all religions are about politics. \n \n \nI'm going to do that - I'm not an expert on them like you. So far, you've taught me that a big part of Deism is to study far eastern religions, or any religion that doesn't oppose atheism, and try to show how similarly they all oppose Christianity.\n\n \n One must wonder how you came to that conclusion. Not all religion interpretations have the same creationist problems that YEC interpretation has with reality. \n \n \nThat atheists love far eastern religions, as long as they don't clash with evolution?\n\n \n Incorrect. Many eastern religions don't have the YEC problem that your interpretation of Christanity does.\n \n \nWhat MY beliefs are prevent you from proving something?\n\n \n Proving? What do you mean? Most rational, educated people know that atheism isn't evolution. You still don't get it. \n \n \nWhere? On 4forums? Yes I failed to notice. Do you have a link?\n\n \n Check out this guy's posts:\n 4Forums.com Political Debates and Polls - View Profile: eanassir\n \n Dumb *ss beliefs in YEC aren't just a Christianity problem. \n \n \nThank you for making a straw man. Please refer me, by post number, to exactly where I said anything about \"YEC\".\n\n \n Easy. You argued that evolution is a tool to attack religion. Except that many people pointed out other religions not to mention different interpretations of Christanity that do not have a problem with Evolution. As you clearly ignore all of those, you by definition believe that Creationism = Christanity.", 
   {}, 
   370174, 
   null, 
   1253161860.0
  ], 
  [
   370183, 
   null, 
   "obvious_child", 
   "\n \n I would suggest that you just say that evolution opposes the concept of creation, which it does, not the idea of religion as a whole, nor God himself.\n\n \n An even more accurate statement is that the sciences of evolution empirically oppose a Literal interpretation of Genesis, not the idea of religion as a whole, nor God himself.", 
   {}, 
   370181, 
   null, 
   1253161980.0
  ], 
  [
   370184, 
   null, 
   "obvious_child", 
   "Religious people, what are your most effective arguments for proving biblical creation?\n\n \n So Marc, you going to even bother to try?", 
   {}, 
   369346, 
   null, 
   1253162040.0
  ], 
  [
   370194, 
   null, 
   "Mosheh Thezion", 
   "ha..\n \n what a joke...\n \n here I am willing to go over every peice of evidence there is about creation.. based on the sciences.... from cosmology to biology to atomic structure....\n \n And i offer a detailed 36 page discussion of it.. with pictures..\n \n And all you wimps... choose to ignore me.\n \n thats fine....\n \n It only shows that you dont want to take on such a challenge.\n \n \n You can make cute remarks... but ha.. it only proves you are afraid of the challenge of discussing the abundant evidence.\n \n Ha...\n \n You just go ahead and argue amoungst yourselves...\n \n When you really want to discuss it... you can talk to me.\n \n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   370184, 
   null, 
   1253168940.0
  ], 
  [
   370203, 
   null, 
   "obvious_child", 
   "Mosheh Thezion, how about you present a specific piece of evidence to support creationism and we'll go over it? \n \n It's not our jobs as those who do not believe in creationism to prove it.", 
   {}, 
   370194, 
   null, 
   1253177460.0
  ], 
  [
   370204, 
   null, 
   "pandion", 
   "Seriously? You just stated that Buddhism has no guidelines. \n \n Perhaps you should educate yourself for a change:\n Buddhism - Wikipedia, the free encyclopedia\n\n Just days ago I returned from Japan where I visited the Great Buddha of Kamakura. There I watched many people participate in a purification ritual where they washed their hands and faces, and drank the water from a fountain before approaching the Buddha. Most people did not do so since Buddhism is a minority religion in Japan and such a ritual would be meaningless to them. I chose not to disrespect the ritual by taking part without belief.", 
   {}, 
   370122, 
   null, 
   1253180040.0
  ], 
  [
   370206, 
   null, 
   "Mosheh Thezion", 
   "Mosheh Thezion, how about you present a specific piece of evidence to support creationism and we'll go over it? \n \n It's not our jobs as those who do not believe in creationism to prove it.\n\n \n the greatest... and most signifigant piece of evidence is the motions of all heavenly bodies..\n \n such as the fact that matter.. is all very organized... such as galaxies.. which are all expanding from a central core in super clusters..\n \n And galaxies... are all spirally... expanding... as stars in orbit..\n \n and that stars... are orbital systems... of planets..\n \n and that all planets are made of atoms... which are spinnning orbital expansions of the same orbital scheme...\n \n \n The fact is... the entire cosmos... is very ordered.... structured... in a specific order... fashion.. and is anything but chaos...\n \n \n That is fact... real evidence... there is nothing random about it.\n \n lets start with that.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   370203, 
   null, 
   1253181240.0
  ], 
  [
   370220, 
   null, 
   "Iuris", 
   "There is not a shred of evidence in your pages, Mosheh. Not a shred. \n \n If you draw a crude picture that shows \"grays\" evolve from dinosaurs (I honestly suspect you're just pulling our legs with that site), this is no evidence. And if you imply that apes evolved directly from fish as humans evolve paralell from the fish up, just to negate a common ancestor, it just shows that you are not aware of what the fossil records actually imply. Or current life genes.\n \n If you just claim that the universe must rise up from one dimension to two dimensions to three dimensions, this does not make it any kind of evidence - it just shows that you have no idea what the actual observations about space show (redshift all over, 3D expansion, not a planar expansion that would follow from your claims). And if you build up from this nonsense into only ether and applied energy existing, without defining these terms or offering any empirical evidence, this is just more nonsense derived out of nonsense. You can technobabble all you want about 28 dimensions, but unless you actually show phenomena in the real world that would indicate it, it's just your weird idea.\n \n And most of all: a post just saying \"Of course there is evidence! Look at my page: Theory !\" Is nothing - anyone can make a page and write whatever he wants on it. It doesn't make it true.\n \n \n And I'm sorry if I sound offensive, but it really got to me how you keep just shoving your page down our noses and I wasted all that time reading it and realized I was reading nonsense. I, a lawyer by trade and education, know it with my college level physics - you're lucky no actualy physicists and evolutionary experts took a look at it.", 
   {}, 
   370206, 
   null, 
   1253194200.0
  ], 
  [
   370243, 
   null, 
   "unkerpaulie", 
   "Mosheh, in addition to the fact that your theory is based on nothing more than interesting imaginations and no real evidence, you don't in anyway connect your theory back to creation, except to possibly suggest that God set the energy needed to create the existing dimensions in initial motion. It really doesn't even come close to biblical creation in anyway. In fact, this is more like an unnecessarily complicated way of saying \"we don't know where the energy for the big bang comes from, so it must have been God did it\". \n \n The original question is for people to come forward with arguments in favor for creation. Your theory doesn't address the question.", 
   {}, 
   370220, 
   null, 
   1253205120.0
  ], 
  [
   370351, 
   null, 
   "marc9000", 
   "I have to disagree. As obvious child and others have pointed out, evolution is not the basis for atheism, neither is religion and evolution mutually exclusive. However, evolution is specifically mutually exclusive to the biblical creation account, which happens to be the foundation of christianity. Other religions that don't have this foundation, and versions of christianity that don't perceive genesis as the foundation of christianity (How this is possible I have yet to see), do not perceive evolution as a threat to the validity of their religion. \n\n \n I know that obvious child and others have pointed it out, but what got my attention in this thread is that someone else pointed out something different. Let's look at it again;\n \n \nOriginally posted by Databed] Science will continue to make it increasingly difficult to create an interpretation of the Bible that agrees with what we actually see happening in the world.\n\n \n The Bible? Shouldn't those two words actually be one word; creationism? Is evolution mutually exclusive to only to creation, or to the entire Bible? Did Databed actually make a mistake, or did the truth just slip out? What does it really matter - anytime I bring up scientific hostility to religion, it only gets me responses like it got me in post #24;\n \n \nOriginally Posted by marc9000 \n So if I go to a website that promotes atheism, I won't really see any references to science? \n\n \n \n Are you saying that your paranoid delusions have something to do with an effective argument for proving biblical creation? \n\n \n He claims that actual current events that show declines in religion, declines in morality, increases in debt, increases in militant atheism in politics are only my paranoid delusions. When it comes to things like the recent Dover Pa, case, the dozens of scientific/atheist best selling books published in the past few years, discrimination in universities, the CULTURE WAR that is going on today, he thrusts his head in the sand and pretends they're only my delusions. If proponents of science ignore current events, or are all over the map concerning the exact extent of just how much of religion they want to destroy, how can I trust them to tell me what happened millions of years ago? \n \n As atheist scientists continue to try to \"make things increasingly difficult\" for just about anything they want, they need to remember one thing, that human imperfection is present in atheism just as it is in any other human endeavor. Atheists can put on an elevated, confident front, but it's not hard to see many of them seek out evolution as a source of confidence and comfort. The idea that sin is present, and may have a price, is not something that is always easy for them to disregard. \n \n \n \n \nI would suggest that you just say that evolution opposes the concept of creation, which it does, not the idea of religion as a whole, nor God himself.\n\n \n I can't say it, because I'm not seeing it. Again, if evolutionists can't get their stories straight, how am I supposed to know how straight their stories are concerning millions of years ago?", 
   {
    "unicode_changes_made": true
   }, 
   370181, 
   null, 
   1253242680.0
  ], 
  [
   370352, 
   null, 
   "marc9000", 
   "Originally Posted by Accipiter \n Religious people, what are your most effective arguments for proving biblical creation \n\n \n \nSo Marc, you going to even bother to try?\n\n \n No, it can't be proven. Just like Deism and/or atheism can't be proven - it's been addressed before many times. This thread started out as flame-bait, nothing more. I just happened to notice something profound in post #19, and decided to explore it a little. You see, here on 4forums (without heavy moderation) even flame-bait threads can turn into something useful. If you don't like it, I'd suggest you retreat to your favorite place, EvC.", 
   {
    "unicode_changes_made": true
   }, 
   370184, 
   null, 
   1253242980.0
  ], 
  [
   370354, 
   null, 
   "unkerpaulie", 
   "Marc, I think I understand where you're coming from. Science is atheistic by nature, because science can only include the study of what is observable. Since God is, by definition, unobservable, science must necessarily exclude God from any form of hypotheses or conclusions. Unless we figure out a way to show that God or God's effects are unobservable, science cannot even address the question of the existence of God. \n \n However, science does not interfere with one's individual beliefs about God. Despite what scientific conclusions are drawn, religious beliefs is the choice of the individual in question, rather than based on what can be considered universal axioms. As much as one may want to put a religious belief on par with fact or truth, it still remains that religious beliefs are going to be subjective and based on the absence of supporting empirical evidence. That's why its called faith. \n \n I would say that since the creation account in Genesis is the foundation for both christianity and the bible itself, then evolution, being that it opposes creation, by extension also opposes the bible. Its fair to say this. Obvious child pointed out that it doesn't oppose religion as a whole, nor even the existence of God himself. In fact, many people feel that it doesn't even oppose christianity, and find some way to make the theory of evolution coexist with their version of the christian religion. \n \n However, with respect to what I consider fundamentalist christianity, yes, evolution opposes the foundation of this religion. That's why it would be more accurate to specify bible-based christianity, rather than religion as a whole.", 
   {}, 
   370351, 
   null, 
   1253244000.0
  ], 
  [
   370368, 
   null, 
   "trebor", 
   "\n However, with respect to what I consider fundamentalist christianity, yes, evolution opposes the foundation of this religion. That's why it would be more accurate to specify bible-based christianity, rather than religion as a whole.\n\n \n In specific, is would even be more accurate is that it opposes the literal reading of the bible (not just bible based) christianity, because the evidence shows that the literal reading of Genesis to be false. That does not mean that the allegorical way that many if not most Christians, and the vast majority of Jews use is opposed. It is only a very narrow interpretation that is opposed.", 
   {}, 
   370354, 
   null, 
   1253247240.0
  ], 
  [
   370390, 
   null, 
   "obvious_child", 
   "the greatest... and most signifigant piece of evidence is the motions of all heavenly bodies.\n\n \n I wasn't aware that physics proves God exists. \n \n How does the fact that gravity defines how objects move in space equates to God being the cause of creation?", 
   {}, 
   370206, 
   null, 
   1253259540.0
  ], 
  [
   370391, 
   null, 
   "obvious_child", 
   "No, it can't be proven.\n\n \n Fair enough. Wonder why Archie refuses to admit this. \n \n \nYou see, here on 4forums (without heavy moderation) even flame-bait threads can turn into something useful. If you don't like it, I'd suggest you retreat to your favorite place, EvC.\n\n \n Favorite place? Did you even know how many posts I have there? \n \n Btw, I see you did not respond to my other post. Especially the part where I cited many of us giving a dumb Muslim hell for his stupid beliefs.", 
   {
    "unicode_changes_made": true
   }, 
   370352, 
   null, 
   1253259600.0
  ], 
  [
   370403, 
   null, 
   "Mosheh Thezion", 
   "I wasn't aware that physics proves God exists. \n \n How does the fact that gravity defines how objects move in space equates to God being the cause of creation?\n\n \n \n gravity does not define.. expanding spiral galaxies.\n \n it is completely opposite to big bang...\n \n which is why they invented dark matter and dark energy... to justify the impossibility of a big bang condensing cloud formation theory...\n \n \n It is obvious... that it would be to much work, to educate all of you on the sciences, and I should restrict this kind of debate to a science forum... as you people simply do not know the evidence.\n \n \n The fact is... you.. you... can point to any given piece of evidence.. and I can show that it fits in my theory of a dimensional progression.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   370390, 
   null, 
   1253264700.0
  ], 
  [
   370417, 
   null, 
   "Penfold", 
   "The fact is that googling your name brings up at least one science forum where you are banned for insisting on peddling your pseudoscientific mumbo jumbo.", 
   {}, 
   370403, 
   null, 
   1253284020.0
  ], 
  [
   370436, 
   null, 
   "gansao", 
   "I have theory....ghosts definitely exist( there is evidence to prove it) but you can never see them because they always stand behind you.\n Pass the nobel prize", 
   {}, 
   370417, 
   null, 
   1253290860.0
  ], 
  [
   370529, 
   null, 
   "Mosheh Thezion", 
   "The fact is that googling your name brings up at least one science forum where you are banned for insisting on peddling your pseudoscientific mumbo jumbo.\n\n \n \n ha... and that one thread went on for 20 pages.. and in the end, I did not loose... and I was banned for breaking a rule they made up just for me... where by I was not allowed to post images anymore... which was the only way they could win... because they could not win the argument.\n \n I knew it was coming... and posted more pictures anyway, as it is essential in decribing the complicated subject.\n \n the thread.. was getting too many hits.. and eating up band width.. so they had to shut it down, but they could not win with evidence or science, so they used a forum rule.\n \n Try again..\n \n -Mosheh Thezion", 
   {}, 
   370417, 
   null, 
   1253350140.0
  ], 
  [
   370530, 
   null, 
   "Mosheh Thezion", 
   "go on fellas... name a bit of science based evidence... real evidence... and not just theory based on interpretation of....\n \n there is a difference..\n \n \n \n And lets start from there.\n \n -Mosheh Thezion", 
   {}, 
   370529, 
   null, 
   1253350260.0
  ], 
  [
   370648, 
   null, 
   "obvious_child", 
   "gravity does not define.. expanding spiral galaxies.\n \n it is completely opposite to big bang.\n\n \n Clearly, you don't understand what a singularity is. \n \n Again, how does physics prove God?", 
   {}, 
   370403, 
   null, 
   1253426940.0
  ], 
  [
   370649, 
   null, 
   "Mosheh Thezion", 
   "Clearly, you don't understand what a singularity is. \n \n Again, how does physics prove God?\n\n \n so.. then... show me evidence for a singularity then.????\n \n show me one black hole, provide evidence, that its a singularity and not mearly a massive black dwarf.\n \n Can you do it? can anyone?\n \n no...\n \n but go ahead and try, because that evidence does not exist.\n \n Like I said.. provide evidence... not the conceptual theory derived from the evidence.\n \n \n Evidence.. like the thing at the center of our galaxy... \n \n its black... its dense.. and has massive gravity...\n \n but thats all we know... and there is nothing proving its a singularity. (A hole)\n \n Or that singularities (holes) can even exist.\n \n \n Believing in holes in space that lead to mysterious unknowns is based on nothing but theory based on imagination... and is not evidence.\n \n try again.\n \n -Mosheh Thezion", 
   {}, 
   370648, 
   null, 
   1253429520.0
  ], 
  [
   370660, 
   null, 
   "obvious_child", 
   "Which proves my point. \n \n You equate a singularity as only a hole. Do I really need to say anything else? \n \n Gravitational singularity - Wikipedia, the free encyclopedia\n \n Besides, your entire argument is based on God of The Gaps.", 
   {}, 
   370649, 
   null, 
   1253444460.0
  ], 
  [
   370661, 
   null, 
   "Mosheh Thezion", 
   "mathmatical models are not evidence, as they are dependant on the evidence, and can work based on false assumptions.\n \n for example.. the classic concept of the event horizon... COULD very well be the surface of the super dence object in question.\n \n it is possile to present mathmatical models for things which cannot exist in reality, such as self folding dimensional mapping and warping and changing patterns which are common in screen savers... it can be done mathmatically, and the patterns can be run mathmatically, but that does not prove that any such thing can exist in nature.\n \n Evidence, and conjecture and mathmatical models are different things.\n \n Scientist says neutron stars, not black holes, at center of galaxies\n \n I can provide just as many sites showing that as many scientists are arguing that black holes probubly dont exist, or cannot exist..\n \n And in the end... we find that there is no real evidence.\n \n You can link to wiki all you want...\n \n Facts are facts... and the fact is... there is no real evidence for black holes or singularities... at all.\n \n its all conjecture even if the math is huge and detailed.\n \n try again.\n \n -Mosheh Thezion emoticon_xkill", 
   {}, 
   370660, 
   null, 
   1253447520.0
  ], 
  [
   370664, 
   null, 
   "T.Q", 
   "Try again? Why? You just called a singularity a \"hole\", which pretty much shows that, despite all the scientific terms you like to (incorrectly) use, you have no idea what you're talking about. As does your challenge to show that what we think are black holes aren't just black dwarfs, since black dwarfs are hypothetical, and the universe is too young for any to have formed.\n \n To get back to the thread topic, put up or shut up already. Post a concise, detailed example of an argument that supports the biblical creation \"model\".", 
   {}, 
   370661, 
   null, 
   1253449020.0
  ], 
  [
   370677, 
   null, 
   "jazyjason", 
   "Try again? Why? You just called a singularity a \"hole\", which pretty much shows that, despite all the scientific terms you like to (incorrectly) use, you have no idea what you're talking about. As does your challenge to show that what we think are black holes aren't just black dwarfs, since black dwarfs are hypothetical, and the universe is too young for any to have formed.\n \n To get back to the thread topic, put up or shut up already. Post a concise, detailed example of an argument that supports the biblical creation \"model\".\n\n \n They'll just throw random Bible verses in there, sprinkle a bit of doomsday talk with a dash of bigotry mixed with half hearted \"love\" and call it scientific evidence.", 
   {}, 
   370664, 
   null, 
   1253453220.0
  ], 
  [
   370697, 
   null, 
   "Easyrider", 
   "They'll just throw random Bible verses in there, sprinkle a bit of doomsday talk with a dash of bigotry mixed with half hearted \"love\" and call it scientific evidence.\n\n \n This from the man who has chosen carnal, radical left-wing folly over Christ and common sense.", 
   {}, 
   370677, 
   null, 
   1253468760.0
  ], 
  [
   370701, 
   null, 
   "T.Q", 
   "This from the man who has chosen carnal, radical left-wing folly over Christ and common sense.\n\n \n Hmm, that doesn't sound like an argument for creation either. Or is that your best evidence for creation? I wouldn't be surprised.", 
   {}, 
   370697, 
   null, 
   1253471880.0
  ], 
  [
   370707, 
   null, 
   "Accipiter", 
   "This from the man who has chosen carnal, radical left-wing folly over Christ and common sense.\n\n \n \n You are not representative of common sense EZ.\n \n What you are representative of is ignorant bigotry.", 
   {}, 
   370697, 
   null, 
   1253474460.0
  ], 
  [
   370718, 
   null, 
   "Mosheh Thezion", 
   "show me one shred of evidence for a singularity.\n \n or a black hole.\n \n or for that matter, relate big bang to the fact that all galaxies are expanding.. as far back as 13 billion years... expanding from a small cloud into a bigger one.\n \n not condensing.\n \n the patterns in space... are that galaxies are all expanding out from the center area of a super cluster of galaxies.\n \n And all galaxies are expanding.. spirally..\n \n And all stars surrounding galaxies.. are spinning.. with orbital masses we call planets..\n \n and all atoms.. have orbitals as well..\n \n \n The fact is... the universe.. is completely structured.. and very organized.. orderly...\n \n NOT RANDOM... NOT CHAOTIC FORMATION... but repeating patterns of motion.\n \n that is evidence.\n \n and as far as we can tell... stars were not giving off light before 13 billion or so years ago... which is at the expanding birth of galaxies..\n \n strange eh?\n \n but fitting perfectly in my theory.. which again... leads back to the application of energy from an outside source..\n \n And what would that source be?\n \n eh?\n \n try again...\n \n bring forward specific evidence.. and lets discuss it.\n \n -Mosheh Thezion", 
   {}, 
   370707, 
   null, 
   1253483640.0
  ], 
  [
   370725, 
   null, 
   "gansao", 
   "show me one shred of evidence for a singularity.\n \n or a black hole.\n \n or for that matter, relate big bang to the fact that all galaxies are expanding.. as far back as 13 billion years... expanding from a small cloud into a bigger one.\n \n not condensing.\n \n the patterns in space... are that galaxies are all expanding out from the center area of a super cluster of galaxies.\n \n And all galaxies are expanding.. spirally..\n \n And all stars surrounding galaxies.. are spinning.. with orbital masses we call planets..\n \n and all atoms.. have orbitals as well..\n \n \n The fact is... the universe.. is completely structured.. and very organized.. orderly...\n \n NOT RANDOM... NOT CHAOTIC FORMATION... but repeating patterns of motion.\n \n that is evidence.\n \n and as far as we can tell... stars were not giving off light before 13 billion or so years ago... which is at the expanding birth of galaxies..\n \n strange eh?\n \n but fitting perfectly in my theory.. which again... leads back to the application of energy from an outside source..\n \n And what would that source be?\n \n eh?\n \n try again...\n \n bring forward specific evidence.. and lets discuss it.\n \n -Mosheh Thezion\n\n \n Ok show me one shred of evidence that God exists", 
   {}, 
   370718, 
   null, 
   1253486400.0
  ], 
  [
   370732, 
   null, 
   "Mosheh Thezion", 
   "Ok show me one shred of evidence that God exists\n\n \n my major point is...\n \n i spent over 7 years... compiling all the evidence.. real evidence as found by the sciences... and used all of it... as the foundation for attempting to form a theory based on all the evidence...\n \n i had no hope of success.. but one day... bingo... I did so.\n \n 7000 pages in hand written notes... and bingo.\n \n I cannot show you any evidence that god exists...\n \n but We can discuss all the established empirical evidence from all the sciences and considering it all on the whole... we find that it.. all.. suggests a progressive dimensional development pattern, which can only be based on the application of energy from an outside source which applied energy of a specific quality so as to cause the presdestined formation of matter and the motions there of, to form the very structured and organized universe we know today.\n and this dimensional progressive pattern... fits biblical genesis.\n \n which... believe me.. was not intentional.. I was very shocked by it.\n \n if you want to argue read my theory... Theory\n \n and point to specific evidence, and then lets argue about that evidence.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   370725, 
   null, 
   1253487900.0
  ], 
  [
   370735, 
   null, 
   "gansao", 
   "ok Mosh so if you cant give me any evidence that god exists then we can agree there is no evidence that God created anything...let alone the universe.\n \n \n \n Black holes...gather enough mass together and a black will occur..even if they dont exist ( and there is enough evidence thaty they do) they could exist if enough marerial was brought together..even Newtonian physics predicts this...\n \n I will decline to read your theory", 
   {}, 
   370732, 
   null, 
   1253488620.0
  ], 
  [
   370737, 
   null, 
   "Mosheh Thezion", 
   "ok Mosh so if you cant give me any evidence that god exists then we can agree there is no evidence that God created anything...let alone the universe.\n \n \n \n Black holes...gather enough mass together and a black will occur..even if they dont exist ( and there is enough evidence thaty they do) they could exist if enough marerial was brought together..even Newtonian physics predicts this...\n \n I will decline to read your theory\n\n \n \n there are thousands... literally.. of phd scientists who would say you just dont know the facts, and that black holes are not in evidence, and could not exist.\n \n \n There is nothing to suggest they exist... only that really heavy things do.\n \n there is a difference...\n \n -Mosheh Thezion", 
   {}, 
   370735, 
   null, 
   1253489040.0
  ], 
  [
   370739, 
   null, 
   "gansao", 
   "there are thousands... literally.. of phd scientists who would say you just dont know the facts, and that black holes are not in evidence, and could not exist.\n \n \n There is nothing to suggest they exist... only that really heavy things do.\n \n there is a difference...\n \n -Mosheh Thezion\n\n \n \n You have just proved that you do not even have grasp of Newtonian physics and so you really arent worth debating with..really heavy things eh?", 
   {}, 
   370737, 
   null, 
   1253489460.0
  ], 
  [
   370749, 
   null, 
   "Mosheh Thezion", 
   "You have just proved that you do not even have grasp of Newtonian physics and so you really arent worth debating with..really heavy things eh?\n\n \n Picking on my mis-use of the term heavy... is not an argument.\n \n let me say... massive. as in lots of mass.\n \n if you have something to ague do so.\n \n -Mosheh Thezion", 
   {}, 
   370739, 
   null, 
   1253491860.0
  ], 
  [
   370755, 
   null, 
   "gansao", 
   "Picking on my mis-use of the term heavy... is not an argument.\n \n let me say... massive. as in lots of mass.\n \n if you have something to ague do so.\n \n -Mosheh Thezion\n\n If you dont know the difference between heavy and massive you have even less of a grasp of physics than feared.\n To keep asking for an argument and continually showing your inability to argue is just making look foolish.\n I would suggest that you take a little time to study basic physics, please dont say that you know because it is quite obvious that you do not!\n I decline to argue with you in the same way that I would decline to argue this with a child..the child may still keep on but you know it really is not worth it.", 
   {}, 
   370749, 
   null, 
   1253492460.0
  ], 
  [
   370757, 
   null, 
   "Mosheh Thezion", 
   "If you dont know the difference between heavy and massive you have even less of a grasp of physics than feared.\n To keep asking for an argument and continually showing your inability to argue is just making look foolish.\n I would suggest that you take a little time to study basic physics, please dont say that you know because it is quite obvious that you do not!\n I decline to argue with you in the same way that I would decline to argue this with a child..the child may still keep on but you know it really is not worth it.\n\n \n \n the fact that i responded with the term 'mass'.. should be enough.\n \n but either way... you are not arguing, so it doesnt matter what you say.\n \n you can cry and run away if thats what you want to do.\n \n -Mosheh Thezion", 
   {}, 
   370755, 
   null, 
   1253492700.0
  ], 
  [
   370758, 
   null, 
   "gansao", 
   "the fact that i responded with the term 'mass'.. should be enough.\n \n but either way... you are not arguing, so it doesnt matter what you say.\n \n you can cry and run away if thats what you want to do.\n \n -Mosheh Thezion\n\n \n \n As I said..the child may keep on but you know it is not worth it.", 
   {}, 
   370757, 
   null, 
   1253492880.0
  ], 
  [
   370763, 
   null, 
   "Mosheh Thezion", 
   "As I said..the child may keep on but you know it is not worth it.\n\n \n \n then stop talking to me, and let me argue with someone who can argue.\n \n -Mosheh Thezion", 
   {}, 
   370758, 
   null, 
   1253493240.0
  ], 
  [
   370767, 
   null, 
   "gansao", 
   "As I said..the child may keep on but you know it is not worth it.", 
   {}, 
   370758, 
   null, 
   1253493540.0
  ], 
  [
   370769, 
   null, 
   "obvious_child", 
   "It's hard to have a meaningful discussion when your discussion partner's overriding belief is God of the Gaps.", 
   {}, 
   370757, 
   null, 
   1253493900.0
  ], 
  [
   370770, 
   null, 
   "Mosheh Thezion", 
   "As I said..the child may keep on but you know it is not worth it.\n\n \n \n ha... and the child keeps coming back for more. \n \n emoticon_xbouncer", 
   {}, 
   370767, 
   null, 
   1253494020.0
  ], 
  [
   370771, 
   null, 
   "Mosheh Thezion", 
   "It's hard to have a meaningful discussion when your discussion partner's overriding belief is God of the Gaps.\n\n \n wow... powerful argument there.\n \n emoticon_xbouncer", 
   {}, 
   370769, 
   null, 
   1253494080.0
  ], 
  [
   370772, 
   null, 
   "gansao", 
   "It's hard to have a meaningful discussion when your discussion partner's overriding belief is God of the Gaps.\n\n \n Thats right. He wants to discuss a subject that he knows nothing about. \n In fact he doesnt even realise that he doesnt know anything about it!\n Hard to argue with ignoranceemoticon_rolleyes", 
   {}, 
   370769, 
   null, 
   1253494140.0
  ], 
  [
   370777, 
   null, 
   "Mosheh Thezion", 
   "Thats right. He wants to discuss a subject that he knows nothing about. \n In fact he doesnt even realise that he doesnt know anything about it!\n Hard to argue with ignoranceemoticon_rolleyes\n\n \n \n the fact is..\n \n i offer a 30 page book, with detailed images and arguments for free online.\n \n but.. you have already said you wont read it.\n \n Which proves, you dont want to argue and it is you, who are the child, who just wants to scream in the corner and say... \"wrong wong wrong.. its not fair... boo hoo..\"\n \n grow up... and if you cant read 30 pages.. then it is you.. who are wasting my time.\n \n Im going to ignore you now... until you read it.\n \n if you cant .. then stop talking to me.\n \n I did not spend 7 years in the library to argue with fools.\n \n -Mosheh Thezion", 
   {}, 
   370772, 
   null, 
   1253494680.0
  ], 
  [
   370783, 
   null, 
   "gansao", 
   "the fact is..\n \n i offer a 30 page book, with detailed images and arguments for free online.\n \n but.. you have already said you wont read it.\n \n Which proves, you dont want to argue and it is you, who are the child, who just wants to scream in the corner and say... \"wrong wong wrong.. its not fair... boo hoo..\"\n \n grow up... and if you cant read 30 pages.. then it is you.. who are wasting my time.\n \n Im going to ignore you now... until you read it.\n \n if you cant .. then stop talking to me.\n \n I did not spend 7 years in the library to argue with fools.\n \n -Mosheh Thezion\n\n \n \n You didnt spend seven years in the library studying physics either by the look of it!\n I certainly would not spend my time reading 30 pages of anything you have written.Reading your posts are enough , thanks.\n \n The fact is that you have humiliated yourself and you are reacting very badly because of it!\n You can shout 'boo sucks' all you want to. You cannot even tell the difference between mass and weight therefore do do not even have the understanding of physics that an 11 year old has.\n You have not done the creationists any favours but you sure have made me laugh!\n \n See you later Einsteinemoticon_xbouncer", 
   {}, 
   370777, 
   null, 
   1253495280.0
  ], 
  [
   370795, 
   null, 
   "Accipiter", 
   "He claims that actual current events that show declines in religion, declines in morality, increases in debt, increases in militant atheism in politics are only my paranoid delusions. When it comes to things like the recent Dover Pa, case, the dozens of scientific/atheist best selling books published in the past few years, discrimination in universities, the CULTURE WAR that is going on today, he thrusts his head in the sand and pretends they're only my delusions. If proponents of science ignore current events, or are all over the map concerning the exact extent of just how much of religion they want to destroy, how can I trust them to tell me what happened millions of years ago? \n \n As atheist scientists continue to try to \"make things increasingly difficult\" for just about anything they want, they need to remember one thing, that human imperfection is present in atheism just as it is in any other human endeavor. Atheists can put on an elevated, confident front, but it's not hard to see many of them seek out evolution as a source of confidence and comfort. The idea that sin is present, and may have a price, is not something that is always easy for them to disregard.\n\n \n Your elaborate little construct here sure reads like you have mental problems.\n \n Have you ever thought about getting some help for your paranoia?", 
   {
    "unicode_changes_made": true
   }, 
   370351, 
   null, 
   1253497860.0
  ], 
  [
   370803, 
   null, 
   "obvious_child", 
   "Your elaborate little construct here sure reads like you have mental problems.\n \n Have you ever thought about getting some help for your paranoia?\n\n \n Marc9000 has exceedingly strange views regarding science in the US. He seems to think that evolution which he calls atheism is out to destroy religion and where religion he means only Christanity in the US. I pointed out how Muslims get the same XXXX for their dumb YEC beliefs to him and he hasn't posted since.\n \n Some people have beliefs so bizarre that it takes mental gymnastics to defend them.", 
   {}, 
   370795, 
   null, 
   1253504160.0
  ], 
  [
   370815, 
   null, 
   "Iuris", 
   "I certainly would not spend my time reading 30 pages of anything you have written.Reading your posts are enough , thanks.\n\n \n Don't get goaded into changing your mind. I read a printout during lunch, and I wish I could have my time back. He has no idea what he is talking about.", 
   {}, 
   370803, 
   null, 
   1253521560.0
  ], 
  [
   370820, 
   null, 
   "Mosheh Thezion", 
   "Don't get goaded into changing your mind. I read a printout during lunch, and I wish I could have my time back. He has no idea what he is talking about.\n\n \n \n I would challenge you to back that up sir.\n \n we can start with any peice of evidence you choose.\n \n -Mosheh Thezion emoticon_xkill", 
   {}, 
   370815, 
   null, 
   1253527740.0
  ], 
  [
   370822, 
   null, 
   "Iuris", 
   "How? You actually cite no evidence at all - you just posit \"Evidence shows...\" without producing any.\n \n On your page, there is no maths at all done. None. No physical models to verify, nothing.\n \n There are no fossils or similar traces of past events presented.\n \n There is no evidence at all to refute. All you offer is an explanation that does not state WHY it's supposed to be the proper explanation.", 
   {}, 
   370820, 
   null, 
   1253532360.0
  ], 
  [
   370823, 
   null, 
   "gansao", 
   "How? You actually cite no evidence at all - you just posit \"Evidence shows...\" without producing any.\n \n On your page, there is no maths at all done. None. No physical models to verify, nothing.\n \n There are no fossils or similar traces of past events presented.\n \n There is no evidence at all to refute. All you offer is an explanation that does not state WHY it's supposed to be the proper explanation.\n\n \n \n Suspicion confirmed!\n Thank you Iuris.", 
   {}, 
   370822, 
   null, 
   1253533080.0
  ], 
  [
   370842, 
   null, 
   "marc9000", 
   "Marc, I think I understand where you're coming from. Science is atheistic by nature, because science can only include the study of what is observable. \n\n \n And that study can only go so far, no further than the time and rearrangement realm. \n \n \nSince God is, by definition, unobservable, science must necessarily exclude God from any form of hypotheses or conclusions. Unless we figure out a way to show that God or God's effects are unobservable, science cannot even address the question of the existence of God. \n\n \n Science/scientists should acknowledge that reality probably goes beyond what we can see in our time and rearrangement realm. So they should stop with their hypotheses/conclusions before entering their atheist worldview, and calling it science, and presenting it to public school students as science. \n \n The reason I say they should acknowledge it is because their own research shows more and more mathematical improbability of naturalistic origins. \n \n \nHowever, science does not interfere with one's individual beliefs about God. Despite what scientific conclusions are drawn, religious beliefs is the choice of the individual in question, rather than based on what can be considered universal axioms. As much as one may want to put a religious belief on par with fact or truth, it still remains that religious beliefs are going to be subjective and based on the absence of supporting empirical evidence. That's why its called faith. \n\n \n And there is much faith in what passes as science today. Faith that time and rearrangement is all there is to reality. Maybe one more realm, the one that involves actual creation/destruction (something that humans will never be able to study/comprehend) or several more realms actually do exist. Applying time and rearrangement to other realms that we can't possibly study is more than just a waste of time, it could be harmful and wrong. \n \n \nI would say that since the creation account in Genesis is the foundation for both christianity and the bible itself, then evolution, being that it opposes creation, by extension also opposes the bible. Its fair to say this. Obvious child pointed out that it doesn't oppose religion as a whole, nor even the existence of God himself. In fact, many people feel that it doesn't even oppose christianity, and find some way to make the theory of evolution coexist with their version of the christian religion. \n\n \n That's what obvious_child and many people say. As we see in this thread, Databed and Trebor say something else - they say that science/evolution opposes the Bible, or a literal reading of the Bible. Not just the creation account, but the entire Bible. They never debate each other on it, they'll even switch positions on it, depending on the argument. Sometimes only Genesis, sometimes the entire Bible. They have no room to call creationists dishonest. \n \n \nHowever, with respect to what I consider fundamentalist christianity, yes, evolution opposes the foundation of this religion. That's why it would be more accurate to specify bible-based christianity, rather than religion as a whole.\n\n \n If Christianity isn't Bible based, Christianity doesn't exist. I'm pretty sure you agree with me on that - you're one of the honest ones.\n \n Bible based Christianity is what western world political structures were built upon. \"Religion as a whole\" is irrelevant in western politics, when competing with atheism/humanism.", 
   {
    "unicode_changes_made": true
   }, 
   370354, 
   null, 
   1253544240.0
  ], 
  [
   370843, 
   null, 
   "marc9000", 
   "Your elaborate little construct here sure reads like you have mental problems.\n \n Have you ever thought about getting some help for your paranoia?\n\n \n \nDarwin's Dangerous Idea / Daniel Dennett - 1995\n The End of Faith/ Sam Harris - 2004\n The God Delusion/ Richard Dawkins - 2006\n Letter to a Christian Nation/ Sam Harris - 2006\n The Atheist Universe / David Mills - 2006\n Breaking the Spell/ Daniel Dennett - 2006\n Everything you know about God is wrong/ Russ Kick - 2007\n The Quotable Atheist / Jack Huberman - 2007\n The Atheist Bible / Joan Konner - 2007\n Nothing - Something to Believe / Lalli Nica - 2007\n The Portable Atheist / Christopher Hitchens - 2007\n God is Not Great / Christopher Hitchens - 2007\n God - the failed hypothesis - How Science Shows That God Does Not Exist / Victor Stenger - 2007\n 50 Reasons People Give For Believing in God/ Guy Harrison - 2008\n Godless: How an Evangelical Preacher Became One of America's Leading Atheists / Barker/Dawkins - 2008 \n\n \n How many of these books are on your shelf?", 
   {
    "unicode_changes_made": true
   }, 
   370795, 
   null, 
   1253544360.0
  ], 
  [
   370849, 
   null, 
   "marc9000", 
   "Marc9000 has exceedingly strange views regarding science in the US. He seems to think that evolution which he calls atheism is out to destroy religion and where religion he means only Christanity in the US. \n\n \n http://thesciencenetwork.org/media/press/Beyond_Belief_NYT.pdf\n \n \n\"Anything we scientists can do to weaken the hold of religion,\" says Nobel Prize winner Steven Weinberg, \"should be done and may in the end be our greatest contribution to civilization.\" \n\n \n \nI pointed out how Muslims get the same XXXX for their dumb YEC beliefs to him and he hasn't posted since. \n\n \n The same XXXX? The threads aren't very long, and don't get many atheist posters, do they? In this one, it went from Islam, to attacks on Archangel, who started out agreeing with the atheists! Imagine that!", 
   {
    "unicode_changes_made": true
   }, 
   370803, 
   null, 
   1253545200.0
  ], 
  [
   370851, 
   null, 
   "gansao", 
   "Using science to disprove Christianity should be a pointless exercise.\n If , for instance, one should use the story of the great flood to prove that the Bible is incorrect , it could be said that an omnipotent God can do exactly as God likes and at that point he did.\n Cries of 'goddidit' from the sidelines should not be enough to make a Christian try to justify the great flood by quoting psuedo science.\n \n Again using science to try to prove the existence of god is pointless. Nothing that has been discovered in science would be evidence that God exists..dont say that the symetry and order of the universe proves God exists ..it doesnt.\n It just shows that the universe is symetrical and ordered.\n \n Creationists should not fear, nor even regard the argument that to balance a creationist earth with what has been discovered in science must mean that we live in a 'matrix' type existence...that would not be a great leap( and I mean this respectfully) from what they believe already.\n \n \n Christianity or at least fundamental Christianity has lost the fight to remain a major force in politics.\n They should just thank god that they are blessed with the knowledge that they have, teach the ones who want to be taught and leave the rest to God.", 
   {}, 
   370842, 
   null, 
   1253545680.0
  ], 
  [
   370857, 
   null, 
   "Accipiter", 
   "How many of these books are on your shelf?\n\n \n Showing me the books you've read is not the issue here and only serves to make my point.\n \n you latch onto everything you can read about it like a hypochondriac reads about an illness that he thinks he has.\n \n you have become totally immersed is this imagined conspiracy of yours and it shows up in here.\n \n Being on the kind of medication commonly prescribed for this kind of thing will not change you into a slobbering fool, you'll hardly notice a difference and it will cleanup your thinking pretty quickly.", 
   {
    "unicode_changes_made": true
   }, 
   370843, 
   null, 
   1253547780.0
  ], 
  [
   370864, 
   null, 
   "trebor", 
   "Showing me the books you&#8217;ve read is not the issue here and only serves to make my point.\n \n you latch onto everything you can read about it like a hypochondriac reads about an illness that he thinks he has.\n \n you have become totally immersed is this imagined conspiracy of yours and it shows up in here.\n \n Being on the kind of medication commonly prescribed for this kind of thing will not change you into a slobbering fool, you&#8217;ll hardly notice a difference and it will cleanup your thinking pretty quickly.\n\n \n \n Nah, I bet Marc hasn't read a single one of those books, he probably took the list off an anti-science creationist web site.\n \n He doesn't realize that while there might be individuals who justify their lack of religion with science it doesn't mean that science has anything to do with religion.\n \n For example, Francis Collins uses science to justify his belief in God. People who are scientists often project their own personal belief into 'behind the scenes' .. as long as they don't project their personal belief into the work they do, so what? If they do, that's what the peer review is for, to eliminate that bias.", 
   {}, 
   370857, 
   null, 
   1253551140.0
  ], 
  [
   370884, 
   null, 
   "T.Q", 
   "In this one, it went from Islam, to attacks on Archangel, who started out agreeing with the atheists! Imagine that!\n\n \n Which pretty much proves the point that O_C was making-atheists don't single out christianity for their \"attacks\", all religions that make wacked out claims are treated the same.\n \n You have very strange ideas of who people should and shouldn't agree with and in what circumstances. For example, if a christian agrees with science wrt evolution, he's obviously a lying atheist trying to appear as a christian. In that thread you linked above, by your implication, we all should have been standing shoulder to shoulder with Archie against Eassnir, even though Archie was saying things just as stupid.", 
   {}, 
   370849, 
   null, 
   1253561760.0
  ], 
  [
   370910, 
   null, 
   "unkerpaulie", 
   "And that study can only go so far, no further than the time and rearrangement realm. \n \n Science/scientists should acknowledge that reality probably goes beyond what we can see in our time and rearrangement realm. So they should stop with their hypotheses/conclusions before entering their atheist worldview, and calling it science, and presenting it to public school students as science. \n \n The reason I say they should acknowledge it is because their own research shows more and more mathematical improbability of naturalistic origins. \n \n\n The thing is, when science comes upon a phenomenon that they don't have a rational explanation for, they don't create premature conclusions that include what cannot be observed or verified with real evidence. They simply leave it as \"inconclusive\" until more evidence is found that supports a complete conclusion. There is nothing wrong with having an inconclusive explanation, and from a scientific point of view, it is much better than coming to a conclusion that cannot be supported by observable evidence. This maintains a standard in science that keeps all conclusions on par with all other conclusions. \n \n If science includes just one conclusion that incorporates an unobservable\n or unsupported explanation, what do you thing would happen? Let's say that we decide to conclude that since we can't yet conclusively explain what caused the big bang, that it was God who did it. Then what would stop us from concluding that it was actually 7 leprechauns on flying unicorns that magically energized a single point with enough energy to create everythibg in the universe. Both conclusions, and endless others, are equally valid in that they have no observable evidence to support them and both entertain the idea reality goes beyond what we can see in our time and rearrangement realm. \n \n \nAnd there is much faith in what passes as science today. Faith that time and rearrangement is all there is to reality. Maybe one more realm, the one that involves actual creation/destruction (something that humans will never be able to study/comprehend) or several more realms actually do exist. Applying time and rearrangement to other realms that we can&#8217;t possibly study is more than just a waste of time, it could be harmful and wrong. \n \n\n That which we cannot study or comprehend cannot be used to explain what we can study and comprehend. \n \n \nThat&#8217;s what obvious_child and many people say. As we see in this thread, Databed and Trebor say something else &#8211; they say that science/evolution opposes the Bible, or a literal reading of the Bible. Not just the creation account, but the entire Bible. They never debate each other on it, they&#8217;ll even switch positions on it, depending on the argument. Sometimes only Genesis, sometimes the entire Bible. They have no room to call creationists dishonest. \n \n\n I don't think they call creationists dishonest. Gullible and ignorant, perhaps. But the position of trying to reinterpret genesis in order to fit evolution into it is actually more dishonest than either accepting genesis as is, or rejecting it completely. \n \n \nIf Christianity isn&#8217;t Bible based, Christianity doesn&#8217;t exist. I&#8217;m pretty sure you agree with me on that &#8211; you&#8217;re one of the honest ones.\n \n Bible based Christianity is what western world political structures were built upon. \"Religion as a whole\" is irrelevant in western politics, when competing with atheism/humanism.\n\n Remember, atheism is the belief that God and/or the supernatural realm doesnt exist. Even religions based on unbiblical beliefs still have some form of deity or supernatural element. And while they may not be opposed by science directly, they are certainly opposed by atheism.", 
   {}, 
   370842, 
   null, 
   1253573760.0
  ], 
  [
   370923, 
   null, 
   "marc9000", 
   "[computer problems - if I disappear unexpectedly tonight, I'll be back in a few days]", 
   {}, 
   370851, 
   null, 
   1253580240.0
  ], 
  [
   370928, 
   null, 
   "marc9000", 
   "Using science to disprove Christianity should be a pointless exercise. \n\n \n It should be, but apparently it's not, since a Nobel Prize winner suggests it will/would be a benefit to mankind. I realize every belief system has its nut cases (Christianity has Fred Phelps) but every denomination of Christianity renounces what he says. I don't notice anyone in science renouncing anything by Steven Weinberg. \n \n \nIf , for instance, one should use the story of the great flood to prove that the Bible is incorrect , it could be said that an omnipotent God can do exactly as God likes and at that point he did. \n\n \n The problem is, science does not accept that. \n \n \nCries of 'goddidit' from the sidelines should not be enough to make a Christian try to justify the great flood by quoting psuedo science. \n\n \n Cries of goddidn'tdomuchofanything are also psuedo science. \n \n \nAgain using science to try to prove the existence of god is pointless. \n\n \n Unless it's used to counter those who use science to try to disprove the existance of God. \n \n \nNothing that has been discovered in science would be evidence that God exists..dont say that the symetry and order of the universe proves God exists ..it doesnt.\n It just shows that the universe is symetrical and ordered. \n\n \n And nothing has been discovered in science that would disprove God's existence, in spite of what Victor Stenger says in his book (in the list above), and in spite of the reverence and respect the scientific community showers upon him. \n \n \nCreationists should not fear, nor even regard the argument that to balance a creationist earth with what has been discovered in science must mean that we live in a 'matrix' type existence...that would not be a great leap( and I mean this respectfully) from what they believe already. \n\n \n Could you run that one by me again - not sure what you're saying. \n \n \n \nChristianity or at least fundamental Christianity has lost the fight to remain a major force in politics. \n\n \n I know, atheists have fought the battle well. One of its many leaders, Weinberg, won the Nobel Prize for his contribution. But Christianity has the right to try to maintain at least a ~minor~ force in politics. \n \n \nThey should just thank god that they are blessed with the knowledge that they have, teach the ones who want to be taught and leave the rest to God.\n\n \n Since atheists largely are writing science textbooks, God could use some Christians as intruments to do something about it.", 
   {}, 
   370851, 
   null, 
   1253581380.0
  ], 
  [
   370931, 
   null, 
   "marc9000", 
   "Showing me the books you've read is not the issue here and only serves to make my point. \n\n \n Uh, a point was made, but it wasn't yours. They are exactly the issue, though I never claimed to have read them, their mere existance/copyright dates/popularity, their influence on society coupled with a statistically proven decline in Christianity proves my point. \n \n \nyou latch onto everything you can read about it like a hypochondriac reads about an illness that he thinks he has. \n\n \n The immense popularity of those books has nothing to do with me personally. \n \n \nyou have become totally immersed is this imagined conspiracy of yours and it shows up in here. \n\n \n Do you believe Steven Weinberg exists? \n \n \nBeing on the kind of medication commonly prescribed for this kind of thing will not change you into a slobbering fool, you'll hardly notice a difference and it will cleanup your thinking pretty quickly.\n\n \n You're a credit to the scientific community.", 
   {
    "unicode_changes_made": true
   }, 
   370857, 
   null, 
   1253581980.0
  ], 
  [
   370932, 
   null, 
   "marc9000", 
   "Nah, I bet Marc hasn't read a single one of those books, he probably took the list off an anti-science creationist web site. \n\n \n So if it's a source you don't like, the books don't exist? Actually, I quickly and easily compiled the list from an Amazon search and read the reviews, the same way a teenager could have if he was looking for a reason to disobey his parents. May have made knocking up his girlfriend, or throwing away the credit card bills a little easier. \n \n \nHe doesn't realize that while there might be individuals who justify their lack of religion with science it doesn't mean that science has anything to do with religion. \n\n \n Do YOU believe Steven Weinberg exists? \n \n \nFor example, Francis Collins uses science to justify his belief in God. People who are scientists often project their own personal belief into 'behind the scenes' .. as long as they don't project their personal belief into the work they do, so what? \n\n \n Did Steven Weinberg project his personal belief into behind the scenes? Was he dismissed as a nut case, or given the Nobel Prize? \n \n \n If they do, that's what the peer review is for, to eliminate that bias.\n\n \n If 90+ percent of the scientific community are atheists, I'm not convinced that the peer review process is perfecto unbiased.", 
   {}, 
   370864, 
   null, 
   1253582460.0
  ], 
  [
   370933, 
   null, 
   "marc9000", 
   "Which pretty much proves the point that O_C was making-atheists don't single out christianity for their \"attacks\", all religions that make wacked out claims are treated the same. \n\n \n Did Steven Weinberg make a wacked out claim? \n \n \nYou have very strange ideas of who people should and shouldn't agree with and in what circumstances. For example, if a christian agrees with science wrt evolution, he's obviously a lying atheist trying to appear as a christian. \n\n \n That has to be determined on a case by case basis. If he shows no knowledge of the very basics of Christianity, constantly attacks creationists, agrees with atheists on everything, it can get suspicious. \n \n \n In that thread you linked above, by your implication, we all should have been standing shoulder to shoulder with Archie against Eassnir, even though Archie was saying things just as stupid.\n\n \n There are hardly any Muslims here, but Eassnir simply isn't/wasn't gone after like Christians are here, in that thread and others.", 
   {}, 
   370884, 
   null, 
   1253582880.0
  ], 
  [
   370935, 
   null, 
   "marc9000", 
   "The thing is, when science comes upon a phenomenon that they don't have a rational explanation for, they don't create premature conclusions that include what cannot be observed or verified with real evidence. They simply leave it as \"inconclusive\" until more evidence is found that supports a complete conclusion. There is nothing wrong with having an inconclusive explanation, and from a scientific point of view, it is much better than coming to a conclusion that cannot be supported by observable evidence. This maintains a standard in science that keeps all conclusions on par with all other conclusions. \n\n \n But who is qualified to determine exactly what inconclusive explanations can possibly be explained at a later date? \n \n \nIf science includes just one conclusion that incorporates an unobservable\n or unsupported explanation, what do you thing would happen? Let's say that we decide to conclude that since we can't yet conclusively explain what caused the big bang, that it was God who did it. \n\n \n When did it become established for sure that a big bang even happened? I'm afraid that's a case of saying something over and over loud enough and long enough that it becomes true. The big bang theory is a result of being locked in a time and rearrangement realm - it seems like I remember seeing somewhere that a Christian originated it. Just because a lot of Christians and atheists both like it, doesn't make it automatically true. It's possible that the universe can into existence in another way, in another realm. \n \n \nThen what would stop us from concluding that it was actually 7 leprechauns on flying unicorns that magically energized a single point with enough energy to create everythibg in the universe. Both conclusions, and endless others, are equally valid in that they have no observable evidence to support them and both entertain the idea reality goes beyond what we can see in our time and rearrangement realm. \n\n \n So does the big bang, and much of evolution. \n \n \nThat which we cannot study or comprehend cannot be used to explain what we can study and comprehend. \n\n \n So why all this scientific speculation about big bangs and evolution and abiogenesis? We can't study the past without quickly turning it into philosophical speculation, equivilent to speculation about design. \n \n \nI don't think they call creationists dishonest. Gullible and ignorant, perhaps. \n\n \n Lots of names, plenty more than just those three. :)\n \n \nBut the position of trying to reinterpret genesis in order to fit evolution into it is actually more dishonest than either accepting genesis as is, or rejecting it completely. \n\n \n I agree. Reinterpreting Genesis, or reinterpreting Christianity. \n \n \n \n \n \nRemember, atheism is the belief that God and/or the supernatural realm doesnt exist. Even religions based on unbiblical beliefs still have some form of deity or supernatural element. And while they may not be opposed by science directly, they are certainly opposed by atheism.\n\n \n Unbiblical beliefs aren't involved in western politics enough to generate militant opposition from atheists. You see very little opposition to any religion on these forums except Christianity.", 
   {}, 
   370910, 
   null, 
   1253584200.0
  ], 
  [
   370936, 
   null, 
   "T.Q", 
   "Did Steven Weinberg make a wacked out claim? \n \n \n \n That has to be determined on a case by case basis. If he shows no knowledge of the very basics of Christianity, constantly attacks creationists, agrees with atheists on everything, it can get suspicious. \n \n \n \n There are hardly any Muslims here, but Eassnir simply isn't/wasn't gone after like Christians are here, in that thread and others.\n\n \n Marc, go fight your \"culture war\" somewhere else. Your problem is you think that your particular brand of Christianity should be consulted in all matters of politics, and you feel that instead, it's being relegated to the back burner and \"atheism\" (which you classify as \"any point of view I don't particularily agree with\") is getting more of a say in American politics. You, of course, have no actual evidence for this, and even if you did, it would say nothing about the methodology or validity of any scientific discipline (see the above definition of \"atheism\" to see how science gets dragged into your fantasy). It especially has nothing to do with the topic thread, or any other topic you bring your call-to-arms conspiracy theory up in.\n \n As for Eassnir, try reading the thread again. Within a few posts he was being labelled the same thing I label you and Archie as-crackpot, loon, delusional, etc etc.\n \n 7 pages, still no argument that supports creationism. Anyone here actually surprised? Me neither.", 
   {}, 
   370933, 
   null, 
   1253584680.0
  ], 
  [
   370938, 
   null, 
   "marc9000", 
   "Marc, go fight your \"culture war\" somewhere else. Your problem is you think that your particular brand of Christianity should be consulted in all matters of politics, and you feel that instead, it's being relegated to the back burner and \"atheism\" (which you classify as \"any point of view I don't particularily agree with\") is getting more of a say in American politics. \n\n \n You make straw men. I've never referred to \"all matters of politics\", and nowhere do I spell out \"my particular brand of Christianity\", except to state what denomination I belong to (LCMS Lutheran), which doesn't disagree in basics with any other organized denomination. \n \n \nYou, of course, have no actual evidence for this, and even if you did, it would say nothing about the methodology or validity of any scientific discipline (see the above definition of \"atheism\" to see how science gets dragged into your fantasy). \n\n \n \"Fantasy\", hmmm, you haven't checked out the list of books I referred to in post #92, or especially, the link in post #93. That's loaded with my evidence, we could specifically refer to some of it. Maybe obvious child would like to do that, if you don't. (at the end of it, Dawkins and Weinberg are musing about how much they'll miss religion when it's gone. \n \n \n It especially has nothing to do with the topic thread, or any other topic you bring your call-to-arms conspiracy theory up in. \n\n \n The topic of the thread was nothing but flame bait, as I said earlier. Without heavy moderation, sometimes flame bait can be turned around, making the original poster sorry he started the thread. Ain't 4forums great? \n \n \nAs for Eassnir, try reading the thread again. Within a few posts he was being labelled the same thing I label you and Archie as-crackpot, loon, delusional, etc etc. \n\n \n But you didn't have 15 or 20 helpers, as you often do with myself or Archangel. \n \n \n7 pages, still no argument that supports creationism. Anyone here actually surprised? Me neither.\n\n \n So the thread backfired on you just the same as the starter of it?", 
   {}, 
   370936, 
   null, 
   1253585880.0
  ], 
  [
   370941, 
   null, 
   "unkerpaulie", 
   "But who is qualified to determine exactly what inconclusive explanations can possibly be explained at a later date? \n \n\n Actually, they usually are explained at a later date. And if they aren't, they remain inconclusive until the answers are found. In science we can't just stick conclusions into unexplained phenomenon because they've been inconclusive too long. \n \n \nWhen did it become established for sure that a big bang even happened? I'm afraid that's a case of saying something over and over loud enough and long enough that it becomes true. The big bang theory is a result of being locked in a time and rearrangement realm - it seems like I remember seeing somewhere that a Christian originated it. Just because a lot of Christians and atheists both like it, doesn't make it automatically true. It's possible that the universe can into existence in another way, in another realm. \n \n\n Its a theory, as you've correctly stated. And it will remain a theory until more data that either conclusively supports it or significantly contradicts it is discovered. How all the energy needed to create the universe got squeezed into a tiny atomic point is still a mystery to scientists. However, the big bang theory explains much of what is observed, such as galaxy formation and movement, planetary age and energy distribution. Plus it fits into predictable scientific models, like the theory of relativity. It isn't conclusive, and perhaps never will be, but its better to have an inconclusive theory that is based on what evidence we actually have, than to come to an absolute conclusion based on evidence we don't have. \n \n \n \nSo why all this scientific speculation about big bangs and evolution and abiogenesis? We can't study the past without quickly turning it into philosophical speculation, equivilent to speculation about design. \n \n\n This is the central argument for creation (to answer T.Q.'s question above). The creationist argues that scientific theories regarding the origin of the world are nothing but philosphical speculation, and that why not choose the biblical speculation instead?\n \n There is only one origin of the world. The scientific theories and creation cannot be both right, and either one being correct will immediately prove that the other is wrong. However, another entirely different explanation could be correct, proving the both former wrong. \n \n The difference between biblical creation and the scientific theories of spontaneous origin is that creation is based on a tale, not originated by moses, but learned culturally from the region in which he grew up. There's more to this than I can go into now, but suffice it to say that creation myths (not just the biblical one), were formed at a time when we believed that the earth was a huge flat expanse, that the horizon was the edge of the world, and that the sun, moon and stars orbited the earth. Creation tells us that everything was born out the sea, including the land itself. \n \n There are lots of myths which incorporate these ideas. Do a wiki search for \"creation myths\" and you'll find a very long list of quite similar stories, particularly from the mediteranean region. \n \n What we know today about the nature of the universe is thousands of years more advanced than what the ancient semites used to sit around campfires telling each other. \n \n But, you have the perogative to choose which story of the origin of the world you wish to accept.", 
   {}, 
   370935, 
   null, 
   1253591880.0
  ], 
  [
   370948, 
   null, 
   "trebor", 
   "Did Steven Weinberg make a wacked out claim? \n \n \n \n That has to be determined on a case by case basis. If he shows no knowledge of the very basics of Christianity, constantly attacks creationists, agrees with atheists on everything, it can get suspicious. \n \n \n \n There are hardly any Muslims here, but Eassnir simply isn't/wasn't gone after like Christians are here, in that thread and others.\n\n \n Tell me then, what do the books actually say? Are you totally judging the book by the title? Come on. .. give me a synopisis of what those book talk about, and the points they make.\n \n Nor, does that counter any of hte points I made either. \n \n you argue from ignorance. That is .. well, ignorant\n b", 
   {}, 
   370933, 
   null, 
   1253595240.0
  ], 
  [
   370951, 
   null, 
   "obvious_child", 
   "http://thesciencenetwork.org/media/press/Beyond_Belief_NYT.pdf\n\n \n I'm not sure why you insist upon playing such a game when you know you will lose . \n \n By your reasoning, Westboro Baptist represents all Christians. \n \n \nThe same XXXX? The threads aren't very long, and don't get many atheist posters, do they?\n\n \n Indeed. The same ****. He made asinine arguments on the basis of the Koran and got his *** handed to him. \n \n \nIn this one, it went from Islam, to attacks on Archangel, who started out agreeing with the atheists! Imagine that!\n\n \n It doesn't matter if you start out agreeing on one aspect. That does not excuse your later idiocy. \n \n So much for your utter bull**** argument that only \"Christanity\" (notice how you ignore the metaphorical Christians who don't get flak for XXXXX beliefs) gets whacked.", 
   {}, 
   370849, 
   null, 
   1253597280.0
  ], 
  [
   370953, 
   null, 
   "obvious_child", 
   "Did Steven Weinberg make a wacked out claim? \n\n \n Does Mr. Weinberg represent all atheists? Careful about your next words. You might just admit that the most racist, hateful bigots on the planet represent all of Christanity. \n \n \nThat has to be determined on a case by case basis. If he shows no knowledge of the very basics of Christianity, constantly attacks creationists, agrees with atheists on everything, it can get suspicious.\n\n \n Except that you call everyone who doesn't agree with you an atheist. \n \n \nThere are hardly any Muslims here, but Eassnir simply isn't/wasn't gone after like Christians are here, in that thread and others.\n\n \n Clearly, you did not read his various threads. Argument from position of absolute sheer ignorance as usual eh Marc?", 
   {}, 
   370933, 
   null, 
   1253597460.0
  ], 
  [
   370954, 
   null, 
   "obvious_child", 
   "\n But you didn't have 15 or 20 helpers, as you often do with myself or Archangel. \n\n \n Seriously, you are AGAIN bringing up the truly asinine argument of numbers having anything to do with validity?\n \n \n How about you just own up to the fact that you, nor Archie could never win a debate one on one? \n \n Your \"helper\" argument is just a coward claim to hide your own sheer incompetence behind.", 
   {}, 
   370938, 
   null, 
   1253597520.0
  ], 
  [
   370956, 
   null, 
   "Mosheh Thezion", 
   "How? You actually cite no evidence at all - you just posit \"Evidence shows...\" without producing any.\n \n On your page, there is no maths at all done. None. No physical models to verify, nothing.\n \n There are no fossils or similar traces of past events presented.\n \n There is no evidence at all to refute. All you offer is an explanation that does not state WHY it's supposed to be the proper explanation.\n\n \n evidence... ok..\n \n lets start.\n \n Any good theory.. must be able to clearly explain for..\n \n 1) galaxies orbit superclusters... which are spirally expanding..\n This is major energy... the motion of entire galaxies....\n \n 2) the spiral expansion of galaxies.. all the way back as far as we can look...13 billion years...\n where there are no condensing clouds... no dust between galaxies..\n all matter.. is contained in expanding spirals of stars around galaxies.\n \n 3) stars.. are spiralling outward from the center of galaxies.. and.. stars tend to stay seperated...for the most part... while gravity should combine them.. but they dont.\n \n 4) all the matter around all stars.. forms a disk..a spiral disk.. \n \n 5) all stars when they explode.. leave behind a dwarf... which is literally shown to be.. in evidence... a solid nucleon.\n literally.. like a solid proton... not made up of atoms.. but one giant atomic core.. which is evidence that matter is not limited to existance as only atoms.... but can exist as super nucleons the size of planets or bigger...\n AND YET... no math has ever been able to show how a nova... an exploding star could form such a mass...\n but all stars do. (or... they were there when the star formed!!!(my theory))\n \n 6) atoms come in a range of sizes... and.. all atoms contain nuetrons...\n but.. if all protons etc.. formed seperately.. in space. as in big bang... we must recognize that nuetrons have a half life of 12 seconds.\n which means all atoms must for formed, and collected into atoms in 12 seconds... after the big bang formed those nucleons in loose free space..\n \n 7) Many scientist who run the numbers, say there has not been enough time for gas clouds to form stars, and then explode and cause other gas clouds to condence via shock waves to form new stars... just not enough time.. in the 13 billion year history..\n and...\n \n 8) at the 13 billion year mark... looking back... with hubble.. we see that star must of formed.. in... those expanding spiral galaxies... while in an expanding universe... .. i.e.. in an expanding galaxie in an expanding supercluster.. in an expanding universe, big bang requires that gas cloud condence.. and do so in a manner to form stars... which big bangs says occurs due to shock waves from exloding stars... which... does not add up.\n \n 9) Uranium... has a half life of 4.5 billion years... and our solar system is only 4.6 billion years old.. which means there must of been twice as much uranium at the dawn of our solar system... \n but.. the problem is... according to the math.. normal nova.. normal exploding stars... dont make uranium...\n So where did all these very heavy atoms come from? \n since the evidence says, nova cant make it.. and only super massive stars or collisions of rare occurance can do so... \n which again... shows the problem is there has not been enough time.\n \n 10) and why is there no small clouds of gas between galaxies?\n \n why no intergalactic dust clouds?\n \n the evidence shows.. there is just pure empty space.. and all gases in space came from emissions of galaxies.. and form clouds around galaxies... not filling all of deep space.\n \n \n 11) the microwave background radiation... which many use to say there was a big bang... just so happens .. 22 cm.. radiation.. to be the radiation emitted by cold hydrogen in space.. which surrounds our star system.. and surrounds our galaxies... which shows that evidence.. is highly suspect and could be from the abundant gases projected from stars.\n \n 12) and stars.. emit.. positrons... in volume..\n \n not electrons... but mostly positrons...\n \n why?\n what could be pushing all this positively charged solar wind away from the sun?\n \n \n \n 13) x-ray photographs of the sun... based on the spectrum of iron... shows that indeed.. iron is present in the sun.. but only visable in the flares, and sun spots... and under the surface of the sun...\n and there is virtually... no.. none.. visible on the normal surface.\n \n which is clear evidence, that the idea that the sun is mostly hyrdogen gas... is completely flawed, because as the sun, with its intence gravity would be a gas diffusior.. the hydrogen being lightest will naturally cover its outer surface... which in no way suggest the sun is all hydrogen.. ONLY THE SURFACE IS.\n \n \n \n YA KNOW... \n \n i COULD GO ON ALL DAY...\n \n seriously.. there is so much evidence.. that for you to say I can present it with anything less than a 3000 page book.. is just nonsence.\n \n there is to much evidence.\n \n My book was written for people who know the evidence.\n \n not for fools who think they do.\n \n \n but ok..\n \n lets start with the evidence presented above.\n \n None of it... fits with big bang... but it is the foundation of my theory.\n \n My theory was derived from collecting all the evidence, and considering it all as one big picture... \n \n \n so lets discuss that evidence.\n \n -Mosheh Thezion", 
   {}, 
   370822, 
   null, 
   1253599320.0
  ], 
  [
   370971, 
   null, 
   "Iuris", 
   "Half right, half wrong. What you get right is those instances where you keep general, but the second you go for specifics that would actually point toward your itnerpretations, you get lost.\n \n \nPoints 1-4\n\n Observations about galaxies, explanations of their origins and predections about their future are a field of scientific study. Galaxies move, which is how we got the original idea of the big bang. Not all expand, not all contract - their state and future behavior will differ from galaxy to galaxy. Some will expand, some will collapse. So far, nothing but basic astronomy. No indications of deities, except that we don't know what started the big bang.\n \n \nPoint 5\n\n Aaand we hit the first big snag - White dwarves, Neutron stars and Black holes. Which kinda torpedos your theory at this point. It fails to even encompass the other two end scenarios.\n \n Also, it shows that you don't realize how we came to these conclusions. A star's life is too long for us to observe it as a whole. What we get is the snapshots of now (OK, of BACK THEN, really, given the distances involved) that we see in the sky. Then, their life cycles were analyzed by looking at what fuel a star burns at what point in life and what it means.\n \n \n6) atoms come in a range of sizes... and.. all atoms contain nuetrons...\n but.. if all protons etc.. formed seperately.. in space. as in big bang... we must recognize that nuetrons have a half life of 12 seconds.\n which means all atoms must for formed, and collected into atoms in 12 seconds... after the big bang formed those nucleons in loose free space..\n\n First particles formed in the big bang. The matter condensed into stars, and within stars fusion converts hydrogen into heavier atoms. After a star ends, we get the heavier materials that can form planets.\n \n Also, re: neutron's half life... you do realize that half life means BETA DECAY! Neutron splits up into a proton and an electron - you know what that combination is known as? Try hydrogen ions.\n \n \n7) Many scientist who run the numbers, say there has not been enough time for gas clouds to form stars, and then explode and cause other gas clouds to condence via shock waves to form new stars... just not enough time.. in the 13 billion year history..\n and...\n\n Yes, some things the models don't explain. However, that doesn't mean that your model, which has apparently never even seen maths, has anything to support them.\n \n \n8) at the 13 billion year mark... looking back... with hubble.. we see that star must of formed.. in... those expanding spiral galaxies... while in an expanding universe... .. i.e.. in an expanding galaxie in an expanding supercluster.. in an expanding universe, big bang requires that gas cloud condence.. and do so in a manner to form stars... which big bangs says occurs due to shock waves from exloding stars... which... does not add up.\n\n Not due to shockwaves - they ARE the shockwaves. The shockwaves spread the heavier elements from the star, where they start to condense into planets.\n \n \n9) Uranium... has a half life of 4.5 billion years... and our solar system is only 4.6 billion years old.. which means there must of been twice as much uranium at the dawn of our solar system... \n\n Which Uranium? You ever heard of isotopes?\n \n \nbut.. the problem is... according to the math.. normal nova.. normal exploding stars... dont make uranium...\n\n Produce this math, please. What I hear makes it OK.\n \n \n \nSo where did all these very heavy atoms come from? \n since the evidence says, nova cant make it.. and only super massive stars or collisions of rare occurance can do so... \n which again... shows the problem is there has not been enough time.\n\n Existence of problem itself is only posited by you, with no actual evidence that there is any controversy. Never mind that it shows more accurately that you have no idea what you are talking about.\n \n \n \n10) and why is there no small clouds of gas between galaxies?\n \n why no intergalactic dust clouds?\n \n the evidence shows.. there is just pure empty space.. and all gases in space came from emissions of galaxies.. and form clouds around galaxies... not filling all of deep space.\n\n Because of how galaxies form. Most of space is empty, there being not enough matter to go around.\n \n \n \n11) the microwave background radiation... which many use to say there was a big bang... just so happens .. 22 cm.. radiation.. to be the radiation emitted by cold hydrogen in space.. which surrounds our star system.. and surrounds our galaxies... which shows that evidence.. is highly suspect and could be from the abundant gases projected from stars.\n\n Actually, red shift is the main argument for a big bang. Also, where'd you get 22 cm? 1.9 mm is the data I've seen...\n \n \n \n12) and stars.. emit.. positrons... in volume..\n \n not electrons... but mostly positrons...\n \n why?\n what could be pushing all this positively charged solar wind away from the sun?\n\n Huh? Solar wind and EM radiation I know about, but since when is the sun radiating positrons? Source?\n \n \n \n13) x-ray photographs of the sun... based on the spectrum of iron... shows that indeed.. iron is present in the sun.. but only visable in the flares, and sun spots... and under the surface of the sun...\n and there is virtually... no.. none.. visible on the normal surface.\n \n which is clear evidence, that the idea that the sun is mostly hyrdogen gas... is completely flawed, because as the sun, with its intence gravity would be a gas diffusior.. the hydrogen being lightest will naturally cover its outer surface... which in no way suggest the sun is all hydrogen.. ONLY THE SURFACE IS.\n\n Silly. 76% hydrogen, next is helium, with iron traces. That's what we see. IT FEEDS ON HYDROGEN FUSION - we do know how to use the emission spectrums to analyze the source of radiation. And from there we got to hydrogen.\n \n \n \nYA KNOW... \n \n i COULD GO ON ALL DAY...\n\n \n Spewing nonsense like that, so could anyone...\n \n \nseriously.. there is so much evidence.. that for you to say I can present it with anything less than a 3000 page book.. is just nonsence\n \n there is to much evidence.\n \n My book was written for people who know the evidence.\n \n not for fools who think they do..\n\n WHAT BLOODY EVIDENCE? You haven't produced a single shred of evidence - all of the above are just your assertions!\n \n \n \nbut ok..\n \n lets start with the evidence presented above.\n \n None of it... fits with big bang... but it is the foundation of my theory.\n \n My theory was derived from collecting all the evidence, and considering it all as one big picture... \n \n \n so lets discuss that evidence.\n\n No, let's stop. You have NOTHING. My COLLEGE LEVEL PHYSICS, after years of neglect, is enough to see that what you are offering is nonsense.\n \n I'd regret even taking you seriously, except that it has given me incentive to brush up on my physcs a bit :)", 
   {}, 
   370956, 
   null, 
   1253613780.0
  ], 
  [
   370981, 
   null, 
   "Accipiter", 
   "Iuris, why did god make the universe appear to be very old?", 
   {}, 
   370971, 
   null, 
   1253630160.0
  ], 
  [
   371018, 
   null, 
   "Iuris", 
   "'Cause he likes the occasional laugh?\n \n Why ask me?", 
   {}, 
   370981, 
   null, 
   1253642880.0
  ], 
  [
   371037, 
   null, 
   "Accipiter", 
   "Why ask me?\n\n \n I asked you because I looked at info about the Creation Museum and it said it supports the young earth theory.", 
   {}, 
   371018, 
   null, 
   1253651880.0
  ], 
  [
   371098, 
   null, 
   "Mosheh Thezion", 
   "Observations about galaxies, explanations of their origins and predections about their future are a field of scientific study. Galaxies move, which is how we got the original idea of the big bang. Not all expand, not all contract - their state and future behavior will differ from galaxy to galaxy. Some will expand, some will collapse. So far, nothing but basic astronomy. No indications of deities, except that we don't know what started the big bang.\n \n wrong.... all galaxies are expanding... EXCEPT for those which have collided, and are a jumble... as far back as hubble can look.. the pattern is always the same.. small galaxies.. spirally expanding.. into bigger galaxies over time... all of them. You may of studied Physics, but you did not focus much on cosmology.\n \n \n Aaand we hit the first big snag - White dwarves, Neutron stars and Black holes. Which kinda torpedos your theory at this point. It fails to even encompass the other two end scenarios.\n \n Wrong again, there is no evidence for black holes.. #1\n #2... dwarfs and nuetron stars, prove, matter is not limited to existance as little tiny protons and nuetrons... or limited to atoms as we know it..\n in fact they prove... atomic cores.. nucleons can be the size of planets.\n \n \n \n First particles formed in the big bang. The matter condensed into stars, and within stars fusion converts hydrogen into heavier atoms. After a star ends, we get the heavier materials that can form planets.\n \n That is what the spoon fed you in college and you ate it up, and never questioned any of it... but real scientists do... they question everything, and there all many many scientists... who dont believe this, because taken on the whole there are to many flaws with this idea...\n since... fusion of 4 hydrogen into helium, has never been accomplished in any laboratory.... and typically requires duetronium and tritium...\n but if all particles began as hydrogen...\n \n then... since protons.. decay.. by giving off a positron to become a nuetron... those positrons would destroy existing electrons, ... and all the first atoms... as hydrogen would ionize into positive ion clouds, which would never collect into atoms.. as the overall positive charge would repell all gases from each other.. in an expanding big bang space.\n \n \n \n \n Also, re: neutron's half life... you do realize that half life means BETA DECAY! Neutron splits up into a proton and an electron - you know what that combination is known as? Try hydrogen ions.\n \n There are many forms of decay... b+, b-, n, alpha, K, and L, IT, e-, not to mention y....\n maybe you should go back to college.\n \n Yes, some things the models don't explain. However, that doesn't mean that your model, which has apparently never even seen maths, has anything to support them.\n \n my model fits ALL the evidence...\n \n Not due to shockwaves - they ARE the shockwaves. The shockwaves spread the heavier elements from the star, where they start to condense into planets.\n \n 1) there are no shock waves in empty space.\n 2) all the planets are made of more than just hydrogen, so why do you think the sun is all hydrogen?\n \n \n Which Uranium? You ever heard of isotopes?\n \n 234 Pa... 6.66 hr\n 234 U.... 2.48x10^5 years\n 235 U.... 7.13x10^8 years \n 236 U ... unstable -instant fission decay\n 238 U.... 4.51x10^9 years (most common Uranium)\n \n \n Produce this math, please. What I hear makes it OK.\n \n there is no math that makes it all add up.. thats the problem...\n simple stars, cant make uranium... \n and if it was created in the big bang.. or early stars... then.. at 4.5 billion for 1/2 to decay... there would have to of been... 6-8 times as much when the galaxies formed 13 billion years ago...\n \n \n \n \n Existence of problem itself is only posited by you, with no actual evidence that there is any controversy. Never mind that it shows more accurately that you have no idea what you are talking about.\n \n no controversy for you... who just excepts everything college fed you.. which shows you are no scientist.. because scientists question everything.. doubt every assumption, and seek to break every unknown open...\n you... just said... there is no actual evidence that there is any controversy.. which proves... arguing with you. is a joke.. because you have already assumed you know everything about the universe, and that it all fits perfectly, and there is no problem.. which shows.. you are not only, not a scientist... but you are a follower, who questions nothing, and just believes what others tell you to believe,,.. \n \n \n Because of how galaxies form. Most of space is empty, there being not enough matter to go around.\n \n Wrong.. if big bang is correct... then there should be small clusters of gases and stars etc... in loose space between galaxies..\n \n but no... just empty space..\n remember the hubble evidence...\n all matter... as far back as we can see... when galaxies first form... are all in galaxies... in tight bunches.. WHICH ARE EXPANDING.. SPREADING OUT..\n which... does not fit your big bang theory... in fact it runs opposite to it.\n \n \n Actually, red shift is the main argument for a big bang. Also, where'd you get 22 cm? 1.9 mm is the data I've seen...\n \n And yet, there is no evidence that space is doing any such thing... expanding.. all we see is matter moving through it.. and that photons expand over distances... and the idea that space is expanding is an assumption....\n nothing more... and I have a much better explination for that expansion, as the 4th dimension, in my theory..\n again.. al evidence fits my theory... but is opposite to big bang.\n \n \n \n Huh? Solar wind and EM radiation I know about, but since when is the sun radiating positrons? Source?\n \n again.. go back to college.. or do a google search... gesh.\n the entire corona around the sun... is a positron cloud.. which is why the sun looks white hot... when in fact the surface of the sun is yellow.\n The corona is hotter... at 15 million degrees F, and alot of that corona cloud is blasted off the sun as the solar wind... which carries a positive charge.. of billions of volts.. +.. positive... which causes the aroura borealis in places where it hits the atmosphere... which is why we should be greatful for the magrnetic field... as it sheilds us from the positive solar wind.\n \n \n \n \n Silly. 76% hydrogen, next is helium, with iron traces. That's what we see. IT FEEDS ON HYDROGEN FUSION - we do know how to use the emission spectrums to analyze the source of radiation. And from there we got to hydrogen.\n \n The emission spectrum is only able to see the surface..\n which is where the lightest element would be.. as the heavy ones will sink... due to gravity..... so all heavy elements will go to the core..\n which means.. ALL heavy metals.. are in the core... where the reactions of energy output is...\n do you suppose the presence of heavy elements in the core, does not play a part in energy production?\n would not the addition of millions of tons of heavy metals not add to the output.. since the core.. is a nuclear furnance.. where all manner of fission would occur...? could occur?\n a dah..\n and remember... what if the dwarf... supposively made in the nova.. is in the core right now?\n white dwarfs.... are positive in charge.. and decay into black dwarfs... which are like nuetrons...\n so if a white dwarf is at the core now... not only would it provide for massive energy output at its surface... but its positive charge would explain the solar wind... and it is left behind.. from all stars as evidence...\n clear evidence.. even the smallest stars... leave behind dwarfs.\n \n \n \n WHAT BLOODY EVIDENCE? You haven't produced a single shred of evidence - all of the above are just your assertions!\n \n again,... ha.. I have complete confidence.. then pick any bit of evidence, and i can show that it fits my theory.\n \n And that same evidence.. often.. contradicts big bang.\n \n \n \n \n No, let's stop. You have NOTHING. My COLLEGE LEVEL PHYSICS, after years of neglect, is enough to see that what you are offering is nonsense.\n \n What it gave you.. was a bias.. a flawed bias.. and sadly.. you dont question any of it.\n \n \n I'd regret even taking you seriously, except that it has given me incentive to brush up on my physcs a bit :)\n \n you need more than a bit...\n \n sorry.\n -Mosheh Thezion", 
   {}, 
   370971, 
   null, 
   1253671260.0
  ], 
  [
   371112, 
   null, 
   "T.Q", 
   "time to stop drinking the bong water Mosheh.", 
   {}, 
   371098, 
   null, 
   1253680440.0
  ], 
  [
   371138, 
   null, 
   "Mosheh Thezion", 
   "time to stop drinking the bong water Mosheh.\n\n \n wow...\n such an impressive argument... i may as well go and cry in the corner, eh?\n \n -Mosheh Thezion :xbanghead", 
   {}, 
   371112, 
   null, 
   1253694780.0
  ], 
  [
   371140, 
   null, 
   "Iuris", 
   "I actually wanted to reply point by point, but really... what to?\n \n Claims about galaxies expanding and not offering sources, what am I to do? Claims regarding fusion, and not even basic maths that for helium, one needs to fuse two, not four hydrogen. Which is not supposed to have happened, even though the US first fusion tests were hydrogen bombs. Or demanding it be done in a lab, except you need the pressures of a star to make it work. Not realising that protons attract electrons into orbitals, which neutralize the outside charge of the atom, allowing molecules to form. Sending me back to college for pointing out that a neutron undergoes beta decay into protons + electrons, which are stable. Uses term shockwave, I explain what it is, and THEN starts that shockwaves can't exist in empty space while he has used the term himself. I keep explaining how stars do make uranium and he still takes it for granted that they can't. He has solar wind with positive charges of millions of VOLTS... He doesn't even know the difference between electric charge and electic potential difference...\n \n And then claims I need to brush MY physics more than a bit...\n \n \n \n Go study some actual science, Mosheh. Some actual science. Not ramblings in your head that apparently never did any maths for your own models.", 
   {}, 
   371112, 
   null, 
   1253695080.0
  ], 
  [
   371143, 
   null, 
   "Mosheh Thezion", 
   "I cant argue with people who need to be educated on the delemas of cosmology... since you are not a cosmologist.\n \n but let me say...\n \n \n \n \n \nI actually wanted to reply point by point, but really... what to?\n \n Claims about galaxies expanding and not offering sources, what am I to do? Claims regarding fusion, and not even basic maths that for helium, one needs to fuse two, not four hydrogen. \n \n this proves you dont know anything.. as hydrogen.. is one proton+one electron.. and helium is 2 protons+ 2 nuetrons+2 electrons.. which takes four hydrogen... a dah. your thinking of duetronium which is rare.\n \n \n Which is not supposed to have happened, even though the US first fusion tests were hydrogen bombs. \n \n which cannot be considered a labortory test.... and was a nuclear bomb.\n \n \n Or demanding it be done in a lab, except you need the pressures of a star to make it work. \n \n thats what they teach you.. and you eat it up...\n \n \n Not realising that protons attract electrons into orbitals, which neutralize the outside charge of the atom, allowing molecules to form. \n \n no.. it allows atoms to form... NOT MOLECULES.... and all electrons come from nuetrons which decay.... there is no other source.\n \n \n Sending me back to college for pointing out that a neutron undergoes beta decay into protons + electrons, which are stable. \n \n yES.. stable.. on the order of 12 billion years stable.. as hydrogen.\n but free floating nuetrons.. decay in 12 seconds (half life)\n \n Uses term shockwave, I explain what it is, and THEN starts that shockwaves can't exist in empty space while he has used the term himself. \n \n The shock waves in space.. are of walls of projected atoms from exploded stars... nothing else... there are no space shock waves... which shows, again.. you just dont have a clue.\n \n \n I keep explaining how stars do make uranium and he still takes it for granted that they can't. \n \n There are 1000's of scientist on earth, who will admit that nova.. cant make uranium in the amounts which exist.. or the abundance of other elements... and that there has not been enough time in the universe to make them at the rate which they could form, due to small percentage possible in nova, and in super collisions of say... two black dwarfs.. etc..\n there has not been enough time... and the fact that you say they can, shows how little you know of the problems in consmology today.\n \n \n \n He has solar wind with positive charges of millions of VOLTS... He doesn't even know the difference between electric charge and electic potential difference...\n \n \n please stop.. do a google search.. the solar wind has a voltage of several million Ev.... charge is how many electrons you have in flow... or working together in capacity, and Ev... is the potential....\n you need to learn... the solar wind.. has a huge positive charge and voltage potential... and if I mis use a term once, it changes nothing.\n it is you... who dont even know about the solar wind.\n And yet you think you know everything.\n gesh....\n the fact that you focus on little terms, shows how weak your position is because you are trying to undermine my credibility instead of discussing the evidence.\n \n And then claims I need to brush MY physics more than a bit...\n no. you did that.. i would not know if you didnt tell me.\n \n \n Go study some actual science, Mosheh. Some actual science. Not ramblings in your head that apparently never did any maths for your own models.\n\n \n I wrote a book on the subject.. what have you done?\n \n I have argued it across the world... what have you done?\n \n I am ready to discuss every bit of evidence known by modern man... are you?\n \n \n All of which leads to the idea of the application of energy from an outside source... which for lack of a better term, would be a god.\n \n and that... is why you want to walk away from arguing... because you fear god.\n \n -Mosheh thezion", 
   {}, 
   371140, 
   null, 
   1253696460.0
  ], 
  [
   371149, 
   null, 
   "Iuris", 
   "This just proves that anyone can write a book and make outrageous claims. Freedom of speech.\n \n Do you even realize that, on this forum, I was the only one willing to take you as seriously to even look at your site? That I was the only one that bothered to tell you why I know what you write is nonsense? Don't you realize other people didn't even take you that seriously? That to them, it was even more obvious that you are a joke?\n \n You have \"argued across the world\", probably by joining forums and pointing them to your website. And you convinced no one. Or did you? Did your \"church\" go beyond \"At this time, 5 - 27 - 2007, there is no bank account, and the church has a total assets of a few notebooks, and one dollar and fifty three cents.\"? How many members have you got that took the vow of poverty that would have them paid minimum wages?\n \n Please, do tell us the story of your success, you who HAVE DONE things, \"Mosheh Eesho Muhammad Al-faraj Thezion, CEO, Founder, Avatar General.\"\n \n I don't know whether this is funny or sad. Or a big joke. I'd be bang along the idea that this is a joke, except that I've seen all kinds of delusions on this forum...", 
   {}, 
   371143, 
   null, 
   1253697360.0
  ], 
  [
   371221, 
   null, 
   "gansao", 
   "This just proves that anyone can write a book and make outrageous claims. Freedom of speech.\n \n Do you even realize that, on this forum, I was the only one willing to take you as seriously to even look at your site? That I was the only one that bothered to tell you why I know what you write is nonsense? Don't you realize other people didn't even take you that seriously? That to them, it was even more obvious that you are a joke?\n \n You have \"argued across the world\", probably by joining forums and pointing them to your website. And you convinced no one. Or did you? Did your \"church\" go beyond \"At this time, 5 - 27 - 2007, there is no bank account, and the church has a total assets of a few notebooks, and one dollar and fifty three cents.\"? How many members have you got that took the vow of poverty that would have them paid minimum wages?\n \n \n \n Please, do tell us the story of your success, you who HAVE DONE things, \"Mosheh Eesho Muhammad Al-faraj Thezion, CEO, Founder, Avatar General.\"\n \n I don't know whether this is funny or sad. Or a big joke. I'd be bang along the idea that this is a joke, except that I've seen all kinds of delusions on this forum...\n\n That's what you get for encouraging himemoticon_xclownemoticon_xclownemoticon_xclown", 
   {}, 
   371149, 
   null, 
   1253739600.0
  ], 
  [
   371227, 
   null, 
   "Iuris", 
   "That's what you get for encouraging him\n\n \n Rub it in, won't ya?", 
   {}, 
   371221, 
   null, 
   1253740500.0
  ], 
  [
   371243, 
   null, 
   "marc9000", 
   " (to Mosheh Thezion)\n Do you even realize that, on this forum, I was the only one willing to take you as seriously to even look at your site? That I was the only one that bothered to tell you why I know what you write is nonsense? Don't you realize other people didn't even take you that seriously? That to them, it was even more obvious that you are a joke? \n\n \n \n Originally posted by marc9000, on 9-9-09]\n (for the record, I've looked over your website, I'd vote for you in a heartbeat) \n\n \n http://www.4forums.com/political/368893-post27.html\n \n You should research very basic things you post, before calling others \"jokes\". emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   371149, 
   null, 
   1253748360.0
  ], 
  [
   371256, 
   null, 
   "trebor", 
   "http://www.4forums.com/political/368893-post27.html\n \n You should research very basic things you post, before calling others \"jokes\". emoticon_xangel\n\n \n Marc, of course, you realize that except for a few nut jobs, no one takes you seriously either.", 
   {}, 
   371243, 
   null, 
   1253753700.0
  ], 
  [
   371270, 
   null, 
   "marc9000", 
   "Originally Posted by marc9000 \n But who is qualified to determine exactly what inconclusive explanations can possibly be explained at a later date? \n\n \n \nActually, they usually are explained at a later date. \n\n \n It depends on what category they're in. Whether they're within, or outside of, the Darwinian paradigm. \n \n \nAnd if they aren't, they remain inconclusive until the answers are found. \n\n \n That's all well and good within Darwinism. It's the challenges to Darwinian basics, or even other origins paths that don't forcefully challange it, that don't seem to remain inconclusive. The reigning scientific worldview (90% atheist) deems themselves qualified to ignore them, throw them out, attack their messengers, discriminate against them in academia. A far lower percentage of the population than 90 does not deem them qualified to do that. \n \n \nIn science we can't just stick conclusions into unexplained phenomenon because they've been inconclusive too long. \n\n \n If only that were true in every case. The 90+ percent of atheist scientists have stuck conclusions of godlessness/purposelessness in origins of life since 1859. \n \n \nIts a theory, as you've correctly stated. And it will remain a theory until more data that either conclusively supports it or significantly contradicts it is discovered. How all the energy needed to create the universe got squeezed into a tiny atomic point is still a mystery to scientists. However, the big bang theory explains much of what is observed, such as galaxy formation and movement, planetary age and energy distribution. Plus it fits into predictable scientific models, like the theory of relativity. It isn't conclusive, and perhaps never will be, but its better to have an inconclusive theory that is based on what evidence we actually have, than to come to an absolute conclusion based on evidence we don't have. \n\n \n There's really no \"perhaps\" to it - it never will be conclusive. Science doesn't have the market cornered on evidence. It's not the only source of knowledge. Why is it that other speculation, other studies, are automatically designated \"absolute\" by many/most in the scientific community? As if a scientific acknowledgement of ID is going to handicap/destroy Darwinian studies? It's the ultimate paranoia, the ultimate \"conspiracy theory\" that is more unfounded than any others out there. \n \n \nThis is the central argument for creation (to answer T.Q.'s question above). The creationist argues that scientific theories regarding the origin of the world are nothing but philosphical speculation, and that why not choose the biblical speculation instead? \n\n \n Most creationists don't imply that the Biblical speculation should be chosen, and others thrown out. \n \n \nThere is only one origin of the world. The scientific theories and creation cannot be both right, and either one being correct will immediately prove that the other is wrong. \n\n \n They both deserve equal footing, when it comes to political establishment. Neither will ever be proven - we can't go back in time. \n \n \nHowever, another entirely different explanation could be correct, proving the both former wrong. \n\n \n Come now, there can't be anything entirely different - at least anything that we could hope to comprehend in any way. Any third thing is going to be related to naturalism, or related to the supernatural. \n \n \nThe difference between biblical creation and the scientific theories of spontaneous origin is that creation is based on a tale, not originated by moses, but learned culturally from the region in which he grew up. There's more to this than I can go into now, but suffice it to say that creation myths (not just the biblical one), were formed at a time when we believed that the earth was a huge flat expanse, that the horizon was the edge of the world, and that the sun, moon and stars orbited the earth. Creation tells us that everything was born out the sea, including the land itself. \n\n \n And equally, Darwinism was based on 19th century study by one man, when there was a massive hunger for an intellectual fulfillment for atheism. A time when basic life forms were thought to be quite simple. A lot has changed in science since then. But the Darwin dogma is established. \n \n \nThere are lots of myths which incorporate these ideas. Do a wiki search for \"creation myths\" and you'll find a very long list of quite similar stories, particularly from the mediteranean region. \n\n \n But only one has stood the test of time. \n \n \nWhat we know today about the nature of the universe is thousands of years more advanced than what the ancient semites used to sit around campfires telling each other. \n \n But, you have the perogative to choose which story of the origin of the world you wish to accept.\n\n \n As a taxpayer, I wish I had the prerogative to choose equality in what school children are taught in science classes. I don't claim that Darwinism has to be eliminated, just balanced. \n \n When I first started posting at 4forums about 5 years ago, liberalism vs conservatism debates were the only things on my mind. I remember seeing the \"Creation vs Evolution\" forum heading, and saying to myself \"wow, I sure don't want any part of that\". After only a few years, it became obvious to me that the amazing monopoly that militant atheism has on the scientific community is the foundation for todays increasing liberalism. \n \n Religions have different faiths, or different interpretations of the same faith. It's only logical that there would be variations in opinions on the subject matter; behaviors, facts about people, God, etc. Science is supposed to be empirical, testable, observable, repeatable - open inquiry, not a religion in any way. Why is it comparable with religion when it comes to variations in opinions on the subject matter, about people involved? The scientific community should consist of an equal, non controversial assessment of just about every person/ subject brought to their attention. Let's look at a few examples with Wikipedia. I realize that Wikipedia gets criticism for being questionably reputable because it is open for public edit and change. It has to be kept in mind of course, but it can be worth noting that having that public involvement could also elevate it above something that is controlled by only one specific, possibly biased source. Let's just enter some names, like Michael Behe\n \n \nBehe's claims about the irreducible complexity of essential cellular structures are roundly rejected by the scientific community.\n \n\n \n Roundly rejected? A community with their expertise on testability, repeatability, observability, etc. should then roundly reject a lot of things. Let's check on Steven Weinberg\n \n \nHis books on science written for the public combine the typical scientific popularization with what is traditionally considered history and philosophy of science and atheism. \n\n \n And Weinberg also said;\n \n \n\"Anything that we scientists can do to weaken the hold of religion should be done and may in the end be our greatest contribution to civilization. \n\n \n Nothing about the scientific community roundly rejecting him! On one hand, we have Behe, a credentialed scientist exploring a path of biology that goes on a different one than an existing one that's riddled with gaps, and on the other, we have an atheist bigot. The scientific community's \" round rejections\"\n aren't squaring with the non-emotion of testable, repeatable, observable. \n \n I could show a lot more examples, but I'm sure you get the idea. Sometimes science doesn't address religion, sometimes it \"shows that God does not exist\". These opinions, and several others in between, often used by the same people in different arguments, get no criticism from the scientific community. But let Behe experiment with cellular structures in an unusual way, and he gets \"roundly rejected\". \n \n Is it really any wonder that we now have a president far more liberal than anyone could have imagined only 20 or 30 years ago? A huge percentage of the people actually believe that he has the power to adjust the temperature of the planet! \n \n I hope conservatives are waking up to what the foundation of liberalism really is.", 
   {
    "unicode_changes_made": true
   }, 
   370941, 
   null, 
   1253756580.0
  ], 
  [
   371274, 
   null, 
   "marc9000", 
   "Tell me then, what do the books actually say? Are you totally judging the book by the title? Come on. .. give me a synopisis of what those book talk about, and the points they make. \n\n \n You quoted my post #103 to T.Q., yet responded to (at least some) of what I said to you in post #102. I don't know if that's dishonesty, or if you're just disoriented, but it doesn't really matter. Some of post #102 you obviously didn't read, so let's try again;\n \n \nOriginally posted by marc9000] I quickly and easily compiled the list from an Amazon search and read the reviews\n\n \n \"Read the reviews\" did you get that part? It's only partly necessary though. Often, a book can be judged by its cover, sometimes I'm quite successful at it. Victor Stenger's \"How Science Shows That God Does Not Exist\" is a good example. I saw the title, and unlike you, I didn't wonder if it was about....gardening. I didn't wonder if it was about plumbing, or auto repair. I suspected it was written with an atheistic worldview, attempting to claim that science shows that God does not exist! About a year ago, I was wandering through a book store with probably a little too much money in my pocket, and saw a copy of it, and bought it. It's still on my shelf, though I keep it turned around backwards to keep the title invisible to any friend who might see it in my possession. It says exactly what its title told me it would say! Are you impressed? It has chapters entitled \"The Uncongenial Universe\", \"Do our values come from God\", and \"Living in the Godless universe. I don't have a copy of \"The God Delusion\", but I suspect it makes a case from an atheist viewpoint that God is a delusion! What do you think, that it may be a cookbook? \n \n Let's look at some more of those titles. \n \n \nThe End of Faith\n The Atheist Universe \n Breaking the Spell\n Everything you know about God is wrong\n The Quotable Atheist \n The Atheist Bible \n Nothing - Something to Believe \n The Portable Atheist \n God is Not Great \n\n \n Are you saying that you have no clue what those books are about? Are you saying that they might not contain an opposition to religion? \n \n \nNor, does that counter any of hte points I made either. \n\n \n Points you made? What were those, your claim in post #96 that scientists don't project their claims into the work they do? Work like writing books? I asked you in post #102 about Steven Weinbergs projections of his claims, didn't get an answer yet. \n \n \nyou argue from ignorance. That is .. well, ignorant \n\n \n If you think those books don't combine science and atheism in an attempt to win converts in the culture war, you argue from dishonesty.", 
   {
    "unicode_changes_made": true
   }, 
   370948, 
   null, 
   1253757540.0
  ], 
  [
   371275, 
   null, 
   "T.Q", 
   "I'm not going to address the rest of the post, because it's the usual creo garbage that has been refuted a thousand times here and elsewhere, but this part is just too damn stupid not to respond to:\n \n \nQuote:Behe's claims about the irreducible complexity of essential cellular structures are roundly rejected by the scientific community. \n \n Roundly rejected? A community with their expertise on testability, repeatability, observability, etc. should then roundly reject a lot of things. Let's check on Steven Weinberg\n \n Quote:His books on science written for the public combine the typical scientific popularization with what is traditionally considered history and philosophy of science and atheism. \n \n And Weinberg also said;\n \n Quote:\"Anything that we scientists can do to weaken the hold of religion should be done and may in the end be our greatest contribution to civilization. \n \n Nothing about the scientific community roundly rejecting him! On one hand, we have Behe, a credentialed scientist exploring a path of biology that goes on a different one than an existing one that's riddled with gaps, and on the other, we have an atheist bigot. The scientific community's \" round rejections\"\n aren't squaring with the non-emotion of testable, repeatable, observable.\n\n \n Well, let's see here. What are the differences between what Behe said and what Weinberg said? Gee, could it be that Behe tried to present his ideas as scientific, while Weinberg presented an opinion? No, that would be too simplistic, wouldn't it Marc?\n \n If a \"scientist\" like Behe puts forward a hypothesis, it will be tested, challeneged, and (in Behe's case) falsified, or accepted. If a scientist, like Weinberg, puts forward an opinion, why the hell would the scientific community say boo about it?", 
   {}, 
   371270, 
   null, 
   1253757600.0
  ], 
  [
   371276, 
   null, 
   "marc9000", 
   "I'm not sure why you insist upon playing such a game when you know you will lose \n\n \n So that's your way of saying that you have no desire to discuss anything in that article? That's what I thought. \n \n \nBy your reasoning, Westboro Baptist represents all Christians. \n\n \n Not quite. Westboro Baptist is opposed by mainstream Christiaity. \n \n \nWestboro has been labeled as a cult by the website apologeticsindex.org;[106] as well as by anti-cult figures such as Rick Ross. Westboro's theology differs considerably from mainstream Christianity.....\n\n \n Westboro Baptist Church - Wikipedia, the free encyclopedia\n \n Steven Weinberg is embraced by the scientific community and has a Nobel Peace Prize.", 
   {
    "unicode_changes_made": true
   }, 
   370951, 
   null, 
   1253758080.0
  ], 
  [
   371280, 
   null, 
   "marc9000", 
   "Does Mr. Weinberg represent all atheists? Careful about your next words. \n\n \n I'll be very careful - he represents all militant atheists yes, the ones who have a vendetta against religion. \n \n \n You might just admit that the most racist, hateful bigots on the planet represent all of Christanity. \n\n \n If they don't get Nobel Prizes, they're not nearly as prominent.", 
   {
    "unicode_changes_made": true
   }, 
   370953, 
   null, 
   1253758320.0
  ], 
  [
   371285, 
   null, 
   "marc9000", 
   "Seriously, you are AGAIN bringing up the truly asinine argument of numbers having anything to do with validity? \n\n \n It was actually you who brought it up, with your taunt in post #52;\n \n \nBtw, I see you did not respond to my other post. Especially the part where I cited many of us giving a dumb Muslim hell for his stupid beliefs. \n\n \n This was covered over a year and a half ago, in the \"numbers\" thread. My posts 3, and 60 make it the most clear. The whole thread is a fun read, though. \n \n \n \n\n How about you just own up to the fact that you, nor Archie could never win a debate one on one? \n\n \n I think it's a good idea to put your boldfaced lies in red type. \n \n http://www.4forums.com/political/debate-tournaments/4994-demoralized-populace.html\n \n Please tell me again that I've never defeated anyone one on one.", 
   {
    "unicode_changes_made": true
   }, 
   370954, 
   null, 
   1253759040.0
  ], 
  [
   371291, 
   null, 
   "marc9000", 
   "I'm not going to address the rest of the post, because it's the usual creo garbage that has been refuted a thousand times here and elsewhere, but this part is just too damn stupid not to respond to:\n\n \n Yes I know, there is no culture war! The scientific community is unbiased! There are no atheist propaganda books! Obama really can adjust the temperature of the planet!\n \n \nWell, let's see here. What are the differences between what Behe said and what Weinberg said? Gee, could it be that Behe tried to present his ideas as scientific, while Weinberg presented an opinion? No, that would be too simplistic, wouldn't it Marc? \n\n \n Yes, way too simplistic! The 90+ percent ruling realm can present anything they want as science or opinion, and the less than 10% can't violate separation of church and state with a different kind of science or opinion. \n \n Do you know why that is? They are outvoted. \n \n \nIf a \"scientist\" like Behe puts forward a hypothesis, it will be tested, challeneged, and (in Behe's case) falsified, or accepted. \n\n \n By atheists, yes. I suppose there are a few that actually think Behe's work was given a thoughtful look before it was rejected. :p\n \n \n If a scientist, like Weinberg, puts forward an opinion, why the hell would the scientific community say boo about it?\n\n \n Because they're atheists, they're to busy doing toasts to his Nobel Peace Prize!", 
   {}, 
   371275, 
   null, 
   1253761080.0
  ], 
  [
   371304, 
   null, 
   "T.Q", 
   "Yes I know, there is no culture war!\n\n Nope, only on the part of christians trying to force their views on everyone.\n \n \nThe scientific community is unbiased!\n\n Pretty much. Individuals are biased, but these biases are overcome by the peer review process, and the rewards for demonstrating errors.\n \n \nThere are no atheist propaganda books!\n\n Of course there are, just like there are christian propoganda books, Hindue propoganda books, Muslim propoganda books, etc, etc. And many of them use any type of evidence they think supports their position, including scientific evidence. The difference is, for some reason you equate atheist propoganda books with actual science.\n \n \n \nYes, way too simplistic! The 90+ percent ruling realm can present anything they want as science or opinion, and the less than 10% can't violate separation of church and state with a different kind of science or opinion. \n\n If it involves \"church\", guess what? It ain't science. Check out the definition of science. If you can find a valid definition that defines it as investigation of the supernatural, then you might have a point. Right now, you're just showing your ignorance.\n \n \nDo you know why that is? They are outvoted. \n\n Science isn't American Idol. \n \n \nBy atheists, yes. I suppose there are a few that actually think Behe's work was given a thoughtful look before it was rejected. :p\n \n \n \n Because they're atheists, they're to busy doing toasts to his Nobel Peace Prize!\n\n Oh wow, the EAC. Proof? Of course not.", 
   {}, 
   371291, 
   null, 
   1253764800.0
  ], 
  [
   371348, 
   null, 
   "Mosheh Thezion", 
   "This just proves that anyone can write a book and make outrageous claims. Freedom of speech.\n \n Do you even realize that, on this forum, I was the only one willing to take you as seriously to even look at your site? That I was the only one that bothered to tell you why I know what you write is nonsense? Don't you realize other people didn't even take you that seriously? That to them, it was even more obvious that you are a joke?\n \n You have \"argued across the world\", probably by joining forums and pointing them to your website. And you convinced no one. Or did you? Did your \"church\" go beyond \"At this time, 5 - 27 - 2007, there is no bank account, and the church has a total assets of a few notebooks, and one dollar and fifty three cents.\"? How many members have you got that took the vow of poverty that would have them paid minimum wages?\n \n Please, do tell us the story of your success, you who HAVE DONE things, \"Mosheh Eesho Muhammad Al-faraj Thezion, CEO, Founder, Avatar General.\"\n \n I don't know whether this is funny or sad. Or a big joke. I'd be bang along the idea that this is a joke, except that I've seen all kinds of delusions on this forum...\n\n \n \n again.. sir... you are attacking my credibility, instead of discussing the evidence.\n \n im serious.. point to any evidence, and I will show you how it fits my theory.\n \n \n I go across the world, in search of people to put me in my place and show me the flaws, i seek it.. desire it.. crave it.. and I cant find it.\n you.. have failed to point to the flaw, and your only basis for arguing, is that you cannot understand it.\n That is not my fault.\n \n I offer to discuss all of nature, in detail...\n \n and you.. are walking away..\n \n i say come back.. and lets focus on the details.\n \n I have no fear in doing so.\n .. do you?\n \n -Mosheh Thezion", 
   {}, 
   371149, 
   null, 
   1253777160.0
  ], 
  [
   371349, 
   null, 
   "Mosheh Thezion", 
   "That's what you get for encouraging himemoticon_xclownemoticon_xclownemoticon_xclown\n\n \n i dont see you trying to argue, which I call... wimpy.\n \n -Mosheh Thezion", 
   {}, 
   371221, 
   null, 
   1253777220.0
  ], 
  [
   371350, 
   null, 
   "Mosheh Thezion", 
   "http://www.4forums.com/political/368893-post27.html\n \n You should research very basic things you post, before calling others \"jokes\". emoticon_xangel\n\n \n i appreciate your defence, but there are two websites.\n \n Mosheh Thezion's Campaign Committee for U.S. Senate (R) | MOSHEH THEZION'S CAMPAIGN COMMITTEE\n \n and...\n \n Theory\n \n which are completely seperate issues... yet are related.\n \n As they both address solving for the problems of the human condition.\n \n and field theory, stands alone.\n \n your feedback is always appreciated.\n \n \n -Mosheh Thezion", 
   {}, 
   371243, 
   null, 
   1253777520.0
  ], 
  [
   372398, 
   null, 
   "Art Pigou", 
   "Because they're atheists, they're to busy doing toasts to his Nobel Peace Prize!\n\n \n His Nobel Peace Prize? emoticon_rolleyes", 
   {}, 
   371291, 
   null, 
   1254600540.0
  ], 
  [
   372477, 
   null, 
   "marc9000", 
   "His Nobel Peace Prize? emoticon_rolleyes\n\n \n Ooops, my bad. There are several classifications of Nobel prizes, aren't there? emoticon_frazzled I was thinking of Al Gore, that's what it was! I sometimes tend to confuse militant atheists with fruitcake environmentalists.", 
   {}, 
   372398, 
   null, 
   1254627960.0
  ], 
  [
   372486, 
   null, 
   "pandion", 
   "Ooops, my bad. There are several classifications of Nobel prizes, aren't there? emoticon_frazzled I was thinking of Al Gore, that's what it was! I sometimes tend to confuse militant atheists with fruitcake environmentalists.\n\n Just as we sometimes tend to confuse creationists with cretins.", 
   {}, 
   372477, 
   null, 
   1254637560.0
  ], 
  [
   372489, 
   null, 
   "T.Q", 
   "Just as we sometimes tend to confuse creationists with cretins.\n\n \n What's to confuse?", 
   {}, 
   372486, 
   null, 
   1254639660.0
  ], 
  [
   372669, 
   null, 
   "marc9000", 
   "Uh oh, two more nominees for a Nobel prize. emoticon_frazzled", 
   {}, 
   372489, 
   null, 
   1254705420.0
  ], 
  [
   373266, 
   null, 
   "prschuster", 
   "To Mosheh Thezion, You lost me when you claimed humans evolved directly from fish after an extinction event, rather than from apes. That's so ridiculous, it doesn't pay to read further. Where is the evidence that we share more DNA with a species of fish-to-human intermediate than we do with chimps?", 
   {
    "post_info": {
     "post_title": "The Missing Fish Link"
    }
   }, 
   372669, 
   null, 
   1254974040.0
  ], 
  [
   373588, 
   null, 
   "Larni", 
   "Hi Mosheh, love the way you put you occupation on your my space page as 'Madman'.\n \n Brightened up my day, rather.", 
   {}, 
   373266, 
   null, 
   1255117320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Effective Arguments For Proving Biblical Creation", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 13267, 
  "discussion_files": [
   [
    "19023.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-print.html"
   ], 
   [
    "19024.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-10-print.html"
   ], 
   [
    "19025.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-8-print.html"
   ], 
   [
    "19026.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-6-print.html"
   ], 
   [
    "19027.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-4-print.html"
   ], 
   [
    "19028.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-5-print.html"
   ], 
   [
    "19029.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-7-print.html"
   ], 
   [
    "19030.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-9-print.html"
   ], 
   [
    "19031.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-3-print.html"
   ], 
   [
    "19032.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/13267-effective-arguments-proving-biblical-creation-2-print.html"
   ]
  ], 
  "identifier": 13267
 }
]