[
 [
  [
   369584, 
   null, 
   "Bassman", 
   "A Common Sense Bill of Non-Rights\n \n \n \n We The People..... Of The United States\n \n \n\"We the sensible people of the United States, in an attempt to help everyone get along, restore some semblance of justice, avoid more riots, keep our nation safe, promote positive behavior, and secure the blessings of debt free liberty to ourselves and our great-great-great-grandchildren, hereby try one more time to ordain and establish some common sense guidelines....\n \n We hold these truths to be self evident: that a whole lot of people are so confused by the Bill of Rights that they require a Bill of NON-Rights.\"\n \n ARTICLE I: You do not have the right to a new car, big screen TV, or any other form of wealth. More power to you if you can legally acquire them, but no one is guaranteeing anything.\n \n ARTICLE II: You do not have the right to never be offended. This country is based on freedom, and that means freedom for everyone -- not just you! You may leave the room, turn the channel, express a different opinion, etc.; but the world is full of XXXXXX, and probably always will be.\n \n ARTICLE III: You do not have the right to be free from harm. If you stick a screwdriver in your eye, learn to be more careful, do not expect the tool manufacturer to make you and all your relatives independently wealthy.\n \n ARTICLE IV: You do not have the right to free food and housing. Americans are the most charitable people to be found, and will gladly help anyone in need, but we are quickly growing weary of subsidizing generation after generation of professional couch potatoes who achieve nothing more than the creation of another generation of professional couch potatoes.\n \n ARTICLE V: You do not have the right to free health care. That would be nice, but from the looks of public housing, we're just not interested in public health care.\n \n ARTICLE VI: You do not have the right to physically harm other people. If you kidnap, rape, intentionally maim, or kill someone, don't be surprised if the rest of us want to see you fry in the electric chair.\n \n ARTICLE VII: You do not have the right to the possessions of others. If you rob, cheat, or coerce away the goods or services of other citizens, don't be surprised if the rest of us get together and lock you away in a place where you still won't have the right to a big screen color TV or a life of leisure.\n \n ARTICLE VIII: You do not have the right to a job. All of us sure want you to have a job, and will gladly help you along in hard times, but we expect you to take advantage of the opportunities of education and vocational training laid before you to make yourself useful.\n \n ARTICLE IX: You do not have the right to happiness. Being an American means that you have the right to PURSUE happiness, which by the way, is a lot easier if you are unencumbered by an over abundance of idiotic laws created by those of you who were confused by the Bill of Rights.\n \n ARTICLE X: This is an English speaking country. We don't care where you are from, English is our language. Learn it or go back to wherever you came from! (lastly....) NOW..\n \n ARTICLE XI: You do not have the right to change our country's history or heritage. This country was founded on the belief in one true God. And yet, you are given the freedom to believe in any religion, any faith, or no faith at all; with no fear of persecution. The phrase IN GOD WE TRUST is part of our heritage and history, and if you are uncomfortable with it, TOUGH!!!!\n", 
   {
    "post_info": {
     "post_title": "Bill of Non Rights!"
    }
   }, 
   null, 
   null, 
   1252886640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bill of Non Rights!", 
  "url": "http://www.4forums.com/political/politics-debates/13277-bill-non-rights.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13277, 
  "discussion_files": [
   [
    "296.html", 
    "http://www.4forums.com/political/politics-debates/13277-bill-non-rights-print.html"
   ]
  ], 
  "identifier": 13277
 }
]