[
 [
  [
   370133, 
   null, 
   "OldSarge", 
   "Lies, damn lies, and VPC statistics\n July 21, 9:06 AMMinneapolis Gun Rights ExaminerJohn Pierce\n \n \"Torture numbers, and they'll confess to anything.\" - Gregg Easterbrook\n \n I have always felt that the Violence Policy Center (VPC) was very aptly named. After all, they do advocate for public policy positions that would certainly result in violence against law abiding citizens if implemented.\n \n Thankfully, their increasingly shrill cries for American citizens to abandon freedom for the nurturing bosom of a totalitarian regime have been generally ignored by one and all.\n \n However, I must give them credit for dogged determination in the face of overwhelming reality. You have to remember that, when they were formed in 1988, there were 15 states where obtaining a concealed carry permit was legally impossible and 25 \"may-issue\" states where obtaining a permit was uncertain at best.\n \n But now, after 21 years of diligent hand-wringing by the VPC and their ilk, there are only 2 states remaining which do not allow concealed carry and 39 states have passed \"shall-issue\" laws which require that all citizens who meet the statutory requirements be issued a permit without the nepotism, elitism and cronyism that are the hallmarks of the \"may-issue\" process.\n \n Talk about a stark image of failure ...\n \n But the VPC soldiers on, not allowing two decades of abysmal, abject failure to discourage them from their insidious mission. Their latest attack on the fundamental right of self-defense comes as Senators Thune and Vitter have introduced an amendment to the National Defense Authorization Act (S. 1390) which would allow an individual who has met the requirements for a carry permit in his home state, or who is otherwise allowed by his home state's law to carry a firearm, to carry a firearm for protection in any other state that issues such permits so long as the laws of the state in which the firearm is carried are observed.\n \n As states such as Maryland, New York, and New Jersey panic over the idea of losing the ability to provide disarmed herds of victims for their criminals, the VPC has sprung to the rescue like a well paid mob lawyer and has released the results of a poorly concocted \"study\" claiming to illustrate the evils of concealed carry permits.\n \n I use the word \"study\" loosely in order to not offend the sensibilities of any true statistician who might be reading this article. Their methodology appears to have been to assign a slightly inebriated intern to do a Google news search for \"permit holder\" and \"charged with\".\n \n These results were apparently then pasted into notepad and ultimately compiled into a state by state list by the VPC's crack technical staff. The resulting PDF file (the creation of which I imagine was a matter of some pride) was dubbed Law Enforcement and Private Citizens Killed by Concealed Handgun Permit Holders: An Analysis of News Reports, May 2007 to April 2009.\n \n On a more serious note\n \n The \"study\" purports to show that during the strangely arbitrary period from May 2007 until April 2009, permit holders were responsible for the deaths of 7 police officers and 44 citizens.\n \n Now ... the loss of a single innocent life is a tragedy that cannot be taken too seriously. And as an ardent supporter of our nation's law enforcement officers, who are overwhelmingly our brothers and sisters in our struggle to protect and enhance our rights as gun owners, I mourn the loss of these 7 brave officers deeply.\n \n But does this \"study\" hold water as it attempts to capitalize on these deaths politically? Ted Deeds, Chief Operating Officer of the Law Enforcement Alliance of America (LEAA) doesn't think so.\n \n \"I've only just started looking at it and, no surprise, I think there will be lots of holes in it. As always, one cop injured or killed, one good guy injured or killed is too many. But I suspect that there are A LOT more significant mechanisms of injury/death than what this so-called 'report' hopes to conclude.\"\n \n Let's examine the many, many flaws that render their data virtually meaningless and reduces their \"study\" to nothing more than the ideological propaganda that is the normal grist of the VPC mill.\n \n Flaw #1: How did they identify permit holders?\n \n The report makes it clear that they have no idea whether or not they are accurately identifying these parties as permit holders. In the study, they admit as much, \"Because of the secretive nature of concealed handgun permit laws, the VPC relied primarily on news accounts.\"\n \n Wait ... what? The very premise upon which the \"study\" is based is the fact that these shooters are permit holders. And this key, threshold issue was determined by relying upon news reports? I cannot remember the last time that I read a news report involving a firearm that did not contain a serious mistake of fact that was glaringly evident to anyone with even a modicum of firearms knowledge.\n \n But wait ... surely this lack of verifiable facts can be remedied. After all, the presence or absence of a carry permit would be entered into evidence in the trial and thus available to the VPC for verification.\n \n Except ... this leads us to flaw #2.\n \n Flaw #2: Charged with a crime does not equal conviction\n \n Many of the alleged permit holders noted in this report are described as having been charged with a crime but no further information is provided as to the disposition of the charge. This is an important and glaring attempt to cloud the issue.\n \n In many states and jurisdictions, a citizen who properly and legally defends themselves from an attack may well expect to be initially charged with a crime. The charges may later be dropped or may be no-true-billed at the grand jury level. A charge does NOT equal a conviction and yet the VPC, an organization that promotes itself as a public policy think-tank on legal and constitutional issues, treats them as synonymous.\n \n It should come as no surprise that the VPC does not support the concepts of \"due process\" or \"innocent until proven guilty\" any more than they do the right to defend one's self or one's family.\n \n Perhaps I could suggest a new VPC motto. \"Individual rights are like potato chips, you can't destroy just one!\"\n Flaw #3: Does my permit allow me to carry a strangling cord?\n \n Another blatant attempt to pad the data was brought to my attention by Mr. Deeds. It comes in the form of several data points involving non-handgun related killings by \"permit holders\" (see Flaw #1).\n \n Carry permits allow a person to carry a handgun for personal protection. In cases where rifles or other weapons are used to commit a crime, the fact that the person may or may not have been a permit holder is a moot point and not germane to the issue at hand.\n \n Flaw #4: Who is more dangerous?\n \n The VPC concludes their report by stating that these examples illustrate clearly that concealed carry laws are not good public policy because permit holders are dangerous. Furthermore, there is a clear implication that they are more dangerous than the general public.\n \n Let's take a closer look at the statistics to refute this wild inaccuracy. According to the FBI Uniform Crime Report, across the general public in the United States, there are an average of .042802 murders per 1,000 citizens per year.\n \n Now ... even if we concede all 51 deaths detailed in the VPC report as wrongful deaths, averaging them across the over 6 MILLION permit holders in the United States and taking into account the two year timeframe, we get an average of .00425 per 1,000 per year.\n \n In other words, even if they are 100% correct in their wildly flawed report, they have simply proven that permit holders commit murders at a rate that is 1/10th of the general public.\n \n The VPC report also makes much of the fact that 7 of the victims in these news reports were police officers. They go out of their way to imply that as concealed carry has swept across the nation, law enforcement deaths have risen alarmingly. The only problem with this? It, like so much else that comes from the VPC, is blatantly untrue.\n In a report released last week, the National Law Enforcement Officers Memorial Fund released data that soundly refutes this claim. Chairman of the Memorial Fund, Craig Floyd said it best, \"There are three-times more officers on our streets than in the 1970s, and we have half the number of fatalities.\"\n \n As a matter of fact, since this is supposed to be a debate over statistics, let's map the killing of officers with firearms against the rise in shall issue states. The data for officer deaths comes from the FBI Uniform Crime Reports and the Department of Justice's Bureau of Justice Statistics (See VPC ... that is what we call citing to actual authority).", 
   {
    "post_info": {
     "post_title": "Brady's favorite source exposed"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1253142540.0
  ], 
  [
   370138, 
   null, 
   "sinjin", 
   "...Senators Thune and Vitter have introduced an amendment to the National Defense Authorization Act (S. 1390) which would allow an individual who has met the requirements for a carry permit in his home state, or who is otherwise allowed by his home state's law to carry a firearm, to carry a firearm for protection in any other state that issues such permits so long as the laws of the state in which the firearm is carried are observed.\n\n \n Thune-Vitter interstate right to carry reciprocity amendment fails\n Close but no cigar.", 
   {}, 
   370133, 
   null, 
   1253143980.0
  ], 
  [
   370140, 
   null, 
   "OldSarge", 
   "Thune-Vitter interstate right to carry reciprocity amendment fails\n Close but no cigar.\n\n \n Are you trying to refute the lies of VPC? If so not even close. try and stay on topic.", 
   {}, 
   370138, 
   null, 
   1253144700.0
  ], 
  [
   370146, 
   null, 
   "sinjin", 
   "Are you trying to refute the lies of VPC? If so not even close. try and stay on topic.\nWhy would I want to do that? I was just posting info relative to part of your C/P job.", 
   {}, 
   370140, 
   null, 
   1253145840.0
  ], 
  [
   370148, 
   null, 
   "OldSarge", 
   "Why would I want to do that? I was just posting info relative to part of your C/P job.\n\n \n Then why the inane comment? Unless you are playing troll.", 
   {}, 
   370146, 
   null, 
   1253145900.0
  ], 
  [
   370152, 
   null, 
   "sinjin", 
   "Then why the inane comment? Unless you are playing troll.\nComment? The one where I assume you were rooting for its passage? Weren't you?", 
   {}, 
   370148, 
   null, 
   1253146680.0
  ], 
  [
   370157, 
   null, 
   "OldSarge", 
   "Comment? The one where I assume you were rooting for its passage? Weren't you?\n\n \n If I was I would have included it. Since I didn't you jumped to the wrong conclusion. I was pointing out the lies of the VPC period. Next time read only the black part. ", 
   {}, 
   370152, 
   null, 
   1253148000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Brady's favorite source exposed", 
  "url": "http://www.4forums.com/political/gun-control-debates/13299-bradys-favorite-source-exposed.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13299, 
  "discussion_files": [
   [
    "24677.html", 
    "http://www.4forums.com/political/gun-control-debates/13299-bradys-favorite-source-exposed-print.html"
   ]
  ], 
  "identifier": 13299
 }
]