[
 [
  [
   370643, 
   null, 
   "antonia", 
   "Please read and share:\n \n ------------------\n \n HEALTHCARE JUSTICE WEEK\n September 20th &#8211; 30th, 2009\n \n Join us in Washington D.C. September 24th, 4:30pm at Upper Senate Park for the 3rd Annual Health Care Justice Vigil.\n \n Join the Mad as Hell Doctors for their Washington D.C. Rally on September 30th in Lafayette Square Park from 4pm - 7pm.\n \n We also need volunteers in Washington, DC between Sept. 20 and the 27th. Physicians for a National Health Program will have a space on the National Mall where they will place American Flags to represent the number of people who die each day in this country because they lack healthcare. They will add more flags each day. We need volunteers to staff the tent and pass out sample national healthcare cards, collect petition signatures and hand out fliers between the hours of 10 am and 6 pm. We need volunteers to set up the exhibit on the 20th and take it down on the 27th. And we need volunteers to watch over the exhibit during the off hours - 6 pm to 10 am. Please contact MDPNHP@gmail.com if you want to help.\n \n ------------------\n \n For more information, including the SEPTEMBER 20th March For Jobs, and what is happening in your area, please visit Healthcare Justice Week &#8211; Healthcare-NOW!\n \n ------------------\n \n Also, the G20 Summit will take place in Pittsburgh on September 24-25, and provides another opportunity for single payer activism. September 20 is the March for Jobs which kicks off a week-long tent city for the unemployed and homeless. All the information you need is at Bail Out the People-Not the Banks!.\n \n These events uphold a deeply important time for those who have lost someone to the broken U.S. healthcare system, or who are still fighting the denials of the for-profit health insurance companies.\n \n Healthcare justice activists will join together reaching across the country to support each other and remember those who have been lost. We will post vigil details from around the country as they come in.\n \n The number of deaths due to insufficient healthcare in the wealthiest of all nations is a grim reminder of the scope of the healthcare crisis.\n \n The Urban Institute estimated that 22,000 adults died in 2006 because they did not have health insurance.\n \n A 2008 study published in Health Affairs Journal analyzed the health systems of 19 countries. The study found that the United States had the highest rate of preventable deaths before the age of 75. The study concluded that as many as 101,000 deaths a year could be prevented by ensuring that all patients receive quality care in a timely manner.\n \n That&#8217;s one death every five minutes that would be prevented if the US healthcare system were fair and accessible to everyone.\n \n If you have lost someone because of insurance denials, or have a healthcare horror experience you want to share, please contact Healthcare-NOW! at stories@healthcare-now.org. To read healthcare horror stories, view the Death by Spreadsheet Booklet.\n \n -----------------------\n \n Thank you,\n \n Antonia\n \n YouTube - We Shall Overcome -- Bruce Springsteen", 
   {
    "post_info": {
     "post_title": "Healthcare Justice Week"
    }
   }, 
   null, 
   null, 
   1253419140.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Healthcare Justice Week", 
  "url": "http://www.4forums.com/political/health-debates/13316-healthcare-justice-week.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13316, 
  "discussion_files": [
   [
    "1221.html", 
    "http://www.4forums.com/political/health-debates/13316-healthcare-justice-week-print.html"
   ]
  ], 
  "identifier": 13316
 }
]