[
 [
  [
   370939, 
   null, 
   "zsu2357", 
   "Personally I thought it was to the point and worth reading.My older daughter e-mailed it to me.\n \n MOST ALL OF THIS HAS ALREADY HAPPENED.\n \n \n What would you say if I gave you 11 reasons why the elections in 2010 will be the most important in the history of the United States ? \n \n 1. What if I had told you in October 2008, before the last presidential election, that before Barack Obama's first 100 days in office, the federal government would be in control of both the mortgage and the banking industries? That 19 of America 's largest banks would be forced to undergo stress tests by the federal government which would determine if they were insufficiently capitalized, so they must be supervised by the government? \n Would you have said, \"C'mon, that will never happen in America .\" \n \n 2. What if I had told you that within Barack Obama's first 100 days in office the federal government would be the largest shareholder in the US Big-Three automakers: GM, and Chrysler? That the government would kick out the CEO's of these companies and appoint hand-picked executives with zero experience in the auto industry and that executive compensation would be determined, not by a Board of Directors, but by the government? \n Would you have said, \"C'mon, that will never happen in America !\" \n \n 3. What if I had told you that Barack Obama would appoint 21 Czars, without congressional approval, accountable only to him, not to the voters, who would have control over a wide range of US policy decisions. That there would be a Stimulus Accountability Czar, an Urban Czar, a Compensation Czar, an Iran Czar, an Auto Industry Czar, a Cyber Security Czar, an Energy Czar, a bank bailout Czar, and more than a dozen other government bureaucrats with unchecked regulatory powers over US domestic and foreign policy. \n Would you have said, \"C'mon, that will never happen in America !\" \n \n 4. What if I had told you that the federal deficit would be $915 billion in the first six months of the Obama presidency - with a projected annual deficit of $1.75 trillion - triple the $454.8 billion in 2008, for which the previous administration was highly criticized by Obama and his fellow Democrats. That congress would pass Obama's $3.53 trillion federal budget for fiscal 2010... That the projected deficit over the next ten years would be greater than $10 trillion. \n Would you have said, \"C'mon, that will never happen in America !\" \n \n 5. What if I had told you that the Obama Justice Department would order FBI agents to read Miranda rights to high-value detainees captured on the battlefield and held at US military detention facilities in Afghanistan . That Obama would order the closing of the Guantanamo detention facility with no plan for the disposition of the 200-plus individuals held there. That several of the suspected terrorists at Guantanamo would be sent to live in freedom in Bermuda at the expense of the US government. That our returning US veterans would be labeled terrorists and put on a watch list. \n Would you have said, \"C'mon, that will never happen in America !\" \n \n 6. What if I had told you that the federal government would seek powers to seize key companies whose failures could jeopardize the financial system. That a new regulatory agency would be proposed by Obama to control loans, credit cards, mortgage-backed securities, and other financial products offered to the public. \n Would you have said, \"C'mon, that will never happen in America !!\" \n \n 7. What if I had told you that Obama would travel to the Middle East, bow before the Saudi king, and repeatedly apologize for America 's past actions. That he would travel to Latin America where he would warmly greet Venezuela 's strongman Hugo Chavez and sit passively in the audience while Nicaraguan Marxist thug Daniel Ortega charged America with terrorist aggression in Central America .\n Would you have said, \"C'mon, that will never happen in America !!\" \n \n 8. Okay, now what if I were to tell you that Obama wants to dismantle conservative talk radio through the imposition of a new \"Fairness Doctrine.\" That he wants to curtail the First Amendment rights of those who may disagree with his policies via internet blogs, cable news networks, or advocacy ads. That most major network television and most newspapers will only sing his phrases like state-run media in communist countries? \n Would you say, \"C'mon, that will never happen in America !!!\" \n \n 9. What if I were to tell you that the Obama Justice Department is doing everything it can to limit your Second Amendment rights to keep and bear arms. That the federal government wants to reinstate the so-called assault weapons ban which would prohibit the sale of any type of firearm that doesn't require the shooter to pull the trigger every time a round is fired. That Obama's Attorney General wants to eliminate the sale of virtually all handguns and ammunition, which most citizens choose for self-defense. \n Would you say, \"C'mon, that will never happen in America !!!\" \n \n 10. What if I were to tell you that the Obama plan is to eliminate states rights guaranteed by the Tenth Amendment and give the federal government sweeping new powers over policies currently under the province of local and state governments and voted on by the people. That Obama plans to control the schools, energy production, the environment, health care, and the wealth of every US citizen.\n Would you say, \"C'mon, that will never happen in America !\" \n \n 11. What if I were to tell you that the president, the courts, and the federal government have ignored the US Constitution and have seized powers which the founders of our country fought to restrict. That our last presidential election may have been our last truly free election for some time to come. That our next presidential election may look similar to the one recently held in Iran .. (And maybe under review by ACORN.) \n I know, I know what you will say. \"That will never happen in America !\" \n \n If we don't do everything in our power to stop this madness in 2010... \n May God have mercy on our worthless souls. \n \n Not all as happened but enough to make you think though.:xcensored", 
   {
    "post_info": {
     "post_title": "A little of the beaten path...but"
    }
   }, 
   null, 
   null, 
   1253588940.0
  ], 
  [
   370940, 
   null, 
   "Symbiote", 
   "Stay home, voting just encourages them.", 
   {}, 
   370939, 
   null, 
   1253589720.0
  ], 
  [
   370963, 
   null, 
   "Mosheh Thezion", 
   "the most important thing to know about 2010...\n \n is that I am running for the U.S, senate in CA..\n \n and need your support.\n \n Mosheh Thezion's Campaign Committee for U.S. Senate (R) | MOSHEH THEZION'S CAMPAIGN COMMITTEE\n \n \n and that i will run in 2012... for the presidency.\n \n -Mosheh Thezion emoticon_xbouncer", 
   {}, 
   370940, 
   null, 
   1253601960.0
  ], 
  [
   370966, 
   null, 
   "Ethmi", 
   "Actually I say go out and vote. I'd be willing to bet that if every person who didn't vote instead went out and voted for the republican side, we'd be saying \"President McCain\" right now.", 
   {}, 
   370963, 
   null, 
   1253607420.0
  ], 
  [
   370973, 
   null, 
   "Symbiote", 
   "Obviously. The fact you would desire such a thing disturbs me.", 
   {}, 
   370966, 
   null, 
   1253623920.0
  ], 
  [
   370975, 
   null, 
   "Doc Jones", 
   "Stay home, voting just encourages them.\n\n \n Don't you aussies get fined for NOT voting or is that just some other aussies lying to me?", 
   {}, 
   370940, 
   null, 
   1253626200.0
  ], 
  [
   370982, 
   null, 
   "zsu2357", 
   "the most important thing to know about 2010...\n \n is that I am running for the U.S, senate in CA..\n \n and need your support.\n \n Mosheh Thezion's Campaign Committee for U.S. Senate (R) | MOSHEH THEZION'S CAMPAIGN COMMITTEE\n \n \n and that i will run in 2012... for the presidency.\n \n -Mosheh Thezion emoticon_xbouncer\n\n \n \n P.O.T.U.S: got my vote fer sure.emoticon_xgood", 
   {}, 
   370963, 
   null, 
   1253630220.0
  ], 
  [
   370984, 
   null, 
   "OldSarge", 
   "Obviously. The fact you would desire such a thing disturbs me.\n\n \n Just where did the word desire appear? Read the black part only.", 
   {}, 
   370973, 
   null, 
   1253630400.0
  ], 
  [
   371013, 
   null, 
   "sinjin", 
   "Email: \"What if...MOST has already happened!!!\" | Media Matters Action Network\n \n https://letters.salon.com/opinion/walsh/politics/2009/09/04/obama_back_to_school_speech/view/index19.html", 
   {}, 
   370984, 
   null, 
   1253640960.0
  ], 
  [
   371014, 
   null, 
   "OldSarge", 
   "Email: \"What if...MOST has already happened!!!\" | Media Matters Action Network\n\n \n Nice try but media matters is not a reliable cluster. Note I say cluster and not group. Then you need only examine the first two responses to see why.\n 1. What if I had told you in October 2008, before the last presidential election, that before Barack Obama's first 100 days in office, the federal government would be in control of both the mortgage and the banking industries? That 19 of America's largest banks would be forced to undergo stress tests by the federal government which would determine if they were insufficiently capitalized, so they must be supervised by the government? \n Would you have said, \"C'mon, that will never happen in America.\"\n \n I get all the bailouts with the banks and the auto industry confused. I know I didn't really like the way President Bush did the bailout last year. I searched for the stress test thing, and it seems like they're just trying to make sure more banks don't fail the way Lehman Brothers did during the campaign. I definitely wouldn't want my bank to fail. \n \n Which has zilch to do with #1 but MM would have you think so. \n \n 2. What if I had told you that within Barack Obama's first 100 days in office the federal government would be the largest shareholder in the US Big-Three automakers: GM, and Chrysler? That the government would kick out the CEO's of these companies and appoint hand-picked executives with zero experience in the auto industry and that executive compensation would be determined, not by a Board of Directors, but by the government?\n \n Would you have said, \"C'mon, that will never happen in America!\"\n \n Also, the government only got involved in the car companies because they didn't have enough money to stay open. Obama could have just let them fail, but then we would have lost hundreds of thousands more American jobs. In the middle of a recession, who would want that?\n \n Again MM would have you think this refutes or negates the takeover and firing. I guess MM never heard of chapter 11 or other bankruptcy protections. Instead here the good O regime merely fired a couple evil rich guys and gave the autonmakers to the unions. Mean while robbing the shareholders blind. \n \n On a final note, to those in the military cluster is half a word!\n ", 
   {}, 
   371013, 
   null, 
   1253641740.0
  ], 
  [
   371015, 
   null, 
   "OldSarge", 
   "\"making history...with a gun\n Last november, america elected her first black president. Those who voted for obama helped make history (I was one of them and I'd do it again).\n \n Those who voted against him are consumed by the idea that we now have a N----r\" in the White House. I know 2nd amendment folks who wish he'd been shot during the campaign.\n \n These \"patriots\" are still praying that some good old boy with a gun goes to washington and \"does the right thing.\" This is what happens when you put the power of god in the hands of a goober.\"\n \n A real left wing fever swamp like unto DU.", 
   {
    "post_info": {
     "post_title": "Salon.com"
    }
   }, 
   371014, 
   null, 
   1253641920.0
  ], 
  [
   371017, 
   null, 
   "OldSarge", 
   "\"7. What if I had told you that Obama would travel to the Middle East, bow before the Saudi king, and repeatedly apologize for America 's past actions.\"\n \n Answer: I would tell you to read fact-checked newspaper articles instead of NewsMax.\n \n So the big O never bowed, merely ducked his head or some other nonsense. The apology tour never happened. It was all a figment of our imaginations. Get a grip on reality.", 
   {
    "post_info": {
     "post_title": "more on the fever swamps"
    }
   }, 
   371015, 
   null, 
   1253642460.0
  ], 
  [
   371026, 
   null, 
   "Doc Jones", 
   "was to take a heck of a bunch of Obama stickers off the road emoticon_ic while putting their owners in debt at a very bad time right before the depression :)\n \n No one is buying cars now and the showrooms are devoid of customers so the jobs will be lost anyhow, a lot of dealers never got paid and probably never will. It did put a lot of money in the hands of unions in the way of control and money in the hands of Acorn for handling the contracts to process claims.\n \n If this is called a success, what would a 'cluster' er, total failure be called?\n \n It doesn't appear anyone is keeping track of the bank failures each Friday when they are announced and now even some that are supposed to be announced Friday are getting announced on Saturday. By the time you add up all the bank failures, and they have a lot of branches, our financial system is being turned into a soup bowl of Marksism.\n \n If cap and trade passes you will see a drastic rise in unemployment and taxes. I hate to contemplate what takeover of the health care system will be!", 
   {
    "post_info": {
     "post_title": "The only thing the &quot;cash for clunkers&quot; did"
    }
   }, 
   371017, 
   null, 
   1253645580.0
  ], 
  [
   371027, 
   null, 
   "JPSartre12", 
   "the most important thing to know about 2010...\n \n is that I am running for the U.S, senate in CA..\n \n and need your support.\n \n Mosheh Thezion's Campaign Committee for U.S. Senate (R) | MOSHEH THEZION'S CAMPAIGN COMMITTEE\n \n \n and that i will run in 2012... for the presidency.\n \n -Mosheh Thezion emoticon_xbouncer\n\n \n Don't you think that using a handle like \"Mosheh The Zion\" will hurt your chances of being taken seriously?", 
   {}, 
   370963, 
   null, 
   1253645640.0
  ], 
  [
   371069, 
   null, 
   "Nozza1", 
   "Don't you aussies get fined for NOT voting or is that just some other aussies lying to me?\n\n \n Yep we do get hit with quite large fines for not voting, how much of a democracy is that hey!! lol", 
   {}, 
   370975, 
   null, 
   1253664300.0
  ], 
  [
   371070, 
   null, 
   "sinjin", 
   "Yep we do get hit with quite large fines for not voting, how much of a democracy is that hey!! lol\nTalkin' out your XXX again I see. \n \n What happens if I do not vote?\n \n Initially the Australian Electoral Commission will write to all apparent non-voters requesting that \n they either provide a reason for their failure to vote or pay a $20 penalty.\n \n If, within 21 days, the apparent non-voter fails to reply, cannot provide a valid and sufficient reason or declines to pay the penalty, then prosecution proceedings may be instigated. If the matter is dealt with in court and the person is found guilty, he or she may be fined up to $50 plus court costs.\n http://www.aec.gov.au/faqs/voting_australia.htm#What%20happens%20if%20I%20do%20not%20vote", 
   {}, 
   371069, 
   null, 
   1253664600.0
  ], 
  [
   371071, 
   null, 
   "NATO 556", 
   "Talkin' out your XXX again I see.\n\n \n You'd be singing a different tune if the same practice was applied to matters like gun ownership, and you facing several hundred dollars worth of fines and court costs for choosing to not exercise your rights.\n \n Voting is a right, you can't be compelled to practice a right at the command of the government. So in Australia voting isn't a right of the people, it's an obligation of the subjects, and a crime to not do your obligation.", 
   {}, 
   371070, 
   null, 
   1253665140.0
  ], 
  [
   371077, 
   null, 
   "sinjin", 
   "You'd be singing a different tune if the same practice was applied to matters like gun ownership, and you facing several hundred dollars worth of fines and court costs for choosing to not exercise your rights.\nWhy several hundred dollars? Inflation? And as you said, it's a right in the USA. Can't be compelled to exercise a right.\n \n \nSo in Australia voting isn't a right of the people, it's an obligation of the subjects, and a crime to not do your obligation.\nNow it's a butt duet.\n \n Today\n \n Australia is a federal, representative parliamentary democracy where citizens have the power to elect their representatives in parliament. \n Enrolling and voting is a right and a responsibility of each Australian citizen.\n \n The effectiveness of our democracy depends on the active participation of all Australian citizens.\n \n Australian voting history in action", 
   {}, 
   371071, 
   null, 
   1253665740.0
  ], 
  [
   371081, 
   null, 
   "Nozza1", 
   "Talkin' out your XXX again I see. \n \n What happens if I do not vote?\n \n Initially the Australian Electoral Commission will write to all apparent non-voters requesting that \n they either provide a reason for their failure to vote or pay a $20 penalty.\n \n If, within 21 days, the apparent non-voter fails to reply, cannot provide a valid and sufficient reason or declines to pay the penalty, then prosecution proceedings may be instigated. If the matter is dealt with in court and the person is found guilty, he or she may be fined up to $50 plus court costs.\n Voting Australia\n\n \n \n So you get fined for not voting, i said you get fined for not voting yet i am talking out the back of my arse. How did you figure that? I provided accurate information and get abused by a gun hater, i can live with that as gun haters are well known for hating facts\n \n NATO I could not agree with you more!", 
   {}, 
   371070, 
   null, 
   1253665920.0
  ], 
  [
   371083, 
   null, 
   "Nozza1", 
   "Why several hundred dollars? Inflation? And as you said, it's a right in the USA. Can't be compelled to exercise a right.\n \n MY WORDS:\n \n Yet over here in Australia we get fined if we do not exercise our right. So i am pretty sure Nato argurement stands. IF we can get fined for not exercising a right then logic states that you can be done for not exercising one of your rights\n \n \n Now it's a butt duet. \n \n MY WORDS:\n \n I am pretty sure you would be the only one playing another mans butt\n \n \n \n Today\n \n Australia is a federal, representative parliamentary democracy where citizens have the power to elect their representatives in parliament. \n Enrolling and voting is a right and a responsibility of each Australian citizen.\n \n The effectiveness of our democracy depends on the active participation of all Australian citizens.\n \n So what you are basically saying is I deserved to get fined for not exercising my rights? Yet over there in America you would be outraged if you were fined for not exercising your rights? What is that i smell? Some hypocricy?\n \n Australian voting history in action\n\n \n YOu cannot have it both ways mate. I said you get fined for not exericing one of your rights yet you say you cannot be fined for exercising one of YOUR rights. I see no reason why that cannot happen.", 
   {}, 
   371077, 
   null, 
   1253666220.0
  ], 
  [
   371090, 
   null, 
   "NATO 556", 
   "Why several hundred dollars? Inflation?\n\n \n Never read a court case before, have you?\n \n \nAnd as you said, it's a right in the USA. Can't be compelled to exercise a right.\n\n \n It's a right here, but not in Australia.\n \n \nAustralia is a federal, representative parliamentary democracy where citizens have the power to elect their representatives in parliament. \n Enrolling and voting is a right and a responsibility of each Australian citizen.\n\n \n Like you said, can't be compelled to exercise a right. So if you can be fined for not voting, that means it's not a right, but an obligation.", 
   {}, 
   371077, 
   null, 
   1253668920.0
  ], 
  [
   371106, 
   null, 
   "OldSarge", 
   "Never read a court case before, have you?\n \n \n \n It's a right here, but not in Australia.\n \n \n \n Like you said, can't be compelled to exercise a right. So if you can be fined for not voting, that means it's not a right, but an obligation.\n\n \n Ouch truth hurts! I wonder if the distinction will sink in?", 
   {}, 
   371090, 
   null, 
   1253676000.0
  ], 
  [
   371123, 
   null, 
   "zsu2357", 
   "Talkin' out your XXX again I see. \n \n What happens if I do not vote?\n \n Initially the Australian Electoral Commission will write to all apparent non-voters requesting that \n they either provide a reason for their failure to vote or pay a $20 penalty.\n \n If, within 21 days, the apparent non-voter fails to reply, cannot provide a valid and sufficient reason or declines to pay the penalty, then prosecution proceedings may be instigated. If the matter is dealt with in court and the person is found guilty, he or she may be fined up to $50 plus court costs.\n Voting Australia\n\n \n \n Still being fined because you don't vote?what a country to live in.Don't matter\n if its $20 or $2000 its the whole principle of being forced or else.\n What if theres know one running you want to vote for?you what say ennie\n minie minnie moe?or just don't and be punished for it?\n \n emoticon_confusedemoticon_mad", 
   {}, 
   371070, 
   null, 
   1253689560.0
  ], 
  [
   371144, 
   null, 
   "Mosheh Thezion", 
   "Don't you think that using a handle like \"Mosheh The Zion\" will hurt your chances of being taken seriously?\n\n \n its not a handle.. it is my name.\n \n I was born Fabio.. raised as Luis.. but live as Mosheh.\n \n it is not a handle I use online.. it is my name in life.\n \n And dont forget it.\n \n and its.. Thezion... not the zion.\n \n -Mosheh Thezion", 
   {}, 
   371027, 
   null, 
   1253696700.0
  ], 
  [
   371145, 
   null, 
   "Mosheh Thezion", 
   "P.O.T.U.S: got my vote fer sure.emoticon_xgood\n\n \n i appreciate hearing that much more than you can imagine.\n \n thank you.\n \n -Mosheh Thezion", 
   {}, 
   370982, 
   null, 
   1253696820.0
  ], 
  [
   371164, 
   null, 
   "Doc Jones", 
   "Ouch truth hurts! I wonder if the distinction will sink in?\n\n \n It should Sarge! First thanks to Nozza1 for the clarification and to Nato and Sarge for drawing the distinction of what a right really is. Now we know that sinjin understands what a civil right and responsibility is as in the 2A. This throttles any further attempt to diminish or 'tax' a right or to add senseless controls to make a right a priviledge. I admit it unrolled better than I thought without sinjin trying to boot it out with some comment like on one board where he questioned Nato \"what does this have to do with guns\". He fell right into his own vomit on this one :) and showed his best side...going away emoticon_xbye\n \n No need to reply sinjin, you already said enough to incriminate you forever emoticon_xbouncer", 
   {}, 
   371106, 
   null, 
   1253710500.0
  ], 
  [
   371168, 
   null, 
   "OldSarge", 
   "It should Sarge! First thanks to Nozza1 for the clarification and to Nato and Sarge for drawing the distinction of what a right really is. Now we know that sinjin understands what a civil right and responsibility is as in the 2A. This throttles any further attempt to diminish or 'tax' a right or to add senseless controls to make a right a priviledge. I admit it unrolled better than I thought without sinjin trying to boot it out with some comment like on one board where he questioned Nato \"what does this have to do with guns\". He fell right into his own vomit on this one :) and showed his best side...going away emoticon_xbye\n \n No need to reply sinjin, you already said enough to incriminate you forever emoticon_xbouncer\n\n \n It should also finally nail the coffin lid down on the license and registration scam too. emoticon_xagreeemoticon_xagreeemoticon_xagree", 
   {}, 
   371164, 
   null, 
   1253712660.0
  ], 
  [
   371201, 
   null, 
   "sinjin", 
   "So you get fined for not voting, i said you get fined for not voting yet i am talking out the back of my arse. How did you figure that?\n\n \n \nYep we do get hit with quite large fines for not voting...\nTwenty bucks? That's how I figure.", 
   {}, 
   371081, 
   null, 
   1253733060.0
  ], 
  [
   371202, 
   null, 
   "sinjin", 
   "Never read a court case before, have you?\nNot one setting the fine for not owning guns.\n \n \nIt's a right here, but not in Australia.\nYou're lying.\n \n \nLike you said, can't be compelled to exercise a right.\nNot in the USA.\n \n \nSo if you can be fined for not voting, that means it's not a right, but an obligation.\nIt means in Australia it's a right and a legal responsibility backed up by law.", 
   {}, 
   371090, 
   null, 
   1253733300.0
  ], 
  [
   371203, 
   null, 
   "sinjin", 
   "Still being fined because you don't vote?what a country to live in.Don't matter\n if its $20 or $2000 its the whole principle of being forced or else.\n What if theres know one running you want to vote for?you what say ennie\n minie minnie moe?or just don't and be punished for it?\n \n emoticon_confusedemoticon_mad\nA country that requires your participation in the process sounds fine by me.", 
   {}, 
   371123, 
   null, 
   1253733420.0
  ], 
  [
   371204, 
   null, 
   "sinjin", 
   "It should Sarge! First thanks to Nozza1 for the clarification and to Nato and Sarge for drawing the distinction of what a right really is. Now we know that sinjin understands what a civil right and responsibility is as in the 2A. This throttles any further attempt to diminish or 'tax' a right or to add senseless controls to make a right a priviledge. I admit it unrolled better than I thought without sinjin trying to boot it out with some comment like on one board where he questioned Nato \"what does this have to do with guns\". He fell right into his own vomit on this one :) and showed his best side...going away emoticon_xbye\nHaven't you advocated compulsory exercise of 2A rights? \n \n \nNo need to reply sinjin, you already said enough to incriminate you forever emoticon_xbouncer \nHow will I live with myself Durward?", 
   {}, 
   371164, 
   null, 
   1253733600.0
  ], 
  [
   371205, 
   null, 
   "NATO 556", 
   "Not one setting the fine for not owning guns.\n\n \n Doesn't matter. It could be a matter of being compelled to own guns, or compelled to invoke your Fifth Amendment rights. What does matter is that I highly doubt you'd sit so idly by if you suddenly found yourself facing charges and fines for deciding that you weren't in the mood to exercise your constitutional rights.\n \n \nYou're lying.\n\n \n You're calling me the liar here? How exactly am I lying by pointing out that facing legal penalties for not exercising a right, means that it's no right at all?\n \n \nNot in the USA.\n\n \n Not anywhere. If you can be compelled to do something by the government threatening to punish you then it's no right, it's an obligation that you owe those in office.\n \n \nIt means in Australia it's a right and a legal responsibility backed up by law.\n\n \n You really have no understanding of the concept of a \"right\" do you? Otherwise you wouldn't be making these blatantly ignorant statements.", 
   {}, 
   371202, 
   null, 
   1253733660.0
  ], 
  [
   371206, 
   null, 
   "sinjin", 
   "Doesn't matter. It could be a matter of being compelled to own guns, or compelled to invoke your Fifth Amendment rights. \nBut this is what you said and to which I was responding. \n \n \nYou'd be singing a different tune if the same practice was applied to matters like gun ownership, and you facing several hundred dollars worth of fines and court costs for choosing to not exercise your rights.\nNow of course it doesn't matter since there is no such case I could have read.\n \n \nI highly doubt you'd sit so idly by if you suddenly found yourself facing charges and fines for deciding that you weren't in the mood to exercise your constitutional rights.\nThat ain't likely to happen in the USA.\n \n \nYou're calling me the liar here? How exactly am I lying by pointing out that facing legal penalties for not exercising a right, means that it's no right at all?\nMeans to whom? You? Apparently Australians, other than our resident Crocodile Dumbdee, disagree with your assessment of their rights. It doesn't cease to be a right because you don't agree with regulation associated with its exercise. Sound familiar? Just as the Japanese Constitution doesn't cease to be a constitution because you don't care for some features. \n \n \nNot anywhere. If you can be compelled to do something by the government threatening to punish you then it's no right, it's an obligation that you owe those in office.\nLarge peaceful assemblies require permits. Do you still have a right to assemble?\n \n \nYou really have no understanding of the concept of a \"right\" do you? Otherwise you wouldn't be making these blatantly ignorant statements. \nSticks and stones, boy.", 
   {}, 
   371205, 
   null, 
   1253734260.0
  ], 
  [
   371218, 
   null, 
   "NATO 556", 
   "Check Kennesaw, Georgia. Mandatory gun ownership in that little town.", 
   {}, 
   371206, 
   null, 
   1253738280.0
  ], 
  [
   371219, 
   null, 
   "Doc Jones", 
   "But this is what you said and to which I was responding. \n \n Now of course it doesn't matter since there is no such case I could have read.\n\n \n Takeing the 5th huh? You sure are a hypocrite to pick and choose rights while condemning others who use them all.\n \n \nThat ain't likely to happen in the USA.\n\n \n You missed the draft huh? I think you are plenty young boy to still get into the age group for service.\n \n \nMeans to whom? You? Apparently Australians, other than our resident Crocodile Dumbdee, disagree with your assessment of their rights. It doesn't cease to be a right because you don't agree with regulation associated with its exercise. Sound familiar? Just as the Japanese Constitution doesn't cease to be a constitution because you don't care for some features.\n\n \n Convoluted logic. There is no doubt what the Constitution says, it is plain as rat sign in the sugar bowl. Just because you don't care for some of it's rights you try to pick and choose which ones you like and eliminate those others enjoy. Hypocrit! \n \n \nLarge peaceful assemblies require permits.\n\n \n Only if they are going to restrict normal traffic. Public property is public property.\n \n \nDo you still have a right to assemble?\n\n \n You betcha! If you are in the service (military) you damn sure better too :)\n \n \nSticks and stones, boy.\n\n \n You pretty sure NATO is a lot younger than you? Bet ya some of us have children older than you kiddo. I would wager our aussie participant is mentally older than you? emoticon_xclownemoticon_xbye", 
   {}, 
   371206, 
   null, 
   1253738640.0
  ], 
  [
   371223, 
   null, 
   "Doc Jones", 
   "A country that requires your participation in the process sounds fine by me.\n\n \n Yeah? We used to have a poll tax here which amounts to about the same principle. Wonder why that ever went away? emoticon_smile", 
   {}, 
   371203, 
   null, 
   1253740020.0
  ], 
  [
   371224, 
   null, 
   "zsu2357", 
   "A country that requires your participation in the process sounds fine by me.\n\n \n Point is what if there isn't anyone worth voting for?you just go ahead anyhow?\n for better or worse.", 
   {}, 
   371203, 
   null, 
   1253740080.0
  ], 
  [
   371226, 
   null, 
   "OldSarge", 
   "\n Apparently Australians, other than our resident Crocodile Dumbdee, disagree with your assessment of their rights. \n Sticks and stones, boy.\n\n \n And here you were crying about names and insults. I thought you were supposed to be above all that?", 
   {}, 
   371206, 
   null, 
   1253740260.0
  ], 
  [
   371236, 
   null, 
   "sinjin", 
   "Check Kennesaw, Georgia. Mandatory gun ownership in that little town.\n\n \n ARTICLE I. IN GENERAL\n \n Sec. 34-1. Heads of households to maintain firearms.\n (a) In order to provide for the emergency management of the city, and further in order to provide for and protect the safety, security and general welfare of the city and its inhabitants, every head of household residing in the city limits is required to maintain a firearm, together with ammunition therefor.\n (b) Exempt from the effect of this section are those heads of households who suffer a physical or mental disability which would prohibit them from using such a firearm. Further exempt from the effect of this section are those heads of households who are paupers or who conscientiously oppose maintaining firearms as a result of beliefs or religious doctrine, or persons convicted of a felony.\n http://www.municode.com/resources/gateway.asp?sid=10&pid=12813", 
   {}, 
   371218, 
   null, 
   1253746440.0
  ], 
  [
   371239, 
   null, 
   "sinjin", 
   "Takeing the 5th huh? You sure are a hypocrite to pick and choose rights while condemning others who use them all.\nI don't condemn anyone for exercising their rights. \n \n \nYou missed the draft huh? I think you are plenty young boy to still get into the age group for service.\nI did miss it but I'm too old now to join up, again.\n \n \nConvoluted logic. There is no doubt what the Constitution says, it is plain as rat sign in the sugar bowl. Just because you don't care for some of it's rights you try to pick and choose which ones you like and eliminate those others enjoy. Hypocrit! \nExcept I'm not seeking to eliminate rights and don't support those that might. \n \n \nOnly if they are going to restrict normal traffic. Public property is public property.\nThat would be a yes then? Is your right to assemble infringed by needing to pull a permit? \n \n \nYou pretty sure NATO is a lot younger than you?\nI hope so.\n \n \nBet ya some of us have children older than you kiddo.\nBut not you. Oldsarge and I are the same age. He's about six months older. \n \n \nI would wager our aussie participant is mentally older than you?\nNow that just hurts Durward.", 
   {}, 
   371219, 
   null, 
   1253747340.0
  ], 
  [
   371240, 
   null, 
   "sinjin", 
   "Yeah? We used to have a poll tax here which amounts to about the same principle.\nPaying to vote isn't the same as a fine for not voting. Have someone mentally older than me explain it to you. \n \n \nWonder why that ever went away? \nIt prevented poor people from voting.", 
   {}, 
   371223, 
   null, 
   1253747520.0
  ], 
  [
   371241, 
   null, 
   "sinjin", 
   "Point is what if there isn't anyone worth voting for?you just go ahead anyhow?\n for better or worse.\nHow would anyone know if you actually checked any boxes?", 
   {}, 
   371224, 
   null, 
   1253747580.0
  ], 
  [
   371244, 
   null, 
   "sinjin", 
   "And here you were crying about names and insults. I thought you were supposed to be above all that?\nI said I try harder not to than you Dave, not that I can always resist the urge. Especially when it's really funny. Nozza1 was getting lippy with me but I guess he won't be any longer.", 
   {}, 
   371226, 
   null, 
   1253748480.0
  ], 
  [
   371247, 
   null, 
   "OldSarge", 
   "I said I try harder not to than you Dave, not that I can always resist the urge. Especially when it's really funny. Nozza1 was getting lippy with me but I guess he won't be any longer.\n\n \n Splain Dave there Slimjim.", 
   {}, 
   371244, 
   null, 
   1253749080.0
  ], 
  [
   371251, 
   null, 
   "sinjin", 
   "Splain Dave there Slimjim.\nAir Force retired after 22+ years? Born February 1960? Ain't that you?", 
   {}, 
   371247, 
   null, 
   1253751000.0
  ], 
  [
   371253, 
   null, 
   "OldSarge", 
   "Air Force retired after 22+ years? Born February 1960? Ain't that you?\n\n \n Not even close. Army retired after 30. Born Nov 1941. ", 
   {}, 
   371251, 
   null, 
   1253752200.0
  ], 
  [
   371271, 
   null, 
   "zsu2357", 
   "A country that requires your participation in the process sounds fine by me.\n\n \n Just another way to say or else, if you don't want this fine outstanding government to fine you.Besides how do they know if you vote or not?if your\n registered.Or for the sake of fines maybe its not such a secret ballot?ehh.\n \n And I bet you would have been first in line to go to the PARTY in pre ww2 germany.:xcensored", 
   {}, 
   371203, 
   null, 
   1253756700.0
  ], 
  [
   371272, 
   null, 
   "Nozza123", 
   "Twenty bucks? That's how I figure.\n\n \n We are getting FINED if we decide not to exercise our right!\n A one dollar fine is WAY TOO MUCH. Besides it is not the fine it is the pricipal that counts. \n \n So if you can be fined for not voting, that means it's not a right, but an obligation. \n \n It means in Australia it's a right and a legal responsibility backed up by law.\n \n What it means is you get fined by your own goverment unless you exercise your \"right\". As has been brilliantly said \"This is no longer, it is an obligation\"", 
   {}, 
   371201, 
   null, 
   1253757000.0
  ], 
  [
   371277, 
   null, 
   "sinjin", 
   "Not even close. Army retired after 30. Born Nov 1941. \nMy apologies. I must be confusing you with a younger \"OldSarge\" from your home state.emoticon_xclown\n \n Thank you for your service.emoticon_xhoho", 
   {}, 
   371253, 
   null, 
   1253758200.0
  ], 
  [
   371282, 
   null, 
   "JPSartre12", 
   "its not a handle.. it is my name.\n \n I was born Fabio.. raised as Luis.. but live as Mosheh.\n \n it is not a handle I use online.. it is my name in life.\n \n And dont forget it.\n \n and its.. Thezion... not the zion.\n \n -Mosheh Thezion\n\n \n My apologies. I meant no offense. It was a case of \"mistaken identity\". ;)", 
   {}, 
   371144, 
   null, 
   1253758680.0
  ], 
  [
   371300, 
   null, 
   "OldSarge", 
   "My apologies. I must be confusing you with a younger \"OldSarge\" from your home state.emoticon_xclown\n \n Thank you for your service.emoticon_xhoho\n\n \n Well since the steel industry died seems a lot of us elect to go for the military. If I had it to do over I'd go Air Force tho. Better billets, better food and definately better duty stations! Your very welcomeemoticon_xhoho", 
   {}, 
   371277, 
   null, 
   1253762880.0
  ], 
  [
   371339, 
   null, 
   "Nozza123", 
   "I would like to apoligise to anybody who may have been offended by my comment.\n \n To the admins who unbanned me I say a big thankyou and I am very happy I can continue to post on these wonderful forums.\n \n Back to what we are all here for, a friendly debateemoticon_xhoho\n \n On the issue of what do you do if you like neither side? Well you just vote for whoever, I literally mean just make it up. This can skew the results if every undecided voter puts down the same candidate.", 
   {}, 
   371300, 
   null, 
   1253774100.0
  ], 
  [
   371340, 
   null, 
   "Nozza123", 
   "I said I try harder not to than you Dave, not that I can always resist the urge. Especially when it's really funny. Nozza1 was getting lippy with me but I guess he won't be any longer.\n\n \n \n I hope you can accept my apoligy to you Sinjin and will not do it again. I oversteped the mark and I apoligise for doing so. We may not agree on many things but I went too far. Sorry mate \n \n I hope you can emoticon_xhoho? (Obvioulsy not for real as I am not legally old enough)", 
   {}, 
   371244, 
   null, 
   1253774280.0
  ], 
  [
   371345, 
   null, 
   "Mosheh Thezion", 
   "My apologies. I meant no offense. It was a case of \"mistaken identity\". ;)\n\n \n no need..\n \n I expect intelegent people to say exactly what you said.\n \n And if you google... Mosheh Thezion, you will find me.. and only me.. there is only one... and I have used this name since I was 16.\n \n When I discovered that I have mutliple legal identities..\n \n Not personalities... mind you. but legally.. I am Fabio, and I am Luis... and so, I became Mosheh to offset and solve for my problem of identity, and that is a long story.\n \n anyway, I explain it on my campaign website.\n \n I expect to be challeneged with this.. over and over and over again.\n \n You, are just the first to state the clear fact that this will confuse things.\n \n -Mosheh Thezion :xbanghead", 
   {}, 
   371282, 
   null, 
   1253775240.0
  ], 
  [
   371346, 
   null, 
   "Mosheh Thezion", 
   "I would like to apoligise to anybody who may have been offended by my comment.\n \n To the admins who unbanned me I say a big thankyou and I am very happy I can continue to post on these wonderful forums.\n \n Back to what we are all here for, a friendly debateemoticon_xhoho\n \n On the issue of what do you do if you like neither side? Well you just vote for whoever, I literally mean just make it up. This can skew the results if every undecided voter puts down the same candidate.\n\n \n i hate to see this kind of statement.\n \n Nozza123... dont apologieze.. for speaking you mind.\n \n if you are afraid to offend.. you will never speak your mind.\n \n \n I have been banned more times than I can count.. seriously.. I've lost count...\n \n and I say... speak you mind.. and if you get banned.. so be it.\n \n dont let children who complain control you.\n dont let one website rule your world.\n dont let others limits your words.\n dont give in, dont give up, and do not back down.\n \n i may be banned at any time, and I fear not.\n \n I will not be silenced, and while maybe.. sometimes.. i go too far.. and get offensive... that is the price of freedom of speech.\n \n \n Dont think.. this forum is the whole world, because there are 1001 other forums to go to, if you get banned.\n \n I know.. ive been banned alot... ha.\n \n anyway... I dont like it when I see people back down, because they fear they may break some rule, or offend someone.\n \n so what?\n \n Some people need to be offended, because it makes them think.\n \n It is a sad world, if we cannot speak our free mind.\n \n -Mosheh Thezion", 
   {}, 
   371339, 
   null, 
   1253775840.0
  ], 
  [
   371352, 
   null, 
   "Ethmi", 
   "i hate to see this kind of statement.\n \n Nozza123... dont apologieze.. for speaking you mind.\n \n if you are afraid to offend.. you will never speak your mind.\n \n \n I have been banned more times than I can count.. seriously.. I've lost count...\n \n and I say... speak you mind.. and if you get banned.. so be it.\n \n dont let children who complain control you.\n dont let one website rule your world.\n dont let others limits your words.\n dont give in, dont give up, and do not back down.\n \n i may be banned at any time, and I fear not.\n \n I will not be silenced, and while maybe.. sometimes.. i go too far.. and get offensive... that is the price of freedom of speech.\n \n \n Dont think.. this forum is the whole world, because there are 1001 other forums to go to, if you get banned.\n \n I know.. ive been banned alot... ha.\n \n anyway... I dont like it when I see people back down, because they fear they may break some rule, or offend someone.\n \n so what?\n \n Some people need to be offended, because it makes them think.\n \n It is a sad world, if we cannot speak our free mind.\n \n -Mosheh Thezion\n\n \n There's a distinctive line between speaking your mind and being stupid. For example, if you go into a room full of Bloodz members and use racial slurs to refer to them, you're being stupid. Or if you say", 
   {}, 
   371346, 
   null, 
   1253784180.0
  ], 
  [
   371353, 
   null, 
   "Mosheh Thezion", 
   "There's a distinctive line between speaking your mind and being stupid. For example, if you go into a room full of Bloodz members and use racial slurs to refer to them, you're being stupid. Or if you say\n\n \n true.. but this is not a gangster den... its an anynomous forum based on open debate.\n \n if we cannot speak our free mind here, where can we?\n \n emoticon_xbouncer", 
   {}, 
   371352, 
   null, 
   1253785620.0
  ], 
  [
   371354, 
   null, 
   "Doc Jones", 
   "Paying to vote isn't the same as a fine for not voting. Have someone mentally older than me explain it to you. \n \n It prevented poor people from voting.\n\n \n Full context:\n , 04:12 PM \n sinjin \n Ill-tempered but colorful Join Date: Apr 2004\n Posts: 5,052 \n \n Quote:\n Originally Posted by Doc Jones \n Yeah? We used to have a poll tax here which amounts to about the same principle. \n \n Paying to vote isn't the same as a fine for not voting. Have someone mentally older than me explain it to you. \n \n \n Quote:\n Wonder why that ever went away? \n \n It prevented poor people from voting.\n __________________\n Here! I will explain it to you:\n \n CBC News - Toronto - Toronto police seize 400 guns in safety push\n \n \nToronto police have seized almost 400 firearms from registered owners in a six-month push aimed at reducing the number of guns on the city's streets.\n \n In March, officers began soliciting registered firearm owners across the city as part of what they call the Safe City Project. Many of those who had to surrender their firearms had either let their registrations lapse, or had stashed their guns improperly under beds or in closets.\n \n The Canadian Firearms Registry stipulates guns must be stored in a secure place.\n \n No charges were laid in the push, police said Tuesday.\n \n Targeting people who had registered their guns is a preventative measure, said Toronto Police Chief Bill Blair.\n \n \"Legal handgun owners are not dangerous individuals,\" Blair told reporters at a Tuesday news conference. \"But we know from experience that their firearms can become extremely dangerous when they get into the hands of criminals. And so we have undertaken a number of initiatives to reduce the availability of those handguns.\"\n \n Police estimate there are still 4,000 guns in Ontario that are being improperly stored.\n \n However, a critic says, the push to target registered gun owners is not getting at the root of the problem.\n \n \"The system doesn't work. It's broken. It doesn't target the right people,\" Greg Farrant, a spokesman for the Ontario Federation of Anglers and Hunters, told CBC News. People who are barred from owning weapons are the ones who should be registered and tracked, he said.\n \n There are about 2.3 million registered guns in Ontario.\n", 
   {}, 
   371240, 
   null, 
   1253789160.0
  ], 
  [
   371365, 
   null, 
   "OldSarge", 
   "In March, officers began soliciting registered firearm owners across the city as part of what they call the Safe City Project. Many of those who had to surrender their firearms had either let their registrations lapse, or had stashed their guns improperly under beds or in closets.\n \n The Canadian Firearms Registry stipulates guns must be stored in a secure place.\n \n No charges were laid in the push, police said Tuesday.\n \n Targeting people who had registered their guns is a preventative measure, said Toronto Police Chief Bill Blair.\n \n If that doesn't drop the temp of one's blood I don't know what will. No constitutional right up there but what is stop the police down here once they get similar laws in place? I just wonder how they solicited. Sounds all innocent and peacable doesn't it? Could be a simple phone call all the way to dynamic entry by SWAT teams. Before anyone gets their panties in a wad about it not happening here look back at New Orleans. \"Many of those who had ...\" Doesn't sound like a choice there does it? Who gets to define \"safe or secure\"? Makes the case for not registering look real good. If its not registered they can't come \"soliciting.\" And here I had the idea that was what ladies of the night did.", 
   {}, 
   371354, 
   null, 
   1253801400.0
  ], 
  [
   371370, 
   null, 
   "Doc Jones", 
   "In March, officers began soliciting registered firearm owners across the city as part of what they call the Safe City Project. Many of those who had to surrender their firearms had either let their registrations lapse, or had stashed their guns improperly under beds or in closets.\n \n The Canadian Firearms Registry stipulates guns must be stored in a secure place.\n \n No charges were laid in the push, police said Tuesday.\n \n Targeting people who had registered their guns is a preventative measure, said Toronto Police Chief Bill Blair.\n \n If that doesn't drop the temp of one's blood I don't know what will. No constitutional right up there but what is stop the police down here once they get similar laws in place? I just wonder how they solicited. Sounds all innocent and peacable doesn't it? Could be a simple phone call all the way to dynamic entry by SWAT teams. Before anyone gets their panties in a wad about it not happening here look back at New Orleans. \"Many of those who had ...\" Doesn't sound like a choice there does it? Who gets to define \"safe or secure\"? Makes the case for not registering look real good. If its not registered they can't come \"soliciting.\" And here I had the idea that was what ladies of the night did.\n\n \n Yeah, that is what a couple have been calling for on this board, \"reasonable restrictions\" and reporting. ...results in loss of rights and property too. I think here you could properly call it a bill of pains and punishment or a bill of attainder including prior restraint. The gun grabbers sure oppose my reasonable compromise which would do the same thing they want , identify gun owners. Anyone exercising their right wouldn't be on the books nor have signs on their house and cars so you could easily tell who were gun owners and could tax them extra for being a \"burden on society\" by not defending themselves and family. slimjim said it best, Paying to vote isn't the same as a fine for not voting. Just substitute another right where VOTE is. Using his logic, it will be all right to fine someone to not exercise the 2A. emoticon_xgood That boy needs some serious doctoring and I know one more than willing to help emoticon_xhoho", 
   {}, 
   371365, 
   null, 
   1253804220.0
  ], 
  [
   371386, 
   null, 
   "OldSarge", 
   "Paying to vote isn't the same as a fine for not voting. \n That is like saying getting hit in the testicles is different if you use a claw hammer as opposed to a ball peen one. The pain in the balls is the same. Just a different implement was used.", 
   {}, 
   371370, 
   null, 
   1253812680.0
  ], 
  [
   371396, 
   null, 
   "sinjin", 
   "Well since the steel industry died seems a lot of us elect to go for the military. If I had it to do over I'd go Air Force tho. Better billets, better food and definately better duty stations! Your very welcomeemoticon_xhoho\nI chose the Navy because I love being on water and you could expect to catch a tan with certain ratings.emoticon_smile", 
   {}, 
   371300, 
   null, 
   1253818860.0
  ], 
  [
   371398, 
   null, 
   "sinjin", 
   "Paying to vote isn't the same as a fine for not voting. \n That is like saying getting hit in the testicles is different if you use a claw hammer as opposed to a ball peen one. The pain in the balls is the same. Just a different implement was used.\nI disagree. One could deprive you of a chance to exercise a right. \n The other simply discourages you from being lazy and/or apathetic, a privilege you can pay for if you so choose.", 
   {}, 
   371386, 
   null, 
   1253819220.0
  ], 
  [
   371399, 
   null, 
   "sinjin", 
   "I hope you can accept my apoligy to you Sinjin and will not do it again. I oversteped the mark and I apoligise for doing so. We may not agree on many things but I went too far. Sorry mate \n \n I hope you can emoticon_xhoho? (Obvioulsy not for real as I am not legally old enough)\nI did not see what you posted but accept your apology just the same. Good on ya, mate!emoticon_xgood", 
   {}, 
   371340, 
   null, 
   1253819580.0
  ], 
  [
   371403, 
   null, 
   "NATO 556", 
   "I disagree. One could deprive you of a chance to exercise a right. \n The other simply discourages you from being lazy and/or apathetic, a privilege you can pay for if you so choose.\n\n \n Being fined for not exercising a \"right\" means that it's an obligation of the people, not a true right. A right is something that belongs to the people to be used against the government, not for the government to use against the people to make them comply with orders.", 
   {}, 
   371398, 
   null, 
   1253821560.0
  ], 
  [
   371406, 
   null, 
   "sinjin", 
   "Being fined for not exercising a \"right\" means that it's an obligation of the people, not a true right. A right is something that belongs to the people to be used against the government, not for the government to use against the people to make them comply with orders.\nRepeating your personally tailored definition of a \"right\" makes it no truer this time than last. One exercises their right to free speech only when one speaks out \"against the government\"? How about assembly? Only when plotting \"against the government\"? You have some silly notions.\n \n In effect you're arguing for rights without responsibility or duty. \n Sure you wanna do that?", 
   {}, 
   371403, 
   null, 
   1253822160.0
  ], 
  [
   371408, 
   null, 
   "NATO 556", 
   "In effect you're arguing for rights without responsibility or duty.\n\n \n No I'm arguing that when the government can punish you for not exercising your rights, then it's no right at all, rather it's an obligation that you owe the government.\n \n This whole standard you seem to be in support of, how it's in effect a crime to not enjoy the protections guaranteed to you by your nation's constitution because failure to do so in detrimental to government authority, is highly disturbing.\n \n Back to the hypothetical situation. If you could be slapped with fines of anywhere between several hundred and several thousand dollars, because you refused to own a gun, would you still see no problem with it? I don't care if there's no court standing for the situation, that's irrelevant to the issue at hand. How would you really feel about the standard of punishment for ignoring your own rights if the practice was applied to you?", 
   {}, 
   371406, 
   null, 
   1253822940.0
  ], 
  [
   371420, 
   null, 
   "Doc Jones", 
   "No I'm arguing that when the government can punish you for not exercising your rights, then it's no right at all, rather it's an obligation that you owe the government.\n \n This whole standard you seem to be in support of, how it's in effect a crime to not enjoy the protections guaranteed to you by your nation's constitution because failure to do so in detrimental to government authority, is highly disturbing.\n \n Back to the hypothetical situation. If you could be slapped with fines of anywhere between several hundred and several thousand dollars, because you refused to own a gun, would you still see no problem with it? I don't care if there's no court standing for the situation, that's irrelevant to the issue at hand. How would you really feel about the standard of punishment for ignoring your own rights if the practice was applied to you?\n\n \n His compass is broken and he is adrift in an ocean of hypocrisy. He got the connection all right and admitted as much already. He is trying to wiggle out of the face of fact because it demolishes his thesis.\n \n I personally like the idea of greatly reduced police protection and insist that folks tend to their own business, land, contracts and life. Adding some realistic cause and effect situations will correct that compass problem real quick. Far too long has nanny government grown to appease the lazy and rich and protect them. All branches of government have exceeded their lawful duties that limit the powers enumerated therein. Time for a reality check!", 
   {}, 
   371408, 
   null, 
   1253829060.0
  ], 
  [
   371421, 
   null, 
   "sinjin", 
   "No I'm arguing that when the government can punish you for not exercising your rights, then it's no right at all, rather it's an obligation that you owe the government.\nThird time and still only personal opinion.\n \n \nThis whole standard you seem to be in support of, how it's in effect a crime to not enjoy the protections guaranteed to you by your nation's constitution because failure to do so in detrimental to government authority, is highly disturbing.\nNear full paticipation in the election process is a worthy objective. The \"authority\" of the government isn't diminished by lack of voluntary participation as we have in the US. \n \n \nBack to the hypothetical situation. If you could be slapped with fines of anywhere between several hundred and several thousand dollars, because you refused to own a gun, would you still see no problem with it? I don't care if there's no court standing for the situation, that's irrelevant to the issue at hand. How would you really feel about the standard of punishment for ignoring your own rights if the practice was applied to you? \nLet's set aside the fact that you've mutiplied the fine from 15 to 150 times the fine in Australia for not voting. Of course you could have said a million dollar fine and most would have a problem with that.\n \n First, I have a few questions.\n \n I'd like to know on what grounds I would be fined? \n How is my choice to not own weapons a failure to participate in the Democratic process like not voting would be? \n How does my choice serve to reflect poorly on our leaders and their mandate? \n What if I were a serving member of the military or Nat'l Guard? \n What if I had religious or philosophical objections to possessing firearms? \n Would you violate one of my rights to compel me to exercise another?", 
   {}, 
   371408, 
   null, 
   1253829240.0
  ], 
  [
   371422, 
   null, 
   "JPSartre12", 
   "Third time and still only personal opinion.\n \n Near full paticipation in the election process is a worthy objective. The \"authority\" of the government isn't diminished by lack of voluntary participation as we have in the US. .....\n\n \n Forced participation in elections is counter-productive, IMO. If a person is so disinterested in his government that he won't vote unless coerced to do so, what does that tell you about the quality of the electorate? \n If I was forced to vote and was uninterested, I'd write in Donald Duck for president. emoticon_rolleyes", 
   {}, 
   371421, 
   null, 
   1253830380.0
  ], 
  [
   371425, 
   null, 
   "sinjin", 
   "Forced participation in elections is counter-productive, IMO. If a person is so disinterested in his government that he won't vote unless coerced to do so, what does that tell you about the quality of the electorate? \n If I was forced to vote and was uninterested, I'd write in Donald Duck for president. emoticon_rolleyes\nIf voting's mandatory you don't know who is coerced. What does it tell you when half the people don't vote? I'm not sure.\n As it happens you are not required to actually select candidates in Australian elections, only show up and drop a piece of paper in a box. \n What's on the paper no one knows.", 
   {}, 
   371422, 
   null, 
   1253831040.0
  ], 
  [
   371427, 
   null, 
   "JPSartre12", 
   "As it happens you are not required to actually select candidates in Australian elections, only show up and drop a piece of paper in a box. \n What's on the paper no one knows.\n\n \n That makes the law even that much more idiotic. :xbanghead", 
   {}, 
   371425, 
   null, 
   1253831160.0
  ], 
  [
   371428, 
   null, 
   "sinjin", 
   "His compass is broken and he is adrift in an ocean of hypocrisy. He got the connection all right and admitted as much already. He is trying to wiggle out of the face of fact because it demolishes his thesis.\nHaven't you advocated for compulsory exercise of 2A rights? You've certainly suggested that anyone who doesn't is nearly a traitor.\n \n \nAre you prepared to do your duty under the Laws of this Republic?\n\n \n A duty is an obligation; a responsibility. \n Is it not Doc? Is jury duty voluntary or compulsory?\n \n Let's skip the poetry. \n If there's any hypocrisy here it's you guys. \n Notice not one of you objected to the Kennesaw, GA law, making exercise of 2A rights compulsory,\n on the grounds that it changed a right into an obligation, thereby making it no \"right\" at all.", 
   {}, 
   371420, 
   null, 
   1253831460.0
  ], 
  [
   371429, 
   null, 
   "sinjin", 
   "That makes the law even that much more idiotic. :xbanghead\nThat would make sense since that provision is clearly an out for the idiotic.", 
   {}, 
   371427, 
   null, 
   1253831580.0
  ], 
  [
   371439, 
   null, 
   "Doc Jones", 
   "Haven't you advocated for compulsory exercise of 2A rights? You've certainly suggested that anyone who doesn't is nearly a traitor.\n\n \n It should be if you want to be involved in the Constitutional rights, you gotta exercise those responsibilities and quit demanding more government to protect you.\n \n the primary job of government is to protect private property, enforce contracts and ensure rule of law. - Walter Williams\n \n Are you doing your duty as defined by law in the militia? 10 USC 311\n \n \nA duty is an obligation; a responsibility. \n Is it not Doc? Is jury duty voluntary or compulsory?\n\n \n Compulsory! That is the final check on both the law and the act alleged. The importance of the jury as the final arbiter of the law and fact. It is time to restore the informed jury and pull these above the law judges down off the pedestal and restore our justice system...and our sovereignty guaranteed therein the Constitution.\n \n \nLet's skip the poetry.\n\n \n You can't dismiss the Constitution as poetry in this Republic. \n \n \nIf there's any hypocrisy here it's you guys. \n Notice not one of you objected to the Kennesaw, GA law making exercise of 2A rights compulsory.\n\n \n In Texas it is your duty and required by law. Read section 9 of the Texas Penal code more closely and quit jumping out of the frying pan like frog legs.\n You have no proof, just more blabber without fact nor source. When you look for responsibility, look in the mirror and point the finger at yourself and quit trying to diminish other's rights! We don't owe you nothing, tend to your own business and protect your family and yourself.", 
   {}, 
   371428, 
   null, 
   1253835000.0
  ], 
  [
   371440, 
   null, 
   "sinjin", 
   "So Doc, you support compulsory voting as in Australia? \n \n You reject the notion that a right one is compelled to exercise is no longer a right?\n \n \nAre you doing your duty as defined by law in the militia? 10 USC 311\nAren't we both too old for the militia?", 
   {}, 
   371439, 
   null, 
   1253835960.0
  ], 
  [
   371442, 
   null, 
   "NATO 556", 
   "Third time and still only personal opinion.\n\n \n And court cases are a matter of opinion as well. Only difference is I'm not in an appointed position. What's your point?\n \n \nNear full paticipation in the election process is a worthy objective. The \"authority\" of the government isn't diminished by lack of voluntary participation as we have in the US.\n\n \n And as other have said, there's no way to make people actually vote, only attend. So what good comes from forcing people to exercise their \"right\" under threat of judicial persecution, if you can't actually make them do it in full?\n \n \nLet's set aside the fact that you've mutiplied the fine from 15 to 150 times the fine in Australia for not voting.\n\n \n Irrelevant fact.\n \n \nI'd like to know on what grounds I would be fined?\n\n \n Failure to participate in a government mandated activity, in accordance with government passed law.\n \n \nHow is my choice to not own weapons a failure to participate in the Democratic process like not voting would be?\n\n \n It's the exercising of a right in a manner that you choose, which is at issue here.\n \n \nHow does my choice serve to reflect poorly on our leaders and their mandate?\n\n \n Did I say that it did?\n \n \nWhat if I were a serving member of the military or Nat'l Guard?\n\n \n What of it?\n \n \nWhat if I had religious or philosophical objections to possessing firearms?\n\n \n Are such objections being honored in Australia?\n \n \nWould you violate one of my rights to compel me to exercise another?\n\n \n The government seems to have no objection with requiring such as it is now.", 
   {}, 
   371421, 
   null, 
   1253839260.0
  ], 
  [
   371463, 
   null, 
   "Bryan", 
   "My 2 cents....\n \n It is an interesting thought to consider whether we can equate the right to vote in Oz with the RKBA in America. \n \n In America we tend to look at rights in two ways. Some rights we look on as freedoms to choose whether or not to do something (like speech, press, assembly, religion, RKBA, or the right to vote, for example). Other rights we look upon as freedoms which prevent the government from doing things to us (unreasonable search and seizure, forcing us to incriminate ourselves, quartering soldiers in our homes, or imposing cruel and unusual punishments, for example). \n \n The Australian voting issue appears to take a slightly different view. You have the right to vote, but as a condition of citizenship the government has chosen to impose an affirmative duty-an obligation, if you will-to exercise that right. \n \n The more interesting question is where does the power for the right originate? Is it, like the right of free speech in America, a right declared to be inherently held by the people which the government is required by the language of its charter to recognize and accept? Or is it a right which the government through its charter grants to its citizens? \n \n If it is the latter, then the right is \"owned\" by the government, and of course the government can make the grant of the right conditional on any terms it pleases-like an obligation to either exercise it or justify the failure to do so to the satisfaction of a government functionary. But if it is viewed as a right inherently held by the people which the government is required to recognize and protect, then it becomes a more difficult task to justify the government's desire to fine those who fail to exercise it. \n \n In any event, the Australian government apparently feels that the right is so important to its ability to function properly that it punishes you for refusing to fully play your part in the democratic process. You could even go so far as to call it a deadbeat citizen tax. Whether you approve of such measures is a matter of opinion. I for one do not. \n \n It is not analogous, however, to the RKBA and the potential duty of militia service. To equate the two requires a belief that the RKBA is limited to militia service, which is not the case. The RKBA is only tied to militia service in the minds of those who choose to read the 2nd. Amendment in conflict with itself-by using the militia preamble as a limit on the operable clause. After all, they co-exist in the same amendment, don't they-or so the argument goes. But here is why I believe the militia preamble was included in the 2nd. Amendment.... \n \n We first have to understand that the militia preamble is nothing more than a statement of a policy goal. The fear was that Congress would raise a standing army, which was universally believed to be a potential engine of despotism. The preferred policy, as expressed in the 2nd. Amendment, was to avoid standing armies wherever possible and instead rely on militias for security. One of the best statements of this policy goal can be seen here: \n \n \"It has been asserted by the most respectable writers upon government, that a well-regulated militia, composed of the yeomanry of the country, have ever been considered as the bulwark of a free people. Tyrants have never placed any confidence on a militia composed of freemen.\" John DeWitt, The Anti-Federalist Papers, p. 75 (M. Borden ed. 1965)\n \n This was the policy goal captured in the militia preamble. It is for this reason the amendment reads \"A well regulated militia being necessary to the security of a free State.\" That is, a state in which men live freely without fear of a domestic tyrant. \n \n Now here in my opinion is why this policy goal was included in the amendment-a natural offshoot of the broader individual RKBA was its ability to help the citizens preserve an effective militia. Remember that Congress not only had the power to raise a standing federal army-it was also granted the authority to arm and equip the militias. The fear was that Congress could effectively disarm the militias by not only refusing to exercise that power to arm them but by also claiming the states were forbidden to do so by the supremacy clause. If there were not an individual RKBA, then no alternative source of arms would exist, and in such an instance the states would be powerless to organize citizens to effectively resist a federal tyrant wielding a federal army. Patrick Henry in particular saw this as a problem:\n \n \"Is it necessary for your liberty, that you should abandon those great rights by the adoption of this system?. . . Will the abandonment of your most sacred rights tend to the security of your liberty?. . . .I am fearful I have lived long enough to become an old fashioned fellow: Perhaps an invincible attachment to the dearest rights of man, may, in these refined enlightened days, be deemed old fashioned: If so, I am contented to be so. . . . Guard with jealous attention the public liberty. Suspect everyone who approaches that jewel. Unfortunately, nothing will preserve it, but downright force: Whenever you give up that force, you are inevitably ruined. . . .\n \n My great objection to this Government is, that it does not leave us the means of defending our rights; or, of waging war against tyrants. . . .\n \n The Honorable Gentleman who presides, told us, that to prevent abuses in our Government, we will assemble in Convention, recall our delegated powers, and punish our servants for abusing the trust reposed in them. Oh, Sir, we should have fine times indeed, if to punish tyrants, it were only sufficient to assemble the people. Your arms wherewith you could defend yourselves, are gone. . . . Did you ever read of any revolution in any nation, brought about by the punishment of those in power, inflicted by those who had no power at all? You read of a riot act in a country [ England ] which is called one of the freest in the world, where a few neighbors cannot assemble without the risk of being shot by hired soldiery, the engines of despotism. We may see such an act in America . A standing army we shall have also, to execute the execrable commands of tyranny: And how are you to punish them? Will you order them to be punished? Who shall obey these orders? Will your Mace-bearer be a match for a disciplined regiment? In what situation are we to be? . . . .What resistance could be made? The attempt would be madness.\" Patrick Henry, Speeches of June 5 and 7, 1788, before the Virginia Ratifying Convention, reprinted in The Anti-Federalist Papers and the Constitutional Convention Debates, pages 199-216, Mentor Books, 1986, edited by Ralph Ketchum.\n \n The answer to Henry's complaint was simple. Either draft an Amendment which specifically granted the states the power to concurrently arm their militias free from congressional interference, or recognize an individual RKBA which the federal government could not deny. America clearly chose the latter course of recognizing a broader, separate individual right which-as a benefit of its existence-could in turn provide the alternative source for arming a militia should the need arise. See, for example, the recognition of this in U.S. v. Miller: \"that ordinarily when called for service these men were expected to appear bearing arms supplied by themselves and of a kind in common use at the time.\"\n \n See also how Tench Coxe described the Amendment: \n \n \"As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms.\" Tench Coxe, discussing the purpose of the Second Amendment in his \"Remarks on the First Part of the Amendments to the Federal Constitution,\" published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1.\n \n Do you see how the broader individual right exists independently of a smaller duty to provide militia service if called upon-and is linked only coincidentally because its existence helps provide a ready source of armed men in an emergency? No where do you see even the slightest imposition of a suggestion that the right is limited by the militia preamble. In Oz, for example, it appears that having a duty to vote is a prerequisite to having the right to vote. But in America performing a militia duty has never been deemed a prerequisite of exercising the RKBA. This is why no SCOTUS decision has ever held that one must actually be performing the duty of militia service before he can mount a claim of infringement of his right-because the right is not limited by the smaller duty it could help the citizen perform. \n \n So I guess I don't see how we can fairly equate voting in Oz with the RKBA in America without turning the amendment on its head and reading it in conflict with itself. And to me it appears beyond the common sense of mankind for someone to believe that this militia policy preamble was intended to restrict the RKBA to it as a sole justification for existence (and as a defined boundary of the right)-particularly when they offer not the slightest evidence in support of this claim other than the strength of their desire to have the tail wag the dog. \n \n ---\n \n \"The power of the sword, say the minority of Pennsylvania, is in the hands of Congress. My friends and countrymen, it is not so, for the powers of the sword are in the hands of the yeomanry of America from sixteen to sixty. The militia of these free commonwealths, entitled and accustomed to their arms, when compared with any possible army, must be tremendous and irresistible. Who are the militia? Are they not ourselves? Is it feared, then, that we shall turn our arms each man against his own bosom? Congress shall have no power to disarm the militia. Their swords and every other terrible implement of the soldier, are the birth-right of an American ....[T]he unlimited power of the sword is not in the hands of either the federal or the state governments, but where I trust in God it will ever remain, in the hands of the People.\" Tench Coxe , Pennsylvania Gazette, Feb. 20, 1788.\n \n \"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe . The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States . A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.\" Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).", 
   {
    "post_info": {
     "post_title": "Oz voting and America's militias"
    }, 
    "unicode_changes_made": true
   }, 
   371442, 
   null, 
   1253865300.0
  ], 
  [
   371469, 
   null, 
   "Doc Jones", 
   "So Doc, you support compulsory voting as in Australia?\n\n \n Can't you read? \n \n \nYou reject the notion that a right one is compelled to exercise is no longer a right?\n\n \n I reject the notion that it is unConstitutional for any branch of government in the U.S. to infringe on the BOR. Government should be silent on the exercise of rights. You talk about voting forgetting the black codes and negating votes through such literacy tests and poll taxes. Look at it this way, the people are sovereign and government servants. We have the right to elect them and the right to recall them through a vote or through our State Legislators considering the 17th Amendment is an acronym of the IX and X Amendments. Notice how Bryan phrases the concept of the founding fathers' meaning of withdrawing our \"ambassadors\". Don't tell me D.C. is not a foreign country in comparison to the States. If you doubt this, buy a DRMO vehicle and find out what is necessary to get registration and tags on that vehicle :) You do understand that there is a difference in United States citizen and united States Citizen? Apparently not :xbanghead\n \n \nAren't we both too old for the militia?\n\n \n Too old to fight tyranny? Hardly. Judging from your wags on the board I am about two decades older than you. Remembering your service days, how many men does it take to keep even one soldier in the battle field?\n Regardless, Bryan makes history come alive as to the true meaning of the Militia and the Second Amendment. The 2A is not a condition for possession and use of arms! The quotes of the FF makes this perfectly clear. You enjoy beating a dead horse? emoticon_xangel\n \n You mistake my point that your refusal? to not own and keep and bear arms even in defense of yourself or family is disgusting to me. This is the part that you contend that is so unwarranted and you want to tax or fine a right away by allowing more infringements through what you want to call \"reasonable\" and that is a direct affront to the right itself and noxious to the intent of the BOR and the Second Amendment...and me/us?\n \n Everything you have thrown up got busted like a clay pidgeon with a direct hit of #9's yet you persist trying to wiggle around in your quest to get your way while claiming to be a 2A supporter. That is akin to a fighter in the ring wearing Haynes boxer briefs instead of the proper protective gear.", 
   {}, 
   371440, 
   null, 
   1253886780.0
  ], 
  [
   371470, 
   null, 
   "Doc Jones", 
   "The 2A is not a condition for possession and use of arms! \n \n Being in the Militia is not a condition for possession and use of arms!", 
   {
    "post_info": {
     "post_title": "Correction for clarity:"
    }
   }, 
   371469, 
   null, 
   1253887080.0
  ], 
  [
   371471, 
   null, 
   "JPSartre12", 
   "That would make sense since that provision is clearly an out for the idiotic.\n\n \n So they can force you to drive to the polling location, wait an hour in line just to have you throw a blank piece of paper in the ballotbox. That's about as idiotic as it gets.\n \n \nIt should be if you want to be involved in the Constitutional rights, you gotta exercise those responsibilities and quit demanding more government to protect you.\n \n the primary job of government is to protect private property, enforce contracts and ensure rule of law. - Walter Williams\n ......\n\n \n emoticon_xagreeemoticon_xagree Gotta love Dr Williams. I wish he was the first black president.", 
   {}, 
   371470, 
   null, 
   1253887680.0
  ], 
  [
   371489, 
   null, 
   "NATO 556", 
   "Let's shift the argument to something that might make a little more sense. If we're doing a compare and contrast of the rights of two countries, and the way the government treats them, let's do something a little closer linked.\n \n Australia requires you to vote, no matter what, and fines you if you fail to do so. It's your right to vote, but you're punished like a criminal if you don't exercise that right.\n \n Let's say that to stimulate the economy, America implemented a program to compel people to exercise their First Amendment rights, by requiring them to attend the opening of all new movies for a given year, which would mean you'd have to stand in line, buy tickets for admission, buy snacks, and sit through the movie even if you absolutely hate it.\n \n Now, you've got a First Amendment right to assemble, for any lawful reason, meaning the government couldn't stop you from attending a movie showing. But if you're required to attend the movie, and you're gonna face heavy fines, court costs, and even jail time if you fail to attend, is it still you're right to assemble? Or is it a government mandate to spend your hard earned money and waste time that you might not have?", 
   {}, 
   371471, 
   null, 
   1253900520.0
  ], 
  [
   371499, 
   null, 
   "zsu2357", 
   "true.. but this is not a gangster den... its an anynomous forum based on open debate.\n \n if we cannot speak our free mind here, where can we?\n \n emoticon_xbouncer\n\n \n Well if you follow 1-11, and it all DIDcome to pass, wouldn't be here, not in this country because there would no longer be a 1st amendment.See # 8)", 
   {}, 
   371353, 
   null, 
   1253906160.0
  ], 
  [
   371501, 
   null, 
   "zsu2357", 
   "I disagree. One could deprive you of a chance to exercise a right. \n The other simply discourages you from being lazy and/or apathetic, a privilege you can pay for if you so choose.\n\n \n A privilege you could pay for?in this country anyhow do you realize how many people would not vote?a whole lot more than don't bother to now given choice's.\n \n And no I have no stats. thats just being around people and listening.No reason to think Australia\n is different, except being fined? ", 
   {}, 
   371398, 
   null, 
   1253907120.0
  ], 
  [
   371502, 
   null, 
   "Doc Jones", 
   "[/B]\n \n A privilege you could pay for?in this country anyhow do you realize how many people would not vote?a whole lot more than don't bother to now given choice's.\n \n And no I have no stats. thats just being around people and listening.No reason to think Australia\n is different, except being fined? \n\n \n \n The FF in their infinite wisdom passed by the States, a BOR warning that an entrenched gov't might assume that those were something the gov't could fiddle with and wrote the Preamble to the BOR to give it the proper context and meaning. We don't need excuses to exercise our rights! The 3 branches of government have all the powers and duties listed (enumerated) that they can perform. There is no power listed to infringe on any rights much less those in the BOR.\n \n I think I have made it clear that the Juries are the final arbiter in all laws whether or not they are Constitutional...not the Supreme Court(s), Federal nor States. Those juries judge both the fact and the law and the sovereign citizens are supreme arbiters of justice.\n \n I have posted that Preamble several times and it needs reading. Any post in conflict with that Preamble is blantantly unConstitutional. Any 'bill' passed outside of those enumerated powers are unConstitutional. Any claims made that are in conflict are unConstitutional. Government is a servant as the quote by Dr. Williams stated. Any pretense that conflicts with either Preamble or Oath or enumerated powers are unConstitutional.\n \n No matter how hard you stomp your feet and yowl will never change those facts! emoticon_xgood", 
   {}, 
   371501, 
   null, 
   1253908380.0
  ], 
  [
   371783, 
   null, 
   "sinjin", 
   "Australia requires you to vote, no matter what, and fines you if you fail to do so. It's your right to vote, but you're punished like a criminal if you don't exercise that right.\nAt least you stopped denying it's a right.\n \n \nLet's say that to stimulate the economy, America implemented a program to compel people to exercise their First Amendment rights, by requiring them to attend the opening of all new movies for a given year, which would mean you'd have to stand in line, buy tickets for admission, buy snacks, and sit through the movie even if you absolutely hate it.\n \n Now, you've got a First Amendment right to assemble, for any lawful reason, meaning the government couldn't stop you from attending a movie showing. But if you're required to attend the movie, and you're gonna face heavy fines, court costs, and even jail time if you fail to attend, is it still you're right to assemble? Or is it a government mandate to spend your hard earned money and waste time that you might not have?\nThis makes no sense as the 1A is about your right to speak, not about anyone being compelled to listen(or watch) as in your scenario.", 
   {}, 
   371489, 
   null, 
   1254157740.0
  ], 
  [
   371785, 
   null, 
   "sinjin", 
   "Are you doing your duty as defined by law in the militia? 10 USC 311\n\n \n \nAren't we both too old for the militia?\n\n \n \nToo old to fight tyranny? Hardly.\n\n \n 311. Militia: composition and classes\n \n (a) The militia of the United States consists of all able-bodied males at least 17 years of age and, except as provided in section 313 of title 32, \n under 45 years of age who are, or who have made a declaration of intention to become, citizens of the United States and of female citizens of \n the United States who are members of the National Guard. \n \n (b) The classes of the militia are&#8212; \n (1) the organized militia, which consists of the National Guard and the Naval Militia; and \n (2) the unorganized militia, which consists of the members of the militia who are not members of the National Guard or the Naval Militia.\n \n sinjin - We're both well past forty-five. No more duty Doc.", 
   {}, 
   371469, 
   null, 
   1254158100.0
  ], 
  [
   371790, 
   null, 
   "Tither", 
   "sinjin - We're both well past forty-five. No more duty Doc.\n\n You just listed the law that grants the U.S. Government the authority to impress citizens into National Service. Doc is talking about ternary. We all must fight that, no matter what age. \n \n However, and be that as it may, Ohio's Constitution and our laws say that one can be drafted and pressed into Ohio's service all the way to 60 or 65. I can't remember which.", 
   {}, 
   371785, 
   null, 
   1254160020.0
  ], 
  [
   371793, 
   null, 
   "JPSartre12", 
   "The FF in their infinite wisdom passed by the States, a BOR warning that an entrenched gov't might assume that those were something the gov't could fiddle with and wrote the Preamble to the BOR to give it the proper context and meaning. We don't need excuses to exercise our rights! The 3 branches of government have all the powers and duties listed (enumerated) that they can perform. There is no power listed to infringe on any rights much less those in the BOR.\n \n I think I have made it clear that the Juries are the final arbiter in all laws whether or not they are Constitutional...not the Supreme Court(s), Federal nor States. Those juries judge both the fact and the law and the sovereign citizens are supreme arbiters of justice.\n \n I have posted that Preamble several times and it needs reading. Any post in conflict with that Preamble is blantantly unConstitutional. Any 'bill' passed outside of those enumerated powers are unConstitutional. Any claims made that are in conflict are unConstitutional. Government is a servant as the quote by Dr. Williams stated. Any pretense that conflicts with either Preamble or Oath or enumerated powers are unConstitutional.\n \n No matter how hard you stomp your feet and yowl will never change those facts! emoticon_xgood\n\n \n The Preamble ISN'T statute law. It is boilerplate that acts as an introduction to the meat and potatoes contained in the BOR. Other than it being used by the SCOTUS to argue the intent of our FF, it serves little additional purpose.", 
   {
    "unicode_changes_made": true
   }, 
   371783, 
   null, 
   1254160320.0
  ], 
  [
   371795, 
   null, 
   "Tither", 
   "The Preamble ISN'T statute law. It is boilerplate that acts as an introduction to the meat and potatoes contained in the BOR. Other than it being used by the SCOTUS to argue the intent of our FF, it serves little additional purpose.\n\n \n I am confused by that statement JP. Intent is everything, no?", 
   {
    "unicode_changes_made": true
   }, 
   371793, 
   null, 
   1254160500.0
  ], 
  [
   371798, 
   null, 
   "JPSartre12", 
   "I am confused by that statement JP. Intent is everything, no?\n\n \n Hardly. The \"devil's in the details.\" The Preamble is just an introduction to the actual provisions that are written into the Constitution. Think of it this way :\n \"Dearly beloved, we are gathered here this day to join this man and this woman in Holy Matrimony\" is the equivalent to the Preamble. It introduces the purpose of what follows.", 
   {}, 
   371795, 
   null, 
   1254161520.0
  ], 
  [
   371811, 
   null, 
   "Tither", 
   "Hardly. The \"devil's in the details.\" The Preamble is just an introduction to the actual provisions that are written into the Constitution. Think of it this way :\n \"Dearly beloved, we are gathered here this day to join this man and this woman in Holy Matrimony\" is the equivalent to the Preamble. It introduces the purpose of what follows.\n\n Yeah. I think I get that, but what Doc said was, \n \n The FF in their infinite wisdom passed by the States, a BOR warning that an entrenched gov't might assume that those were something the gov't could fiddle with and wrote the Preamble to the BOR to give it the proper context and meaning.\n\n That is why I was confused.", 
   {}, 
   371798, 
   null, 
   1254164220.0
  ], 
  [
   371812, 
   null, 
   "JPSartre12", 
   "Yeah. I think I get that, but what Doc said was, \n That is why I was confused.\n\n \n I was responding to this part:\n \"I have posted that Preamble several times and it needs reading. Any post in conflict with that Preamble is blantantly unConstitutional. Any 'bill' passed outside of those enumerated powers are unConstitutional. Any claims made that are in conflict are unConstitutional. Government is a servant as the quote by Dr. Williams stated. Any pretense that conflicts with either Preamble or Oath or enumerated powers are unConstitutional.\"\n \n Specifically, the Preamble has no legal teeth. That was my only point. I agree with Doc's sentiment, I was just being overly technical, I guess. ;)", 
   {}, 
   371811, 
   null, 
   1254164580.0
  ], 
  [
   371814, 
   null, 
   "Tither", 
   "I was responding to this part:\n \"I have posted that Preamble several times and it needs reading. Any post in conflict with that Preamble is blantantly unConstitutional. Any 'bill' passed outside of those enumerated powers are unConstitutional. Any claims made that are in conflict are unConstitutional. Government is a servant as the quote by Dr. Williams stated. Any pretense that conflicts with either Preamble or Oath or enumerated powers are unConstitutional.\"\n \n Specifically, the Preamble has no legal teeth. That was my only point. I agree with Doc's sentiment, I was just being overly technical, I guess. ;)\n\n That clears it all up! Thanks!", 
   {}, 
   371812, 
   null, 
   1254164760.0
  ], 
  [
   371815, 
   null, 
   "Doc Jones", 
   "Hardly. The \"devil's in the details.\" The Preamble is just an introduction to the actual provisions that are written into the Constitution. Think of it this way :\n \"Dearly beloved, we are gathered here this day to join this man and this woman in Holy Matrimony\" is the equivalent to the Preamble. It introduces the purpose of what follows.\n\n \n \n Hardly! Seeing as how Marriage is as simple as a man and a woman areeing to live as a married couple in common law. The BOR is a compact between the States to ensure that the enumerated powers are not overstepped.\n \n Congress OF THE United States\n begun and held at the City of New York, on Wednesday\n the Fourth of March, one thousand seven hundred and eighty nine.\n \n THE Conventions of a number of the States having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best insure the beneficent ends of its institution\n \n RESOLVED by the Senate and House of Representatives of the United States of America, in Congress assembled, two thirds of both Houses concurring, that the following Articles be proposed to the Legislatures of the several States, as Amendments to the Constitution of the United States, all or any of which Articles, when ratified by three fourths of the said Legislatures, to be valid to all intents and purposes, as part of the said Constitution; viz.:\n \n ARTICLES in addition to, and Amendment of the Constitution of the United States of America, proposed by Congress, and ratified by the Legislatures of the several States, pursuant to the fifth Article of the original Constitution.\n \n It is a charter of freedoms by which the government must govern and is not limited to the rights enumerated by the BOR as is made clear in the IXth and Xth Amendment. All rights are inherent in the people; powers are granted to governments.\n \n The powers granted to government are enumerated and final as to their powers. Three amendments deal with rights and priviledges that are and do supercede government powers. That is the trial by jury and the right of the people to be the final arbiters in all law and fact. That amounts to a check on the courts. The ultimate power lies in the hands of the people \"where we trust it will ever remain\". The debates make this even more salient and clear.\n \n Perhaps Bryan will have some thoughts on this subject?", 
   {}, 
   371798, 
   null, 
   1254164820.0
  ], 
  [
   371816, 
   null, 
   "Doc Jones", 
   "Those legal teeth are found in the 2A. That is the final option of restoring government to the original agreement. ..in this Republic, a Nation of Law.", 
   {}, 
   371815, 
   null, 
   1254165060.0
  ], 
  [
   371817, 
   null, 
   "NATO 556", 
   "At least you stopped denying it's a right.\n\n \n No I'm trying to emphasize the point that voting in Australia isn't a right, it's an obligation of the people to the government.\n \n \nThis makes no sense as the 1A is about your right to speak, not about anyone being compelled to listen(or watch) as in your scenario.\n\n \n First, the First Amendment is about the right of free assembly, meaning the gathering of individual people into groups.\n \n Second, it doesn't matter if it makes any sense or not. You keep claiming that voting is a right in Australia, but you get fined for not voting; a punishment for not exercising your rights. It doesn't matter how much you deny it or how much you argue, that's no longer a right, it's a duty.", 
   {}, 
   371783, 
   null, 
   1254165300.0
  ], 
  [
   371821, 
   null, 
   "JPSartre12", 
   "Hardly! Seeing as how Marriage is as simple as a man and a woman areeing to live as a married couple in common law. The BOR is a compact between the States to ensure that the enumerated powers are not overstepped.\n \n Congress OF THE United States\n begun and held at the City of New York, on Wednesday\n the Fourth of March, one thousand seven hundred and eighty nine.\n \n THE Conventions of a number of the States having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best insure the beneficent ends of its institution\n \n RESOLVED by the Senate and House of Representatives of the United States of America, in Congress assembled, two thirds of both Houses concurring, that the following Articles be proposed to the Legislatures of the several States, as Amendments to the Constitution of the United States, all or any of which Articles, when ratified by three fourths of the said Legislatures, to be valid to all intents and purposes, as part of the said Constitution; viz.:\n \n ARTICLES in addition to, and Amendment of the Constitution of the United States of America, proposed by Congress, and ratified by the Legislatures of the several States, pursuant to the fifth Article of the original Constitution.\n \n It is a charter of freedoms by which the government must govern and is not limited to the rights enumerated by the BOR as is made clear in the IXth and Xth Amendment. All rights are inherent in the people; powers are granted to governments.\n \n The powers granted to government are enumerated and final as to their powers. Three amendments deal with rights and priviledges that are and do supercede government powers. That is the trial by jury and the right of the people to be the final arbiters in all law and fact. That amounts to a check on the courts. The ultimate power lies in the hands of the people \"where we trust it will ever remain\". The debates make this even more salient and clear.\n \n Perhaps Bryan will have some thoughts on this subject?\n\n \n You're still missing my point. The Preamble is NOT law. It is an introduction to laws that follow.", 
   {}, 
   371815, 
   null, 
   1254165780.0
  ], 
  [
   371822, 
   null, 
   "Doc Jones", 
   "You're still missing my point. The Preamble is NOT law. It is an introduction to laws that follow.\n\n \n Well yeah, it is a definition of why they exist and as a part of the Constitution and the source of those rights they cannot be diminished nor removed by any branch of government. I would say that it is statutory precedent. You may have different thoughts? They saw fit to list some rights that are given by a greater power and would exist whether they were written or not.\n \n You like Dr. Williams I see. He has some excellent synopsis columns on his site that go back quite a ways. Want a link?", 
   {}, 
   371821, 
   null, 
   1254166200.0
  ], 
  [
   371827, 
   null, 
   "JPSartre12", 
   "Well yeah, it is a definition of why they exist and as a part of the Constitution and the source of those rights they cannot be diminished nor removed by any branch of government. I would say that it is statutory precedent. You may have different thoughts? They saw fit to list some rights that are given by a greater power and would exist whether they were written or not.\n\n \n The reason that I'm careful in making the point that the Preamble isn't law is because liberals love to state that \"promote the general welfare\" gives them authority to enact social engineering legislation that is outside of the scope of the Constitution. Promoting the general welfare does NOT mean enriching individuals with monetary rewards for doing nothing. \n \n\n You like Dr. Williams I see. He has some excellent synopsis columns on his site that go back quite a ways. Want a link?\n\n \n I've been a fan of WW and Thomas Sowell for decades, I'd love to have the link. His story of the first Thanksgiving is one of my favorites. Thanks.", 
   {
    "unicode_changes_made": true
   }, 
   371822, 
   null, 
   1254167880.0
  ], 
  [
   371837, 
   null, 
   "Doc Jones", 
   "The reason that I'm careful in making the point that the Preamble isn't law is because liberals love to state that \"promote the general welfare\" gives them authority to enact social engineering legislation that is outside of the scope of the Constitution. Promoting the general welfare does NOT mean enriching individuals with monetary rewards for doing nothing.\n\n \n Yeah? Well tell them that is found in the Declaration of Independence and not in the Constitution. \n \n \n \nI've been a fan of WW and Thomas Sowell for decades, I'd love to have the link. His story of the first Thanksgiving is one of my favorites. Thanks.\n\n \n Here is (a) link to Walter Williams website on JFPO...AS well as some others that are interesting reading by scholars of the Constitution.\n \n The Constitutional Society is located here in Texas and has a wealth of things to enrich your understanding of document and history, you can find almost any answer there. The National Archives and Records Administration is also an excellent site and maintained by the government.\n \n Walter Williams archive\n Walter Williams Archives\n \n That is one. Townhall is another place that posts his insight. It goes back by year and may have more articles under his name there as well as a link to those archives.\n \n Constitution Society Home Page\n Constitution Society Home Page\n \n http://www.chuckbaldwinlive.com/\n Chuck Baldwin's home page\n \n The Federalist Society\n The Federalist Society\n \n Sorry it took so long but I have been up to my elbows in dough...no, not that kind, the stuff you make bread from :) Today is my bread and pastries day :)", 
   {
    "unicode_changes_made": true
   }, 
   371827, 
   null, 
   1254171840.0
  ], 
  [
   371843, 
   null, 
   "JPSartre12", 
   "Yeah? Well tell them that is found in the Declaration of Independence and not in the Constitution. \n\n \n emoticon_confused\n \n\n Preamble to the US Constitution\n We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\n\n \n It's there in my copy. ;)\n \n\n Here is (a) link to Walter Williams website on JFPO...AS well as some others that are interesting reading by scholars of the Constitution.\n \n The Constitutional Society is located here in Texas and has a wealth of things to enrich your understanding of document and history, you can find almost any answer there. The National Archives and Records Administration is also an excellent site and maintained by the government.\n \n Walter Williams archive\n Walter Williams Archives\n \n That is one. Townhall is another place that posts his insight. It goes back by year and may have more articles under his name there as well as a link to those archives.\n \n Constitution Society Home Page\n Constitution Society Home Page\n \n http://www.chuckbaldwinlive.com/\n Chuck Baldwin's home page\n \n The Federalist Society\n The Federalist Society\n \n Sorry it took so long but I have been up to my elbows in dough...no, not that kind, the stuff you make bread from :) Today is my bread and pastries day :)\n\n \n Thanks for the links. Are you a baker by profession or hobby?", 
   {}, 
   371837, 
   null, 
   1254177480.0
  ], 
  [
   371851, 
   null, 
   "Doc Jones", 
   "emoticon_confused\n \n \n It's there in my copy. ;)\n\n \n That is why I quoted the preamble to the BOR. Congress has its' powers enumerated in article 1, section 8. Any claim to the contrary and not withstanding. If it isn't enumerated, they don't have it.\n \n \n [quote}Thanks for the links. Are you a baker by profession or hobby?[/QUOTE]\n \n Necessity, we like homemade stuff and I enjoy cooking because it is relaxing. If you ever met some of the folks that have come visiting, they can attest to that :) I cook quite a bit when I have time and the older I get the more time I have. Outside of that there are plenty of chores around the ranchocita plus my regular duties which I have slacked off on quite a bunch :) I found a fondness for good books and rocking chairs and an occasional round of golf or a bit of fishing but sometimes after I forget how much of a chore that is, the rocking chair and spittoon look more attractive ;)\n \n The computer is a hobby. Took it up after a bout with cancer to occupy my time during recovery and have met some darn fine folks that are like minded that I enjoy quite a bit. Old fashioned, the kitchen and dining table are the visiting spots for us still anyhow.", 
   {}, 
   371843, 
   null, 
   1254179340.0
  ], 
  [
   371852, 
   null, 
   "Doc Jones", 
   "emoticon_confused\n \n \n It's there in my copy. ;)\n\n \n That is why I quoted the preamble to the BOR. Congress has its' powers enumerated in article 1, section 8. Any claim to the contrary and not withstanding. If it isn't enumerated, they don't have it.\n \n \n \nThanks for the links. Are you a baker by profession or hobby?\n\n \n Necessity, we like homemade stuff and I enjoy cooking because it is relaxing. If you ever met some of the folks that have come visiting, they can attest to that :) I cook quite a bit when I have time and the older I get the more time I have. Outside of that there are plenty of chores around the ranchocita plus my regular duties which I have slacked off on quite a bunch :) I found a fondness for good books and rocking chairs and an occasional round of golf or a bit of fishing but sometimes after I forget how much of a chore that is, the rocking chair and spittoon look more attractive ;)\n \n The computer is a hobby. Took it up after a bout with cancer to occupy my time during recovery and have met some darn fine folks that are like minded that I enjoy quite a bit. Old fashioned, the kitchen and dining table are the visiting spots for us still anyhow.", 
   {}, 
   371843, 
   null, 
   1254179520.0
  ], 
  [
   371874, 
   null, 
   "Bryan", 
   "I believe that our founding fathers frequently used preambles as declarations of strongly held beliefs or principles. Here is one example from the first American Constitution, the Constitution of Virginia (June 6, 1776):\n \n &#8220;That religion, or the duty which we owe to our Creator, and the manner of discharging it, can be directed only by reason and conviction, not by force or violence; and therefore all men are equally entitled to the free exercise of religion, according to the dictates of conscience; and that it is the mutual duty of all to practice Christian forbearance, love, and charity towards each other.&#8221;\n \n Here is how I break this clause down: You start with a preamble, a statement of principle--&#8220;That religion, or the duty which we owe to our Creator, and the manner of discharging it, can be directed only by reason and conviction, not by force or violence&#8221;&#8212;followed by the actual operable language which expresses the right--&#8220;and therefore all men are equally entitled to the free exercise of religion, according to the dictates of conscience&#8221;&#8212;followed by another, closing statement of principle--&#8220;and that it is the mutual duty of all to practice Christian forbearance, love, and charity towards each other.&#8221;\n \n No one suggests that this preamble was intended to limit the right it helps introduce.\n \n Here is another example, this time from the Constitution of North Carolina (December 14, 1776):\n \n &#8220;That retrospective laws, punishing facts committed before the existence of such laws, and by them only declared criminal, are oppressive, unjust, and incompatible with liberty; wherefore no ex post facto law ought to be made.&#8221;\n \n From this provision we see another use of a preamble to state a principle&#8212;&#8220;That retrospective laws, punishing facts committed before the existence of such laws, and by them only declared criminal, are oppressive, unjust, and incompatible with liberty&#8221;&#8212;followed by the operable language of the right&#8212;&#8220;wherefore no ex post facto law ought to be made.&#8221;\n \n And again no one suggests that this preamble was intended to do anything other than introduce the right.\n \n Preambles like this were in fact very common. I have argued before that the militia clause of the 2nd. Amendment is nothing more than another of these statements of principle:\n \n &#8220;A well regulated militia being necessary to the security of a free State&#8221;(emphasis added)\n \n I still believe this is nothing more than a restatement of a universally held principle that I quoted before:\n \n &#8220;It has been asserted by the most respectable writers upon government, that a well-regulated militia, composed of the yeomanry of the country, have ever been considered as the bulwark of a free people. Tyrants have never placed any confidence on a militia composed of freemen.&#8221; John DeWitt, The Anti-Federalist Papers, p. 75 (M. Borden ed. 1965) \n \n I have found it was also espoused by Patrick Henry: \n \n &#8220;[T]hat a well regulated militia, composed of gentlemen and yeomen, is the natural strength and only security of a free government.&#8221; Speech of Patrick Henry in R. Meade's Patrick Henry, p. 28 (1969).\n \n But it was not only private citizens who felt the need to make this statement of principle. It was included in many of the state constitutions. Here are a few examples:\n \n CONSTITUTION OF VIRGINIA (June 6, 1776)\n \n That a well-regulated militia, composed of the body of the people, trained to arms, is the proper, natural, and safe defense of a free state; that standing armies, in time of peace, should be avoided, as dangerous to liberty; and that in all cases the military should be under strict subordination to, and governed by, the civil power.\n \n DELAWARE DECLARATION OF RIGHTS (September 11, 1776)\n \n That a well-regulated militia is the proper, natural and safe defense of a free government.\n That standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n CONSTITUTION OF MARYLAND (November 3, 1776)\n \n That a well-regulated militia is the proper and natural defense of a free government.\n That standing armies are dangerous to liberty, and ought not to be raised or kept up, without consent of the legislature.\n \n CONSTITUTION OF NEW HAMPSHIRE (June 2, 1784)\n \n A well-regulated militia is the proper, natural, and safe defense of a state.\n Standing armies are dangerous to liberty, and ought not to be raised or kept up without the consent of the legislature.\n \n You can see from this that all Madison did was cut this statement of a widely held belief from the state constitutions and paste in into the BoR as a preamble for the 2nd. Amendment. And that&#8217;s all it is in my opinion&#8212;a restatement of a universally held belief in the preference for militias (also tied in these instances to a universally held fear of standing armies). \n \n And that&#8217;s all these preambles are designed to do in my opinion&#8212;make a statement of a universally held belief. Many American rights are preceeded by these preambles. In my opinion there remains absolutely no evidence that the 2nd. Amendment was intended to be unfortunate enough to have a preamble included as a sort of chaperone to limit where it goes, what it does, and what it protects. \n \n Still I know many people&#8212;Brady, for example&#8212;who believe the militia preamble was designed to do just this. He has in fact lectured us on this belief before. But I have heard lectures given before by people who know very little themselves about the subject they presume to teach on&#8212;people for whom we say &#8220;his knowledge is only power point deep&#8221; and once you ask them a question about the topic that was not included in the power point presentation they borrowed from someone else they flounder like a fish out of water. And this is why you won&#8217;t see someone like Brady tackle issues like this&#8212;because his knowledge &#8220;is only VPC press release deep&#8221;&#8212;and the VPC hasn&#8217;t given him the talking points on an issue like this yet.", 
   {
    "post_info": {
     "post_title": "preambles"
    }
   }, 
   371852, 
   null, 
   1254201720.0
  ], 
  [
   371898, 
   null, 
   "JPSartre12", 
   "That is why I quoted the preamble to the BOR. Congress has its' powers enumerated in article 1, section 8. Any claim to the contrary and not withstanding. If it isn't enumerated, they don't have it.\n\n \n While I agree, there are many liberals that don't. :(\n \n \n\n Necessity, we like homemade stuff and I enjoy cooking because it is relaxing. If you ever met some of the folks that have come visiting, they can attest to that :) I cook quite a bit when I have time and the older I get the more time I have. Outside of that there are plenty of chores around the ranchocita plus my regular duties which I have slacked off on quite a bunch :) I found a fondness for good books and rocking chairs and an occasional round of golf or a bit of fishing but sometimes after I forget how much of a chore that is, the rocking chair and spittoon look more attractive ;)\n \n\n \n I envy you. My free time is limited to evenings and weekends, which I spend fishing (bass fishing addict) or drag racing with my son, when the weather co-operates.\n \n \n\n The computer is a hobby. Took it up after a bout with cancer to occupy my time during recovery and have met some darn fine folks that are like minded that I enjoy quite a bit. Old fashioned, the kitchen and dining table are the visiting spots for us still anyhow.\n\n \n Well, your misfortune was our gain. I hope that your prognosis was a good one.", 
   {}, 
   371852, 
   null, 
   1254241200.0
  ], 
  [
   371899, 
   null, 
   "Tither", 
   "I believe that our founding fathers frequently used preambles as declarations of strongly held beliefs or principles. \n \n No one suggests that this preamble was intended to limit the right it helps introduce.\n\n Man Bryan, it would be very cool if we could just prove that preambles or declarations were, in fact, part of the Bill of Rights. In this way, we could put to bed the ridiculous notion of the antis forever! Alas, such proof of preambles of declarations just does not exist! Or does it? emoticon_smile\n \n  Bill of Rights Preamble \n THE Conventions of a number of the States having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best insure the beneficent ends of its institution.\n\n \n , in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: \n \n Declaratory or declaration. Restrictive or restriction. Restrictions against who? The Government.\n \n Amendment II\n Here is a declaration that our Founders said would be included. A well regulated Militia being necessary to the security of a free State, \n \n The Restriction. the right of the people to keep and bear Arms shall not be infringed.", 
   {}, 
   371874, 
   null, 
   1254241620.0
  ], 
  [
   371902, 
   null, 
   "JPSartre12", 
   "....\n Amendment II\n Here is a declaration that our Founders said would be included. A well regulated Militia being necessary to the security of a free State, \n \n The Restriction. the right of the people to keep and bear Arms shall not be infringed.\n\n \n You have that wrong. The first clause is prefatory, the SECOND is the operative one.", 
   {}, 
   371899, 
   null, 
   1254242520.0
  ], 
  [
   371904, 
   null, 
   "Tither", 
   "You have that wrong. The first clause is prefatory, the SECOND is the operative one.\n\n   prefatory \n pref&#8901;a&#8901;to&#8901;ry\n &#8194; [pref-uh-tawr-ee, -tohr-ee] \n of, pertaining to, or of the nature of a preface: prefatory explanations. \n\n Or said another way, a declaration. emoticon_smile\n   declaration \n 1. the act of declaring; announcement\n \n 2. a positive, explicit, or formal statement; proclamation: a declaration of war.\n 3. something that is announced, avowed, or proclaimed.\n 4. a document embodying or displaying an announcement or proclamation:\n \n Semantics.emoticon_smile", 
   {}, 
   371902, 
   null, 
   1254243480.0
  ], 
  [
   371905, 
   null, 
   "Tither", 
   " V. Drafting of the Federal Bill of Rights \n When James Madison found himself cast in the unlikely role of father of the national bill of rights,[234] he was not forced to write upon a clean slate. His first step was to obtain a pamphlet which conveniently listed all state proposals, from the Pennsylvania minority onward.[235] The problem became one of editing; out of hundreds of proposals, many redundant and some questionable, a hard core of usable proposals had to be selected. The barriers to be surmounted required discarding all controversial proposals. As he informed Jefferson, \"every thing of a controvertible nature that might endanger the concurrence of two-thirds of each House and three quarters of the States was studiously avoided.\"[236] After excluding the controversial propositions, Madison still had to single out the most desirable proposal, and then (where several different proposals had been made to a single end) select the specific terms of the guarantee. Finally, he had to decide how to assemble and group the rights into a number of amendments. The last task was to a certain extent governed by Madison's plan (which had been retained in committee) to (p.54)interweave the amendments into the text of the constitution, in the manner of a modern \"pocket part.\"[237]\n \n Madison's decision to include a right to arms in his federal bill of rights is hardly surprising. Such a right had been demanded in virtually every call for a bill of rights; indeed, it had received twice the number of demands accorded freedom of speech.[238] Language praising the militia had received much less support, essentially having been appended to the right to arms clause in Virginia and the two following conventions.[239] But an adaptation of the Virginia/New York/North Carolina wording combining the two held unusual promise. One of Madison's major objectives was to \"bring in\" North Carolina.[240] He hoped to convince it to ratify the Constitution by offering an acceptable bill of rights. North Carolina could hardly object to a nearly verbatim acceptance of its demand.\n \n A combination of a militia statement with individual right recognition fitted Madison's objectives perfectly. \n", 
   {}, 
   371904, 
   null, 
   1254243660.0
  ], 
  [
   371909, 
   null, 
   "OldSarge", 
   "From the gunner's seat Bryan is correct in the use of prefaces or preambles were quite common. Just because a preamble is used it doesn't change the rules of English grammer. The barn jelly that the militia clause some how defines, narrows, transforms or transmogrifys (sic) the operate clause is nothing more than nonsense. It only proves the sorry state of what passes for modern education. Just because the second amendment has a preamble does not diminish or change the fact that the granting or afirming of this right to the people is quite clear. Any attempt to argue some thing different is merely proof of mental defect or retardation. It is quite clear in the other amendments the rights belong to the people. One can examine 19th century legal treates and find \"When words of the enacting clause are clear and positive, recourse must not be had to the preamble.\" Even later it can be found that \"the preamble can neither limit nor extend the meaning of a statute which is clear. Similiarly, it cannot be used to create doubt or uncertainty.\" The invention of the pseudo science of linguistics had not been invented at the time the second amendment was written. At that time the rules of interpreting legal language were understood. Punctuation does not change the meaning of the right of the people no matter how much you twist, squirm, spin and shout. ", 
   {}, 
   371905, 
   null, 
   1254246840.0
  ], 
  [
   371910, 
   null, 
   "JPSartre12", 
   "Quote:\n Originally Posted by JPSartre12 \n You have that wrong. The first clause is prefatory, the SECOND is the operative one. \n \n \n\n prefatory \n Quote:\n pref&#8901;a&#8901;to&#8901;ry\n &#8194; [pref-uh-tawr-ee, -tohr-ee] \n of, pertaining to, or of the nature of a preface: prefatory explanations. \n \n Or said another way, a declaration. \n declaration \n \n Semantics. \n \n\n \n No, a preface is a specific use of language. It is an introduction.\n It's not semantics, it's attempted subterfuge on your part. emoticon_rolleyes\n \n Subterfuge\n 1 : deception by artifice or stratagem in order to conceal, escape, or evade\n 2 : a deceptive device or stratagem", 
   {}, 
   371904, 
   null, 
   1254247620.0
  ], 
  [
   371911, 
   null, 
   "Doc Jones", 
   "Quote:\n Originally Posted by JPSartre12 \n You have that wrong. The first clause is prefatory, the SECOND is the operative one. \n \n \n \n No, a preface is a specific use of language. It is an introduction.\n It's not semantics, it's attempted subterfuge on your part. emoticon_rolleyes\n \n Subterfuge\n 1 : deception by artifice or stratagem in order to conceal, escape, or evade\n 2 : a deceptive device or stratagem\n\n \n The entire BOR is a restriction on government, all 10 of them! Says so in the Preamble.\n \n Just because some have been usurped should serve as a warning and wake up call to every citizen as much as Paul Revere riding through town.", 
   {}, 
   371910, 
   null, 
   1254249060.0
  ], 
  [
   371914, 
   null, 
   "Tither", 
   "It's not semantics, it's attempted subterfuge on your part. \n \n Subterfuge\n 1 : deception by artifice or stratagem in order to conceal, escape, or evade\n 2 : a deceptive device or stratagem\n\n \n Everyone can exactly see the two definitions I Linked! They will be the judge of this! And they can also be the judge of your ridiculous mis-characterization of my motives too!\n \n The Preamble to the Bill of Rights said \"that further declaratory and restrictive clauses should be added:\" Maybe your argument should be with our Founders for not using the legal term for such. \n \n You SHOULD be ashamed of your ridiculous accusation, but I doubt that you are!", 
   {}, 
   371910, 
   null, 
   1254251040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A little of the beaten path...but", 
  "url": "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13324, 
  "discussion_files": [
   [
    "32092.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-print.html"
   ], 
   [
    "32093.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-8-print.html"
   ], 
   [
    "32094.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-6-print.html"
   ], 
   [
    "32095.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-4-print.html"
   ], 
   [
    "32096.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-5-print.html"
   ], 
   [
    "32097.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-7-print.html"
   ], 
   [
    "32098.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-3-print.html"
   ], 
   [
    "32099.html", 
    "http://www.4forums.com/political/gun-control-debates/13324-little-beaten-path-but-2-print.html"
   ]
  ], 
  "identifier": 13324
 }
]