[
 [
  [
   371441, 
   null, 
   "Another opinion", 
   "There are many beliefs in God and the supernatural that seem to be constant over a wide range of religions. These are assumptions that are often so taken for granted that they are rarely ever considered. I would like to bring up a couple here for discussion to see what people think...\n \n 1) Assumption: Belief in God necessarily includes a belief that God created Man and the Universe. Many earlier religions included gods that had no role in creation and I have heard that there are some minor religions that do not espouse supernatural creation stories. Why do we feel that, in order to properly believe in God, we need to believe the He created Man and the universe? How would it affect our view of God if we no longer believed in creation?\n \n 2) Assumption: God is omnipotent, or at least powerful enough to be able to carry out anything which He wills. How would it change our view of God if God had limitations in that there were things which He wills, but cannot achieve? This is a question independent of the question of free will for people - since traditional belief in God says that He wants us to practice free will and, therefore, limits His actions by His own choice to let us make our own mistakes.\n \n So, what are your views in \"thinking outside the box\" about these assumptions we make about God?", 
   {
    "post_info": {
     "post_title": "Challenging assumptions we make about God"
    }
   }, 
   null, 
   null, 
   1253836140.0
  ], 
  [
   371641, 
   null, 
   "marc9000", 
   "There are many beliefs in God and the supernatural that seem to be constant over a wide range of religions. These are assumptions that are often so taken for granted that they are rarely ever considered. I would like to bring up a couple here for discussion to see what people think...\n \n 1) Assumption: Belief in God necessarily includes a belief that God created Man and the Universe. Many earlier religions included gods that had no role in creation and I have heard that there are some minor religions that do not espouse supernatural creation stories. Why do we feel that, in order to properly believe in God, we need to believe the He created Man and the universe? How would it affect our view of God if we no longer believed in creation? \n\n \n It makes God weak - makes him secondary to the laws of nature. An insignificant God is right next to a non-existant God. \n \n \n2) Assumption: God is omnipotent, or at least powerful enough to be able to carry out anything which He wills. How would it change our view of God if God had limitations in that there were things which He wills, but cannot achieve? This is a question independent of the question of free will for people - since traditional belief in God says that He wants us to practice free will and, therefore, limits His actions by His own choice to let us make our own mistakes. \n\n \n Science/humans have done at least a few amazing things. If God has ANY limitations, he is then susceptible to taking a back seat to man. It's not Christianity. \n \n \nSo, what are your views in \"thinking outside the box\" about these assumptions we make about God?\n\n \n You're calling them assumptions, but they are actually basics in Christianity, made clear throughout the word of God (the Bible) and most, if not all details of Christianity fall like dominos without them.", 
   {}, 
   371441, 
   null, 
   1254021720.0
  ], 
  [
   371714, 
   null, 
   "unkerpaulie", 
   "What would be the point of believing in a God with limitations or flaws? If you're going to believe that God exist, why wouldn't you go for all the bells and whistles? I don't think a God that didn't really create the universe or isn't omnipotent sounds like a more \"realistic\" God than one that did or is. Plus, we've had gods in the past that were less than perfect, like the norse or greek mythology figures. They were portrayed to be much more down-to-earth (so to speak) than the biblical God, yet they didn't really last as objects of worship.", 
   {}, 
   371641, 
   null, 
   1254081300.0
  ], 
  [
   371728, 
   null, 
   "marc9000", 
   "What would be the point of believing in a God with limitations or flaws? If you're going to believe that God exist, why wouldn't you go for all the bells and whistles? \n\n \n Because \"all the bells and whistles\" clash with some philosophical science that passes for actual science today. Scientists like Kenneth Miller who take a keen interest in biology have a choice to make. If they don't believe in limitations and flaws in God, they have to turn away from some philosophical science that they're interested in. \n \n \n I don't think a God that didn't really create the universe or isn't omnipotent sounds like a more \"realistic\" God than one that did or is. \n\n \n Miller sure does. From his book \"Finding Darwins God\" he says;\n \n \n...only those who embrace the scientific reality of evolution are adequately prepared to give God the credit and power he truly deserves. \n\n \n An amazing statement - it's up to each individual to determine if they believe it's a sincere statement, or phony. \n \n \nPlus, we've had gods in the past that were less than perfect, like the norse or greek mythology figures. They were portrayed to be much more down-to-earth (so to speak) than the biblical God, yet they didn't really last as objects of worship.\n\n \n There are lots of insignificant gods, past and present. Atheists often bring up their \"existence\" (NOT YOU) in order to downplay the conflict between religion and science. It's up to each individual to determine if they're sincere. emoticon_xangel", 
   {}, 
   371714, 
   null, 
   1254086400.0
  ], 
  [
   371782, 
   null, 
   "unkerpaulie", 
   "This kinda brings us back to the same question. If someone who, from their understanding of science, believes that the universe and life on earth occured spontaneously, and believes that we can only interact with the tangible and observable realm, then why would they think its still necessary to believe that God exists?\n \n What good is a God with no power to affect the physical realm? For forgiveness of sin and taking you to heaven when you die? Now where would someone get the feeling that man is sinful and needs a savior? And where would he get the idea that God is preparing a place called heaven for those who believe in him when they die? Hmmm....\n \n At some point we end up with a form of hybrid religion where people are still sourcing the very bible they reject to pick out the parts that they want to keep. Like you said its just the individual arbitrarily deciding what is true and what isn't. Not very scientific at all if you ask me...", 
   {}, 
   371728, 
   null, 
   1254157560.0
  ], 
  [
   371787, 
   null, 
   "Another opinion", 
   "It makes God weak - makes him secondary to the laws of nature. An insignificant God is right next to a non-existant God. \n \n Science/humans have done at least a few amazing things. If God has ANY limitations, he is then susceptible to taking a back seat to man. It's not Christianity.\n\n You seem to assume that, if God is not omnipotent and did not create man and the universe, then he is somehow so weak as to not be impressive enough to follow. I would strongly contest that point. Between the capabilities of man and the concept of omnipotence is a huge gray region of power that could crush man in an instant or tremendously help him. There were many gods of the past that were limited in the power yet were worshipped. In the history of religion, neither omnipotence nor creation were ever firm requirements for deities that were worshipped. They just needed to be powerful enough that worshipping them could help people gain some sense of security about their own lives - i.e. a sort of deal with their god(s) that worship translated to good treatment by those god(s). Indeed, most religions did not hold a belief in a monotheistic omnipotent creator god. That concept is far more related to the Judeo/Christian/Muslim faith that all started with the same core belief and branched out from that core. \n \nYou're calling them assumptions, but they are actually basics in Christianity, made clear throughout the word of God (the Bible) and most, if not all details of Christianity fall like dominos without them.\n\n Christianity was once much more widely defined than it is nowadays - particularly prior to the Council of Nicaea under Emperor Constantine in the fourth century that suppressed all alternate Christian beliefs to support only one - the proto-orthodox that later split into the Roman Catholic faith and the orthodox faith. If you look at early Christian beliefs such as the Gnostic belief, then you will see that a belief can be Christian without the structure that we take for granted in Christian belief nowadays. You define Christianity too tightly. Early Christians were far more diverse.", 
   {}, 
   371641, 
   null, 
   1254159240.0
  ], 
  [
   371792, 
   null, 
   "Another opinion", 
   "What would be the point of believing in a God with limitations or flaws? If you're going to believe that God exist, why wouldn't you go for all the bells and whistles? I don't think a God that didn't really create the universe or isn't omnipotent sounds like a more \"realistic\" God than one that did or is. Plus, we've had gods in the past that were less than perfect, like the norse or greek mythology figures. They were portrayed to be much more down-to-earth (so to speak) than the biblical God, yet they didn't really last as objects of worship.\n\n A belief in a limited God can still hold great psychological advantages over no belief at all. For example, one could believe in a God that did not create man or the universe but still is very capable of responding to prayers to lead people into making better decisions in their lives, etc. - a cosmic parent of sorts that many people feel the need for. \n \n As for gods of the past, they didn't really last as objects of worship in the past - in the West. However, the Hindu belief system is older than that of Christianity - where they have maintained polytheistic beliefs consistently for millenia. Also, the only reason Christianity gained popularity and lasted for so long in high numbers is because it was espoused by the powers that be in the Roman empire - i.e. Constantine. If not for the adaptation of Christianity as the official religion of the Roman empire, then it would have remained a minor religion. Lastly, from the ancient Egyptian empire, Akenahten had introduced quasi-omnipotent monotheistic belif, yet that belief did not survive his reign because of politics. Therefore, one cannot automatically assume that it was omnipotent monotheism that caused Christianity to survive as a religion.\n \nAt some point we end up with a form of hybrid religion where people are still sourcing the very bible they reject to pick out the parts that they want to keep. Like you said its just the individual arbitrarily deciding what is true and what isn't. Not very scientific at all if you ask me...\n\n Historically, it was the religious heirarchy that determined which parts of the scriptural heritage they would keep and which parts they would throw out. This was certainly true of the Council of Nicaea during Emperor Constantine's time which threw out the great majority of Christian writings (a small fraction of which has been recovered in recent decades). Do you really believe that it was purely direction from God that determined which aspects of Christian belief would be preserved and which would be rejected? It is clear to me that Christian history is very full of decisions about belief that were made by very flawed individuals that were making decisions often based more on politics of the time than on direct influence from God (think of all of the popes that were viewed as infalable yet led very flawed and immoral lives). Why should we hold those historical decisions as flawless? To me, I see Christian history as already being full of very flawed influences so I see very limited problems with people picking the beliefs which they want to hold since, either way, we are largely guessing.", 
   {}, 
   371714, 
   null, 
   1254160260.0
  ], 
  [
   371869, 
   null, 
   "marc9000", 
   "You seem to assume that, if God is not omnipotent and did not create man and the universe, then he is somehow so weak as to not be impressive enough to follow. I would strongly contest that point. Between the capabilities of man and the concept of omnipotence is a huge gray region of power that could crush man in an instant or tremendously help him. \n\n \n Then I would expect that huge gray region of power to contain at least some who are religious/non-creationists that have similar worldviews in other aspects (behavior/political) to creationists. It doesn't happen at 4forums, does it? I would expect to see a non creationist, sincere with the \"crush\", \"tremendously help\" beliefs, to agree with creationists in political matters. I would expect them to agree with creationists 90 or more percent of the time in politics, and despise atheists political beliefs. Not the other way around, as they always do here. \n \n \nThere were many gods of the past that were limited in the power yet were worshipped. In the history of religion, neither omnipotence nor creation were ever firm requirements for deities that were worshipped. They just needed to be powerful enough that worshipping them could help people gain some sense of security about their own lives - i.e. a sort of deal with their god(s) that worship translated to good treatment by those god(s). Indeed, most religions did not hold a belief in a monotheistic omnipotent creator god. That concept is far more related to the Judeo/Christian/Muslim faith that all started with the same core belief and branched out from that core. \n\n \n That concept is also related to the foundation of the U.S. government. In the current culture war in the U.S. those long past beliefs are irrelevant. \n \n \nChristianity was once much more widely defined than it is nowadays - particularly prior to the Council of Nicaea under Emperor Constantine in the fourth century that suppressed all alternate Christian beliefs to support only one - the proto-orthodox that later split into the Roman Catholic faith and the orthodox faith. If you look at early Christian beliefs such as the Gnostic belief, then you will see that a belief can be Christian without the structure that we take for granted in Christian belief nowadays. You define Christianity too tightly. Early Christians were far more diverse.\n\n \n It was defined like that in the 18th century when U.S. foundations were laid. I'm no expert on Christian history, but as far as I know the Bible wasn't even translated into English until the 16th century. (King James) It makes sense that important discoveries about Christianity weren't discovered until only a few centuries ago. Bible scholars like Martin Luther and many others made significant contributions. I think it makes sense - just because discoveries about Christianity weren't made immediately after the Bible was written, doesn't mean they weren't there all along.", 
   {}, 
   371787, 
   null, 
   1254192720.0
  ], 
  [
   371871, 
   null, 
   "unkerpaulie", 
   "A belief in a limited God can still hold great psychological advantages over no belief at all. For example, one could believe in a God that did not create man or the universe but still is very capable of responding to prayers to lead people into making better decisions in their lives, etc. - a cosmic parent of sorts that many people feel the need for. \n \n\n Even though this sounds like a psychological crutch, I can't discount the idea that many people indeed feel the need to have this belief in an invisible guide/partner. And since they might want to personify this idea, they might as well refer to it as God. Personally I disagree with this idea, and I think people would be short-changing themselves if they never realize that the wisdom to make decisions was there's all along, and they should take responsibility for the good and bad choices they make. \n \n \nAs for gods of the past, they didn't really last as objects of worship in the past - in the West. However, the Hindu belief system is older than that of Christianity - where they have maintained polytheistic beliefs consistently for millenia. Also, the only reason Christianity gained popularity and lasted for so long in high numbers is because it was espoused by the powers that be in the Roman empire - i.e. Constantine. If not for the adaptation of Christianity as the official religion of the Roman empire, then it would have remained a minor religion. Lastly, from the ancient Egyptian empire, Akenahten had introduced quasi-omnipotent monotheistic belif, yet that belief did not survive his reign because of politics. Therefore, one cannot automatically assume that it was omnipotent monotheism that caused Christianity to survive as a religion.\n \n Historically, it was the religious heirarchy that determined which parts of the scriptural heritage they would keep and which parts they would throw out. This was certainly true of the Council of Nicaea during Emperor Constantine's time which threw out the great majority of Christian writings (a small fraction of which has been recovered in recent decades). Do you really believe that it was purely direction from God that determined which aspects of Christian belief would be preserved and which would be rejected? It is clear to me that Christian history is very full of decisions about belief that were made by very flawed individuals that were making decisions often based more on politics of the time than on direct influence from God (think of all of the popes that were viewed as infalable yet led very flawed and immoral lives). Why should we hold those historical decisions as flawless? To me, I see Christian history as already being full of very flawed influences so I see very limited problems with people picking the beliefs which they want to hold since, either way, we are largely guessing.\n\n Very true. It boils down to ones decision to believe, and their own personal feeling of justification for doing so. At the same time, a person in that position would probably have a hard time justifying to someone else to adopt their idea of god based on this. Rather than masses of organized religion, belief in God would be based on isolated personal situations. Perhaps the concept of God would completely fade away eventually.", 
   {}, 
   371792, 
   null, 
   1254194100.0
  ], 
  [
   371908, 
   null, 
   "Another opinion", 
   "Then I would expect that huge gray region of power to contain at least some who are religious/non-creationists that have similar worldviews in other aspects (behavior/political) to creationists. It doesn't happen at 4forums, does it? I would expect to see a non creationist, sincere with the \"crush\", \"tremendously help\" beliefs, to agree with creationists in political matters. I would expect them to agree with creationists 90 or more percent of the time in politics, and despise atheists political beliefs. Not the other way around, as they always do here. \n\n Most of the prominent religions of the world either hold monotheistic beliefs in an omnipotent creator God (mainstream Christianity, Islam, Judeism, etc.) or have polytheistic beliefs where some gods are involved in creation and some are not (Hinduism). There are very few religions that have no belief in supernatural creations and, from the examples that I have heard, those tend to be more alternative - ex. Wikka - so they might not espouse conservative beliefs. You should also keep in mind that Christians hold various views on God's role in creation - some holding to a strict literal interpretation of the Bible and its Genesis story, while others interpret it more symbolically (apparently so do most Biblical scholars) in a way that allows for beliefs such as theistic evolution. Either way, believing in God and His involvement at some level in creation does by no means mean that those believers will have conservative political views. The only thing I would agree to there is that those that have very strict literal interpretations of the Bible, including literal interpretations of Genesis, would tend to be more conservative. However, many (possibly most) Christians don't hold views of creation that are nearly as strictly literal and their political views vary much more widely. Either way, this thread was started as a general philosophical question and was not meant to address any political contraversies. I think the philosophical question is interesting enough on its own.\n \nThat concept is also related to the foundation of the U.S. government. In the current culture war in the U.S. those long past beliefs are irrelevant. \n\n Again, this thread was not meant to address the culture war or political issues. It was meant as a general philosophical issue to discuss. \n \nIt was defined like that in the 18th century when U.S. foundations were laid. I'm no expert on Christian history, but as far as I know the Bible wasn't even translated into English until the 16th century. (King James) It makes sense that important discoveries about Christianity weren't discovered until only a few centuries ago. Bible scholars like Martin Luther and many others made significant contributions. I think it makes sense - just because discoveries about Christianity weren't made immediately after the Bible was written, doesn't mean they weren't there all along.\n\n The recent discoveries were not made because of the Bible being translated into English. It was already known for centuries that the council of Niceae strictly limited Christian belief, rejecting many earlier beliefs. The recent decades have revealed archeological finds of buried, decaying texts from those early times, as well as more efforts at independent scholarly research to find out about the origins of scripture based on archeology, comparative analysis, etc. These efforts in independent scholarship and archeology really only started around the 19th century and took off more in the 20th - relatively recent times. \n \n Either way, if you take a look at Gnostic beliefs (where the Gnostics were one of the most prominent Christian beliefs in early Christianity, after proto-orthodox), then you will see how very different they are from our current belief systems in Christianity. Here is a link: Gnosticism - Wikipedia, the free encyclopedia (where you could also look at their section on Gnosticism and Christianity - i.e. the beliefs in Jesus held by the Gnostics). Gnostics believed that humans are divine souls trapped in a material world created by an imperfect god, the demiurge, associated with the God of Abraham (which is also the God of Christianity). Gnostic beliefs themselves varied widely. From that link:\" Jesus of Nazareth is identified by some Gnostic sects as an embodiment of the supreme being who became incarnate to bring gn&#333;sis to the earth. In others (e.g. the Notzrim and Mandaeans) he is considered a m\u009aiha kdaba or \"false messiah\" who perverted the teachings entrusted to him by John the Baptist. \" Also, the fairly recently unearthed Gospel of Thomas was associated with the Gnostic version of Christianity. The bottom line is that this is one example of a Christian belief that once existed that was detroyed due to the politics of the Council of Nicaea and whose beliefs were very different than the range of beliefs that Christians currently hold.", 
   {}, 
   371869, 
   null, 
   1254245880.0
  ], 
  [
   371916, 
   null, 
   "Easyrider", 
   "\n Also, the fairly recently unearthed Gospel of Thomas was associated with the Gnostic version of Christianity. The bottom line is that this is one example of a Christian belief that once existed that was detroyed due to the politics of the Council of Nicaea and whose beliefs were very different than the range of beliefs that Christians currently hold.\n\n \n Gnosticism was not mainstream Christianity. The Bible holds that God became flesh in the person of Jesus Christ (John chapter 1, etc.). Gnosticism denies this is possible.\n \n The Gospel of Thomas is 2nd century redacted gnosticism. The original 4 Gospels (Matthew, Mark, Luke and John) are all argued to have been written by 95 AD.\n \n The Council of Nicea confirmed Biblical truths, as opposed to rejecting them.", 
   {}, 
   371908, 
   null, 
   1254252960.0
  ], 
  [
   371918, 
   null, 
   "Another opinion", 
   "Even though this sounds like a psychological crutch, I can't discount the idea that many people indeed feel the need to have this belief in an invisible guide/partner. And since they might want to personify this idea, they might as well refer to it as God. Personally I disagree with this idea, and I think people would be short-changing themselves if they never realize that the wisdom to make decisions was there's all along, and they should take responsibility for the good and bad choices they make. \n \n Very true. It boils down to ones decision to believe, and their own personal feeling of justification for doing so. At the same time, a person in that position would probably have a hard time justifying to someone else to adopt their idea of god based on this. Rather than masses of organized religion, belief in God would be based on isolated personal situations. Perhaps the concept of God would completely fade away eventually.\n\n I think that one has to see that there are certain psychological needs that many religions, whether actually real or not, address better than does purely secular thought and that is why I would guess that religion of some sort will take a very long time to disappear and might indeed last indefinitely. Some of religion's answers to these psychological needs may indeed be a crutch but not a complete one. For example, one psychological advantage of religion is in letting people get a sense that God might be helping in directing their lives - something that gives them more confidence in a direction that they choose to pursue. However, just because they feel that God is helping to guide them doesn't mean that they don't recognize that they also need to be proactive - thus the expression \"God helps those who help themselves\". Also, another psychological advanatage of certain religious beliefs is a sense of cosmic justice attributed to those guilty parties that never suffer justice here on earth. That sense of cosmic justice is very sattisfying to those who have been wronged or exploited - which constitutes the great majority of the people of the world, to a larger or smaller extent. However, that doesn't mean that they themselves will not also try to pursue justice here on earth. \n \n Both of these issues are issues that are hard for a purely secular world to fully address. However, there is another psychologically beneficial aspect of religion that the secular world could address but is doing a relatively poor job of doing. Namely, many people go to religion for a sense of community and support - especially those people who are facing grave problems in their lives. This has drawn many converts to religion - especially the more fundamentalist religions that reach out their hands to such people in trouble. The secular world could help stem that flow by being much more welcoming to such marginalized people.", 
   {}, 
   371871, 
   null, 
   1254253620.0
  ], 
  [
   371922, 
   null, 
   "Another opinion", 
   "Gnosticism was not mainstream Christianity. The Bible holds that God became flesh in the person of Jesus Christ (John chapter 1, etc.). Gnosticism denies this is possible.\n \n The Gospel of Thomas is 2nd century redacted gnosticism. The original 4 Gospels (Matthew, Mark, Luke and John) are all argued to have been written by 95 AD.\n \n The Council of Nicea confirmed Biblical truths, as opposed to rejecting them.\n\n The Council of Niceae was simply composed of human beings making decisions based both on the politics of the time, their own personal views and preferences and, hopefully, some divine inspiration. One can make the claim, as you do, that the council \"confirmed Biblical truths\" but we have no way of knowing that for sure. We would have to have complete confidence that those men had it right in rejecting alternate Christian beliefs such as Gnosticism.\n \n You may take a leap of faith yourself in holding such complete confidence in the conclusions of the Council of Niceae. I, on the other hand, see no reason to be confident in their conclusions - especially given millenia of church history where so many church officials were shown to be corrupt. With so much bad mixed in with the good, it is hard to disentagle all of the bad or incorrect influence to get to the pure true origin. So, since we cannot be sure either way, I see little problem with people picking and choosing what they choose to believe from Christianity. Either way, we have to make a guess (i.e. a leap of faith in some chosen direction) or, for atheists and agnostics, no leap at all.", 
   {}, 
   371916, 
   null, 
   1254254220.0
  ], 
  [
   371938, 
   null, 
   "Easyrider", 
   "The Council of Niceae was simply composed of human beings making decisions based both on the politics of the time, their own personal views and preferences and, hopefully, some divine inspiration. One can make the claim, as you do, that the council \"confirmed Biblical truths\" but we have no way of knowing that for sure.\n\n \n I think we do since the Nicean Creed matches what we find in the earliest 1st Century scriptures.", 
   {}, 
   371922, 
   null, 
   1254263820.0
  ], 
  [
   371942, 
   null, 
   "Another opinion", 
   "I think we do since the Nicean Creed matches what we find in the earliest 1st Century scriptures.\n\n \"Mainstream\" Christianity only emerges after the Council of Nicea - which ultimately led to the other Christian beliefs being rejected and any trace of them destroyed. Even the Gospel of Thomas that was found seems to have been deliberately hidden. So, it is not surprising that most writings that we do know of from that early time were just the gospels that were allowed to survive because they were of the accepted version of Christianity. Any others would have had a high chance of being purposely destroyed as heresy - especially given all the centuries during which they would have remained heretical. Either way, Gnostics (only one of many heretical creeds) apparently did not believe in writing down their religious views since they viewed physical existence as impure and that writing them down would befowl the views. \n \n There is a good web site that summarizes much of early Christian history and debunks the myth of Christianity starting only from one pure source. There were many early versions of Christianity. It is worth a glance: Early Christian History Home Page\n \n Anyway, whatever you might think of these early Christian beliefs, they do demonstrate my main point that Christian beliefs of Christianity's earliest phases varied much more widely than they do today. So, Christianity also once encompased beliefs in an imperfect God, as well as beliefs that Jesus was not divine but God's perfect human creation. Which particular belief is right, if any, is an argument that we might never be able to answer since the evidence is so very limited from that time.", 
   {}, 
   371938, 
   null, 
   1254267060.0
  ], 
  [
   371945, 
   null, 
   "Easyrider", 
   " \"Mainstream\" Christianity only emerges after the Council of Nicea -\n\n \n I submit the basic teachings of Christianity were what was mainstream since the get-go, as evidenced in what Christ, the Apostles, and Paul taught. \n \n \n\n Even the Gospel of Thomas that was found seems to have been deliberately hidden.\n\n \n I've never heard that one before. Is that a theory or do you have some evidence to bolster that? In all appearances it appears to be a redacted 2nd century work. No one in the first century ever wrote about it to my knowledge.\n \n \nThere is a good web site that summarizes much of early Christian history and debunks the myth of Christianity starting only from one pure source. There were many early versions of Christianity. It is worth a glance: Early Christian History Home Page\n\n \n I reviewed some of those articles and it looks like something the liberal Bishop Spong would have embraced. I call it suspect liberal scholarship with a very small \"s\". One of the articles had this statement:\n \n \"The Trinity concept did exist as a tentative or nebulous idea in the heads of some early Christian writers, but was never laid out specifically until the middle of the 4th century.\"\n \n \"...never laid out specifically until the middle of the 4th century...?\" The New Testament, as well as supporting scriptures from the OT, are full of examples of the Trinity. What's more, you have a number of early Trinitarian quotes from various sources (before Nicea) that clearly speak about the Trinity. The following link has some of them:\n \n Early Trinitarian Quotes:\n \n Early Trinitarian Quotes | Christian Apologetics & Research Ministry\n \n After a number of Trinity quotes from early Christian leaders, we have the following:\n \n \"If, as the anti-Trinitarians maintain, the Trinity is not a biblical doctrine and was never taught until the council of Nicea in 325, then why do these quotes exist? The answer is simple: the Trinity is a biblical doctrine and it was taught before the council of Nicea in 325 A.D.\n \n Part of the reason that the Trinity doctrine was not \"officially\" taught until the time of the Council of Nicea is because Christianity was illegal until shortly before the council. It wasn't really possible for official Christian groups to meet and discuss doctrine. For the most part, they were fearful of making public pronouncements concerning their faith.\n \n Additionally, if a group had attacked the person of Adam, the early church would have responded with an official doctrine of who Adam was. As it was, the person of Christ was attacked. When the Church defended the deity of Christ, the doctrine of the Trinity was further defined.\"\n \n There was also an article questioning whether there was ever an actual Jesus. I don't find those arguments the least bit credible. \n \n \nAnyway, whatever you might think of these early Christian beliefs, they do demonstrate my main point that Christian beliefs of Christianity's earliest phases varied much more widely than they do today. So, Christianity also once encompased beliefs in an imperfect God, as well as beliefs that Jesus was not divine but God's perfect human creation. Which particular belief is right, if any, is an argument that we might never be able to answer since the evidence is so very limited from that time.\n\n \n Well you're right about one thing - there were always some screwball sects around who either always questioned the historical Jesus, or who mixed paganism in with Biblical Christianity, including the gnostics. But there was also the real thing all along. A resurrected Jesus is the Occam's Razor that best fits the NT scenarios.", 
   {}, 
   371942, 
   null, 
   1254273420.0
  ], 
  [
   371952, 
   null, 
   "unkerpaulie", 
   "I think we do since the Nicean Creed matches what we find in the earliest 1st Century scriptures.\n\n The earliest christian scriptures that you have access to. Don't you see that the scriptures are in accord with the nicean idealogy because its the nicean council that allowed them to be part of the scriptures? Arguing that the bible is correct because the nicean council's doctrine was the mainstream one, and the modern christianity was the correct version because its based on the bible, is classical circular reasoning at its finest.", 
   {}, 
   371938, 
   null, 
   1254281040.0
  ], 
  [
   371955, 
   null, 
   "unkerpaulie", 
   "I think that one has to see that there are certain psychological needs that many religions, whether actually real or not, address better than does purely secular thought and that is why I would guess that religion of some sort will take a very long time to disappear and might indeed last indefinitely. Some of religion's answers to these psychological needs may indeed be a crutch but not a complete one. For example, one psychological advantage of religion is in letting people get a sense that God might be helping in directing their lives - something that gives them more confidence in a direction that they choose to pursue. However, just because they feel that God is helping to guide them doesn't mean that they don't recognize that they also need to be proactive - thus the expression \"God helps those who help themselves\". Also, another psychological advanatage of certain religious beliefs is a sense of cosmic justice attributed to those guilty parties that never suffer justice here on earth. That sense of cosmic justice is very sattisfying to those who have been wronged or exploited - which constitutes the great majority of the people of the world, to a larger or smaller extent. However, that doesn't mean that they themselves will not also try to pursue justice here on earth. \n \n Both of these issues are issues that are hard for a purely secular world to fully address. \n\n I think its not that difficult to address these issues. Its called taking responsibility. A secular viewpoint espouses the laws of nature, particularly \"survival of the fittest\". When one takes the position of being dependent on the guidance of a god, they give themselves an excuse to adopt a passive stance, or to withdraw themselves from the consequences of their actions or inactions. Similarly with the idea of divine justice, or with the hope of being reunited with loved ones, or any other popular religious ideal that allows one to detach themselves from reality rather than taking up the challenge of taking life head on and dealing with the bad and good from an autonomous proactive stance. \n \n In a way, maybe we could look at dependence on these beliefs as a survival mechanism in an of itself. I feel, however, that people who must depend on detaching themselves from reality in order to survive are not using their full potential. It isn't necessary to feel that you can't deal with life's issues indepedently. You can. People do it all the time. You become a lot more in tune with opportunities and obstacles when you recognize that noone else can take the glory or the blame for the way you react to life than yourself. \n \n \nHowever, there is another psychologically beneficial aspect of religion that the secular world could address but is doing a relatively poor job of doing. Namely, many people go to religion for a sense of community and support - especially those people who are facing grave problems in their lives. This has drawn many converts to religion - especially the more fundamentalist religions that reach out their hands to such people in trouble. The secular world could help stem that flow by being much more welcoming to such marginalized people.\n\n That I agree with. Even though I just ranted on about independence in action, belonging to and acceptance in a social group is a basic human need. Many people are not cut out for, or willing to, be the leader of their own group, so they follow already existing groups, looking for acceptance. Religious groups are usually very accomodating to people who are looking for acceptance. \n \n The thing is, imo, religion actually propogates this sort of dependency from its onset. It rewards people for adopting a follower mentality, and feeds off this lack of autonomy in its members for its own survival. Whereas, if more people realized how beneficial being independent was, religion wouldn't be needed at all.", 
   {}, 
   371918, 
   null, 
   1254282540.0
  ], 
  [
   371962, 
   null, 
   "Easyrider", 
   "The earliest christian scriptures that you have access to. Don't you see that the scriptures are in accord with the nicean idealogy because its the nicean council that allowed them to be part of the scriptures? Arguing that the bible is correct because the nicean council's doctrine was the mainstream one, and the modern christianity was the correct version because its based on the bible, is classical circular reasoning at its finest.\n\n \n That's your opinion, which is uninspired.\n \n Is the New Testament also Scripture?\n \n It should go without saying that the New Testament is also Scripture. The early church (before Nicea - EZ) recognized the New Testament documents as being authentic and inspired and included them in the canon of Scripture along with the Old Testament. In fact, Paul recognized the authority that his words had in the church. Take for example what he said to the Colossians.\n \n Col. 4:16, \"And when this letter is read among you, have it also read in the church of the Laodiceans; and you, for your part read my letter that is coming from Laodicea.\"1\n \n Likewise, Peter made an interesting comment about Paul's writings when he said,\n \n \"as also in all his letters, speaking in them of these things, in which are some things hard to understand, which the untaught and unstable distort, as they do also the rest of the Scriptures, to their own destruction,\" (2 Pet. 3:16).\n \n Peter called Paul's writings Scripture. In turn, Paul called Scriptures \"God-breathed,\" and Jesus said the Scriptures cannot fail.\n \n The Bible isn't the word of God. It contains the word of God | Christian Apologetics & Research Ministry\n \n The fact is that the original NT writings were already in place and being taught to the church BEFORE Nicea.", 
   {}, 
   371952, 
   null, 
   1254317040.0
  ], 
  [
   371972, 
   null, 
   "trebor", 
   "That's your opinion, which is uninspired.\n \n Is the New Testament also Scripture?\n \n It should go without saying that the New Testament is also Scripture. The early church (before Nicea - EZ) recognized the New Testament documents as being authentic and inspired and included them in the canon of Scripture along with the Old Testament. In fact, Paul recognized the authority that his words had in the church. Take for example what he said to the Colossians.\n \n Col. 4:16, \"And when this letter is read among you, have it also read in the church of the Laodiceans; and you, for your part read my letter that is coming from Laodicea.\"1\n \n Likewise, Peter made an interesting comment about Paul's writings when he said,\n \n \"as also in all his letters, speaking in them of these things, in which are some things hard to understand, which the untaught and unstable distort, as they do also the rest of the Scriptures, to their own destruction,\" (2 Pet. 3:16).\n \n Peter called Paul's writings Scripture. In turn, Paul called Scriptures \"God-breathed,\" and Jesus said the Scriptures cannot fail.\n \n The Bible isn't the word of God. It contains the word of God | Christian Apologetics & Research Ministry\n \n The fact is that the original NT writings were already in place and being taught to the church BEFORE Nicea.\n\n \n Boy oh boy, do we have circular reasoning here. The bible says that the bible is scripture, and scripture never lies, because it says in the bible that Peter said blah blah blah.\n \n Of course, it's all a lie, and for that matter, the 'god breathed' is one of the pastorals, which means it is falsely claiming to be by Paul.. i.e. one big lie.", 
   {}, 
   371962, 
   null, 
   1254326700.0
  ], 
  [
   372045, 
   null, 
   "Easyrider", 
   "Boy oh boy, do we have circular reasoning here. The bible says that the bible is scripture, and scripture never lies, because it says in the bible that Peter said blah blah blah.\n \n \n\n \n <Flush<\n \n It's not circular reasoning if it's the truth. So you lose again.", 
   {}, 
   371972, 
   null, 
   1254351420.0
  ], 
  [
   372050, 
   null, 
   "obvious_child", 
   "<Flush<\n \n It's not circular reasoning if it's the truth. So you lose again.\n\n \n If I get to decide what is Canon, why can't I decide what isn't scripture? And if I can decide what is and is not scripture, why can't I exclude whatever I wish and call it not scripture? \n \n You don't seem to understand how Canon was decided. That is why you lose again. \n \n Education:\n Begging the question - Wikipedia, the free encyclopedia", 
   {}, 
   372045, 
   null, 
   1254351840.0
  ], 
  [
   372051, 
   null, 
   "unkerpaulie", 
   "Easyrider, don't you see that the letters from Paul and the gospels were only a few of possibly hundreds of documents that were circulated throughout the early churches? There was no such thing as a new testament when the christian church began. The ones that were picked by the council were the ones that meshed with their personal religious preferences, and not necessarily what was the prominent doctrine of the original christian churches. Plus, like AO pointed out, because christianity was very underground before Rome adopted it, there really was no such thing as \"mainstream christianity\".", 
   {}, 
   371972, 
   null, 
   1254351840.0
  ], 
  [
   372090, 
   null, 
   "Another opinion", 
   "I submit the basic teachings of Christianity were what was mainstream since the get-go, as evidenced in what Christ, the Apostles, and Paul taught. \n\n This just means that you have chosen to take the leap of faith in fully trusting that the Council of Niceae had it right in choosing the proto-orthodox as the official faith of Christianity (proto-orthodox is the name by which the sect is called that eventually became the mainstream Christian belief). As for the evidence, since it was the texts of the proto-orthodox that survived (since they did not suffer centuries of persecution as herecies), then it is natural to assume that those are the only teachings of Christ and the apostles and that those sayings were true. The Gospel of Thomas, that has relatively recently been unearther, shows that early Christians attributed many other teachings to Jesus as well. You only choose to discount those because of your leap of faith in the divine inspiration of the men of the Council of Niceae. I choose not to take that same leap of faith without strong evidence.\n \nI've never heard that one before. Is that a theory or do you have some evidence to bolster that? In all appearances it appears to be a redacted 2nd century work. No one in the first century ever wrote about it to my knowledge.\n\n Unless you question this as a source, Wikipedia has a nice article about the Nag Hammati texts (the ones that contain the Gnostics texts - including the Gospel of Thomas) - from Nag Hammadi library - Wikipedia, the free encyclopedia :\n \nThe Nag Hammadi library (popularly known as The Gnostic Gospels) is a collection of early Christian Gnostic texts discovered near the Upper Egyptian town of Nag Hammadi in 1945. That year, twelve leather-bound papyrus codices buried in a sealed jar were found by a local peasant named Mohammed Ali Samman.[1][2] The writings in these codices comprised fifty-two mostly Gnostic tractates (treatises), but they also include three works belonging to the Corpus Hermeticum and a partial translation / alteration of Plato's Republic. In his \"Introduction\" to The Nag Hammadi Library in English, James Robinson suggests that these codices may have belonged to a nearby Pachomian monastery, and were buried after Bishop Athanasius condemned the uncritical use of non-canonical books in his Festal Letter of 367 AD.\n\n So the texts were buried in sealed jars at around the time when the local bishop outlawed non-mainstream texts.\n \nI reviewed some of those articles and it looks like something the liberal Bishop Spong would have embraced. I call it suspect liberal scholarship with a very small \"s\". One of the articles had this statement:\n \n \"The Trinity concept did exist as a tentative or nebulous idea in the heads of some early Christian writers, but was never laid out specifically until the middle of the 4th century.\"\n \n \"...never laid out specifically until the middle of the 4th century...?\" The New Testament, as well as supporting scriptures from the OT, are full of examples of the Trinity. What's more, you have a number of early Trinitarian quotes from various sources (before Nicea) that clearly speak about the Trinity. The following link has some of them:\n \n Early Trinitarian Quotes:\n \n Early Trinitarian Quotes | Christian Apologetics & Research Ministry\n \n After a number of Trinity quotes from early Christian leaders, we have the following:\n \n \"If, as the anti-Trinitarians maintain, the Trinity is not a biblical doctrine and was never taught until the council of Nicea in 325, then why do these quotes exist? The answer is simple: the Trinity is a biblical doctrine and it was taught before the council of Nicea in 325 A.D.\n \n Part of the reason that the Trinity doctrine was not \"officially\" taught until the time of the Council of Nicea is because Christianity was illegal until shortly before the council. It wasn't really possible for official Christian groups to meet and discuss doctrine. For the most part, they were fearful of making public pronouncements concerning their faith.\n \n Additionally, if a group had attacked the person of Adam, the early church would have responded with an official doctrine of who Adam was. As it was, the person of Christ was attacked. When the Church defended the deity of Christ, the doctrine of the Trinity was further defined.\"\n \n There was also an article questioning whether there was ever an actual Jesus. I don't find those arguments the least bit credible. \n\n Given your strong faith in the validity of the texts which became the New Testament and the invalidity of the other sexts that competed with the proto-orthodox prior to the Council of Niceae, I am not surprised that you hold these views. Again, there was no \"official\" church doctrine until the Nicene Council. For one, as your quoted article says, the illegality of Christianity within the Roman Empire made it difficult to maintain official doctrine when meetings to discuss such doctrine would have been illegal. Also, there were still questions on how to interpret the main doctrine - which included questions about the trinity. One of the main goals of the Council of Niceae was to iron out those differences about views of the trinity to come to some conclusion.\n \n This article tries to present all sides of the issue so it mentions a wide range of theories, including theories that Jesus did not exist. Since most of the web site talks about different versions of Christianity, then it is hard to argue that the author has made up his mind that Jesus did not exist - that was only one theory held by some scholars that the author felt compeled to mention in order to summarize the range of scholarly opinion.\n \n I have not read every linked section of the web page, but those sections which I have read have coincided well with other sources I have accessed on early Christianity (including an interesting \"Teaching Company\" course which I bought on the subject, and which I recommend). It is a web site meant to lay out all the facts, not to come to any conclusions based on faith. The only complaint I myself have against it is that I would have preferred if he had referrenced his sources not as one big list in a separate link but point-by-point within his essays themselves. It makes it harder to ascertain where he got the information from on a particular point.\n \nWell you're right about one thing - there were always some screwball sects around who either always questioned the historical Jesus, or who mixed paganism in with Biblical Christianity, including the gnostics. But there was also the real thing all along. A resurrected Jesus is the Occam's Razor that best fits the NT scenarios.\n\n Again, the NT texts were the ones that were chosen for survival by the Nicene Council so, of course, current religious dogma of Christ's resurrection would be consistent with the only texts allowed to survive. However, even when examining the official scriptures, there are large differences between the approaches that Mark's gospel has toward Jesus (where he is called the Son of Man, not the Son of God, for example) and that of John (on which much of mainstream theology relies). Since the Gospel of Mark was written much earlier than the Gospel of John, Mark would seem more authentic and less vulnerable to the distortions that happen to stories over time.", 
   {}, 
   371945, 
   null, 
   1254356760.0
  ], 
  [
   372091, 
   null, 
   "Another opinion", 
   "I think its not that difficult to address these issues. Its called taking responsibility. A secular viewpoint espouses the laws of nature, particularly \"survival of the fittest\". When one takes the position of being dependent on the guidance of a god, they give themselves an excuse to adopt a passive stance, or to withdraw themselves from the consequences of their actions or inactions. Similarly with the idea of divine justice, or with the hope of being reunited with loved ones, or any other popular religious ideal that allows one to detach themselves from reality rather than taking up the challenge of taking life head on and dealing with the bad and good from an autonomous proactive stance. \n \n In a way, maybe we could look at dependence on these beliefs as a survival mechanism in an of itself. I feel, however, that people who must depend on detaching themselves from reality in order to survive are not using their full potential. It isn't necessary to feel that you can't deal with life's issues indepedently. You can. People do it all the time. You become a lot more in tune with opportunities and obstacles when you recognize that noone else can take the glory or the blame for the way you react to life than yourself. \n\n I would agree that at least some non-insignificant fraction of religious people do use belief as a full crutch that keeps them from taking more proactive direct action in their lives. It reminds me of the movie \"Laurence of Arabia\" where Laurence ends up saving the life of an Arab soldier that disappeared during their crossing of the desert despite all the earlier protestations of the other soldiers that such effort was not worth it since \"it is written\" that the lost soldier will die. I liked Laurence's line that \"Nothing is written\" (i.e. nothing is pre-determined). He was fighting the very crutch-type reasoning that you argue against.\n \n However, I think that you are overly pessimistic in thinking that religious belief automatically forces people to lose that sense of action and fully rely on religion as a crutch. I would say that most people do take responsible action in their lives and don't let themselves be pushed around, despite their religious beliefs. In some cases, it is the very religious beliefs that let them gain the psychological strength necessary to overcome their adversities. Remember, not everyone is capable of being inherently psychologically strong. Many people need the psychological boost that religion can give them.\n \nThat I agree with. Even though I just ranted on about independence in action, belonging to and acceptance in a social group is a basic human need. Many people are not cut out for, or willing to, be the leader of their own group, so they follow already existing groups, looking for acceptance. Religious groups are usually very accomodating to people who are looking for acceptance. \n \n The thing is, imo, religion actually propogates this sort of dependency from its onset. It rewards people for adopting a follower mentality, and feeds off this lack of autonomy in its members for its own survival. Whereas, if more people realized how beneficial being independent was, religion wouldn't be needed at all.\n\n Yes, religion does mostly propogate a follower mentality (with some exceptions) but that is better than letting the troubled person sink into depths of depression. Many people are simply not inherently strong enough to be as independent as you would like them to be - especially if they have gone through a lot of difficulties in life. I think we both agree that the secular world should take a more active role in helping such people get back on their feet - both psychologically and practically.", 
   {}, 
   371955, 
   null, 
   1254357420.0
  ], 
  [
   372203, 
   null, 
   "marc9000", 
   "Most of the prominent religions of the world either hold monotheistic beliefs in an omnipotent creator God (mainstream Christianity, Islam, Judeism, etc.) or have polytheistic beliefs where some gods are involved in creation and some are not (Hinduism). There are very few religions that have no belief in supernatural creations and, from the examples that I have heard, those tend to be more alternative - ex. Wikka - so they might not espouse conservative beliefs. You should also keep in mind that Christians hold various views on God's role in creation - some holding to a strict literal interpretation of the Bible and its Genesis story, while others interpret it more symbolically (apparently so do most Biblical scholars) in a way that allows for beliefs such as theistic evolution. \n\n \n There are a wide range of views concerning Christian behavior, but I don't think the range is near that wide when the subject is creation - I don't think there is a strict literal, a not-so-strick-literal, a non-strict-literal, etc. Either one believes in creation or one does not. Either God was bound by scientific laws, or he was not bound by them. I don't think the views are \"various\". And I don't think \"most Biblical scholars\" believe in a limited God that was restricted by scientific laws. Anyone can call themself a Biblical scholar. \n \n \nEither way, believing in God and His involvement at some level in creation does by no means mean that those believers will have conservative political views. \n\n \n Disagree, there are exceptions to every rule of course, but I think it's the rule. It all stems from this phrase; \"....that all men are created equal, that they are endowed by their creator with certain unalienable rights.....\"\n \n No creator, no unalienable rights - simple. And the political views take off in different directions from there. 'Big government Christianity' is not a noteable political force, as isn't 'limited government atheism'. \n \n \n The only thing I would agree to there is that those that have very strict literal interpretations of the Bible, including literal interpretations of Genesis, would tend to be more conservative. However, many (possibly most) Christians don't hold views of creation that are nearly as strictly literal and their political views vary much more widely. Either way, this thread was started as a general philosophical question and was not meant to address any political contraversies. I think the philosophical question is interesting enough on its own. \n \n Again, this thread was not meant to address the culture war or political issues. It was meant as a general philosophical issue to discuss. \n\n \n I don't think the philosophical question can arise without an inspiration from political thought. I think you proved it in your subsequent post #12 by speculating on when/if religion may disappear, or how people can go to religion for a sense of community comfort and support. Many people go to science, or the community of organized humanism, for comfort and support as well. It's important to always remember that there's no neutral, perfect position. People with no religion who consider themselves neutral and thoughtful, often have powerful political views. \n \n \nThe recent discoveries were not made because of the Bible being translated into English. It was already known for centuries that the council of Niceae strictly limited Christian belief, rejecting many earlier beliefs. The recent decades have revealed archeological finds of buried, decaying texts from those early times, as well as more efforts at independent scholarly research to find out about the origins of scripture based on archeology, comparative analysis, etc. These efforts in independent scholarship and archeology really only started around the 19th century and took off more in the 20th - relatively recent times. \n \n Either way, if you take a look at Gnostic beliefs (where the Gnostics were one of the most prominent Christian beliefs in early Christianity, after proto-orthodox), then you will see how very different they are from our current belief systems in Christianity. Here is a link: Gnosticism - Wikipedia, the free encyclopedia (where you could also look at their section on Gnosticism and Christianity - i.e. the beliefs in Jesus held by the Gnostics). Gnostics believed that humans are divine souls trapped in a material world created by an imperfect god, the demiurge, associated with the God of Abraham (which is also the God of Christianity). Gnostic beliefs themselves varied widely. From that link:\" Jesus of Nazareth is identified by some Gnostic sects as an embodiment of the supreme being who became incarnate to bring gn&#333;sis to the earth. In others (e.g. the Notzrim and Mandaeans) he is considered a m\u009aiha kdaba or \"false messiah\" who perverted the teachings entrusted to him by John the Baptist. \" Also, the fairly recently unearthed Gospel of Thomas was associated with the Gnostic version of Christianity. The bottom line is that this is one example of a Christian belief that once existed that was detroyed due to the politics of the Council of Nicaea and whose beliefs were very different than the range of beliefs that Christians currently hold.\n\n \n I think the basics have always been there, and the current ones have stood the test of time.", 
   {}, 
   371908, 
   null, 
   1254448320.0
  ], 
  [
   372204, 
   null, 
   "marc9000", 
   "The thing is, imo, religion actually propogates this sort of dependency from its onset. It rewards people for adopting a follower mentality, and feeds off this lack of autonomy in its members for its own survival. Whereas, if more people realized how beneficial being independent was, religion wouldn't be needed at all. \n\n \n \nYes, religion does mostly propogate a follower mentality (with some exceptions) but that is better than letting the troubled person sink into depths of depression. Many people are simply not inherently strong enough to be as independent as you would like them to be - especially if they have gone through a lot of difficulties in life. I think we both agree that the secular world should take a more active role in helping such people get back on their feet - both psychologically and practically. \n\n \n Uh, are you guys telling me there is no follower mentality in science/atheism? :p", 
   {}, 
   372203, 
   null, 
   1254448740.0
  ], 
  [
   372210, 
   null, 
   "Archangel", 
   "There are many beliefs in God and the supernatural that seem to be constant over a wide range of religions. These are assumptions that are often so taken for granted that they are rarely ever considered. I would like to bring up a couple here for discussion to see what people think...\n \n 1) Assumption: Belief in God necessarily includes a belief that God created Man and the Universe. Many earlier religions included gods that had no role in creation and I have heard that there are some minor religions that do not espouse supernatural creation stories. Why do we feel that, in order to properly believe in God, we need to believe the He created Man and the universe? How would it affect our view of God if we no longer believed in creation?\n \n 2) Assumption: God is omnipotent, or at least powerful enough to be able to carry out anything which He wills. How would it change our view of God if God had limitations in that there were things which He wills, but cannot achieve? This is a question independent of the question of free will for people - since traditional belief in God says that He wants us to practice free will and, therefore, limits His actions by His own choice to let us make our own mistakes.\n \n So, what are your views in \"thinking outside the box\" about these assumptions we make about God?\n\n \n We christians take for granted that God created the heavens/universe and the earth because He said He did in His word. And we accept that He is omnipotent, omniscient and omnipresent because His word says he is. Just as you believe by faith the principles of atheism or secular humanism with a bent toward accepting evolution as the process by which you came to be here, so do we accept by faith that our God is capable of accomplishing these feats.", 
   {}, 
   371441, 
   null, 
   1254458100.0
  ], 
  [
   372221, 
   null, 
   "Jo Bennett", 
   "\n \n Disagree, there are exceptions to every rule of course, but I think it's the rule. It all stems from this phrase; \"....that all men are created equal, that they are endowed by their creator with certain unalienable rights.....\"\n \n No creator, no unalienable rights - simple. And the political views take off in different directions from there. 'Big government Christianity' is not a noteable political force, as isn't 'limited government atheism'. \n \n\n \n Of course, the US constitution is the basis of political thought everywhere. emoticon_rolleyes In fact Christianity and socialism go together pretty well everywhere except the US. The UK Labour Party famously \"owed as much to Methodism as to Marxism\". It was Christians who led the jubilee debt campaign, who started the trade justice movement, who were key in the Make Poverty History campaign. That's before we even start on Liberation Theology. Free markets are anathema to the beliefs of most Christians.", 
   {}, 
   372203, 
   null, 
   1254464340.0
  ], 
  [
   372272, 
   null, 
   "Easyrider", 
   " Free markets are anathema to the beliefs of most Christians.\n\n \n The only so-called 'Christians' I've seen who don't like free-market capitalism are the Obama style socialists from the liberal left.", 
   {}, 
   372221, 
   null, 
   1254519000.0
  ], 
  [
   372275, 
   null, 
   "Jo Bennett", 
   "The only so-called 'Christians' I've seen who don't like free-market capitalism are the Obama style socialists from the liberal left.\n\n \n That's because you live in America. American Christianity has little do with Christianity in the rest of the world.", 
   {}, 
   372272, 
   null, 
   1254521040.0
  ], 
  [
   372278, 
   null, 
   "Art Pigou", 
   "The ones that were picked by the council were the ones that meshed with their personal religious preferences, and not necessarily what was the prominent doctrine of the original christian churches.\n\n \n \"Picked by the council\"?", 
   {}, 
   372051, 
   null, 
   1254523320.0
  ], 
  [
   372672, 
   null, 
   "marc9000", 
   "Of course, the US constitution is the basis of political thought everywhere. emoticon_rolleyes \n\n \n I refer to that statement of Jefferson's only because of what it says, not because of it's connection to the U.S. foundings. It's easier to see political divides based on belief/non-belief of creation, far more than a basis of Christianity/non-Christianity. \n \n \nIn fact Christianity and socialism go together pretty well everywhere except the US. \n\n \n Do most Christians outside the U.S. not believe in creation? If so, your claim makes sense. \n \n \nThe UK Labour Party famously \"owed as much to Methodism as to Marxism\". It was Christians who led the jubilee debt campaign, who started the trade justice movement, who were key in the Make Poverty History campaign. That's before we even start on Liberation Theology. Free markets are anathema to the beliefs of most Christians.\n\n \n I'd like to see a discussion on that, perhaps another thread. Not so much to participate in, but to see a condensation of others research on it, which I don't really have time for. It seems to me that the free will that people have to reject or accept Christ would go along with the free will people have (should have) to determine what to produce/what to buy, in free markets. A society without free markets requires a lot of involvement from \"Ceasar\". I don't see detailed guidelines in the Bible outlining what Ceasar should do, or what his qualifications should be.", 
   {}, 
   372221, 
   null, 
   1254706260.0
  ], 
  [
   372695, 
   null, 
   "Jo Bennett", 
   "We do see in the New Testament detailed descriptions of how a Christian community should live - and it is collective in nature. The Apostles took from the wealthy to provide for the poor.", 
   {}, 
   372672, 
   null, 
   1254722820.0
  ], 
  [
   372728, 
   null, 
   "Another opinion", 
   "There are a wide range of views concerning Christian behavior, but I don't think the range is near that wide when the subject is creation - I don't think there is a strict literal, a not-so-strick-literal, a non-strict-literal, etc. Either one believes in creation or one does not. Either God was bound by scientific laws, or he was not bound by them. I don't think the views are \"various\". And I don't think \"most Biblical scholars\" believe in a limited God that was restricted by scientific laws. Anyone can call themself a Biblical scholar.\n\n Recent Gallup polls show that 77% of Americans self-identify themselves as Christian (from This Easter, Smaller Percentage of Americans Are Christian ). However, Gallup polls and other polls show that it is only a minority of Americans that believe that God created man in his present form within the last 10,000 years. At least half of Americans espouse Evolution of some form - either purely secular Evolution or, more commonly, essentially theistic Evolution which is Evolution viewed as being guided by God. From Science and Nature (reformatted since column alignment is not easily implemented in 4forums.com):\n \nGallup Poll. May 8-11, 2008. N=1,017 adults nationwide. MoE ± 3.\n \n \"Which of the following statements comes closest to your views on the origin and development of human beings? (1) Human beings have developed over millions of years from less advanced forms of life, but God guided this process. (2) Human beings have developed over millions of years from less advanced forms of life, but God had no part in this process. (3) God created human beings pretty much in their present form at one time within the last 10,000 years or so.\" Options rotated 1-3, 3-1\n \n 5/8-11/08: 36% say Guided by God, 14% say God Had no Part, 44% say God Created in Present Form, 5% say Other/Unsure. \n\n These numbers are fairly constant through polls taken all the way back to 1982. Also, the same page shows the February 2009 poll that was expounded upon in the media where only 39% of the respondents say they believed in Evolution. However, what was not expounded upon in the media is that the same poll showed that 36% had no opinion either way (Evolution vs Creation). This is consistent with the idea that many people don't want to commit to purely one side or the other but try to take views that are in between - such as theistic Evolution.\n \n These polls tell me that a large number of American Christians do not interpret Genesis literally but try to find some common ground with Science and its Theory of Evolution. I am currently in discussion with jyoshu in another thread where he is just one of numerous examples of people who espouse theistic evolution.\n \nDisagree, there are exceptions to every rule of course, but I think it's the rule. It all stems from this phrase; \"....that all men are created equal, that they are endowed by their creator with certain unalienable rights.....\"\n \n No creator, no unalienable rights - simple. And the political views take off in different directions from there. 'Big government Christianity' is not a noteable political force, as isn't 'limited government atheism'. \n\n The unalienable rights is just another term for the philosophical idea of natural rights. Indeed, there were many who viewed natural rights in a religious light - i.e. that they came from God, but other philosophers had more secular approaches to the idea of natural rights. However, either way, the reason that natural (a.k.a. unalienable) rights were never included in the structure of our government (i.e. the US Constitution) but remained only a vague philosophical statement in the Declaration of Independence was that philosophers and theologians could never agree on exactly what these unalienable rights were. Certainly, the founders of this country did not agree on whether they should be applied to people of African descent. \n \n From what I understand from summaries of the Federalist Papers, where the founders essentially illucidated their thinking process behind many directions taken by government, \"All men are created equal\" meant that all men should be viewed as equal under the law. This was in reaction to their experience with the British system where nobility were privilidged in not being as subjected to the rigorous justice system as were everyday people. Our current justice may be flawed in that those who can afford good lawyers are far more likely to get off, but at least technically the laws apply equally to everyone. That was not always the case.\n \n Outside of the law, we all know that there are wide ranges of human capabilities so that a bank CEO will be treated better by his fellow human beings than a homeless man. That is an aspect of human nature that broadly cuts across all political affiliations. One reason that Democrats support large government is that they view that government can be one of the few institutions that can have the power to try to at least slightly level that playing field so that, in the ideal case, the son of the homeless man might get the same opportunities for growth (through education, etc) as might the son of the bank CEO. Government is necessary to provide him with those opportunities through help in funding, anti-discrimination laws, etc. Republicans far too often think that things can work out on their own without government intervention but they forget that it was government intervention that gave us 40 hour work week, relatively safe working conditions, safe food to eat, drugs which were monitored for safety, social security for our old age, anti-discrimination laws, etc. \n \n At this point, we have stayed pretty far from the original purpose of this thread and I am partly to blame for letting you lead us in that direction. I will be more limited in my responses on the political front after this post...\n \nI don't think the philosophical question can arise without an inspiration from political thought. I think you proved it in your subsequent post #12 by speculating on when/if religion may disappear, or how people can go to religion for a sense of community comfort and support. Many people go to science, or the community of organized humanism, for comfort and support as well. It's important to always remember that there's no neutral, perfect position. People with no religion who consider themselves neutral and thoughtful, often have powerful political views. \n\n Everyone - from the nonreligious to the religious - can have powerful political views but those don't necessarily have to be purely because of their religious views. My views of the economy, for example, have nothing to do with my religious views. There are trends in religious views vs political views in that those who are fundamentalist Christians tend to be on the political right while those who are agnostics and atheists tend to be on the political left, but even where those extremes are concerned, the alignment is not perfect. Furthermore, most Americans are neither fundamentalist Christians nor atheists or agnostics but are somewhere in the middle and their political views are far more mixed and unaligned.\n \nI think the basics have always been there, and the current ones have stood the test of time.\n\n Many of the other early Christian sects might also have stood the test of time if they had been given the same chance as the proto-orthodox (precursor to mainstream Christianity) had in terms of being the official religion of the Roman empire with all other religions persecuted. If the proto-orthodox sect had suffered the same persecution as the Gnostic sect had, then I highly doubt that it would have survived.", 
   {}, 
   372203, 
   null, 
   1254764100.0
  ], 
  [
   372729, 
   null, 
   "jyoshu", 
   "The Apostles took from the wealthy to provide for the poor.\n\n \n Actually, the scriptures say the wealthy brought the value of their voluntarily-sold possessions and laid it at the apostles' feet. And THEN they redistributed. (Acts 4:34, 35)\n \n That point doesn't need to be glossed over ...\n It was voluntary.\n NOwhere in the NT does it say a government should take and control the wealth of its citizens. Nor should Biblical examples and teaching about Christian charity be used to justify government-mandated socialism via taxation. NT teaching is not pro-govenmental-socialist. It's pro-charity on a voluntary basis.", 
   {}, 
   372695, 
   null, 
   1254764640.0
  ], 
  [
   372730, 
   null, 
   "trebor", 
   "Actually, the scriptures say the wealthy brought the value of their voluntarily-sold possessions and laid it at the apostles' feet. And THEN they redistributed. (Acts 4:34, 35)\n \n That point doesn't need to be glossed over ...\n It was voluntary.\n \n\n Seems to me that a person what mentioned in the bible getting stoned for not tithing. \n \n\n \n NOwhere in the NT does it say a government should take and control the wealth of its citizens. Nor should Biblical examples and teaching about Christian charity be used to justify government-mandated socialism via taxation. NT teaching is not pro-govenmental-socialist. It's pro-charity on a voluntary basis.\n\n [/quote]\n \n Render onto Caesars that which is Caesars.", 
   {}, 
   372729, 
   null, 
   1254766080.0
  ], 
  [
   372736, 
   null, 
   "jyoshu", 
   "Yes, but it doesn't say that Caesar is justified in preventing people from trading and making a living, and making them rely on government for subsistence instead. Capitalism is a normal state of human living. It's what happens in the absence of imposing by the government. \n \n This is a different verse than that of the issue of Christian charity. No one is saying we shouldn't pay taxes; we still have to hold a govt. by the people and for the people accountable when they OVER-tax the people.", 
   {}, 
   372730, 
   null, 
   1254767520.0
  ], 
  [
   372746, 
   null, 
   "trebor", 
   "Yes, but it doesn't say that Caesar is justified in preventing people from trading and making a living, and making them rely on government for subsistence instead. Capitalism is a normal state of human living. It's what happens in the absence of imposing by the government. \n \n This is a different verse than that of the issue of Christian charity. No one is saying we shouldn't pay taxes; we still have to hold a govt. by the people and for the people accountable when they OVER-tax the people.\n\n \n I challenge you to prove with evidence anything you are claiming.\n \n I would like to see you prove 'Capitialism is a normal state of human living' for one.\n \n You seem to make lots of statements I bet you can't back up.", 
   {}, 
   372736, 
   null, 
   1254768720.0
  ], 
  [
   372752, 
   null, 
   "jyoshu", 
   "I challenge you to prove with evidence anything you are claiming.\n \n I would like to see you prove 'Capitialism is a normal state of human living' for one.\n\n \n Come on ... it's common sense. People trade things. They buy and sell. Do you really need PROOF that such happens in society in the absence of regulation??? They create businesses that grow if they do well. People try and better themselves. \n This is what people in society DO, unless ruled by a govt. that won't let them for some reason, preferring people to rely on govt. for everything.", 
   {}, 
   372746, 
   null, 
   1254770400.0
  ], 
  [
   372758, 
   null, 
   "Jo Bennett", 
   "Come on ... it's common sense. People trade things. They buy and sell.\n\n \n Buying and selling requires currency, or at the very least an agreed upon medium of exchange. You make the usual mistake of confusing your values with universal constants. Capitalism is barely 500 years old, tribal cultures traditionally held everything in common beyond personal possessions. That is the \"natural\" way of doing things. It is also what the disciples did and what the early church did. The idea that one can own land that one neither works nor occupies is absurd.", 
   {}, 
   372752, 
   null, 
   1254771540.0
  ], 
  [
   372760, 
   null, 
   "Another opinion", 
   "Come on ... it's common sense. People trade things. They buy and sell. Do you really need PROOF that such happens in society in the absence of regulation??? They create businesses that grow if they do well. People try and better themselves. \n This is what people in society DO, unless ruled by a govt. that won't let them for some reason, preferring people to rely on govt. for everything.\n\n I am curious, why would you say that our government won't let people engage in business, buying and selling, etc. It makes no logical sense to me in reference to the US government. Even if you take the extremes of former Communist countries, my parents immigrated to the US from Communist Poland and I had a chance to visit there a few times as a teenager prior to its change-over to Capitalism. There certainly was a lot of buying and selling going on - mainly through people working in state-owned industry but there was a very lively private black-market of goods as well that was unofficially allowed by the government. The main disadvantage of the communist system was not that everyone was supported by the government - since very few were while the great majority worked. The main disadvantage (speaking economically) was that there was no incentive to work particularly hard since one gained nothing from hard work, so the economy remained very inefficient and, therefore, relatively poor.\n \n In a previous post, you also referred to \"government-mandated socialism via taxation\". Please define Socialism as you see it in this context. Under your definition, then, do any of these programs fall under that definition and why and why not?:\n 1) Social Security\n 2) Medicare\n 3) Public education\n 4) Government student loans and grants\n 5) A progressive tax system - i.e. the rich pay a higher percentage in tax than do the Middle Class or poor.\n 6) The perscription drug program introduced during the Bush administration.\n \n I would claim that what Obama is proposing is just more of these types of programs that we have come to take for granted for decades. If you claim that he is going farther, then please explain this view in detail.\n \n (Side note: These political conversations are getting off topic of this thread but, at this point, I suspect that was unavoidable anyway so .... when in Rome)", 
   {}, 
   372752, 
   null, 
   1254771900.0
  ], 
  [
   372764, 
   null, 
   "jyoshu", 
   "Buying and selling requires currency, or at the very least an agreed upon medium of exchange. You make the usual mistake of confusing your values with universal constants. Capitalism is barely 500 years old, tribal cultures traditionally held everything in common beyond personal possessions. That is the \"natural\" way of doing things. It is also what the disciples did and what the early church did. The idea that one can own land that one neither works nor occupies is absurd.\n\n \n You do know that English royalty own a lot of land (approx. 135,000 acres) that they neither work nor occupy, right? Do you take issue with your own royalty?\n \n Perhaps capitalism in the sense of being driven by free-market competition is that young (though it's likely considerably older), but I don't see how you can say that for human history there haven't been those that society would consider wealthy and those that it considers poor, and within that reality trading/buying/selling takes place. \n \n But I think the real problem here is that anti-capitalists--like yourself, frankly--aren't specific enough in your objections and tend to take a very blanket approach in your comments. Capitalism is too complex of a system to be thrown around in such a simpleton way as just a sweeping blanket generalization of it being anti-Christian or bad. It's the same thing that goes on when someone blithely declares \"communism\" as evil in generalization without taking into account the complexity and relativism of things. A reverse McCarthyism of sorts.", 
   {}, 
   372758, 
   null, 
   1254772800.0
  ], 
  [
   372772, 
   null, 
   "jyoshu", 
   "I am curious, why would you say that our government won't let people engage in business, buying and selling, etc. It makes no logical sense to me in reference to the US government.\n\n \n I think things tend to take place on a scale, and I don't mean that the U.S. govt. is forbidding any business. I think this is largely the classic debate between higher regulation/taxation/govt.-handout-programs and lower-regulation/taxation/encoruagement-of-personal-responsibility. There are times the govt. is encouraging business and for people to thus better themselves, and times it wants to work more toward people relying on government. \n It's going to depend on what one thinks is best for our republic I guess, but I tend to think that lower-taxation, less regulation, and therefore an emphasis on encouragement of entrepreneuship is more in keeping with values the U.S. was founded on.\n \n \nPlease define Socialism as you see it in this context. Under your definition, then, do any of these programs fall under that definition and why and why not?:\n 1) Social Security\n 2) Medicare\n 3) Public education\n 4) Government student loans and grants\n 5) A progressive tax system - i.e. the rich pay a higher percentage in tax than do the Middle Class or poor.\n 6) The perscription drug program introduced during the Bush administration.\n\n \n I think socialism is defined aptly by a standard definition. This is largely a debate about focus and what is too much or too little.\n As you must know, many conservatives were frustrated with Bush and felt he had abandoned conservatism with his runaway spending.\n I've never been all that comfortable with a number of the programs you cite, but I think the fact that all but #'s 4 and 5 are basically in non-sustaining shambles is telling. (Note these are always topics that many, many people talk about as needing reform!) I don't consider #5 a socialistic matter necessarily, and #4 at least has some theoretical return in the long run.", 
   {}, 
   372760, 
   null, 
   1254773700.0
  ], 
  [
   372799, 
   null, 
   "trebor", 
   "Come on ... it's common sense. People trade things. They buy and sell. Do you really need PROOF that such happens in society in the absence of regulation??? They create businesses that grow if they do well. People try and better themselves. \n This is what people in society DO, unless ruled by a govt. that won't let them for some reason, preferring people to rely on govt. for everything.\n\n \n Is a pure barter system 'capitalism'.. I would say not.\n \n And, once you get beyond a pure barter system, it's government.", 
   {}, 
   372752, 
   null, 
   1254777780.0
  ], 
  [
   372880, 
   null, 
   "Jo Bennett", 
   "You do know that English royalty own a lot of land (approx. 135,000 acres) that they neither work nor occupy, right? Do you take issue with your own royalty?\n\n \n Yes, I do. I'm in no great rush to abolish the Monarchy, unless it is part of a wholesale restructuring of the economic and political system, but I certainly include their land in my view.\n \n In any case, socialism doesn't mean encouraging people to rely on the government, it means encouraging people to work together to support each other. Sometimes the government is the facilitator of that, but it doesn't have to be. The Co-operative Wholesale Society began because businesses were adulterating food to make a quick profit and it was a way of people working together to ensure the quality and safety of their food.", 
   {}, 
   372764, 
   null, 
   1254809580.0
  ], 
  [
   372911, 
   null, 
   "jyoshu", 
   "In any case, socialism doesn't mean encouraging people to rely on the government, it means encouraging people to work together to support each other. Sometimes the government is the facilitator of that, but it doesn't have to be. The Co-operative Wholesale Society began because businesses were adulterating food to make a quick profit and it was a way of people working together to ensure the quality and safety of their food.\n\n \n We folks with a libertarian mindset don't have a problem with non-governmental work in such a regard.\n But when it comes to government, \"encouraging\" and \"facilitator\" are awfully watered-down words, when the actual danger is potentially taking business from the private sector via public service with programs that are exorbitant in costs we can't even begin to afford. IMO, a point about non-governmental organizations doesn't even belong here--the problem people have is government-run socialism as well as over-regulation. So if that's what you mean by \"encouraging\" or \"facilitating\", I can't agree that's a good thing.", 
   {}, 
   372880, 
   null, 
   1254842880.0
  ], 
  [
   372918, 
   null, 
   "Another opinion", 
   "I think things tend to take place on a scale, and I don't mean that the U.S. govt. is forbidding any business. I think this is largely the classic debate between higher regulation/taxation/govt.-handout-programs and lower-regulation/taxation/encoruagement-of-personal-responsibility. There are times the govt. is encouraging business and for people to thus better themselves, and times it wants to work more toward people relying on government. \n It's going to depend on what one thinks is best for our republic I guess, but I tend to think that lower-taxation, less regulation, and therefore an emphasis on encouragement of entrepreneuship is more in keeping with values the U.S. was founded on.\n\n I do agree that we might mainly be talking about where one stands on the multi-part scale:\n --< more taxation/less taxation that supports...\n --< more government programs/fewer government programs\n --< don't fully trust industry so regulate / fully trust industry so don't regulate\n --< expect personal responsibility but balance that with government programs to catch people that fall through the cracks / expect personal responsibility but balance that with personal charity for those people that fall through the cracks\n \n However, to call current Democratic political goals Socialist (which, by the official definition that you linked, is full state ownership of industry) is to argue extremes, which is disingenuous and misleading and helps destroy communication between the two factions instead of promoting it. Neither party is at the extremes of this political spectrum - just the minority extremists that sometimes get the most press.\n \n I personally consider myself a left-of-center moderate in that I think that one needs to balance the needs of businesses, consumers and employees when thinking about labor laws and regulations controlling business practice. It should be obvious from the many failures of business to regulate itself (the latest financial crisis being one of many examples) that business cannot be trusted to fully limit itself - especially in a climate where the quest for short term gain overcomes any concerns about long term problems. As for personal responsibility, the great majority of Democrats are just as personally responsible as Republicans. Democrats, on average, do favor government programs to help alleviate the problems of the poor (to help give them opportunities to get out of poverty) where Republicans favor charity for the poor. Charity is all well and good and I do applaud the fact that Republicans do seem to give more in personal charity, but they often don't realize that charity isn't enough to overcome the social/economic obstacles of the poor. I last read that total US charity giving is about 350 billion dollars a year. That would not be enough to cover things such as support for the poor elderly (which is now covered by Social Security and Medicare), for the handicapped, etc. Charity, generous as it is, is simply not enough. What other option would there be - let the poor elderly die out or live homeless on the streets? It is compassion for the poor that drives Democrats to push for these social programs.\n \nI've never been all that comfortable with a number of the programs you cite, but I think the fact that all but #'s 4 and 5 are basically in non-sustaining shambles is telling. (Note these are always topics that many, many people talk about as needing reform!) I don't consider #5 a socialistic matter necessarily, and #4 at least has some theoretical return in the long run.\n\n Many of these programs will become unsustaining since we are demanding more and more of them every year while being unwilling to pay for those increased benefits. In the past, with average lifespan being closer to seventy, then social security would have only needed to support the average elderly person for a bit over five years. Now it is closer to 15 years. Medicare also faces not only rising numbers of seniors (given the higher lifespans) but ever improving medical technology where access to that medical technology involves higher costs. What are the options? I would say that there are no good options. Either way, if we are to avoid sky-rocketing costs of health care in the future, health care will have to be rationed. It will not be pleasant but it is better than letting our country go broke in future debt. I propose biting the political bullet and reducing benefits to a point that is long-term sustainable while cutting un-necessary costs wherever one finds them and slightly raising social security / medicare taxes to make that bullet more palatable. What solution do you propose to this crisis? If you think that charity can cover the costs of care for the elderly, then you grossly underestimate how much is needed. Otherwise, do you think that we should, as a country, leave them out in the cold to fend for themselves - meaning many early deaths? It is easy to criticize - much harder to propose a real solution.", 
   {}, 
   372772, 
   null, 
   1254848520.0
  ], 
  [
   372978, 
   null, 
   "trebor", 
   "Actually, the scriptures say the wealthy brought the value of their voluntarily-sold possessions and laid it at the apostles' feet. And THEN they redistributed. (Acts 4:34, 35)\n \n That point doesn't need to be glossed over ...\n It was voluntary.\n NOwhere in the NT does it say a government should take and control the wealth of its citizens. Nor should Biblical examples and teaching about Christian charity be used to justify government-mandated socialism via taxation. NT teaching is not pro-govenmental-socialist. It's pro-charity on a voluntary basis.\n\n \n Show me where in the bible does it say that a bible can not.\n \n Argument from silence anybody? \n \n Render onto Caesar's what is Caesar's. It says nothing about that that is.\n \n Of course, it also says to give up all your wealth to follow Jesus. Have you given up all your wealth<?", 
   {}, 
   372729, 
   null, 
   1254864360.0
  ], 
  [
   377704, 
   null, 
   "Easyrider", 
   "Show me where in the bible does it say that a bible can not.\n \n Argument from silence anybody? \n \n Render onto Caesar's what is Caesar's. It says nothing about that that is.\n \n Of course, it also says to give up all your wealth to follow Jesus. Have you given up all your wealth<?\n\n \n And render unto God the things that are God's. You forgot that part.\n \n Why don't all you bleeding heart liberals take up a collection on your own and give the Fed all you want? You don't need to wait for tax day.\n \n You know why you don't? As far as giving, you liberals suck at it (but you're real good at spending OTHER PEOPLE'S MONEY). Conservatives give more and are more generous.\n \n Study: Conservatives More Generous Than Liberals - Bright Hall\n \n \n Conservatives vs. Liberals\n \n If a conservative doesn&#8217;t like guns, he doesn`t buy one.\n If a liberal doesn't like guns, he wants all guns outlawed. \n \n If a conservative is a vegetarian, he doesn`t eat meat. \n If a liberal is a vegetarian, he wants all meat products banned for everyone. \n \n If a conservative sees a foreign threat, he thinks about how to defeat his enemy. \n \n A liberal wonders how to surrender gracefully and still look good. \n \n If a conservative is homosexual, he quietly leads his life. \n If a liberal is homosexual, he demands legislated respect.\n \n If a black man or Hispanic are conservative, they see themselves as independently successful. \n \n Their liberal counterparts see themselves as victims in need of government protection.\n \n If a conservative is down-and-out, he thinks about how to better his situation. \n \n A liberal wonders who is going to take care of him. \n \n If a conservative doesn&#8217;t like a talk show host, he switches channels. \n Liberals demand that those they don&#8217;t like be shut down. \n \n If a conservative is a non-believer, he doesn&#8217;t go to church. \n A liberal non-believer wants any mention of God and religion silenced. (Unless it&#8217;s a foreign religion, of course!) \n \n If a conservative decides he needs health care, he goes about shopping for it, or may choose a job that provides it.\n A liberal demands that the rest of us pay for his. \n \n If a conservative slips and falls in a store, he gets up, laughs and is embarrassed. \n If a liberal slips and falls, he grabs his neck, moans like he's in labor and then sues.", 
   {}, 
   372978, 
   null, 
   1257904620.0
  ], 
  [
   377762, 
   null, 
   "Jo Bennett", 
   "Your BS has been ripped to shreds the last time you posted it, Easyrider.", 
   {}, 
   377704, 
   null, 
   1257923340.0
  ], 
  [
   377790, 
   null, 
   "trebor", 
   "Your BS has been ripped to shreds the last time you posted it, Easyrider.\n\n \n He does repeat himself a lot, doesn't he?", 
   {}, 
   377762, 
   null, 
   1257957600.0
  ], 
  [
   377816, 
   null, 
   "jazyjason", 
   "He does repeat himself a lot, doesn't he?\n\n \n When someone has nothing more than their tired old prejudices to fling at others it does get repetitive, especially when their only \"evidence\" is a religion based entirely upon faith, has thousands of interpretations, and does not dictate the course of American law, let alone the Constitution or the Bill of Rights.", 
   {}, 
   377790, 
   null, 
   1257980100.0
  ], 
  [
   377826, 
   null, 
   "Easyrider", 
   "Your BS has been ripped to shreds the last time you posted it, Easyrider.\n\n \n Only in your warped, boneheaded thinking. \n \n Did the libs try to outlaw guns or not? Duh.", 
   {}, 
   377762, 
   null, 
   1257985380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Challenging assumptions we make about God", 
  "url": "http://www.4forums.com/political/religion-debates/13335-challenging-assumptions-we-make-about-god.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13335, 
  "discussion_files": [
   [
    "25303.html", 
    "http://www.4forums.com/political/religion-debates/13335-challenging-assumptions-we-make-about-god-print.html"
   ], 
   [
    "25304.html", 
    "http://www.4forums.com/political/religion-debates/13335-challenging-assumptions-we-make-about-god-4-print.html"
   ], 
   [
    "25305.html", 
    "http://www.4forums.com/political/religion-debates/13335-challenging-assumptions-we-make-about-god-3-print.html"
   ], 
   [
    "25306.html", 
    "http://www.4forums.com/political/religion-debates/13335-challenging-assumptions-we-make-about-god-2-print.html"
   ]
  ], 
  "identifier": 13335
 }
]