[
 [
  [
   25031, 
   null, 
   "Traveler", 
   "A homophobe according to Websters Dictionary is one who has an intense dislike or fear of homosexuals.\n \n If someone is opposed to gay marriage and does not dislike gays or fear them, just not wanting to extend marriage to gays they would not be a homophobe.One can be opposed to gay marriage and not intensely dislike gays or fear them.\n \n If someone posted topics on here that dealt with something current and that particular topic showed a gay person doing something bad(Gay gang...), the poster could not be accused of homophobia, any more than someone posting a topic of a straight person could be accused of heterophobia.\n \n If someone posted a gang of straights using the date rape drug on women, I wouldn't accuse the poster of heterophobia, the intense dislike or fear of heterosexuals.\n \n But that's just me.", 
   {
    "post_info": {
     "post_title": "What is homophobia?"
    }
   }, 
   null, 
   null, 
   1070326860.0
  ], 
  [
   25042, 
   null, 
   "Charchuk", 
   "A homophobe according to Websters Dictionary is one who has an intense dislike or fear of homosexuals.\n \n If someone is opposed to gay marriage and does not dislike gays or fear them, just not wanting to extend marriage to gays they would not be a homophobe.One can be opposed to gay marriage and not intensely dislike gays or fear them.\n\n \n Why do you oppose gay marriage? The traditional definition of marriage is as a contract for the purchase of a bride. The wedding is what is sacred. What you are doing is no different than those who opposed marriage betwen people of different races or beliefs as well. You have no valid reason to oppose it either.\n \n \nIf someone posted topics on here that dealt with something current and that particular topic showed a gay person doing something bad(Gay gang...), the poster could not be accused of homophobia, any more than someone posting a topic of a straight person could be accused of heterophobia.\n\n \n It would be if such a topic made it look like the issue was a problem with homosexuals only and not primarily with heterosexuals as well. Sexuality has nothing to do with this crime. Rape is wrong no matter who does it.\n \n \nIf someone posted a gang of straights using the date rape drug on women, I wouldn't accuse the poster of heterophobia, the intense dislike or fear of heterosexuals.\n\n \n Of course not since that is the primary, and original, use of the drug.\n \n \nBut that's just me.\n\n \n Apparently.", 
   {}, 
   25031, 
   null, 
   1070329620.0
  ], 
  [
   25103, 
   null, 
   "sundowner", 
   "OK, fine, so there not homophobes, hmmm...what can we call them...how about bigots?", 
   {}, 
   25042, 
   null, 
   1070347080.0
  ], 
  [
   25129, 
   null, 
   "Traveler", 
   "Why do you oppose gay marriage? The traditional definition of marriage is as a contract for the purchase of a bride. The wedding is what is sacred. What you are doing is no different than those who opposed marriage betwen people of different races or beliefs as well. You have no valid reason to oppose it either.\n \n \n \n It would be if such a topic made it look like the issue was a problem with homosexuals only and not primarily with heterosexuals as well. Sexuality has nothing to do with this crime. Rape is wrong no matter who does it.\n \n \n \n Of course not since that is the primary, and original, use of the drug.\n \n \n \n Apparently.\n\n \n I oppose gay marriage because the Constitution gives me that right, and secondly because I disapprove of gay marriage.\n \n As well, a majority of blacks are opposed to gay marriage, and not all blacks see the issue of allowing gay marriage as being related to past opposition to interracial marriage.\n \n The topic did not make it look like this was a problem with homosexuals only. The topic showed A(1) gay gang using the date rape drug. Never did I say that this was a crime only being committed by gays. For someone to see that they would clearly have to be reading into something that wasn't there.", 
   {}, 
   25042, 
   null, 
   1070385240.0
  ], 
  [
   25130, 
   null, 
   "Traveler", 
   "OK, fine, so there not homophobes, hmmm...what can we call them...how about bigots?\n\n \n Maybe, but the term bigot would then have to be applied to homosexual heterophobes as well", 
   {}, 
   25103, 
   null, 
   1070385300.0
  ], 
  [
   25133, 
   null, 
   "Charchuk", 
   "I oppose gay marriage because the Constitution gives me that right, and secondly because I disapprove of gay marriage.\n\n \n The Constitution doesn't give you the right to take another's rights away from them just because you disapporve of them. Why do you disapprove of it? No one is actually being harmed by this. You don't have a valid reason. It is like if I had said that people who are left-handed should get married because mostly everyone else is right-handed and thus it isn't \"natural\". BTW, I'm ambidextrous. I write both ways. :)\n \n \nAs well, a majority of blacks are opposed to gay marriage, and not all blacks see the issue of allowing gay marriage as being related to past opposition to interracial marriage.\n\n \n Irrelevant. Discrimination is still discrimination when it is based on bigotry.\n \n \nThe topic did not make it look like this was a problem with homosexuals only. The topic showed A(1) gay gang using the date rape drug. Never did I say that this was a crime only being committed by gays. For someone to see that they would clearly have to be reading into something that wasn't there.\n\n \n I read everything you put into it.", 
   {}, 
   25129, 
   null, 
   1070385660.0
  ], 
  [
   25134, 
   null, 
   "Charchuk", 
   "Maybe, but the term bigot would then have to be applied to homosexual heterophobes as well\n\n \n Now you're making up terms. How can we hate heyerosexuals when most of us are heterosexual? We don't go around posting articles stating just how evil and sinful heterosexuals are. We aren't ones who are saying that they shouldn't get married either. You're the one who is doing the posting of articles which label homosexuals as being evil and wanting to take their rights away from them. You're the bigot.", 
   {}, 
   25130, 
   null, 
   1070385840.0
  ], 
  [
   25136, 
   null, 
   "Traveler", 
   "The Constitution doesn't give you the right to take another's rights away from them just because you disapporve of them. Why do you disapprove of it? No one is actually being harmed by this. You don't have a valid reason. It is like if I had said that people who are left-handed should get married because mostly everyone else is right-handed and thus it isn't \"natural\". BTW, I'm ambidextrous. I write both ways. :)\n \n \n \n Irrelevant. Discrimination is still discrimination when it is based on bigotry.\n \n \n \n I read everything you put into it.\n\n \n If within the Constitution it is ok for the Massachusettes Supreme Court to overturn the ban on gay marriage, then it is ok to implement a Constitutional Amendment to ban gay marriage since this is what the Constitution says the people have a right to implement if they want to overturn, lets say, the Mass. court, or a possible future Supreme Court ruling. \n \n Who are you to decide what bigotry is? What is bigotry to you isn't bigotry to someone else. If one truly believes in cultural diversity they will understand this.\n \n You read into it what you want. I am fine with that. Others may disagree, or not. I don't go around stating that what I perceive in a topic is the standard. I just state that it is my opinion, and you would do well to state that what you see concerning the topic is your opinion and that you could be wrong in that opinion.", 
   {}, 
   25133, 
   null, 
   1070386740.0
  ], 
  [
   25138, 
   null, 
   "Traveler", 
   "Now you're making up terms. How can we hate heyerosexuals when most of us are heterosexual? We don't go around posting articles stating just how evil and sinful heterosexuals are. We aren't ones who are saying that they shouldn't get married either. You're the one who is doing the posting of articles which label homosexuals as being evil and wanting to take their rights away from them. You're the bigot.\n\n \n Show me any place where I have stated that gays are evil or sinful. You are making stuff up. I have a right to state in posts that I disagree with gay marriage, just as you have the right to say that gay marriage is ok. You are painting yourself to be the one who is intolerant of other peoples free speech, where I on the other hand welcome it.\n \n Given what you have posted, the only evidence that I can see is that you are bigotted to free speech. If opposing something makes one a bigot, such as me opposing gay marriage, then every person living on this planet is a bigot because everyone has something they disagree with or are opposed to.", 
   {}, 
   25134, 
   null, 
   1070387040.0
  ], 
  [
   25139, 
   null, 
   "Charchuk", 
   "Show me any place where I have stated that gays are evil or sinful. You are making stuff up. I have a right to state in posts that I disagree with gay marriage, just as you have the right to say that gay marriage is ok. You are painting yourself to be the one who is intolerant of other peoples free speech, where I on the other hand welcome it.\n \n Given what you have posted, the only evidence that I can see is that you are bigotted to free speech. If opposing something makes one a bigot, such as me opposing gay marriage, then every person living on this planet is a bigot because everyone has something they disagree with or are opposed to.\n\n \n By the very topics you post. Hate speech was never a part of free speech. Free speech is also not an absolute either or else there wouldn't be libel or slander laws. Opposing something based on ignorance is bigotry. You've never said why you oppose gay marriage.", 
   {}, 
   25138, 
   null, 
   1070387400.0
  ], 
  [
   25141, 
   null, 
   "Traveler", 
   "By the very topics you post. Hate speech was never a part of free speech. Free speech is also not an absolute either or else there wouldn't be libel or slander laws. Opposing something based on ignorance is bigotry. You've never said why you oppose gay marriage.\n\n \n Show me any place where I have stated that gays are evil or sinful? You can't. You lied. Who are you to decide what hate spech is? Simply stating that one is against gay marriage or that they plan to oppose gay marriage is no more or less hate speech than stating that you are for gay marriage, or plan to try and implement it. I see nowhere within the Constitution anything that remotely says that I cannot state my views within society if I am not slandering someone or printing libel. As well, within slander or libel it must be proven that the person must have had a reckless disregard for the truth. Who are you to say that I am ignorant? I could just as easily accuse you of the same, but I'm not into that kind of stuff, nor am I into intolerant oppression of free speech.\n \n You do not have the right to say that what I am sying is hate speech simply because you disagree with it.", 
   {}, 
   25139, 
   null, 
   1070387880.0
  ], 
  [
   25143, 
   null, 
   "airhead", 
   "If within the Constitution it is ok for the Massachusettes Supreme Court to overturn the ban on gay marriage, then it is ok to implement a Constitutional Amendment to ban gay marriage since this is what the Constitution says the people have a right to implement if they want to overturn, lets say, the Mass. court, or a possible future Supreme Court ruling. \n \n\n \n I don't think that the Constitution specifically said anything on gay marriage (if I am wrong, please point it out). This means that the Constitution essentially leaves it open on the question of gay marriage. \n \n The question is, then, whether it is reasonable to ban gay marriage, not whether it is allowable by the constitution to ban gay marriage -- and \"it's reasonable because I think it's reasonable\" is not a valid answer because it lacks reasoning. \n \n With what you are allowed to do aside, why is it reasonable (and fair) to ban gay marriage? (I have no take on this -- haven't thought about it long enough)\n \n As an analogy: if I am correct, there is nothing in the Constitution that prevents people from repealing the first amendment (again, if I am wrong, please point it out). Would it be ok then to go ahead and repeal it? Sure, but would it be a reasonable thing to do? Probably not, as I am sure you would agree.", 
   {}, 
   25136, 
   null, 
   1070388180.0
  ], 
  [
   25148, 
   null, 
   "step314", 
   "Hate speech was never a part of free speech.\n \n \n What rot. Here in America we have for quite some time had the right to speak that we hate someoe, some group, or some behavior. It would be a sad day if we did not have that right. But perhaps Charchuk will say that by \"hate speech\" he means speech that threatens violence. So why not say that free speech does not entail the right to threaten illegal violence? Why is it in the male homosexual agenda to call threats of violence \"hate speech\" rather than just \"threats of violence\"? Because the gay agenda is to equate expression of hate with threats of illegal violence in an effort to make it illegal to express hate for sodomizers, male homosexuals, sodomy, etc. \n \n This is the same sort of rot that the Southern States used before the Civil War to ban newspapers, etc., that were hateful toward slave owners and the slave system. The excuse was that such newspapers encouraged violence and hate in the slaves. \n \n I'd be the first to say there is an unfortunate lack of hate toward sodomizers in those who are submissive to them. The abused woman too afraid and guilty to leave her abuser and go to a woman's shelter, the gay male sodomized into homosexuality and a barren lifestyle because the monstrous parasite that dominates him wants his money--these unfortunates need to hate like nothing else.\n \n \"To every thing there is a season, and a time to every purpose under the heaven: ... A time to love, and a time to hate.\"--Ecclesiastes.", 
   {
    "post_info": {
     "post_title": "Hate"
    }
   }, 
   25143, 
   null, 
   1070390460.0
  ], 
  [
   25170, 
   null, 
   "Charchuk", 
   "What rot. Here in America we have for quite some time had the right to speak that we hate someoe, some group, or some behavior. It would be a sad day if we did not have that right. But perhaps Charchuk will say that by \"hate speech\" he means speech that threatens violence. So why not say that free speech does not entail the right to threaten illegal violence? Why is it in the male homosexual agenda to call threats of violence \"hate speech\" rather than just \"threats of violence\"? Because the gay agenda is to equate expression of hate with threats of illegal violence in an effort to make it illegal to express hate for sodomizers, male homosexuals, sodomy, etc. \n\n \n There is no gay agenda. That is just a paranoid delusion by the Christian-reich to justify their fears and hatreds.\n \n \nI'd be the first to say there is an unfortunate lack of hate toward sodomizers in those who are submissive to them. The abused woman too afraid and guilty to leave her abuser and go to a woman's shelter, the gay male sodomized into homosexuality and a barren lifestyle because the monstrous parasite that dominates him wants his money--these unfortunates need to hate like nothing else.\n\n \n Man, do you ever lack a clue. No one can be made gay. Either you're born gay or you're not. Plus, you're confusing sexuality with the sex act itself. You are also confusing love and sex as well.\n \n Say you are married and your wife developed a problem where she could never have sex again. Would you still love her or would you just get another wife who could? Homosexuality is not about the sex act, it is about whom you love, not about how you love. You can't control who you love.\n \n \n\"To every thing there is a season, and a time to every purpose under the heaven: ... A time to love, and a time to hate.\"--Ecclesiastes.\n\n \n When are you going to start the time to love? I think you've had the time to hate for far too long.", 
   {}, 
   25148, 
   null, 
   1070399400.0
  ], 
  [
   25192, 
   null, 
   "step314", 
   "Homosexuality is not about the sex act, it is about whom you love, not about how you love.\n \n \n Yeah, right. Then why did the male homosexuals lobby so hard to get anti-sodomy laws overturned?\n \n \nWhen are you going to start the time to love? I think you've had the time to hate for far too long.\n \n \n Oh, but I am loving. I am trying to rescue the downtrodden from their enslavement to sodomizers. What a just, loving thing to do.", 
   {}, 
   25170, 
   null, 
   1070402460.0
  ], 
  [
   25195, 
   null, 
   "Traveler", 
   "Yeah, right. Then why did the male homosexuals lobby so hard to get anti-sodomy laws overturned?\n\n \n Bingo!\n \n \n \n Oh, but I am loving. I am trying to rescue the downtrodden from their enslavement to sodomizers. What a just, loving thing to do.[/QUOTE]\n \n Keep up the good work.", 
   {}, 
   25192, 
   null, 
   1070403780.0
  ], 
  [
   25198, 
   null, 
   "gilligan8503", 
   "Keep up the good work.\n\n yeah! go get 'em hitler!", 
   {}, 
   25195, 
   null, 
   1070404080.0
  ], 
  [
   25199, 
   null, 
   "Traveler", 
   "yeah! go get 'em hitler!\n\n \n I see that you fell for my trolling, dolt. Someone always does when I do it from time to time. Anyway I have seriously doubted that the poster I was responding to is nothing more than a sock puppet, since his post has not been commented on by any of the others here as it should have been. I mean, come on, look at what was posted. I believe that my doubts have been confirmed given that you went right past his post and straight to mine.", 
   {}, 
   25198, 
   null, 
   1070405160.0
  ], 
  [
   25206, 
   null, 
   "Goturuge", 
   "Yeah, right. Then why did the male homosexuals lobby so hard to get anti-sodomy laws overturned?\nIf a man loved a woman, but the government forbid him to express his love in a sexual manner if he wished, he would do the same. People have a right to do to their own bodies what they wish. If two willing people wish to express their love in a particular manner, they have that right--sodomy or not. They wanted to have those laws overturned so that a gay couple may express their love in that manner if they wished.\n \n \nOh, but I am loving. I am trying to rescue the downtrodden from their enslavement to sodomizers. What a just, loving thing to do.\nThat sounds a bit too rediculous for me to take seriously. Enslavement to sodomizers? Please, elaborate on this.\n \n Goturuge", 
   {}, 
   25192, 
   null, 
   1070409420.0
  ], 
  [
   25210, 
   null, 
   "Charchuk", 
   "Yeah, right. Then why did the male homosexuals lobby so hard to get anti-sodomy laws overturned?\n\n \n Because those laws were unconstitutional, and they also included just being gay as well. \n \n \nOh, but I am loving. I am trying to rescue the downtrodden from their enslavement to sodomizers.\n\n \n What downtrodden from what sodomizers?\n \n \nWhat a just, loving thing to do.\n\n \n The Inquisition thought that same thing as well for those who wouldn't tow the line. You're no different than them and their real evil.", 
   {}, 
   25192, 
   null, 
   1070411580.0
  ], 
  [
   25211, 
   null, 
   "Charchuk", 
   "Bingo!\n\n \n This isn't church. \n \n \nKeep up the good work.\n\n \n How is it in the Klan?", 
   {}, 
   25195, 
   null, 
   1070411640.0
  ], 
  [
   25212, 
   null, 
   "Charchuk", 
   "I see that you fell for my trolling, dolt. Someone always does when I do it from time to time. Anyway I have seriously doubted that the poster I was responding to is nothing more than a sock puppet, since his post has not been commented on by any of the others here as it should have been. I mean, come on, look at what was posted. I believe that my doubts have been confirmed given that you went right past his post and straight to mine.\n\n \n What do you expect since you're nothing more than a little frightened homophobe. Most likely you're worried about your own sexuality and this is how you \"compensate\".", 
   {}, 
   25199, 
   null, 
   1070411760.0
  ], 
  [
   25233, 
   null, 
   "sundowner", 
   "I'd be the first to say there is an unfortunate lack of hate toward sodomizers in those who are submissive to them. The abused woman too afraid and guilty to leave her abuser and go to a woman's shelter, the gay male sodomized into homosexuality and a barren lifestyle because the monstrous parasite that dominates him wants his money--these unfortunates need to hate like nothing else.\n \n \n Some women like anal sex, who are you to interfere? And you make it sound as if homosexuals rape people into the lifestyle. You make it sound as if half of the gay community are criminal rapists and the other half are unwilling victims. Got some news for you, YOU'RE WRONG. I really don't care if you want to continue to post this XXXX, it just shows how ignorant you are towards the whole subject. \n \n \n\"To every thing there is a season, and a time to every purpose under the heaven: ... A time to love, and a time to hate.\"--Ecclesiastes.\n \n \n Turn, turn, turn... -The Byrds", 
   {}, 
   25192, 
   null, 
   1070418600.0
  ], 
  [
   25260, 
   null, 
   "step314", 
   "Some women like anal sex, who are you to interfere? \n\n \n \n Who are you to say I shouldn't? Clearly if rectal sodomy (the preferred term) is addictive, this sodomy from being insidious and unusually capable of unnaturally altering sexual desires is much more evil and worthy of ban than (say) marijuana or cocaine. \n \n \nGot some news for you, YOU'RE WRONG.\n \n \n Totally unsubstantiated claim. Intelligent argument does not consist merely in saying (in bold caps) \"you're wrong,\" but consists in giving reasons for your belief.\n \n \nYou make it sound as if half of the gay community are criminal rapists and the other half are unwilling victims.\n \n \n Data I imagine would be hard to come by as to the question of how many people who like being sodomized were originally sodomized as a result of forcible sexual abuse, since it stands to reason that the people so addicted to sodomy might be just as quiet with an interrogator as they presumably have been since they had the opportunity to seek conviction. And it is proverbial that forcibly sodomized people don't tend to speak out. This is one of the main reasons some of those priests who were in the news lately have been able to sodomize a hundred (at least) boys and then got away with it for a long while. So I don't think that an empirical pursuit of data along those lines would be very interesting or conclusive. Nor do I think that your observations (whatsoever they be) on this matter would be any more than a guess, either. Not that a good many of the males addicted into sodomy don't end up having homosexual relationships with males other than the male who originally abused them, but yeah, I would not be at all surprised if the majority of those males who \"willingly\" get sodomized have gotten this willingness because they were originally forcibly sodomized. I say this because it is the simplest assumption given my hypothesis that sodomy is an addiction, not because I have any meaningful data directly dealing with the matter, which as I mentioned, can't really be got. As for females, that would be a different matter. If my theory is correct, clearly the majority of people nowadays are clueless as to the true nature of sodomy. This ignorance might often cause females to stupidly try sodomy if their sex partner begs for it sufficiently--more especially inasmuch as (not my type) females sometimes try to behave submissively from a desire to show their man they are too lame and weak to commit adultery.", 
   {}, 
   25233, 
   null, 
   1070426160.0
  ], 
  [
   25342, 
   null, 
   "sundowner", 
   "Who are you to say I shouldn't? Clearly if rectal sodomy (the preferred term) is addictive, this sodomy from being insidious and unusually capable of unnaturally altering sexual desires is much more evil and worthy of ban than (say) marijuana or cocaine. \n\n \n That is really sick logic. Even by those who claim that semen is an addictive substance, most agree that it must be consumed on a regular basis for several weeks before it begins to have measurable effect. Even then, most will agree that it does not cause cravings like nicotine (in other words...nobody has sperm fits). You need to learn that what 2 consenting adults do behind closed doors is not your business. \n \n \nTotally unsubstantiated claim. Intelligent argument does not consist merely in saying (in bold caps) \"you're wrong,\" but consists in giving reasons for your belief.\n \n \n OK then, let's analyze this statement:\n \n \nI'd be the first to say there is an unfortunate lack of hate toward sodomizers in those who are submissive to them. The abused woman too afraid and guilty to leave her abuser and go to a woman's shelter, the gay male sodomized into homosexuality and a barren lifestyle because the monstrous parasite that dominates him wants his money--these unfortunates need to hate like nothing else.\n \n \n Define submissive? Do you intend to say that they are unwilling victims of sodomy? There is a vast difference between rapists / rape victims, and consenting adults having anal sex. And let me ask this question, are you trying to assert that most of these victims are not willing to report the crime or seek help because they need to feed their sperm addiction? And answer this as well, how do you sodomize someone into homosexuality. Ask anyone on this forum that is gay if they were forced into their first physical homosexual experience, or if the did it willingly. Again, you must learn the difference between consenting adults and criminals / victims. It is funny how someone advocating gay rights talks of peace, love, and understanding, while you speak of hate. What value will you teach your children?\n \n \n I would not be at all surprised if the majority of those males who \"willingly\" get sodomized have gotten this willingness because they were originally forcibly sodomized. I say this because it is the simplest assumption given my hypothesis that sodomy is an addiction, not because I have any meaningful data directly dealing with the matter, which as I mentioned, can't really be got. As for females, that would be a different matter. If my theory is correct, clearly the majority of people nowadays are clueless as to the true nature of sodomy. This ignorance might often cause females to stupidly try sodomy if their sex partner begs for it sufficiently--more especially inasmuch as (not my type) females sometimes try to behave submissively from a desire to show their man they are too lame and weak to commit adultery.\n \n \n So you are trying to say that the majority of the male homosexual population are rape victims? Good luck with that. \n If find all of your logic flawed. Many women and their partners first experiment with anal sex through the use of toys. It seems to me that there is no sperm in a sex toy to cause your adiction. Many couples include such toys as a normal part of their sex life. Many women and men find anal stimulation pleasurable, this may be the reason so many continue to do it time after time.", 
   {}, 
   25260, 
   null, 
   1070484840.0
  ], 
  [
   25348, 
   null, 
   "step314", 
   "Many women and their partners first experiment with anal sex through the use of toys.\n \n \n Totally unsubstantiated codswallop. Saying something doesn't make it so. Are you saying that females have naturally a masturbatory view of rectal sodomy, or even more incredible, that they take pleasure in such masturbatory activity? So, for instance, there would be lots of sodomy-inexperienced virgin girls who pleasurably masturbate by putting things up their rectum? Not. Get a clue about what females are about before you start profaning them. Try to figure out why girls tend on the whole to not be so tolerant of dirt and mess as males, and why, for instance, it would be such a big deal for a girl to have to wear a dirty dress to school; if you fail to see the obvious, consider that--hello--sodomy (and rectal sodomy in particular) is a dirty mess.", 
   {
    "post_info": {
     "post_title": "Codswallop"
    }
   }, 
   25342, 
   null, 
   1070487420.0
  ], 
  [
   25356, 
   null, 
   "Traveler", 
   "What do you expect since you're nothing more than a little frightened homophobe. Most likely you're worried about your own sexuality and this is how you \"compensate\".\n\n \n The only ones that fear are the little frightened heterophobes like yourself. You fear and hate any discussion that may differ from the way you think things ought to be. You are the exact opposite of what this country stands for. Ever heard of the term \"projection\"? You are a classic sign of it. Normally those who accuse things of others, like your stating to me that I am worried about my sexuality, and am trying to compensate for it, only shows that in fact YOU are the one who is worried and is compensating.\n \n Heterophobic,intolerant, discriminatory, anti-heterosexual biggotry is on the rise and you exemplify it. Please try and contain your hate, though.", 
   {}, 
   25212, 
   null, 
   1070490420.0
  ], 
  [
   25371, 
   null, 
   "sundowner", 
   "Totally unsubstantiated codswallop. Saying something doesn't make it so. \n 1. Are you saying that females have naturally a masturbatory view of rectal sodomy, or even more incredible, that they take pleasure in such masturbatory activity? \n \n 2. So, for instance, there would be lots of sodomy-inexperienced virgin girls who pleasurably masturbate by putting things up their rectum? \n \n Not. \n \n 3. Get a clue about what females are about before you start profaning them. \n \n 4. Try to figure out why girls tend on the whole to not be so tolerant of dirt and mess as males, and why, for instance, it would be such a big deal for a girl to have to wear a dirty dress to school; if you fail to see the obvious, consider that--hello--sodomy (and rectal sodomy in particular) is a dirty mess.\n\n \n 1. Some do. Some males do as well.\n \n 2. There would be some, many in fact. I did not say a majority, but there are many people who do find anal stimulation peasurable. \n \n 3. Who \"profaned\" females? By saying that some women like anal sex or stimulation is profane towards women? Get a grip. Many men and women, both straight and gay, enjoy anal sex / stimulation. Stating the truth is not profane.\n \n 4. Are you serious?", 
   {}, 
   25348, 
   null, 
   1070493060.0
  ], 
  [
   25777, 
   null, 
   "mizmaxx", 
   "So, for instance, there would be lots of sodomy-inexperienced virgin girls who pleasurably masturbate by putting things up their rectum? \n\n \n Are yuo saying there aren't? Find some evidence to back that up, then get back to us.\n \n You are the one coming up with outlandish theories. The onus of evidence is on you. Come up with some evidence to back up your fantastic claims, such as that oral intercourse is more related to sexual abuse/assault than other sexual activities. \n \n I happen to know quite a bit on the subject of sexual abuse of children, and I am aware of many indicators of sexual abuse in children and past sexual abuse/assault in adults. Anal intercourse has never, to my knowledge, been shown to be more prevalent in abused children than other sexual activities. \n \n Neither are survivors of same sex sexual abuse/assault more likely to be homosexual.\n \n In fact, the opposite is just as likely, as people who experience trauma tend to associate particular abusive acts with any kind of similar sexual activity. For example, having been abused mano-vaginally can cause a person to associate their feelings of fear/horror/pain/etc. with any suggestion/description/image/act of mano-vaginal stimulation.\n \n It is of course possible for people to do the opposite. This is more likely to occur if they were confused and further traumatized by feelings of physical pleasure during the assault. I am by no means saying that they \"liked it\", just that the body predictibly responds with pleasure signals when stimulated in certain ways, despite the fear/pain/horror/disgust/trauma of assault. Because survivors are so often told by the agressor and others, explicitely and implicitely, that they \"asked for it\" or \"liked it\", these healthy physical responses can cause serious guilt and confusion. In response, the person can identify with having \"liked it\" as a way to deny the loss of power and autonomy that are part of such assaults.\n \n However, and this is a BIG however, this is no more likely related to any one sex act than any other. \n \n Therefore, a person who was sexually abused by anal penetration could engage in it in an unhealthy way (as they could engage in any sexual behaviour in an unhealthy way), but would just as likely feel the kind of aversion you demonstrate towards the act. \n \n *For more info on real life sexual abuse survival (as opposed to academic shlock, which isn't hard to find), I highly recommend the books \"The Courage to Heal: A Guide for Women Survivors of Child Sexual Abuse\" (Ellen Bass and Laura Davis) and \"Allies in Healing: When the Person You Love Was Sexually Abused As a Child\" (Laura Davis). The first book is written for women, but many men find it helpful anyway.", 
   {}, 
   25371, 
   null, 
   1070694240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What is homophobia?", 
  "url": "http://www.4forums.com/political/gay-rights-debates/1333-what-homophobia.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 1333, 
  "discussion_files": [
   [
    "7309.html", 
    "http://www.4forums.com/political/gay-rights-debates/1333-what-homophobia-print.html"
   ], 
   [
    "7310.html", 
    "http://www.4forums.com/political/gay-rights-debates/1333-what-homophobia-2-print.html"
   ]
  ], 
  "identifier": 1333
 }
]