[
 [
  [
   371332, 
   null, 
   "antonia", 
   "Mary Travers, of Peter, Paul and Mary, peace ambassador and teacher, and one of America's great folk artists, has passed away. \n \n \n Here is a youtube from their 1966 Tonight In Person appearance. \n \n YouTube - Peter Paul & Mary - Blowin in the wind\n \n \n \"There's an old folk song that has a line in it that says, 'We shall study war no more'. And it is what all of us wish for the world. A time when we study war no more. The way to achieve that is to ask questions. This next song is just a beginning, and we ask you to ask the questions with us. Sing it with us. Because you were, and you are, and you will always be, blowing in the wind.\"\n \n - Mary Travers, Live in Japan, 1990", 
   {
    "post_info": {
     "post_title": "Mary Travers"
    }
   }, 
   null, 
   null, 
   1253772360.0
  ], 
  [
   371360, 
   null, 
   "Winston Smith", 
   "Mary Travers, of Peter, Paul and Mary, peace ambassador and teacher, and one of America's great folk artists, has passed away. \n \n \n Here is a youtube from their 1966 Tonight In Person appearance. \n \n YouTube - Peter Paul & Mary - Blowin in the wind\n \n \n \"There's an old folk song that has a line in it that says, 'We shall study war no more'. And it is what all of us wish for the world. A time when we study war no more. The way to achieve that is to ask questions. This next song is just a beginning, and we ask you to ask the questions with us. Sing it with us. Because you were, and you are, and you will always be, blowing in the wind.\"\n \n - Mary Travers, Live in Japan, 1990\n\n \n \"Blowing in the wind\" is a good song to remember her by.\n The answer has gone with the wind, unfortunately", 
   {}, 
   371332, 
   null, 
   1253793300.0
  ], 
  [
   371368, 
   null, 
   "snakespit", 
   "A great loss to the folk community. She was certainly an amazing singer/songwriter, and her influence has certainly shaped music as we know it today, and as we will know it for years to come.", 
   {}, 
   371360, 
   null, 
   1253803980.0
  ], 
  [
   371490, 
   null, 
   "antonia", 
   "She had such beautiful expression and wisdom in her voice that only seemed to deepen with time. They brought folk music to so many audiences, and the body of work they produced is enormous. I think they are also to be greatly credited for bringing so much folk music to children. They were (are, as well, since Peter and Paul are still alive) very generous as musicians.\n \n I remember being in a park once as a child and Paul was there with his guitar. He just started playing and singing for all the kids there. All the kids wound up there, dropping all else they were doing, sitting on the grass, listening to him perform. Talking about the music and songs too. He was also quite a teacher.\n \n The photo from the first link is all 3 of them at the 1963 March on Washington when Dr. King gave his I Have A Dream speech. I think Mary was also involved in the voter registration drive down south. I think of her, too, as a feminist. She was a strong and opinionated and inspiring woman who spoke her mind out on issues when others were reluctant to. Some looked at her and saw this gorgeous willowy blonde and thought there was nothing else going on. But anyone really listening to her sing, this strength and spirit and spunk belted out, could see that she was quite a principled and brave person, a lot of character, a thinking individual. Very encouraging and supportive of others, a quality I think increasingly out in her music, over the years.\n \n Here, you can see it, too in her rendition of the Hammer Song (I think it's the Newport Folk Festival). \n \n http://www.youtube.com/watch?v=lUKB3PxG-0E&feature=related\n \n The New York Times ran an obituary, but I thought they really did a poor job summarizing her contributions, didn't really appreciate the history or person or music there, and were even a little nasty (e.g. they qualified the music as \"commercial\", etc).\n \n Some people wanted Mary to go into a closet when she got older and ill and when she was no longer their sex symbol. But Mary obviously knew she was a person, not a thing. She never stopped fighting and she never accepted the shallow definitions that others were imposing upon her, and then, as a middle-aged or older woman, and having gained weight. She was a self-disciplined and trained artist and kept reflecting that self-perception in her music, to anyone who knew how to listen to what was there on a deeper level. She kept speaking her mind and developing and deepening the artistry in her expression. She always carried herself with dignity, even more so in later years.\n \n They're so tight and connected in their performance together, as a group, at Newport. I reminded of how some jazz musicians do it up. It's just beautiful.\n \n Anyway, I see Mary Travers as an inspiring figure in music also. (And the New York Times can go jump in a lake.)", 
   {}, 
   371368, 
   null, 
   1253901000.0
  ], 
  [
   371492, 
   null, 
   "JPSartre12", 
   "\n \n Of all the forms of inequality, injustice in health care is the most shocking and inhumane. Dr. Martin Luther King, Jr.\n \n 1-866-338-1015 Call your representatives toll free at the Capitol and tell them to represent you for a change. Tell them you want H.R. 676, Single Payer Health Care. Pass it on. \n \n\n \n Wow! Now you're an unabashed shill for socialized medicine? Have you no shame? emoticon_rolleyes", 
   {}, 
   371332, 
   null, 
   1253902440.0
  ], 
  [
   371544, 
   null, 
   "Easyrider", 
   "Back in 1963 or early 1964 I was a teenager working at the Atlantic Richfield station at the corner of Desert Inn Rd. and Maryland Pkwy in Las Vegas. Around 6 PM or so (could have been Saturday) a long, black limo pulls up. The right rear window rolls down and I'm looking at Peter, Paul, and Mary. Mary was in the middle in a mini skirt and long legs, with her long blonde hair and she looked really good. It was either Peter or Paul who asked directions to UNLV. They must have had a concert there that night. \"Down Maryland Pkwy about 1 mile on the right,\" I said. I wanted to hop in there with them. And there they went, down the highways of their lives. It was a moment in time. One moment she looked young, and great, and had wonderful times ahead of her. Now she's gone. Time goes by so quickly.\n \n Edit: Here's a link with a picture: http://celebrating50.unlv.edu/timeline.html\n \n It was 1963\n \n I wonder what Mary's religious beliefs were? I can't find anything on the internet. Does anyone know?  I know either Peter or Paul is a Christian but I'd like to know what Mary thought.\n \n My favorite song of theirs is \"Early Morning Rain.\"", 
   {}, 
   371492, 
   null, 
   1253932200.0
  ], 
  [
   371553, 
   null, 
   "antonia", 
   "I googled around and the only thing I see is a comment on an Israel forum (Judaica Journal, \"Goodnight Mary Travers\"), mentioning that she was not Jewish. I love the way they did \"The Cherry Tree Carol,\" but of course, as folk singers, they sang music from many cultures.\n \n That's a great story from Nevada about the limo!", 
   {}, 
   371544, 
   null, 
   1253942520.0
  ], 
  [
   371573, 
   null, 
   "Winston Smith", 
   "This was a good thread! \n \n But I think you overdid the feminist side of the story. Not every woman is a 'sister in arms' such as 'simone'.", 
   {}, 
   371553, 
   null, 
   1253970660.0
  ], 
  [
   371585, 
   null, 
   "antonia", 
   "This was a good thread! \n \n But I think you overdid the feminist side of the story.\n\n \n Yeah, I didn't want to go in that direction, I know people get trippy about it, but I think it's a side of Mary Travers the media doesn't credit enough, and it was challenging to put into words, and when it's late .... people don't understand what \"feminist\" really means or is. That's why I liked what Laura Bush said in that interview, that she was a feminist. It was a very Nixonesque moment in the Nimoy sense (only he could go to China). But she understood that problem with the language and addressed it very well, probably because of her teaching background. But people don't credit her enough as a woman either. She's a very inteliigent person, for example (even though I'm quite at odds with a lot of her politics, since she's a contemporary Republican). That's the real heart of these matters.\n \n Anyway, have a good weekend, Winston. I'll see you again for more Femmes Violent (?) youtubes.", 
   {}, 
   371573, 
   null, 
   1253985120.0
  ], 
  [
   371586, 
   null, 
   "antonia", 
   "Winston, there's this school of feminism, I think Camille Paglia is part of it. http://web.archive.org/web/20080211100400/www.randomhouse.com/pantheon/paglia/ They're into 'power over' rather than equality. I think a lot of people think of that school of thought when they hear the word 'feminism', but it's not what it means at all. I knew a woman who used to say she was a 'humanist' because she felt that this word conveyed the meaning of 'feminism' more fully.\n \n But .. we digress .. and I must go now, off to my womanly duties ...:p", 
   {}, 
   371585, 
   null, 
   1253986080.0
  ], 
  [
   371673, 
   null, 
   "Winston Smith", 
   "I had a look at Ms Paglia's site. Had no idea she existed. I loved the title of one her books: Sexual Personae: Art and Decadence from Nefertiti to Emily Dickinson \n \n Emily Dickinson decadent? Nefertiti maybe? But going by what I saw of her at the Met, beautifully decadent. Truth is, I found her elegant, not decadent at all. When she lived Egypt was hardly a decadent civilization, she was no Cleopatra, selling herself to the Romans.\n \n In Australia no one mentions feminism, well, Germaine Greer is still alive but living in England, so far as I know. Her feminism was a mixture of Marxism and women liberation, very 60's very very outmoded and obsolete radical thinking.\n \n Thanks, my weekend is finishing, the sun has set on this windy Sunday in Sydney.", 
   {}, 
   371586, 
   null, 
   1254047040.0
  ], 
  [
   371689, 
   null, 
   "antonia", 
   "I had a look at Ms Paglia's site. Had no idea she existed. I loved the title of one her books: Sexual Personae: Art and Decadence from Nefertiti to Emily Dickinson \n\n \n I agree, it's intriguing. I never read anything by her, though. Just about her. (i.e. she's dominatrix supreme.)\n \n \nEmily Dickinson decadent?\n\n \n I find that description of ED very interesting. Radical, certainly. Maybe I'll read Paglia, decide for myself. \n \n \nNefertiti maybe? But going by what I saw of her at the Met, beautifully decadent. Truth is, I found her elegant, not decadent at all. When she lived Egypt was hardly a decadent civilization, she was no Cleopatra, selling herself to the Romans.\n\n \n Well put. I love the Met, though places in Europe make NYC pale in comparison ITO art.\n \n \nIn Australia no one mentions feminism, well, Germaine Greer is still alive but living in England, so far as I know. Her feminism was a mixture of Marxism and women liberation, very 60's very very outmoded and obsolete radical thinking.\n\n \n Perhaps, I read her too long ago to remember. Except that her thinking in feminism was more along the lines of Betty Freidan, which is compatible with my tastes. And certainly influenced my views. I didn't know she was Australian until your hoopla over there about the crocodile man on television. She wrote an article that blasted the myth apart, and as to what he really represented, and upset the more provincially minded on your island paradise.\n \n You stereotype feminists too much Winston. Including Simone, whether or she is really female, and not Chester. Your sexism repeatedly betrays you.\n \n Also, I don't think all views from the sixties are outmoded. Equality, civil rights, peace, etc. Everything we are today would not be, without that period in history shaping us.\n \n \nThanks, my weekend is finishing, the sun has set on this windy Sunday in Sydney.\n\n \n We're having lovely weather this weekend ourselves, but have mostly been working, and not out as much I'd like. Though I did get to do some hiking.\n \n I'm off to the market now.", 
   {}, 
   371673, 
   null, 
   1254071160.0
  ], 
  [
   371761, 
   null, 
   "Winston Smith", 
   "I agree, it's intriguing. I never read anything by her, though. Just about her. (i.e. she's dominatrix supreme.)\n\n \n dominatrix supreme? kinky. is this where the feminist path leads to ? \n \n \n \nWell put. I love the Met, though places in Europe make NYC pale in comparison ITO art.\n\n \n I wished we had a Met and a MOMA in Sydney, they are pretty good museums.\n MOMA is holding an exhibition of photographs called \"The Americans\" right now, wished I were there \n \n \n \nPerhaps, I read her too long ago to remember. Except that her thinking in feminism was more along the lines of Betty Freidan, which is compatible with my tastes. And certainly influenced my views. I didn't know she was Australian until your hoopla over there about the crocodile man on television. She wrote an article that blasted the myth apart, and as to what he really represented, and upset the more provincially minded on your island paradise.\n\n \n Never cared much for her ideology. More of a notoriety seeker if you ask me.\n \n \nYou stereotype feminists too much Winston. Including Simone, whether or she is really female, and not Chester. Your sexism repeatedly betrays you.\n\n \n and you accuse me of sterotyping feminists ?? emoticon_rolleyes\n \n \nAlso, I don't think all views from the sixties are outmoded. Equality, civil rights, peace, etc. Everything we are today would not be, without that period in history shaping us.\n\n \n I remember the 60's, I was in Chile, attending High School and later Uni, during those incredible years. We just couldn't understand what was going with the 'gringos'. Have they gone 'locos' ? To us they were just a bunch of rich spoiled kids, with nothing better to do and talking about things they knew nothing about. I am still of the same opinion about the hippies and the anti-war movement, bras burning women etc. The only sane voice was Martin Luther King jr. He was on a real mission.\n The hippies metamorphosed into yuppies and all the excesses of the 80's followed, neo-conservatives gained the upper ground in politics, Reagan became president, and look what eventually followed: the Bush era.\n So you are right, we are what we are today thanks to them we got the conservative backlash. I mean 'you' for American I ain't.\n \n \n \n \n \n We're having lovely weather this weekend ourselves, but have mostly been working, and not out as much I'd like. Though I did get to do some hiking.\n \n I'm off to the market now.\n\n \n I worked this weekend. The weather is also lovely in Sydney today, mowed the front lawn. We need some rain to wash the dust we copped last week.", 
   {
    "unicode_changes_made": true
   }, 
   371689, 
   null, 
   1254116040.0
  ], 
  [
   372062, 
   null, 
   "antonia", 
   "dominatrix supreme? kinky. is this where the feminist path leads to ? \n\n \n I am simply pointing out that \"feminism\" is more complex as a \"school\" than you apparently appreciate. You find this individual appealing as a thinker, and she is a feminist, and apparently, more from the *dominatrix* school of thinking -- which is how you characterize other feminists, who actually, are not from that school of thinking at all.\n \n \nI wished we had a Met and a MOMA in Sydney, they are pretty good museums.\n MOMA is holding an exhibition of photographs called \"The Americans\" right now, wished I were there \n\n \n I love the MOMA in NYC too, although they charge too high a fee for entrance. I think all museums should be easily accessible to the public.\n \n \nNever cared much for her ideology. More of a notoriety seeker if you ask me.\n\n \n Have you even read any of her books?\n \n \nand you accuse me of sterotyping feminists ?? emoticon_rolleyes\n\n \n I fail to see what your point is. My point is that you stereotype Simone, whoever Simone is.\n \n \nI remember the 60's, I was in Chile, attending High School and later Uni, during those incredible years.\n\n \n Yeah, well, so you say, Winston ...", 
   {
    "unicode_changes_made": true
   }, 
   371761, 
   null, 
   1254352800.0
  ], 
  [
   372069, 
   null, 
   "antonia", 
   "Btw, Winston, in point of contrast to your comments about the sixties in the U.S., this song Peter, Paul and Mary did is just as good now as it was then:\n \n YouTube - Peter Paul & Mary - These times they are a-changing\n \n Youtube had another recording of the group doing it more recently in a church, but unfortunately, I see it is removed for copyright reasons. It was a great recording. (John Sebastian joins them on the harmonica.) You could really appreciate the way Mary Travers had deepened as a singer and performer. She does that same solo with the verse compassionately appealing to parents, but it has this even wiser aspect in her expression (now that she's lived more herself). Plus, there is this joyful and triumphant quality in her older artistry, that isn't yet evident in Mary as a younger performer.\n \n But anyway, you can see how relevant these issues today, as then. Through a comparison of the two pieces.", 
   {}, 
   372062, 
   null, 
   1254353520.0
  ], 
  [
   372112, 
   null, 
   "Winston Smith", 
   "I am simply pointing out that \"feminism\" is more complex as a \"school\" than you apparently appreciate. You find this individual appealing as a thinker, and she is a feminist, and apparently, more from the *dominatrix* school of thinking -- which is how you characterize other feminists, who actually, are not from that school of thinking at all. \n\n \n I don't find her appealing as a thinker, just a 'talking head', whar should be clear from my comment of her idea of who is/was decadent.\n You called her a 'dominatrix' not I.\n \n \n \n \nI love the MOMA in NYC too, although they charge too high a fee for entrance. I think all museums should be easily accessible to the public. \n\n \n I was wrong, the exhibition I mentioned is at the Met, that if I remember correctly, ask for a 'donation'.\n \n \nHave you even read any of her books?\n\n \n Nope, and never will. I have seen her interviewed on TV, and read some articles she wrote for a newspaper. Not interested in what she has to say.\n \n \nI fail to see what your point is. My point is that you stereotype Simone, whoever Simone is.\n\n \n My point is that you are blind to your stereotyping of those who disagree with you. There is no need to stereotype simone, her posts speak for themselves.\n \n \n Yeah, well, so you say, Winston ...\n\n \n Are you calling me a liar?", 
   {}, 
   372062, 
   null, 
   1254407100.0
  ], 
  [
   372113, 
   null, 
   "Winston Smith", 
   "Had enough of her, let her R.I.P.", 
   {}, 
   372069, 
   null, 
   1254407220.0
  ], 
  [
   372179, 
   null, 
   "antonia", 
   "I don't find her appealing as a thinker, just a 'talking head', whar should be clear from my comment of her idea of who is/was decadent.\n You called her a 'dominatrix' not I.\n\n \n I do not call her a \"dominatrix.\" I said that she is characterized as such, within various streams of feminism.\n \n You are the one with this ridiculously simple-minded, stereotypical view of \"bra burning\", unshaven screaming hoards who shove men around. Who dominate.\n \n I am calling your guff. Because the thinker you criticize is actually at odds with the school of feminism that does emphasize dominance. While the thinker you find appealing is reputedly an expert at it.\n \n \nI was wrong, the exhibition I mentioned is at the Met, that if I remember correctly, ask for a 'donation'.\n\n \n You missed a great NY museum then. It's certainly worth the admission if you've never been there before (unless you don't like modern art).\n \n \nNope, and never will. I have seen her interviewed on TV, and read some articles she wrote for a newspaper. Not interested in what she has to say.\n\n \n She is from (what is now) a pretty conservative school of feminism, as I recall, from her books during the 1970's. She believes in the equality of men and women, and doesn't interact with men on a sexual plane, which drives some men (like yourself) crazy.\n \n \nMy point is that you are blind to your stereotyping of those who disagree with you.\n\n \n Where am I stereotyping?\n \n \nAre you calling me a liar?\n\n \n I am retaining my right to skepticism and free thought.", 
   {}, 
   372112, 
   null, 
   1254435900.0
  ], 
  [
   372180, 
   null, 
   "antonia", 
   "Had enough of her, let her R.I.P.\n\n \n Good-bye to you then.\n \n Her music, however, will live on for many years to come. \n \n May she not rest in peace. May she continue to inspire interested listeners, provoke controversy and discussion.\n \n YouTube - Peter Paul & Mary - The Rising of the Moon", 
   {}, 
   372113, 
   null, 
   1254436140.0
  ], 
  [
   372230, 
   null, 
   "Winston Smith", 
   "\n You missed a great NY museum then. It's certainly worth the admission if you've never been there before (unless you don't like modern art). \n\n \n I didn't miss MOMA at all. And I do like modern art. The new MOMA building although it is beautiful, the way the pictures are arranged is not to my liking.\n \n \nWhere am I stereotyping?\n\n \"She believes in the equality of men and women, and doesn't interact with men on a sexual plane, which drives some men (like yourself) crazy.\"\n \n right there. \n \n You labelled me, without even knowing anything about me, and no matter how many times I have expressed my view that sex neither limits nor defines a person, you persist with it. \n \n \n \n I am retaining my right to skepticism and free thought.\n\n \n I don't talk to people who insult me by calling me a liar, so talk with your skepticism (you don't know what the word means) and your free thought; free thought indeed! I can see by the way you are behaving in this forum, insulting people left and right, that I am not the only one who had enough of tolerating your insults. \n You really need help, medical help of the psychiatric kind. Pronto! No wonder you worry so much about universal health insurance emoticon_rolleyes\n \n Goodbye!", 
   {}, 
   372179, 
   null, 
   1254489540.0
  ], 
  [
   372315, 
   null, 
   "antonia", 
   "I didn't miss MOMA at all. And I do like modern art. The new MOMA building although it is beautiful, the way the pictures are arranged is not to my liking.\n\n \n Hm. Interesting. I've haven't been there for a while, so I can't comment further. Just that, since, I've been to some remarkable modern art museums that no one would particularly consider because of their locations. In my later years, I tend to feel more drawn to lesser known artists and their works. \n \n \n \"She believes in the equality of men and women, and doesn't interact with men on a sexual plane, which drives some men (like yourself) crazy.\"\n \n right there. \n \n You labelled me, without even knowing anything about me, and no matter how many times I have expressed my view that sex neither limits nor defines a person, you persist with it.\n[emphasis added]\n \n There you are wrong. I do know something about you because the way you interact on this board, and what you yourself often express in opinions about women. You say one thing, but you show another. In this particular instance, that is. It has nothing to do with stereotyping, except for your own.\n \n \nI don't talk to people who insult me by calling me a liar, so talk with your skepticism (you don't know what the word means) and your free thought; free thought indeed! I can see by the way you are behaving in this forum, insulting people left and right, that I am not the only one who had enough of tolerating your insults. \n\n \n I don't know if you're lying about your alleged experience in Chile, Winston (i.e. coming of age under Allende's assassination, a father who entertained the right wing intelligentsia, being tormented by the communists on the university campus who called you homophobic names, your later escape to Australia when Pinochet went down, etc etc). It's quite a tale. And you display many a board shenanigan, here, AFAICS. \n \n \nYou really need help, medical help of the psychiatric kind. Pronto!\n\n \n Because I'm a skeptic? LOL", 
   {}, 
   372230, 
   null, 
   1254544980.0
  ], 
  [
   372317, 
   null, 
   "JPSartre12", 
   "Hm. Interesting. I've haven't been there for a while, so I can't comment further. Just that, since, I've been to some remarkable modern art museums that no one would particularly consider because of their locations. In my later years, I tend to feel more drawn to lesser known artists and their works. \n \n [emphasis added]\n \n There you are wrong. I do know something about you because the way you interact on this board, and what you yourself often express in opinions about women. You say one thing, but you show another. In this particular instance, that is. It has nothing to do with stereotyping, except for your own.\n \n \n \n I don't know if you're lying about your alleged experience in Chile, Winston (i.e. coming of age under Allende's assassination, a father who entertained the right wing intelligentsia, being tormented by the communists on the university campus who called you homophobic names, your later escape to Australia when Pinochet went down, etc etc). It's quite a tale. And you display many a board shenanigan, here, AFAICS. \n \n \n \n Because I'm a skeptic? LOL\n\n \n Winston's known for his schizophrenic personality. Some people actually think he's a nice guy, but those of us that have known him for many years on at least 3 boards, know the real winston.", 
   {}, 
   372315, 
   null, 
   1254545280.0
  ], 
  [
   372327, 
   null, 
   "Winston Smith", 
   " Some people actually think he's a nice guy, but those of us that have known him for many years on at least 3 boards, know the real winston.\n\n \n some people think I am a nice guy? I wonder who, maybe 'mae, 'baron', 'j.p.\n and 'antonia' ? emoticon_rolleyes", 
   {}, 
   372317, 
   null, 
   1254547140.0
  ], 
  [
   372334, 
   null, 
   "Winston Smith", 
   "\n I don't know if you're lying about your alleged experience in Chile, Winston (i.e. coming of age under Allende's assassination, a father who entertained the right wing intelligentsia, being tormented by the communists on the university campus who called you homophobic names, your later escape to Australia when Pinochet went down, etc etc). It's quite a tale. And you display many a board shenanigan, here, AFAICS. LOL\n\n \n I have never said any of the above. You are a liar.\n \n you need help, not for being a liar, but for being such a humourless, hateful, insultive person, always carrying a chip on shoulder, always spoiling for a fight.\n \n \n Your 'crusades' (women's lib and health reform) are boring and repetitive posts.\n \n Pick a fight with someone else. I am done with you.", 
   {}, 
   372315, 
   null, 
   1254550260.0
  ], 
  [
   372427, 
   null, 
   "antonia", 
   "Winston's known for his schizophrenic personality. \n\n \n There we agree. I suppose it is safe, however, as long as one abides by general internet safety rules.", 
   {}, 
   372317, 
   null, 
   1254608460.0
  ], 
  [
   372428, 
   null, 
   "antonia", 
   "I have never said any of the above. You are a liar.\n\n \n You did so, on one of the abortion threads. But you also have an infamous habit (however your right) of taking down your posts after you put them up.\n \n You are the liar.\n \n What are you so afraid of, Winston? Are you to be hunted down at IKEA by former enemies in Chile?\n \n LOL\n \n \nyou need help, not for being a liar, but for being such a humourless, hateful, insultive person, always carrying a chip on shoulder, always spoiling for a fight.\n\n \n You are king of projection.\n \n \nYour 'crusades' (women's lib and health reform) are boring and repetitive posts.\n\n \n Too bad. I do not exist for your entertainment.\n \n \nPick a fight with someone else. I am done with you.\n\n \n Arivaderchi.\n \n http://www.youtube.com/watch?v=Fa3h3pnhg8s&feature=related", 
   {}, 
   372334, 
   null, 
   1254608640.0
  ], 
  [
   372500, 
   null, 
   "Winston Smith", 
   "You did so, on one of the abortion threads. But you also have an infamous habit (however your right) of taking down your posts after you put them up.\n \n You are the liar.\n \n What are you so afraid of, Winston? Are you to be hunted down at IKEA by former enemies in Chile? \n \n LOL \n\n \n No, why would I be afraid of anyone, what former enemies are you talking about ? You are a liar with a sick imagination\n \n \n \n \n \n \n \nArivaderchi.\n\n \n Don't try to write in a language you can't speak a word of, you mangle it. Stick to your American lingo\n \n \n YouTube - Leaving on a jet plane- peter, paul and mary\n\n \n funny that you never mention the males in her emoticon_rolleyes group. \n \n John Denver's version is superior, he composed this song, a little uncomfortable fact you fail to mention. It was already in my youtube favourites list.\n \n YouTube - John Denver - Leaving on a Jet Plane\n \n Insult someone else, there no shortages there from what I can see\n Stick to your crusades, you won't change a thing, except your blood pressure. emoticon_xdonno\n \n By the way, the Italian word you mangled is 'arrivederci', it means 'hasta la vista' in Spanish.\n \n Adios.", 
   {}, 
   372428, 
   null, 
   1254656580.0
  ], 
  [
   372519, 
   null, 
   "antonia", 
   "No, why would I be afraid of anyone, what former enemies are you talking about ? You are a liar with a sick imagination\n\n \n You are hysterically funny.\n \n \n funny that you never mention the males in her emoticon_rolleyes group.\n\n \n This is a great example of how you are so lost in your imagined stereotypes when you communicate with women, that you don't \"hear\" the person or individual who is \"speaking\" with you.\n \n For I told a story about one of the \"males in emoticon_rolleyes group\" right here on this board.\n \n You are forever having conversations with your fantasies.\n \n \nJohn Denver's version is superior, he composed this song, a little uncomfortable fact you fail to mention. It was already in my youtube favourites list.\n\n \n Sometimes you have a sense of humor and sometimes you are completely out of it.\n \n I also preferred John Denver's version, though I don't think it was \"superior.\" Hers was very appealing too when it came out back then. (It just doesn't stand the test of time, though, like some of their others. Neither does John Denver's.)\n \n \nInsult someone else, there no shortages there from what I can see\n Stick to your crusades, you won't change a thing, except your blood pressure. emoticon_xdonno\n\n \n There you go with your projections and stereotyping again. I even feel sorry for you at this point, Winston.\n \n \nBy the way, the Italian word you mangled is 'arrivederci', it means 'hasta la vista' in Spanish.\n\n \n At least I don't so completely mangle reality as you do.", 
   {}, 
   372500, 
   null, 
   1254673380.0
  ], 
  [
   372667, 
   null, 
   "Winston Smith", 
   "The original version by John Denver is the most popular in the i-tunes store, followed by the version of Peter, Paul and .... Oops! I meant Mary, Peter and Paul.\n \n \"Already I'm so lonesome I could cry ...\n \n I'm leavin' on a jet plane\n I dont know when Ill be back again..\"", 
   {
    "unicode_changes_made": true
   }, 
   372519, 
   null, 
   1254704640.0
  ], 
  [
   372671, 
   null, 
   "Winston Smith", 
   "washingtonpost.com\n \n Hard to believe that even a few parochial, navel gazing, gringos knew anything about her, albeit only a minority, of course. emoticon_rolleyes\n \n her interpretation of \"Gracias a la vida\" is not as good as Violeta Parra's masterpiece, though. But you can't improve on perfection.\n \n This one is my favourite, I never tire of listening to it: \n \n \n YouTube - Mercedes Sosa - Solo le Pido a Dios\n \n Vaya con Dios compañera Sosa, you made Argentina proud. Rest in a well deserved peace. Your voice, your music, your words will live in in me till the day I die.", 
   {
    "post_info": {
     "post_title": "Mercedes Sosa"
    }
   }, 
   372667, 
   null, 
   1254706200.0
  ], 
  [
   372687, 
   null, 
   "antonia", 
   "washingtonpost.com\n \n Hard to believe that even a few parochial, navel gazing, gringos knew anything about her, albeit only a minority, of course. emoticon_rolleyes\n \n her interpretation of \"Gracias a la vida\" is not as good as Violeta Parra's masterpiece, though. But you can't improve on perfection.\n \n This one is my favourite, I never tire of listening to it: \n \n \n YouTube - Mercedes Sosa - Solo le Pido a Dios\n \n Vaya con Dios compañera Sosa, you made Argentina proud. Rest in a well deserved peace. Your voice, your music, your words will live in in me till the day I die.\n\n \n She's magnificent and this is sad news, Winston, but ... compañera? Hard to believe that an Allende hater like yourself could feel that way about Mercedes Sosa.\n \n As well as, \"Vaya con Dios?\" From a perishable agnostic?\n \n What dramatis personae.", 
   {}, 
   372671, 
   null, 
   1254717960.0
  ], 
  [
   372689, 
   null, 
   "antonia", 
   "La Estrella Azul\n (Peteco Carabajal)\n \n Donde estará la estrella azul?,\n esa estrellita del alma;\n sus ojos suelen brillar\n perdidos en la inmensidad.\n \n A veces sueño que esta aquí\n y se ilumina el camino,\n cuando aparece el fulgor\n cerquita de mi corazón.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n En una lagrima quedo\n hasta perderse en el cielo;\n mi corazón se partió\n atravesado de penas.\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n En una lagrima quedo\n hasta perderse en el cielo;\n mi corazón se partió\n atravesado de penas.\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.", 
   {}, 
   372687, 
   null, 
   1254719580.0
  ], 
  [
   372707, 
   null, 
   "Winston Smith", 
   "La Estrella Azul\n (Peteco Carabajal)\n \n Donde estará la estrella azul?,\n esa estrellita del alma;\n sus ojos suelen brillar\n perdidos en la inmensidad.\n \n A veces sueño que esta aquí\n y se ilumina el camino,\n cuando aparece el fulgor\n cerquita de mi corazón.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n En una lagrima quedo\n hasta perderse en el cielo;\n mi corazón se partió\n atravesado de penas.\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n \n En una lagrima quedo\n hasta perderse en el cielo;\n mi corazón se partió\n atravesado de penas.\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n Donde estará la estrella azul?,\n ya no podré con mi dolor;\n en otros cielos brillara\n esa estrellita del amor.\n\n \n I know your intention is pure but, \n \n Why do you quote something you don't understand a single word of ? \n \n It is cr-ap, by the way. I don't like Peteco at all.\n \n Well, it is not all cr-ap, this verse is very good, sweet and sad:\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n but the music is flat, horrible.", 
   {}, 
   372689, 
   null, 
   1254750120.0
  ], 
  [
   372709, 
   null, 
   "Winston Smith", 
   "She's magnificent and this is sad news, Winston, but ... compañera? Hard to believe that an Allende hater like yourself could feel that way about Mercedes Sosa.\n \n As well as, \"Vaya con Dios?\" From a perishable agnostic?\n \n What dramatis personae.\n\n \n The problem with &#8216;crusaders&#8217; such as yourself is that you see everything in black and white, the &#8216;us&#8217; and &#8216;them&#8217; is how you divide the human race, and the &#8216;them&#8217; is the enemy. You carry a big chip on your shoulder and pick up a fight with anyone who disagrees with you, insults always follow.\n People such as myself, see not only black and white but every shade of grey in between.\n You don&#8217;t know the meaning of the word &#8216;agnostic&#8217;. You don&#8217;t know the meaning of the word &#8216;skeptic&#8217;.\n You are not a bad person though, superficial yes, but bad, no. \n Don&#8217;t worry about songs in Spanish, you not only need to learn the language but you have to live in Spain or South America for many years to understand the songs, to really understand the songs. You know nothing about Allende, you don&#8217;t know anything about Chile or Argentina, except what you read in tourist travel brochures.\n You know nothing about me. emoticon_xclown\n \n Now for something I really like and I hope you will like also :\n \n YouTube - THE MOTELS - TOTAL CONTROL LIVE VERSION\n \n Martha Davis was really something, what an underrated singer, but I don't care.\n \n Oh! one more thing you should have said 'dramatis persona' not 'personae', which is the plural form of persona. don't mangle latin, please stick to your lingo. emoticon_rolleyes", 
   {}, 
   372687, 
   null, 
   1254751020.0
  ], 
  [
   372858, 
   null, 
   "antonia", 
   "I know your intention is pure but, \n \n Why do you quote something you don't understand a single word of ? \n \n It is cr-ap, by the way. I don't like Peteco at all.\n \n Well, it is not all cr-ap, this verse is very good, sweet and sad:\n \n A nadie puedo preguntar\n con las palabras del alma;\n es mi tristeza un papel\n que el viento no deja caer.\n \n but the music is flat, horrible.\n\n \n So now we know that your alleged familarity with Mercedes Sosa is fraudulent. \n \n Where would you be without youtube?", 
   {}, 
   372707, 
   null, 
   1254797100.0
  ], 
  [
   372891, 
   null, 
   "Winston Smith", 
   "I have casettes of Mercedes Sosa and one CD I bought years ago.\n I have LPs of Atahualpa Yupanqui and one of Angel Parra singing his compositions.\n \n It useless trying to talk to you. I give up.\n \n Adios y vaya con Dios", 
   {}, 
   372858, 
   null, 
   1254826500.0
  ], 
  [
   373031, 
   null, 
   "antonia", 
   "\n Adios y vaya con Dios\n\n \n Vaya con Vida.\n \n YouTube - Joan Baez y Mercedes Sosa - Gracias a la vida", 
   {}, 
   372891, 
   null, 
   1254872940.0
  ], 
  [
   373033, 
   null, 
   "gansao", 
   "Fue la semana pasada, lo que realmente me puso a pensar,\n Acerca de cómo su señora se vuelve loco cuando vamos a beber\n La semana pasada, que terminó en una borrachera, \n Se bajó de su t * TS y mostró los porteros de su *****\n Y es la amenaza de lesiones corporales graves,\n Ella tiene que mantener la calma, y el uso de su encanto,\n Yo pensaba que era gracioso, me hizo reír,\n Cuando se lanzó el cenicero en el personal del bar\n \n Goldie busca la cadena de", 
   {}, 
   373031, 
   null, 
   1254873720.0
  ], 
  [
   373039, 
   null, 
   "Baron", 
   "\"It's useless trying to talk to you. You are not a bad person, superficial yes. Oh, and don't mangle latin.\"\n \n \"Adios y vaya con Dios.\" \n \n \n So how does it feel to be thrown under the bus Antonia. The good bye sounds like,\" Go with God, just go\"\n \n Sorry, I couldn't resist because it is so typical.\n \n Ciao", 
   {}, 
   373033, 
   null, 
   1254875100.0
  ], 
  [
   373044, 
   null, 
   "antonia", 
   "\n So how does it feel to be thrown under the bus Antonia.\n\n \n Not like being thrown under a bus, for sure. Since that would mean winston were a bus driver one had decided to ride with, to begin with .. \n \n More like, so .. ridiculous .. how can anyone take it seriously. Kind of detached, I guess.\n \n \nSorry, I couldn't resist because it is so typical.\n \n Ciao\n\n \n On the bright side, maybe winston is not a psychopath, but a dadaist writer, and a very bad one.\n \n One can really see his mom issues though.\n \n Ciao", 
   {}, 
   373039, 
   null, 
   1254878700.0
  ], 
  [
   373163, 
   null, 
   "antonia", 
   "What will turn up next on the Mary Travers thread? \n \n While waiting ....\n \n YouTube - Jose Feliciano - Malaguena", 
   {}, 
   373044, 
   null, 
   1254943080.0
  ], 
  [
   373736, 
   null, 
   "Mintaka", 
   "Okay like a folk music thread? My sister is a folk singer and knew Mary Travers in the Village. I also like Sosa and Baez in that link. Here is Baez again in Paris @ youtube.com/watch?v=o5nzFgvvMi0&feature=related. Peace and best wishes.", 
   {}, 
   373163, 
   null, 
   1255155960.0
  ], 
  [
   374131, 
   null, 
   "Easyrider", 
   "Okay like a folk music thread? My sister is a folk singer and knew Mary Travers in the Village. I also like Sosa and Baez in that link. Here is Baez again in Paris @ youtube.com/watch?v=o5nzFgvvMi0&feature=related. Peace and best wishes.\n\n \n Do you have any specific information on Mary Traver's funeral? What date did it occur; what church, if any? Where was she laid to rest? Thanks.", 
   {}, 
   373736, 
   null, 
   1255400280.0
  ], 
  [
   374189, 
   null, 
   "jyoshu", 
   "Alright, back on topic, I've loved the music of Peter Paul & Mary for a long time. While I don't always agree with the extent of their politics, they were a great musical trio and I loved their passion and many of the things they stood for. There are some very nice vids of them online, particularly a color one of them performing 'Jane, Jane' in 1966 that really shows Mary Travers' enthusiasm, and a b&w one I particularly like of 'Early Mornin' Rain'.", 
   {}, 
   374131, 
   null, 
   1255451580.0
  ], 
  [
   374190, 
   null, 
   "jyoshu", 
   "I know either Peter or Paul is a Christian but I'd like to know what Mary thought.\n\n \n Paul is.\n He's well known for \"The Wedding Song\" which is pretty blatantly Christian.\n It's beautiful.", 
   {}, 
   371544, 
   null, 
   1255451880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mary Travers", 
  "url": "http://www.4forums.com/political/entertainment-debates/13333-mary-travers.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 13333, 
  "discussion_files": [
   [
    "10721.html", 
    "http://www.4forums.com/political/entertainment-debates/13333-mary-travers-print.html"
   ], 
   [
    "10722.html", 
    "http://www.4forums.com/political/entertainment-debates/13333-mary-travers-3-print.html"
   ], 
   [
    "10723.html", 
    "http://www.4forums.com/political/entertainment-debates/13333-mary-travers-2-print.html"
   ]
  ], 
  "identifier": 13333
 }
]