[
 [
  [
   372137, 
   null, 
   "JPSartre12", 
   "Have we really transcended common sense THAT much? emoticon_rolleyes\n \n \n\n Study to determine cows' greenhouse gas emissions\n \n Any calculation of the carbon footprint of a gallon of milk needs to include fuel used by tractors and trucks, as well as electricity consumed by milking machines and refrigerators. But how much gas is coming from the cows themselves?\n That's the question Purdue Univ. researchers are investigating as they start a new study aimed at measuring greenhouse gases from dairy cows. Albert Heber, principal investigator and a professor of agricultural and biological engineering, said the study is part of an industry-wide effort to reduce greenhouse gas emissions related to fluid milk.\n \"The dairy industry understands that in order to adopt best practices that will help lower greenhouse gas emissions in the dairy supply chain, it must first know where the mitigation opportunities exist,\" Heber said.\n The study is being funded by the Innovation Center for U.S. Dairy and is one of several studies that will be used to measure the entire carbon footprint of fluid milk - from the farm to the glass. Researchers from the Univ. of California Davis, Cornell Univ., the Univ. of Minnesota, and Washington State Univ. are collaborating on the project.\n \"Measuring the greenhouse gas emissions of dairy cows will help determine the extent to which the dairy industry contributes to U.S. greenhouse gas emissions,\" said Rick Naczi, the group's executive vice president of strategic industry analysis and evaluation. \"Preliminary scan level research was conducted last year that showed the dairy industry accounts for less than 2 percent of total U.S. greenhouse gas emissions. Now, we are expanding our efforts by partnering with respected academic institutions like Purdue and engaging in extensive research to assure that our efforts are based on sound science as we address the environmental, economic and social importance of reducing our carbon footprint.\"\n Carbon dioxide, methane and nitrous oxide will be monitored at five barn sites and two manure lagoons in Indiana, Wisconsin, California, Washington and New York. Mobile laboratories set up for the National Air Emissions Monitoring Study, of which Heber also is principal investigator, are being used to take the measurements in this study as well.\n Study to determine cows greenhouse gas emissions | R&D Mag\n", 
   {
    "post_info": {
     "post_title": "The Dreaded Cow Fart"
    }
   }, 
   null, 
   null, 
   1254419160.0
  ], 
  [
   372150, 
   null, 
   "simone", 
   "Obviously, you know little of the nature of cows.\n \n There are a number of factors to consider, I hope the complexity of the issue does not tax your brain too much:\n Deforestation:\n \nOver 80% of the dry tropical forests from northern Costa Rica to Mexico have been cut down. Areas of this size and larger have been cut down throughout the world including the Amazon, Indonesia, the Congo and other rain forests. The temperature after removing the rain forest has risen dramatically in these large tracts of land. The weather pattern also changes from this deforestation in each locality and they become drier. When these huge areas have their trees removed, erosion dumps millions of tons of sediment into the rivers that flow into the oceans. This sediment slowly suffocates the polyps of the precious coral reefs in the tropics. What is the main reason for cutting these rain forests down? The main reason is to make room to raise cattle, not logging as many people think. With logging they generally cut down large hardwoods. To raise cow meat they cut down everything.\n\n Clear-cutting??? - Yahoo! Answers\n \n Where does this beef go? What are the costs of eating beef? \n \nIn Central America much of the beef is exported to the United States. The cattle industry, over all, causes more global warming than car emissions do. .. A person who eats cow meat (beef) as their main protein source requires about 20 acres of land each year and over 2000 gallons of precious water to raise that steer for protein. That is not sustainability. \n\n The issue of methane:\n \nA person eating soy for their main source of protein only requires one acre of land and about 40 gallons of water each year to grow it. Also, soy doesn't add millions of tons of methane gas each year to our atmosphere. it actually absorbs co2. Cows produce over 100 million tons of this global warming methane gas in the U.S. alone. Cattle excrement also is adding to major pollution problems in our water systems today.\n\n Obviously, you've never had to tiptoe through a cow pasture, city boy, and you know little of the ins and outs of raising beef.", 
   {}, 
   372137, 
   null, 
   1254422340.0
  ], 
  [
   372157, 
   null, 
   "JPSartre12", 
   "...\n Obviously, you've never had to tiptoe through a cow pasture, city boy, and you know little of the ins and outs of raising beef.\n\n \n LOL. I grew up in the Garden State amongst the miles of cornfields, tomato plants, peach orchards, etc. . (I guess that makes me one of the Children of the Corn, but I digress). \n \n If you read the article, you'd know that it's looking at dairy cattle. Now, I'm guessing that you must be a city slicker 'cuz you don't know the difference between a cow and a steer. (You milk the cow; you run from the steer, in case you're interested) ;)", 
   {}, 
   372150, 
   null, 
   1254424140.0
  ], 
  [
   372218, 
   null, 
   "Jo Bennett", 
   "LOL. I grew up in the Garden State amongst the miles of cornfields, tomato plants, peach orchards, etc. . (I guess that makes me one of the Children of the Corn, but I digress). \n \n If you read the article, you'd know that it's looking at dairy cattle. Now, I'm guessing that you must be a city slicker 'cuz you don't know the difference between a cow and a steer. (You milk the cow; you run from the steer, in case you're interested) ;)\n\n \n You run from the cow too if you've got between her and her calf. There have been a couple of incidents of trampling by cows in Britain recently, mostly dog related.", 
   {}, 
   372157, 
   null, 
   1254463320.0
  ], 
  [
   372242, 
   null, 
   "simone", 
   "LOL. I grew up in the Garden State amongst the miles of cornfields, tomato plants, peach orchards, etc. . (I guess that makes me one of the Children of the Corn, but I digress). \n \n If you read the article, you'd know that it's looking at dairy cattle. Now, I'm guessing that you must be a city slicker 'cuz you don't know the difference between a cow and a steer. (You milk the cow; you run from the steer, in case you're interested) ;)\n\n Sounds like you don't know the difference between a bum steer and a pile of bull...", 
   {}, 
   372157, 
   null, 
   1254502740.0
  ], 
  [
   372245, 
   null, 
   "JPSartre12", 
   "You run from the cow too if you've got between her and her calf. There have been a couple of incidents of trampling by cows in Britain recently, mostly dog related.\n\n \n I try not to get between any mother and her young. Even geese get hostile and hiss at you if you do. ;)\n \n \nSounds like you don't know the difference between a bum steer and a pile of bull...\n\n \n Sure I do. One is bad advice; the other is one of your posts. ;)", 
   {}, 
   372242, 
   null, 
   1254503340.0
  ], 
  [
   372246, 
   null, 
   "simone", 
   "Giggle! Do you know the difference between a bull and a steer, \"Sartre\"?", 
   {}, 
   372245, 
   null, 
   1254505200.0
  ], 
  [
   372261, 
   null, 
   "JPSartre12", 
   "Giggle! Do you know the difference between a bull and a steer, \"Sartre\"?\n\n \n Sure do. Do YOU know what a pizzle is? ;)", 
   {}, 
   372246, 
   null, 
   1254514800.0
  ], 
  [
   372372, 
   null, 
   "simone", 
   "Is that one of your rude street terms that you learned from your thug friends, \"Sartre\"?", 
   {}, 
   372261, 
   null, 
   1254593580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Dreaded Cow Fart", 
  "url": "http://www.4forums.com/political/environmental-debates/13363-dreaded-cow-fart.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 13363, 
  "discussion_files": [
   [
    "17744.html", 
    "http://www.4forums.com/political/environmental-debates/13363-dreaded-cow-fart-print.html"
   ]
  ], 
  "identifier": 13363
 }
]