[
 [
  [
   372293, 
   null, 
   "antonia", 
   "Atlantic Embed", 
   {
    "post_info": {
     "post_title": "Wingnut Traitors Cheer America's Olympic Bid Loss"
    }
   }, 
   null, 
   null, 
   1254537720.0
  ], 
  [
   372300, 
   null, 
   "jyoshu", 
   "On what basis are you assuming these people in the video are \"wingnuts\"?\n My understanding is that there was definitely a significant contingent of average folks in Chicago that weren't particularly wanting the Olympics there. It's not automatically a good thing. In fact, according to one article (below), less that 50% of the residents there wanted it.\n \n\"The Olympics would have lasted 17 days, he noted, but \"who knows what we would have had to deal with after that? I mean, taxpayers are probably going to end up paying for this.\"\n \n David Hoffmann, CEO of Arts and Artisans gallery on Chicago's North Michigan Avenue, was pleased with the news.\n \n \"I'm delighted,\" he said. \"For one month of good sales in our business, we would have had every landlord in town try to really do us a number on our next lease negotiations.\"Olympic decision disappoints many -- but not all -- Chicagoans - CNN.com\n\n \n \nChicago's bid to host the 2016 Olympics has the support of some of the world's most famous people as Barack Obama, Oprah Winfrey, Michael Jordan and Michael Phelps have each publicly backed the bid. Unfortunately for the bid's organizers, many of the city's residents don't feel the same way.\n \n Of the four cities bidding for the Games, Chicago has the lowest amount of public support by a wide margin. According to recent polling, less than 50 percent of the city's residents support the city's proposal to host the Olympics.Will tepid support in Chicago derail the city's Olympic chances? - Fourth-Place Medal - OLY - Yahoo! Sports\n", 
   {}, 
   372293, 
   null, 
   1254541080.0
  ], 
  [
   372301, 
   null, 
   "Archangel", 
   "I needn't even respond to your whining, all I need do is connect the dots of his corrupt cronies to produce the trail of fraud that would have taken place if their scheme had played out. And all at the expense of the poor tax payers who are always the victims of the low lifes.\n Olympics Crony Watch: Let the games begin\n By Michelle Malkin \u0095 September 22, 2009 11:00 AM\n Last week, I spotlighted Valerie Jarrett and Michelle Obama's collaborative efforts to push their mentor, friend, and former employer Chicago mayor Richard Daley's bid to bring the Olympics to Chicago in 2016.\n From now until Oct. 2, when the International Olympic Committee votes on the decision in Copenhagen, I'll keep tabs on all the Chicago scheming with an Olympics Crony Watch.\n The latest news on the p.r. front? Jarrett is hinting that The Crony-in-Chief himself may make an appearance in Copenhagen:\n President Barack Obama personally gave the order to send a White House advance team to Copenhagen and would \"love\" to be there himself next week to argue Chicago's case for the 2016 Olympics.\n That's the word from key presidential aide Valerie Jarrett in the latest and perhaps strongest sign that last week's suggestion that Obama would skip Copenhagen has changed.\n In a phone interview Monday, Ms. Jarrett, a senior adviser to the president who heads the White House's new office on the Olympics, said the decision to send the advance team to Copenhagen to prepare for a possible presidential visit \"was his\": Mr. Obama's. Sending the team will \"preserve the option\" that the president can join first lady Michelle Obama, who already is scheduled to travel to the Oct. 2 IOC meeting.\n \"(Mr. Obama) would love to be there,\" Ms. Jarrett said. \"He (just) wants to make sure his absence won't be harmful\" to ongoing negotiations in Washington over national health care reform.\n Ms. Jarrett said the president several days ago personally communicated his desire to be in Copenhagen to Mayor Richard M. Daley.\n \"The president has been an ardent supporter from the beginning,\" Ms. Jarrett added. \"He cares passionately about bringing the Olympics to Chicago. . . .It's good for the U.S. and it's good for Chicago. We talk about it every day.\"\n They talk about it every day.\n Priorities.\n Jarrett and FLOTUS will travel ahead of POTUS and are scheduled to land in Copenhagen on Sept. 30.\n Taxpayers, hold on to your wallets:\n Mayor Richard M. Daley and Patrick Ryan assure Chicago taxpayers that a safety net of insurance would insulate them from the financial risks of hosting the 2016 Olympics.\n But the insurance policies Mr. Ryan says he'll secure would cover only about $1.1 billion of the $3.8-billion operating budget that the mayor's Olympic point man has drawn up for the games. In many key areas, no insurer stands between taxpayers and the risk of revenue shortfalls or cost overruns.\n For example, there's no insurance against the risk that private lenders won't shell out $1 billion to finance construction of the Olympic Village, as Messrs. Daley and Ryan predict they will. And there's no coverage against shortfalls in corporate sponsorship sales, which they predict will rake in $1.8 billion, two-thirds more than London expects to collect for the 2012 games.\n Oh, and did you know that there is a White House Olympics office?\n \"Even if [White House officials] don't give financial guarantees, at least now they can say there is some government support behind the Olympic bid, and they've never been able to say that,\" said Mallon. \"We've never had anything approaching this. Historically, the U.S. government\n has said, 'We don't want to have anything to do with governing the Olympic Games and supporting Olympic sports in the United States.\"\n The new office - officially called the White House Office of Olympic, Paralympic and Youth Sport - will \"coordinate federal resources, and act as liaison to, any organizing committee for an Olympic and Paralympic Games hosted in the United States,\" according to a statement announcing the new office.\n The office also will work to promote youth sports, particularly in urban areas, the statement says. \"As the International Olympic Committee moves forward with their selection process we hope that this new office can serve as a model for youth involvement worldwide,\" Obama said in the statement.\n The White House did not answer questions about staffing or budgeting, but did say the office would be housed in the White House Office of Public Engagement, whose top leadership includes Jarrett.\n Guess who else gets a windfall? Senior White House adviser David Axelrod's p.r. firm, AKPD, which has done work for the nonprofit corporation formed to lure the 2016 Olympics to Chicago.\n Steve Bartin sums up the Olympic-sized graft and taxpayer rip-offs that lie ahead:\n In Chicago, prestige is important, but graft is the real king. In Chicago, one of the most corrupt big cities, the Olympics represents, more than anything, a grand chance for a giant heist.\n Economists have a technical term for profiting from the political process: it's called rent-seeking. Chicago's politically favored businesses, unions, and insiders with ties to Mayor Daley and Alderman Burke have perfected this activity. The Olympics just provide another opportunity to clean up at the public expense.\n This is how it works. On Chicago public works projects, those on the inside hope to get overpaid at the expense of Illinois and federal taxpayers. Now throw in the Olympics where opportunities for such activities have long been rife with corruption and you can understand the glee in the Chicago machine's eyes.\n Right now there isn't any financial guarantee from the federal government. But Chicago's power elite hopes Rahm Emanuel, Valerie Jarrett, David Axelrod, and others can convince the Congress at some point to help with Chicago's Olympic sized costs if they get the 2016 games. They can always call it a \"stimulus\"!\n ...The fear of cost overruns, a history of bloated union contracts, and fraud has tempered enthusiasm for the Olympics. Mayor Daley has had to promise tighter oversight on the whole Olympics process. Yet this has not prevented an effective grass roots opposition organization from springing up. No Games Chicago has been instrumental at raising questions of money and accountability, dampening public support for the games. No Games Chicago spokesman Thomas Tesser explains:\n The City Council voted to give oversight of the City's Olympic commitments to Ald. Ed Burke, chairman of the Finance Committee. This is the final cruel joke played by the Council on the taxpayers. Burke has become a millionaire doing deals with firms that have business with the city and has collected millions in campaign contributions from firms doing business with the city. Pat Ryan, the chairman of the 2016 effort, contributed $3,000 to Burke. Burke didn't mention that he has ten clients who are major donors to the 2016 Committee, giving a total of at least $1 million in cash and services, and likely much, much more.\n But, Alderman Burke isn't the only insider benefiting from the Olympics. Real Estate developer Michael Scott also stands to gain. The Chicago Tribune reports of Scott: \"A member of Mayor Richard Daley's team working to bring the Olympics to Chicago has quietly arranged to develop city-owned land near a park that would be transformed for the 2016 Summer Games, potentially positioning himself to cash in if the Games come here.\"\n Michael Scott is also President of the Chicago Public School board. The Chicago Sun-Times reported that Scott\n has been subpoenaed to testify before a federal grand jury investigating how students are chosen for admission to some of the city's most elite public schools.\n This new scandal might put in to question Secretary of Education Arne Duncan's leadership as CEO of the Chicago Public School system.\n All the recent skepticism of the cost of the games couldn't stop Chicago insiders from getting the stunning vote of support from Chicago's City Council. This is still a one-party, all-machine, all-the-time town. In a vote of 49-0, the City Council showed that there is not a single vote to back the nearly fifty percent who oppose Mayor Daley's plans.\n Michelle Obama will lead a Chicago delegation for the last pitch for the games in Copenhagen next month. Some speculate that President Obama will make a dramatic last minute appearance to make Chicago's case in front of the International Olympic Committee. No one knows for sure whether Chicago will get the 2016 games but if it does, it will be a grand feeding time at the trough for the insiders and ever bigger burdens on the less well-connected businesses and individuals who inhabit Chicago.\n \n Michelle Malkin Olympics Crony Watch: Let the games begin", 
   {
    "unicode_changes_made": true
   }, 
   372293, 
   null, 
   1254541440.0
  ], 
  [
   372302, 
   null, 
   "antonia", 
   "On what basis are you assuming these people in the video are \"wingnuts\"?\n\n \n Because they're cheering for the defeat of their country in an international competition. They're so right wing, they're nuts. That's the basic meaning of the term. They would even see America lose if it meant advancing their petty political aims and vested corporate interests.\n \n \nMy understanding is that there was definitely a significant contingent of average folks in Chicago that weren't particularly wanting the Olympics there.\n\n \n That's not what your own linked article says. It says a significant contingent of average folks DO want it there, and a few don't.\n \n \n It's not automatically a good thing.\n\n \n There are always local issues with Olympics because it drives the cost of living up in the area where it's held. But overall, it's good for the economy of the area, and a lot of mid-westerners, in Chicago itself as well as the surrounding area, were hoping for the Olympics because it would bring in jobs.\n \n What a pathetic group, calling themselves \"Americans for Prosperity\" and cheering the downfall of an event that would bring more prosperity into Chicago for their fellow Americans.\n \n Maybe you didn't notice, but unemployment is pretty high right now, buddy.", 
   {}, 
   372300, 
   null, 
   1254541920.0
  ], 
  [
   372304, 
   null, 
   "antonia", 
   "I needn't even respond to your whining, all I need do is connect the dots of his corrupt cronies to produce the trail of fraud that would have taken place if their scheme had played out. And all at the expense of the poor tax payers who are always the victims of the low lifes.\n\n \n What a joke, you talking about corruption, Archangel. Supporter of Peter Paul, international crook who ripped off millions of dollars in people's retirement funds, and illegally fled justice over international borders ... lying to customs officials ... and ironically .. to Brazil. Where he was later extradited from. So dishonest that a federal judge instructed the jury to be aware that they were listening to a seasoned con man on the witness stand.\n \n You talking about corruption, Archangel. Supporter of the treasonous Bush administration who sold this country down the river, its international borders, its jobs, and in cohoots with wealthy Latin American criminals in places like ... ironically .. Brazil.\n \n No wonder that you should now be supporting the downfall of your nation outright. You're so crazed with your cause that you would probably even hand this country over to foreign powers, if you could. If it meant winning an election, putting incompetents like Sarah Palin in power, who can't even recognize a phony phone call from not-the-French-President.\n \n I wouldn't be surprised if the GOP campaigned with organized criminal elites in Brazil for them to win the Olympic bid against the United States. They're such a sickening lot, the GOP, and you support them, Archie. In your wingnut zeal, you applaud the defeat of the United States of America. You've reached a new low.\n \n Why don't you all just move to Brazil where you belong?", 
   {}, 
   372301, 
   null, 
   1254542460.0
  ], 
  [
   372307, 
   null, 
   "jyoshu", 
   "Because they're cheering for the defeat of their country in an international competition. They're so right wing, they're nuts. That's the basic meaning of the term. They would even see America lose if it meant advancing their petty political aims and vested corporate interests.\n\n \n I think you're getting a little carried away. Not everyone felt that winning such a \"competition\" would be a good thing, necessarily. Just because they were cheering that Chicago didn't get the Olympics doesn't mean they were cheering against America.\n \n \nThat's not what your own linked article says. It says a significant contingent of average folks DO want it there, and a few don't.\n\n \n Um, over 50% isn't \"a few\". It's the majority.\n \n \nThere are always local issues with Olympics because it drives the cost of living up in the area where it's held. But overall, it's good for the economy of the area, and a lot of mid-westerners, in Chicago itself as well as the surrounding area, were hoping for the Olympics because it would bring in jobs.\n\n \n Maybe so; maybe not; nevertheless with over half of Chicago residents not supporting, it's pretty presumptuous to assume they are just \"wingnuts.\" Obviously it was pretty mainstream there to prefer Chicago not host the Olympics.", 
   {}, 
   372302, 
   null, 
   1254543120.0
  ], 
  [
   372311, 
   null, 
   "foundit66", 
   "I think you're getting a little carried away, to say the least. Not everyone felt that winning such a \"competition\" would be a good thing, necessarily.\n\n And some of those \"not everyone\" were wanting it to fail as a political blow to Obama...\n THAT is the point... emoticon_rolleyes\n \n \n \nUm, over 50% isn't \"a few\". It's the majority.\n\n It's also a BLOWI.\n Blatant Lie or Willful Ignorance on your part.\n \n Let's talk about reality instead of your misrepresentation...A poll released this month by the Chicago Tribune showed residents almost evenly split, with 47 percent in favor of the bid and 45 percent against; that's a drop from the 2-1 support the newspaper found in a February poll.\n \n The 2016 bid committee said its own poll last week shows support from 72 percent of Chicagoans. But even that segment has concerns.Some Chicago residents hoping Olympics bid a bust - Yahoo! News\n \n In ONE poll that was close, MORE people were FOR the bid than against it.\n In TWO OTHER polls that were not close, a vast majority of people were FOR the bid.\n \n I would start to wonder what was wrong with that one poll that makes it so atypical...\n Perhaps some changed their minds when they found out Obama was going to be associated with the bid... emoticon_rolleyes\n \n \n \nMaybe so; maybe not; nevertheless with over half of Chicago residents not supporting...\n\n Quit misrepresenting the article.\n NOWHERE did it say \"over half of Chicago residents not supporting\". :xbanghead", 
   {}, 
   372307, 
   null, 
   1254543720.0
  ], 
  [
   372314, 
   null, 
   "foundit66", 
   "One example...\n \n \nSo how will all these conservatives who have been rooting against the United States react now that their rhetoric has become reality? On Twitter, former Bush spokesman Scott Stanzel cautioned Republicans against gloating: \"Note to GOP officials/consultants - resist the temptation to pile on about Chicago losing the Olympic bid just because Obama made the pitch.\" His message didn't reach RedState's Erick Erickson, who immediately wrote:\n  Hahahahaha. I thought the world would love us more now that Bush was gone. I thought if we whored ourselves out to our enemies, great things would happen. Apparently not.\n Bringing the Olympics wasn't about cronyism. Besides U.S. pride, it was about an event that could have generated $22.5 billion in economic activity and the equivalent of 315,000 new full-time jobs in America.\n\n Right-Wingers Root Against U.S., Then Celebrate Olympic Bid Failure | Video | AlterNet", 
   {
    "unicode_changes_made": true
   }, 
   372311, 
   null, 
   1254544620.0
  ], 
  [
   372320, 
   null, 
   "JPSartre12", 
   "Atlantic Embed\n\n \n Hosting a modern Olympics is like throwing money down a bottomless pit. I can't remember the last Olympics that didn't have a NEGATIVE impact on the host country. China dropped a bundle on the last one, but they knew they would. It was a giant PR campaign for them.\n f Obama had any sense, he would have known that AND the fact that 1/2 of the residents of Chicago didn't even want to get the Olympics.", 
   {}, 
   372293, 
   null, 
   1254545700.0
  ], 
  [
   372331, 
   null, 
   "Archangel", 
   "What a joke, you talking about corruption, Archangel. Supporter of Peter Paul, international crook who ripped off millions of dollars in people's retirement funds, and illegally fled justice over international borders ... lying to customs officials ... and ironically .. to Brazil. Where he was later extradited from. So dishonest that a federal judge instructed the jury to be aware that they were listening to a seasoned con man on the witness stand.\n \n You talking about corruption, Archangel. Supporter of the treasonous Bush administration who sold this country down the river, its international borders, its jobs, and in cohoots with wealthy Latin American criminals in places like ... ironically .. Brazil.\n \n No wonder that you should now be supporting the downfall of your nation outright. You're so crazed with your cause that you would probably even hand this country over to foreign powers, if you could. If it meant winning an election, putting incompetents like Sarah Palin in power, who can't even recognize a phony phone call from not-the-French-President.\n \n I wouldn't be surprised if the GOP campaigned with organized criminal elites in Brazil for them to win the Olympic bid against the United States. They're such a sickening lot, the GOP, and you support them, Archie. In your wingnut zeal, you applaud the defeat of the United States of America. You've reached a new low.\n \n Why don't you all just move to Brazil where you belong?\n\n \n Who's Peter Paul? What office did he run for and earn, gaining for himself a position of power that allowed him to manipulate the system from within it and to actually reshape it in his corrupted image? You speak of unknown criminals and compare them to Obama who is using his elected position to betray the country he was entrusted to serve. This is the guy who spent more money which we don't have in his first 100 days than Bush spent in his whole 8 years in 2 wars. Bush was a street mugger compared to Obama who is a sophisticated crime lord in practicing what he learned as a political insider in the most historically corrupt city in america. \n \n Just study the corruption his developer buddies carried out in the slums of chicago as they collected millions of dollars for redevelopment of these tenements which they pocketed as they allowed their alleged black constituents to continue to live in rat infested squalor. Remember Tony Rezco's conviction antonia? Here, once again, rather that making unsubstantiated accusations I will document the corruption I refer to. Obama Fundraiser Convicted on 16 Money Laundering Charges America's Watchtower\n \n Here's more if you really care to learn what this scumbag stands for.\n Atlas Shrugs: Obama's Corruption Eruption\n \n TPMMuckraker | Talking Points Memo | Obama and Rezko: TPM's Timeline\n \n Right Wing Nut House Obama-Rezko\n \n And if you feel very adventurous, read this timeline of Obama's socialist/marxist/communist awakening. This as you all continue to deny that he is one. While never explaining why he would surround himself with them unless he shared their radical ideology.\n \n Newsvine - The Obama Timeline: 1961-2008 HOW MANY LIES CAN YOU FIND!!", 
   {
    "unicode_changes_made": true
   }, 
   372304, 
   null, 
   1254548700.0
  ], 
  [
   372335, 
   null, 
   "jyoshu", 
   "And some of those \"not everyone\" were wanting it to fail as a political blow to Obama...\n THAT is the point... emoticon_rolleyes\n\n \n Prove that for the people in video that tehy were wanting to see it fail as a blow to Obama ... You're point is hollow.\n \n Let's talk about reality instead of your misrepresentation...A poll released this month by the Chicago Tribune showed residents almost evenly split, with 47 percent in favor of the bid and 45 percent against; that's a drop from the 2-1 support the newspaper found in a February poll.\n \n The 2016 bid committee said its own poll last week shows support from 72 percent of Chicagoans. But even that segment has concerns.Some Chicago residents hoping Olympics bid a bust - Yahoo! News\n \n \nI would start to wonder what was wrong with that one poll that makes it so atypical...\n Perhaps some changed their minds when they found out Obama was going to be associated with the bid... emoticon_rolleyes\n\n \n Meh. No more so that some in the other polls jumped on the Olympics bandwagon when discovering their cult of personality figure was going to battle for them ...\n \n \nQuit misrepresenting the article.\n NOWHERE did it say \"over half of Chicago residents not supporting\". :xbanghead\n\n \n It said, quite clearly, that less than 50% of Chicago residents support it. Back to your reading practice, I guess.", 
   {}, 
   372311, 
   null, 
   1254551580.0
  ], 
  [
   372336, 
   null, 
   "jyoshu", 
   "Hosting a modern Olympics is like throwing money down a bottomless pit. I can't remember the last Olympics that didn't have a NEGATIVE impact on the host country. China dropped a bundle on the last one, but they knew they would. It was a giant PR campaign for them.\n f Obama had any sense, he would have known that AND the fact that 1/2 of the residents of Chicago didn't even want to get the Olympics.\n\n \n Exactly. It's a money pit.\n NO WONDER people didn't want it.\n They weren't \"wingnuts\", they were concerned citizens.", 
   {}, 
   372320, 
   null, 
   1254551760.0
  ], 
  [
   372341, 
   null, 
   "foundit66", 
   "Prove that for the people in video that tehy were wanting to see it fail as a blow to Obama ... You're point is hollow.\n\n emoticon_rolleyes\n First of all, I was commenting on the issue of \" Wingnut Traitors Cheer America's Olympic Bid Loss \", which I substantiated.\n As for the video, I watched it and was annoyed at how absolutely little detail there was regarding it. We don't even know why those people were in that room in the first place.\n Without any real information, I felt the best way to respond to the topic was to provide independent substantiation.\n \n Secondly, your response could easily be turned back on its ear. Demanding you prove it was just about the finances.\n \n \n \nLet's talk about reality instead of your misrepresentation...A poll released this month by the Chicago Tribune showed residents almost evenly split, with 47 percent in favor of the bid and 45 percent against; that's a drop from the 2-1 support the newspaper found in a February poll.\n \n The 2016 bid committee said its own poll last week shows support from 72 percent of Chicagoans. But even that segment has concerns.Some Chicago residents hoping Olympics bid a bust - Yahoo! News\n\n I take it you have no comment on this? emoticon_rolleyes\n \n \n \nMeh. No more so that some in the other polls jumped on the Olympics bandwagon when discovering their cult of personality figure was going to battle for them ...\n\n ROFLMAO!\n I really wish some people could get out of the Christian apologetic mind-set.\n It seems to lead people to just toss out a retort, without even bothering to think about the validity of their claim.\n \n Take this example.\n We have what would appear like a DROP in the support for the Chicago Olympics.\n I give an explanation for that drop.\n \n To counter, you say that the phenomenon would conceivably have to be equivalent to a phenomenon which would cause the support TO RISE.\n (and absolutely no logic behind that claim)\n emoticon_rolleyes\n \n I think it's funny that Obama bashers seem to want to pretend that the people who blindly embrace something Obama is associated with are just as numerous as those who blindly bash those things he is associated with.\n Take the \"9/12\" project for example.\n For the number of people who roamed D.C. with their \"Obama socialist / Kenyan / Muslim / racist / Nazi / Communist\" signs, do you see an equivalent number of people roaming the streets with \"Obama is our savior\" signs???\n No.\n \n For all those people who run around proclaiming that Obama is a Kenyan, do you find an equal amount proclaiming that he is the second coming of Christ?\n No.\n \n On THIS issue, I have provided documented examples of Republicans in power acknowledging (and perpetuating) the existence of what I am talking about.\n You have shown NOBODY who has desired Chicago Olympics just for the sake of Obama...\n \n There is no logic behind your pretense that the two are equivalent.\n \n \n \nIt said, quite clearly, that less than 50% of Chicago residents support it. Back to your reading practice, I guess.\n\n And back to your significance failure, I guess.\n Why does it matter if \"less than 50%\"?\n You don't have a plurality, do you...\n IN EVERY POLL, MORE PEOPLE SUPPORTED the Chicago Olympics than opposed it... emoticon_xgood\n There is ONLY ONE poll (out of three) which shows it anywhere near close.", 
   {}, 
   372335, 
   null, 
   1254554640.0
  ], 
  [
   372378, 
   null, 
   "antonia", 
   "Prove that for the people in video that tehy were wanting to see it fail as a blow to Obama ... You're point is hollow.\n\n \n Are you kidding me? Go google up Americans For Prosperity and watch them at their anti-health care rallies with posters of Obama painted with a moustache.\n \n But you knew that didn't you.\n \n \nLet's talk about reality instead of your misrepresentation...\n\n \n Yes, let's.\n \n Let's also talk about their guru's long-time adulterous love affair with government health plans.\n \n --------------\n \n BILL MOYERS: Gingrich became Speaker of the House and Armey the House Majority Leader.\n \n But they did nothing about health care except let its costs soar while their corporate backers reaped huge profits. Since then costs have more than doubled and are escalating now at twice the rate of inflation. There were around 39 million americans without health care coverage then. There are more than 46 million now. \n \n And Dick Armey? He retired from his government job to lead an advocacy group called FreedomWorks, which aims to torpedo healthcare reform once again. Curiously, they refuse to disclose their corporate donors. They say they want to protect against \"aggressive attacks on companies who people have claimed are donors but aren't even donors.\" Got that? \n \n But here's the catch. Something these marchers who came to Washington at Armey's urging could hardly be expected to know. For most of his adult life, their leader has benefited from just the kind of government, tax-supported healthcare he's fighting to keep them from having, too. \n \n When Dick Armey taught economics at the University of North Texas for 13 years his health insurance was administered by the state and supplemented by the taxpayers. \n \n When he was elected to Congress, he was covered by the federal employees' health benefit plan. And when he retired from Congress eighteen years later, he was insured by that plan until he turned 66 and Medicare, another government program, kicked in. All the time he's been making some half a million dollars a year working for FreedomWorks and raking in lobbyist fees amounting to what he recently called \"a darned handsome pile of dough.\" \n \n You can't blame him for keeping his government health plan. It's great. It gave him a lot of options, dozens of private insurers to choose from, and with eight million members in it, the federal government's got the muscle to negotiate some of the best premiums and drug prices in the country. That's not all. Taxpayers subsidize these federal health insurance plans by as much as 75% of the premium cost. Beneficiaries -- including members and retired members of congress like armey -- pay their share of the premiums with pre-tax dollars. \n \n Not bad. \n \n Now get this: Dick Armey thought so much of that federal health plan - the cadillac of coverage --that he tried to keep it as his primary carrier, instead of that other federal program, medicare. \n \n Mr. Armey wanted an option. A government option. How about that? \n \n But he couldn't get out of medicare without losing his Social Security (they're hitched together -- you give up one, you give up both), so he's suing to divorce the two ... And now he says he's happy to buy his health insurance on his own - and why not? He's got that pile of dough. And there's the rub. \n \n Dick Armey is the epitome of those people with power and privilege who are insured against the vicissitudes of life, and want no government assistance for any suffering ... Except their own. \n \n And all those members of congress sitting there during the president's speech last week? Joe Wilson, included. They; too have Cadillac federal coverage subsidized by tax dollars. \n \n That's no lie. \n \n Bill Moyers Journal . Watch & Listen | PBS\n \n ----------------------------\n \n They lack any kind of principle or scruple. Their main aim? To see Obama fail, at any cost. \n \n They hate their country. They oppose health care, they oppose employment for Americans, they oppose their own nation winning the Olympic bid, and they will likely cheer and celebrate if American athletes lose at the games.\n \n Wingnuts. Run along with them, jyoshu, over their cliff.", 
   {}, 
   372335, 
   null, 
   1254595020.0
  ], 
  [
   372379, 
   null, 
   "antonia", 
   "More on \"Americans For Prosperity\" (a.k.a. AAP or Americans Against Prosperity) and \"Freedomworks\" (a.k.a. IGMS or \"I Got Mine Sucka\"):\n \n -----------------\n \n The Cashroots Conspiracy Behind FreedomWorks and Americans for Prosperity\n astroturf corporations front groups\n Source: Guardian, September 18, 2009\n \n The Guardian notes the cashroots behind right-wing Astroturf: \"When Obama beat Hillary Clinton in the Democratic primaries, FreedomWorks studied how he did it and then copied him. ... A plethora of groups have jumped on board, with exotic names such as Tea Party Patriots, Grassfire, Conservatives for Patients' Rights, 60 Plus, all loosely working together, with FreedomWorks and Americans for Prosperity probably the leading partners. ... FreedomWorks and Americans for Prosperity are sister groups who came from the same parent body -- a campaign called Citizens for a Sound Economy, which split in two in 2004. It was set up by one of America's richest men, David Koch, an oil tycoon who has funded rightwing causes for decades. FreedomWorks receives funding from the tobacco conglomerate Philip Morris, as well as from Richard Scaife, another business tycoon, who for years helped fund dirt-digging investigations into Bill Clinton. Local branches of Americans for Prosperity have also received tobacco money; the group has opposed smoke-free workplace laws and cigarette taxes. ... ExxonMobil was a sponsor of Citizens for Sound Economy, and both FreedomWorks and Americans for Prosperity have campaigned vigorously against Obama's plans to reduce CO2 emissions through a cap and trade scheme, working closely with the American Petroleum Institute. 'This is the same old, same old,' says John Stauber of the Center for Media and Democracy, which investigates corporate lobbying. 'Yes there are some new names and new causes, but these anti-government front groups have been around for a long time.'\"\n \n The Cashroots Conspiracy Behind FreedomWorks and Americans for Prosperity | Center for Media and Democracy\n \n ------------------", 
   {}, 
   372378, 
   null, 
   1254595260.0
  ], 
  [
   372664, 
   null, 
   "Steeeeve", 
   "I was cheering! Congrats Brazil! No one in South America has gotten the Olympics and deserve it here. I was cheering when the US was voted out..then I cheered when Tokyo was voted out...then I cheered when Madrid was gone. I love going to Chicago (go Cubs!) but they can't even get a parking meter contract correct.", 
   {}, 
   372379, 
   null, 
   1254700080.0
  ], 
  [
   372677, 
   null, 
   "jyoshu", 
   "Are you kidding me? Go google up Americans For Prosperity and watch them at their anti-health care rallies with posters of Obama painted with a moustache.\n \n But you knew that didn't you.\n\n \n No actually I've never even heard of them until this forum. But that still doesn't change the fact your video doesn't really give any info about who it is in the video.\n I guess I'd take all this supposed outrage a little more seriously except that Dems didn't seem nearly as interested in American \"winning\" when it was troops' lives on the line in Iraq, where it counted a helluva lot more. Suddenly all these people are pro-WIN for America? Give me a break.\n \n \nThey hate their country. They oppose health care, they oppose employment for Americans, they oppose their own nation winning the Olympic bid, and they will likely cheer and celebrate if American athletes lose at the games.\n \n Wingnuts. Run along with them, jyoshu, over their cliff.\n\n \n Wow, somebody woke up on the wrong side of the bed today ... emoticon_xangel\n You sound like Limbaugh talking about people HE hates.\n It's the Olympics. Less than 50% of Chicago residents even supported it to begin with. With all the real problems we have, people really need to drop the feigned outrage and trying to find leverage issues and find a real issue to get all hot and bothered over. That's my 2 cents, whether it's worth that much or less. :)", 
   {}, 
   372378, 
   null, 
   1254707760.0
  ], 
  [
   372696, 
   null, 
   "antonia", 
   "No actually I've never even heard of them until this forum. \n\n \n I don't believe you.\n \n \nBut that still doesn't change the fact your video doesn't really give any info about who it is in the video.\n\n \n Aren't you a liar. The fact is, the video has a caption that it is a meeting for Americans For Prosperity.\n \n \nI guess I'd take all this supposed outrage a little more seriously except that Dems didn't seem nearly as interested in American \"winning\" when it was troops' lives on the line in Iraq, where it counted a helluva lot more. Suddenly all these people are pro-WIN for America? Give me a break.\n\n \n I've supported the United States - my country - in every Olympics regardless of which President we had. Why don't the lot of you grow up. This isn't an illegal war that led to the deaths of 1/2 million Iraqis, thousands of Americans, tens of thousands of American casualties, destroying an entire nation, driving the world to the brink of #3, and destroying the American economy, as well as our international prestige.\n \n I never knew just how deeply, to what extent, what a true bunch of iXXXts you all are until this.\n \n And I'm not surprised that you don't take any of it seriously.\n \n You must have crumpled newspaper for brains.", 
   {}, 
   372677, 
   null, 
   1254723120.0
  ], 
  [
   372711, 
   null, 
   "JPSartre12", 
   "I was cheering! Congrats Brazil! No one in South America has gotten the Olympics and deserve it here. I was cheering when the US was voted out..then I cheered when Tokyo was voted out...then I cheered when Madrid was gone. I love going to Chicago (go Cubs!) but they can't even get a parking meter contract correct.\n\n \n Chicago is way too corrupt to handle anything of this complexity without massive skimming and union thuggery. I'm glad SA got it. It's their headache now. emoticon_xgood\n \n \nI don't believe you.\n \n Aren't you a liar. The fact is, the video has a caption that it is a meeting for Americans For Prosperity.\n \n I've supported the United States - my country - in every Olympics regardless of which President we had. Why don't the lot of you grow up. This isn't an illegal war that led to the deaths of 1/2 million Iraqis, thousands of Americans, tens of thousands of American casualties, destroying an entire nation, driving the world to the brink of #3, and destroying the American economy, as well as our international prestige.\n \n I never knew just how deeply, to what extent, what a true bunch of iXXXts you all are until this.\n \n And I'm not surprised that you don't take any of it seriously.\n \n You must have crumpled newspaper for brains.\n\n \n And you must have been related to Nero. The US, in case you haven't noticed, is still in the middle of a financial meltdown. An Olympics in 7 years isn't going to help our situation today. You want good PR for the US? Stop your president from running up our nation's debt and devaluing our couuency!!!:xcensored", 
   {}, 
   372696, 
   null, 
   1254755280.0
  ], 
  [
   372821, 
   null, 
   "foundit66", 
   "No actually I've never even heard of them until this forum.\n\n \nI don't believe you\n\n Jyoshu's got a habit of saying he's \"never heard\" of something or \"never seen\" something that HE HIMSELF INTRODUCED onto this forum just a few weeks prior...\n \n Such assessments from him cannot be trusted.", 
   {}, 
   372696, 
   null, 
   1254782940.0
  ], 
  [
   372854, 
   null, 
   "foundit66", 
   "There was what President Obama likes to call a teachable moment last week, when the International Olympic Committee rejected Chicago's bid to be host of the 2016 Summer Games.\n \n \"Cheers erupted\" at the headquarters of the conservative Weekly Standard, according to a blog post by a member of the magazine's staff, with the headline \"Obama loses! Obama loses!\" Rush Limbaugh declared himself \"gleeful.\" \"World Rejects Obama,\" gloated the Drudge Report. And so on.\n \n So what did we learn from this moment? For one thing, we learned that the modern conservative movement, which dominates the modern Republican Party, has the emotional maturity of a bratty 13-year-old. \n\n http://www.nytimes.com/2009/10/05/opinion/05krugman.html?_r=2&th&emc=th\n \n More examples of what the topic of this thread is talking about...", 
   {
    "unicode_changes_made": true
   }, 
   372821, 
   null, 
   1254793260.0
  ], 
  [
   372861, 
   null, 
   "antonia", 
   "http://www.nytimes.com/2009/10/05/opinion/05krugman.html?_r=2&th&emc=th\n \n More examples of what the topic of this thread is talking about...\n\n \n Krugman is very on target with that article. Seeing as it's what one can become intimately acquainted with on this forum.\n \n Thank you for posting it.", 
   {}, 
   372854, 
   null, 
   1254799020.0
  ], 
  [
   372867, 
   null, 
   "jyoshu", 
   "Jyoshu's got a habit of saying he's \"never heard\" of something or \"never seen\" something that HE HIMSELF INTRODUCED onto this forum just a few weeks prior...\n \n Such assessments from him cannot be trusted.\n\n \n You are welcome to back that little bit of ad hominem up (though he probably won't if history is any indicator).\n Since you brought it up, you saying anyone can't be trusted--FOPIOI as it is--is SUCH the pot calling the kettle black, and you obviously have no idea the people that have indicated as such .... \n Incidentally, I note to the viewing public how the post has nothing to do with the thread, and is entirely a post about a poster rather than the topic of the thread. Something that Foundit has hypocritically complained about in other posts.\n \n Regarding the topic (which Foundit's post avoided completely), it's not like it's uncommon for people of the opposing political party to actually hope the president has troubles ... as bad as that really is. But the bottom line is that everyone here knows good and well that people of both political parties have engaged in such.\n The problem here is that some people are actually pretending this is some sort of betrayal of AMERICA, rather than what it is: partisan opposition. That's not unlike the accusation that it was unAMERICAN to oppose Bush or be anti-war. As much as the Olympics COST to put on, and the fact that revenue is not a guarantee, it's not like having the Olympics is necessarily an automatically good thing. I challenge anyone who says it is to show how it will automatically help financially, taking into account the obviously enormous costs it incurs.\n I'm betting no one will.\n Even without getting the Olympics, it has in effect STILL cost between $790,000 to $1.4 million of taxpayer funds the U.S. will not recover.", 
   {}, 
   372821, 
   null, 
   1254802020.0
  ], 
  [
   372875, 
   null, 
   "foundit66", 
   "You are welcome to back that little bit of ad hominem up (though he probably won't if history is any indicator).\n\n You really do claim to be egregiously damaged at the drop of the hat, don't you...\n That wasn't ad hominem.\n I only noted that such comments could not be taken as valid coming from you.\n \n If I had assessed you as being a liar, THAT would be ad hominem.\n \n \n \nSince you brought it up, you saying anyone can't be trusted--FOPIOI as it is--is SUCH the pot calling the kettle black, and you obviously have no idea the people that have indicated as such .... \n\n Dude.\n YOU put the focus ON YOU by offering your own experience into testimony.\n It is illogical and irrational for YOU to give YOUR EXPERIENCE as evidence of something, and then complain when somebody else questions the validity of such a claim.\n \n If YOU don't want to talk about YOU, then may I suggest YOU STOP TALKING about your experiences...\n \n \n \nIncidentally, I note to the viewing public how the post has nothing to do with the thread, and is entirely a post about a poster rather than the topic of the thread.\n\n < snore <\n It was entirely topical.\n You offered your own experience as evidence of the significance of something.\n I was DIRECTLY REBUTTING YOUR STATEMENT, pointing out that such a claim was not to be treated as credible.\n \n Here's the real situation Jyoshu.\n If you retract your claim of what you have supposedly not heard of, then I happily capitulate that my comments are no longer applicable.\n As long as your claim remains, my comments are DIRECTLY RESPONDING to your own attempts to claim your experience as evidence of something.\n \n \n \nRegarding the topic (which Foundit's post avoided completely), it's not like it's uncommon for people of the opposing political party to actually hope the president has troubles ... as bad as that really is. But the bottom line is that everyone here knows good and well that people of both political parties have engaged in such.\n\n And off you go with the obfuscational approach.\n The initial approach from Jyoshu in this thread was to try to deny the occurrence of what we were talking about.\n But now that it has been solidified with evidence, he is trying to change his tune.\n \n \n \nThe problem here is that some people are actually pretending this is some sort of betrayal of AMERICA, rather than what it is: partisan opposition. That's not unlike the accusation that it was unAMERICAN to opposed Bush or be anti-war.\n\n When a person wants something to harm the other party politically, REGARDLESS of what is best for the country, that is a betrayal.\n \n \n \nAs much as the Olympics COST to put on, and the fact that revenue is not a guarantee, it's not like having the Olympics is necessarily an automatically good thing. I challenge anyone who says it is to show how it will automatically help financially, taking into account the obviously enormous costs it incurs.\n I'm betting no one will.\n\n See, this is part of the problem with Republican apologetics.\n You show them acting egregiously.\n Then another Republican tries to come along and RE-INVENT the real reason for why they were acting the way they were...\n \n The same thing happened on the 9/12 thread.\n People tried to pretend that the attendees were all of some magnaminous noble mind, while THEY IGNORED the ACTUAL EXTREMISM which was building the numbers that caused the size of the event.\n \n Hey everybody! Look away from the REAL REASON for why Jack killed his wife (for the insurance money) and instead let me try to persuade you that he could have killed his wife FOR SOME OTHER REASON WHICH WASN'T THE REAL REASON FOR HIS MURDER.\n \n It DOES NOT MATTER if Jack COULD HAVE wanted to kill his wife for some noble reason.\n If he killed his wife out of malice and greed, then THOSE ARE THE REAL MOTIVES that are looked at.\n It's just that simple!", 
   {}, 
   372867, 
   null, 
   1254805560.0
  ], 
  [
   372907, 
   null, 
   "Steeeeve", 
   "I love how Krugman thinks Democrats have the moral high ground on issues. They are oh so respecting and only coming up with the facts and aren't misleading at all. What a bunch of BS from an economist who has lost all credibility so now turns to all political issues instead of economy ones. \n \n Frankly there were people who were going to say Obama brought home the Olympics which is about as true as saying he failed to bring them home. So if someone was going to say one than you have to take the other. It isn't \"unamerican\" as some people claim.\n \n Maybe Krugman and the rest of you should stop wearing your rose glasses for the democrats.", 
   {}, 
   372875, 
   null, 
   1254841260.0
  ], 
  [
   372912, 
   null, 
   "jyoshu", 
   "Frankly there were people who were going to say Obama brought home the Olympics which is about as true as saying he failed to bring them home. So if someone was going to say one than you have to take the other. It isn't \"unamerican\" as some people claim.\n\n \n That's a good point--this thing goes both ways.\n It's not like Obama supporting Democrats wouldn't have been using this to trump Obama if Chicago HAD gotten it.", 
   {}, 
   372907, 
   null, 
   1254843180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Wingnut Traitors Cheer America's Olympic Bid Loss", 
  "url": "http://www.4forums.com/political/politics-debates/13374-wingnut-traitors-cheer-americas-olympic-bid-loss.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13374, 
  "discussion_files": [
   [
    "21052.html", 
    "http://www.4forums.com/political/politics-debates/13374-wingnut-traitors-cheer-americas-olympic-bid-loss-print.html"
   ], 
   [
    "21053.html", 
    "http://www.4forums.com/political/politics-debates/13374-wingnut-traitors-cheer-americas-olympic-bid-loss-2-print.html"
   ]
  ], 
  "identifier": 13374
 }
]