[
 [
  [
   372394, 
   null, 
   "simone", 
   "Several studies, for example, demonstrate that the more children are threatened with punishment, the more they lie and the better they get at it. In one, kids who attend a traditional colonial school in western Africa, where teachers frequently slap children for misdeeds, were especially likely to lie progressively more in order to avoid the consequences. Another study found that reading \"The Boy Who Cried Wolf\" increased children's likelihood of lying, while a book on George Washington and the cherry tree decreased it dramatically. And not because kids revere Washington - the students in the study were Canadian.\n\n http://www.nytimes.com/2009/10/04/books/review/Paul-t.html\n \n My goodness! Would one have to conclude, therefore, that Republicans were brought up in excessively abusive homes?", 
   {
    "post_info": {
     "post_title": "Physical Punishment and Lying"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1254600180.0
  ], 
  [
   372397, 
   null, 
   "simone", 
   "Some interesting assertions about childhood lying:\n \n.... bright kids-those who do better on other academic indicators-are able to start lying at 2 or 3. \"Lying is related to intelligence,\" explains Dr. Victoria Talwar, an assistant professor at Montreal's McGill University and a leading expert on children's lying behavior.\n \n Although we think of truthfulness as a young child's paramount virtue, it turns out that lying is the more advanced skill. A child who is going to lie must recognize the truth, intellectually conceive of an alternate reality, and be able to convincingly sell that new reality to someone else. Therefore, lying demands both advanced cognitive development and social skills that honesty simply doesn't require. \"It's a developmental milestone,\" Talwar has concluded.\n \n This puts parents in the position of being either damned or blessed, depending on how they choose to look at it. If your 4-year-old is a good liar, it's a strong sign she's got brains. And it's the smart, savvy kid who's most at risk of becoming a habitual liar.\n \n By their 4th birthday, almost all kids will start experimenting with lying in order to avoid punishment. Because of that, they lie indiscriminately-whenever punishment seems to be a possibility. A 3-year-old will say, \"I didn't hit my sister,\" even if a parent witnessed the child's hitting her sibling.\n \n Are Kids Copying Their Parents When They Lie? -- New York Magazine\n \n I don't think my kids ever really learned to lie. I tried to teach them how to be creatively lazy, Telling truth is the easier than lying, because it's such hard work remembering where you lied and having to lie more in order to defend the first lie.", 
   {
    "unicode_changes_made": true
   }, 
   372394, 
   null, 
   1254600480.0
  ], 
  [
   372402, 
   null, 
   "gansao", 
   "Some interesting assertions about childhood lying:\n \n Are Kids Copying Their Parents When They Lie? -- New York Magazine\n \n I don't think my kids ever really learned to lie. I tried to teach them how to be creatively lazy, Telling truth is the easier than lying, because it's such hard work remembering where you lied and having to lie more in order to defend the first lie.\n\n \n Unless , as stated, you are intelligent.", 
   {}, 
   372397, 
   null, 
   1254601080.0
  ], 
  [
   372403, 
   null, 
   "simone", 
   "There's an appreciable difference between lying at age 4 and lying in adulthood.\n \n Bit difficult for you to ponder, Gansao?", 
   {}, 
   372402, 
   null, 
   1254601800.0
  ], 
  [
   372406, 
   null, 
   "gansao", 
   "There's an appreciable difference between lying at age 4 and lying in adulthood.\n \n Bit difficult for you to ponder, Gansao?\n\n We tell lies for the same reasons when we are age 4 or an adult but we are more skilled as adults.\n Difficult for you to ponder?", 
   {}, 
   372403, 
   null, 
   1254602280.0
  ], 
  [
   372432, 
   null, 
   "simone", 
   "But, perhaps, some adults, particularly because they haven't had the bejesus beaten out of them as children, are less likely to lie.", 
   {}, 
   372406, 
   null, 
   1254609840.0
  ], 
  [
   372433, 
   null, 
   "gansao", 
   "But, perhaps, some adults, particularly because they haven't had the bejesus beaten out of them as children, are less likely to lie.\n\n \n You were knocked around as a child?", 
   {}, 
   372432, 
   null, 
   1254610080.0
  ], 
  [
   372437, 
   null, 
   "simone", 
   "Nope. My parents set me an example by not lying.\n \n And, they didn't like it when others lied. I got the message. All I needed was a stern look and disapproval, because my parents were honest, honorable people and I wanted their respect.\n \n I may have gotten smacked if I were getting myself into a dangerous situation, because a parent was scared to death.", 
   {}, 
   372433, 
   null, 
   1254610500.0
  ], 
  [
   372441, 
   null, 
   "gansao", 
   "But, perhaps, some adults, particularly because they haven't had the bejesus beaten out of them as children, are less likely to lie.\n\n \n Being knocked about as a child doesn't mean you will lie as an adult\n \n \nNope. My parents set me an example by not lying.\n \n And, they didn't like it when others lied. I got the message. All I needed was a stern look and disapproval, because my parents were honest, honorable people and I wanted their respect.\n \n I may have gotten smacked if I were getting myself into a dangerous situation, because a parent was scared to death.\n\n \n Your parents assaulted you as a child! No excuse!", 
   {}, 
   372437, 
   null, 
   1254611460.0
  ], 
  [
   418642, 
   null, 
   "fzgrums", 
   "you are intelligent", 
   {}, 
   372441, 
   null, 
   1291741200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Physical Punishment and Lying", 
  "url": "http://www.4forums.com/political/education-debates/13379-physical-punishment-lying.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 13379, 
  "discussion_files": [
   [
    "18809.html", 
    "http://www.4forums.com/political/education-debates/13379-physical-punishment-lying-print.html"
   ]
  ], 
  "identifier": 13379
 }
]