[
 [
  [
   372645, 
   null, 
   "Tither", 
   "I am not picking on Australia, and you don't owe me a thing! Do as you wish, but didn't you have yet another amnesty? How come things like that don't work? \n \n I guess that Gun control is NOT Crime Control! \n   Guns hold Sydney hostage \n GUN violence is so out of control there are three shootings a week in Sydney and neighbourhoods are living in fear.\n \n Exclusive statistics from the Bureau of Crime Statistics show there were 157 drive-by and illegal shootings between July 2008 and the end of June, up from 129 the year before.\n \n Opposition police spokesman Mike Gallacher said NSW was awash with handguns, which were being imported from overseas and then traded on Sydney streets.\n \"Criminals are getting their hands on illegally imported firearms,\" he said last night.\n \n In one raid on September 9, police officers managed to seize five Colt M16 assault rifles,(The actual Machine Guns) three Colt AR15 assault rifles, (Not the Machine Guns) three 9mm assault rifles, a tactical assault rifle and seven 9mm handguns at Rosebery.\n\n \n The problem with gun control is Drug Dealers! Stop them first! Then we can talk! emoticon_smile\n \n However, we all know that you can't! \n \n But even if you COULD stop the drugs and drug dealers you wouldn't have any reason to talk about gun control! Would you? emoticon_smile", 
   {
    "post_info": {
     "post_title": "Guns hold Sydney hostage"
    }
   }, 
   null, 
   null, 
   1254693180.0
  ], 
  [
   372674, 
   null, 
   "Symbiote", 
   "Well you can fairly easily stop drug dealers by legalising drugs... which is why there aren't bootleggers amd moonshine cartels firing tommy guns at each other and the cops anymore.", 
   {}, 
   372645, 
   null, 
   1254707460.0
  ], 
  [
   372678, 
   null, 
   "snakespit", 
   "3 shootings a week? Seriously? We often have 3 a night where I work.", 
   {}, 
   372674, 
   null, 
   1254708060.0
  ], 
  [
   372690, 
   null, 
   "zsu2357", 
   "3 shootings a week? Seriously? We often have 3 a night where I work.\n\n \n Talking about OZ, not Chicago(lol)emoticon_xkill", 
   {}, 
   372678, 
   null, 
   1254720000.0
  ], 
  [
   372716, 
   null, 
   "Tither", 
   "The point is that, if gun control works, why are there any shootings? Why are they increasing in number, more than 10 years after their bans? Why are they increasing after what seems to be a never ending gun turn in amnesty? \n \n Why are the only people who are disarmed, are just the law-abiding?", 
   {}, 
   372690, 
   null, 
   1254759480.0
  ], 
  [
   372724, 
   null, 
   "sinjin", 
   "Bike gangs and gun smugglers. That's how.", 
   {}, 
   372716, 
   null, 
   1254763020.0
  ], 
  [
   372765, 
   null, 
   "Doc Jones", 
   "Bike gangs and gun smugglers. That's how.\n\n \n \n Nice quip but didn't address the question Tither asked.\n \n How is a fellow like you still clinging to unlawful conduct by encouraging politicians and law enforcement to violate rights of any other citizen? Don't you think most citizens are as able to take care of themselves without a bunch of nanny gun grabbers trying to take their rights and guns away in the face of criminal misuse? You get it wrong time after time and it is so boring, monotonous and incorrect I bet your family raised you by Spock's book(s)?\n \n Your self esteem stops where others' rights begin! Everyday I hear something similar to \"cops put their lives on the line\". It is far down the list of hazardous occupations. Citizens, unarmed, have much more to lose when disarmed and you know it emoticon_mad but keep promoting your screed time after time after time...", 
   {}, 
   372724, 
   null, 
   1254772860.0
  ], 
  [
   372777, 
   null, 
   "sinjin", 
   "Never have supported disarming citizens.", 
   {}, 
   372765, 
   null, 
   1254774600.0
  ], 
  [
   372785, 
   null, 
   "OldSarge", 
   "Never have supported disarming citizens.\n\n \n No just in favor of NYC style paperwork to death.", 
   {}, 
   372777, 
   null, 
   1254775560.0
  ], 
  [
   372790, 
   null, 
   "Tither", 
   "No just in favor of NYC style paperwork to death.\n\n I saw somewhere that either in NY or Chicago it takes 3 rears of paperwork in order to get a gun and with yearly reregistration, just as soon as you get it you have to start the process of re-registration immediately because it takes that long. Any gun not re-registered by the re-registration date can never be registered ever again. \n \n I think that is Chicago tho!", 
   {}, 
   372785, 
   null, 
   1254776520.0
  ], 
  [
   372796, 
   null, 
   "OldSarge", 
   "I saw somewhere that either in NY or Chicago it takes 3 rears of paperwork in order to get a gun and with yearly reregistration, just as soon as you get it you have to start the process of re-registration immediately because it takes that long. Any gun not re-registered by the re-registration date can never be registered ever again. \n \n I think that is Chicago tho!\n\n \n NYC is so bad they have people that charge you to get the paperwork in order and walk you through. Runs about $1300 last I heard. ", 
   {}, 
   372790, 
   null, 
   1254777360.0
  ], 
  [
   372802, 
   null, 
   "sinjin", 
   "No just in favor of NYC style paperwork to death.\nNo, California style.", 
   {}, 
   372785, 
   null, 
   1254779760.0
  ], 
  [
   372807, 
   null, 
   "Doc Jones", 
   "No, California style.\n\n \n LOL, from the first failed State that has different criteria in each outhouse, wants to tax or otherwise end ammunitions sales and has what? to rely on?\n \n I bet your dreams will be shattered by the upcoming McDonald v. Chicago case to be heard probably in January emoticon_xbouncer", 
   {}, 
   372802, 
   null, 
   1254780240.0
  ], 
  [
   372810, 
   null, 
   "JPSartre12", 
   "Well you can fairly easily stop drug dealers by legalising drugs... which is why there aren't bootleggers amd moonshine cartels firing tommy guns at each other and the cops anymore.\n\n \n emoticon_xgood Remove the crime = remove the criminals. In a truly free society, guns and drugs should both be legal.", 
   {}, 
   372674, 
   null, 
   1254780540.0
  ], 
  [
   372822, 
   null, 
   "sinjin", 
   "I bet your dreams will be shattered by the upcoming McDonald v. Chicago case to be heard probably in January emoticon_xbouncer\nHow so? We allow registered handguns. No annual registration. What will this case mean to California? Specifically.\n \n We require all firearm sales include a background check. \n \n We have mandatory theft/loss reporting.\n \n I'd just like to see uniformity of regulation nationwide.", 
   {}, 
   372807, 
   null, 
   1254783300.0
  ], 
  [
   372823, 
   null, 
   "sinjin", 
   "emoticon_xgood Remove the crime = remove the criminals. In a truly free society, guns and drugs should both be legal.\nI don't disagree but since we've prohibited felons from buying firearms(new ones anyway), we have created the NICS system. \n Why wouldn't we want to apply it to all transactions?", 
   {}, 
   372810, 
   null, 
   1254783540.0
  ], 
  [
   372830, 
   null, 
   "NATO 556", 
   "I don't disagree but since we'd prohibited felons from buying firearms(new ones anyway), we have created the NICS system. \n Why wouldn't we want to apply it to all transactions?\n\n \n Because you've presented no credible evidence to support the claims that private transactions are an established and major source of firearms for criminals.\n \n If you can't prove it's broken, you don't have grounds to call for fixing it.", 
   {}, 
   372823, 
   null, 
   1254784260.0
  ], 
  [
   372837, 
   null, 
   "OldSarge", 
   "Because you've presented no credible evidence to support the claims that private transactions are an established and major source of firearms for criminals.\n \n If you can't prove it's broken, you don't have grounds to call for fixing it.\n\n \n Sinjin the ball has been in your court for a while yet you have ignored it. ", 
   {}, 
   372830, 
   null, 
   1254786240.0
  ], 
  [
   372840, 
   null, 
   "sinjin", 
   "Because you've presented no credible evidence to support the claims that private transactions are an established and major source of firearms for criminals.\n \n If you can't prove it's broken, you don't have grounds to call for fixing it.\nHow would one go about showing that unrecorded changes of ownership include sales to felons?", 
   {}, 
   372830, 
   null, 
   1254787260.0
  ], 
  [
   372843, 
   null, 
   "NATO 556", 
   "How would one go about showing that unrecorded changes of ownership include sales to felons?\n\n \n I don't think that's for me to worry about. You're trying to make the case that private transactions are a major source of crime guns, it's up to you to find the evidence to back up your case and prove that your position is correct.", 
   {}, 
   372840, 
   null, 
   1254787380.0
  ], 
  [
   372845, 
   null, 
   "sinjin", 
   "\"But far and away, the leading proximate source of crime guns is the private sales market. More than 85% of recovered crime guns have gone through at least one private party transaction following their initial sale by a licensed retailer.\"\n http://www.ucdmc.ucdavis.edu/vprp/pdf/IGS/IGSexecsummweb.pdf", 
   {}, 
   372843, 
   null, 
   1254788580.0
  ], 
  [
   372850, 
   null, 
   "OldSarge", 
   "\"But far and away, the leading proximate source of crime guns is the private sales market. More than 85% of recovered crime guns have gone through at least one private party transaction following their initial sale by a licensed retailer.\"\n http://www.ucdmc.ucdavis.edu/vprp/pdf/IGS/IGSexecsummweb.pdf\n\n \n From your source: Broadly speaking, the possibilities for intervention involve expanded enforcement of existing laws, new public policies, and voluntary action.\n ATF's enforcement operations currently impact less than 5% of gun shows; this is far too small. Its activities to date have generally received wide-spread support from the gun show industry and the National Rifle Association. Ideally, there would be an enforcement operation at every major general-purpose event. California's experience demonstrates that such a program is feasible. ATF should be free and expected to work proactively, developing its own intelligence on illegal activity generally at gun shows and mounting enforcement operations based on that intelligence.The best-known public policy initiative is the proposal that all private party sales at gun shows be subject to the same background check and record-keeping requirements that exist for sales by licensed retailers. The evidence suggests that there are two real difficulties with closing the gun show loophole, as this initiative is named, if no other action is taken. Regulating private party sales just at gun shows will not end the problems associated with these anony-mous and undocumented transactions. Most of them occur elsewhere already, and others would likely be displaced by restrictions that applied to gun shows only. Second, regulating private party sales will not render gun shows unimpor-tant as sources of trafficked crime guns; the best evidence is that most of those guns are sold by licensed retailers.\n There are several problems with your \"proof.\" First the author is an MD and not a criminologist. Second his math doesn't add up in several places. \"But less than 2% of felons incarcerated for crimes involving guns acquired those guns themselves at gun shows. This poses a seeming paradox: How can gun shows be an impor-tant source of crime guns if criminals get their guns elsewhere?\" \"gun shows account for 4% to 9% of all gun sales.\" Third no where in his \"study\" does he take into account stolen firearms. Fourth no where does he take into account criminals selling stolen firearms to other criminals. \n \n You are still lacking proof that the problem is the law abiding. ", 
   {
    "unicode_changes_made": true
   }, 
   372845, 
   null, 
   1254790860.0
  ], 
  [
   372851, 
   null, 
   "Tither", 
   "You bring up the private sale of guns in a thread named Guns hold Sydney hostage? Now THAT is the definition of hootspa if I ever heard one! emoticon_smile\n \n Even with FAR more gun control that you claim you want, at this particular time, and having all of the gun control that you are claiming will work here, they are still having the exact same problem with illegal guns as non gun controlled countries are having, but with one different twist. The Drug Dealing Biker Gangs are importing Machine Guns too!\n \n Well Bobs your uncle and Happy Birthday~!~ emoticon_smile", 
   {}, 
   372845, 
   null, 
   1254790920.0
  ], 
  [
   372895, 
   null, 
   "Doc Jones", 
   "How so? We allow registered handguns. No annual registration. What will this case mean to California? Specifically.\n \n We require all firearm sales include a background check. \n \n We have mandatory theft/loss reporting.\n \n I'd just like to see uniformity of regulation nationwide.\n\n \n None of which are enumerated powers of government. We have uniformity and it is found the the FF statements, the BOR and the XIVth Amendment.\n \n What you see is what you get in this Republic. Maybe you should contemplate emigration? emoticon_xgood", 
   {}, 
   372822, 
   null, 
   1254834240.0
  ], 
  [
   372897, 
   null, 
   "Doc Jones", 
   "\"But far and away, the leading proximate source of crime guns is the private sales market. More than 85% of recovered crime guns have gone through at least one private party transaction following their initial sale by a licensed retailer.\"\n http://www.ucdmc.ucdavis.edu/vprp/pdf/IGS/IGSexecsummweb.pdf\n\n \n The leading cause of injuries in airplanes by skydivers and those who use parachutes is...wait for it....parachutes.\n \n From this we can determine that skydivers would be safer without parachutes. emoticon_xhoho emoticon_xclown", 
   {}, 
   372845, 
   null, 
   1254835200.0
  ], 
  [
   372922, 
   null, 
   "sinjin", 
   "The leading cause of injuries in airplanes by skydivers and those who use parachutes is...wait for it....parachutes.\n \n From this we can determine that skydivers would be safer without parachutes. emoticon_xhoho emoticon_xclown\nNo, without parachutes that malfunction. The leading cause of skydiving injuries is impact, not the chute. Many times a reserve is never deployed.\n \n It's not the fall that kills you, it's the sudden stop at the end.", 
   {}, 
   372897, 
   null, 
   1254849780.0
  ], 
  [
   372923, 
   null, 
   "Tither", 
   "It's not the fall that kills you, it's the sudden stop at the end.\n\n \n emoticon_smileemoticon_smileemoticon_smile", 
   {}, 
   372922, 
   null, 
   1254850020.0
  ], 
  [
   372924, 
   null, 
   "sinjin", 
   "You are still lacking proof that the problem is the law abiding.\nI offered a study, not proof. Evidence at best. I don't claim that the law-abiding are the problem, only the lack of comprehensive and complementary regulations.", 
   {}, 
   372850, 
   null, 
   1254850260.0
  ], 
  [
   372932, 
   null, 
   "NATO 556", 
   "I offered a study, not proof. Evidence at best. I don't claim that the law-abiding are the problem, only the lack of comprehensive and complementary regulations.\n\n \n Circumstantial evidence and hearsay at best, actually.\n \n If you want to have this discussion, move it over to the designated thread.", 
   {}, 
   372924, 
   null, 
   1254854820.0
  ], 
  [
   373504, 
   null, 
   "Nozza123", 
   "Like I have been saying, the 500 million dollar gun buyback has been nothing but a complete and utter failiure. Taking guns from the lawabiding to stop CRIMINALS is truely insane\n \n \n Oh just to let you know about the rights our government is taking away from us. Now the council is considering this however this law can already be enforced as under the food act you cannot have animals around food. HOW DISGRACEFUL!!!\n \n Dog ban at coffee shops - ACA: Have Your Say", 
   {}, 
   372932, 
   null, 
   1255079760.0
  ], 
  [
   373558, 
   null, 
   "JPSartre12", 
   "Like I have been saying, the 500 million dollar gun buyback has been nothing but a complete and utter failiure. Taking guns from the lawabiding to stop CRIMINALS is truely insane\n\n \n It's akin to taking away the car keys from those with perfect driving records in order to stop speeders.", 
   {}, 
   373504, 
   null, 
   1255113420.0
  ], 
  [
   373601, 
   null, 
   "Tither", 
   "It's akin to taking away the car keys from those with perfect driving records in order to stop speeders.\n\n emoticon_smile\n \n Not only that, but even after their Just recent, but seemingly never ending amnesties, they still are spending a ton of money, and crime fighting man power to try and police the law-abiding. \n   Licensed gun owners facing police check \n \n Not only that, but we are still reading stories about illegal guns and even machine guns too! \n   Man faces 196 charges over illegal guns \nDuring the raids, police allegedly uncovered machine guns, pump action shotguns, telescopic sights and thousands of rounds of ammunition.\n\n Perhaps they might try and close a gun show loophole or something. Oh that's right they already have massive amounts of gun control and no gun shows. They are criminals! That is what they do! Figure out ways to skirt the law.", 
   {}, 
   373558, 
   null, 
   1255121880.0
  ], 
  [
   373661, 
   null, 
   "Nozza123", 
   "It's akin to taking away the car keys from those with perfect driving records in order to stop speeders.\n\n \n \n That is actually one of the best ways i have ever seen to describe the gun/rights grabbers. Well done sir!", 
   {}, 
   373558, 
   null, 
   1255136100.0
  ], 
  [
   374055, 
   null, 
   "NATO 556", 
   "Licensed gun owners facing police check - - News | The Manly Daily\n \n \nNORTHERN Beaches Police will be turning up on the doorstep of every licensed gun owner in the area over the next four years to check their firearms are stored correctly.\n \n Operation Aston follows the gun amnesty that ended on May 31 and will target guns stored incorrectly and the security of gun safes, Northern Beaches Commander Doreen Cruickshank said.\n \n \"Gun owners have a responsibility to ensure their weapon is safely stored at all times when not in use,\" Supt Cruickshank said.\n \n \"Licensing police will be attending the home of every licensed firearm owner in the northern beaches over the next four years to inspect every weapon and check the gun safe.\n \n \"Officers will be examining all gun safes to ensure they comply with the legislative requirements, particularly in relation to the standard and security of safes.\"\n \n Supt Cruickshank reminded all legitimate owners that under the Firearms Act they must take all reasonable precautions to ensure the safe-keeping of their firearms.\n \n \"It's especially important that weapons are stored in such a way as to limit the possibility of loss or theft, so they don't come into the possession of a person who isn't authorised to hold them,\" she said.\n \n The maximum penalty for incorrect storage of a weapon is two years in jail.\n\n \n Can anybody else see the problems with this? I mean other than the wasting of taxpayer money to actually implement the plan, and taking beat cops off of their patrols to go door to door and further harass law-abiding citizens by treating them like convicted criminals?", 
   {
    "unicode_changes_made": true
   }, 
   372845, 
   null, 
   1255372140.0
  ], 
  [
   374056, 
   null, 
   "JPSartre12", 
   "That is actually one of the best ways i have ever seen to describe the gun/rights grabbers. Well done sir!\n\n \n Thanks. Feel free to borrow it. ;)", 
   {}, 
   373661, 
   null, 
   1255372440.0
  ], 
  [
   374070, 
   null, 
   "zsu2357", 
   "Licensed gun owners facing police check - - News | The Manly Daily\n \n \n \n Can anybody else see the problems with this? I mean other than the wasting of taxpayer money to actually implement the plan, and taking beat cops off of their patrols to go door to door and further harass law-abiding citizens by treating them like convicted criminals?\n\n \n O.K. this is OZ.but do they or you (Nozz)have any kind of rights that involve\n a search warrant or something else that says HEY I got the right to enter your house if you want me to or not?emoticon_xdonno", 
   {}, 
   374055, 
   null, 
   1255374240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Guns hold Sydney hostage", 
  "url": "http://www.4forums.com/political/gun-control-debates/13388-guns-hold-sydney-hostage.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13388, 
  "discussion_files": [
   [
    "13762.html", 
    "http://www.4forums.com/political/gun-control-debates/13388-guns-hold-sydney-hostage-print.html"
   ], 
   [
    "13763.html", 
    "http://www.4forums.com/political/gun-control-debates/13388-guns-hold-sydney-hostage-3-print.html"
   ], 
   [
    "13764.html", 
    "http://www.4forums.com/political/gun-control-debates/13388-guns-hold-sydney-hostage-2-print.html"
   ]
  ], 
  "identifier": 13388
 }
]