[
 [
  [
   372676, 
   null, 
   "marc9000", 
   "Obama thinks children should spend more time in school. \n \n More school: Obama would curtail summer vacation - Yahoo! News\n \n Is this the \"it takes a village\" mentality? Is it beneficial to Democrats to shorten family time for children, and lengthen their time in a controlled, government setting? It's going to be costly of course, additional staff time, and additional meal programs. Not all childrens time away from school is simply 'play time', or goof off time. Many children actually do accomplish things when they're not in school, especially when they get to their teen years. It's important for at least some children, in a free society, to begin to appreciate what freedom actually is - to be able to make some of their own choices about how to spend their time, without having most all their time planned out by someone else. \n \n If today's children need more education, it's in ethics and morals. Government schools aren't likely to provide that with longer school days.", 
   {
    "post_info": {
     "post_title": "Longer school days"
    }
   }, 
   null, 
   null, 
   1254707520.0
  ], 
  [
   372691, 
   null, 
   "Ryuuichi", 
   "That plan is made of fail. How about hiring more competent teachers and stop trying to help people who don't want help! Forcing students to spend more time in school isn't going to make them smarter, its just going to waste more of their free time. I'm sooo happy I'm in college now and don't have to endure that idiocy. Vacation time was the only good thing about school <_<", 
   {}, 
   372676, 
   null, 
   1254721320.0
  ], 
  [
   372866, 
   null, 
   "unkerpaulie", 
   "I don't get how cutting down summer vacation time is going to be such a bad thing. Its obviously going to cost more (although, iirc, teachers still get paid during the summer). I think, if school is and should be a form of preparation for the real world of careers and business, then less time off from school may actually be beneficial. In the real world your average day job with benefits has you working 9 to 5 with 2 weeks paid vacation. In school they got 9 to 3 and about 12-14 weks off. \n \n I'd love to hear an argument how giving students less vacation will make them worse students or less productive in the adult workforce.", 
   {}, 
   372691, 
   null, 
   1254801420.0
  ], 
  [
   372868, 
   null, 
   "Ryuuichi", 
   "I don't get how cutting down summer vacation time is going to be such a bad thing. Its obviously going to cost more (although, iirc, teachers still get paid during the summer). I think, if school is and should be a form of preparation for the real world of careers and business, then less time off from school may actually be beneficial. In the real world your average day job with benefits has you working 9 to 5 with 2 weeks paid vacation. In school they got 9 to 3 and about 12-14 weks off. \n \n I'd love to hear an argument how giving students less vacation will make them worse students or less productive in the adult workforce.\n\n \n It doesn't but it doesn't necessarily make them better either. Unless theirs studies to prove that of course. \n \n Also learning is different from working. You can pretend your working, learning...um not so much. You can't fake you know something. Not very well at least.\n \n Also LOL Link in OP proves that kids who spend LESS time in school get HIGHER grades. *rolls* Nice going there Obama. How about focus on quality instead of quantity eh?", 
   {}, 
   372866, 
   null, 
   1254803880.0
  ], 
  [
   373284, 
   null, 
   "trebor", 
   "Obama thinks children should spend more time in school. \n \n More school: Obama would curtail summer vacation - Yahoo! News\n \n Is this the \"it takes a village\" mentality? Is it beneficial to Democrats to shorten family time for children, and lengthen their time in a controlled, government setting? It's going to be costly of course, additional staff time, and additional meal programs. Not all childrens time away from school is simply 'play time', or goof off time. Many children actually do accomplish things when they're not in school, especially when they get to their teen years. It's important for at least some children, in a free society, to begin to appreciate what freedom actually is - to be able to make some of their own choices about how to spend their time, without having most all their time planned out by someone else. \n \n If today's children need more education, it's in ethics and morals. Government schools aren't likely to provide that with longer school days.\n\n \n Yes Marc, you show yet again you don't like that learning thingy. It might show that the earth is not 6000 years old, or that evolution happened, and ththen SATAN will get you.", 
   {}, 
   372676, 
   null, 
   1254980400.0
  ], 
  [
   373434, 
   null, 
   "marc9000", 
   "I don't get how cutting down summer vacation time is going to be such a bad thing. Its obviously going to cost more (although, iirc, teachers still get paid during the summer). I think, if school is and should be a form of preparation for the real world of careers and business, then less time off from school may actually be beneficial. In the real world your average day job with benefits has you working 9 to 5 with 2 weeks paid vacation. In school they got 9 to 3 and about 12-14 weks off. \n \n I'd love to hear an argument how giving students less vacation will make them worse students or less productive in the adult workforce.\n\n \n \n \n Classroom education is about more than just teaching facts. No one can claim that it doesn't have a blend of facts and philosophy. The recent controversial Obama loving song being sung by school children is only one example of many. I've heard of, and seen several examples of students (often elementary students) being assigned the task of writing letters to editors of newspapers, explaining why we should pull out of Iraq or Afghanistan, or how dirty the environment is, etc. Another thing that can, and is being done in at least some cases, is for a liberal history teacher to focus on only the negative aspects of U.S. history, making children think the U.S. is a pretty awful country, without really encouraging them to ask \"Compared to what?\" It's not really debatable that some of what goes on in school does more harm than good, at least to a large percentage of those who pay the bills, the parents. \n \n Just as an example, let's generously assume that today's students are getting an 80/20 ratio on their education. (80% facts, 20% liberal indoctrination) If they go longer, is there a guarantee that ratio would stay the same? Of course not, but there's an excellent chance that it would shift towards more indoctrination, considering the certain-to-arise claim that children don't have the stamina and focus that adults do, and therefore all their school time must be balanced with more structured play time, or feel-good philosophy time. \n \n But even with all that aside, I believe children with less free time are less likely to appreciate freedom as adults. If their lives are more structured by others as they're growing up, they're going to be more likely to look for structure from others as adults. It would result in less innovation, fewer new businesses. Summer jobs/after school jobs are the best introduction to the real world that students can get. Too many students today in their mid/late teens are creating new mouths to feed without really knowing that money doesn't grow on trees. More classroom time isn't going to help that problem.", 
   {
    "unicode_changes_made": true
   }, 
   372866, 
   null, 
   1255051200.0
  ], 
  [
   373436, 
   null, 
   "marc9000", 
   "Yes Marc, you show yet again you don't like that learning thingy. It might show that the earth is not 6000 years old, or that evolution happened, and ththen SATAN will get you.\n\n \n You don't have the market cornered on the learning thingy. Did you know that there's not enough extra money laying around to pay for more school hours? What do you know about the wisdom of not buying something that you don't have the money to pay for?", 
   {}, 
   373284, 
   null, 
   1255051380.0
  ], 
  [
   373441, 
   null, 
   "JPSartre12", 
   "I don't get how cutting down summer vacation time is going to be such a bad thing. Its obviously going to cost more (although, iirc, teachers still get paid during the summer). I think, if school is and should be a form of preparation for the real world of careers and business, then less time off from school may actually be beneficial. In the real world your average day job with benefits has you working 9 to 5 with 2 weeks paid vacation. In school they got 9 to 3 and about 12-14 weks off. \n \n I'd love to hear an argument how giving students less vacation will make them worse students or less productive in the adult workforce.\n\n \n Maybe if the entire purpose of childhood was to mold good little worker bees for the next century, I'd agree. But that shouldn't be the only purpose of childhood. There's more to life than work, IMO, and the older and more financially secure I become, the more I value my free time. Summers are a time for families to enjoy socializing in new places and learning about how others live, nature, geography and a host of other things that make one a well-rounded individual instead of just a worker bee.", 
   {}, 
   372866, 
   null, 
   1255052640.0
  ], 
  [
   373491, 
   null, 
   "jitobear", 
   "Maybe if the entire purpose of childhood was to mold good little worker bees for the next century, I'd agree. But that shouldn't be the only purpose of childhood. There's more to life than work, IMO, and the older and more financially secure I become, the more I value my free time. Summers are a time for families to enjoy socializing in new places and learning about how others live, nature, geography and a host of other things that make one a well-rounded individual instead of just a worker bee.\n\n \n awwwww - a moment to publicly agree with JP.\n \n I do suspect all Obama really wants is to see is more of out future succeed. Education is huge. Does everything have to be suspect?", 
   {}, 
   373441, 
   null, 
   1255071480.0
  ], 
  [
   373531, 
   null, 
   "trebor", 
   "awwwww - a moment to publicly agree with JP.\n \n I do suspect all Obama really wants is to see is more of out future succeed. Education is huge. Does everything have to be suspect?\n\n \n \n Of course, What JP doesn't acknowledge, is that most of the summer, parents have to work anyway, and in many places, both parents have to work. Increasing the length of the school year only means that the time parents might take off for their vacation gets narrowed down to their kids vacation.\n \n Since adults have to work anyway, having longer school years won't take away from 'home time', since working adults are home anyway.", 
   {}, 
   373491, 
   null, 
   1255103700.0
  ], 
  [
   373537, 
   null, 
   "JPSartre12", 
   "awwwww - a moment to publicly agree with JP.\n\n \n It's OK to have an occasional moment of lucidity, Jito, but if you have too many of them, we'll have to call you a Conservative. ;)\n \n\n I do suspect all Obama really wants is to see is more of out future succeed. Education is huge. Does everything have to be suspect?\n\n \n I admire the goal, but don't trust the man as far as I could throw him. He's a polished, smooth-talking marionette. I just can't quite figure out who's on the other end of the strings at times.", 
   {
    "unicode_changes_made": true
   }, 
   373491, 
   null, 
   1255107360.0
  ], 
  [
   373617, 
   null, 
   "jitobear", 
   "It's OK to have an occasional moment of lucidity, Jito, but if you have too many of them, we'll have to call you a Conservative. ;)\n\n \n I don't do labels or clubs.\n \n \nI admire the goal, but don't trust the man as far as I could throw him. He's a polished, smooth-talking marionette. I just can't quite figure out who's on the other end of the strings at times.\n\n \n Quit doing the labels and clubs and you might get over this silly paranoia. He is not evil incarnate - just a man, I truly believe his wishes for children are genuine.", 
   {
    "unicode_changes_made": true
   }, 
   373537, 
   null, 
   1255124880.0
  ], 
  [
   373620, 
   null, 
   "JPSartre12", 
   "I don't do labels or clubs.\n \n \n \n Quit doing the labels and clubs and you might get over this silly paranoia. He is not evil incarnate - just a man, I truly believe his wishes for children are genuine.\n\n \n The man is bleeding American wealth by the day. How can I get over his $10Trillion in new debt? emoticon_angry", 
   {}, 
   373617, 
   null, 
   1255125000.0
  ], 
  [
   373714, 
   null, 
   "jitobear", 
   "The man is bleeding American wealth by the day. How can I get over his $10Trillion in new debt? emoticon_angry\n\n \n That doesn't mean he doeasn't genuinely care about school children.", 
   {}, 
   373620, 
   null, 
   1255148220.0
  ], 
  [
   373716, 
   null, 
   "JPSartre12", 
   "That doesn't mean he doeasn't genuinely care about school children.\n\n \n He's a puppet and the teacher unions are some of the collective puppetmasters. Longer school years = more teacher pay. Follow the moneyemoticon_rolleyes", 
   {}, 
   373714, 
   null, 
   1255148400.0
  ], 
  [
   373742, 
   null, 
   "Jo Bennett", 
   "He's a puppet and the teacher unions are some of the collective puppetmasters. Longer school years = more teacher pay. Follow the moneyemoticon_rolleyes\n\n \n No teacher I know would want a longer school year, the workload required during term time is not something that can be maintained 48-50 weeks per year. Maybe it's different in the US but in the UK 50% of newly qualified teachers leave the profession within 3 years.", 
   {}, 
   373716, 
   null, 
   1255175520.0
  ], 
  [
   373746, 
   null, 
   "Symbiote", 
   "What's unusual about teachers isn't how hard they work, it's how utterly convinced they are that other people don't work even harder, which is complete rubbish.\n \n I'd love to see someone who complains about a 6 hour workday 200 days a year (with additional work at home) find out what it's like to work 10 hour days 300 days a year.", 
   {}, 
   373742, 
   null, 
   1255179300.0
  ], 
  [
   373747, 
   null, 
   "Jo Bennett", 
   "What's unusual about teachers isn't how hard they work, it's how utterly convinced they are that other people don't work even harder, which is complete rubbish.\n \n I'd love to see someone who complains about a 6 hour workday 200 days a year (with additional work at home) find out what it's like to work 10 hour days 300 days a year.\n\n \n You think teachers have a 6 hour workday? I know no teacher who only works 6 hours a day. Also, I've done long shifts in factories, kitchens, offices in my time, and it's nothing like as exhausting as teaching. \n \n How many other careers have a burnout rate like teaching does? Maybe share trading, but they get huge salaries to compensate.", 
   {}, 
   373746, 
   null, 
   1255180980.0
  ], 
  [
   373750, 
   null, 
   "Symbiote", 
   "You think teachers have a 6 hour workday? I know no teacher who only works 6 hours a day. \n\n \n And plenty of the people supposed to work 10 hours a day end up working 12 - 14, whether they be in IT, Accounting, Finance, Sales and Marketing, Law or Medicine. HR admittedly get it easier.\n \n The main difference being they don't feel they're uniquely disadvantaged to be working past 4pm on the 60% of days in the year they're working.\n \n Don't even get me started on the investment bankers, as privileged and spoiled as they are, they can end up spending days without sleep, taking just a couple of hours a day to change clothes and shower before it's back to the desk. Now that'll give you burnout.\n \n I don't know whether a 50% dropout rate in 3 years is high or not. It doesn't really sound that high off-hand, but I haven't seen any stats that compare. Generally people who love their jobs don't burn out, even when they work long hours.", 
   {}, 
   373747, 
   null, 
   1255181580.0
  ], 
  [
   373766, 
   null, 
   "jitobear", 
   "I work in IT at one of the largest Investment firms in the country and I know I don't work harder than teachers - and I get paid more.", 
   {}, 
   373750, 
   null, 
   1255205100.0
  ], 
  [
   373809, 
   null, 
   "JPSartre12", 
   "No teacher I know would want a longer school year, the workload required during term time is not something that can be maintained 48-50 weeks per year. Maybe it's different in the US but in the UK 50% of newly qualified teachers leave the profession within 3 years.\n\n \n Most union teachers in my state are lifers. I've worked with a few that left the profession and went into industry. Some quickly returned to teaching.\n \n \nWhat's unusual about teachers isn't how hard they work, it's how utterly convinced they are that other people don't work even harder, which is complete rubbish.\n \n I'd love to see someone who complains about a 6 hour workday 200 days a year (with additional work at home) find out what it's like to work 10 hour days 300 days a year.\n\n \n Three months off for the summer, yet they still force schools here in Michigan to have long Christmas and winter/spring breaks.\n \n \nYou think teachers have a 6 hour workday? I know no teacher who only works 6 hours a day. Also, I've done long shifts in factories, kitchens, offices in my time, and it's nothing like as exhausting as teaching. \n \n How many other careers have a burnout rate like teaching does? Maybe share trading, but they get huge salaries to compensate.\n\n \n Air traffic controllers, nurses, I can think of plenty.\n \n \nI work in IT at one of the largest Investment firms in the country and I know I don't work harder than teachers - and I get paid more.\n\n \n I've never seen an IT person break a sweat. It's a cake job in any company.", 
   {}, 
   373766, 
   null, 
   1255232040.0
  ], 
  [
   373831, 
   null, 
   "Jo Bennett", 
   "\n Air traffic controllers, nurses, I can think of plenty.\n \n \n\n \n Where's your proof?", 
   {}, 
   373809, 
   null, 
   1255268700.0
  ], 
  [
   373845, 
   null, 
   "JPSartre12", 
   "Where's your proof?\n\n \n You disputed it, where's yours?", 
   {}, 
   373831, 
   null, 
   1255277820.0
  ], 
  [
   374068, 
   null, 
   "jitobear", 
   "I've never seen an IT person break a sweat. It's a cake job in any company.\n\n \n \n I am actually not an IT person, I just work in an IT department. I am BSA - I basically herd IT folk. You are right - its not real sweaty work - that was sort of my point when someone claimed they work harder than teachers.", 
   {}, 
   373809, 
   null, 
   1255374240.0
  ], 
  [
   374071, 
   null, 
   "JPSartre12", 
   "I am actually not an IT person, I just work in an IT department. I am BSA - I basically herd IT folk. You are right - its not real sweaty work - that was sort of my point when someone claimed they work harder than teachers.\n\n \n Most people in industry do work harder than teachers, however.", 
   {}, 
   374068, 
   null, 
   1255374420.0
  ], 
  [
   374092, 
   null, 
   "Jo Bennett", 
   "You disputed it, where's yours?\n\n \n I have a stat for the burnout rate from teaching, you claimed air traffic controllers and nurses have higher burnout rates, I'm asking you to prove it.", 
   {}, 
   373845, 
   null, 
   1255377900.0
  ], 
  [
   374134, 
   null, 
   "jitobear", 
   "Most people in industry do work harder than teachers, however.\n\n \n Maybe - but they are likely paid more and rarely have to put up with large herds of teenagers.", 
   {}, 
   374071, 
   null, 
   1255405920.0
  ], 
  [
   374136, 
   null, 
   "JPSartre12", 
   "I have a stat for the burnout rate from teaching, you claimed air traffic controllers and nurses have higher burnout rates, I'm asking you to prove it.\n\n \n ATC 20% in two years quit.\n \n\n The controllers' working conditions are so bad that nearly one-fifth of the controllers have quit over the past two years, reducing their number to the lowest level since 1992.\n \n Help At Last For Air Traffic Controllers By Dick Meister \n\n \n and nurses\n \n\n ......\n The burnout study's principal investigator was \"Heather Laschinger, associate director of nursing research at the University of Western Ontario.\" (Laschinger has a Ph.D., though the piece does not indicate that.) Dr. Laschinger and her colleagues reportedly surveyed 225 junior hospital nurses working across Ontario. They found that a whopping 66% were experiencing \"symptoms of burnout, including emotional exhaustion and depression.\" Earlier studies by Laschinger reportedly put burnout rates at 58% of nurses who had been working for a wider range of periods, and 54% of nurse managers. \n The piece also includes material on the larger effects of these trends on the nursing profession. Silas notes that CFNU surveys indicate almost one third of Canadian nurses under 30 want to leave the profession. In addition, \"a predicted slew of early retirements\" by the many nurses over 50 suggest the problem is even more urgent. Silas warns that the system will \"crumble\" unless health care management and policy makers (in the reporter's words) \"quit talking about nursing shortages and [] do something about it.\" That's good, though the piece would have benefited from some response from those managers and policy makers, and perhaps some discussion of potential solutions. \n \n \"By far the worst burnout levels I've ever seen\"\n \n", 
   {}, 
   374092, 
   null, 
   1255407000.0
  ], 
  [
   381731, 
   null, 
   "rokch1ck", 
   "this is ridicoulous....school day should not be extended...the school year!!!!:xbanghead this is just really idiotic...think about it...if the kids who dont wanna be in skool dont like it as short as it is...do you think that they'll like it longer????", 
   {
    "post_info": {
     "post_title": "D.a.s"
    }
   }, 
   373716, 
   null, 
   1260219300.0
  ], 
  [
   381733, 
   null, 
   "JPSartre12", 
   "this is ridicoulous....school day should not be extended...the school year!!!!:xbanghead this is just really idiotic...think about it...if the kids who dont wanna be in skool dont like it as short as it is...do you think that they'll like it longer????\n\n \n A prima facie example of why kids need more time in school. ;)", 
   {}, 
   381731, 
   null, 
   1260219540.0
  ], 
  [
   381792, 
   null, 
   "Pippie", 
   "That doesn't mean he doeasn't genuinely care about school children.\n\n \n So did Hitler. He did exactly what Obama is proposing. Right down to little brown shirts.", 
   {}, 
   373714, 
   null, 
   1260242940.0
  ], 
  [
   381797, 
   null, 
   "Pippie", 
   "Jo: You think teachers have a 6 hour workday? I know no teacher who only works 6 hours a day.\n\n \n Maybe not in the UK, but many in America do. School is in session an average of 187 days in America. I taught school for a few years. I thought it was a cushy job compared to other work I did. Try being a cop or therapist. \n \n \nJP: I just can't quite figure out who's on the other end of the strings at times.\n\n \n The Emanual brothers. \n \n Back when education was still education and not big business, teachers worked longer days. Kids learned more. Respect was taught. Discipline was still ok for the errant brats. Parents still had a say in raising their kids. Teachers didn't whine. Kids took brown bag lunches to school.....the state didn't pay for them. Cafeterias still made their own food instead of concession garbage they have today. There were nice Christmas programs that ALL the kids participated in....well before the Christians were reclassified as the \"plague\" among socialist. Yup, back in the day....education was about the 3 R's and not PC.", 
   {
    "unicode_changes_made": true
   }, 
   381733, 
   null, 
   1260244440.0
  ], 
  [
   381801, 
   null, 
   "iangb", 
   "Back when education was still education and not big business, teachers worked longer days. Kids learned more. Respect was taught. Discipline was still ok for the errant brats. Parents still had a say in raising their kids. Teachers didn't whine. Kids took brown bag lunches to school.....the state didn't pay for them. Cafeterias still made their own food instead of concession garbage they have today. There were nice Christmas programs that ALL the kids participated in....well before the Christians were reclassified as the \"plague\" among socialist. Yup, back in the day....education was about the 3 R's and not PC.\nWhereas nowadays... \n \n  \"The children now love luxury; they have bad manners, contempt for authority; they show disrespect for elders and love chatter in place of exercise. Children are now tyrants, not the servants of their households. They no longer rise when elders enter the room. They contradict their parents, chatter before company, gobble up dainties at the table, cross their legs, and tyrannize their teachers.\n \n - Socrates (470 - 399 BC)\n \n Beware of nostalgia.", 
   {
    "unicode_changes_made": true
   }, 
   381797, 
   null, 
   1260246060.0
  ], 
  [
   381804, 
   null, 
   "Symbiote", 
   "I once found that argument compelling, but you should remember Greek society was conquered by Rome only 250 years later; not an awfully long time in ancient historical terms, it's entirely possible that Socrates was right, and that he was witnessing the decline of society.\n \n Youth were particularly disrespectful of their elders in Weimar Germany, and there's a whole study around this issue as part of the sociology of inflation.\n \n It's certainly improbable that youth have become continually worse for thousands of years, but that there will be periods of decline fits pretty well with the intersection of monetary and social theory.", 
   {}, 
   381801, 
   null, 
   1260247860.0
  ], 
  [
   381832, 
   null, 
   "daewoo", 
   "Most people in industry do work harder than teachers, however.\n\n \n Agreed 100%. I have an in law who is a teacher (2 of them, but only 1 that I talk to) and he REALLY thinks he works hard. In addition to the normal school day he often has meetings or prep work that takes up an hour or 2 of his PERSONAL time sometimes as many as 3 days a week.\n \n Personal time? What the hell is that? \n \n On average, salaried workers in the US work 56 hours per week. I cannot speak for other places, but I would be surprised if our local teachers put in 45 hours in an average week. \n \n The \"we work really hard\" mantra is embedded in them by other teachers. It does not reflect reality. \n \n I agree with obama on this in part, though. We should do away with summer vacation. We had summer vacation because we were once an agrarian society and the kids needed to be working on the farm in the summer. Today it does not make much sense and there is a SERIOUS problem with knowledge retention over the summer. It is not a very efficient way to do things.", 
   {}, 
   374071, 
   null, 
   1260286560.0
  ], 
  [
   381834, 
   null, 
   "JPSartre12", 
   "Agreed 100%. I have an in law who is a teacher (2 of them, but only 1 that I talk to) and he REALLY thinks he works hard. In addition to the normal school day he often has meetings or prep work that takes up an hour or 2 of his PERSONAL time sometimes as many as 3 days a week.\n \n Personal time? What the hell is that? \n \n On average, salaried workers in the US work 56 hours per week. I cannot speak for other places, but I would be surprised if our local teachers put in 45 hours in an average week. \n \n The \"we work really hard\" mantra is embedded in them by other teachers. It does not reflect reality. \n \n I agree with obama on this in part, though. We should do away with summer vacation. We had summer vacation because we were once an agrarian society and the kids needed to be working on the farm in the summer. Today it does not make much sense and there is a SERIOUS problem with knowledge retention over the summer. It is not a very efficient way to do things.\n\n \n I loved summer vacation. When else was a horny teen able to hang out on the beach all day, pick up hotties and get laid? emoticon_cool", 
   {}, 
   381832, 
   null, 
   1260288420.0
  ], 
  [
   381840, 
   null, 
   "daewoo", 
   "I loved summer vacation. When else was a horny teen able to hang out on the beach all day, pick up hotties and get laid? emoticon_cool\n\n \n I agree, HOWEVER, the idea is more efficient education, not to contribute to the spread of STDs in the teenage demographic. \n \n I cannot even count the number of relatively promising young people who have dorked themselves because they get out of college, move into the job market where there ARE no summer vacations, and try to manufacture one for themselves using sick days and what little (if any) vacation time they may have.\n \n IMO, the entire point of school is to prepare children to be productive and useful adults. Grown ups do not get summer vacation so we should not spend 16 years getting kids used to having one. We coddle our children too much and for too long. The world is hard. We need to prepare them for it.", 
   {}, 
   381834, 
   null, 
   1260305460.0
  ], 
  [
   382160, 
   null, 
   "JPSartre12", 
   "I agree, HOWEVER, the idea is more efficient education, not to contribute to the spread of STDs in the teenage demographic. \n\n Party pooper! :p \n \n\n I cannot even count the number of relatively promising young people who have dorked themselves because they get out of college, move into the job market where there ARE no summer vacations, and try to manufacture one for themselves using sick days and what little (if any) vacation time they may have.\n \n IMO, the entire point of school is to prepare children to be productive and useful adults. Grown ups do not get summer vacation so we should not spend 16 years getting kids used to having one. We coddle our children too much and for too long. The world is hard. We need to prepare them for it.\n\n \n Why not just put the young kids out in the field with a shovel at age 6 then, Daewoo, and save all of the useless time spent in school learing about history, English, literature, music, etc.? \n I don't believe that the sole purpose of education is to raise worker bees. I've been raising mine to be queens and kings (OK, the bee metaphor doesn't work with male children) and not spend their entire lives having to work.", 
   {}, 
   381840, 
   null, 
   1260476460.0
  ], 
  [
   382175, 
   null, 
   "daewoo", 
   "Party pooper! :p \n \n \n Why not just put the young kids out in the field with a shovel at age 6 then, Daewoo, and save all of the useless time spent in school learing about history, English, literature, music, etc.? \n I don't believe that the sole purpose of education is to raise worker bees. I've been raising mine to be queens and kings (OK, the bee metaphor doesn't work with male children) and not spend their entire lives having to work.\n\n \n I said \"productive and useful adults\" not \"worker bees\" nor have I advocated not giving them the best education that we can (that would be YOU). I am merely pointing out that spending the first 22 years of their lives getting them used to having summer vacations and spring and winter breaks is not a reasonable course of action in the long term. That is like letting your dog sleep on your bed every night from the time it is born and then one day a few years down the line beating the dog viciously for being on the bed.", 
   {}, 
   382160, 
   null, 
   1260484860.0
  ], 
  [
   390861, 
   null, 
   "maueze", 
   "I agree we that , student should stay longer in school...", 
   {
    "post_info": {
     "post_title": "Longer school days"
    }
   }, 
   372676, 
   null, 
   1266399540.0
  ], 
  [
   394618, 
   null, 
   "The Smart One", 
   "Obama thinks children should spend more time in school. \n \n \n \n Is this the \"it takes a village\" mentality? Is it beneficial to Democrats to shorten family time for children, and lengthen their time in a controlled, government setting? It's going to be costly of course, additional staff time, and additional meal programs. Not all childrens time away from school is simply 'play time', or goof off time. Many children actually do accomplish things when they're not in school, especially when they get to their teen years. It's important for at least some children, in a free society, to begin to appreciate what freedom actually is - to be able to make some of their own choices about how to spend their time, without having most all their time planned out by someone else. \n \n If today's children need more education, it's in ethics and morals. Government schools aren't likely to provide that with longer school days.\n\n school days should be longer and have a recess!", 
   {}, 
   372676, 
   null, 
   1268625900.0
  ], 
  [
   403802, 
   null, 
   "QuackAttack1887", 
   "Oh, Obama. I love him. I'm giggling at the thought of my school having longer school days and shorter vacations. My teachers would have gone crazy. I have ADHD and was in the level of classes that had all kids with learning disabilities. My teachers have been witnessed running to their car when they had free hours. Teachers teased that my little brother wasn't allowed to attend and I wasn't allowed to visit. The school and them needed ten years to heal from me and my classmates. \n \n At 2:17 (the exact time our day ended) me and my classmates would go running outside, jamming on our hats that our vice principal didn't allow and go to meet up with our friends or whatever we did.", 
   {}, 
   394618, 
   null, 
   1275558360.0
  ], 
  [
   403849, 
   null, 
   "Shooterandproud", 
   "Classroom education is about more than just teaching facts. No one can claim that it doesn't have a blend of facts and philosophy. The recent controversial Obama loving song being sung by school children is only one example of many. I've heard of, and seen several examples of students (often elementary students) being assigned the task of writing letters to editors of newspapers, explaining why we should pull out of Iraq or Afghanistan, or how dirty the environment is, etc. Another thing that can, and is being done in at least some cases, is for a liberal history teacher to focus on only the negative aspects of U.S. history, making children think the U.S. is a pretty awful country, without really encouraging them to ask \"Compared to what?\" It's not really debatable that some of what goes on in school does more harm than good, at least to a large percentage of those who pay the bills, the parents.\n\n \n Bingo. I'd like to point out how true the bolded is. This description perfectly fits my AP United States history teacher. She was an excellent teacher who's kids both loved her and scored extremely high on the AP test. But, she was extremely liberal and extremely biased. She was also an excellent orator and debater, and she made very good points. Since I'm mostly liberal, I agreed with most of what she said. But, even I could recognize her heavy bias. Nearly all of the kids, even the conservative ones, came out of that class with a radically different (and negative) view of the United States. The biggest problem with it was that everything she said was true, which made disproving any of it impossible. \n \n \n \nBut even with all that aside, I believe children with less free time are less likely to appreciate freedom as adults. If their lives are more structured by others as they're growing up, they're going to be more likely to look for structure from others as adults. It would result in less innovation, fewer new businesses. Summer jobs/after school jobs are the best introduction to the real world that students can get. Too many students today in their mid/late teens are creating new mouths to feed without really knowing that money doesn't grow on trees. More classroom time isn't going to help that problem.\n\n \n Bingo again. I'm not known for agreeing with Marc, but this time he's spot on.", 
   {
    "unicode_changes_made": true
   }, 
   373434, 
   null, 
   1275599880.0
  ], 
  [
   403854, 
   null, 
   "Shooterandproud", 
   "I said \"productive and useful adults\" not \"worker bees\" nor have I advocated not giving them the best education that we can (that would be YOU). I am merely pointing out that spending the first 22 years of their lives getting them used to having summer vacations and spring and winter breaks is not a reasonable course of action in the long term. That is like letting your dog sleep on your bed every night from the time it is born and then one day a few years down the line beating the dog viciously for being on the bed.\n\n \n For most of us high school students, summer vacation isn't much of a vacation at all. It's the time to get a real job and build our resume. This summer, I'm doing martial arts and working on getting my black belt by the end of this year, working at a local Starbucks, going away for a week to work on my uncle's farm, and am training to get my pilot's license. Now, I acknowledge the fact that martial arts and flying are fun, but a black belt looks very good on any job resume or college app, and since I want to pursue flying as a career, a pilots license is a good thing to have. Also, how do you expect kids to pay for college if they don't have a summer vacation to get a job and raise money?\n \n My point is that the stereotypical rebellious teenager spending his summer vacation in his room playing video games is far from the truth.", 
   {}, 
   382175, 
   null, 
   1275600960.0
  ], 
  [
   403917, 
   null, 
   "daewoo", 
   "For most of us high school students, summer vacation isn't much of a vacation at all. It's the time to get a real job and build our resume. This summer, I'm doing martial arts and working on getting my black belt by the end of this year, working at a local Starbucks, going away for a week to work on my uncle's farm, and am training to get my pilot's license. Now, I acknowledge the fact that martial arts and flying are fun, but a black belt looks very good on any job resume or college app, and since I want to pursue flying as a career, a pilots license is a good thing to have. Also, how do you expect kids to pay for college if they don't have a summer vacation to get a job and raise money?\n \n My point is that the stereotypical rebellious teenager spending his summer vacation in his room playing video games is far from the truth.\n\n \n I worked full time through both high school and college.\n \n Life is hard and getting harder every day. If you are in high school now, I absolutely CRINGE to think about how hard it will be by the time you get out of college. How will you pay for college without a summer job? With the money you make at your evening and weekend job. \n \n I am at the point that I will not hire anybody under 30 to do anything but operate a shovel or broom. It just is not worth it to play nursemaid for the decade it takes them to grow up and actually realize that they are expected to behave like adults. The work ethic simply is not there. The sense of responsibility is simply not there. The attitude is simply not there.", 
   {}, 
   403854, 
   null, 
   1275630720.0
  ], 
  [
   403921, 
   null, 
   "Steeeeve", 
   "Life is hard and getting harder every day. If you are in high school now, I absolutely CRINGE to think about how hard it will be by the time you get out of college. How will you pay for college without a summer job? With the money you make at your evening and weekend job. \nFinancial Aid of course! We should have unlimited financial aid because it works oh so well! I'd know, I deal with the accounting every %$#@&%( year at many schools <<end sarcasm<<. I can't even begin to tell you how bad financial aid works in this country.\n \n \nI am at the point that I will not hire anybody under 30 to do anything but operate a shovel or broom. It just is not worth it to play nursemaid for the decade it takes them to grow up and actually realize that they are expected to behave like adults. The work ethic simply is not there. The sense of responsibility is simply not there. The attitude is simply not there.\nWell, there is more to this story I'm sure...if you were legally allowed to ask questions that are relevant and matter then you could find many qualified 20 year olds. Sadly making people take a test gets you a lawsuit. Want some advice from someone who knows colleges? Don't higher anyone from the top colleges of the lower colleges. The best are the ones that are almost good but the barely don't make it...the students are smart...IQ in the high 120s, probably hard workers because they weren't geniuses so they had to be dedicated to make it into that good of school. I'm not sure about Kansas but I can tell you where to hire from Virginia and it makes a hell of a difference. \n \n Pff, its hard.", 
   {}, 
   403917, 
   null, 
   1275632460.0
  ], 
  [
   403925, 
   null, 
   "daewoo", 
   "Financial Aid of course! We should have unlimited financial aid because it works oh so well! I'd know, I deal with the accounting every %$#@&%( year at many schools <<end sarcasm<<. I can't even begin to tell you how bad financial aid works in this country.\n\n \n LOL. I remember the first time I realized that Obama was really and truly an XXXXX with no idea how the world works, what is wrong with our country, or how to fix it. He was talking about MORE financial aid for MORE people so they could go to college.\n \n I'm sorry, but one problem that this country does NOT have is too few XXXXXX running around with business degrees. \n \n \nWell, there is more to this story I'm sure...if you were legally allowed to ask questions that are relevant and matter then you could find many qualified 20 year olds. Sadly making people take a test gets you a lawsuit. Want some advice from someone who knows colleges? Don't higher anyone from the top colleges of the lower colleges. The best are the ones that are almost good but the barely don't make it...the students are smart...IQ in the high 120s, probably hard workers because they weren't geniuses so they had to be dedicated to make it into that good of school. I'm not sure about Kansas but I can tell you where to hire from Virginia and it makes a hell of a difference. \n \n Pff, its hard.\n\n \n Some honest to god quotes from 20 something calling in to work (of course before the office is opened so they can talk toe the machine):\n \n \"I am not going to be at work today because I have to help my dad move some stuff\"\n \n \"I will not be at work today because my friends daughter is sick so I have to watch her other kids while she takes the sick one to the doctor\"\n \n \"I will not be in today because I have a flat tire\" (how long does it take to change a damn tire??)\n \n \"My dryer is broke and I dont have anything at all to wear to work, so I will be gone until the guy comes to fix it....it should be by friday\"\n \n \"Sorry I was not at work today, I had to help my dad plant some trees\"\n \n Some more honest to god quotes from the same age range:\n \n \"Just because you have made a lot of money doing this does not mean you know anything about it\"\n \n \"Taxes have NOTHING TO DO WITH deciding when to buy new equipment\"\n \n \"I expect to be paid mileage for commuting to work\"\n \n \"I was NOT drinking on the job, I was on my lunch break and OFF THE CLOCK so it is none of your business!\"", 
   {}, 
   403921, 
   null, 
   1275633420.0
  ], 
  [
   403926, 
   null, 
   "daewoo", 
   "I forgot one....From a guy I hired as an accounting assistant:\n \n \"I have been here for 6 months now. I expected to have a company car and cell phone by now. If you have not gotten me an F-150 platinum and a droid by the end of the month, I am really going to have to consider finding another job\"\n \n I laughed uncontrollably. He got upset and quit. Then he filed an unemployment claim. In KS you do not get unemployment if you quit. His reasoning for why he should get it is that by laughing at his completely reasonable demand, it was actually a constructive discharge.", 
   {}, 
   403925, 
   null, 
   1275633780.0
  ], 
  [
   403927, 
   null, 
   "Steeeeve", 
   "Hey, don't crack on business degrees...technically accounting is a business degree and I got a BA and masters in that. Now if you say management and marketing majors then point taken ;)\n \n I suggest you stop hiring from the local community college. I assume a lot of these workers are just doing stuff at the mine and don't need a full degree...perhaps you are out of luck with them and should wait for the 30+ crowd with some experience. Higher labor costs + better work < two low labor cost employees + no work\n \n Once they actually feel like they have to support a family do they start working.", 
   {}, 
   403925, 
   null, 
   1275633960.0
  ], 
  [
   403934, 
   null, 
   "daewoo", 
   "Hey, don't crack on business degrees...technically accounting is a business degree and I got a BA and masters in that. Now if you say management and marketing majors then point taken ;)\n \n I suggest you stop hiring from the local community college. I assume a lot of these workers are just doing stuff at the mine and don't need a full degree...perhaps you are out of luck with them and should wait for the 30+ crowd with some experience. Higher labor costs + better work < two low labor cost employees + no work\n \n Once they actually feel like they have to support a family do they start working.\n\n \n EXACTLY. Show me a guy with a couple of kids at home and a wife with a shopping habit and I will show you a guy who takes his job very seriously.\n \n I almost never hire people with degrees for the mine. I learned a long time ago that you need people there who are used to working outside and under harsh conditions so I mostly look for construction guys and industrial maintenance guys. \n \n A while back I hired a girl (21) as a personal assistant. She was pretty much marginally competent eye candy (which I can say since this is an anonymous internet forum :) ) \n \n What was interesting to me was that she was getting a degree in business administration. It was I thought it was just fascinating that somebody, somewhere, thinks you can teach business administration or business management. Good administrators/managers are a product of experience, intelligence and ambition. You dont teach that in a classroom.\n \n I was constantly looking at her coursework and asking what they were doing in school. They learned to use MS Office extremely well, quickbooks fairly well, dreamweaver, and powerpoint. \n \n AS far as I can tell, somebody with a business management degree or business administration degree would probably be a really good secretary. Beyond that, I dont think there is any use for those degrees at all. Granted they did apparently learn a lot of BS stuff that you never actually use in the business world. If somebody in a meeting stepped up to the white board and suggested we use a thought cloud as a brainstorming method I would probably drug test them.", 
   {}, 
   403927, 
   null, 
   1275635040.0
  ], 
  [
   403935, 
   null, 
   "daewoo", 
   "BTW-\n \n Nothing but respect for accountants here. Especially marginally crooked ones with creative tax strategies.", 
   {}, 
   403934, 
   null, 
   1275635100.0
  ], 
  [
   403938, 
   null, 
   "Jo Bennett", 
   "I would say don't dump all recent graduates in the same pot. The only time I've had off work was when I was actively vomitting and could barely stand up because of 'flu. I find it odd that, in the US where you have hire and fire, you get people trying to pull those sort of stunts, but here, where our union will back us through pretty much anything up to and including attempted murder, people bust a gut to make sure they don't take more time off than they absolutely need.", 
   {}, 
   403935, 
   null, 
   1275637680.0
  ], 
  [
   403939, 
   null, 
   "Steeeeve", 
   "BTW-\n \n Nothing but respect for accountants here. Especially marginally crooked ones with creative tax strategies.\n\n \n I take it you prefer KPMG to do your tax work?\n \n crooked tax accountants are probably a lot better than crooked financial reporting accountants but sadly those are normally under the same crooked management. I deal with only non profit and governmental accounting so no need to get creative. On the plus side I have a great perceptive on how types of governments and non profits/universities spend money. \n \n Yeah we had some business administration classes to be a well rounded accountants. Probably my worst class if I remember correctly. I'm not very good at BS so come test time when I select the logical answer I was usually wrong. I seem to recall we even did a case study on Krispy Kreme and how awesome the management system was...good one :p", 
   {}, 
   403935, 
   null, 
   1275638460.0
  ], 
  [
   403940, 
   null, 
   "Shooterandproud", 
   "I worked full time through both high school and college.\n \n Life is hard and getting harder every day. If you are in high school now, I absolutely CRINGE to think about how hard it will be by the time you get out of college.\n\n \n I agree, and most of us realize this.\n \n \nHow will you pay for college without a summer job? With the money you make at your evening and weekend job.\n\n \n I don't think so. Things aren't as they were. College is getting more expensive and the average salary of an American worker is shrinking. Many of us simply aren't going to college, and the ones that are are struggling. There's simply no way we can afford to not have a summer job.\n \n \nI am at the point that I will not hire anybody under 30 to do anything but operate a shovel or broom. It just is not worth it to play nursemaid for the decade it takes them to grow up and actually realize that they are expected to behave like adults. The work ethic simply is not there. The sense of responsibility is simply not there. The attitude is simply not there.\n\n \n It depends on what kind of work you hire for. But I would caution you against the \"all teenagers are irresponsible\" stereotype. There are plenty mature, hard working, responsible teens out there, but there are also plenty of immature idiotic ones. You need to learn to weed the good from the bad. If the government trusts me to be the pilot in command of an aircraft full of passengers, surely you can trust me to do more than push a broom.\n \n I also might mention that age based discrimination is illegal.\n \n But like I said, if it's something that requires a degree or higher education then obviously high schoolers and college kids are not qualified.", 
   {}, 
   403917, 
   null, 
   1275638640.0
  ], 
  [
   403954, 
   null, 
   "daewoo", 
   "I would say don't dump all recent graduates in the same pot. The only time I've had off work was when I was actively vomitting and could barely stand up because of 'flu. I find it odd that, in the US where you have hire and fire, you get people trying to pull those sort of stunts, but here, where our union will back us through pretty much anything up to and including attempted murder, people bust a gut to make sure they don't take more time off than they absolutely need.\n\n \n 2 years ago I would have said it was nonsense, but today, with unemployment benefits being extended to 18 months and congress apparently willing to extend them forever, it really does seem like it has removed the pressure on people to do well at work. They simply do not seem to care. If they get fired, uncle moneybags will pay them to sit around for 2 years.", 
   {}, 
   403938, 
   null, 
   1275659340.0
  ], 
  [
   403967, 
   null, 
   "Steeeeve", 
   "I would say don't dump all recent graduates in the same pot. The only time I've had off work was when I was actively vomitting and could barely stand up because of 'flu. I find it odd that, in the US where you have hire and fire, you get people trying to pull those sort of stunts, but here, where our union will back us through pretty much anything up to and including attempted murder, people bust a gut to make sure they don't take more time off than they absolutely need.\n\n \n Wow Jo, another nonsensical anti-American post? I don't think lack of unions is Daewoo's problem.", 
   {}, 
   403938, 
   null, 
   1275664860.0
  ], 
  [
   403969, 
   null, 
   "Jo Bennett", 
   "Wow Jo, another nonsensical anti-American post? I don't think lack of unions is Daewoo's problem.\n\n \n It's not anti-american, just an expression of surprise. It's probably to do with individual workplaces as much as anything, but I wonder whether hire and fire laws mitigate against people developing a sense of loyalty to their employer. It might also be the difference between public and private sector.", 
   {}, 
   403967, 
   null, 
   1275665340.0
  ], 
  [
   403973, 
   null, 
   "Symbiote", 
   "I'm 26. I've developed business strategies at this point for almost all the major global FMCGs and half of the pharmaceutical companies, done the statistical analysis, drafted the reports, presented in front of their execs. I'm currently working 10 hours a day, 6 days a week. \n \n Some of the guys I work with work harder.\n \n There is some of the entitlement / laziness mentality around, but it isn't universal.\n \n The core problem I face, and that most people my age face, is that property prices in Sydney are absurd, so even on my income I can't afford to buy anything reasonable. Think $300,000 US for a 1 bedroom 50 year old apartment in a high crime neighbourhood a 40 minute train ride from the CBD. I can imagine if I was on a low wage thinking \"why bother\", so to an extent I understand not trying very hard.", 
   {}, 
   403969, 
   null, 
   1275667080.0
  ], 
  [
   403980, 
   null, 
   "Steeeeve", 
   "It's not anti-american, just an expression of surprise.\nYes it is, it was a jab at the US and you do this all the time making it border on bigotry.\n \n I mean let's be honest here, this has nothing to do with unions. Moreover, the average US worker works more per year than those in England and France and most of western Europe. \n \n \nIt's probably to do with individual workplaces as much as anything, but I wonder whether hire and fire laws mitigate against people developing a sense of loyalty to their employer. It might also be the difference between public and private sector.\nPrivate sector has turnover in the US upwards of 4 times higher than the public sector. Involuntary (aka being fired) turnover has the same trend in the US. Public workers in the federal government (not always state) make more than the same job in the private sector. Over 20% of federal employees make over $100,000 USD per year. Is this better? Depends on who you ask. Public employees work less and are substantially less productive. Daewoo says he values people who find it necessary to do a good job...well you don't find that as much in the public sector. You also have to pay those salaries which means higher taxes or going into debt. Furthermore, since it is hard to fire someone you are better off just hiring someone to do the job and just paying the other person do to nothing. Public sector is something like 3 times the workforce to do the same job the private sector could do.\n \n Back in reality businesses need to adapt to stay competitive. Since labor costs are the vast majority of costs it is often more cost effective to move operations to India where you can give people who actually want to work a job. So when you folks in the UK get mad because Eastern Europeans take your jobs at lower pay you only have yourselves to blame.\n \n I hate to break it to you and Simone but you can't have it every way. You want everything to be dirt cheap, executives to work for nothing, workers get paid high wages, and no one to ever get fired, people with high standards of living, and to have a strong economy. Clearly this idea isn't working.", 
   {}, 
   403969, 
   null, 
   1275672480.0
  ], 
  [
   403981, 
   null, 
   "Steeeeve", 
   "Think $300,000 US for a 1 bedroom 50 year old apartment in a high crime neighbourhood a 40 minute train ride from the CBD. I can imagine if I was on a low wage thinking \"why bother\", so to an extent I understand not trying very hard.\nGood grief...why is everything so expensive in Australia?", 
   {}, 
   403973, 
   null, 
   1275672600.0
  ], 
  [
   403988, 
   null, 
   "Jo Bennett", 
   "Yes it is, it was a jab at the US and you do this all the time making it border on bigotry.\n \n I mean let's be honest here, this has nothing to do with unions. Moreover, the average US worker works more per year than those in England and France and most of western Europe. \n \n Private sector has turnover in the US upwards of 4 times higher than the public sector. Involuntary (aka being fired) turnover has the same trend in the US. Public workers in the federal government (not always state) make more than the same job in the private sector. Over 20% of federal employees make over $100,000 USD per year. Is this better? Depends on who you ask. Public employees work less and are substantially less productive. Daewoo says he values people who find it necessary to do a good job...well you don't find that as much in the public sector. You also have to pay those salaries which means higher taxes or going into debt. Furthermore, since it is hard to fire someone you are better off just hiring someone to do the job and just paying the other person do to nothing. Public sector is something like 3 times the workforce to do the same job the private sector could do.\n \n Back in reality businesses need to adapt to stay competitive. Since labor costs are the vast majority of costs it is often more cost effective to move operations to India where you can give people who actually want to work a job. So when you folks in the UK get mad because Eastern Europeans take your jobs at lower pay you only have yourselves to blame.\n \n I hate to break it to you and Simone but you can't have it every way. You want everything to be dirt cheap, executives to work for nothing, workers get paid high wages, and no one to ever get fired, people with high standards of living, and to have a strong economy. Clearly this idea isn't working.\n\n \n Strange, here, public sector workers get paid less, but get job security and better pensions by way of compensation. The professions with the highest rates of overtime are also in the public sector. Making comparisons is not a jab, it's providing perspective on a debate and reminding people that how things are for them in their part of the world is not universal. It's not anti-american to believe that America gets a large number of things wrong, either.\n \n As for strong economies with high pay for workers, strong workers rights, high standards of living, small gaps between highest and lowest paid, didn't you pretty much just describe Norway? I don't recall ever demanding everything be dirt cheap, I am willing and do pay more to ensure the things I buy are ethically produced. That's not always possible, I'll admit, but I don't always go for the cheapest. Also, strong economy is a poorly defined term. If you mean massive GDP growth, I'm not particularly bothered by that, as it tends to be artificial and goes into the pockets of a tiny number of people. It also assumes infinite resources which is just not feasible.", 
   {}, 
   403980, 
   null, 
   1275674040.0
  ], 
  [
   403990, 
   null, 
   "Steeeeve", 
   "Making comparisons is not a jab, it's providing perspective on a debate and reminding people that how things are for them in their part of the world is not universal. It's not anti-american to believe that America gets a large number of things wrong, either.\nBut it is when you constantly do it and don't know what you are talking about. The US is a different country from the UK with different values and different priorities. To make blanket statements about the US based upon your love for unions is ignorant at best. Sorry, but it is true.\n \n \nAs for strong economies with high pay for workers, strong workers rights, high standards of living, small gaps between highest and lowest paid, didn't you pretty much just describe Norway?\nNope. Even Norway is starting to be concerned with their extraordinary high cost of living...but Norway is an entirely different debate if you want to get into why sitting on a pot of unrestricted oil is a good thing.", 
   {}, 
   403988, 
   null, 
   1275677160.0
  ], 
  [
   403993, 
   null, 
   "Symbiote", 
   "Strange, here, public sector workers get paid less.\n\n \n A standard public sector lie used to justify continued pay hikes.\n \n \"The average public sector worker was paid £23,660 a year, compared with private sector workers who were paid £21,528 a year, in the three months to the end of November. \"\n \n Record gap between public and private sector pay - Telegraph", 
   {}, 
   403988, 
   null, 
   1275679440.0
  ], 
  [
   403998, 
   null, 
   "Steeeeve", 
   "A standard public sector lie used to justify continued pay hikes.\n \n \"The average public sector worker was paid £23,660 a year, compared with private sector workers who were paid £21,528 a year, in the three months to the end of November. \"\n \n Record gap between public and private sector pay - Telegraph\n\n \n Here in the US it is really just the federal government and non-balancing states like California and Massachusetts that have higher than private sector pay. I know for a fact in my state we are well below but the benefits and work schedule flexibility make it about even.\n \n If I worked for the federal government I could do the job of a first year employee and get paid about 30-40k more...granted COL in DC is high but that still is a large disparity.\n \n Accountant\n Government average: $74,907\n Nationwide average: $58,020\n \n Of course by accountant they mean everything from a bookkeeper and data entry all the way to COO of a department.", 
   {}, 
   403993, 
   null, 
   1275682920.0
  ], 
  [
   404003, 
   null, 
   "Jo Bennett", 
   "A standard public sector lie used to justify continued pay hikes.\n \n \"The average public sector worker was paid £23,660 a year, compared with private sector workers who were paid £21,528 a year, in the three months to the end of November. \"\n \n Record gap between public and private sector pay - Telegraph\n\n \n Compare like with like. Most of the low paid work in the public sector is now contracted out (unfortunately) so doesn't show up. If you compare people with similar qualifications and similar jobs, rates of pay in the public sector are lower.\n \n EDIT: in fact, just look at the first comment in your link, public sector pay, particularly at the top end, is lower than the private sector. It only appears otherwise because successive governments have farmed out the lowest paid work to the private sector.", 
   {}, 
   403993, 
   null, 
   1275686040.0
  ], 
  [
   404009, 
   null, 
   "Symbiote", 
   "So you've backpedalled on the \"Public sector earns less\" claim, now it's \"Sure, public sector workers earn more, but that's only because they're superior to private sector folk\".", 
   {}, 
   404003, 
   null, 
   1275687840.0
  ], 
  [
   404010, 
   null, 
   "Jo Bennett", 
   "So you've backpedalled on the \"Public sector earns less\" claim, now it's \"Sure, public sector workers earn more, but that's only because they're superior to private sector folk\".\n\n \n Look at the context! Steeve was talking about people doing the same jobs, so was I. Is it really necessary to spell everything out for you? I really don't think anyone can be naturally that dumb so I can only assume you're trying to find loopholes to score points rather than put forward any arguments of your own. As usual.\n \n EDIT: and it's nothing to do with superior either, it's a just a matter of comparing similar jobs. If you want to have a discussion about whether doctors should be paid more than shop assistants, start a new thread.", 
   {}, 
   404009, 
   null, 
   1275688020.0
  ], 
  [
   404012, 
   null, 
   "Symbiote", 
   "If you believe that's true, why don't you find some actual evidence for it? Surely your beliefs have some basis in reality and aren't just whingeing in the teachers' lounge.\n \n How much does a teacher in a private vs. a government school make? A nurse at a government vs private hospital? A police officer and a low level thug in a private street gang?\n \n And please do it without equivocating a government bureaucrat and Steve Jobs.", 
   {}, 
   404010, 
   null, 
   1275688500.0
  ], 
  [
   404014, 
   null, 
   "Jo Bennett", 
   "If you believe that's true, why don't you find some actual evidence for it?\n \n How much does a teacher in a private vs. a government school make?\n \n And please do it without equivocating a government bureaucrat and Steve Jobs.\n\n \n Private schools vary a lot, it depends on the school. Most pay at least the state main pay scale:\n Pay & Benefits of Teaching in Independent Schools - ISC\n I've done a bit of googling but can't find any hard data.\n \n I've already pointed to the evidence, in your own link, separated by general job type. Specific roles where the public sector is overwhelmingly dominant are unlikely to provide a reliable indicator, not least because public sector pay scales tend to dictate pay in those areas (this certainly seems to be the case in nursing http://www.nursing-pay.com/pay4.shtml ). I'm pretty sure private security get paid more than the army for going into warzones, though.", 
   {}, 
   404012, 
   null, 
   1275688920.0
  ], 
  [
   404038, 
   null, 
   "daewoo", 
   "I take it you prefer KPMG to do your tax work?\n\n \n Independent guy. \n \n I have been through 2 IRS audits where I had listed ammunition purchases as a business expense. In both cases they allowed it. It is surprisingly hard to find an accountant who is willing to put it down that way. \n \n A lot of accountants also seem to be really hesitant to let you claim an R&D tax credit for anything that cannot be explained in 10 words or less. \n \n Wimps\n \n \ncrooked tax accountants are probably a lot better than crooked financial reporting accountants but sadly those are normally under the same crooked management. I deal with only non profit and governmental accounting so no need to get creative. On the plus side I have a great perceptive on how types of governments and non profits/universities spend money. \n\n \n Uh...they spend money like drunken sailors in a whore house.....\n \n \nYeah we had some business administration classes to be a well rounded accountants. Probably my worst class if I remember correctly. I'm not very good at BS so come test time when I select the logical answer I was usually wrong. I seem to recall we even did a case study on Krispy Kreme and how awesome the management system was...good one :p\n\n \n LOL. Remember when Japanese management techniques were all the rage and we were all going to manage companies just like the Japanese???? Then, after years of hearing about how the Japanese do things, the business experts figured out what those of us who are actually IN business knew all along...that you cannot just emulate the Japanese management structure without the Japanese culture to make it work. DUH.", 
   {}, 
   403939, 
   null, 
   1275705180.0
  ], 
  [
   404039, 
   null, 
   "daewoo", 
   "\n I don't think so. Things aren't as they were. College is getting more expensive and the average salary of an American worker is shrinking. Many of us simply aren't going to college, and the ones that are are struggling. There's simply no way we can afford to not have a summer job.\n\n \n unless you work more at your night and weekend job\n \n \n \n\n It depends on what kind of work you hire for. But I would caution you against the \"all teenagers are irresponsible\" stereotype. There are plenty mature, hard working, responsible teens out there, but there are also plenty of immature idiotic ones. You need to learn to weed the good from the bad. If the government trusts me to be the pilot in command of an aircraft full of passengers, surely you can trust me to do more than push a broom.\n\n \n Probably not. GREAT! you can fly a plane (or are learning anyway). That does not mean you have the mental discipline to show up for work every day, work all day, and stay productive. There is a good chance it also does not mean that you have managed to figure out that you dont know everything...a common failing in younger people.\n \n \nI also might mention that age based discrimination is illegal.\n\n \n Here is a thought....dont tell them that you did not hire them because they are too young. If it ever comes up \"hired somebody with more experience\" works just as well. \n \n Obviously I cannot comment on you personally...these are just my observations after years of trying to integrate younger workers into my companies. Now I let somebody else play nursemaid. I will wait until the bugs are worked out.", 
   {}, 
   403940, 
   null, 
   1275705780.0
  ], 
  [
   404043, 
   null, 
   "Steeeeve", 
   "Independent guy. \n \n I have been through 2 IRS audits where I had listed ammunition purchases as a business expense. In both cases they allowed it. It is surprisingly hard to find an accountant who is willing to put it down that way. \n \n A lot of accountants also seem to be really hesitant to let you claim an R&D tax credit for anything that cannot be explained in 10 words or less. \n \n Wimps\nHa, well they got a little stricter with the laws so I understand being a wimp...if you lose your CPA it is all over. The best tax accountants aren't really the ones that find deductions anyway....they are the ones who know IRS agents. I have a friend who does small business taxes and basically he is on the phone with the IRS all day...it's amazing how quick taxes go down if you are about to make someone at the IRS life miserable.\n \n \nUh...they spend money like drunken sailors in a whore house.....\nHardly, drunken sailors don't have unlimited checkbooks. Most not for profits are somewhat ok but universities and states go a bit crazy. The funny thing is they do not go crazy on what you would think. For example a college might spend tons of money on research and so people say \"well that's good\". A closer look shows the research is rather worthless and makes you wonder why you pay for it in the first place. So it is things like that. Education is pretty low on the expenditure list for colleges.\n \n \nLOL. Remember when Japanese management techniques were all the rage and we were all going to manage companies just like the Japanese???? Then, after years of hearing about how the Japanese do things, the business experts figured out what those of us who are actually IN business knew all along...that you cannot just emulate the Japanese management structure without the Japanese culture to make it work. DUH.\nThis is why they were teaching it. People never seem to get the idea that you can't take one thing from one country and expect it to work the same in another. \"Let's do exactly what Norway does\"...well, Norway is 400 times smaller than the US. The US culture is different from a frozen country in Europe and slave workers in China.", 
   {}, 
   404038, 
   null, 
   1275709560.0
  ], 
  [
   404083, 
   null, 
   "Symbiote", 
   "As for prices in Aus, Steve, I don't know.\n \n Many imported goods are the same price as in the US or even slightly cheaper ater you take into account state-taxes. E.g. TVs, electronics in general.\n \n Clothing is for some reason much more expensive, I pay $80 for a shirt I can get in the US at any discount store (which are common) for $15 - $20 and the range available is smaller.\n \n Real estate, we have a \"bubble\" much like the US did, but unlike in the US, that bubble never burst. Throughout the GFC property prices just kept rising, despite home loan interest rates now up to ~7.5%, property prices are still going up.\n \n I strongly suspect they will come down, and may in fact come down real soon. But timing bubbles is a game for fools, they often go a lot higher and for a lot longer than anyone expected, until there's a crapload of surplus inventory waiting to be bought. And with ~4% unemployment, we don't havce the same mass of \"subprime\" loans waiting to bring down the lenders.", 
   {}, 
   404043, 
   null, 
   1275759180.0
  ], 
  [
   405974, 
   null, 
   "Anton", 
   "Me living in New Jersey the summer vacation is 2 month. \n In Russia in most places its 3 month.\n Even though the Russia has longer vacations it still manages to be tough on children and make them learn and achieve more. Perfect example why its a stupid idea. And kids would be pretty XXXXXX off too.", 
   {}, 
   373716, 
   null, 
   1277856660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Longer school days", 
  "url": "http://www.4forums.com/political/education-debates/13389-longer-school-days.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 13389, 
  "discussion_files": [
   [
    "24374.html", 
    "http://www.4forums.com/political/education-debates/13389-longer-school-days-print.html"
   ], 
   [
    "24375.html", 
    "http://www.4forums.com/political/education-debates/13389-longer-school-days-5-print.html"
   ], 
   [
    "24376.html", 
    "http://www.4forums.com/political/education-debates/13389-longer-school-days-4-print.html"
   ], 
   [
    "24377.html", 
    "http://www.4forums.com/political/education-debates/13389-longer-school-days-3-print.html"
   ], 
   [
    "24378.html", 
    "http://www.4forums.com/political/education-debates/13389-longer-school-days-2-print.html"
   ]
  ], 
  "identifier": 13389
 }
]