[
 [
  [
   372705, 
   null, 
   "jazyjason", 
   "I went to the theater today to watch Michael Moore's new movie Capitalism A love story. I must admit that I have not seen any of Moore;s previous films so I did not know what to expect. What I got was an eye opening shocker into the fragility and sheer horror that is America and it's system of government and economic system.\n \n Currently as I write this my family is facing potential foreclosure. My father works over 90 hours a week at two jobs and is 64. And yet, still cannot make up the difference of 55000 dollars we owe in the loss of value on our home, and in part due to the predatory refinancing scheme that my family bought into.\n \n Seeing the reality of just how corrupt and how sickening it is seeing the true face of what is now greed and cutthroat tactics all in the name of the almighty dollar shows how close to the brink we really are...\n \n Moore portrayed the fall of the Roman Empire and implied such things into the current situation America faces. It appears that history not only repeats itself, but echos of the validity of such events we have gone through today.\n \n I urge everyone here to see this film. This is not party politics. This is a film that goes after both Republican and Democrat. No one is safe in this film, not even Obama. Sure he is portrayed as a change but with sceptically and caution.\n \n I do not care what your opinion of Moore is, he really drove the point home that we people need to demand a change before the America we know and love is stolen right our from under our feet. Please please please go see this film. Trust me you will not be disappointed.", 
   {
    "post_info": {
     "post_title": "Capitalism : A love story. A MUST see!"
    }
   }, 
   null, 
   null, 
   1254743820.0
  ], 
  [
   372708, 
   null, 
   "Archangel", 
   "You mean what you got was an eye opening shocker into the world of leftist propaganda, and I can see that like a good sheeple you swallowed it hook line and sinker. Thankfully though, most people chose not to submit themselves to his brand of commentary and stayed away from the drivel you will so easily endorse because the movie tanked. Didn't you notice how empty it was in there for an opening weekend? \n \n Socialism and Christian-Bashing Crash at Box Office\n \n by John Nolte\n \n Tough times for leftie Hollywood. Nothing's gone right this week. None of this is their fault, of course. In order to understand that it might not be a good idea to rally around a child rapist, bash religion in a religious country or trash capitalism in a capitalist country you have to live in the real world...\n Steve Mason:\n Michael Moore's CAPITALISM tanks!Ricky Gervais has launched his second consecutive box office bomb as The Invention of Lying (Warner Bros) only mustered $2.2M or so to start the 3-day. The comedy should finish #5 with approximately $6.5M for the weekend. ...\n \n But the biggest disappointment of the weekend is Michael Moore's Capitalism: A Love Story (Overture). After a $57K per theatre average on 4 screens last weekend, the picture broke to a wider 962 locations with terrible results. The \"documentary\" only sold an estimated $1.3M in tickets to start the weekend, and it will finish at about $3.9M for a PTA of less than $4,000. That soft opening will almost certainly make Capitalism Moore's weakest-grossing movie since 2002's Bowling for Columbine ($21.5M domestic gross).\n As if all this isn't enough for our friends on the left to take in, you have $800 billion spent to get us to 9.8% unemployment, the *poof* of the public option, and a nine-month World Apology Tour resulting in Rio getting the Olympics.\n And what can we expect as a result of these \"teachable moments?\"\n What's that phrase again...? Oh, yeah: More Of The Same.\n Big Hollywood Blog Archive Socialism and Christian-Bashing Crash at Box Office", 
   {
    "unicode_changes_made": true
   }, 
   372705, 
   null, 
   1254750420.0
  ], 
  [
   372710, 
   null, 
   "gansao", 
   "The last thing the Western world needs is a self loathing, navel gazing United States. I think Moore has taken a step too far.", 
   {}, 
   372708, 
   null, 
   1254751860.0
  ], 
  [
   372715, 
   null, 
   "jyoshu", 
   "No one is safe in this film, not even Obama.\n\n \n What about Michael Moore? Did it go after him?\n For someone who supposedly hates capitalism, he sure hasn't shyed away from reaping its benefits .... emoticon_xangel\n I think CNSNews nailed it on this one ...\"According to Fortune Magazine, Moore&#8217;s films have grossed over $300 million worldwide. His highest grossing film was &#8220;Fahrenheit 9/11,&#8221; which critiques the Bush administration&#8217;s handling of the war in Iraq and earned over $200 million worldwide. \n Moore reportedly was paid $21 million by Disney for producing, directing and creating the film. \n Moore also earned 50 percent of the profits of his 2007 film &#8220;Sicko,&#8221; totaling $25 million plus DVD sales, according to Vanity Fair. \n The Los Angeles Times reported that Moore would receive all of the profits made from DVD sales of &#8220;Sicko,&#8221; sales of which have been estimated at over $17 million.\"CNSNews.com - Millionaire Filmmaker Michael Moore: ?Capitalism Did Nothing For Me?\n Quite the capitalist!\n That's what anti-capitalists don't get. The very thing they are railing against and calling for everyone to change is what allows them the the opportunity and success for their liberal message. Sorta like Al Gore's use of private jets that get him to global warming conferences.", 
   {}, 
   372710, 
   null, 
   1254757800.0
  ], 
  [
   372721, 
   null, 
   "JPSartre12", 
   "I went to the theater today to watch Michael Moore's new movie Capitalism A love story. I must admit that I have not seen any of Moore;s previous films so I did not know what to expect. What I got was an eye opening shocker into the fragility and sheer horror that is America and it's system of government and economic system.\n \n Currently as I write this my family is facing potential foreclosure. My father works over 90 hours a week at two jobs and is 64. And yet, still cannot make up the difference of 55000 dollars we owe in the loss of value on our home, and in part due to the predatory refinancing scheme that my family bought into.\n Seeing the reality of just how corrupt and how sickening it is seeing the true face of what is now greed and cutthroat tactics all in the name of the almighty dollar shows how close to the brink we really are...\n \n Moore portrayed the fall of the Roman Empire and implied such things into the current situation America faces. It appears that history not only repeats itself, but echos of the validity of such events we have gone through today.\n \n I urge everyone here to see this film. This is not party politics. This is a film that goes after both Republican and Democrat. No one is safe in this film, not even Obama. Sure he is portrayed as a change but with sceptically and caution.\n \n I do not care what your opinion of Moore is, he really drove the point home that we people need to demand a change before the America we know and love is stolen right our from under our feet. Please please please go see this film. Trust me you will not be disappointed.\n\n \n Let's be honest here. Your father took out a second mortgage on the equity in your home to do what? buy more adult toys? like cars? a boat? and then the real estate market tanked, leaving him with more debt than equity. And that's the system's fault? Did the banks hold a gun to your father's head and demand he take their money? Or was he attracted to the low interest rates and figured it was too good to be true?\n The real estate market tanked precisely because of actions like your father's. \n People took the equity out of their houses and spent it on \"things\". This created a false economic boom that was fueled almost completely by the increase in personal debt. I fell victim to the same opium that your father did, easy money, but I only partook of a smaller dose and was able to overcome the real estate bubble's popping because my equity to debt ratio was much higher. \n Sorry if I don't sound very sympathetic, but unless your father took out his equity because he had to, my sympathy's tied up elsewhere.", 
   {}, 
   372705, 
   null, 
   1254762720.0
  ], 
  [
   372727, 
   null, 
   "tester", 
   "... Thankfully though, most people chose not to submit themselves to his brand of commentary and stayed away from the drivel you will so easily endorse because the movie tanked. \n\n \n If you mean that, literally, \"most\" people stayed away, then I suppose you're right. But, if that is what you really meant then it is a profoundly weak statement because \"most\" people \"stay away\" from all movies on any given weekend. In comparison to other movies, however, I'd say that Capitalism: A Love Story did quite well for a documentary: it  tied for #6 in terms of total box-office sales this past weekend, and it was #4 in terms of per-theater box-office sales.\n \n More importantly, however, I'd say that box-office sales are NOT a good quality measure for documentaries in the first place!", 
   {}, 
   372708, 
   null, 
   1254763920.0
  ], 
  [
   372732, 
   null, 
   "JPSartre12", 
   "If you mean that, literally, \"most\" people stayed away, then I suppose you're right. But, if that is what you really meant then it is a profoundly weak statement because \"most\" people \"stay away\" from all movies on any given weekend. In comparison to other movies, however, I'd say that Capitalism: A Love Story did quite well for a documentary: it  tied for #6 in terms of total box-office sales this past weekend, and it was #4 in terms of per-theater box-office sales.\n \n More importantly, however, I'd say that box-office sales are NOT a good quality measure for documentaries in the first place!\n\n \n Oh, I don't know about that. March of the Penguins was a box office success ANF an Oscar winner for best documentary. \n Calling any of Moore's movies \"a documentary\" requires one to employ some artistic license with the term and some slight of hand. emoticon_rolleyes", 
   {}, 
   372727, 
   null, 
   1254766860.0
  ], 
  [
   372745, 
   null, 
   "tester", 
   "Oh, I don't know about that. March of the Penguins was a box office success ANF an Oscar winner for best documentary. \n Calling any of Moore's movies \"a documentary\" requires one to employ some artistic license with the term and some slight of hand. emoticon_rolleyes\n\n \n Two things:\n \n 1) His films are indeed documentaries; they clearly fall under that genre. You can certainly criticize them for being sensationalistic, ideologically biased and poorly documented (and I'd agree with you -- I've HATED most of his films for these reasons), but they are still documentaries.\n \n 2) I don't think the fact that you can cite an example of a film that received both popular and critical support (e.g., March of the Penguins) is a good argument for the generalization that popular support is therefore a good gauge for the quality of a film. Think of the converse: would you argue that ALL top-grossing films should also be considered great films? It depends on what you value in film. And, for the case of a documentary, I don't think popular appeal is a good measure.\n \n My point is that I think it is silly to criticize a movie based on box-office sales unless appeal to mass culture is the criterion upon which you intend to base that criticism. For a documentary, or any film for that matter, I think it would make far more sense to address the film's content in a substantive discussion.", 
   {}, 
   372732, 
   null, 
   1254768660.0
  ], 
  [
   372751, 
   null, 
   "Accipiter", 
   "You mean what you got was an eye opening shocker into the world of leftist propaganda, and I can see that like a good sheeple you swallowed it hook line and sinker.\n\n \n yeah just like you and your idols Glenn Beck, Rush Limbaugh, etc.", 
   {}, 
   372708, 
   null, 
   1254770100.0
  ], 
  [
   372754, 
   null, 
   "Steeeeve", 
   "Saying a Michael Moore film is an eye opener is like saying the \"9/11 truth\" movies are eye openers.", 
   {}, 
   372745, 
   null, 
   1254770760.0
  ], 
  [
   372759, 
   null, 
   "JPSartre12", 
   "Two things:\n \n 1) His films are indeed documentaries; they clearly fall under that genre. You can certainly criticize them for being sensationalistic, ideologically biased and poorly documented (and I'd agree with you -- I've HATED most of his films for these reasons), but they are still documentaries.\n \n 2) I don't think the fact that you can cite an example of a film that received both popular and critical support (e.g., March of the Penguins) is a good argument for the generalization that popular support is therefore a good gauge for the quality of a film. Think of the converse: would you argue that ALL top-grossing films should also be considered great films? It depends on what you value in film. And, for the case of a documentary, I don't think popular appeal is a good measure.\n \n My point is that I think it is silly to criticize a movie based on box-office sales unless appeal to mass culture is the criterion upon which you intend to base that criticism. For a documentary, or any film for that matter, I think it would make far more sense to address the film's content in a substantive discussion.\n\n \n What is the criterai for calling a film a documentary? Isn't factual information a part of that definition? Moore's movies are more Goebbels-esque propaganda than fact.", 
   {}, 
   372745, 
   null, 
   1254771840.0
  ], 
  [
   372767, 
   null, 
   "simone", 
   "I must say that Farenheit 911 was an eye-opener for me.\n \n I'd never realized that Bush II was unable to to the normal walk to the White House when he became president because of hostility against him and he had to hop a limo to the White House.\n \n I was not aware of the drama that occurred in the Senate where Senators were too cowardly to challenge the U.S. Supreme Court investiture of George W. Bush as president.\n \n Our mainstream omitted to cover those most important events.\n \n Right wing censorship!", 
   {}, 
   372759, 
   null, 
   1254773280.0
  ], 
  [
   372778, 
   null, 
   "JPSartre12", 
   "I must say that Farenheit 911 was an eye-opener for me.\n \n I'd never realized that Bush II was unable to to the normal walk to the White House when he became president because of hostility against him and he had to hop a limo to the White House.\n \n I was not aware of the drama that occurred in the Senate where Senators were too cowardly to challenge the U.S. Supreme Court investiture of George W. Bush as president.\n \n Our mainstream omitted to cover those most important events.\n \n Right wing censorship!\n\n \n If you want to read about Moore's tactics of using inuendo and half-truths, check out this:\n FactCheck.org: Media Fund Twists the Truth More Than Michael Moore\n and this one\n Fifty-nine Deceits in Fahrenheit 911, Dave Kopel, Independence Institute", 
   {}, 
   372767, 
   null, 
   1254774660.0
  ], 
  [
   372848, 
   null, 
   "jazyjason", 
   "You mean what you got was an eye opening shocker into the world of leftist propaganda, and I can see that like a good sheeple you swallowed it hook line and sinker. Thankfully though, most people chose not to submit themselves to his brand of commentary and stayed away from the drivel you will so easily endorse because the movie tanked. Didn't you notice how empty it was in there for an opening weekend?\n \n \n Actually Archie it was neither left nor right. he went after both democrat and republican and took a center tone to the entire issue at hand. Portraying the reality of the suffering of his hometown due to jobs leaving the US and the greed on wall street. \n \n \n \n \nAs if all this isn't enough for our friends on the left to take in, you have $800 billion spent to get us to 9.8% unemployment, the *poof* of the public option, and a nine-month World Apology Tour resulting in Rio getting the Olympics.\n And what can we expect as a result of these \"teachable moments?\"\n What's that phrase again...? Oh, yeah: More Of The Same.[/COLOR]\n Big Hollywood Blog Archive Socialism and Christian-Bashing Crash at Box Office\n\n \n There was no Christian bashing in the movie. Rather Moore went to Catholic priests to get their opinions on capitalism in it's current form and how it relates to what Christ said in His time. So before you jump on the GOP bandwagon ranting and screaming go actually see the film and THEN give me an opinion that is valid....", 
   {
    "unicode_changes_made": true
   }, 
   372708, 
   null, 
   1254789840.0
  ], 
  [
   372864, 
   null, 
   "unkerpaulie", 
   "If you want to read about Moore's tactics of using inuendo and half-truths, check out this:\n FactCheck.org: Media Fund Twists the Truth More Than Michael Moore\n and this one\n Fifty-nine Deceits in Fahrenheit 911, Dave Kopel, Independence Institute\n\n those 56 deciets ended up being 2 points that actually identified real errors in the movies and 54 points that dave koppel bitched about because he doesn't like moore. It always goes like this, we have all these people that hate moore because he paints an ugly (but factual) picture of america, then rather than prove that the film is based on lies by actually pointing out the lies, they just rant about how evil moore is, how he's making money and he's not patriotic. So you have a bunch of people who haven't seen the movie arguing about how bad the movie was.", 
   {}, 
   372778, 
   null, 
   1254800580.0
  ], 
  [
   372913, 
   null, 
   "Steeeeve", 
   "those 56 deciets ended up being 2 points that actually identified real errors in the movies and 54 points that dave koppel bitched about because he doesn't like moore. It always goes like this, we have all these people that hate moore because he paints an ugly (but factual) picture of america, then rather than prove that the film is based on lies by actually pointing out the lies, they just rant about how evil moore is, how he's making money and he's not patriotic. So you have a bunch of people who haven't seen the movie arguing about how bad the movie was.\nThis is almost too funny.\n \n I could easily just take this paragraph and replace dave koppel with michael moore and visa versa. It isn't a secret that Michael Moore puts as much thought into his movies as the 9/11 Truthers. They are misleading and filled with half-truths...probably like this Koppel guy. If you want a true fact based perspective than find the most boring book or movie on the topic and it is probably the best", 
   {}, 
   372864, 
   null, 
   1254844260.0
  ], 
  [
   372915, 
   null, 
   "unkerpaulie", 
   "This is almost too funny.\n \n I could easily just take this paragraph and replace dave koppel with michael moore and visa versa. It isn't a secret that Michael Moore puts as much thought into his movies as the 9/11 Truthers. They are misleading and filled with half-truths...probably like this Koppel guy. If you want a true fact based perspective than find the most boring book or movie on the topic and it is probably the best\n\n Try this. Actually point out the lies in the movie, rather than just sitting there asserting that the movie is full of lies.", 
   {}, 
   372913, 
   null, 
   1254846120.0
  ], 
  [
   372947, 
   null, 
   "Steeeeve", 
   "Try this. Actually point out the lies in the movie, rather than just sitting there asserting that the movie is full of lies.\n\n \n Which movie? Also, do you really expect me to rebuke an entire movie here on these forums...don't be silly. There is plenty of evidence out there to show Moore is doing nothing more than misleading people or presenting half-truths. \n \n Do you seriously think this guy is credible? I mean honestly!?!?! This guy is a tool! \n \n This would be like someone coming up to me and saying Rush Limbaugh is credible for a documentary on Obama.", 
   {}, 
   372915, 
   null, 
   1254858900.0
  ], 
  [
   373042, 
   null, 
   "foundit66", 
   "I'm not a big fan of CNS, but in this case they show the video of Michael Moore answering the question so them repeating what Michael Moore actually said seems pretty straight-forward.\n \n \nDocumentary film director Michael Moore, who has become a millionaire thanks to the profits from his movies, told CNSNews.com that \"capitalism did nothing\" for him. \n \n CNSNews.com spoke with Moore on the red carpet at the Uptown Theatre in Washington, D.C., on Tuesday night before the premiere of his upcoming documentary, \"Capitalism: A Love Story.\"\n \n CNSNews.com asked: \"Critics may say, when they see this movie, Michael Moore has amassed a fortune of over $50 million, some have said and -\"\n \n Moore said: \"Really? Are you kidding me? Seriously? Wow. Where did it go?\"\n \n CNSNews.com then asked Moore: \"Critics would say he's [Moore] been very successful under a capitalist system. How would you justify making a movie where you paint capitalism as evil?\"\n \n Moore said: \"Well, capitalism did nothing for me, starting with my first film.\"\n \n \"You know, I had to pretty much beg, borrow and steal,\" he said. \"The system is not set up to help somebody from the working class make a movie like this and get the truth out there.\"\n \n \"In fact, in Fahrenheit 9/11 if you remember, capitalism, the Disney Corporation, tried to kill that film--tried to make it so that people couldn't see it,\" said Moore. \"My book Stupid White Men--Harper Collins tried to kill that book so that people couldn't see it. It's only because I put the light of day on it and told people what was going on did people get the chance to see these things.\"\n\n CNSNews.com - Millionaire Filmmaker Michael Moore: ?Capitalism Did Nothing For Me?\n \n I think Michael Moore often brings up thought-provoking points.\n Unfortunately, he also says things which are (IMO) just plain backwards.\n The above being a prime example.\n \n He talks about people trying to kill his previous work.\n I'm not really sure how \"capitalism\" (the actual concept of it) is actually to blame. IMO, he's playing fast and loose with his ideology assessment.\n Moreover, it is very possible that capitalism (people seeing profit out of Michael Moore's product) is what caused people to IGNORE others trying to halt his work, and put it out there anyways.\n \n But more to the point, he's giving examples of his HISTORICAL work and its difficulties.\n He needs to admit that capitalism is one of the reasons why his CURRENT work is not having such problems.\n \n I think capitalism needs a wary eye. Unfettered, it serves the almighty dollar sign.\n But in other ways, it's ironic that his skepticism of capitalism and rich people could easily be seen as reflective of other people's earlier comments...\n 1 Timothy 6:10 For the love of money is the root of all evil\n Matthew 19:24  Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\"", 
   {
    "unicode_changes_made": true
   }, 
   372947, 
   null, 
   1254877440.0
  ], 
  [
   373051, 
   null, 
   "unkerpaulie", 
   "Which movie? Also, do you really expect me to rebuke an entire movie here on these forums...don't be silly. There is plenty of evidence out there to show Moore is doing nothing more than misleading people or presenting half-truths. \n \n Do you seriously think this guy is credible? I mean honestly!?!?! This guy is a tool! \n \n This would be like someone coming up to me and saying Rush Limbaugh is credible for a documentary on Obama.\n\n If, as you say, moore's movies are full of lies, then how hard could it be to pick a movie and point out a lie? Any movie, any lie. If you can't point out a single lie in a single movie, then why should I take you seriously. \n \n And if limbaugh actually did a documentary that exposed obama's corruption, and the info was factual, then it wouldn't matter who did the movie. Facts compiled by sensationalist are still facts, and the person compiling them doesn't make them less factual", 
   {}, 
   372947, 
   null, 
   1254883140.0
  ], 
  [
   373128, 
   null, 
   "Steeeeve", 
   "If, as you say, moore's movies are full of lies, then how hard could it be to pick a movie and point out a lie? Any movie, any lie. If you can't point out a single lie in a single movie, then why should I take you seriously. \nI don't use lie because you don't know intent. I say misleading or presenting half-truths. In any event, you admitted two yourself from the Far 9/11 movie. Exactly how many would you want? Clearly two isn't enough. Even in bowling for columbine he had misleading statements. Everything from fabricating parts of old political ads to not actually presenting fair gun data from Canada. In other words, he cherry picks to get a result. Sicko gives examples of people dying because the insurance company won't pay but they fail to mention if another system would have covered the treatment. Turns out it examples he gives that Canada and the UK wouldn't cover it either! He was also wrong about waiting times in Canada. \n \n This is just to name a few. \n \n \nAnd if limbaugh actually did a documentary that exposed obama's corruption, and the info was factual, then it wouldn't matter who did the movie. Facts compiled by sensationalist are still facts, and the person compiling them doesn't make them less factual\nBut they wouldn't be facts...you and I both know that. They would be cherry picked, half-truths that don't give the full picture and are meant to mislead the viewer. \n \n I find it unreal that you can't see this.", 
   {}, 
   373051, 
   null, 
   1254934500.0
  ], 
  [
   373179, 
   null, 
   "JPSartre12", 
   "those 56 deciets ended up being 2 points that actually identified real errors in the movies and 54 points that dave koppel bitched about because he doesn't like moore. It always goes like this, we have all these people that hate moore because he paints an ugly (but factual) picture of america, then rather than prove that the film is based on lies by actually pointing out the lies, they just rant about how evil moore is, how he's making money and he's not patriotic. So you have a bunch of people who haven't seen the movie arguing about how bad the movie was.\n\n \n Wazzupo Unk!!! WE haven't chatted in ages. Good to see you.\n Now, pleasantries aside, \n here's some more on Moore:\n The lies of Michael Moore. - By Christopher Hitchens - Slate Magazine\n Michael Moore : EXPOSED!", 
   {}, 
   372864, 
   null, 
   1254951180.0
  ], 
  [
   373181, 
   null, 
   "simone", 
   "Was Hitchens sober when he wrote that piece?", 
   {}, 
   373179, 
   null, 
   1254952020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Capitalism : A love story. A MUST see!", 
  "url": "http://www.4forums.com/political/politics-debates/13392-capitalism-love-story-must-see.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13392, 
  "discussion_files": [
   [
    "26512.html", 
    "http://www.4forums.com/political/politics-debates/13392-capitalism-love-story-must-see-print.html"
   ], 
   [
    "26513.html", 
    "http://www.4forums.com/political/politics-debates/13392-capitalism-love-story-must-see-2-print.html"
   ]
  ], 
  "identifier": 13392
 }
]