[
 [
  [
   373315, 
   null, 
   "jyoshu", 
   "As if Obama wasn't in bad enough shape in his Afghanistan fiasco, now he has a serious troop morale problem that's coming to public light ...\n \n American troops in Afghanistan losing heart, say army chaplains - Times Online\n \n As a side note, I also find it fascinating that people are having to go to British journalism to get any real information about what's going on there. \n One can only surmise that the reason these problems aren't being reported on much in the American media is because of their love affair with Obama.", 
   {
    "post_info": {
     "post_title": "American troops in Afghanistan losing heart"
    }
   }, 
   null, 
   null, 
   1255016880.0
  ], 
  [
   373367, 
   null, 
   "foundit66", 
   "It's funny to note that you don't even try to quote from the article you post...\n Probably because the ACTUAL REASONS for the \"losing heart\" are not helping your cause...\n Many feel that they are risking their lives - and that colleagues have died - for a futile mission and an Afghan population that does nothing to help them, the chaplains told The Times in their makeshift chapel on this fortress-like base in a dusty, brown valley southwest of Kabul.\n \n \"The many soldiers who come to see us have a sense of futility and anger about being here. They are really in a state of depression and despair and just want to get back to their families,\" said Captain Jeff Masengale, of the 10th Mountain Division's 2-87 Infantry Battalion.\n \n \"They feel they are risking their lives for progress that's hard to discern,\" said Captain Sam Rico, of the Division's 4-25 Field Artillery Battalion. \"They are tired, strained, confused and just want to get through.\" The chaplains said that they were speaking out because the men could not.\n And what your partisanry will refuse to recognize is that this same opinion IS GROWING IN THE STATES AS WELL.\n Questions as to how legitimate our actions truly are in that country regarding whether or not we're just propping up a government that committed election fraud to be in power.\n \n But people like you see it as a way to attack Obama, so you post a headline and leave it at that. \n Did you even bother to look closer for the REAL REASONS?\n \n There is a growing opinion questioning our methodology in Afghanistan. There are some people talking about whether or not we should shift our approach to just be about surgical strikes instead of holding ground that is held for who???\n A corrupt and illegitimate government?\n \n \n \nAs a side note, I also find it fascinating that people are having to go to British journalism to get any real information about what's going on there.\n One can only surmise that the reason these problems aren't being reported on much in the American media is because of their love affair with Obama.\n\n Yeah. You would jump to that conclusion.\n The truth is that our American journalism often is inferior to other journalism like the British on issues like this.\n \n And it was a problem under Bush as well.\n Take a look at our news industry response to Bush's lies about \"we do not torture\". The American press essentially gave him a free pass on that one.\n In Britain, they have a more time-honored practice of holding their politicians accountable for things like that...", 
   {
    "unicode_changes_made": true
   }, 
   373315, 
   null, 
   1255038420.0
  ], 
  [
   373376, 
   null, 
   "simone", 
   "I wonder very much how many times our people in Afghanistan have been redeployed into the midst of battle.\n \n George W. Bush ran our military into the ground with his bootless Iraq adventure. Now Obama is left with Bush's multiple messes and a destroyed military.", 
   {}, 
   373367, 
   null, 
   1255039740.0
  ], 
  [
   373378, 
   null, 
   "jyoshu", 
   "And what your partisanry will refuse to recognize is that this same opinion IS GROWING IN THE STATES AS WELL.\n Questions as to how legitimate our actions truly are in that country regarding whether or not we're just propping up a government that committed election fraud to be in power.\n \n But people like you see it as \n\n \n The REALLY ironic thing is that, during the Iraq war, we kept hearing Democrats say that we needed to focus more on Afghanistan, instead.\n Now that we ARE, Democrats like Foundit are now talking about whether our actions there are legitimate or not. \n Rather than truly getting behind it and sticking to what they've ALREADY said we should do. :)", 
   {}, 
   373367, 
   null, 
   1255039860.0
  ], 
  [
   373384, 
   null, 
   "foundit66", 
   "The REALLY ironic thing is that, during the Iraq war, we kept hearing Democrats say that we needed to focus more on Afghanistan, instead.\n Now that we ARE, Democrats like Foundit are now talking about whether our actions there are legitimate or not. \n\n emoticon_emb\n What is it with some Republicans and refusing to notice SIGNIFICANT CHANGES in the situation.\n \n With the CURRENT situation, there is the added question of the rigged election.\n Why the heck should we fight to help establish that government's control in a country they don't legitimately have a claim to?\n \n The article and I have already addressed this.\n The article is talking about THE MILITARY MEMBERS having the concerns that the left are currently talking about...\n \n Like I have already pointed out, there are significant voices talking about SURGICAL strikes, instead of \"occupying\" tactics to help hold land.\n It would take less troops and be safer for our troops, but still attacking the Taliban.", 
   {}, 
   373378, 
   null, 
   1255040280.0
  ], 
  [
   373481, 
   null, 
   "Jo Bennett", 
   "This isn't really British journalism, it's another branch of News Corporation. US reluctance to report on this has more to do with the hero-worship of the armed forces in the US than love for Obama, otherwise Fox would be all over it and using it as a stick to beat Obama.", 
   {}, 
   373384, 
   null, 
   1255070160.0
  ], 
  [
   375130, 
   null, 
   "Master of puppe", 
   "Americans are propagating infection in the whole Central Asia!\n US head command in Afghanistan accuses it's allies in inactivity, treason and other. But in truth Americans don't differ from Italians who tried to agree with Tallibs about nonaggression! As became well-known Americans introduce 'the most-favoured status' with regards to IMU troops what take part in war at Tallibs side! In fact Yankees give them the green light to Tajikistan, Uzbekistan and Kirghizia where Washington has influence at government. Moreover Pentagon ready to provide it's 'wardship' by everything required if only they leave Afghanistan territory. And of course Washington doesn't care that by this way it sap situation in Central Asia!", 
   {
    "post_info": {
     "post_title": "Americans are propagating infection in the whole Central Asia!"
    }, 
    "unicode_changes_made": true
   }, 
   373315, 
   null, 
   1256138640.0
  ], 
  [
   375683, 
   null, 
   "jyoshu", 
   "And more on this ...\n \n Morale dips for American marines in Afghanistan - Times Online", 
   {}, 
   375130, 
   null, 
   1256597400.0
  ], 
  [
   378145, 
   null, 
   "jyoshu", 
   "Army says morale down among troops in Afghanistan\n \n Looks like the problem is finally starting to get reported in U.S. media. It's about time. Obama is taking months to make a decision on Afghanistan while our troops flounder and risk being killed.", 
   {}, 
   375683, 
   null, 
   1258147800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  American troops in Afghanistan losing heart", 
  "url": "http://www.4forums.com/political/politics-debates/13419-american-troops-afghanistan-losing-heart.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13419, 
  "discussion_files": [
   [
    "10567.html", 
    "http://www.4forums.com/political/politics-debates/13419-american-troops-afghanistan-losing-heart-print.html"
   ]
  ], 
  "identifier": 13419
 }
]