[
 [
  [
   373212, 
   null, 
   "foundit66", 
   "The right wing has a new target: Kevin Jennings, whom President Obama appointed Assistant Deputy Secretary at the Department of Education for the Office of Safe and Drug Free Schools (OSDFS). Jennings has had a distinguished career as a teacher, author, and founder of Gay, Lesbian, and Straight Education Network (GLSEN), an organization that works to make schools safe for all students, regardless of sexual orientation or gender identity.\n \n It is primarily Jennings' work with GLSEN that has so outraged the far right. The Family Research Council (FRC) launched the \"Stop Kevin Jennings\" campaign this week, warning that he is a \"radical homosexual activist\" who has \"worked tirelessly to bring the homosexual agenda into our nation's classrooms.\" \"His history demonstrates disregard for our obligations to safeguard the health and well being of the student population,\" writes FRC President Tony Perkins.\n \n ThinkProgress investigated FRC's claims and spoke to people who have worked with Jennings.\n\n Think Progress FACT CHECK: The Right-Wing Smear Campaign Against Kevin Jennings\n \n The article goes on to list a variety of smears that right-wingers are attempting against Jennings.", 
   {
    "post_info": {
     "post_title": "Right-Wing Smear Campaign Against Kevin Jennings"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1254955200.0
  ], 
  [
   373213, 
   null, 
   "foundit66", 
   "One of the smears against Jennings is to accuse him of statutory rape. emoticon_angry\n \n The <bleeping< pathetic thing about it?\n The supposed victim REFUTES their allegations!\n \n \nA former student of an Obama Administration official is coming to his defense, as critics seek to use a 20-year-old incident to call for the official's resignation.\n \n Kevin Jennings, who heads the Department of Education's Office of Safe and Drug Free Schools, is under fire for counseling advice he gave a teenage gay student more than two decades ago.\n \n Conservative groups charge that Jennings, who is openly gay, condoned statutory rape and child molestation. That's in reference to an incident in 1988 when Jennings, who was a teacher at the time, did not tell authorities that a 16-year-old student revealed to Jennings that he'd had sex with an older man.\n \n Now that former student is speaking out for the first time and telling CNN he did not have sex with that man at all.\n\n Ex-pupil defends Obama aide over controversial advice in 1988 - CNN.com\n \n Furthermore, THERE IS NO REASON for Jennings to have reported such a thing in the first place.\n Silly thing. The law...\n The kid would have been 16-years old which is ABOVE that state's age of \"staturoy rape\"... emoticon_angry", 
   {}, 
   373212, 
   null, 
   1254955380.0
  ], 
  [
   373217, 
   null, 
   "jyoshu", 
   "LOL\n Funny how the article completely skirts the Harry Hay issue ...", 
   {}, 
   373213, 
   null, 
   1254956340.0
  ], 
  [
   373219, 
   null, 
   "foundit66", 
   "LOL\n Funny how the article completely skirts the Harry Hay issue ...\n\n What Harry Hay issue? emoticon_confused\n \n On another level, I find it funny how you completely skirted the articles.\n But then again, you criticizing your fellow Christian anti-gay members for inexcusable egregious behavior? I am not holding my breath...", 
   {}, 
   373217, 
   null, 
   1254957000.0
  ], 
  [
   373292, 
   null, 
   "kiwimac", 
   "Oh, please so he knew Harry Hay? Please. Find something real to complain about.", 
   {}, 
   373219, 
   null, 
   1254989100.0
  ], 
  [
   373316, 
   null, 
   "jyoshu", 
   "What Harry Hay issue? emoticon_confused\n\n \n You can't be serious.\n It's like ... one of the main reason Jennings is under fire publicly.\n Let's just say I don't think you REALLY want to be in the position of defending this nut considering who he considers his 'inspiration.'", 
   {}, 
   373219, 
   null, 
   1255017900.0
  ], 
  [
   373323, 
   null, 
   "Steeeeve", 
   "I hadn't looked into this until I saw it posted here..mainly because I could care less...but since it is here I thought it was worthy of my consideration.\n \n I find it a little odd Foundit is upset people are using guilt by association as a tactic considering he feels that is a good one to use versus people like Sarah Palin but nevertheless it isn't about him.\n \n My first reaction was why does this position even exist. So far I haven't found a reasonable answer. \n \n Second, I guess, is the main question about whether or not he is qualified. You got the boy advice thing, the Harry Hay thing, and the talking about drug use thing. Those are the three I've seen the most. The boy advice thing is confusing considering the story the teacher (Jennings) gave is different from what the boy said. So Jennings thought he was 15 even if he was 16 at the time. I'm not sure what to make of this but it was a long time ago and Jennings probably was pretty stupid being only 24. I'd let that one go. The NAMBLA thing doesn't seem to hold much water either. The drug thing is a reference in his own book which makes it a little ironic he is the drug free guy but again it was a young and stupid thing. I don't know if he ever spoke against it later or later in the book. \n \n Frankly this doesn't seem like a big deal. This position is pointless and not that big. If Jennings is doing his pointless job like he is supposed to than who cares...let it go. I wonder if there is an \"office of school playground and common grounds upkeep\" that I become director...ha.", 
   {}, 
   373316, 
   null, 
   1255021620.0
  ], 
  [
   373329, 
   null, 
   "jyoshu", 
   "I'd let that one go. The NAMBLA thing doesn't seem to hold much water either. \n\n \n Steeeeve,\n There is clear photographic evidence putting Harry Hay at their gatherings, and Jennings is on record saying he found the guy inspiring. Pointing that out is no smear campaign; it's the facts. He's an expert on the history of the gay rights movement, so it's not like he wouldn't have known the connection. I really don't want to get into it much because I don't think it's really fair to carry on about Nambla on a gay rights forum, as the two are really separate issues--this thread really belongs in the politics forum anyway. (PM me if you want the links.) I simply found it interesting that the article completely skirted one of the biggest issues about Jennings (probably because they have no rebuttal)", 
   {}, 
   373323, 
   null, 
   1255027200.0
  ], 
  [
   373349, 
   null, 
   "Steeeeve", 
   "Steeeeve,\n There is clear photographic evidence putting Harry Hay at their gatherings, and Jennings is on record saying he found the guy inspiring. Pointing that out is no smear campaign; it's the facts. He's an expert on the history of the gay rights movement, so it's not like he wouldn't have known the connection. I really don't want to get into it much because I don't think it's really fair to carry on about Nambla on a gay rights forum, as the two are really separate issues--this thread really belongs in the politics forum anyway. (PM me if you want the links.) I simply found it interesting that the article completely skirted one of the biggest issues about Jennings (probably because they have no rebuttal)\n\n \n But inspired him in what way and does this even make a difference in his pointless job. I don't see how it does which misses the much bigger point that this job shouldn't even exist because it is beyond worthless. I mean every day you see the republicans trying to tear up some Obama appointment which is a waste of time and only makes you look like a jerk. Obama can fail on his own...he doesn't need help by ripping up a guy in some low level post.\n \n Come on, I know you want to show Obama is not doing good for the country but you can easily show real examples instead of relying on some Jennings guy I just heard about a few days ago.\n \n Now, I'm ok with smearing Foundit66 who clearly likes this kind of political tactic:\n \n http://www.4forums.com/political/politics-debates/12675-palins-choice-not-like-sophies.html", 
   {}, 
   373329, 
   null, 
   1255032900.0
  ], 
  [
   373360, 
   null, 
   "foundit66", 
   "I hadn't looked into this until I saw it posted here..mainly because I could care less...but since it is here I thought it was worthy of my consideration.\n I find it a little odd Foundit is upset people are using guilt by association as a tactic considering he feels that is a good one to use versus people like Sarah Palin but nevertheless it isn't about him.\n\n This tactic of yours where you just wander around trying to smear me is pathetic.\n \n First of all, WHAT ACTUAL \"guilt by association\" tactic is the right using against Jennings.\n Reviewing the items I've documented so far, they aren't even in that arena in the first place.\n \n It's another example of how you make allegations without even reading what is posted first... :xbanghead\n \n \n \nMy first reaction was why does this position even exist. So far I haven't found a reasonable answer. \n\n The \"Assistant Deputy Secretary at the Department of Education for the Office of Safe and Drug Free Schools\" position?\n \n Wasn't it Reagan who started in with the drug free politics? emoticon_rolleyes\n \n Once again, good for the Republican.\n But when the Democrat does likewise, Repubs challenge it like it's scandalous... emoticon_rolleyes\n \n \n \nSecond, I guess, is the main question about whether or not he is qualified. You got the boy advice thing, the Harry Hay thing, and the talking about drug use thing. Those are the three I've seen the most. The boy advice thing is confusing considering the story the teacher (Jennings) gave is different from what the boy said. So Jennings thought he was 15 even if he was 16 at the time.\n\n Can you quote any source that states Jennings THOUGHT the boy was 15?\n \n \n \nThe NAMBLA thing doesn't seem to hold much water either.\n\n After googling, I find vague references from Jennings towards \"Harry Hay\".\n It's like people playing the degrees of separation from Kevin Bacon game.\n Jennings never claimed anything regarding NAMBLA that I see.\n Jennings made positive comments about \"Harry Hay\", but I'm still trying to find an actual quote.\n \n Reviewing some right-wing resources, they don't include quotes. They just say it was a positive comment.\n Harry Hay did a LOT of good work towards gay equality before he got involved with NAMBLA. It seems like another smear campaign to pretend that Jennings was praising NAMBLA, when the probable truth is that he was probably referring to Harry Hay's positive gay rights work.\n \n Martin Luther King Jr. has some reported issues with extramarital affairs. Possibly even with prostitution / underage girls.\n That doesn't mean a man who praises King is automatically assuming the sins of the man as valid... :xbanghead\n \n \n \nThe drug thing is a reference in his own book which makes it a little ironic he is the drug free guy but again it was a young and stupid thing. I don't know if he ever spoke against it later or later in the book. \n \n Frankly this doesn't seem like a big deal. This position is pointless and not that big. If Jennings is doing his pointless job like he is supposed to than who cares...let it go. I wonder if there is an \"office of school playground and common grounds upkeep\" that I become director...ha.\n\n The main point of the thread is the fact that the right-wing is smearing him like this in the first place...\n \n \n \nCome on, I know you want to show Obama is not doing good for the country but you can easily show real examples instead of relying on some Jennings guy I just heard about a few days ago.\n\n Part of the problem is that people have to resort to this type of junk to attack Obama in the first place.\n The \"not doing good for the country\" junk is simply continuing similar tactics in a different arena ...\n \n \n \nNow, I'm ok with smearing Foundit66 who clearly likes this kind of political tactic\n\n Steeeeve, if you were more honest you would admit that you were smearing me before I even started that thread...\n But nah. I don't expect you to admit that... emoticon_xgood", 
   {}, 
   373323, 
   null, 
   1255036620.0
  ], 
  [
   373362, 
   null, 
   "foundit66", 
   "Steeeeve,\n There is clear photographic evidence putting Harry Hay at their gatherings...\n\n At WHOSE gatherings?\n NAMBLAs?\n \n \n \n... and Jennings is on record saying he found the guy inspiring.\n\n emoticon_frazzled\n Talk about a fast and loose accusation.\n WHAT DID HE ACTUALLY SAY???\n \n Cause Harry Hay is well known for his gay rights work.\n If Jennings did find something about the guy inspiring, it was probably his gay rights work.\n \n If I said that I thought Martin Luther King Jr was inspiring, would you automatically associate my praise with extramarital affairs?\n \n This is just stupid!\n \n \n \nPointing that out is no smear campaign; it's the facts.\n\n \"facts\" are like this...\n On January 14th, 1985, John Henry said \"I think Martin Luther King Jr is a pretty amazing guy\".\n \n THAT is a fact.\n What you did would take a statement like that and try to associate John Henry's praise with extramarital affairs... emoticon_emb\n \n \n \nHe's an expert on the history of the gay rights movement, so it's not like he wouldn't have known the connection.\n\n So?\n Harry Hay had a connection to NAMBLA.\n Doesn't mean that Jennings approves of NAMBLA when he admires Harry Hay. emoticon_xdonno\n \n The more rational recognition would be for praising Harry Hay's gay rights work.\n \n I think Harry Hay did some courageous work for gay rights too.\n Are you going to blindly assume something bad about me and NAMBLA now as well?\n \n \n \nI really don't want to get into it much because I don't think it's really fair to carry on about Nambla on a gay rights forum, as the two are really separate issues--this thread really belongs in the politics forum anyway. (PM me if you want the links.)\n\n Wow.\n Not even the courage to post them on the board for all to see...\n \n Not surprised... emoticon_frazzled\n \n \n \nI simply found it interesting that the article completely skirted one of the biggest issues about Jennings (probably because they have no rebuttal)\n\n ROFLMAO!\n YOU REFUSE TO PROVIDE SUBSTANTIVE EVIDENCE for your claim, yet you pretend there is no rebuttal... emoticon_ic", 
   {}, 
   373329, 
   null, 
   1255036980.0
  ], 
  [
   373368, 
   null, 
   "jyoshu", 
   "Wow.\n Not even the courage to post them on the board for all to see...\n\n \n Nah. Just don't have any interest for a Nambla discussion on a gay rights forum. Though I'm not surprised you would pipe up with a 'courage' comment. 'Course, if you really cared, you'd have no problem finding the proof on your own using Google. I certainly didn't.\n I really don't give a hoot what YOU think is courageous or not.", 
   {}, 
   373362, 
   null, 
   1255038420.0
  ], 
  [
   373369, 
   null, 
   "foundit66", 
   "If you think for a second that YOUR view--you specifically--of what's 'courageous' and what's not carries any weight with me, you're sadly mistaken.\n\n If you think I'm alone in my recognition of such things, then you are sadly mistaken...\n \n \n \nIf you want the links to the comments and pictures, you can PM me for them and I'll give it to you that way. That's up to you.\n\n Why won't you post them openly?\n \n Quite frankly, the accusations have already been made public.\n You're only holding back on the proof, which is funny.\n \n Suppose I came on here proclaiming I had information about your background and who you were.\n But I refused to post it on this forum. Instead asking people to PM me personally to get it.\n Do you think that would in any way be REALLY any better than simply posting it in the first place???\n \n Jyoshu, you have ALREADY CROSSED that line.\n Don't pretend you didn't...\n \n \n \nOtherwise, I have no -interest in a thread turning into a Nambla discussion on a gay rights forum, and neither should you.\n\n The accusation as I have seen it isn't even about that.\n It's not about a \"NAMBLA discussion\".\n \n And it is incredibly shallow of you to actually POST the claims, and then just hold back on the proof.\n Yeah. Like THAT is going to be effective in quelling the accusation... emoticon_frazzled\n \n ==========================================\n \n Anyways, you made a comment about how you hadn't seen the refutation of the Harry Hay situation?\n \n Well, here you go...\n \n \nThe Fox Nation and The Washington Examiner linked Department of Education official Kevin Jennings to the North American Man-Boy Love Association (NAMBLA) based on a 1997 speech in which Jennings praised gay rights activist Harry Hay, who had spoken in support of the organization. But like many obituaries written about Hay upon his death in 2002, Jennings was touting Hay as a gay civil rights pioneer for his role in helping start \"the first ongoing gay rights groups in America\" in 1948, and Jennings' comments had nothing to do with NAMBLA.\n\n The smear campaign continues: Fox Nation, Washington Examiner manufacture Jennings-NAMBLA link | Media Matters for America\n \n ====================================================================\n \n \nThough I'm not surprised you would pipe up with a 'courage' comment. 'Course, if you really cared, you'd have no problem finding the information on your own using Google. I certainly didn't.\n\n Jyoshu...\n I HAVE FOUND THIS JUNK ONLINE.\n I have ALREADY ADDRESSED it.\n \n STEEEEVE made comments on what HE had seen online.\n HE actually refuted it as well.\n \n At this stage, people HAVE refuted it, and you're just holding back pretending you've got something that has probably already been COMPLETELY addressed.", 
   {}, 
   373368, 
   null, 
   1255038720.0
  ], 
  [
   373410, 
   null, 
   "Steeeeve", 
   "The \"Assistant Deputy Secretary at the Department of Education for the Office of Safe and Drug Free Schools\" position?\n \n Wasn't it Reagan who started in with the drug free politics? emoticon_rolleyes\n \n Once again, good for the Republican.\n But when the Democrat does likewise, Repubs challenge it like it's scandalous... emoticon_rolleyes\nThis was created in 2002 according to wikipedia...and it is still a worthless position. \n \n \nCan you quote any source that states Jennings THOUGHT the boy was 15?\nYes I can: Kevin Jennings appointed to Department of Education post &#8212; Warren Throckmorton\n \n \nThe main point of the thread is the fact that the right-wing is smearing him like this in the first place...\nWell it matters if the smearing is legitimate. In this case it hasn't been shown to be legitimate which I just pointed out (this isn't too say that new evidence could come to light). \n \n \nPart of the problem is that people have to resort to this type of junk to attack Obama in the first place.\nThey really don't and they didn't need to for Bush either but it still happened. \n \n \nThe \"not doing good for the country\" junk is simply continuing similar tactics in a different arena ...\nYet you do it. \n \n \nSteeeeve, if you were more honest you would admit that you were smearing me before I even started that thread...\nDamn right I did..and deservingly so. You smear based upon the same non credible facts all the time and yet you expect me to sit back and let you get all self-righteous on this thread? No way!", 
   {}, 
   373360, 
   null, 
   1255045500.0
  ], 
  [
   373562, 
   null, 
   "simone", 
   "LOL\n Funny how the article completely skirts the Harry Hay issue ...\n\n How true! Harry Hay is a character you can get your panties in a twist about and must not be forgotten.", 
   {}, 
   373217, 
   null, 
   1255114200.0
  ], 
  [
   373606, 
   null, 
   "foundit66", 
   "This was created in 2002 according to wikipedia...and it is still a worthless position.\n\n And were you and your Repub cronies making such complaints then?\n Oh wait. That was with Bush.\n \n I can guess the reality of THAT situation... emoticon_ic\n \n \n \nYes I can: Kevin Jennings appointed to Department of Education post - Warren Throckmorton\n\n Then he should have reported it, or figured out the young man's true age.\n \n \n \nWell it matters if the smearing is legitimate. In this case it hasn't been shown to be legitimate which I just pointed out (this isn't too say that new evidence could come to light). \n\n Actually, the definition of \"smear\" includes an automatic recognition of a fallacious charge...\n \n smear:\n : a usually unsubstantiated charge or accusation against a person or organization -often used attributively <a smear campaign< <a smear job<\n \n If it is able to be substantiated, it's not really a smear.\n And as you can see from my opening post (if you're bothering to read the posts which I doubt you are if you haven't learned from that other thread), I started out by pointing out how the charges were unsubstantiated and just plain false.\n \n \n \nThey really don't and they didn't need to for Bush either but it still happened.\n\n You're talking apples and oranges.\n With Bush, they complained about Harriet Meiers not being qualified. That was true.\n They complained about Brownie NOT doing a \"heck of a job\". Which was true.\n \n It's apples and oranges. People are essentially making stuff up, or insinuating absurd claims regarding the situation.\n If they COULD nail this guy on taxes, I'm sure they would do it.\n But evidently they can't. And they are too rabid to let it go when they have nothing to go on.\n \n \n \nYet you do it. \n\n < yawn <\n I am not the topic of conversation.\n \n It would appear obvious that when you can't attack Obama, you go after somebody who doesn't attack Obama rabidly like you...\n \n \n \nDamn right I did..and deservingly so. You smear based upon the same non credible facts all the time and yet you expect me to sit back and let you get all self-righteous on this thread? No way!\n\n I presented the statements that people were making.\n Whether you want to accept it or not, people were making statements about Palin. THAT was a FACT.\n \n Whether you BELIEVE those statements about what those people had seen is another issue.\n The fact that we DISAGREED about the validity of those statements was another matter.\n \n This thread is NOT about statements about what people have seen. It's about attempts to make FALSE claims about Jennings.\n \n So whether you want to accept it or not, making FALSE statements about Jennings (which I have proven) is NOT the same thing as you not believing other people's statements about what they claim they had seen.", 
   {
    "unicode_changes_made": true
   }, 
   373410, 
   null, 
   1255123140.0
  ], 
  [
   373761, 
   null, 
   "Steeeeve", 
   "And were you and your Repub cronies making such complaints then?\nYes, as a matter of fact I was. I don't know any republican cronies. \n \n \n \n \n \nActually, the definition of \"smear\" includes an automatic recognition of a fallacious charge...\n \n smear:\n : a usually unsubstantiated charge or accusation against a person or organization -often used attributively <a smear campaign< <a smear job<\n \n If it is able to be substantiated, it's not really a smear.\n And as you can see from my opening post (if you're bothering to read the posts which I doubt you are if you haven't learned from that other thread), I started out by pointing out how the charges were unsubstantiated and just plain false.\nWait....follow this with me for a second:\n \n You said the below in your second post:\n Furthermore, THERE IS NO REASON for Jennings to have reported such a thing in the first place.\n\n \n And in this past post of yours you said this:\n Then he should have reported it, or figured out the young man's true age.\n\n So basically the \"smear\" was accurate or not in your opinion? \n \n In any event, this is not what I was referencing. You claim the right-wing people are smearing Jennings (in the negative sense). I stated it matters to find out if the allegations are true and worthy to launch a \"smear\" (non-negative sense) campaign. In this case I don't find it to be worthy evidence considering the facts and what job position he has. \n \n \nYou're talking apples and oranges.\n With Bush, they complained about Harriet Meiers not being qualified. That was true.\n They complained about Brownie NOT doing a \"heck of a job\". Which was true.\n \nYeah, they never tried to smear Bush or his appointments...give me a break emoticon_rolleyes But some are legitimate and some are not. With Harriet, both sides were complaining...probably the repubs more. The major difference is the democrats have no backbone so they buckle under the pressure. The republicans will defend a hack to the death.\n \n \nIt would appear obvious that when you can't attack Obama, you go after somebody who doesn't attack Obama rabidly like you...\n \nIf i recall correctly I actually am agreeing with you that Jennings shouldn't be smeared like this.... I'm just calling you out at the same time. I can do both :)\n \n \nI presented the statements that people were making.\n Whether you want to accept it or not, people were making statements about Palin. THAT was a FACT.\n \n Whether you BELIEVE those statements about what those people had seen is another issue.\n The fact that we DISAGREED about the validity of those statements was another matter.\n \n This thread is NOT about statements about what people have seen. It's about attempts to make FALSE claims about Jennings.\nThere is no difference. People are making statements about Jennings. That is a FACT too. What matters is whether or not the allegations against Palin and Jenning are true or legitimate concerns. In both cases they are not...at least from the evidence I've seen (I say this because the Jennings thing is somewhat new).", 
   {
    "unicode_changes_made": true
   }, 
   373606, 
   null, 
   1255190220.0
  ], 
  [
   373781, 
   null, 
   "foundit66", 
   "Yes, as a matter of fact I was. I don't know any republican cronies. \n\n Can you document that claim?\n \n \n \nSo basically the \"smear\" was accurate or not in your opinion? \n\n Criticizing Jennings for not reporting the sexual interaction between what he believed was a 15-year old and another man.\n The actual story in question doesn't specifically note that the 15-year old was talking about sex with somebody over 18, but I think that knowledge is established in other resources.\n \n \n \nIn any event, this is not what I was referencing. You claim the right-wing people are smearing Jennings (in the negative sense). I stated it matters to find out if the allegations are true and worthy to launch a \"smear\" (non-negative sense) campaign. In this case I don't find it to be worthy evidence considering the facts and what job position he has.\n\n I got that.\n \n I was pointing out that your complaint was actually redundant.\n \n \n \nYeah, they never tried to smear Bush or his appointments...give me a break emoticon_rolleyes\n\n And for any actual \"smears\" (unsubstantiated claims), that's a different story.\n My point was that there was PLENTY that Bush was attacked on with substantiation.\n \n Ironically, I am of the opinion that most attacks against Bush were actually valid, cause they didn't need to resort to smears for most issues.\n He screwed up enough things all on his own.\n \n With Obama, the smears are plentiful and wide-spread.\n Death Panel lies.\n Kenyan claims.\n Secret Muslim.\n Communist, Nazi, Socialist, etc, etc...\n \n Quite frankly, if the Republican party DOES have \"enough material\" to attack Obama without resorting to smears, then their actions obviously show they don't \"realize\" that.\n \n \n \nIf i recall correctly I actually am agreeing with you that Jennings shouldn't be smeared like this.... I'm just calling you out at the same time. I can do both :)\n\n And you're wrong as to your allegations.\n The previous example you gave with Palin HAD SUBSTANTIATION.\n You just didn't find it credible.\n \n There is a difference inbetween Republicans MAKING SOMETHING UP, like the claims that have been exposed here, and actually finding somebody's testimony credible when others do not.\n \n \n \nThere is no difference. People are making statements about Jennings. That is a FACT too.\n\n Do NOT start playing Glenn Beck on me.\n Wait. I forgot who I was talking to. Why wouldn't I expect you to go there... :xbanghead\n \n In the other thread, we had claims being made by people WHO WOULD HAVE WITNESSED what was being described.\n \n If you think \"people making statements\" is the pathetically pointless level you want to boil this down to, then there is no point in trying to make ANY distinctions.\n \n \n \nWhat matters is whether or not the allegations against Palin and Jenning are true or legitimate concerns. In both cases they are not...at least from the evidence I've seen (I say this because the Jennings thing is somewhat new).\n\n With Jennings case, there is an issue of things being taken out of context.\n FACTS being HIDDEN in order to pretend the situation is something it isn't.\n \n With Palin, it's an issue of you not finding somebody else's statements (who was actually there) credible, and you rail against me for believing them.\n Suppose I take the same approach when it comes to the bible? After all, there are millions of Christians out there who \"believe\" things that are obviously questionable.\n \n Suppose I started taking your attitude towards them just cause they believed something different than I do?\n Nah. You lack the empathy to understand that. emoticon_cool", 
   {}, 
   373761, 
   null, 
   1255211940.0
  ], 
  [
   373822, 
   null, 
   "Steeeeve", 
   "Can you document that claim?\nYes, let me go ahead and scan in notarized documents of everything I've done over the last decade. I'll have that posted by tomorrow night emoticon_frazzled\n \n \nAnd for any actual \"smears\" (unsubstantiated claims), that's a different story.\n My point was that there was PLENTY that Bush was attacked on with substantiation.\nAnd there are substantiated ones with Obama as well and I'm sure more will come in the future. \n \n \nIronically, I am of the opinion that most attacks against Bush were actually valid, cause they didn't need to resort to smears for most issues.\n He screwed up enough things all on his own.\nThat's because you are heavily skewed towards the left.\n \n \nWith Obama, the smears are plentiful and wide-spread.\n Death Panel lies.\n Kenyan claims.\n Secret Muslim.\n Communist, Nazi, Socialist, etc, etc...\nDo we need to bring up the Bush CBS story? Yeah, didn't think so. \n \n \nQuite frankly, if the Republican party DOES have \"enough material\" to attack Obama without resorting to smears, then their actions obviously show they don't \"realize\" that.\nI'm actually wrong in what I said. I should have said \"someone could legitimately attack Obama for what he has done so far\". Frankly the republicans can't because it would make them hypocrites. It's a little funny to hear people call Obama a big spender when Bush was a big spender as well...granted Obama has amplified it but that's like a murderer saying another murderer is killing too much. \n \n \nAnd you're wrong as to your allegations.\n The previous example you gave with Palin HAD SUBSTANTIATION.\n You just didn't find it credible.\nsubstantiation typically means evidence or proof some kind. Your allegations of Palin in that thread had neither....and certainly no more than this Jennings fella. \n \n \nThere is a difference inbetween Republicans MAKING SOMETHING UP, like the claims that have been exposed here, and actually finding somebody's testimony credible when others do not.\nThere is a difference between the republicans making up and posting an article about a guy who made something up? So much for substantiation. \n \n \nWith Jennings case, there is an issue of things being taken out of context.\n FACTS being HIDDEN in order to pretend the situation is something it isn't.\n \n With Palin, it's an issue of you not finding somebody else's statements (who was actually there) credible, and you rail against me for believing them.\nActually it is much of the same. With that Palin thread you tried to take thing out of context and make associations where none existed.\n \n I wish you could just admit you used a different standard for Palin. Had this been reversed you'd be all over me for being inconsistent.", 
   {}, 
   373781, 
   null, 
   1255245300.0
  ], 
  [
   373914, 
   null, 
   "foundit66", 
   "Yes, let me go ahead and scan in notarized documents of everything I've done over the last decade. I'll have that posted by tomorrow night emoticon_frazzled\n\n So you don't have any web-site that you posted such complaints on?\n Interesting...\n \n Brings me back to those missing CA Medicare numbers that you evidently made up...\n \n \n \nAnd there are substantiated ones with Obama as well and I'm sure more will come in the future.\n\n I think you are confusing the issues of EXISTENCE with the type of negligence that the Repub party wants to try to prove.\n Yes. He has a problem here and a problem there.\n But nothing like the laundry list of disasters that Bush had and the Repub party CONSISTENTLY turned their back on. emoticon_frazzled \n \n \n \nThat's because you are heavily skewed towards the left.\n\n You only think that cause you are heavily skewed towards the right.\n \n \n \nDo we need to bring up the Bush CBS story? Yeah, didn't think so. \n\n You can if you want.\n It looks obvious that the news was snookered by one man's fraud.\n However, Rather still holds that his story was newsworthy.\n He still wants his day in court to document how his news organization improperly squashed him.\n \n \n \nI'm actually wrong in what I said. I should have said \"someone could legitimately attack Obama for what he has done so far\". Frankly the republicans can't because it would make them hypocrites. It's a little funny to hear people call Obama a big spender when Bush was a big spender as well...granted Obama has amplified it but that's like a murderer saying another murderer is killing too much.\n\n At least somebody recognizes it.\n \n I pointed out in another thread that the 2008 election had polls covering party concerns.\n \"Deficit\" was on the list of moderates and liberals, but NOT on the list of the conservatives.\n But by the same token, I firmly expect that in 2012, \"Deficit\" will be absent from the liberal list.\n \n As for the here and now, you can't put out a forest fire without water. So complaints about water conservation at this stage are illogical.\n \n \n \nsubstantiation typically means evidence or proof some kind. Your allegations of Palin in that thread had neither....and certainly no more than this Jennings fella. \n\n emoticon_rolleyes\n You are wrong.\n If you want to go back to that thread, I am willing and able.\n Otherwise, this thread is about Jennings and not Palin.\n \n So while the parallel can be pointed out, there is no point in a non-topical in-depth discussion on Palin's situation.\n \n \n \nThere is a difference between the republicans making up and posting an article about a guy who made something up? So much for substantiation. \n\n Here, I CAN PROVE they made up junk regarding Jennings.\n For Palin, you doubt the testimony of others, but that's it.\n \n \n \nActually it is much of the same. With that Palin thread you tried to take thing out of context and make associations where none existed.\n\n \"Association\" with what?\n The Alaskan secessionist group?\n \n Again, I'll be happy to bring it up there cause I DOCUMENTED that association.\n If it had been Obama, the Repubs would have taken that documentation to the bank and tried to cash it as a check!\n \n \n \nI wish you could just admit you used a different standard for Palin. Had this been reversed you'd be all over me for being inconsistent.\n\n I just wish you could stop with this ad hominem junk. emoticon_rolleyes\n \n You've given your topical response, and now you want to make the topic an attack on ME...\n \n Or maybe I could make a smaller wish and wish for consistency?\n Like how Jyoshu attempted to further these claims against Jennings, but I'm betting you'll continue to give him a free pass in the future, won't you... emoticon_rolleyes", 
   {}, 
   373822, 
   null, 
   1255294860.0
  ], 
  [
   373953, 
   null, 
   "Steeeeve", 
   "So you don't have any web-site that you posted such complaints on?\n Interesting...\nI told you I'm scanning in the documents...geesh, why are you so impatient? Tell me, on what web-site would I find your pre 1995 objection to state marriage laws?\n \n \nI think you are confusing the issues of EXISTENCE with the type of negligence that the Repub party wants to try to prove.\n Yes. He has a problem here and a problem there.\n But nothing like the laundry list of disasters that Bush had and the Repub party CONSISTENTLY turned their back on.\nIn all fairness, we had 8 years of Bush data. We only have 9 months of Obama. I'd say Obama is keeping pace...but you are missing my main point in that this stuff is silly to get hung up on. Obama is a self-destructing on this own with his policy choices. and Bush did the same thing. Instead of attacking on this the democrats would latch on to some pointless issue just like the republicans are doing now. And this is what they have to do because they are all the same. The democrats couldn't really say \"this war thin was a bad idea and republicans did it\" without being laughed at because THEY VOTED FOR IT like fools. As a disclosure, I'm a fool too for buying into it back then. \n \n \nYou can if you want.\n It looks obvious that the news was snookered by one man's fraud.\n However, Rather still holds that his story was newsworthy.\n He still wants his day in court to document how his news organization improperly squashed him.\nAnd Sean Hannity thinks this Jennings thing is news worthy. \n \n \nI pointed out in another thread that the 2008 election had polls covering party concerns.\n \"Deficit\" was on the list of moderates and liberals, but NOT on the list of the conservatives.\n But by the same token, I firmly expect that in 2012, \"Deficit\" will be absent from the liberal list.\nAnd this is why I am often dumbfounded when people will defend the liberals to the death or republicans do the death. Both do the EXACT SAME THING yet it seems I'm the only one here pointing out this obvious fact. This is standard in our political environment. We had an argument some time back about this. I was trying to make the argument that this standard won't change and it is useless to try and make it change. The way to mitigate this annoying reality is to have less government (at least federal). Of course I violate my own standard here because trying to get less government is just as useless :) but I think it has a better chance than changing human nature.\n \n \nHere, I CAN PROVE they made up junk regarding Jennings.\nDidn't we show it wasn't made up? Jennings thought the boy was 15 and he said he looked up to that Hay guy. The conclusions may be illogical or pointless but the facts they have are not out of thin air. In fact the article you linked to doesn't show any facts made up but that the conclusions are suspect in some cases. This is almost an exact parallel to the Palin thing!\n \n \n \n \n\"Association\" with what?\n The Alaskan secessionist group?\n \n Again, I'll be happy to bring it up there cause I DOCUMENTED that association.\nRight, and you can DOCUMENT the association with Harry Hay..you just can't make reasonable conclusions from it i.e. Jennings supports NAMBLA and Palin support secession. \n \n \nYou've given your topical response, and now you want to make the topic an attack on ME...\nfine, you're right...we'll stick with the subject.", 
   {}, 
   373914, 
   null, 
   1255307940.0
  ], 
  [
   373955, 
   null, 
   "Steeeeve", 
   "Like how Jyoshu attempted to further these claims against Jennings, but I'm betting you'll continue to give him a free pass in the future, won't you... \nI gotta be honest with you, I haven't read any of his posts since the one I responded to. Didn't I disagree with him there?", 
   {}, 
   373953, 
   null, 
   1255308060.0
  ], 
  [
   373985, 
   null, 
   "foundit66", 
   "I gotta be honest with you, I haven't read any of his posts since the one I responded to. Didn't I disagree with him there?\n\n Man. You refuse to recognize your own behavior.\n You \"disagreed\" with him.\n But what you are doing with me is MORE than just \"disagreeing\".\n \n You are dragging back past history, trying to make this about how I (supposedly) have been \"smearing\" people (unsubstantiated) in the past.\n JYOSHU smears people in the past, and you care not.\n \n But me you chase around insisting that people shouldn't take me seriously ...\n If you were to treat Jyoshu the same way, THAT would be consistent.\n But we both know there is no way you're going to start being consistent there... emoticon_rolleyes", 
   {}, 
   373955, 
   null, 
   1255318200.0
  ], 
  [
   373987, 
   null, 
   "foundit66", 
   "I told you I'm scanning in the documents...geesh, why are you so impatient? Tell me, on what web-site would I find your pre 1995 objection to state marriage laws?\n\n What issue/personal opinion are you referencing there?\n emoticon_confused\n \n \n \nIn all fairness, we had 8 years of Bush data. We only have 9 months of Obama. I'd say Obama is keeping pace...but you are missing my main point in that this stuff is silly to get hung up on.\n\n You are missing my point that it IS silly stuff to get hung up on ...\n ... but that Repubs DO get hung up on it because they LACK significant traction on Obama in the first place.\n \n It's like John having a neighbor he doesn't like, but isn't really that bad of a neighbor.\n John starts complaining about the height of the grass on his neighbor's property cause all his friends have heard the old complaints, and he doesn't have any NEW VALID complaints to complain about... \n \n \n \nObama is a self-destructing on this own with his policy choices. and Bush did the same thing. Instead of attacking on this the democrats would latch on to some pointless issue just like the republicans are doing now.\n\n \"Instead of attacking on this\"???\n Fine.\n Give me an issue that you think Obama SHOULD be attacked on, but IS NOT being attacked on... emoticon_rolleyes\n \n \n \nAnd this is what they have to do because they are all the same. The democrats couldn't really say \"this war thin was a bad idea and republicans did it\" without being laughed at because THEY VOTED FOR IT like fools. As a disclosure, I'm a fool too for buying into it back then.\n\n emoticon_rolleyes\n Yeah. They can say that.\n On a personal level, I bought into the initial pre-war \"intelligence\" as well.\n But after looking at the situation in hind-sight, I see PLENTY of things that the Bush administration did wrong which was inexcusable.\n \n One of our main sources of intelligence was a man WHOSE OWN COUNTRY disavowed the legitimacy of his \"intel\".\n But Bush's admin took it because it was convenient.\n \n On some levels, I think Bush did well in helping get U.N. investigators into the country, although I don't think that had any high priority on his tasking.\n I remember seeing the reports on the U.N. investigators and recognizing that it conflicted with our own \"intel\".\n It was at that stage we should have stopped and rethought things, but instead Bush invaded anyways.\n \n \n \nAnd Sean Hannity thinks this Jennings thing is news worthy. \n\n Are you seriously comparing the news credentials of Dan Rather up against \"Sean Hannity\"???\n emoticon_rolleyes\n \n Another problem with that analogy is that the \"Jennings thing\" can be rebutted with ACTUAL EVIDENCE.\n There were gaping holes on Bush's service before Rather started poking.\n Rather's SMOKING GUN went away, but there is no disproof of the story either.\n And while I am not saying that a lack of disproof is evidence of validation, I am saying that Jenning's situation HAS disproof.\n \n \n \nAnd this is why I am often dumbfounded when people will defend the liberals to the death or republicans do the death. Both do the EXACT SAME THING yet it seems I'm the only one here pointing out this obvious fact. This is standard in our political environment. We had an argument some time back about this. I was trying to make the argument that this standard won't change and it is useless to try and make it change.\n\n My personal mindset refuses to accept it as something that is \"useless to try and make it change\".\n \n \n \nThe way to mitigate this annoying reality is to have less government (at least federal).\n\n emoticon_rolleyes\n Yeah. And you just used it to further your own goals...\n And the funny thing is that NOTHING in your solution actually affects the problem.\n We still have the bipartisan bickering at the state and local levels.\n But you use the circumstances to promote your own political agenda...\n \n \n \nOf course I violate my own standard here because trying to get less government is just as useless :) but I think it has a better chance than changing human nature.\n\n And what about the issues you want the government to intrude upon?\n Like gay marriage?\n Preventing gay marriage isn't an example of \"less government\".\n Allowing states to make laws that violate what the courts interpret regarding the 14th amendment is not \"less\" government.\n \n \n \nDidn't we show it wasn't made up? Jennings thought the boy was 15 and he said he looked up to that Hay guy.\n\n MOST of it was made up.\n The \"boy was 15\" thing was valid.\n The rest is junk.\n \n And are you SERIOUSLY going to backpedal on me with that \"he looked up to that Hay guy\" junk?\n We BOTH know that isn't the full story on the conservative smear on that issue.\n \n \n \nThe conclusions may be illogical or pointless but the facts they have are not out of thin air.\n\n Fine.\n I also have \"facts\" on Palin then.\n You have to agree with that.\n I have \"facts\" on how she repeatedly gave addresses to the secessionist group. I have \"facts\" on how they themselves deemed her when they didn't have news media listening.\n \n You may disagree with the conclusions, but \"the facts are not out of thin air\"... :xbanghead\n \n \n \nIn fact the article you linked to doesn't show any facts made up but that the conclusions are suspect in some cases. This is almost an exact parallel to the Palin thing!\n\n Fine. Let's review the \"facts\" that the article was talking about...\n 1) \"\"Jennings' and GLSEN's concept of 'safe schools' means special protections for privileged groups (especially homosexuals), rather than safety for all.\"\"\n Do you support this as a fact?\n \n 2) \"\"Jennings is viciously hostile to religion.\"\"\n Do you support this as a fact?\n \n 3) \"Jennings is \"unfit for the post to which he's been assigned.\"\" \n Do you support this as a fact?\n \n If you do, then let's actually discuss what you want to defend.\n Openly state what you want to defend, and let's discuss it.\n \n \n \nRight, and you can DOCUMENT the association with Harry Hay..you just can't make reasonable conclusions from it i.e. Jennings supports NAMBLA and Palin support secession. \n\n QUOTE ME.\n Quote me where I supposedly said \"Palin supports secession\" or anything of significant relation to such a statement.\n \n The thing you refuse to grasp in your desire to try to make this personal against me is that the Alaskan Secession Group WAS FORMED FOR THE PURPOSE OF SECESSION.\n \n Harry Hay is a man who did MANY things over his life.\n \n Like the example I kept raising but people refused to touch. It would be like praising Martin Luther King Jr, and then pretending that such praise was somehow validating extra-marital affairs...\n \n But the Secession Group IS NOT complex like that.\n \n And before you start down a path of trying to misrepresent the group, YOUR SAME TACTICS of obfuscation could be applied to NAMBLA.\n YOUR SAME TACTICS could be used to point at the NAMBLA web-site and pretend they don't have anything to do with child rape. :xbanghead\n \n \n \nfine, you're right...we'll stick with the subject.\n\n Okay.\n Is there any part of the \"smears\" against Jennings you want to defend, beyond the already discussed \"15-year old\" issue?", 
   {
    "unicode_changes_made": true
   }, 
   373953, 
   null, 
   1255319580.0
  ], 
  [
   373996, 
   null, 
   "jyoshu", 
   "Like how Jyoshu attempted to further these claims against Jennings, but I'm betting you'll continue to give him a free pass in the future, won't you... emoticon_rolleyes\n\n \n Sweetie, I wasn't \"furthering\" anything against Jennings--the proof is already easily accessible to anyone who knows how to use a search engine, and I said you could PM me for the link(s) anyways, which you haven't done. By creating these sort of threads you do more to 'further' things like this than anyone has done. So you are more than welcome to prove your claim that I was attempting to do that. I'm betting you won't, though. :)", 
   {}, 
   373914, 
   null, 
   1255323660.0
  ], 
  [
   374000, 
   null, 
   "foundit66", 
   "Sweetie, I wasn't \"furthering\" anything against Jennings--the proof is already easily accessible to anyone who knows how to use a search engine, and I said you could PM me for the link(s) anyways, which you haven't done.\n\n Actually, you extended that offer to Steeeeve.\n You posted a similar offer to me, but then you changed your post to REMOVE that offer.\n \n And I've already seen what a variety of web-sites have to say on the issue.\n It's absolute crud.\n I've already refuted what is out there.\n STEEEEEVE has already refuted what is out there...\n \n If you have anything else, you can post it on this forum.\n \n \n \nBy creating these sort of threads you do more to 'further' things like this than anyone has done.\n\n This is a stupid claim.\n I am refuting EXISTING lies and smears.\n \n I think that there is one clear difference between the 2004 and 2008 election which is unmistakable.\n Kerry IGNORED the smears against him, and it cost him.\n Obama ADDRESSED the smears against him, and it cost his opponents.\n If you think exposing the lies of the anti-gay religious right somehow hurts gays, then you are seriously deluded.\n \n \n \nSo you are more than welcome to prove your claim that I was attempting to do that. I'm betting you won't, though. :)\n\n emoticon_xdonno\n You are funny.\n The fact that you supported the \"Jennings\" smear is easily documentable...\n \n jyoshu: \"Let's just say I don't think you REALLY want to be in the position of defending this nut considering who he considers his 'inspiration.'\"\n \n jyoshu: \"There is clear photographic evidence putting Harry Hay at their gatherings, and Jennings is on record saying he found the guy inspiring. Pointing that out is no smear campaign; it's the facts.\"\n \n And incidentally, you lost your bet...\n You should know better than to challenge me for substance.\n And I know better than to rely on you for substance...", 
   {}, 
   373996, 
   null, 
   1255325760.0
  ], 
  [
   374011, 
   null, 
   "Steeeeve", 
   "... but that Repubs DO get hung up on it because they LACK significant traction on Obama in the first place.\nAnd an honest person would say democrats do this as well...step for step.\n \n \n\"Instead of attacking on this\"???\n Fine.\n Give me an issue that you think Obama SHOULD be attacked on, but IS NOT being attacked on... \nWe've heard all the attacks but hear the republicans in congress complain about fiscal responsibility is a little silly. In any event, I'd like to see people actually complain about his fiscal policies and offer a real solution. I'd like to see people call him on the fact that the stimulus was a failure by his own standards. I'd like to people to point out that his health care plan is an awful idea and not a priority right now (apparently I'm in the minority on that last part). I'd like people to call him out on the fact that Iraq and Afghanistan still have no end in sight. In fact, Afghanistan looks to be getting bigger. I'd like people to attack him more on going around giving way too many speeches and constantly acting like a people pleaser. What kind of president brings a cop and a black professor to the white house for a beer? I could go on if you want. \n \n \nAre you seriously comparing the news credentials of Dan Rather up against \"Sean Hannity\"???\nYou are right, Hannity probably has more credibility..and Hannity has absolutely none...other than his uncanny ability to point out \"great Americans\". :p \n \n \nAnother problem with that analogy is that the \"Jennings thing\" can be rebutted with ACTUAL EVIDENCE.\n There were gaping holes on Bush's service before Rather started poking.\n Rather's SMOKING GUN went away, but there is no disproof of the story either.\n And while I am not saying that a lack of disproof is evidence of validation, I am saying that Jenning's situation HAS disproof.\nCome on, you and I both know this is splitting hairs. In reality, neither story is legitimate. More importantly neither story really mattered(s).\n \n Yeah. And you just used it to further your own goals...\n And the funny thing is that NOTHING in your solution actually affects the problem.\n We still have the bipartisan bickering at the state and local levels.\n But you use the circumstances to promote your own political agenda...\n \n \nAnd what about the issues you want the government to intrude upon?\n Like gay marriage?\n Preventing gay marriage isn't an example of \"less government\".\nThe federal government shouldn't have laws regarding marriage other than for reasons related to a functional federal government such as taxes. Even if that case it should be limited to definitional. Off subject don't you think?\n \n \nAnd are you SERIOUSLY going to backpedal on me with that \"he looked up to that Hay guy\" junk?\n We BOTH know that isn't the full story on the conservative smear on that issue.\nWell the 15 year old boy thing wasn't the whole story either. I'm just saying that those are facts...he did say it even if that isn't the whole story which you are correct to point out.\n \n \nFine.\n I also have \"facts\" on Palin then.\n You have to agree with that.\n I have \"facts\" on how she repeatedly gave addresses to the secessionist group. I have \"facts\" on how they themselves deemed her when they didn't have news media listening.\n \n You may disagree with the conclusions, but \"the facts are not out of thin air\"... \nTrue...but like above, are not the whole story. Both parities cherry pick facts to try and create an illusion. Let me give an example you might appreciate. \n \n FACT: thousands of people have died from having an abortion\n FACT: an abortion procedure can include dismembering the fetus \n FACT: hundreds of babies are born alive after being \"aborted\"\n FACT: Roe in Roe vs Wade feels abortion is wrong\n \n Now, does that give you a clear picture of the abortion debate? All of those are true. Of course it is thousands over decades and include illegal abortions. Dismembering only happens in a very small number of cases..same with babies born after being aborted. Roe really is against abortion but that is just trying to emphasis the previous points. This is the exact thing I feel happens with Jennings, Palin, LA Times health insurance article, etc etc. Why do you think I never try and post news article anymore as proof (I try to limit as much as possible that is)? It is because they are misleading and often times wrong. \n \n \nFine. Let's review the \"facts\" that the article was talking about...\nThis is exactly what i am talking about. All three of those are conclusions based upon actual facts and then this article came along and attacked the conclusions drawn. All three of those are opinions on someone else. So this isn't really a \"fact check\" like factcheck.org does. very misleading. \n \n by the way, for all three I could care less accept whether or not he is \"unfit\". Frankly anyone is fit for that job because it is a worthless position. It probably pays over $100k...maybe we should get in on that.\n \n \n\n And before you start down a path of trying to misrepresent the group, YOUR SAME TACTICS of obfuscation could be applied to NAMBLA.\n YOUR SAME TACTICS could be used to point at the NAMBLA web-site and pretend they don't have anything to do with child rape.\naccept that NAMBLA's website clearly states their agenda as being same as it was when it started. The AIP's website clearly states they are no long about that and have adopted a different platform to be more inclusive of differing views on the subject along with many others. I see no reason to doubt this.\n \n \nOkay.\n Is there any part of the \"smears\" against Jennings you want to defend, beyond the already discussed \"15-year old\" issue?\nI'm only arguing that this goes both ways including on these forums! I think neither is right.", 
   {}, 
   373987, 
   null, 
   1255331580.0
  ], 
  [
   374024, 
   null, 
   "foundit66", 
   "And an honest person would say democrats do this as well...step for step.\n\n I whole-heartedly agree...\n But considering the statement I was making had more ramifications than that...\n \n \n \nWe've heard all the attacks but hear the republicans in congress complain about fiscal responsibility is a little silly. In any event, I'd like to see people actually complain about his fiscal policies and offer a real solution.\n\n That's another glaring problem. One of the ways the Republican politicians amaze me at their duplicity.\n \n They insist that they want a more fiscally responsible government.\n BUT LOOK at what menial \"budget proposal\" they actually offered...\n It was HUGE TAX CUTS which would have obviously raised the deficit.\n \n \n \nI'd like to see people call him on the fact that the stimulus was a failure by his own standards.\n\n Meh.\n First of all, I think his expectations were absurdly high.\n Secondly, a significant percentage of that stimulus money has not even been spent.\n Not only has some of the big package been slotted for later spending, but a LOT of the \"now\" spending hasn't even been spent.\n \n \n \nI'd like to people to point out that his health care plan is an awful idea and not a priority right now (apparently I'm in the minority on that last part).\n\n I see it as a priority cause if the political landscape shifts it just ain't gonna happen.\n Republicans are going to find excuses to kill it later and Obama may very well be without a lot of his political ammo later...\n \n Furthermore, do you recognize that the ENACTMENT of the plan isn't slated until much farther down the road?\n Essentially, the \"now\" part is to get the legislation signed.\n But most of the actual dollar expenditures is going to occur much later...\n \n \n \nI'd like people to call him out on the fact that Iraq and Afghanistan still have no end in sight.\n\n And that's his fault????\n Come ON!\n This is EXACTLY what I was talking about earlier with regards to pathetic griping with little traction.\n \n GW Bush himself said that the war on terror may have no end.\n And now you whine because Obama hasn't given you a visible end within 9 months???\n emoticon_xdonno\n \n \n \nI'd like people to attack him more on going around giving way too many speeches and constantly acting like a people pleaser.\n\n emoticon_frazzled\n I realize that doing what the people want is a miraculous idea to the Republicans. Especially considering so many have yet to figure out that refusing to do what the people wanted is one of the HUGE reasons they got unceremoniously kicked out of power in the first place ...\n \n But comments like these are pathetic fluff.\n They play well to the partisan rhetoric, but not well beyond that...\n \n \n \nWhat kind of president brings a cop and a black professor to the white house for a beer? I could go on if you want.\n\n I honestly don't care if you go on.\n As for the \"beer summit\", it was about race relations and closing wounds as much as anything.\n I also recognize Republicans don't give a care about that either, unless it can be used to rile up white voters, but that's another fault of the RNC that they think is a plus...\n \n \n \nYou are right, Hannity probably has more credibility..and Hannity has absolutely none...other than his uncanny ability to point out \"great Americans\". :p \n\n Dan Rather\n He has received numerous Emmy Awards, several Peabody Awards, and various honorary degrees from universities.\n Award Year Program Title\n Peabody 1975 CBS News\n Peabody 1976 60 Minutes\n Peabody 1994 CBS Reports: D-Day\n Peabody 1995 CBS Reports: In the Killing Fields of America\n Peabody 2000 48 Hours: Heroes Under Fire\n Peabody 2001 60 Minutes II: Memories of a Massacre\n Peabody 2004 60 Minutes II: Abuse at Abu Ghraib\n Dan Rather - Wikipedia, the free encyclopedia\n \n Sean Hannity\n * Hannity received a Marconi Award in 2003 and 2007 as the Network Syndicated Personality of the Year from the National Association of Broadcasters.[27]\n * In 2009, Talkers Magazine listed Hannity as #2 on their list of the 100 most important radio talk show hosts in America.[28]\n * Talkers Magazine gave Hannity their Freedom of Speech Award in 2003.[29]\n * In 2005, Jerry Falwell, chancellor of Liberty University, awarded Hannity an honorary degree.[30]\n * Radio and Records magazine has honored Hannity with the National Talk Show Host of the Year Award for three consecutive years.[31]\n Sean Hannity - Wikipedia, the free encyclopedia\n \n Yeah.\n You can continue this b.s. if you like, but it only diminishes your credibility.\n \n \n \nCome on, you and I both know this is splitting hairs.\n\n Right-wingers taking something out of context, with proof thereof is significantly different from you not believing testimony of other people.\n That's not \"splitting hairs\".\n \n \n \nThe federal government shouldn't have laws regarding marriage other than for reasons related to a functional federal government such as taxes. Even if that case it should be limited to definitional. Off subject don't you think?\n\n No. Entirely on subject of recognizing the reality behind people's claimed positions.\n \n By your argument, DOMA should not exist.\n You should instead start attacking the over 1,000 rights and benefits associated with marriage.\n \n But that's not what your position is, is it...\n \n \n \nTrue...but like above, are not the whole story. Both parities cherry pick facts to try and create an illusion.\n\n Some times, that is true.\n \n \n \nWhy do you think I never try and post news article anymore as proof (I try to limit as much as possible that is)? It is because they are misleading and often times wrong. \n\n I see the alternative (posting no news article whatsoever) as worse.\n How many threads here would just not exist if that standard were practiced by everybody?\n \n \n \nThis is exactly what i am talking about. All three of those are conclusions based upon actual facts and then this article came along and attacked the conclusions drawn. All three of those are opinions on someone else. So this isn't really a \"fact check\" like factcheck.org does. very misleading. \n\n No.\n The are not based upon actual facts, but rather assumptions and taking things out of context.\n Take the whole \"Jennings / Harry Hay =< Pedophile\" assessment.\n The only facts presented are \"Jennings praised Hay\" and \"Hay supported NAMBLA\".\n Is there ANY logical conclusion that can be made to \"Jennings praised NAMBLA\"?\n No. But that is PRECISELY what is being attempted.\n \n It's a simple logical fallacy that they are perpetuating, and you pretend it is \"based upon fact\".\n A) Jack praises MLK Jr.\n B) MLK Jr had extra-marital affairs.\n \n C) Jack is praising MLK Jr's extra-marital affairs.\n C is not based upon facts A & B. C is a logical fallacy that anybody should be able to see through.\n \n \n \naccept that NAMBLA's website clearly states their agenda as being same as it was when it started. The AIP's website clearly states they are no long about that and have adopted a different platform to be more inclusive of differing views on the subject along with many others. I see no reason to doubt this.\n\n Rrrriiiggghhhtttt...\n \n NAMBLA \"clearly states\" something, so you believe them.\n Either you are woefully ignorant of NAMBLA, or you are just trying to be difficult. Follow-on post regarding NAMBLA shenanigans...\n \n Quite frankly \"their agenda\" may \"be the same\", but they aren't completely honest about what their agenda is on their web-site...\n Same for the AIP.\n \n As for AIP, I find your position absurd.\n If somebody were trying to get a vote to do away with child molestation laws, the obvious goal would be regarding legal child molestation.\n AIP talks about about achieving a vote for Alaskan Independence, and you doubt whether or not their goal is for secession??? emoticon_xdonno\n \n Surely you can't be that naive...", 
   {}, 
   374011, 
   null, 
   1255342560.0
  ], 
  [
   374026, 
   null, 
   "foundit66", 
   "Regarding NAMBLA, here's some stuff they DO NOT put on their web-site...\n Man-boy love association member stung by FBI \n By Matt O'Connor\n Chicago Tribune\n Published August 21, 2006 \n \n A flight attendant from Chicago, caught in an undercover FBI probe that infiltrated a national pedophile organization, was recently sentenced to prison for traveling to California to engage in sex with a minor.\n \n David C. Mayer, 51, was about to board a boat to Mexico when he was arrested last year. He and six others snared in the FBI investigation thought they were traveling to a bed-and-breakfast that provided boys for their sexual pleasure, authorities charged.\n \n A federal judge in San Diego sentenced Mayer to 37 months in prison on Aug. 11.\n \n Mayer had pleaded guilty to the sex offense on the condition he be allowed to appeal the judge's refusal to dismiss the charge on 1st Amendment grounds.\n \n The defense alleged the government had over-reached after an undercover FBI agent infiltrated the North American Man/Boy Love Association, or NAMBLA, secretly tape-recording discussions at annual conventions in 2003 and 2004.\n \n Within half an hour of meeting the FBI agent at the 2004 convention, Mayer expressed frustration at the group's political agenda, authorities said. The organization, formed in 1978, is dedicated to eliminating age-of-consent laws.\n \n Mayer wanted advice on traveling abroad to have sex with young boys, according to court records.\n \n \"I don't know who's lying to who or if ... they're lying to themselves and saying, `This is all political. This is all to change society,'\" Mayer said of conference organizers in the tape-recorded conversation. \"[Expletive], it's like, bring on the boys.\" \n ....\n In a telephone interview last week, Robert Hamer, the undercover FBI agent, said he joined NAMBLA in 2001 for a $35 fee while investigating sex tourism in Thailand.\n \n Over the next two years, Hamer won the trust of the group's leaders, writing Christmas cards to incarcerated members and authoring stories for a NAMBLA publication on chemical castration and the unfairness of laws allowing charges against sex offenders decades after alleged crimes. \n ....\n In fall 2003, Hamer attended the invitation-only NAMBLA convention in New York City, secretly tape-recording his conversations but being careful not to ask too many questions for fear of drawing suspicion. \n ....\n A year later, at the Miami convention, Hamer said he became more aggressive in his conversations in an effort to draw out discussions of criminal activities.\n \n Two days after the convention, Mayer e-mailed Hamer about Web sites for hotels in Costa Rica and elsewhere that catered to homosexuals, according to court records. CampusActivism.org &bull; View topic - Witness who charged FBI agent with pedophilia found murdered\n \n As the article specifies, a total of seven NAMBLA members were busted in this sting.\n \n There are other NAMBLA articles as well. There is a lawsuit against NAMBLA for publications they put forth, with the plantiffs arguing that the publications not only encourage child molestation but provide information as to how to keep the crime secret and how to escape if the actions become known.\n \n What NAMBLA says on their web-site is hardly sufficient to the whole story...\n I find it amusing that you refuse to post news articles, but you evidently take NAMBLA's words at face value.", 
   {}, 
   374024, 
   null, 
   1255343040.0
  ], 
  [
   374051, 
   null, 
   "Steeeeve", 
   "BUT LOOK at what menial \"budget proposal\" they actually offered...It was HUGE TAX CUTS which would have obviously raised the deficit.\nNot if you cut the spending as well....HAHAHAHA...Oh I can't type that with a straight face :p\n \n \nFirst of all, I think his expectations were absurdly high.\n Secondly, a significant percentage of that stimulus money has not even been spent.\n Not only has some of the big package been slotted for later spending, but a LOT of the \"now\" spending hasn't even been spent.\nI can't tell you how many meetings I've had on the ARRA BS. You want to know the truth about how it \"saves jobs\"? Say ORG A had a budget of $2 million from the state of North Carolina. The economy goes south and ORG A gets a budget of $1.5 million but NC is going to be nice and give ORG A $.1 million ($100,000) to help offset some of the loss. Now ORG A has the ability to cut the budget however it wants. It would be that ORG A would have cut out all travel, no raises, reduction in supplies, etc and never cut someone. In reality ORG A probably would have cut someone but wouldn't cut $500,000 worth of someone. North Carolina, under fear of God from the federal government, says you MUST spend the entire $100,000 on salaries. So what happens? You just call money something else. If you were only going to cut $20,000 worth of salaries anyway than the reality is AT BEST saved $20,000 worth of a job for as long a that money is available. But thanks to rearranging of money Obama claims he saved $100,000 worth of a job. Hopefully you can follow that but basically the numbers are cooked! States are now worried about the so called \"cliff-effect\" related to this.\n \n So yeah, he set his standards too high, the money isn't spent, and the economy looks like it will just limp somewhat upward for the foreseeable future with our dollar being a joke. Too much? Perhaps I've had to work with ARRA too much ha.\n \n \nAnd that's his fault????\n Come ON!\n This is EXACTLY what I was talking about earlier with regards to pathetic griping with little traction.\n \n GW Bush himself said that the war on terror may have no end.\n And now you whine because Obama hasn't given you a visible end within 9 months???\nYes...when you basically run on the idea of getting out of there. He said \"I will bring this war to an end in 2009\" during the campaign...did he not? Then he qualified it which is how he will get away with it now by saying it might change when he gets in office and looks at the situation. That's my personal view...so yes it is HIS fault and he was misleading at best.\n \n \nBut comments like these are pathetic fluff.\n They play well to the partisan rhetoric, but not well beyond that...\nWhy do you keep referring this with republicans? This is what I think Obama should be criticized for. Him going around giving speeches all day is legitimate...it makes him look like he is still campaigning instead of doing something useful. \n \n \nRight-wingers taking something out of context, with proof thereof is significantly different from you not believing testimony of other people.\n That's not \"splitting hairs\".\nYes it is. Both would be believing in evidence that is wrong and misleading. \n \n \nBy your argument, DOMA should not exist.\nCorrect. DOMA is not constitutional as it isn't a power of the federal government.\n \n \nThe are not based upon actual facts, but rather assumptions and taking things out of context.\n Take the whole \"Jennings / Harry Hay =< Pedophile\" assessment.\nYou just admit this is an assessment not the fact that was used. The \"fact\" was what Jennings said about Harry Hay. The assessment is what is baseless. They went from FACT to CONCLUSION incorrectly..in other words the conclusion is not supported by the fact they claim...it's a logical fallacy. \n \n \nThe only facts presented are \"Jennings praised Hay\" and \"Hay supported NAMBLA\".\n Is there ANY logical conclusion that can be made to \"Jennings praised NAMBLA\"?\n No. But that is PRECISELY what is being attempted.\nRight. This is the same thing done on the Palin smear thread i referred to. I say both are wrong.\n \n I feel you aren't understanding me. The fact is the basic thing they present such as the \"Jennings praised Hay\". I fully understand and am explaining that the conclusion does not follow and that is what is misleading. It is also misleading to \"fact check\" a conclusion in the sense this article did (it some cases). It would be more accurate to say \"jennings praised Hay but no evidence exists to show he supports or has ever been a member of NAMBLA\"...something along those lines. An example of the article is where they said the myth was \"\"unfit for the post to which he's been assigned.\" the fact was their opinion on why he is qualified...that isn't a fact.. it is an opinion. You could say Jennings is \"unfit\" because he praised Hay. It is true Jennings praised Hay but it is mere opinion on whether or not that makes someone fit for a given job. Frankly I don't think it does but that's my opinion.\n \n \nAIP talks about about achieving a vote for Alaskan Independence, and you doubt whether or not their goal is for secession??? \nI have no reason to doubt their website and positions.", 
   {
    "unicode_changes_made": true
   }, 
   374024, 
   null, 
   1255365420.0
  ], 
  [
   374109, 
   null, 
   "foundit66", 
   "Not if you cut the spending as well....HAHAHAHA...Oh I can't type that with a straight face :p\n\n Sad, but true.\n \n \n \nI can't tell you how many meetings I've had on the ARRA BS. You want to know the truth about how it \"saves jobs\"? Say ORG A had a budget of $2 million from the state of North Carolina. The economy goes south and ORG A gets a budget of $1.5 million but NC is going to be nice and give ORG A $.1 million ($100,000) to help offset some of the loss. Now ORG A has the ability to cut the budget however it wants. It would be that ORG A would have cut out all travel, no raises, reduction in supplies, etc and never cut someone. In reality ORG A probably would have cut someone but wouldn't cut $500,000 worth of someone. North Carolina, under fear of God from the federal government, says you MUST spend the entire $100,000 on salaries. So what happens? You just call money something else. If you were only going to cut $20,000 worth of salaries anyway than the reality is AT BEST saved $20,000 worth of a job for as long a that money is available. But thanks to rearranging of money Obama claims he saved $100,000 worth of a job. Hopefully you can follow that but basically the numbers are cooked! States are now worried about the so called \"cliff-effect\" related to this.\n\n I don't think people realize that the cliff is there REGARDLESS of the stimulus.\n If you ask anybody, they'll be happy to have a job for six more months as opposed to losing it six months earlier.\n Plus, the effect of getting that money into people's hands so they can spend it and stimulate the economy.\n \n That cliff is there anyways.\n If you want to look at Obama as laying more road so that we don't fall off it NOW, as opposed to six months from now when the economy will be rebuilding ground underneath to offset a fall...\n \n \n \nSo yeah, he set his standards too high, the money isn't spent, and the economy looks like it will just limp somewhat upward for the foreseeable future with our dollar being a joke. Too much? Perhaps I've had to work with ARRA too much ha.\n\n In some ways, I think of it as a \"Perfect Storm\".\n I think there are a lot of factors just piling upon themselves.\n The Housing bubble burst. Jobs were already being outsourced, so I can't help but wonder how much of this job deficit is actually a correction for the outsourcing.\n \n Too much of our economy is built on transferring money around. Our credit card debt is ridiculous. I saw a guy on the news quoting the increase in bank profits from \"overdraft charges\", and it was topping 10% (from the previous year).\n Education expenses keep rising, but the payoffs for the educations aren't rising at the same rate.\n \n Things are coming together and its ugly.\n \n \n \nYes...when you basically run on the idea of getting out of there. He said \"I will bring this war to an end in 2009\" during the campaign...did he not?\n\n You would have to quote him.\n \n I've seen him talk about troop withdrawal from Iraq and give some deadline. As far as \"ending the war\", it was NEVER a 2009 deadline.\n \n And I don't believe any such thing was alleged for Afghanistan. \n He said he would send two additional brigades to Afghanistan, but I heard nothing about ending that war by 2009.\n \n \n \nThen he qualified it which is how he will get away with it now by saying it might change when he gets in office and looks at the situation. That's my personal view...so yes it is HIS fault and he was misleading at best.\n\n His statements are his fault.\n The situation that he inherited is not.\n \n \n \nWhy do you keep referring this with republicans? This is what I think Obama should be criticized for. Him going around giving speeches all day is legitimate...it makes him look like he is still campaigning instead of doing something useful. \n\n emoticon_rolleyes\n See, this is EXACTLY part of the problem with the \"Blame Obama\" machine.\n People complain Obama isn't doing anything. But if that were REALLY true, your complaints on Obama would be absolutely short and list one thing.\n \"Obama ain't doing anything...\"\n \n The truth is Obama is doing A LOT of what Republicans don't like, but Repubs don't want to give Obama credit for actions that they don't approve of.\n They want to blame him for not doing anything, AND for doing things at the same time... emoticon_frazzled\n \n You're getting sucked into the Repub blame machine.\n Obama is working on healthcare, which you disapprove of. But that IS something.\n Obama has made efforts on the stimulus, which you disapprove of. But that IS something.\n Heck. Obama has even broken promises to the extent that he has decided to CONTINUE some of the Bush admin practices which liberals hated. Repubs should be happier about that. But Obama doesn't get credit for that either...\n \n \n \nYes it is. Both would be believing in evidence that is wrong and misleading. \n\n I think part of this problem in interpretation is that I work off things from a scientific perspective.\n Science has facts. Evidence. Things which are concrete.\n X DID happen.\n \n How we interpret X can lead to theories or hypotheses.\n But that doesn't change that X DID happen.\n \n You can't really \"believe\" in evidence. Beliefs require some sort of doubt. Some sort of leap of faith.\n Evidence IS.\n \n It's a fact that Jennings made positive comments about Hay.\n But WHAT HE WAS REFERENCING is part of that context that Repubs want to ignore.\n It's not a \"belief\" in facts that is the Repub problem on this issue.\n It's a SELECTIVE VIEW of what happened, applying logical fallacies that is the problem.\n \n \n \nCorrect. DOMA is not constitutional as it isn't a power of the federal government.\n\n emoticon_rolleyes\n Considering the full faith and credit clause, I don't see how you could even try to make that allegation.\n DOMA is unconstitutional for other reasons. But to declare it as unconstitutional because \"it isn't a power of the federal government\" is simply ignoring parts of the constitution...\n \n \n \nYou just admit this is an assessment not the fact that was used. The \"fact\" was what Jennings said about Harry Hay. The assessment is what is baseless. They went from FACT to CONCLUSION incorrectly..in other words the conclusion is not supported by the fact they claim...it's a logical fallacy.\n\n Yeah. I think I just said that.\n \n \n \nRight. This is the same thing done on the Palin smear thread i referred to. I say both are wrong.\n\n And here I say no.\n There is a difference between PRAISING somebody, and NOMINATING them for a position...\n \n Take Obama as an example.\n He was NOMINATING his cabinet, filled with different people.\n Some of them had serious tax problems.\n Now the question comes down to whether or not we want people on the cabinet who have these serious tax problems.\n Republicans said no.\n I agree with them.\n \n A nomination (and subsequent filling that post) is for a whole bigger picture than just recognizing some aspect as being inspiring.\n I think Clinton has some areas he deserves praise in.\n But as a president (filling an office), I would have to judge the whole picture which would include him lying to the public.\n \n On PALIN's issue, the issue at hand had a DIRECT CORRELATION to the accusation being levelled.\n We're talking about a guy for ATTORNEY GENERAL, making comments about RAPE and DOMESTIC VIOLENCE. How he would prosecute or approach these issues as part of his job is entirely relevant.\n \n A more apt analogy would be if Jennings thought Hay was perfect for a school principal position. THEN you can roast Jennings... emoticon_frazzled\n \n \n \nI feel you aren't understanding me. The fact is the basic thing they present such as the \"Jennings praised Hay\". I fully understand and am explaining that the conclusion does not follow and that is what is misleading. It is also misleading to \"fact check\" a conclusion in the sense this article did (it some cases). It would be more accurate to say \"jennings praised Hay but no evidence exists to show he supports or has ever been a member of NAMBLA\"...something along those lines. An example of the article is where they said the myth was \"\"unfit for the post to which he's been assigned.\" the fact was their opinion on why he is qualified...that isn't a fact.. it is an opinion. You could say Jennings is \"unfit\" because he praised Hay. It is true Jennings praised Hay but it is mere opinion on whether or not that makes someone fit for a given job. Frankly I don't think it does but that's my opinion.\n\n To repeat myself simply...\n It's a simple logical fallacy that they are perpetuating.\n A) Jack praises MLK Jr.\n B) MLK Jr had extra-marital affairs.\n A&B are facts.\n \n C) Jack is praising MLK Jr's extra-marital affairs.\n C is not based upon facts A & B. C is a logical fallacy that anybody should be able to see through.\n \n \n \nI have no reason to doubt their website and positions.\n\n emoticon_rolleyes\n You realize the obvious retort to that is I had no reason to doubt the statement of the people talking about what Palin's nominated Attorney General had said...\n \n Funny how \"no reason to doubt\" works... emoticon_frazzled\n \n But going a step further, I gave reason for doubt.\n \n If somebody were trying to get a vote to do away with child molestation laws, the obvious goal would be regarding legal child molestation.\n AIP talks about about achieving a vote for Alaskan Independence, and you doubt whether or not their goal is for secession???\n \n To ask a more direct question, what is their motive then?\n They state that they want to force a vote on Alaskan secession.\n If they are not pursuing secession, then WHY do they want a vote on it? emoticon_frazzled", 
   {
    "unicode_changes_made": true
   }, 
   374051, 
   null, 
   1255388580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Right-Wing Smear Campaign Against Kevin Jennings", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13413-right-wing-smear-campaign-against-kevin-jennings.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13413, 
  "discussion_files": [
   [
    "5781.html", 
    "http://www.4forums.com/political/gay-rights-debates/13413-right-wing-smear-campaign-against-kevin-jennings-print.html"
   ], 
   [
    "5782.html", 
    "http://www.4forums.com/political/gay-rights-debates/13413-right-wing-smear-campaign-against-kevin-jennings-3-print.html"
   ], 
   [
    "5783.html", 
    "http://www.4forums.com/political/gay-rights-debates/13413-right-wing-smear-campaign-against-kevin-jennings-2-print.html"
   ]
  ], 
  "identifier": 13413
 }
]