[
 [
  [
   374251, 
   null, 
   "foundit66", 
   "The president of a Midwest office supply company is in court after a salesman claimed the boss' pre-election e-mail rant against Barack Obama amounted to an edict: Vote for Obama and you're fired.\n \n The lawsuit (.pdf) claims the president of KK Office Solutions' pre-election e-mail criticizing Obama to company employees was no joke and instead resulted in the firing of a pro-Obama salesman, Elliot Snell, who openly made it known he supported and voted for Obama.\n \n \"Mr. Snell was terminated for voting for his presidential candidate of choice. Voting for a president is acting in a manner that public policy would encourage as it is similar to civic duties/opportunities such as performing jury duty, seeking public office or joining a labor union,\" Snell's lawsuit said.\n \n The lawsuit, filed in Kansas state court Oct. 6, highlights that there is no federal statute directly protecting private workers from being retaliated for their votes. \"There's not really a federal statute that would cover this. It's just not there. It has to be a public policy argument that is covered by state law,\" said Snell's attorney, Lawrence Williamson of Kansas.\n \n What's more, it's an open question of whether Snell and his colleagues were being cyberbullied by president Matthew Brandt's e-mail - underscoring that office humor in the digital age might get lost in translation - especially when undertaken by the boss.\n \n \"It was an ill-advised attempt at humor. Obviously, the better practice is to confine the use of company e-mails for business,\" said Bill Tretbar, the company's attorney, in a telephone interview.\n \n \"Having said that,\" Tretbar added, \"nobody in their right mind would interpret this e-mail as serious. The message here is even if the claim is utterly without merit, which we claim it is, my client is going to incur thousands of dollars in attorney's fees to get rid of it.\"\n \n Among other things, the Oct. 29 2008 e-mail said if Obama is elected, changes would be made: sales personnel would pool commissions to give underachievers a \"fair shake.\" Hourly wage earners will pool wages and overtime to \"help those who are 'too busy' for overtime.\" Tretbar maintains the company president did not write the message but instead forwarded it on to employees.\n \n What's more, the e-mail, \"Exhibit A\" in the case, said top managers would be referred to as \"the government.\"\n \n \"We will not participate in this 'pooling' experience because the law doesn't apply to us,\" the e-mail said.\n \n The linchpin of the fired worker's argument hinges on a few of the final lines in Brandt's e-mail.\n \n \"The last few people who are hired should clean out their desks,\" the e-mail said. \"Don't feel bad, though, because President Obama will give you free healthcare, free handouts, free oil for heating your home, free food stamps, and he'll let you stay in your home for as long as you want even if you can't pay your mortgage.\"\n \n The e-mail ended: \"If for any reason you are not happy with the new policies, you may want to rethink your vote on November 4th.\"\n \n Snell, in his lawsuit, claims he was the last salesman hired, so the e-mail proved true when he was terminated two weeks after Obama was elected.\n \n \"I'm sure they're going to argue that they didn't mean anything by it, but their actions ratified what the e-mail was,\" Snell's lawyer, Williamson, said in a telephone interview. \"Mr. Snell was very verbal about his support for Obama and he was terminated.\"\n \n For its part, the company said Snell was fired for legal cause, which Snell disputes.\n \n \"All we wanted him to do was to sell copiers. He was terminated, after giving him ample opportunity, because he couldn't meet expectations,\" Tretbar said. \"We don't care if he was a Democrat or Republican or a Libertarian Buddhist. We just wanted him to sell our gear.\"\n\n E-Mail Mocking Obama Is &#8216;Exhibit A&#8217; in Wrongful-Firing Suit | Threat Level | Wired.com\n \n 1) This is why you don't discuss politics at the office.\n \n 2) It is incredibly stupid for a boss to make such comments.\n Serious or not.", 
   {
    "post_info": {
     "post_title": "Threat Level Privacy, Crime and Security Online E-Mail Mocking Obama Is \u0091Exhibit A\u0092"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1255503420.0
  ], 
  [
   374283, 
   null, 
   "jitobear", 
   "E-Mail Mocking Obama Is 'Exhibit A' in Wrongful-Firing Suit | Threat Level | Wired.com\n \n 1) This is why you don't discuss politics at the office.\n \n 2) It is incredibly stupid for a boss to make such comments.\n Serious or not.\n\n \n We are not allowed to talk politics at work.\n \n Dumb-XXX.", 
   {
    "unicode_changes_made": true
   }, 
   374251, 
   null, 
   1255536600.0
  ], 
  [
   374287, 
   null, 
   "JPSartre12", 
   ".....\n 1) This is why you don't discuss politics at the office.\n \n 2) It is incredibly stupid for a boss to make such comments.\n Serious or not.\n\n \n \n That was pretty dumb fior the boss to send this out to his employees.", 
   {}, 
   374251, 
   null, 
   1255537920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Threat Level Privacy, Crime and Security Online E-Mail Mocking Obama Is \u0091Exhibit A\u0092", 
  "url": "http://www.4forums.com/political/politics-debates/13445-threat-level-privacy-crime-security-online-e-mail-mocking-obama-exhibit.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13445, 
  "discussion_files": [
   [
    "4895.html", 
    "http://www.4forums.com/political/politics-debates/13445-threat-level-privacy-crime-security-online-e-mail-mocking-obama-exhibit-print.html"
   ]
  ], 
  "identifier": 13445
 }
]