[
 [
  [
   374372, 
   null, 
   "sinjin", 
   "\"Soccer mom Meleanie Hain was shot to death by her husband, Scott Hain, while she chatted with another man on a computer webcam, police announced Friday.\"\n \n \"Meleanie became notorious a year ago when she openly carried a loaded pistol to her daughter's soccer game.\" \n A cult of guns leads to deadly results | PoconoRecord.com\n \n \n \n \"Meleanie Hain was not armed when she was shot. A handgun registered to her was found \n fully-loaded in a backpack hanging on a hook on the back of the house's front door...\"\n \n \"...the couple's children, 2- and 6-year-old girls and a 10-year-old boy, were in the house at the time of the shootings.\" \n http://www.ldnews.com/ci_13528356?source=most_emailed#\n \n \n sinjin - No comment.", 
   {
    "post_info": {
     "post_title": "Mom's gotta gun"
    }
   }, 
   null, 
   null, 
   1255635720.0
  ], 
  [
   374374, 
   null, 
   "NATO 556", 
   "sinjin - No comment.\n\n \n Good, this isn't the time for either side to be making politically motivated comments, even if the case is over a week old.", 
   {}, 
   374372, 
   null, 
   1255637100.0
  ], 
  [
   374377, 
   null, 
   "sinjin", 
   "Good, this isn't the time for either side to be making politically motivated comments, even if the case is over a week old.\nI wouldn't have any of those anyway. Philosophical maybe, not political.", 
   {}, 
   374374, 
   null, 
   1255638480.0
  ], 
  [
   374383, 
   null, 
   "OldSarge", 
   "\"Soccer mom Meleanie Hain was shot to death by her husband, Scott Hain, while she chatted with another man on a computer webcam, police announced Friday.\"\n \n \"Meleanie became notorious a year ago when she openly carried a loaded pistol to her daughter's soccer game.\" \n A cult of guns leads to deadly results | PoconoRecord.com\n \n \n \n \"Meleanie Hain was not armed when she was shot. A handgun registered to her was found \n fully-loaded in a backpack hanging on a hook on the back of the house's front door...\"\n \n \"...the couple's children, 2- and 6-year-old girls and a 10-year-old boy, were in the house at the time of the shootings.\" \n Lebanon soccer mom shot by husband while chatting on webcam - Lebanon Daily News\n \n \n sinjin - No comment.\n\n \n Looks like dancing in the blood of innocents to me. ", 
   {}, 
   374372, 
   null, 
   1255645260.0
  ], 
  [
   374386, 
   null, 
   "sinjin", 
   "Looks like dancing in the blood of innocents to me. \nOnly one innocent bled in this case.", 
   {}, 
   374383, 
   null, 
   1255646040.0
  ], 
  [
   374388, 
   null, 
   "OldSarge", 
   "Only one innocent bled in this case.\n\n \n The point is you dancing in the blood, of at least one innocent. Why else post this? Especially with no comment?", 
   {}, 
   374386, 
   null, 
   1255646760.0
  ], 
  [
   374391, 
   null, 
   "sinjin", 
   "The point is you dancing in the blood, of at least one innocent. Why else post this? Especially with no comment?\nI found it ironic. You're trying to make it political. Take Nato's advice.", 
   {}, 
   374388, 
   null, 
   1255648620.0
  ], 
  [
   374396, 
   null, 
   "OldSarge", 
   "I found it ironic. You're trying to make it political. Take Nato's advice.\n\n \n I just found it ghoulish to say the least. Ironic just don't get it. Sick is not political, it crosses all creeds, national origins, sex or politics. ", 
   {}, 
   374391, 
   null, 
   1255649220.0
  ], 
  [
   374397, 
   null, 
   "OldSarge", 
   "A cult of guns leads to deadly \n October 14, 2009 \n \"Guns don't kill people, people kill people.\"\n \n Problem is, people with guns ready at hand sometimes use guns as a way to resolve problems. Witness last week's domestic tragedy involving the gun-toting soccer mom from Lebanon whose husband shot her to death, then turned his gun on himself. Two parents dead, three young children, 2, 6 and 10, orphaned.\n \n Police: Gun-toting soccer mom was shot by husband during video chat Gun-toting Pa. soccer mom, husband found shot dead Maybe a gunless 33-year-old Scott Hain would have found another way to kill his 31-year-old wife, Meleanie. But certainly the parents had made something of a cult of guns in their lives. Meleanie became notorious a year ago when she openly carried a loaded pistol to her daughter's soccer game. The county sheriff revoked her concealed carry permit, saying her provocative behavior indicated she was using poor judgment. But she appealed and a judge gave her the permit back, ordering her to conceal the weapon. She later sued the sheriff, blaming him for decimating her child care business. Maybe she couldn't get her thoughts around the possibility that other parents simply didn't want their young children around accessible guns.\n \n Other indications of the couple's reverence for guns surfaced. Meleanie Hain also wore her 9 mm Glock pistol to the grocery store. A family car's bumper sticker said \"NRA law enforcement.\"\n \n And neighbors recently spotted Meleanie holding a rifle while she chatted with someone outside her house.\n \n The Second Amendment confers the right to bear arms, and earlier this year a U.S. Supreme Court ruling curtailed government's ability to regulate guns. Americans clearly revel in their ability to own and use firearms of all types.\n \n But besides any firearm's inherent danger, there's human psychology to consider. Despite a commonly held belief, owning a gun does not make people safer. In fact statistics say otherwise. And when people's lives begin to revolve around guns, it's inevitable that guns will be at hand at moments of anger or danger. Did anyone feel safer during the summer's town hall meetings when gun owners showed up carrying a weapon? Isn't the whole idea of a town meeting a conversation, not dispute by arms?\n \n Neighbors said the Hains had been having marital problems. A gun ended the parents' conflict. But that gun took a mother and father away from three innocent children forever.\n \n The National Rifle Association is highly effective at motivating gun owners to protect their right to bear arms. The NRA's lobbying success in not only defending but expanding gun rights is well known.\n \n The NRA ought to throw an equal amount of energy into reminding members that guns are best used for hunting and target practice, not for brandishing at public events or for threatening spouses. Some people need such reminders, and often.\n \n There's a better way to teach Americans the meaning of the hallowed right to bear arms than by encouraging a fetish.\n \n And this isn't political? Why else would you source this other than to dance in the blood of at least one innocent?", 
   {
    "post_info": {
     "post_title": "here's yer political"
    }
   }, 
   374396, 
   null, 
   1255649400.0
  ], 
  [
   374404, 
   null, 
   "sinjin", 
   "And this isn't political? Why else would you source this other than to dance in the blood of at least one innocent?\nBecause I and maybe others didn't know who she was. \n I sourced it because that's what we do here when pulling quotes. \n Neither quote I posted in the OP is political.", 
   {}, 
   374397, 
   null, 
   1255651080.0
  ], 
  [
   374405, 
   null, 
   "OldSarge", 
   "Because I and maybe others didn't know who she was.\n\n \n Nice try but the give away is the title of your thread. The piece you linked to was a ghoulish hit piece. There were no others of less political bent I suppose. Yer caught my ghoulish chum.", 
   {}, 
   374404, 
   null, 
   1255651440.0
  ], 
  [
   374406, 
   null, 
   "sinjin", 
   "Nice try but the give away is the title of your thread. The piece you linked to was a ghoulish hit piece. There were no others of less political bent I suppose. Yer caught my ghoulish chum.\nIt's not my job to find NRA-friendly pieces. That's for you chum.\n I chose the title, true. I fail to see any \"give away\". Assigning motives to others is a hobby of yours.", 
   {}, 
   374405, 
   null, 
   1255652100.0
  ], 
  [
   374407, 
   null, 
   "OldSarge", 
   "It's not my job to find NRA-friendly pieces. That's for you chum.\n I chose the title, true. I fail to see any \"give away\". Assigning motives to others is a hobby of yours.\n\n \n Of course you wouldn't blinded by the blood splashes. Throw some thing against the wall and hope it sticks. The point is why choose that particular hit piece unless there was some inner glee at the gun totin' mom getting what she deserved. No your job is to find ghoul pieces to gloat over. ", 
   {}, 
   374406, 
   null, 
   1255652880.0
  ], 
  [
   374409, 
   null, 
   "sinjin", 
   "Of course you wouldn't blinded by the blood splashes. Throw some thing against the wall and hope it sticks. The point is why choose that particular hit piece unless there was some inner glee at the gun totin' mom getting what she deserved. No your job is to find ghoul pieces to gloat over. \nWhere's the gloating? I stumbled on the piece reading about Bloomberg, and any potential arrests forthcoming, purely by accident.", 
   {}, 
   374407, 
   null, 
   1255653180.0
  ], 
  [
   374411, 
   null, 
   "OldSarge", 
   "Where's the gloating? I stumbled on the piece reading about Bloomberg, and any potential arrests forthcoming, purely by accident.\n\n \n Then why post it other than to dance in blood?", 
   {}, 
   374409, 
   null, 
   1255653300.0
  ], 
  [
   374793, 
   null, 
   "sinjin", 
   "Then why post it other than to dance in blood?\n\"The best laid plans of mice and men often go awry.\"", 
   {}, 
   374411, 
   null, 
   1255981860.0
  ], 
  [
   374803, 
   null, 
   "JPSartre12", 
   "I thought the song was \"Jamie's got a gun\" emoticon_xkill", 
   {}, 
   374793, 
   null, 
   1255982640.0
  ], 
  [
   374880, 
   null, 
   "Doc Jones", 
   "So what! I got a box of cracker jacks with a Nobel Peace Prize :p", 
   {
    "post_info": {
     "post_title": "Mom's got a gun!"
    }
   }, 
   374803, 
   null, 
   1255996740.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Mom's gotta gun", 
  "url": "http://www.4forums.com/political/gun-control-debates/13450-moms-gotta-gun.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13450, 
  "discussion_files": [
   [
    "2352.html", 
    "http://www.4forums.com/political/gun-control-debates/13450-moms-gotta-gun-print.html"
   ], 
   [
    "2353.html", 
    "http://www.4forums.com/political/gun-control-debates/13450-moms-gotta-gun-2-print.html"
   ]
  ], 
  "identifier": 13450
 }
]