[
 [
  [
   374498, 
   null, 
   "Ethmi", 
   "Remember, the likelyhood of this is irrelevant. Imagine you're sitting on your couch one evening when the Newslady says something about a cannibalistic serial killer being on the loose in the local area, and you see a police drawing of his face on the screen. Suddenly, the door is kicked down and you see the same guy in the drawing. Entrails and blood drool from his mouth, and he has a razor-sharp with a twelve inch blade, from which blood drips. You have a 38 Special next to you. You show him the weapon in an attempt to scare him away, but he's not intimidated. There are several things you can try, but when he raises the knife and starts charging, you have mere seconds to react. Would it be just to shoot him? And does thinking of this make me paranoid?", 
   {
    "post_info": {
     "post_title": "Is it ever just to shoot someone?"
    }
   }, 
   null, 
   null, 
   1255763100.0
  ], 
  [
   374509, 
   null, 
   "Superlite27", 
   "I know you've tried to cover all the bases in your scenario, but I didn't answer because you failed to mention where this was happening. I would reccommend two alternative reactions based on where I happened to be living.\n \n In the United States? ......Fire away. Good ol' Second Amendment and Castle Doctrine just saved my life.\n \n Britain?......Gotta use reason. \n \n After all, having a .38 would be a serious crime. The mere posession of such an item shows my disregard for human life and willingness to murder small children and the elderly. Since I am such an evil criminal for owning a handgun, I would definately not call 911. After all, the police would show up and arrest me. Not to mention, there would be a witness (the cannibal) to testify to my possession of such a hideous object. Especially since I \"brandished\" the weapon. Why would I call the police, unless I wanted them to come and interview the serial killer about my evil crime? I would hope he didn't stab me in self defense.\n \n Shooting him, or assaulting him physically would be right out. That would be illegal.\n \n That just leaves using reason to try and talk the cannibalistic serial killer from calling 911 and reporting me.", 
   {}, 
   374498, 
   null, 
   1255793100.0
  ], 
  [
   374564, 
   null, 
   "Ethmi", 
   "Law is irrelevant here, only in the eyes of the government is self-defense more or less ethical purely becuase you did it in a certain place. Illegal and unethical are two different things.", 
   {}, 
   374509, 
   null, 
   1255817700.0
  ], 
  [
   374594, 
   null, 
   "Brady", 
   "What about due process?", 
   {}, 
   374564, 
   null, 
   1255867320.0
  ], 
  [
   374595, 
   null, 
   "Doc Jones", 
   "What about due process?\n\n \n Well what about it girl? \n \n That is due process!", 
   {}, 
   374594, 
   null, 
   1255867740.0
  ], 
  [
   374607, 
   null, 
   "NATO 556", 
   "What about due process?\n\n \n What about it? What part of due process applies here? How does a requirement of the court affect people outside of the court?", 
   {}, 
   374594, 
   null, 
   1255879920.0
  ], 
  [
   374627, 
   null, 
   "Brady", 
   "Well if you just shoot someone and they die then they dont get their day in court so they dont get due process. The fifth says you cant lose your life without due process.", 
   {}, 
   374607, 
   null, 
   1255890240.0
  ], 
  [
   374628, 
   null, 
   "NATO 556", 
   "Well if you just shoot someone and they die then they dont get their day in court so they dont get due process. The fifth says you cant lose your life without due process.\n\n \n And the Supreme Court has also held that the Bill of Rights is a restriction only against those who work for the government; you can't be denied your constitutional rights by a private citizen. So therefore there's no issue of missed due process.\n \n If you want to use this stupid argument, then I'm going to use the same against you. What about the victim's right to due process? Aren't their rights violated when they're killed and unable to get their killers locked up?", 
   {}, 
   374627, 
   null, 
   1255890540.0
  ], 
  [
   374736, 
   null, 
   "Nozza123", 
   "Well if you just shoot someone and they die then they dont get their day in court so they dont get due process. The fifth says you cant lose your life without due process.\n\n \n Umm, isant the cannibalistic serial killer violating your basic human right the right to life? Hasant he violated the basic human rights of those he murdered. Hasant he commited sickening crimes by murdering and then eating his victoms?\n \n Are you telling me that you care more about the rights of the cannibalistic serial killer more than the innocent victoms he brutally slays and eats?\n He lost the right to life the second he murdered the INNOCENT! \n \n Were you born with all your marbles?", 
   {}, 
   374627, 
   null, 
   1255954740.0
  ], 
  [
   374749, 
   null, 
   "Doc Jones", 
   "Well if you just shoot someone and they die then they dont get their day in court so they dont get due process. The fifth says you cant lose your life without due process.\n\n \n Where does it say that? Self-defense has always been a principle of law! Sounds strange that you would try to use a document that you wish to destroy and advocate no due process for the parts you hate and make a living from suckers you scam money from.\n \n Say, how did that illegal hospital room supposedly 'donated' to your momma in kalifornia turn out emoticon_xgood back in the '90s?", 
   {}, 
   374627, 
   null, 
   1255964700.0
  ], 
  [
   374761, 
   null, 
   "sinjin", 
   "Is my 38 Special next to me on the side my 3 yr. old is sitting or the other, where my 6 yr. old is sitting?\n I've been meaning to reinforce that front door.emoticon_xclown", 
   {}, 
   374749, 
   null, 
   1255972380.0
  ], 
  [
   374765, 
   null, 
   "JPSartre12", 
   "\n __________________\n A handgun is a badge of cowardice. \n\n \n Interesting sigline. Let's explore it further.\n So, if I'm a woman working in a high crime area of a city at night and carry a handgun for my protection because I'm only 5\" tall and 100 pounds and couldn't engage in hand-to-hand combat with a 250 pound assailant, I'm a coward?", 
   {
    "unicode_changes_made": true
   }, 
   374594, 
   null, 
   1255973820.0
  ], 
  [
   374769, 
   null, 
   "sinjin", 
   "No, you're the NRA's wet dream.", 
   {}, 
   374765, 
   null, 
   1255974480.0
  ], 
  [
   374771, 
   null, 
   "JPSartre12", 
   "No, you're the NRA's wet dream.\n\n \n So what's that make you, a Brady nuthugger? ;)", 
   {}, 
   374769, 
   null, 
   1255975440.0
  ], 
  [
   374777, 
   null, 
   "sinjin", 
   "So what's that make you, a Brady nuthugger? ;)\nI'm just a guy with no use for a handgun.", 
   {}, 
   374771, 
   null, 
   1255977360.0
  ], 
  [
   374779, 
   null, 
   "JPSartre12", 
   "I'm just a guy with no use for a handgun.\n\n \n I don't own a handgun, either, but I have told my daughters that I'd buy them handguns for their own protection if they wanted one. I just happen to prefer my 12 gauge. It's a much better deterrent, IMO. emoticon_xgood", 
   {}, 
   374777, 
   null, 
   1255977720.0
  ], 
  [
   374788, 
   null, 
   "sinjin", 
   "I don't own a handgun, either, but I have told my daughters that I'd buy them handguns for their own protection if they wanted one. I just happen to prefer my 12 gauge. It's a much better deterrent, IMO. emoticon_xgood\nIt has always seemed so to me as well. Are semi-auto shotguns reliable or would you always choose a pump action?", 
   {}, 
   374779, 
   null, 
   1255981440.0
  ], 
  [
   374791, 
   null, 
   "JPSartre12", 
   "It has always seemed so to me as well. Are semi-auto shotguns reliable or would you always choose a pump action?\n\n \n I have a semi-automatic, but pumps are cheaper to buy.", 
   {}, 
   374788, 
   null, 
   1255981680.0
  ], 
  [
   374794, 
   null, 
   "NATO 556", 
   "I don't own a handgun, either, but I have told my daughters that I'd buy them handguns for their own protection if they wanted one. I just happen to prefer my 12 gauge. It's a much better deterrent, IMO. emoticon_xgood\n\n \n While I own something in almost every firearm category, I prefer to go with my carbine more than anything else.\n \n A .45 ACP or .357 Magnum if effective. A 12 gauge slug is intimidating and commands respect. But a .223 Remington is not to be f***ed with under any circumstances.", 
   {}, 
   374779, 
   null, 
   1255981860.0
  ], 
  [
   374806, 
   null, 
   "JPSartre12", 
   "While I own something in almost every firearm category, I prefer to go with my carbine more than anything else.\n \n A .45 ACP or .357 Magnum if effective. A 12 gauge slug is intimidating and commands respect. But a .223 Remington is not to be f***ed with under any circumstances.\n\n \n In a home defense scenario, there's no substitute for bird shot followed by 00Buck for the second shot. I don't have to worry about killing a family member or a neighbor that way. emoticon_xkill", 
   {}, 
   374794, 
   null, 
   1255982760.0
  ], 
  [
   374812, 
   null, 
   "Ethmi", 
   "What about due process?\n\n \n Due process won't ressurrect you.", 
   {}, 
   374594, 
   null, 
   1255984020.0
  ], 
  [
   374814, 
   null, 
   "Ethmi", 
   "Well if you just shoot someone and they die then they dont get their day in court so they dont get due process. The fifth says you cant lose your life without due process.\n\n \n No matter how many times we tell you, you just won't learn, will you Brady? It says you can't be executed or punished in any way without due process. Due process is meant for criminals in court, not criminals kicking your door down and charging at you with a knife. You have every right to protect your life against an attacker by any means neccesary, and that includes killing him/her. BTW, I bet you'd think differently if we were discussing wether or not it'd be legitimate to stab or beat your attacker to death.\n \n BTW, It's weird how you always whine that the rights of criminals are violated, you're against Megan's Law, you think pedophilia should be legalized, and you want guns taken out of as many hands as possible. I think I see a correlation there.", 
   {}, 
   374627, 
   null, 
   1255984200.0
  ], 
  [
   374818, 
   null, 
   "Ethmi", 
   "No, you're the NRA's wet dream.\n\n \n And of course average people who can't stand up to a 250 pound experienced robber who is armed with a knife are extremely rare, and are just the NRA's fantasies, huh?", 
   {}, 
   374769, 
   null, 
   1255984500.0
  ], 
  [
   374827, 
   null, 
   "zsu2357", 
   "It has always seemed so to me as well. Are semi-auto shotguns reliable or would you always choose a pump action?\n\n \n If you are thinking shotgun,go 20ga.pump,do the job,less coll.damage.emoticon_xkill", 
   {}, 
   374788, 
   null, 
   1255986960.0
  ], 
  [
   374835, 
   null, 
   "zsu2357", 
   "No matter how many times we tell you, you just won't learn, will you Brady? It says you can't be executed or punished in any way without due process. Due process is meant for criminals in court, not criminals kicking your door down and charging at you with a knife. You have every right to protect your life against an attacker by any means neccesary, and that includes killing him/her. BTW, I bet you'd think differently if we were discussing wether or not it'd be legitimate to stab or beat your attacker to death.\n \n BTW, It's weird how you always whine that the rights of criminals are violated, you're against Megan's Law, you think pedophilia should be legalized, and you want guns taken out of as many hands as possible. I think I see a correlation there.\n\n \n You know what really gets me Ethmi?The twerp don't seem to understand if your a## is dead, than due process don't mean squat.Do process is doing unto, before your done to first.emoticon_xagree?", 
   {}, 
   374814, 
   null, 
   1255988700.0
  ], 
  [
   374847, 
   null, 
   "NATO 556", 
   "In a home defense scenario, there's no substitute for bird shot followed by 00Buck for the second shot. I don't have to worry about killing a family member or a neighbor that way. emoticon_xkill\n\n \n Wrong answer!\n \n Birdshot is not to be considered in a real world home defense scenario. Veteran defense instructors will give you this advice, while armchair generals will recommend birdshot.", 
   {}, 
   374806, 
   null, 
   1255990320.0
  ], 
  [
   374851, 
   null, 
   "JPSartre12", 
   "Wrong answer!\n \n Birdshot is not to be considered in a real world home defense scenario. Veteran defense instructors will give you this advice, while armchair generals will recommend birdshot.\n\n \n When was the last time you shot a .357 or a .223 through a piece of drywall in a house? How far did the round go upon exiting? \n No thanks. I'll take my birdshot over a hard round in my quad-level house every time. At close range, he's dead. At longer range, he's hurtuing. If he's still coming 00 Buck is already chambered, awaiting my command.", 
   {}, 
   374847, 
   null, 
   1255990680.0
  ], 
  [
   374856, 
   null, 
   "zsu2357", 
   "Wrong answer!\n \n Birdshot is not to be considered in a real world home defense scenario. Veteran defense instructors will give you this advice, while armchair generals will recommend birdshot.\n\n \n #7 birdshot?not stoping elk or grizzly here,or shooting much over 15ft.much more than that you better hope he's armed.(if not, get his prints on a knife and drop it by him.)emoticon_xangel", 
   {}, 
   374847, 
   null, 
   1255991280.0
  ], 
  [
   374860, 
   null, 
   "NATO 556", 
   "When was the last time you shot a .357 or a .223 through a piece of drywall in a house? How far did the round go upon exiting?\n\n \n I didn't have to. A retired police officer and licensed firearms instructor was gracious enough to test these things for us, so we could all learn. The Box O' Truth - The Box O' Truth \n \n \nNo thanks. I'll take my birdshot over a hard round in my quad-level house every time.\n\n \n That's like claiming you can be a dumb@$$ with a loaded gun because you've got the safety on. Don't rely on a mechanical feature of design, exercise common sense and good judgment.\n \n \nAt close range, he's dead.\n\n \n It didn't stop Harry Whittington three years ago, it won't stop some much younger and more able-bodied punk. If anything you're going to be the one that's dead.\n \n \nAt longer range, he's hurtuing. If he's still coming 00 Buck is already chambered, awaiting my command.\n\n \n You seem to overlook something. Even if you do shoot the little turkey with just birdshot, or even a specially loaded cork round, the fact that you used a gun will be sufficient to raise whatever charges you might face to include assault with a deadly weapon.\n \n And if you use birdshot and they get away, they could always turn around and sue you in a court of law and turn you into the bad guy. The last time I checked your state didn't have the Castle Doctrine as law.", 
   {}, 
   374851, 
   null, 
   1255992060.0
  ], 
  [
   374863, 
   null, 
   "sinjin", 
   "And of course average people who can't stand up to a 250 pound experienced robber who is armed with a knife are extremely rare, and are just the NRA's fantasies, huh?\nI agree that there are plenty of people that can't defend themselves against a larger adversary. I don't see the wisdom in all of them going around armed and prepared to kill as a good long term solution to the problem. The bad guys could make adjustments as well. Like shoot first.", 
   {}, 
   374818, 
   null, 
   1255992240.0
  ], 
  [
   374866, 
   null, 
   "NATO 556", 
   "I agree that there are plenty of people that can't defend themselves against a larger adversary. I don't see the wisdom in all of them going around armed and prepared to kill as a good long term solution to the problem. The bad guys could make adjustments as well. Like shoot first.\n\n \n Well it was good enough for the Israeli school teachers. School massacres took a sharp nose dive after the armed teacher program became the law.", 
   {}, 
   374863, 
   null, 
   1255992660.0
  ], 
  [
   374867, 
   null, 
   "sinjin", 
   "Well it was good enough for the Israeli school teachers. School massacres took a sharp nose dive after the armed teacher program became the law.\nI didn't realize the Israelis were countering over-sized terrorists. \n Most Americans would probably prefer their teachers not be strapped in the classroom. \n They don't share your values that way.", 
   {}, 
   374866, 
   null, 
   1255993020.0
  ], 
  [
   374869, 
   null, 
   "NATO 556", 
   "I didn't realize the Israelis were countering over-sized terrorists. \n Most Americans would probably prefer their teachers not be strapped in the classroom. \n They don't share your values that way.\n\n \n Blah, blah, blah...\n \n The point is, when teachers and students were being killed off, the government took effective action. As a result, school massacres have dropped sharply, down to just about nothing in comparison.\n \n It doesn't have to be a school. It doesn't even have to be in your own home. But the best solution at hand is to let those who're at the scene at the exact moment of the instance, to actually handle it instead of forcing them to wait an ungodly amount of time for somebody else to arrive.", 
   {}, 
   374867, 
   null, 
   1255993260.0
  ], 
  [
   374871, 
   null, 
   "OldSarge", 
   "I didn't realize the Israelis were countering over-sized terrorists. \n Most Americans would probably prefer their teachers not be strapped in the classroom. \n They don't share your values that way.\n\n \n Yea that's why we have a large amount of deaths in our schools. No one around to stop the shooters. Head in rectum defilade syndrome rules.", 
   {}, 
   374867, 
   null, 
   1255994280.0
  ], 
  [
   374872, 
   null, 
   "Doc Jones", 
   "Yea that's why we have a large amount of deaths in our schools. No one around to stop the shooters. Head in rectum defilade syndrome rules.\n\n \n Well Sarge, looking at it from his viewpoint it would appear that he figures he can outrun little kids so the murderers would take the easier targets instead of his fast moving rump. I bet his wife is in for a surprise if they ever encounter real trouble? Armed people are a threat to him because he know criminals, like the predators they are, prefer easy prey and not hard prey. He can always outrun the women and kids he figures.", 
   {}, 
   374871, 
   null, 
   1255994700.0
  ], 
  [
   374873, 
   null, 
   "sinjin", 
   "Yea that's why we have a large amount of deaths in our schools. No one around to stop the shooters. \nYou better refresh my memory. When did terrorists attack students on an American campus? Other students don't count.", 
   {}, 
   374871, 
   null, 
   1255994760.0
  ], 
  [
   374874, 
   null, 
   "sinjin", 
   "Well Sarge, looking at it from his viewpoint it would appear that he figures he can outrun little kids so the murderers would take the easier targets instead of his fast moving rump. I bet his wife is in for a surprise if they ever encounter real trouble? Armed people are a threat to him because he know criminals, like the predators they are, prefer easy prey and not hard prey. He can always outrun the women and kids he figures.\nDon't speak of my wife Durward. What happened to manners in Texas?", 
   {}, 
   374872, 
   null, 
   1255994880.0
  ], 
  [
   374875, 
   null, 
   "Doc Jones", 
   "Don't speak of my wife Durward. What happened to manners in Texas?\n\n \n Thanks for proving my point! They really aren't a consideration for you are they?", 
   {}, 
   374874, 
   null, 
   1255995000.0
  ], 
  [
   374876, 
   null, 
   "Doc Jones", 
   "Thanks for proving my point! They really aren't a consideration for you are they?\n\n \n Unlike kalifornia, we revere our women and children and their protection comes first, not last!", 
   {}, 
   374875, 
   null, 
   1255995120.0
  ], 
  [
   374878, 
   null, 
   "OldSarge", 
   "You better refresh my memory. When did terrorists attack students on an American campus? Other students don't count.\n\n So it has to be terrorists? I was speaking of our shooting galleys the unarmed teachers of others have made for whack jobs. If you're trying to be don't you leave too many bloody footprints.", 
   {}, 
   374873, 
   null, 
   1255995300.0
  ], 
  [
   374882, 
   null, 
   "JPSartre12", 
   "I didn't have to. A retired police officer and licensed firearms instructor was gracious enough to test these things for us, so we could all learn. The Box O' Truth - The Box O' Truth \n \n\n I read the section on shotgun rounds. I stand by my selection of birdshot followed by 00 Buckshot.\n \n \n\n That's like claiming you can be a dumb@$$ with a loaded gun because you've got the safety on. Don't rely on a mechanical feature of design, exercise common sense and good judgment.\n \n It didn't stop Harry Whittington three years ago, it won't stop some much younger and more able-bodied punk. If anything you're going to be the one that's dead.\n \n You seem to overlook something. Even if you do shoot the little turkey with just birdshot, or even a specially loaded cork round, the fact that you used a gun will be sufficient to raise whatever charges you might face to include assault with a deadly weapon.\n \n And if you use birdshot and they get away, they could always turn around and sue you in a court of law and turn you into the bad guy. The last time I checked your state didn't have the Castle Doctrine as law.\n\n \n Have you ever read Michigan's Constitution? There's no ambiguity over the right to keep and bear arms for self-defense in my state. And we've had the Castle Docrtine since 2006. \n \n And just in case you think I can't shoot, here's my effort using my son's 9mm Sig P229 Elite Stainless after not having shot for a decade. \n [URL=\"http://i183.photobucket.com/albums/x72/jpsartre12/IMG_5161.jpg\"]http://i183.photobucket.com/albums/x72/jpsartre12/IMG_5161.jpg[/URL]\n \n That's 38 straight head shots. Shooting is like riding a bike. Once you know, you know. emoticon_xkill", 
   {}, 
   374860, 
   null, 
   1255997220.0
  ], 
  [
   374883, 
   null, 
   "sinjin", 
   "So it has to be terrorists? I was speaking of our shooting galleys the unarmed teachers of others have made for whack jobs. If you're trying to be don't you leave too many bloody footprints.\nTry selling the idea to parents that the teachers need to be able to shoot students should it become necessary.", 
   {}, 
   374878, 
   null, 
   1255997280.0
  ], 
  [
   374887, 
   null, 
   "OldSarge", 
   "Try selling the idea to parents that the teachers need to be able to shoot students should it become necessary.\n\n \n Hence my comment head in rectum defilade rules. You should get it straight tho rather than try to leave a weasel hole. Its teachers shooting students that are shooting other students. Big difference there although I expect you wouldn't notice. ", 
   {}, 
   374883, 
   null, 
   1255998180.0
  ], 
  [
   374893, 
   null, 
   "Ethmi", 
   "I agree that there are plenty of people that can't defend themselves against a larger adversary. I don't see the wisdom in all of them going around armed and prepared to kill as a good long term solution to the problem. The bad guys could make adjustments as well. Like shoot first.\n\n \n Then what, exactly, would you recommend for a 90 year old woman being attacked by a 250 pound, 20 year old guy?", 
   {}, 
   374863, 
   null, 
   1255999740.0
  ], 
  [
   374894, 
   null, 
   "Ethmi", 
   "I didn't realize the Israelis were countering over-sized terrorists. \n Most Americans would probably prefer their teachers not be strapped in the classroom. \n They don't share your values that way.\n\n \n What makes you think that? Terrorist attacks almost always have two things in common.\n \n 1. They always come armed.\n 2. They almost always attack the weaker, such as hospital patients, school children, unarmed people in a shopping mall, etc.\n \n Terrorists are rarely man enough to attack a building with armed people, even if they're just teachers.", 
   {}, 
   374867, 
   null, 
   1256000040.0
  ], 
  [
   374896, 
   null, 
   "Ethmi", 
   "You better refresh my memory. When did terrorists attack students on an American campus? Other students don't count.\n\n \n The only reason they don't count because you don't want them to. But students who want to become famous overnight effectively prove that the armed have the advantage over the unarmed. Why make the good guys the unarmed?", 
   {}, 
   374873, 
   null, 
   1256000220.0
  ], 
  [
   374897, 
   null, 
   "Ethmi", 
   "Try selling the idea to parents that the teachers need to be able to shoot students should it become necessary.\n\n \n How is a terrorist shooting dozens of people worse than a student shooting dozens of people? Would the parents feel better if they knew their sons and daughters were shot by a student rather than an Islamic Jihadist?", 
   {}, 
   374883, 
   null, 
   1256000340.0
  ], 
  [
   374899, 
   null, 
   "Chuz Life", 
   "Then what, exactly, would you reccomend for a 90 year old woman being attacked by a 250 pound, 20 year old guy?\n\n \n Yeah right,.... like that's ever going to be a problem.\n \n \n Rape of 87 year old linked to others \n \n Gonzalez charged with sexually assaulting an elderly woman\n \n Rape of Elderly Woman Shocks Neighbors\n \n Elderly woman raped in her house \n \n MI: Elderly woman shoots man in self defense \n \n OOOPS!\n \n How did that one get in there?\n \n emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "Like that would ever happen,...."
    }
   }, 
   374893, 
   null, 
   1256000580.0
  ], 
  [
   374903, 
   null, 
   "OldSarge", 
   "From the Press-Register of October 12, 2009\n 81-year-old man shoots Escambia County home invader to death\n \n An 81-year-old man shot and killed a masked gunman during a home invasion early this morning at a residence north of Brewton, Escambia County Sheriff Grover Smith said.\n \n The sheriff said the robber had been released from a Nebraska jail just two days before he was killed.\n \n Smith declined to identify the homeowner, but said the man and his wife were in bed in their home along U.S. 31 north of town about 3 a.m. when the intruder kicked in the door to the home and entered their bedroom, demanding money.\n \n Smith said the homeowner managed to retrieve a pistol from the bedside table and pointed it at the robber, who told the homeowner to drop the weapon.\n \n Instead, Smith said, the homeowner fired the gun, striking the intruder in the forehead, killing him instantly.\n \n Smith identified the intruder as Jeremy Paul McCall, believed to be 35 years old. Smith said McCall had a prior record, and had been released from a Nebraska jail about 48 hours before he was killed.\n \n Smith said McCall's body was sent to the Alabama Department of Forensic Sciences in Mobile for autopsy.\n \n The shooting will be presented to the grand jury, Smith said, but the sheriff said he doubted the homeowner would face any charges.\n \n \"The man was in his home, in bed with his wife, and he acted in self-defense,\" Smith said. \"And as far as the wife, she had armed herself with a shotgun by the time I got there.\"", 
   {
    "post_info": {
     "post_title": "goblin 0 old fart 1"
    }
   }, 
   374896, 
   null, 
   1256001900.0
  ], 
  [
   374926, 
   null, 
   "zsu2357", 
   "Try selling the idea to parents that the teachers need to be able to shoot students should it become necessary.\n\n \n I would have been trying to sell it on the teachers,be it another student or\n terrorist, the firearm knows nothing it just shoots.emoticon_wow", 
   {}, 
   374883, 
   null, 
   1256013420.0
  ], 
  [
   374980, 
   null, 
   "sinjin", 
   "The only reason they don't count because you don't want them to. But students who want to become famous overnight effectively prove that the armed have the advantage over the unarmed. Why make the good guys the unarmed?\nI'm not \"making\" anyone anything. The point is you'll find little support in the US for arming teachers as a precaution against violence on the schoolyard. Even if a teacher has a valid CCW, the school's policy could still deny them the right to carry on campus.", 
   {}, 
   374896, 
   null, 
   1256058360.0
  ], 
  [
   374981, 
   null, 
   "sinjin", 
   "Then what, exactly, would you recommend for a 90 year old woman being attacked by a 250 pound, 20 year old guy?\nStraight razor might work well. \n \n Are you suggesting that every 90 lb woman would do well to \n get used to carrying a pistol with her everywhere?", 
   {}, 
   374893, 
   null, 
   1256058600.0
  ], 
  [
   374982, 
   null, 
   "OldSarge", 
   "I'm not \"making\" anyone anything. The point is you'll find little support in the US for arming teachers as a precaution against violence on the schoolyard. Even if a teacher has a valid CCW, the school's policy could still deny them the right to carry on campus.\n\n \n Yes head in rectum defilade policy. Or would that be typical leftist non-think?", 
   {}, 
   374980, 
   null, 
   1256059080.0
  ], 
  [
   374983, 
   null, 
   "Tither", 
   "Straight razor might work well. \n\n \n My goodness Sinjin. You picked the most violent and bloody way for this 90 year old woman to protect herself?\n \n Tell me, is that legal? No. I didn't think so. However one can legally get a Concealed Weapons permit. One is legal the other is a crime. You chose the crime! emoticon_smile", 
   {}, 
   374981, 
   null, 
   1256059080.0
  ], 
  [
   374984, 
   null, 
   "OldSarge", 
   "Straight razor might work well. \n \n Are you suggesting that every 90 lb woman would do well to \n get used to carrying a pistol with her everywhere?\n\n \n No because then she'd be morally inferior to one raped and stranged with her pantyhose laying in an alley.", 
   {}, 
   374981, 
   null, 
   1256059140.0
  ], 
  [
   374986, 
   null, 
   "sinjin", 
   "My goodness Sinjin. You picked the most violent and bloody way for this 90 year old woman to protect herself?\n \n Tell me, is that legal?\nDo you mistake me for a pacifist? Self-defense by whatever means is always legal given appropriate threat.\n \n I have no problem with her seeking a CCW. I have never suggested I was against them. With training preferably.\n I still don't think it addresses the policing side of things. Grandma shouldn't have to protect herself.", 
   {}, 
   374983, 
   null, 
   1256059920.0
  ], 
  [
   374987, 
   null, 
   "Tither", 
   "Do you mistake me for a pacifist? Self-defense by whatever means is always legal given appropriate threat.\n\n So you are saying she can carry and use the straight razor on Cleveland Streets? Or LA's?\n \n I see jail time for anyone following your advice.", 
   {}, 
   374986, 
   null, 
   1256060040.0
  ], 
  [
   374988, 
   null, 
   "sinjin", 
   "No because then she'd be morally inferior to one raped and stranged with her pantyhose laying in an alley.\nI'm not sure from where you draw your moral conclusions. I'm not making a morality argument, only a practical one.", 
   {}, 
   374984, 
   null, 
   1256060220.0
  ], 
  [
   374989, 
   null, 
   "sinjin", 
   "So you are saying she can carry and use the straight razor on Cleveland Streets? Or LA's?\n \n I see jail time for anyone following your advice.\nI thought you supported trading a misdemeanor for tactical advantage?\n \n I was kidding at any rate, sort of.", 
   {}, 
   374987, 
   null, 
   1256060340.0
  ], 
  [
   374992, 
   null, 
   "OldSarge", 
   "I'm not sure from where you draw your moral conclusions. I'm not making a morality argument, only a practical one.\n\n \n I can understand that. Forgive me for treading into a subject you know know nothing about.", 
   {}, 
   374988, 
   null, 
   1256061660.0
  ], 
  [
   374993, 
   null, 
   "OldSarge", 
   "I thought you supported trading a misdemeanor for tactical advantage?\n \n I was kidding at any rate, sort of.\n\n \n So we should then take your postings as a joke in future!", 
   {}, 
   374989, 
   null, 
   1256061720.0
  ], 
  [
   375002, 
   null, 
   "NATO 556", 
   "I was kidding at any rate, sort of.\n\n \n Haven't we had discussions about this before? This isn't a subject that should be joked about or discussed lightly. People's lives are on the line here, there's no room for humor.", 
   {}, 
   374989, 
   null, 
   1256063820.0
  ], 
  [
   375010, 
   null, 
   "sinjin", 
   "So we should then take your postings as a joke in future!\nYou may take them as an enema for all I care.", 
   {}, 
   374993, 
   null, 
   1256065140.0
  ], 
  [
   375017, 
   null, 
   "Doc Jones", 
   "You may take them as an enema for all I care.\n\n \n Yep, we just flush you away emoticon_xhoho", 
   {}, 
   375010, 
   null, 
   1256066820.0
  ], 
  [
   375021, 
   null, 
   "OldSarge", 
   "You may take them as an enema for all I care.\n\n Oh your latest kink eh! Your poor taste in humor aside, we do take you as a joke, no insult intended. And as Doc pointed out we flush your sick attempts at humor away.", 
   {}, 
   375010, 
   null, 
   1256067240.0
  ], 
  [
   375032, 
   null, 
   "Doc Jones", 
   "Oh your latest kink eh! Your poor taste in humor aside, we do take you as a joke, no insult intended. And as Doc pointed out we flush your sick attempts at humor away.\n\n \n \n At times it appears he wants to be a boy toy? His solicitations are kind of unbecoming. That may be the norm in kalifornia?", 
   {}, 
   375021, 
   null, 
   1256067900.0
  ], 
  [
   375038, 
   null, 
   "OldSarge", 
   "At times it appears he wants to be a boy toy? His solicitations are kind of unbecoming. That may be the norm in kalifornia?\n\n I believe you are correct. After al the code pinkos did boycott the Marine recruiting in the Birkley hell hole.", 
   {}, 
   375032, 
   null, 
   1256068260.0
  ], 
  [
   375040, 
   null, 
   "sinjin", 
   "You guys need some new material.", 
   {}, 
   375038, 
   null, 
   1256068440.0
  ], 
  [
   375041, 
   null, 
   "Doc Jones", 
   "You guys need some new material.\n\n \n Oh you are providing plenty but hang in there, you are a long term investor :)", 
   {}, 
   375040, 
   null, 
   1256068620.0
  ], 
  [
   375045, 
   null, 
   "sinjin", 
   "Oh you are providing plenty but hang in there, you are a long term investor :)\nI certainly understand your desperate need to justify your contempt. \n \n Sort of a \"...can't be a man cause he doesn't smoke the same cigarettes as me\" kind of wisdom. \n \n More things Horatio...", 
   {}, 
   375041, 
   null, 
   1256070180.0
  ], 
  [
   375051, 
   null, 
   "Doc Jones", 
   "I certainly understand your desperate need to justify your contempt. \n \n Sort of a \"...can't be a man cause he doesn't smoke the same cigarettes as me\" kind of wisdom. \n \n More things Horatio...\n\n \n Bad guess but nice try. I don't smoke nor do I drink alcohol. In my profession it wasn't ethical nor did I care for either one. Even at my age I will probably outlive you :) so don't get your hopes up for attending the reading of the will. emoticon_xangel", 
   {}, 
   375045, 
   null, 
   1256074860.0
  ], 
  [
   375056, 
   null, 
   "Ethmi", 
   "I'm not \"making\" anyone anything. The point is you'll find little support in the US for arming teachers as a precaution against violence on the schoolyard. Even if a teacher has a valid CCW, the school's policy could still deny them the right to carry on campus.\n\n \n It doesn't matter what they think, what matters is what we thing, on this forum. Criminals will be less inclined to attack you if you're carrying a firearm.", 
   {}, 
   374980, 
   null, 
   1256077020.0
  ], 
  [
   375057, 
   null, 
   "OldSarge", 
   "It doesn't matter what they think, what matters is what we thing, on this forum. Criminals will be less inclined to attack you if you're carrying a firearm.\n\n \n Watch out, the spelling god will git you!", 
   {}, 
   375056, 
   null, 
   1256077140.0
  ], 
  [
   375058, 
   null, 
   "Ethmi", 
   "Straight razor might work well. \n\n \n If she strikes first, I suppose.\n \n \nAre you suggesting that every 90 lb woman would do well to \n get used to carrying a pistol with her everywhere?\n\n \n I don't see the problem as long as they don't have mental disorders, drug addictions, or violent criminal records.", 
   {}, 
   374981, 
   null, 
   1256077320.0
  ], 
  [
   375059, 
   null, 
   "Ethmi", 
   "Do you mistake me for a pacifist? Self-defense by whatever means is always legal given appropriate threat.\n \n I have no problem with her seeking a CCW. I have never suggested I was against them. With training preferably.\n I still don't think it addresses the policing side of things. Grandma shouldn't have to protect herself.\n\n \n That's pretty ignorant. To avoid frivolous lawsuits, the police have no obligation to protect you. They do their best to do their job, but you can't depend on them to protect you. A gun you can always count on to be there when you need it.", 
   {}, 
   374986, 
   null, 
   1256077680.0
  ], 
  [
   375060, 
   null, 
   "Doc Jones", 
   "If she strikes first, I suppose.\n \n \n \n I don't see the problem as long as they don't have mental disorders, drug addictions, or violent criminal records.\n\n \n \n I have alzheimer's; I can't remember who I shot last. emoticon_xgood", 
   {}, 
   375058, 
   null, 
   1256077860.0
  ], 
  [
   375069, 
   null, 
   "sinjin", 
   "That's pretty ignorant. To avoid frivolous lawsuits, the police have no obligation to protect you. They do their best to do their job, but you can't depend on them to protect you. A gun you can always count on to be there when you need it.\nI wasn't suggesting we depend on them to protect us. But there might be policing strategies that reduce the likelihood\n of grandma getting attacked in the first place. The police do more than respond to calls.", 
   {}, 
   375059, 
   null, 
   1256081400.0
  ], 
  [
   375071, 
   null, 
   "OldSarge", 
   "I wasn't suggesting we depend on them to protect us. But there might be policing strategies that reduce the likelihood\n of grandma getting attacked in the first place. The police do more than respond to calls.\n\n \n Suggest some slick and run them by your local law enforcement.", 
   {}, 
   375069, 
   null, 
   1256081940.0
  ], 
  [
   375072, 
   null, 
   "sinjin", 
   "Suggest some slick and run them by your local law enforcement.\nI doubt they need my suggestions, Shoddy.", 
   {}, 
   375071, 
   null, 
   1256082060.0
  ], 
  [
   375076, 
   null, 
   "OldSarge", 
   "I doubt they need my suggestions, Shoddy.\n\n \n So what you are saying is you have no clue but you are psoting any how.", 
   {}, 
   375072, 
   null, 
   1256082360.0
  ], 
  [
   375112, 
   null, 
   "zsu2357", 
   "I have alzheimer's; I can't remember who I shot last. emoticon_xgood\n\n \n I think you shot me last time around if I recall.emoticon_xgoodemoticon_confused", 
   {}, 
   375060, 
   null, 
   1256104020.0
  ], 
  [
   375113, 
   null, 
   "zsu2357", 
   "I wasn't suggesting we depend on them to protect us. But there might be policing strategies that reduce the likelihood\n of grandma getting attacked in the first place. The police do more than respond to calls.\n\n \n Like maybe drive by her house or apt.hrly.?\n Call her hrly.?emoticon_frazzled\n Like Sarge says,start suggesting.emoticon_xdonno", 
   {}, 
   375069, 
   null, 
   1256104380.0
  ], 
  [
   375120, 
   null, 
   "Doc Jones", 
   "I think you shot me last time around if I recall.emoticon_xgoodemoticon_confused\n\n \n I suspect a good many monitors and keyboards got cleaned on that one? ;)", 
   {}, 
   375112, 
   null, 
   1256129280.0
  ], 
  [
   375150, 
   null, 
   "zsu2357", 
   "I wasn't suggesting we depend on them to protect us. But there might be policing strategies that reduce the likelihood\n of grandma getting attacked in the first place. The police do more than respond to calls.\n\n \n When you say\"do more\",do you mean like spread thin trying to help more little old ladies, or more paper work on afore mentioned or more time in a donut shop?\n ( lol)\n The police do more what?emoticon_confused", 
   {}, 
   375069, 
   null, 
   1256155920.0
  ], 
  [
   376656, 
   null, 
   "Brady", 
   "The court also ruled that her stabbing her husband to death was excessive and may not be seen as legitimate self-defense. The husband had carried out a violent attack on her, punching her in the face, holding her underwater in the bathtub and strangling her. The wife picked up a knife from the kitchen sink and urged him to stay away. He attacked her again, upon which she stabbed her husband. The husband was immediately taken to the hospital but died the following day. The wife was indicted for injury resulting in death and was sentenced to three years in jail. \n\n If you have to defend yourself you should do it without killing someone.", 
   {}, 
   375150, 
   null, 
   1257286260.0
  ], 
  [
   376657, 
   null, 
   "NATO 556", 
   "If you have to defend yourself you should do it without killing someone.\n\n \n What, and give them the chance to either get back up and kill you, or recover and then sue you through the court system?", 
   {}, 
   376656, 
   null, 
   1257286740.0
  ], 
  [
   376673, 
   null, 
   "Ethmi", 
   "If you have to defend yourself you should do it without killing someone.\n\n \n Agreed. If they have a gun aimed at you, it's time to decide who should shoot first. If you just wound them they'll still be able to shoot. You must learn to value your life and the lives of your family over the life of an attacker. It's not unethical, it's human nature.", 
   {}, 
   376656, 
   null, 
   1257293340.0
  ], 
  [
   376678, 
   null, 
   "NATO 556", 
   "As much as we wish it wasn't, the story is purely a hoax. If it were real the minor's name would never have been released.", 
   {}, 
   376673, 
   null, 
   1257295080.0
  ], 
  [
   376679, 
   null, 
   "sinjin", 
   "As much as we wish it wasn't, the story is purely a hoax. If it were real the minor's name would never have been released.\n11-year-old with shotgun stops invaders-Fiction!\n \n Apparently withdrawn by the offending rumor-monger.", 
   {}, 
   376678, 
   null, 
   1257295740.0
  ], 
  [
   376684, 
   null, 
   "OldSarge", 
   "11-year-old with shotgun stops invaders-Fiction!\n \n Apparently withdrawn by the offending rumor-monger.\n\n \n Other than insult ya got any thing slim? ", 
   {}, 
   376679, 
   null, 
   1257296700.0
  ], 
  [
   376685, 
   null, 
   "sinjin", 
   "Other than insult ya got any thing slim? \nThat depends on whether you've anything more than fabrications for us. \n And let's not forget the links to the stories, please. \n Tall tales especially.:)", 
   {}, 
   376684, 
   null, 
   1257297000.0
  ], 
  [
   376686, 
   null, 
   "OldSarge", 
   "That depends on whether you've anything more than fabrications for us. \n And let's not forget the links to the stories, please. \n Tall tales especially.:)\n\n \n Maybe you could point them out for us? The fabrications that is. ", 
   {}, 
   376685, 
   null, 
   1257297120.0
  ], 
  [
   376692, 
   null, 
   "sinjin", 
   "Maybe you could point them out for us? The fabrications that is. \nYou're just like summer vacation.", 
   {}, 
   376686, 
   null, 
   1257297900.0
  ], 
  [
   376693, 
   null, 
   "Penfold", 
   "His self-respect, among other things you would be unaware of.", 
   {}, 
   376684, 
   null, 
   1257297900.0
  ], 
  [
   376695, 
   null, 
   "OldSarge", 
   "You're just like summer vacation.\n\n \n An admission of letting your alligator mouth overload your rabbit butt I see.", 
   {}, 
   376692, 
   null, 
   1257298260.0
  ], 
  [
   376696, 
   null, 
   "OldSarge", 
   "His self-respect, among other things you would be unaware of.\n\n \n Oh the comic relief is here good for a laff as always.", 
   {}, 
   376693, 
   null, 
   1257298380.0
  ], 
  [
   376704, 
   null, 
   "OldSarge", 
   "Of course slim in your defense you could admit to not being able to tell the difference between truth and fabrication. It's a common failing among denizens of the left you know. ", 
   {}, 
   376696, 
   null, 
   1257302940.0
  ], 
  [
   376705, 
   null, 
   "sinjin", 
   "Of course slim in your defense you could admit to not being able to tell the difference between truth and fabrication. It's a common failing among denizens of the left you know. \nI didn't have any trouble at all telling in this instance. But you knew that. \n Whilst you aren't troubled in the least by posting a fabrication, assuming it flys, except...\n \n No 11 yr. old Patricia Harrington.\n Too bad, so sad.emoticon_cry", 
   {}, 
   376704, 
   null, 
   1257304380.0
  ], 
  [
   376711, 
   null, 
   "OldSarge", 
   "I didn't have any trouble at all telling in this instance. But you knew that. \n Whilst you aren't troubled in the least by posting a fabrication, assuming it flys, except...\n \n No 11 yr. old Patricia Harrington.\n Too bad, so sad.emoticon_cry\n\n \n Of course I got it in an email, but when I checked I found it was in error. So I deleted it. Which shows I knew after the fact it was false. But you on the other hand have trouble finding any that I posted emoticon_xgood. So sad your dad emoticon_cry So the fabrication was not mine. Of course you are free to find some evidence if you can. ", 
   {}, 
   376705, 
   null, 
   1257307620.0
  ], 
  [
   376768, 
   null, 
   "sinjin", 
   "Of course I got it in an email, but when I checked I found it was in error. So I deleted it. Which shows I knew after the fact it was false.\nI know. You might have simply admitted as much in the first place. But instead: \n \n \nMaybe you could point them out for us? The fabrications that is. \nSeriously? Apparently Nato saw the same fig newton I saw.\n \n \nBut you on the other hand have trouble finding any that I posted emoticon_xgood. So sad your dad emoticon_cry So the fabrication was not mine. Of course you are free to find some evidence if you can.\nAnd still. I know you aren't the story's author. Might I suggest you corroborate prior to posting yarns?", 
   {}, 
   376711, 
   null, 
   1257359100.0
  ], 
  [
   376836, 
   null, 
   "OldSarge", 
   "I know. You might have simply admitted as much in the first place. But instead: \n \n Seriously? Apparently Nato saw the same fig newton I saw.\n \n And still. I know you aren't the story's author. Might I suggest you corroborate prior to posting yarns?\n\n \n Nice try slim jim but no cigar. Now the question is why do you attempt to make it look as though the fabrication was done by me? I'd point out that its singular but then the devil's in the details. Just as you corroborated on poor Mr Carpenter knowing about the weasel hole in the CA law that got his family killed by pitchfork boy. We are still waiting for the evidence in that case. We are still waiting for your research and get back to us on another thread. Was that a fabrication on your part? Even Bryan was wanting to see what you turned up. ", 
   {}, 
   376768, 
   null, 
   1257422580.0
  ], 
  [
   376863, 
   null, 
   "sinjin", 
   "Nice try slim jim but no cigar. Now the question is why do you attempt to make it look as though the fabrication was done by me?\nNot done, only passed along without verification. It's okay to wish it were true. Why don't we drop it? \n \n \nJust as you corroborated on poor Mr Carpenter knowing about the weasel hole in the CA law that got his family killed by pitchfork boy. We are still waiting for the evidence in that case.\nHow many times must I admit that Mr. Carpenter may have been ignorant of his rights? \n And what's weaslely about being able to grant your children access to your firearms? \n My point was that Mr. Lott must have read the actual text of the law before writing his article. \n He intentionally misconstrued the requirements of the law because he was desperate to document \n a case where safe storage laws got someone killed. \n \n \nEven Bryan was wanting to see what you turned up.\nI believe Bryan suggested that the numbers we were both interested in might be hard to come by. \n That has proven to be the case. What of it? I do have other more pressing matters as a rule btw. \n I have found nothing as yet. So shoot me.", 
   {}, 
   376836, 
   null, 
   1257446280.0
  ], 
  [
   376904, 
   null, 
   "OldSarge", 
   "Not done, only passed along without verification. It's okay to wish it were true. Why don't we drop it? \n \n How many times must I admit that Mr. Carpenter may have been ignorant of his rights? \n \n\n \n May have? I'd say more likely he was since that part of the law was not required to be posted in gunshops.\n \n I'm not the one who made a federal case out of a simple error that I corrected. \n \n Shoot you and give ammo to the pro slavery crowd, ya got to be kidding.", 
   {}, 
   376863, 
   null, 
   1257465960.0
  ], 
  [
   377074, 
   null, 
   "Bryan", 
   "Not done, only passed along without verification. It's okay to wish it were true. Why don't we drop it? \n \n How many times must I admit that Mr. Carpenter may have been ignorant of his rights? \n And what's weaslely about being able to grant your children access to your firearms? \n My point was that Mr. Lott must have read the actual text of the law before writing his article. \n He intentionally misconstrued the requirements of the law because he was desperate to document \n a case where safe storage laws got someone killed. \n \n I believe Bryan suggested that the numbers we were both interested in might be hard to come by. \n That has proven to be the case. What of it? I do have other more pressing matters as a rule btw. \n I have found nothing as yet. So shoot me.\n\n \n I won't shoot. It's Friday, and I'd rather have a drink. emoticon_xhoho", 
   {
    "unicode_changes_made": true
   }, 
   376863, 
   null, 
   1257536160.0
  ], 
  [
   377086, 
   null, 
   "OldSarge", 
   "I won't shoot. It's Friday, and I'd rather have a drink. emoticon_xhoho\n\n \n Just don't drink and then go shoot! emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   377074, 
   null, 
   1257541080.0
  ], 
  [
   378030, 
   null, 
   "Montanae", 
   "Remember, the likelyhood of this is irrelevant. Imagine you're sitting on your couch one evening when the Newslady says something about a cannibalistic serial killer being on the loose in the local area, and you see a police drawing of his face on the screen. Suddenly, the door is kicked down and you see the same guy in the drawing. Entrails and blood drool from his mouth, and he has a razor-sharp with a twelve inch blade, from which blood drips. You have a 38 Special next to you. You show him the weapon in an attempt to scare him away, but he's not intimidated. There are several things you can try, but when he raises the knife and starts charging, you have mere seconds to react. Would it be just to shoot him? And does thinking of this make me paranoid?\n\n \n \n I am not proud to say that I would probably shoot him with the 38 special. I would not even take the time to show it to him to intimidate him, but I would pick it up, blow his head off, and then call the police and scream murder, of course, after I stashed the gun.\n \n Yes, I think it would be just to shoot him, because he:\n \n \n [*]Entered your property without permission.[*]Knocked your door down[*]Attempted to scare you[*]Charged at you with dangerous weapon, even after you tried to defend yourself[*]And he tried to KILL YOU\n So, I think it's just. I don't think you're paranoid for asking, because so many people would have a different answer, and I hope I answered it justly.", 
   {
    "post_info": {
     "post_title": "In this scenerio..."
    }
   }, 
   374498, 
   null, 
   1258090680.0
  ], 
  [
   378051, 
   null, 
   "Winston Smith", 
   " Remember, the likelyhood of this is irrelevant.Imagine you're sitting on your couch one evening when the Newslady says something about a cannibalistic serial killer being on the loose in the local area, and you see a police drawing of his face on the screen. Suddenly, the door is kicked down and you see the same guy in the drawing. Entrails and blood drool from his mouth, and he has a razor-sharp with a twelve inch blade, from which blood drips. You have a 38 Special next to you. You show him the weapon in an attempt to scare him away, but he's not intimidated. There are several things you can try, but when he raises the knife and starts charging, you have mere seconds to react. Would it be just to shoot him? And does thinking of this make me paranoid?\n\n \n this guy you are talking about, hm.. is he Doc Jones ?\n \n Anyway, a razor-sharp (composite word hmmm... ?) with a twelve inch blade ??\n what's that?\n \n But going back to your question about what could you have done to defend yourself from the urban cannibal, there are several things you could have tried for example :\n \n a) you can wake up and call your mom for help\n b) you can continue with your wet dream of fantasying about killing someone\n c) you can keep your hands above your waist and stroke only your toy gun.\n \n What about this scenario:\n \n (Remember, the likelyhood of this is relevant.)\n \n Imagine you're sitting on your couch one evening when the Newslady says something about your country being invaded out of the blue by an army of soldiers dressed as those star-troopers in Stars Wars &#8212;and with the same awesome weapons&#8212; who are killing everyone in sight after bombing the cities of your country to smithereens. . A drawing of the face of one of the invaders is shown on the screen and you recoil in horror.\n The star troopers are seen advancing street by street kicking doors down and shooting indiscriminately into the houses. Screams and bloodied bodies being left in their wake.\n Suddenly, you realize that they are outside your humble adobe house.\n Bang! The door is kicked in and a dozen guns point to your face.\n &#8220;Suck on this, you dirty filthy Arab&#8221; one of them shouts at you.\n You have no 38 Special next to you. You show him you have no weapons in an attempt to make them go away, but they are not deterred. There are several things you can try, but when they raise their guns and aim at you and your wife and little children, you have mere seconds to react. Would it be just to shoot them, but with what? And does thinking of this makes you paranoid?\n \n Child among civilians killed by U.S.-led coalition forces - CNN.com\n \n \n k14031 :: Sep 16: Mentally disturbed man shot by US forces in Falluja, dying later from injuries :: Iraq Body Count\n \n \n Civilians killed by US troops | World news | The Guardian", 
   {}, 
   374498, 
   null, 
   1258101840.0
  ], 
  [
   378059, 
   null, 
   "Doc Jones", 
   "this guy you are talking about, hm.. is he Doc Jones ?\n \n Anyway, a razor-sharp (composite word hmmm... ?) with a twelve inch blade ??\n what's that?\n \n But going back to your question about what could you have done to defend yourself from the urban cannibal, there are several things you could have tried for example :\n \n a) you can wake up and call your mom for help\n b) you can continue with your wet dream of fantasying about killing someone\n c) you can keep your hands above your waist and stroke only your toy gun.\n \n What about this scenario:\n \n (Remember, the likelyhood of this is relevant.)\n \n Imagine you're sitting on your couch one evening when the Newslady says something about your country being invaded out of the blue by an army of soldiers dressed as those star-troopers in Stars Wars -and with the same awesome weapons- who are killing everyone in sight after bombing the cities of your country to smithereens. . A drawing of the face of one of the invaders is shown on the screen and you recoil in horror.\n The star troopers are seen advancing street by street kicking doors down and shooting indiscriminately into the houses. Screams and bloodied bodies being left in their wake.\n Suddenly, you realize that they are outside your humble adobe house.\n Bang! The door is kicked in and a dozen guns point to your face.\n \"Suck on this, you dirty filthy Arab\" one of them shouts at you.\n You have no 38 Special next to you. You show him you have no weapons in an attempt to make them go away, but they are not deterred. There are several things you can try, but when they raise their guns and aim at you and your wife and little children, you have mere seconds to react. Would it be just to shoot them, but with what? And does thinking of this makes you paranoid?\n \n Child among civilians killed by U.S.-led coalition forces - CNN.com\n \n \n k14031 :: Sep 16: Mentally disturbed man shot by US forces in Falluja, dying later from injuries :: Iraq Body Count\n \n \n Civilians killed by US troops | World news | The Guardian\n\n \n Congrats Raulito, that should get the FBI's attention!", 
   {
    "unicode_changes_made": true
   }, 
   378051, 
   null, 
   1258113420.0
  ], 
  [
   378061, 
   null, 
   "Ethmi", 
   "this guy you are talking about, hm.. is he Doc Jones ?\n \n Anyway, a razor-sharp (composite word hmmm... ?) with a twelve inch blade ??\n what's that?\n \n there are several things you can do :\n \n a) you can wake up and call your mom for help\n b) you can continue with your wet dream of fantasying about killing someone\n c) you can keep your hands above your waist and stroke only your toy gun.\n\n \n I wasn't paying attention and didn't add the word knife. If commented on every mistake you made in your writing, my posts would be five times as long. You don't even capitalize the first letter of sentences half the time, so you really have no room to be a douchebag. I could imagine what a little wuss you'd be in a small, quiet town when you learned that there were loose gun laws. Your hatred for gun owners is equivalent to racism.\n \n Once again you make stupid, asinine comments about gun owners based on your ignorance and hatred.\n \n \nWhat about this scenario:\n \n (Remember, the likelyhood of this is relevant.)\n \n Imagine you're sitting on your couch one evening when the Newslady says something about your country being invaded out of the blue by an army of soldiers dressed as those star-troopers in Stars Wars &#8212;and with the same awesome weapons&#8212; who are killing everyone in sight after bombing the cities of your country to smithereens. . A drawing of the face of one of the invaders is shown on the screen and you recoil in horror.\n The star troopers are seen advancing street by street kicking doors down and shooting indiscriminately into the houses. Screams and bloodied bodies being left in their wake.\n Suddenly, you realize that they are outside your humble adobe house.\n Bang! The door is kicked in and a dozen guns point to your face.\n &#8220;Suck on this, you dirty filthy Arab&#8221; one of them shouts at you.\n You have no 38 Special next to you. You show him you have no weapons in an attempt to make them go away, but they are not deterred. There are several things you can try, but when they raise their guns and aim at you and your wife and little children, you have mere seconds to react. Would it be just to shoot them, but with what? And does thinking of this makes me paranoid?\n\n \n If only everyone in town had a firearm to try and fight them off, huh?\n \n You're not as smart as you think you are, and you're not nearly as impressive. Unlike you, I had a solution to the problem I presented.\n \n \nChild among civilians killed by U.S.-led coalition forces - CNN.com\n \n k14031 :: Sep 16: Mentally disturbed man shot by US forces in Falluja, dying later from injuries :: Iraq Body Count\n \n Civilians killed by US troops | World news | The Guardian\n\n \n I don't deny this. The Army Corps of Engineers has also provided many villages in Iraq and Afghanistan with electricity and running water. For the first time in history, traders in some Iraqi and Afghan villages can get on the internet and sell their products on eBay and amazon, and for many Iraqi and Afghan citizens, life has improved drastically.\n \n Has the Australian military done anything like that? Maybe they would if they'd pay for training for their soldiers rather than fake boobs. Since I don't live in Australia, I don't have to pay for them. :)", 
   {}, 
   378051, 
   null, 
   1258115340.0
  ], 
  [
   378071, 
   null, 
   "Winston Smith", 
   "I don't hate loonies of any kind. I pity them specially gun nuts and I also pity the sane people who live among them.\n \n You say :\n \n \nIf only everyone in town had a firearm to try and fight them off, huh?\n\n \n but you see in my scenario those 'everyone in town\" were Iraqi civilians, so fighting the 'them' would mean fighting and therefore killing American boys.\n Now, you wouldn't that to happen, would you ? emoticon_frazzled", 
   {}, 
   378061, 
   null, 
   1258118460.0
  ], 
  [
   378072, 
   null, 
   "Ethmi", 
   "I don't hate loonies of any kind. I pity them specially gun nuts and I also pity the sane people who live among them.\n\n \n Admit it. You hate them. If you didn't hate us, you wouldn't make such vile, asinine comments about us such as \"They have guns because they have small...\" or \"gun crazy loonies\". You'd also have the understanding to know that gun owners are ordinary people. But you're living in your fantasy world and you can't accept that.\n \n \nYou say :\n \n \n \n but you see in my scenario those 'everyone in town\" were Iraqi civilians, so fighting the 'them' would mean fighting and therefore killing American boys.\n Now, you wouldn't that to happen, would you ? emoticon_frazzled\n\n \n All members of Hamas, Hezzbolloah, Al Queda, and other Jihadist groups are civilians, as they are paramilitary organizations and therefore cannot be defined as soldiers. Being civilian doesn't make them innocent.\n \n Stop living in a fairy tale and realize that in war, innocents always die in the process. War is a terrible thing. So was 9-11.\n \n I also see you didn't have a comment about what our troops have done for Iraqi and Afghan citizens. Is that too inconvinient for you, just like the fact that your government is spending your money on fake boobs for military personell was too inconvinient for you?", 
   {}, 
   378071, 
   null, 
   1258118820.0
  ], 
  [
   378074, 
   null, 
   "Winston Smith", 
   "You're not as smart as you think you are, and you're not nearly as impressive. Unlike you, I had a solution to the problem I presented.\n\n \n Of course I am not as smart as you are, I know I am not smart and all those Iraqi civilians killed in my hypothetical scenario weren&#8217;t either, they died.\n \n You instead solved the problem of dealing with the urban cannibal with the 18&#8221; ? blade or was it a 12&#8221; blade ? Anyway, you solved the problem.\n Of course one question remains, how did you clean up the blood and entrails from the carpet in your living room? Was the carpet ruined? Did you have insurance against entrails and blood stains ?\n I mean, kicking a door in of my house, well, that is not uncommon in Australia, just the other day &#8230; sorry, I am digressing. But what is uncommon is an entrails drooping cannibal kicking the door in etc. To drop blood an entrails in other people living rooms is consider bad, bad manners in Australia.", 
   {}, 
   378072, 
   null, 
   1258119600.0
  ], 
  [
   378075, 
   null, 
   "Ethmi", 
   "Of course I am not as smart as you are, I know I am not smart and all those Iraqi civilians killed in my hypothetical scenario weren't either, they died.\n\n \n Once again, all members of Jihadist organizations are technically civilians.\n \n \nYou admit solved the problem of dealing with the urban cannibal with the 18\" ? blade or was it a 12\" blade. Anyway, you solved the problem.\n Of course one question remains, how did you clean up the blood and entrails from the carpet in your living room? Was the carpet ruined? Did you have insurance against entrails and blood stains ?\n I mean, kicking a door in of my house, well, that is not uncommon in Australia, just the other day ... sorry, I am digressing. But what is uncommon is an entrails drooping cannibal kicking the door in etc. To drop blood an entrails in other people living rooms is consider bad, bad manners in Australia.\n\n \n I'll comment when you have something to say worth commenting on. Some of what you say is fun to mutilate, other stuff is just a waste of bandwidth.", 
   {
    "unicode_changes_made": true
   }, 
   378074, 
   null, 
   1258119840.0
  ], 
  [
   378110, 
   null, 
   "Montanae", 
   "What about due process?\n\n \n What about it? \n \n You do realize that you only use due process, if you are not about to be sliced open and eaten?\n \n How the heck is due process going to stop someone who has already lost his mind?\n \n My due process is loading the gun, giving him one warning, (Which I probably wouldn't even do), and then, if he takes one step forward, blowing his head off.\n \n That's my type of due process.", 
   {
    "post_info": {
     "post_title": "What about it?"
    }
   }, 
   374594, 
   null, 
   1258138500.0
  ], 
  [
   378117, 
   null, 
   "NATO 556", 
   "this guy you are talking about, hm.. is he Doc Jones ?\n\n \n What happened to the board rules about being polite?\n \n \nAnyway, a razor-sharp (composite word hmmm... ?) with a twelve inch blade ??\n what's that?\n\n \n Stop trying to change the subject.\n \n \nBut going back to your question about what could you have done to defend yourself from the urban cannibal, there are several things you could have tried for example :\n \n a) you can wake up and call your mom for help\n b) you can continue with your wet dream of fantasying about killing someone\n c) you can keep your hands above your waist and stroke only your toy gun.\n\n \n Or you could quit being a stupid Aussie.\n \n \nWhat about this scenario:\n \n (Remember, the likelyhood of this is relevant.)\n \n Imagine you're sitting on your couch one evening when the Newslady says something about your country being invaded out of the blue by an army of soldiers dressed as those star-troopers in Stars Wars -and with the same awesome weapons- who are killing everyone in sight after bombing the cities of your country to smithereens. . A drawing of the face of one of the invaders is shown on the screen and you recoil in horror.\n The star troopers are seen advancing street by street kicking doors down and shooting indiscriminately into the houses. Screams and bloodied bodies being left in their wake.\n Suddenly, you realize that they are outside your humble adobe house.\n Bang! The door is kicked in and a dozen guns point to your face.\n \"Suck on this, you dirty filthy Arab\" one of them shouts at you.\n You have no 38 Special next to you. You show him you have no weapons in an attempt to make them go away, but they are not deterred. There are several things you can try, but when they raise their guns and aim at you and your wife and little children, you have mere seconds to react. Would it be just to shoot them, but with what? And does thinking of this makes you paranoid?\n\n \n What about that scenario?\n \n Too bad. This is a declared state of war, there are casualties in war. If the Middle Easterners don't want to become nameless casualties then they should out all the terrorists and make them easy for us to find and terminate.", 
   {
    "unicode_changes_made": true
   }, 
   378051, 
   null, 
   1258139760.0
  ], 
  [
   378119, 
   null, 
   "JPSartre12", 
   "What about it? \n \n You do realize that you only use due process, if you are not about to be sliced open and eaten?\n \n How the heck is due process going to stop someone who has already lost his mind?\n \n My due process is loading the gun, giving him one warning, (Which I probably wouldn't even do), and then, if he takes one step forward, blowing his head off.\n \n That's my type of due process.\n\n \n emoticon_xagreeemoticon_xagree Hard to argue with that logic.", 
   {}, 
   378110, 
   null, 
   1258139940.0
  ], 
  [
   378157, 
   null, 
   "Winston Smith", 
   "\n \n Too bad. This is a declared state of war, there are casualties in war. If the Middle Easterners don't want to become nameless casualties then they should out all the terrorists and make them easy for us to find and terminate.\n\n \n emoticon_xagree The above makes you the instant recipient of the Nobel Prize for imbecility. You really belong in the land of the loonies emoticon_xagree", 
   {}, 
   378117, 
   null, 
   1258156860.0
  ], 
  [
   378161, 
   null, 
   "NATO 556", 
   "You really belong in the land of the loonies\n\n \n No thanks I already left the UK for a more civilized country. A country with a Constitution and protections for the people against the government.\n \n Britain is no place to be anymore, it's no longer a civilized nation. It's quickly falling under Sharia law, muslims running around all over the place, their message of killing everyone who doesn't worship Allah filling the airwaves, etc.", 
   {}, 
   378157, 
   null, 
   1258157220.0
  ], 
  [
   378225, 
   null, 
   "zsu2357", 
   "Were off to see the Wizard the wonderful Wizard Of Oz.\n Ever wonder why they call it Oz?emoticon_rolleyes(Don't take it personal Nozz.)", 
   {
    "post_info": {
     "post_title": "The wizard."
    }
   }, 
   378161, 
   null, 
   1258189500.0
  ], 
  [
   378231, 
   null, 
   "Winston Smith", 
   "No thanks I already left the UK for a more civilized country. A country with a Constitution and protections for the people against the government.\n \n Britain is no place to be anymore, it's no longer a civilized nation. It's quickly falling under Sharia law, muslims running around all over the place, their message of killing everyone who doesn't worship Allah filling the airwaves, etc.\n\n \n \n Britain is not a civilized nation? emoticon_rolleyes\n \n A country with a Constitution and protections for the people against the government? \n \n But, I thought the government under God, was of the people, by the people, for the people, shall not perish from the earth. ...\n so why do you need protection from the people? emoticon_rolleyes\n \n I will recognize your intelligence the day I find it, but so far, I am still searching for it.", 
   {}, 
   378161, 
   null, 
   1258201620.0
  ], 
  [
   378242, 
   null, 
   "OldSarge", 
   "\n \n A country with a Constitution and protections for the people against the government? \n \n But, I thought the government under God, was of the people, by the people, for the people, shall not perish from the earth. ...\n so why do you need protection from the people? emoticon_rolleyes\n \n I will recognize your intelligence the day I find it, but so far, I am still searching for it.\n\n \n Winnie the poo as usual out in left field. That would be a yes. Strange concept for a foreigner isn't it.\n \n As usual you can't recognize a very simple concept. Governments don't need protect. Its the people that need protection from governments. Tortured logic on your part does not mean confusion on my part.\n \n When you resort to insult as you constantly do you have lost the debate. But then you have never really been in it. I doubt you would recognize intelligence if it bit a plug out of you. It is some thing totally foreign to you.", 
   {}, 
   378231, 
   null, 
   1258207920.0
  ], 
  [
   378257, 
   null, 
   "Ethmi", 
   "I know this is way off topic, but Australian censoring isn't fair, Winston. \n \n The Cannibal Corpse album Butchered at Birth is banned from being sold on the public market in Australia, supposedly because the lyrics are too gorey. Yet this guy got to sing the actual lyrics to Rancid Amputation from that album on National Television.\n \n YouTube - Cannibal Corpse Lounge Music\n \n I just felt it'd make it a bit clearer, the original song, which is in an album that is banned in your country. So is Tomb of the Mutilated, which was one of the most popular albums in Death Metal history.\n \n http://www.youtube.com/watch?v=O2C9zEHAk7U", 
   {}, 
   378242, 
   null, 
   1258210620.0
  ], 
  [
   378258, 
   null, 
   "NATO 556", 
   "Britain is not a civilized nation? emoticon_rolleyes\n \n A country with a Constitution and protections for the people against the government?\n\n \n Ask Iangb, he'll tell you that Britain has no Constitution. According to him, they don't need it because they live by a standard of what's in the best interest of the quality of life.", 
   {}, 
   378231, 
   null, 
   1258212720.0
  ], 
  [
   378367, 
   null, 
   "Winston Smith", 
   "and that makes them uncivilzed ? or is it that they are not allowed to own personal weapons of mass destruction ?\n \n By the way a constitution is a set of laws on how a country is governed and that the British have although not codified in a single document as in other countries. So yes, they do have a constitution. \n \n \n \n \nA constitution is a set of laws on how a country is governed. The British Constitution is unwritten in one single document, unlike the constitution in America or the proposed European Constitution, and as such, is referred to as an uncodified constitution in the sense that there is no single document that can be classed as Britain's constitution. The British Constitution can be found in a variety of documents. Supporters of our constitution believe that the current way allows for flexibility and change to occur without too many problems. Those who want a written constitution believe that it should be codified so that the public as a whole has access to it - as opposed to just constitutional experts who know where to look and how to interpret it.\n \n Amendments to Britain's unwritten constitution are made the same way - by a simply majority support in both Houses of Parliament to be followed by the Royal Assent.\n \n The British Constitution comes from a variety of sources. The main ones are:\n \n Statutes such as the Magna Carta of 1215 and the Act of Settlement of 1701.\n Laws and Customs of Parliament; political conventions\n Case law; constitutional matters decided in a court of law\n Constitutional experts who have written on the subject such as Walter Bagehot and A.V Dicey. \n There are two basic principles to the British Constitution:\n \n The Rule of Law The Supremacy of Parliament \n\n \n \n The British Constitution", 
   {
    "unicode_changes_made": true
   }, 
   378258, 
   null, 
   1258284600.0
  ], 
  [
   378381, 
   null, 
   "OldSarge", 
   "and that makes them uncivilzed ? or is it that they are not allowed to own personal weapons of mass destruction ?\n \n By the way a constitution is a set of laws on how a country is governed and that the British have although not codified in a single document as in other countries. So yes, they do have a constitution. \n \n The British Constitution\n\n \n Reading is not your strong point I see. \n \n Amendments to Britain's unwritten constitution are made the same way - by a simply majority support in both Houses of Parliament to be followed by the Royal Assent.\n \n ", 
   {
    "unicode_changes_made": true
   }, 
   378367, 
   null, 
   1258293900.0
  ], 
  [
   378441, 
   null, 
   "Winston Smith", 
   "the parts of the consitution which are unwritten, not all of the constitution is unwritten. \n \n \nThe British Constitution is unwritten in one single document, unlike the constitution in America or the proposed European Constitution, and as such, is referred to as an uncodified constitution in the sense that there is no single document that can be classed as Britain's constitution. The British Constitution can be found in a variety of documents\n. \n \n maybe the ammo has gone to your brains and the lead has really affected you gun loonies, for there is no much sign of intelligence in any of you.\n you can't even understand what you read.\n On the other hand your gun fetishism probably started at an early age so you were born this way, emoticon_xdonno", 
   {}, 
   378381, 
   null, 
   1258324980.0
  ], 
  [
   378445, 
   null, 
   "NATO 556", 
   "the parts of the consitution which are unwritten, not all of the constitution is unwritten.\n\n \n So Iangb is lying?\n \n \nmaybe the ammo has gone to your brains and the lead has really affected you gun loonies, for there is no much sign of intelligence in any of you.\n\n \n That would be the fault of you rather than us. Everyone knows a small mind can't see what's beyond it's comprehension level.\n \n \nyou can't even understand what you read.\n On the other hand your gun fetishism probably started at an early age so you were born this way\n\n \n How's that nine hour police response time working out for you? Lost any friends to machete violence yet? Seen any of your neighbors dragged off to prison for owning an unregistered toy gun?", 
   {}, 
   378441, 
   null, 
   1258325460.0
  ], 
  [
   378467, 
   null, 
   "OldSarge", 
   "the parts of the consitution which are unwritten, not all of the constitution is unwritten. \n \n . \n \n maybe the ammo has gone to your brains and the lead has really affected you gun loonies, for there is no much sign of intelligence in any of you.\n you can't even understand what you read.\n On the other hand your gun fetishism probably started at an early age so you were born this way, emoticon_xdonno\n\n \n Well it certainly helps to have that blank sheet of paper encased in lucite labed constitution now doesn't it? \n \n Maybe it was fetal alcohol syndrome or ingesting paint chips winnie the poo. Or a sucession of abusive \"dads.\" Or maybe just born stupid, who knows. You are entertaining tho. We understand fine. Its you that has the comprehension problem. Maybe from touching yourself too much? ", 
   {}, 
   378441, 
   null, 
   1258329420.0
  ], 
  [
   378538, 
   null, 
   "Penfold", 
   "So Iangb is lying?\n \n That would be the fault of you rather than us. Everyone knows a small mind can't see what's beyond it's comprehension level. ...... \n\n \n \n Asked and answered your own question. You didn't get it in the first place....", 
   {}, 
   378445, 
   null, 
   1258380780.0
  ], 
  [
   378539, 
   null, 
   "OldSarge", 
   "Asked and answered your own question. You didn't get it in the first place....\n\n \n And here's Moe, cue laff track!", 
   {}, 
   378538, 
   null, 
   1258380960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is it ever just to shoot someone?", 
  "url": "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13458, 
  "discussion_files": [
   [
    "24379.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-print.html"
   ], 
   [
    "24380.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-9-print.html"
   ], 
   [
    "24381.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-7-print.html"
   ], 
   [
    "24382.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-5-print.html"
   ], 
   [
    "24383.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-4-print.html"
   ], 
   [
    "24384.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-6-print.html"
   ], 
   [
    "24385.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-8-print.html"
   ], 
   [
    "24386.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-3-print.html"
   ], 
   [
    "24387.html", 
    "http://www.4forums.com/political/gun-control-debates/13458-ever-just-shoot-someone-2-print.html"
   ]
  ], 
  "identifier": 13458
 }
]