[
 [
  [
   374941, 
   null, 
   "Galileo", 
   "I'm making this post in response to people who have argued that gun control is inherently racist. Perhaps by examining examples of early gun control we can better evaluate such a claim. I use two sources. My point is not to argue which person's interpretation of the Second Amendment is better. It is only to find examples of the power that government exercised over arms in early America. \n \n Robert H. Churchill\n -In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n \n -Almost thirty years ago, Edmund Morgan observed that white Virginians excluded African-Americans, Indians, and indentured servants from the body politic and denied them the most fundamental of rights. In 1998, Michael Bellesiles applied this observation to the issue of gun ownership, demonstrating that most colonial jurisdictions denied these groups the right to keep weapons.\n \n - When called upon by the Continental Congress to disarm non-associators, legislatures enacted a series of measures that ordered the disarmament of those refusing to take up arms against the king.\n \n -Pennsylvania's Test Act of 1777 marks the return to voluntary allegiance as the standard of membership in the body politic. It required all white men over eighteen to swear an oath declaring allegiance to the commonwealth, abjuring all allegiance to the British monarchy, and promising to do nothing injurious to the freedom and independence of the state. The act prohibited those refusing the test from voting, holding office, serving on juries, suing, and transferring land. It also ordered them disarmed.\n \n - Maryland instituted a test oath in 1777 and barred those refusing from the basic civil liberties of voting, holding office, serving on juries, suing, and keeping arms.\n \n - North Carolina followed suit, barring non-testors from basic liberties including the keeping of arms while promising that any who relented would be \"held and deemed a good subject of this state, and shall enjoy the privileges thereof.\"\n \n - Early American militia laws prohibited any use of guns on the day of muster unless expressly ordered by militia officers. They also required militiamen and other householders to bring their guns to the muster field twice a year so that militia officers could record which men in the community owned guns. Some colonies authorized door-to-door surveys of gun ownership.\n \n - Colonial governments expressed particular concern over the firing of guns after dark, in part because the traditional method of raising the alarm of an attack after dark involved the firing of several guns in succession. Thus, an amendment to New Hampshire's militia law prohibited the firing of guns after sunset during \"time of war or watch.\" Connecticut and Georgia enacted similar measures.\n \n - By 1770, the shooting of guns was prohibited in the cities of Philadelphia, New York, and Boston. The colonies of Pennsylvania and New York extended this prohibition to all other towns and boroughs. Delaware also prohibited the firing of guns within built-up areas, but made an exception for \"days of public rejoicing.\" \n \n - Rhode Island banned the placement of shooting ranges lying across a public highway. Pennsylvania banned gunfire \"on or near any of the King's highways.\" The legislature noted, however, that the fine did not extend \"to any person carrying a gun on the public highway.\" New Jersey also explicitly protected the carrying of guns on the highways.\n \n - Massachusetts regulated the manner of keeping arms as well as the manner of using them. As a precaution against the accidental wounding of firefighters, the state prohibited the storage of loaded guns in any house within the town of Boston. At least some of these laws, including the prohibition of storing loaded guns in Boston, provided for the confiscation of the gun as penalty. North Carolina and New Jersey both acted to prevent trespasses by hunters and to preserve their game populations by levying steep fines for abusive hunting practices. Each colony also provided that hunters without a \"settled habitation\" or residence in the colony would forfeit their guns.\n Robert H. Churchill | Forum: Rethinking the Second Amendment: Gun Regulation, the Police Power, and the Right to Keep Arms in Early America: The Legal Context of the Second Amendment | Law and History Review, 25.1 | The History Cooperative\n \n Michael Bellesiles\n -It seems almost too obvious to point out that the Second Amendment did nothing to prevent the various states from disarming those perceived as dangerous to public safety and passing laws forbidding the possession of guns by these people. Thus every Southern state not only forbade slaves from carrying firearms, but also outlawed the ownership of guns by free blacks.\n \n -Congress retained tight control over the sale of firearms and ammunition to the Indians, again needing no further justification than public safety. The Indian Intercourse Act of 1834 placed strict limitations on those selling any kind of arms to Indiansand required a federal license to enter into the Indian trade.\n \n -Louisiana&#8217;s 1813 act outlawing the carrying of concealed firearms allowed police officers to stop and search anyone suspected of carrying a concealed weapon.335 Several state constitutions forbade noncitizens from possessing firearms.336 This fear of concealed weapons accelerated in the 1830s as pistols became smaller. In 1832 Illinois instituted $100 fine for anyone caught carrying &#8220;upon him any pistol, gun, knife, bludgeon, or other offensive weapon.&#8221;\n http://www.saf.org/LawReviews/bellesilesChicago.htm", 
   {
    "post_info": {
     "post_title": "Gun Control in Early America"
    }
   }, 
   null, 
   null, 
   1256032680.0
  ], 
  [
   374947, 
   null, 
   "Doc Jones", 
   "I'm making this post in response to people who have argued that gun control is inherently racist. Perhaps by examining examples of early gun control we can better evaluate such a claim. I use two sources. My point is not to argue which person's interpretation of the Second Amendment is better. It is only to find examples of the power that government exercised over arms in early America. \n \n Robert H. Churchill\n -In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n \n -Almost thirty years ago, Edmund Morgan observed that white Virginians excluded African-Americans, Indians, and indentured servants from the body politic and denied them the most fundamental of rights. In 1998, Michael Bellesiles applied this observation to the issue of gun ownership, demonstrating that most colonial jurisdictions denied these groups the right to keep weapons.\n \n - When called upon by the Continental Congress to disarm non-associators, legislatures enacted a series of measures that ordered the disarmament of those refusing to take up arms against the king.\n \n -Pennsylvania's Test Act of 1777 marks the return to voluntary allegiance as the standard of membership in the body politic. It required all white men over eighteen to swear an oath declaring allegiance to the commonwealth, abjuring all allegiance to the British monarchy, and promising to do nothing injurious to the freedom and independence of the state. The act prohibited those refusing the test from voting, holding office, serving on juries, suing, and transferring land. It also ordered them disarmed.\n \n - Maryland instituted a test oath in 1777 and barred those refusing from the basic civil liberties of voting, holding office, serving on juries, suing, and keeping arms.\n \n - North Carolina followed suit, barring non-testors from basic liberties including the keeping of arms while promising that any who relented would be \"held and deemed a good subject of this state, and shall enjoy the privileges thereof.\"\n \n - Early American militia laws prohibited any use of guns on the day of muster unless expressly ordered by militia officers. They also required militiamen and other householders to bring their guns to the muster field twice a year so that militia officers could record which men in the community owned guns. Some colonies authorized door-to-door surveys of gun ownership.\n \n - Colonial governments expressed particular concern over the firing of guns after dark, in part because the traditional method of raising the alarm of an attack after dark involved the firing of several guns in succession. Thus, an amendment to New Hampshire's militia law prohibited the firing of guns after sunset during \"time of war or watch.\" Connecticut and Georgia enacted similar measures.\n \n - By 1770, the shooting of guns was prohibited in the cities of Philadelphia, New York, and Boston. The colonies of Pennsylvania and New York extended this prohibition to all other towns and boroughs. Delaware also prohibited the firing of guns within built-up areas, but made an exception for \"days of public rejoicing.\" \n \n - Rhode Island banned the placement of shooting ranges lying across a public highway. Pennsylvania banned gunfire \"on or near any of the King's highways.\" The legislature noted, however, that the fine did not extend \"to any person carrying a gun on the public highway.\" New Jersey also explicitly protected the carrying of guns on the highways.\n \n - Massachusetts regulated the manner of keeping arms as well as the manner of using them. As a precaution against the accidental wounding of firefighters, the state prohibited the storage of loaded guns in any house within the town of Boston. At least some of these laws, including the prohibition of storing loaded guns in Boston, provided for the confiscation of the gun as penalty. North Carolina and New Jersey both acted to prevent trespasses by hunters and to preserve their game populations by levying steep fines for abusive hunting practices. Each colony also provided that hunters without a \"settled habitation\" or residence in the colony would forfeit their guns.\n Robert H. Churchill | Forum: Rethinking the Second Amendment: Gun Regulation, the Police Power, and the Right to Keep Arms in Early America: The Legal Context of the Second Amendment | Law and History Review, 25.1 | The History Cooperative\n \n Michael Bellesiles\n -It seems almost too obvious to point out that the Second Amendment did nothing to prevent the various states from disarming those perceived as dangerous to public safety and passing laws forbidding the possession of guns by these people. Thus every Southern state not only forbade slaves from carrying firearms, but also outlawed the ownership of guns by free blacks.\n \n -Congress retained tight control over the sale of firearms and ammunition to the Indians, again needing no further justification than public safety. The Indian Intercourse Act of 1834 placed strict limitations on those selling any kind of arms to Indiansand required a federal license to enter into the Indian trade.\n \n -Louisiana's 1813 act outlawing the carrying of concealed firearms allowed police officers to stop and search anyone suspected of carrying a concealed weapon.335 Several state constitutions forbade noncitizens from possessing firearms.336 This fear of concealed weapons accelerated in the 1830s as pistols became smaller. In 1832 Illinois instituted $100 fine for anyone caught carrying \"upon him any pistol, gun, knife, bludgeon, or other offensive weapon.\"\n Chicago-Kent Law Review\n\n \n Without any further ado, post the backgrounds and profile on your two \"sources\" and a brief thesis on why either one is creditable or their views are even worthy of discussion. :xcensored", 
   {
    "unicode_changes_made": true
   }, 
   374941, 
   null, 
   1256037540.0
  ], 
  [
   374965, 
   null, 
   "OldSarge", 
   "Without any further ado, post the backgrounds and profile on your two \"sources\" and a brief thesis on why either one is creditable or their views are even worthy of discussion. :xcensored\n\n \n Michael A. Bellesiles has been so thoroughly discredited that any attempt to use him or his \"work\" is in the fiction classification.\n \n From the desk of Jane Galt:\n \n So Michael Bellesiles has resigned, and it's hard to read the findings of the investigating committee without feeling a wave of compassion. If you've ever read academic reviews, this finding is the professorial equivalent of running around the quad shrieking \"He's a big, fat liar!\"\n \n This was the right result. The review process worked, although obviously much, much less quickly than it should have -- the finding goes out of it's way to spank the journal where Bellesiles work on guns was first published, asking why no editor had thought to ask that Bellesiles supply the basic information needed to understand his tables. This is the professorial equivalent of giving them the fish eye and saying, \"So, you guys just publish anything any XXXXX hands you? Or aren't you bright enough to read the little numbers in the boxes?\"\n \n It's instructive, though, that it took too much publicity to get the right result. Happy as we are that the integrity of the profession of history has been upheld, it's troubling that absent publicity, it probably would have taken 20 years or more for the record to be set straight. During that time, Bellesiles' work would have been incorporated into court cases, public policy, and the minds of millions of people . . . damage that would probably continue long after professional historians knew the work to be false. This tendency is apparent in almost every profession, particularly cloistered ones like academia, medicine, and police work, where practicioners tend to feel that it is \"us\" against \"them\", and when one of our own screws up, it's better to circle the wagons and protect him than risk one of \"them\" finding out that we aren't perfect. This should be a wake-up call to academics everywhere -- but of course, it won't be.\n \n It's also instructive that Bellesiles thought he could get away with it. A friend has a theory that Bellesiles, like the guy at Bell Labs, wasn't in it for self-aggrandizement, exactly, but is just a compulsive liar. He got such a high from putting one over that he simply couldn't stop, even though the longer he went on, the more likely it was that he would be discovered. Another friend, an academic, thinks it more probable that Bellesiles really believed that he could get away with it. And of course if he had, the rewards were astronomical. Being the TV historian for gun issues . . . the lecture circuit. . . the prestigious prizes . . . [here I interject the opinion of an anonymous emailer, a graduate student in history, that the most embarassing thing about all of this is the famous historians trying to save face by claiming that the book was a towering work that would have gotten the Bancroft even without the probate records, indeed even had the subject not been so controversial: \"the rest of the book, at least the parts that aren't misrepresented, is a trivial recount of explosive new facts that have been well known to professional historians for a hundred years\"] . . . and indeed, it's hard to ignore the fact that Bellesiles became very famous for contradicting commonly accepted views of historical gun rights, even before his data was challenged. It seems likely that he picked his topic with that end in mind -- it's hard to imagine the New York Times devoting that much space to a shattering new interpretation of, say, early 19th century tariff laws.\n \n So one can say he tried to lie his way to fame and fortune, and got a much-deserved comeuppance. And yet, I feel sorry for him. Just as I feel sorry for Monica Lewinsky and everyone else who sought fame and fortune, and found it in very public humiliation. We've all had the feeling, I imagine, of not being quite able to make it. We've all been tempted to push the envelope, go out on a limb, do something maybe not quite right just to put ourselves over the top. Thank God we didn't. We found a job or a field where we were more qualified, or we learned to compensate, or we accepted that we weren't ever going to win the Nobel Prize. But is it really so hard to imagine yourself taking that first step -- making up a couple entries in a table, maybe, to make your case look a little better? And when no one caught it, to make up a little more, so your case was really dazzling? And when people responded by showering you with praise for your results, is it hard to imagine how intense the pressure must have been to keep serving them up? People on HNN have been jumping all over a history professor for suggesting that this is a tragedy for Bellesiles -- that the peer review system served him as badly as it served us -- but really, couldn't we have saved ourselves a lot of grief by catching this the first time? Bellesiles might have been spanked and sent back to do better research, instead of rewarded in a way that demanded he produce ever more outlandish results. And how hard is it to imagine the hell he has been living in over the past few years, desperately lying to cover his previous lies, breathing a little easier as the questions receded for a time. . . but then the noose inevitably closing in? He didn't behave well, and he doesn't deserve mercy. But when we see a man destroy himself by inches, I hope we can muster up some compassion. His life is effectively over. He will never work again in his chosen field. He will never publish again. He stands revealed to everyone whose opinion ever mattered to him as a liar and a fraud. Frankly, I find it hard to imagine what he will do, since professors rarely have a lot of money, and their skills are somewhat rarified. Most of the professors I've worked for couldn't even type or file well enough to work in an office.\n \n \n Emory University News Release - bellesiles\n MichaelXBellesiles | February 2003 OAH Newsletter\n http://www.discoverthenetworks.org/individualProfile.asp?indid=1026\n Could Bellesiles's Problems Undermine Gun Control?\n http://www.emory.edu/news/Releases/Final_Report.pdf\n Part 13 Michael A. Bellesiles: Mega Anti-Gun-Nut\n Part 4 Michael A. Bellesiles: Mega Anti-Gun-Nut\n Michael Bellesiles Can&#8217;t Stop Lying | Skepticism.Net\n Michael Bellesiles Is PC", 
   {
    "post_info": {
     "post_title": "One"
    }
   }, 
   374947, 
   null, 
   1256048820.0
  ], 
  [
   374968, 
   null, 
   "Tither", 
   "Gun control is all a scam, on the Constitution and the law-abiding!", 
   {}, 
   374965, 
   null, 
   1256049720.0
  ], 
  [
   375127, 
   null, 
   "Galileo", 
   "Without any further ado, post the backgrounds and profile on your two \"sources\" and a brief thesis on why either one is creditable or their views are even worthy of discussion. :xcensored\n\n My focus is not on their views but on the specific examples of government power over arms in early America. If you think articles about historical matters written by people who have doctorates in history can't be taken seriously then I shudder to think about which sources you use to learn about history.", 
   {}, 
   374947, 
   null, 
   1256137140.0
  ], 
  [
   375128, 
   null, 
   "Doc Jones", 
   "My focus is not on their views but on the specific examples of government power over arms in early America. If you think articles about historical matters written by people who have doctorates in history can't be taken seriously then I shudder to think about which sources you use to learn about history.\n\n \n Posting a proven liar's thoughts about altering history is not history. You don't read links either. You just jump in and spam the board and leave. You aren't interested in the truty, you just want to spread your particular propaganda for the day so: :xcensored", 
   {}, 
   375127, 
   null, 
   1256137860.0
  ], 
  [
   375131, 
   null, 
   "PeterV", 
   "If they regulated guns that much back then I don't think the founding fathers would disapprove of gun control now especially since modern guns are more powerful.", 
   {}, 
   375128, 
   null, 
   1256139000.0
  ], 
  [
   375133, 
   null, 
   "Doc Jones", 
   "If they regulated guns that much back then I don't think the founding fathers would disapprove of gun control now especially since modern guns are more powerful.\n\n \n Who is going to control a right? and exactly where is those powers to act found?\n \n Walter E. Williams : American Idea - Townhall.com", 
   {}, 
   375131, 
   null, 
   1256140140.0
  ], 
  [
   375135, 
   null, 
   "Tither", 
   " If you think articles about historical matters written by people who have doctorates in history can't be taken seriously then I shudder to think about which sources you use to learn about history.\n\n More to the point. They are gun haters. They have an agenda, and that agenda is to persecute, I mean rewrite history about the 2nd Amendment. \n \n Lets apply the smell test to what you are peddling! The Revolutionary War started when the Government came to both Lexington and Concord to seize the powder stores, seizing weapons along the way. If they were willing to fight and die to stop the Most Powerful Army the World had ever known in order to prevent them, what might they be willing to do in order to stop you, and what you have in mind for us? emoticon_smile\n \n Our Founders distrusted government, That is absolutely clear. Even the very government they were in the process of creating. Part of that distrust is recorded here in the Federalist's attempt to sell the new Constitution. \n   Federalist No. 28 -- Alexander Hamilton \n If the representatives of the people betray their constituents, there is then no resource left but in the exertion of that \n  original right of self-defense \n which is paramount to all positive forms of government, and which against the usurpations of the national rulers, may be exerted with infinitely better prospect of success than against those of the rulers of an individual state. \n In a single state, if the persons intrusted with supreme power become usurpers, the different parcels, subdivisions, or districts of which it consists, having no distinct government in each, can take no regular measures for defense. \n  The citizens must rush tumultuously to arms, without concert, without system, without resource; except in their courage and despair. \n The usurpers, clothed with the forms of legal authority, can too often crush the opposition in embryo.\n \n The obstacles to usurpation and the facilities of resistance increase with the increased extent of the state, provided the citizens understand their rights and are disposed to defend them. The natural strength of the people in a large community, in proportion to the artificial strength of the government, is greater than in a small, and of course more competent to a struggle with the attempts of the government to establish a tyranny. \n\n Alexander Hamilton contending that the the Bill of Rights was unnecessary because our rights were Inalienable Rights.  Federalist Papers no. 84 \n I go further, and affirm that bills of rights, in the sense and in the extent in which they are contended for, are not only unnecessary in the proposed constitution, but would even be dangerous. They would contain various exceptions to powers which are not granted; and on this very account, would afford a colourable pretext to claim more than were granted. For why declare that things shall not be done which there is no power to do? Why for instance, should it be said, that the liberty of the press shall not be restrained, when no power is given by which restrictions may be imposed? I will not contend that such a provision would confer a regulating power; but it is evident that it would furnish, to men disposed to usurp, a plausible pretence for claiming that power.\"\n\n and here in the   Preamble Bill of Rights \n THE Conventions of a number of the States having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best insure the beneficent ends of its institution \n\n or here at our National Archives.\n  The Bill Of Rights ~ The First Ten Amendments to the Constitution -- i Alexander Hamilton 1775\n The Sacred Rights of Mankind are not to be rummaged for among old parchment,. or musty records. They are written with a sun beam in whole volume of human nature, by the hand of the divinity itself, \n and can never be erased or obscured by mortal power. \n\n Which you now want to claim that the government can now do! emoticon_smile", 
   {}, 
   375127, 
   null, 
   1256141760.0
  ], 
  [
   375141, 
   null, 
   "NATO 556", 
   "If they regulated guns that much back then I don't think the founding fathers would disapprove of gun control now especially since modern guns are more powerful.\n\n \n The first part of your argument is completely nonsensical at best. The second part is even worse; the \"more powerful\" argument holds no water. It's an attempt to confuse the issue. It's no different than suggesting the 4th Amendment shouldn't apply to cellphones and computers.", 
   {}, 
   375131, 
   null, 
   1256151180.0
  ], 
  [
   375146, 
   null, 
   "Bryan", 
   "I have argued that gun control has been used as a tool of racism&#8212;but I have never argued that it is inherently racist. It has not been the exclusive tool of racists, as the post which started this thread admits. Still, the majority of the examples cited are of gun control being used to disenfranchise selected groups. \n \n Churchill&#8217;s citation from Edmund Morgan was an example of gun control being used to promote racism. The test oath examples he cites from Pennsylvania, Maryland, and North Carolina are all examples gun control being used as a tool of majority oppression of a different sort&#8212;in these cases oppression of those holding a minority political view (Monarchism). \n \n Bellesiles (assuming he is any more believable here than in the past) cites examples of gun control being use to promote a racist agenda against slaves, freed blacks, and Native Americans.\n \n If gun control in the abstract is race neutral, then surely these examples demonstrate how often even in American it has been used by those in power as a tool to oppress others because they are of a different race or because they happen to hold an opposing political view.\n \n True, other examples of restrictions are cited which are race and political view neutral, but I have never argued that no restrictions existed on the right at the time of the nation&#8217;s founding&#8212;nor do I advocate this should be the case today.", 
   {}, 
   374941, 
   null, 
   1256153880.0
  ], 
  [
   375148, 
   null, 
   "Galileo", 
   "More to the point. They are gun haters. They have an agenda, and that agenda is to persecute, I mean rewrite history about the 2nd Amendment.\n\n Actually, the majority of my first post in this thread came from Robert H. Churchill's article who is an advocate of the individual rights interpretation.", 
   {}, 
   375135, 
   null, 
   1256154840.0
  ], 
  [
   375149, 
   null, 
   "Galileo", 
   "If they regulated guns that much back then I don't think the founding fathers would disapprove of gun control now especially since modern guns are more powerful.\n\n I think this is why people like Paul Helmke think that Supreme Court rulings on the constitutionality of gun control laws are win/win situations for his side. He realizes that an individual rights interpretation or a ruling that the states are bound by the Second Amendment could still leave the door open for plenty of gun control.", 
   {}, 
   375131, 
   null, 
   1256155380.0
  ], 
  [
   375151, 
   null, 
   "Tither", 
   "Well with 20 to 30 thousand gun laws on the books and all of this Federal stuff, I think the point is moot.\n \n Recent Federal Laws.\n 1.Brady background checks for all handgun buyers, \n 2.institution of the waiting period,\n 3. Making it illegal for anyone under 18 to own or even possess a handgun.\n 4. The President's executive order stopping the importation of many guns,\n 5. Excessive fees and regulations that drove many legitimate gun shop owners out of business.\n 6. The widening of Brady to include background checks from just handguns to include all new firearm purchases. \n 7. Insta Check! \n 8. Additional disqualification's and changes to legal firearms purchases on form 4473, \n 9. The assault weapons ban. Sunset\n 10. The ten round magazine, Sunset\n 11 Lautenburg.\n 12 and just recently the NICS improvement act!\n \n And let me also point out that people here are not calling for the end to gun laws either, yet we are somehow the radicals? What we are saying is Stop abusing a Right that our founders called Inalienable! It is not yours to take nor is it ours to give. It belongs to all of our future generations too! \n \n What The Supreme Court will do is put a limit on what abuses can be inflected on our Bill of Rights, as there seems to be absolutely nothing that was out of bounds before!\n \n Not to say that I wouldn't like to see some of the 20 to 30 thousand infringements fall! Chicago's and N.Y.'s handgun bans being just one of them.", 
   {}, 
   375149, 
   null, 
   1256158440.0
  ], 
  [
   375152, 
   null, 
   "OldSarge", 
   "My focus is not on their views but on the specific examples of government power over arms in early America. If you think articles about historical matters written by people who have doctorates in history can't be taken seriously then I shudder to think about which sources you use to learn about history.\n\n \n In the Bellesiles case his was all but revoked since he was proven to twist quotes into what wasn't said to support his claim. He was caught with false research that he never did. When caught he made up more lies to cover his lack of truth and integrity. His publisher stopped publishing his fiction. The Bancroft prize was revoked. He was allowed to resign from Emory before they got up the guts to do the right thing and fire him. So you picked a rather poor example of person holding a doctorate. Going to leftist university does not make you smart nor knowledgeable. Since in the Bellesiles case he was not smart enough to realize he would be caught in his fiction and distortion. He was so arrogant that he tried to play the victim card after getting caught in his lies and distortions. What he and other leftist doctorates do is revise history to support their themes and ideas. I'll take the truth any day from a well read uneducated person any day over your turds.", 
   {}, 
   375127, 
   null, 
   1256159760.0
  ], 
  [
   375155, 
   null, 
   "Tither", 
   "Finding that Early Americans had some safety laws, does not exactly equal what we think of as gun control. Although I sincerely think you hope others will. \n \n For instance, in Heller, Justice Souter mentioned that one was not allowed to keep Black Powder in their homes, over a curtain amount, and he called that gun control! It is not.\n \n Black Power is an explosive, and it was for fire safety and neighborhood safety reasons that this regulation was in place. A fire in a place with 20 lbs of black powder could take down a whole block, by explosion and fire. \n \n That is why the British went to both Concord and Lexington to seize the Power Stores. It is an explosive, so people followed safety precautions. \n \n Today's gun powder in not an explosive. It creates a large amount of gas, which pushes the bullet down the barrel quickly, for its power. \n \n Actual Gun control is considered keeping people from possessing weapons, or creating conditions for ownership. Like handguns and such.\n \n Your details of Militia captains doing quarter mastering of men and materials is not gun control, no matter how bad you wish to turn that into gun registration! emoticon_smile \n \n It is under this understanding that I offer Clayton E. Cramer's (A black man's) work on the   The Racist Roots of Gun Control  He details everything one would want to know in these pages.", 
   {}, 
   375152, 
   null, 
   1256163240.0
  ], 
  [
   375160, 
   null, 
   "NATO 556", 
   "I think this is why people like Paul Helmke think that Supreme Court rulings on the constitutionality of gun control laws are win/win situations for his side. He realizes that an individual rights interpretation or a ruling that the states are bound by the Second Amendment could still leave the door open for plenty of gun control.\n\n \n Don't get too confident. The individual rights interpretation is going to leave absolutely no room for the kinds of gun control you want. Coupled with the Heller ruling, which forbids restrictions on modern weaponry, you won't have any ground for bans on .50 caliber rifles \"assault weapons\", magazine size limitations, prohibiting the possession of firearms on city owned or leased property, ammo serialization, gun rationing schemes, or anything else along those lines.", 
   {}, 
   375149, 
   null, 
   1256165700.0
  ], 
  [
   375212, 
   null, 
   "PeterV", 
   "The first part of your argument is completely nonsensical at best. The second part is even worse; the \"more powerful\" argument holds no water. It's an attempt to confuse the issue. It's no different than suggesting the 4th Amendment shouldn't apply to cellphones and computers.\n\n I think the 2nd Amendment does apply to modern guns. That's why I'm against gun bans. All I'm saying is that modern guns are more powerful and more dangerous so they should be controlled and regulated more.", 
   {}, 
   375141, 
   null, 
   1256219820.0
  ], 
  [
   375213, 
   null, 
   "OldSarge", 
   "I think the 2nd Amendment does apply to modern guns. That's why I'm against gun bans. All I'm saying is that modern guns are more powerful and more dangerous so they should be controlled and regulated more.\n\n \n You have a specious arguement at best probably caused by not being educated enough on the subject. You are just as dead or wounded no matter if the firearm is a modern high powered rifle or a flintlock smooth bore musket. It is not the tool that does the damage. Its the hand that wields it. The major problem with your argument is when is enough, enough? For the controller regulator the answer is never until you have a UK or Japan. When a right is controlled or regulated it is no longer a right. It has become a privilige subject to the whim of petty bureaucrats. ", 
   {}, 
   375212, 
   null, 
   1256220360.0
  ], 
  [
   375215, 
   null, 
   "Doc Jones", 
   "I think the 2nd Amendment does apply to modern guns. That's why I'm against gun bans. All I'm saying is that modern guns are more powerful and more dangerous so they should be controlled and regulated more.\n\n \n Uh huh. So how do you feel about freedom of the press with advent of computers and even much more advancement?\n \n What about cell phones?\n \n What about the right to vote?\n \n In the 2A, what do the words \"shall not be infringed\" mean?\n \n In Article 1, section 8, where is power granted to congress to tamper with Constitutional Rights?", 
   {}, 
   375212, 
   null, 
   1256221200.0
  ], 
  [
   375216, 
   null, 
   "PeterV", 
   "You have a specious arguement at best probably caused by not being educated enough on the subject. You are just as dead or wounded no matter if the firearm is a modern high powered rifle or a flintlock smooth bore musket. It is not the tool that does the damage. Its the hand that wields it. The major problem with your argument is when is enough, enough? For the controller regulator the answer is never until you have a UK or Japan. When a right is controlled or regulated it is no longer a right. It has become a privilige subject to the whim of petty bureaucrats. \n\n The government regulates things all the time that don't get banned. Nobody says that we can't regulate things like alcohol because if you die by other means you're just as dead. That doesn't even make sense.", 
   {}, 
   375213, 
   null, 
   1256222100.0
  ], 
  [
   375218, 
   null, 
   "NATO 556", 
   "I think the 2nd Amendment does apply to modern guns. That's why I'm against gun bans. All I'm saying is that modern guns are more powerful and more dangerous so they should be controlled and regulated more.\n\n \n Your argument is rejected on the basis of stupidity. Arbitrary standards of control based on the developmental level of something, even suggesting that two different types of items can be held to two different types of regulation standards, is absurd.\n \n Your standard would allow for very little regulation of the news media if they used hand cranked presses, but at the same time they would be faced with considerably stricter regulation if they used computer controlled presses.", 
   {}, 
   375212, 
   null, 
   1256222160.0
  ], 
  [
   375219, 
   null, 
   "NATO 556", 
   "The government regulates things all the time that don't get banned. Nobody says that we can't regulate things like alcohol because if you die by other means you're just as dead. That doesn't even make sense.\n\n \n Then show the basis that would allow the government to regulate firearms more strictly based on their level of power.\n \n Does the government have the authority to regulate a hunting rifle in .300 Winchester Magnum, more strictly than a .22 rimfire rifle?\n \n And what is the definition of \"more powerful\" anyway? Are we talking about the ballistic potential of individual rounds? Or the magazine capacity? Or effective range? Or the ability to make the sheeple think it's a machine gun because it looks like one? Or the ability to bring down an elephant in a single shot?", 
   {}, 
   375216, 
   null, 
   1256222280.0
  ], 
  [
   375220, 
   null, 
   "Doc Jones", 
   "The government regulates things all the time that don't get banned. Nobody says that we can't regulate things like alcohol because if you die by other means you're just as dead. That doesn't even make sense.\n\n \n Shades of Carrie Nation. The alcohol amendment was repealed. Who has to follow a law?\n \n How is that 'war on drugs' going?", 
   {}, 
   375216, 
   null, 
   1256222580.0
  ], 
  [
   375221, 
   null, 
   "Doc Jones", 
   "Then show the basis that would allow the government to regulate firearms more strictly based on their level of power.\n \n Does the government have the authority to regulate a hunting rifle in .300 Winchester Magnum, more strictly than a .22 rimfire rifle?\n \n And what is the definition of \"more powerful\" anyway? Are we talking about the ballistic potential of individual rounds? Or the magazine capacity? Or effective range? Or the ability to make the sheeple think it's a machine gun because it looks like one? Or the ability to bring down an elephant in a single shot?\n\n \n Or for that matter, practice and a high level of proficiency? :)", 
   {}, 
   375219, 
   null, 
   1256223360.0
  ], 
  [
   375222, 
   null, 
   "OldSarge", 
   "The government regulates things all the time that don't get banned. Nobody says that we can't regulate things like alcohol because if you die by other means you're just as dead. That doesn't even make sense.\n\n \n Your main theme seems to be as long as it is not banned then any thing goes, correct? Did I say the government can't regulate things? That is what is known as a strawman. You still haven't answered when or what is enough regulation. Nor have you addressed the right that is regulated is now a privilige. As I stated, you arguement looks like it comes from lack or knowledge or education on the subject. ", 
   {}, 
   375216, 
   null, 
   1256224260.0
  ], 
  [
   375223, 
   null, 
   "Doc Jones", 
   "This Nation has some of the most draconian gun laws ever. If one is found to even have a spent case in or about their person it is straight to prison.\n \n Ciudad Juarez passes 2,000 homicides in '09, setting record | Breaking News | Chron.com - Houston Chronicle\n \n Yet one city has over 2 thousand killed already in 2009. Yep, maybe they need another law? Color me a skeptic.", 
   {}, 
   375221, 
   null, 
   1256224440.0
  ], 
  [
   375303, 
   null, 
   "PeterV", 
   "Your argument is rejected on the basis of stupidity. Arbitrary standards of control based on the developmental level of something, even suggesting that two different types of items can be held to two different types of regulation standards, is absurd.\n \n Your standard would allow for very little regulation of the news media if they used hand cranked presses, but at the same time they would be faced with considerably stricter regulation if they used computer controlled presses.\n\n Your comparison is rejected on the basis of absurdity. Of course, advances in technology mean that guns are more dangerous because guns are weapons. Weapons are meant to hurt and kill but presses are different. All this time I've been trying to make a simple point that it makes sense to regulate more dangerous things more.", 
   {}, 
   375218, 
   null, 
   1256307720.0
  ], 
  [
   375304, 
   null, 
   "PeterV", 
   "Your main theme seems to be as long as it is not banned then any thing goes, correct? Did I say the government can't regulate things? That is what is known as a strawman. You still haven't answered when or what is enough regulation. Nor have you addressed the right that is regulated is now a privilige. As I stated, you arguement looks like it comes from lack or knowledge or education on the subject. \n\n Enough is whatever is required to protect people's safety. Another example here of someone here trying to complicate a simple point.", 
   {}, 
   375222, 
   null, 
   1256307900.0
  ], 
  [
   375307, 
   null, 
   "OldSarge", 
   "Enough is whatever is required to protect people's safety. Another example here of someone here trying to complicate a simple point.\n\n \n Sorry charlie your strawman is on fire. You are trying to avoid discussion obviously since you also obviously have not put much thought into it. So in essense what you are saying is there is no end to it. The kicker is who gets to determine what is enough beyond a vague nebulous phantom. The real beauty of our Constitution is it protects us against this very idea of yours. \n \n Your main theme seems to be as long as it is not banned then any thing goes, correct? Yes or no will suffice. Its not that hard. \n \n Nor have you addressed the right that is regulated is now a privilige. As I stated, you arguement looks like it comes from lack or knowledge or education on the subject. ", 
   {}, 
   375304, 
   null, 
   1256309400.0
  ], 
  [
   375309, 
   null, 
   "OldSarge", 
   "Your comparison is rejected on the basis of absurdity. Of course, advances in technology mean that guns are more dangerous because guns are weapons. Weapons are meant to hurt and kill but presses are different. All this time I've been trying to make a simple point that it makes sense to regulate more dangerous things more.\n\n \n Your weapon argument is specious. A weapon is a tool, nothing more. A tool that is used in self defense since criminals by their very definition don't obey laws. So what you are actually proposing is to regulate my right of self defense because you are afraid of weapons. ", 
   {}, 
   375303, 
   null, 
   1256309640.0
  ], 
  [
   375311, 
   null, 
   "Doc Jones", 
   "Your comparison is rejected on the basis of absurdity. Of course, advances in technology mean that guns are more dangerous because guns are weapons. Weapons are meant to hurt and kill but presses are different. All this time I've been trying to make a simple point that it makes sense to regulate more dangerous things more.\n\n \n If those guns were not dangerous none of us would want one. I want the most deadly, dangerous gun I can pack to hurt and kill those who would kill me. A quote attributed to a Texas Ranger went in a story something like this: \"lady notices cocked and locked .45 on his hip and asked if that wasn't dangerous\" Texas Ranger replied, \"of course it is dangerous or I wouldn't pack the darn thing\"!\n \n You still trying the old ploy that once worked of trying to intimidate people and make them fearful of a Constitutional right by demonizing an inantimate object? How is that gun control working out in jolly old England old chap? eh?\n \n Would you stop putting your specific propaganda on advanced communication devices? The power of the press is indeed more to be feared than guns in the rightful hands of the owners of this Republic. \n \n To prohibit a citizen from wearing or carrying a war arm . . . is an unwarranted restriction upon the constitutional right to keep and bear arms. If cowardly and dishonorable men sometimes shoot unarmed men with army pistols or guns, the evil must be prevented by the penitentiary and gallows, and not by a general deprivation of constitutional privilege. [Wilson v. State, 33 Ark. 557, at 560, 34 Am. Rep. 52, at 54 (1878)]", 
   {}, 
   375303, 
   null, 
   1256310120.0
  ], 
  [
   375315, 
   null, 
   "Doc Jones", 
   "No one can read our Constitution without concluding that the people who wrote it wanted their government severely limited; the words \"no\" and \"not\" employed in restraint of government power occur 24 times in the first seven articles of the Constitution and 22 more times in the Bill of Rights. - EDMUND A. OPITZ ", 
   {
    "unicode_changes_made": true
   }, 
   375311, 
   null, 
   1256311860.0
  ], 
  [
   375322, 
   null, 
   "Tither", 
   "Enough is whatever is required to protect people's safety. Another example here of someone here trying to complicate a simple point.\n\n Hi PerterV. So far I have been staying out of this waiting for you to clarify your position. The problem is that you are making blanket statements. Others are trying to feel you out and giving you a chance to clarify your position.\n \n There are currently 20 to 30 thousand gun laws already on the books.  The &#8220;Unregulated&#8221; Gun  and we have all of these Federal gun laws that have been passed. \n \n 1.Brady background checks for all handgun buyers, \n 2.institution of the waiting period,\n 3. Making it illegal for anyone under 18 to own or even possess a handgun.\n 4. The President's executive order stopping the importation of many guns,\n 5. Excessive fees and regulations that drove many legitimate gun shop owners out of business.\n 6. The widening of Brady to include background checks from just handguns to include all new firearm purchases. \n 7. Insta Check! \n 8. Additional disqualification's and changes to legal firearms purchases on form 4473, \n 9. The assault weapons ban. Sunset\n 10. The ten round magazine, Sunset\n 11 Lautenburg.\n 12. and just recently the NICS improvement act!\n \n Is this enough? Or are you asking more from a Right that our founders sought to protect from Governments intrusion and interference, by Constitutionally protecting it?", 
   {}, 
   375304, 
   null, 
   1256315880.0
  ], 
  [
   375342, 
   null, 
   "NATO 556", 
   "Your comparison is rejected on the basis of absurdity. Of course, advances in technology mean that guns are more dangerous because guns are weapons. Weapons are meant to hurt and kill but presses are different. All this time I've been trying to make a simple point that it makes sense to regulate more dangerous things more.\n\n \n Yeah well guess what, I don't give a damn. Just because something's dangerous, that doesn't mean the government should have the authority to regulate it in whatever manner they choose to. When the wishes of the people conflict with the desires of the government, the only proper outcome is for the government to withdraw and suck it up.", 
   {}, 
   375303, 
   null, 
   1256326440.0
  ], 
  [
   375344, 
   null, 
   "Doc Jones", 
   "Yeah well guess what, I don't give a damn. Just because something's dangerous, that doesn't mean the government should have the authority to regulate it in whatever manner they choose to. When the wishes of the people conflict with the desires of the government, the only proper outcome is for the government to withdraw and suck it up.\n\n \n And PeterV thinks presses are safe?\n ExecutedToday.com 1692: Giles Corey, &#8220;more weight!&#8221;", 
   {}, 
   375342, 
   null, 
   1256326920.0
  ], 
  [
   375461, 
   null, 
   "hansberrym", 
   "If they regulated guns that much back then I don't think the founding fathers would disapprove of gun control now especially since modern guns are more powerful.\n\n \n \n The OP attempts to conflate \"early America\" with \"times of military mergency\" in order to justify the conclusion you make above. \n \n \n The qualifier \"at moments of military emergency\" is glossed over\n In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n \n \n What happened when the military emergency passed in early america? The extraordinary powers were discontinued. That hardly supports claims made by those supporting gun control.", 
   {
    "post_info": {
     "post_title": "Gun control in early America  -or during times of military emergency?"
    }
   }, 
   375131, 
   null, 
   1256411880.0
  ], 
  [
   375511, 
   null, 
   "Galileo", 
   "The OP attempts to conflate \"early America\" with \"times of military mergency\" in order to justify the conclusion you make above. \n \n \n The qualifier \"at moments of military emergency\" is glossed over\n In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n \n \n What happened when the military emergency passed in early america? The extraordinary powers were discontinued. That hardly supports claims made by those supporting gun control.\n\n I thought my post was clear that it happened in times of military emergency and even included information about the impressment of arms being largely discontinued after the war.", 
   {}, 
   375461, 
   null, 
   1256446920.0
  ], 
  [
   375533, 
   null, 
   "matt_wmb", 
   "FYI, Michael Bellesiles has been completely and utterly discredited to the point where proponents of gun control (never sticklers for facts) have stopped bringing him up.", 
   {}, 
   375511, 
   null, 
   1256455200.0
  ], 
  [
   375536, 
   null, 
   "PeterV", 
   "I wasn't even talking about taking people's guns away and Nato556, FYI, gov't is of by and for the people. So the gov't will only pass gun laws people want. Get your facts straight before posting", 
   {}, 
   375533, 
   null, 
   1256468400.0
  ], 
  [
   375540, 
   null, 
   "OldSarge", 
   "I wasn't even talking about taking people's guns away and Nato556, FYI, gov't is of by and for the people. So the gov't will only pass gun laws people want. Get your facts straight before posting\n\n \n That's a rather naive and ill-informed view not backed up by any facts. I suggested you do some reading and get educated before you show your ignorance. ", 
   {}, 
   375536, 
   null, 
   1256477280.0
  ], 
  [
   375543, 
   null, 
   "Doc Jones", 
   "I wasn't even talking about taking people's guns away and Nato556, FYI, gov't is of by and for the people. So the gov't will only pass gun laws people want. Get your facts straight before posting\n\n \n So that may be true in a democracy of mob rule but it would not be the case in this Constitutional Republic!", 
   {}, 
   375536, 
   null, 
   1256477940.0
  ], 
  [
   375553, 
   null, 
   "Tither", 
   "So that may be true in a democracy of mob rule but it would not be the case in this Constitutional Republic!\n\n Doc, can you elaborate on this point? Not everyone understands the significances of what you just said.", 
   {}, 
   375543, 
   null, 
   1256485980.0
  ], 
  [
   375554, 
   null, 
   "NATO 556", 
   "I wasn't even talking about taking people's guns away and Nato556, FYI, gov't is of by and for the people. So the gov't will only pass gun laws people want. Get your facts straight before posting\n\n \n Government will only pass the gun laws people want? Come on man how old are you, really? Nobody can be that foolish.\n \n The government doesn't care what the people want, they pass the laws that only they want. California passed the gun microstamping and ammo regulation bills despite the extreme opposition they faced. New Jersey became a gun rationing state despite months of intense opposition. The federal government failed to enact the national carry reciprocity bill despite it's 38 state support.\n \n And that's only in the last couple of years. Do I have to make a detailed list of all the bad laws that got passed despite the millions of calls to the contrary?", 
   {}, 
   375536, 
   null, 
   1256486640.0
  ], 
  [
   375555, 
   null, 
   "NATO 556", 
   "Michael A. Bellesiles: Information from Answers.com\n \n \nMichael A. Bellesiles is a former professor of American colonial history at Emory University, Atlanta, Georgia, U.S. Two years after publishing Arming America: The Origins of a National Gun Culture (2000), Bellesiles was investigated by Emory University for research misconduct. After the committee found him \"guilty of unprofessional and misleading work,\" he resigned his professorship in October 2002, and the Bancroft Prize of Columbia University, earlier awarded the book, was rescinded.\n\n \n \nQuestions of scholarly misconduct eventually became so serious that Emory University both conducted an internal inquiry and appointed an Investigative Committee of outside scholars. Both committees found serious flaws in Bellesiles's work, with the external committee questioning both its quality and veracity. During the investigation, Bellesiles refused to turn over his notes to investigators and claimed that they had been destroyed in a flood.[11] Bellesiles publicly disputed the Committee's findings, claiming he had followed all pertinent scholarly guidelines and corrected all errors of fact known to him. He said, \"I have never fabricated evidence of any kind nor knowingly evaded my responsibilities as a scholar.\" On the day that the report was released, Bellesiles resigned from Emory.\n", 
   {}, 
   375536, 
   null, 
   1256487000.0
  ], 
  [
   375559, 
   null, 
   "Doc Jones", 
   "Doc, can you elaborate on this point? Not everyone understands the significances of what you just said.\n\n \n Doc, can you elaborate on this point? Not everyone understands the significances of what you just said.\n \n ****************************************\n Mr. Tither, thanks for noticing that some here do not have a clue about the formation of our Republic which is a Nation of Laws based on an existing Constitution which are the rules/law that was agreed upon by the original compact in the Articles of Confederation. \n \n The Articles are the backbone of our Bill of Rights. The quote by Edmund P. Ortiz outlines the nature of these documents by noting that our FF used no or not 24 times in the Articles and 22 times in the BOR as a limit of government power which they distrusted immensely.\n \n Article one lists (enumerates) the powers of Congress and the people gave them only those powers listed and no more. For instance the 2A says \"shall NOT be infringed\" as a bar against government passing any law which infringes on the individual right to exercise that right. For PeterV to think \"government\" in which I assume he means Congress, can pass laws not delegated to them on the whim of the wishes of some fictional majority would ring hollow simply because Congress is not delegated that power and the BOR is/are individual rights of \"the people\".\n \n Articles II and III have similar language that binds the Courts and the Executive Branch by identify(ing) their power and duties.\n \n The Courts are bound by an oath to \"preserve and protect THIS Constitution to the best of their ability against all enemies (to it) both domestic and foreign\". That is the operational clause of the Document. It is an oath that binds all elected or appointed officials as well as the military and the Courts.\n \n For PeterV to think he is not similarly bound this oath serves as a check against mischief should any laws passed contrary to that are subject to the penalty described/proscribed in the Constitution.\n \n The only thing we have in common with a democracy is that people get to elect their Executive Branch and Congressional Representatives and Senators. \n \n Government as a whole is charged with only 3 things: 1) Protection of Property, 2) Preservation of Contracts, and 3) Provide for the Rule of Law.\n \n That is it in a nutshell, plain and simple.", 
   {}, 
   375553, 
   null, 
   1256488500.0
  ], 
  [
   375560, 
   null, 
   "Doc Jones", 
   "During the investigation, Bellesiles refused to turn over his notes to investigators and claimed that they had been destroyed in a flood.\n\n \n LOL, most of which he claimed to have from probate records that were from a California courthouse that \"he personally examined\" but were actually destroyed in early 1900s by an earthquake and fire :) Maybe it was in a prior life?", 
   {
    "post_info": {
     "post_title": "Nato:"
    }
   }, 
   375559, 
   null, 
   1256489640.0
  ], 
  [
   375566, 
   null, 
   "OldSarge", 
   "LOL, most of which he claimed to have from probate records that were from a California courthouse that \"he personally examined\" but were actually destroyed in early 1900s by an earthquake and fire :) Maybe it was in a prior life?\n\n \n Not to forget his use or misuse of famous personages which upon examination were not the quotes he said but his own doctored versions of them. The pity of it all is that Mikey is still employed by academia at yet another universary after being allowed to resign in disgrace from Emory. Even Mikey's supporters weren't able to replicate his \"research\" nor were his math skills up to par either.", 
   {}, 
   375560, 
   null, 
   1256495940.0
  ], 
  [
   375567, 
   null, 
   "Doc Jones", 
   "Not to forget his use or misuse of famous personages which upon examination were not the quotes he said but his own doctored versions of them. The pity of it all is that Mikey is still employed by academia at yet another universary after being allowed to resign in disgrace from Emory. Even Mikey's supporters weren't able to replicate his \"research\" nor were his math skills up to par either.\n\n \n His attempt to 'prove' guns were rare in early America by trying to re-write history was a blantant attempt to ignore the Revolutionary War, the War of 1812, and the not so civil war, the Spanish-American War after the Battle for Texas and Louisiana which is evidence enough that firearms were anything but \"scarce\" as his failed attempt tried to illustrate. I figure right now they are more scarce since our current resident in the White House was elected? :)\n \n Perhaps Ms. Jo has some interesting history about our Continent we are not aware of?", 
   {}, 
   375566, 
   null, 
   1256497260.0
  ], 
  [
   375568, 
   null, 
   "NATO 556", 
   "By far the most glaring fact against Bellesile's thesis, is the sheer number of antique guns we have available today. Thousands upon thousands of pistols, shotguns, rifles, fowlers, butt stocked pistols, blunderbusses, muskets and every other combination of black powder weaponry you can imagine.\n \n Obviously gun ownership wasn't all that rare back then, otherwise we wouldn't have such an extensive collection of historical artifacts stored safely in museums for be enjoyed by future generations.", 
   {}, 
   375567, 
   null, 
   1256498280.0
  ], 
  [
   375633, 
   null, 
   "Galileo", 
   "Professor Wiener of the University of California defends Bellesiles. He says critics have tried to discredit an entire book by excessively focusing on a few minor issues: \n \n \"Hanna H. Gray, Stanley Katz, and Laurel Thatcher Ulrich--the committee that investigated charges of fraud in Michael Bellesiles's book Arming America for Emory University--made a serious mistake at the outset of their work: They agreed to limit their report to answering five narrow questions posed by the Emory University administration, and to avoid the larger issues of the significance of their findings.... The committee concluded that Bellesiles's research into probate records was 'unprofessional and misleading' as well as 'superficial and thesis-driven,' and that his earlier explanations of errors 'raise doubts about his veracity.' But they found 'evidence of falsification'; only on one page: Table 1, 'Percentage of probate inventories listing firearms.' Bellesiles omitted two years from the table, which covered almost a century from 1765 to 1859. The two years, 1774 and 1775, would have shown more guns... Bellesiles in his reply explained that he omitted 1774 and 1775 not to deceive readers, but because those years were not relevant to his thesis: 'the colonial governments were passing out firearms to the members of their militia . . . in preparation for the expected confrontation with Great Britain' therefore these two years give 'an inaccurate portrait of peacetime gun ownership' by individuals... Gun rights groups have been working to discredit the book and destroy Bellesiles's career since before the book was published--they see it as 'anti-gun,' partly because the introduction criticized Charlton Heston and the NRA. (In fact, the debate over gun control is not going to be decided on the basis of an argument about whether our present gun culture began in the mid-nineteenth century.) Instead of focusing on the book's thesis or claims made about its contemporary significance, their strategy has been to try to discredit it by focusing attention on errors in a tiny portion of the documentation.\"\n Emory's Bellesiles Report: A Case of Tunnel Vision |XJon Wiener |XFebruary 2003 OAH Newsletter\n \n That's kind of what has happened to me in this thread. Most of those who have tried to discredit what I posted haven't addressed the main point nor the majority of the content of the first post. Furthermore, I think it's a bit of a stretch to try to discredit information from an article solely based on the fact that the author did engage in or may have engaged in falsification in another publication.", 
   {}, 
   375568, 
   null, 
   1256552640.0
  ], 
  [
   375640, 
   null, 
   "OldSarge", 
   "Professor Wiener of the University of California defends Bellesiles. He says critics have tried to discredit an entire book by excessively focusing on a few minor issues: \n \n \"Hanna H. Gray, Stanley Katz, and Laurel Thatcher Ulrich--the committee that investigated charges of fraud in Michael Bellesiles's book Arming America for Emory University--made a serious mistake at the outset of their work: They agreed to limit their report to answering five narrow questions posed by the Emory University administration, and to avoid the larger issues of the significance of their findings.... The committee concluded that Bellesiles's research into probate records was 'unprofessional and misleading' as well as 'superficial and thesis-driven,' and that his earlier explanations of errors 'raise doubts about his veracity.' But they found 'evidence of falsification'; only on one page: Table 1, 'Percentage of probate inventories listing firearms.' Bellesiles omitted two years from the table, which covered almost a century from 1765 to 1859. The two years, 1774 and 1775, would have shown more guns... Bellesiles in his reply explained that he omitted 1774 and 1775 not to deceive readers, but because those years were not relevant to his thesis: 'the colonial governments were passing out firearms to the members of their militia . . . in preparation for the expected confrontation with Great Britain' therefore these two years give 'an inaccurate portrait of peacetime gun ownership' by individuals... Gun rights groups have been working to discredit the book and destroy Bellesiles's career since before the book was published--they see it as 'anti-gun,' partly because the introduction criticized Charlton Heston and the NRA. (In fact, the debate over gun control is not going to be decided on the basis of an argument about whether our present gun culture began in the mid-nineteenth century.) Instead of focusing on the book's thesis or claims made about its contemporary significance, their strategy has been to try to discredit it by focusing attention on errors in a tiny portion of the documentation.\"\n Emory's Bellesiles Report: A Case of Tunnel Vision |XJon Wiener |XFebruary 2003 OAH Newsletter\n \n That's kind of what has happened to me in this thread. Most of those who have tried to discredit what I posted haven't addressed the main point nor the majority of the content of the first post. Furthermore, I think it's a bit of a stretch to try to discredit information from an article solely based on the fact that the author did engage in or may have engaged in falsification in another publication.\n\n \n Given your past performance on other threads you have been thoroughly discredited. With that being said, your pathetic attempt to resurrect bellesiles is just that, pathetic. \n \n Rather than indulge in a blow by blow slice and dice I refer you to the early post of sources which condemn Mikey. Not just one individual who perhaps needs a little light shed on him as defender of the indefendable.\n \n Sorry no brass ring, except in your own mind.\n \n \n http://www.emory.edu/news/Releases/bellesiles1035563546.html\n MichaelXBellesiles | February 2003 OAH Newsletter\n http://www.discoverthenetworks.org/i...asp?indid=1026\n Could Bellesiles's Problems Undermine Gun Control?\n http://www.emory.edu/news/Releases/Final_Report.pdf\n Part 13 Michael A. Bellesiles: Mega Anti-Gun-Nut\n Part 4 Michael A. Bellesiles: Mega Anti-Gun-Nut\n Michael Bellesiles Can&#8217;t Stop Lying | Skepticism.Net\n Michael Bellesiles Is PC", 
   {}, 
   375633, 
   null, 
   1256566320.0
  ], 
  [
   375641, 
   null, 
   "OldSarge", 
   "MichaelXBellesiles | February 2003 OAH Newsletter\n \n The Investigative Committee's report concluded that serious failures did exist in Bellesiles's research methods and presentation of archival records, but it could not confirm or reject allegations of intentional fabrication. The committee did claim to find evidence, however, of falsification in Table 1 of Arming America and raised questions about the integrity and interpretation of probate records from San Francisco County. Specifically, the committee noted that Bellesiles's failure to identify his sources for Table 1 amounted to \"falsification\"and a violation of the professional norms of documentation, source availability, and evidence representation.\n \n \n Alfred A. Knopf Disowns Arming America\n \n On 7 January 2003 the Alfred A. Knopf publishing house told the Associated Press that it would no longer sell Arming America. Knopf indicated it had decided to end its contractual relationship with Bellesiles. For more on this decision, visit <http://www.usatoday.com/life/books/news/2003-01-08-guns-book_x.htm<", 
   {}, 
   375640, 
   null, 
   1256566560.0
  ], 
  [
   375661, 
   null, 
   "Bryan", 
   "Professor Wiener of the University of California defends Bellesiles. He says critics have tried to discredit an entire book by excessively focusing on a few minor issues: \n \n \"Hanna H. Gray, Stanley Katz, and Laurel Thatcher Ulrich--the committee that investigated charges of fraud in Michael Bellesiles's book Arming America for Emory University--made a serious mistake at the outset of their work: They agreed to limit their report to answering five narrow questions posed by the Emory University administration, and to avoid the larger issues of the significance of their findings.... The committee concluded that Bellesiles's research into probate records was 'unprofessional and misleading' as well as 'superficial and thesis-driven,' and that his earlier explanations of errors 'raise doubts about his veracity.' But they found 'evidence of falsification'; only on one page: Table 1, 'Percentage of probate inventories listing firearms.' Bellesiles omitted two years from the table, which covered almost a century from 1765 to 1859. The two years, 1774 and 1775, would have shown more guns... Bellesiles in his reply explained that he omitted 1774 and 1775 not to deceive readers, but because those years were not relevant to his thesis: 'the colonial governments were passing out firearms to the members of their militia . . . in preparation for the expected confrontation with Great Britain' therefore these two years give 'an inaccurate portrait of peacetime gun ownership' by individuals... Gun rights groups have been working to discredit the book and destroy Bellesiles's career since before the book was published--they see it as 'anti-gun,' partly because the introduction criticized Charlton Heston and the NRA. (In fact, the debate over gun control is not going to be decided on the basis of an argument about whether our present gun culture began in the mid-nineteenth century.) Instead of focusing on the book's thesis or claims made about its contemporary significance, their strategy has been to try to discredit it by focusing attention on errors in a tiny portion of the documentation.\"\n Emory's Bellesiles Report: A Case of Tunnel Vision |XJon Wiener |XFebruary 2003 OAH Newsletter\n \n That's kind of what has happened to me in this thread. Most of those who have tried to discredit what I posted haven't addressed the main point nor the majority of the content of the first post. Furthermore, I think it's a bit of a stretch to try to discredit information from an article solely based on the fact that the author did engage in or may have engaged in falsification in another publication.\n\n \n I don't think I did what you are alledging. But since Bellesiles credibility in Arming America is being specifically addressed again I'll get back into the discussion. Let me dig up my past research into his work and I'll be back later to respond more fully to your post, Galileo.", 
   {}, 
   375633, 
   null, 
   1256580360.0
  ], 
  [
   375668, 
   null, 
   "NATO 556", 
   "Galileo-\n \n I don't give a damn who's defending Bellesile's, or what their claims of his credibility are, he's simply wrong.\n \n First, if guns were so very rare, and almost nobody owned one, how can we have so many tens of thousands of the originals still around?\n \n Second, the Militia Act of 1792. This law specifically called upon the people who were in the militia, which was every able bodied male of a certain age, to supply their own arms for duty. How could a law call for something so impossible, if gun ownership was so rare?\n \n Third, what does it matter? Owning a gun is a right and nobody can argue otherwise. So it doesn't matter one damn bit if it was exercised rarely in the beginning, it's not important. A right isn't a use it or lose it standard, you have it regardless.", 
   {}, 
   375661, 
   null, 
   1256583660.0
  ], 
  [
   375671, 
   null, 
   "OldSarge", 
   "MichaelXBellesiles | February 2003 OAH Newsletter\n \n The Investigative Committee's report concluded that serious failures did exist in Bellesiles's research methods and presentation of archival records, but it could not confirm or reject allegations of intentional fabrication. The committee did claim to find evidence, however, of falsification in Table 1 of Arming America and raised questions about the integrity and interpretation of probate records from San Francisco County. Specifically, the committee noted that Bellesiles's failure to identify his sources for Table 1 amounted to \"falsification\"and a violation of the professional norms of documentation, source availability, and evidence representation.\n \n \n Alfred A. Knopf Disowns Arming America\n \n On 7 January 2003 the Alfred A. Knopf publishing house told the Associated Press that it would no longer sell Arming America. Knopf indicated it had decided to end its contractual relationship with Bellesiles. For more on this decision, visit <http://www.usatoday.com/life/books/news/2003-01-08-guns-book_x.htm<\n\n \n Bellesiles was given ample opportunity to respond to his critics during their limited investigation. When Mikey did so it was to further dig himself deeper in the hole he was in. He either couldn't remember or his notes were lost as he told falshood after falsehood. When questioned about wheter he looked at probate records or wills he didn't remember then claimed it was probate records. The difference a will would not necessarily mention a firearm where a probate records might contain an inventory which could. Mikey's supporters couldn't replicate or duplicate his research which told the story more than enough. His use of quotes when the original sources were consulted did not match up. He either fabricated or put his own words in the supposed quotes of others. When probed about San Franscisco probates he claimed to have examinded them. Then went back and said it was wills in Contra Costa County that contained San Francisco individuals. The major problem here was where the Contra Costa will were located had no record of him signing in or making any query. The Bancroft prize was revoked which is very seldom if ever done. His published refused to print his work of fiction. Yet Galleo has one dubious defense so Mikey is rehabilitated and is now a credible source??? Not even you believe that fairy tale.", 
   {
    "post_info": {
     "post_title": "mikey with a fork in him"
    }
   }, 
   375641, 
   null, 
   1256588220.0
  ], 
  [
   375672, 
   null, 
   "OldSarge", 
   "Jon Wiener is a contributing editor to The Nation magazine and teaches 20th century US history at the University of California - Irvine. He sued the FBI for their files on John Lennon - the story is told in his book Gimme Some Truth: The John Lennon FBI Files and at the website The John Lennon FBI files website. The case went all the way to the Supreme Court before most of the outstanding issues were settled in 1997.\n \n Wiener is the author of three other books, including Professors, Politics and Pop. \"Wiener takes the modern university as his beat, and covers it like a police reporter,\" reviewer John Leonard wrote. \"Wiener's mean streets are the think tank, the scholarly symposium, and the faculty lounge.\"\n \n Wiener's articles have appeared in the New York Times Magazine and the Los Angeles Times as well as The Nation. His article \"Murdered Ink: Media Conglomerates are Censoring Authors\" in The Nation was named \"The Year's Best Writing about Writing\" by Writers' Yearbook.\n \n Wiener has participated as a speaker in more than 100 conferences, including conferences on censorship and the arts at the Columbia University School of Journalism, and on \"Capitalism and its Culture\" at the University of California, Santa Barbara.\n \n He's been a host at KPFK since 1999. On KPFK he has interviewed Gore Vidal, Edward Said, Maxine Hong Kingston, Mike Davis, Joan Didion, Al Franken, Paul Krugman, Barbara Ehrenreich, Samantha Power, Eric Schlosser and Howard Zinn. During the Democratic National Convention in L.A. in 2000 he worked as co-anchor of the Pacifica broadcast of the Shadow Convetion; he also broadcast election night in the 2000 election - and announced that Al Gore had won Florida. He was on the air on Sept. 11, 2001 - \"the most difficult show I've ever had to do,\" he says.\n \n Jon Wiener: On the Radio Jon Wiener&#8217;s Bio", 
   {
    "post_info": {
     "post_title": "who is Jon Wiener"
    }, 
    "unicode_changes_made": true
   }, 
   375671, 
   null, 
   1256588640.0
  ], 
  [
   375674, 
   null, 
   "OldSarge", 
   "Michael Bellesiles, a former Emory University history professor and author of Arming America: The Origins of a National Gun Culture, can no longer claim the prestigious Bancroft Prize, awarded to him in April 2001, as his own. \n \n \n In a statement released Friday, Columbia University announced that the school's trustees had voted to rescind the prize because Bellesiles \"had violated basic norms of acceptable scholarly conduct.\" Arming America \"had not and does not meet the standards they had established for the Bancroft Prize,\" the trustees found. Columbia also requested that Bellesiles return $4,000 in prize money.\n \n It is the first time the prize for \"distinguished works\" in American history and diplomacy has been withdrawn since it was first awarded in 1948. \n Arming America was immediately embraced by many scholars because it appeared to confirm what many already believed: that the Second Amendment only protects a collective right to bear arms, and individual gun rights were unimportant to America's Founders. The thesis of the book is that there were few guns in early America and that most of the guns that did exist were old and broken.\n \n This October, Bellesiles was forced to resign from his professorship at Emory after a panel of historians built on the seed work of critics (most notably James Lindgren of Northwestern University) and found that Bellesiles was \"guilty of unprofessional and misleading work.\" The National Endowment for the Humanities also withdrew its name from a Newberry fellowship awarded to Bellesiles for a second book on guns (the NEH and the William & Mary Quarterly were the first to seriously examine the charges against Bellesiles). \n \n Columbia's provost, Jonathan Cole, tells NRO that his school's decision came at the end of a careful process that began in the fall of 2001. Though they were ultimately influenced by the results of the Emory investigation, Columbia's trustees also consulted with outside historians in their deliberations about the fate of Bellesiles's award. In fact, Bellesiles was even allowed to provide his input before Columbia made its decision.\n Columbia's recent evaluation of Arming America by its trustees, administration, and faculty contrasts sharply with the original review by the Bancroft selection committee in 2001. Despite early revelations that Bellesiles had made many errors in the book, Columbia's prize committee issued the award anyway, as reiterated last Friday, because Arming America appeared to fulfill criteria of \"enduring worth and impeccable scholarship that make a major contribution to our understanding of the American past.\" \n \n But did it?\n \n Before the Bancroft Prize was awarded in 2001, scholars had already shown that Bellesiles's main probate data were mathematically impossible, and that he had miscounted, misinterpreted, and made up substantial portions of information. When asked by National Review last fall, Arthur Goren, professor emeritus of Columbia, then chair of the prize committee, said he wasn't aware of a public debate or serious questions about Arming America when the committee considered it: \"We reviewed 150 books over a four month period. As you undertake that process and seek to recognize innovative work, among other things, it is probably inevitable that some of the books will touch on controversial topics.\" This, despite the fact that one of the original Bancroft panel members, Rutgers historian Jan Lewis, had been sent a scholarly manuscript detailing most of these problems. \n \n What's more, on April 18, 2001, the day that Columbia presented Bellesiles his prize, the Columbia College Conservative Club (CCCC) held a roundtable discussion on the author's work. Not a single Bancroft committee member or member of the school's history department attended. \"On April 9, I e-mailed members of the history department and the Bancroft committee with a summary of the case against Bellesiles including some clear cases of fraud. I received no responses,\" explains Ron Lewenberg, then president of the CCCC. He tried again and was shunned again. \"I was not allowed to put the packets in the mailboxes of professors and staff, so with the approval of the secretary, I placed them on the desk. According to a friendly TA, whose anonymity I have kept secret for the protection of his career, Professor Eric Foner, saw the handouts and threw a fit. All of the packets were thrown out.\" \n \n After what Lewenberg interpreted as Foner's attempt to suppress knowledge of possible problems with the book, Foner last week defended the committee's ignorance in comments to the Associated Press: \"The Bancroft judges operate on a basis of trust. We assume a book published by a reputable press has gone through a process where people have checked the facts. Members of prize committees cannot be responsible for that.\"\n \n Though relieved that the school's trustees withdrew Bellesiles's Bancroft Prize, Joyce Malcolm, a history professor at Bentley College who has written a book on the Anglo-American conception of gun rights, and who was an early skeptic of Bellesiles's research begs to differ: \"The sad part is that if the prize committee had taken the trouble to read the serious criticism of the book before bestowing this award they would never have been put in this embarrassing situation. The award was meant to be for a work of impeccable scholarship, and it was clear before April 2001 that Arming America was not such a book.\" \n And what about the book's publisher, Knopf? In the wake of Columbia's actions, Knopf announced plans to continue to publish the same paperback edition that Emory and Columbia found to be the product of \"misconduct\" and \"falsification\" - problems serious enough for Bellesiles to lose his tenured position at Emory and the coveted Bancroft Prize but not for Knopf to stop selling his discredited book, and its lies.", 
   {
    "post_info": {
     "post_title": "Melissa Seckora"
    }, 
    "unicode_changes_made": true
   }, 
   375672, 
   null, 
   1256589660.0
  ], 
  [
   375677, 
   null, 
   "OldSarge", 
   "May 21, 2002\n JIM LINDGREN has some interesting comments on the Bellesiles developments (Click here for a link to the post by Prof. Michael Tinkler that set this discussion in motion):\n \n \n Thanks for the VERY interesting post about another Bellesiles story that doesn't stand up. So he used a research assistant and a spreadsheet for his probate research on guns, contrary to his prior claims.\n \n Of course, Bellesiles first presented his probate research on guns (which was later republished in Arming America) at the OAH meetings in early 1995 and first published almost all of his Arming America probate data in a 1996 JAH article. There was not enough time between the publication of the Ethan Allen book in 1993 and his OAH talk in early 1995 to have done much more than count the records in Philadelphia, the largest of his 40 counties-if he had no other responsibilities and did nothing else with his time. He has always claimed to have worked on Arming America long before 1993 (the year the Ethan Allen book was published). I didn't read the Ethan Allen book too carefully, but I\n \n don't remember any counts of guns in probate inventories. The Vermont counties are in his probate samples in both the 1996 JAH article (Table 1) and Arming America (p. 445, Table 1). This new story suggests that he had started on the data for Arming America by 1988, whether he was conceptualizing something like the JAH article or a book we cannot know. But the research that his assistant reported, if done on Vermont estates, would very likely be on estates in his probate samples in Arming America. I would love to see those early counts because-as confirmed both in William & Mary Quarterly (Roth) and in the William & Mary Law Review (Lindgren & Heather)-guns are in about 40% of Vermont estates, not the 14% that Bellesiles claimed. Bellesiles missed guns in over 60% of the inventoried estates in his Vermont samples. I have never had a research assistant even close to this error rate, and I don't believe that he has either.\n \n If the research assistant is telling the truth about putting her data on a spreadsheet for Bellesiles under his direction-and there is not the slightest reason to suppose otherwise-why would Bellesiles claim that he was unfamiliar with using computers for collecting probate data when he wasn't? The most obvious answers are either that he did little probate research beyond that done by the research assistant or that her counts were relatively accurate and thus did not match what he wanted to find for Arming America.\n \n In any event, there are now three different stories about when Bellesiles first\n \n noted the small numbers of guns in probate inventories-\n \n (1) in 1989 or 1990 when he had an \"epiphany\" reading probate inventories in a Vermont courthouse (as he told the New York Times in April 2000 and Hartford Courant in September 2000), (The Learning Network - The Learning Network Blog - NYTimes.com)\n \n (2) in the early 1980s when he now says that he counted guns and books in Vermont estates (he recently claimed in his website's revised Vermont probate report to have recorded guns and books in the early 1980s),\n \n Emory University | Atlanta, GA | Error 404: Not Found\n \n and\n \n (3) in 1988 when he directed his research assistant to count guns on microfilm\n \n and put her data on a spreadsheet (a story that Bellesiles has never mentioned himself).\n \n Indeed. I hope that Emory's investigation looks into this discrepancy in stories.", 
   {
    "post_info": {
     "post_title": "http://pajamasmedia.com/instapundit/31423/"
    }, 
    "unicode_changes_made": true
   }, 
   375674, 
   null, 
   1256591940.0
  ], 
  [
   375678, 
   null, 
   "OldSarge", 
   "[9/19/2001]\n Dear Colleagues:\n \n I have followed the controversy over Michael Bellesiles' work on probate records in some detail over the past few months. My review of the ARMING AMERICA will be appearing in REVIEWS IN AMERICAN HISTORY sometime this month [for those with MUSE access, the review can be found at http://muse.jhu.edu/journals/reviews_in_american_history/toc/rah29.3.html] \n \n Given Michael's latest claim that his report of his research on Vermont probate inventories is in fact the product of some unidentified third party, I thought it was time to review the controversy.\n -\n ARMING AMERICA'S claims regarding very low rates of gun ownership rely on three types of data: probate inventories, militia returns, and anecdotal evidence. Of these, the anecdotal evidence, often in the form of requests that colonial and state governments provide guns to beleaguered populations, is the least reliable, statistically speaking, because such evidence is generated only by a state of scarcity. This leaves the militia returns and the probate analysis as the empirical foundation on which Bellesiles' chronological argument rests.\n -\n Jim Lindgren's analysis of the book last January made its most important contribution in providing a detailed statistical analysis of probate inventories in Providence, Rhode Island, published in the Providence Town Records, and of Alice Hanson Jones' published compilation of inventories. At the time, all evidence indicated that Bellesiles had relied upon both of these samples. Bellesiles has since claimed that he never used Jones' sample, despite stating in his 1996 JAH article that he had. Six years after Bellesiles published his findings, those of us engaged in the professional responsibility of evaluating his work are still guessing at the composition of his sample. I will return to this point shortly.\n -\n Bellesiles could not claim that he had never used the Providence inventories, as he discussed them in detail in ARMING AMERICA. What Lindgren's analysis demonstrated was that Bellesiles had misrepresented the original records, mischaracterizing the sample and altering the language of the original documents. Specifically, Bellesiles had claimed that half of the guns were listed as old, and \"a great many\" were listed as \"Queen's arms,\" or state property. Lindgren found slightly more guns, fewer inventories, that only 9% of the guns were listed as old, and only one was a Queen's arm. He also found that Bellesiles had in the book attributed this Queen's arm to the wrong inventory. In May Bellesiles posted a revised analysis of the Providence records on his website that conceded on all of these points.\n -\n Prior to this, in February, Bellesiles had posted an analysis of guns in Vermont probate inventories from 1770-1790. This analysis had a specific purpose. When Lindgren circulated his essay at the turn of the year that in part analyzed Alice Hanson Jones' probate sample, he found guns in over 40% of northern inventories and over 60% of southern inventories. Before I was aware of Lindgren's work, I made a similar count that confirmed his findings. As Bellesiles had reported finding guns in 15% of northern inventories and 18% in the South, his work was called into question. Bellesiles' purpose in posting the essay on Vermont was to shore up his claim of lower rates of gun ownership than Jones had found. He accordingly found guns in 44 of 342 \"probate records.\" Once a large number of state owned guns were removed from the sample, guns were present in only 11.4% of the sample.\n -\n This essay was crucial because it offered a second specific set of records with which to evaluate Bellesiles' work. And it is here that Bellesiles' failure to reveal the precise details of his sample is critical. Lindgren and Justin Heather went to Vermont, and found that once again Bellesiles had misrepresented the original records. Furthermore, he had done it in precisely the same manner that he has now been proven to have utilized with the Providence records. Without revealing the details of Lindgren's newest work, which he has shared with me but has not yet published, the pattern is clear: more guns, fewer inventories, and language altered to make guns appear old or state owned, and thus advance the overall thesis.\n -\n In my own research into late eighteenth and early nineteenth-century militia returns, I have also found that Bellesiles has mischaracterized, misinterpreted, and sometimes grossly misrepresented the original records on which he relied. I will discuss three examples here, not because they are particularly egregious, but because they fit the pattern that Lindgren has discovered. Bellesiles cites a 1744 militia return from Worcester County, Massachusetts. He claims that 8 of 21 companies that \"filed a report on their firearms\" reported that they were \"entirely deficient.\" (ARMING AMERICA, 150) In the original document the colonel of the regiment reported the state of the arms and ammunition of each company. He noted that four of the companies were \"entirely deficient as to arms.\" He reported the other four as \"entirely deficient as to ammunition.\" Bellesiles has thus altered the language in the original to advance his thesis of gun scarcity. A photocopy of this document is in my possession, and I will be happy to provide it to anyone interested.\n -\n Another example of this tendency is Bellesiles' use of an anecdote from Harold Selesky's WAR AND SOCIETY IN COLONIAL CONNECTICUT, pp. 228-229. In Bellesiles telling, when Benedict Arnold heard the news of Lexington and Concord, he \"inspected his troops and found them largely unarmed. He threatened to break into the town arsenal in order to arm his men, but the town's selectmen relented and opened the doors to his militia, with Arnold supervising the distribution of Brown Besses.\" (ARMING AMERICA, 181) But in Selesky's account, and in the source upon which Selesky relies, Arnold demanded the keys to the powderhouse, so as to secure ammunition for his men. The compelling details of gunlessness and the distribution of public arms appear to be an invention designed to advance the thesis.\n -\n Finally, in the Table 3 of the appendix of ARMING AMERICA, Bellesiles purports to show the levels of \"Private gun ownership in Massachusetts.\" For a series of sample years from 1789 to 1839, he reports the \"number of privately owned muskets or rifles,\" the state's population, and the \"percent of population with guns\" for both total population and white males 16 and older. The problem with this analysis is that Bellesiles has taken the number of guns from George D. Moller's approximations of the number of guns returned in the Annual Return of the Massachusetts Militia for the given year, published in Moller's MASSACHUSETTS MILITARY SHOULDER ARMS. These are thus the approximate number of guns brought by militiamen to the annual inspection musters held around the state. They are not the total number of privately owned guns in Massachusetts, a number that no state government sought to keep track of in this period. In comparing this number to total population and to all white men over 16, and not to the number of militiamen appearing at muster, Bellesiles artificially inflates his sample in order to report low rates of gun ownership.\n -\n Which brings us to Bellesiles' claim that the inaccuracies in his essay were inserted by a hacker.[...] If Bellesiles' website has been hacked, it has been hacked twice. The hacker would have to have changed the language Bellesiles reported for individual gun estates, while leaving intact Bellesiles' claims that guns were present in only 11.4 % of estates. That overall finding was on the website when I first viewed it a week after it was created, on February 16. The hacker would have to have inserted alterations entirely consistent with the alterations Bellesiles made in the Providence records. These alterations must have been made within weeks of the original posting. The hacker must then have struck again in the last week or two to add the references to pornography that Bellesiles mentions but that did not exist on the site on September 3.\n -\n [...]\n \n Sincerely,\n Robert Churchill\n Rutgers University, Ph.D., 2001\n Lecturer, Princeton University\n rchurchi@princeton.edu", 
   {
    "post_info": {
     "post_title": "yet again more"
    }
   }, 
   375559, 
   null, 
   1256592120.0
  ], 
  [
   375680, 
   null, 
   "OldSarge", 
   "The publication of Arming America: The Origins of a National Gun Culture, by Michael A. Bellesiles, New York: Alfred A. Knopf has been hailed by pro-gun control supporters such as the New York Times because Bellesiles asserts that guns were not common in colonial America. Bellesiles claims that before the civil war there was virtually no access to firearms and that the conventional lore that Colonial families were armed is wrong (see Lord Baltimore's list of equipment for settlers in Maryland for some contrary evidence). So, Bellesiles asserts that the Second Amendment wasn't intended to mean that the people have the right to keep and bear arms. Joyce Lee Malcolm, Clayton Cramer, Don Kates, and James Lindgren & Justin Lee Heather review and refute Bellesiles' claims at the following links. Cramer states in his article \"Arming America: Part II,\" Shotgun News, Dec. 18, 2000, page 22, that \"Bellesiles's book . . . makes false claims about the state of gun ownership in early America -- not just errors of fact, but intentionally deceptive misquotation of sources.\"\n \n Bellesiles has become a beacon for the anti-RKBA groups. But Bellisiles is a fraud and his assertions are wrong like most of the assertions from that crowd. This page points to the contrary evidence and documents the news reports of the unraveling of Bellesiles' deceptions and the actions taken against him.\n \n Most recently the gun grabbers have tried to deny their connection with Bellesiles' frauds or to deny that these frauds are important. This controversy continues today as the link to the History News Network below shows and Bellesiles' frauds continues to provide important examples of the superficial or dishonest nature of the gun grabbers and their propaganda. \n \n \n Following the Bellesiles Story By History News Network Staff; up to date reports and an active discussion list. \n \n \n Concealed Weapons -- The controversial book Arming America has the facts all wrong.\", Joyce Lee Malcolm, \n Reason, January 2001 \n Shots in the Dark, Clayton Cramer, National Review, September 23-24, 2000 \n Were the Founding Fathers in Favor of Gun Ownership? S. P. Halbrook, The Washington Times (Washington, DC), \n Nov. 5, 2000 (en espanol) \n Gun Scarcity in the Early Republic?, Clayton Cramer \n Fraud in Michael Bellesiles's Arming America, Clayton Cramer \n Firearms Ownership & Manufacturing in Early America, Clayton Cramer \n Cramer's Primary Historical Sources, Clayton Cramer \n What Clayton Cramer Saw and (Nearly) Everyone Else Missed, By Clayton E. Cramer, 1-06-03 \n Why do law reviews fact check articles? To quote Don Kates, a civil rights attorney who did much of the early work in the \n legal history of gun control, \"Law reviews check facts because lawyers lie.\" \n \n Notes for Speech on Bellesiles, Don Kates, Oct. 2000 \n Counting Guns in Early America, James Lindgren & Justin Lee Heather, Center for Public \n Health Law U. of Missouri \n Could Bellesiles's Problems Undermine Gun Control?, Don Williams \n This article shows how Bellesiles' work corrupted the judicial system and so was more than an academic fraud.\n \n Mr. Bellesiles's Emails, James Lindgren \n Lindgren's response to Bellesiles' denial that he wrote some E-mails to Lindgren. \n \"Pulped\" Fiction: Michael Bellesiles and His Yellow Note Pads, Jerome Sternstein \n A dissection of Bellesiles' tale about his research being ruined by a flood at Emory. \n Are Michael Bellesiles's Critics Afraid to Say What They Really Think?, Jerome Sternstein. A summary of The \n William and Mary Quarterly, 59#1, Jan. 2002 articles linked below and of different tales told by Bellesiles. \n Many Things Forgotten: The Use of Probate Records in Arming America, Gloria L. Main, The William and Mary \n Quarterly, 59#1, Jan. 2002 \n Of Arms and Men: Arming America and Military History, Ira D. Gruber, The William and Mary Quarterly, 59#1, \n Jan. 2002 \n Guns, Gun Culture, and Homicide: The Relationship between Firearms, the Uses of Firearms, and \n Interpersonal Violence, Randolph Roth, The William and Mary Quarterly, 59#1, Jan. 2002 \n Historian's Prizewinning Book on Guns Is Embroiled in a Scandal, Robert F. Worth, New York Times, December 8, \n 2001 [registration required]. [\"Now many of Mr. Bellesiles's defenders have gone silent. Over the past year a \n number of scholars who have examined his sources say he has seriously misused historical records and possibly \n fabricated them.\"] \n Historian's Prizewinning Book on Guns Is Embroiled in a Scandal, Robert F. Worth from an alterative source. \n \n \n GunCite has done a fine job of collecting reviews and analyses of Bellesiles' distortions. In particular, I recommend reading their comparisons of a history by another author of the initial Revolutionary War battles around Lexington and Concord with Bellesiles'. Just reading that other history is worth the look. A number of comments discussing Bellesiles's defense (\"Disarming the Critics\") of his book \"Arming America\" may found on the Organization of American Historians site. The Contra Costa County History Center responds to Prof. Bellesiles claim to having found San Francisco Probate records in their collection. \n \n News Reports \n \n Emory's final report on Bellesiles' research; (see page 18)\n \n But in one respect, the failure to clearly identify his sources, does move into the realm of \"falsification,\" which would constitute a violation of the Emory \"Policies.\" The construction of this Table implies a consistent, comprehensive, and intelligible method of gathering data. The reality seems quite the opposite. In fact, Professor Bellesiles told the Committee that because of criticism from other scholars, he himself had begun to doubt the quality of his probate research well before he published it in the Journal of American History. [Interview, p.35-6 AA 00764-764; MB 00448]\n \n The most egregious misrepresentation has to do with his handling of the more than 900 cases reported by Alice Hanson Jones. When critics pointed out that Jones' data disagreed with his, Bellesiles responded by explaining that he did NOT include Jones's data in his computations because her inventories, taken during the build-up to the American revolution, showed a disproportionately high number of guns! Here is a clear admission of misrepresentation, since the label on column one in Table One clearly says \"1765-1790.\" If Professor Bellesiles silently excluded data from the years 1774-1776, as he asserts, precisely because they failed to show low numbers of guns, he has willingly misrepresented the evidence. This, compounded with all the other inconsistencies in his description of his method and sources and the fact that neither he nor anyone else has been able to replicate any part of his data, suggest that there is a real discrepancy between the research Professor Bellesiles did and his presentation of that research in Table One.", 
   {
    "post_info": {
     "post_title": "more nails, more nails"
    }, 
    "unicode_changes_made": true
   }, 
   375559, 
   null, 
   1256592900.0
  ], 
  [
   375681, 
   null, 
   "Doc Jones", 
   "I have never seen nor heard of a Predator strike any more devatating.\n \n Looks like Sarge took star gazer up on his kind offer to comment on \"what he said\" :)", 
   {}, 
   375680, 
   null, 
   1256595660.0
  ], 
  [
   375682, 
   null, 
   "OldSarge", 
   "Ward Churchill's Bizarre Explanation of the Bellesiles Scandal\n \n There's an interview with him in one of the hard left publications: \n Consider the case of Michael Bellesiles, the young historian at Emory who wrote Arming America, a study devoted to debunking many of the more cherished myths of the country's thriving gun culture (for which he won the prestigious Bancroft Prize in 2000).\n This is wrong and deceptive in more ways than I can count. Yes, Bellesiles won the Bancroft Prize--and it was then revoked--for the first time in the Bancroft Prize's history. The public nature of the fraud became so massive that even Columbia University couldn't ignore it anymore.\n It wasn't other academics who went after Bellesiles, but the National Rifle Association, which commenced a campaign alleging \"academic fraud\" even before the book was published (there were nearly 250 national articles published on the \"Bellesiles Hoax\" in less than two years).\n Nearly 250 articles? Perhaps Churchill is counting when newspapers around the country reprinted a story that originally appeared somewhere else. The notion that the NRA \"orchestrated\" this is laughable. It was largely my doing, James Lindgren, and a few journalists who were concerned about this fraud. There were questions about Bellesiles's numbers before the book came out because many of the same claims appeared in a 1996 Journal of American History paper by Bellesiles--but while some historians, such as myself, thought he was in error about this, and perhaps that he was blinded by his ideological zeal, I don't know that anyone thought that Bellesiles was intentionally lying until his book came out. I certainly didn't think Bellesiles was making things up at first, and I don't know anyone who did.\n \n \n Ultimately, the \"fraud\" claim hinged on a single footnote in which Bellesiles gave the wrong archival location for certain documents he cited to demonstrate that gun ownership in early America was much less common than those of the NRA persuasion-which, by the way, includes me-would have it. The documents actually existed, and they said pretty much what Bellesiles said they said.\n \n Bellesiles's problem was not just \"wrong archival location\"--it was that much of the data that he claimed to have extracted from various probate inventories couldn't be found in any archive. Bellesiles's answers about which archives he visited kept changing. James Lindgren has demonstrated that Bellesiles's numbers (from combining published sources and his supposed work in archives) were mathematically impossible. Several historians went back and checked some of the archives where the probate data that Bellesiles claimed to have used did exist, and found that Bellesiles's numbers were often far at variance from his claims for it.\n \n Bellesiles's problem wasn't just the probate data--it was massive fraud involving vast numbers of documents that he misquoted, often to say the exact opposite of what they actually said. \n Nonetheless, in the face of an unrelenting barrage of negative publicity-the NRA was able to orchestrate nearly 250 articles on the \"Bellesiles Hoax\" in less than two years-a panel of \"impartial\" scholars commissioned by Emory to \"investigate the integrity of Professor Bellesiles' scholarship\" concluded that in this instance his handling of data was \"less than professional.\" \n They concluded a heck of a lot more than that. I don't know if Churchill can't read, or is simply relying on sympathetic accounts that leave out important details. The report found that his answers were often evasive. They were evasive for a reason--he kept changing his story about when a flood destroyed all of his notes; he was unable to supply the electronic form of the data from which the graphs must have been derived.\n \n The rest of the interview is equally bizarre. He mentions Michelle Malkin's book In Defense of Internment and argues that she plagiarized it: \n the fact is that the bulk of her argument on the World War II internment derives from a fairly obscure right-winger named Lillian Baker. Yet Baker's material is cited nowhere in Malkin's book.\n \n ...\n \n What's the payout for Malkin? Let's start with a stint as a regular commentator-read, pet \"minority\" (she's Filipina)-on Fox News and Clear Channel. And let's end with an all but total silence about her \"scholarly integrity\" from the left.\n I don't know what the truth of the story is about Lillian Baker; in light of Churchill's general regard for truth, I am inclined to believe Malkin over Churchill. But the claim that the left has engaged in \"all but total silence\" is absurd. See, for example, this spirited attack on the book.\n \n It would appear that Malkin may be considering a libel suit against CounterPunch and Churchill. \n \n Churchill refers to himself and Bellesiles as \"oppositional\" scholars. Yeah: in opposition to honesty.\n \n UPDATE: I notice that a little deeper in the interview, Churchill gives a new book by Jon Weiner of UC Irvine as his source for his knowledge of the Bellesiles matter. This explains Churchill's highly inaccurate explanation of what happened.\n \n Ah the Wiener connection!\n \n Clayton Cramer's BLOG", 
   {
    "post_info": {
     "post_title": "if you had any doubt whatsoever"
    }
   }, 
   374941, 
   null, 
   1256595720.0
  ], 
  [
   375684, 
   null, 
   "Doc Jones", 
   "Actually, it did affect the judiciary. One of the judges on the 3 judge panel that decided Emerson used a quote and source from that book. He later went back and edited it out.\n \n Proof that a few maladjusted people can cause a great deal of confusion. No wonder they cite Mao in the gun grabber camp now!", 
   {}, 
   375682, 
   null, 
   1256597880.0
  ], 
  [
   375685, 
   null, 
   "Doc Jones", 
   "And that was in the 5th Circuit!", 
   {
    "post_info": {
     "post_title": "tag:"
    }
   }, 
   375684, 
   null, 
   1256598000.0
  ], 
  [
   375686, 
   null, 
   "OldSarge", 
   "Michael Bellesiles and Guns\n in the Early Republic\n by Clayton E. Cramer\n Professor Michael A. Bellesiles's Arming America: The Origins of a National Gun Culture makes the claim that hunting with guns was rare in America\n before the 1830s.1 According to Bellesiles, few Americans hunted, few Americans wanted guns, and few Americans owned guns in the early Republic (the period from the American Revolution to 1846). What guns were present were often old, rusty, or otherwise wall hangers. Similarly, Bellesiles tells us that hunting until the 1840s was done almost entirely by a small number of professional market hunters or by Indians. Most Americans, even on the frontier, Bellesiles claims, did not hunt.2 As evidence for this claim, he reports, \"an examination of eighty travel accounts written in America from 1750 to 1860 indicate that the travelers did not notice that they were surrounded by guns and violence.\"3 In a previous article, I gave examples of four of these accounts, by Baynard Rush Hall, Anne Newport Royall, Ole Rynning, and Charles Augustus Murray, that Bellesiles misrepresented or distorted; all four reported guns and hunting as commonplace-in some cases,\n nearly universal-activities.4 The present article reports on eight more accounts that Bellesiles claims to have read-and that all portray an early Republic awash in guns and hunting. One of those \"eighty travel accounts\" is\n William N. Blane's An Excursion through the United States and Canada, during the Years 1822-3. Blane mentioned guns and hunting on at least 22 pages, and his remarks make it clear that these were not unusual occurrences. On the road across the Appalachians he described his first encounter with rifles in the hands of some hunters. \"As one of them, an old man, was boasting of his skill as a marksman, I offered to put up a half-dollar at a distance of fifty yards, to be his if he could hit it. Accordingly, I stepped the distance, and\n placed the half-dollar in the cleft of a small stick, which I thrust into the ground. The hunter, slowly raising his rifle, fired, and to my great astonishment, struck the halfdollar.\" 5 Rifles were common in the backcountry. According to Blane, \"Go to what house I might, the people were always ready to lend me a rifle, and were in general glad to\n accompany me when I went out hunting.\"6 Blane described going squirrel hunting with an American on an island in the Ohio River, and how the Americans were engaged in a losing battle to exterminate these pests: \"In\n parts of Ohio, the people attempted to destroy them by means of guns, dogs, and clubs. One party of hunters, in the course of a week, killed upwards of 19,000. . . . The people are very fond of the flesh of the squirrel,\n roasting it, and making it into pies, soups, &c. . . .\"7\n \n Clayton Cramer (clayton@claytoncramer.com) is\n the author of Concealed Weapon Laws of the\n Early Republic: Dueling, Southern Violence, and\n Moral Reform (Praeger Press, 1999).\n SEPTEMBER 2002\n 17\n Blane's description of the backwoodsmen of the United States observed: \"Every boy, as soon as he can lift a rifle, is constantly practicing\n with it, and thus becomes an astonishingly expert marksman. Squirrel shooting\n is one of the favorite amusements of all the boys, and even of the men themselves.\" Blane wrote an additional two pages about the impressive marksmanship skills of the backwoodsmen, remarking, \"in these immense\n forests, where every tree is a fort, the backwoodsmen, the best sharp shooters in the world, constitute the most formidable military force imaginable.\"8 Americans hunted birds as well, and Blane described the normal procedure by which Americans hunted the prairie grouse. \"They are delicious eating, and are killed in great numbers by the unrivalled marksmen of this\n country. After driving up a flock of these birds, the hunter advances within fifteen or twenty yards, raises his long heavy rifle, and rarely misses striking the bird on the head.\" After admitting that he was not as good a shot, and had to resort to shooting the prairie grouse through the body, \"the Backwoodsmen regarded my unsportsmanlike shooting with as much contempt, as one of our country squires feels, when a cockney shoots at a covey of partridges on the ground.\"9 Blane also described the astonishment\n when he informed Americans that British game laws prohibited hunting deer in\n public lands, and even limited hunting on one's own land to the wealthy. \"Such flagrant injustice appeared to them impossible. . . .\"10\n Western Journey Bellesiles read Fortescue Cuming's Sketches of a Tour to the Western Country, which described a journey through Pennsylvania,\n Ohio, and Kentucky from 1807 to 1809, and claims that Cuming was one of these travelers who \"did not notice that they were surrounded by guns and violence.\" Throughout his journey Cuming mentioned, with no surprise, widespread use of guns for sport, subsistence hunting, and self-defense.\n Cuming also distinguished between subsistence hunting and hunting for market, yet he still suggested that subsistence hunting was\n common, not rare.11 In Kentucky, Cuming describes how abundant the wildlife of the area remained, even after settlement by reporting \"that little or no bread was used, but that even the children were fed on game;\n the facility of gaining which prevented the progress of agriculture. . . .\"12\n Even though Cuming was a hunter,13 he expressed his admiration for the superior marksmanship of western Pennsylvanians and Virginians: \"Apropos of the rifle. The inhabitants of this country in common with the Virginians, and all the back woods people, Indians as well as whites, are wonderfully\n expert in the use of it: thinking it a bad shot if they miss the very head of a squirrel, or a wild turkey, on the top of the highest forest tree with a single ball; though they generally load with a few grains of swan shot, with which they are equally sure of hitting the head of the bird or animal they fire\n at.\"14 Isaac Weld's account of his travels in North America between 1795 and 1797 is another of those that Bellesiles claims shows an \"absence of discussion about guns.\"15 Weld's account described how rifles worked\n for his British audience, who would have been unfamiliar with rifled weapons. Weld told how: An experienced marksman, with one of these guns, will hit an object not larger than a crown piece, to a certainty, at the distance of one hundred yards. Two men belonging to the Virginia rifle regiment, a large division of which was quartered in this town during the war, had such a\n dependence on each other's dexterity, that the one would hold a piece of board, not more than nine inches square, between his knees, whilst the other shot at it with a ball at the distance of one hundred paces. This they used to do alternately, for the amusement of the town's people, as often as they were called upon. Numbers of people in Lancaster can vouch for the truth of this fact. Were I, however, to tell you all the stories that I\n Ideas on Liberty 18 have heard of the performance of riflemen, you would think the people were most abominably addicted to lying.16 Weld also discussed rifle manufacturing, the use of rifles for hunting,17 and how in the\n backcountry, \"The people all travel on horseback, with pistols and swords. . . .\"18 While discussing hunting, Weld compared Canadian hunters to their American counterparts: \"The people here, as in the back parts of the United States, devote a very great part of their time to hunting, and they\n are well skilled in the pursuit of game of every description. They shoot almost universally with the rifle gun, and are as dexterous at the use of it as any men can be.\"19 The difference between Americans and Canadians,\n according to Weld, was that Canadians imported their rifles from England, and preferred larger caliber hunting weapons. Another of Bellesiles's \"eighty travel accounts\" is Francis Baily's Journal of a Tour in Unsettled Parts of North America in 1796 & 1797. Yet Baily's account is full of guns and hunting, including not only his own, but also those of the Americans whom he met. Baily portrayed boys hunting-with guns-in what were to become the main\n streets of the nation's capital,20 and described both Fredericktown and Hagerstown, Maryland, as centers of rifle manufacturing and sales. He bought rifles in Hagerstown.21 Like Cuming, Baily spoke of the Kentuckians\n as living largely \"upon deer and turkeys, which they shoot wild in the woods.\n . . .\"22 He also described Kentuckians' hunting black bears with rifles.23 Baily was surrounded by guns and by hunting. At no point did Baily give any indication that either was unusual. Sunday Gunning Bellesiles also cites Caroline Kirkland's A New Home-Who'll Follow? as one of his sources for this gunless America. Yet Kirkland's account gives many indications that guns and sports involving guns were widespread. Discussing the problems of church\n attendance, \"Preachers belonging to various denominations have, from the beginning, occasionally called meetings in the little log school-house, and many of the neighbours always make a point of being present, although a far greater proportion reserve the Sunday for fishing and gunning.\"24 Kirkland mentions long guns, pistols, and hunting in a manner that suggests that they\n were normal enough parts of frontier life.25 The only gun described as old or rusty in Kirkland's book belonged to her \"neighbour, long Sam Jennings, the slowest talker in Michigan, [who] came sauntering across the yard with his rusty fowling-piece on his shoulder. . . .\" It would appear, from the fact\n that Kirkland described him as heading into the woods with this rusty gun, that it was still functional.26 Kirkland mentioned hunting as unremarkable,\n commenting on a neighbor whose husband's love of hunting left her alone and\n neglected.27 She also reported that in the woods, \"The division of labour is almost unknown\" and \"in absolutely savage life, each man is of necessity his own tailor, tentmaker, carpenter, cook, huntsman, and fisherman. . . .\"28\n Bellesiles included naturalist John James Audubon's Delineations of American\n Scenery and Character on his list of travel accounts, and this is perhaps the most disturbing example of Bellesiles misreading of a source. On page 3 Audubon described traveling along the Ohio River: \"The margins of the shores and of the river were at this season amply supplied with game. A Wild\n Turkey, a Grouse, or a Blue-winged Teal, could be procured in a few moments; and we fared well, for, whenever we pleased, we landed, struck up a fire, and provided as we were with the necessary utensils, procured a\n good repast.\"29 Not surrounded by guns? Audubon described his preparations for a trip in the forests of Pennsylvania, including \"25 pounds of shot, some flints . . . my gun Tearjacket.\" 30 (It would appear that everywhere that Audubon went, his gun was sure to follow. 31) His trip included hunting in the forest with a friend: \"The juicy venison, excellent bear flesh . . . that daily formed my food, methinks I can still enjoy.\"32 He depicted what this area must have been like before settlement: \"Bears and the Common Deer\n must have been plentiful, as, at the moment when I write, many of both kinds are seen and killed by the resident hunters.\"33 Audubon described an incident in which eight bears wandered into a clearing, driving away the woodsmen. \"Down they all rushed from the mountain; the noise spread quickly; rifles were soon procured and shouldered; but when the spot was reached, no bears were to be found. . . .\"34 Audubon's chapter on \"Navigation of the Mississippi\" described how boatmen would stop along the way when logs blocked their path. \"The time is not altogether lost, as\n most of the men, being provided with rifles, betake themselves to the woods, and search for the deer, the bears, or the turkeys, that are generally abundant there.\"35 Audubon described the flood stage of the Mississippi and the Ohio Rivers, and how \"Bears, Cougars, Lynxes, and all other quadrupeds that can ascend the trees\" were trapped at the top. \"Fatigued by the exertions which they have made in reaching the dry land, they will there stand the hunter's fire, as if to die by a ball were better than to perish amid the waste waters. On occasions like this, all these animals are shot by hundreds.\"36 How common was hunting? Audubon described a squatter's cabin, and how squatters, \"like most of those adventurous settlers in the uncultivated tracts of our frontier districts . . . [are] well versed in the chase, and acquainted with the habits of some of the larger species of quadrupeds and birds.\" Audubon then wrote about going cougar hunting with a party of squatters. \"Each hunter now moved with caution, holding his\n gun ready. . . .\"37 Audubon told of a young couple's home in the backwoods, and while he emphasized how their clothes and furniture were \"homespun\"\n and \"of domestic manufacture,\" a \"fine rifle ornamented the chimney-piece.\"38\n Audubon described another family in the Louisiana bayous, but in this case, runaway slaves. Their food supply came from wild plants and deer. \"One day, while in search of wild fruits, he found a bear dead before the muzzle of a gun that had been set for that purpose. . . . His friends at the plantation\n managed to supply him with some ammunition. . . .\"39\n Burning Forest A chapter about how the burning of forests changed the nature of the trees that grew there described an immense forest fire\n in Maine, and how the settlers responded to the fire that awakened them one night. \"We were sound asleep one night, in a cabin about a hundred miles from this, when about two hours before day, the snorting of the horses and lowing of the cattle which I had ranging in the woods suddenly awakened\n us. I took yon rifle, and went to the door to see what beast had caused the hubbub. . . .\"40\n A chapter on Kentucky sports described how Virginians moved into the Kentucky frontier. \"An axe, a couple of horses, and a heavy rifle, with store of ammunition, were all that were considered necessary. . . .\"41\n \n John James Audubon (1785-1851)\n COURTESY LIBRARY OF CONGRESS, BRADY-HANDY COLLECTION\n Kentucky sports included target shooting with rifles, and Audubon spent four pages describing practices quite similar to Gosse's account of \"driving the nail\" in 1830s Alabama.42 This form of target-shooting was apparently not a new practice, nor specific to the New World. Mourt's Relation concerning Plymouth Colony and published in 1622, used this target-shooting practice as\n a metaphor for his writing: \"though through my slender judgment I should miss the mark, and not strike the nail on the head. . . .\"43 Audubon was clearly a gun enthusiast. When a new acquaintance offered to show him the new percussion cap method of firing a gun, Audubon was anxious to see it. His friend demonstrated that it could fire under water by loading and firing it in a basin of water-inside the house.44 Guns were a fundamental part of how\n Audubon was able to produce his beautiful works on natural history. \"I drew and noted the habits of every thing which I procured, and my collection was daily augmenting, as every individual who carried a gun always sent me such birds or quadrupeds as he thought might prove useful to me.\"45 Hunting? Audubon devoted a whole chapter to \"Deer Hunting\" with rifles, distinguishing\n \"still hunting\" from \"firelight hunting,\" and \"driving.\" \"Still Hunting is followed\n as a kind of trade by most of our frontier men. To be practiced with success, it requires great activity, an expert management of the rifle, and a thorough knowledge of the forest. . . .\"46 Another section described alligator hunting: \"A rifle bullet was now and then sent through the eye of one of the largest. . . .\"47 Audubon devoted an entire chapter to \"The Moose Hunt\" in\n 1833 Maine, and of course, the hunt was with guns.48 Similarly, an entire chapter is devoted to \"A Racoon [sic] Hunt in Kentucky,\" which was carried out with rifles; it includes a detailed and picturesque description of rifle loading.49 Violence, much of it involving guns in offense or defense, is also\n not in short supply in Audubon's book.50 Bellesiles might have made the case that Audubon's travels and experiences were atypical, but to list this book by Audubon as an account that shows \"the travelers did not notice that they were surrounded by guns and violence\" defies explanation.Bellesiles also cites a travel account by Charles Dickens to prove his claim, and yet Dickens's account, like Audubon's, is awash in guns and gun violence.51 (Space precludes a discussion of gun violence that Bellesiles\n seems to have missed in his travel accounts.) Of the 80 accounts Bellesiles claims to have read, I have read 12: Audubon, Baily, Blane, Cuming, Dickens, Hall, Kirkland, Maryatt, Murray, Royall, Rynning, and Weld. Bellesiles quotes selectively and out of context from some, and misreads others. He apparently skipped whole sections of Baily, Blane, Cuming, Murray, and Hall's books, and nearly all of Audubon's. All 12 show that guns, violence, or hunting were either common or unremarkable,\n exactly opposite to Bellesiles's claims. It would be interesting to read the other 68 travel accounts to see how many others Bellesiles read so carelessly-but why bother? These 12 clearly demonstrate that the\n travelers knew that guns, violence, hunting, and combinations of the three surrounded them. You don't have to bite into every chocolate in the box when 12 of the first 12 you pick have worms in them. When Aaron Burr was tried for his criminal conspiracy in a plot to detach the Southwest into its own country, one of the pieces of evidence used against him was a meeting\n of one Harmen Blannerhassett with a number of other conspirators-all of them armed. Burr's defense attorney's argument is completely contrary to Bellesiles's claim about the early Republic: If there were evidence of a merely\n friendly meeting, it would be the same as if there were no assemblage. If they were to give evidence that Blannerhassett and some of those with him were in possession of arms, as people in this country usually are, it would not be sufficient of itself, to prove that the meeting was military. Arms are not necessarily military weapons. Rifles, shot guns and fowling pieces are used commonly by the people of this country in hunting and for domestic\n purposes; they are generally in the habit of pursuing game. In the upper\n country every man has a gun; a majority of the people have guns everywhere, for peaceful purposes. Rifles and shot guns are no more evidence of military weapons than pistols or dirks used for personal\n defence, or common fowling pieces kept for the amusement of taking game. It is lawful for every man in this country to keep such weapons.52 It is certainly possible that Burr's defense attorney was mistaken in his characterization of the level of gun ownership and hunting in America. It seems most unlikely, however, that he would make such claims if he did not believe that this argument would be persuasive. To persuade us that early Americans did not commonly own and use guns, Bellesiles would need powerful evidence of widespread self-delusion. Perhaps Bellesiles is right and dozens of eyewitnesses are wrong. Somehow, I don't think so. \u0002\n 1. Michael A. Bellesiles, Arming America: The Origins of\n a National Gun Culture (New York: Alfred A. Knopf, 2000),\n pp. 320-23.\n 2. Ibid., pp. 320-23.\n 3. Ibid., p. 306.\n 4. Clayton E. Cramer, \"Arming America,\" American Rifleman,\n January 2001.\n 5. William N. Blane, An Excursion through the United\n States and Canada, during the Years 1822-3 (New York: Negro\n Universities Press, 1969 [1824]), p. 88.\n 6. Ibid., p. 145.\n 7. Ibid., pp. 95-96.\n 8. Ibid., p. 95.\n 9. Ibid., pp. 173-74.\n 10. Ibid., p. 175.\n 11. Fortescue Cuming, Sketches of a Tour to the Western\n Country Through the States of Ohio and Kentucky; A Voyage\n Down the Ohio and Mississippi Rivers . . . (Pittsburgh, 1810),\n pp. 30, 42, 114, 118, 135.\n 12. Ibid., p. 156.\n 13. Ibid., p. 42.\n 14. Ibid., p. 30.\n 15. Bellesiles, p. 306.\n 16. Isaac Weld, Travels Through the States of North America,\n and the Provinces of Upper and Lower Canada, During the\n Years 1795, 1796, and 1797 (London: John Stockdale, 1807),\n 1:118-19.\n 17. Ibid., 1:117-19.\n 18. Ibid., 1:234.\n 19. Ibid., 2:150.\n 20. Francis Baily, Journal of a Tour in Unsettled Parts of\n North America in 1796 & 1797, ed. Jack D.L. Holmes (Carbondale,\n Ill.: Southern Illinois University, 1969), pp. 39-40.\n 21. Ibid., pp. 41-43.\n 22. Ibid., 91.\n 23. Ibid., pp. 97-98.\n 24. Caroline Matilda Kirkland, A New Home-Who'll Follow?\n Or, Glimpses of Western Life (New York: C. S. Francis,\n 1839), pp. 215-16; http://etext.lib.virginia.edu/toc/modeng/\n public/Eaf240.html.\n 25. Ibid., pp. 13, 45, 126, 130, 201, 253.\n 26. Ibid., p. 192.\n 27. Ibid., pp. 108-109, 209.\n 28. Ibid., p. 123.\n 29. John James Audubon, Delineations of American Scenery\n and Character (New York: G. A. Baker & Co., 1926), p. 3.\n 30. Ibid., p. 6.\n 31. Ibid., pp. 8, 14, 76, 117.\n 32. Ibid., pp. 7-9.\n 33. Ibid., p. 11.\n 34. Ibid., p. 12.\n 35. Ibid., p. 26.\n 36. Ibid., p. 33.\n 37. Ibid., pp. 41-47.\n 38. Ibid., p. 82.\n 39. Ibid., p. 122.\n 40. Ibid., p. 206.\n 41. Ibid., p. 57.\n 42. Philip Gosse, Letters from Alabama (London: Morgan\n & Chase, 1859), pp. 130-31, 59-63.\n 43. Dwight B. Heath, ed., Mourt's Relation: A Journal of\n the Pilgrims at Plymouth (Bedford, Mass.: Applewood Press,\n 1963), p. 88.\n 44. Audubon, p. 88.\n 45. Ibid., p. 93.\n 46. Ibid., pp. 68-75.\n 47. Ibid., pp. 177.\n 48. Ibid., pp. 210-16.\n 49. Ibid., pp. 281-6.\n 50. Ibid., pp. 16-22.\n 51. Charles Dickens, American Notes for General Circulation\n (London: 1842), pp. 185-86, 215, 275-82, at http://etext.\n lib.virginia.edu/toc/modeng/public/DicAmer.html, lists dozens\n of murders, largely committed with guns.\n 52. David Robertson, Reports of the Trials of Colonel\n Aaron Burr (New York: Da Capo Press, 1969 [1808]), 1:582.\n Ideas on Liberty \u0095 September 2002\n 22. Ibid., pp. 97-98.\n 24. Caroline Matilda Kirkland, A New Home-Who'll Follow?\n Or, Glimpses of Western Life (New York: C. S. Francis,\n 1839), pp. 215-16; http://etext.lib.virginia.edu/toc/modeng/\n public/Eaf240.html.\n 25. Ibid., pp. 13, 45, 126, 130, 201, 253.\n 26. Ibid., p. 192.\n 27. Ibid., pp. 108-109, 209.\n 28. Ibid., p. 123.\n 29. John James Audubon, Delineations of American Scenery\n and Character (New York: G. A. Baker & Co., 1926), p. 3.\n 30. Ibid., p. 6.\n 31. Ibid., pp. 8, 14, 76, 117.\n 32. Ibid., pp. 7-9.\n 33. Ibid., p. 11.\n 34. Ibid., p. 12.\n 35. Ibid., p. 26.\n 36. Ibid., p. 33.\n 37. Ibid., pp. 41-47.\n 38. Ibid., p. 82.\n 39. Ibid., p. 122.\n 40. Ibid., p. 206.\n 41. Ibid., p. 57.\n 42. Philip Gosse, Letters from Alabama (London: Morgan\n & Chase, 1859), pp. 130-31, 59-63.\n 43. Dwight B. Heath, ed., Mourt's Relation: A Journal of\n the Pilgrims at Plymouth (Bedford, Mass.: Applewood Press,\n 1963), p. 88.\n 44. Audubon, p. 88.\n 45. Ibid., p. 93.\n 46. Ibid., pp. 68-75.\n 47. Ibid., pp. 177.\n 48. Ibid., pp. 210-16.\n 49. Ibid., pp. 281-6.\n 50. Ibid., pp. 16-22.\n 51. Charles Dickens, American Notes for General Circulation\n (London: 1842), pp. 185-86, 215, 275-82, at http://etext.\n lib.virginia.edu/toc/modeng/public/DicAmer.html, lists dozens\n of murders, largely committed with guns.\n 52. David Robertson, Reports of the Trials of Colonel\n Aaron Burr (New York: Da Capo Press, 1969 [1808]), 1:582.\n I say is any of this getting thru to ya?", 
   {
    "post_info": {
     "post_title": "quotes and fraudulent quotes"
    }, 
    "unicode_changes_made": true
   }, 
   375682, 
   null, 
   1256599020.0
  ], 
  [
   375688, 
   null, 
   "OldSarge", 
   "My first shot across the bow of Arming America was to point out that Bellesiles had altered the text of the Militia Act of 1792. The text included the words: &#8220;every citizen so enrolled and notified, shall within six months thereafter, provide himself with a good musket or firelock.&#8221;[3] Bellesiles changed the passage to read: &#8220;every citizen so enrolled, shall...be constantly provided with a good musket or firelock&#8230;.&#8221;[4] This was not a trivial change; it was evidence that Bellesiles used to demonstrate that guns were rare in America, because, &#8220;Congress took upon itself the responsibility of providing those guns&#8230;.&#8221;\n \n Not just a single page as the pompous professor Wiener piously proclaims. This is a deliberate misquote that Mikey believed noone would call him on. The amazing thing is no leftist professor did so even tho that particular one is so easy to find! Any further attempts at rehabiliation of the fraud Bellesiles?", 
   {
    "post_info": {
     "post_title": "Arrogance?"
    }
   }, 
   375686, 
   null, 
   1256600760.0
  ], 
  [
   375690, 
   null, 
   "OldSarge", 
   "The true story of how, since Colonial times, an individual's right to own guns has been \"as American as apple pie\"\n Armed America \n by Clayton Cramer \n For many Americans, guns seem to be a fundamental part of the American experience - and always have been. But in 2000, Emory University history professor Michael A. Bellesiles published a startling book, Arming America: The Origins of a National Gun Culture, that challenged this conventional wisdom. Throughout American history, opined Bellesiles, guns were much rarer, and more rigorously controlled, than popular culture and gun-rights advocates would have us believe. Gun-controllers were beside themselves with delight, and Bellesiles was showered with accolades -- including the Bancroft Prize, the nation's most prestigious award for a history book.\n \n Within two short years, however, Bellesiles' scholarship would be exposed as not only shoddy but fraudulent - leading to the loss of his professorship at Emory, the revocation of his prize, and the withdrawal of his book from publication. The prime mover behind that truth campaign was Clayton Cramer, a fellow historian who had been challenging Bellesiles' false claims ever since they began circulating in academic circles. Now, in Armed America: The Remarkable Story of How and Why Guns Became as American as Apple Pie, Cramer delivers the definitive answer to Bellesiles and his anti-gun supporters - who incredibly, continue to argue that the problems with Arming America are confined to a few paragraphs.\n Cramer not only debunks Bellesiles' anti-gun myths, but takes readers along a winding historical trail full of surprising revelations and riveting anecdotes, as he explain the roots of America's gun culture. With scholarship as sound and honest as Bellesiles' was shoddy and deceptive, Cramer explains how common guns were in early America; what laws regulated their use; the practice, pastime, and sport of hunting in early America; and much more.\n \n \"The evidence this book examines is very clear,\" writes Cramer. \"Guns were a fundamental part of the American experience from the founding of the first English colonies. Americans used guns initially as tools for individual self-protection and hunting, but by the time of the American Revolution, firearms became symbols of citizenship, intimately tied to defending political rights. Gun ownership was not universal in early America -- but in every period, in every region, the evidence from written accounts, from probate inventories (the documents assessing the value of an estate after a person's death), from archaeological digs, and from official records demonstrates that gun ownership in our nation's early history was the norm -- not the exception.\" You'll discover:\n \n \n How Bellesiles repeatedly misquoted and misrepresented primary sources -- even changing the text of the federal Militia Law of 1792 to exactly reverse its meaning\n \n How every American colony required free man to own guns for militia duty - requirements that continued when the colonies became states\n \n How, in at least six colonies, the duty to be armed included bringing guns to church and other public meetings, or while traveling\n \n How restrictions on gun ownership in early America was based solely on who could be trusted (criminals, most Indians, and some - but not all - slaves need not apply)\n \n How, contrary to Bellesiles' phony scholarship, official records and personal prove overwhelmingly speak that guns in early America were widely owned and inexpensive\n \n How gunpowder production figures reveal that guns were not only widely owned - but often used\n \n Proof that hunting was not only central to the survival of the colonists - but a national pastime as well\n \n The absurd - and easily disproved - claim that Americans were desperately short of guns at the start of the Revolution, and had little or no competence with them\n \n Proof that Revolutionary gun manufacturing was an expansion of an established pre-Revolutionary industry\n \n How the \"bewildering array\" of gun types and calibers in the Continental army reflected the diversity of privately owned hunting weapons\n \n How, in early America, private gun ownership symbolized both one's individual rights and one's duties in defense of the community\n \n How, contrary to Bellesiles, eyewitness and newspaper accounts demonstrate that handguns were commonly carried in at least some parts of the U.S. - and that their presence was never a surprise\n \n Irrefutable evidence that hunting was common throughout the U.S., and near-universal on the frontier - and not just among the upper classes, as Bellesiles falsely claims", 
   {
    "post_info": {
     "post_title": "book review"
    }, 
    "unicode_changes_made": true
   }, 
   375680, 
   null, 
   1256603160.0
  ], 
  [
   375736, 
   null, 
   "Bryan", 
   "Alright I'm back. Let me answer this, Galileo: \"Furthermore, I think it's a bit of a stretch to try to discredit information from an article solely based on the fact that the author did engage in or may have engaged in falsification in another publication.\"\n \n I prefer to address the facts flat on without discrediting them simply because of the messenger. I think I did so in my first response on this thread. But Bellesiles presents a case study in credibility. Our word is our only bond, and when you ask others to believe you over someone else then you offer your own self as surety for the truthfulness of your words. And when Bellesiles answered his critics-saying they were biased, wrong, etc., and asked us to, in essence, \"believe me over them what I'm saying is the truth of the matter\"--he identified his own virtue, his own self, with the truthfulness of what he said. I believe he was found to be a liar-and in these circumstances society is entitled to view him in the future with skepticism-for he no longer has any virtue left to pledge as the guarantor of his words which society is willing to accept. This is why I am allowed to ask witnesses about prior convictions for perjury. It directly affects their credibility. Bellesiles is, in my opinion, guilty of academic perjury, and it effects how I view everything he says. \n \n (As an aside, Galileo, Robert Churchill, the author whom you cite with Bellesiles at the start of this thread, wrote what was described as a \"devastating\" critic of Bellesiles' work you will have to read for yourself offline: Robert H. Churchill, Guns and the Politics of History, 29 REVS. AM. HIST. 329 (2001).)\n \n Now Weiner has long been a Bellesiles apologist, but let me answer his criticism directly:\n \n \"Instead of focusing on the book's thesis or claims made about its contemporary significance, their strategy has been to try to discredit it by focusing attention on errors in a tiny portion of the documentation.\"\n \n True, this \"tiny portion\" of documentation was small if we are merely counting pages, but it was THE key to the book. Bellesiles claims he conducted his research over a period of years culminating in 1993. In 1996 he published an article using this research in the Journal of American History and he advanced the novel claim that guns were rare in early America. No one bothered to peer reviewed his research, and his article was awarded a prize as the best article written in the journal for that year. Then it came time to translate this research into the book which was published for a much wider audience. Bellesiles did add a lot to his book, including discussions of how Samuel Colt shrewdly marketed his revolvers, and how the industrial revolution made firearms cheaper to produce. None of this was very important or groundbreaking, however. All the praise was lavished on the book for the \"research,\" into Early American gun ownership-that \"tiny portion\" Weiner refers to became the \"proof\" that dispelled the NRA \"myth\" of common gun ownership in early America. And that is why his book drew such early adoration from the gun control movement. Gary Wills typified this adoration in his NY times book review:\n \n \"Bellesiles has dispersed the darkness that covered the gun's early history in America. He provides overwhelming evidence that our view of the gun is as deep a superstition as any that affected Native Americans in the 17th century.\" Garry Wills, Editorial, Spiking the Gun Myth, N.Y. TIMES, Sept. 10, 2000, § 7, at 5.\n \n The \"overwhelming evidence\" Wills refers to is the research which led Bellesiles to claim low counts of guns in probate records, gun censuses, militia muster records, and homicide accounts-all of which became the \"tiny portion\" of documentation in the book. \n \n I've gone back through some of my archived material on Bellesiles. First of all, here is the actual Emory report which can still be found online:\n \n http://www.emory.edu/news/Releases/Final_Report.pdf\n \n Also, I consider this source to be a good chronology of events on Bellesiles:\n \n History News Network\n \n The problems with Bellesiles' research in Arming America are legion, and are developed well in the above sites. But there are two issues in particular I want to flesh out fully here. They involve how he acted in defense of his work, and give specific examples of how he pledged his virtue as surety for the truth of what he was claiming, only to be caught in academic perjury....\n \n #1. Bellesiles' denial of his own emails\n \n When questions surfaced about his research, Bellesiles sent e-mails to a fellow academic (James Lindgren) who was trying to identify some of his sources. Bellesiles said in the e-mails that one of his sources was the National Archives in east Point, Ga. Later, Bellesiles changed his story about this source. Professor Lindgren then reminded him of the earlier and different version he provided in his emails. Bellesiles responded by denying the emails had been sent. Lindgren then reproduced them from his own e-mail archives. Bellesiles has since claimed his e-mail must have been hacked and the e-mail was fraudulently sent by someone else. You can find that saga here (and also discussed at the first HNN site I linked-where the Emory student newspaper suggested Bellesiles was lying about his e-mails):\n \n Are Michael Bellesiles's Critics Afraid to Say What They Really Think?\n \n #2. The fraudulent San Francisco probate records\n \n The problem of the San Francisco probate records is the most illustrative example of his lack of truthfulness. Bellesiles claimed that some of his research in his 1996 article and the 2000 book came from probate records of the city of San Francisco dated 1849-50 and 1858-59. He claimed to have done his research in 1993 on these records. That was challenged early, and in response he posted on his own Emory University website (long since deleted) that he had conducted his research on these records at the San Fran Superior Courthouse. Melissa Seckora of Nation Review Online interviewed Bellesiles and he again said: \n \n \"I used county probate records from the Superior Court. I had to go the courthouse -- the San Francisco Superior Court.\" \n \n Ms. Seckora checked with the Clerk of that court to verify Bellesiles' claim and was told:\n \n \"Every record at the San Francisco Superior Court predating 1906 was destroyed by fire, or other causes, in the 1906 earthquake.\" \n \n Ms. Seckora informed Bellesiles of this and he responded: \n \n \"Did I say San Francisco Superior Court? I can't remember exactly. I'm working off a dim memory. Now, if I remember correctly, the Mormon Church's Family Research Library has these records. You can try the Sutro Library, too.\" \n \n Ms. Seckora checked behind this claim. The Mormon library said it did not have probate records, only an index list: \n \n \"The index only lists names and the locations of the actual probate records. It does not list possessions.\" \n \n And the Sutro library reported it had no San Fran probate records: \n \n \"All official probate records were destroyed by the San Francisco earthquake and fire because the city hall burned down.\" \n \n Now we can engage in Ad Hominem attacks on Ms. Seckora's political beliefs (as Weiner has done about Bellesiles' critics), but Bellesiles never disputed any of this report by Ms. Seckora, which you can read here: Real History and Emory University historians\n \n In response, Bellesiles did make an unannounced trip out to California in 2002 to try and re-locate his records. But, as the Emory Report noted: \n \n \"He didn't accept the opportunity to go find the San Francisco records until a friend suggested he may have found them in Contra Costa.\" \n \n That is, he did nothing to try and resolve the location of his missing probate records until a friend suggested he go and look for some San Fran probate records at the Contra Costa County Historical Society History Center (a neighbor to San Fran). Bellesiles went there and he ultimately photocopied the files of seven probate records that had the words \"San Francisco\" somewhere in the document (Only seven-although his original claim had been research into \"hundreds\" of files from LA and San Fran). He then produced these seven photocopies and advanced a claim that this is where he did his research on San Fran probate records in 1993 (From a clip I took out of the Emory University journal \"Academic Exchange\"): \n \n \"I was not hallucinating when I read the San Francisco probate files. They are housed in the California History Center. (Complicating matters is that fact that the center, where I read these files in 1993, moved last year [to Martinez], and it does not have a website.)\" (Bold emphasis added by me)\n \n Note how he got the name of the historical society wrong. It was in fact the CCHSHC where he got the records on his 2002 trip. And, inexplicably, he took a swipe at the Center on his (now deleted) website where he said (and I have to paraphrase this because I lost it) something to the effect that the staff was unaware of the records he had found. \n \n It is important to note that on his 2002 trip he never went to the staff at this agency and asked for help replicating his research. He did sign their visitor log this time (something he apparently failed to do when he claimed to have done his original research in 1993), but he otherwise worked to reconstruct his missing San Fran records in secret. When Bellesiles released this as proof of his San Fran records research journalists and others flooded the Historical Society with requests for information. That agency was caught completely by surprise, and it responded here (note how it deals with Bellesiles' claims):\n \n Records in the Contra Costa County Historical Society History Center\n \n But it got worse for Bellesiles, for the Emory review committee also followed up on this claimed source of his records, and it discovered from Historical Society the following information: \n \n \"On p. 25 of the report [the confidential portion provided only to Emory University and never made public--Bryan] it is mentioned that the Contra Costa records in dispute and which Professor Bellesiles claimed to have read at the History Center in 1993 did not in fact go to the History Center until 1998 (they had earlier been stored in a county warehouse used to store records from the Contra Costa Superior Court.)\"\n \n Therefore, Bellesiles claim that he had found the records in the CCHSHC archives in 1993 (which I bold emphasized above) is patently false.\n \n Now if these examples are not evidence of academic fraud, then I don't know what is. They help place in context the findings of other historians who attempted to reconstruct Bellesiles' research, and who found his findings \"mathematically improbable or impossible.\"", 
   {
    "post_info": {
     "post_title": "Bellesiles and credibility"
    }, 
    "unicode_changes_made": true
   }, 
   375690, 
   null, 
   1256672460.0
  ], 
  [
   375740, 
   null, 
   "OldSarge", 
   "Alright I'm back. Let me answer this, Galileo: \"Furthermore, I think it's a bit of a stretch to try to discredit information from an article solely based on the fact that the author did engage in or may have engaged in falsification in another publication.\"\n \n I prefer to address the facts flat on without discrediting them simply because of the messenger. I think I did so in my first response on this thread. But Bellesiles presents a case study in credibility. Our word is our only bond, and when you ask others to believe you over someone else then you offer your own self as surety for the truthfulness of your words. And when Bellesiles answered his critics-saying they were biased, wrong, etc., and asked us to, in essence, \"believe me over them what I'm saying is the truth of the matter\"--he identified his own virtue, his own self, with the truthfulness of what he said. I believe he was found to be a liar-and in these circumstances society is entitled to view him in the future with skepticism-for he no longer has any virtue left to pledge as the guarantor of his words which society is willing to accept. This is why I am allowed to ask witnesses about prior convictions for perjury. It directly affects their credibility. Bellesiles is, in my opinion, guilty of academic perjury, and it effects how I view everything he says. \n \n (As an aside, Galileo, Robert Churchill, the author whom you cite with Bellesiles at the start of this thread, wrote what was described as a \"devastating\" critic of Bellesiles' work you will have to read for yourself offline: Robert H. Churchill, Guns and the Politics of History, 29 REVS. AM. HIST. 329 (2001).)\n \n Now Weiner has long been a Bellesiles apologist, but let me answer his criticism directly:\n \n \"Instead of focusing on the book's thesis or claims made about its contemporary significance, their strategy has been to try to discredit it by focusing attention on errors in a tiny portion of the documentation.\"\n \n True, this \"tiny portion\" of documentation was small if we are merely counting pages, but it was THE key to the book. Bellesiles claims he conducted his research over a period of years culminating in 1993. In 1996 he published an article using this research in the Journal of American History and he advanced the novel claim that guns were rare in early America. No one bothered to peer reviewed his research, and his article was awarded a prize as the best article written in the journal for that year. Then it came time to translate this research into the book which was published for a much wider audience. Bellesiles did add a lot to his book, including discussions of how Samuel Colt shrewdly marketed his revolvers, and how the industrial revolution made firearms cheaper to produce. None of this was very important or groundbreaking, however. All the praise was lavished on the book for the \"research,\" into Early American gun ownership-that \"tiny portion\" Weiner refers to became the \"proof\" that dispelled the NRA \"myth\" of common gun ownership in early America. And that is why his book drew such early adoration from the gun control movement. Gary Wills typified this adoration in his NY times book review:\n \n \"Bellesiles has dispersed the darkness that covered the gun's early history in America. He provides overwhelming evidence that our view of the gun is as deep a superstition as any that affected Native Americans in the 17th century.\" Garry Wills, Editorial, Spiking the Gun Myth, N.Y. TIMES, Sept. 10, 2000, § 7, at 5.\n \n The \"overwhelming evidence\" Wills refers to is the research which led Bellesiles to claim low counts of guns in probate records, gun censuses, militia muster records, and homicide accounts-all of which became the \"tiny portion\" of documentation in the book. \n \n I've gone back through some of my archived material on Bellesiles. First of all, here is the actual Emory report which can still be found online:\n \n http://www.emory.edu/news/Releases/Final_Report.pdf\n \n Also, I consider this source to be a good chronology of events on Bellesiles:\n \n History News Network\n \n The problems with Bellesiles' research in Arming America are legion, and are developed well in the above sites. But there are two issues in particular I want to flesh out fully here. They involve how he acted in defense of his work, and give specific examples of how he pledged his virtue as surety for the truth of what he was claiming, only to be caught in academic perjury....\n \n #1. Bellesiles' denial of his own emails\n \n When questions surfaced about his research, Bellesiles sent e-mails to a fellow academic (James Lindgren) who was trying to identify some of his sources. Bellesiles said in the e-mails that one of his sources was the National Archives in east Point, Ga. Later, Bellesiles changed his story about this source. Professor Lindgren then reminded him of the earlier and different version he provided in his emails. Bellesiles responded by denying the emails had been sent. Lindgren then reproduced them from his own e-mail archives. Bellesiles has since claimed his e-mail must have been hacked and the e-mail was fraudulently sent by someone else. You can find that saga here (and also discussed at the first HNN site I linked-where the Emory student newspaper suggested Bellesiles was lying about his e-mails):\n \n Are Michael Bellesiles's Critics Afraid to Say What They Really Think?\n \n #2. The fraudulent San Francisco probate records\n \n The problem of the San Francisco probate records is the most illustrative example of his lack of truthfulness. Bellesiles claimed that some of his research in his 1996 article and the 2000 book came from probate records of the city of San Francisco dated 1849-50 and 1858-59. He claimed to have done his research in 1993 on these records. That was challenged early, and in response he posted on his own Emory University website (long since deleted) that he had conducted his research on these records at the San Fran Superior Courthouse. Melissa Seckora of Nation Review Online interviewed Bellesiles and he again said: \n \n \"I used county probate records from the Superior Court. I had to go the courthouse -- the San Francisco Superior Court.\" \n \n Ms. Seckora checked with the Clerk of that court to verify Bellesiles' claim and was told:\n \n \"Every record at the San Francisco Superior Court predating 1906 was destroyed by fire, or other causes, in the 1906 earthquake.\" \n \n Ms. Seckora informed Bellesiles of this and he responded: \n \n \"Did I say San Francisco Superior Court? I can't remember exactly. I'm working off a dim memory. Now, if I remember correctly, the Mormon Church's Family Research Library has these records. You can try the Sutro Library, too.\" \n \n Ms. Seckora checked behind this claim. The Mormon library said it did not have probate records, only an index list: \n \n \"The index only lists names and the locations of the actual probate records. It does not list possessions.\" \n \n And the Sutro library reported it had no San Fran probate records: \n \n \"All official probate records were destroyed by the San Francisco earthquake and fire because the city hall burned down.\" \n \n Now we can engage in Ad Hominem attacks on Ms. Seckora's political beliefs (as Weiner has done about Bellesiles' critics), but Bellesiles never disputed any of this report by Ms. Seckora, which you can read here: Real History and Emory University historians\n \n In response, Bellesiles did make an unannounced trip out to California in 2002 to try and re-locate his records. But, as the Emory Report noted: \n \n \"He didn't accept the opportunity to go find the San Francisco records until a friend suggested he may have found them in Contra Costa.\" \n \n That is, he did nothing to try and resolve the location of his missing probate records until a friend suggested he go and look for some San Fran probate records at the Contra Costa County Historical Society History Center (a neighbor to San Fran). Bellesiles went there and he ultimately photocopied the files of seven probate records that had the words \"San Francisco\" somewhere in the document (Only seven-although his original claim had been research into \"hundreds\" of files from LA and San Fran). He then produced these seven photocopies and advanced a claim that this is where he did his research on San Fran probate records in 1993 (From a clip I took out of the Emory University journal \"Academic Exchange\"): \n \n \"I was not hallucinating when I read the San Francisco probate files. They are housed in the California History Center. (Complicating matters is that fact that the center, where I read these files in 1993, moved last year [to Martinez], and it does not have a website.)\" (Bold emphasis added by me)\n \n Note how he got the name of the historical society wrong. It was in fact the CCHSHC where he got the records on his 2002 trip. And, inexplicably, he took a swipe at the Center on his (now deleted) website where he said (and I have to paraphrase this because I lost it) something to the effect that the staff was unaware of the records he had found. \n \n It is important to note that on his 2002 trip he never went to the staff at this agency and asked for help replicating his research. He did sign their visitor log this time (something he apparently failed to do when he claimed to have done his original research in 1993), but he otherwise worked to reconstruct his missing San Fran records in secret. When Bellesiles released this as proof of his San Fran records research journalists and others flooded the Historical Society with requests for information. That agency was caught completely by surprise, and it responded here (note how it deals with Bellesiles' claims):\n \n Records in the Contra Costa County Historical Society History Center\n \n But it got worse for Bellesiles, for the Emory review committee also followed up on this claimed source of his records, and it discovered from Historical Society the following information: \n \n \"On p. 25 of the report [the confidential portion provided only to Emory University and never made public--Bryan] it is mentioned that the Contra Costa records in dispute and which Professor Bellesiles claimed to have read at the History Center in 1993 did not in fact go to the History Center until 1998 (they had earlier been stored in a county warehouse used to store records from the Contra Costa Superior Court.)\"\n \n Therefore, Bellesiles claim that he had found the records in the CCHSHC archives in 1993 (which I bold emphasized above) is patently false.\n \n Now if these examples are not evidence of academic fraud, then I don't know what is. They help place in context the findings of other historians who attempted to reconstruct Bellesiles' research, and who found his findings \"mathematically improbable or impossible.\"\n\n \n As usual an outstanding job sir. This should lay to rest any delusions whatsoever that Bellesiles has a shred of credibility. ", 
   {
    "post_info": {
     "post_title": "Game, set and match"
    }, 
    "unicode_changes_made": true
   }, 
   375736, 
   null, 
   1256675640.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun Control in Early America", 
  "url": "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13469, 
  "discussion_files": [
   [
    "22861.html", 
    "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america-print.html"
   ], 
   [
    "22862.html", 
    "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america-5-print.html"
   ], 
   [
    "22863.html", 
    "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america-4-print.html"
   ], 
   [
    "22864.html", 
    "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america-3-print.html"
   ], 
   [
    "22865.html", 
    "http://www.4forums.com/political/gun-control-debates/13469-gun-control-early-america-2-print.html"
   ]
  ], 
  "identifier": 13469
 }
]