[
 [
  [
   25602, 
   null, 
   "bud095", 
   "ok! i personally dont have a religion! and im not trying to cause trouble but what is the true religion? wich one is the only one?", 
   {
    "post_info": {
     "post_title": "religion"
    }
   }, 
   null, 
   null, 
   1070616360.0
  ], 
  [
   25608, 
   null, 
   "montalban", 
   "Interesting question.\n What has this to do with creation/evolution?", 
   {}, 
   25602, 
   null, 
   1070627460.0
  ], 
  [
   25623, 
   null, 
   "Charchuk", 
   "ok! i personally dont have a religion! and im not trying to cause trouble but what is the true religion? wich one is the only one?\n\n \n I just read an interesting short SF story in which the author basically said that all theistic religions are tautologies. in that to them god does exist, elseways the world wouldn't be here, so the fact that the world is here proves that their god exists. Round and round in circles. In other words circular logic. They all are true and none of them are true. All religious claims are equal.", 
   {}, 
   25602, 
   null, 
   1070635680.0
  ], 
  [
   25632, 
   null, 
   "montalban", 
   "I just read an interesting short SF story in which the author basically said that all theistic religions are tautologies. in that to them god does exist, elseways the world wouldn't be here, so the fact that the world is here proves that their god exists. Round and round in circles. In other words circular logic. They all are true and none of them are true. All religious claims are equal.\n\n \n \n The same is said of evolution. All the animals that exist prove evolution - as how else could these animals be here?", 
   {}, 
   25623, 
   null, 
   1070636940.0
  ], 
  [
   25638, 
   null, 
   "bud095", 
   "Interesting question.\n What has this to do with creation/evolution?\n\n i most likley posted in the wrong spot im sorry bout that i m fairly new to computers.", 
   {}, 
   25608, 
   null, 
   1070644020.0
  ], 
  [
   25643, 
   null, 
   "bud095", 
   "just intrested in everyones opinion if i were looking for one what it should be?", 
   {}, 
   25638, 
   null, 
   1070645100.0
  ], 
  [
   25649, 
   null, 
   "Charchuk", 
   "just intrested in everyones opinion if i were looking for one what it should be?\n\n \n They will all tell you that their's is the only true belief and they can only offer you blind faith as their proof.", 
   {}, 
   25643, 
   null, 
   1070648460.0
  ], 
  [
   25669, 
   null, 
   "gilligan8503", 
   "just intrested in everyones opinion if i were looking for one what it should be?\n\n non-worshiping buddhism, or zen buddhism, is a good place to start; it is sometimes considered a philosophy because the point in practicing is to achieve enlightenment. this is what we should all be searching for.", 
   {}, 
   25643, 
   null, 
   1070655180.0
  ], 
  [
   25693, 
   null, 
   "epaphras_faith", 
   "non-worshiping buddhism, or zen buddhism, is a good place to start; it is sometimes considered a philosophy because the point in practicing is to achieve enlightenment. this is what we should all be searching for.\n\n \n I agree with gilligan about what we are searching for.......to a point. I disagree with the way to go. I would suggest you look for the truth. Look at everything..........see which matches up best with reality, try it out, see where you go. \n \n For your info, I am christian. Char will hopefully note that I did not tell you to seek christianity. Try on that which you think is true and see what effect it has in your life. Do not always listen to your emotions but get objective opinions from others that know you and care about you. \n \n Blind faith implies that it is never tested. I am saying, test it and see what happens. Trust that which is trust worthy, trust not that which is not.", 
   {}, 
   25669, 
   null, 
   1070666940.0
  ], 
  [
   25699, 
   null, 
   "montalban", 
   "ok! i personally dont have a religion! and im not trying to cause trouble but what is the true religion? wich one is the only one?\n\n \n \n If you don't have a religion - why are you seeking a 'true one'? Are you looking for God? Are you just trying to pit Christians vs non-Christians (are you an agent provocateur)?\n \n What are your parameters for 'true'?", 
   {}, 
   25602, 
   null, 
   1070667840.0
  ], 
  [
   25712, 
   null, 
   "bud095", 
   "If you don't have a religion - why are you seeking a 'true one'? Are you looking for God? Are you just trying to pit Christians vs non-Christians (are you an agent provocateur)?\n \n What are your parameters for 'true'?\n\n im just curious! i mean no harm, im wondering how many religions their are and whats involved.my wife is a catholic and shes non-practicing .and i guess by (true) i meant why do you prefer such religion . im not an (agent provocteur) i dont want to pit anyone against anyone ,i see enough of that already on this forum! i have only been to church a few times mostly for funerals (wich is not a fun thing) im just curious is all. i am sincear about this!", 
   {}, 
   25699, 
   null, 
   1070669100.0
  ], 
  [
   25743, 
   null, 
   "montalban", 
   "im just curious! i mean no harm, im wondering how many religions their are and whats involved.my wife is a catholic and shes non-practicing .and i guess by (true) i meant why do you prefer such religion . im not an (agent provocteur) i dont want to pit anyone against anyone ,i see enough of that already on this forum! i have only been to church a few times mostly for funerals (wich is not a fun thing) im just curious is all. i am sincear about this!\n\n \n \n Many people believe that their own religion is true... I would question why they'd be in a faith if they didn't believe in its truth.\n \n I am an Orthodox Christian. I hold not only Christianity to be true, but my particular group (brand?) to be true.\n \n If you want to know why... it's harder for me to explain Christianity as a truth, than my own particular group.\n \n If you accept Christianity then you would want to follow the way that Christ taught (at least that is my parameter).* I have, through my own readings and research been brought to the conclusion that Orthodoxy is the best fit for these conditions.\n \n I was not born into Orthodoxy, and thus have given a great deal of thought before moving to this old church. I am hamstrung by a few things though - a division exists in Orthodoxy based on national groups - each group uses their own language to say the same thing. The church I go to is Antiochian. They use Arabic in most their services. I don't speak Arabic. My knowledge of language is confined to English (with a little bit of Gaelic and Irish). I thus go to a service that is the only one available in English.\n \n *Some people seem to choose a group based on life-style. You can 'shop around' for the church that you feel most suits you. For me Church is not about 'fun' it's about duty - it is what we should do.", 
   {}, 
   25712, 
   null, 
   1070684220.0
  ], 
  [
   25992, 
   null, 
   "Leigha941", 
   "I don't know why people even question if there is a God. God is there no matter what anyone says. Just because people have their own pinion on the bible, it doesn't prove that there is no God.There isn't any scientific evidence of God and there probaly will never be because if there was, everybody would just believein him. That's not what God wants, God wants people to have faith and that's what God is about.\n Maybe there isn't one religion, but I know what God wants. God wants people to have faith in him, pray and ask him to come into their heart, and obey the ten commandments. Just look at the world today. Alot of christans I see are happy and loving people., People who do not believe in God are out raping, murdering innocent people. I'm not saying that all non believers are like that, but I believe that is what's wrong with the world today. If you have faith in God he can change your life forever. If you are an alcoholic or are addicted to any other drugs, God can take those cravings away., I have seen it done. Think about it, we are talking about eternal life here. You ask Jesus to come into your heart and be the Christian he wants you to beyou will have eternal life in heaven. If you don't believe you spend eternal life in hell. Can you even imagin how long eternal is?I don't know about you, but I don't want to spend eternal life in hell. The only proof is faith. There's no harm in believing.", 
   {
    "post_info": {
     "post_title": "Creation vs. evolution"
    }
   }, 
   25602, 
   null, 
   1070787060.0
  ], 
  [
   26006, 
   null, 
   "Leviathan", 
   "Bud,\n \n I am of no religion. Definitively, I am confined to atheism, but I am not truly atheist. It is difficult to explain.\n \n However, my ex-girlfriend is Christian. We've had many (frustrating) debates over such issues. We can both agree on one point however: There is no religion. There is only faith. Giligan is a fine scholar, from what I have seen thus far, and I have to agree with his methodologies. You should take heart from all wealths of knowledge and reach a common truth.\n \n I have but one other important piece of advice to offer: The answer lay inside yourself. Take that one to the grave with you.\n \n In angered response to Leigha's atheistic rape and crime comment, I would like to point out that Mr. William Clinton and Mr. George Bush are such fine, devout Christians and that their actions, in the white house, are in no way comparable to those of us horrible, horrible atheists. ;\\\n \n \n So yea, it's kind of like that.\n LEVIATHAN", 
   {}, 
   25992, 
   null, 
   1070795340.0
  ], 
  [
   26008, 
   null, 
   "montalban", 
   "Bud,\n \n I am of no religion. Definitively, I am confined to atheism, but I am not truly atheist. It is difficult to explain.\n \n However, my ex-girlfriend is Christian. We've had many (frustrating) debates over such issues. We can both agree on one point however: There is no religion. There is only faith. Giligan is a fine scholar, from what I have seen thus far, and I have to agree with his methodologies. You should take heart from all wealths of knowledge and reach a common truth.\n \n I have but one other important piece of advice to offer: The answer lay inside yourself. Take that one to the grave with you.\n \n In angered response to Leigha's atheistic rape and crime comment, I would like to point out that Mr. William Clinton and Mr. George Bush are such fine, devout Christians and that their actions, in the white house, are in no way comparable to those of us horrible, horrible atheists. ;\\\n \n \n So yea, it's kind of like that.\n LEVIATHAN\n\n \n Don't confuse faith with faiths.\n \n \n Have you no heard of \"dogma\"?* My Church is a religion because it sets out dogmatic beliefs. These are in part distinct from other faiths.\n \n \n \n *And I'm not talking about the film style.", 
   {}, 
   26006, 
   null, 
   1070796000.0
  ], 
  [
   26014, 
   null, 
   "Leviathan", 
   "Don't confuse faith with faiths.\n \n \n Have you no heard of \"dogma\"?* My Church is a religion because it sets out dogmatic beliefs. These are in part distinct from other faiths.\n \n \n \n *And I'm not talking about the film style.\n\n \n \n \n Uhh... Okay... According to Montalban, all Christians do not serve a common faith. Mybad...\n \n \n \n Lev.", 
   {}, 
   26008, 
   null, 
   1070798220.0
  ], 
  [
   26030, 
   null, 
   "Charchuk", 
   "I don't know why people even question if there is a God. God is there no matter what anyone says. Just because people have their own pinion on the bible, it doesn't prove that there is no God.There isn't any scientific evidence of God and there probaly will never be because if there was, everybody would just believein him. That's not what God wants, God wants people to have faith and that's what God is about.\n Maybe there isn't one religion, but I know what God wants. God wants people to have faith in him, pray and ask him to come into their heart, and obey the ten commandments. Just look at the world today. Alot of christans I see are happy and loving people., People who do not believe in God are out raping, murdering innocent people. I'm not saying that all non believers are like that, but I believe that is what's wrong with the world today. If you have faith in God he can change your life forever. If you are an alcoholic or are addicted to any other drugs, God can take those cravings away., I have seen it done. Think about it, we are talking about eternal life here. You ask Jesus to come into your heart and be the Christian he wants you to beyou will have eternal life in heaven. If you don't believe you spend eternal life in hell. Can you even imagin how long eternal is?I don't know about you, but I don't want to spend eternal life in hell. The only proof is faith. There's no harm in believing.\n\n \n Thta is basically just a tautologically arguement topped off with a variation of Pascal's Wager.", 
   {}, 
   25992, 
   null, 
   1070810520.0
  ], 
  [
   26031, 
   null, 
   "Charchuk", 
   "ok! i personally dont have a religion! and im not trying to cause trouble but what is the true religion? wich one is the only one?\n\n \n I have found that to many people religion is no different than a drug addiction, with the exception that much of the real harm is not done to the addict, but to the non-addict instead. It is no mistake that Star Trek's The Borg are compared to and modeled after Christianity.", 
   {}, 
   25602, 
   null, 
   1070811000.0
  ], 
  [
   26186, 
   null, 
   "montalban", 
   "I have found that to many people religion is no different than a drug addiction, with the exception that much of the real harm is not done to the addict, but to the non-addict instead. It is no mistake that Star Trek's The Borg are compared to and modeled after Christianity.\n\n \n You mean to say that the Borg are modelled after Christians.\n \n It would be interesting if you actually cite a site to which you refer. Just for a change.", 
   {}, 
   26031, 
   null, 
   1070882100.0
  ], 
  [
   26281, 
   null, 
   "epaphras_faith", 
   "I have found that to many people religion is no different than a drug addiction, with the exception that much of the real harm is not done to the addict, but to the non-addict instead. It is no mistake that Star Trek's The Borg are compared to and modeled after Christianity.\n\n \n Actually, they are modeled after an insect colony.", 
   {}, 
   26031, 
   null, 
   1070922060.0
  ], 
  [
   26294, 
   null, 
   "Charchuk", 
   "Actually, they are modeled after an insect colony.\n\n \n Only in part. They've said that it is modeled after Christianity. The \"philosophy\" of The Borg is no different than that of the Church for most of its history. The Borg wanted to bring \"perfection\" to All and the Church wanted to bring the \"perfection\" of their god to all. Each didn't care if others didn't want it. \"Resistence is futile, you will be assimulated.\"", 
   {}, 
   26281, 
   null, 
   1070924160.0
  ], 
  [
   26295, 
   null, 
   "gilligan8503", 
   "i found this (it is a document):\n \n www.ianjackson.flyer.co.uk/xb.doc", 
   {}, 
   26281, 
   null, 
   1070924220.0
  ], 
  [
   26302, 
   null, 
   "epaphras_faith", 
   "i found this (it is a document):\n \n www.ianjackson.flyer.co.uk/xb.doc\n\n \n The document is interesting. However, the analogy breaks down as the bord experience no emotion. Not just no pain but no positive emotions either. Heaven is described as a place of great joy!", 
   {}, 
   26295, 
   null, 
   1070925480.0
  ], 
  [
   26308, 
   null, 
   "Charchuk", 
   "The document is interesting. However, the analogy breaks down as the bord experience no emotion. Not just no pain but no positive emotions either. Heaven is described as a place of great joy!\n\n \n Many Christians believe that the only true form of love is that of their god, and any they may feel towards each other or their families is nothing in comparison. The Borg have harmony of thought and mind. Perfection as the Borg Queen puts it. They are One. Christians when they die want to be One with their god as well. Assimulation and death are the say thing in this regard when going to the All Mind. Individuality is meaningless to each as well. Christians call it self-sacrifce.", 
   {}, 
   26302, 
   null, 
   1070927040.0
  ], 
  [
   26311, 
   null, 
   "epaphras_faith", 
   "egads the everpresent \"many christians believe\" argument.", 
   {}, 
   26308, 
   null, 
   1070928960.0
  ], 
  [
   26438, 
   null, 
   "superbuddhaman", 
   "I don't know why people even question if there is a God. God is there no matter what anyone says. Just because people have their own pinion on the bible, it doesn't prove that there is no God.There isn't any scientific evidence of God and there probaly will never be because if there was, everybody would just believein him. That's not what God wants, God wants people to have faith and that's what God is about.\n Maybe there isn't one religion, but I know what God wants. God wants people to have faith in him, pray and ask him to come into their heart, and obey the ten commandments. Just look at the world today. Alot of christans I see are happy and loving people., People who do not believe in God are out raping, murdering innocent people. I'm not saying that all non believers are like that, but I believe that is what's wrong with the world today. If you have faith in God he can change your life forever. If you are an alcoholic or are addicted to any other drugs, God can take those cravings away., I have seen it done. Think about it, we are talking about eternal life here. You ask Jesus to come into your heart and be the Christian he wants you to beyou will have eternal life in heaven. If you don't believe you spend eternal life in hell. Can you even imagin how long eternal is?I don't know about you, but I don't want to spend eternal life in hell. The only proof is faith. There's no harm in believing.\n\n \n \n Where do I start?\n God... is a concept, created by man to explain the things he can not logically do on his own. You should realize that the idea of a single all-powerful deity is rather new in terms of world history, and that in calling this belief truth, you are calling every other religion false.\n Are you really scholarly enough to deny the learned teachers of the past?\n Do you think you can refute my claim that the bible is a ripoff of earlier religions?\n \n I am a buddhist, which means that I follow the teachings of the buddha, who lived more than 500 years before Christ, and who's existence is not doubted, and who's followers all agree on the essentials of their religion.\n (you can't say that about christianity, can you?)\n But buddhism is still rather young in terms of world religion, which is believed to have begun in Mesopotamia, a far reach from Bethlehem.\n \n buddhism has been called a philosophy rather than a religion, but I dare anyone to walk into a temple and tell the master who practices hard each and every day religiously, that he has no religion.\n \n But while I hold buddhism to be true for me, I make no presumption that it shall hold true for anyone else, which is my biggest problem with christianity's claim to hold the \"ultimate truth\"\n \n We all have different questions- why would the answer be the same for all of them?\n \n And no, dear, I won't spend my eternity in hell any more than you will spend yours being reborn as a worm.\n \n Oh yeah, I wanted to remind you that in the case of proving the existence of god, the existence of anything, the burden of proof always lies on the positive.\n You have to prove that he exists, there is no call for us to prove he doesn't.\n What would you like me to do? point at the big empty spot? Bring your attention to the nothingness?\n heehee, that's what we buddhists do.........point at nothing.", 
   {}, 
   25992, 
   null, 
   1070978820.0
  ], 
  [
   26468, 
   null, 
   "Charchuk", 
   "egads the everpresent \"many christians believe\" argument.\n\n \n They do wheither you like it or not.", 
   {}, 
   26311, 
   null, 
   1070998500.0
  ], 
  [
   26503, 
   null, 
   "montalban", 
   "Only in part. They've said that it is modeled after Christianity. The \"philosophy\" of The Borg is no different than that of the Church for most of its history. The Borg wanted to bring \"perfection\" to All and the Church wanted to bring the \"perfection\" of their god to all. Each didn't care if others didn't want it. \"Resistence is futile, you will be assimulated.\"\n\n \n Who is 'they' this time?", 
   {}, 
   26294, 
   null, 
   1071012900.0
  ], 
  [
   26504, 
   null, 
   "montalban", 
   "egads the everpresent \"many christians believe\" argument.\n\n \n Borg as Christians...\n I think you should leave that argument as it's getting rather silly", 
   {}, 
   26311, 
   null, 
   1071013020.0
  ], 
  [
   26505, 
   null, 
   "montalban", 
   "Where do I start?\n God... is a concept, created by man to explain the things he can not logically do on his own. You should realize that the idea of a single all-powerful deity is rather new in terms of world history, and that in calling this belief truth, you are calling every other religion false.\n Are you really scholarly enough to deny the learned teachers of the past?\n Do you think you can refute my claim that the bible is a ripoff of earlier religions?\n \n I am a buddhist, which means that I follow the teachings of the buddha, who lived more than 500 years before Christ, and who's existence is not doubted, and who's followers all agree on the essentials of their religion.\n (you can't say that about christianity, can you?)\n But buddhism is still rather young in terms of world religion, which is believed to have begun in Mesopotamia, a far reach from Bethlehem.\n \n buddhism has been called a philosophy rather than a religion, but I dare anyone to walk into a temple and tell the master who practices hard each and every day religiously, that he has no religion.\n \n But while I hold buddhism to be true for me, I make no presumption that it shall hold true for anyone else, which is my biggest problem with christianity's claim to hold the \"ultimate truth\"\n \n We all have different questions- why would the answer be the same for all of them?\n \n And no, dear, I won't spend my eternity in hell any more than you will spend yours being reborn as a worm.\n \n Oh yeah, I wanted to remind you that in the case of proving the existence of god, the existence of anything, the burden of proof always lies on the positive.\n You have to prove that he exists, there is no call for us to prove he doesn't.\n What would you like me to do? point at the big empty spot? Bring your attention to the nothingness?\n heehee, that's what we buddhists do.........point at nothing.\n\n \n Some things are true whether you want them to hold true or not.\n \n That Christianity claims to hold to some truths you find odd - I find odd. Why should there not be a claim to truth?\n \n For you, the simple truth is that there is no one truth!", 
   {}, 
   26438, 
   null, 
   1071013260.0
  ], 
  [
   26598, 
   null, 
   "superbuddhaman", 
   "Some things are true whether you want them to hold true or not.\n \n That Christianity claims to hold to some truths you find odd - I find odd. Why should there not be a claim to truth?\n \n For you, the simple truth is that there is no one truth!\n\n \n \n For something to hold true as you put it, there has to be evidence, and the only evidence I have ever seen of the bible, haha, is the bible itself.\n \n And no, there is no one truth, concering things such as religion, faith, spirituality etc.\n \n Your opinion seems to be that this book, badly written and greatly edited though it may be, is the \"ultimate\" truth. A truly fantastic (by that I mean pure fantasy) idea. and fanatical idea as well.", 
   {}, 
   26505, 
   null, 
   1071043560.0
  ], 
  [
   26607, 
   null, 
   "montalban", 
   "For something to hold true as you put it, there has to be evidence, and the only evidence I have ever seen of the bible, haha, is the bible itself.\n\n \n \n This is a very limited viewpoint you have. I for one do not support a belief in 'bible only' Christianity. If you knew something (anything really) about Orthodoxy (my faith) you'd not have made that statement.\n \n Sola scriptura (bible-only) is the basis of Protestant faiths. The two largest (Catholicism, Orthodoxy) hold fast to Holy Tradition and the Bible.\n \n \nAnd no, there is no one truth, concering things such as religion, faith, spirituality etc.\n\n \n Exactly what I said before. You hold this to be true; that there are no truths in religion. I could therefore claim that this is a rather dogmatic stance of yours. This axiomatic argument you post is like mine, only the mirror.\n \n \nYour opinion seems to be that this book, badly written and greatly edited though it may be, is the \"ultimate\" truth. A truly fantastic (by that I mean pure fantasy) idea. and fanatical idea as well.\n\n \n There is a lot of unsupported allegations here. Firstly, you make an assumption about my faith. As mentioned above, you have not an iota of knowledge about it to claim that I hold the Bible as the sole 'ultimate' truth. I would never put the Bible above my Church.\n \n The other allegations revolve around your view of the Bible itself. They are so generalised I will not respond.", 
   {}, 
   26598, 
   null, 
   1071046260.0
  ], 
  [
   26613, 
   null, 
   "Leviathan", 
   "For something to hold true as you put it, there has to be evidence, and the only evidence I have ever seen of the bible, haha, is the bible itself.\n \n And no, there is no one truth, concering things such as religion, faith, spirituality etc.\n \n Your opinion seems to be that this book, badly written and greatly edited though it may be, is the \"ultimate\" truth. A truly fantastic (by that I mean pure fantasy) idea. and fanatical idea as well.\n\n \n \n 1.)Nothing has a single tangible truth. period.\n 2.)The truth about faith is that, to the illogical, it is the truth.\n 3.)The truth about logic is that, to the faithless, it is the truth.\n 4.)Humanity grew up with both faith and logic.\n ----------\n \n CONCEPTS\n Logic is that which is proven and disproven.\n Faith is that which cannot be proven or disproven.\n \n These two arguements are, and always will be, incoherent and inarguable unto each other, and both concepts will always point at each other and claim stupidity.\n \n While I technically consider myself atheist, I am an open-minded vantage point on the subject. I know what faith means, but I cannot argue it. It isn't possible because it is not logical. Faith understands that logic is an invention of a higher power.\n \n I know what logic is, but I cannot argue it, because it will prove itself. Logic understands that anything that science cannot explain cannot exist.\n ------\n \n FLAWS\n Faiths major flaw: Insubstantial logical evidence\n Logics major flaw: Incapability to disprove faith\n \n Faith has no leg to stand on when it comes to logical evidence. There is no actual proof that the many characters who contributed to complete work of the Bible ever even existed.\n \n Logic will always fail to disprove faith. Logic has no proof of the beggining of time, the creation of our planet, or how the first life-forms came into existence. Even if it had, it is simply part of the perfection of faith's 'master plan'.\n ------\n \n BOTTOMLINE\n Neither arguement can ever win. They are incompatible arguements. Truth is devoid of meaning. The arguement is a Great Mistake and quite a source of entertainment from the sidelines. One might consider it an 'inside joke'. =)\n \n \n \n LEVIATHAN", 
   {}, 
   26598, 
   null, 
   1071048540.0
  ], 
  [
   26615, 
   null, 
   "superbuddhaman", 
   "i apologise for any assumption on my part of your beliefs. I actually might have confused you with someone else, for that I also apologise. I probably should learn a bit about orthodoxy, in fact, I will make a point of it.\n But I have already discarded any and all monotheistic religions for being uninspired, simplistic, and unrealistic. But that is an opinion I am allowed to have, and will elaborate on if you wish.\n \n \n \n\n Exactly what I said before. You hold this to be true; that there are no truths in religion. I could therefore claim that this is a rather dogmatic stance of yours. This axiomatic argument you post is like mine, only the mirror.\n\n No, what I said was that every religion offers its followers a version of truth, and that to everyone, religious or not, there is something they hold to be truth. But I refuse to believe that there is one religion that offers some ultimate truth, therefore negating all others. while I may wish everyone would wake up tomorrow as a buddhist, I realize that not everyone would be happyor fulfilled that way. \n \n \n\n The other allegations revolve around your view of the Bible itself. They are so generalised I will not respond.\n\n ohhhh, so you'd rather I had a specialized view of your religion's edition of the bible rather than that of a methodists? Or that i should have some specialized views on each seperate book of the bible. \n I have read the bible, including other scriptures that have either not been included, or have been edited out somewhere over the years. Funny, the best works are those that have been removed from the bible, such as the Gospel of Thomas.\n \n There is one good thing... I can't think of any major religion that offers a teaching of anything but love and respect for yourself and others. And I am relieved to think that any violence done in the name of any religion is not only wrong, but in direct contravention of that religion.", 
   {}, 
   26607, 
   null, 
   1071048840.0
  ], 
  [
   26735, 
   null, 
   "montalban", 
   "1.)Nothing has a single tangible truth. period.\n 2.)The truth about faith is that, to the illogical, it is the truth.\n 3.)The truth about logic is that, to the faithless, it is the truth.\n 4.)Humanity grew up with both faith and logic.\n ----------\n \n CONCEPTS\n Logic is that which is proven and disproven.\n Faith is that which cannot be proven or disproven.\n \n These two arguements are, and always will be, incoherent and inarguable unto each other, and both concepts will always point at each other and claim stupidity.\n \n While I technically consider myself atheist, I am an open-minded vantage point on the subject. I know what faith means, but I cannot argue it. It isn't possible because it is not logical. Faith understands that logic is an invention of a higher power.\n \n I know what logic is, but I cannot argue it, because it will prove itself. Logic understands that anything that science cannot explain cannot exist.\n ------\n \n FLAWS\n Faiths major flaw: Insubstantial logical evidence\n Logics major flaw: Incapability to disprove faith\n \n Faith has no leg to stand on when it comes to logical evidence. There is no actual proof that the many characters who contributed to complete work of the Bible ever even existed.\n \n Logic will always fail to disprove faith. Logic has no proof of the beggining of time, the creation of our planet, or how the first life-forms came into existence. Even if it had, it is simply part of the perfection of faith's 'master plan'.\n ------\n \n BOTTOMLINE\n Neither arguement can ever win. They are incompatible arguements. Truth is devoid of meaning. The arguement is a Great Mistake and quite a source of entertainment from the sidelines. One might consider it an 'inside joke'. =)\n \n \n \n LEVIATHAN\n\n \n I like this post. It reminds me of a division in thinking between western Christendom, and eastern churches, such as the Orthodox.\n \n Catholicism attempts to detail things in, well... detail. They take a legalistic approach - intent on describing all phenomena\n \n Orthodoxy reaches a point and says 'enough - it is a mystery - it is a matter of faith - to take it any further is both a waste of time - and an arrogant assumption that man's meager mind can ever understand everything'.\n \n Protestantism, and modern humanism do in some part derive from the legalistic approach - it is a current that also runs into evolutionary theory - the triumph of man's ability to explain things.", 
   {}, 
   26613, 
   null, 
   1071111300.0
  ], 
  [
   26741, 
   null, 
   "montalban", 
   "i apologise for any assumption on my part of your beliefs. I actually might have confused you with someone else, for that I also apologise. I probably should learn a bit about orthodoxy, in fact, I will make a point of it.\n But I have already discarded any and all monotheistic religions for being uninspired, simplistic, and unrealistic. But that is an opinion I am allowed to have, and will elaborate on if you wish. \n\n \n Your loss :)\n \n \n \n \nNo, what I said was that every religion offers its followers a version of truth, and that to everyone, religious or not, there is something they hold to be truth. But I refuse to believe that there is one religion that offers some ultimate truth, therefore negating all others. while I may wish everyone would wake up tomorrow as a buddhist, I realize that not everyone would be happyor fulfilled that way. \n\n \n So then your truth is there is no religion that is true.\n \n \nohhhh, so you'd rather I had a specialized view of your religion's edition of the bible rather than that of a methodists? Or that i should have some specialized views on each seperate book of the bible. \n I have read the bible, including other scriptures that have either not been included, or have been edited out somewhere over the years. Funny, the best works are those that have been removed from the bible, such as the Gospel of Thomas.\n \n There is one good thing... I can't think of any major religion that offers a teaching of anything but love and respect for yourself and others. And I am relieved to think that any violence done in the name of any religion is not only wrong, but in direct contravention of that religion.\n\n \n \n Ahem, if you know a) who put the Bible together and b) why they put it together then you'd not even raise Thomas's Gospel (I won't ask you which one you refer; I know of 4)\n \n I'll try and do a summary\n Jesus commissioned His Apostles to 'do things in My name'. He gave this commission to 12.\n The Churchmen He left behind sorted out any difficulties that arose; such as the issue of coverting Gentiles.\n St. Paul taught people who had faith to stick to the one true teaching - that is, of the Bishops (those original persons chosen by Christ; and other as added to the number; as the church expanded)\n These bishops were especially trained and chosen, and given Holy gifts, through the power of the Holy Spirit\n They began to write.\n They discussed things. They held true to certain orthodox teachings which we call Holy Tradition; teachings that were taught by the person of Jesus to His followers\n (see www.earlychristianwritings.com for a list of documents and aprox dates; you'll see for instance the Didache written before 150 AD; it describes the Eucharist)\n As books emerged they were discussed. Some taught the opposite to the traditions, the Gospel of Thomas, of which you are fond came about hundreds of years later. (assuming that you're talking about the earliest one) As it taught things not known to Tradition, it was rejected.\n The Church decided to authenticate one collection of works; which we call the Bible. No Gospel of Thomas was ever in the Bible; none were ever accepted by the Church as being genuine. The Church handed teachings down; as they were taught by Jesus to do so.\n \n In a similar vein there is a Constitution of Australia. If you read it, you might believe that we are a military dictatorship as many powers are given to the Governor General. But in practice we are a democracy, with many things run not by law, but by convention (or tradition) - for instance the Prime Minister is in charge of the military, not the Governor General.\n \n We have laws, and we have people who have studied these laws to interpret these. Common law is based on the law of precedent; that which went before.\n \n If you come along and write a book on our laws, and it is rejected, this does not add to the book at all. Those who rejected it aren't part of a conspiracy in doing so; they do so because they are learned, and they see no value in the book\n \n So it is with the Orthodox Church. The Church has laws and traditions and interprets these laws and traditions. If a 'gnostic' pops up and writes something then not accepting this book does not add to the value of the book, it just means the book is not worthless.\n \n You are trying to give one such book worth based on it's place in the scrap-heap.\n \n If you are talking about one of the two Infancy Gospels of Thomas then you will know that the picture of Jesus they portray is totally different from traditional views of Him; they portray Him as rather petty and vindictive; zapping other children with his Godly powers.", 
   {
    "unicode_changes_made": true
   }, 
   26615, 
   null, 
   1071112380.0
  ], 
  [
   26823, 
   null, 
   "mizmaxx", 
   "My personal fave is the Landover Baptists . They're honest and straightforward Christians. lol...", 
   {}, 
   26505, 
   null, 
   1071137640.0
  ], 
  [
   26884, 
   null, 
   "superbuddhaman", 
   "third attempt- durn computer keeps freezing\n \n \n\n So then your truth is there is no religion that is true.\n \n\n Truth, like beauty, is in the eye of the beholder. What is true for me may not hold true for you, and there is no reason why it should. In religious terms, nothing can be proven beyond reasonable doubt, so claiming something as an absolute truth is not only unreasonable, but pretentious and rude.\n \n \n \n\n Ahem, if you know a) who put the Bible together and b) why they put it together then you'd not even raise Thomas's Gospel (I won't ask you which one you refer; I know of 4)\n\n The gospel of thomas is just one example of the scriptures, or testaments of christ that have been omitted. I question the motivations of those that did the compiling of the bible, and why certain things were discarded.\n \n\n I'll try and do a summary\n Jesus commissioned His Apostles to 'do things in My name'. He gave this commission to 12.\n\n 12? You mean this included Judas Iscariot, even though he hanged himself?\n \n\n The Churchmen He left behind sorted out any difficulties that arose; such as the issue of coverting Gentiles.\n St. Paul taught people who had faith to stick to the one true teaching - that is, of the Bishops (those original persons chosen by Christ; and other as added to the number; as the church expanded)\n These bishops were especially trained and chosen, and given Holy gifts, through the power of the Holy Spirit\n They began to write.\n They discussed things. They held true to certain orthodox teachings which we call Holy Tradition; teachings that were taught by the person of Jesus to His followers\n\n \n Oh, right, and obviously I'm supposed to assume that Jesus's wishes were properly transmitted to the next person? Have you ever played the telephone game?\n \n\n As books emerged they were discussed. Some taught the opposite to the traditions, the Gospel of Thomas, of which you are fond came about hundreds of years later. (assuming that you're talking about the earliest one) As it taught things not known to Tradition, it was rejected.\n The Church decided to authenticate one collection of works; which we call the Bible. No Gospel of Thomas was ever in the Bible; none were ever accepted by the Church as being genuine. The Church handed teachings down; as they were taught by Jesus to do so.\n \n\n the first testament of Jesus I am aware of dates a full 40 years after his death. (40 years is mor than the average life expectancy of the day, but for your benefit I wll assume that author actually witnessed these events.) But I will not assume that one person's version is without flaw, and without omission.\n And so those men who complied the bible discarded certain texts because they were not \"genuine\" whatever that means. A very small group of people were taught personally by Jesus, and I refuse to believe for obvious reasons that say, a priest in seminary today is getting the exact same training St Paul was given by Jesus.\n \n \n\n In a similar vein there is a Constitution of Australia. If you read it, you might believe that we are a military dictatorship as many powers are given to the Governor General. But in practice we are a democracy, with many things run not by law, but by convention (or tradition) - for instance the Prime Minister is in charge of the military, not the Governor General.\n \n We have laws, and we have people who have studied these laws to interpret these. Common law is based on the law of precedent; that which went before.\n \n\n OK, the difference between religion and law is pretty clear. Obviously, there has to be some sort of consensus on the interpretation of laws and how they are applied, as well as enforced. If each person had their own version of lawful behavior, that would come pretty close to anarchy.\n We trust these scholars and lawyers to do this for us because they are properly trained and learned in the area of law.\n Religion, on the other hand, specifically one's understanding of God and Jesus, is not and shouldnot be so cut and dry. To reject and omit certain texts because you don't like the message they contain, is to intentionally limit the resources one might use to draw their own conclusion. I'm not so sure Jesus would have approved of the idea of ranking within his church, and I'm sure he would not like the idea that somehow a higher ranking member of the congregation is somehow more able to understand god and his son.\n The worst thing about the omission of certain texts is that in doing so, it has made them difficult to find by people who are looking to expand their view of religion. It was years after i heard of these texts that I actually had the chance to read them, and it took ordering them specially from a store that specializes in out of print and hard to find books. The gospel of Thomas, for example, is much easier to find than certain gnostic texts, apocrypha, pseudoepigraphica, etc.\n \n\n If you come along and write a book on our laws, and it is rejected, this does not add to the book at all. Those who rejected it aren't part of a conspiracy in doing so; they do so because they are learned, and they see no value in the book\n \n just because some \"learned\" religious scholar sees no value in a certain book, he should not assume that it would not be of value to anyone. Obviously the ideas it contains and the message it is intended to impart was of value to the author, and that they thought it might be to someone else. This is like destroying a child's painting because you can't tell if its a horse or an airplane.\n The act of omitting these books implies that those \"learned men\" thought that people were not capable of drawing their own conclusions properly, or that the conclusion they might draw would not agree with their own. Why not make available every possible testament, and let the reader decide what is of value for themselves?\n It is ok for them to put emphasis or focus on certain texts, in fact,that is exactly what happens. But to make other texts unavailable, to literally discard them is to intentionally guide them into seeing what you want them to see. In other words, it is censorship. This is something quite unpopular in the world. There's a reason book burning is wrong, and the same standard should obviously apply to all texts, including religious.\n \n\n So it is with the Orthodox Church. The Church has laws and traditions and interprets these laws and traditions. If a 'gnostic' pops up and writes something then not accepting this book does not add to the value of the book, it just means the book is not worthless.\n \n but, like you said above, it has been decided that this book has no value, and therefore, should not be read.\n \n\n You are trying to give one such book worth based on it's place in the scrap-heap.\n\n No, I am trying to make you see that placing any book into any such \"scrap heap\" is fundamentally wrong. By using that label for such texts, you only reinforce my opinion that you see no value in them... and no value in any of the other 6 trillion people on the planet reading them either. \n \n\n If you are talking about one of the two Infancy Gospels of Thomas then you will know that the picture of Jesus they portray is totally different from traditional views of Him; they portray Him as rather petty and vindictive; zapping other children with his Godly powers.\n\n Gasp! we wouldn't want anyone to see Jesus depicted in any way but the approved way, right? Church forbid a child realize that Jesus, like any other adolescent, had certain struggles. Church forbid a child be able to better identify with their savior by seeing a few more \"human\" qualities. NO....instead the church would rather us just swallow that Jesus was 12, then suddenly 30.\n And, after reading the Exodus, and realizing that God himself \"zapped\" the firstborn (innocent) children of Egypt simply to prove a point, I would think the apple doesnt fall far from the proverbial tree.", 
   {
    "unicode_changes_made": true
   }, 
   26741, 
   null, 
   1071176040.0
  ], 
  [
   27046, 
   null, 
   "montalban", 
   "So then your truth is there is no religion that is true.\n\n \n \nTruth, like beauty, is in the eye of the beholder. What is true for me may not hold true for you, and there is no reason why it should. In religious terms, nothing can be proven beyond reasonable doubt, so claiming something as an absolute truth is not only unreasonable, but pretentious and rude.\n\n \n Then for you how do you prove beyond a reasonable doubt your truth that there is no truth?\n \n \n Ahem, if you know a) who put the Bible together and b) why they put it together then you?d not even raise Thomas?s Gospel (I won?t ask you which one you refer; I know of 4)\n\n \n \nThe gospel of Thomas is just one example of the scriptures, or testaments of Christ that have been omitted. I question the motivations of those that did the compiling of the bible, and why certain things were discarded.\n\n \n It is good to question. But it is the first step to wisdom to knowing just how little one knows. I would question, but be humble that I do so in the spirit of seeking knowledge, not proving how clever I am.\n \n I don't mean to be pedantic. Some of the so-called 'Gnostic Gospels' were not 'omitted' because they weren't in being when the Bible was compiled in the first place. If you look at the ones that pre-date the Bible - like the infancy gospels, their teaching is inconsistent with Holy Tradition. That too is a clear indication why they aren't accepted.\n \n The historian Tacitus mentions Christ/Christians. Should we have included his history in the Bible? Question these things, read them if you want. But don't suggest some kind of conspiracy.\n \n \n I?ll try and do a summary\n Jesus commissioned His Apostles to ?do things in My name?. He gave this commission to 12.\n\n \n \n12? You mean this included Judas Iscariot, even though he hanged himself?\n\n \n Judas was replaced. :) Yes, people are free to make choices. Even Peter denied knowing Jesus. That is what it is to be human.\n \n \nThe Churchmen He left behind sorted out any difficulties that arose; such as the issue of converting Gentiles.\n St. Paul taught people who had faith to stick to the one true teaching ? that is, of the Bishops (those original persons chosen by Christ; and other as added to the number; as the church expanded)\n These bishops were especially trained and chosen, and given Holy gifts, through the power of the Holy Spirit\n They began to write.\n They discussed things. They held true to certain orthodox teachings which we call Holy Tradition; teachings that were taught by the person of Jesus to His followers\n\n \n \nOh, right, and obviously I'm supposed to assume that Jesus' wishes were properly transmitted to the next person? Have you ever played the telephone game?\n\n \n We called it 'Chinese Whispers' when I was growing up :)\n \n Hah! You've now shown why there were all those other gospels! The message was lost on some people. You want it both ways; that the false messages be included and that there be no false message.\n \n There were many witnesses to Jesus. They did a pretty good job. They always had each other to check back against. That is what the Orthodox Church is about. We have many bishops all equal. (not a single Pope who dictates to us). The Bishops discuss things. We have Holy Tradition.\n \n \nAs books emerged they were discussed. Some taught the opposite to the traditions, the Gospel of Thomas, of which you are fond came about hundreds of years later. (assuming that you?re talking about the earliest one) As it taught things not known to Tradition, it was rejected.\n The Church decided to authenticate one collection of works; which we call the Bible. No Gospel of Thomas was ever in the Bible; none were ever accepted by the Church as being genuine. The Church handed teachings down; as they were taught by Jesus to do so.\n\n \n \nthe first testament of Jesus I am aware of dates a full 40 years after his death. (40 years is more than the average life expectancy of the day, but for your benefit I will assume that author actually witnessed these events.) But I will not assume that one person's version is without flaw, and without omission.\n\n \n We have 4 gospels. We have the writings of those who were witness; viz Peter, John, etc which are called Epistles. And, we have the guidance of the Holy Spirit.\n \n \nAnd so those men who complied the bible discarded certain texts because they were not \"genuine\" whatever that means. A very small group of people were taught personally by Jesus, and I refuse to believe for obvious reasons that say, a priest in seminary today is getting the exact same training St Paul was given by Jesus.\n\n \n Obviously he wouldn't get the same teaching; theology has developed over time to deal with new situations. We are a living Church.\n \n Not genuine means not consistent with Holy Tradition.\n \n \n In a similar vein there is a Constitution of Australia. If you read it, you might believe that we are a military dictatorship as many powers are given to the Governor General. But in practice we are a democracy, with many things run not by law, but by convention (or tradition) ? for instance the Prime Minister is in charge of the military, not the Governor General.\n We have laws, and we have people who have studied these laws to interpret these. Common law is based on the law of precedent; that which went before.\n\n \n \nOK, the difference between religion and law is pretty clear. Obviously, there has to be some sort of consensus on the interpretation of laws and how they are applied, as well as enforced. If each person had their own version of lawful behavior, that would come pretty close to anarchy.\n\n \n Indeed, and there's consensus in the Bible - a commission of people looked at it for some time. There was lively discussion. There were even plans to exclude Revelations and include the Didache. However, you should also note that mere exclusion doesn't mean 'false'. There are many books that the Orthodox Church reveres - such as the Epistles of St.Clement of Rome, and St. Ignatius of Antioch, and the aforementioned Didache.\n \n Again you want both arguments. You pick on the fact that the Church excluded some books, then you want consensus!\n \n \nWe trust these scholars and lawyers to do this for us because they are properly trained and learned in the area of law.\n Religion, on the other hand, specifically one's understanding of God and Jesus, is not and shouldn't be so cut and dry. To reject and omit certain texts because you don't like the message they contain, is to intentionally limit the resources one might use to draw their own conclusion. I'm not so sure Jesus would have approved of the idea of ranking within his church, and I'm sure he would not like the idea that somehow a higher ranking member of the congregation is somehow more able to understand god and his son.\n\n \n Indeed the Orthodox Church is not a legalistic church. There are some things we won't try to explain; we just accept them as a mystery.\n \n \nThe worst thing about the omission of certain texts is that in doing so, it has made them difficult to find by people who are looking to expand their view of religion. It was years after i heard of these texts that I actually had the chance to read them, and it took ordering them specially from a store that specializes in out of print and hard to find books. The gospel of Thomas, for example, is much easier to find than certain Gnostic texts, apocrypha, pseudoepigraphica, etc.\n\n \n Yes, it is hard to find the writings of people who are wrong. Most people would see reading their rantings as a waste of time. You seem to attach some kind of status - like they have a 'mystique'.\n \n \nIf you come along and write a book on our laws, and it is rejected, this does not add to the book at all. Those who rejected it aren?t part of a conspiracy in doing so; they do so because they are learned, and they see no value in the book\n\n \n \njust because some \"learned\" religious scholar sees no value in a certain book, he should not assume that it would not be of value to anyone. Obviously the ideas it contains and the message it is intended to impart was of value to the author, and that they thought it might be to someone else. This is like destroying a child's painting because you can't tell if its a horse or an airplane.\n The act of omitting these books implies that those \"learned men\" thought that people were not capable of drawing their own conclusions properly, or that the conclusion they might draw would not agree with their own. Why not make available every possible testament, and let the reader decide what is of value for themselves?\n It is ok for them to put emphasis or focus on certain texts, in fact,that is exactly what happens. But to make other texts unavailable, to literally discard them is to intentionally guide them into seeing what you want them to see. In other words, it is censorship. This is something quite unpopular in the world. There's a reason book burning is wrong, and the same standard should obviously apply to all texts, including religious.\n\n \n During the darkness of the Dark Ages :) the Church kept copying these books. They didn't make them a first priority, but if it weren't for Christians, you'd not have those books at all.\n \n They are not unavailable - that is a choice of words on your part tinged with a sense of 'conspiracy'. I can get them through Christian book shops.\n \n But also, as I said, Jesus commissioned people to teach. When you go to school, you are taught certain things. You can reject these of course, but to make sense of schooling their is a curriculum that has been organised and developed by experts to ensure that when you leave school, you know something more then when you started. It is the same with Christianity. Jesus knew the dangers of people claiming to set themselves up as their own teachers - this is manifestly plain in the number of false Christian preachers we see on the telly every day. 100,000s of Christian churches have sprung up - all based on their own interpretation of the Bible - and quite contrary to the pleadings of Paul - who wanted unity.\n \n \n So it is with the Orthodox Church. The Church has laws and traditions and interprets these laws and traditions. If a ?Gnostic pops up and writes something then not accepting this book does not add to the value of the book, it just means the book is not worthless.\n\n \n \nbut, like you said above, it has been decided that this book has no value, and therefore, should not be read.\n\n \n Yes, they did. They knew Jesus, or they were taught by people who knew Jesus.\n \n In the middle ages, people in Europe would write books on places like China, places they'd never seen, but only barely heard about. They'd write fantastic stories about the culture, history etc of foreign lands. That these books aren't easy to find today, isn't because of a great cover-up of some fantastic secret knowledge that these books might contain.\n \n \n You are trying to give one such book worth based on it?s place in the scrap-heap.\n\n \n \nNo, I am trying to make you see that placing any book into any such \"scrap heap\" is fundamentally wrong. By using that label for such texts, you only reinforce my opinion that you see no value in them... and no value in any of the other 6 trillion people on the planet reading them either. \n\n \n Indeed I would also discard any book on Jesus, written by someone who doesn't understand Him. But if you feel the need to read these books, I should suggest that you do so bearing in mind again, why they have been rejected.\n \n \n If you are talking about one of the two Infancy Gospels of Thomas then you will know that the picture of Jesus they portray is totally different from traditional views of Him; they portray Him as rather petty and vindictive; zapping other children with his Godly powers.\n\n \n \nGasp! we wouldn't want anyone to see Jesus depicted in any way but the approved way, right? Church forbid a child realize that Jesus, like any other adolescent, had certain struggles. Church forbid a child be able to better identify with their savoir by seeing a few more \"human\" qualities. NO....instead the church would rather us just swallow that Jesus was 12, then suddenly 30.\n And, after reading the Exodus, and realizing that God himself \"zapped\" the firstborn (innocent) children of Egypt simply to prove a point, I would think the apple doesn't fall far from the proverbial tree\n\n \n You are determined to see the negative - to view some kind of conspiracy involved - an official cover-up.\n \n If I wrote a book about George W Bush, telling you that as a child he saved the lives of hundreds of people based on super-powers he received from aliens - you'd add value to this - simply because\n a) it's ridiculous\n b) it wouldn't be a great seller.\n \n I actually find your thinking is back the front on these issues.\n \n Furthermore, you want both consensus, but are against that consensus. You want both accuracy of Jesus' wishes, then are annoyed that the inaccurate portrayals are discarded.\n \n Which of the four Gospels of Thomas do you think more accurately portrays Christ? If you believe you know better than 2,000 years of teaching, then please put forward that list of books that you deem the most reflective of Christ's teachings.\n \n \n \n PS I mentioned earlier about the Orthodox Church not relying solely on the Bible. I posted this as an example list on some other posts and do so again here to give you an idea. Here is a list of writers we can consult on the issue of Love and the Christian marriage. The list is not 'complete' but it shows that teachings continue up to the present time.\n Basil the great (330-79)\n Gregory of Nyssa (331-95)\n John Chrysotomon (347-407)\n The Desert Fathers (4th-5th centuries)\n Isaiah the SOlitary (5th century)\n Diadochos of Photike (5th century)\n Dorotheos of Gaza (6th century)\n Gregory the Great (540-604)\n Theodor the Ascetic (7th century)\n Maximos the Confessor (580-662)\n Thaslassios the Libyan (7th century)\n Dionysios the Areopagite (c.500)\n John Klimakos (579-649)\n Symeon the New Theologian (949-1022)\n Nicholas Kavasilas (1322-96)\n Symeon of Thessalonika (d.1429)\n Dimitri of Rostov (1651-1709)\n Macarius of Optino (1788-1860)\n Ignatius Brianchaninov (1807-67)\n John of Kronstad (1829-1908)\n Silouan of Athos (1866-1938)\n Alexander Elchaninov (1881-1934)\n Kallistos of Diokleia (b.1934)\n list taken from \"Love, Sexuality, and the Sacrament of Marriage\" by John Chryssavgis", 
   {}, 
   26884, 
   null, 
   1071211620.0
  ], 
  [
   28480, 
   null, 
   "bud095", 
   "Bud,\n \n I am of no religion. Definitively, I am confined to atheism, but I am not truly atheist. It is difficult to explain.\n \n However, my ex-girlfriend is Christian. We've had many (frustrating) debates over such issues. We can both agree on one point however: There is no religion. There is only faith. Giligan is a fine scholar, from what I have seen thus far, and I have to agree with his methodologies. You should take heart from all wealths of knowledge and reach a common truth.\n \n I have but one other important piece of advice to offer: The answer lay inside yourself. Take that one to the grave with you.\n \n In angered response to Leigha's atheistic rape and crime comment, I would like to point out that Mr. William Clinton and Mr. George Bush are such fine, devout Christians and that their actions, in the white house, are in no way comparable to those of us horrible, horrible atheists. ;\\\n \n \n So yea, it's kind of like that.\n LEVIATHAN\n i think ill stick with atheism", 
   {}, 
   26006, 
   null, 
   1071871380.0
  ], 
  [
   28501, 
   null, 
   "montalban", 
   "i think ill stick with atheism\n\n \n If you don't believe in any supreme being - then how do you know your judgment of right and wrong is right or wrong?\n \n When a Christian does something (in a moral sense) we can measure his actions against the template of Christian ethics. We can say 'his actions are immoral - as according to his own belief system'.\n \n With atheism, all you need to do is not believe in God. There is no moral template, because a kindly person giving all their money and effort to charity or a mass murderer can all fit under the over-arching banner that is atheism - so long as they don't believe in God. There is no moral template for which you can work against - which is truly objective.\n \n You can -decide for yourself (subjective)\n Listen to society (a group of subjective opinions)\n Obey the law made by society (see above).\n \n \n Christian morals transcend space and time. For Orthodox, what was immoral 2,000 years ago is still immoral. It's sinfulness does not depend on societal fads and whims.\n \n Thus when slavery was legal in the US, many atheists were against government interference because they said that the gov't. had no right to move in on personal issues - but Christians looking beyond trends saw that slavery was immoral - regardless of its legal status.", 
   {}, 
   28480, 
   null, 
   1071876780.0
  ], 
  [
   28783, 
   null, 
   "superbuddhaman", 
   "If you don't believe in any supreme being - then how do you know your judgment of right and wrong is right or wrong?\n\n you have to trust yourself to know that you have good judgement. I have seen many people, religious and not convince themselves and others that what they are doing is right... and I have seen many more people do something wrong, and their religion has convinced them it is right.\n \n\n When a Christian does something (in a moral sense) we can measure his actions against the template of Christian ethics. We can say 'his actions are immoral - as according to his own belief system'.\n \n With atheism, all you need to do is not believe in God. There is no moral template, because a kindly person giving all their money and effort to charity or a mass murderer can all fit under the over-arching banner that is atheism - so long as they don't believe in God. There is no moral template for which you can work against - which is truly objective.\n \n\n There is a moral template for many, and not all of these depend on a \"god\", have you never heard of other religions setting down \"rules\" for their followers?\n \n \n\n Christian morals transcend space and time. For Orthodox, what was immoral 2,000 years ago is still immoral. It's sinfulness does not depend on societal fads and whims.\n \n\n Ok, explain to me how Joan of Arc could have been burned at the stake for her immoral behavior, and then 500 years later be canonized?\n \n\n Thus when slavery was legal in the US, many atheists were against government interference because they said that the gov't. had no right to move in on personal issues - but Christians looking beyond trends saw that slavery was immoral - regardless of its legal status.\n\n \n First of all, I'd like to point out that many God following churches feel no need to support the rights of all- for example the Catholic church's stance of non-involvement during the holocaust.\n And then I feel the need to point out that not all abolitionists were religious folk. But according to you, they had no \"moral template\" with which to determine that slavery was wrong. Why is that christians feel the need to take credit for anything good that has ever happened in the world? It was not Christians who ended slavery- it was citizens.", 
   {}, 
   28501, 
   null, 
   1072083780.0
  ], 
  [
   28790, 
   null, 
   "montalban", 
   "There is a moral template for many, and not all of these depend on a \"god\", have you never heard of other religions setting down \"rules\" for their followers?\n\n \n Yes, but what about atheists? Whose rules are they following?\n \n \nOk, explain to me how Joan of Arc could have been burned at the stake for her immoral behavior, and then 500 years later be canonized?\n\n \n Dunno! Ask a member of the Church that did both. The Orthodox Church (which remains true to the teachings of the New Testament) did not have an Inquisition.\n \n \nFirst of all, I'd like to point out that many God following churches feel no need to support the rights of all- for example the Catholic church's stance of non-involvement during the holocaust.\n And then I feel the need to point out that not all abolitionists were religious folk. But according to you, they had no \"moral template\" with which to determine that slavery was wrong. Why is that christians feel the need to take credit for anything good that has ever happened in the world? It was not Christians who ended slavery- it was citizens.\n\n \n Ah, no. Many atheists argued that they had no right to meddle in a person's own private affairs - which is why someone such as Locke (a liberal/atheist/humanist) wrote slavery into the articles that formed the government of the Carolinas.\n \n A notion continued by the US founding fathers, many of whom were atheists or believing in some minor and vague theistic force.\n \n Those atheists who were anti-slavery had only their own inward moral template - their own subjective feelings to go by. But it was Wilberforce (in Britain) and Garrison (in USA) who lead the way and these guys were Christian.", 
   {}, 
   28783, 
   null, 
   1072092720.0
  ], 
  [
   28793, 
   null, 
   "superbuddhaman", 
   "Yes, but what about atheists? Whose rules are they following?\n\n it depends on the atheist- ask one\n \n \n \n\n Dunno! Ask a member of the Church that did both. The Orthodox Church (which remains true to the teachings of the New Testament) did not have an Inquisition.\n \n\n ok, now tell me what the orthodox church did to stop it? Tell me waht your church did to end the holocaust? And another thing- what brand of orthodoxy are you talking about? You have never elaborated, are you jewish orthodox, greek orthodox, catholic orthodox...\n \n \n\n Ah, no. Many atheists argued that they had no right to meddle in a person's own private affairs - which is why someone such as Locke (a liberal/atheist/humanist) wrote slavery into the articles that formed the government of the Carolinas.\n A notion continued by the US founding fathers, many of whom were atheists or believing in some minor and vague theistic force.\n Those atheists who were anti-slavery had only their own inward moral template - their own subjective feelings to go by. But it was Wilberforce (in Britain) and Garrison (in USA) who lead the way and these guys were Christian.\n\n \n right. And I'm sure that none of the slave-owners were christian, right?\n The whole slavery angle is a very bad one with which to prove that your religion is the right one. At some point or another, almost all cultures 0haev been enslaved; the blacks in America just being the most recent.", 
   {}, 
   28790, 
   null, 
   1072095600.0
  ], 
  [
   28794, 
   null, 
   "dreamweaver", 
   "Yes, but what about atheists? Whose rules are they following?\n\n Atheists may well choose to \"follow\" someone, but there is nothing in their \"atheistic beliefs\" that suggests that they should follow anything. Or abide by anything, or accept that anything is \"wrong\" or \"right\" except Religion.\n \n As I have mentioned before, an atheist can rape, kill, lie and be entirely consistent with his \"beliefs\".", 
   {}, 
   28793, 
   null, 
   1072096260.0
  ], 
  [
   28797, 
   null, 
   "superbuddhaman", 
   "Atheists may well choose to \"follow\" someone, but there is nothing in their \"atheistic beliefs\" that suggests that they should follow anything. Or abide by anything, or accept that anything is \"wrong\" or \"right\" except Religion.\n \n As I have mentioned before, an atheist can rape, kill, lie and be entirely consistent with his \"beliefs\".\n\n \n A religious person can do all of those things and be entirely consistent with his beliefs as well. We call them fanatics, we say they misinterpret the text, but nonetheless, they can make arguments to support their actions, based on their beliefs. They may not be consistent with another's beliefs, but that is not the question. Having consistency amongst all the followers of any given path is something that is truly unlikely. It's not like all atheists agree either.", 
   {}, 
   28794, 
   null, 
   1072099140.0
  ], 
  [
   28829, 
   null, 
   "montalban", 
   "A religious person can do all of those things and be entirely consistent with his beliefs as well. We call them fanatics, we say they misinterpret the text, but nonetheless, they can make arguments to support their actions, based on their beliefs. They may not be consistent with another's beliefs, but that is not the question. Having consistency amongst all the followers of any given path is something that is truly unlikely. It's not like all atheists agree either.\n\n \n Atheists can't all agree - it is impossible, because Atheism allows for any moral behaviour at all - all it requires is a lack of belief in God.\n \n To your first point - this is why Orthodoxy doesn't recommend personal interpretation of the Bible - that's not what it was meant for.", 
   {}, 
   28797, 
   null, 
   1072132020.0
  ], 
  [
   28831, 
   null, 
   "montalban", 
   "ok, now tell me what the orthodox church did to stop it?\n\n \n I believe that at the time we were fighting the Turks... Too busy being over-run.\n \n \nTell me waht your church did to end the holocaust?\n\n \n I don't know the Churches very recent history as well as I should, but again the Church was under occupation - in the Soviet Union it itself was being heavily attacked, with 10,000s of Orthodox being killed or sent to internment.\n \n You are really asking the wrong kind of questions. Orthodoxy has seldom been a religion 'of power'. We have been persecuted.\n \n \nAnd another thing- what brand of orthodoxy are you talking about? You have never elaborated, are you jewish orthodox, greek orthodox, catholic orthodox...\n\n \n Huh? I believe I made it know that I'm Christian - so that rules out Jewish Orthodox right there.\n \n I am unaware of Catholic Orthodox\n \n All Orthodox that you know such as Greek, Russian, Serbian, Antiochian, are the same.\n \n \nright. And I'm sure that none of the slave-owners were christian, right?\n The whole slavery angle is a very bad one with which to prove that your religion is the right one. At some point or another, almost all cultures 0haev been enslaved; the blacks in America just being the most recent.\n\n \n Yes there have been bad Christians... how do we know they were bad? We compare them against Christian principles you can call them hypocrites - because you can measure them against their beliefs.\n \n You can't with Atheists because they all can have matter of morals. And when arguing against an atheist over slavery - what do you do? You as an atheist can only argue your opinion vs. his opinion - and what makes yours right?", 
   {
    "unicode_changes_made": true
   }, 
   28793, 
   null, 
   1072132620.0
  ], 
  [
   28842, 
   null, 
   "dreamweaver", 
   "A religious person can do all of those things and be entirely consistent with his beliefs as well. We call them fanatics, we say they misinterpret the text, but nonetheless, they can make arguments to support their actions, based on their beliefs. They may not be consistent with another's beliefs, but that is not the question. Having consistency amongst all the followers of any given path is something that is truly unlikely. It's not like all atheists agree either.\n\n No. Christians are justified by faith - yes. But, if we have faith we would have works. One can rape, kill, lie and cheat and still call himself Christian - yes. However, He will not be consistent with his beliefs. He'll be defying their very nature. \n \n While in Atheism you don't need to have any rules, in most Religions you do have some. The only thing that can cause you to be inconsistent with your atheistic beliefs is to believe that Theism is correct. \n \n You cannot rape and be consistent with your Jewish, Christian or Muslim beliefs. It's like saying that you're a devout vegetarian but you eat meat daily.", 
   {}, 
   28831, 
   null, 
   1072138440.0
  ], 
  [
   28897, 
   null, 
   "superbuddhaman", 
   "No. Christians are justified by faith - yes. But, if we have faith we would have works. One can rape, kill, lie and cheat and still call himself Christian - yes. However, He will not be consistent with his beliefs. He'll be defying their very nature. \n\n christians are justified by faith? So you are telling me that the inquisition was justified because those involved had faith? What?!?! Those who were involved were pretty good at convincing people that what they were up to was perfectly justified... just as the Al Quaeda operatives are pretty good at convincing people that the Qu'ran advocates such behavior. I am quite aware of the good works christians have performed throughout history, and I commend them. But I am also very aware of the horrible things that have been done in the church's name. And, the first rule of public interaction is that someone will remember a bad experience more than they'll remember 10 good ones, so it is simple human nature to see the church in a very bad light.\n [quote]", 
   {}, 
   28842, 
   null, 
   1072164060.0
  ], 
  [
   28906, 
   null, 
   "dreamweaver", 
   "Superbuddhaman- Have you read the Bible? It's just that the majority of those who criticize Christianity have not read the Bible, and it is increasingly clear. \n \n christians are justified by faith? So you are telling me that the inquisition was justified because those involved had faith? What?!?!\n\n Yes, Christians are justified by Faith (Rom. 3:28, 5:1, 4:5, John 3:16). Of course, Christians would not be justified by works! Do you think that God judges the same as a human? God looks into our heart. \n \n However, true faith results in \"regeneration of the sinner\" which would result in good works. If one does have faith - it will be evident by their works. \n \njust as the Al Quaeda operatives are pretty good at convincing people that the Qu'ran advocates such behavior.\n\n Why are you talking about the Al Quaeda? They were not Christian, and they made no secret about it. Plus, when they have a verse in their scriptures saying how Allah loves those who fight for him on the battle field, it's a lot easier for them to try to justify their actions.\n \n But I am also very aware of the horrible things that have been done in the church's name. And, the first rule of public interaction is that someone will remember a bad experience more than they'll remember 10 good ones, so it is simple human nature to see the church in a very bad light.\n\n I think it's normally the other way around. The Church has made many mistakes in the past, I don't know of any Christian who disputes this. There are plenty of ignorant Christians, just like there are ignorant atheists. Others who call themselves Christians shouldn't be our role model, our only role model should be Jesus. Follow his moral imperative: be perfect.\n \n It stands: Atheists can rape, kill, cheat and be pedophiles and remain completely and utterly consistent with their \"beliefs\". Christians cannot. This is why atheism is so very attractive! Isn't it so great! Why should I follow what anyone else says? I'm the boss, I say what's right and wrong.", 
   {
    "unicode_changes_made": true
   }, 
   28794, 
   null, 
   1072186080.0
  ], 
  [
   28909, 
   null, 
   "superbuddhaman", 
   "Superbuddhaman- Have you read the Bible? It's just that the majority of those who criticize Christianity have not read the Bible, and it is increasingly clear. \n\n yes, I have read the bible, but I have put it aside for better reading material.\n \n\n Yes, Christians are justified by Faith (Rom. 3:28, 5:1, 4:5, John 3:16). Of course, Christians would not be justified by works! Do you think that God judges the same as a human? God looks into our heart. \n \n\n I love how christians justify their beliefs by quoting their bible. can you not come up with any other argument than quoting passages from a book written a very very long time before you were ever a \"gleam in your father's eye\"?\n \n\n However, true faith results in \"regeneration of the sinner\" which would result in good works. If one does have faith - it will be evident by their works. \n \n\n Ah, so you think that only the faithful are capable of good works?\n \n\n Why are you talking about the Al Quaeda? They were not Christian, and they made no secret about it. Plus, when they have a verse in their scriptures saying how Allah loves those who fight for him on the battle field, it's a lot easier for them to try to justify their actions.\n \n\n I used Al Quaeda as an axample of those who justify their actions by referring to an outdated text. Tell me exactly where this passage comes from, and what exactly it says, or else I will sum it up to the rumor mill\n \n\n I think it's normally the other way around. The Church has made many mistakes in the past, I don't know of any Christian who disputes this. There are plenty of ignorant Christians, just like there are ignorant atheists. Others who call themselves Christians shouldn't be our role model, our only role model should be Jesus. Follow his moral imperative: be perfect.\n \n\n In the past? As in, not currently? Can you please enlighten me as to exactly when these mistakes ended?\n [/quote]\n It stands: Atheists can rape, kill, cheat and be pedophiles and remain completely and utterly consistent with their \"beliefs\". Christians cannot. This is why atheism is so very attractive! Isn't it so great! Why should I follow what anyone else says? I'm the boss, I say what's right and wrong.[/QUOTE]\n It also stands that people do all of those horrible things everyday, christian and not... sorry for you but the only standards any of us has to adhere to are those set forth by the government.", 
   {
    "unicode_changes_made": true
   }, 
   28906, 
   null, 
   1072188000.0
  ], 
  [
   28910, 
   null, 
   "dreamweaver", 
   "yes, I have read the bible, but I have put it aside for better reading material.\n\n Well, I'm sorry to hear that. \n \nI love how christians justify their beliefs by quoting their bible. can you not come up with any other argument than quoting passages from a book written a very very long time before you were ever a \"gleam in your father's eye\"?\n\n That statement is really not going to stand. I provided both Scriptural evidence and logical evidence for why one is justified by faith. Plus, of course a Christian should quote from their Bible. What type of Christian relies on their own understanding and simply discards the Bible and what Jesus says? That is not what Christianity is about.\n \nAh, so you think that only the faithful are capable of good works?\n\n I'm not getting into that, but you should perhaps check my last post since I said nothing of the sort. I said that if one does have faith, then it will be apparent by their works. \n \nI used Al Quaeda as an [e]xample of those who justify their actions by referring to an outdated text. \n\n You should probably evaluate on what you mean by \"outdated\" texts. Your subjective opinion on what is outdated isn't really gonna hold.\n \nTell me exactly where this passage comes from, and what exactly it says, or else I will sum it up to the rumor mill\n\n \"Truly Allah loves those who fight in His Cause in battle array, as if they were a solid cemented structure,\" (Surah 61:4). \n \n \"Fight in the cause of Allah those who fight you but do not transgress limits...191And slay them wherever ye catch them. and turn them out from where they have turned you out; for persecution is worse than slaughter; But fight them not at the sacred Mosque unless they (first) fight you there; But if they fight you, slay them. Such is the reward of those who reject faith. 192 But if they cease, Allah is oft-forgiving, Most Merciful. 193And fight them on until there is no more persecution. And the religion becomes Allah's. But if they cease, Let there be no hostility except to those who practice oppression\" (The Qur'an, Surah 2:190-193). \n \nIn the past? As in, not currently? Can you please enlighten me as to exactly when these mistakes ended?\n\n You're not listening to what I have said. I never said that the Church will never make mistakes in the future. \n \nIt also stands that people do all of those horrible things everyday, christian and not... sorry for you but the only standards any of us has to adhere to are those set forth by the government.\n\n That changes, near enough, nothing. It doesn't answer what I said at all. There is nothing in atheism that suggests that one shouldn't rape or kill.", 
   {}, 
   28909, 
   null, 
   1072188840.0
  ], 
  [
   28911, 
   null, 
   "superbuddhaman", 
   "Well, I'm sorry to hear that. \n\n Oh, you'd rather I read the bible and only the bible? Sorry\n \n\n That statement is really not going to stand. I provided both Scriptural evidence and logical evidence for why one is justified by faith. Plus, of course a Christian should quote from their Bible. What type of Christian relies on their own understanding and simply discards the Bible and what Jesus says? That is not what Christianity is about.\n \n\n I'm sorry to hear that. Quoting a book, any book, does you no good unless you have personal understanding of what the author was trying to convey. I thought christianity supported this idea in its followers, but alas, you, the expert, have told me otherwise.\n \n\n I'm not getting into that, but you should perhaps check my last post since I said nothing of the sort. I said that if one does have faith, then it will be apparent by their works. \n \n\n And so what is made apparent by my works?\n [quote]\n You should probably evaluate on what you mean by \"outdated\" texts. Your subjective opinion on what is outdated isn't really gonna hold.\n [quote]\n anything that was written more than, say 1000 years ago is very likely outdated, and even more likely, badly translated.\n \n \n \n\n You're not listening to what I have said. I never said that the Church will never make mistakes in the future. \n \n\n or that it is currently making mistakes?\n \n\n That changes, near enough, nothing. It doesn't answer what I said at all. There is nothing in atheism that suggests that one shouldn't rape or kill.\n\n you do not need a religious dictate to know that hurting people is wrong, that is common sense.", 
   {}, 
   28910, 
   null, 
   1072190820.0
  ], 
  [
   28961, 
   null, 
   "montalban", 
   "\"Truly Allah loves those who fight in His Cause in battle array, as if they were a solid cemented structure,\" (Surah 61:4). \n \n\n \n On a muslim site's Q & A\n \"Question: Some enemies of the religion claim that Islam was spread by the sword. What is your response to that? Answer: Islam was spread by proof and evidence, in the case of those who listened to the message and responded to it.  And it was spread by strength and the sword in the case of those who stubbornly resisted, until they had no choice and had to submit to the new reality.\" (www.islam-qa.com - question #5441)\n \n Further;\n \"A group of eight men from the tribe of 'Ukil came to the Prophet and then they found the climate of Medina unsuitable for them. So, they said, ?O Allah's Apostle! Provide us with some milk.? Allah's Apostle said, ?I recommend that you should join the herd of camels.? So they went and drank the urine and the milk of the camels (as a medicine) till they became healthy and fat. Then they killed the shepherd and drove away the camels, and they became unbelievers after they were Muslims. When the Prophet was informed by a shouter for help, he sent some men in their pursuit, and before the sun rose high, they were brought, and he had their hands and feet cut off. Then he ordered for nails which were heated and passed over their eyes, and they were left in the Harra (i.e. rocky land in Medina). They asked for water, and nobody provided them with water till they died.\" (Hadith, Sahih Bukhari, Volume 4, Book 52, Number 261: Narrated by Anas bin Malik.)\n \n The oldest still-available biography of Muhammad is called the \"Sirat Rasul Allah\" (\"Life of the Prophet of Allah\"). This book was written by Ibn Ishaq a century before any of the major works of the Hadith. \"Sirat Rasulallah\" is considered the most authentic biography of Muhammad. On page 515, we read of an event that took place about three years before Muhammad's death. This specific narrative tells of Muhammad?s conquest of Khaibar, a large Jewish settlement with some of the best date palms in the region. The Jews of Khaibar were prosperous merchants, craftsmen, and farmers. Kinana al-Rabi, who was said to have had the custody of a certain hidden treasure, was brought to Muhammad who asked him about it. Kinana denied that he knew where it was. A Jew came to the apostle and said that he had seen Kinana going round a certain ruin every morning early. When the apostle said to Kinana, \"Do you know that if we find you have it I shall kill you?\" he said \"Yes.\" Muhammad gave orders that the ruin be excavated and some of the treasure was found. When he asked Kinana about the rest of the treasure he refused to produce it, so the apostle gave orders to al-Zubayr Al-Awwam, \"Torture him until you extract what he has.\" So he kindled a fire with flint and steel on his chest until he was nearly dead. Then Muhammad delivered him to Muhammad b. Maslama and he struck off his head. Were Muhammad?s actions in keeping with a religion that is for peace? And this is only one such example among many.\n \n all quotes found at\n http://answering-islam.org/TWOR/peacepromoting.html", 
   {}, 
   28910, 
   null, 
   1072236780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  religion", 
  "url": "http://www.4forums.com/political/religion-debates/1352-religion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1352, 
  "discussion_files": [
   [
    "1877.html", 
    "http://www.4forums.com/political/religion-debates/1352-religion-print.html"
   ], 
   [
    "1878.html", 
    "http://www.4forums.com/political/religion-debates/1352-religion-4-print.html"
   ], 
   [
    "1879.html", 
    "http://www.4forums.com/political/religion-debates/1352-religion-3-print.html"
   ], 
   [
    "1880.html", 
    "http://www.4forums.com/political/religion-debates/1352-religion-2-print.html"
   ]
  ], 
  "identifier": 1352
 }
]