[
 [
  [
   377055, 
   null, 
   "SeriousSister08", 
   "Dawn the time when my \n \n voice will be heard, amid screams, \n \n and misunderstandings, amid all hostility. \n \n Restless in my soul for a way to escape, \n \n trying not to give way to the insanity pulling at me from every direction. \n \n Life will take you down a road you are unwilling to travel, \n \n a road a million miles away from the sanity you once, knew. \n \n The only chance is to fight back with fierceness and \n \n to slave over your own imperfections for a brand new way of living. \n \n Nothing can be more agonizing then a misunderstood soul, \n \n that cries out for mercy when none is shown. \n \n Floating above the waters of despair you try not to drown, \n \n hoping that something may come your way, \n \n so that you can pull yourself out of your despair. \n \n As the day begins to dawn, you wonder what it brings. \n \n More pain?! More anxiety?! It can only bring what you will accept, nothing more or less. \n \n No longer willing to allow life, and people to let you drown, \n \n you climb aboard the nearest lifeline and you cling to it, with the determination to live. \n \n Welcoming the dawning day with a new outlook, can you ever survive life?! You can sure try.", 
   {
    "post_info": {
     "post_title": "Restless Soul"
    }
   }, 
   null, 
   null, 
   1257532860.0
  ], 
  [
   377105, 
   null, 
   "gansao", 
   "Dawn the time when my voice will be heard, amid screams, and misunderstandings, amid all hostility. Restless in my soul for a way to escape, trying not to give way to the insanity pulling at me from every direction. Life will take you down a road you are unwilling to travel, a road a million miles away from the sanity you once, knew. The only chance is to fight back with fierceness and to slave over your own imperfections for a brand new way of living. Nothing can be more agonizing then a misunderstood soul, that cries out for mercy when none is shown. Floating above the waters of despair you try not to drown, hoping that something may come your way, so that you can pull yourself out of your despair. As the day begins to dawn, you wonder what it brings. More pain?! More anxiety?! It can only bring what you will accept, nothing more or less. No longer willing to allow life, and people to let you drown, you climb aboard the nearest lifeline and you cling to it, with the determination to live. Welcoming the dawning day with a new outlook, can you ever survive life?! You can sure try.\n\n I read it once and thought it was nonsense..so I read it again.. and found it rather good!\n If you spaced out the sentences it would be easier to find the timing of the verse . I say that out of ignorance though.\n I like it!", 
   {}, 
   377055, 
   null, 
   1257549660.0
  ], 
  [
   378955, 
   null, 
   "SeriousSister08", 
   "I read it once and thought it was nonsense..so I read it again.. and found it rather good!\n If you spaced out the sentences it would be easier to find the timing of the verse . I say that out of ignorance though.\n I like it!\n\n \n I'm glad that you like my poem. I like to make them hard to understand the first time. Every word has a special meaning, it takes a few times reading it to understand. Thank you for enjoying my work. I took your advice about the spacing, I was never good at learning how to properly form the outline of a peom, so I just write without a specific line-up. All my poems, are in novel form.lol", 
   {}, 
   377105, 
   null, 
   1258560180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Restless Soul", 
  "url": "http://www.4forums.com/political/writings/13544-restless-soul.html", 
  "breadcrumbs": [
   "Writings"
  ], 
  "id_number": 13544, 
  "discussion_files": [
   [
    "28692.html", 
    "http://www.4forums.com/political/writings/13544-restless-soul-print.html"
   ]
  ], 
  "identifier": 13544
 }
]