[
 [
  [
   378047, 
   null, 
   "Symbiote", 
   "Rand Paul, that's Ron Paul's son, is running for senator in the republican primaries in Kentucky against Secretary of State Trey Grayson.\n \n 6 weeks ago when the polls showed Grayson 37 - Paul 26, the GOP establishment dismissed Paul's rise as a \"short term bounce\" or an error in polling.\n \n But now it's Paul 35 - Grayson 32.\n \n Paul's lead is greater amongst self-described conservatives, while Grayson is slightly ahead with self-described moderates.\n \n Survey USA: Rand Paul surges for GOP, Mongiardo maintains lead in Dem. race | WHAS11 Louisville, Kentucky and Indiana News | Political Blog\n \n To me this represents a backlash from the small government conservative base against sellout politicians who get elected to washington and endorse \"stimulus packages\" selling out america to special interests.", 
   {
    "post_info": {
     "post_title": "Rand Paul likely contender for Senate."
    }
   }, 
   null, 
   null, 
   1258100820.0
  ], 
  [
   378112, 
   null, 
   "Steeeeve", 
   "How freaky is that...I was just singing Rand's praises a second ago and was going to post about it. \n \n During the primaries I felt Ron Paul had good ideas but was too cold so he could never get anything done. I think I was wrong. Who cares about that at this point. We really need someone in there to just let congress know we don't like them very much. \n \n Anyway, on to Rand. I think Kentucky is one of the luckiest states to have him. This is a backlash after people realize how bad Bush and Obama really are.", 
   {}, 
   378047, 
   null, 
   1258138680.0
  ], 
  [
   378113, 
   null, 
   "JPSartre12", 
   "The country is 40% Conservative and only 20% liberal, so why is everyone surprised when a real conservative pops his head up and does well?", 
   {}, 
   378112, 
   null, 
   1258139100.0
  ], 
  [
   378118, 
   null, 
   "jyoshu", 
   "Does he lean libertarian like his father? If so, I'm all for him!! emoticon_xagree", 
   {}, 
   378113, 
   null, 
   1258139820.0
  ], 
  [
   392713, 
   null, 
   "Symbiote", 
   "Poll: Rand Paul Easily Leads in Senate Race The Washington Independent\n \n 44:23 - Grayson must be crapping his pants about now.", 
   {}, 
   378118, 
   null, 
   1267270140.0
  ], 
  [
   392729, 
   null, 
   "daewoo", 
   "How freaky is that...I was just singing Rand's praises a second ago and was going to post about it. \n \n During the primaries I felt Ron Paul had good ideas but was too cold so he could never get anything done. I think I was wrong. Who cares about that at this point. We really need someone in there to just let congress know we don't like them very much. \n \n Anyway, on to Rand. I think Kentucky is one of the luckiest states to have him. This is a backlash after people realize how bad Bush and Obama really are.\n\n \n Ron Pauls day in the white house may still come. He won the CPAC straw poll by a landslide. \n \n IF the democrats continue down the path they are on, I think he has a real chance since he is the only person the republicans can out forth that actually has a history of fiscal dicipline. Most of them talk a good game but when you actually look at their track record it sucks. \n \n As far as Rand goes, I have not heard enough of him to make a determination one way or another. You would hope that the apple would not fall too far from the tree, but you have to keep the Bush fiasco in mind. George Bush Sr, bar none the most conservative president we have had in 20 years. Fiscal dicipline, respected the constitution and individual rights. George Bush Sr, bar none the most liberal president we have had in the last 20 years. Less fiscal dicipline than my wife in a furniture store, no respect whatsoever for the constitution or individual rights.", 
   {}, 
   378112, 
   null, 
   1267285620.0
  ], 
  [
   392742, 
   null, 
   "Esdraelon", 
   "Ron Pauls day in the white house may still come. He won the CPAC straw poll by a landslide. \n \n IF the democrats continue down the path they are on, I think he has a real chance since he is the only person the republicans can out forth that actually has a history of fiscal dicipline. Most of them talk a good game but when you actually look at their track record it sucks. \n \n As far as Rand goes, I have not heard enough of him to make a determination one way or another. You would hope that the apple would not fall too far from the tree, but you have to keep the Bush fiasco in mind. George Bush Sr, bar none the most conservative president we have had in 20 years. Fiscal dicipline, respected the constitution and individual rights. George Bush Sr, bar none the most liberal president we have had in the last 20 years. Less fiscal dicipline than my wife in a furniture store, no respect whatsoever for the constitution or individual rights.\n\n \n Well, Ron Paul is about the only Republican worth his salt. Rand should do well. Now if Republicans can just get someone over in West Virginia.", 
   {}, 
   392729, 
   null, 
   1267300260.0
  ], 
  [
   392768, 
   null, 
   "JPSartre12", 
   "Ron Pauls day in the white house may still come. He won the CPAC straw poll by a landslide. \n \n IF the democrats continue down the path they are on, I think he has a real chance since he is the only person the republicans can out forth that actually has a history of fiscal dicipline. Most of them talk a good game but when you actually look at their track record it sucks. \n \n As far as Rand goes, I have not heard enough of him to make a determination one way or another. You would hope that the apple would not fall too far from the tree, but you have to keep the Bush fiasco in mind. George Bush Sr, bar none the most conservative president we have had in 20 years. Fiscal dicipline, respected the constitution and individual rights. George Bush Sr, bar none the most liberal president we have had in the last 20 years. Less fiscal dicipline than my wife in a furniture store, no respect whatsoever for the constitution or individual rights.\n\n \n I think you meant Jr on that last one.", 
   {}, 
   392729, 
   null, 
   1267320840.0
  ], 
  [
   402696, 
   null, 
   "Symbiote", 
   "Well he's through the primaries with last I heard 59% of the vote to Grayson's 35, and set off a shitstorm of fear in the pro-government media, now onto the elections and we may have 2 actual conservatives in Washington.", 
   {}, 
   392768, 
   null, 
   1274556240.0
  ], 
  [
   402699, 
   null, 
   "Galileo", 
   "I don't think his views on the Civil Rights Act of 1964 will help him and will possibly give the Democrats a lot of ammunition against him. \n Nation & World | Rand Paul draws attacks for stance on Civil Rights Act | Seattle Times Newspaper", 
   {}, 
   402696, 
   null, 
   1274557920.0
  ], 
  [
   402701, 
   null, 
   "snakespit", 
   "I don't think his views on the Civil Rights Act of 1964 will help him and will possibly give the Democrats a lot of ammunition against him. \n Nation & World | Rand Paul draws attacks for stance on Civil Rights Act | Seattle Times Newspaper\n\n \n I think the liberals that are critical of his position on the CRA don't really understand that he is speaking more about the constitutionality and less about the actual substance. \n \n He is not the monsterous racist he has been portrayed to be in the liberal media. Sad that people don't actually listen to what he is saying and understand the points that he makes.", 
   {}, 
   402699, 
   null, 
   1274558820.0
  ], 
  [
   402702, 
   null, 
   "COBHC", 
   "I don't think his views on the Civil Rights Act of 1964 will help him and will possibly give the Democrats a lot of ammunition against him. \n Nation & World | Rand Paul draws attacks for stance on Civil Rights Act | Seattle Times Newspaper\n\n \n From that very link you posted:\n \n \n\n WASHINGTON - Rand Paul, the tea-party candidate who challenged the Republican establishment to win the party's Senate nomination in Kentucky on Tuesday, criticized a landmark civil-rights law Thursday, landing himself in a potentially damaging dispute over civil rights and race.\n \n In doing so, he provided Democrats an opportunity to portray him as extreme and renewed concern among Republicans that his views made him vulnerable in a general election.\n \n Paul, in a series of television and radio interviews, suggested that the Civil Rights Act of 1964 was too broad and should not apply to private businesses, such as luncheonettes. As his statements drew attacks, Paul issued a statement declaring that he would not support repealing the landmark 1964 statute and blaming political opponents for trying to distort his views by saying he favored repeal.\n \n \"Let me be clear: I support the Civil Rights Act because I overwhelmingly agree with the intent of the legislation, which was to stop discrimination in the public sphere and halt the abhorrent practice of segregation and Jim Crow laws,\" he said. Later, in a CNN interview, he said that if he had been in the Senate in 1964, he would have voted in favor of the act.\n \n\n \n From what I've read, it didn't mention exactly what statements he made.\n \n I don't take most accusations of any candidate seriously. During elections, every candidate of any party is greedy, corporate-loving, tax-raising, corrupt, racist, terrorist-coddling, etc. During the campaign, candidates of any party will be misquoted, have quotes taken out of context, and sometimes blatantly lied about if it helps demonize them. Campaigns and political committees like to demonize their opponents.", 
   {
    "unicode_changes_made": true
   }, 
   402699, 
   null, 
   1274558940.0
  ], 
  [
   402706, 
   null, 
   "Symbiote", 
   "Paul's position is the same as virtually every other Libertarian's position, which is that the government has no business telling people who they can or cannot associate with. So he supports the portion of the civil rights act about ending segregation, but opposes the part that forces integration.\n \n If that makes him \"racist\", which it obviously doesn't except to braindead tv reporters, than it makes every libertarian and anyone who believes in the constitution a racist.\n \n You may be right about it providing \"ammunition\" in the mainstream media, the same media that will heap praise on actual racist folk as long as they support a statist agenda.", 
   {}, 
   402702, 
   null, 
   1274561520.0
  ], 
  [
   402711, 
   null, 
   "Galileo", 
   "As I understand, his position is that the federal government does not have the power under the Constitution to stop private businesses from discriminating. Claiming that McDonald's, for example, should be able to post a \"Whites Only\" sign is going to sound racist to a lot of people no matter what the explanation.", 
   {}, 
   402706, 
   null, 
   1274562600.0
  ], 
  [
   402720, 
   null, 
   "snakespit", 
   "As I understand, his position is that the federal government does not have the power under the Constitution to stop private businesses from discriminating. Claiming that McDonald's, for example, should be able to post a \"Whites Only\" sign is going to sound racist to a lot of people no matter what the explanation.\n\n \n In the year 2010, doing so would be the death knell of most businesses. However, I think it would be great if racists who ran businesses put their beliefs right out in the open for all to see...then I could be sure that I never supported them. \n \n Ron and Rand Paul both have a deeper respect and understanding for the constitution than most everyone else in our government. Hopefully Rand gets a fair shake from the liberal media...but somehow I doubt it.", 
   {}, 
   402711, 
   null, 
   1274567760.0
  ], 
  [
   402723, 
   null, 
   "snakespit", 
   "Paul's position is the same as virtually every other Libertarian's position, which is that the government has no business telling people who they can or cannot associate with. So he supports the portion of the civil rights act about ending segregation, but opposes the part that forces integration.\n \n If that makes him \"racist\", which it obviously doesn't except to braindead tv reporters, than it makes every libertarian and anyone who believes in the constitution a racist.\n\n \n Exactly. It's all about the difference between private and public. Sadly, our country has forgotten far too much of the constitution.", 
   {}, 
   402706, 
   null, 
   1274568000.0
  ], 
  [
   402726, 
   null, 
   "Symbiote", 
   " Claiming that McDonald's, for example, should be able to post a \"Whites Only\" sign is going to sound racist to a lot of people no matter what the explanation.\n\n \n I don't know about that. When the ACLU says Nazis have the right to street parades advertising their white pride do you think the ACLU are a bunch of racists?\n \n Essentially what you're claiming is that the public is too stupid to distinguish between not making a law against something and endorsing it. I'm sure that's what the tv chatterboxes are hoping for, but at this point even the hillbillies of America realise the media is playing them for fools and aren't paying all that much attention.", 
   {}, 
   402711, 
   null, 
   1274570760.0
  ], 
  [
   402735, 
   null, 
   "Steeeeve", 
   "Glad to see there is some common sense on this thread. Rand Paul is absolutely right that the one section of the CRA is unconstitutional. I think only a very select few are dumb enough to believe Rachel Maddow and others who are going off about it. \n \n Talk about a manufactured issue though.", 
   {}, 
   402726, 
   null, 
   1274574900.0
  ], 
  [
   402752, 
   null, 
   "marc9000", 
   "I was pretty set on Rand Paul's opponent (Trey Grayson) in the primary up until about March, when I heard a radio ad of Grayson's quoting a Paul comment on the possibility of raising the retirement age. Life expectancy has gone way up since the retirement age of 65 was set, and to me raising it a couple of years only makes sense. Grayson ridiculing it caused me to spend about the next month being undecided, but to me Grayson showed himself to be a \"business as usual\" Republican more and more. By the time the day came to vote, I was firm in my vote for Paul. Though I can get too much Libertarianism in a hurry, I'm getting less and less afraid of putting it up against business as usual. :)\n \n One of the liberal commentators on Fox News (Bob Beckel) immediately claimed that the Paul victory would make it easier for the Democrat to take that Senate seat this fall. I don't think so, but we'll see.", 
   {}, 
   402723, 
   null, 
   1274584680.0
  ], 
  [
   402758, 
   null, 
   "Jo Bennett", 
   "In the year 2010, doing so would be the death knell of most businesses. However, I think it would be great if racists who ran businesses put their beliefs right out in the open for all to see...then I could be sure that I never supported them. \n\n \n But don't you think the existence of anti-discrimination legislation is the reason it has become unacceptable?", 
   {}, 
   402720, 
   null, 
   1274592900.0
  ], 
  [
   402959, 
   null, 
   "jyoshu", 
   "But don't you think the existence of anti-discrimination legislation is the reason it has become unacceptable?\n\n \n Even if the intentions are noble and the results effective, using the iron fist of law to force people to act a certain way is still imposing a moral ideological view onto them. Obviously, it's wrong to be racist, but that doesn't mean we should codify that morality into law and impose it on people.", 
   {}, 
   402758, 
   null, 
   1274724180.0
  ], 
  [
   404300, 
   null, 
   "Galileo", 
   "Does Rand Paul with his extremist beliefs live in la-la land?\n \n \"I'd also like to know whether Paul really believes in a conspiracy among the U.S., Canadian and Mexican governments to turn North America into a 'borderless, mass continent' bisected by a 10-lane superhighway. Because that's what he said in 2008... \n \n \"And while we're at it, what about Paul's recent analysis of the catastrophic oil spill in the Gulf of Mexico?...\n \n \"But the general idea -- that it's wrong to hold private firms strictly accountable for disasters such as the gulf spill -- appears to be something that Paul really believes, since he also dismisses the recent West Virginia mine explosion in which 29 miners were killed.... \n \n \"But maybe accidents are less likely to happen when appropriate safety standards are established and enforced. This kind of cause-and-effect reasoning is meaningful only to those who live in the real world, however. From all evidence, Paul lives in Libertarian La-La Land, where a purist philosophy leads people to believe in the purest nonsense.... \n \n \"Now that he is running for the Senate as a card-carrying Republican, Paul is going to have to abandon, or pretend to abandon, many of his loopy beliefs. This won't be easy, as illustrated by the hemming and hawing he did before finally endorsing the Civil Rights Act. Even then, he suggested that the law was justified only by the prevailing situation in the South. As soon as Paul is allowed out of his cave, someone should ask him whether the landmark legislation properly applies to the rest of the country.\"\n Eugene Robinson - Rand Paul's Libertarian La-La Land", 
   {}, 
   402959, 
   null, 
   1276125840.0
  ], 
  [
   404304, 
   null, 
   "Steeeeve", 
   "Does Rand Paul with his extremist beliefs live in la-la land?\nNo, he lives in reality where commonsense should prevail.\n \n Referring to the oil spill Paul basically stated that accidents happen and it is silly think we should destroy a company because one happens. Same thing with the mine accident. In fact, as demonstrated on this forum, not many people know about mining operations or drilling oil a mile down in the sea. In both cases it just looks like someone make a mistake at the wrong time and boom!", 
   {}, 
   404300, 
   null, 
   1276128600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Rand Paul likely contender for Senate.", 
  "url": "http://www.4forums.com/political/politics-debates/13568-rand-paul-likely-contender-senate.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13568, 
  "discussion_files": [
   [
    "26156.html", 
    "http://www.4forums.com/political/politics-debates/13568-rand-paul-likely-contender-senate-print.html"
   ], 
   [
    "26157.html", 
    "http://www.4forums.com/political/politics-debates/13568-rand-paul-likely-contender-senate-2-print.html"
   ]
  ], 
  "identifier": 13568
 }
]