[
 [
  [
   377807, 
   null, 
   "MarieAntoinette", 
   "News of another health care study released on Veterans' Day. \n \n \nLack of health care killed 2,266 US veterans last year: study\n (AFP) &#8211; 50 minutes ago\n \n WASHINGTON &#8212; The number of US veterans who died in 2008 because they lacked health insurance was 14 times higher than the US military death toll in Afghanistan that year, according to a new study.\n \n The analysis produced by two Harvard medical researchers estimates that 2,266 US military veterans under the age of 65 died in 2008 because they lacked health coverage and had reduced access to medical care.\n \n That figure is more than 14 times higher than the 155 US troop deaths in Afghanistan in 2008, the study says.\n \n Released as the United States commemorates fallen soldiers on Veterans Day, the study warns that even health care provided by the Veterans Health Administration (VA) leaves many veterans without coverage.\n \n The analysis uses census data to isolate the number of US veterans who lack both private health coverage and care offered by the VA.\n \n \"That's a group that's about 1.5 million people,\" said David Himmelstein, an associate professor of medicine at Harvard Medical School and co-founder of Physicians for a National Health Program who co-authored the study.\n \n Himmelstein and co-author Stephanie Woolhandler, also a Harvard medical professor, overlaid that figure with another study examining the mortality rate associated with lack of health insurance.\n \n \"The uninsured have about a 40 percent higher risk of dying each year than otherwise comparable insured individuals,\" Himmelstein told AFP.\n \n \"Putting that all together you get an estimate of almost 2,300 -- 2,266 veterans who die each year from lack of health insurance.\"\n \n Only some US veterans have access to medical care through the VA and coverage is apportioned on the basis of eight \"priority groups.\"\n \n \"They range from things like people who were prisoners of war, who have coverage for life, or who have battle injuries and therefore have coverage for their injuries for life,\" said Himmelstein.\n \n Veterans who fall below an income threshold that is determined on a county-by-county basis can qualify for care, but many veterans are \"working poor\" and fall just above the bracket.\n \n \"The priority eight group, the lowest priority, are veterans above the very poor group who have no other reason to be eligible and that group is essentially shut out of the VA,\" according to Himmelstein.\n \n The study comes as the US Senate weighs health care reform legislation and whether to offer government health insurance.\n \n Himmelstein warns that congressional proposals could still leave veterans uncovered and favors a national health care program similar to those in Britain and Canada. AFP: Lack of health care killed 2,266 US veterans last year: study\n\n \n Peace, and health care for ALL.\n \n http://www.youtube.com/watch?v=7kgAUf_rXss&feature=related", 
   {
    "post_info": {
     "post_title": "2,266 Veterans Died In 2008"
    }
   }, 
   null, 
   null, 
   1257973020.0
  ], 
  [
   377809, 
   null, 
   "Steeeeve", 
   "I'd like to know how they know these people would live if they had health care. \n \n I'd like to see the actual study...anyone got a link?", 
   {}, 
   377807, 
   null, 
   1257976260.0
  ], 
  [
   377812, 
   null, 
   "OldSarge", 
   "News of another health care study released on Veterans' Day. \n \n \n \n Peace, and health care for ALL.\n \n YouTube - Last Night, I had the strangest dream...\n\n \n If you believe that 2,000 pages of XXXX is going to do any thing to fix that problem you are delusional. Or more accurate certifiable. Veterans health care is run by the government and now you want it to run all health care. They sure can't get veteran health care right so by what stretch of the imingation do you think its going to do better with everyone?", 
   {}, 
   377807, 
   null, 
   1257978720.0
  ], 
  [
   377817, 
   null, 
   "snakespit", 
   "News of another health care study released on Veterans' Day. \n \n \n \n Peace, and health care for ALL.\n \n YouTube - Last Night, I had the strangest dream...\n\n \n So in support of a Government run health care program for all American citizens, you bring us an example of a Government run health care program for our veterans that according to the article is failing to provide adequate care to those veterans, and consequently causing them to die. Can you just imagine how much more comfortable I am with the idea of the government getting into the private sector health care business? \n \n \nthe study warns that even health care provided by the Veterans Health Administration (VA) leaves many veterans without coverage.\n\n \n Bravo Antonia. emoticon_xgood", 
   {}, 
   377807, 
   null, 
   1257980640.0
  ], 
  [
   377898, 
   null, 
   "simone", 
   "So in support of a Government run health care program for all American citizens, you bring us an example of a Government run health care program for our veterans that according to the article is failing to provide adequate care to those veterans, and consequently causing them to die. Can you just imagine how much more comfortable I am with the idea of the government getting into the private sector health care business? \n \n \n \n Bravo Antonia. emoticon_xgood\n\n Having the memory of an elephant, I remember quite clearly that George W. Bush managed to privatize a lot of the services offered by the VA and it was the incompetent management of the private sector that in many cases brought about the incompetent and neglectful care of our returning wounded soldiers..", 
   {}, 
   377817, 
   null, 
   1258053060.0
  ], 
  [
   377904, 
   null, 
   "simone", 
   "We must also remember that George W. Bush cut veterans' benefits while in office:\n \nBush to Cut Veterans' Benefits\n Bush plans to cut funding for veterans' health care over the next few years, yes this is while an increasing number of troops are returning home wounded from battle in Iraq and Afghanistan. The President is pushing these cuts to fulfill his pledge to \"balance the budget by 2012,\" which is a shell game in itself.\n \n \"Even though the cost of providing medical care to veterans has been growing rapidly - by more than 10 percent in many years - White House budget documents assume consecutive cutbacks in 2009 and 2010 and a freeze thereafter,\" according to a report by the AP.\n \n No, tax cuts are unthinkable. Pork barrel spending that spun out of control during Republican rule in Congress could simply NOT be vetoed. But funding for veterans wounded while serving in Bush's war? XXXX that, they should get better jobs with decent benefits!\n\n POLJUNK - Bush to Cut Veterans' Benefits\n \n George W. Bush's black little heart, financing taxcuts for his rich friends on the backs of wounded soldiers.", 
   {
    "unicode_changes_made": true
   }, 
   377898, 
   null, 
   1258053660.0
  ], 
  [
   377908, 
   null, 
   "simone", 
   "Published on Sunday, December 22, 2002 by the Boston Globe\n Frustrated Veterans Accuse Bush of Breaking Promise\n by Wayne Washington\n WASHINGTON - The leaders of America's most prominent veterans organizations say that President Bush is failing to honor past commitments to military men and women even as he prepares to send a new generation of soldiers and sailors into combat.\n \n The administration's support for rescinding lifetime health benefits for World War II and Korean War veterans and continuing problems at veterans hospitals stand as proof, veteran leaders say, that America is more than willing to lean on its soldiers during times of war but tolerates them serving as political props in peacetime.\n \n .... ''I'm terribly frustrated and extremely angry,'' said retired Air Force Colonel George ''Bud'' Day, a Republican who won the Medal of Honor and was a prisoner of war in North Vietnam with Senator John McCain of Arizona.\n \n Frustrated Veterans Accuse Bush of Breaking Promise\n \n People who really support our soldiers don't cut benefits on them and pull the carpet out from under them.", 
   {
    "post_info": {
     "post_title": "From the Boston Globe"
    }
   }, 
   377904, 
   null, 
   1258053960.0
  ], 
  [
   377923, 
   null, 
   "simone", 
   "And we must never forget good old Senator Coburn of Oklahoma (honest to God! Oklahoma elects the dumbest and most horrific legislators!) who hates the soldiers:\n \nI don't know if flag-waving Senator Tom Coburn of Oklahoma gave a speech with veterans as a backdrop today. What is known, as BarbinMD wrote earlier, is that he has a dismal record with veterans groups, Ds and Fs and rankings of 40% or worse from groups such as the Iraq and Afghanistan Veterans of America, the Disabled Veterans of America and the Retired Enlisted Association. No surprise.\n \n For weeks now, Senator Coburn has been using his \"holding\" privilege to block consideration of the Veterans Caregiver and Omnibus Health Benefits Act - S. 1963. The legislation would help severely wounded veterans of the Iraq and Afghan wars. Coburn wants to fund it by diverting unused stimulus funds.\n \n According to Army Times, the hope of many veterans organizations was to get the legislation passed by Veterans Day. The delay initiated by Coburn prompted a letter from 13 veterans organizations to Senate Majority Leader Harry Reid a week ago Monday:\n\n Daily Kos: State of the Nation\n \n The letter was signed by the American Legion, Veterans of Foreign Wars, Disabled American Veterans, AmVets, Paralyzed Veterans of America, Blinded Veterans Association, Military Order of the Purple Heart, Vietnam Veterans of America, Iraq and Afghanistan Veterans of America and Jewish War Veterans, plus the Military Officers Association of America, National Military Family Association and Wounded Warrior Project.\n \n We must never forget that Senator Coburn never had a problem with voting for off-budget and unfunded money for Bush's ongoing occupation of Iraq and Afghanistan, which of course benefited Bush and Coburn's military contractor friends.", 
   {}, 
   377908, 
   null, 
   1258055760.0
  ], 
  [
   377925, 
   null, 
   "simone", 
   "Oh, and Senator Coburn has never served in the military so he's totally clueless about what it's like to be in combat.", 
   {}, 
   377923, 
   null, 
   1258055940.0
  ], 
  [
   377946, 
   null, 
   "Steeeeve", 
   "Having the memory of an elephant, I remember quite clearly that George W. Bush managed to privatize a lot of the services offered by the VA and it was the incompetent management of the private sector that in many cases brought about the incompetent and neglectful care of our returning wounded soldiers..\n\n \n I don't seem to recall this...nor can I find any information on this. Do you care to provide some proof?", 
   {}, 
   377898, 
   null, 
   1258058520.0
  ], 
  [
   377947, 
   null, 
   "simone", 
   "Links are provided above, if you know how to use them.", 
   {}, 
   377946, 
   null, 
   1258058580.0
  ], 
  [
   377948, 
   null, 
   "simone", 
   "However, I don't know of a remedy for your selective memory. Somehow, I don't think that ginkgo extract would work in your case.", 
   {}, 
   377947, 
   null, 
   1258058640.0
  ], 
  [
   377953, 
   null, 
   "Steeeeve", 
   "Links are provided above, if you know how to use them.\n\n \n So your claim is the following: \"I remember quite clearly that George W. Bush managed to privatize a lot of the services offered by the VA and it was the incompetent management of the private sector that in many cases brought about the incompetent and neglectful care of our returning wounded soldiers..\"\n \n Not any of those links support this claim. Please provide evidence for the claim I quoted.", 
   {}, 
   377947, 
   null, 
   1258059060.0
  ], 
  [
   377961, 
   null, 
   "simone", 
   "December 4, 2005\n VA Diverted Healthcare Funds for Illegal Studies\n Funds were diverted from veterans? healthcare to pay for studies on outsourcing jobs and closing VA hospitals ? The dismantling of the VA is leading to privatization\n by Larry Scott\n One of the maxims of the Bush administration is: Never let the law get in your way. The political appointees who run the Department of Veterans? Affairs (VA) certainly know how to play by those rules.\n \n Between 2001 and 2004 the VA illegally diverted funds earmarked for veterans? healthcare to pay for studies on outsourcing jobs at VA facilities and to fund other studies on closing VA hospitals. The report detailing the VA's misdeeds was released last week by the Government Accountability Office (GAO). (The full GAO report is available here -- http://www.gao.gov/new.items/d06124r.pdf )\n \n The VA officially denies any wrongdoing. VA Secretary Jim Nicholson argued, \"Congress clearly did not intend to preclude all manner of cost analysis necessary for the day-to-day administration of our health-care system.\" However, Congress did pass legislation in 1981 that prohibits the diversion of funds appropriated to VA medical care accounts for studies on the cost of keeping work in-house versus that of contracting it out.\n \n During the time VA officials were misappropriating funds they were working with Republicans in Congress to try to change the 1981 law that they were breaking. Senator Larry Craig (R-ID), Chairman of the Senate Committee on Veterans? Affairs, introduced legislation (S. 1182 Sec 7) to do away with the prohibition and allow the VA to spend healthcare funds on outsourcing studies.\n \n Also during this time the VA asked Congress for funds to conduct outsourcing studies. The amounts ranged from $16 million to $50 million. The VA was turned down every time. Since the VA couldn't get the funds, they just broke the law.\n\n VA Watchdog dot Org - Article for OpEdNews dot Com - VA Diverted Healthcare Funds for Illegal Studies\n \n The outsourcing of VA services played a major part in the veterans' care scandal that erupted during the latter years of the Bush Administration.", 
   {}, 
   377953, 
   null, 
   1258060140.0
  ], 
  [
   377965, 
   null, 
   "simone", 
   "VA Hospital Scandal--Caring for Veterans\n 04/05/2007\n 7:00pm - 8:00pm\n The Public Square at the IHC\n Last month the Washington Post's in depth report revealing appalling conditions at Walter Reed Medical Center outraged the nation. The hospital, run by the Department of Defense, had been known as one of the nation's premier facilities for treating the wounded from Iraq and Afghanistan. Roach-infestation, shoddy outpatient care, and wounded patients forced to care for each other, are just some of the shocking conditions discovered by reporters during their four-month investigation. In the weeks that followed, several high-level Pentagon officials were forced to step down.\n \n As little as two years ago, veterans' hospitals were heralded for providing the best treatment in the county. They were applauded for reforming their previous reputation as dangerous, dirty, and scandal-ridden. Many suggested that the VA might hold the answer to America's health-care crisis. What happened? Have the nation's priorities changed in how we value veterans and the many injured soldiers in need of treatment?\n \n Critics have long alleged that problems of military care extend to the VA's vast network, which provides supplemental health care and rehabilitation to 5.8 million veterans. As conflicts have continued in Iraq and Afghanistan, the number of those in need of both long and short term care have increased but the budget has not. Some argue that this is yet another instance of how the Bush Administration has been hiding the true costs and impact of the war. \n\n VA Hospital Scandal--Caring for Veterans | Illinois Humanities Council\n \n The work of private contractors. The incompetence of the private sector because of their greed for more profits.\n \n The dangers of profit-only health care.", 
   {
    "unicode_changes_made": true
   }, 
   377961, 
   null, 
   1258060440.0
  ], 
  [
   377971, 
   null, 
   "Steeeeve", 
   "VA Hospital Scandal--Caring for Veterans | Illinois Humanities Council\n \n The work of private contractors. The incompetence of the private sector because of their greed for more profits.\n \n The dangers of profit-only health care.\n\n \n Well Simone, after some quick research, you might actually have something here.\n \n It doesn't appear this is the private sectors fault as you seem to think but the outsourcing did cause numerous problems. Bush had an initiative back in 01-02 to have agencies look towards outsourcing. The outsourcing started in 2000 under Clinton and was pushed more but Bush's thing. It was the Army's decision to go ahead with the outsourcing.\n \n What Simone doesn't tell us is that this appears to be the failure of Walter Reed management as opposed to the companies outsourced to. In one instance Walter Reed cut employees from 300 to 60 (in one area) before the private company even took over. There was no problem with the private company not fulfilling its contracted duty. This reminds me of what happened here in Virginia with Northrup Gruman handling the IT for the Virginia Government. They basically wrote the contract so NG would be better off meeting deadlines of a few areas and taking penalties on the rest. \n \n Anywho, so the Army writes boneheaded contracts and the IAP Worldwide people take advantage of it. \n \n Also, it appears outsourcing might have helped in some areas:\n HSR&D Study: VCR 99-013\n \n Finally, the current health care bill seeks to use outside sources if I recall correctly (could be wrong) so this wouldn't change much.\n \n So while I give kudos to Simone for being mostly accurate about this comment \"George W. Bush managed to privatize a lot of the services offered by the VA\". The only part wrong is that it was pushed more by Bush but started by the Army in 2000 prior to Bush being elected.", 
   {}, 
   377965, 
   null, 
   1258064220.0
  ], 
  [
   377972, 
   null, 
   "OldSarge", 
   "Having the memory of an elephant, I remember quite clearly that George W. Bush managed to privatize a lot of the services offered by the VA and it was the incompetent management of the private sector that in many cases brought about the incompetent and neglectful care of our returning wounded soldiers..\n\n \n Well you are alone in it baby. And with your leftist ranting and raving ya got to come up with some proof. After all a leftist would know the truth if it bit them. I see Steeeeve shot your memory full of holes as usual.", 
   {}, 
   377898, 
   null, 
   1258064220.0
  ], 
  [
   377974, 
   null, 
   "OldSarge", 
   "Oh, and Senator Coburn has never served in the military so he's totally clueless about what it's like to be in combat.\n\n \n So neither are you.", 
   {}, 
   377925, 
   null, 
   1258064340.0
  ], 
  [
   377975, 
   null, 
   "OldSarge", 
   "Frustrated Veterans Accuse Bush of Breaking Promise\n \n People who really support our soldiers don't cut benefits on them and pull the carpet out from under them.\n\n \n And you want government to run all of health care after that? Get a grip on reality baby.", 
   {}, 
   377908, 
   null, 
   1258064460.0
  ], 
  [
   378001, 
   null, 
   "Penfold", 
   "So neither are you.\n\n \n \n The nearest you got was a nintendo game OldFraud, so you have no room to comment.", 
   {}, 
   377974, 
   null, 
   1258075860.0
  ], 
  [
   378003, 
   null, 
   "OldSarge", 
   "The nearest you got was a nintendo game OldFraud, so you have no room to comment.\n\n \n Oh the comic relief showed up with its usual insult. And your evidence is? I thought not my thimble wearing comic relief. I'd ask about yours but we both know you have none.", 
   {}, 
   378001, 
   null, 
   1258076160.0
  ], 
  [
   378015, 
   null, 
   "Winston Smith", 
   "The nearest you got was a nintendo game OldFraud, so you have no room to comment.\n\n \n the closest old sarge got to see action was as an extra in the block buster : \"We were never soldiers\" starring Dick and Dubya emoticon_smile", 
   {}, 
   378001, 
   null, 
   1258086480.0
  ], 
  [
   378021, 
   null, 
   "JPSartre12", 
   "the closest old sarge got to see action was as an extra in the block buster : \"We were never soldiers\" starring Dick and Dubya emoticon_smile\n\n \n I believe that OS already gave us his military resume and it was impressive. Now, other than being a buttboy for Pinochet, what have you done?", 
   {}, 
   378015, 
   null, 
   1258089060.0
  ], 
  [
   378079, 
   null, 
   "OldSarge", 
   "the closest old sarge got to see action was as an extra in the block buster : \"We were never soldiers\" starring Dick and Dubya emoticon_smile\n\n \n Gee right on schedule here's the other half of the comic relief. Get a job and a life and off the dole. PS I think mum would be happy to see you out of her basement too. ", 
   {}, 
   378015, 
   null, 
   1258122480.0
  ], 
  [
   378081, 
   null, 
   "MarieAntoinette", 
   "If you believe that 2,000 pages of XXXX is going to do any thing to fix that problem you are delusional.\n\n \n No, I favor a national plan like U.K. or Canada which can be enacted with a much sparser piece of legislation.\n \n \nThey sure can't get veteran health care right so by what stretch of the imingation do you think its going to do better with everyone\n\n \n It is no stretch of the imagination except for someone as intellectually challenged as yourself. No industrialized and westernized nation on earth with a universal system - where we stand singularly behind the times - treats its veterans as disgracefully as ours does.", 
   {}, 
   377812, 
   null, 
   1258126200.0
  ], 
  [
   378086, 
   null, 
   "OldSarge", 
   "No, I favor a national plan like U.K. or Canada which can be enacted with a much sparser piece of legislation.\n \n \n \n It is no stretch of the imagination except for someone as intellectually challenged as yourself. No industrialized and westernized nation on earth with a universal system - where we stand singularly behind the times - treats its veterans as disgracefully as ours does.\n\n \n Speaking of intellectually challenged have you read what you just wrote? I knew insult was all you had but then that is all most leftists have. You seem to believe that these leftist clowns can do any thing right when they so obviously can't even get veteran care right. I am not sure which one is more mentally challenged you or the ones with 2000 pages of feces. ", 
   {}, 
   378081, 
   null, 
   1258129860.0
  ], 
  [
   378088, 
   null, 
   "MarieAntoinette", 
   "You seem to believe that these leftist clowns can do any thing right when they so obviously can't even get veteran care right.\n\n \n The deterioration of veterans' care has been at the hands of the right and the private sector.", 
   {}, 
   378086, 
   null, 
   1258130460.0
  ], 
  [
   378094, 
   null, 
   "JPSartre12", 
   "The deterioration of veterans' care has been at the hands of the right and the private sector.\n\n \n We all know that the Left has such a stellar record when it comes to the military, right? emoticon_rolleyes", 
   {}, 
   378088, 
   null, 
   1258134120.0
  ], 
  [
   378140, 
   null, 
   "simone", 
   "So neither are you.\n\n I'm in combat every day with total XXXXXX, whom I shall not deign to name.\n \n I'm using a higher form of English that you prolly think is a foreign language, OS.", 
   {}, 
   377974, 
   null, 
   1258143720.0
  ], 
  [
   378144, 
   null, 
   "JPSartre12", 
   "I'm in combat every day with total XXXXXX, whom I shall not deign to name.\n \n I'm using a higher form of English that you prolly think is a foreign language, OS.\n\n \n So \"prolly\" is part of that higher form of english?", 
   {}, 
   378140, 
   null, 
   1258144080.0
  ], 
  [
   378147, 
   null, 
   "simone", 
   "So \"prolly\" is part of that higher form of english?\n\n I thought I'd mix in a term or two that most would recognize.", 
   {}, 
   378144, 
   null, 
   1258149180.0
  ], 
  [
   378159, 
   null, 
   "MarieAntoinette", 
   "We all know that the Left has such a stellar record when it comes to the military, right?\n\n \n No we don't all know. What is your remark supposed to mean.", 
   {}, 
   378094, 
   null, 
   1258156980.0
  ], 
  [
   378210, 
   null, 
   "JPSartre12", 
   "No we don't all know. What is your remark supposed to mean.\n\n \n The track record of liberals and military spending has been dismal in the past. Carter decimated the military. Reagan had to make a deal with the devil, Tipp O'Neil to rebuild it. Clinton tried to do the same.", 
   {}, 
   378159, 
   null, 
   1258176060.0
  ], 
  [
   378251, 
   null, 
   "OldSarge", 
   "The deterioration of veterans' care has been at the hands of the right and the private sector.\n\n \n You know that has to rate up there with the world's most dumb comments. The private sector has nothing to do with veteran's care and you should know it. As to the right ha ha good luck with proof. It is the left who despises the military. The chosen one ever tried to get combat wounded to pay for their own medical care after discharge. Too bad that got shot down.", 
   {}, 
   378088, 
   null, 
   1258209000.0
  ], 
  [
   378253, 
   null, 
   "OldSarge", 
   "the closest old sarge got to see action was as an extra in the block buster : \"We were never soldiers\" starring Dick and Dubya emoticon_smile\n\n \n Gee I never heard of that film. Were you lying about it being made? Then again truth was never a strong point to the left. ", 
   {}, 
   378015, 
   null, 
   1258209180.0
  ], 
  [
   378259, 
   null, 
   "Penfold", 
   "the closest old sarge got to see action was as an extra in the block buster : \"We were never soldiers\" starring Dick and Dubya emoticon_smile\n\n \n He's a tiny part of a massive army, veterans of a million battles, who never left their bedroom.", 
   {}, 
   378015, 
   null, 
   1258213560.0
  ], 
  [
   378261, 
   null, 
   "OldSarge", 
   "He's a tiny part of a massive army, veterans of a million battles, who never left their bedroom.\n\n \n Funny coming from one who never left mum's basement.", 
   {}, 
   378259, 
   null, 
   1258215720.0
  ], 
  [
   378600, 
   null, 
   "OldSarge", 
   "TriCare for Life is a component of compensation for career length service that grew out of promises made by the military services as an inducement to serve. That inducement was used extensively following WW II and the entire Cold War but military members with career length service found that despite the promises, they were required to buy insurance or at the least supplemental insurance to cover health care costs that were provided outside the military health care system. That came to a head when Colonel &#8220;Bud&#8221; Day took the case to the Supreme Court and lost. To its credit however the Republican Congress enacted TriCare for Life which effectively fulfills the obligation. \n \n Now, however, Obama, his Administration and the Democrat Congress are reported to be planning modifications to TriCare for Life that would levy taxes on that earned benefit to help pay for unearned universal health care. So, in additional to having earned health care incident to service, under the Obama/Democrat plan military members will be required to pay additional taxes to pay for those who have earned nothing. Sort of like the chosen one's wanting to have combat wounded pay for their injuries with civilian heath care, remember?\n \n Despite their best effort to disguise this monstrosity as health care, it is not. No doubt there should be a safety net where appropriate, but the obscene piece of proposed legislation that Democrats and Obama are creating is worthy of a nothing less than feeding it into a shredder.", 
   {}, 
   378261, 
   null, 
   1258409400.0
  ], 
  [
   378651, 
   null, 
   "MarieAntoinette", 
   "\n No doubt there should be a safety net where appropriate,\n\n \n And therein lies the clincher, doesn't it. You can't sit in a waiting room with the rest of your fellow Americans, can you. You have to have \"the right kind of people\" there.\n \n Your kind of bigoted extremism on healthcare, your conditional Christian love, your caste system you can't part with, is probably more the cause of this monstrosity of legislation in Congress, at present, than anything else.\n \n I don't believe you're a veteran either. I think you're another one of Ali's bizarre handles.", 
   {}, 
   378600, 
   null, 
   1258429020.0
  ], 
  [
   378669, 
   null, 
   "OldSarge", 
   "And therein lies the clincher, doesn't it. You can't sit in a waiting room with the rest of your fellow Americans, can you. You have to have \"the right kind of people\" there.\n \n Your kind of bigoted extremism on healthcare, your conditional Christian love, your caste system you can't part with, is probably more the cause of this monstrosity of legislation in Congress, at present, than anything else.\n \n I don't believe you're a veteran either. I think you're another one of Ali's bizarre handles.\n\n \n Um not sure where you got off with the waiting room strawman but that dog don't hunt. \n \n No I can see a load of jelly a mile off. Your resort to insult merely proves you lost the debate.\n \n I don't believe you are full human either so that makes us even. ", 
   {}, 
   378651, 
   null, 
   1258434840.0
  ], 
  [
   378671, 
   null, 
   "MarieAntoinette", 
   "[B]Um not sure where you got off with the waiting room strawman but that dog don't hunt.\n\n \n Oh no bigshot? Shoot this one: what's \"appropriate\"?\n \n The only qualification I know for providing health care is a human being who needs a doctor.\n \n \nI don't believe you are full human either so that makes us even.\n\n \n I'm sure there are many people you would \"appropriately\" deny healthcare on that same basis.", 
   {}, 
   378669, 
   null, 
   1258436280.0
  ], 
  [
   378709, 
   null, 
   "OldSarge", 
   "Oh no bigshot? Shoot this one: what's \"appropriate\"?\n \n The only qualification I know for providing health care is a human being who needs a doctor.\n \n \n \n I'm sure there are many people you would \"appropriately\" deny healthcare on that same basis.\n\n \n More strawmen in flames baby. \n \n You don't know much at all do you?\n \n I'm not the bad guy here so your fiction of me denying any thing doesn't fly. On the flip side of the coin I don't see you slamming George Soros either. he could pay for all our health care and then some. Carefull there is some mud on your jackboots. ", 
   {}, 
   378671, 
   null, 
   1258470000.0
  ], 
  [
   378735, 
   null, 
   "MarieAntoinette", 
   "I'm not the bad guy here so your fiction of me denying any thing doesn't fly. \n\n \n Answer the question, then. When is it \"appropriate\" in your book, big mouth, to deliver health care?", 
   {}, 
   378709, 
   null, 
   1258480500.0
  ], 
  [
   378746, 
   null, 
   "OldSarge", 
   "Answer the question, then. When is it \"appropriate\" in your book, big mouth, to deliver health care?\n\n \n There you go again with the insults subhuman. Answer where you got you 44,000 deaths first.", 
   {}, 
   378735, 
   null, 
   1258483860.0
  ], 
  [
   378758, 
   null, 
   "JPSartre12", 
   "And therein lies the clincher, doesn't it. You can't sit in a waiting room with the rest of your fellow Americans, can you. You have to have \"the right kind of people\" there.\n \n Your kind of bigoted extremism on healthcare, your conditional Christian love, your caste system you can't part with, is probably more the cause of this monstrosity of legislation in Congress, at present, than anything else.\n \n I don't believe you're a veteran either. I think you're another one of Ali's bizarre handles.\n\n \n Pot. Kettle. Black. LOL", 
   {}, 
   378651, 
   null, 
   1258486980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  2,266 Veterans Died In 2008", 
  "url": "http://www.4forums.com/political/health-debates/13563-2-266-veterans-died-2008-a.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13563, 
  "discussion_files": [
   [
    "8459.html", 
    "http://www.4forums.com/political/health-debates/13563-2-266-veterans-died-2008-a-print.html"
   ], 
   [
    "8460.html", 
    "http://www.4forums.com/political/health-debates/13563-2-266-veterans-died-2008-a-3-print.html"
   ], 
   [
    "8461.html", 
    "http://www.4forums.com/political/health-debates/13563-2-266-veterans-died-2008-a-2-print.html"
   ]
  ], 
  "identifier": 13563
 }
]