[
 [
  [
   378082, 
   null, 
   "MarieAntoinette", 
   "An intelligent proposal for real reform by Dr. Marcia Angell, Physician, Author, Senior Lecturer, Harvard Medical School, 11/08/09 @ huffpost. I especially like how it opens Medicare in increments, over time spans, by age group. And all this would give the tea baggers more than sufficient time to jump their sinking ship.\n \n \nWell, the House health reform bill -- known to Republicans as the Government Takeover -- finally passed after one of Congress's longer, less enlightening debates. Two stalwarts of the single-payer movement split their votes; John Conyers voted for it; Dennis Kucinich against. Kucinich was right.\n \n Conservative rhetoric notwithstanding, the House bill is not a \"government takeover.\" I wish it were. Instead, it enshrines and subsidizes the \"takeover\" by the investor-owned insurance industry that occurred after the failure of the Clinton reform effort in 1994. To be sure, the bill has a few good provisions (expansion of Medicaid, for example), but they are marginal. It also provides for some regulation of the industry (no denial of coverage because of pre-existing conditions, for example), but since it doesn't regulate premiums, the industry can respond to any regulation that threatens its profits by simply raising its rates. The bill also does very little to curb the perverse incentives that lead doctors to over-treat the well-insured. And quite apart from its content, the bill is so complicated and convoluted that it would take a staggering apparatus to administer it and try to enforce its regulations.\n \n What does the insurance industry get out of it? Tens of millions of new customers, courtesy of the mandate and taxpayer subsidies. And not just any kind of customer, but the youngest, healthiest customers -- those least likely to use their insurance. The bill permits insurers to charge twice as much for older people as for younger ones. So older under-65's will be more likely to go without insurance, even if they have to pay fines. That's OK with the industry, since these would be among their sickest customers. (Shouldn't age be considered a pre-existing condition?)\n \n Insurers also won't have to cover those younger people most likely to get sick, because they will tend to use the public option (which is not an \"option\" at all, but a program projected to cover only 6 million uninsured Americans). So instead of the public option providing competition for the insurance industry, as originally envisioned, it's been turned into a dumping ground for a small number of people whom private insurers would rather not have to cover anyway.\n \n If a similar bill emerges from the Senate and the reconciliation process, and is ultimately passed, what will happen?\n \n First, health costs will continue to skyrocket, even faster than they are now, as taxpayer dollars are pumped into the private sector. The response of payers -- government and employers -- will be to shrink benefits and increase deductibles and co-payments. Yes, more people will have insurance, but it will cover less and less, and be more expensive to use.\n \n But, you say, the Congressional Budget Office has said the House bill will be a little better than budget-neutral over ten years. That may be, although the assumptions are arguable. Note, though, that the CBO is not concerned with total health costs, only with costs to the government. And it is particularly concerned with Medicare, the biggest contributor to federal deficits. The House bill would take money out of Medicare, and divert it to the private sector and, to some extent, to Medicaid. The remaining costs of the legislation would be paid for by taxes on the wealthy. But although the bill might pay for itself, it does nothing to solve the problem of runaway inflation in the system as a whole. It's a shell game in which money is moved from one part of our fragmented system to another.\n \n Here is my program for real reform:\n \n Recommendation #1: Drop the Medicare eligibility age from 65 to 55. This should be an expansion of traditional Medicare, not a new program. Gradually, over several years, drop the age decade by decade, until everyone is covered by Medicare. Costs: Obviously, this would increase Medicare costs, but it would help decrease costs to the health system as a whole, because Medicare is so much more efficient (overhead of about 3% vs. 20% for private insurance). And it's a better program, because it ensures that everyone has access to a uniform package of benefits.\n \n Recommendation #2: Increase Medicare fees for primary care doctors and reduce them for procedure-oriented specialists. Specialists such as cardiologists and gastroenterologists are now excessively rewarded for doing tests and procedures, many of which, in the opinion of experts, are not medically indicated. Not surprisingly, we have too many specialists, and they perform too many tests and procedures. Costs: This would greatly reduce costs to Medicare, and the reform would almost certainly be adopted throughout the wider health system.\n \n Recommendation #3: Medicare should monitor doctors' practice patterns for evidence of excess, and gradually reduce fees of doctors who habitually order significantly more tests and procedures than the average for the specialty. Costs: Again, this would greatly reduce costs, and probably be widely adopted.\n \n Recommendation #4: Provide generous subsidies to medical students entering primary care, with higher subsidies for those who practice in underserved areas of the country for at least two years. Costs: This initial, rather modest investment in ending our shortage of primary care doctors would have long-term benefits, in terms of both costs and quality of care.\n \n Recommendation #5: Repeal the provision of the Medicare drug benefit that prohibits Medicare from negotiating with drug companies for lower prices. (The House bill calls for this.) That prohibition has been a bonanza for the pharmaceutical industry. For negotiations to be meaningful, there must be a list (formulary) of drugs deemed cost-effective. This is how the Veterans Affairs System obtains some of the lowest drug prices of any insurer in the country. Costs: If Medicare paid the same prices as the Veterans Affairs System, its expenditures on brand-name drugs would be a small fraction of what they are now.\n \n Is the House bill better than nothing? I don't think so. It simply throws more money into a dysfunctional and unsustainable system, with only a few improvements at the edges, and it augments the central role of the investor-owned insurance industry. The danger is that as costs continue to rise and coverage becomes less comprehensive, people will conclude that we've tried health reform and it didn't work. But the real problem will be that we didn't really try it. I would rather see us do nothing now, and have a better chance of trying again later and then doing it right.\n", 
   {
    "post_info": {
     "post_title": "Is The House Health Bill Better Than Nothing?"
    }
   }, 
   null, 
   null, 
   1258126800.0
  ], 
  [
   378083, 
   null, 
   "Steeeeve", 
   "The so called \"teabaggers' ship would only be sinking because too many people are getting on it. I don't think the problem is lack of support considering the polls out there....not that you'd know anything about that emoticon_frazzled", 
   {}, 
   378082, 
   null, 
   1258127640.0
  ], 
  [
   378085, 
   null, 
   "MarieAntoinette", 
   "The so called \"teabaggers' ship would only be sinking because too many people are getting on it. I don't think the problem is lack of support considering the polls out there....not that you'd know anything about that\n\n \n That's quite correct since we've discussed your \"polls\" on other threads and your information is about as reputable as Hannity's 2nd grade montages.", 
   {}, 
   378083, 
   null, 
   1258128060.0
  ], 
  [
   378255, 
   null, 
   "OldSarge", 
   "An intelligent proposal for real reform by Dr. Marcia Angell, Physician, Author, Senior Lecturer, Harvard Medical School, 11/08/09 @ huffpost. I especially like how it opens Medicare in increments, over time spans, by age group. And all this would give the tea baggers more than sufficient time to jump their sinking ship.\n\n \n I don't think you are going to get the gay community to jump ship any time soon. ", 
   {}, 
   378082, 
   null, 
   1258209300.0
  ], 
  [
   378304, 
   null, 
   "MarieAntoinette", 
   "I don't think you are going to get the gay community to jump ship any time soon.\n\n \n What does the gay community have to do with this? \n \n Besides the fact that they are Americans like anyone else who needs health care.", 
   {}, 
   378255, 
   null, 
   1258234740.0
  ], 
  [
   378315, 
   null, 
   "OldSarge", 
   "What does the gay community have to do with this? \n \n Besides the fact that they are Americans like anyone else who needs health care.\n\n \n all this would give the tea baggers more than sufficient time to jump their sinking ship.\n \n You did know that is a term for a specific gay male act?", 
   {}, 
   378304, 
   null, 
   1258237080.0
  ], 
  [
   378319, 
   null, 
   "MarieAntoinette", 
   "all this would give the tea baggers more than sufficient time to jump their sinking ship.\n \n You did know that is a term for a specific gay male act?\n\n \n Quite frankly, no. And from I read in the various press outlets, including those who describe themselves as such, they don't either.", 
   {}, 
   378315, 
   null, 
   1258239000.0
  ], 
  [
   378323, 
   null, 
   "MarieAntoinette", 
   "Hmm, interesting googling about. I guess this little teabagger does know that other meaning. And I bet the adult smiling approvingly at him disapproves of sex education in the schools.\n \n Dickipedia: Teabaggers", 
   {
    "post_info": {
     "post_title": "People corrupted by a very young age ..."
    }
   }, 
   378319, 
   null, 
   1258242300.0
  ], 
  [
   378325, 
   null, 
   "Steeeeve", 
   "That's quite correct since we've discussed your \"polls\" on other threads and your information is about as reputable as Hannity's 2nd grade montages.\nWOW, you really are delusional. If you remember correctly I without a doubt showed you that your polls were wrong. One poll you didn't have the latest information and the others were from pre-2007. It was embarrassing...apparently to the point where you can't even admit it.", 
   {}, 
   378085, 
   null, 
   1258242780.0
  ], 
  [
   378329, 
   null, 
   "OldSarge", 
   "Quite frankly, no. And from I read in the various press outlets, including those who describe themselves as such, they don't either.\n\n \n No but the left-tard (redundancy alert) media aka the lamestream media sure did and does. Hence the demonization of thos who would dare to protest the chosen one's leftist policy. ", 
   {}, 
   378319, 
   null, 
   1258243920.0
  ], 
  [
   378330, 
   null, 
   "OldSarge", 
   "Hmm, interesting googling about. I guess this little teabagger does know that other meaning. And I bet the adult smiling approvingly at him disapproves of sex education in the schools.\n \n Dickipedia: Teabaggers\n\n \n Now why did I know you'd be on the Puffington Post?", 
   {}, 
   378323, 
   null, 
   1258244040.0
  ], 
  [
   378331, 
   null, 
   "MarieAntoinette", 
   "Now why did I know you'd be on the Puffington Post?\n\n \n Very poorly executed diversionary tactic.", 
   {}, 
   378330, 
   null, 
   1258246920.0
  ], 
  [
   378332, 
   null, 
   "OldSarge", 
   "Very poorly executed diversionary tactic.\n\n \n And here I was about to say that of you and Puff.", 
   {}, 
   378331, 
   null, 
   1258247100.0
  ], 
  [
   378333, 
   null, 
   "MarieAntoinette", 
   "WOW, you really are delusional. If you remember correctly I without a doubt showed you that your polls were wrong. One poll you didn't have the latest information and the others were from pre-2007. It was embarrassing...apparently to the point where you can't even admit it.\n\n \n Don't be shy. Link the thread, so users can read you in all your brilliance, instead of all your bravado.", 
   {}, 
   378325, 
   null, 
   1258247160.0
  ], 
  [
   378334, 
   null, 
   "MarieAntoinette", 
   "And here I was about to say that of you and Puff.\n\n \n You seem very uncomfortable with the fact that your teabaggers have been exposed for deliberately using that term in the slang sexual sense you are so familiar with, and even encouraging their children to use it in such a manner, showing how corrupt and depraved they are.\n \n Let the board know when you have something of substance, for a change, to say about healthcare for ALL Americans. Or something of substance on any other board, for that matter.", 
   {}, 
   378332, 
   null, 
   1258247520.0
  ], 
  [
   378364, 
   null, 
   "Steeeeve", 
   "Don't be shy. Link the thread, so users can read you in all your brilliance, instead of all your bravado.\n\n \n I'm glad you linked it. YOU never responded to this: http://www.4forums.com/political/377590-post72.html\n \n You couldn't show any current poll to support your position! In fact, you had to go back to 2008 and look at only ONE state to support your 65% number. \n \n Can you explain to the readers of this forum why you refuse to admit any of this? Why you refuse to come clean? Perhaps it is just your style to try and manipulate and bring down people that don't agree with you...kinda like when you insulted the admin of this forum for banning you...twice. You're pathetic.", 
   {}, 
   378333, 
   null, 
   1258273500.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is The House Health Bill Better Than Nothing?", 
  "url": "http://www.4forums.com/political/health-debates/13570-house-health-bill-better-than-nothing.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13570, 
  "discussion_files": [
   [
    "2587.html", 
    "http://www.4forums.com/political/health-debates/13570-house-health-bill-better-than-nothing-print.html"
   ], 
   [
    "2588.html", 
    "http://www.4forums.com/political/health-debates/13570-house-health-bill-better-than-nothing-2-print.html"
   ]
  ], 
  "identifier": 13570
 }
]