[
 [
  [
   378687, 
   null, 
   "jazyjason", 
   "By 365gay Newswire\n 11.16.2009 12:29pm EST\n \n Towleroad reported today that a gay Puerto Rican teen was found brutally murdered on the island.\n \n Nineteen-year-old, Jorge Steven Lopez Mercado's body was found burned, decapitated and dismembered on Nov. 14 in Cayey, a city only a few miles away from his hometown in Caguas.\n \n According to an iReport by Christopher Pagan, \"He was a very well known person in the gay community of Puerto Rico, and very loved.\"\n \n Pagan said, \"Never in the history of Puerto Rico has a murder been classified as a hate crime. Even though we have to follow federal mandates and laws, many of the laws in which are passed in the USA such as Obama's new bill, do not always directly get practiced in Puerto Rico.\"\n \n Pagan also noted the public remarks from a police investigator for the case that 'people who lead this type of lifestyle need to be aware that this will happen'.\n \n Towleroad translated gay activist Pedro Julio Serrano's response:\n \n \"It is inconceivable that the investigating officer suggests that the victim deserved his fate, like a woman deserves rape for wearing a short skirt. We demand condemnation of this investigator and demand that Superintendent Figueroa Sancha replace him with someone capable of investigating this case without prejudice.\"\n \n According to Pagan, the story has only made local headlines and deserves international coverage.", 
   {
    "post_info": {
     "post_title": "Gay teen burned and decapitated in Puerto Rico"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1258452960.0
  ], 
  [
   378715, 
   null, 
   "gansao", 
   "The police investigator did not say he deserved his fate but it suits you to suggest that he did.", 
   {}, 
   378687, 
   null, 
   1258472940.0
  ], 
  [
   378720, 
   null, 
   "jyoshu", 
   "Wouldn't it be better to hold off and see if hate was indeed a motive before automatically assuming it was, here? What's to say the killer wasn't just some nutcase?\n Guess that's a gay-pride biased publication for ya, though.", 
   {}, 
   378715, 
   null, 
   1258474980.0
  ], 
  [
   378724, 
   null, 
   "gansao", 
   "Wouldn't it be better to hold off and see if hate was indeed a motive before automatically assuming it was, here? What's to say the killer wasn't just some nutcase?\n Guess that's a gay-pride biased publication for ya, though.\n\n \n The Gay we-are-victims brigade never pass up an opportunity.", 
   {}, 
   378720, 
   null, 
   1258475280.0
  ], 
  [
   378779, 
   null, 
   "jazyjason", 
   "Wouldn't it be better to hold off and see if hate was indeed a motive before automatically assuming it was, here? What's to say the killer wasn't just some nutcase?\n Guess that's a gay-pride biased publication for ya, though.\n\n \n The body was burned and decapitated and the victim was an openly gay man well known in the LGBT community. The evidence points toward a hate crime no matter how watered down your side attempts to make it.", 
   {}, 
   378720, 
   null, 
   1258491180.0
  ], 
  [
   378780, 
   null, 
   "jazyjason", 
   "The Gay we-are-victims brigade never pass up an opportunity.\n\n \n An opportunity? This was a human being Gansao. I know you don't want to hear that gays are human or even people deserving of rights, but sadly your mistaken. This was a person who did not deserve such a horrible fate and sinister act of cruelty done to him no matter the reasoning.\n \n \n \n The fact is gay people all over the world are suffering increased acts of violence against them from the Gays in Sadir City in Iraq being tortured and forced to eat laxatives while their anus has been sealed with a glue that can only be removed with surgery until they die, or those like Seaman August Provost who was shot to death in a guard shack in Camp Pendalton for being openly gay and was African American.\n \n \n These senseless acts of HATE yes hate Gansao, need to be stopped and these sick killers brought to justice.", 
   {}, 
   378724, 
   null, 
   1258491480.0
  ], 
  [
   378788, 
   null, 
   "JPSartre12", 
   "The body was burned and decapitated and the victim was an openly gay man well known in the LGBT community. The evidence points toward a hate crime no matter how watered down your side attempts to make it.\n\n \n Amazing how you can make such a strong statement based on ZERO facts. Maybe he was ALSO a double-crossing drug dealer in addition to being gay. Ever consider that?\n \n I think that the police officer's comment was inexcusable, but don't jump to conclusions without a modicum of facts.", 
   {}, 
   378779, 
   null, 
   1258492380.0
  ], 
  [
   378789, 
   null, 
   "gansao", 
   "An opportunity? This was a human being Gansao. I know you don't want to hear that gays are human or even people deserving of rights, but sadly your mistaken. This was a person who did not deserve such a horrible fate and sinister act of cruelty done to him no matter the reasoning.\n \n \n \n The fact is gay people all over the world are suffering increased acts of violence against them from the Gays in Sadir City in Iraq being tortured and forced to eat laxatives while their anus has been sealed with a glue that can only be removed with surgery until they die, or those like Seaman August Provost who was shot to death in a guard shack in Camp Pendalton for being openly gay and was African American.\n \n \n These senseless acts of HATE yes hate Gansao, need to be stopped and these sick killers brought to justice.\n\n \n Your thread had nothing to do with what you had just posted JJ.\n \n It was a reaction to an aside by police investigator.\n If there was a prostitute found horribly murdered and the police investigator stated that people who work in the sex industry need to be aware this kind of things happen would that be a direct attack on prostitution ?\n \n You see condemnation in everything and everywhere.\n \n \n how do you know it was not a gay man that killed him?\n They do kill each other sometimes.", 
   {}, 
   378780, 
   null, 
   1258492500.0
  ], 
  [
   378797, 
   null, 
   "jazyjason", 
   "Amazing how you can make such a strong statement based on ZERO facts. Maybe he was ALSO a double-crossing drug dealer in addition to being gay. Ever consider that?\n \n I think that the police officer's comment was inexcusable, but don't jump to conclusions without a modicum of facts.\n\n \n What else would you assume in my position? The Investigator obviously has no real urgency to solve this crime, and his comments prove his motives. It will most likely wind up another cold case...\n \n As far as my strong statements, I am only going off of what I know. The person was openly gay. He was well known in the gay community and probably by others. And that he was murdered not in a typical drug deal gone bad but in a humiliating and sinister manner. \n \n Of course I could be wrong or others could be wrong. We'll have to see.", 
   {}, 
   378788, 
   null, 
   1258493280.0
  ], 
  [
   378799, 
   null, 
   "jazyjason", 
   "Your thread had nothing to do with what you had just posted JJ.\n \n It was a reaction to an aside by police investigator.\n If there was a prostitute found horribly murdered and the police investigator stated that people who work in the sex industry need to be aware this kind of things happen would that be a direct attack on prostitution ?\n \n You see condemnation in everything and everywhere.\n \n \n how do you know it was not a gay man that killed him?\n They do kill each other sometimes.\n\n \n My intention of posting the thread was not on the Police Investigators comments but on the murder and the way this person was murdered. This was not just a typical killing. It was a shocking one a decapitation. Hopefully more updates will come in soon about this tragic event.\n \n As far as the police investigator I could care less about his comments, I just hope the murder is brought to justice.", 
   {}, 
   378789, 
   null, 
   1258493400.0
  ], 
  [
   378800, 
   null, 
   "jazyjason", 
   "AN update on the case: \n By Jennifer Vanasco, editor in chief, 365gay.com\n 11.17.2009 9:44am EST\n \n A suspect has been arrested in the Puerto Rico murder and decapitation of gay teenager Jorge Steven Lopez Mercado, according to an iReport by Christopher Pagan.:\n \n Send / Share\n Add Comment\n The main suspect of the cruel murder of a young homosexual found in the area of Guavate Cayey, was arrested this morning and shall be taken to \n \n a judge today to face charges, confirmed the press of the Puerto Rico Police, Damaris Periera.\n \n She also indicted that two vehicles were taken into custody, and that there is a crime scene as well under police custody in the town of Cayey.\n \n Pagan says that the FBI is now also involved and back2Stonewall says that the FBI is investigating the murder as a hate crime. Other reports from around the web say the suspect may have offered the victim money for sex.\n \n Says the Associated Press in the first mainstream media coverage we've seen:\n \n Police say they have arrested a suspect in the slaying of a teenager whose decapitated remains were found along a road in southern Puerto Rico.\n \n Police commandant Eliezer Colon says the man was detained at his home early Tuesday morning. The suspect has not been identified because he has not been formally charged.\n \n The burned and dismembered body of 19-year-old Jorge Steven Lopez was discovered Friday in a wooded area of the town of Cayey. Authorities are looking into whether he may have been targeted because he was gay.\n \n Activist Pedro Julio Serrano called on authorities to treat the case as a hate crime if the investigation shows Lopez was killed because of his sexual orientation.\n \n There will be a vigil at 8 p.m. Sunday in New York City. Americablog is calling on people to email Attorney General Eric Holder to ensure the murder is prosecuted as a hate crime.", 
   {
    "unicode_changes_made": true
   }, 
   378799, 
   null, 
   1258493520.0
  ], 
  [
   378826, 
   null, 
   "gansao", 
   "My intention of posting the thread was not on the Police Investigators comments but on the murder and the way this person was murdered. This was not just a typical killing. It was a shocking one a decapitation. Hopefully more updates will come in soon about this tragic event.\n \n As far as the police investigator I could care less about his comments, I just hope the murder is brought to justice.\n\n \n Well a large part of the post was about the aside JJ.\n Any murder of any kind is terrible and violent murder of anyone is a tragedy.", 
   {}, 
   378799, 
   null, 
   1258496040.0
  ], 
  [
   378828, 
   null, 
   "jyoshu", 
   "The body was burned and decapitated and the victim was an openly gay man well known in the LGBT community. The evidence points toward a hate crime no matter how watered down your side attempts to make it.\n\n \n So if a victim of a heinous murder was black and well-known among other black people, should we assume it was a racism-motive hate crime, automatically? No. It's a determination that has to be made on evidence. It may very well BE a hate crime, but people shouldn't jump to conclusions--this is serious stuff. You can't go on the 'shocking' nature of the killing as there are plenty of very violent murders that take place that aren't hate crimes.\n It would also be better to be able to read about this case on something less biased than a site like 365Gay.", 
   {}, 
   378779, 
   null, 
   1258496340.0
  ], 
  [
   378831, 
   null, 
   "JPSartre12", 
   "What else would you assume in my position? The Investigator obviously has no real urgency to solve this crime, and his comments prove his motives. It will most likely wind up another cold case...\n \n As far as my strong statements, I am only going off of what I know. The person was openly gay. He was well known in the gay community and probably by others. And that he was murdered not in a typical drug deal gone bad but in a humiliating and sinister manner. \n \n Of course I could be wrong or others could be wrong. We'll have to see.\n\n \n In drug turf wars, the victims are typically murdered in brutal ways to send a message. You have ZERO facts to back up your assumption that he was killed BECAUSE he was gay. His \"gayness\" may have been a footnote, not the reason. We don't yet know. In the meantime, the cop's statements don't give me a warm and fuzzy about his motivation to solve the case either, so I'd find another investigator to take over.", 
   {
    "unicode_changes_made": true
   }, 
   378797, 
   null, 
   1258497060.0
  ], 
  [
   378835, 
   null, 
   "gansao", 
   "They see gay, murder and can only see ..hate crime..its a nice mantra for a serial victim.", 
   {}, 
   378831, 
   null, 
   1258498200.0
  ], 
  [
   378880, 
   null, 
   "jazyjason", 
   "Another Update: \n By Jennifer Vanasco, editor in chief, 365gay.com\n 11.17.2009 3:20pm EST\n \n UPDATE 5:30 pm:\n \n The Puerto Rican newspaper El Nuevodia reports that the suspect in the killing of Jorge Steven Lopez Mercado is Juan antonio Martinez Matos, 26 years old and father of four. (This is a translation from a colleague; the link is Arrestan sospechoso de asesinato de homosexual - El Nuevo Da and we'd appreciate corrections!)\n Send / Share\n Add Comment\n Martinez Matos was \"looking for women\" in a red light district last Friday. He had already been turned down several times, but Lopez Mercado, wearing a blue dress and boots, agreed to get in his car.\n \n District Attorney Jose J. Bermudez says that in his confession, Martinez Matos said that he thought Lopez Mercado was a woman. The victim asked him for money and when he refused, Lopez Mercado pulled out a knife. When Martinez Matos realized that the teenager was actually male, he had a flashback to when he was raped in prison while he was serving a sentence for domestic violence. He then attacked Lopez Mercado, separating his arms from his torso.\n \n Police found a wig, a knife, a burned mattress, a burned PVC pipe and blood on the wall where the murder took place.\n \n The forensic evidence is being investigated by the FBI. Though they have not specified charges yet, the DA says that he is sure this qualifies as a hate crime.\n \n Activists are calling for justice and for the media to focus on the suspect's acts instead of the behavior of the victim.\n \n The National Gay and Lesbian Task Force released a statement saying: \n \n \"We urge local law enforcement authorities to continue their expedient work on this case. Fortunately, Puerto Rico has a local hate crimes statute, but it is imperative that federal authorities continue to monitor this ongoing investigation and step in if necessary or assist if asked, as allowed by the new federal hate crimes law.\"\n \n Pedro Julio Serrano, Task Force Communications Manager and founder of Puerto Rico Para Todas said in a statement:\n \n \"This is a terrible, terrible crime. While we are pleased that law enforcement has acted promptly in making an arrest, it is vital that the hate crimes angle be investigated. This horrendous killing of a young gay man shows no compassion or respect for the dignity of a human life. As someone who grew up in Puerto Rico and has been very active in its lesbian, gay, bisexual and transgender community, this is a heart-wrenching moment. Our hearts and sympathies go out to all of Jorge Steven López's loved ones at this difficult time. Justice must prevail.\"\n \n *************************\n \n 365gay has new information on the murder investigation surrounding the decapitation and dismemberment of Puerto Rican teen Jorge Steven Lopez Mercado.\n \n Juan Costa Rivera, a 365gay reader who knows Lopez Mercado's friends, says that the local PR press is reporting that the suspect's house was radied by police, where they found a burned mattress and pvc pope, a wig, two knives and a \"big blood stain on a wall.\" The suspect confessed to police, saying he was looking for prostitutes in a red light district in Caguas. Basically, Rivera says:\n \n \"After being rejected by a few women, he saw Jorge dressed as a woman and asked him to go with him to the house. Apparently on the house, the suspect found out that Lopez was a man, after Lopez made sexual advantages, and as a result of the rage, he did what he did.\"\n \n Rivera says the police told media outlets that the suspect will likely use a \"homosexual panic\" defense, arguing for a plea of temporary insanity.", 
   {
    "unicode_changes_made": true
   }, 
   378835, 
   null, 
   1258512660.0
  ], 
  [
   378932, 
   null, 
   "gansao", 
   "Dressing up as a woman and soliciting strange men for sex seems to have its dangers. \n Just as the police invesrigator stated.\n Do any of these gay men in 'steady' relationships try to deter young gay men from prostitution?", 
   {}, 
   378880, 
   null, 
   1258549200.0
  ], 
  [
   378936, 
   null, 
   "jazyjason", 
   "Dressing up as a woman and soliciting strange men for sex seems to have its dangers. \n Just as the police invesrigator stated.\n Do any of these gay men in 'steady' relationships try to deter young gay men from prostitution?\n\n \n I do. sadly it has been an alarming issue especially in the major cities of the US. Many gay teens and young adults are kicked out of their homes for either coming out, or whatever reason, come to a big city where they think it is \"gay friendly\" and simply cannot afford to live there.\n \n \n They have to resort to prostitution to survive or to make any form of income especially in this horrible economy. The whole state of affairs is sad and alarming...", 
   {}, 
   378932, 
   null, 
   1258551480.0
  ], 
  [
   378948, 
   null, 
   "gansao", 
   "I do. sadly it has been an alarming issue especially in the major cities of the US. Many gay teens and young adults are kicked out of their homes for either coming out, or whatever reason, come to a big city where they think it is \"gay friendly\" and simply cannot afford to live there.\n \n \n They have to resort to prostitution to survive or to make any form of income especially in this horrible economy. The whole state of affairs is sad and alarming...\n\n \n Very sad situation.", 
   {}, 
   378936, 
   null, 
   1258558860.0
  ], 
  [
   379173, 
   null, 
   "SeriousSister08", 
   "Heterosexuals are getting murdered every second of the day. Should we assume that they are being targeted because they are straight?emoticon_rolleyes (I'm straight btw). I think that running around dressed as a woman and trying to have sex with straight men is dangerous. People really dont think. He should have known that it was very dangerous what he was doing, and to try to sleep with a straight man would get him into alot of trouble, but he did it anyway. I hate what happened to him, but I think he brought it on himself, he holds some of the responsibilty as well. If he wanted to do that, he should have made it known that he was a male, for anyone who is into that. The whole situation is sad, but should serve as an example for others who play these stupid games. Plus, wasn't this gay kid trying to rob him?! He does not seem like too much of a victim here. He went out looking for trouble, and found it. He bit off more then he could chew, and because he is gay people want to jump on the bandwagon and say what a victim he was. Puh-leeesse!!!emoticon_rolleyes", 
   {}, 
   378948, 
   null, 
   1258646580.0
  ], 
  [
   379174, 
   null, 
   "JPSartre12", 
   "Dressing up as a woman and soliciting strange men for sex seems to have its dangers. \n Just as the police invesrigator stated.\n Do any of these gay men in 'steady' relationships try to deter young gay men from prostitution?\n\n \n \nI do. sadly it has been an alarming issue especially in the major cities of the US. Many gay teens and young adults are kicked out of their homes for either coming out, or whatever reason, come to a big city where they think it is \"gay friendly\" and simply cannot afford to live there.\n \n \n They have to resort to prostitution to survive or to make any form of income especially in this horrible economy. The whole state of affairs is sad and alarming...\n\n \n \nHeterosexuals are getting murdered every second of the day. Should we assume that they are being targeted because they are straight?emoticon_rolleyes (I'm straight btw). I think that running around dressed as a woman and trying to have sex with straight men is dangerous. People really dont think. He should have known that it was very dangerous what he was doing, and to try to sleep with a straight man would get him into alot of trouble, but he did it anyway. I hate what happened to him, but I think he brought it on himself, he holds some of the responsibilty as well. If he wanted to do that, he should have made it known that he was a male, for anyone who is into that. The whole situation is sad, but should serve as an example for others who play these stupid games. Plus, wasn't this gay kid trying to rob him?! He does not seem like too much of a victim here. He went out looking for trouble, and found it. He bit off more then he could chew, and because he is gay people want to jump on the bandwagon and say what a victim he was. Puh-leeesse!!!emoticon_rolleyes\n\n \n You nailed it. This cross-dressing gay prostitute/thug tried to rob a straight john and paid the ultimate price. That isn't a hate crime, unless it's a hate crime to hate being held at knifepoint and react accordingly. emoticon_rolleyes", 
   {}, 
   379173, 
   null, 
   1258649100.0
  ], 
  [
   379360, 
   null, 
   "SeriousSister08", 
   "You nailed it. This cross-dressing gay prostitute/thug tried to rob a straight john and paid the ultimate price. That isn't a hate crime, unless it's a hate crime to hate being held at knifepoint and react accordingly. emoticon_rolleyes\n\n \n Exactly!! Are we the only sane people on this thread? It seems like everyone else bypassed the actions of the child and just whined about him being gay. As a matter of fact, the gay advocates, asked everyone not to take the cross-dressing thugs action into account when you look at this situation. But how can you not?! He started the trouble! No excuse for decapitating him, but if you go out looking for trouble you're bound to run into some sicko willing to literally bite/cut off your head.emoticon_xgood", 
   {}, 
   379174, 
   null, 
   1258734000.0
  ], 
  [
   379397, 
   null, 
   "gansao", 
   "This 'victim' has changed from being an innocent... According to an iReport by Christopher Pagan, \"He was a very well known person in the gay community of Puerto Rico, and very loved.\"\n \n \n to being a cross dressing, knife wielding mugger who mugged the wrong person.:xbanghead", 
   {
    "unicode_changes_made": true
   }, 
   379360, 
   null, 
   1258757580.0
  ], 
  [
   379424, 
   null, 
   "foundit66", 
   "Heterosexuals are getting murdered every second of the day. Should we assume that they are being targeted because they are straight?\n\n It's funny to see you guys try to treat gay / straight like they are somehow equivalent ...\n \n ... but then you'll turn around and insist that they are not when it comes to equal rights...\n \n If we had numerous examples of straights getting killed viciously because they were straight, then the motive would be recognized as having a significant existence in our society and such a motive would be more likely to be questioned in such situations.\n \n Looking at the statistics...\n In 2007, the FBI's hate crime statistics show 52 times more hate crimes against gays than against straights, even though it's the straights who outnumber the gays by a factor of 20...\n \n So in the big picture, your attempt to pretend they are equivalent is laughable at best...\n \n \n \nThough they have not specified charges yet, the DA says that he is sure this qualifies as a hate crime.\n\n Well gee.\n I guess we can all sleep better knowing that the obvious is out in the open...\n \n \n \nto being a cross dressing, knife wielding mugger who mugged the wrong person.\n\n It's funny how people who ridiculed the idea that such a violent crime of passion could be motivated by a violent hatred like homophobia...\n \n ... to all of a sudden trusting a murdering ex-con at his word.\n Cause lord knows that murderers NEVER lie about the circumstances of the crime when they get busted...\n \n If it was self-defense, why not simply go to the cops?\n emoticon_wow\n \n Yeah. I know some people are too busy trusting the word of the ex-con murderer to think about something simple like that...", 
   {}, 
   379173, 
   null, 
   1258779540.0
  ], 
  [
   379482, 
   null, 
   "SeriousSister08", 
   "It's funny to see you guys try to treat gay / straight like they are somehow equivalent ...\n \n ... but then you'll turn around and insist that they are not when it comes to equal rights...\n \n If we had numerous examples of straights getting killed viciously because they were straight, then the motive would be recognized as having a significant existence in our society and such a motive would be more likely to be questioned in such situations.\n \n Looking at the statistics...\n In 2007, the FBI's hate crime statistics show 52 times more hate crimes against gays than against straights, even though it's the straights who outnumber the gays by a factor of 20...\n \n So in the big picture, your attempt to pretend they are equivalent is laughable at best...\n\n \n You know what is even more laughable?! The fact that you are on here saying anything, when you have still not responded back to my last post in the,\"Is gayness geneti?\" Thread. So don't get on here telling me what is laughable, because to me you running from a ongoing debate is laughable. And I never said that gay lifestyle is equal to straight lifestyle, but as far as being humans, they are equal. You have a problem with me saying gays are just as human as straights?! So I should just start calling you an animal then huh?! I think a human life is equal, but not the way they LIVE their life. DUH!!emoticon_rolleyesemoticon_xdonno\n \n \n \n \nWell gee.\n I guess we can all sleep better knowing that the obvious is out in the open...\n\n \n And the significants of this statement is?! Watch out people we have a bitter gay on our hands!!emoticon_xclown\n \n \n\n \n ... to all of a sudden trusting a murdering ex-con at his word.\n Cause lord knows that murderers NEVER lie about the circumstances of the crime when they get busted...\n \n \n \n \n Yeah. I know some people are too busy trusting the word of the ex-con murderer to think about something simple like that...\n\n \n Yeah it's crazy huh?! Just as crazy as it is that you want people to see your viewpoints, and your mindframe is not too far from the crazy ex-con. emoticon_xdonno emoticon_xgood The fact of the matter is this, if he wouldn't have been out there dressed as a woman and trying to sleep with a staright man, then this problem would not have occured. You can debate the fact that the ex-con could be lying, but how can anyone debate the fact the the kid was out there in a dress trying to sleep with a straight man. Instead of watching himself he got himself into trouble, hence my earlier statement, he was looking for trouble and found it. PERIOD!!emoticon_rolleyes", 
   {}, 
   379424, 
   null, 
   1258824240.0
  ], 
  [
   379485, 
   null, 
   "foundit66", 
   "You know what is even more laughable?! The fact that you are on here saying anything, when you have still not responded back to my last post in the,\"Is gayness geneti?\" Thread.\n\n I'm getting to it.\n Don't get your panties in a bunch just cause you think you've been neglected from a butt whuppin...\n \n \n \nSo don't get on here telling me what is laughable, because to me you running from a ongoing debate is laughable.\n\n I fail to see how the commentary from some posters on this thread could not be comical even if I haven't given you full attention in other threads...\n emoticon_rolleyes\n \n \n \nAnd I never said that gay lifestyle is equal to straight lifestyle, but as far as being humans, they are equal.\n\n Did I say that you thought the gay LIFESTYLE was equal?\n No.\n \n I was obviously referencing an EXPLICIT comment you made, so please try to take the context of my comment into the big picture so you can avoid your confusion in the future...\n \n \n \nYou have a problem with me saying gays are just as human as straights?!\n\n ROFLMAO!\n You are 0 for 2.\n To answer your question directly and explicitly sign-post it to hopefully avoid your further confusion the answer is: No. \n And nothing I said involves anything that any rational person could think I was saying that I had a problem with you supposedly saying \"gays are just as human as straights\".\n \n To help fill in your blank stare before you get hopelessly lost, I was obviously referencing your pretense that a gay man getting murdered in such a ridiculously violent way is somehow justification for an assumption that a straight man is murdered just for being straight.\n \n I can name you a LONG LIST of gay men who have been attacked and killed for being gay.\n Can you name me ANY straight man who was attacked or killed for being straight?\n \n So obviously, to a logical and rational mind, it isn't smart to assume that the existence of the killing of a gay person automatically means that we should assume a straight being murdered was brought about by the victim being straight can be rationally concluded... :xbanghead\n \n There's a phrase that perhaps you aren't aware of...\n \"If you hear hoof beats, look for horses, not zebras\"\n So when you talk of a straight being murderered and you wonder if we should assume he was killed for being straight, it's probably more of a case where you shouldn't be looking for penguins...\n \n \n \nAnd the significants of this statement is?!\n\n Well, this is an improvement.\n At least you're asking a question when you don't understand, instead of leaping head-long into ridiculous assessments and false conclusions. \n I applaud you for asking.\n \n The significance of that statement is that the District Attorney is also recognizing the obvious regarding this crime.\n So while you and your posse evidently can't come to a rational conclusion, and instead mindlessly embrace the words of murderering ex-felons, at least cooler heads are prevailing in this case and the obvious is recognized by the professionals and will be acted upon in prosecution.\n \n \n \n Watch out people we have a bitter gay on our hands!!emoticon_xclown\n\n I would ask what the topical point of that comment would be, but I'm pretty there is none.\n It's just an attempt at personal invective to side-step the fact that despite the incapability of multiple posters to recognize the obvious, the District Attorney is proceeding to treat this crime as an obvious hate crime...\n \n \n \nYeah it's crazy huh?! Just as crazy as it is that you want people to see your viewpoints, and your mindframe is not too far from the crazy ex-con. emoticon_xdonno emoticon_xgood \n\n Well, that opinion is duly noted...\n I mean, I find it fascinating that you would so quickly attempt to lump in my credibility with a murderering ex-felon who has an obvious reason to lie about the motive for his crime...\n But hey! We all got our standards.\n \n And evidently you are blindly trusting of people who kill gays in a most extreme manner, claim self-defense, but then fail to report it as such when the opportunity to come forward on your own presents itself.\n \n And I don't know if you can recognize it or not, but these comments are some of the things that will be brought up in a trial. Possibly a jury trial.\n I would be fascinated to see you try to defend your blind trust in the statements of a murderous ex-felon to eleven other people face-to-face.\n Now THAT would be entertainment! emoticon_xgood\n \n \n \nThe fact of the matter is this, if he wouldn't have been out there dressed as a woman and trying to sleep with a staright man, then this problem would not have occured.\n\n Ahhh.\n See! You DO recognize some legal maneuver attempts.\n What you're trying to do now is \"blame the victim\".\n Like as you attempt, it's a common ploy in attempting to blame the rape victim when a rapist decides that \"no\" isn't an answer he is going to accept.\n Yet again you side with the criminals. Consistently fascinating!\n \n But what you fail to recognize is that regardless of \"dressing as a woman\" and \"trying to sleep with a straight man\" in no way justifies murder.\n In fact, legally the logical reaction would be to simply reject the advance.\n \n Now I am not defending such deceit in an attempt to get laid. I think the actions of this victim are questionable at best, but not unprecedented as in finding a receptive audience from some.\n You would think the adam's apple would give it away... emoticon_rolleyes\n Or maybe it did, and that's the reason why this murdererous ex-felon picked up the gay man in the first place...\n \n But I can't help but think that if we as a people adopt a policy whereby deceit utilized in an effort to get laid is something that has \"kill him\" as a valid response, then there are going to be an AWFUL LOT of straight guys out there who would be in danger as well.\n \n \n \nYou can debate the fact that the ex-con could be lying, but how can anyone debate the fact the the kid was out there in a dress trying to sleep with a straight man.\n\n Perhaps you can explain to me why I would need to debate that in the first place?\n Regardless, there are some guys who are into that sort of thing.\n Perhaps if he had found one of the more accepting \"straight\" guys, this wouldn't have happened.\n \n \n \nInstead of watching himself he got himself into trouble, hence my earlier statement, he was looking for trouble and found it. PERIOD!!emoticon_rolleyes\n\n Yes.\n You consistently side with the murderer, which I find truly fascinating.\n \n Do you also side with the rapists and criticize the woman for not putting out after he paid for dinner and drinks?\n Or is it just the gays who deserve to be killed when an attempt at a sexual liaison results in murder?", 
   {}, 
   379482, 
   null, 
   1258826280.0
  ], 
  [
   379496, 
   null, 
   "gansao", 
   "Nobody said gays deserve to be killed.\n \n Once again Foundit makes 1+1=3emoticon_rolleyes", 
   {}, 
   379485, 
   null, 
   1258837920.0
  ], 
  [
   379500, 
   null, 
   "jitobear", 
   "Kid shouldn't be mugging people. But stabbing followed by decapitation and burning are little over the top for simple self-defense.", 
   {}, 
   379496, 
   null, 
   1258839060.0
  ], 
  [
   379558, 
   null, 
   "foundit66", 
   "Nobody said gays deserve to be killed.\n Once again Foundit makes 1+1=3emoticon_rolleyes\n\n I never said anybody said \"gays deserve to be killed\"...\n Once again, somebody says \"1+1=2\" and gansao thinks purple carrots are involved... emoticon_rolleyes\n \n What I DID comment on was \"SeriousSister's\" use of the \"blame the victim\" tactic, and in this case SeriousSister was talking about blaming the victim for the deceit involved (teen-ager dressing as a woman).\n It's like fixating on the wife who was late in getting dinner to the table, after the husband murders her for doing so...\n After all, the wife would still be alive if she had just gotten the dinner on the table ON TIME!\n \n \n \nKid shouldn't be mugging people. But stabbing followed by decapitation and burning are little over the top for simple self-defense.\n\n Exactly.\n \"separating his arms from his torso\" emoticon_frazzled\n Such extreme actions in a response hardly become \"self-defense\" and indicate the passion involved was much more extreme.\n \n Plus, the killer kept the knife which supposedly belonged to the victim.\n People typically don't keep trophies in \"self-defense\" cases... :xbanghead\n Unless it never belonged to the gay teen-ager in the first place...\n \n I am curious to see if the victim had any criminal record. If the victim has been in trouble for mugging before, that would help provide weight for the claim of the murderer that he was being mugged.\n If the teen has never been in any trouble and we have an wife beater who took a gay teen-ager (dressed as a woman) to the murderer's home and then killed the gay teen-ager there, subsequently making claims not matched by the teen-ager's history???\n emoticon_cool", 
   {}, 
   379496, 
   null, 
   1258845720.0
  ], 
  [
   379562, 
   null, 
   "gansao", 
   "I never said anybody said \"gays deserve to be killed\"...\n Once again, somebody says \"1+1=2\" and gansao thinks purple carrots are involved... emoticon_rolleyes\n \n What I DID comment on was \"SeriousSister's\" use of the \"blame the victim\" tactic, and in this case SeriousSister was talking about blaming the victim for the deceit involved (teen-ager dressing as a woman).\n It's like fixating on the wife who was late in getting dinner to the table, after the husband murders her for doing so...\n After all, the wife would still be alive if she had just gotten the dinner on the table ON TIME!\n \n \n \n Exactly.\n \"separating his arms from his torso\" emoticon_frazzled\n Such extreme actions in a response hardly become \"self-defense\" and indicate the passion involved was much more extreme.\n \n Plus, the killer kept the knife which supposedly belonged to the victim.\n People typically don't keep trophies in \"self-defense\" cases... :xbanghead\n Unless it never belonged to the gay teen-ager in the first place...\n \n I am curious to see if the victim had any criminal record. If the victim has been in trouble for mugging before, that would help provide weight for the claim of the murderer that he was being mugged.\n If the teen has never been in any trouble and we have an wife beater who took a gay teen-ager (dressed as a woman) to the murderer's home and then killed the gay teen-ager there, subsequently making claims not matched by the teen-ager's history???\n emoticon_cool\n\n \n I was wrong, it should have been 1+1=5emoticon_xclown", 
   {}, 
   379558, 
   null, 
   1258845840.0
  ], 
  [
   379626, 
   null, 
   "SeriousSister08", 
   "What I DID comment on was \"SeriousSister's\" use of the \"blame the victim\" tactic, and in this case SeriousSister was talking about blaming the victim for the deceit involved (teen-ager dressing as a woman).\n It's like fixating on the wife who was late in getting dinner to the table, after the husband murders her for doing so...\n After all, the wife would still be alive if she had just gotten the dinner on the table ON TIME!\n\n \n Now I really see that you're losing it!! You like to go on rants, and never think seriously about what you are saying. I should just hand you a virtual shovel everytime you get ready to speak since it seems that you are always digging yourself into a hole everytime you press that submit button.emoticon_rolleyes\n \n A woman that gets the dinner on the table late, is something that is common to everyday life, something comes up and dinner is late. So if a husband kills a wife for that, then he is one sick puppy. Now a gay teenager with a dress on and a knife, trying to rob somebody is not what I call a normal thing. I call it looking for trouble. A long step away from someone upset because the meatloaf is not on the table at 6:00pm sharp.\n \n \n \n \nExactly.\n \"separating his arms from his torso\" emoticon_frazzled\n Such extreme actions in a response hardly become \"self-defense\" and indicate the passion involved was much more extreme.\n\n \n Since you are hinting on the fact that he had a reponse must mean that you also believe what an ex-con said. Because you just admitted that his actions were in response. In response to what?! Hmmm.....Contridicting yourself?!\n \n \nI am curious to see if the victim had any criminal record. If the victim has been in trouble for mugging before, that would help provide weight for the claim of the murderer that he was being mugged.\n If the teen has never been in any trouble and we have an wife beater who took a gay teen-ager (dressed as a woman) to the murderer's home and then killed the gay teen-ager there, subsequently making claims not matched by the teen-ager's history???\n \n\n \n You are trying to play lawyer, jury with me but you are acting like someone who is void of any common sense, much less someone who knows anything about the law. Have you ever heard of a.......FIRST TIME OFFENDER?! They do have those. Not every robber started out to be one, there was a point in time when they NEVER robbed anyone, and then one day BOOOM!! They robbed someone, putting it on their record for the, what's the words?! Oh yeah...FIRST TIME! And have you ever heard of this one?! Probably not because if you have you wouldn't have made that nonsense comment I just had to quote. \"There's a first time for everything.\" Guess you hadn't heard of that one. So his prior record is irrelevant.emoticon_xdonno\n \n \n \nI'm getting to it.\n Don't get your panties in a bunch just cause you think you've been neglected from a butt whuppin...\n\n \n You think I'm going to worry about someone who is taking days, to get back to me on one topic giving me a butt whuppin?! I really don't think so honey.emoticon_rolleyes\n \n \n \n \nI fail to see how the commentary from some posters on this thread could not be comical even if I haven't given you full attention in other threads...\n emoticon_rolleyes\n\n \n Really now?! Hmmm.....\n \n \n \n \nDid I say that you thought the gay LIFESTYLE was equal?\n No.\n \n I was obviously referencing an EXPLICIT comment you made, so please try to take the context of my comment into the big picture so you can avoid your confusion in the future...\n\n \n Explicit comment I made?! Which was it?! I'm sure you didn't break it down but instead talked around it, and imagined you spoke on it. And yeah you were talking about equality, so that is the reason I said what I said. And what?!\n \n \n \n \nROFLMAO!\n You are 0 for 2.\n To answer your question directly and explicitly sign-post it to hopefully avoid your further confusion the answer is: No. \n And nothing I said involves anything that any rational person could think I was saying that I had a problem with you supposedly saying \"gays are just as human as straights\".\n \n To help fill in your blank stare before you get hopelessly lost, I was obviously referencing your pretense that a gay man getting murdered in such a ridiculously violent way is somehow justification for an assumption that a straight man is murdered just for being straight.\n\n \n You mean to tell me that you are actually trying to picture what my face looks like when I read your posts?! Can you say....OBSESSED?! And since your so full of hot air, you don't even know when someone is being sarcastic. I pity you, because that went right over your head. You actually responded to it, and then tried breaking it down. LOL! WOW!!\n \n \n \nI can name you a LONG LIST of gay men who have been attacked and killed for being gay.\n Can you name me ANY straight man who was attacked or killed for being straight?\n\n \n Really?! You can name a long list?! Well name them for me big boy, I challenge you. And nope, I cannot name any straight men. WHY?! Let just say because it was once again Sarcasm that flew over your head. Such a shame.\n \n \nSo obviously, to a logical and rational mind, it isn't smart to assume that the existence of the killing of a gay person automatically means that we should assume a straight being murdered was brought about by the victim being straight can be rationally concluded...\n\n \n emoticon_xagree\n \n \nThere's a phrase that perhaps you aren't aware of...\n \"If you hear hoof beats, look for horses, not zebras\"\n So when you talk of a straight being murderered and you wonder if we should assume he was killed for being straight, it's probably more of a case where you shouldn't be looking for penguins...\n\n \n Well, actually I don't spend my time looking at whether someone was killed because of sexual orintation, I leave that up to the homos, they are good at doing that. Hence this thread.\n \n \n \n \nWell, this is an improvement.\n At least you're asking a question when you don't understand, instead of leaping head-long into ridiculous assessments and false conclusions. \n I applaud you for asking.\n \n The significance of that statement is that the District Attorney is also recognizing the obvious regarding this crime.\n So while you and your posse evidently can't come to a rational conclusion, and instead mindlessly embrace the words of murderering ex-felons, at least cooler heads are prevailing in this case and the obvious is recognized by the professionals and will be acted upon in prosecution.\n\n \n You're talking to me about rational?! You're sitting here knowing good and well that this is not the reason that you made that little statement. You kniw that you were being sarcastic with Article, but because you were called out for it, you dug this tacky explination out of your arse. We're not buying it.\n \n \n \n \nI would ask what the topical point of that comment would be, but I'm pretty there is none.\n It's just an attempt at personal invective to side-step the fact that despite the incapability of multiple posters to recognize the obvious, the District Attorney is proceeding to treat this crime as an obvious hate crime...\n\n \n Whoa! I feel like I just stepped into an episode of Law and order. At first people thought that he wasn't taking it seriously, and now you see where he is making sure it is under the label of,\"Hate crime.\" Who cares?! So your point is?! Why would I care whether it gets labeled a hate crime?! Why would I try to side step something that really makes no never mind to me?! I'm arguing the fact that he went out looking for trouble, and found it. In my opinion, it is not a hate crime, but if they want to label it as such, then so be it. But I think it's some sicko that took self-defense way too seriously, and killed the cross dressing gay kid. But the only one who seems to be side stepping anything here is you. You fail to look at the fact that if he was not out there doing what he should not have been doing, this would not have happened to him. You fail to look at the kids actions that lead to his death.\n \n \n \n \nWell, that opinion is duly noted...\n I mean, I find it fascinating that you would so quickly attempt to lump in my credibility with a murderering ex-felon who has an obvious reason to lie about the motive for his crime...\n But hey! We all got our standards.\n\n \n What can I say I'm a fascinating person. Yup, we do all have our standards, and I believe that I brought yours to the fore when I lumped you with the ex-con.\n \n \nAnd evidently you are blindly trusting of people who kill gays in a most extreme manner, claim self-defense, but then fail to report it as such when the opportunity to come forward on your own presents itself.\n\n \n I do?! Well that's funny how you can make such a bold statement as to tell me that I blidly trust people who kill gay people. How is saying that the kid was looking for trouble blind trust in the ex-con?! And since he said that the kid had a knife, why is it that the police found the knife on the killer?! I mean a quick fingerprint test would show that it was the young gay kids knife. So that is facts. And that fact that the kids was in a dress in the middle of the night trying to sleep with a straight man is also a fact. So I wouldn't call that blind trust. But I could just as easily say that you trust, cross-dressing muggers who lie to try and sleep with straight men, blindly.\n \n \nAnd I don't know if you can recognize it or not, but these comments are some of the things that will be brought up in a trial. Possibly a jury trial.\n I would be fascinated to see you try to defend your blind trust in the statements of a murderous ex-felon to eleven other people face-to-face.\n Now THAT would be entertainment! emoticon_xgood\n\n \n Well I guess you would have to turn on the t.v for your entertainment, because I didn't recieve an invitation to the trial. Sorry to burst your bubble. Maybe you can try to entertain yourself for a while, maybe with the lights, turned off, singing to your favorite doll, the rest is up to your own creative imagination.emoticon_rolleyes\n \n \n \n \nAhhh.\n See! You DO recognize some legal maneuver attempts.\n What you're trying to do now is \"blame the victim\".\n Like as you attempt, it's a common ploy in attempting to blame the rape victim when a rapist decides that \"no\" isn't an answer he is going to accept.\n Yet again you side with the criminals. Consistently fascinating!\n\n \n I fascinated you again huh?! Your going to have to start paying me for the viewing pleasure. I'm not blaming the victim, I'm putting responsibility where it belongs. From what I see both parties were at fault and palyed a part in what happened. Not all of the blame goes to the killer, the victim/first agressor played a major part in what happened to him. Have you ever heard of cause and effect?! Without a cause, there would be no effect. How do you like being spoon fed the basics?!\n \n As far as rape victims are concerned it really does depend on the situation, and the circumstances that surround the case. Not one case is the same, so I would not be able to lump a rape victim with this situation, without generalizing all rape cases. \n \n \nBut what you fail to recognize is that regardless of \"dressing as a woman\" and \"trying to sleep with a straight man\" in no way justifies murder.\n In fact, legally the logical reaction would be to simply reject the advance.\n\n \n Did I say that it justifies murder?! No I did not. I simply stated that the boy had a lot to do with what happened to him. And if you were reading the article, the killer said that the boy's actions reminded him of an experience when he was raped in prison. You spoke of the logical response is to reject the advance. I'm surprised that you act as if you are so smart but then make silly statements such as this one. Obvioulsy a person capable of decapitating a human, and burning him, is in not position to think logically. So maybe the logical response would have been to say no, but we are not talking about a logical person. We are talking about a sick individual. So here is my thoughts, logic would have dictated that you don't go out at night dressed as a woman, and try to rob, and sleep with a straight man.\n \n \n \nNow I am not defending such deceit in an attempt to get laid. I think the actions of this victim are questionable at best, but not unprecedented as in finding a receptive audience from some.\n You would think the adam's apple would give it away... emoticon_rolleyes\n Or maybe it did, and that's the reason why this murdererous ex-felon picked up the gay man in the first place...\n\n \n I highly doubt it, if he picked him up after seeing the adams apple, he would not have been surprised to find out he was a man. Not all men have adams apples that are pronunced.\n \n \n \nBut I can't help but think that if we as a people adopt a policy whereby deceit utilized in an effort to get laid is something that has \"kill him\" as a valid response, then there are going to be an AWFUL LOT of straight guys out there who would be in danger as well.\n\n \n I'm not aware of anyone here trying to make such an insane statement as the one you assume we are making. No one here is saying that he should have been killed because of his deceit; we are just saying that he is not completely innocent. But because we're not ignoring his part in this and pitting him because he was gay, you&#8217;re having a queen moment. And exaggerating what we are trying to say, by claiming that we condone the killing of that young gay boy. This is not a fact.\n \n \n \nPerhaps you can explain to me why I would need to debate that in the first place?\n Regardless, there are some guys who are into that sort of thing.\n Perhaps if he had found one of the more accepting \"straight\" guys, this wouldn't have happened.\n\n \n Because you seem to try to ignore that fact that this kid had anything to do with what happened to him. You argued the fact that the ex-con could have lied, which he mmight have, but you cannot aruge the fact that the kid was out there looking for trouble. Or else he would not have gotten into what he did. That I why I said you cannot debate that fact. \n \n And let me ask this question, why would there have to be a more accepting straight guy?! If they are straight why would they have to tollerate a gay trying to put the moves on them?! Also, yes some people are into that sort of thing, that is why I said in my earlier post that he should have stated he was a male, in case people are into that, instead of trying to bed down a straight man.\n \n \n \n \nYes.\n You consistently side with the murderer, which I find truly fascinating.\n \n Do you also side with the rapists and criticize the woman for not putting out after he paid for dinner and drinks?\n Or is it just the gays who deserve to be killed when an attempt at a sexual liaison results in murder?\n\n \n I constantly side with the murderer?! You need some more articulating skills, you read, but you don't comprehend. I feel sorry for you. These last two questions aren't worth me dignifying them with answers. If you want these answered, then you waste your own time contemplating them.emoticon_rolleyes", 
   {}, 
   379485, 
   null, 
   1258875900.0
  ], 
  [
   379630, 
   null, 
   "Iuris", 
   "Has anyone here heard of self defense being excessive? A legal concept intended specifically for these situations, it evaluates whether the use of self defense was suitable to the threat.\n \n Because, y'know, it could be either way? A normal crime may escalate due to hate reasons.\n \n I just hope there's a good judiciary in place to make sure it is so.\n \n \n P.S. Lookit, I'm writing bigger and bolder than Old Sarge! The public will LOVE it!", 
   {}, 
   379626, 
   null, 
   1258894080.0
  ], 
  [
   379649, 
   null, 
   "Easyrider", 
   "It gets worse. If the gay teen didn't repent of any gay sex sin he had then he's arguably lost and in the Pit of Hades this morning.\n \n Like Jesus said, \"Unless you repent, you will all likewise perish.\"", 
   {}, 
   379630, 
   null, 
   1258908060.0
  ], 
  [
   379660, 
   null, 
   "gansao", 
   "It gets worse. If the gay teen didn't repent of any gay sex sin he had then he's arguably lost and in the Pit of Hades this morning.\n \n Like Jesus said, \"Unless you repent, you will all likewise perish.\"\n\n \n Maybe, maybe not .What is certain is that if that young man would have taken Easy's advice he would probably not be a dead,headless body today.", 
   {}, 
   379649, 
   null, 
   1258917360.0
  ], 
  [
   379693, 
   null, 
   "gayhumanist", 
   "Maybe, maybe not .What is certain is that if that young man would have taken Easy's advice he would probably not be a dead,headless body today.\n\n \n Sick. That's right, blame the victim.", 
   {}, 
   379660, 
   null, 
   1258929240.0
  ], 
  [
   379697, 
   null, 
   "gansao", 
   "Sick. That's right, blame the victim.\n\n \n A cross dressing prostitute and knife wielding ,failed mugger can only be victim if he's gayemoticon_xdonno", 
   {}, 
   379693, 
   null, 
   1258929780.0
  ], 
  [
   379701, 
   null, 
   "Auneface", 
   "TL DR;\n I think it's right to not immediantly assume a hate crime, although I love my gay friends no differently, less or more than my straight friends, and have always accepted and approved of them.\n Honestly, I took a Sexuality/Gender course, and did my final research paper on hate crimes to gays still being prevelant in today's culture. What I found was quite surprising-- the vast majority of those gay-hate crimes also had drugs involved, big time, and money. And honestly, it's not too huge of an assumption to make that if society XXXXs you over (IE growing up gay) you may be more inclined to getting high.\n In the end, although I hated the people who did the crimes- because most of them were homophobic,, I honestly believe that they didn't kill the guy on the sole purpose of him being gay- he killed the guy for some serious drug-related reasons (which, is honestly only serious to those in the business, as the TV show \"weeds\" puts into perspective, what do you do if that QP is your mortage? ) Obviously he's not out to spout that out in court. \n However I do believe that when it came down to it, a homophob on an angry rage will hit a gay/lesbian harder than someone who was accepting of their sexuality. \n Reason for the extensive brutality- probably hate crime\n Reason for the original crime- drugs.\n \n The answer- don't do drugs..(or don't lie to a generation about just one of them)", 
   {}, 
   379626, 
   null, 
   1258931340.0
  ], 
  [
   379702, 
   null, 
   "gayhumanist", 
   "A cross dressing prostitute and knife wielding ,failed mugger can only be victim if he's gayemoticon_xdonno\n\n \n YOU brought up sexuality as a factor in what happened to him.\n \n \nIt gets worse. If the gay teen didn't repent of any gay sex sin he had then he's arguably lost and in the Pit of Hades this morning.\n \n Like Jesus said, \"Unless you repent, you will all likewise perish.\" \n\n \n \nMaybe, maybe not .What is certain is that if that young man would have taken Easy's advice he would probably not be a dead,headless body today.\n", 
   {}, 
   379697, 
   null, 
   1258931460.0
  ], 
  [
   379708, 
   null, 
   "gansao", 
   "YOU brought up sexuality as a factor in what happened to him.\n\n \n I think you will find that it was your friend JJ that brought up the fact that he was gay in the first post of his threademoticon_xdonno", 
   {}, 
   379702, 
   null, 
   1258932240.0
  ], 
  [
   379712, 
   null, 
   "gayhumanist", 
   "I think you will find that it was your friend JJ that brought up the fact that he was gay in the first post of his threademoticon_xdonno\n\n \n Originally, but you continued with it, as I've shown, saying if he had followed Easyrider's advice and not been gay, he might have been ok. That's establishing his homosexuality as a factor in what happened to him and why.", 
   {}, 
   379708, 
   null, 
   1258933080.0
  ], 
  [
   379721, 
   null, 
   "Matthew S", 
   "It gets worse. If the gay teen didn't repent of any gay sex sin he had then he's arguably lost and in the Pit of Hades this morning.\n \n Like Jesus said, \"Unless you repent, you will all likewise perish.\"\n\n \n Of course according to Lutheran teaching he has no reason to repent of anything as what ever his sin has been forgiven and Jesus holds this poor boy in His arms.", 
   {}, 
   379649, 
   null, 
   1258945500.0
  ], 
  [
   379733, 
   null, 
   "jazyjason", 
   "I just attended a candle light vigil in West Hollywood for this victim and another one who was 15 also brutally murdered. We can argue the reasoning behind, the motive, or dare I say even the justification.\n \n Point being is that this murder is wrong for ANY reason. Any murder is wrong but these were stooped in a sinister hatred. We all need to sake a step back and appreciate our fellow man. We need to see the fragility of our lives every single day.\n \n This was not just some lonely gay person. This was someones son. Someone's friend, their lover, their cousin, their brother. This was a HUMAN being. And if any of you have a single caring bone in your body you will reflect and see that this could have been anyone. Including your son or your daughter...\n \n I read the letter written by this boy's mother.. It simply was heart wrenching... Nothing will bring her son back. And all because of blind hare filled rage at someone who is different for WHATEVER reason!\n \n This was not a drug deal gone bad, this in the manner of the horrible gruesome aftermaths of these murders shows it was something more sinister. The killer WANTED to inflict harm in the worst possible manner.....", 
   {}, 
   379721, 
   null, 
   1258972500.0
  ], 
  [
   379797, 
   null, 
   "JPSartre12", 
   "Kid shouldn't be mugging people. But stabbing followed by decapitation and burning are little over the top for simple self-defense.\n\n \n The stabbing might be justifiable if he was being threatened at knifepoint, but I agree the decapitation and burning was over-the-top.\n \n \nHas anyone here heard of self defense being excessive? A legal concept intended specifically for these situations, it evaluates whether the use of self defense was suitable to the threat.\n \n Because, y'know, it could be either way? A normal crime may escalate due to hate reasons.\n \n I just hope there's a good judiciary in place to make sure it is so.\n \n \n P.S. Lookit, I'm writing bigger and bolder than Old Sarge! The public will LOVE it!\n\n \n In the US, we have the Castle Doctrine in many states. It says that it is perfectly legal to stand your ground and off the perp. \n If someone pulls a knife on me, he'd better darn well know how to use it or I'm going to give him a quick lesson in dying. \n \n \nI just attended a candle light vigil in West Hollywood for this victim and another one who was 15 also brutally murdered. We can argue the reasoning behind, the motive, or dare I say even the justification.\n \n Point being is that this murder is wrong for ANY reason. Any murder is wrong but these were stooped in a sinister hatred. We all need to sake a step back and appreciate our fellow man. We need to see the fragility of our lives every single day.\n \n This was not just some lonely gay person. This was someones son. Someone's friend, their lover, their cousin, their brother. This was a HUMAN being. And if any of you have a single caring bone in your body you will reflect and see that this could have been anyone. Including your son or your daughter...\n \n I read the letter written by this boy's mother.. It simply was heart wrenching... Nothing will bring her son back. And all because of blind hare filled rage at someone who is different for WHATEVER reason!\n \n This was not a drug deal gone bad, this in the manner of the horrible gruesome aftermaths of these murders shows it was something more sinister. The killer WANTED to inflict harm in the worst possible manner.....\n\n \n Where was the outcry against the crimes that this cross-dressing thug was engaging in? IMO, you look more than a little hypocritical when you overlook the \"victim's\" crimes.", 
   {}, 
   379733, 
   null, 
   1259006280.0
  ], 
  [
   379832, 
   null, 
   "gansao", 
   "Originally, but you continued with it, as I've shown, saying if he had followed Easyrider's advice and not been gay, he might have been ok. That's establishing his homosexuality as a factor in what happened to him and why.\n\n \n It was....", 
   {}, 
   379712, 
   null, 
   1259019540.0
  ], 
  [
   379833, 
   null, 
   "gansao", 
   "I just attended a candle light vigil in West Hollywood for this victim and another one who was 15 also brutally murdered. We can argue the reasoning behind, the motive, or dare I say even the justification.\n \n Point being is that this murder is wrong for ANY reason. Any murder is wrong but these were stooped in a sinister hatred. We all need to sake a step back and appreciate our fellow man. We need to see the fragility of our lives every single day.\n \n This was not just some lonely gay person. This was someones son. Someone's friend, their lover, their cousin, their brother. This was a HUMAN being. And if any of you have a single caring bone in your body you will reflect and see that this could have been anyone. Including your son or your daughter...\n \n I read the letter written by this boy's mother.. It simply was heart wrenching... Nothing will bring her son back. And all because of blind hare filled rage at someone who is different for WHATEVER reason!\n \n This was not a drug deal gone bad, this in the manner of the horrible gruesome aftermaths of these murders shows it was something more sinister. The killer WANTED to inflict harm in the worst possible manner.....\n\n \n and what if your cross dressing prostitute friend had actually stuck his knife into his potential victim and HE died ?\n Would you attend a vigil for him?\n I doubt itemoticon_xdonno", 
   {}, 
   379733, 
   null, 
   1259019720.0
  ], 
  [
   379848, 
   null, 
   "jazyjason", 
   "\n Where was the outcry against the crimes that this cross-dressing thug was engaging in? IMO, you look more than a little hypocritical when you overlook the \"victim's\" crimes.\n\n \n JP the outcry has always been there... I spoke on this issue briefly concerning prostitution and life on the streets for LGBT youth. Like I stated earlier it is a growing issue escalating out of control...\n \n That is why there are youth centers and shelters to get these young people off the streets... But sadly not nearly enough is being done to make any serious headway.. And also it was not just for this one victim but the 15 year old who was raped and stabbed to death by his uncle for being Gay and then having his body tossed into a closet...", 
   {}, 
   379797, 
   null, 
   1259021220.0
  ], 
  [
   379849, 
   null, 
   "jazyjason", 
   "and what if your cross dressing prostitute friend had actually stuck his knife into his potential victim and HE died ?\n Would you attend a vigil for him?\n I doubt itemoticon_xdonno\n\n \n \n Certainly. Violence is unacceptable period. My reasoning for going was more so than that of an outcry against hate crimes but against violence period. No one no matter the reason should have to endure such horrible deaths...", 
   {}, 
   379833, 
   null, 
   1259021340.0
  ], 
  [
   379852, 
   null, 
   "gansao", 
   "Certainly. Violence is unacceptable period. My reasoning for going was more so than that of an outcry against hate crimes but against violence period. No one no matter the reason should have to endure such horrible deaths...\n\n \n Your reason for going was to cry over a dead gay mugger.", 
   {}, 
   379849, 
   null, 
   1259021640.0
  ], 
  [
   379933, 
   null, 
   "jazyjason", 
   "Your reason for going was to cry over a dead gay mugger.\n\n \n Wrong. And how wonderful you marginalize anything that has to do with the Gay community or speaking out against violence period. And FYI the 15 year old was not a prostitute like the 19 year old but an honor roll student living a vibrant life... Funny how you forget things rather quickly...", 
   {}, 
   379852, 
   null, 
   1259073360.0
  ], 
  [
   379939, 
   null, 
   "JPSartre12", 
   "JP the outcry has always been there... I spoke on this issue briefly concerning prostitution and life on the streets for LGBT youth. Like I stated earlier it is a growing issue escalating out of control...\n \n That is why there are youth centers and shelters to get these young people off the streets... But sadly not nearly enough is being done to make any serious headway.. And also it was not just for this one victim but the 15 year old who was raped and stabbed to death by his uncle for being Gay and then having his body tossed into a closet...\n\n \n It's not just a LGBT issue; it's an issue for all disenfranchised youth. I'm guessing the majority of kids on the street aren't gay, but rather straights that come from broken and/or dysfunctional homes.", 
   {
    "unicode_changes_made": true
   }, 
   379933, 
   null, 
   1259075940.0
  ], 
  [
   379941, 
   null, 
   "SeriousSister08", 
   "It's not just a LGBT issue; it's an issue for all disenfranchised youth. I'm guessing the majority of kids on the street aren't gay, but rather straights that come from broken and/or dysfunctional homes.\n\n \n That's right; I was just going to bring up the same issue. It seems that JazyJason only brought up the gay kids, living on the streets and prostituting, but if you look at the real percentage, there are like 5% gay kids on the streets homeless and prostituting as opposed to the 95% that are straight. So if he wants to help anyone, it should be the straight kids that are out there on the streets, or at least give them as much support as he does the gay kids. I think he's a bit hypocritical.", 
   {
    "unicode_changes_made": true
   }, 
   379939, 
   null, 
   1259077440.0
  ], 
  [
   380019, 
   null, 
   "QuackAttack1887", 
   "That's right; I was just going to bring up the same issue. It seems that JazyJason only brought up the gay kids, living on the streets and prostituting, but if you look at the real percentage, there are like 5% gay kids on the streets homeless and prostituting as opposed to the 95% that are straight. So if he wants to help anyone, it should be the straight kids that are out there on the streets, or at least give them as much support as he does the gay kids. I think he's a bit hypocritical.\n\n \n Well, if I see anyone on the street, I help them out if I can. I don't ask if they're gay. I help if I can.", 
   {}, 
   379941, 
   null, 
   1259110620.0
  ], 
  [
   380056, 
   null, 
   "jazyjason", 
   "It's not just a LGBT issue; it's an issue for all disenfranchised youth. I'm guessing the majority of kids on the street aren't gay, but rather straights that come from broken and/or dysfunctional homes.\n\n \n I agree. Sadly there are more and more broken homes...", 
   {
    "unicode_changes_made": true
   }, 
   379939, 
   null, 
   1259124180.0
  ], 
  [
   380057, 
   null, 
   "jazyjason", 
   "That's right; I was just going to bring up the same issue. It seems that JazyJason only brought up the gay kids, living on the streets and prostituting, but if you look at the real percentage, there are like 5% gay kids on the streets homeless and prostituting as opposed to the 95% that are straight. So if he wants to help anyone, it should be the straight kids that are out there on the streets, or at least give them as much support as he does the gay kids. I think he's a bit hypocritical.\n\n \n \n I do give them as much support. Ive been to canned food drives shelters you name it for youth. I was not saying it was only gay youth that face this issue or that it is predominately a gay issue.\n \n I was bringing up the reasoning behind the 19 year olds prostitution... Before you assume and call someone a hypocrite why not get the whole story....", 
   {}, 
   379941, 
   null, 
   1259124300.0
  ], 
  [
   380225, 
   null, 
   "jitobear", 
   "The stabbing might be justifiable if he was being threatened at knifepoint, but I agree the decapitation and burning was over-the-top.\n\n \n Hard one to call. I have been mugged twice. First time I was with friends and on a busy street, we laughed the guy off. The second time I was alone late at night with my toddler - I just handed the guy my purse.\n \n I don't know that I would kill to protect my purse - myself, my kid - yes, my purse - probably not.\n \n Of course we are dealing with a criminal and a dead guy here. Who knows what happened?\n \n And I don't like castle laws. Too much leeway - forgives you for not THINKING.", 
   {}, 
   379797, 
   null, 
   1259225040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay teen burned and decapitated in Puerto Rico", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13584-gay-teen-burned-decapitated-puerto-rico.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13584, 
  "discussion_files": [
   [
    "14100.html", 
    "http://www.4forums.com/political/gay-rights-debates/13584-gay-teen-burned-decapitated-puerto-rico-print.html"
   ], 
   [
    "14101.html", 
    "http://www.4forums.com/political/gay-rights-debates/13584-gay-teen-burned-decapitated-puerto-rico-4-print.html"
   ], 
   [
    "14102.html", 
    "http://www.4forums.com/political/gay-rights-debates/13584-gay-teen-burned-decapitated-puerto-rico-3-print.html"
   ], 
   [
    "14103.html", 
    "http://www.4forums.com/political/gay-rights-debates/13584-gay-teen-burned-decapitated-puerto-rico-2-print.html"
   ]
  ], 
  "identifier": 13584
 }
]