[
 [
  [
   379161, 
   null, 
   "OldSarge", 
   "Hasan's Supervisor Warned Army In '07 : NPR\n \n Hasan's Supervisor Warned Army In '07\n Daniel Zwerdling\n \n November 18, 2009 \n Two years ago, a top psychiatrist at Walter Reed Army Medical Center was so concerned about what he saw as Nidal Hasan's incompetence and reckless behavior that he put those concerns in writing. NPR has obtained a copy of the memo, the first evaluation that has surfaced from Hasan's file. \n \n Officials at Walter Reed sent that memo to Fort Hood this year when Hasan was transferred there. \n \n Nevertheless, commanders still assigned Hasan - accused of killing 13 people in a mass shooting at Fort Hood on Nov. 5 - to work with some of the Army's most troubled and vulnerable soldiers.\n \n The Damning Memo\n \n On May 17, 2007, Hasan's supervisor at Walter Reed sent the memo to the Walter Reed credentials committee. It reads, \"Memorandum for: Credentials Committee. Subject: CPT Nidal Hasan.\" More than a page long, the document warns that: \"The Faculty has serious concerns about CPT Hasan's professionalism and work ethic. ... He demonstrates a pattern of poor judgment and a lack of professionalism.\" It is signed by the chief of psychiatric residents at Walter Reed, Maj. Scott Moran. \n \n When shown the memo, two leading psychiatrists said it was so damning, it might have sunk Hasan's career if he had applied for a job outside the Army.\n \n \"Even if we were desperate for a psychiatrist, we would not even get him to the point where we would invite him for an interview,\" says Dr. Steven Sharfstein, who runs Sheppard Pratt's psychiatric medical center, based just outside Baltimore. \n \n Sharfstein says it's a little hard to read the evaluation now and pretend that he doesn't know that Hasan is accused of shooting dozens of people. But he says if he had seen a memo like this about an applicant, Sharfstein would have avoided him like the plague. \n \n The memo ticks off numerous problems over the course of Hasan's training, including proselytizing to his patients. It says he mistreated a homicidal patient and allowed her to escape from the emergency room, and that he blew off an important exam. \n \n According to the memo, Hasan hardly did any work: He saw only 30 patients in 38 weeks. Sources at Walter Reed say most psychiatrists see at least 10 times that many patients. When Hasan was supposed to be on call for emergencies, he didn't even answer the phone.\n \n Warning Signs \n \n Sharfstein says the memo doesn't suggest that Hasan would end up shooting people, but it warns that Hasan was \"somebody who could potentially put patients in danger.\"\n \n \"There are all kinds of warning signs, flashing red lights, that, in terms of just this paragraph, you'd say, 'Oh, no, this is not somebody that we would take a chance on.' \"\n \n Sharfstein says that in the 25 years he has been supervising and hiring psychiatrists, he has seen only a half-dozen evaluations this bad. \n \n The memo does have a couple of qualifications that say something positive about Hasan. It says, \"He is able to self-correct with supervision.\" And Moran writes, \"I am not able to say he is not competent to graduate.\" \n \n Officials at Walter Reed told NPR that those statements were very carefully worded. What they convey is that when Hasan's supervisors read him the riot act - when they gave him intensive supervision - he would improve just enough so that they had to tell their commanders: \"Hasan is capable of doing better.\"\n \n But officials say nobody has the time to supervise a doctor that closely.\n \n Alerting Fort Hood\n \n \"I would never, ever hire a physician with this kind of a record,\" says Judith Broder, who runs the Soldiers Project, an award-winning private therapy program for troops in Southern California.\n \n Broder says that soldiers seeking therapy may be falling apart, filled with rage and a distrust of authority. What those soldiers need, she says, is a psychiatrist they can trust completely - not a therapist who fails to show up and abandons his patients.\n \n \"This kind of behavior could, in fact, set off a stress reaction\" in a patient, she says. \"It could be a trigger to a post-traumatic stress reaction.\"\n \n \n Moran and Pentagon spokesmen declined NPR's requests for interviews for this story. Officials at Fort Hood would not comment, either. \n \n But sources say that when the Army sent Hasan to Fort Hood earlier this year, Walter Reed sent the damning evaluation there, too. So commanders at Fort Hood would know exactly what they were getting.", 
   {
    "post_info": {
     "post_title": "Hasan's Supervisor Warned Army In '07"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1258641720.0
  ], 
  [
   379203, 
   null, 
   "JPSartre12", 
   "This is a sterling example of just how perversely politically correct the military is becoming. Here you have documented proof that Hasan was a screw-up, yet he is allowed to continue screwing up because nobody wants to be accused of bigotry for speaking against this clown. :xcensored", 
   {}, 
   379161, 
   null, 
   1258661640.0
  ], 
  [
   379211, 
   null, 
   "Ethmi", 
   "This is a sterling example of just how perversely politically correct the military is becoming. Here you have documented proof that Hasan was a screw-up, yet he is allowed to continue screwing up because nobody wants to be accused of bigotry for speaking against this clown. :xcensored\n\n \n Soon enough it'll be racist for a white cop to arrest a serial killer, rapist, pedophile, and drug dealer who happens to be black.", 
   {}, 
   379203, 
   null, 
   1258663560.0
  ], 
  [
   379213, 
   null, 
   "simone", 
   "This is a sterling example of just how perversely politically correct the military is becoming. Here you have documented proof that Hasan was a screw-up, yet he is allowed to continue screwing up because nobody wants to be accused of bigotry for speaking against this clown. :xcensored\n\n Yeah, Bush's military was totally screwed up.\n \n Most of this stuff happened under Bush's watch, just like 9/11 happened.", 
   {}, 
   379203, 
   null, 
   1258663740.0
  ], 
  [
   379215, 
   null, 
   "Ethmi", 
   "Yeah, Bush's military was totally screwed up.\n \n Most of this stuff happened under Bush's watch, just like 9/11 happened.\n\n \n Just like the attack on Fort Hood happened during Bush's presidency.\n \n I've also seen many people whine about 9-11 happening under Bush's presidency, but I've never seen any of them provide a course of action that could've prevented it.", 
   {}, 
   379213, 
   null, 
   1258664160.0
  ], 
  [
   379221, 
   null, 
   "JPSartre12", 
   "Soon enough a it'll be racist for a white cop to arrest a serial killer, rapist, pedophile, and drug dealer who happens to be black.\n\n \n Pretty soon we won't be allowed to have white cops. ;)\n \n \nYeah, Bush's military was totally screwed up.\n \n Most of this stuff happened under Bush's watch, just like 9/11 happened.\n\n \n I'm not aware of any terrorist attacks occurring after 9-11 on US soil until now, are you?\n \n \nJust like the attack on Fort Hood happened during Bush's presidency.\n \n I've also seen many people whine about 9-11 happening under Bush's presidency, but I've never seen any of them provide a course of action that could've prevented it.\n\n \n Clinton could have given the OK to whack Bin Laden when he had the chance to.", 
   {
    "unicode_changes_made": true
   }, 
   379215, 
   null, 
   1258665600.0
  ], 
  [
   379227, 
   null, 
   "Ethmi", 
   "\n Clinton could have given the OK to whack Bin Laden when he had the chance to.\n\n \n I could imagine the reaction if Bush managed to do that before 9-11.", 
   {}, 
   379221, 
   null, 
   1258666020.0
  ], 
  [
   379233, 
   null, 
   "simone", 
   "Just like the attack on Fort Hood happened during Bush's presidency.\n \n I've also seen many people whine about 9-11 happening under Bush's presidency, but I've never seen any of them provide a course of action that could've prevented it.\n\n Most of the warning signs were recognized during the Bush administration.\n \n And, prior to 9/11 Bush could have stopped taking all the vacations he took and spent some time in DC reading terrorist reports. As Ron Suskind reports in THE ONE PERCENT DOCTRINE: Deep Inside America's Pursuit of Its Enemies Since 9/11:\n \nThe book's opening anecdote tells of an unnamed CIA briefer who flew to Bush's Texas ranch during the scary summer of 2001, amid a flurry of reports of a pending al-Qaeda attack, to call the president's attention personally to the now-famous Aug. 6, 2001, memo titled \"Bin Ladin Determined to Strike in US.\" Bush reportedly heard the briefer out and replied: \"All right. You've covered your XXX, now.\" \n\n The Shadow War, In a Surprising New Light - washingtonpost.com", 
   {}, 
   379227, 
   null, 
   1258666920.0
  ], 
  [
   379248, 
   null, 
   "OldSarge", 
   "Most of the warning signs were recognized during the Bush administration.\n \n And, prior to 9/11 Bush could have stopped taking all the vacations he took and spent some time in DC reading terrorist reports. As Ron Suskind reports in THE ONE PERCENT DOCTRINE: Deep Inside America's Pursuit of Its Enemies Since 9/11:\n \n The Shadow War, In a Surprising New Light - washingtonpost.com\n\n \n Simone baby you best put down the koolaid and get some help for the bad case of BDS you have. No one on the planet could have dreamed the use of hijacked airplanes to destroy the WTC. Bush didn't cause 9-11. Islam did.\n \n Bush is gone and who shot John doesn't excuse nor fix any real or imagined ills in our system. Diversity caused hasan to be ignored for fear of being unPC. ", 
   {}, 
   379233, 
   null, 
   1258669740.0
  ], 
  [
   379250, 
   null, 
   "JPSartre12", 
   "Most of the warning signs were recognized during the Bush administration.\n \n And, prior to 9/11 Bush could have stopped taking all the vacations he took and spent some time in DC reading terrorist reports. As Ron Suskind reports in THE ONE PERCENT DOCTRINE: Deep Inside America's Pursuit of Its Enemies Since 9/11:\n \n The Shadow War, In a Surprising New Light - washingtonpost.com\n\n \n \n You mean the warning signs weren't already known by Clinton when the WTC bomb went off years before 9-11? The problem is that without a reputable crystal ball, it's difficult to put specific detail to vague threats. emoticon_rolleyes", 
   {}, 
   379233, 
   null, 
   1258669920.0
  ], 
  [
   379265, 
   null, 
   "sinjin", 
   "This is a sterling example of just how perversely politically correct the military is becoming. Here you have documented proof that Hasan was a screw-up, yet he is allowed to continue screwing up because nobody wants to be accused of bigotry for speaking against this clown. :xcensored\nI must be missing the proof that fear of being accused of bigotry played any part. Where's that?", 
   {}, 
   379203, 
   null, 
   1258672140.0
  ], 
  [
   379267, 
   null, 
   "sinjin", 
   "Soon enough a it'll be racist for a white cop to arrest a serial killer, rapist, pedophile, and drug dealer who happens to be black.\nThis gets my vote for stupidest post of the month.", 
   {}, 
   379211, 
   null, 
   1258672260.0
  ], 
  [
   379279, 
   null, 
   "OldSarge", 
   "This gets my vote for stupidest post of the month.\n\n \n Evidently you haven't read any from the 3 stooges then.", 
   {}, 
   379267, 
   null, 
   1258673760.0
  ], 
  [
   379283, 
   null, 
   "simone", 
   "You mean the warning signs weren't already known by Clinton when the WTC bomb went off years before 9-11? The problem is that without a reputable crystal ball, it's difficult to put specific detail to vague threats. emoticon_rolleyes\n\n You mean back in 1993 when Clinton had been in office for only 13 months? Do you think George H.W. Bush knew about these bombers before hand and didn't warn Clinton?\n \n But, even so, check out this link, if you aren't too damned lazy (I can't cut and paste from that site):\n snopes.com: Clinton Administration and Terrorists\n \n But phobic little minds are already fixated on what they believe and you probably won't.", 
   {}, 
   379250, 
   null, 
   1258674240.0
  ], 
  [
   379288, 
   null, 
   "OldSarge", 
   "You mean back in 1993 when Clinton had been in office for only 13 months? Do you think George H.W. Bush knew about these bombers before hand and didn't warn Clinton?\n \n But, even so, check out this link, if you aren't too damned lazy (I can't cut and paste from that site):\n snopes.com: Clinton Administration and Terrorists\n \n But phobic little minds are already fixated on what they believe and you probably won't.\n\n \n You mean 8 months before 9-11 baby? Do you think slick willie knew about any thing beside tail?\n \n Online Rumor Mill Spins Its Own Myth(Snopes.com's leftwing bias undercuts its credibility)\n Who else here is aware that Snopes is a LIBERAL LEFT website? - Yahoo! Answers\n Snopes.com LEFT WING authority - Toyota Tundra Forums : Tundra Solutions Forum\n Do you find the fact-checking site Snopes.com to be biased? | BuzzDash\n RUTHLESS ROUNDUP: SNOPES LIES\n In defense of Snopes A Modest Construct\n Snopes' Liberal Political Agenda ~ Notoriously Conservative\n \n ", 
   {}, 
   379283, 
   null, 
   1258675140.0
  ], 
  [
   379290, 
   null, 
   "Ethmi", 
   "Most of the warning signs were recognized during the Bush administration.\n\n \n And if it had made a significant story \"Arab guy gets kicked out of Army\", you'd be accusing Bush of racism. When Phil Gramm called us a nation of whiners, he was right.\n \n \nAnd, prior to 9/11 Bush could have stopped taking all the vacations he took and spent some time in DC reading terrorist reports. As Ron Suskind reports in THE ONE PERCENT DOCTRINE: Deep Inside America's Pursuit of Its Enemies Since 9/11:\n \n The Shadow War, In a Surprising New Light - washingtonpost.com\n\n \n \n There was no course of action that Bush could've taken that could've prevented 9-11 without you accusing him of some crime or another. You have no right to whine about a problem if you have no solution for it.", 
   {}, 
   379233, 
   null, 
   1258675200.0
  ], 
  [
   379293, 
   null, 
   "Ethmi", 
   "This gets my vote for stupidest post of the month.\n\n \n And this gets mine.\n \n With how politically correct this nation is getting, I wouldn't be surprised. You obviously weren't paying attention to how much political correctness fans were saying \"We need a black president\" during the 08 elections. You also weren't paying attention to papers published by the federal government which portrayed conservatives as extremists and racists. Currently, our nation is on a witch hunt for racists, such as Glenn Beck, a man who is so racist that several black people have been guests on his show in the past, and have been treated just like his white guests.", 
   {}, 
   379267, 
   null, 
   1258675920.0
  ], 
  [
   379300, 
   null, 
   "sinjin", 
   "And this gets mine.\n \n With how politically correct this nation is getting, I wouldn't be surprised. You obviously weren't paying attention to how much political correctness fans were saying \"We need a black president\" during the 08 elections. You also weren't paying attention to papers published by the federal government which portrayed conservatives as extremists and racists. Currently, our nation is on a witch hunt for racists, such as Glenn Beck, a man who is so racist that several black people have been guests on his show in the past, and have been treated just like his white guests.\nI like the direction the country is moving . Too bad you can't share in it. \n It's still OK to be white. Not to worry there, whitey. Mr. Obama's only half black.", 
   {}, 
   379293, 
   null, 
   1258680780.0
  ], 
  [
   379304, 
   null, 
   "OldSarge", 
   "Not to worry there, whitey. \n\n \n That wouldn't be evidence of bias there would it?", 
   {}, 
   379300, 
   null, 
   1258681500.0
  ], 
  [
   379313, 
   null, 
   "Winston Smith", 
   "This is a sterling example of just how perversely politically correct the military is becoming. Here you have documented proof that Hasan was a screw-up, yet he is allowed to continue screwing up because nobody wants to be accused of bigotry for speaking against this clown. :xcensored\n\n \n \n Bush got re-elected, although he killed millions of Iraqis and caused the present chaos in AfPak. 9/11 happened on his watch emoticon_rolleyes", 
   {}, 
   379203, 
   null, 
   1258693980.0
  ], 
  [
   379314, 
   null, 
   "Winston Smith", 
   "This gets my vote for stupidest post of the month.\n\n \n Wait! the month is not over yet. Give him time to xl himself :p", 
   {}, 
   379267, 
   null, 
   1258694040.0
  ], 
  [
   379319, 
   null, 
   "Ethmi", 
   "I like the direction the country is moving.\n\n \n Because you don't see the witch hunt for racists.\n \n\n Too bad you can't share in it. \n\n \n Ignorance is bliss. We are born cold, wet, and hungry. After that it gets worse.\n \n \nIt's still OK to be white. Not to worry there, whitey. Mr. Obama's only half black.\n\n \n He's 12.6% black. That didn't stop the liberals from saying \"Let's get a black president!\"\n \n BTW, where did I say I was white?", 
   {}, 
   379300, 
   null, 
   1258704540.0
  ], 
  [
   379320, 
   null, 
   "Ethmi", 
   "Bush got re-elected, although he killed millions of Iraqis and caused the present chaos in AfPak. 9/11 happened on his watch emoticon_rolleyes\n\n \n I don't know how many times I'll have to inform you people that there was nothing Bush could've done to prevent 9-11 that wouldn't have led to you whining about him. The only things he could've done would've been invade Afghanistan and Saudi Arabia unprovoked, or had Bin Laden assassinated. Both of these would've led to you accusing him of racism and murder and any other accusation you could regurgitate.\n \n As for the Iraqi/Afghan citizens, all members of Jihadist organizations are civilians. The fact that many of them are willing to detonate themselves in crowded markets doesn't mean they're not civilians. The Army Corps of Engineers has provided hundreds of middle-eastern towns with electricity and running water. For the first time in history, traders in those villages can get on the internet and sell their products to people across the world. I will add that they did this for the towns after freeing them from Jihadist control. Many of them have give their lives to help out the Iraqi people, and I personally know a few who have taken wounds in Iraq.\n \n Tell me, what has the Australian Army Corps of Engineers done for the Iraqi people?", 
   {}, 
   379313, 
   null, 
   1258705680.0
  ], 
  [
   379321, 
   null, 
   "Ethmi", 
   "Wait! the month is not over yet. Give him time to xl himself :p\n\n \n Ironic you accuse me of being stupid.", 
   {}, 
   379314, 
   null, 
   1258705800.0
  ], 
  [
   379323, 
   null, 
   "Winston Smith", 
   "and ignorant :)", 
   {}, 
   379321, 
   null, 
   1258708920.0
  ], 
  [
   379324, 
   null, 
   "Ethmi", 
   "and ignorant :)\n\n \n It doesn't come to me as a surprise that you have no intelligent argument. It's obvious that somebody on this page is stupid and ignorant, but it isn't me, Sarge, or even Sinjin.", 
   {}, 
   379323, 
   null, 
   1258709280.0
  ], 
  [
   379347, 
   null, 
   "OldSarge", 
   "Bush got re-elected, although he killed millions of Iraqis and caused the present chaos in AfPak. 9/11 happened on his watch emoticon_rolleyes\n\n \n And your source for that bogus claim is? ", 
   {}, 
   379313, 
   null, 
   1258723980.0
  ], 
  [
   379365, 
   null, 
   "snakespit", 
   "Most of this stuff happened under Bush's watch, just like 9/11 happened.\n\n \n \n9/11 happened on his watch \n\n \n I said it prior to 9/11 of this year...anything that goes wrong from 9/11/2009 on is all Obama's fault. After all, it happened on his watch. You guys refuse to blame Cliton for his role in not doing more to prevent 9/11, so stop blaming Bush for anything happening now. \n \n Your total lack of consistency and your obvious partisan bias makes you both little more than a joke.", 
   {}, 
   379213, 
   null, 
   1258740660.0
  ], 
  [
   379366, 
   null, 
   "sinjin", 
   "Because you don't see the witch hunt for racists.\nThere are no real witches. Exposing real racists doesn't compare.\n \n \nIgnorance is bliss. We are born cold, wet, and hungry. After that it gets worse.\nNow I get your avatar and I do you.\n \n \nHe's 12.6% black. That didn't stop the liberals from saying \"Let's get a black president!\"\nYou'll have to walk me through the math. This is a new one to me.\n \n \nBTW, where did I say I was white? \nBefore, with your stupid PC protecting criminals comment. And just here again but you're too white to see it.", 
   {}, 
   379319, 
   null, 
   1258741860.0
  ], 
  [
   379376, 
   null, 
   "Ethmi", 
   "There are no real witches. Exposing real racists doesn't compare.\n\n \n Yes, but Glenn Beck, Bill O'Reily, and everyone who works for Fox News are not racists. There might be a racist or two working for Fox News, but Fox is not a racist organization. And I don't think there are any more racists working for Fox than there are working for CNN or NBC.\n \n Someone disagrees with a left-winger? Racism!!\n \n \nNow I get your avatar and I do you.\n\n \n Huh?\n \n \nYou'll have to walk me through the math. This is a new one to me.\n\n \n Him being 12.6% black isn't the point. In fact it wouldn't matter if he was 1% black or 100%, the point is that he looks black, so in the eyes of the left, he is black. And if you disagree with him, prepare to get categorized as a racist. Conservatives are being generalized as racists by the left-wing, who will deny it.\n \n \nBefore, with your stupid PC protecting criminals comment. And just here again but you're too white to see it.\n\n \n I asked for proof that I'm white. You haven't provided any. I could be black, red, yellow, or lime green for all you know. I've never said or implied anywhere that I'm white. The fact that you can't understand the meaning behind the comment I made doesn't make it stupid.", 
   {}, 
   379366, 
   null, 
   1258745880.0
  ], 
  [
   379409, 
   null, 
   "Winston Smith", 
   "I said it prior to 9/11 of this year...anything that goes wrong from 9/11/2009 on is all Obama's fault. After all, it happened on his watch. You guys refuse to blame Cliton for his role in not doing more to prevent 9/11, so stop blaming Bush for anything happening now. \n \n Your total lack of consistency and your obvious partisan bias makes you both little more than a joke.\n\n \n A picture is worth a thousand words :\n \n Is George W. Bush responsible for 9-11?", 
   {}, 
   379365, 
   null, 
   1258766220.0
  ], 
  [
   379425, 
   null, 
   "OldSarge", 
   "A picture is worth a thousand words :\n \n Is George W. Bush responsible for 9-11?\n\n \n The koolaid rotted his brain.", 
   {}, 
   379409, 
   null, 
   1258779660.0
  ], 
  [
   379428, 
   null, 
   "Penfold", 
   "The koolaid rotted his brain.\n\n \n I think you'll find it was booze and coke, then Shrub got religion. Which of those was the more toxic, who can say?", 
   {}, 
   379425, 
   null, 
   1258782480.0
  ], 
  [
   379438, 
   null, 
   "Ethmi", 
   "A picture is worth a thousand words :\n \n Is George W. Bush responsible for 9-11?\n\n \n Of course not. This is just a conspiracy theory with no real evidence to back it up.", 
   {}, 
   379409, 
   null, 
   1258792260.0
  ], 
  [
   379443, 
   null, 
   "Winston Smith", 
   "The events of and leading up to 9/11 was not just a crime but a horrific tragedy. \n \n Why did this happen? \n \n \"Who benefits?\" is one of the first questions that should be answered when a crime of this magnitude is committed. \n \n Another question that deserves a detailed answer: \"If they knew in advance, why would top officials in the FBI, CIA, and Bush administration allow this tragedy to take place?\" \n \n These questions have the same probable answer: \n \n The 9/11 tragedy and mass murder of 3000 Americans would transform an unpopular and inept president into a war time leader who could not only claim unprecedented power, but whose administration could then successfully threaten, intimidate, and prevent anyone from uncovering the complicity of the FBI, CIA, and the Bush administration in this horrific assault on America. \n \n Immediately following 9/11, and after he emerged from hiding, President Bush lavishly praised his accomplices in the FBI and warned off those who might dare to question or criticize the agency. Moreover, although he had grounded all commercial and private jets, he made one critical exception: The bin Laden family, with whom he and his father had personal and financial ties, were allowed to escape questioning and the U.S. and to fly back to Saudi Arabia. \n \n Both President Bush and Vice President Dick Cheney also began threatening those who were suggesting that the events leading up to 9/11 should have been anticipated, and both Bush and Cheney urged Senate and House Republican leaders and Democratic Majority Leader Tom Daschle to block any investigation into the events of Sept. 11. \n \n Why would they do that? What are they afraid of? \n \n We believe the answer is obvious. \n \n The cover up began well before 9/11. The cover up continues to this day. \n \n http://www.rense.com/general25/fb.htm", 
   {
    "post_info": {
     "post_title": "Dubya knew about 9/11"
    }
   }, 
   379438, 
   null, 
   1258799400.0
  ], 
  [
   379465, 
   null, 
   "OldSarge", 
   "The events of and leading up to 9/11 was not just a crime but a horrific tragedy. \n \n Why did this happen? \n \n \"Who benefits?\" is one of the first questions that should be answered when a crime of this magnitude is committed. \n \n Another question that deserves a detailed answer: \"If they knew in advance, why would top officials in the FBI, CIA, and Bush administration allow this tragedy to take place?\" \n \n These questions have the same probable answer: \n \n The 9/11 tragedy and mass murder of 3000 Americans would transform an unpopular and inept president into a war time leader who could not only claim unprecedented power, but whose administration could then successfully threaten, intimidate, and prevent anyone from uncovering the complicity of the FBI, CIA, and the Bush administration in this horrific assault on America. \n \n Immediately following 9/11, and after he emerged from hiding, President Bush lavishly praised his accomplices in the FBI and warned off those who might dare to question or criticize the agency. Moreover, although he had grounded all commercial and private jets, he made one critical exception: The bin Laden family, with whom he and his father had personal and financial ties, were allowed to escape questioning and the U.S. and to fly back to Saudi Arabia. \n \n Both President Bush and Vice President Dick Cheney also began threatening those who were suggesting that the events leading up to 9/11 should have been anticipated, and both Bush and Cheney urged Senate and House Republican leaders and Democratic Majority Leader Tom Daschle to block any investigation into the events of Sept. 11. \n \n Why would they do that? What are they afraid of? \n \n We believe the answer is obvious. \n \n The cover up began well before 9/11. The cover up continues to this day. \n \n America Betrayed - Bush Administration, FBI Complicity In 911\n\n \n Ah that explains it all. A conspiracy theory nutjob. Sorry that has been debunked so often that believers should be put in institutions until they are well. ", 
   {}, 
   379443, 
   null, 
   1258813440.0
  ], 
  [
   381115, 
   null, 
   "snakespit", 
   "The events of and leading up to 9/11 was not just a crime but a horrific tragedy. \n \n Why did this happen? \n \n \"Who benefits?\" is one of the first questions that should be answered when a crime of this magnitude is committed. \n \n Another question that deserves a detailed answer: \"If they knew in advance, why would top officials in the FBI, CIA, and Bush administration allow this tragedy to take place?\" \n \n These questions have the same probable answer: \n \n The 9/11 tragedy and mass murder of 3000 Americans would transform an unpopular and inept president into a war time leader who could not only claim unprecedented power, but whose administration could then successfully threaten, intimidate, and prevent anyone from uncovering the complicity of the FBI, CIA, and the Bush administration in this horrific assault on America. \n \n Immediately following 9/11, and after he emerged from hiding, President Bush lavishly praised his accomplices in the FBI and warned off those who might dare to question or criticize the agency. Moreover, although he had grounded all commercial and private jets, he made one critical exception: The bin Laden family, with whom he and his father had personal and financial ties, were allowed to escape questioning and the U.S. and to fly back to Saudi Arabia. \n \n Both President Bush and Vice President Dick Cheney also began threatening those who were suggesting that the events leading up to 9/11 should have been anticipated, and both Bush and Cheney urged Senate and House Republican leaders and Democratic Majority Leader Tom Daschle to block any investigation into the events of Sept. 11. \n \n Why would they do that? What are they afraid of? \n \n We believe the answer is obvious. \n \n The cover up began well before 9/11. The cover up continues to this day. \n \n America Betrayed - Bush Administration, FBI Complicity In 911\n\n \n Thank you Winston for illustrating my point on a level I just couldn't get to. emoticon_xgood", 
   {}, 
   379443, 
   null, 
   1259712540.0
  ], 
  [
   381186, 
   null, 
   "jazyjason", 
   "[B]You mean 8 months before 9-11 baby? Do you think slick willie knew about any thing beside tail?\n \n \n\n \n Psh if I had to F*&^ Hillary I'd cheat too! I mean I'm Gay but Lord have mercy! lol...\n \n But getting back to the subject at hand. Simone hun honestly just stop with the cook theories and whoever else even believes them. Bush and Dick had no idea of 9/11 we all didn't. \n \n I find it a sad irony that we discover the warning signs AFTER the incident... We're only human and we all make mistakes...\n \n Oh and FYI We did NOT land on the moon.. Simone told me it was made of cheese and that there were giant moon rats eating and eating until one day the moon will be gone... that's why there are holes in it. It's true!!! Honestly!", 
   {}, 
   379288, 
   null, 
   1259732340.0
  ], 
  [
   381228, 
   null, 
   "JPSartre12", 
   "I must be missing the proof that fear of being accused of bigotry played any part. Where's that?\n\n \n Classmates: Hasan defended suicide bombings, held Islamist views - CNN.com\n Political correctness and Ft. Hood killings - CNN.com\n Free Speech Rights Prevented Probe Into Hasan E-Mails, Investigators Say - FOXNews.com\n \n Here's one excerpt, from Time Magazine.\n \n\n These students, speaking privately because they have been ordered not to speak publicly, say they're angry that what they view as political correctness led their superiors to ignore the warning signs witnessed by students and faculty at the Uniformed Services University of the Health Sciences in Bethesda, Md. Two of them expressed a willingness to testify about Hasan's conduct in the 2007-08 school year but also expressed concern that the military's political sensitivities could compromise any Pentagon investigation. \n \n Read more: Fort Hood: Hasan's Warning Signs Ignored, Say Classmates - TIME \n\n \n Even the freaking Huffington Post called it what it was...even though they tried to spin it in favor of liberalism. \n Benjamin R. Barber: Forgiving Political Correctness At Fort Hood On Thanksgiving\n \n \nYou mean back in 1993 when Clinton had been in office for only 13 months? Do you think George H.W. Bush knew about these bombers before hand and didn't warn Clinton?\n \n But, even so, check out this link, if you aren't too damned lazy (I can't cut and paste from that site):\n snopes.com: Clinton Administration and Terrorists\n \n But phobic little minds are already fixated on what they believe and you probably won't.\n\n \n Clinton treated terrorism as a criminal matter, not a military matter. His admin set up the walls between the CIA and FBI that prevented the two agencies from sharing information. There are so many examples of him neutering our ability to catch terrorists that it could fill a book. In fact, Obama is following in Clinton's footsteps by holding criminal trials for Al Qaeda terrorists instead of military tribunals. And it's not surprisnin why. The same Clinton cronies are working for Obama now. \n \n \nYou mean 8 months before 9-11 baby? Do you think slick willie knew about any thing beside tail?\n \n Online Rumor Mill Spins Its Own Myth(Snopes.com's leftwing bias undercuts its credibility)\n Who else here is aware that Snopes is a LIBERAL LEFT website? - Yahoo! Answers\n Snopes.com LEFT WING authority - Toyota Tundra Forums : Tundra Solutions Forum\n Do you find the fact-checking site Snopes.com to be biased? | BuzzDash\n RUTHLESS ROUNDUP: SNOPES LIES\n In defense of Snopes A Modest Construct\n Snopes' Liberal Political Agenda ~ Notoriously Conservative\n \n \n\n \n Oh snap! Looks like you got Pwned. \n \n \nBush got re-elected, although he killed millions of Iraqis and caused the present chaos in AfPak. 9/11 happened on his watch emoticon_rolleyes\n\n \n Revisionist history again, Winston? Millions? How about the Million that starved under Clinton during the Iraqi embargo?", 
   {
    "unicode_changes_made": true
   }, 
   381186, 
   null, 
   1259788500.0
  ], 
  [
   381238, 
   null, 
   "Iuris", 
   "I don't know what Sarge was thinking, but I fail to see how he intends to discredit Snopes.com by citing sources that state it's accurate and that it's not...", 
   {}, 
   381228, 
   null, 
   1259791920.0
  ], 
  [
   381246, 
   null, 
   "Steeeeve", 
   "Winston is a 9/11 conspiracy guy?!?!?!? Priceless! emoticon_xhoho", 
   {}, 
   381238, 
   null, 
   1259794260.0
  ], 
  [
   381251, 
   null, 
   "snakespit", 
   "Winston is a 9/11 conspiracy guy?!?!?!? Priceless! emoticon_xhoho\n\n \n This actually surprises you?", 
   {}, 
   381246, 
   null, 
   1259796480.0
  ], 
  [
   381253, 
   null, 
   "trebor", 
   "Winston is a 9/11 conspiracy guy?!?!?!? Priceless! emoticon_xhoho\n\n \n No. if you read what he said '911 happened on Bush's watch'.\n \n He didn't say bush did it., merely that it happened on his watch. \n \n That is an accurate statement. \n \n If he said 9/11 was planned by bush, then he would be a wack job.", 
   {}, 
   381246, 
   null, 
   1259802540.0
  ], 
  [
   381292, 
   null, 
   "OldSarge", 
   "I don't know what Sarge was thinking, but I fail to see how he intends to discredit Snopes.com by citing sources that state it's accurate and that it's not...\n\n \n If you bothered to read closely then you should have picked up on snopes having a left wing bias.", 
   {}, 
   381238, 
   null, 
   1259852460.0
  ], 
  [
   381298, 
   null, 
   "Iuris", 
   "I have been reading Snopes for, oh, years now. If anything, they're rightish. Of course, to you, everything is left, so...\n \n EDIT: Perhaps a little clarification would be nice: it's not that Snopes is leftist. It's just that so many bogus claims mailed around are rightist. And since most of snopes findings are \"claim was not true/was overstated/was misleading\", they quash much rightist trash.", 
   {}, 
   381292, 
   null, 
   1259854320.0
  ], 
  [
   381303, 
   null, 
   "OldSarge", 
   "I have been reading Snopes for, oh, years now. If anything, they're rightish. Of course, to you, everything is left, so...\n \n EDIT: Perhaps a little clarification would be nice: it's not that Snopes is leftist. It's just that so many bogus claims mailed around are rightist. And since most of snopes findings are \"claim was not true/was overstated/was misleading\", they quash much rightist trash.\n\n \n Reading it does not make one an expert. Even less so since you read through a leftist lens. \n \n \"Although Snopes hasn't any political philosophy explicitly stated on the website, snopes' selectivity and analysis of political emails oozes with partisanship. Religious emails don't fare much better and typically get a liberal hatchet job. In a nutshell, although snopes has to reluctantly admit that most of the conservative political and religious emails are &#8220;true\" as far as snopes can determine, there is always a caveat, disclaimer, footnote, or lengthy oratory explaining why everything from crime statistics to reports from Iraq must be viewed and understood through snopes' lens. Some examples and links follow:\n \n An email made its way around the country recently showing a picture of John Kerry at an anti-war rally with Jane Fonda. If a picture is worth a thousand words, Snopes thinks ten thousand words is the only antidote to spinning this photo that Snopes had to admit was true. Indeed, Snopes has gone into high gear to rescue John Kerry from being associated with the extreme left. Snopes uses extensive quotes from Jane Fonda to demonstrate that John Kerry was not as much of a foaming at the mouth liberal as she herself was [is].\"\n ", 
   {}, 
   381298, 
   null, 
   1259857080.0
  ], 
  [
   381325, 
   null, 
   "snakespit", 
   "No. if you read what he said '911 happened on Bush's watch'.\n \n He didn't say bush did it., merely that it happened on his watch. \n \n That is an accurate statement. \n \n If he said 9/11 was planned by bush, then he would be a wack job.\n\n \n Did you read post #35? The one with the tag-line: \n \n \nDubya knew about 9/11\n \n \n Steeeve is 100% correct. Based on post #35, Winston is a 9/11 conspiracy guy.", 
   {}, 
   381253, 
   null, 
   1259874240.0
  ], 
  [
   381349, 
   null, 
   "sinjin", 
   "Reading it does not make one an expert. Even less so since you read through a leftist lens. \n \n \"Although Snopes hasn't any political philosophy explicitly stated on the website, snopes' selectivity and analysis of political emails oozes with partisanship. Religious emails don't fare much better and typically get a liberal hatchet job. In a nutshell, although snopes has to reluctantly admit that most of the conservative political and religious emails are &#8220;true\" as far as snopes can determine, there is always a caveat, disclaimer, footnote, or lengthy oratory explaining why everything from crime statistics to reports from Iraq must be viewed and understood through snopes' lens. Some examples and links follow:\n \n An email made its way around the country recently showing a picture of John Kerry at an anti-war rally with Jane Fonda. If a picture is worth a thousand words, Snopes thinks ten thousand words is the only antidote to spinning this photo that Snopes had to admit was true. Indeed, Snopes has gone into high gear to rescue John Kerry from being associated with the extreme left. Snopes uses extensive quotes from Jane Fonda to demonstrate that John Kerry was not as much of a foaming at the mouth liberal as she herself was [is].\"\n \nSnopes' Liberal Political Agenda ~ Notoriously Conservative\n \n Speaking of lenses.", 
   {}, 
   381303, 
   null, 
   1259886120.0
  ], 
  [
   381407, 
   null, 
   "OldSarge", 
   "Snopes' Liberal Political Agenda ~ Notoriously Conservative\n \n Speaking of lenses.\n\n \n Um want to try for the content? I didn't think so. Not even a small piece of it such as this one? \"An email made its way around the country recently showing a picture of John Kerry at an anti-war rally with Jane Fonda. If a picture is worth a thousand words, Snopes thinks ten thousand words is the only antidote to spinning this photo that Snopes had to admit was true. Indeed, Snopes has gone into high gear to rescue John Kerry from being associated with the extreme left. Snopes uses extensive quotes from Jane Fonda to demonstrate that John Kerry was not as much of a foaming at the mouth liberal as she herself was [is].\"\n ", 
   {}, 
   381349, 
   null, 
   1259938080.0
  ], 
  [
   381430, 
   null, 
   "sinjin", 
   "Um want to try for the content? I didn't think so. Not even a small piece of it such as this one? \"An email made its way around the country recently showing a picture of John Kerry at an anti-war rally with Jane Fonda. If a picture is worth a thousand words, Snopes thinks ten thousand words is the only antidote to spinning this photo that Snopes had to admit was true. Indeed, Snopes has gone into high gear to rescue John Kerry from being associated with the extreme left. Snopes uses extensive quotes from Jane Fonda to demonstrate that John Kerry was not as much of a foaming at the mouth liberal as she herself was [is].\"\n \n\n Who defines where the \"extreme left\" begins?\n \n Do you deny the existence of a \"conservative lens\"?\n \n We all view the world through a perceptual filter.\n \n Could it be that through yours, anyone left of you becomes a commie?\n \n I've heard similar said about the ACLU and they've defended the \"extreme right\" in court.", 
   {}, 
   381407, 
   null, 
   1259950560.0
  ], 
  [
   381452, 
   null, 
   "Iuris", 
   "By Sarge's criteria, so much is leftist that almost everything else is to the left of him.\n \n I've been reading Snopes for years, and they're far from politically loaded. But, of course, Sarge has read rightist writings accusing Snopes of leftism, and he must know better...\n \n As for the Kerry+Fonda, had dear Sarge read the article, he'd see it's among the shorter ones and points out that the picture is true, that both Kerry and Fonda were at the rally, that this was before Fonda went to Vietnam and that Kerry doesn't support her later actions.", 
   {}, 
   381430, 
   null, 
   1259965920.0
  ], 
  [
   381484, 
   null, 
   "OldSarge", 
   "Who defines where the \"extreme left\" begins?\n \n Do you deny the existence of a \"conservative lens\"?\n \n We all view the world through a perceptual filter.\n \n Could it be that through yours, anyone left of you becomes a commie?\n \n I've heard similar said about the ACLU and they've defended the \"extreme right\" in court.\n\n \n Interesting you dodged the question. Your strawmen are in flames.", 
   {}, 
   381430, 
   null, 
   1259983740.0
  ], 
  [
   381485, 
   null, 
   "OldSarge", 
   "By Sarge's criteria, so much is leftist that almost everything else is to the left of him.\n \n I've been reading Snopes for years, and they're far from politically loaded. But, of course, Sarge has read rightist writings accusing Snopes of leftism, and he must know better...\n \n As for the Kerry+Fonda, had dear Sarge read the article, he'd see it's among the shorter ones and points out that the picture is true, that both Kerry and Fonda were at the rally, that this was before Fonda went to Vietnam and that Kerry doesn't support her later actions.\n\n \n Where I view any thing has no part here beyond the idea of smear and insult.\n \n So you are an expert on left wing bias then due to years of reading snopes.\n I note you didn't make any attempt to refute the source I gave other than you experthood. Yes it was true. Yet you and snopes have to add the modifier. Why? Did you think you would find a left wing site that would admit a bias to the left?\n \n The idea the media is conservative is ridiculous. The same goes for snopes as was demonstrated. Thanks for proving my point. ", 
   {}, 
   381452, 
   null, 
   1259984400.0
  ], 
  [
   381536, 
   null, 
   "Iuris", 
   "Of course it does matter. Your false perception invalidates your argument. Or, affirms the honesty of your argument but renders discussion impossible.\n \n The very sources you offered included a refutation - have you missed that one? Why would I add an additional refutation when you have already offered it yourself?\n \n As for the Kerry+Fonda: A picture is shown out of context, making an implication. Snopes investigates, confirms the true bit and adds a bit of context that refutes the implication. That's bias to you?\n \n As for expertise in leftism... I claim no expertise except with Slovenian law. That's expertise. If everyone were as honest in declaring where exactly they are experts, we'd be left with every one of us claiming one or two areas of expertise. In other areas I claim familiarity.\n \n And I am familiar with Snopes. And I claim again - in the published articles, the views are central. However, many of the subjects examined are hoaxes with a RIGHT wing bias, and they are duly refuted. This isn't left wing bias - this is center responding to right wing bias.", 
   {}, 
   381485, 
   null, 
   1260043860.0
  ], 
  [
   381539, 
   null, 
   "OldSarge", 
   "Of course it does matter. Your false perception invalidates your argument. Or, affirms the honesty of your argument but renders discussion impossible.\n \n The very sources you offered included a refutation - have you missed that one? Why would I add an additional refutation when you have already offered it yourself?\n \n As for the Kerry+Fonda: A picture is shown out of context, making an implication. Snopes investigates, confirms the true bit and adds a bit of context that refutes the implication. That's bias to you?\n \n As for expertise in leftism... I claim no expertise except with Slovenian law. That's expertise. If everyone were as honest in declaring where exactly they are experts, we'd be left with every one of us claiming one or two areas of expertise. In other areas I claim familiarity.\n \n And I am familiar with Snopes. And I claim again - in the published articles, the views are central. However, many of the subjects examined are hoaxes with a RIGHT wing bias, and they are duly refuted. This isn't left wing bias - this is center responding to right wing bias.\n\n \n Double talk aside, it merely proves my point. \n \n Strange i would have thought that reading snopes for years would make you an expert. After all i read the physician's desk reference but then that doesn't make me a doctor.\n \n Your assertion is absurd. \n \n Snopes.com makes these comments concerning an email they were reviewing concerning what Darrell Scott the father of Rachel Scott who died in the Columbine High School massacre had testified of on May 27, 1999 before the House Judiciary Committee's subcommittee on crime that held hearings on \"Pending Firearms Legislation and the Administration's Enforcement of Current Gun Laws.\"\n \n Darrell Scott made the following comments which Snopes.com confirmed: \"As transcripts of the proceedings demonstrate, Darrell Scott did make the statement attributed to him\" in the emails sent out. Here is what Darrell said,\n \n \"Since the dawn of creation there has been both good & evil in the hearts of men and women. We all contain the seeds of kindness or the seeds of violence. The death of my wonderful daughter, Rachel Joy Scott, and the deaths of that heroic teacher, and the other eleven children who died must not be in vain. Their blood cries out for answers.\" \"The first recorded act of violence was when Cain slew his brother Abel out in the field. \n \n The villain was not the club he used. Neither was it the NCA, the National Club Association. The true killer was Cain, and the reason for the murder could only be found in Cain's heart. \"In the days that followed the Columbine tragedy, I was amazed at how quickly fingers began to be pointed at groups such as the NRA.\n \n I am not a member of the NRA. I am not a hunter. I do not even own a gun. I am not here to represent or defend the NRA - because I don't believe that they are responsible for my daughter's death. Therefore I do not believe that they need to be defended. If I believed they had anything to do with Rachel's murder I would be their strongest opponent.\"\n \n \"I am here today to declare that Columbine was not just a tragedy-it was a spiritual event that should be forcing us to look at where the real blame lies! Much of the blame lies here in this room.\n \n Much of the blame lies behind the pointing fingers of the accusers themselves. \"I wrote a poem that expresses my feelings best. This was written way before I knew I would be speaking here today:\"\n \n Your laws ignore our deepest needs,\n Your words are empty air.\n You've stripped away our heritage,\n You've outlawed simple prayer. \n Now gunshots fill our classrooms,\n And precious children die.\n You seek for answers everywhere,\n And ask the question \"Why?\"\n \n You regulate restrictive laws,\n Through legislative creed.\n And yet you fail to understand,\n That God is what we need!\n \n \"Men and women are three-part beings. We all consist of body, soul, and spirit. When we refuse to acknowledge a third part of our make-up, we create a void that allows evil, prejudice, and hatred to rush in and reek havoc. Spiritual influences were present within our educational systems for most of our nation's history. Many of our major colleges began as theological seminaries. This is a historical fact.\n \n What has happened to us as a nation? We have refused to honor God, and in so doing, we open the doors to hatred and violence. And when something as terrible as Columbine's tragedy occurs politicians immediately look for a scapegoat such as the NRA. They immediately seek to pass more restrictive laws that contribute to erode away our personal and private liberties.\n \n We do not need more restrictive laws.\" Eric and Dylan would not have been stopped by metal detectors. No amount of gun laws can stop someone who spends months planning this type of massacre. The real villain lies within our own hearts.\n \n Political posturing and restrictive legislation are not the answers. The young people of our nation hold the key. There is a spiritual awakening taking place that will not be squelched! We do not need more religion. We do not need more gaudy television evangelists spewing out verbal religious garbage. We do not need more million dollar church buildings built while people with basic needs are being ignored.\n \n We do need a change of heart and a humble acknowledgment that this nation was founded on the principle of simple trust in God!\" \"As my son Craig lay under that table in the school library and saw his two friends murdered before his very eyes, He did not hesitate to pray in school. I defy any law or politician to deny him that right!\n \n I challenge every young person in America, and around the world, to realize that on April 20, 1999, at Columbine High School prayer was brought back to our schools. Do not let the many prayers offered by those students be in vain. Dare to move into the new millennium with a sacred disregard for legislation that violates your God-given right to communicate with Him. To those of you who would point your finger at the NRA- I give to you a sincere challenge.\n \n Dare to examine your own heart before casting the first stone! My daughter's death will not be in vain! The young people of this country will not allow that to happen!\"\n \n Darrell is ultimately saying that guns are not the issue but God. \"We have refused to honor God, and in so doing, we open the doors to hatred and violence.\" and \"We do need a change of heart and a humble acknowledgment that this nation was founded on the principle of simple trust in God!\".\n \n Now here is where an interpretive bias by Scopes.com comes in. The image to the left/above is a snap shot from snopes.com. Click on it to enlarge but here is what snopes said, \"Mr. Scott presented no facts or statistics relating to the issues of gun control and gun law enforcement\" which is true. But I don't think he meant to do that with his testimony. Now snopes biases the viewers against Darrell's testimony by continuing on and saying, \"he merely gave a rambling opinion that gun control laws wouldn't have stopped the Columbine High School shootings and that those shootings were somehow related to a lack of religion in schools (repeating along the way the mistaken claim that prayer has been \"outlawed\" in schools).\"\n \n Contrary to snopes.com according to the 1963 US Supreme Court decision the public school practice of prayer and Bible reading was deemed unconstitutional and it is clear that Darrell and most Christians when we talk about this is in that context. This reveals another bias by snopes. Instead they should have not contradicted Darrell at this point but rather given context. Of course people can pray silently and in group situations. Darrell was just using this event as a spring board to make a point and condemn the outlawing of such practices when our history as America was different when we didn't have school violence and hatred like we do today thus giving evidence to the relation of a lack of (not \"religion in schools\" as snopes put it) but of \"God\" as Darrell put it. Darrell even said, \"We do not need more religion.\" So from his perspective it's not religion but God. And Darrell did say this in context of this speech that contained: \"Spiritual influences were present within our educational systems for most of our nation's history. Many of our major colleges began as theological seminaries. This is a historical fact. What has happened to us as a nation?\"\n \n Snopes.com should get somebody on their editorial that understand people of faith before mocking them. This post clearly shows that snopes may have a bias when it comes to issues like this.\n \n Lastly, the claim about the media is not fair from snopes.com either. Just because the testimony is released in the AP and reported in several big-city newspapers doesn't mean this story got media attention. I bet ABC, NBC, PBS and CBS all reported about the gun law and control side of the issue and at the same time gave very little if any attention to this man's perspective which many Americans have. When people speak of the media they do not mean by that some newspapers in big city's they don't live in and not that many read the AP either or rather only if major news outlets pick up the AP story. Most mean by media ABC, NBC, CBS and PBS cause that is what is the most watched. Nowadays alternative media sources are growing largely in part because of the media bias in the mainstream and so media is continuing to change but snopes.com's answer was revealing of a little bias against claims of media bias.\n \n Snopes.com vs Darrell Scott the father of Rachel Scott who died in the Columbine school massacre incident in 1999... | Values Voter News\n \n \n ", 
   {}, 
   381536, 
   null, 
   1260046080.0
  ], 
  [
   381593, 
   null, 
   "sinjin", 
   "\"...he merely gave a rambling opinion that gun control laws wouldn't have stopped the Columbine High School shootings and that those shootings were somehow related to a lack of religion in schools (repeating along the way the mistaken claim that prayer has been \"outlawed\" in schools).\"\n \n I would agree with this assessment of his testimony but I'm an atheist.", 
   {}, 
   381539, 
   null, 
   1260070740.0
  ], 
  [
   381613, 
   null, 
   "Iuris", 
   "Sarge, you do realize the article focuses on the E-mail and it's claims? The E-mail makes claims, snopes examines them, states which are true and which are wrong and that's the article.\n \n Do note that the email cited at the top of the page contains an additional paragraph - the one the article focuses on and that it's specifically these claims that snopes addressed.", 
   {}, 
   381593, 
   null, 
   1260108540.0
  ], 
  [
   381616, 
   null, 
   "OldSarge", 
   "\"...he merely gave a rambling opinion that gun control laws wouldn't have stopped the Columbine High School shootings and that those shootings were somehow related to a lack of religion in schools (repeating along the way the mistaken claim that prayer has been \"outlawed\" in schools).\"\n \n I would agree with this assessment of his testimony but I'm an atheist.\n\n \n At least some one gets it.", 
   {}, 
   381593, 
   null, 
   1260110460.0
  ], 
  [
   381656, 
   null, 
   "sinjin", 
   "At least some one gets it.\nI think you delude yourself with regard to where the \"middle\" lies along the American political spectrum.", 
   {}, 
   381616, 
   null, 
   1260148560.0
  ], 
  [
   381659, 
   null, 
   "OldSarge", 
   "I think you delude yourself with regard to where the \"middle\" lies along the American political spectrum.\n\n \n In your case I don't think, I know.", 
   {}, 
   381656, 
   null, 
   1260149220.0
  ], 
  [
   381773, 
   null, 
   "Pippie", 
   "You mean 8 months before 9-11 baby? Do you think slick willie knew about any thing beside tail?\n \n Online Rumor Mill Spins Its Own Myth(Snopes.com's leftwing bias undercuts its credibility)\n Who else here is aware that Snopes is a LIBERAL LEFT website? - Yahoo! Answers\n Snopes.com LEFT WING authority - Toyota Tundra Forums : Tundra Solutions Forum\n Do you find the fact-checking site Snopes.com to be biased? | BuzzDash\n RUTHLESS ROUNDUP: SNOPES LIES\n In defense of Snopes A Modest Construct\n Snopes' Liberal Political Agenda ~ Notoriously Conservative\n \n \n\n \n I thought most intelligent people knew Snopes were panderers to the left. I've caught many erroneous statements off their site.", 
   {}, 
   379288, 
   null, 
   1260238740.0
  ], 
  [
   381778, 
   null, 
   "Pippie", 
   "Most of the warning signs were recognized during the Bush administration.\n \n And, prior to 9/11 Bush could have stopped taking all the vacations he took and spent some time in DC reading terrorist reports. As Ron Suskind reports in THE ONE PERCENT DOCTRINE: Deep Inside America's Pursuit of Its Enemies Since 9/11:\n \n The Shadow War, In a Surprising New Light - washingtonpost.com\n\n \n Look for the book in the fiction section. emoticon_rolleyes", 
   {}, 
   379233, 
   null, 
   1260239880.0
  ], 
  [
   381780, 
   null, 
   "OldSarge", 
   "I thought most intelligent people knew Snopes were panderers to the left. I've caught many erroneous statements off their site.\n\n \n You are correct. The operative word being intelligent.", 
   {}, 
   381773, 
   null, 
   1260240900.0
  ], 
  [
   381790, 
   null, 
   "Pippie", 
   "Yeah, Bush's military was totally screwed up.\n \n Most of this stuff happened under Bush's watch, just like 9/11 happened.\n\n \n This \"stuff\" has been in the works for almost 4 decades simone. The PC crowd started their campaign in earnest back in the early 70's. \n \n A few examples of the PC bullc**p are: Before MLK died, he used the word \"negroe\". Along comes a domestic terrorist, Stokely Carmichael and wants negroes to be called \"black\". Then the NAACP and their ilk come along and decide \"African-American\" is the new term. A political PC ploy. \n \n Then we saw the dawning of the \"Positive Parenting\" crowd. It was not PC to spank a child. Liberals...YES liberals embarked on a plan to stiffle parent's abilities to discipline their OWN children. Schools were also admonished against warming a kid's butt. Thank you socialist minded social workers.\n \n Next, Mexicans from Mexico were no longer Mexicans. They got a new label assigned by La Raza and that ilk...now they are \"Hispanics\". And to facilitate the flood of illegals, schools were forced to institute ESL programs.\n \n Then, our military had to start catering to every whim and bull special interest groups demanded. Nevermind the fact the military was still a fairly well run organization. Feminists and gays decided to change all that. Forget the fact, the damage being done, their PC agendas took presecedence. \n \n Here we are today. How dare the military operate under the UCMJ? It might offend some radical Muslim. People like Hasan get a pass because the left doesn't want to offend a minority. Or worse a frigging terrorist. Thirty years ago, Hasan would have been booted out. \n \n Clinton knew about the terrorists and did nothing. CAIR was building up their regime in D.C. under Clinton's watch. Noooone said a word. ALL the planning for 9/11 took place during Clinton's term. \n \n All this \"stuff\" has become a real life curse on America. The radical movement of Islam could have been stopped a long time ago. But, oh my gosh, we wouldn't want to offend some suicidal jihadist. That wouldn't be PC. \n \n The socialists have been permeating society with their c**p for too long and America has become a cesspool of pandering fools.", 
   {}, 
   379213, 
   null, 
   1260242460.0
  ], 
  [
   383523, 
   null, 
   "OldSarge", 
   "Alas poor Hasan's rights are being trampled since he can't pray in arabic with anyone unless there is a translator present. Oh the inhumanity of it.", 
   {}, 
   381790, 
   null, 
   1261688460.0
  ], 
  [
   383813, 
   null, 
   "jim's trucking", 
   "I thought most intelligent people knew Snopes were panderers to the left. I've caught many erroneous statements off their site.\nScratch a service provider...find bias.", 
   {}, 
   381773, 
   null, 
   1261993980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Hasan's Supervisor Warned Army In '07", 
  "url": "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 13596, 
  "discussion_files": [
   [
    "18570.html", 
    "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a-print.html"
   ], 
   [
    "18571.html", 
    "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a-5-print.html"
   ], 
   [
    "18572.html", 
    "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a-4-print.html"
   ], 
   [
    "18573.html", 
    "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a-3-print.html"
   ], 
   [
    "18574.html", 
    "http://www.4forums.com/political/current-events-debates/13596-hasans-supervisor-warned-army-07-a-2-print.html"
   ]
  ], 
  "identifier": 13596
 }
]