[
 [
  [
   379222, 
   null, 
   "simone", 
   "A bipartisan House task force wanted to debunk allegations that Ronald Reagan's campaign in 1980 had sabotaged President Jimmy Carter's negotiations with Iran about freeing 52 Americans, who were taken hostage 30 years ago this week.\n \n That alleged act of treachery, making Carter look weak and inept, set the stage for Reagan's landslide victory on Nov. 4, 1980, exactly one year to the date after the hostages were seized. But the suspicions about this so-called October Surprise case only reached a critical mass in 1991-92 after several years of disclosures about the Iran-Contra arms-for-hostages scheme.\n\n Consortiumnews.com\n \n Alibis for key Republicans had to be constructed, especially for William Casey, Reagan's campaign chief in 1980 and later Reagan's CIA director. October 19, 1980 was a critical day for establishing the whereabouts of Mr. Casey:\n \nLarry Casey insisted to me that he vividly remembered his parents having dinner with Bill Casey at the Jockey Club in Washington on Oct. 19, 1980. \"It was very clear in my mind even though it was 11 years ago,\" Larry Casey said.\n \n But then I showed Larry Casey the sign-in sheets for the Reagan-Bush campaign headquarters. The entries recorded Larry Casey's parents picking up Bill Casey for the dinner on Oct. 15, four days earlier. Larry Casey acknowledged his error, and indeed an American Express receipt later confirmed Oct. 15 as the date of the Jockey Club dinner.\n \n An alibi for that day also had to be established for George Herbert Walker Bush, then Reagan's VP running mate.\n \nThe biographer, journalist David Andelman, said deMarenches had described arranging meetings between Republicans and Iranians in the summer and fall of 1980, with one meeting held in Paris in October. But deMarenches demanded that the story be kept out of his memoir to protect the reputations of his friends, George H.W. Bush and William Casey, Andelman said.\n\n Interestingly, a prominent Democrat, Lee Hamilton, was an active participant in the coverup. And he successfully quashed a congressional investigation into the illicit deal cut with Iran for arms:\n \nAs chairman of the Select Committee to Investigate Covert Arms Transactions with Iran, Hamilton chose not to investigate President Ronald Reagan or President George H. W. Bush, stating that he did not think it would be \"good for the country\" to put the public through another impeachment trial.\n\n Lee H. Hamilton - Wikipedia, the free encyclopedia", 
   {
    "post_info": {
     "post_title": "The Coverups"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1258665660.0
  ], 
  [
   379225, 
   null, 
   "simone", 
   "Oh yeah. And Lee Harmilton was also on the 9/11 Commission.", 
   {}, 
   379222, 
   null, 
   1258665840.0
  ], 
  [
   379226, 
   null, 
   "JPSartre12", 
   "What's next? A rehashing of the Bay of Pigs? The Gulf of Tonkin Incident? Pearl Harbor? Oh wait, they were all under Democrats....never mind. emoticon_rolleyes", 
   {}, 
   379222, 
   null, 
   1258665960.0
  ], 
  [
   379264, 
   null, 
   "OldSarge", 
   "Oh yeah. And Lee Harmilton was also on the 9/11 Commission.\n\n \n Simone baby this is spam, you already posted this drivel elsewhere. ", 
   {}, 
   379225, 
   null, 
   1258671360.0
  ], 
  [
   379269, 
   null, 
   "simone", 
   "New developments.", 
   {}, 
   379264, 
   null, 
   1258672380.0
  ], 
  [
   379274, 
   null, 
   "OldSarge", 
   "Think for a moment of other recent examples of Democrat cover-ups. John Kerry comes to mind. The press excoriated anyone who questioned his military record. Yet, despite the very public promises to release his full record, most notably to the late Tim Russert, he has never done so. He never will, because in that record one would find just what a liar John Kerry is. Apparently, he never actually made the trip to Cambodia that is seared in his memory, but he did take one to Paris to talk to the Viet Cong. So far, thanks to President Carter reinstating his medals, it has been a very successful cover up. \n \n \n John Edwards portrayed himself as the quintessential husband and father. His boyish good looks, his empathy for the downtrodden and his abiding love for his cancer stricken wife made him a vice-presidential shoo-in, except for that mistress and love child that he visited regularly. Despite his staffers covering for him and the press spiking reporting on the affair, it came out, a very unsuccessful cover-up for Edwards. We are assured however, that even though he admits the affair, the child is not his. Oh, and there will be no DNA testing of the child. \n \n \n How about all the assurances that Fannie Mae and Freddie Mac were in good order? No audits or reforms necessary, everything is just fine. How many members of Congress blocked meaningful regulation for many years? The Democrats have profited and continue to profit greatly from the two enterprises, costing the taxpayers billions. Yet a majority of Americans blame President Bush for the financial crisis. Yet another successful cover-up, as well as an effective propaganda campaign courtesy of the party of coincidence. Do you remember that financial crisis that miraculously popped up last November? You know, just before the election. Pure coincidence, really, you can trust the Democrats. \n \n \n And last but not least, is the record of the Clinton administration's contribution to 9-11. We know that members of the administration actively built barriers to data sharing between intelligence and law enforcement. We know the Clintons viewed terrorism as a law enforcement matter. We know that Madeleine Albright warned Pakistan before Clinton's half-hearted cruise missile strike on Bin Laden, thereby giving days of warning to Al Qaeda. \n \n \n We know that soon after the formation of 9-11 commission was officially announced the Clinton administrations National Security Advisor, Sandy Berger, went to National Archives over a period of weeks to steal and destroy highly classified records of the Clinton administration decision-making process in handling Al-Qaeda and terrorism. He stuck them in his pants and socks and later burned and shredded them. You can bet they held incriminating evidence, evidence that would have tanked the Democrats on security issues and ripped away the \"Clinton Legacy.\" It was a very successful cover-up, about which the press is remarkably silent. Berger received what amounts to a wrist slap, while old Bill laughed it off saying; \"That Sandy, he's so absent minded.\" \n American Thinker Blog: The Alchemy of Democrat Cover-ups\n \n Very few car accidents, or cover-ups, have achieved the notoriety of that which took place July 18, 1969 involving the now senior U.S. Senator from Massachusetts, Edward Moore \"Ted\" Kennedy on Chappaquiddick Island, Martha's Vineyard. On that fateful night, nearly 4 decades ago, Ted Kennedy attended a reunion for staffers who had toiled on his brother Bobby Kennedy's 1968 presidential campaign. \n Ted Kennedy at Chappaquiddick - CoverUps.com\n \n Our financial system is financially bankrupt because of bad loans and home mortgages made by the Fannie Mae and Freddie Mac scandal that bled into banks and investment firms around the country, which was being run and overseen by Democrats in Congress. This video shows hearings from the scandal that broke back in 2004, when the Fannie Mae and Freddie Mac were being investigated for illegal accounting practices. After watching this video is it clear who is responsible for the mess we have today that could cause our country to go into a 1929 depression. It is also clear it is not President Bush who is responsible, it is the Democrats that were overseeing Fannie Mae and Freddie Mac, and the black congressional caucus, of which Barack Obama was a member, that wanted the scandal to be ignored until it was too late.\n \n FYI: This footage isn't from Fox News.\n Democrats Coverup Fannie Mae and Freddie Mac Scandal in 2004 :: HollywoodGrind - Celebrity gossip juicy celebrity rumors celebrity scandals Hollywood gossip blog\n \n Judge upholds Washington governor's election\n Rossi won the first count by 261 votes, then watched his lead shrink to 42 in a machine recount. In a hand recount completed in late December, Gregoire was pronounced the winner by 129 votes - the smallest margin of victory in percentage terms of any statewide election in the nation's history. Five days before Gregoire's inauguration, Rossi sued to contest the election. \n USATODAY.com - Judge upholds Washington governor's election\n \n Voting Fraud In South Dakota", 
   {
    "post_info": {
     "post_title": "while we are at it"
    }, 
    "unicode_changes_made": true
   }, 
   379264, 
   null, 
   1258673400.0
  ], 
  [
   379276, 
   null, 
   "OldSarge", 
   "New developments.\n\n \n Yea right, they should have gone to the original post. Spam is spam", 
   {}, 
   379269, 
   null, 
   1258673520.0
  ], 
  [
   379292, 
   null, 
   "simone", 
   ".... Voting Fraud In South Dakota\n\n I have an interest in South Dakota and vaguely remember this case so I had to check up on the Equal Justice Foundation based in Colorado Springs, Colorado, also home to Focus on the Family et al.\n \n Whining about voter fraud instead of election fraud always raises a warning flag because it probably means that someone is having a hissyfit if native Americans, Indian tribes in South Dakota, are allowed to vote. Or if any person of color is allowed to vote.\n \n Not surprisingly, I couldn't find a list of the board of the directors of this organization, nor could I find a list of its staff members, another warning flag. Then I pulled up this fascinating rant of an article:\n \nAre We A Nation Of Whores? \n by Terri Lynn Tersak\n Are we a nation of whores and whore mongers? The November 2, 2005, Op/Ed by Kathleen Parker, Feminism's devolution from hoaxers to whores. seems to take an affirmative position that this is in fact the case. Are we all whores? No, but my guess is at least half of American women are, and an equal number of our men. If you count those who claim to be \"liberals\" or \"feminists\" that percentage would be considerably higher.\n \n I would bet all the women who fought and suffered getting the American woman the right to vote, smoke, drive, drink, and to get paid for being naked, are turning over in their graves due to the mockery too many of today's women make of themselves. Why is it that women today who are working for social, political, and economic equality of the sexes or support the notion that men have the right to exist (beyond breathing air and paying any bill for a woman that can be conjured up) are called \"women haters?\" I will admit that if it is ever proven that all feminists hate men I, for one, would not be a bit surprised. But that still wouldn't make any woman that believes equal protection under the law is true equality, a woman hater.\n \n\n Are We A Nation Of Whores? by Terri Lynn Tersak\n \n Yeppers! Ripping on nasty FEMINISTS and horrible LIBERALS. We know exactly the bias of this Equal Justice Foundation.", 
   {}, 
   379274, 
   null, 
   1258675620.0
  ], 
  [
   379294, 
   null, 
   "simone", 
   "....FYI: This footage isn't from Fox News.\n Democrats Coverup Fannie Mae and Freddie Mac Scandal in 2004 :: HollywoodGrind - Celebrity gossip juicy celebrity rumors celebrity scandals Hollywood gossip blog....\n\n Hollywood celeb rag. And the guy who runs it seems to have a major crush on very young actor Robert Patinson.", 
   {
    "unicode_changes_made": true
   }, 
   379274, 
   null, 
   1258675980.0
  ], 
  [
   379297, 
   null, 
   "OldSarge", 
   "I have an interest in South Dakota and vaguely remember this case so I had to check up on the Equal Justice Foundation based in Colorado Springs, Colorado, also home to Focus on the Family et al.\n \n Whining about voter fraud instead of election fraud always raises a warning flag because it probably means that someone is having a hissyfit if native Americans, Indian tribes in South Dakota, are allowed to vote. Or if any person of color is allowed to vote.\n \n Not surprisingly, I couldn't find a list of the board of the directors of this organization, nor could I find a list of its staff members, another warning flag. Then I pulled up this fascinating rant of an article:\n \n Are We A Nation Of Whores? by Terri Lynn Tersak\n \n Yeppers! Ripping on nasty FEMINISTS and horrible LIBERALS. We know exactly the bias of this Equal Justice Foundation.\n\n \n Attacking the source negates the content? yea right, denied and dismissed baby.", 
   {}, 
   379292, 
   null, 
   1258678740.0
  ], 
  [
   379298, 
   null, 
   "OldSarge", 
   "\nHollywood celeb rag. And the guy who runs it seems to have a major crush on very young actor Robert Patinson.\n\n \n Attacking the source negates the content? yea right, denied and dismissed baby. Want to try the content? I didn't think so. Never part of the left-tard play book. Try again on content next time.\n ", 
   {}, 
   379294, 
   null, 
   1258678860.0
  ], 
  [
   379334, 
   null, 
   "jazyjason", 
   "\n \n Attacking the source negates the content? yea right, denied and dismissed baby. Want to try the content? I didn't think so. Never part of the left-tard play book. Try again on content next time.\n \n\n \n You know I could name some typical plays orchestrated by the right. Instead of gloating and attmepting to play a majoirty of Americans as mentally incapable, why not instead bring an agument of value to a conversation instead of partisan politics?\n \n This goes for BOTH SIDES", 
   {}, 
   379298, 
   null, 
   1258711380.0
  ], 
  [
   379532, 
   null, 
   "OldSarge", 
   "You know I could name some typical plays orchestrated by the right. Instead of gloating and attmepting to play a majoirty of Americans as mentally incapable, why not instead bring an agument of value to a conversation instead of partisan politics?\n \n This goes for BOTH SIDES\n\n \n Don't get yer panties in a wad Jazz. Simone is a liberal troll and this is for her. If you don't like then tune out. Simone doesn't do debate. Its a hit and run and attack the source bit eh!", 
   {}, 
   379334, 
   null, 
   1258841400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Coverups", 
  "url": "http://www.4forums.com/political/politics-debates/13600-coverups.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13600, 
  "discussion_files": [
   [
    "25974.html", 
    "http://www.4forums.com/political/politics-debates/13600-coverups-print.html"
   ]
  ], 
  "identifier": 13600
 }
]