[
 [
  [
   379472, 
   null, 
   "OldSarge", 
   "Judge Strikes Down Tennessee Guns-in-Bars Law\n Friday, November 20, 2009\n By Lucas L. Johnson II, Associated Press \n \n \n Nashville, Tenn. (AP) - Tennessee's new law allowing people with handgun permits to be armed in bars and restaurants that serve alcohol is unconstitutionally vague, a judge ruled on Friday.\n \n Chancellor Claudia Bonnyman said the law, enacted earlier this year over the veto of Gov. Phil Bredesen, is \"fraught with ambiguity.\"\n \n She ruled after an hour of arguments in a lawsuit brought by a group of plaintiffs, many of them restaurant owners. More than 257,000 people have handgun carry permits in Tennessee.\n \n Tennessee previously banned handguns in all locations where alcohol was served. The new law made an exception for establishments that serve at least one meal on five days per week and that \"the serving of such meals shall be the principal business conducted.\" Tennessee has no legal definition to distinguish bars from restaurants.\n \n Plaintiffs' attorneys argued that it would be difficult for patrons to know what restaurants met the exceptions, which would put them at risk of breaking the law.\n \n \"What citizen could ever know that?\" attorney David Raybin asked during the hearing. \"It's criminal if you make the wrong choice.\"\n \n However, Assistant Attorney General Lyndsay Fuller Sanders said patrons who have concerns \"can just ask.\"\n \n \"Common sense should not be thrown out the window,\" Sanders said.\n \n But Bonnyman eventually ruled that language in the current law is \"unfairly vague.\"\n \n Sharon Curtis-Flair, a spokeswoman for the state attorney general's office, said attorneys will study the opinion and decide whether to appeal.\n \n Rep. Curry Todd, a main sponsor of the measure, said he hadn't seen the ruling but said he will ask the state to appeal. The Collierville Republican said he plans to \"re-pass\" legislation in January to fix any legal problems.\n \n Plaintiffs' attorney David Randolph Smith said Bonnyman's ruling will stand unless overturned by an appeals court or the Tennessee Supreme Court. However, he said the state Legislature could pass a new law.\n \n \"But then that would create a new debate,\" Smith said.\n \n Sen. Doug Jackson, D-Dickson and the chief Senate sponsor, said he expects the law to be restored either through appeals or through legislation.\n \n \"I anticipate the first of next week you're going to see legislation filed and we'll establish a clear standard,\" he said.\n \n Tennessee's new law took effect July 14. Thirty-seven states had similar legislation at the time.\n \n Many restaurants across the state opted out of the law under a provision allowing them to do so. The legislation retained an existing ban on consuming alcohol while carrying a handgun.\n \n Randy Rayburn, who owns three Nashville restaurants, said the judge's ruling is mainly a victory for Tennessee residents who \"are opposed to this law because it is vague ... and defies common sense.\"\n \n Nevertheless, critics complained that guns and alcohol in close proximity are a dangerous combination.\n \n Records show 607 people had their permits revoked or suspended last year. Revocations are issued for felony convictions, while permits can be suspended for pending criminal charges or for protection in domestic abuse cases.\n \n ___\n \n Associated Press Writer Erik Schelzig contributed to this report.\n \n CNSNews.com - Judge Strikes Down Tennessee Guns-in-Bars Law", 
   {
    "post_info": {
     "post_title": "all ya need is one judge"
    }
   }, 
   null, 
   null, 
   1258815420.0
  ], 
  [
   379478, 
   null, 
   "Doc Jones", 
   "A rare commodity, a Judge who hasn't been brain damaged in the public skools with liberal theology. emoticon_xgood", 
   {}, 
   379472, 
   null, 
   1258818780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  all ya need is one judge", 
  "url": "http://www.4forums.com/political/gun-control-debates/13609-all-ya-need-one-judge.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13609, 
  "discussion_files": [
   [
    "23008.html", 
    "http://www.4forums.com/political/gun-control-debates/13609-all-ya-need-one-judge-print.html"
   ]
  ], 
  "identifier": 13609
 }
]