[
 [
  [
   379469, 
   null, 
   "OldSarge", 
   "Gun-Toting Homeowner Catches Burglar In His Boxers\n Intruder Made Himself At Home: Showering, Doing Laundry, Filling The Fridge\n \n GOLDEN, Colo. -- A Golden homeowner did a double-take when he caught a burglar at gunpoint in his house.\n \n The intruder, who had more than made himself at home, was only wearing a pair of boxers -- boxers belonging to the homeowner. The man had also showered, done his laundry, and placed his own items in the refrigerator, Golden police said.\n \n David Strickland told 7 News that he returned home at 5 p.m. last Monday to find a stranger's white Lexus ES300 in his garage. Inside, there were signs that someone had been rummaging through his house.\n \n What was going through my mind is 'I cannot believe what's going on here,'\" said Strickland.\n \n As he searched the house, the homeowner called out, demanding to know who was there.\n \n \"To his surprise, a male voice answered,\" a Golden police report said.\n \n He looked upstairs and saw a man calmly standing there wearing only a pair of boxers, belonging to the homeowner.\n \n When Strickland demanded that the boxer burglar get off his property, he said, the man claimed he was the real homeowner and that the gun was a toy.\n \n Strickland said that he fired a warning shot at the door when the suspect moved towards him aggressively.\n \n Police soon arrived at the home in the 1200 block of Mesa Court and arrested 24-year old Timothy P. Gonzales of Golden.\n \n Not only had the suspect spent most of the day in the home, he had pretended to be the homeowner when two real estate agents and their clients arrived for a showing of the house, which is for sale, police said.\n \n Officers also discovered materials commonly used to make methamphetamine on the work bench in the garage.\n \n Gonzales was booked into the Jefferson County jail for burglary, possession of burglary tools and drug violations. The Jefferson County District Attorney's office will consider further charges.\n \n \"Bottom line, I'm just glad nobody got hurt,\" said Strickland.\n \n He said if he had it to do again, he would have walked out the back door, but he was glad he knew how to use his gun appropriately.\n \n \"If you're going to keep a gun for home protection, you need to know what you're going to do and what you're not going to do, just for safety's sake,\" Strickland said.\n \n Gonzales has a long criminal record, including charges of trespassing, possession of burglar tools and drug offenses.\n \n Golden police said they are investigating how and why Gonzales broke into the home.\n \n There are no signs of forced entry.\n \n If he used the realtor's lock box to get in, police said they will be investigating how he got the access code and whether there are similar crimes in other cities. \n Gun-Toting Homeowner Catches Burglar In His Boxers - Denver News Story - KMGH Denver", 
   {
    "post_info": {
     "post_title": "Gun-Toting Homeowner Catches Burglar In His Boxers"
    }
   }, 
   null, 
   null, 
   1258814820.0
  ], 
  [
   379476, 
   null, 
   "Doc Jones", 
   "That puts a new meaning on 'going through someone else's drawers' emoticon_smile", 
   {}, 
   379469, 
   null, 
   1258817880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun-Toting Homeowner Catches Burglar In His Boxers", 
  "url": "http://www.4forums.com/political/gun-control-debates/13607-gun-toting-homeowner-catches-burglar-his-boxers.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13607, 
  "discussion_files": [
   [
    "13090.html", 
    "http://www.4forums.com/political/gun-control-debates/13607-gun-toting-homeowner-catches-burglar-his-boxers-print.html"
   ]
  ], 
  "identifier": 13607
 }
]