[
 [
  [
   379622, 
   null, 
   "Ethmi", 
   "It's an email I received.\n \n Now we may have some insight into why President Obama said \"to not jump to conclusions about Nidal Hasan\" and why Congressmen were not briefed before the press leak. With all the data now being collected, many have classified Hasan - who killed and wounded the soldiers and civilians at Ft Hood, Texas - as a Muslim Terrorist. Yet Hasan was selected as an advisor to Obama's homeland Security team. How could this be!\n \n Look on page 29 of the Homeland Security Institute link below. Go to page number 29 of this document, scroll down toward the middle of the page on the Left Column - Nidal Hasan is listed! One would think that in selecting the advisors for our Homeland Security Team that Obama would have had a more extensive background check done on each person.\n \n http://www.gwumc.edu/hspi/old/PTTF_ProceedingsReport_05.19.09.PDF", 
   {
    "post_info": {
     "post_title": "This sheds some light"
    }
   }, 
   null, 
   null, 
   1258872660.0
  ], 
  [
   379629, 
   null, 
   "Iuris", 
   "May I recommend checking the snopes.com: Urban Legends Reference Pages website before going all out with the latest urban legend?\n \n (P.S. - look, I'm typing bigger and bolder than Old Sarge!", 
   {}, 
   379622, 
   null, 
   1258893540.0
  ], 
  [
   379631, 
   null, 
   "Ethmi", 
   "May I recommend checking the snopes.com: Urban Legends Reference Pages website before going all out with the latest urban legend?\n \n (P.S. - look, I'm typing bigger and bolder than Old Sarge!\n\n \n http://www.gwumc.edu/hspi/old/PTTF_ProceedingsReport_05.19.09.PDF\n \n That wasn't an urban legend or a biased right wing source. It was an official Homeland Security paper that included a list of advisors for homeland security, a list in which Nidil Hasan was included on page 29. It's obvious that you didn't even look at it, nor did you even take the time to read the second paragraph of the OP.", 
   {}, 
   379629, 
   null, 
   1258894860.0
  ], 
  [
   379633, 
   null, 
   "iangb", 
   "The relevant Snopes page.\n \n In summary: The true part of the email is that Hasan attended a meeting on the subject of Homeland Security. However, this meeting was a public event, Hasan was not specifically invited (ie he went as a member of the public, not as one of the organisers) and the organisers themselves are a non-partisan university think-tank, with no more ties to Obama than the fact that they probably talk about him a lot.\n \n A second suggestion, to go with Iuris'? Next time you check your FW: emails, beware of confirmation bias.\n \n EDIT: Ethmi posted, somewhat hilariously - quoted here for posterity:\n \nhttp://www.gwumc.edu/hspi/old/PTTF_P...t_05.19.09.PDF\n \n That wasn't an urban legend or a biased right wing source. It was an official Homeland Security paper that included a list of advisors for homeland security, a list in which Nidil Hasan was included on page 29. It's obvious that you didn't even look at it, nor did you even take the time to read the second paragraph of the OP.\n\n \n Ethmi - a third suggestion. When you make a claim implying that you have read a PDF file, actually make sure you've done so. The file is headed with big words saying 'Homeland Security', true - but those words are preceded by 'The George Washington University'. Take your time to look at the second page (the first one to have some textual content) and the very first thing you will read is the following:\n \n About the Institute:\n Founded in 2003, The George Washington University Homeland Security Policy Institute (HSPI) is a nonpartisan &#8220;think and do&#8221; tank\n \n Then, at the bottom of the ninth page in the document, comes the following (bold added by me):\n \n To further develop and vet these priorities, HSPI and the Presidential Transition Task Force hosted a series of public roundtables titled, Thinking Anew &#8211; Security Priorities for the Next Administration, to draw upon the expertise, insights and perspectives of the broader policy community. The roundtables drew significant audiences and featured respected speakers from a variety of relevant arenas, including policymakers; federal, state and local government officials; concerned and involved citizens; recognized think tank experts and academics in international studies; leaders in the NGO community; and media experts steeped in an understanding of new media and behavioral research. Reports of these proceedings follow; a roster of participants and an overview of media coverage is also included at the end of this document.\n \n The document itself dispels the hoax of the email.", 
   {}, 
   379629, 
   null, 
   1258895460.0
  ], 
  [
   379650, 
   null, 
   "OldSarge", 
   "May I recommend checking the snopes.com: Urban Legends Reference Pages website before going all out with the latest urban legend?\n \n (P.S. - look, I'm typing bigger and bolder than Old Sarge!\n\n \n Imitation is the sincerest form of flattery.", 
   {}, 
   379629, 
   null, 
   1258909380.0
  ], 
  [
   379651, 
   null, 
   "Iuris", 
   "Imitation is the sincerest form of flattery.\n\n \n Yes! PLEASE, be FLATTERED!", 
   {}, 
   379650, 
   null, 
   1258909680.0
  ], 
  [
   379653, 
   null, 
   "OldSarge", 
   "Yes! PLEASE, be FLATTERED!\n\n \n I am!emoticon_xlove", 
   {}, 
   379651, 
   null, 
   1258910460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  This sheds some light", 
  "url": "http://www.4forums.com/political/current-events-debates/13616-sheds-some-light.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 13616, 
  "discussion_files": [
   [
    "17199.html", 
    "http://www.4forums.com/political/current-events-debates/13616-sheds-some-light-print.html"
   ]
  ], 
  "identifier": 13616
 }
]