[
 [
  [
   380152, 
   null, 
   "NATO 556", 
   "Congressman Todd Tiahrt : Latest News : Tiahrt to Mayors: Stop Politicizing Fort Hood Deaths\n \n \nWASHINGTON-U.S. Congressman Todd Tiahrt (pronounced TEE-hart), R-Kan., released the following statement in response to heinous accusations from Mayor Bloomberg's political organization Mayors Against Illegal Guns. On Monday the Bloomberg organization paid for a full-page advertisement in the Washington Post assigning blame for the Fort Hood massacre, in part, to firearm policy authored by Tiahrt and approved by Congress since 2002.\n \n \"The mayors who politicized the tragic deaths of those whose lives were taken along with the dozens who sustained injuries at Fort Hood should immediately issue a public apology to the victims and their families,\" said Tiahrt. \"Their use of soldiers' deaths, their smear campaign against me, and their attempt to deceitfully change public policy disgraces their reputations as public servants. Using the Fort Hood massacre to advance a devious ad campaign dishonors the freedoms our men and women in uniform have paid the ultimate sacrifice to protect. Americans everywhere should be outraged and demand that each of these mayors be held accountable.\n \n \"The Tiahrt trace data amendment prevents the release of confidential law enforcement data to the public while making certain it is provided to local, state and federal law enforcement officials for use in criminal investigations. That's why the Fraternal Order of Police, the world's largest organization of sworn law enforcement officers, supports the Tiahrt trace data amendment.\n \n \"Contrary to what Mayors Against Illegal Guns have asserted, the Tiahrt amendment does not affect background check outcomes, does not affect who is permitted to own a firearm, and does not restrict law enforcement officials from accessing and effectively using all available firearm data for criminal investigations. Allowing the federal government to maintain a firearm registry of law-abiding American citizens who have passed a background test will do nothing to prevent terrorist attacks. Retaining a federal registry for 45 days or even 45 years will not make us any safer but will expose which citizens own guns and how many they own - something every violent criminal would like to access.\n \n \"Unfortunately, many opponents of the Tiahrt language, including Mayor Bloomberg, appear to be more interested in lawsuits against firearm manufacturers than about protecting law enforcement officers, the public, and privacy rights of law-abiding citizens who own firearms.\"\n \n For more information about the Tiahrt trace data language, click here.\n\n \n Congressman Todd Tiahrt : Tiahrt Trace Data Amendment : Tiahrt Trace Data Amendment\n \n \nTiahrt Trace Data Amendment\n \n Congressman Tiahrt sponsored an amendment commonly referred to as the Tiahrt amendment (now permanent law) to protect the lives of law enforcement officers, their families, and privacy rights of legal firearm owners who have the right to protect themselves, their families and their property.\n \n Recently, deceitful attacks have been launched against the Tiahrt amendment by liberal organizations seeking to capitalize on the tragic deaths of the Fort Hood massacre. Click here to read Congressman Tiahrt's response to the vicious and attacks.\n Tiahrt Trace Data Amendment\n \n Protecting Those Who Protect Us\n \n BRIEF HISTORY\n In fiscal years 2003, 2004, 2005, 2006, 2007 and 2008 the House Appropriations Committee included language to prevent the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) from publicly disclosing un-redacted firearm trace data and multiple handgun purchase data. This information was and continues to be made available to law enforcement officials.\n \n The Appropriations Trace Data Language, called the Tiahrt Amendment, prevents release of confidential law enforcement data to the public. This information had never been released prior to a 2002 court ruling in a Chicago case. Trial lawyers took the ATF to court on a fishing expedition to gather evidence for lawsuits against the firearms industry, and some data was made public in 2002. Many in the law enforcement community were alarmed this sensitive data had been released.\n \n The ATF and law enforcement groups, including the Fraternal Order of Police (FOP) - the world's largest law enforcement organization of sworn law enforcement officers - oppose public disclosure of this data because it could jeopardize ongoing investigations and endanger officers' lives. They asked Congressman Tiahrt to protect the integrity of trace data in 2003 and have supported retention of the Trace Data Language each year since.\n \n The FY2008 Trace Data Language was included in the actual bill text making it permanent law - no further annual amendment language is needed.\n \n WHAT DOES THE TRACE DATA INFORMATION INCLUDE?\n Firearms trace data includes information such as the agency requesting a gun trace, the location from which the gun was recovered, and the identity of the dealer and original retail buyer.\n \n Multiple handgun sales reports include information such as the buyer's name and address, and the makes, models and serial numbers of handguns purchased.\n \n WHY IS IT A PROBLEM FOR THE ATF TO PUBLICALLY RELEASE THIS INFORMATION?\n ATF and the FOP oppose release of these databases because they contain information (such as names of buyers of traced guns) that could identify officers or informants, and could jeopardize ongoing criminal investigations.\n \n If this information were made public, for example, a suspected gun trafficker targeted by an investigation could search the multiple sales database for names of \"straw purchasers\" he had used to buy handguns, or search the trace database for traces requested on guns he had sold.\n \n In affidavits filed in one case on this subject, senior ATF staff testified to several such scenarios in which investigations could be compromised and the safety of federal agents, local police officers and family members could be threatened.\n \n NEW YORK CITY\n The FOP claims a New York City sting operation by private investigators hired by the City jeopardized multiple investigations in 2006. The U.S. Department of Justice complained to the City of New York in a February 2007 letter about the potential for their actions to \"interrupt or jeopardize ongoing criminal investigations.\"\n \n Current New York City Police Commissioner Ray Kelly supported the policy of not publicly releasing trace data in 2002 when he wrote former U.S. Attorney General John Ashcroft and then in 2003 when he entered into a Memorandum of Understanding with the ATF supporting the policy. However, after New York City Mayor Michael Bloomberg took office, Commissioner Kelly's position reversed.\n \n AGGREGATE STATISTICAL DATA\n The ATF stopped releasing aggregate statistical data in 2000, years before passage of the first Trace Data Amendment offered by Congressman Tiahrt in FY2003. Nothing in any of the Trace Data Amendments prevented such publication of aggregate data. The decision to not release aggregate data was made independently by the ATF.\n \n The FY 2003 and FY2004 Trace Data Language did not address issues pertaining to aggregate statistical data being released; however, in FY2005, Congressman Tiahrt amended the language directing the ATF to resume the publication of the aggregate statistical information that was available to researchers, law enforcement, governments, and the public.\n \n After the ATF refused to release aggregate statistical data, Tiahrt again worked to ensure the public release of this information by amending the Trace Data Language in FY2008 to make it explicitly clear that Congress allows for the release of such data. The FY2008 revisions include bill language to ensure that this practice is allowed. It is now permanent law.\n \n LAW ENFORCEMENT SAFETY\n The FOP and the ATF, as well as individual law enforcement officers, have expressed concern that the release of trace data into the public impairs their job. These are the men and women concerned with bringing criminals to justice, and we should pay heed to their concern - especially as they put their own lives on the line to protect our communities and our families.\n \n The FOP, the world's largest organization of sworn law enforcement officers, with more than 325,000 members, stated in a 2007 letter to the House Appropriations Committee that:\n \n \u0095 \"The FOP has supported this language [Trace Data Language] since the original version was first enacted several years ago because of our concern for the safety of law enforcement officers and the integrity of law enforcement investigations.\"\n \n \u0095 \"According to media reports last year, law enforcement sources cited that as many as 'four cases were compromised, and an additional 14 were put at risk' by private investigators employed by the city [NYC] who acted on the basis of trace data.\"\n \n In multiple meetings with Congressman Tiahrt over the years, ATF directors have unequivocally expressed their belief that the release of trace data for any other reason than a criminal investigation/prosecution puts officers' lives on the line. Director Truscott expressed concern about the breadth of personal information about officers and investigative tools included in trace data reports that would threaten the ability of his agency and local law enforcement agencies to carry out their duties. He also believed that it would expose undercover agents and put them and their families at risk.\n \n SHARING TRACE DATA - CRIMINAL INVESTIGATIONS\n The intent of the Trace Data Language has always been to protect the lives of law enforcement officers and the integrity of law enforcement investigations. The intent of the Trace Data Language was never to prevent the sharing of trace data or other information in a criminal investigation or prosecution.\n \n Brooklyn Judge Weinstein claimed that the FY 2004 Trace Data Language \"could be interpreted to prevent the cooperation of ATF with the courts in amassing evidence in a murder prosecution.\" Congressman Tiahrt worked to ensure that the FY 2005, 2006, 2007 and 2008 language clearly addresses this concern, as well as any concerns about the effect on civil actions such as license revocation proceedings.\n \n In 2007, as a response to concerns from local law enforcement officials, Congressman Tiahrt advocated amending the language for FY2008-which became public law-to make it even clearer that trace data information should always be available to law enforcement officials and prosecutors conducting criminal investigations or prosecutions. This has always been the intent of Congress, and Congressman Tiahrt has worked hard to ensure this intent is accurately reflected in the Trace Data Language.\n \n The FY2008 revision ensures that the language reflects congressional intent that aggregate trace data may be shared between geographic jurisdictions. Though previous language did not prohibit information sharing between local and state law enforcement agencies and prosecutors, this revised language explicitly allows information sharing.\n \n Unfortunately, many opponents of this language appear to be more concerned with flashy trials of gun manufacturers than with justice and protecting the lives of law enforcement officers.\n \n INFORMATION SHARING\n Due to national security concerns, the Trace Data Language was revised in FY2008 to ensure the sharing and exchange of such information among and between federal, state, local or foreign law enforcement agencies or federal, state, or local prosecutors, or national security, intelligence, or counterterrorism officials.\n \n FY2008 LANGUAGE: PERMANENT LAW\n The FY2008 language (current permanent law) was passed by the Democrat-led House and Senate and signed into law as part of the FY08 Omnibus Appropriations Act by President Bush on December 26, 2007.\n \n This Trace Data Language is now permanent law - no annual Appropriations amendments are needed.\n \n The FY2008 language reads as follows:\n \n Provided further, That, beginning in fiscal year 2008 and thereafter, no funds appropriated under this or any other Act may be used to disclose part or all of the contents of the Firearms Trace System database maintained by the National Trace Center of the Bureau of Alcohol, Tobacco, Firearms and Explosives or any information required to be kept by licensees pursuant to section 923(g) of title 18, United States Code, or required to be reported pursuant to paragraphs (3) and (7) of such section 923(g), except to (1) a Federal, State, local, tribal or foreign law enforcement agency, or a Federal, State, or local prosecutor, solely in connection with and for use in a criminal investigation or prosecution, or (2) a Federal agency for a national security or intelligence purpose; and all such data shall be immune from legal process, shall not be subject to subpoena or other discovery, shall be inadmissible in evidence, and shall not be used, relied on, or disclosed in any manner, nor shall testimony or other evidence be permitted based on the data, in a civil action in any State (including the District of Columbia) or Federal court or in an administrative proceeding other than a proceeding commenced by the Bureau of Alcohol, Tobacco, Firearms and Explosives to enforce the provisions of chapter 44 of such title, or a review of such an action or proceeding; except that this proviso shall not be construed to prevent (a) the disclosure of statistical information concerning total production, importation, and exportation by each licensed importer (as defined in section 921(a)(9) of such title) and licensed manufacturer (as defined in section 921(a)(10) of such title), (b) the sharing or exchange of such information among and between Federal, State, local or foreign law enforcement agencies, Federal, State, or local prosecutors, and federal national security, intelligence, or counterterrorism officials, or (c) the publication of previously published annual statistical reports on products regulated by the Bureau of Alcohol, Tobacco, Firearms and Explosives, including total production, importation, and exportation by each licensed importer (as so defined) and licensed manufacturer (as so defined), or statistical aggregate data regarding firearms traffickers and trafficking channels, or firearms misuse, felons, and trafficking investigations. \n \n SETTING THE RECORD STRIGHT ABOUT FIREARMS TRACE DATA\n By Michael J. Sullivan, acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), U.S. Department of Justice\n Monday, April 30, 2007\n \n During the past several weeks, numerous questions and articles have arisen in the media, regarding the ability of the Bureau of Alcohol, Tobacco, Firearms and Explosives to share firearms trace data among members of the law-enforcement community. With the recent tragic events surrounding the senseless criminal use of firearms; I felt the need to clarify this important issue.\n \n Firearms trace data is critically important information developed by ATF to assist state and local law-enforcement in investigating and solving violent crimes. This data tracks the transfer of a firearm from the manufacturer to the gun's first purchaser, and can assist law enforcement in ultimately pinpointing the individual who used the gun to commit a particular crime.\n \n During the investigation of the recent Virginia Tech incident, ATF provided the Virginia State Police (VSP) with trace information that allowed the VSP to determine where and from whom Seung-Hui Cho purchased the two handguns he used in the shootings. Firearms trace information was also used to solve a theft of 22 firearms from a security service in Atlanta that were subsequently purchased by an undercover police officer on the streets of New York.\n \n ATF considers this information law-enforcement-sensitive because it is often the first investigative lead in a case. We treat it no differently than fingerprint matches and other crime-scene information, since disclosure outside of law enforcement can tip off criminals to the investigation, compromise cases and endanger the lives of undercover officers, witnesses and confidential sources.\n \n Our agency routinely shares trace data with state and local law-enforcement agencies in support of investigations within their respective jurisdictions. Once a requesting agency receives law-enforcement-sensitive trace data from ATF, it becomes the agency's data to disseminate and share with other law-enforcement entities as it deems appropriate.\n \n Let me be clear: neither the congressional language nor ATF rules prohibit the sharing of trace data with law enforcement conducting criminal investigations, or place any restrictions on the sharing of trace data with other jurisdictions once it is in the hands of state or local law enforcement. In fact, multi-jurisdictional trace data is also utilized by ATF and shared with fellow law-enforcement agencies to identify firearm-trafficking trends and leads. Additionally, nothing prohibits ATF from releasing our own reports that analyze trace-data trends that could be used by law enforcement.\n \n ATF has a proud tradition of supporting its law-enforcement partners at every level of government. We will continue to provide them with the information they need to protect our communities from individuals who would use firearms to further illegal activity. Congress has recognized ATF's crucial role in that investigative process and has protected our ability to share that sensitive data with law enforcement. The restriction did nothing more than to codify ATF's longstanding policy of sharing trace data with other law-enforcement agencies for the purpose of conducting a criminal investigation.\n \n Our priority will continue to be to release trace data in a manner consistent with our longstanding policy, and to support the over 17,000 federal, state, local and foreign law-enforcement agencies that avail themselves of this crucial tool.\n", 
   {
    "post_info": {
     "post_title": "Tiahrt to Mayors: Stop Politicizing Fort Hood Deaths"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1259180280.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tiahrt to Mayors: Stop Politicizing Fort Hood Deaths", 
  "url": "http://www.4forums.com/political/gun-control-debates/13637-tiahrt-mayors-stop-politicizing-fort-hood-deaths.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13637, 
  "discussion_files": [
   [
    "30762.html", 
    "http://www.4forums.com/political/gun-control-debates/13637-tiahrt-mayors-stop-politicizing-fort-hood-deaths-print.html"
   ]
  ], 
  "identifier": 13637
 }
]