[
 [
  [
   380857, 
   null, 
   "JPSartre12", 
   "Way to go, Commander-in-Chief. It may have taken a second look, but in the end, he did the right thing. emoticon_xgood\n \n \n\n Court sides with Gov't in detainee photo case \n The Associated Press \n Monday, November 30, 2009; 10:16 AM \n \n WASHINGTON -- The Supreme Court has thrown out an appeals court ruling ordering the disclosure of photographs of detainees being abused by their U.S. captors. \n \n In doing so Monday, the high court cited a recent change in federal law that allows the pictures to be withheld. \n \n The justices issued a brief, and expected, order Monday directing the 2nd U.S. Circuit Court of Appeals in New York to take another look at a lawsuit filed by the American Civil Liberties Union to obtain the photos of detainee abuse. President Barack Obama at first didn't oppose the release, but he changed his mind, saying they could whip up anti-American sentiment overseas and endanger U.S. troops. \n \n The administration appealed the matter to the Supreme Court, but also worked with Congress to give Defense Secretary Robert Gates the power to keep from the public all pictures of foreign detainees being abused. \n washingtonpost.com \n", 
   {
    "post_info": {
     "post_title": "Obama-Credit where credit is due"
    }
   }, 
   null, 
   null, 
   1259605980.0
  ], 
  [
   381044, 
   null, 
   "OldSarge", 
   "Way to go, Commander-in-Chief. It may have taken a second look, but in the end, he did the right thing. emoticon_xgood\n\n \n Well even a busted clock is right twice a day. emoticon_wow", 
   {}, 
   380857, 
   null, 
   1259698980.0
  ], 
  [
   381236, 
   null, 
   "JPSartre12", 
   "Well even a busted clock is right twice a day. emoticon_wow\n\n \n Unless you're on military time, that is. ;)", 
   {}, 
   381044, 
   null, 
   1259791380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama-Credit where credit is due", 
  "url": "http://www.4forums.com/political/current-events-debates/13659-obama-credit-where-credit-due.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 13659, 
  "discussion_files": [
   [
    "1370.html", 
    "http://www.4forums.com/political/current-events-debates/13659-obama-credit-where-credit-due-print.html"
   ]
  ], 
  "identifier": 13659
 }
]