[
 [
  [
   380789, 
   null, 
   "Symbiote", 
   "We have discovered that the warming in New Zealand over the past 156 years was indeed man-made, but it had nothing to do with emissions of CO2&#8212;it was created by man-made adjustments of the temperature.\n \n TBR.cc: BREAKING: NZ?s NIWA accused of CRU-style temperature faking\n \n Whoops.\n \n It looks like all the global warming in New Zealand, ever, was a result of manual \"adjustments\".\n \n The creators of New Zealand's warming trend claim that one of their many adjustments was justified, although utterly unscientific, because the temperature sensor was moved to a location that they think (but are not sure) is colder than the previous one. Although this sensor was moved only once, it was adjusted many times.\n \n As for the rest of the adjustments, all the public gets is a \"no comment\".\n \n Meanwhile Phil Jones over at the equally corrupt CRU claims his original data was originally destroyed, so now we have to take his word for it that the warming trends he has identified are genuine.\n \n All in the name of science.", 
   {
    "post_info": {
     "post_title": "NZ climate change fraud"
    }
   }, 
   null, 
   null, 
   1259558880.0
  ], 
  [
   380791, 
   null, 
   "JPSartre12", 
   "We have discovered that the warming in New Zealand over the past 156 years was indeed man-made, but it had nothing to do with emissions of CO2-it was created by man-made adjustments of the temperature.\n \n TBR.cc: BREAKING: NZ?s NIWA accused of CRU-style temperature faking\n \n Whoops.\n \n It looks like all the global warming in New Zealand, ever, was a result of manual \"adjustments\".\n \n The creators of New Zealand's warming trend claim that one of their many adjustments was justified, although utterly unscientific, because the temperature sensor was moved to a location that they think (but are not sure) is colder than the previous one.\n \n As for the rest of the adjustments, all the public gets is a \"no comment\".\n \n Meanwhile Phil Jones over at the equally corrupt CRU claims his original data was originally destroyed, so now we have to take his word for it that the warming trends he has identified are genuine.\n \n All in the name of science.\n\n \n The world's oceans are the largest heatsink on the planet, yet no global warming studies have ever attempted to determine the temperatures of the oceans, except for the superficial surface waters.", 
   {
    "unicode_changes_made": true
   }, 
   380789, 
   null, 
   1259559480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  NZ climate change fraud", 
  "url": "http://www.4forums.com/political/environmental-debates/13657-nz-climate-change-fraud.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 13657, 
  "discussion_files": [
   [
    "31392.html", 
    "http://www.4forums.com/political/environmental-debates/13657-nz-climate-change-fraud-print.html"
   ]
  ], 
  "identifier": 13657
 }
]