[
 [
  [
   381766, 
   null, 
   "gayhumanist", 
   "A positive step towards inclusion and non-discrimination:\n \nPosted on Advocate.com December 07, 2009\n \n \n Bishop Robinson Applauds Lesbian Bishop\n \n By Christopher Mangum\n \n \n \n The Reverend V. Gene Robinson, the first openly gay Episcopal bishop, released a statement on the election of the Reverend Mary Glasspool as assistant bishop of Los Angeles.\n \n \"They [the people of the diocese of Los Angeles] have chosen the two people who, in their minds, and with the guidance of the Holy Spirit, are best suited for this ministry, and one of them happens to be a lesbian,\" wrote Robinson on the New Hampshire Episcopal Diocese website. \"But let us be clear: it is Mary Glasspool's experience, skills and faith which will make her a good bishop, and are the reason for her election.\"\n \n Glasspool, 55, was selected for the position on Sunday. If approved by a group of national church leaders, Glasspool will become the second openly gay bishop for the church. \n \n Currently a Baltimore resident, Glasspool has been with her partner, Becki Sander, since 1988.\n\n Bishop Robinson Applauds Lesbian Bishop | News | Advocate.com", 
   {
    "post_info": {
     "post_title": "Lesbian Bishop"
    }
   }, 
   null, 
   null, 
   1260237120.0
  ], 
  [
   381846, 
   null, 
   "gansao", 
   "What's next? A bishop thats married to a sheep?", 
   {}, 
   381766, 
   null, 
   1260309960.0
  ], 
  [
   381850, 
   null, 
   "smiley", 
   "What's next? A bishop thats married to a sheep?\n\n For that you would need the consent of the sheep, so . . . . er . . . no.", 
   {}, 
   381846, 
   null, 
   1260313860.0
  ], 
  [
   381851, 
   null, 
   "JPSartre12", 
   "A positive step towards inclusion and non-discrimination:\n \n Bishop Robinson Applauds Lesbian Bishop | News | Advocate.com\n\n \n I'd say it's more like an attempt by the Episcopalians to recoup some of their losses. emoticon_rolleyes", 
   {}, 
   381766, 
   null, 
   1260314400.0
  ], 
  [
   381853, 
   null, 
   "gansao", 
   "For that you would need the consent of the sheep, so . . . . er . . . no.\n\n \n You just wait until they are in heat then..er ...yes.\n Anyway if the Moslems dont have to ask permission to slit their throats then a good Christian Bishop should be allowed to xxxx them\n You a bigot?:(", 
   {}, 
   381850, 
   null, 
   1260314640.0
  ], 
  [
   381854, 
   null, 
   "gansao", 
   "Gay sex is prohibited in the Bible. So as this Church ignores this sin why not ignore other sins?\n How about a Bishop who is also a cat burglar or a rapist?", 
   {}, 
   381853, 
   null, 
   1260315000.0
  ], 
  [
   381935, 
   null, 
   "jazyjason", 
   "Gay sex is prohibited in the Bible. So as this Church ignores this sin why not ignore other sins?\n How about a Bishop who is also a cat burglar or a rapist?\n\n \n Oh please... Yet another fundamentalist bit of garbage comparing people to common thieves and people who rape sheep.... I guess it's the only thing you can do when even other Christians can validate the love of two consenting gay people...", 
   {}, 
   381854, 
   null, 
   1260396180.0
  ], 
  [
   381947, 
   null, 
   "gayhumanist", 
   "I'd say it's more like an attempt by the Episcopalians to recoup some of their losses. emoticon_rolleyes\n\n \n They can't do that by taking an anti-gay stand? It's still good news.emoticon_xgood", 
   {}, 
   381851, 
   null, 
   1260398640.0
  ], 
  [
   381949, 
   null, 
   "Jo Bennett", 
   "Gay sex is prohibited in the Bible.\n\n \n Talk about begging the question...\n \n In any case, eating shellfish is too, I don't see an outcry when we appoint a bishop who eats prawns.\n \n In any case, this is nothing to do with the policies of the church. God calls who we wants to be Bishops, it just happens that some of the people called recently have been gay. To me that says that God is less concerned about the person they are in love with than their honesty, their faith, and their devotion.", 
   {}, 
   381854, 
   null, 
   1260399120.0
  ], 
  [
   381954, 
   null, 
   "gansao", 
   "Maybe we should review whether we should eat shellfish, if the bible says we should not.\n \n \n \n but as this church has decided to have gay bishops against Gods well then maybe they should completely ignore the Bible..maybe they could celebrate the inclusion of Gays in their sacrilegious interpretation of Christianity.\n Gay bishops wearing arseless chaps and Lesbian nuns wearing merkins.\n \n \n Ordaining lesbian bishops is sacrilegious... like spitting on the Bible or saying the lords prayer backwards...\n \n Jo... Peter Sutcliffe said that the lord told him to smash prostitutes skulls in with his ball pein hammer.\n The Lord certainly works in mysterious ways...", 
   {}, 
   381949, 
   null, 
   1260401040.0
  ], 
  [
   381956, 
   null, 
   "JPSartre12", 
   "They can't do that by taking an anti-gay stand? It's still good news.emoticon_xgood\n\n \n Not when they're trying to recruit kids that have been exposed to the pro-gay indoctrination mantra from the time they were in kindergarten. emoticon_rolleyes", 
   {}, 
   381947, 
   null, 
   1260401280.0
  ], 
  [
   381964, 
   null, 
   "gayhumanist", 
   "Not when they're trying to recruit kids that have been exposed to the pro-gay indoctrination mantra from the time they were in kindergarten. emoticon_rolleyes\n\n \n I don't see the need for the eyeroll. None of this is bad. It's all good from the standpoint of my original statement for this thread, in favour of inclusion.", 
   {}, 
   381956, 
   null, 
   1260402780.0
  ], 
  [
   381971, 
   null, 
   "Easyrider", 
   "Talk about begging the question...\n \n In any case, eating shellfish is too, I don't see an outcry when we appoint a bishop who eats prawns.\n \n\n \n All foods were declared clean in the NT, Jo. You've been advised of that before. I don't know why you keep pumping that dead dog.\n \n Mark 7:18 (NIV) \"Are you so dull?\" he asked. \"Don't you see that nothing that enters a man from the outside can make him 'unclean'?\n Mark 7:19 (NIV) For it doesn't go into his heart but into his stomach, and then out of his body.\" (In saying this, Jesus declared all foods \"clean.\")\n \n ACTS 10:10 He became hungry and wanted something to eat, and while the meal was being prepared, he fell into a trance. 11 He saw heaven opened and something like a large sheet being let down to earth by its four corners. 12 It contained all kinds of four-footed animals, as well as reptiles of the earth and birds of the air. 13 Then a voice told him, \"Get up, Peter. Kill and eat.\" 14 \"Surely not, Lord!\" Peter replied. \"I have never eaten anything impure or unclean.\" 15 The voice spoke to him a second time, \"Do not call anything impure that God has made clean.\" (NIV)\n \n p.s. Ordaining active homosexuals - male or female - is an abomination. All that's left is the Synagogue of Satan.", 
   {}, 
   381949, 
   null, 
   1260403980.0
  ], 
  [
   381983, 
   null, 
   "iangb", 
   "\"Are you so dull?\" he asked. \"Don't you see that nothing that enters a man from the outside can make him 'unclean'?\n\n Sodomy? Those 'evil demons' which get mentioned every now and then by Archangel?\n \n You can't have it both ways.", 
   {}, 
   381971, 
   null, 
   1260405600.0
  ], 
  [
   382004, 
   null, 
   "jazyjason", 
   "\n \n p.s. Ordaining active homosexuals - male or female - is an abomination. All that's left is the Synagogue of Satan.\n\n \n Gee Easy God forbid that someone who is Gay can witness and preach about Christ... I mean come on it's not about the message of salvation or umm fellowship, or coming together as believers it's all about bigotry and cynical stigmas and excluding based upon prejudice right?\n \n Cause that' exactly what your preaching Easy... And that is exactly why I still say your a hypocrite... You deny the message and light of God to those you deem unworthy in your twisted mind of self righteous indignation...", 
   {}, 
   381971, 
   null, 
   1260408600.0
  ], 
  [
   382140, 
   null, 
   "jitobear", 
   "Gee Easy God forbid that someone who is Gay can witness and preach about Christ... I mean come on it's not about the message of salvation or umm fellowship, or coming together as believers it's all about bigotry and cynical stigmas and excluding based upon prejudice right?\n \n Cause that' exactly what your preaching Easy... And that is exactly why I still say your a hypocrite... You deny the message and light of God to those you deem unworthy in your twisted mind of self righteous indignation...\n\n \n Oh Easy isn't interested in your salvation, silly. He just likes to make sure that we are all keenly aware of how righteous he is and how the rest of us get to burn. He can't wait to haul out the EZ chair and and popcorn on judgement day when he just KNOWS all the poeple he has condemned will burn.", 
   {}, 
   382004, 
   null, 
   1260466680.0
  ], 
  [
   382155, 
   null, 
   "JPSartre12", 
   "I don't see the need for the eyeroll. None of this is bad. It's all good from the standpoint of my original statement for this thread, in favour of inclusion.\n\n \n It's not the function of our schools to indoctrinate our kids. If you think otherwise, then I pray that you never have kids. :xcensored", 
   {}, 
   381964, 
   null, 
   1260475200.0
  ], 
  [
   382215, 
   null, 
   "Easyrider", 
   "Oh Easy isn't interested in your salvation, silly. \n\n \n Besides being spiritually constipated, Jitobear, you're sadly misinformed about this too.\n \n \n\n He just likes to make sure that we are all keenly aware of how righteous he is and how the rest of us get to burn.\n\n \n Now you're being stupid. As the Bible says, \"All (myself included) have sinned and fallen short of the glory of God.\" Except you. You think you're too righteous to need Christ as your Savior, so you've rejected his salvation.\n \n \n\n He can't wait to haul out the EZ chair and and popcorn on judgement day when he just KNOWS all the poeple he has condemned will burn.\n\n \n You won't burn if you and Jazy repent of your pro Sodom and Gomorrah nonsense. If you do burn it will be your own decision, not mine.", 
   {}, 
   382140, 
   null, 
   1260494340.0
  ], 
  [
   382232, 
   null, 
   "gayhumanist", 
   "It's not the function of our schools to indoctrinate our kids. If you think otherwise, then I pray that you never have kids. :xcensored\n\n \n Indoctrinate them to get along, to treat others as they would want to be treated. Indoctrinate to not bully, to not hate, not discriminate. There's such a thing as educating the whole person and preparing them to go out into the world.\n \n \"Indoctrinate\" of course is a loaded word you used. I'm not sure if we can call this indoctrination, but even if we did, it wouldn't be bad. But you know, your side always claims a monopoly on doing right by the children, even when nothing could be further from the truth.", 
   {}, 
   382155, 
   null, 
   1260501960.0
  ], 
  [
   382279, 
   null, 
   "jyoshu", 
   "Indoctrinate them to get along, to treat others as they would want to be treated. Indoctrinate to not bully, to not hate, not discriminate. There's such a thing as educating the whole person and preparing them to go out into the world.\n \n \"Indoctrinate\" of course is a loaded word you used. I'm not sure if we can call this indoctrination, but even if we did, it wouldn't be bad. But you know, your side always claims a monopoly on doing right by the children, even when nothing could be further from the truth.\n\n \n This is an empty discrepancy you're making here. If it's a moralistic teaching, then it's not the school's job. And clearly, making an effort to teach against discrimination, bullying, etc. involves moralistic value judgments. Don't push your morality on kids, even if it happens to be what's currently politically correct. Reading, writing, and 'rithmatic--that's the school's job.", 
   {}, 
   382232, 
   null, 
   1260548220.0
  ], 
  [
   382291, 
   null, 
   "jitobear", 
   "Besides being spiritually constipated, Jitobear, you're sadly misinformed about this too.\n \n \n \n Now you're being stupid. As the Bible says, \"All (myself included) have sinned and fallen short of the glory of God.\" Except you. You think you're too righteous to need Christ as your Savior, so you've rejected his salvation.\n \n \n \n You won't burn if you and Jazy repent of your pro Sodom and Gomorrah nonsense. If you do burn it will be your own decision, not mine.\n\n \n See Jazy - just like I told you. EZ - I think I am going to make you a big batch of cookies to enjoy the show with, too. Right before I burn.", 
   {}, 
   382215, 
   null, 
   1260560100.0
  ], 
  [
   382301, 
   null, 
   "JPSartre12", 
   "Indoctrinate them to get along, to treat others as they would want to be treated. Indoctrinate to not bully, to not hate, not discriminate. There's such a thing as educating the whole person and preparing them to go out into the world.\n \n \"Indoctrinate\" of course is a loaded word you used. I'm not sure if we can call this indoctrination, but even if we did, it wouldn't be bad. But you know, your side always claims a monopoly on doing right by the children, even when nothing could be further from the truth.\n\n \n You mean indoctrinate them in opposition to their religious beliefs? What gives the school the right to do that?:xcensored", 
   {}, 
   382232, 
   null, 
   1260564000.0
  ], 
  [
   382313, 
   null, 
   "jitobear", 
   "You mean indoctrinate them in opposition to their religious beliefs? What gives the school the right to do that?:xcensored\n\n \n Sorry, but if you attend a public school and your religions says its OK to terrorize gay kids, I'm afriad your religion can suck it.\n \n The school is responsible for teaching hundreds of kids from various backgrounds in a safe environment. That means no discrimination, or bullying. It means teaching tolerance and recognizing all kinds of people. What school actually has no business doing is running around pandering to any of their students' religions.", 
   {}, 
   382301, 
   null, 
   1260581880.0
  ], 
  [
   382321, 
   null, 
   "gayhumanist", 
   "This is an empty discrepancy you're making here. If it's a moralistic teaching, then it's not the school's job. And clearly, making an effort to teach against discrimination, bullying, etc. involves moralistic value judgments.\n\n \n It will always require effort to teach and to learn. Please explain what you mean by \"making an effort\", and why that's pertinent.\n \n \nDon't push your morality on kids, even if it happens to be what's currently politically correct. Reading, writing, and 'rithmatic--that's the school's job.\n\n \n There's one of those right-wing loaded terms that are actually meaningless, \"politically correct\". It's this particular teaching against homophobia that you don't like. It's the school's job to serve a diversity of students, from different backgrounds and families and identities. Homophobic bullying, can interfere with a student's learning. As well, social studies classes deal with issues that aren't just numbers and spelling.", 
   {}, 
   382279, 
   null, 
   1260594720.0
  ], 
  [
   382332, 
   null, 
   "jazyjason", 
   "Oh Easy isn't interested in your salvation, silly. He just likes to make sure that we are all keenly aware of how righteous he is and how the rest of us get to burn. He can't wait to haul out the EZ chair and and popcorn on judgement day when he just KNOWS all the poeple he has condemned will burn.\n\n \n Sadly I feel your right... Maybe not in the context you presented, but perhaps in attitude. It seems that his focus on mere carnality and the lack of empathy towards others whom he judges solely upon ignorance and bitter prejudice leads me to believe so.", 
   {}, 
   382140, 
   null, 
   1260612360.0
  ], 
  [
   382333, 
   null, 
   "jazyjason", 
   "\n \n \n You won't burn if you and Jazy repent of your pro Sodom and Gomorrah nonsense. If you do burn it will be your own decision, not mine.\n\n \n Easy the story of Sodom and Gomorrah was not based upon the carnality of homosexuality bur rather upon the in hospitality and prideful selfishness of the city.. \n \n I have repented of my sins and love Jesus and accept His teachings. Like I said earlier it has been a long bitter struggle with self and spirit but I know in my heart Christ affirms the love I have for my partner.", 
   {}, 
   382215, 
   null, 
   1260612480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Lesbian Bishop", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13684-lesbian-bishop.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13684, 
  "discussion_files": [
   [
    "14112.html", 
    "http://www.4forums.com/political/gay-rights-debates/13684-lesbian-bishop-print.html"
   ], 
   [
    "14113.html", 
    "http://www.4forums.com/political/gay-rights-debates/13684-lesbian-bishop-2-print.html"
   ]
  ], 
  "identifier": 13684
 }
]