[
 [
  [
   382292, 
   null, 
   "Superlite27", 
   "I'm a little cornfused....\n \n \n ...I thought U.S. vs. Miller ruled that Miller couldn't own a short barreled shotgun because it wasn't a legitimate firearm used in \"militias\" or the military?\n \n (which says NOTHING about one being required to be a member of a militia to own firearms...sorry, gun grabbers.)\n \n Yet, The National Firearms Act made it illegal for citizens to own fully automatic firearms. (Without a government granted licence and a $200 tax stamp)\n \n According to Miller, I thought the weapons we owned had to have a legitimate military use?\n \n Yet, According to the NFA, we can't own weapons that have a legitimate military use.\n \n Which is it?", 
   {
    "post_info": {
     "post_title": "Which is it? U.S. vs. Miller or NFA?"
    }
   }, 
   null, 
   null, 
   1260561480.0
  ], 
  [
   382299, 
   null, 
   "NATO 556", 
   "Well at the time Miller's shotgun was unregistered and taken across state lines.\n \n But this matter that you speak of is what we commonly refer to as a Catch-22: no matter what option you take, you lose either way.", 
   {}, 
   382292, 
   null, 
   1260563580.0
  ], 
  [
   382538, 
   null, 
   "Rick_OShea", 
   "According to Miller, I thought the weapons we owned had to have a legitimate military use?\n \n Yet, According to the NFA, we can't own weapons that have a legitimate military use.\n \n Which is it?\n\n \n As NATO said the only issue before the Court was the short barreled shotgun with no stamp . . . And the Court only went as far as it needed to go to decide that issue with the very limited evidence presented.\n \n This will be a little long but it will answer your question (but probably will not remove your puzzlement)\n \n First thing to understand, Miller wasn't the end of the discussion it was the genesis of all the mischief in the lower federal courts . . . Some background on Miller first.\n \n There were no briefs filed for Miller and no oral argument was presented to the Supreme Court on his behalf. That's what the Court meant by \"In the absence of any evidence\" and \"it is not within judicial notice\" . . . The Court heard no evidence and they didn't look for any on their own or know of any on their own that showed that a short barreled shotgun has military usefulness.\n \n Miller's language left a large interpretive void in applying the 2nd Amendment and the obvious reading that you see (rendering the ownership of full military weaponry immune to any federal interference) was quite evident to lower federal courts and was used as evidence that the Miller ruling could not be read as establishing a rule for 2nd Amendment interpretation.\n \n Shortly after Miller the 1st Circuit said that the \"Miller rule\" was \"outdated\" because the argument then could be made that any firearm can have military usefulness. If that was so then the protections of the 2nd Amendment are absolute and the government would only be authorized to regulate the ownership of firearms not in current use by the military, \"antiques and curiosities\" is how the court defined them. Thus, the ownership of \"machine guns, trench mortars, anti-tank or anti-aircraft guns\" would be allowed for private citizens. (fn1)\n \n This lower federal court decided that such an interpretation was unacceptable. It is at this point (1942) when 2nd Amendment interpretation in the lower federal courts went off the rails. This decision, Cases v US, is where the militia connection qualification (fn2) was born and another, US v Tot is where the \"state's right\" interpretations (fn3) came into being\n \n NFA-34 issues have not reached SCOTUS since Miller, cases have arisen in the lower federal courts but they have used Cases and Tot (and then the cases citing Cases and Tot) to extinguish those claims of 2nd Amendment protection. Those cases are (were) a group of winos each leaning on the other for support but none able to stand on their own. Heller finally flagged them and threw them out of the pub . . . \n \n Heller though refocused the 2nd Amendment protection spotlight away from Miller's primary military usefulness \"rule\" and brought Miller's \"in common use by the citizen\"(fn4) into the forefront. This has foreclosed \"getting back\" Title II arms at the moment but it will expand the protection sphere of all regular arms owned and used by the citizenry and will, with McDonald invalidate heaps of federal and state and local laws.\n \n It hasn't just been machine gun regulations upheld. . . so much law has been validated by lazily relying on Tot and Cases and their illegitimate progeny. Take NJ for instance; some of the most restrictive ownership and purchase laws in the nation in a state with no RKBA provision in their constitution. The state legislature has taken that to mean anything goes and the state judiciary has rubber stamped those laws by citing the inapplicability of the 2nd on the states and Cases and Tot and their progeny in creating a militia connection dependency. (NJ, (again with no RKBA provision), has not developed a sophisticated legal history of the RKBA under state law, they have just lazily relied on the federal cases; see Burton v. Sills, 248 A.2d 521 (N.J. 1968))\n \n Heller has already rendered Cases and Tot invalid and McDonald will enforce the 2nd Amendment on the states.\n \n Things are going to get very interesting next year emoticon_xgood\n \n ---------------\n \n (fn1) From Cases v. U.S, 131 F.2d 916 (1st Cir. 1942):\n \n \"At any rate the rule of the Miller case, if intended to be comprehensive and complete would seem to be already outdated, in spite of the fact that it was formulated only three and a half years ago, because of the well known fact that in the so called 'Commando Units' some sort of military use seems to have been found for almost any modern lethal weapon. In view of this, if the rule of the Miller case is general and complete, the result would follow that, under present day conditions, the federal government would be empowered only to regulate the possession or use of weapons such as a flintlock musket or a matchlock harquebus. \n \n But to hold that the Second Amendment limits the federal government to regulations concerning only weapons which can be classed as antiques or curiosities,-- almost any other might bear some reasonable relationship to the preservation or efficiency of a well regulated militia unit of the present day,-- is in effect to hold that the limitation of the Second Amendment is absolute. \n \n Another objection to the rule of the Miller case as a full and general statement is that according to it Congress would be prevented by the Second Amendment from regulating the possession or use by private persons not present or prospective members of any military unit, of distinctly military arms, such as machine guns, trench mortars, anti-tank or anti-aircraft guns, even though under the circumstances surrounding such possession or use it would be inconceivable that a private person could have any legitimate reason for having such a weapon. It seems to us unlikely that the framers of the Amendment intended any such result.\"\n \n (paragraph breaks added)\n (fn2) Again from Cases v. U.S, 131 F.2d 916 (1st Cir. 1942):\n \"We therefore turn to the record in the case at bar. From it it appears that on or about August 27, 1941, the appellant received into his possession and carried away ten rounds of ammunition, and that on the evening of August 30 of the same year he went to Annadale's Beach Club on Isla Verde in the municipality of Carolina, Puerto Rico, equipped with a .38 caliber Colt type revolver of Spanish make which, when some one turned out the lights, he used, apparently not wholly without effect, upon another patron of the place who in some way seems to have incurred his displeasure. While the weapon may be capable of military use, or while at least familiarity with it might be regarded as of value in training a person to use a comparable weapon of military type and caliber, still there is no evidence that the appellant was or ever had been a member of any military organization or that his use of the weapon under the circumstances disclosed was in preparation for a military career. \"\n (fn3)From U.S. v. Tot, 131 F.2d 261 (3rd Cir. 1942)\n \"It is abundantly clear . . . that this amendment, unlike those providing for protection of free speech and freedom of religion, was not adopted with individual rights in mind, but as a protection for the States in the maintenance of their militia organizations against possible encroachments by the federal power.\"\n (fn4) From UNITED STATES v. MILLER, 307 U.S. 174 (1939) \n \"The signification attributed to the term Militia appears from the debates in the Convention, the history and legislation of Colonies and States, and the writings of approved commentators. These show plainly enough that the Militia comprised all males physically capable of acting in concert for the common defense. \"A body of citizens enrolled for military discipline.\" And further, that ordinarily, when called for service these men were expected to appear bearing arms supplied by themselves and of the kind in common use at the time.\"", 
   {}, 
   382292, 
   null, 
   1260781440.0
  ], 
  [
   382656, 
   null, 
   "Galileo", 
   " \n Heller though refocused the 2nd Amendment protection spotlight away from Miller's primary military usefulness \"rule\" and brought Miller's \"in common use by the citizen\"(fn4) into the forefront.\n\n So they decided to focus on the dicta in Miller rather than the holding? I wondered how Heller would handle or get around the machine gun question if they decided to go the individual right route especially in light of the civic purpose of the Second Amendment. Heller seemed to me to say that the right is not limited to its civic purpose but can be more limited than its civic purpose.", 
   {}, 
   382538, 
   null, 
   1260868980.0
  ], 
  [
   382662, 
   null, 
   "OldSarge", 
   "So they decided to focus on the dicta in Miller rather than the holding? I wondered how Heller would handle or get around the machine gun question if they decided to go the individual right route especially in light of the civic purpose of the Second Amendment. Heller seemed to me to say that the right is not limited to its civic purpose but can be more limited than its civic purpose.\n\n \n Do you even read what you post. Reread your last sentence.", 
   {}, 
   382656, 
   null, 
   1260884040.0
  ], 
  [
   382682, 
   null, 
   "Rick_OShea", 
   "So they decided to focus on the dicta in Miller rather than the holding?\n\n \n Miller's dicta isn't stating anything but history;\"when called for service these men were expected to appear bearing arms supplied by themselves and of the kind in common use at the time.\" Are you arguing that wasn't the unremarkable, accepted, ordinary circumstance and condition?\n \n If that was the unremarkable, accepted, ordinary circumstance and condition then it would follow that the types of \"arms supplied by themselves and of the kind in common use at the time\" satisfy the people's \"civic purpose\" duty aspect of the object of the 2nd Amendment and thus are protected from federal interference.\n \n \nI wondered how Heller would handle or get around the machine gun question if they decided to go the individual right route especially in light of the civic purpose of the Second Amendment.\n\n \n You say, \"if they decided to go the individual right route\"???? No Supreme Court decision can be interpreted as anything but holding the right protected by the 2nd Amendment as being an individual right. Even the dissents acknowledge this.\n \n \nHeller seemed to me to say that the right is not limited to its civic purpose but can be more limited than its civic purpose.\n\n \n Two things:\n \n 1) The right is pre-existing and is not dependent upon the Constitution or any structure or condition created by the Constitution (i.e., organized militia) (see Cruikshank).\n \n 2) There is no longer any \"civic purpose\" aspect of the 2nd Amendment other than the original, unalterable general militia principle that is an inseparable component of our republic (see Presser).\n \n In light of that one must then understand that the Court is applying Constitutional principle to the present governmental condition of not having any militia law in force. The Dick Act extinguished all remaining state militia powers to organize, train and utilize militia; there is no authority for any entity to organize or train or utilize militia as Art I, § 8 cl's 15 & 16 originally set out. Presently it is only the fundamental republican general militia principle of an armed citizenry which governs these things not any need to satisfy any legal requirement for militia or any other \"civic purpose\" needs.\n \n If anything, (if one wants to nitpick),the fact that Congress has chosen to extinguish all aspects of the militia principle from government, (and replaced it with a national standing army), has in fact extinguished any constitutional interest the national government may legitimately have in the guns I own.", 
   {}, 
   382656, 
   null, 
   1260899880.0
  ], 
  [
   382689, 
   null, 
   "Superlite27", 
   "Thank you, Mr. OShea.\n \n You have very succinctly, and accurately answered my question. I've always thought the contradictions of federal laws governing military and non-military firearms were obvious, yet I was unaware of the actual reason for this. The explanation has always been very obscure. (Possibly meant to be kept this way for a reason?)\n \n By citing the relevant case law, you have done a better job than any at shining the light into my dark and clouded mind. \n \n I wonder, maybe you could elaborate on potential consequences when McDonald gets the nod from SCOTUS? (I would say \"if\" ...but I can't forsee any reason why it wouldn't rule in favor of gun owners)", 
   {}, 
   382682, 
   null, 
   1260908580.0
  ], 
  [
   383067, 
   null, 
   "Galileo", 
   "Miller's dicta isn't stating anything but history;\"when called for service these men were expected to appear bearing arms supplied by themselves and of the kind in common use at the time.\" Are you arguing that wasn't the unremarkable, accepted, ordinary circumstance and condition?\n \n If that was the unremarkable, accepted, ordinary circumstance and condition then it would follow that the types of \"arms supplied by themselves and of the kind in common use at the time\" satisfy the people's \"civic purpose\" duty aspect of the object of the 2nd Amendment and thus are protected from federal interference.\n\n I'm not saying the dicta is wrong. However, Heller interpreted it as a limit on the Constitutional protection of the right which seems to contradict the holding in Miller. \n \n \n\n You say, \"if they decided to go the individual right route\"???? No Supreme Court decision can be interpreted as anything but holding the right protected by the 2nd Amendment as being an individual right. Even the dissents acknowledge this.\n\n In the past, gun activists have labeled scholars who have expressed similar views to the dissents as advocates of the collective rights interpretation. \n \n \n \n\n Two things:\n \n 1) The right is pre-existing and is not dependent upon the Constitution or any structure or condition created by the Constitution (i.e., organized militia) (see Cruikshank).\n\n I did a little research on that. Apparently, Cruikshank was referring to an idea developed earlier in the Slaughterhouse case that fundamentals rights were dependent on state citizenship not national citizenship and thus do not fall under the protection of the \"privileges or immunities\" clause of the 14th Amendment. \n \n \n\n 2) There is no longer any \"civic purpose\" aspect of the 2nd Amendment other than the original, unalterable general militia principle that is an inseparable component of our republic (see Presser).\n \n In light of that one must then understand that the Court is applying Constitutional principle to the present governmental condition of not having any militia law in force. The Dick Act extinguished all remaining state militia powers to organize, train and utilize militia; there is no authority for any entity to organize or train or utilize militia as Art I, § 8 cl's 15 & 16 originally set out. Presently it is only the fundamental republican general militia principle of an armed citizenry which governs these things not any need to satisfy any legal requirement for militia or any other \"civic purpose\" needs.\n \n If anything, (if one wants to nitpick),the fact that Congress has chosen to extinguish all aspects of the militia principle from government, (and replaced it with a national standing army), has in fact extinguished any constitutional interest the national government may legitimately have in the guns I own.\n\n The Founders did not include the conscientious objector clause in the Second Amendment because they feared that Congress would use it to exclude large numbers of people from the militia and thus the nation would be forced to rely on a standing army for its security. I doubt they would have approved of the acts passed by Congress in the early 20th Century that had the same effect that they feared the conscientious objector clause would have. And yet people nowadays claiming to defend the Second Amendment seem not to be bothered by this. They talk about the dangers of tyranny but seem not to realize that active citizen participation in the militia was intended to be one of the main defenses against such a threat.", 
   {}, 
   382682, 
   null, 
   1261121280.0
  ], 
  [
   383078, 
   null, 
   "Doc Jones", 
   "I'm not saying the dicta is wrong. However, Heller interpreted it as a limit on the Constitutional protection of the right which seems to contradict the holding in Miller. \n \n \n In the past, gun activists have labeled scholars who have expressed similar views to the dissents as advocates of the collective rights interpretation. \n \n \n \n I did a little research on that. Apparently, Cruikshank was referring to an idea developed earlier in the Slaughterhouse case that fundamentals rights were dependent on state citizenship not national citizenship and thus do not fall under the protection of the \"privileges or immunities\" clause of the 14th Amendment. \n \n \n The Founders did not include the conscientious objector clause in the Second Amendment because they feared that Congress would use it to exclude large numbers of people from the militia and thus the nation would be forced to rely on a standing army for its security. I doubt they would have approved of the acts passed by Congress in the early 20th Century that had the same effect that they feared the conscientious objector clause would have. And yet people nowadays claiming to defend the Second Amendment seem not to be bothered by this. They talk about the dangers of tyranny but seem not to realize that active citizen participation in the militia was intended to be one of the main defenses against such a threat.\n\n \n Did you say something? Looks like a drowning man thrashing around before going under for the final time :) emoticon_cool", 
   {}, 
   383067, 
   null, 
   1261142040.0
  ], 
  [
   383091, 
   null, 
   "Doc Jones", 
   "38 STATES have filed amicas motion to participate in the oral arguments FOR INCORPORATION of the 2A in the McDonald Case.\n \n +5 others signed onto the original brief supporting incorporation.\n \n Sorry to have upset anyone's Christmas but the rest of us will be trying out new guns this Christmas as a means of celebration :)", 
   {
    "post_info": {
     "post_title": "Attn: All gun rustlers"
    }
   }, 
   383078, 
   null, 
   1261156140.0
  ], 
  [
   383093, 
   null, 
   "OldSarge", 
   "Did you say something? Looks like a drowning man thrashing around before going under for the final time :) emoticon_cool\n\n \n Sounded more to me like a dealer trying to swallow a pound of weed to evade arrest. That's the major problem with historical revisionists. They end up like Bellesilies grubbing away at some Jr College in Buffalo Chip maine.", 
   {}, 
   383078, 
   null, 
   1261160160.0
  ], 
  [
   383164, 
   null, 
   "Rick_OShea", 
   "I'm not saying the dicta is wrong.\n\n \n Uhhh, OK? \n \n So what are you saying about it, that the Court is forbidden to embrace earlier \"dicta\" as the opinion of the Court? \n \n The Court has elevated dissenting opinion to the majority opinion of the Court; (Harlan's dissent in Poe v Ulman* being a perfect example, in support of reproductive rights; Planned Parenthood v. Casey, Moore v. East Cleveland, Roe v. Wade); so, why can't historically, legally and philosophically correct dicta in an earlier majority opinion be affirmed and elevated?\n \n \nHowever, Heller interpreted it as a limit on the Constitutional protection of the right which seems to contradict the holding in Miller. \n\n \n You anti's used to complain that the pro-gunner's arguments forced an interpretation that didn't take \"modern conditions\" into account . . . Scalia crafts a near perfect compromise opinion that honors the object of the 2nd Amendment while taking into account \"modern conditions\" and your side screams, \"judicial activism\" because he didn't say that machine guns are absolutely protected as the Miller holding apparently demands (which I might add, is an interpretation your side had denied for 70 years). \n \n Your side is nothing but intellectually dishonest and constitutionally disingenuous.\n \n \nIn the past, gun activists have labeled scholars who have expressed similar views to the dissents as advocates of the collective rights interpretation. \n\n \n And there is that disingenuousness on display! \n \n The dissenting Justices would never propose the use of a alternate, subjectively interpreted standard of scrutiny to be applied for any other right deemed \"individual\" expressly secured by a provision of the Bill of Rights (Stevens especially and even for rights NOT enumerated). \n \n The dissents refuse to consider the incongruousness of saying that, \"based on our precedent and today's opinions, to which . . . the entire Court subscribes\" the 2nd Amendment, \"protects an \"individual\" right-i.e., one that is separately possessed, and may be separately enforced\" and then argue that, \"When each word in the text is given full effect, the Amendment is most naturally read to secure to the people a right to use and possess arms in conjunction with service in a well-regulated militia.\"\n \n Say what????\n \n The leftist dissenters, while acknowledging the Court's history of unwavering \"individual right\" conclusions, revert to their old statist (but invalid) theories when explaining their unconstitutional, philosophically bankrupt positions.\n \n \nI did a little research on that. Apparently, Cruikshank was referring to an idea developed earlier in the Slaughterhouse case that fundamentals rights were dependent on state citizenship not national citizenship and thus do not fall under the protection of the \"privileges or immunities\" clause of the 14th Amendment.\n\n \n WRONG\n \n And even when you \"research\" these things you use disingenuous resources. Slaughterhouse gutted the privileges or immunities clause of the 14th and rendered it impotent. That excluded any later examination by the Court of the simple historical, legal and philosophical nature of an enumerated right and deciding if it was a general liberty interest that enjoys the 14th's intended protections. The only clause of the 14th that remained actionable after Slaughterhouse was the 14th's due process clause and that demands a case by case examination to apply the 14th's protections (thus the creation of \"selective incorporation\" - which came into being AFTER Cruikshank).\n \n In Cruikshank, the violators of the rights of the Freemen were private citizens (KKK members) not state government actors so the Court held that the 14th (more precisely, the Enforcement Act of 1870) did not create a federal protection envelope against \"fellow citizens\" and for any violations suffered from \"fellow citizens\" the police powers and courts of the states were the correct venue - NOT THE FEDERAL COURTS.\n \n If you want to do some real research on the 14th and the Slaughterhouse Cases and the implications for the 2nd Amendment I recommend you read the Petitioner's Brief (254KB pdf) in McDonald v Chicago. Gura (McDonald's attorney and the winning attorney in Heller) only spends 6 pages on due process, the rest is arguing the multifaceted incorrectness of Slaughterhouse and that it should be directly overturned and thus reinvigorate the privileges or immunities clause of the 14th. It is fascinating read and if the Court agrees, it would be utterly revolutionary for the entire protection sphere for all rights (including abortion and gay rights which is why liberals and progressives are supporting McDonald).\n \n \nThe Founders did not include the conscientious objector clause in the Second Amendment because they feared that Congress would use it to exclude large numbers of people from the militia and thus the nation would be forced to rely on a standing army for its security.\n\n \n Correct, that was one of the reasons the clause was shot down.\n \n \nI doubt they would have approved of the acts passed by Congress in the early 20th Century that had the same effect that they feared the conscientious objector clause would have. And yet people nowadays claiming to defend the Second Amendment seem not to be bothered by this. \n\n \n Come on now, why didn't YOUR SIDE fight those enactments while the \"state's right\" interpretation of the 2nd Amendment was \"true\"? Remember when it was \"true\" that the 2nd Amendment:\n \"unlike those providing for protection of free speech and freedom of religion, was not adopted with individual rights in mind, but as a protection for the States in the maintenance of their militia organizations against possible encroachments by the federal power.\" \n If there was one thing the state's right interpretation should have defeated it was the continual creep of federal preemption of state militia powers that finally culminated in the Dick Act completely exterminating state militia powers. But hey, it was fine with your side that the \"state's right\" interpretation couldn't really be used to do what you guys said it did, just as long as it was your hammer to beat common citizens with that claimed the protections of the 2nd Amendment in the courts of America.\n \n As I said, intellectually dishonest and constitutionally disingenuous.\n \n And now you say it was/is the citizen's responsibility to combat \"encroachments by the federal power\" . . . ????\n \n Add despicable and disgusting as terms to describe your side.\n \n \nThey talk about the dangers of tyranny but seem not to realize that active citizen participation in the militia was intended to be one of the main defenses against such a threat.\n\n \n Take your complaints to the state legislatures and governors; they were the ones who sat idly as their sovereign powers of self defense were stolen. The citizens are doing what they have always done and all that is required of them as citizens; remaining armed and vigilant.\n \n ________________________________________________\n \n \n *Harlan's dissent as cited in the majority opinon in Planned Parenthood v Casey:\n \"Neither the Bill of Rights nor the specific practices of States at the time of the adoption of the Fourteenth Amendment marks the outer limits of the substantive sphere of liberty which the Fourteenth Amendment protects. See U.S. Const., Amdt. 9. As the second Justice Harlan recognized:\n \n [T]he full scope of the liberty guaranteed by the Due Process Clause cannot be found in or limited by the precise terms of the specific guarantees elsewhere provided in the Constitution. This \"liberty\" is not a series of isolated points pricked out in terms of the taking of property; the freedom of speech, press, and religion; the right to keep and bear arms; the freedom from unreasonable searches and seizures; and so on. It is a rational continuum which, broadly speaking, includes a freedom from all substantial arbitrary impositions and purposeless restraints, . . . and which also recognizes, what a reasonable and sensitive judgment must, that certain interests require particularly careful scrutiny of the state needs asserted to justify their abridgment. Poe v. Ullman, supra, 367 U.S., at 543 (dissenting from dismissal on jurisdictional grounds).\"\n \n PLANNED PARENTHOOD OF SOUTHEASTERN PA. v. CASEY, 505 U.S. 833 (1992) (note, no internal quotation marks in original as linked to @ Findlaw)", 
   {
    "unicode_changes_made": true
   }, 
   383067, 
   null, 
   1261256940.0
  ], 
  [
   383178, 
   null, 
   "Bryan", 
   "Galileo, I would abandon this argument. Rick has a very good grasp of this issue. Cruikshank in particular has been long oversold by anti individual rights fans who have ignored the facts of the case which Rick correctly cites. The holding does nothing more than state the 14th. Amendment does not apply to actions by private citizens:\n \n \"The fourteenth amendment prohibits a State from depriving any person of life, liberty, or property, without due process of law; but this adds nothing to the rights of one citizen as against another.\" Cruikshank, 92 U.S. 542 at 554 \n \n Rick, I agree with Gura&#8217;s approach in McDonald. The time has come for a judicial admission of the acknowledged illegitimacy of the Slaughter-House cases. The 14th&#8217;s privileges and immunities clause was IMO intended to totally incorporate the individual rights recognized in the BoR. I&#8217;ve quoted this history before: \n \n Congressman John Bingham of Ohio is acknowledged as the principle author of the 14th. Amendment. This is how he described its purpose:\n \n \"This immortal bill of rights embodied in the Constitution, rested for its execution and enforcement hitherto upon the fidelity of the States. . . .The proposition pending before the House is simply a proposition to arm Congress. . .with the power to enforce this bill of rights as it stands in the Constitution today.\" Congressional Globe, 39th. Congress, 1st. Session, part 1, at p. 1033-34 (February 26, 1866) and p. 1088 (February 28, 1966) [Speeches by Congressman John A. Bingham (Republican-Ohio)] (bold emphasis added)\n \n Senator Jacob Howard (also a member of the joint committee charged with drafting the 14th. Amendment) introduced the legislation to the Senate and described its purpose:\n \n \"To these privileges and immunities should be added the personal rights guaranteed and secured by the first eight amendments of the Constitution; such as the freedom of speech and of the press; the right of the people peaceably to assemble and petition the Government for a redress of grievances, a right appertaining to each and all the people; the right to keep and to bear arms; the right to be exempted from the quartering of soldiers in a house without the consent of the owner; the right to be exempt from unreasonable searches and seizures, and from any search or seizure except by virtue of a warrant issued upon a formal oath or affidavit; the right of an accused person to be informed of the nature of the accusation against him, and his right to be tried by an impartial jury of the vicinage; and also the right to be secure against excessive bail and against cruel and unusual punishments.. . .[A]ll these immunities, privileges, rights, thus guaranteed by the Constitution or recognized by it, are secured to the citizens solely as a citizen of the United States and as a party in their courts. They do not operate in the slightest degree as a restraint or prohibition upon State egislation. . . .The great object of the first section of this amendment is, therefore, to restrain the power of the States and compel them at all times to respect these great fundamental guarantees.\" Congressional Globe, 39th. Congress, 1st. Session, part 3, p. 2765 (May 23, 1866) [Speech of Senator Jacob M. Howard (Republican-Michigan)] (bold emphasis added)(Note also this quote was cited by Justice Black in his concurring opinion arguing for a total incorporation reading of the 14th in Duncan v. LOUISIANA, 391 U.S. 145, 167 (1968)) \n \n Note also that:\n \n \"In the entire Senate debate on the Fourteenth Amendment, running from May 23 to June 8, not a single senator challenged Senator Howard's declaration that Section 1 made the first eight amendments enforceable against the states.\" Irving Bryant, The Bill of Rights, p. 337 (1965). (bold emphasis added)(Section I contains the P&I, due process, and equal protection clauses)\n \n Therefore, there can be no legitimate doubt that those which drafted this amendment intended the P&I clause to have this scope and effect&#8212;despite Slaughter-House&#8217;s incorrect assertion to the contrary. \n \n SCOTUS has already all but gutted Slaughter-House&#8217;s refusal to incorporate with the P&I clause by using the Due Process clause to incorporate nearly all the rights in the BoR. However, IMO the process of selective incorporation through the due process clause is just as illegitimate as the holding in Slaughter-House. The 14th. was clearly designed by Congress and the people who ultimately ratified it to incorporate each and every one of the first 8 amendments in the BoR. SCOTUS&#8217; selective incorporation doctrine is in effect a judicial abrogation of the Amendment&#8212;whereby SCOTUS unilaterally declares that it alone has the authority to decide, on an individual basis, which rights are really important enough to be incorporated&#8212;despite what Congress and the people did in amending the national charter. \n \n Here, I think, is where the majority&#8217;s opinion in Heller can be used to support Gura&#8217;s argument for a true reading (total incorporation of the BoR) of the P&I clause by using these two arguments--(1) it was the scope intended by those who passed it, and (2) the balancing of the decision whether or not to totally incorporate the BoR with the P&I clause has already been made by the people who passed and ratified the amendment. The majority in Heller has already made two very similar arguments against Breyer&#8217;s illegitimate &#8220;only if the judge thinks it&#8217;s important enough to still have the right&#8221; test: \n \n \"JUSTICE BREYER moves on to make a broad jurisprudential point: He criticizes us for declining to establish a level of scrutiny for evaluating Second Amendment restrictions. He proposes, explicitly at least, none of the traditionally expressed levels (strict scrutiny, intermediate scrutiny, rational basis), but rather a judge-empowering &#8220;interestbalancing inquiry&#8221; that &#8220;asks whether the statute burdens a protected interest in a way or to an extent that is out of proportion to the statute&#8217;s salutary effects upon other important governmental interests.&#8221; Post, at 10. After an exhaustive discussion of the arguments for and against gun control, JUSTICE BREYER arrives at his interestbalanced answer: because handgun violence is a problem, because the law is limited to an urban area, and because there were somewhat similar restrictions in the founding period (a false proposition that we have already discussed), the interest-balancing inquiry results in the constitutionality of the handgun ban. QED. \n We know of no other enumerated constitutional right whose core protection has been subjected to a freestanding &#8220;interest-balancing&#8221; approach. The very enumeration of the right takes out of the hands of government&#8212;even the Third Branch of Government&#8212;the power to decide on a case-by-case basis whether the right is really worth insisting upon. A constitutional guarantee subject to future judges&#8217; assessments of its usefulness is no constitutional guarantee at all. Constitutional rights are enshrined with the scope they were understood to have when the people adopted them, whether or not future legislatures or (yes) even future judges think that scope too broad. We would not apply an &#8220;interest-balancing&#8221; approach to the prohibition of a peaceful neo-Nazi march through Skokie. See National Socialist Party of America v. Skokie, 432 U. S. 43 (1977) (per curiam). The First Amendment contains the freedom-of-speech guarantee that the people ratified, which included exceptions for obscenity, libel, and disclosure of state secrets, but not for the expression of extremely unpopular and wrong-headed views. The Second Amendment is no different. Like the First, it is the very product of an interest-balancing by the people&#8212;which JUSTICE BREYER would now conduct for them anew. And whatever else it leaves to future evaluation, it surely elevates above all other interests the right of law-abiding, responsible citizens to use arms in defense of hearth and home.\" District Of Columbia v. Heller, 554 U.S. ___ 07290, 62-63 (2008) (bold emphasis added)\n \n SCOTUS could side-step Gura&#8217;s P&I argument entirely and &#8220;selectively incorporate&#8221; the 2nd. Amendment, but I would prefer incorporation which also overturned Slaughter-House and revitalized the P&I clause by reading it as it was intended to be.\n \n In any event, we still need an infringement test, which I have long suggested should be strict scrutiny&#8212;and which I still hold out hope for. The language I quoted above compares by analogy the 2nd. Amendment RKBA with other fundamental rights (and may be the beginning of a consensus for strict scrutiny???)&#8212;and the majority has IMO already indicated abandonment of the near-anything-goes rational relation test:\n \n \"JUSTICE BREYER correctly notes that this law, like almost all laws, would pass rational-basis scrutiny. Post, at 8. But rational-basis scrutiny is a mode of analysis we have used when evaluating laws under constitutional commands that are themselves prohibitions on irrational laws. See, e.g., Engquist v. Oregon Dept. of Agriculture, 553 U. S. ___, ___ (2008) (slip op., at 9&#8211;10). In those cases, &#8220;rational basis&#8221;is not just the standard of scrutiny, but the very substance of the constitutional guarantee. Obviously, the same test could not be used to evaluate the extent to which a legislature may regulate a specific, enumerated right, be it the freedom of speech, the guarantee against double jeopardy, the right to counsel, or the right to keep and bear arms. See United States v. Carolene Products Co., 304 U. S. 144, 152, n. 4 (1938) (&#8220;There may be narrower scope for operation of the presumption of constitutionality [i.e., narrower than that provided by rational-basis review] when legislation appears on its face to be within a specific prohibition of the Constitution, such as those of the first ten amendments. . .&#8221;). If all that was required to overcome the right to keep and bear arms was a rational basis, the Second Amendment would be redundant with the separate constitutional prohibitions on irrational laws, and would have no effect.\" \n Heller, 554 U.S. ___ 07290, 56 (2008) (Footnote 27 at p. 64)\n \n ---\n \n &#8220;As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms.&#8221; Tench Coxe, explaining the purpose of the 2nd. Amendment in his &#8220;Remarks on the First Part of the Amendments to the Federal Constitution.&#8221; Published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1.", 
   {
    "post_info": {
     "post_title": "I'm with Rick on this one"
    }
   }, 
   383164, 
   null, 
   1261292160.0
  ], 
  [
   383341, 
   null, 
   "Galileo", 
   "Uhhh, OK? \n \n So what are you saying about it, that the Court is forbidden to embrace earlier \"dicta\" as the opinion of the Court? \n \n The Court has elevated dissenting opinion to the majority opinion of the Court; (Harlan's dissent in Poe v Ulman* being a perfect example, in support of reproductive rights; Planned Parenthood v. Casey, Moore v. East Cleveland, Roe v. Wade); so, why can't historically, legally and philosophically correct dicta in an earlier majority opinion be affirmed and elevated?\n \n You anti's used to complain that the pro-gunner's arguments forced an interpretation that didn't take \"modern conditions\" into account . . . Scalia crafts a near perfect compromise opinion that honors the object of the 2nd Amendment while taking into account \"modern conditions\" and your side screams, \"judicial activism\" because he didn't say that machine guns are absolutely protected as the Miller holding apparently demands (which I might add, is an interpretation your side had denied for 70 years). \n \n Your side is nothing but intellectually dishonest and constitutionally disingenuous.\n\n I didn't say it was wrong to embrace earlier Supreme Court dicta. What I really was questioning was their interpretation of the dicta- they interpreted it as some kind of limit which would seem to contradict the holding in that ruling. Also, I'm not the spokesperson for \"my side\" so what I say doesn't necessarily show any inconsistency on my side's part. \n \n \n \n\n WRONG\n \n And even when you \"research\" these things you use disingenuous resources. Slaughterhouse gutted the privileges or immunities clause of the 14th and rendered it impotent. That excluded any later examination by the Court of the simple historical, legal and philosophical nature of an enumerated right and deciding if it was a general liberty interest that enjoys the 14th's intended protections. The only clause of the 14th that remained actionable after Slaughterhouse was the 14th's due process clause and that demands a case by case examination to apply the 14th's protections (thus the creation of \"selective incorporation\" - which came into being AFTER Cruikshank).\n \n In Cruikshank, the violators of the rights of the Freemen were private citizens (KKK members) not state government actors so the Court held that the 14th (more precisely, the Enforcement Act of 1870) did not create a federal protection envelope against \"fellow citizens\" and for any violations suffered from \"fellow citizens\" the police powers and courts of the states were the correct venue - NOT THE FEDERAL COURTS.\n \n If you want to do some real research on the 14th and the Slaughterhouse Cases and the implications for the 2nd Amendment I recommend you read the Petitioner's Brief (254KB pdf) in McDonald v Chicago. Gura (McDonald's attorney and the winning attorney in Heller) only spends 6 pages on due process, the rest is arguing the multifaceted incorrectness of Slaughterhouse and that it should be directly overturned and thus reinvigorate the privileges or immunities clause of the 14th. It is fascinating read and if the Court agrees, it would be utterly revolutionary for the entire protection sphere for all rights (including abortion and gay rights which is why liberals and progressives are supporting McDonald).\n\n \n Didn't the Enforcement Act of 1870 make it illegal for private citizens such as those in the KKK to conspire to take away or interfere with the rights of American citizens under the US Constitution?\n \n \n \n\n Come on now, why didn't YOUR SIDE fight those enactments while the \"state's right\" interpretation of the 2nd Amendment was \"true\"? Remember when it was \"true\" that the 2nd Amendment:\n \n\n Since my side isn't really pro-Second Amendment I wouldn't really expect them to fight such enactments.", 
   {}, 
   383164, 
   null, 
   1261453920.0
  ], 
  [
   383342, 
   null, 
   "NATO 556", 
   "Didn't the Enforcement Act of 1870 make it illegal for private citizens such as those in the KKK to conspire to take away or interfere with the rights of American citizens under the US Constitution?\n\n \n It might have at one point, until United States V Harris came about and gutted the act of its protections.", 
   {}, 
   383341, 
   null, 
   1261454760.0
  ], 
  [
   383390, 
   null, 
   "Galileo", 
   "\n WRONG\n \n And even when you \"research\" these things you use disingenuous resources. Slaughterhouse gutted the privileges or immunities clause of the 14th and rendered it impotent. That excluded any later examination by the Court of the simple historical, legal and philosophical nature of an enumerated right and deciding if it was a general liberty interest that enjoys the 14th's intended protections. The only clause of the 14th that remained actionable after Slaughterhouse was the 14th's due process clause and that demands a case by case examination to apply the 14th's protections (thus the creation of \"selective incorporation\" - which came into being AFTER Cruikshank).\n \n In Cruikshank, the violators of the rights of the Freemen were private citizens (KKK members) not state government actors so the Court held that the 14th (more precisely, the Enforcement Act of 1870) did not create a federal protection envelope against \"fellow citizens\" and for any violations suffered from \"fellow citizens\" the police powers and courts of the states were the correct venue - NOT THE FEDERAL COURTS.\n \n If you want to do some real research on the 14th and the Slaughterhouse Cases and the implications for the 2nd Amendment I recommend you read the Petitioner's Brief (254KB pdf) in McDonald v Chicago. Gura (McDonald's attorney and the winning attorney in Heller) only spends 6 pages on due process, the rest is arguing the multifaceted incorrectness of Slaughterhouse and that it should be directly overturned and thus reinvigorate the privileges or immunities clause of the 14th. It is fascinating read and if the Court agrees, it would be utterly revolutionary for the entire protection sphere for all rights (including abortion and gay rights which is why liberals and progressives are supporting McDonald).\n\n Now that I've had more time to consider the issue I will ask this-\n So if Cruikshank's denial that the right to bear arms was a right of national citizenship had no basis in the Slaughterhouse case which made a similar claim about fundamental rights then what did Cruikshank base it on? You've claimed I'm wrong but I don't see any clear explanation or evidence to support this.", 
   {}, 
   383164, 
   null, 
   1261522500.0
  ], 
  [
   383395, 
   null, 
   "Doc Jones", 
   "Now that I've had more time to consider the issue I will ask this-\n So if Cruikshank's denial that the right to bear arms was a right of national citizenship had no basis in the Slaughterhouse case which made a similar claim about fundamental rights then what did Cruikshank base it on? You've claimed I'm wrong but I don't see any clear explanation or evidence to support this.\n\n \n Title and Jurisdiction! It is that simple.", 
   {}, 
   383390, 
   null, 
   1261528560.0
  ], 
  [
   383397, 
   null, 
   "Doc Jones", 
   "Now that I've had more time to consider the issue I will ask this-\n So if Cruikshank's denial that the right to bear arms was a right of national citizenship had no basis in the Slaughterhouse case which made a similar claim about fundamental rights then what did Cruikshank base it on? You've claimed I'm wrong but I don't see any clear explanation or evidence to support this.\n\n \n Rick gave you about 5 cases explaining the court's concept. I will add Morrison, Lopez, Castillio, and Roe v. Wade.\n \n Of all the cases mentioned, Roe v Wade was the only case that came close to implying P & I.\n \n Reynold's v. U.S. all were subrogated by individual actors governed by State claims and could not be made standing in federal courts since there were no 'state actors' but individual state citizens which was so because there was no Federal Due Process involved but priviledges and immunities which had been gutted in the Slaughter House cases. There, all better now? \n \n Morrison for instance involved a rape case at college and sought to bring her claims to Federal Court under title IX of the Federal Jurisdiction. SCOTUS denied her standing issue and returned it to the State Court to seek relief because no State actors were involved in the incident.\n \n Lopez was an attempt by the Federal Government to grab power under the Interstate Commerce Clause to regulate guns on schoolgrounds. It failed also because no State Actors were involved, SCOTUS nixed Federal Claims of jurisdiction under the Interstate Commerce plea just as it did with Morrison\n \n Is this really too difficult for you? You seem to think title and jurisdiction is too great a barrier to enforce in this Republic?", 
   {}, 
   383395, 
   null, 
   1261529400.0
  ], 
  [
   383533, 
   null, 
   "Galileo", 
   "Rick gave you about 5 cases explaining the court's concept. I will add Morrison, Lopez, Castillio, and Roe v. Wade.\n \n Of all the cases mentioned, Roe v Wade was the only case that came close to implying P & I.\n \n Reynold's v. U.S. all were subrogated by individual actors governed by State claims and could not be made standing in federal courts since there were no 'state actors' but individual state citizens which was so because there was no Federal Due Process involved but priviledges and immunities which had been gutted in the Slaughter House cases. There, all better now? \n \n Morrison for instance involved a rape case at college and sought to bring her claims to Federal Court under title IX of the Federal Jurisdiction. SCOTUS denied her standing issue and returned it to the State Court to seek relief because no State actors were involved in the incident.\n \n Lopez was an attempt by the Federal Government to grab power under the Interstate Commerce Clause to regulate guns on schoolgrounds. It failed also because no State Actors were involved, SCOTUS nixed Federal Claims of jurisdiction under the Interstate Commerce plea just as it did with Morrison\n \n Is this really too difficult for you? You seem to think title and jurisdiction is too great a barrier to enforce in this Republic?\n\n You seem more concerned with impressing and baffling people with your legal knowledge than answering a simple question. Those cases all came after Cruikshank so I don't see how they address my question about the basis for what was brought up about Cruikshank.", 
   {}, 
   383397, 
   null, 
   1261700940.0
  ], 
  [
   383547, 
   null, 
   "OldSarge", 
   "You seem more concerned with impressing and baffling people with your legal knowledge than answering a simple question. Those cases all came after Cruikshank so I don't see how they address my question about the basis for what was brought up about Cruikshank.\n\n \n Keep working at it I'm sure it will come to you after some study.", 
   {}, 
   383533, 
   null, 
   1261714080.0
  ], 
  [
   383581, 
   null, 
   "Doc Jones", 
   "You seem more concerned with impressing and baffling people with your legal knowledge than answering a simple question\n. \n \n I did answer simply, NO TITLE, NO JURISDICTION. The only powers congress has is their claim under interstate commerce. The court ruled it was a non economic activity and no State actors and promptly booted it out of court! Any court must substantiate a claim to have standing. The court must declare their Jurisdiction and Title to accept a case, any case. \n \n \nThose cases all came after Cruikshank so I don't see how they address my question about the basis for what was brought up about Cruikshank.\n\n \n Rick and Bryan both answered your question about Cruikshank. It was a simple answer as was mine. Maybe you should make a NEW YEAR resolution to get an education and learn to read? and write :) I believe Bryan suggested you abandon your false innuendo and his agreement with Mr. O'Sheay's take on the outcome. Why did you ignore their advice? You are like the energizer bunny, going the wrong way but just keep going and going because you dislike the ruling. TOUGH! You didn't ask a question about the \"basis for what was brought up about Cruikshank\". What you were seeking is support for your thesis and got a thumbs down. You were politely hanged but didn't have the capacity to understand a simple answer.", 
   {}, 
   383533, 
   null, 
   1261757520.0
  ], 
  [
   383593, 
   null, 
   "Doc Jones", 
   "You seem more concerned with impressing and baffling people with your legal knowledge than answering a simple question. Those cases all came after Cruikshank so I don't see how they address my question about the basis for what was brought up about Cruikshank.\n\n \n You can go all the way back to Marbury vs. Madison IF you want to, the principle hasn't changed. Each branch of government has enumerated powers. Congress has their powers enumerated in Article 1, section 8. The Court used it's enumerated power to uphold the Constitution and said congress does not have authority ie. Jurisdiction and Title to expand federal power over those enumerated in the Constitution, Article 1, section 8. You can beg, plead and lie yourself to death and Congress still will not have the power to pass the gun grabbing laws like your ilk would like. This is a Republic and no one is above the law, the Constitution.\n \n Each branch of government, the Congress, the Courts and the Executive have their duties enumerated in the Constitution. When they presume to be tyrants and immune to the law, the other branch beats them down. Check and balance. When all else fails and a tyrant emerges, the Constitution put the ultimate check in the hands of the people. You don't seem to hanker to that final option that is to always remain in \"the hands of the people\"?", 
   {}, 
   383533, 
   null, 
   1261766820.0
  ], 
  [
   383596, 
   null, 
   "Rick_OShea", 
   "I didn't say it was wrong to embrace earlier Supreme Court dicta. What I really was questioning was their interpretation of the dicta- they interpreted it as some kind of limit which would seem to contradict the holding in that ruling.\n\n \n Well, any decision that falls short of ruling that the 2nd Amendment's protections of the arms of the private citizen is absolute and the federal government is forbidden to write any laws impacting them . . . is \"some kind of limit.\" \n \n As \"limits\" go this isn't a bad one as it re-re-re-affirmed principles that had always been assumed to exist in previous SCOTUS decisions but were perverted and morphed into meaninglessness by the lower federal courts. \n \n It is telling that some express shock that the 2nd Amendment can be said to protect the arms possessed and in common use by the citizen; it shows just how deep the Tot perversion has been embedded, that people still read the 2nd Amendment as a permission slip for the citizen.\n \n Scalia had a tough job . . . He needed to apply the principles of the Constitution that endorses and embraces an armed citizenry (\"undoubtedly true that all citizens\" is how Presser phrased it) to the modern legal setting in which there is no legal means to activate, train or control the armed citizenry (the unorganized militia) into an organized, government controlled militia. \n \n The right to arms has always existed separately from the \"perpetuate the militia\" object of the 2nd Amendment and it continues to exist in the vacuum created by the complete preemption (and then extinguishing) of militia powers by the federal government.\n \n \nAlso, I'm not the spokesperson for \"my side\" so what I say doesn't necessarily show any inconsistency on my side's part. \n \n\n \n It was just a \"continuity of argument\" question. I have been doing this on-line debate of gun control / rights since 1993. The anti-gun rights side presents certain arguments that are legitimately assigned to that \"side\" of the debate. \n \n I think Scalia's opinion in Heller is a commendable attempt to balance fundamental constitutional principle with modern conditions and realities. If, in illuminating fundamental constitutional principles in modern times the Court creates new boundaries then that is a reality that we must accept. Certainly a \"like it or lump it\" attitude would be coming from you in your posts if Stevens or Breyer got to write the Heller majority opinion right?\n \n What precisely is your objection to the \"limit\" Scalia has placed on the right secured by the 2nd Amendment? Is it that it would affirm laws restricting \"dangerous and unusual\" weapons or that it will invalidate wide swaths of laws that are on the wish lists of gun-grabbers?\n \n \nDidn't the Enforcement Act of 1870 make it illegal for private citizens such as those in the KKK to conspire to take away or interfere with the rights of American citizens under the US Constitution?\n\n \n As a legislative act of Congress it can not alter the Constitution; in this case the 14th Amendment. The Enforcement Act of 1870, even if it was intended to apply to private individuals the law is bound by the words of the Constitutional article it is intended to enforce. See §5 of the 14th Amendment; \"The Congress shall have power to enforce, by appropriate legislation, the provisions of this article.\" That section does not permit altering the Article's scope. In this case the 14th expressly says \"nor shall any State deprive . . .\" and thus excludes rights deprivations caused by private actors.\n \n It is a unintended circumstance of the Congressional act of disbanding state militias that the KKK surged in it's role of oppressors of Black citizens. By disbanding the state militias as the enforcers of discriminatory laws, Congress effectively extinguished all federal government interest in the protection of rights of the Freemen. \n \n That was essentially the holding of Cruikshank.\n \n \nSince my side isn't really pro-Second Amendment I wouldn't really expect them to fight such enactments.\n\n \n Again, just a rhetorical question centered on the [lack of] continuity of argument by the anti-gun side (and by extension, you). \n \n The embraced anti-gun rights interpretation of the 2nd was that it was a provision that had but one function and intent, to protect the \"state right\" to organize and control their militia from federal interference.\n \n Now you are shoving responsibility for the elimination of state militia powers on gun rights supporters like it was our duty to preserve those powers:\n I doubt [the Founders] would have approved of the acts passed by Congress in the early 20th Century that had the same effect that they feared the conscientious objector clause would have. And yet people nowadays claiming to defend the Second Amendment seem not to be bothered by this. They talk about the dangers of tyranny but seem not to realize that active citizen participation in the militia was intended to be one of the main defenses against such a threat.\n\n Jeez, it was all we gun rights advocates could do when your interpretation was dominant to keep you from forcibly disarming us . . . Now you argue we should have instead been concentrating on protecting the state militia powers that your side said was the only function of the 2nd Amendment?\n \n That line of inquiry shows is that you have no allegiance to or affinity for the Constitution; you are only serving a political agenda focused on US civilian/citizen disarmament and will spew any statement -no matter how inconsistent- to advance that agenda.", 
   {}, 
   383390, 
   null, 
   1261771020.0
  ], 
  [
   384147, 
   null, 
   "Galileo", 
   "Well, any decision that falls short of ruling that the 2nd Amendment's protections of the arms of the private citizen is absolute and the federal government is forbidden to write any laws impacting them . . . is \"some kind of limit.\" \n \n As \"limits\" go this isn't a bad one as it re-re-re-affirmed principles that had always been assumed to exist in previous SCOTUS decisions but were perverted and morphed into meaninglessness by the lower federal courts. \n \n It is telling that some express shock that the 2nd Amendment can be said to protect the arms possessed and in common use by the citizen; it shows just how deep the Tot perversion has been embedded, that people still read the 2nd Amendment as a permission slip for the citizen.\n \n Scalia had a tough job . . . He needed to apply the principles of the Constitution that endorses and embraces an armed citizenry (\"undoubtedly true that all citizens\" is how Presser phrased it) to the modern legal setting in which there is no legal means to activate, train or control the armed citizenry (the unorganized militia) into an organized, government controlled militia. \n \n The right to arms has always existed separately from the \"perpetuate the militia\" object of the 2nd Amendment and it continues to exist in the vacuum created by the complete preemption (and then extinguishing) of militia powers by the federal government.\n \n It was just a \"continuity of argument\" question. I have been doing this on-line debate of gun control / rights since 1993. The anti-gun rights side presents certain arguments that are legitimately assigned to that \"side\" of the debate. \n \n I think Scalia's opinion in Heller is a commendable attempt to balance fundamental constitutional principle with modern conditions and realities. If, in illuminating fundamental constitutional principles in modern times the Court creates new boundaries then that is a reality that we must accept. Certainly a \"like it or lump it\" attitude would be coming from you in your posts if Stevens or Breyer got to write the Heller majority opinion right?\n \n What precisely is your objection to the \"limit\" Scalia has placed on the right secured by the 2nd Amendment? Is it that it would affirm laws restricting \"dangerous and unusual\" weapons or that it will invalidate wide swaths of laws that are on the wish lists of gun-grabbers?\n\n My objection is simple- I don't see any historical basis or textual basis for such a limit. Furthermore, I find it quite odd that people such as yourself who are so insistent that the preamble of the Second Amendment does not determine the scope of the protection of the right but so willingly embrace a limitation that is not even found in the text of the Second Amendment. This all began because I merely commented on Heller's decision to focus on the dicta instead of the holding in the Miller decision. You couldn't simply respond by saying if you thought I was correct or not but were very determined to spin what I said into some kind of attack on your opposition. Enough.\n \n \n \n\n Again, just a rhetorical question centered on the [lack of] continuity of argument by the anti-gun side (and by extension, you).\n \n The embraced anti-gun rights interpretation of the 2nd was that it was a provision that had but one function and intent, to protect the \"state right\" to organize and control their militia from federal interference.\n \n Now you are shoving responsibility for the elimination of state militia powers on gun rights supporters like it was our duty to preserve those powers\n \n Jeez, it was all we gun rights advocates could do when your interpretation was dominant to keep you from forcibly disarming us . . . Now you argue we should have instead been concentrating on protecting the state militia powers that your side said was the only function of the 2nd Amendment?\n \n That line of inquiry shows is that you have no allegiance to or affinity for the Constitution; you are only serving a political agenda focused on US civilian/citizen disarmament and will spew any statement -no matter how inconsistent- to advance that agenda.\n\n More ad hominem arguments and attempts to pigeonhole your opposition. I didn't say it was the duty of your side to preserve the old militia laws but merely commented how odd it was coming from people who so loudly proclaim that the Second Amendment is a protection against tyranny. Shall I bring up that quote again from Joseph Story who reminds us of the importance of a well regulated militia?", 
   {}, 
   383596, 
   null, 
   1262246460.0
  ], 
  [
   384161, 
   null, 
   "Rick_OShea", 
   "My objection is simple- I don't see any historical basis or textual basis for such a limit.\n\n \n I equate the \"limit\" that you speak of as the Court saying that the 1st Amendment's protections extends not only to political speech but also the expression of one's sentiments on all issues, public and private . . . \n \n Does it occur to you the Court is discussing a near absolute protection of all firearms from federal oversight?\n \n The Court is discussing not what the citizen is allowed to possess but what the government is allowed to dictate upon -- it is discussing the IMMUNITY such weapons enjoy which is tied directly to the complete silence in the Constitution of any grant of power for government to have even a shred of interest in the personal arms of the private citizen.\n \n As rights and liberty go, you can \"limit\" me like that all you like . . . \n \n \nFurthermore, I find it quite odd that people such as yourself who are so insistent that the preamble of the Second Amendment does not determine the scope of the protection of the right but so willingly embrace a limitation that is not even found in the text of the Second Amendment.\n\n \n Stop reading the Amendment like a permission slip for the citizen. Whatever \"limits\" are affirmed by the Court will be determined by the application of unchanging constitutional principle of general militia to the legal realities of today in which the structure to activate, organize and train the citizenry has been extinguished. Even though the people can not serve in an organized fashion does not diminish their original, sovereign duty as the final arbiters of legitimate government and the possessors of the right to consent to government (and rescind that consent, with violence if necessary).\n \n \nThis all began because I merely commented on Heller's decision to focus on the dicta instead of the holding in the Miller decision. You couldn't simply respond by saying if you thought I was correct or not but were very determined to spin what I said into some kind of attack on your opposition. Enough.\n\n \n Yeah, you are just a un-invested spectator who really never had an opinion on gun control and just popped into this thread with a general comment and I went and jumped all over you . . . emoticon_cry\n \n \nMore ad hominem arguments and attempts to pigeonhole your opposition. I didn't say it was the duty of your side to preserve the old militia laws but merely commented how odd it was coming from people who so loudly proclaim that the Second Amendment is a protection against tyranny.\n\n \n Further proof that you suffer from profound ignorance of the philosophical concepts at issue here and a complete disconnect with the reasoning of the framers (and that you are a crybaby).\n \n \nShall I bring up that quote again from Joseph Story who reminds us of the importance of a well regulated militia?\n\n \n Oh please do . . .\n \n Please demonstrate the wealth of your knowledge and the depths of your understanding . . . \n \n Explain precisely how the states being derelict in their duty to maintain the structure of militia organization and training demanded by the Constitution and subsequent federal enactments consistent with the Constitution (i.e., Militia Act of 1792) impacts the pre-existing right of the people to keep and bear arms for a myriad of legal purposes which exists and is enjoyed in the complete silence of the Constitution on the personal arms of the private citizen (except for the 2nd Amendment, redundantly forbidding government from exercising powers it was never granted over the personal arms of the private citizen).", 
   {}, 
   384147, 
   null, 
   1262263680.0
  ], 
  [
   384170, 
   null, 
   "OldSarge", 
   "Originally Posted by Galileo \n Furthermore, I find it quite odd that people such as yourself who are so insistent that the preamble of the Second Amendment does not determine the scope of the protection of the right but so willingly embrace a limitation that is not even found in the text of the Second Amendment.\n \n I find it quite odd that one who claims copious amounts of knowledge in the area of gun control would forget the Dick Act. You are insistant upon blindly trudging onward until you are beaten into a position where there is no come back such as your ill fated expediton in claiming Belesillies as a valid source. That extended into dredging up another drooling nitwit who tried to defend Mikey even though it was quite evident he had zero knowledge of what he was puffing and blowing about. The Dick Act simply destroys your simplistic theory of limits since it codifies into law what the militia is. The Act defines the militia into 2 parts, organized and unorganized. The organized part becomes the National Guard and by extention the Reserves. The unorganized part becomes all others. ", 
   {
    "post_info": {
     "post_title": "stargazer in flames again"
    }
   }, 
   384161, 
   null, 
   1262269380.0
  ], 
  [
   384174, 
   null, 
   "Doc Jones", 
   "Originally Posted by Galileo \n Furthermore, I find it quite odd that people such as yourself who are so insistent that the preamble of the Second Amendment does not determine the scope of the protection of the right but so willingly embrace a limitation that is not even found in the text of the Second Amendment.\n \n I find it quite odd that one who claims copious amounts of knowledge in the area of gun control would forget the Dick Act. You are insistant upon blindly trudging onward until you are beaten into a position where there is no come back such as your ill fated expediton in claiming Belesillies as a valid source. That extended into dredging up another drooling nitwit who tried to defend Mikey even though it was quite evident he had zero knowledge of what he was puffing and blowing about. The Dick Act simply destroys your simplistic theory of limits since it codifies into law what the militia is. The Act defines the militia into 2 parts, organized and unorganized. The organized part becomes the National Guard and by extention the Reserves. The unorganized part becomes all others.\n\n \n Let us not forget the STATE MILITIAS of the various States. The NG can be called up for national service while the State Militias cannot. The Adjutant General of each State is the Commanding Officer and appointed by the Govenor who is the CinC and not the President. The Adjutant General is in charge of both the NG and the State Militia.", 
   {}, 
   384170, 
   null, 
   1262274780.0
  ], 
  [
   384197, 
   null, 
   "Doc Jones", 
   "star gazing gone nuts:\n \n \nMy objection is simple- I don't see any historical basis or textual basis for such a limit.\n\n \n So that was your reason to try to use Bellisiles fake, fraudulant study in \"Guns in Early America\" to try to prove that they were not numerous and did indeed have a 'historical basis'? You were shown the long standing right to keep and bear arms as intended in the Constitution contrary to what Bellisiles tried to present fiction as fact and you still are trying to do the same D*** thing.\n \n \nFurthermore, I find it quite odd that people such as yourself who are so insistent that the preamble of the Second Amendment\n \n \n You mean the Preamble to the Bill of Rights? The first clause is not a preamble to the Second Amendment! Read Article the fourth of the original right before the BOR was adopted, passed, and made all States from then on bound by those unalienable rights.\n \n \ndoes not determine the scope of the protection of the right but so willingly embrace a limitation that is not even found in the text of the Second Amendment.\n \n \n \"Shall not be infringed\" says it all! NUNN V. STATE OF GEORGIA goes farther and:\n Nunn V. State\n \n \"The right of the people peaceably to assemble and petition the\n government for a redress of grievances; to be secure in their\n persons, houses, papers, and effects, against unreasonable searches\n and seizures; in all criminal prosecutions, to be confronted with\n the witness against them; to be publicly tried by an impartial\n jury; and to have the assistance of counsel for their defence, is\n as perfect under the State as the national legislature, and cannot\n be violated by either.\n \n Nor is the right involved in this discussion less\n comprehensive or valuable: \"The right of the people to bear arms\n shall not be infringed;\" The right of the whole people, old and\n young, men, women and boys, and not militia only, to keep and hear\n arms of every description, not merely as are used by the militia,\n shall not be infringed, curtailed, or broken in upon, in the\n smallest degree; and all this for the important end to be attained:\n the rearing up and qualifying a well-regulated militia, so vitally\n necessary to the security of a free State. Our opinion is, that\n any law, State or Federal, is repugnant to the Constitution, and\n void, which contravenes this right, originally belonging to our\n forefathers, trampled under foot by Charles I. and his two wicked\n sons and successors, reestablished by the revolution of 1688,\n conveyed to this land of liberty by the colonists, and finally\n incorporated conspicuously in our own Magna Charta! And Lexington,\n Concord, Camden, River Raisin, Sandusky, and the laurel-crowned\n field of New Orleans, plead eloquently for this interpretation!\n And the acquisition of Texas may be considered the full fruits of\n this great constitutional right.\n \n We are of the opinion, then, that so far as the act of 1837\n seeks to suppress the practice of carrying certain weapons\n secretly, that it is valid, inasmuch as it does not deprive the\n citizen of his natural right of self-defence, or of his\n constitutional right to keep and bear arms. But that so much of\n it, as contains a prohibition against bearing arms openly is in\n conflict with the Constitution, and void; and that, as the\n defendant has been indicted and convicted for carrying a pistol,\n without charging that it was done in a concealed manner, under that\n portion of the statute which entirely forbids its use, the judgment\n of the court below must be reversed, and the proceeding quashed\n \n \nThis all began because I merely commented on Heller's decision to focus on the dicta instead of the holding in the Miller decision.\n <snip childish rant<.\n \n What do you think the \"holding\" in Miller was? It darn sure wasn't what you pretend it was!\n \n Miller and Layton nor their attourneys were present, the feds tried to get a freebie. It would have been easy to show that \"sawed off shotguns\" had been used as far back as the Civil War and WWI and WWII...if they had of been present. The best I recall, over 98,000 were used in the trenches during WWII.\n \n Here is all that came of it:\n \n Page 183 We are unable to accept the conclusion of the court below and \n the challenged judgment must be reversed. The cause will be remanded for \n further proceedings.\n \n Reversed and remanded.\n \n and... DISMISSED", 
   {}, 
   384174, 
   null, 
   1262294820.0
  ], 
  [
   384201, 
   null, 
   "Galileo", 
   "I equate the \"limit\" that you speak of as the Court saying that the 1st Amendment's protections extends not only to political speech but also the expression of one's sentiments on all issues, public and private . . . \n \n Does it occur to you the Court is discussing a near absolute protection of all firearms from federal oversight?\n \n The Court is discussing not what the citizen is allowed to possess but what the government is allowed to dictate upon -- it is discussing the IMMUNITY such weapons enjoy which is tied directly to the complete silence in the Constitution of any grant of power for government to have even a shred of interest in the personal arms of the private citizen.\n \n As rights and liberty go, you can \"limit\" me like that all you like . . .\n \n Stop reading the Amendment like a permission slip for the citizen. Whatever \"limits\" are affirmed by the Court will be determined by the application of unchanging constitutional principle of general militia to the legal realities of today in which the structure to activate, organize and train the citizenry has been extinguished. Even though the people can not serve in an organized fashion does not diminish their original, sovereign duty as the final arbiters of legitimate government and the possessors of the right to consent to government (and rescind that consent, with violence if necessary).\n\n What I see here:\n 1) An attempt to downplay or deny the the fact that limiting the Second Amendment's protection to commonly used weapons is truly a limit. I fail to wrap my brain around this point. \n 2) Some vague reference to the general principle of the militia being applied to modern realities being the justification for such a limit. \n 3) A point about the people having the right to rescind the government which makes me wonder why you don't oppose a ban on machine guns. Are you aware of the modern military realities of our day?\n \n \n \n\n Yeah, you are just a un-invested spectator who really never had an opinion on gun control and just popped into this thread with a general comment and I went and jumped all over you . . . emoticon_cry\n\n I think you responded with such hostility because I so clearly demonstrated an example of mental gymnastics in the Heller decision. The truth is not always so cut and dried. \n \n \n\n Further proof that you suffer from profound ignorance of the philosophical concepts at issue here and a complete disconnect with the reasoning of the framers (and that you are a crybaby).\n \n Oh please do . . .\n \n Please demonstrate the wealth of your knowledge and the depths of your understanding . . . \n \n Explain precisely how the states being derelict in their duty to maintain the structure of militia organization and training demanded by the Constitution and subsequent federal enactments consistent with the Constitution (i.e., Militia Act of 1792) impacts the pre-existing right of the people to keep and bear arms for a myriad of legal purposes which exists and is enjoyed in the complete silence of the Constitution on the personal arms of the private citizen (except for the 2nd Amendment, redundantly forbidding government from exercising powers it was never granted over the personal arms of the private citizen).\n\n Perhaps if the states had done a better job of maintaining the militia then the Federal government would not have stepped in and taken control thus depriving most of the people of the opportunity and right to bear arms in their state militias. Here's the Story quote:\n \n \"The importance of this article will scarcely be doubted by any persons, who have duly reflected upon the subject. The militia is the natural defence of a free country against sudden foreign invasions, domestic insurrections, and domestic usurpations of power by rulers. It is against sound policy for a free people to keep up large military establishments and standing armies in time ofanding armies in time of peace, both from the enormous expenses, with which they are attended, and the facilee means, which they afford to ambitious and unprincipled rulers, to subvert the government, or trample upon the rights of the people. The right of the citizens to keep and bear arms has justly been considered, as the palladium of the liberties of a republic; since it offers a strong moral check against the usurpation and arbitrary power of rulers; and will generally, even if these are successful in the first instance, enable the people to resist and triumph over them. And yet, thought this truth would seem so clear, and the importance of a well regulated militia would seem so undeniable, it cannot be disguised, that among the American people there is a growing indifference to any system of militia discipline, and a strong disposition, from a sense of its burthens, to be rid of all regulations. How is it practicable to keep the people duly armed without some organization, it is difficult to see. There is certainly no small danger, that indifference may lead to disgust, and disgust to contempt; and thus gradually undermine all the protection intended by this clause of our national bill of rights.\"\n \n Gun activists often bring up the old idea of civilian gun ownership being a protection against tyranny, but seemed unconcerned about the form this protection was intended to take which the Founders considered so essential. Why such inconsistency? Most likely because they are more concerned with making a useful argument in a debate than actually dealing with the threat of government tyranny. Historian Jack Rakove points out:\n \n \"Only by evoking that speculative threat [tyranny] to the republic itself can the individual right interpretation identify a danger more ominous than the actual costs annually incurred through the casual and deliberate use of firearms.\"", 
   {}, 
   384161, 
   null, 
   1262296860.0
  ], 
  [
   384205, 
   null, 
   "Galileo", 
   "Let us not forget the STATE MILITIAS of the various States. The NG can be called up for national service while the State Militias cannot. The Adjutant General of each State is the Commanding Officer and appointed by the Govenor who is the CinC and not the President. The Adjutant General is in charge of both the NG and the State Militia.\n\n So? The state \"militias\" of our own day are really only nominal militias. It has been so since Congress made major changes to militia laws in the early 20th Century because of the military ineffectiveness and poor performance of state militias. But I guess if Doc Jones thinks that if such \"militias\" are good enough to protect us against tyranny then we can all sleep well at night.", 
   {}, 
   384174, 
   null, 
   1262298240.0
  ], 
  [
   384210, 
   null, 
   "Galileo", 
   "The Dick Act simply destroys your simplistic theory of limits since it codifies into law what the militia is. The Act defines the militia into 2 parts, organized and unorganized. The organized part becomes the National Guard and by extention the Reserves. The unorganized part becomes all others. [/B]\n\n The dividing of the militia into the organized and unorganized parts was merely an attempt to make the law appear consistent with the old idea of the militia being composed of the body of the people. However, the unorganized \"militia\" isn't much of a militia at all. In reality, a federal select militia (which the founders thought was a step away from a standing army) was created. You and Doc Jones both seem to be out of touch with military realities.", 
   {}, 
   384170, 
   null, 
   1262299320.0
  ], 
  [
   384222, 
   null, 
   "NATO 556", 
   "Galileo-\n \n Regardless of whatever nonsense you wish to claim, you're simply wrong as always.\n \n The people of the United States will always form the unorganized militia. We are the last ditch defense against whatever trouble arises, be it local or national, native or foreign. And we don't need the government's consent for that.", 
   {}, 
   384210, 
   null, 
   1262303640.0
  ], 
  [
   384227, 
   null, 
   "OldSarge", 
   "The dividing of the militia into the organized and unorganized parts was merely an attempt to make the law appear consistent with the old idea of the militia being composed of the body of the people. However, the unorganized \"militia\" isn't much of a militia at all. In reality, a federal select militia (which the founders thought was a step away from a standing army) was created. You and Doc Jones both seem to be out of touch with military realities.\n\n \n Ha ha nice try but a failure as usual. There is no wiggle room around the law. You are either the organized or the unorganized militia! You seem to out of touch with reality. Then a leftist with a an embrace of moral relativism would be. emoticon_xhoho", 
   {}, 
   384210, 
   null, 
   1262305620.0
  ], 
  [
   384270, 
   null, 
   "Rick_OShea", 
   "What I see here:\n 1) An attempt to downplay or deny the the fact that limiting the Second Amendment's protection to commonly used weapons is truly a limit. I fail to wrap my brain around this point. \n\n \n It is a limitation when gaged against an absolutist interpretation but really, who is arguing for an absolutist interpretation? Is there anyone who says that the right is unlimited, any weapon anywhere for anyone? None that the reasonable among us take seriously I hope . . . \n \n When gaged against the lower federal court decisions embraced by gun rights detractors for 70 some odd years, (the so called 'settled law of the 2nd') Scalia's \"limit\" is a radical expansion of the protection sphere of the 2nd. \n \n That's why, for now, I am willing to accept this 'limit' as stated in Heller to the extent that it settled Heller. Scalia admits Heller is not an exhaustive analysis of the full scope of the Second Amendment and as we see now, the Court is affording itself the opportunity to partake in that endeavor with McDonald v Chicago. Even then, there will be liberty interests that will need to be clarified; the full scope of the right to arms will still not be completely established.\n \n \n2) Some vague reference to the general principle of the militia being applied to modern realities being the justification for such a limit. \n\n \n Isn't that the duty of the Supreme Court, to apply the Constitution to modern realities?\n \n \n3) A point about the people having the right to rescind the government which makes me wonder why you don't oppose a ban on machine guns. Are you aware of the modern military realities of our day?\n\n \n I can not wrap my brain around the fact that so many rabid anti-gunners are now arguing that Heller is wrongly decided because machine gun restrictions remain legitimate under the ruling.\n \n I am aware of the modern military realities and I am aware of the capabilities of the weaponry that enjoys 2nd Amendment protection. In all honesty, if the XXXX hit the fan I would rather have 20 motivated guys with .300 WinMag scoped bolt action rifles and 20 rounds each than 60 guys with machine guns and 500 rounds each.\n \n After about three days I would enjoy the company of 20 guys with .300 WinMag scoped bolt action rifles and machine guns, grenade launchers, rockets, mortars etc, etc, etc. . . The \"machine gun ban\" would only be in force for as long as it would take the militia to \"liberate\" those weapons from the regulars.\n \n \nI think you responded with such hostility because I so clearly demonstrated an example of mental gymnastics in the Heller decision. The truth is not always so cut and dried. \n\n \n Correct, the truth is not so cut and dried (or settled) as you present. Heller is just the first step in restoring the Constitution as it relates to gun rights. Heller is not the end-all decision and I think you are in for much more hurt when McDonald is decided. Chicago/Oak Park filed the respondent's brief right on deadline yesterday. This will not be a fair fight.\n \n \nPerhaps if the states had done a better job of maintaining the militia then the Federal government would not have stepped in and taken control . . . \n\n \n Absolutely correct!\n \n \nthus depriving most of the people of the opportunity and right to bear arms in their state militias.\n\n \n There is no right to serve in a militia; militia organization is a power originally concurrent between the state and federal governments. An armed citizenry is what allows an organized militia to be created.\n \n \nHere's the Story quote:\n\n \n And true to form you gloss over and ignore the plain explanations that distinguish the right of the citizen from the duties (and dangers) of government. \n \n Look, I understand the argument you are trying to make here; that the organization and training of the people in their capacity of militia to serve the government is what legitimizes the condition of the people being armed . . . That is a very convenient position for a person arguing for a qualified, conditioned or restricted scope of the right and I would stipulate that one could conclude that from the last sentences you quote from Story.\n \n Reading the entirety of Story's exposition of the 2nd Amendment through the sentence that is without a doubt the focus of your attention actually endorses Scalia's interpretation of the 'limited' scope of the right protected by the 2nd Amendment! Story says:\n \n \"How is it practicable to keep the people duly armed without some organization, it is difficult to see.\" \n \n My argument would be OK, since there is no means to facilitate the organization of the people then being \"duly armed\" with machine guns, rocket launchers and anti-tank missiles is not protected by the 2nd Amendment. :p\n \n Your contention fails even more miserably when ALL the concepts of Constitutional liberty defined by a Bill of Rights discussed by Story in his Commentaries are inspected (§ 1856-1859). Story paraphrasing Hamilton in Federalist 84 (§ 1855) and his commentary about a bill of rights constraining the whims of the majority (§ 1860) all serve to reject your argument that criteria established by government, act to constrain a right enumerated in the Bill of Rights. \n \n It is absurd.\n \n \nHistorian Jack Rakove points out:\n \n \"Only by evoking that speculative threat [tyranny] to the republic itself can the individual right interpretation identify a danger more ominous than the actual costs annually incurred through the casual and deliberate use of firearms.\"\n\n \n There is no balance sheet for the Bill of Rights.\n \n As the \"costs incurred\" Rakove point to are rarely caused by the legitimate exercise of the right to arms I fail to see why his is a constitutional argument. \n \n Is your computer to blame for the scourge of child pornography?", 
   {}, 
   384201, 
   null, 
   1262331360.0
  ], 
  [
   384276, 
   null, 
   "Doc Jones", 
   "star gazer is a bit s-l-o-w.\n \n My guess is he has lost a lot of money betting on instant replays :) Both his buddies like him for that reason alone emoticon_xgood", 
   {}, 
   384270, 
   null, 
   1262352900.0
  ], 
  [
   384277, 
   null, 
   "Doc Jones", 
   "The dividing of the militia into the organized and unorganized parts was merely an attempt to make the law appear consistent with the old idea of the militia being composed of the body of the people. However, the unorganized \"militia\" isn't much of a militia at all. In reality, a federal select militia (which the founders thought was a step away from a standing army) was created. You and Doc Jones both seem to be out of touch with military realities.\n\n \n So that explains our current VOLUNTEER ARMY in your estimation, right? They aren't a \"body of the people\"?\n \n Are you doing your militia duties as required by the Constitution?", 
   {}, 
   384210, 
   null, 
   1262353080.0
  ], 
  [
   384279, 
   null, 
   "Doc Jones", 
   "The dividing of the militia into the organized and unorganized parts was merely an attempt to make the law appear consistent with the old idea of the militia being composed of the body of the people. However, the unorganized \"militia\" isn't much of a militia at all. In reality, a federal select militia (which the founders thought was a step away from a standing army) was created. You and Doc Jones both seem to be out of touch with military realities.\n\n \n Oh really? What is/was your MOS?\n \n We are indeed fortunate to have someone of your 'caliber' handy for reference to either the Constitution or military affairs :p", 
   {}, 
   384210, 
   null, 
   1262356620.0
  ], 
  [
   384280, 
   null, 
   "Rick_OShea", 
   "The dividing of the militia into the organized and unorganized parts was merely an attempt to make the law appear consistent with the old idea of the militia being composed of the body of the people. However, the unorganized \"militia\" isn't much of a militia at all. In reality, a federal select militia (which the founders thought was a step away from a standing army) was created. You and Doc Jones both seem to be out of touch with military realities.\n\n \n What events or circumstances has altered the \"old idea?\" What pray tell is the \"new idea,\" who's is it and why should we accept it?\n \n Section 311 of Title 10 of the US Code is not creating anything new nor perpetuating anything illegitimate but just affirming a fundamental tenant of this nation.\n \n Are you forgetting Presser? It was decided well before the Dick Act and confirmed that ALL citizens capable of bearing arms constitute the \"reserve militia\":\n \"It is undoubtedly true that all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states, and, in view of this prerogative of the general government, as well as of its general powers, the states cannot, even laying the constitutional provision in question out of view, prohibit the people from keeping and bearing arms, so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government. But, as already stated, we think it clear that the sections under consideration do not have this effect.\"\n Section 311 of Title 10 of the US Code conforms perfectly with this, declaring all able bodied citizens as the unorganized militia.\n \n As Story commented earlier (1833), the right to arms of the people is the safeguard of our Republic. Presser (1886) makes it clear that the armed citizenry is a fundamental INSEPARABLE component of the republican government established by the Constitution. \n \n See, the only \"general powers\" Constitutional clause that can be said to empower the federal government to forbid states to \"prohibit the people from keeping and bearing arms\" (with the 2nd Amendment placed \"out of view\") is Art IV, § 4 . . . The promise to forever provide to the states a republican form of government. That \"general power\" is buttressed by an attendant unenumerated power (\"prerogative\") to perpetuate fundamental republican principles (like an armed citizenry).\n \n A close reading of Presser clearly unmounts the protection of the citizen's right to arms from the 2nd Amendment and dismisses with any requirement that the right be \"incorporated\" under the 14th Amendment. The right to arms is among the most fundamental liberty interests and is secured by the simple structure of the Constitution.", 
   {}, 
   384210, 
   null, 
   1262356980.0
  ], 
  [
   384645, 
   null, 
   "Galileo", 
   "\n Correct, the truth is not so cut and dried (or settled) as you present. Heller is just the first step in restoring the Constitution as it relates to gun rights. Heller is not the end-all decision and I think you are in for much more hurt when McDonald is decided. Chicago/Oak Park filed the respondent's brief right on deadline yesterday. This will not be a fair fight.\n \n\n I think that Heller is not a model of originalism, but some of the mental gymnastics in it do work in favor of gun control advocates. Anyone here notice that organizations such as the Brady Campaign are still quite optimistic after the outcome of Heller? \n \n \n \n\n There is no right to serve in a militia; militia organization is a power originally concurrent between the state and federal governments. An armed citizenry is what allows an organized militia to be created.\n \n And true to form you gloss over and ignore the plain explanations that distinguish the right of the citizen from the duties (and dangers) of government. \n \n Look, I understand the argument you are trying to make here; that the organization and training of the people in their capacity of militia to serve the government is what legitimizes the condition of the people being armed . . . That is a very convenient position for a person arguing for a qualified, conditioned or restricted scope of the right and I would stipulate that one could conclude that from the last sentences you quote from Story.\n \n Reading the entirety of Story's exposition of the 2nd Amendment through the sentence that is without a doubt the focus of your attention actually endorses Scalia's interpretation of the 'limited' scope of the right protected by the 2nd Amendment! Story says:\n \n \"How is it practicable to keep the people duly armed without some organization, it is difficult to see.\" \n \n My argument would be OK, since there is no means to facilitate the organization of the people then being \"duly armed\" with machine guns, rocket launchers and anti-tank missiles is not protected by the 2nd Amendment. :p\n \n Your contention fails even more miserably when ALL the concepts of Constitutional liberty defined by a Bill of Rights discussed by Story in his Commentaries are inspected (§ 1856-1859). Story paraphrasing Hamilton in Federalist 84 (§ 1855) and his commentary about a bill of rights constraining the whims of the majority (§ 1860) all serve to reject your argument that criteria established by government, act to constrain a right enumerated in the Bill of Rights. \n \n It is absurd.\n\n I'm not sure what your point about Hamilton was, but I think Story's point was basically that in order for the right to serve as a defense against tyranny militia organization and regulations were necessary. Someone might want to go back and see how that relates to my point about modern day people on the pro-gun side often bringing up the threat of tyranny in their arguments.\n \n \n \n\n There is no balance sheet for the Bill of Rights.\n \n As the \"costs incurred\" Rakove point to are rarely caused by the legitimate exercise of the right to arms I fail to see why his is a constitutional argument. \n \n Is your computer to blame for the scourge of child pornography?\n\n Every legal gun is a potentially illegal gun.", 
   {}, 
   384270, 
   null, 
   1262669880.0
  ], 
  [
   384646, 
   null, 
   "Galileo", 
   "What events or circumstances has altered the \"old idea?\" What pray tell is the \"new idea,\" who's is it and why should we accept it?\n \n Section 311 of Title 10 of the US Code is not creating anything new nor perpetuating anything illegitimate but just affirming a fundamental tenant of this nation.\n \n Are you forgetting Presser? It was decided well before the Dick Act and confirmed that ALL citizens capable of bearing arms constitute the \"reserve militia\":\n \"It is undoubtedly true that all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states, and, in view of this prerogative of the general government, as well as of its general powers, the states cannot, even laying the constitutional provision in question out of view, prohibit the people from keeping and bearing arms, so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government. But, as already stated, we think it clear that the sections under consideration do not have this effect.\"\n Section 311 of Title 10 of the US Code conforms perfectly with this, declaring all able bodied citizens as the unorganized militia.\n \n As Story commented earlier (1833), the right to arms of the people is the safeguard of our Republic. Presser (1886) makes it clear that the armed citizenry is a fundamental INSEPARABLE component of the republican government established by the Constitution. \n \n See, the only \"general powers\" Constitutional clause that can be said to empower the federal government to forbid states to \"prohibit the people from keeping and bearing arms\" (with the 2nd Amendment placed \"out of view\") is Art IV, § 4 . . . The promise to forever provide to the states a republican form of government. That \"general power\" is buttressed by an attendant unenumerated power (\"prerogative\") to perpetuate fundamental republican principles (like an armed citizenry).\n \n A close reading of Presser clearly unmounts the protection of the citizen's right to arms from the 2nd Amendment and dismisses with any requirement that the right be \"incorporated\" under the 14th Amendment. The right to arms is among the most fundamental liberty interests and is secured by the simple structure of the Constitution.\n\n Legal scholars H. Richard Ulliver and William G. Merkel explain:\n \n \"Interestingly, the Court conceded in dicta that because 'all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states,' the states cannot prohibit the people from keeping and bearing arms 'so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government.'48 However, this prohibition on state-ordered disarmament of the federal militia reserve existed apart from the Second and Fourteenth Amendments.49 Instead, it reflected what the Court called the 'prerogative of the general government, as well as its general powers' respecting the 'reserve militia of the United States.'50 The Court thus invoked a concept of federal supremacy derived from the 'calling forth' and 'provid[ing] for 51' powers under the Constitution to imply a prohibition against state interference with arms bearing in the federal militia. This federal right of the people to keep and bear arms, like the state right to keep and bear arms guaranteed by the Second Amendment, had no application outside the context of militia service. To the Supreme Court,52 as well as to Lyman Trumbull,53 the right(s) to arms protected the states and the nation against over-large standing armies by enabling a militia, but served no private purposes.\"", 
   {}, 
   384280, 
   null, 
   1262670660.0
  ], 
  [
   384652, 
   null, 
   "OldSarge", 
   "Legal scholars H. Richard Ulliver and William G. Merkel explain:\n \n \"Interestingly, the Court conceded in dicta that because 'all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states,' the states cannot prohibit the people from keeping and bearing arms 'so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government.'48 However, this prohibition on state-ordered disarmament of the federal militia reserve existed apart from the Second and Fourteenth Amendments.49 Instead, it reflected what the Court called the 'prerogative of the general government, as well as its general powers' respecting the 'reserve militia of the United States.'50 The Court thus invoked a concept of federal supremacy derived from the 'calling forth' and 'provid[ing] for 51' powers under the Constitution to imply a prohibition against state interference with arms bearing in the federal militia. This federal right of the people to keep and bear arms, like the state right to keep and bear arms guaranteed by the Second Amendment, had no application outside the context of militia service. To the Supreme Court,52 as well as to Lyman Trumbull,53 the right(s) to arms protected the states and the nation against over-large standing armies by enabling a militia, but served no private purposes.\"\n\n \n Since the numbers are obviously footnotes why do you not give your source? ", 
   {}, 
   384646, 
   null, 
   1262691060.0
  ], 
  [
   384653, 
   null, 
   "OldSarge", 
   "\"First, although the 2nd Amendment did create a personal right to \"keep and bear arms,\" it did so only insofar as private arms were needed to maintain a citizen militia. The basis for the right is the collective, republican concept of the citizen militia, and the primary objective of enshrining the militia in the Bill of Rights was to guard against the dangers of a standing professional army. Moreover, the phrase \"keep and bear arms\" had distinctly military connotations leading up to and including the founding era, and there is remarkably little evidence of an individualist right to possess guns, even in the anti-federalist literature. However, the authors do not entirely eschew the individualist interpretation of the Amendment; the \"right of the people\" was, they believe, intended to vest the ownership and possession of arms in the potential militia members-(white male) citizens.\"\n \n Never mind the discredited collective right theory which was settled by Heller.", 
   {
    "unicode_changes_made": true
   }, 
   384652, 
   null, 
   1262691840.0
  ], 
  [
   384656, 
   null, 
   "Rick_OShea", 
   "Legal scholars H. Richard Ulliver and William G. Merkel explain:\n\n \n Just a quick note, I'm off to work . . .\n \n The book this is from, THE MILITIA AND THE RIGHT TO BEAR ARMS, OR, HOW THE SECOND AMENDMENT FELL SILENT (2002), is one of a flurry of cribbed together dissertations forced by US v Emerson. \n \n By 2000 real legal scholarship was showing that the pure state's right / collective right interpretation was hogwash so the anti-liberty \"scholars\" (including Cornell and Bogus) came up with the \"conditioned individual right\" . . . \n \n \"OK, FINE! it's an individual right but you can only exercise it when the gubmint says it is OK, OK?\"\n \n LOL!\n \n The theory held people's attention for a few minutes but like all permutations of the collective right interpretation it fails when inspected deeply.\n \n Nobody of note is arguing the interpretation today, it just adds to the immense pile of excrement thrown by these guys that didn't stick to the wall. \n \n More tonite, specifically addressing their uhhh, shall we say, 'peculiar' take on Presser. \n \n LOL²!!!", 
   {}, 
   384646, 
   null, 
   1262694960.0
  ], 
  [
   384675, 
   null, 
   "NATO 556", 
   "Legal scholars H. Richard Ulliver and William G. Merkel explain:\n\n \n Another of your petty little Joyce Foundation monkeys who'll say exactly what you want even though it has no bearing on reality?\n \n \n\"Interestingly, the Court conceded in dicta that because 'all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states,' the states cannot prohibit the people from keeping and bearing arms 'so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government.'\n\n \n And yet the state can order its potential militia members to undergo a six month waiting period before they're able to be armed for emergency defense?\n \n \nThis federal right of the people to keep and bear arms, like the state right to keep and bear arms guaranteed by the Second Amendment, had no application outside the context of militia service. To the Supreme Court,52 as well as to Lyman Trumbull,53 the right(s) to arms protected the states and the nation against over-large standing armies by enabling a militia, but served no private purposes.\"\n\n \n This whole BS argument was absolutely done away with in the Heller ruling. The Supreme Court stated, in absolute and unquestionable terms, that owning a gun has no connection with the duty of serving in a state sponsored militia, or filling some other requirement to the government.", 
   {}, 
   384646, 
   null, 
   1262706300.0
  ], 
  [
   384753, 
   null, 
   "Doc Jones", 
   "That whole mess cost Soros a lot of money trying to salvage a ruling for individual rights in the Emerson case.\n \n I say, \"It was money well wasted\". <smirk<\n \n That mess of rat bait sure drew a lot of rats who are no longer with us though! A busted rat is a good rat.", 
   {}, 
   384675, 
   null, 
   1262733420.0
  ], 
  [
   384800, 
   null, 
   "Rick_OShea", 
   "However, this prohibition on state-ordered disarmament of the federal militia reserve existed apart from the Second and Fourteenth Amendments.49\n\n \n More than a bit disingenuous to assign the title of \"federal militia reserve\" (in the context of this paragraph as a restricting condition) to the wider entity the Court describes as \"all citizens\" and \"the people\" as the protected class. \n \n The \"federal militia reserve\" could only be disarmed indirectly by state laws disarming the PEOPLE by \"prohibit[ing] the people from keeping and bearing arms \". . . The Court does not allude that this protection is in any way dependent upon actual service to the nation; in fact it precludes it by stating the right to keep and bear arms is NOT \"in any manner dependent upon [the Constitution] for its existence.\" Organized militia structure (either federal or state) is a creation of the Constitution, thus, the right to arms can not depend upon it.\n \n You are presenting absurd foolishness designed to mislead people.\n \n \nInstead, it reflected what the Court called the 'prerogative of the general government, as well as its general powers' respecting the 'reserve militia of the United States.'50\n\n \n I would appreciate it if you would post the footnotes for these passages; I would like to review them to see the sources of their reasoning. While this statement is essentially true, the following explanation drawn from it (that you embrace) has no relationship with a power residing in the prerogative of the government. \n \n \nThe Court thus invoked a concept of federal supremacy derived from the 'calling forth' and 'provid[ing] for 51' powers under the Constitution to imply a prohibition against state interference with arms bearing in the federal militia.\n\n \n This theory is lacking when the Court's precedents on militia issues are taken into account. The doctrine of federal preemption (specifically of militia powers) was established in Houston v Moore in 1820. Houston said that the full grant of powers was exercised in the Militia clauses of the Constitution, that leaves little room for \"prerogative\" to elbow itself into the equation of protecting militia powers.\n \n \"Constitutional scholars\" arguing the collective rights theory never refer to those SCOTUS militia cases as they destroy any thought that the 2nd Amendment protects state government militia interests. I would be very surprised if a single mention of or citation to the Court's militia cases (inexplicably NOT 2nd Amendment cases) is found in Ulliver and Merkel's work.\n \n \nThis federal right of the people to keep and bear arms, like the state right to keep and bear arms guaranteed by the Second Amendment, had no application outside the context of militia service.\n\n \n Again, a theory destroyed by any inspection of the Court's actual militia cases where actual conflict between federal and state control of the militia were always decided in favor of the federal government. Why no state ever mentioned this alleged immunity for states from federal interference established by the 2nd Amendment is something the \"state's right\" advocates have never addressed.\n \n \nTo the Supreme Court,52 as well as to Lyman Trumbull,53 the right(s) to arms protected the states and the nation against over-large standing armies by enabling a militia, but served no private purposes.\"\n\n \n And to believe that we must ignore the Presser Court's re-stating the holding of Cruikshank. The Presser Court replaces the Cruikshank Court's quote from the indictment at issue characterizing the, \"right there specified is that of 'bearing arms for a lawful purpose'\" to the plain, universally understood \"the right of the people to keep and bear arms.\"\n \n The \"right of the people to keep and bear arms\" is synonymous with \"bearing arms for lawful purpose\" as exercised by two former slaves in Grant Parish, Louisiana in 1873 for the purpose of self defense in a state where there was no militia because it had been disbanded by the Governor on orders of Congress . . . \n \n If you have this book I ask you to post up footnote 53 as I am interested in the context in which Ulliver and Merkel view Senator Trumbull being hostile to an individual right to arms . . . \n \n I'm not going to go into great depth but Trumbull widely denounced the Black Coses as violations of civil and Constitutional rights and widely supported The Civil Rights Act of 1866 and the Freedman's Bureau Bills as protecting Constitutional rights and specifically the right to keep and bear arms. When introducing the Civil Rights Bill Senator Trumbull explicitly took aim at a Mississippi law that prohibited 'any black or mulatto from having firearms.'\" Is it really your contention that this was just so freed slaves could serve in the militia? LOL\n \n Please provide the footnotes and additional argument and answer my question, ( \"What events or circumstances has altered the \"old idea?\" What pray tell is the \"new idea,\" who's is it and why should we accept it?\") as this response fell quite short . . .", 
   {}, 
   384646, 
   null, 
   1262781000.0
  ], 
  [
   384831, 
   null, 
   "Bryan", 
   "Legal scholars H. Richard Ulliver and William G. Merkel explain:\n \n \"Interestingly, the Court conceded in dicta that because 'all citizens capable of bearing arms constitute the reserved military force or reserve militia of the United States as well as of the states,' the states cannot prohibit the people from keeping and bearing arms 'so as to deprive the United States of their rightful resource for maintaining the public security, and disable the people from performing their duty to the general government.'48 However, this prohibition on state-ordered disarmament of the federal militia reserve existed apart from the Second and Fourteenth Amendments.49 Instead, it reflected what the Court called the 'prerogative of the general government, as well as its general powers' respecting the 'reserve militia of the United States.'50 The Court thus invoked a concept of federal supremacy derived from the 'calling forth' and 'provid[ing] for 51' powers under the Constitution to imply a prohibition against state interference with arms bearing in the federal militia. This federal right of the people to keep and bear arms, like the state right to keep and bear arms guaranteed by the Second Amendment, had no application outside the context of militia service. To the Supreme Court,52 as well as to Lyman Trumbull,53 the right(s) to arms protected the states and the nation against over-large standing armies by enabling a militia, but served no private purposes.\"\n\n \n Here is the problem I have with the argument these scholars advance. They correctly note the supremacy clause exists without understanding how it destroys the legitimacy of their argument. Here is the clause and examples of how it works (Article VI of the Constitution):\n \n &#8220;This Constitution, and the laws of the United States which shall be made in pursuance thereof; and all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land; and the judges in every state shall be bound thereby, any thing in the Constitution or laws of any state to the contrary notwithstanding.&#8221;\n \n Gregory v. Ashcroft, 501 U.S. 452, 460 (1991):\n &#8220;The Federal Government holds a decided advantage in this delicate balance: the Supremacy Clause. U.S. Const., Art. VI. As long as it is acting within the powers granted it under the Constitution, Congress may impose its will on the States. Congress may legislate in areas traditionally regulated by the States. This is an extraordinary power in a federalist system. It is a power that we must assume Congress does not exercise lightly.&#8221;\n \n Louisiana Public Service Comm'n v. FCC, 476 U.S. 355, 368-369 (1986):\n &#8220;The Supremacy Clause of Art. VI of the Constitution provides Congress with the power to pre-empt state law. Pre-emption occurs when Congress, in enacting a federal statute, expresses a clear intent to pre-empt state law, Jones v. Rath Packing Co., 430 U.S. 519 (1977), when there is outright or actual conflict between federal and state law, e.g., Free v. Bland, 369 U.S. 663 (1962), where compliance with both federal and state law is in effect physically impossible, Florida Lime & Avocado Growers, Inc. v. Paul, 373 U.S. 132 (1963), where there is implicit in federal law a barrier to state regulation, Shaw v. Delta Air Lines, Inc., 463 U.S. 85 (1983), where Congress has legislated comprehensively, thus occupying an entire field of regulation and leaving no room for the States to supplement federal law, Rice v. Santa Fe Elevator Corp., 331 U.S. 218 (1947), or where the state law stands as [Page 369] an obstacle to the accomplishment and execution of the full objectives of Congress. Hines v. Davidowitz, 312 U.S. 52 (1941). Pre-emption may result not only from action taken by Congress itself; a federal agency acting within the scope of its congressionally delegated authority may pre-empt state regulation. Fidelity Federal Savings & Loan Assn. v. De la Cuesta, 458 U.S. 141 (1982); Capital Cities Cable, Inc. v. Crisp, 467 U.S. 691 (1984).&#8221;\n \n What these two scholars fail to understand (or refuse to concede???) is that their contrived and overly restrictive &#8220;militia service only right&#8221; is already within the exclusive control of Congress under Article I Section 8:\n \n &#8220;To provide for organizing, arming, and disciplining, the militia, and for governing such part of them as may be employed in the service of the United States, reserving to the states respectively, the appointment of the officers, and the authority of training the militia according to the discipline prescribed by Congress.&#8221;\n \n Congress has the exclusive power to choose how large the state militia will be, who will be considered a member and who will not, how they will be armed, and how they will be disciplined. And if the right to keep and bear arms is limited only to militia service, as these scholars suggest, then it is not a right at all&#8212;it merely becomes a privilege incidental to militia service which Congress has the total power to grant or withhold. This point was addressed in Heller:\n \n &#8220;Besides ignoring the historical reality that the Second Amendment was not intended to lay down a &#8220;novel principl[e]&#8221; but rather codified a right &#8220;inherited from our English ancestors,&#8221; Robertson v. Baldwin, 165 U.S. 275, 281 (1897), petitioners' interpretation does not even achieve the narrower purpose that prompted codification of the right. If, as they believe, the Second Amendment right is no more than the right to keep and use weapons as a member of an organized militia, see Brief for Petititioners 8 &#8212; if, that is, the organized militia is the sole institutional [Slip Op. 27] beneficiary of the Second Amendment's guarantee &#8212; it does not assure the existence of a &#8220;citizens' militia&#8221; as a safeguard against tyranny. For Congress retains plenary authority to organize the militia, which must include the authority to say who will belong to the organized force.17 That is why the first Militia Act's requirement that only whites enroll caused States to amend their militia laws to exclude free blacks. See Siegel, The Federal Government's Power to Enact Color-Conscious Laws, 92 Nw. U. L. Rev. 477, 521-525 (1998). Thus, if petitioners are correct, the Second Amendment protects citizens' right to use a gun in an organization from which Congress has plenary authority to exclude them. It guarantees a select militia of the sort the Stuart kings found useful, but not the people's militia that was the concern of the founding generation.&#8221; District Of Columbia v. Heller, 554 U.S. ___ 07290, 26-27 (2008)\n \n Additionally, many anti-federalists complained that if Congress were given the exclusive power to arm the militia then Congress could effectively disarm the state militias simply by refusing to exercise its authority to arm them. \n \n The federalist response was essentially &#8220;so what?&#8221; The people were already armed (and, as Miller noted, the practice of the time was for the militias to be made up of men &#8220;bearing arms supplied by themselves&#8221;&#8212;arms they had a right to own and possess unattached to any militia duty). This individual right to keep and bear arms exists apart from and beyond the Congressional power to arm the militias. See, for example:\n \n &#8220;The power of the sword, say the minority of Pennsylvania, is in the hands of Congress. My friends and countrymen, it is not so, for the powers of the sword are in the hands of the yeomanry of America from sixteen to sixty. The militia of these free commonwealths, entitled and accustomed to their arms, when compared with any possible army, must be tremendous and irresistible. Who are the militia? Are they not ourselves? Is it feared, then, that we shall turn our arms each man against his own bosom? Congress shall have no power to disarm the militia. Their swords and every other terrible implement of the soldier, are the birth-right of an American ....[T]he unlimited power of the sword is not in the hands of either the federal or the state governments, but where I trust in God it will ever remain, in the hands of the People.&#8221; Tench Coxe, Pennsylvania Gazette, Feb. 20, 1788. \n \n &#8220;Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.&#8221; Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution.\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).\n \n The view clearly was that Congress cannot exercise a monopoly over arms because the people have a concurrent individual right to have arms. If Congress formed an army of tyranny and both refused to arm the militias and forbade the states from providing arms to the militias, then the people in an emergency could provide their own arms.\n \n Every court which has looked upon the issue has held that the Bill of Rights acts as a check upon the power of the federal government. Yet these scholars suggest the 2nd. Amendment is nothing more than an unnecessary statement that you have a right to keep and bear arms if Congress allows you to have them. \n \n This is a fraudulent argument with no basis in history or law. I too would like to see the footnotes cited in this writing to see where they support this assertion. The scholars say &#8220;To the Supreme Court&#8221; which implies they believe the Presser Court viewed the right that way. Presser most certainly did not make this assumption. If there is another case they refer to in the footnote I would like to read it. \n \n They do cite, however, Illinois Senator Lyman Trumball as a supporter of this &#8220;militia service only right&#8221; view. Senator Trumball is widely known for having condemned the actions of the Mississippi state militia, which he accused of roaming throughout that state to habitually \"hang some freedmen or search negro houses for arms.&#8221; Congressional Globe, 39th. Congress, 1st. Session, part 1, Senate Report Number 30, p. 813 (February 13, 1866) [Speech of Senator Lyman Trumball (Republican-Illinois). Trumball was also known to support the expressed congressional purpose of the 14th. Amendment&#8212;which was to incorporate the first 8 amendments in the BoR against the states. \n \n Yet the two scholars argue that Trumball believed the RKBA only protected the black man&#8217;s right to join up with and carry arms amongst the same racist militia members who sought to disarm and lynch him? \n \n I too share Rick&#8217;s disbelief here. I would like to see the sources in the footnote. For Trumball to be associated with this argument is unknown to me this side of the looking glass.", 
   {
    "post_info": {
     "post_title": "supremacy clause"
    }
   }, 
   384646, 
   null, 
   1262817900.0
  ], 
  [
   384925, 
   null, 
   "Doc Jones", 
   "You will have a long wait I predict! star gazer cannot defend his posts which are propaganda, and has fled back to his bunker hoping the issue will go away.\n His gunban.orgs is playing with yet another non-peer \"gun study\" funded by CDC through a third party. Branus and about 14 other \"scholars\" are trying to unleash that thing shortly with Holder's and the administrations blessings. \n \n The **** he posts come from those .orgs and that is all that matters to him; **** the torpedoes and full speed ahead. Just another set of repetitions, lies with just an inkling of hope that someone will buy it hook, line and sinker. If you go to the source, a decent firewall will block access. I doubt the \"book\" has been released yet but my bet is that will go the way of Bellesiles hogwash.", 
   {}, 
   384831, 
   null, 
   1262878680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Which is it? U.S. vs. Miller or NFA?", 
  "url": "http://www.4forums.com/political/gun-control-debates/13694-u-s-vs-miller-nfa.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13694, 
  "discussion_files": [
   [
    "9058.html", 
    "http://www.4forums.com/political/gun-control-debates/13694-u-s-vs-miller-nfa-print.html"
   ], 
   [
    "9059.html", 
    "http://www.4forums.com/political/gun-control-debates/13694-u-s-vs-miller-nfa-4-print.html"
   ], 
   [
    "9060.html", 
    "http://www.4forums.com/political/gun-control-debates/13694-u-s-vs-miller-nfa-3-print.html"
   ], 
   [
    "9061.html", 
    "http://www.4forums.com/political/gun-control-debates/13694-u-s-vs-miller-nfa-2-print.html"
   ]
  ], 
  "identifier": 13694
 }
]