[
 [
  [
   382663, 
   null, 
   "OldSarge", 
   "40 Congressmen Call on Special Ops Commander to Dismiss Case Brought Against Navy SEALs over Alleged Punching of Terrorist\n Monday, December 14, 2009\n By Fred Lucas, Staff Writer \n \n \n (CNSNews.com) - Forty members of Congress are calling on the military commander who ordered the court martial of three Navy SEALs over the alleged punching of a terrorist to dismiss the charges. \n \n The letter, circulated by Rep. Dan Burton (R-Ind.), was sent Thursday to Army Major Gen. Charles T. Cleveland, commander of Special Operation Command Central. Gen. Cleveland ordered the prosecution of the three SEALs.\n \n \"In our opinion, prosecutorial discretion should have been exercised,\" the 40 congressmen said. \"Failing that, we respectfully and strongly urge you to exercise your leadership authority, stop the impending court martial and exonerate these men.\"\n \n Earlier, 33 House Members had signed a letter to Defense Secretary Robert Gates asking him to intervene in the case. That letter had been circulated by Rep. Duncan Hunter (R-Calif.). Military law experts told CNSNews.com, however, that the Defense secretary's ability to intervene in a court martial could be limited. \n \n U.S. congressmen representing two of the SEALs' home districts signed the letters. Only Republican members signed the letters. \n \n Rep. Bob Latta, who represents the Ohio's 5th Congressional District that includes Perrysburg, Ohio, signed both of the letters. Perryburg is the hometown of one of the three SEALs, 24-year-old Petty Officer Second Class Mathew McCabe. \n \n McCabe was part of the SEAL team that captured Ahmed Hashim Abed, the alleged architect of the murder of four Blackwater USA security guards in Fallujah, Iraq in 2004. The bodies of the four Americans were mutilated, burned and hanged from a bridge over the Euphrates River. \n \n McCabe has been charged with assault for allegedly punching Abed in the midsection. He has also been charged with dereliction of duty for allegedly failing to protect Abed and with allegedly making a false statement by denying the incident. Two other SEALs, Petty Officer Julio Huertas, 28, and Petty Officer Jonathon Keefe, 25, have been charged with alleged dereliction of duty for not protecting Abed and for allegedly making a false statement. Huertas has also been charged with allegedly impeding an investigation. \n \n Rep. Latta will have more to say on the matter in the near future, his spokesman Bob Popp told CNSNews.com Friday. \n \n Keefe is from Yorktown, Va., part of the state's 1st Congressional District represented by Rep. Rob Wittman, who signed Rep. Hunter's letter to Gates. \n \n \"After hearing the case of these three Navy SEALs, one of which is a constituent of mine, I and many of my colleagues were concerned with the message this would send to our soldiers, sailors, Marines, and airmen who serve in harms way every day,\" Wittman told CNSNews.com in a statement. \n \n \"These service members often risk their lives in dangerous and uncertain situations, and in this case, they captured one of the most wanted terrorists in Iraq. I am eagerly awaiting the secretary of defense's response to the letter I signed in defense of these SEALs,\" Wittman continued. \"While I do not believe that the prosecution of these men is warranted, I do have full faith and confidence that the military justice system will bring all the facts to light.\"\n \n Huertas is from Blue Island, Ill., part of that state's 1st Congressional District, which is represented by Rep. Bobby Rush, a Democrat. Rush did not sign either of the letters. Rush's spokeswoman Sharon Jenkins told CNSNews.com that he will not be making a statement on the matter now, but \"will continue to monitor the legal proceedings.\"\n \n The Burton letter said the SEALs should have been hailed as heroes instead of being vilified for allegedly assaulting Abed, who was in custody during the alleged Sept. 1 incident. \n \n \"Al Qaeda's own handbook instructs their operatives to allege detainee abuse if detained by American forces,\" Burton's letter says. \"We've seen repeated cases of this since the conflicts in Iraq and Afghanistan began.\"\n \n \"General, surely you agree that we are in a war that we must win,\" says the Burton letter. \"Our military personnel are putting their lives on the line every day trying to track down terrorists who want to indiscriminately kill Americans. Our troops and our SEALs need to be bold and decisive in combat; not looking over their shoulder fearing legal jeopardy for every action or gesture.\"\n \n The letter from the congressmen to Gen. Cleveland may have more chance of succeeding than the letter from the congressmen to Defense Secretary Gates. \n \n Under the Uniform Code of Military Justice, it is the \"convening authority\" who has the power to take action in a court martial. In this case, that is Gen. Cleveland. While Gates technically may have the authority to get involved, the exercise of that authority is complicated by a military court rule called \"unlawful command influence.\" The rule says that no high ranking commander--such as Secretary Gates--may interfere with a court martial or military tribunal conducted by a lower level commander--such as Gen. Cleveland--regarding \"functions of the court-martial or tribunal or such persons in the conduct of the proceedings.\"\n \n CNSNews.com - 40 Congressmen Call on Special Ops Commander to Dismiss Case Brought Against Navy SEALs over Alleged Punching of Terrorist", 
   {
    "post_info": {
     "post_title": "What the democrats really feel about the military"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1260884700.0
  ], 
  [
   382683, 
   null, 
   "sinjin", 
   "We do not have all the facts.\n \n I'll leave this to Gen. Cleveland.\n \n But how we get to what Dems really feel for the military, I don't see.\n \n Partisan posturing is at work as well of course.", 
   {}, 
   382663, 
   null, 
   1260901380.0
  ], 
  [
   382687, 
   null, 
   "JPSartre12", 
   "We do not have all the facts.\n \n I'll leave this to Gen. Cleveland.\n \n But how we get to what Dems really feel for the military, I don't see.\n \n Partisan posturing is at work as well of course.\n\n \n Only Republicans signed the letter requesting that the charges be dropped. His message is pretty clear to me. Democrats, as a party, despise the military and have since Vietnam. This isn't anything new. Carter decimated the military; Reagan rebuilt it. Clinton tried to put it under UN control; Bush restored it. \n So far, though, Obama appears to be making the right moves, albeit at a snail's pace.", 
   {}, 
   382683, 
   null, 
   1260907980.0
  ], 
  [
   382692, 
   null, 
   "sinjin", 
   "So because the Dems have left decisions concerning internal military discipline \n to the Commanding Officer, they despise the military.\n \n Got it!emoticon_xgood", 
   {}, 
   382687, 
   null, 
   1260910320.0
  ], 
  [
   382695, 
   null, 
   "sinjin", 
   "I read they have witnesses.", 
   {}, 
   382692, 
   null, 
   1260913080.0
  ], 
  [
   382696, 
   null, 
   "JPSartre12", 
   "I read they have witnesses.\n\n \n Witnesses Hell. If I was there, I'd have gut him like a deer not just poked him in the stomach. I think the Navy Seals used incredible restraint given the fact that the guy in their custody burned and drug 4 Americans around.:xcensored", 
   {}, 
   382695, 
   null, 
   1260917340.0
  ], 
  [
   382699, 
   null, 
   "sinjin", 
   "Witnesses Hell. If I was there, I'd have gut him like a deer not just poked him in the stomach. I think the Navy Seals used incredible restraint given the fact that the guy in their custody burned and drug 4 Americans around.:xcensored\nI don't believe you. You'd have followed orders which mostly likely would not have given you leave to murder your prisoner.\n \n The four were Blackwater, which makes them more than just any old Americans.\n http://www.religiondispatches.org/archive/politics/1769/blackwater%E2%80%99s_free-market_crusade", 
   {}, 
   382696, 
   null, 
   1260918480.0
  ], 
  [
   382725, 
   null, 
   "OldSarge", 
   "I don't believe you. You'd have followed orders which mostly likely would not have given you leave to murder your prisoner.\n \n The four were Blackwater, which makes them more than just any old Americans.\n Blackwater?s Free-Market Crusade | Politics | ReligionDispatches\n\n \n Sounds like you are doing what you accused me off from where I sit sin. Carry on tho. Don't forget the spellchek.", 
   {}, 
   382699, 
   null, 
   1260931920.0
  ], 
  [
   382726, 
   null, 
   "sinjin", 
   "Sounds like you are doing what you accused me off from where I sit sin. Carry on tho. Don't forget the spellchek.\nWhat did I accuse you off? I saw my typo but wouldn't dream of going back.", 
   {}, 
   382725, 
   null, 
   1260933000.0
  ], 
  [
   382732, 
   null, 
   "JPSartre12", 
   "I don't believe you. You'd have followed orders which mostly likely would not have given you leave to murder your prisoner.\n \n The four were Blackwater, which makes them more than just any old Americans.\n Blackwater?s Free-Market Crusade | Politics | ReligionDispatches\n\n \n Wow! For someone not pre-disposed to believing in conspiracies, you sure bought this one. And it's irrelevent to the discussion. The 4 were ex-military, American citizens, killed, dragged from their vehicles, burned and drug around the street. All your story above does is try to cloud the real issue.", 
   {}, 
   382699, 
   null, 
   1260940320.0
  ], 
  [
   382748, 
   null, 
   "OldSarge", 
   "What did I accuse you off? I saw my typo but wouldn't dream of going back.\n\n \n Do not even try it sin. Any typo or spelling error I made you pounced on. Just go back over your postings.", 
   {}, 
   382726, 
   null, 
   1260963720.0
  ], 
  [
   382749, 
   null, 
   "OldSarge", 
   "So because the Dems have left decisions concerning internal military discipline \n to the Commanding Officer, they despise the military.\n \n Got it!emoticon_xgood\n\n \n Sarcasm doesn't become you. Try and find which party that held the WH gave the largest pay raises to the military and get back to us. While you are about that see what the slickster was on about the military. Good for getting the blue dress off the front pages is all. While you are at that ask John or Jack Murtha about apologizing for condemning the Marines as murderers. Your pal John Fornicationface Kerry sure did a few numbers too.", 
   {}, 
   382692, 
   null, 
   1260964020.0
  ], 
  [
   382750, 
   null, 
   "OldSarge", 
   "\"I didn't see a lot of warmth in that crowd out there that the President chose to address tonight. And I thought that that was interesting. He went to, maybe, the enemy camp tonight to make his case. I mean, that is - that's where Paul Wolfowitz used to write speeches for - back in the old Bush days - that's where he went to rabble rouse the 'We're going to democratize the world' campaign back in '02. So, I thought it was a strange venue.\"\n - MSNBC's Chris Matthews during live coverage following President Obama's speech at West Point, December 1. Matthews apologized the following evening. [Audio/video (0:34): Windows Media | MP3 audio]\n And here's tingles weighing in.", 
   {
    "post_info": {
     "post_title": "Matthews: West Point Academy = \u0093the Enemy Camp\u0094"
    }, 
    "unicode_changes_made": true
   }, 
   382749, 
   null, 
   1260965880.0
  ], 
  [
   382795, 
   null, 
   "sinjin", 
   "Wow! For someone not pre-disposed to believing in conspiracies, you sure bought this one. And it's irrelevent to the discussion. The 4 were ex-military, American citizens, killed, dragged from their vehicles, burned and drug around the street. All your story above does is try to cloud the real issue.\nWere these men targeted specifically because they were Blackwater? \n Hardly irrelevant given the company's reputation for brutality in Iraq.\n \n A prisoner's alleged crime is what's irrelevant to a soldier assigned guard duty.\n \n I got your conspiracy theory right here:\n \n http://freeinternetpress.com/story.php?sid=23854\n \n Representative Rush D. Holt, a New Jersey Democrat who is chairman of the House Select Intelligence Oversight Panel, said in an interview that &#8220;the use of contractors in intelligence and paramilitary operations is a scandal waiting to be examined.&#8221; While he declined to comment on specific operations, Holt said that the use of contractors in such operations &#8220;got way out of hand.&#8221; \n He added, &#8220;It&#8217;s been very troubling to a lot of people.&#8221;", 
   {}, 
   382732, 
   null, 
   1260985860.0
  ], 
  [
   382797, 
   null, 
   "sinjin", 
   "Sarcasm doesn't become you. Try and find which party that held the WH gave the largest pay raises to the military and get back to us. While you are about that see what the slickster was on about the military. Good for getting the blue dress off the front pages is all. While you are at that ask John or Jack Murtha about apologizing for condemning the Marines as murderers. Your pal John Fornicationface Kerry sure did a few numbers too.\nAnd this has what to do with the case of these Seals? \n \n My pal Kerry?\n \n You can put me in a box of your own construction but \n I'm still my own man, my man.", 
   {}, 
   382749, 
   null, 
   1260986160.0
  ], 
  [
   382799, 
   null, 
   "sinjin", 
   "Do not even try it sin. Any typo or spelling error I made you pounced on.\nSpelling only IIRC. I'm sorry you didn't see the humor in misspelling misspell.\n \n \nJust go back over your postings.\nGood advice.", 
   {}, 
   382748, 
   null, 
   1260986460.0
  ], 
  [
   382808, 
   null, 
   "OldSarge", 
   "And this has what to do with the case of these Seals? \n \n My pal Kerry?\n \n You can put me in a box of your own construction but \n I'm still my own man, my man.\n\n \n It has all to do with the topic of this thread but you knew that my man. I am afraid you built your own box around you. ", 
   {}, 
   382797, 
   null, 
   1260989100.0
  ], 
  [
   382810, 
   null, 
   "OldSarge", 
   "Were these men targeted specifically because they were Blackwater? \n Hardly irrelevant given the company's reputation for brutality in Iraq.\n Which has what to do with either the SEALs or the topic?\n A prisoner's alleged crime is what's irrelevant to a soldier assigned guard duty.\n From what I gather there was no \"guard duty\" involved. It was a mission to capture and turn over a terrorist.\n I got your conspiracy theory right here:\n \n Free Internet Press :: Blackwater Guards Tied To C.I.A. Raids :: Uncensored News For Real People\n \n Representative Rush D. Holt, a New Jersey Democrat who is chairman of the House Select Intelligence Oversight Panel, said in an interview that \"the use of contractors in intelligence and paramilitary operations is a scandal waiting to be examined.\" While he declined to comment on specific operations, Holt said that the use of contractors in such operations \"got way out of hand.\" \n He added, \"It's been very troubling to a lot of people.\"\n\n \n The use or non use of contractors is merely a red herring. What is troubling is the knowledge terrorists are trained to make claims of brutality and other abuses to create bad PR. That you and a lot of the left bit into and swallowed it whole hog is appalling. ", 
   {
    "unicode_changes_made": true
   }, 
   382795, 
   null, 
   1260989460.0
  ], 
  [
   382812, 
   null, 
   "JPSartre12", 
   "And this has what to do with the case of these Seals? \n \n My pal Kerry?\n \n You can put me in a box of your own construction but \n I'm still my own man, my man.\n\n \n It has about as much relevence as your attempt to paint 4 murdered Americans as the real criminals here. Jeez!", 
   {}, 
   382797, 
   null, 
   1260989760.0
  ], 
  [
   382814, 
   null, 
   "sinjin", 
   "It has about as much relevence as your attempt to paint 4 murdered Americans as the real criminals here. Jeez!\nThat is not my intent. I don't hold mercs in the same esteem as regular U.S. military personnel. \n Blackwater personnel have been charged with crimes.\n \n None of this has a thing to do with treatment of prisoners or allowing the military to handle internal discipline without congressional, partisan showboating getting in the way.", 
   {}, 
   382812, 
   null, 
   1260990240.0
  ], 
  [
   382815, 
   null, 
   "sinjin", 
   "The use or non use of contractors is merely a red herring. What is troubling is the knowledge terrorists are trained to make claims of brutality and other abuses to create bad PR. That you and a lot of the left bit into and swallowed it whole hog is appalling. \nI'm not disallowing that possibility. I'm trusting their commanding officer to get to the bottom of things.", 
   {}, 
   382810, 
   null, 
   1260990360.0
  ], 
  [
   382816, 
   null, 
   "JPSartre12", 
   "That is not my intent. I don't hold mercs in the same esteem as regular U.S. military personnel. \n Blackwater personnel have been charged with crimes.\n\n \n So what!! Were these 4 slaughtered and paraded Americans charged with any of those crimes? If not than who gives a flying F#$%!\n \n\n None of this has a thing to do with treatment of prisoners or allowing the military to handle internal discipline without congressional, partisan showboating getting in the way.\n\n \n If I just caught the bastard that killed, burned and dragging my fellow Americans through the streets, I wouldn't treat him with kid gloves......unless they were sand-filled gloves, that is.", 
   {}, 
   382814, 
   null, 
   1260990480.0
  ], 
  [
   382824, 
   null, 
   "sinjin", 
   "So what!! Were these 4 slaughtered and paraded Americans charged with any of those crimes? If not than who gives a flying F#$%!\nYes, 4 Americans not in military uniform, there fighting for pay and not their country. How do we treat \"enemy combatants\" captured in civilian clothes? Do they get status a POW's. Are they treated in accordance with the Geneva Convention? \n \n \nIf I just caught the bastard that killed, burned and dragging my fellow Americans through the streets, I wouldn't treat him with kid gloves......unless they were sand-filled gloves, that is.\nAt the risk of sounding \"soft on terror\", I do not support beating or otherwise torturing prisoners. \n Bluster and bravado impresses me little when it advocates actions lacking honor.\n \n More on PMC's:\n \n \"These guys run loose in this country and do stupid stuff. There's no authority over them, so you can't come down on them hard when they escalate force,\" said Brig. Gen. Karl R. Horst, deputy commander of the 3rd Infantry Division, which is responsible for security in and around Baghdad. \"They shoot people, and someone else has to deal with the aftermath. It happens all over the place.\"\n http://www.washingtonpost.com/wp-dyn/content/article/2005/09/09/AR2005090902136.html\n \n Horst declined to provide the name of the contractors whose employees were involved in the 12 shootings he documented in the Baghdad area. But he left no doubt that he believed the May 12 incident, in which three people were killed, led directly to the attack on his soldiers that came days later on the same block. \n \n \"Do you think that's an insurgent action? Hell no,\" Horst said. \"That's someone paying us back because their people got killed. And we had absolutely nothing to do with it.\"\n \n sinjin - It's not too hard to imagine that the 4 Blackwater guys got nailed as pay back for the actions of others, Blackwater or some other PMC.", 
   {}, 
   382816, 
   null, 
   1260993840.0
  ], 
  [
   382834, 
   null, 
   "OldSarge", 
   "I'm not disallowing that possibility. I'm trusting their commanding officer to get to the bottom of things.\n\n \n Just like the Haditha Marines had their Commanding Officer get to the bottom of things after Jack murtha branded them murderers in the media. As to show boating, no one held a pistol to the heads of the democrats and forced them to keep mum. They had the opportunity to jump in. What held them back?", 
   {}, 
   382815, 
   null, 
   1260997860.0
  ], 
  [
   382838, 
   null, 
   "sinjin", 
   "Just like the Haditha Marines had their Commanding Officer get to the bottom of things after Jack murtha branded them murderers in the media. As to show boating, no one held a pistol to the heads of the democrats and forced them to keep mum. They had the opportunity to jump in. What held them back?\nAs I said, we do not have all the facts. Maybe they don't either.", 
   {}, 
   382834, 
   null, 
   1260999480.0
  ], 
  [
   382843, 
   null, 
   "sinjin", 
   "This sums up my opinion of PMC's:\n \n Blackwater taints soldier integrity - Opinions\n \n \"Blackwater employees are not subjected to the American Uniform Code of Military Justice \n and have immunity on Iraqi soil - they answer to no one.\"", 
   {}, 
   382838, 
   null, 
   1260999960.0
  ], 
  [
   382847, 
   null, 
   "JPSartre12", 
   "Yes, 4 Americans not in military uniform, there fighting for pay and not their country. How do we treat \"enemy combatants\" captured in civilian clothes? Do they get status a POW's. Are they treated in accordance with the Geneva Convention? \n\n \n Their job was escorting supply trucks carrying kitchen equipment. Damn! Now you're becoming a drama queen, too. \n \n\n At the risk of sounding \"soft on terror\", I do not support beating or otherwise torturing prisoners. \n Bluster and bravado impresses me little when it advocates actions lacking honor.\n \n More on PMC's:\n \n \"These guys run loose in this country and do stupid stuff. There's no authority over them, so you can't come down on them hard when they escalate force,\" said Brig. Gen. Karl R. Horst, deputy commander of the 3rd Infantry Division, which is responsible for security in and around Baghdad. \"They shoot people, and someone else has to deal with the aftermath. It happens all over the place.\"\n Security Contractors in Iraq Under Scrutiny After Shootings - washingtonpost.com\n \n Horst declined to provide the name of the contractors whose employees were involved in the 12 shootings he documented in the Baghdad area. But he left no doubt that he believed the May 12 incident, in which three people were killed, led directly to the attack on his soldiers that came days later on the same block. \n \n \"Do you think that's an insurgent action? Hell no,\" Horst said. \"That's someone paying us back because their people got killed. And we had absolutely nothing to do with it.\"\n \n sinjin - It's not too hard to imagine that the 4 Blackwater guys got nailed as pay back for the actions of others, Blackwater or some other PMC.\n\n \n They were in Fallujah, a hotbed of anti-American sentiment and got lost. That's all it took for the opportunists to attack them. The rest is just smoke and mirrors.", 
   {}, 
   382824, 
   null, 
   1261001400.0
  ], 
  [
   382861, 
   null, 
   "sinjin", 
   "Their job was escorting supply trucks carrying kitchen equipment.\nWhat happened to the trucks and drivers in this incident?", 
   {}, 
   382847, 
   null, 
   1261005720.0
  ], 
  [
   382862, 
   null, 
   "JPSartre12", 
   "What happened to the trucks and drivers in this incident?\n\n \n The two Blackwater vehicles got lost and wound up separated from them was all I could deduce. The contract that they were working under was to escort trucks carrying kitchen equipment.", 
   {}, 
   382861, 
   null, 
   1261005840.0
  ], 
  [
   382864, 
   null, 
   "sinjin", 
   "The two Blackwater vehicles got lost and wound up separated from them was all I could deduce.\nAnd you'd be wrong.\n \n \n Upon entering the city of Fallujah, the convoy was stopped at an Iraqi police checkpoint. The Blackwater personnel in the lead vehicle, occupied by Wes Batalona (driver) and Scott Helvenston (passenger), spoke with an officer and then were allowed to proceed. Only several blocks further down the road, the traffic again stopped. At the time, the convoy had separated into two lanes of traffic, with the lead Blackwater vehicle ahead of two of the convoy trucks in the left lane. In the lane to their right, the third convoy truck was ahead of the rear Blackwater vehicle, occupied by Mike Teague (driver) and Jerry Zovko (passenger). According to one account, three vehicles, a dark Mercedes 300, a tan Opel sedan, and a 1990 white pickup truck with a double cab, had assisted in setting a roadblock, presumably ahead of the Blackwater vehicles. \n \n While at a standstill in traffic, the lead Blackwater vehicle was approached by four to five boys for whom the security personnel rolled down their windows. One of them spoke briefly with Mr. Helvenston. Two of the boys then walked toward a large group of people and spoke to two men. At that point, the crowd seemed to focus its attention on the lead Blackwater vehicle. After several minutes, the Blackwater escort vehicles were attacked by insurgents bearing AK-47s. The initial shots apparently were fired at the rear Blackwater vehicle. After the firing began, the lead Blackwater escort vehicle attempted to make a U-turn across the median but was blocked by the oncoming traffic. By one account, the vehicle blew out a tire in the process.62 This vehicle also came under attack by small arms fire. One insurgent, who had fired upon the vehicle from the rear, approached the stopped vehicle on the driver&#8217;s side and fired four or five shots directly at the driver. The truck drivers indicated that there were at least five insurgents, and probably more, involved in the attack. At least one of the assailants was carrying a video camera along with his AK-47.63 According to the CPA report, contrary to initial accounts, heavier weapons, such as rocket-propelled grenades (RPGs), were not used in the attack. \n \n The available evidence, including bullet holes found in rear hatch doors and rear side doors, indicates that the attack was initiated from the rear blind spots of the vehicles, with fire initially focusing on the passengers, then on the drivers. Point blank shots were then fired through the windows. There was no evidence of return fire by the Blackwater personnel. \n \n The truck drivers were able to drive out of the area. As they sought to exit Fallujah, they passed the site of the ambush again and witnessed both Blackwater vehicles on fire and a crowd of people chanting and yelling.66 Although one of the trucks was struck by a bullet during the attack &#8212; as shown in pictures taken when they had returned to base &#8212; the truck drivers were apparently not targeted.\n http://abcnews.go.com/images/Blackwater_Fallujah_Waxman_Report_070926.pdf\n \n sinjin - None of the three truck drivers were American.", 
   {}, 
   382862, 
   null, 
   1261007880.0
  ], 
  [
   382868, 
   null, 
   "OldSarge", 
   "As I said, we do not have all the facts. Maybe they don't either.\n\n \n That didn't stop the chosen one in Gatesgate. Like I said they could have done the right thing but party politics held them back.", 
   {}, 
   382838, 
   null, 
   1261015020.0
  ], 
  [
   382939, 
   null, 
   "sinjin", 
   "That didn't stop the chosen one in Gatesgate. Like I said they could have done the right thing but party politics held them back.\nParty politics restrain some and spur some. Not exactly news. But Democrats despising the military is a stretch based on this one incident IMO. YMMV.", 
   {}, 
   382868, 
   null, 
   1261072620.0
  ], 
  [
   382943, 
   null, 
   "JPSartre12", 
   "And you'd be wrong..........\n http://abcnews.go.com/images/Blackwater_Fallujah_Waxman_Report_070926.pdf\n \n sinjin - None of the three truck drivers were American.\n\n \n Thanks for the link. Interesting reading. Sure looks like Blackwater screwed the pooch on that operation. But that doesn't change the fact that American citizens were targeted, assassinated and their bodies desecrated by the Navy Seal's prisoner and they face a court martial for a shot to his gut? emoticon_angry", 
   {}, 
   382864, 
   null, 
   1261074180.0
  ], 
  [
   382946, 
   null, 
   "sinjin", 
   "Thanks for the link. Interesting reading. Sure looks like Blackwater screwed the pooch on that operation. But that doesn't change the fact that American citizens were targeted, assassinated and their bodies desecrated by the Navy Seal's prisoner and they face a court martial for a shot to his gut? emoticon_angry\nI thought you'd find it interesting reading, I did as well. And no, it doesn't change a thing with respect to those unfortunate \"soldiers\". While I might share your feelings towards the perpetrators of the act, I cannot condone any dereliction of duty, however understandably motivated. I suprised you can.", 
   {}, 
   382943, 
   null, 
   1261075620.0
  ], 
  [
   382948, 
   null, 
   "OldSarge", 
   "Party politics restrain some and spur some. Not exactly news. But Democrats despising the military is a stretch based on this one incident IMO. YMMV.\n\n \n Go back and count. Not the democrat way either... one another another another... yep one.", 
   {}, 
   382939, 
   null, 
   1261076280.0
  ], 
  [
   382949, 
   null, 
   "JPSartre12", 
   "I thought you'd find it interesting reading, I did as well. And no, it doesn't change a thing with respect to those unfortunate \"soldiers\". While I might share your feelings towards the perpetrators of the act, I cannot condone any dereliction of duty, however understandably motivated. I suprised you can.\n\n \n I don't see it as dereliction of duty. It doesn't rise anywhere near that level, IMO. I'd call it a mild \"tune-up\" at worst. ;)", 
   {}, 
   382946, 
   null, 
   1261076340.0
  ], 
  [
   382958, 
   null, 
   "sinjin", 
   "I don't see it as dereliction of duty. It doesn't rise anywhere near that level, IMO. I'd call it a mild \"tune-up\" at worst. ;)\nThis is the formal charge. Permissible \"tuning\" is nowhere in the UCMJ.", 
   {}, 
   382949, 
   null, 
   1261079520.0
  ], 
  [
   382959, 
   null, 
   "sinjin", 
   "Go back and count. Not the democrat way either... one another another another... yep one.\nI'm sure we'd disagree on what \"counts\". You mentioned Haditha. \n Do you believe that what happened there was SOP and no one involved acted outside the rules of engagement?", 
   {}, 
   382948, 
   null, 
   1261079700.0
  ], 
  [
   382961, 
   null, 
   "JPSartre12", 
   "This is the formal charge. Permissible \"tuning\" is nowhere in the UCMJ.\n\n \n But discretion is part of the process. They don't HAVE to prosecute these men. IMO, this is military PC gone awry. emoticon_angry", 
   {}, 
   382958, 
   null, 
   1261080180.0
  ], 
  [
   382963, 
   null, 
   "sinjin", 
   "But discretion is part of the process. They don't HAVE to prosecute these men. IMO, this is military PC gone awry. emoticon_angry\nCaptain's mast ain't that big a deal. You can wind up there for getting carried away on shore leave. And if not beating prisoners is PC, then it must be the old-fashioned kind since that rule has been in place forever.", 
   {}, 
   382961, 
   null, 
   1261080900.0
  ], 
  [
   382974, 
   null, 
   "JPSartre12", 
   "Captain's mast ain't that big a deal. You can wind up there for getting carried away on shore leave. And if not beating prisoners is PC, then it must be the old-fashioned kind since that rule has been in place forever.\n\n \n If you conside one punch to the gut as a beating, then I guess you lived in a good neighborhood and had no siblings while growing up. ;)", 
   {}, 
   382963, 
   null, 
   1261084500.0
  ], 
  [
   382978, 
   null, 
   "sinjin", 
   "If you conside one punch to the gut as a beating, then I guess you lived in a good neighborhood and had no siblings while growing up. ;)\nSo one is not a wife-beater if one only punches her once, per transgression that is.", 
   {}, 
   382974, 
   null, 
   1261085640.0
  ], 
  [
   382986, 
   null, 
   "OldSarge", 
   "I'm sure we'd disagree on what \"counts\". You mentioned Haditha. \n Do you believe that what happened there was SOP and no one involved acted outside the rules of engagement?\n\n \n Strange didn't I mention your main man John Fornicationface Kerry? \n \n What I believe is 7 out of 8 had the charges dropped or dismissed and one is pending if memory serves me right. Of course that Jack should be Meoff instead of Murtha had them tried and convicted as murderers in the media before the investigation was complete doesn't count eh? Then we have newly clean and sober Ted Kennedy's tirades about the abuses of our military. Then there was Al Gore's team of lawyers going into Florida to disqualify the absentee ballots. Now who would vote absentee? Did you miss Tingles saying West Point is the enemy camp? Did we forget about General Betray-us?\n \n How are you coming on military pay raises under democrats versus republican presidents? Or did I dream that? \n \n I Bet Toledo&#8217;s Mayor is a Democrat | The Virtuous Republic\n Carty Finkbeiner - Wikipedia, the free encyclopedia\n Democratic Party Leaders Loathe US Military | Clipmarks\n Fred Phelps - Wikipedia, the free encyclopedia", 
   {}, 
   382959, 
   null, 
   1261088880.0
  ], 
  [
   382996, 
   null, 
   "JPSartre12", 
   "So one is not a wife-beater if one only punches her once, per transgression that is.\n\n \n I went to school in da hood. A good beatdown required a trip in an ambulance with sirens and flashing lights. ;)", 
   {}, 
   382978, 
   null, 
   1261091100.0
  ], 
  [
   383003, 
   null, 
   "sinjin", 
   "[B]Strange didn't I mention your main man John Fornicationface Kerry?\nNot my main man as I said before and I really don't care about the sex lives of elected officials unless they rail against the things it turns out they do themselves.\n \n \nWhat I believe is 7 out of 8 had the charges dropped or dismissed and one is pending if memory serves me right. Of course that Jack should be Meoff instead of Murtha had them tried and convicted as murderers in the media before the investigation was complete doesn't count eh? Then we have newly clean and sober Ted Kennedy's tirades about the abuses of our military. Then there was Al Gore's team of lawyers going into Florida to disqualify the absentee ballots. Now who would vote absentee? Did you miss Tingles saying West Point is the enemy camp? Did we forget about General Betray-us? \n\n A simple yes or no, please. Do you believe the Marines acted in accordance with their rules of engagement at Haditha?", 
   {}, 
   382986, 
   null, 
   1261093140.0
  ], 
  [
   383007, 
   null, 
   "OldSarge", 
   "Not my main man as I said before and I really don't care about the sex lives of elected officials unless they rail against the things it turns out they do themselves.\n I didn't mention his sex life. Just his long ugly face. \n \n A simple yes or no, please. Do you believe the Marines acted in accordance with their rules of engagement at Haditha?\n\n \n Quit trying to escape and evade via your famed weasel holes. I gave you proof of my contention and that is enough. If you want a different thread on Haditha go for it. What I believe or not believe is not pertinent to this thread. Just as your side trip of condemnation of Blackwater, mercs or contractors wasn't. \n \n How are you coming on military pay raises under democrats versus republican presidents? Or did I dream that? \n \n \n The Rules of Engagement (ROE) allow for this and the SOP (Standard Operating Procedure) that US Military train for is to follow the source of the enemy fire, enter the room and toss a fragmentation grenade into the room. This is the way war works. \n http://www.californiaconservative.org/military/the-unraveling-of-haditha-part-i/", 
   {}, 
   383003, 
   null, 
   1261094100.0
  ], 
  [
   383032, 
   null, 
   "sinjin", 
   "And what of \"Positive Target Identification\"?", 
   {}, 
   383007, 
   null, 
   1261099260.0
  ], 
  [
   383033, 
   null, 
   "sinjin", 
   "How are you coming on military pay raises under democrats versus republican presidents? Or did I dream that?\nSo now your horse will be military pay raises? If Democratic Presidents gave fewer or \n less it means they \"despise\" the military? Is that your contention? \n Did you feel the same way towards your parents with regard to increases in your allowance?", 
   {}, 
   383007, 
   null, 
   1261099680.0
  ], 
  [
   383052, 
   null, 
   "OldSarge", 
   "So now your horse will be military pay raises? If Democratic Presidents gave fewer or \n less it means they \"despise\" the military? Is that your contention? \n Did you feel the same way towards your parents with regard to increases in your allowance?\n\n \n Always the spin in search of the weasel hole sin. ", 
   {}, 
   383033, 
   null, 
   1261109100.0
  ], 
  [
   383053, 
   null, 
   "OldSarge", 
   "And what of \"Positive Target Identification\"?\n\n \n Belongs on your haditha thread. What of Jack Murtha's labeling them murderers without benifit of trial. Or in other words take the guilty SOBs out and hang them in the media. ", 
   {}, 
   383032, 
   null, 
   1261109280.0
  ], 
  [
   383829, 
   null, 
   "jim's trucking", 
   "Liberalism is a mental disorder.", 
   {}, 
   383053, 
   null, 
   1262000100.0
  ], 
  [
   383853, 
   null, 
   "jazyjason", 
   "Liberalism is a mental disorder.\n\n \n And ignorance and blind allegiance to a political party is cancer.... Your trunk tied in a knot yet?", 
   {}, 
   383829, 
   null, 
   1262006820.0
  ], 
  [
   384027, 
   null, 
   "OldSarge", 
   "And ignorance and blind allegiance to a political party is cancer.... Your trunk tied in a knot yet?\n\n \n A case of head in rectum defilade?", 
   {}, 
   383853, 
   null, 
   1262096340.0
  ], 
  [
   386137, 
   null, 
   "OldSarge", 
   "\"The University of Washington's student senate rejected a memorial for alumnus Gregory \"Pappy\" Boyington of \"Black Sheep Squadron\" fame amid concerns a military hero who shot down enemy planes was not the right kind of person to represent the school. \n \n Student senator Jill Edwards, according to minutes of the student government's meeting last week, said she \"didn't believe a member of the Marine Corps was an example of the sort of person UW wanted to produce.\" \n Students reject honor to 'Baa Baa Black Sheep' hero", 
   {
    "post_info": {
     "post_title": "fuel on the fire"
    }
   }, 
   384027, 
   null, 
   1263739380.0
  ], 
  [
   386142, 
   null, 
   "Archangel", 
   "Liberalism is a mental disorder.\n\n \n \nAnd ignorance and blind allegiance to a political party is cancer.... Your trunk tied in a knot yet?\n\n \n Jim didn't endorse a political party with his statement in any way. He simply commented on the reality of the mental condition of liberals. And are you actually implying that we can find even one liberal who isn't a member of the democratic party? So by what standard of rationale do you expect conservatives to abandon a unified party when you militant liberals are so committed to one?", 
   {}, 
   383853, 
   null, 
   1263741180.0
  ], 
  [
   386257, 
   null, 
   "jazyjason", 
   "Jim didn't endorse a political party with his statement in any way. He simply commented on the reality of the mental condition of liberals. And are you actually implying that we can find even one liberal who isn't a member of the democratic party? So by what standard of rationale do you expect conservatives to abandon a unified party when you militant liberals are so committed to one?\n\n \n Mental condition. yeah do a CAT scan on the teabag hat lady and get back to me Archie.... And I actually don't belong to a party. I find political parties to be machines and greasy and dirty. I just vote how I choose based upon the candadiate and the issue at hand....\n \n I don't pledge alligance to a donkey or an elephant. Nor a politician cause they have a big fat D or R next to their name.... Perhaps you should do the same....", 
   {}, 
   386142, 
   null, 
   1263796680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What the democrats really feel about the military", 
  "url": "http://www.4forums.com/political/news-forum/13706-what-democrats-really-feel-about-military.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 13706, 
  "discussion_files": [
   [
    "6706.html", 
    "http://www.4forums.com/political/news-forum/13706-what-democrats-really-feel-about-military-print.html"
   ], 
   [
    "6707.html", 
    "http://www.4forums.com/political/news-forum/13706-what-democrats-really-feel-about-military-4-print.html"
   ], 
   [
    "6708.html", 
    "http://www.4forums.com/political/news-forum/13706-what-democrats-really-feel-about-military-3-print.html"
   ], 
   [
    "6709.html", 
    "http://www.4forums.com/political/news-forum/13706-what-democrats-really-feel-about-military-2-print.html"
   ]
  ], 
  "identifier": 13706
 }
]