[
 [
  [
   382597, 
   null, 
   "JPSartre12", 
   "The Supreme Court has paved the way for the EPA to circumvent the Constitution and become the only non-elected legislative branch of government. Oh wait, the SCOTUS already did that in Roe v Wade. emoticon_confused\n \n \n\n EPA chief offers new way to take on carbon emissions\n By John Heilprin, Associated Press Writer\n Wednesday, December 9, 2009\n COPENHAGEN (AP)-The United States for the first time outlined a dual path Wednesday toward cutting greenhouse gases that would involve both the Obama administration and Congress.\n Speaking at a U.N. climate conference in Copenhagen, Environmental Protection Agency Administrator Lisa Jackson described the EPA's decision that greenhouse gases should be regulated as complementary to U.S. legislation-not an effort to supplant the work of Congress.\n \"This is not an either/or moment. This is a both/and moment,\" she told more than 100 people who packed a U.S. meeting room in the conference center. Negotiators at the 192-nation U.N. conference are also working to bridge the chasm between rich and poor countries over how to share the burden of fighting climate change.\n The EPA on Monday gave President Barack Obama a new way to cut back on greenhouse gas emissions when it determined that scientific evidence clearly shows they are endangering the health of Americans, and that the pollutants-mainly carbon dioxide from burning fossil fuels-should be regulated under the Clean Air Act. That means the EPA could regulate those gases without the approval of Congress.\n The EPA decision was welcomed by other nations in Copenhagen that have called on the U.S. to boost its efforts to cut greenhouse gas emissions.\n The full Senate has yet to take up legislation that cleared its environment committee and calls for greenhouse gases to be cut by 20 percent by 2020, a target that was scaled back to 17 percent in the House after opposition from coal-state Democrats.\n \"We need legislation\" to remove any uncertainty that businesses might have, Jackson added. \"The reason for legislation is to take that question out of their minds. ... We will work closely with our Congress to pass legislation to lower our greenhouse gases more than 80 percent by 2050.\"\n EPA chief offers new way to take on carbon emissions | R&D Mag\n \n\n \n So, it looks like this administration isn't above circumventing the legislative process in order to get his agenda enacted. Maybe Daewoo is right after all. Maybe Obama is a fascist and not a socialist. \n His pay czar is telling companies what they can pay their execs. Now, the Environmental czar is going to tell industries how much CO2 they can discharge.\n What's next?", 
   {
    "post_info": {
     "post_title": "EPA Threatens End around Congress"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1260832860.0
  ], 
  [
   382641, 
   null, 
   "marc9000", 
   "To me, this is nothing new. In the mid 70's (75 IIRC) a really restrictive auto emissions testing program went into effect in the city of Cincinnati. That wasn't very long (about 5 years) after the EPA was formed. I remember it so well not because I was affected (I live across the river) but because of a firey newspaper column about it by one of Cincy's normally humourous columnists. I remember him describing how the legislative process meant nothing concerning the EPA, even back then. Since then, auto emisssion testing programs seem to have come and gone over several areas in the U.S. They last a few years, then get scrapped just about every time. Nothing but a waste of time & money. Does anyone learn from it? Nooooo. \n \n The EPA seems to really run wild during Democrat administrations, and is at least somewhat held in check during Republican administrations. Has a lot to do with who the EPA administrator is, no doubt. (a presidential cabinet appointee)", 
   {}, 
   382597, 
   null, 
   1260845640.0
  ], 
  [
   383065, 
   null, 
   "daewoo", 
   "The Supreme Court has paved the way for the EPA to circumvent the Constitution and become the only non-elected legislative branch of government. Oh wait, the SCOTUS already did that in Roe v Wade. emoticon_confused\n\n \n The only unelected legislative branch of government? Are you crazy or are you just forgetting about MSHA, OSHA, the BATFE, and a dozen other alphabet soup agencies that make owning a paper copy of the CFR an acquisition that requires a semi. \n \n They have been doing this for a long time. There is no way that a politician would actually stand up and vote for the ridiculous rules those agencies pass. They would never see public office again. So they give sweeping powers to these completely unaccountable agencies.", 
   {}, 
   382597, 
   null, 
   1261118820.0
  ], 
  [
   383084, 
   null, 
   "Bassman", 
   "To me, this is nothing new. In the mid 70's (75 IIRC) a really restrictive auto emissions testing program went into effect in the city of Cincinnati. That wasn't very long (about 5 years) after the EPA was formed. I remember it so well not because I was affected (I live across the river) but because of a firey newspaper column about it by one of Cincy's normally humourous columnists. I remember him describing how the legislative process meant nothing concerning the EPA, even back then. Since then, auto emisssion testing programs seem to have come and gone over several areas in the U.S. They last a few years, then get scrapped just about every time. Nothing but a waste of time & money. Does anyone learn from it? Nooooo. \n \n The EPA seems to really run wild during Democrat administrations, and is at least somewhat held in check during Republican administrations. Has a lot to do with who the EPA administrator is, no doubt. (a presidential cabinet appointee)\nYeah really. Several states, including New York, have stupid emissions inspections on top of the regular safety inspections. Here in NY, any car made from 1996 on has to pass this test. Basically, if the \"check engine\" idi0t light kicks on because of faulty O2 sensors, guess what, no sticker and you have to pay buku bucks just to get the damned thing fixed.", 
   {}, 
   382641, 
   null, 
   1261147500.0
  ], 
  [
   383101, 
   null, 
   "JPSartre12", 
   "The only unelected legislative branch of government? Are you crazy or are you just forgetting about MSHA, OSHA, the BATFE, and a dozen other alphabet soup agencies that make owning a paper copy of the CFR an acquisition that requires a semi. \n \n They have been doing this for a long time. There is no way that a politician would actually stand up and vote for the ridiculous rules those agencies pass. They would never see public office again. So they give sweeping powers to these completely unaccountable agencies.\n\n \n BATFE, OSHA and MSHA have to get Congressional buy-in for any actions and they do so in the form of legislation voted on by Congress. I'm not sure that the EPA has to have Congressional approval, given the statements made recently by members of Congress.\n \n Incidentally, almost 30 years ago, the BATF misclassified ammonium perchlorate based composite rocket propellant as an explosive and as a result, I had to obtain a Low Explosive User Permit from the BATF in order to buy over 65g of hobby rocket propellant. After 10 years in court, we got a judge to declare that the BATF did indeed overstep its authority and now the propellant is NOT classifies as an explosive. Gone is my LEUP, gone is my annual BATF visit. emoticon_xbye", 
   {}, 
   383065, 
   null, 
   1261163220.0
  ], 
  [
   383191, 
   null, 
   "marc9000", 
   "Yeah really. Several states, including New York, have stupid emissions inspections on top of the regular safety inspections. Here in NY, any car made from 1996 on has to pass this test. Basically, if the \"check engine\" idi0t light kicks on because of faulty O2 sensors, guess what, no sticker and you have to pay buku bucks just to get the damned thing fixed.\n\n \n \n \n In Northern Ky, we had an emissions testing program that lasted from 2000 to 2005. That was during a Republican presidential administration, but that was because of the political delays In getting it started, and getting it stopped. It was set up during the Clinton administration, and stopped during the Bush administration. Ours tested cars made all the way back to 1968, (the first year for PCV valves) which is ridiculous, because cars anywhere near that old aren&#8217;t driven enough miles to contribute to any pollution problem. In NY, are cars 1995 and older exempt from it? It makes sense, but it shows how there&#8217;s no way to run a program like this and keep everybody happy &#8211; there are different opinions and political motivations on exactly what cars should be tested. It&#8217;s probably safe to say that cars 5 to 15 years old are the worse polluters, but if owners of really new or really old cars are exempted from an all-encompassing search, it only makes sense that the 5 to 15 year car owners would feel singled out. There&#8217;s a reason the fourth amendment reads the way it does. In Northern Ky, during the Clinton administration, our local liberal paper pushed hard for the program, with their editorials and slanted news reports on the subject. Part of their reporting concerned questions about the wisdom of testing brand new cars. The statement was made that &#8220;all cars must be tested to ensure the effectiveness of the program&#8221;. The paper never questioned it - they knew the program wouldn't get off the ground if it didn't include all cars. Then, two years later after all cars had cycled through the program one time, this same newspaper started crying about how wasteful it was to test new cars &#8211; how they should be exempted, and how owners of older cars should subsequently pay more for their tests, to satisfy the contract of the testing company. There&#8217;s no doubt in my mind the newspaper had it planned that way from the beginning, so they could exempt new cars (including themselves) from the program. Obviously, a staff of a liberal newspaper is going to drive late model cars &#8211; they&#8217;re not going to take an interest, or know anything about, the economics, maintanence, or efficiency of keeping a car for more than a few years. And of course, being elite liberals, they look down their noses at people who do, which is why they wanted the tests. It didn&#8217;t work out for them. New cars continued to be tested until the program completely ended. The fourth amendment to the U.S. Constitution reads like this, and I&#8217;ll highlight the significant parts in this case;\n \n \nThe right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no warrants shall issue, but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized. \n\n \n I think the U.S. founders saw examples in the European countries they came from, where the government was involving itself in the private lives of citizens &#8211; of doing some kinds of all encompassing searches, and that&#8217;s the reason they worded the fourth amendment like they did, and auto safety and emissions testing goes against the spirit of the Constitution IMO. The technology exists today for &#8216;spot checks&#8217; of polluting vehicles, (similar to the way radar can spot speeders) and to me it&#8217;s the only way to combat vehicle pollution. Police can set up check points, and get electronic readings of polluting vehicles. And they can do visuals for safety, as well as excessive smoke, even without checkpoints. That way, they have a probable cause, and a particular description, of the action they take. \n \n The all-encompassing searches of vehicle safety checks and emissions tests, charging people money and taking up their time with no particular description or probable cause, doesn&#8217;t leave us with the liberty that I believe the founders intended for us to have.", 
   {}, 
   383084, 
   null, 
   1261344000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  EPA Threatens End around Congress", 
  "url": "http://www.4forums.com/political/environmental-debates/13705-epa-threatens-end-around-congress.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 13705, 
  "discussion_files": [
   [
    "32225.html", 
    "http://www.4forums.com/political/environmental-debates/13705-epa-threatens-end-around-congress-print.html"
   ]
  ], 
  "identifier": 13705
 }
]