[
 [
  [
   384417, 
   null, 
   "jazyjason", 
   "Looking at some posts from other users I find myself asking \"why do people think that overbearing blind irrational discourse is a proper way to share your faith?\" \n \n Is not sharing your faith a means for positive discourse or change in a person? Are you not supposed to preach the change and positive influence your faith has done in your life instead of going around yelling what is wrong with other peoples lives?\n \n Did not Christ in particular preach that loving your neighbor as yourself is one of the greatest of all commandments?\n \n I find that in particular glaring and insulting posts to those who do not share ones exact beliefs to be a brick wall leading to nowhere... In a vain attempt to validate one's own faith or it's lacking thereof you actually damage the credibility of your belief!\n \n So I ask those and I know some of your answers already.... why is Zealotry or overbearing preaching and even insulting other people a clear or even positive way to share your faith?", 
   {
    "post_info": {
     "post_title": "Is Zealotry A Proper Way To Evangelize?"
    }
   }, 
   null, 
   null, 
   1262487960.0
  ], 
  [
   384431, 
   null, 
   "Jo Bennett", 
   "You have to remember that the people who \"evangelise\" in this fashion do not have the goal of seeking converts, they value the process of evangelism more than the result, they're wanting to have been evangelising regardless of whether the methods they use are successful.\n \n It's much the same as their attitude to poverty. They are more interested in the practice of charity than in actually reducing poverty. Charity is about their giving, not the effect of that gift on others.\n \n Some flavours of Protestantism have corrupted the valuable idea of a personal relationship with God into a form of narcicism, where the actions taken to demonstrate that one is a Christian are more important than the effects of those actions. Actions and there intent are valuable, but so is the effect they have on others. Evangelism is worthwhile because it brings people to Christ. Giving to others is worthwhile not only because it reminds us that everything we have comes as a gift from God, but because it helps people.", 
   {}, 
   384417, 
   null, 
   1262518860.0
  ], 
  [
   384434, 
   null, 
   "Symbiote", 
   "It's the same way that advocates of socialism don't actually believe it will help people (who could be so stupid), but instead enjoy the feeling of superiority they get agitating for it.\n \n Or I could stop with the arrogance of pretending to be a God who can peer into the minds of men and read their thoughts, one or the other.", 
   {}, 
   384431, 
   null, 
   1262522520.0
  ], 
  [
   384435, 
   null, 
   "Archangel", 
   "Looking at some posts from other users I find myself asking \"why do people think that overbearing blind irrational discourse is a proper way to share your faith?\" \n \n Is not sharing your faith a means for positive discourse or change in a person? Are you not supposed to preach the change and positive influence your faith has done in your life instead of going around yelling what is wrong with other peoples lives?\n \n Did not Christ in particular preach that loving your neighbor as yourself is one of the greatest of all commandments?\n \n I find that in particular glaring and insulting posts to those who do not share ones exact beliefs to be a brick wall leading to nowhere... In a vain attempt to validate one's own faith or it's lacking thereof you actually damage the credibility of your belief!\n \n So I ask those and I know some of your answers already.... why is Zealotry or overbearing preaching and even insulting other people a clear or even positive way to share your faith?\n\n \n Before this typically inane thread which claims overbearing blind irrational discourse from unnamed posters goes any further with blind and unsupported agreements from the peanut gallery, and claims Zealotry or overbearing preaching with no quoted posts at all for evidence that such accusations are valid, how about actually proving these unfounded allegations in proper context to show that we or anyone is responding to loving and reasonable posts by the opposition with zealotry or overbearing preaching and even insulting other posters without first being attacked as the premise of this very thread does? \n \n To simplify my question for you, prove your accusation by quoting the posts you want to focus on as evidence of the offenders and for the offenses you are proposing they commit, here.", 
   {}, 
   384417, 
   null, 
   1262524680.0
  ], 
  [
   384436, 
   null, 
   "Easyrider", 
   "Is Zealotry A Proper Way To Evangelize? \n \n What - you're waiting for a lukewarm, pansy milquetoast to offer up the Gospel? When does that happen around here?\n \n And what's a zealot? As I've always said, a zealot is someone who believes in God more than you do.", 
   {}, 
   384435, 
   null, 
   1262533320.0
  ], 
  [
   384451, 
   null, 
   "Accipiter", 
   "In many areas religion calls for restraint and moderation.\n \n I wonder why it doesn't say to evangelize with restraint and moderation.", 
   {
    "unicode_changes_made": true
   }, 
   384436, 
   null, 
   1262540940.0
  ], 
  [
   384455, 
   null, 
   "Easyrider", 
   "In many areas religion calls for restraint and moderation.\n I wonder why it doesn't say to evangelize with restraint and moderation.\n\n \n I believe most sinners prefer not to have their consciences tweaked by bold believers reaching out to the masses, so they make up threads like this one to try to shut them up. That's Jazy's hope when he started this thread, so he wouldn't be confronted with Biblical admonitions against gay sex sin.", 
   {
    "unicode_changes_made": true
   }, 
   384451, 
   null, 
   1262543220.0
  ], 
  [
   384461, 
   null, 
   "ShadowPikachu", 
   "I believe most sinners prefer not to have their consciences tweaked by bold believers reaching out to the masses, so they make up threads like this one to try to shut them up. That's Jazy's hope when he started this thread, so he wouldn't be confronted with Biblical admonitions against gay sex sin.\n\n Too bad there are none.....................emoticon_xkillemoticon_xkillemoticon_xkill", 
   {}, 
   384455, 
   null, 
   1262547480.0
  ], 
  [
   384462, 
   null, 
   "Easyrider", 
   "Too bad there are none.....................\n\n \n You don't have to go through 2010 ignorant concerning the admonitions against gay sex, so I'll help you out.\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n 1 Timothy 1:8-10 - &#8220;But we know that the law is good if one uses it lawfully, knowing this: that the law is not made for a righteous person, but for the lawless and insubordinate, for the ungodly and for sinners, for the unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for fornicators, for sodomites, for kidnappers, for liars, for perjurers, and if there is any other thing that is contrary to sound doctrine&#8230;&#8221;\n \n Jude 7 &#8211; &#8220;In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire.&#8221; \n \n There's no gay marriages in the Old Testament; No gay marriages in the New Testament; no gay sex approved anywhere in the Bible. Just the opposite - gay sex is condemned in both testaments. God is consistent on that.\n \n And to close:\n \n &#8220;Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.&#8221; - Thomas Jefferson, A Bill for Proportioning Crimes and Punishments", 
   {
    "post_info": {
     "post_title": "Educating Shadow Pikachu"
    }
   }, 
   384461, 
   null, 
   1262551020.0
  ], 
  [
   384472, 
   null, 
   "jitobear", 
   "So I ask those and I know some of your answers already.... why is Zealotry or overbearing preaching and even insulting other people a clear or even positive way to share your faith?\n\n \n No. But those who use these tactics aren't looking to share their faith just serve their own ego. That, or they are so completely dim that they ought to be pitied. Treating people badly gets you nowhere. Not rocket science.\n \n \nBefore this typically inane thread which claims overbearing blind irrational discourse from unnamed posters goes any further with blind and unsupported agreements from the peanut gallery, and claims Zealotry or overbearing preaching with no quoted posts at all for evidence that such accusations are valid, how about actually proving these unfounded allegations in proper context to show that we or anyone is responding to loving and reasonable posts by the opposition with zealotry or overbearing preaching and even insulting other posters without first being attacked as the premise of this very thread does? \n \n To simplify my question for you, prove your accusation by quoting the posts you want to focus on as evidence of the offenders and for the offenses you are proposing they commit, here.\n\n \n Funny you should ask, for just a moment a go I read what is linked below. In a thread where the topic is literature Easy, in usual fashion, completely ignores the topic at hand and jumps in to inform somebody about how they are doomed to hell if they don't repent. I hope the next time he goes to the movies or out to dinner some Jehovah's Witnesses sit next to him and start shouting in his ear about how wrong he is.\n \n http://www.4forums.com/political/384465-post163.html\n \n There are a plethera of other examples.\n \n Shall I quote your post back to you where your loving faith inspired you to let me know that I am harmful to those I love based on absolutely NO EVIDENCE WHATSOEVER? How many points do you think you scored for your bloody god with me using that tactic?", 
   {}, 
   384435, 
   null, 
   1262559240.0
  ], 
  [
   384473, 
   null, 
   "gansao", 
   "No. But those who use these tactics aren't looking to share their faith just serve their own ego. That, or they are so completely dim that they ought to be pitied. Treating people badly gets you nowhere. Not rocket science.\n \n \n \n Funny you should ask, for just a moment a go I read what is linked below. In a thread where the topic is literature Easy, in usual fashion, completely ignores the topic at hand and jumps in to inform somebody about how they are doomed to hell if they don't repent. I hope the next time he goes to the movies or out to dinner some Jehovah's Witnesses sit next to him and start shouting in his ear about how wrong he is.\n \n http://www.4forums.com/political/384465-post163.html\n \n There are a plethera of other examples.\n \n Shall I quote your post back to you where your loving faith inspired you to let me know that I am harmful to those I love based on absolutely NO EVIDENCE WHATSOEVER? How many points do you think you scored for your bloody god with me using that tactic?\n\n \n Not all Jehovahs wtnessess shout down your ear and none of them do it in the cinema..dont know about dinner though!\n Shame on you for stereotyping Jito!", 
   {}, 
   384472, 
   null, 
   1262560140.0
  ], 
  [
   384474, 
   null, 
   "jitobear", 
   "Not all Jehovahs wtnessess shout down your ear and none of them do it in the cinema..dont know about dinner though!\n Shame on you for stereotyping Jito!\n\n \n smart-XXX emoticon_xgood", 
   {}, 
   384473, 
   null, 
   1262561100.0
  ], 
  [
   384501, 
   null, 
   "jazyjason", 
   "You have to remember that the people who \"evangelise\" in this fashion do not have the goal of seeking converts, they value the process of evangelism more than the result, they're wanting to have been evangelising regardless of whether the methods they use are successful.\n \n It's much the same as their attitude to poverty. They are more interested in the practice of charity than in actually reducing poverty. Charity is about their giving, not the effect of that gift on others.\n \n Some flavours of Protestantism have corrupted the valuable idea of a personal relationship with God into a form of narcicism, where the actions taken to demonstrate that one is a Christian are more important than the effects of those actions. Actions and there intent are valuable, but so is the effect they have on others. Evangelism is worthwhile because it brings people to Christ. Giving to others is worthwhile not only because it reminds us that everything we have comes as a gift from God, but because it helps people.\n\n \n And yet these people think that by insulting others and ridiculing them and their beliefs while only propping up their own egos will spread a message of Christ? I hardly believe it and seeing such destructive ends to such means it harms any seed planted in ones mind to to even consider faith or any type of faith let alone the one that these people are professing to believe...", 
   {}, 
   384431, 
   null, 
   1262599020.0
  ], 
  [
   384502, 
   null, 
   "jazyjason", 
   "Before this typically inane thread which claims overbearing blind irrational discourse from unnamed posters goes any further with blind and unsupported agreements from the peanut gallery, and claims Zealotry or overbearing preaching with no quoted posts at all for evidence that such accusations are valid, how about actually proving these unfounded allegations in proper context to show that we or anyone is responding to loving and reasonable posts by the opposition with zealotry or overbearing preaching and even insulting other posters without first being attacked as the premise of this very thread does? \n \n To simplify my question for you, prove your accusation by quoting the posts you want to focus on as evidence of the offenders and for the offenses you are proposing they commit, here.\n\n \n One such comment was already given as example in a link above Archie. You try to play the victim here as if it were a shouting match, and you a wounded person. Yet I deem that you above all others besides Easy's blunt irrational discourse proves above all the very zealotry and ineffective methods I have mentioned.\n \n Instead of posting personal conviction of the positive workings of Christ in your life, you instead portray others with such vile discourse and sarcasm you refuse to acknowledge even their belief or lack thereof, and only instead prop up your own conclusions with scripture.\n \n No methodical reasoning as to why one should even consider Christ, but rather a damning warning and staunch negativity that only hardens men's hearts against what it is you are attempting to portray...", 
   {}, 
   384435, 
   null, 
   1262599260.0
  ], 
  [
   384503, 
   null, 
   "jazyjason", 
   "I believe most sinners prefer not to have their consciences tweaked by bold believers reaching out to the masses, so they make up threads like this one to try to shut them up. That's Jazy's hope when he started this thread, so he wouldn't be confronted with Biblical admonitions against gay sex sin.\n\n \n \n Easy your about as blind as your are stupid... Once again you take my methods as a way to \"hide\" behind your own damning lack of persuasion and lack of self faith to such a degree you must constantly judge others hearts and minds by your own doing and action...\n \n Were you ever a true follower of Christ you would be as a prophet and never stop giving glory to God by praising His good works in your life and how it matters not the state of mens hearts and minds only of the saving grace of Christ.\n \n For there is not one righteous man here Easy including yourself despite what you attempt to convey to others... IF all you can do is insult and attempt to belittle and delude my opinion and sincere questioning then by all means you have yet proven further my questioning and reasoning behind it...", 
   {}, 
   384455, 
   null, 
   1262599440.0
  ], 
  [
   384516, 
   null, 
   "MrWriteLA", 
   "Recommended reading for the Posters Under Discussion (PUDs)...\n \n Fischtank - Book - 12 Steps for the Recovering Pharisee \n\n 12 Steps for the Recovering Pharisee (like me)\n by John Fischer \n \n As I have grown to understand the gospel and learn more of God's grace, I have also become conscious of a corresponding struggle with pride and self-righteousness. Like anyone, I want to be well thought of. I am often conscious, as I am even now, of picking my words carefully, like walking through a minefield of impressions, so as to appear honest while stopping short of the naked truth that might implicate me more than I am willing. It is a problem that the Pharisees of Jesus' day sought to overcome by concealing themselves behind a whitewashed religious veneer.\n \n So when a gentleman came up to me at a summer festival at which I was teaching and commented on how he had found my writings to be, for him, like a twelve-step plan for recovering Pharisees, I realized that I had been working on rooting out this problem for quite a while, though until now it had never been the focus of my work. I decided it was time to make it such. His fingering of this correlation struck a chord in me, as did the use of the recovery model as a creative approach to this chronic spiritual disease.\n \n My use of the recovery model in this book is admittedly somewhat tongue-in-cheek. I am not expecting Pharisee recovery groups to spring up all over the country as a result of my discussions here (though it might not be such a bad idea), nor am I expecting people to see these steps as some sort of methodology through which they can accomplish the permanent eradication of pride and self-projected superiority. I am more interested in borrowing the recovery model as a way of unmasking, and potentially freeing us from, the intoxication of spiritual pride and prejudice that continually lures believers away from the grace, gratitude and life of astonishment that the Spirit of God desires for us.\n \n It is my firm belief that the prideful attitude of the Pharisees and their practice of measuring out righteousness are problems that affect not only Christians but everyone at some point. They are built into human nature. They even accompany other religions and cults. Pharisaism always seems to show up whenever righteousness is pursued in any form, at any level. Acceptance on the basis of performance was how most of us began our lives, and it's not easy to shake. In biblical history this is called the Old Covenant.\n \n The Old Covenant requires a standard of performance and a reason to be obedient to it. But the standard, in its truest form, is impossible to pull off consistently. It could be argued that this is the whole point of God's dealings with humanity through the covenants. The Old Covenant is there to break us, to show us that we cannot live according to its precepts--that sin and selfishness dwell in us to a significant degree so as to rule out the possibility of following even the clear call of Jesus to love God, self and others. This inability to follow the standard, along with its accompanying humility, qualifies us for a Savior--someone who will fulfill the law on our behalf and grant us righteousness as a free gift. This is God's grace as given to us in the New Covenant through the death and resurrection of our Lord and Savior Jesus Christ.\n \n The Pharisees enter the picture as the ones who figure out a way to make the Old Covenant work for them, thus making the new one unnecessary. As official interpreters of the laws of God, they adapt the standard through their own interpretation until the law (actually, their version of it) becomes something that is not impossible to perform but indeed quite possible, though difficult and meticulous at times. The \"standard\" is set so that attaining it is difficult enough to weed out the undesirables but not so difficult as to become overly burdensome--and that's the key. Armed with this new standard, Pharisees can then qualify themselves for righteousness and judge those who, according to their measurement, fall short. Once this course is entered upon, it can branch into a myriad of avenues of arrogance, judgment and false humility.\n \n What makes pharisaical sin so dangerous is that it disguises itself as a form of enlightenment. This is what Jesus meant when he said, \"If the light within you is darkness, how great is that darkness!\" (Matthew 6:23).\n \n The darkness is great because one is deluded into thinking it is light. You think you are seeing better than anyone else, when, in fact, you can't see at all. This means the idea that you can't see is farthest from you. A blind person knows he is blind. A Pharisee thinks he can see, and this is why the \"light\" within him is actually darkness. Jesus called the Pharisees \"blind guides.\"\n \n So it is necessary in this darkness we call light to identify our error and get free from our entrapment--exactly the job of all recovery groups. It could even be argued that our churches ought to be more like this. The church should be the most honest place on earth--a place where it is possible to say among friends: \"Hi, I'm John, and I'm a Pharisee.\"\n \n \"Hi, John,\" comes the echo, and we reveal in the realization that this is the meeting place of accountability for equals. These are the Simons who want to come down off their pedestals and join the company of saved sinners at the feet of Jesus, who, like the prostitute anointing his feet with perfume and tears, can't seem to get enough of this grace and forgiveness. This is the gospel for those courageous enough to tear off of their masks of adequacy and self-righteousness and get on with a life of gratitude and love for others. This is the Pharisee recovery group of which I speak, and these are the steps which will lead us out. I know, for I am an expert in the downturned look, the haughty eye, the wagging head--and I've had enough of it.\n \n Welcome to the group.\n", 
   {}, 
   384503, 
   null, 
   1262604000.0
  ], 
  [
   384517, 
   null, 
   "jazyjason", 
   "Recommended reading for the Posters Under Discussion (PUDs)...\n \n Fischtank - Book - 12 Steps for the Recovering Pharisee\n\n \n I wouldn't doubt Easy and Archie both would just skim over your post or ignore it completely....", 
   {}, 
   384516, 
   null, 
   1262604900.0
  ], 
  [
   384518, 
   null, 
   "MrWriteLA", 
   "I wouldn't doubt Easy and Archie both would just skim over your post or ignore it completely....\n Of course. Which would be a case of QED.", 
   {}, 
   384517, 
   null, 
   1262605680.0
  ], 
  [
   384523, 
   null, 
   "jazyjason", 
   "Of course. Which would be a case of QED.\n\n \n QED? whats QED again?", 
   {}, 
   384518, 
   null, 
   1262614440.0
  ], 
  [
   384535, 
   null, 
   "MrWriteLA", 
   "QED? whats QED again?\n From Wikipedia:\n \n \"Q.E.D. is an abbreviation of the Latin phrase quod erat demonstrandum, which literally means 'which was to be demonstrated.' The phrase is written in its abbreviated form at the end of a mathematical proof or philosophical argument to signify that the last statement deduced was the one to be demonstrated; the abbreviation thus signals the completion of the proof.\"\n \n More at Q.E.D. - Wikipedia, the free encyclopedia.", 
   {}, 
   384523, 
   null, 
   1262621520.0
  ], 
  [
   384540, 
   null, 
   "Archangel", 
   "Recommended reading for the Posters Under Discussion (PUDs)...\n \n Fischtank - Book - 12 Steps for the Recovering Pharisee\n\n \n \nI wouldn't doubt Easy and Archie both would just skim over your post or ignore it completely....\n\n \n I don't know why you would expect that jason, this link he posted to shows great insight by the author of the article which speaks directly to me as a believer in my Lord. It's possible it's you unbelievers who don't get it since it defines our walk through life as admitted sinners who are in dire need for our Lords sanctifying work which occurred when Christ died for our sins on the Cross. It is you unbelievers who deny that truth, yet here you are posting a right on piece which should convict you of your spiritual need. Instead you continue to look at others rather introspectively consider your own spiritual conditions. \n \n After all, it was the Pharisees who believed they could accomplish through the Law which Jesus showed could only be accomplished through Grace. So thanks for posting this link Mr WLA, now if only you will realize that you are the Pharisee, not me, all will finally be well with you.", 
   {}, 
   384517, 
   null, 
   1262630460.0
  ], 
  [
   384552, 
   null, 
   "pappillion001", 
   "I don't know why you would expect that jason, this link he posted to shows great insight by the author of the article which speaks directly to me as a believer in my Lord. It's possible it's you unbelievers who don't get it since it defines our walk through life as admitted sinners who are in dire need for our Lords sanctifying work which occurred when Christ died for our sins on the Cross. It is you unbelievers who deny that truth, yet here you are posting a right on piece which should convict you of your spiritual need. Instead you continue to look at others rather introspectively consider your own spiritual conditions.\n \n \n This is not intended as sarcasm or to belittle or towards a particular person, though it may come across that way it isn't my intention. \n \n It is your belief that you are a sinner an not capable of being anything else. Therefore your only hope of access to Heaven is via mercy/pity of Jesus/God. There are many people who have not given up on themselves and choose not to accept a man made concept of human nature. I wouldn't expect made in God's image to include a characteristic so contrary to God's being that it becomes necessary to radically alter his intended purpose. Granted not one of us is perfect at all times, but how many of us decided never to ride a bike after falling down the first time? Because that is what you do when you look for Jesus to become training wheels. You are saying thank you God for believing in me, but I can't be what I think you want me to be. You don't ask for help, you ask for a free pass and then get mad or find fault with those who have not given up or don't want training wheels.\n \n The zealot in my mind is ashamed of his inability to be what he thinks he is supposed to be. He looks for ways to overcome failings in one thing by exceeding in another. He seeks to lessen his own perceived shortcomings by pointing out those of others. Hoping to somehow slide beneath the notice of God by making sure there are others for God to notice. He fears being an outcast by finding others who feel as he does. As a group the enjoy the power, acceptance and self-worth that comes from belonging to any group. This is a fragile environment and is protected and insulated from possible corruption by outside influence. Reason and logic are ignored or manipulated and any perceived threat to what is accepted is condemned.\n \n \nAfter all, it was the Pharisees who believed they could accomplish through the Law which Jesus showed could only be accomplished through Grace. So thanks for posting this link Mr WLA, now if only you will realize that you are the Pharisee, not me, all will finally be well with you.\n\n \n Wasn't it God who put that idea in their head? I don't know that Jesus showed it could be done through grace alone. Christians claim he was sinless, so it could have just as easily been by his works. Actually more likely being his works, since having not sinned did not need God's mercy. Maybe Jesus was an example of what could be done, an example of what made in God's image is supposed to look like.\n \n I know I have completely fouled up the idea and have no understanding of scripture, but in my arrogance I find my view more appealing than yours.\n \n I also don't poorly of your view or relish in the idea of erternal suffering for those who think I am wrong.", 
   {}, 
   384540, 
   null, 
   1262635080.0
  ], 
  [
   384554, 
   null, 
   "JPSartre12", 
   "I'm a pragmatic Christian. I don't proselytize because I hate waiting in long lines. ;)", 
   {}, 
   384552, 
   null, 
   1262635560.0
  ], 
  [
   384557, 
   null, 
   "sinjin", 
   "I'm a pragmatic Christian. I don't proselytize because I hate waiting in long lines. ;)\nI'm an atheist because I wouldn't want to belong to any club that would have me.:p", 
   {}, 
   384554, 
   null, 
   1262636460.0
  ], 
  [
   384574, 
   null, 
   "jyoshu", 
   "Looking at some posts from other users I find myself asking \"why do people think that overbearing blind irrational discourse is a proper way to share your faith?\" \n \n Is not sharing your faith a means for positive discourse or change in a person? Are you not supposed to preach the change and positive influence your faith has done in your life instead of going around yelling what is wrong with other peoples lives?\n\n \n The thing is though, people who argue against said Christians sometimes do the very same thing with what THEY think people should be convinced of. In a sense, we're all engaged in a sort of 'evangelism' (if you will) of our views. And I've heard plenty of overbearing and blindly irrational discourse from atheists and agnostics too against fundies. One only needs to read the comments section of sites like Huffington to see it. Or the way evolutionists talk down to creationists.\n \n I don't think the problem in discourse of our society is so much religion as it is extremism. It can exist as religious fundamentalism, over-zealous atheism, or whatever angry and ranting ideologues of any view (including things the left champions too, sometimes). So I agree that such is a bad way to 'share faith.' But I'd go farther and say it's a bad way to share anything or convince anyone of one's views no matter which side of the fence it's on.", 
   {}, 
   384417, 
   null, 
   1262647200.0
  ], 
  [
   384584, 
   null, 
   "jazyjason", 
   "I don't know why you would expect that jason, this link he posted to shows great insight by the author of the article which speaks directly to me as a believer in my Lord. It's possible it's you unbelievers who don't get it since it defines our walk through life as admitted sinners who are in dire need for our Lords sanctifying work which occurred when Christ died for our sins on the Cross. It is you unbelievers who deny that truth, yet here you are posting a right on piece which should convict you of your spiritual need. Instead you continue to look at others rather introspectively consider your own spiritual conditions. \n \n After all, it was the Pharisees who believed they could accomplish through the Law which Jesus showed could only be accomplished through Grace. So thanks for posting this link Mr WLA, now if only you will realize that you are the Pharisee, not me, all will finally be well with you.\n\n \n You really are a card Archie..... Have fun with a walking stick because as far as I'm concerned your blinder than a bat.... Now you accuse me of being an unbeliever as well? \n \n The point is you refuse to preach upon the benefit of such things!! You only ridicule and mock and scoff as you JUST did! You provide no spiritual insight at all whatsoever!", 
   {}, 
   384540, 
   null, 
   1262649660.0
  ], 
  [
   384586, 
   null, 
   "jazyjason", 
   "The thing is though, people who argue against said Christians sometimes do the very same thing with what THEY think people should be convinced of. In a sense, we're all engaged in a sort of 'evangelism' (if you will) of our views. And I've heard plenty of overbearing and blindly irrational discourse from atheists and agnostics too against fundies. One only needs to read the comments section of sites like Huffington to see it. Or the way evolutionists talk down to creationists.\n \n I don't think the problem in discourse of our society is so much religion as it is extremism. It can exist as religious fundamentalism, over-zealous atheism, or whatever angry and ranting ideologues of any view (including things the left champions too, sometimes). So I agree that such is a bad way to 'share faith.' But I'd go farther and say it's a bad way to share anything or convince anyone of one's views no matter which side of the fence it's on.\n\n \n This is not about he said she said although already the spin is there.... It is about the PROPER way or method to evangelize and WHY these overbearing people do this.... Do not try and shift blame upon other people who's beliefs differ from yours, your shifting the goalposts to try and escape the tackle yourself....", 
   {}, 
   384574, 
   null, 
   1262649780.0
  ], 
  [
   384589, 
   null, 
   "jazyjason", 
   "I'm a pragmatic Christian. I don't proselytize because I hate waiting in long lines. ;)\n\n \n *looks down* you are number 5,345,698. Now serving number 5.....", 
   {}, 
   384554, 
   null, 
   1262649840.0
  ], 
  [
   384591, 
   null, 
   "jazyjason", 
   "\n The zealot in my mind is ashamed of his inability to be what he thinks he is supposed to be. He looks for ways to overcome failings in one thing by exceeding in another. He seeks to lessen his own perceived shortcomings by pointing out those of others. Hoping to somehow slide beneath the notice of God by making sure there are others for God to notice. He fears being an outcast by finding others who feel as he does. As a group the enjoy the power, acceptance and self-worth that comes from belonging to any group. This is a fragile environment and is protected and insulated from possible corruption by outside influence. Reason and logic are ignored or manipulated and any perceived threat to what is accepted is condemned.\n \n \n\n \n \n You hit the nail right on the head. I can attest to this because I used to be a zealot for the simple reason that I was in the closet. I felt me being gay a shortcoming or more so a horrible black hole I could not escape. \n \n It took me a long time to overcome such a thing and to actually see Gods grace for what it really is....", 
   {}, 
   384552, 
   null, 
   1262650020.0
  ], 
  [
   384599, 
   null, 
   "Easyrider", 
   "If it weren't for zealots the Gospel would probably have never been preached to the masses. \n \n God's Little Troublemakers\n \n Some years back if you&#8217;d been watching any sports events on TV, you probably saw this one commercial for Lite beer. And there was this one guy &#8211; I think his name was Bob Eucker &#8211; who always liked to go up into the stands at baseball and football games and stir up trouble. He&#8217;d sit down between two guys who were drinking Lite beer and nudge one of them in the ribs and say something like, &#8220;That guy sitting on the other side of me says that Lite Beer tastes great.&#8221; Well that would get the first guys attention and he&#8217;d say, &#8220;Oh yeah?&#8221; Then he&#8217;d turn to the other guy and tell him the first guy said that Lite beer is less filling. And that guy would then get up and look at the first guy and yell, &#8220;Tastes great!&#8221; And the other guy would yell back, &#8220;Less filling!&#8221; And the war would be on. The whole stadium would be in an uproar. Then the camera would pan back at Bob Eucker and he would just be sitting back there yucking it up at all the trouble he&#8217;d caused.\n \n Well, I&#8217;m here today to tell you that God has his own little troublemakers. Wherever the full gospel of Jesus Christ is being preached, God&#8217;s little troublemakers are at work. But their mission is to save lives, not stir up unnecessary trouble. Keep that story about Bob Euker in mind as we read from the twenty-third chapter of the Book of Acts:\n \n &#8220;Paul looked straight at the Sanhedrin (the members of the Jewish ruling council who were trying to sentence Paul to death) and said, &#8220;My brothers, I have fulfilled my duty to God in all good conscience to this day.&#8221; At this, the high priest Ananias ordered those standing near Paul to strike him on the mouth. Then Paul said to Ananias, &#8220;God will strike you &#8211; you white-washed wall! You sit there to judge me according to the law, yet you yourselves violate the law by commanding that I be struck!&#8221; Then Paul, knowing that some of them were Sadducees (who didn&#8217;t believe in the resurrection and afterlife), and the others Pharisees (who did believe in it), called out in the Sanhedrin, &#8220;My brothers, I am a Pharisee, the son of a Pharisee, and I stand on trial today because of my hope in the resurrection of the dead.&#8221; When he had said this, a dispute broke out between the Pharisees and the Sadducees, and the assembly was divided. And there was a great uproar, and some of the teachers of the law who spoke out who were Pharisees stood up and argued vigorously&#8230;..The dispute became so violent that the Roman commander was afraid that Paul would be torn to pieces by them. He ordered the troops to go down and rescue him by force, and take him back to the barracks. The council was in an uproar.&#8221;\n \n One of God&#8217;s little troublemakers had struck! Less filling! Tastes great! That&#8217;s the kind of thing you sometimes run into when you&#8217;re preaching the gospel of Jesus Christ. \n \n Some years ago, an old English preacher by the name of Smith Wigglesworth remarked, &#8220;If you leave people as you found them, God is not speaking through you. If you are not making people either mad or glad, there is something wrong with your ministry. If there&#8217;s not a (spiritual) war going on, you&#8217;re not doing your job.&#8221;\n \n Another commentator, a guy by the name of Arthur Wallis, speaking on the apostolic style of preaching that we see in the Book of Acts, said, &#8220;Such preaching makes indifference to the word of God impossible &#8211; it sets the hearers into one of two camps. It&#8217;s calculated to either produce a revival or a riot.&#8221;\n \n Whether we like it or not, God&#8217;s people are sometimes called on to &#8220;rock the boat,&#8221; and to preach a confrontational gospel. And just what is a confrontational gospel? It&#8217;s any message that preaches the entire gospel of Jesus Christ. It&#8217;s a message that not only tells the world that Christ is the only way to salvation and eternal life, but it&#8217;s also a message that confronts unrighteousness, exposes ambivalence, and challenges people to reexamine their lives to see if they have made Christ not only their Savior, but also the Lord of their lives. The Bible doesn&#8217;t say that Jesus is our Lord or Savior. It says he is our Lord and Savior! And when you acknowledge that and advance his gospel with all the dedication, vigor and passion that you can possibly muster, then you too will have become one of God&#8217;s &#8220;little troublemakers.&#8221;\n \n America today is at a crossroads. We have traded in the &#8220;tastes great&#8221; gospel of Jesus Christ for one that is &#8220;less filling.&#8221; We have sought to make ungodly people godly without converting them from their sin. We have taught grace without godliness, salvation without repentance, and tolerance in lieu of moral outrage. And as a nation, we have strayed far from the commandments of God. As Carl Henry so eloquently noted, &#8220;America has turned its back on God. It mocks God. Instead it worships a twentieth century Baal, incarnated in sensuality, materialism, and immorality of every kind.&#8221; We see this even in some of our mainline churches today. Over one hundred years ago, Catherine Booth remarked, &#8220;It is a bad sign for the Christianity of this day when it provokes so little opposition from the world. When the Church and the world can jog along together side by side comfortably, you may be sure there is something wrong.&#8221; \n \n America has gone from a righteous, Christian nation to a predominately pagan, &#8220;anything goes&#8221; moral sewer of a society, where in the name of tolerance and appeasement we ordain practicing homosexual ministers, engage in the genocide of millions of unborn children, and then we go home and quietly lay down on our couches because we don&#8217;t want to give anyone the appearance of being judgmental or intolerant. Do we hate God so much that we will let these outrageous deeds pass without so much as even raising our voices for what&#8217;s right in his eyes? Are we so fearful of mortal man and public opinion that we no longer fear the wrath of the Almighty and Invincible King of Kings and Lord of the universe? Are we so gutless and timid about speaking out that we can ignore the righteous blood of Christ and his apostles, who cry out to us from heaven to take a stand for what&#8217;s right in the eyes of God? Is this what our faith has come to?\n \n Once anointed with the Holy Spirit, &#8220;God&#8217;s Little Troublemakers&#8221; no longer have a fear of mortal man. They would just as soon walk up to the antichrist and read him the riot act as look at him. They are God&#8217;s little spiritually-impassioned wrecking-balls of evangelism and conviction. Though imperfect in the flesh, they are emboldened by the Spirit. Though looked upon as so much self-righteous, despicable rubbish by unregenerate men, they are seen as precious in the eyes of the Lord.\n \n And the paradox of the Old and New Testament prophets and disciples is this: Ultimately, they gave their lives so that others might have the words of eternal life. Greater love hath no man than he lay down his life for another. \n \n Now there&#8217;s absolutely no doubt that when a confrontational message is preached, there will come those from the pews of our churches and from society at large who will say, &#8220;Judge not and you will not be judged&#8221; (Matthew 7:1). In reality, their sole intent is to stifle the messenger so their consciences won't be tweaked because of their sins. \n \n People today are so afraid to speak out on an issue and be labeled as judgmental and intolerant that they&#8217;re not speaking out at all. They&#8217;re allowing our nation to be utterly destroyed by all manner of iniquity. People who are starting to feel the heat of the conviction of the Holy Spirit for their sins, and who are uncomfortably squirming in their seats, love to quote that verse about not judging just to try to shut you up. They can&#8217;t stand the heat. Jesus is not saying that we cannot make judgments about sin &#8211; he is saying that we should not be hypocrites if we do. In Matthew 7:5 he says, &#8220;You hypocrite, first take the plank out of your own eye, and then you can see clearly to remove the speck that is in your brothers eye.&#8221; Note that it&#8217;s okay to remove the speck from your brother&#8217;s eye. Just make sure that first there&#8217;s not a plank in your own eye. \n \n Now I want to remind you that the world generally despised and rejected Jesus Christ. He was looked upon as a radical extremist and a troublemaker of the first order. Today, the unregenerate world looks upon him simply as either a myth or a minister of love, peace and tolerance. But love is often confrontational. It speaks the truth even when the truth is unpopular. Regarding peace, Jesus said (Matthew 10:34-36), &#8220;Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword (the sword of the Spirit &#8211; the word of God &#8211; note Hebrews 4:12). For I have come to turn a man against his father, a daughter against her mother, and a daughter-in-law against her mother-in-law. A man&#8217;s own enemies will be members of his own household.&#8221; Preaching the entire word of God will do just that. And as for tolerance, Jesus was anything but tolerant. Not once did he compromise God&#8217;s word for man&#8217;s. He rebuked hypocrisy, exposed sin, and regularly confronted the scurrilous and demonic doctrines of the corrupt religious leaders of his day. \n \n You may remember another one of God&#8217;s little troublemakers, Stephen. You see him in Acts chapters six and seven. Stephen was &#8220;a man full of God&#8217;s grace and power, and he did great wonders and miraculous signs among the people.&#8221; But the Bible says that opposition arose against him. Why? Because his message was a threat to the religious establishment of his day &#8211; an establishment that rejected Jesus Christ and those who proclaimed his message. Here again was a man who would not compromise God&#8217;s word for the doctrines of the world. He was wholly and totally committed to God. He was on fire for the Lord. And he was brought into the council of the Sanhedrin to account for his testimony. And here&#8217;s what happened next: After a long litany of historic review about the nation of Israel, Stephen looked at the members of the Sanhedrin and cried out,\n \n &#8220;You stiff-necked people with uncircumcised hearts and ears!\n You always resist the Holy Spirit. Was there ever a prophet\n your fathers did not persecute? They even killed those who\n predicted the coming of the Righteous One. And now you\n have betrayed and murdered him &#8211; you who have received the\n law that was put into effect through angels, but have not\n obeyed it!&#8217; When the members of the Sanhedrin heard this\n they were furious, and gnashed their teeth at him. But Stephen,\n full of the Holy Spirit, looked up to heaven and saw the glory\n of God, and Jesus standing at the right hand of God. &#8216;Look,&#8217;\n he said, &#8216;I see heaven open and the Son of Man standing at\n the right hand of God.&#8217; At this they covered their ears, and\n yelling at the top of their voices, they all rushed him&#8230;.and\n they dragged him outside the city and stoned him to death.&#8221;\n (Acts 7:51-58)\n \n They were furious! They gnashed their teeth and screamed at the top of their lungs. The council was in an uproar.\n \n One of God&#8217;s little troublemakers had struck again! So much for &#8220;tolerance!&#8221; And looked at what happened when Stephen rebuked those obstinate people for their sins &#8211; the Glory of God appeared! Imagine, if Stephen were standing here today and spoke out against the backslidden and the unregenerate, and he said:\n \n &#8220;You stiff-necked and rebellious people &#8211; you, who continue to resist the Holy Spirit, reject Jesus Christ, and live for yourselves. What hope can there possibly be for you? When, if ever, are you going to get yourselves right with the Lord?&#8221; \n \n How popular would that be?\n \n Why was John the Baptist beheaded? Was he a reed swayed by the breeze of political correctness? Was John one of those guys who wanted everyone to be his buddy? Was he someone who sought after his own well-being and personal indulgences? John the Baptist spoke out strongly against the corrupt religious leaders of his day. He went after King Herod and reminded him of his adultery. He called the Sadducees and Pharisees a &#8220;Brood of Vipers!&#8221; He wasn&#8217;t playing the world&#8217;s game and looking out for his own welfare and popularity. He wasn&#8217;t practicing &#8220;tolerance&#8221; and preaching a watered-down gospel that sends people to hell. He was preaching the word of God, trying to turn someone to repentance and salvation, and for that he was labeled a troublemaker and eventually put to death. \n \n Why was Paul beaten and persecuted? Why was James put to death with the sword? Why were the prophets and the apostles martyred? They didn&#8217;t go after these guys for preaching love and tolerance. They went after them because they exposed sin, corruption, and idolatry, and took a stand for what&#8217;s right in the eyes of God. They were God&#8217;s little troublemakers, and the world couldn&#8217;t handle it. The world stood convicted of its sin, and in order to justify its own worldliness and unrighteousness it chose instead to kill the messengers. Sound familiar?\n \n And herein lies the crux of this message: Exposing sin and confronting apathy and unrighteousness is critically essential to salvation. Without conviction there is no need for a savior. And if the world has no need for a savior, then Jesus&#8217; life, death, and resurrection has absolutely no relevance or significance. \n \n Now for those in the church who say we shouldn&#8217;t &#8220;rock the boat,&#8221; I ask: &#8220;What kind of baptism and faith do we have that calls for almost no separation from the world, produces no personal sacrifice, and breeds practically no animosity towards sin? What kind of born-again experience is it that makes Christ our Savior, but fails to make Him Lord of our lives? And what kind of faith is it that permits us to follow the dictates of this world, and pursue our own pleasures, wants, and feelings, rather than the commandments of God?&#8221; What kind of faith is that? James calls it &#8220;dead faith.&#8221; Where is the evidence of our salvation and new birth if we&#8217;re not trying to follow God&#8217;s word? We say, &#8220;Just confess Jesus and you&#8217;re saved.&#8221; Jesus says, &#8220;Not everyone who says to me, Lord, Lord, will enter into heaven, but only he who does the will of my Father.&#8221; We say, &#8220;Just say this simple prayer and you&#8217;re in.&#8221; He says, &#8220;If anyone would come after Me, he must deny himself and take up his cross daily and follow me.&#8221; \n \n A man by the name of Thomas Kempis once wrote, &#8220;Many follow Jesus unto the breaking of bread, but few to the drinking of the cup of His passion.&#8221; \n \n Now would you like some sound, scriptural proof that the compromised Church of Jesus Christ has been inundated by the worldly doctrines of tolerance and appeasement? Simply put, there is little or no persecution of Christians in America. Persecution arises when the Gospel of Christ becomes a threat to a perverse and degenerate society. Persecution is evidence that Satan&#8217;s demonic empire is being threatened &#8211; that sin and corruption are being exposed, and that Satan and his people are starting to feel the heat. Persecution is evidence that one of God&#8217;s little troublemakers has smashed the foundations of a self-righteous society, and by God&#8217;s righteous Spirit, has brought conviction to the masses. Yet today, the confrontational gospel has yet to shake the foundations of the church, much less the world. \n \n Contrast that with the confrontational message of the early prophets and apostles. King Herod and his &#8220;wife&#8221; were so incensed by the impassioned discourse of John the Baptist that they had him imprisoned and beheaded. Paul&#8217;s teachings so enraged the idol makers of Ephesus that the silversmiths and craftsmen stirred up an enormous riot that almost resulted in Paul&#8217;s death. And Stephen&#8217;s message before the Sanhedrin so infuriated the Pharisees that they gnashed their teeth and turned into a raging mob. Time after time, from the Old Testament to the New, God&#8217;s little troublemakers spoke out against the scourges of political correctness and condemned evil and iniquity. Time after time, they were mocked, alienated, branded as troublemakers, and were beaten and put to death for exposing lies, greed, and deception. The world was not worthy of them. They were the ancient gladiators of truth and justice, and they served God with humility and honor. Great are their rewards in heaven. \n \n So let this lesson serve you well. Come out of the world and into the faith. Dare to recognize that your eternal rewards are far more encompassing than your earthly desires. Realize that you cannot be a friend of this world and serve Christ too. You will only love the one and hate the other. And understand that in serving your earthly passions you will not only fail to bring the word of salvation to those who tomorrow may pass from this earth into hell, but you will also ultimately antagonize your Creator, to whom you must someday give a full and honest accounting for all you&#8217;ve done, or failed to do in this life.\n \n Acknowledgments to Dr. Michael L. Brown and his book, &#8220;It&#8217;s Time to Rock the Boat.\" (righterreport.com)", 
   {}, 
   384591, 
   null, 
   1262650920.0
  ], 
  [
   384619, 
   null, 
   "jazyjason", 
   "If it weren't for zealots the Gospel would probably have never been preached to the masses. \n \n God's Little Troublemakers\n \n Some years back if you'd been watching any sports events on TV, you probably saw this one commercial for Lite beer. And there was this one guy - I think his name was Bob Eucker - who always liked to go up into the stands at baseball and football games and stir up trouble. He'd sit down between two guys who were drinking Lite beer and nudge one of them in the ribs and say something like, \"That guy sitting on the other side of me says that Lite Beer tastes great.\" Well that would get the first guys attention and he'd say, \"Oh yeah?\" Then he'd turn to the other guy and tell him the first guy said that Lite beer is less filling. And that guy would then get up and look at the first guy and yell, \"Tastes great!\" And the other guy would yell back, \"Less filling!\" And the war would be on. The whole stadium would be in an uproar. Then the camera would pan back at Bob Eucker and he would just be sitting back there yucking it up at all the trouble he'd caused.\n \n Well, I'm here today to tell you that God has his own little troublemakers. Wherever the full gospel of Jesus Christ is being preached, God's little troublemakers are at work. But their mission is to save lives, not stir up unnecessary trouble. Keep that story about Bob Euker in mind as we read from the twenty-third chapter of the Book of Acts:\n \n \"Paul looked straight at the Sanhedrin (the members of the Jewish ruling council who were trying to sentence Paul to death) and said, \"My brothers, I have fulfilled my duty to God in all good conscience to this day.\" At this, the high priest Ananias ordered those standing near Paul to strike him on the mouth. Then Paul said to Ananias, \"God will strike you - you white-washed wall! You sit there to judge me according to the law, yet you yourselves violate the law by commanding that I be struck!\" Then Paul, knowing that some of them were Sadducees (who didn't believe in the resurrection and afterlife), and the others Pharisees (who did believe in it), called out in the Sanhedrin, \"My brothers, I am a Pharisee, the son of a Pharisee, and I stand on trial today because of my hope in the resurrection of the dead.\" When he had said this, a dispute broke out between the Pharisees and the Sadducees, and the assembly was divided. And there was a great uproar, and some of the teachers of the law who spoke out who were Pharisees stood up and argued vigorously.....The dispute became so violent that the Roman commander was afraid that Paul would be torn to pieces by them. He ordered the troops to go down and rescue him by force, and take him back to the barracks. The council was in an uproar.\"\n \n One of God's little troublemakers had struck! Less filling! Tastes great! That's the kind of thing you sometimes run into when you're preaching the gospel of Jesus Christ. \n \n Some years ago, an old English preacher by the name of Smith Wigglesworth remarked, \"If you leave people as you found them, God is not speaking through you. If you are not making people either mad or glad, there is something wrong with your ministry. If there's not a (spiritual) war going on, you're not doing your job.\"\n \n Another commentator, a guy by the name of Arthur Wallis, speaking on the apostolic style of preaching that we see in the Book of Acts, said, \"Such preaching makes indifference to the word of God impossible - it sets the hearers into one of two camps. It's calculated to either produce a revival or a riot.\"\n \n Whether we like it or not, God's people are sometimes called on to \"rock the boat,\" and to preach a confrontational gospel. And just what is a confrontational gospel? It's any message that preaches the entire gospel of Jesus Christ. It's a message that not only tells the world that Christ is the only way to salvation and eternal life, but it's also a message that confronts unrighteousness, exposes ambivalence, and challenges people to reexamine their lives to see if they have made Christ not only their Savior, but also the Lord of their lives. The Bible doesn't say that Jesus is our Lord or Savior. It says he is our Lord and Savior! And when you acknowledge that and advance his gospel with all the dedication, vigor and passion that you can possibly muster, then you too will have become one of God's \"little troublemakers.\"\n \n America today is at a crossroads. We have traded in the \"tastes great\" gospel of Jesus Christ for one that is \"less filling.\" We have sought to make ungodly people godly without converting them from their sin. We have taught grace without godliness, salvation without repentance, and tolerance in lieu of moral outrage. And as a nation, we have strayed far from the commandments of God. As Carl Henry so eloquently noted, \"America has turned its back on God. It mocks God. Instead it worships a twentieth century Baal, incarnated in sensuality, materialism, and immorality of every kind.\" We see this even in some of our mainline churches today. Over one hundred years ago, Catherine Booth remarked, \"It is a bad sign for the Christianity of this day when it provokes so little opposition from the world. When the Church and the world can jog along together side by side comfortably, you may be sure there is something wrong.\" \n \n America has gone from a righteous, Christian nation to a predominately pagan, \"anything goes\" moral sewer of a society, where in the name of tolerance and appeasement we ordain practicing homosexual ministers, engage in the genocide of millions of unborn children, and then we go home and quietly lay down on our couches because we don't want to give anyone the appearance of being judgmental or intolerant. Do we hate God so much that we will let these outrageous deeds pass without so much as even raising our voices for what's right in his eyes? Are we so fearful of mortal man and public opinion that we no longer fear the wrath of the Almighty and Invincible King of Kings and Lord of the universe? Are we so gutless and timid about speaking out that we can ignore the righteous blood of Christ and his apostles, who cry out to us from heaven to take a stand for what's right in the eyes of God? Is this what our faith has come to?\n \n Once anointed with the Holy Spirit, \"God's Little Troublemakers\" no longer have a fear of mortal man. They would just as soon walk up to the antichrist and read him the riot act as look at him. They are God's little spiritually-impassioned wrecking-balls of evangelism and conviction. Though imperfect in the flesh, they are emboldened by the Spirit. Though looked upon as so much self-righteous, despicable rubbish by unregenerate men, they are seen as precious in the eyes of the Lord.\n \n And the paradox of the Old and New Testament prophets and disciples is this: Ultimately, they gave their lives so that others might have the words of eternal life. Greater love hath no man than he lay down his life for another. \n \n Now there's absolutely no doubt that when a confrontational message is preached, there will come those from the pews of our churches and from society at large who will say, \"Judge not and you will not be judged\" (Matthew 7:1). In reality, their sole intent is to stifle the messenger so they won't be convicted of their iniquity. \n \n People today are so afraid to speak out on an issue and be labeled as judgmental and intolerant that they're not speaking out at all. They're allowing our nation to be utterly destroyed by all manner of iniquity. People who are starting to feel the heat of the conviction of the Holy Spirit for their sins, and who are uncomfortably squirming in their seats, love to quote that verse about not judging just to try to shut you up. They can't stand the heat. Jesus is not saying that we cannot make judgments about sin - he is saying that we should not be hypocrites if we do. In Matthew 7:5 he says, \"You hypocrite, first take the plank out of your own eye, and then you can see clearly to remove the speck that is in your brothers eye.\" Note that it's okay to remove the speck from your brother's eye. Just make sure that first there's not a plank in your own eye. \n \n Now I want to remind you that the world generally despised and rejected Jesus Christ. He was looked upon as a radical extremist and a troublemaker of the first order. Today, the unregenerate world looks upon him simply as either a myth or a minister of love, peace and tolerance. But love is often confrontational. It speaks the truth even when the truth is unpopular. Regarding peace, Jesus said (Matthew 10:34-36), \"Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword (the sword of the Spirit - the word of God - note Hebrews 4:12). For I have come to turn a man against his father, a daughter against her mother, and a daughter-in-law against her mother-in-law. A man's own enemies will be members of his own household.\" Preaching the entire word of God will do just that. And as for tolerance, Jesus was anything but tolerant. Not once did he compromise God's word for man's. He rebuked hypocrisy, exposed sin, and regularly confronted the scurrilous and demonic doctrines of the corrupt religious leaders of his day. \n \n You may remember another one of God's little troublemakers, Stephen. You see him in Acts chapters six and seven. Stephen was \"a man full of God's grace and power, and he did great wonders and miraculous signs among the people.\" But the Bible says that opposition arose against him. Why? Because his message was a threat to the religious establishment of his day - an establishment that rejected Jesus Christ and those who proclaimed his message. Here again was a man who would not compromise God's word for the doctrines of the world. He was wholly and totally committed to God. He was on fire for the Lord. And he was brought into the council of the Sanhedrin to account for his testimony. And here's what happened next: After a long litany of historic review about the nation of Israel, Stephen looked at the members of the Sanhedrin and cried out,\n \n \"You stiff-necked people with uncircumcised hearts and ears!\n You always resist the Holy Spirit. Was there ever a prophet\n your fathers did not persecute? They even killed those who\n predicted the coming of the Righteous One. And now you\n have betrayed and murdered him - you who have received the\n law that was put into effect through angels, but have not\n obeyed it!' When the members of the Sanhedrin heard this\n they were furious, and gnashed their teeth at him. But Stephen,\n full of the Holy Spirit, looked up to heaven and saw the glory\n of God, and Jesus standing at the right hand of God. 'Look,'\n he said, 'I see heaven open and the Son of Man standing at\n the right hand of God.' At this they covered their ears, and\n yelling at the top of their voices, they all rushed him....and\n they dragged him outside the city and stoned him to death.\"\n (Acts 7:51-58)\n \n They were furious! They gnashed their teeth and screamed at the top of their lungs. The council was in an uproar.\n \n One of God's little troublemakers had struck again! So much for \"tolerance!\" And looked at what happened when Stephen rebuked those obstinate people for their sins - the Glory of God appeared! Imagine, if Stephen were standing here today and spoke out against the backslidden and the unregenerate, and he said:\n \n \"You stiff-necked and rebellious people - you, who continue to resist the Holy Spirit, reject Jesus Christ, and live for yourselves. What hope can there possibly be for you? When, if ever, are you going to get yourselves right with the Lord?\" \n \n How popular would that be?\n \n Why was John the Baptist beheaded? Was he a reed swayed by the breeze of political correctness? Was John one of those guys who wanted everyone to be his buddy? Was he someone who sought after his own well-being and personal indulgences? John the Baptist spoke out strongly against the corrupt religious leaders of his day. He went after King Herod and reminded him of his adultery. He called the Sadducees and Pharisees a \"Brood of Vipers!\" He wasn't playing the world's game and looking out for his own welfare and popularity. He wasn't practicing \"tolerance\" and preaching a watered-down gospel that sends people to hell. He was preaching the word of God, trying to turn someone to repentance and salvation, and for that he was labeled a troublemaker and eventually put to death. \n \n Why was Paul beaten and persecuted? Why was James put to death with the sword? Why were the prophets and the apostles martyred? They didn't go after these guys for preaching love and tolerance. They went after them because they exposed sin, corruption, and idolatry, and took a stand for what's right in the eyes of God. They were God's little troublemakers, and the world couldn't handle it. The world stood convicted of its sin, and in order to justify its own worldliness and unrighteousness it chose instead to kill the messengers. Sound familiar?\n \n And herein lies the crux of this message: Exposing sin and confronting apathy and unrighteousness is critically essential to salvation. Without conviction there is no need for a savior. And if the world has no need for a savior, then Jesus' life, death, and resurrection has absolutely no relevance or significance. \n \n Now for those in the church who say we shouldn't \"rock the boat,\" I ask: \"What kind of baptism and faith do we have that calls for almost no separation from the world, produces no personal sacrifice, and breeds practically no animosity towards sin? What kind of born-again experience is it that makes Christ our Savior, but fails to make Him Lord of our lives? And what kind of faith is it that permits us to follow the dictates of this world, and pursue our own pleasures, wants, and feelings, rather than the commandments of God?\" What kind of faith is that? James calls it \"dead faith.\" Where is the evidence of our salvation and new birth if we're not trying to follow God's word? We say, \"Just confess Jesus and you're saved.\" Jesus says, \"Not everyone who says to me, Lord, Lord, will enter into heaven, but only he who does the will of my Father.\" We say, \"Just say this simple prayer and you're in.\" He says, \"If anyone would come after Me, he must deny himself and take up his cross daily and follow me.\" \n \n A man by the name of Thomas Kempis once wrote, \"Many follow Jesus unto the breaking of bread, but few to the drinking of the cup of His passion.\" \n \n Now would you like some sound, scriptural proof that the compromised Church of Jesus Christ has been inundated by the worldly doctrines of tolerance and appeasement? Simply put, there is little or no persecution of Christians in America. Persecution arises when the Gospel of Christ becomes a threat to a perverse and degenerate society. Persecution is evidence that Satan's demonic empire is being threatened - that sin and corruption are being exposed, and that Satan and his people are starting to feel the heat. Persecution is evidence that one of God's little troublemakers has smashed the foundations of a self-righteous society, and by God's righteous Spirit, has brought conviction to the masses. Yet today, the confrontational gospel has yet to shake the foundations of the church, much less the world. \n \n Contrast that with the confrontational message of the early prophets and apostles. King Herod and his \"wife\" were so incensed by the impassioned discourse of John the Baptist that they had him imprisoned and beheaded. Paul's teachings so enraged the idol makers of Ephesus that the silversmiths and craftsmen stirred up an enormous riot that almost resulted in Paul's death. And Stephen's message before the Sanhedrin so infuriated the Pharisees that they gnashed their teeth and turned into a raging mob. Time after time, from the Old Testament to the New, God's little troublemakers spoke out against the scourges of political correctness and condemned evil and iniquity. Time after time, they were mocked, alienated, branded as troublemakers, and were beaten and put to death for exposing lies, greed, and deception. The world was not worthy of them. They were the ancient gladiators of truth and justice, and they served God with humility and honor. Great are their rewards in heaven. \n \n So let this lesson serve you well. Come out of the world and into the faith. Dare to recognize that your eternal rewards are far more encompassing than your earthly desires. Realize that you cannot be a friend of this world and serve Christ too. You will only love the one and hate the other. And understand that in serving your earthly passions you will not only fail to bring the word of salvation to those who tomorrow may pass from this earth into hell, but you will also ultimately antagonize your Creator, to whom you must someday give a full and honest accounting for all you've done, or failed to do in this life.\n \n Acknowledgments to Dr. Michael L. Brown and his book, \"It's Time to Rock the Boat.\" (righterreport.com)\n\n \n \n Figures the only way to attract the attention of the drooling masses is to appease to them with a story about beer.... Anything else you want to fling out of your cracked head Easy?", 
   {
    "unicode_changes_made": true
   }, 
   384599, 
   null, 
   1262657220.0
  ], 
  [
   384620, 
   null, 
   "Easyrider", 
   "Figures the only way to attract the attention of the drooling masses is to appease to them with a story about beer.... Anything else you want to fling out of your cracked head Easy?\n\n \n You're so screwed up. You didn't learn anything from that, did you?", 
   {}, 
   384619, 
   null, 
   1262657340.0
  ], 
  [
   384622, 
   null, 
   "jazyjason", 
   "You're so screwed up. You didn't learn anything from that, did you?\n\n \n Probably because I was distracted by illicit gay sex sin again.... emoticon_xkill You still have not answered as to why you think preaching in your manner is a proper way to spread the gospel by demeaning others.... Still waiting for that answer..", 
   {}, 
   384620, 
   null, 
   1262657700.0
  ], 
  [
   384632, 
   null, 
   "Easyrider", 
   "Probably because I was distracted by illicit gay sex sin again.... You still have not answered as to why you think preaching in your manner is a proper way to spread the gospel by demeaning others.... Still waiting for that answer..\n\n \n I don't answer to you. But I will say this: Even Jesus called the devil a devil, and a brood of vipers a brood of vipers. emoticon_xkill\n \n When are you going to start promoting Christ around here???", 
   {}, 
   384622, 
   null, 
   1262661660.0
  ], 
  [
   384635, 
   null, 
   "Accipiter", 
   "You're so screwed up. You didn't learn anything from that, did you?\n\n \n You're the last person that should be calling anyone screwed up.", 
   {
    "unicode_changes_made": true
   }, 
   384620, 
   null, 
   1262662800.0
  ], 
  [
   384637, 
   null, 
   "Easyrider", 
   "You're the last person that should be calling anyone screwed up.\n\n \n <Flush<\n \n \"Who is the liar? It is the man who denies that Jesus is the Christ. Such a man is the antichrist-he denies the Father and the Son. No one who denies the Son has the Father; whoever acknowledges the Son has the Father also.\" - 1 John 2:22-23 (NIV)", 
   {
    "unicode_changes_made": true
   }, 
   384635, 
   null, 
   1262663640.0
  ], 
  [
   384655, 
   null, 
   "Archangel", 
   "Probably because I was distracted by illicit gay sex sin again.... emoticon_xkill You still have not answered as to why you think preaching in your manner is a proper way to spread the gospel by demeaning others.... Still waiting for that answer..\n\n \n Why don't you stop with the dishonest labeling of what we do here, you liar? You started this thread under false pretense by describing our reason for being here to evangelize when nothing could be further from the truth. I know that my reason for being here is the same as everyone elses, and that is to share my personal opinion on a wide variety of issues, religion being just one of them. Sure, when atheists and secular humanists like you attack christianity, I personally feel obligated to defend it, but that isn't evangelizing at all or proselytizing in any way. It is defending it.\n \n So you need to actually learn what these words like \"preaching\" and \"evangelize\" mean and apply them honestly in the debate. Especially if you are then going to place yourself in the category of an actual believer in Christ when you support, endorse and defend the homosexual lifestyle and all of the illicit sex which God clearly refers to as an abomination. And while you're looking up these words in a dictionary, look up hypocrite and double minded. emoticon_xdonno", 
   {}, 
   384622, 
   null, 
   1262693460.0
  ], 
  [
   384658, 
   null, 
   "jazyjason", 
   "I don't answer to you. But I will say this: Even Jesus called the devil a devil, and a brood of vipers a brood of vipers. emoticon_xkill\n \n When are you going to start promoting Christ around here???\n\n \n \n I actually have personally saying how God has worked in my life for the better. Only difference is I don't go around demonizing other people here with my belief like you...\n \n And of course you won't answer what I ask because in your crazed mind your some holy warrior that's gone off the deep end without a life ring....", 
   {}, 
   384632, 
   null, 
   1262698080.0
  ], 
  [
   384659, 
   null, 
   "jazyjason", 
   "Why don't you stop with the dishonest labeling of what we do here, you liar?\n\n \n Liar? Perhaps you would like to take a look at your previous methods of \"evangelizing?\" \n \n \n \n You started this thread under false pretense by describing our reason for being here to evangelize when nothing could be further from the truth.\n\n \n Then why do you and Easy accuse and deface others beliefs with such zeal and fervor? \n \n \n \n I know that my reason for being here is the same as everyone elses, and that is to share my personal opinion on a wide variety of issues, religion being just one of them.\n\n \n Wrong. Your main reasoning here is not just as reasoning or explaining of opinion, your purpose for being here is to show everyone your definition of faith... Look at your avatar Archie the proof is in the pudding...\n \n \n \n Sure, when atheists and secular humanists like you attack christianity, I personally feel obligated to defend it, but that isn't evangelizing at all or proselytizing in any way. It is defending it.\n\n \n How am I an atheist? Have I ever denied the existence of God? And how am I secular I believe in the validity of Christ. Once again in this VERY post you deface and slander a person who's views or methods are different from yours but share the same relative faith... This is EXACTLY what I am pointing out and you gave the perfect example...\n \n \nSo you need to actually learn what these words like \"preaching\" and \"evangelize\" mean and apply them honestly in the debate.\n I do. And you need to learn the proper methods in which to apply them in context without being overbearing...\n \n \n \n Especially if you are then going to place yourself in the category of an actual believer in Christ when you support, endorse and defend the homosexual lifestyle and all of the illicit sex which God clearly refers to as an abomination. \n\n \n In your opinion and in your prejudiced mind Archie. You based condition upon what a true believer may be and reject what it actually takes to be a follower of Christ which is believing in Him. \n \n \nAnd while you're looking up these words in a dictionary, look up hypocrite and double minded. emoticon_xdonno\n\n \n Pot paging kettle. If anything you should look up the term zealot and prejudice...", 
   {}, 
   384655, 
   null, 
   1262698500.0
  ], 
  [
   384681, 
   null, 
   "jyoshu", 
   "This is not about he said she said although already the spin is there.... It is about the PROPER way or method to evangelize and WHY these overbearing people do this....\n\n \n They do it for the same reasons their equivalents on the other side of the fence, like Matthew, LA, and Foundit do it. A fundie is a fundie, no matter what the ideology. Hate convinces no one, whether it's to redefine marriage or to prevent it.", 
   {}, 
   384586, 
   null, 
   1262709000.0
  ], 
  [
   384687, 
   null, 
   "jazyjason", 
   "They do it for the same reasons their equivalents on the other side of the fence, like Matthew, LA, and Foundit do it. A fundie is a fundie, no matter what the ideology. Hate convinces no one, whether it's to redefine marriage or to prevent it.\n\n \n Stop spinning the subject and trying to bail your fellow fundies out Jyoshu... Seriously. This is a thread based upon methods of evangelism not methods upon which to present ideals. This is far more in depth.\n \n You fail to recognize that these posters regularly slander and dehumanize other peoples beliefs then wonder why no one takes them seriously.... I do agree about Matt on some issues, Foundit I have not seen in awhile and LA hardly if ever has the same bite as Easy does on every single post he makes as a personal vendeta or insult against the said person...", 
   {}, 
   384681, 
   null, 
   1262711940.0
  ], 
  [
   384691, 
   null, 
   "Penfold", 
   "In actual fact, he accused them all, as zealots, of expressing hatred. He is excusing his komrades' hate by accusing others, but he is admitting their hate speech.", 
   {}, 
   384687, 
   null, 
   1262713860.0
  ], 
  [
   384699, 
   null, 
   "jyoshu", 
   "In actual fact, he accused them all, as zealots, of expressing hatred. He is excusing his komrades' hate by accusing others, but he is admitting their hate speech.\n\n \n One isn't \"admitting\" to something they've long already held to, to begin with. I was already of the view that the things Jason is pointing out is hate speech. What Jason doesn't recognize though is that it happens on both sides. Not just one. to focus only on the evangelizing from only the religious fundies here and not realize this is a product of extremism regardless of the mantra is naive, IMO.", 
   {}, 
   384691, 
   null, 
   1262718960.0
  ], 
  [
   384704, 
   null, 
   "JPSartre12", 
   "Stop spinning the subject and trying to bail your fellow fundies out Jyoshu... Seriously. This is a thread based upon methods of evangelism not methods upon which to present ideals. This is far more in depth.\n \n You fail to recognize that these posters regularly slander and dehumanize other peoples beliefs then wonder why no one takes them seriously.... I do agree about Matt on some issues, Foundit I have not seen in awhile and LA hardly if ever has the same bite as Easy does on every single post he makes as a personal vendeta or insult against the said person...\n\n \n If this is a \"thread based upon methods of evangelism not methods upon which to present ideals\" then why do you take the next paragraph to discuss slander and dehumanization? Are these methods of evangelism, IYO? emoticon_confused", 
   {}, 
   384687, 
   null, 
   1262720340.0
  ], 
  [
   384730, 
   null, 
   "jazyjason", 
   "If this is a \"thread based upon methods of evangelism not methods upon which to present ideals\" then why do you take the next paragraph to discuss slander and dehumanization? Are these methods of evangelism, IYO? emoticon_confused\n\n \n No their not. At least not proper methods to express the love and grace of Christ. That is my biggest complaint here... It serves no purpose to score cheap shots at the expense of the message being lost....", 
   {}, 
   384704, 
   null, 
   1262730600.0
  ], 
  [
   384732, 
   null, 
   "jazyjason", 
   "One isn't \"admitting\" to something they've long already held to, to begin with. I was already of the view that the things Jason is pointing out is hate speech. What Jason doesn't recognize though is that it happens on both sides. Not just one. to focus only on the evangelizing from only the religious fundies here and not realize this is a product of extremism regardless of the mantra is naive, IMO.\n\n \n \n Wrong. Once again moving the goalposts and refusing to focus as usual.... First of it is not \"hate\" speech no matter how droll or insulting. In the mind of these people (being the evangelizing zealots) it is for the \"good\" of the person. They think that by prodding and poking it will somehow get their message across.\n \n The issue is the message of Christ gets lost amongst all the insults and dehumanizing.", 
   {}, 
   384699, 
   null, 
   1262730780.0
  ], 
  [
   384734, 
   null, 
   "jazyjason", 
   "In actual fact, he accused them all, as zealots, of expressing hatred. He is excusing his komrades' hate by accusing others, but he is admitting their hate speech.\n\n \n It is not hate speech in their eyes, remember this Pen. And I would not even go so far as to call it hate speech. I call it the aggressive salesman mixed with spiritual comparison. \n \n Measuring your spiritual \"worth\" to someone else based upon ideals or how they align to your point of view.....", 
   {}, 
   384691, 
   null, 
   1262730900.0
  ], 
  [
   384743, 
   null, 
   "pappillion001", 
   "Looking at some posts from other users I find myself asking \"why do people think that overbearing blind irrational discourse is a proper way to share your faith?\" \n \n Is not sharing your faith a means for positive discourse or change in a person? Are you not supposed to preach the change and positive influence your faith has done in your life instead of going around yelling what is wrong with other peoples lives?\n \n Did not Christ in particular preach that loving your neighbor as yourself is one of the greatest of all commandments?\n \n I find that in particular glaring and insulting posts to those who do not share ones exact beliefs to be a brick wall leading to nowhere... In a vain attempt to validate one's own faith or it's lacking thereof you actually damage the credibility of your belief!\n \n So I ask those and I know some of your answers already.... why is Zealotry or overbearing preaching and even insulting other people a clear or even positive way to share your faith?\n\n \n Honestly, because it's fun. AA and ER know they aren't going to change any minds. They want a place they can feel like they knocked some sense into some stiff necked Christ deniers while maybe becoming a little more informed on their beliefs in the process. \n \n And that is pretty much the same for the other side. The intent of this place is to debate ideas and opinions. Sometimes it's as adults and sometimes it's not, but that is also what is appealing. Being able to thank Yoda for his ignorant wisdom and reminding him even on his milk crate he is only 3 feet tall. \n \n \n God how embarrassing if I am the only one who thinks like this.", 
   {}, 
   384417, 
   null, 
   1262731740.0
  ], 
  [
   384744, 
   null, 
   "jazyjason", 
   "Honestly, because it's fun. AA and ER know they aren't going to change any minds. They want a place they can feel like they knocked some sense into some stiff necked Christ deniers while maybe becoming a little more informed on their beliefs in the process. \n \n And that is pretty much the same for the other side. The intent of this place is to debate ideas and opinions. Sometimes it's as adults and sometimes it's not, but that is also what is appealing. Being able to thank Yoda for his ignorant wisdom and reminding him even on his milk crate he is only 3 feet tall. \n \n \n God how embarrassing if I am the only one who thinks like this.\n\n \n Yoda is awesome your not alone. I'm talking Empire Strikes Back Yoda. Not Hey I'm george lucas let me destroy the very franchise I made by making jar jar frickin binks..... Yoda.\n \n Even if the lightsaber battles were cool with Yoda I still like the old Yoda the best...\n \n \n Oh and yeah I understand what your saying but to actually think that is evangelism is not only wrong it's crazy!! If any of those two talked to real life people like that, they'd wind up going to church in a wheelchair the next day....", 
   {}, 
   384743, 
   null, 
   1262731980.0
  ], 
  [
   384759, 
   null, 
   "Easyrider", 
   "Honestly, because it's fun. AA and ER know they aren't going to change any minds.....\n\n \n There you have it. No amount of truth will ever sway the dedicated Christ-deniers!", 
   {}, 
   384743, 
   null, 
   1262734920.0
  ], 
  [
   384783, 
   null, 
   "pappillion001", 
   "There you have it. No amount of truth will ever sway the dedicated Christ-deniers!\n\n \n Just as no amount of truth will get you to let go of your security binky!", 
   {}, 
   384759, 
   null, 
   1262743080.0
  ], 
  [
   384784, 
   null, 
   "pappillion001", 
   "There you have it. No amount of truth will ever sway the dedicated Christ-deniers!\n\n \n I am not dedicated it's just your version or understanding of God has to many concepts that simply don't make sense to any rational person. I can see the potential but it is surrounded by illogical ideas and a philosophy that is at odds with itself. \n \n My best evidence is the inability of Christianity and the other mono religions to maintain a singular consistency. If you take the parts that they all agree on you would most likely have in reality what each faction claims to possess uniquely.", 
   {}, 
   384759, 
   null, 
   1262743920.0
  ], 
  [
   384785, 
   null, 
   "Easyrider", 
   "I am not dedicated it's just your version or understanding of God has to many concepts that simply don't make sense to any rational person. I can see the potential but it is surrounded by illogical ideas and a philosophy that is at odds with itself. \n \n My best evidence is the inability of Christianity and the other mono religions to maintain a singular consistency. If you take the parts that they all agree on you would most likely have in reality what each faction claims to possess uniquely.\n\n \n Just for someday in the future - you will find Christ / God when you pursue him in prayer to reveal himself to you. I know you don't believe that right now, but it's true.", 
   {}, 
   384784, 
   null, 
   1262744580.0
  ], 
  [
   384786, 
   null, 
   "pappillion001", 
   "Yoda is awesome your not alone. I'm talking Empire Strikes Back Yoda. Not Hey I'm george lucas let me destroy the very franchise I made by making jar jar frickin binks..... Yoda.\n \n Even if the lightsaber battles were cool with Yoda I still like the old Yoda the best...\n \n \n Oh and yeah I understand what your saying but to actually think that is evangelism is not only wrong it's crazy!! If any of those two talked to real life people like that, they'd wind up going to church in a wheelchair the next day....\n\n \n In all fairness I have seen AA turn on the charm. His arguments are more compelling, but the fire and brimstone AA is far more entertaining.\n \n I think easy has his moments as well. He doesn't get as warm and fuzzy, just tries to flood you with info, but I will give them both the credit for sticking around because while they do give a lot of abuse, they take a lot as well. I know that personally I know more now having had to research when arguing against them than before I started. (I know being a Christ denier I couldn't have learned very much)", 
   {}, 
   384744, 
   null, 
   1262744640.0
  ], 
  [
   384791, 
   null, 
   "Archangel", 
   "How am I an atheist? Have I ever denied the existence of God? And how am I secular I believe in the validity of Christ. Once again in this VERY post you deface and slander a person who's views or methods are different from yours but share the same relative faith... This is EXACTLY what I am pointing out and you gave the perfect example...\n\n \n You are a secular humanist jason, otherwise known as a wolf in sheep's clothing with your religious sounding lip service. You are a hypocrite who claims a form of Godliness while denying the power thereof. You continue to insist that you know the Lord personally yet you refuse to submit to His will which is the only real tenet of being a follower of His. If you do possess the Holy Spirit within you, you are grieving Him every time you fulfill the lust of the flesh for another member of your gender. \n \n Every time you defend homosexuality on this or any public forum, you are publicly endorsing that which is an abomination to the God you claim to love and trust with your life. This makes you a servant of the enemy of God and the eternal truths He stands for. How do you explain this hypocrisy jason? And why do you consider these admonitions from me attempts to evangelize when all I am doing is warning you of the error of your ways? \n \n Here is a verse I attempt to live by jason. It is a passage I have burned into my heart, soul and mind as a reminder of the type of child I want to be to my Heavenly Father who is my salvation via Jesus the Christ Messiah of the world.\n \n Tts 2:11 For the grace of God that brings salvation has appeared to all men,\n Tts 2:12 teaching us that, denying ungodliness and worldly lusts, we should live soberly, righteously, and godly in the present age,\n Tts 2:13 looking for the blessed hope and glorious appearing of our great God and Savior Jesus Christ,\n Tts 2:14 who gave Himself for us, that He might redeem us from every lawless deed and purify for Himself [His] own special people, zealous for good works.\n Tts 2:15 Speak these things, exhort, and rebuke with all authority. Let no one condemn you.\n \n Notice the bolded sentence jason. It says it all regarding what each of our goals should be regarding our personal walk in this life. It definitely represents my goal in this life. Are you personally denying ungodliness and worldly lusts jason? Are you living soberly, righteously and godly in this present age of rebellion? Are you hungering for and looking for the blessed hope and glorious return of our Lord Jesus Christ? If you were, you wouldn't spend your limited life force here defending, endorsing and justifying homosexuality here which is an abomination before God in both the Old and New Testaments.\n \n Now come on back and ignore everything I've said which is absolutely substantial and right on target regarding what you represent. Come on back and ask me why I evangelize as I do while ignoring the meat of my post which exposes the hypocrisy and deceit which you represent with your religious sounding lip service which has no truth in it at all, coming from you. And once again my dishonest wolf in sheeps clothing, learn the difference between evangelizing, and defending ones faith against liars and the lies they tell about my God and savior.", 
   {}, 
   384786, 
   null, 
   1262749080.0
  ], 
  [
   384804, 
   null, 
   "jazyjason", 
   "You are a secular humanist jason, otherwise known as a wolf in sheep's clothing with your religious sounding lip service. You are a hypocrite who claims a form of Godliness while denying the power thereof. \n\n \n Since when have I ever claimed a form of Godliness? Did I not just mention to Easy that there is not one righteous man or have you already forgotten? Just because I myself hold to my own beliefs and that they differ form your ideals does not make me a hypocrite, it makes you stubborn and narrow minded...\n \n \nYou continue to insist that you know the Lord personally yet you refuse to submit to His will which is the only real tenet of being a follower of His.\n\n \n How am I refusing Archie? By being Gay? By having a loving committed partner in a monogamous relationship? If this is your big form of evidence it is shallow at best....\n \n \n If you do possess the Holy Spirit within you, you are grieving Him every time you fulfill the lust of the flesh for another member of your gender. \n\n \n And I assume as much that you can confirm this.... Once against carnality and only one element of a person, even of a persons faith... That is all you will ever see....\n \n \nEvery time you defend homosexuality on this or any public forum, you are publicly endorsing that which is an abomination to the God you claim to love and trust with your life. \n\n \n In your opinion and in your literalistic idealism Archie.... \n \n \nThis makes you a servant of the enemy of God and the eternal truths He stands for. How do you explain this hypocrisy jason? And why do you consider these admonitions from me attempts to evangelize when all I am doing is warning you of the error of your ways? \n \n \n\n \n An enemy of God...... You know Archie I wonder sometimes if you even realize what you are saying half the time.... You sure know how to jump to conclusions and judge others quicker than you can look in the mirror....\n \n Perhaps you would have preferred me to be a tormented soul in the closet despairing until finally committing suicide as many LGBT youth who are of faith based families often do.....\n \n Is that what you would want for us? Because Archie I can affirm to you that if it were a choice and if it were my choice I would take the life of being a strait man easily....\n \n You fail to grasp this simple yet weighing concept. Because you do not know what it is like going through such trials that is where you ARE blind Archie.... And no amount of scripture or lip service or preaching will ever bring you closer to understanding such....", 
   {}, 
   384791, 
   null, 
   1262783100.0
  ], 
  [
   384809, 
   null, 
   "thelmoose", 
   "I am not dedicated it's just your version or understanding of God has to many concepts that simply don't make sense to any rational person. I can see the potential but it is surrounded by illogical ideas and a philosophy that is at odds with itself. \n \n My best evidence is the inability of Christianity and the other mono religions to maintain a singular consistency. If you take the parts that they all agree on you would most likely have in reality what each faction claims to possess uniquely.\n\n \n Well put. \n A nice summary of the rationale of non-belief.\n Thanks.", 
   {}, 
   384784, 
   null, 
   1262795100.0
  ], 
  [
   385093, 
   null, 
   "jyoshu", 
   "Wrong. Once again moving the goalposts and refusing to focus as usual.... First of it is not \"hate\" speech no matter how droll or insulting. In the mind of these people (being the evangelizing zealots) it is for the \"good\" of the person. They think that by prodding and poking it will somehow get their message across.\n \n The issue is the message of Christ gets lost amongst all the insults and dehumanizing.\n\n \n I find it interesting that you are trying to indicate your point for this thread is from the standpoint of what's truly good for evangelism's sake.\n There is no credibility on your part that you are really interested in Christianity's benefit here. Your life's mantra seems to be gay pride, rather than Christ. And let's be honest--a Christian's purpose is going to be about Christ, even above gay pride or gay-related issues, if you are gay. (this is exactly why so many \"ex-gays\" are able to do what they do: they are Christian first; all other things second. So being Christian trumps their sexuality, by a long shot.) I'm sorry, but I don't see how a person can put gay-related issues foremost above all things and then indicate he's Christian.", 
   {}, 
   384732, 
   null, 
   1262972400.0
  ], 
  [
   386082, 
   null, 
   "jazyjason", 
   "I find it interesting that you are trying to indicate your point for this thread is from the standpoint of what's truly good for evangelism's sake.\n There is no credibility on your part that you are really interested in Christianity's benefit here. Your life's mantra seems to be gay pride, rather than Christ. And let's be honest--a Christian's purpose is going to be about Christ, even above gay pride or gay-related issues, if you are gay. (this is exactly why so many \"ex-gays\" are able to do what they do: they are Christian first; all other things second. So being Christian trumps their sexuality, by a long shot.) I'm sorry, but I don't see how a person can put gay-related issues foremost above all things and then indicate he's Christian.\n\n \n \n Sadly Jyoshu you fail to understand nor attempt to actually see the issue at hand. You are accusing me of revolving around gay \"pride\" and other LGBT issues instead of evangelism. Have you just skimmed over my posts concerning Christ? Or rather do you try to play again the issue and redirect fire toward me to avoid the issue at hand.\n \n The issue is not anything of LGBT in this thread. Rather it was brought yet again to that point by the very people I have pointed out to be narrow minded zealots who's methods do nothing to further the positive message of Christianity.\n \n You fail to see this and make rather small pokes and jabs trying to find flaw in one's argument to then switch the issue instead of addressing it. Instead of accusing me of being self centered around Gay pride and bringing up the myth of \"ex\" gays which has shown horrible results of closeted men returning to a life of one night pick ups and sexual dangers, why not address the main issue at hand? Because you can't.", 
   {}, 
   385093, 
   null, 
   1263731340.0
  ], 
  [
   386112, 
   null, 
   "Easyrider", 
   "\n \n The issue is not anything of LGBT in this thread. Rather it was brought yet again to that point by the very people I have pointed out to be narrow minded zealots who's methods do nothing to further the positive message of Christianity. \n\n \n Truth is usually pointed and narrow-minded. That doesn't mean it's wrong. Same for those who rightly defend the Bible when it identifies gay sex as being a sin and a perversion. \n \n But the real turkeys are the LGBT zealots who flaunt and defend unbiblical gay sex sin, and trash anyone who doesn't embrace their narrow-minded views.", 
   {}, 
   386082, 
   null, 
   1263734880.0
  ], 
  [
   386275, 
   null, 
   "jazyjason", 
   "Truth is usually pointed and narrow-minded. That doesn't mean it's wrong. Same for those who rightly defend the Bible when it identifies gay sex as being a sin and a perversion. \n \n But the real turkeys are the LGBT zealots who flaunt and defend unbiblical gay sex sin, and trash anyone who doesn't embrace their narrow-minded views.\n\n \n How am I trashing others? YOUR the one who is going around mouthing off saying their faith is flase or invalid. If anything I have defended my faith and faith in general and attempted to paint belief in a positive spotlight to try and cleanse it from your horrible taint and foul mark.....\n \n Once again gay sex sin.... I really am beginning to wonder about you Easy.... Why do you obsess so much over sex espeically Gay sex? Just curious.....", 
   {}, 
   386112, 
   null, 
   1263811980.0
  ], 
  [
   386280, 
   null, 
   "pappillion001", 
   "How am I trashing others? YOUR the one who is going around mouthing off saying their faith is flase or invalid. If anything I have defended my faith and faith in general and attempted to paint belief in a positive spotlight to try and cleanse it from your horrible taint and foul mark.....\n \n Once again gay sex sin.... I really am beginning to wonder about you Easy.... Why do you obsess so much over sex espeically Gay sex? Just curious.....\n\n \n Oh come on now you've gone well past curious, Easy on the other hand.....", 
   {}, 
   386275, 
   null, 
   1263812520.0
  ], 
  [
   386285, 
   null, 
   "Easyrider", 
   "Oh come on now you've gone well past curious, Easy on the other hand.....\n\n \n Easy, on the other hand, is strongly recommending you repent of your many sins and receive Jesus Christ as your Lord and Savior for the remission of your sins. Do that before you wind up in the Pit, and you will be saved.", 
   {}, 
   386280, 
   null, 
   1263825360.0
  ], 
  [
   386487, 
   null, 
   "jazyjason", 
   "Oh come on now you've gone well past curious, Easy on the other hand.....\n\n \n \n Curious..... Lol I passed that phase a LONG time ago.... I dunno about him. I think personally he just likes to snipe at groups of people he dislikes or hates....\n \n I mean come one wouldn't you get XXXXXX off if you saw a bunch of happy queens enjoying life? I know I would if I was a insecure middle to late late late aged self loathing strait guy. Then again I know alot of messed up queens so lets not even go there...... emoticon_frazzled", 
   {}, 
   386280, 
   null, 
   1263906840.0
  ], 
  [
   386488, 
   null, 
   "jazyjason", 
   "Easy, on the other hand, is strongly recommending you repent of your many sins and receive Jesus Christ as your Lord and Savior for the remission of your sins. Do that before you wind up in the Pit, and you will be saved.\n\n \n You never responded to me..... Lol.\n \n Oh and I would love to find out that the pit is filled with marshmallows or ice cream that would be so ironic.... mmmmm ice cream.....", 
   {}, 
   386285, 
   null, 
   1263906960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Zealotry A Proper Way To Evangelize?", 
  "url": "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13747, 
  "discussion_files": [
   [
    "8662.html", 
    "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize-print.html"
   ], 
   [
    "8663.html", 
    "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize-5-print.html"
   ], 
   [
    "8664.html", 
    "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize-4-print.html"
   ], 
   [
    "8665.html", 
    "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize-3-print.html"
   ], 
   [
    "8666.html", 
    "http://www.4forums.com/political/religion-debates/13747-zealotry-proper-way-evangelize-2-print.html"
   ]
  ], 
  "identifier": 13747
 }
]