[
 [
  [
   384029, 
   null, 
   "Easyrider", 
   "That's what Trebor barked out recently.\n \n Christianity says otherwise. From John Chapter 8:\n \n The Children of the Devil \n \n 42 Jesus said to them, \"If God were your Father, you would love me, for I came from God and now am here. I have not come on my own; but he sent me. 43 Why is my language not clear to you? Because you are unable to hear what I say. 44 You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. 45 Yet because I tell the truth, you do not believe me! 46 Can any of you prove me guilty of sin? If I am telling the truth, why don't you believe me? 47 He who belongs to God hears what God says. The reason you do not hear is that you do not belong to God.\"\n \n John 3:36 - Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God's wrath remains on him.\"\n \n And that's what Jesus said to the JEWS of his day. \n \n It's even highly unlikely Trebor's claim comes from Judaism, due to scores of OT passages that show God's seething displeasure with various Jews and Gentiles.\n \n So, Trebor and like-minded individuals, three questions for starters:\n \n 1. Where did you get that idea from that we are all sons and daughters of God? \n 2. What evidence do you have that whoever wrote that knows what they're talking about?\n 3. Is that a \"truth\" for all eternity or just until people die?", 
   {
    "post_info": {
     "post_title": "Are we all Sons and Daughters of God(s)?"
    }
   }, 
   null, 
   null, 
   1262100120.0
  ], 
  [
   384031, 
   null, 
   "trebor", 
   "That's what Trebor barked out recently.\n \n Christianity says otherwise. From John Chapter 8:\n \n The Children of the Devil \n \n 42 Jesus said to them, \"If God were your Father, you would love me, for I came from God and now am here. I have not come on my own; but he sent me. 43 Why is my language not clear to you? Because you are unable to hear what I say. 44 You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. 45 Yet because I tell the truth, you do not believe me! 46 Can any of you prove me guilty of sin? If I am telling the truth, why don't you believe me? 47 He who belongs to God hears what God says. The reason you do not hear is that you do not belong to God.\"\n \n John 3:36 - Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God's wrath remains on him.\"\n \n And that's what Jesus said to the JEWS of his day. \n \n It's even highly unlikely Trebor's claim comes from Judaism, due to scores of OT passages that show God's seething displeasure with various Jews and Gentiles.\n \n So, Trebor and like-minded individuals, three questions for starters:\n \n 1. Where did you get that idea from that we are all sons and daughters of God? \n 2. What evidence do you have that whoever wrote that knows what they're talking about?\n 3. Is that a \"truth\" for all eternity or just until people die?\n\n \n From your superstitious New Testament.\n \n \n Stop clinging to me; for I have not yet ascended to the Father; but go to my brethren (disciples), and say to them, 'I ascend to my Father and your Father, and my God and your God.' (John 20: 17).\n \n \n Then there is the prayer \n \n Our Father who art in Heaven hollowed be Thy name\n \n And the words of attributed to Jesus in Mark 7:25-26\n 11:25 And when ye stand praying, forgive, if ye have ought against any: that your Father also which is in heaven may forgive you your trespasses. \n 11:26 But if ye do not forgive, neither will your Father which is in heaven forgive your trespasses.\n \n If you don't accept the words of your own bible, well, I just can't imagine why you are pushing it then. \n \n It's a theme that is taken from the Jewish scripture, for example \n 1 Chronicles 29:10-18 \n \n 10And he blessed the Lord before all the multitude, and he said: Blessed art thou, O Lord the God of Israel, our father from eternity to eternity.\n \n I mean, it's pretty plain, eternity to eternity is stating for all time. \n \n As for when we die, meh, you'll find out when you get put into the time out corner for not playing with your fellow children nicely.\n \n \n So, biblically speaking, we are all god's children.", 
   {}, 
   384029, 
   null, 
   1262103180.0
  ], 
  [
   384054, 
   null, 
   "Easyrider", 
   "From your superstitious New Testament.\n \n \n Stop clinging to me; for I have not yet ascended to the Father; but go to my brethren (disciples), and say to them, 'I ascend to my Father and your Father, and my God and your God.' (John 20: 17).\n \n \n Then there is the prayer \n \n Our Father who art in Heaven hollowed be Thy name\n \n And the words of attributed to Jesus in Mark 7:25-26\n 11:25 And when ye stand praying, forgive, if ye have ought against any: that your Father also which is in heaven may forgive you your trespasses. \n 11:26 But if ye do not forgive, neither will your Father which is in heaven forgive your trespasses.\n \n If you don't accept the words of your own bible, well, I just can't imagine why you are pushing it then. \n\n \n Those are believers, Trebor. You say everyone (obviously including non-believers, Saddam Hussein, Hitler, etc. ) is a son or daughter of God. Would you like to revise your generalization, of shall we count Adolph Hitler in as a son of God?\n \n \nIt's a theme that is taken from the Jewish scripture, for example \n 1 Chronicles 29:10-18 \n \n 10And he blessed the Lord before all the multitude, and he said: Blessed art thou, O Lord the God of Israel, our father from eternity to eternity.\n \n I mean, it's pretty plain, eternity to eternity is stating for all time. \n \n As for when we die, meh, you'll find out when you get put into the time out corner for not playing with your fellow children nicely.\n \n So, biblically speaking, we are all god's children.\n\n \n No. I just showed you in the OP where the NT says not all are sons of God. Some were of their father the devil, remember?\n \n Now, going back to the OT, so try these on for size:\n \n Psalm 73:18,19. \"Surely thou didst set them in slippery places; thou castedst them down into destruction: How are they brought into desolation as in a moment!\"\n \n We often read of the fury of God; as in Isa. 59:18. \"According to their deeds, accordingly he will repay fury to his adversaries.\" So Isa. 66:15. \"For behold, the Lord will come with fire, and with his chariots like a whirlwind, to render his anger with fury, and his rebuke with flames of fire.\" \n \n Ezek. 8:18. \"Therefore will I also deal in fury: mine eye shall not spare, neither will I have pity; and though they cry in mine ears with a loud voice, yet I will not hear them.\"\n \n How awful are those words from Isa. 63:3, which are the words of the great God. \"I will tread them in mine anger, and will trample them in my fury, and their blood shall be sprinkled upon my garments, and I will stain all my raiment.\" It is perhaps impossible to conceive of words that carry in them greater manifestations of these three things, viz. contempt, and hatred, and fierceness of indignation.\n \n Isa. 66:23,24. \"And it shall come to pass, that from one new moon to another, and from one sabbath to another, shall all flesh come to worship before me, saith the Lord. And they shall go forth and look upon the carcasses of the men that have transgressed against me; for their worm shall not die, neither shall their fire be quenched, and they shall be an abhorring unto all flesh.\"\n \n Select Sermons | Christian Classics Ethereal Library\n \n From a prior post: Isaiah call the Jews \"Sodomites;\" Jeremiah likens them to \"a wild XXX in heat;\" Ezekiel and Hosea classify them as \"adultresses;\" and Amos likens them to a \"father and son who use the same girl.\" \n \n And the Lord said to Moses, \"I have seen this people, and behold, it is a stiff-necked people; now therefore let me alone, that my wrath may burn hot against them and I may consume them [Exod. 32: 9-10].\n \n Elsewhere in the Bible, God wiped out everyone except Noah and his family; he destroyed Sodom and Gomorrah; Jericho; a great number of the Exodus people, and numerous men and nations throughout the OT.\n \n \"You are destroyed, O Israel, because you are against me, against your helper. Hosea 13:9\n \n Multitudes who sleep in the dust of the earth will awake: some to everlasting life, others to shame and everlasting contempt. - Daniel 12:2\n \n And these are all sons and daughters of God? You can't be serious.", 
   {}, 
   384031, 
   null, 
   1262132880.0
  ], 
  [
   384056, 
   null, 
   "pappillion001", 
   "That's what Trebor barked out recently.\n \n Christianity says otherwise. From John Chapter 8:\n \n The Children of the Devil \n \n 42 Jesus said to them, \"If God were your Father, you would love me, for I came from God and now am here. I have not come on my own; but he sent me. 43 Why is my language not clear to you? Because you are unable to hear what I say. 44 You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. 45 Yet because I tell the truth, you do not believe me! 46 Can any of you prove me guilty of sin? If I am telling the truth, why don't you believe me? 47 He who belongs to God hears what God says. The reason you do not hear is that you do not belong to God.\"\n \n John 3:36 - Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God's wrath remains on him.\"\n \n And that's what Jesus said to the JEWS of his day. \n \n It's even highly unlikely Trebor's claim comes from Judaism, due to scores of OT passages that show God's seething displeasure with various Jews and Gentiles.\n \n So, Trebor and like-minded individuals, three questions for starters:\n \n 1. Where did you get that idea from that we are all sons and daughters of God? \n 2. What evidence do you have that whoever wrote that knows what they're talking about?\n 3. Is that a \"truth\" for all eternity or just until people die?\n\n \n Jews of his day would have scratched their heads asking what is he talking about? Maybe that is why they couldn't understand him. Judaism doesn't have a Christian devil. The Satan has a limited appearance and does not have God like abilities. That would make him a God and Judaism doesn't have more than one. \n \n Are we one or the other or are we something else and be come one or the other? If we can become one or the other what are we to begin with and when do we become one or the other? Can we remain neither or can we be both at various times?\n \n What evidence do you have that whoever wrote that knows what they are talking about?", 
   {}, 
   384029, 
   null, 
   1262133420.0
  ], 
  [
   384057, 
   null, 
   "Easyrider", 
   "Jews of his day would have scratched their heads asking what is he talking about? Maybe that is why they couldn't understand him.\n\n \n There's plenty who did understand him. Why do you think that was?\n \n \n\n Judaism doesn't have a Christian devil. The Satan has a limited appearance and does not have God like abilities.\n\n \n No one is like God, but Satan is the Christian and Jewish devil and wants to be like God.\n \n \n\n What evidence do you have that whoever wrote that knows what they are talking about?\n\n \n Multiple authors confirm Jesus rose from the dead. Try to falsify that one if you think you can.", 
   {}, 
   384056, 
   null, 
   1262135160.0
  ], 
  [
   384063, 
   null, 
   "Zardoz", 
   "I also thought the bible said God knew us before we were born.\n \n And that Satan does NOT create but destroys.", 
   {}, 
   384057, 
   null, 
   1262145000.0
  ], 
  [
   384067, 
   null, 
   "pappillion001", 
   "There's plenty who did understand him. Why do you think that was?\n\n \n Because many of them were gentiles. The verse you use to start this thread gives you an idea of how well he was received by them. There is also Paul who was probably a smart guy and well spoken. His logic, although a little flawed, would easily convince a certain segment of the population. \n \n \nNo one is like God, but Satan is the Christian and Jewish devil and wants to be like God.\n\n \n For Christianity, but not in Judaism\n \n \nMultiple authors confirm Jesus rose from the dead. Try to falsify that one if you think you can.\n\n \n Why, you wont accept it, but why is it you have to have faith? Why do you need to trust that the Gospels are right? Why couldn't early Christians agree what Jesus said? Why did the change certain verses? How do you know with any doubt the Bible today, which is still subject to additions and omissions, is correct? \n \n You have 2 possible eyewtiness accounts and 3 heresay accounts. All of which were written well after the fact. It was @ 300 years after the fact that Christians finally decided to collectively decide which texts to use and which of those texts was correct. Today we have 5500 fragments and whole manuscripts and you can't get two to match word for word. Now we know why faith is required.", 
   {}, 
   384057, 
   null, 
   1262146200.0
  ], 
  [
   384071, 
   null, 
   "Easyrider", 
   "Because many of them were gentiles.\n\n \n Some were and some weren't. But Christianity was founded by Jews. And the God of the Jews. \n \n \n\n You have 2 possible eyewtiness accounts and 3 heresay accounts. All of which were written well after the fact.\n\n \n Historical accounts normally are written after the fact, and often with hearsay accounts. \n \n Are you ready to chuck the vast majority of secular history books in the trash using the same criteria?? Why not?\n \n \n\n It was @ 300 years after the fact that Christians finally decided to collectively decide which texts to use and which of those texts was correct. Today we have 5500 fragments and whole manuscripts and you can't get two to match word for word. Now we know why faith is required.\n\n \n Which major tenet of the faith was placed in doubt by minor word fluctuations? I don't know of any.\n \n They say some 97% of the NT can be recreated using non-biblical sources (Church fathers, etc.). \n \n Now, why don't you start showing us your wisdom by refuting the resurrection?? No one in 2,000 years has been able to do it.", 
   {}, 
   384067, 
   null, 
   1262148780.0
  ], 
  [
   384152, 
   null, 
   "pappillion001", 
   "Some were and some weren't. But Christianity was founded by Jews. And the God of the Jews. \n\n \n Gentiles were the group most successfully indoctrinated into the early church. The Jewish population despite it's similarity were hesitant and within a few years Christianity started diverging from traditional Judaism, so that by 100 years later, very little was held in common between the two. \n \n \n \nHistorical accounts normally are written after the fact, and often with hearsay accounts. \n \n Are you ready to chuck the vast majority of secular history books in the trash using the same criteria?? Why not?\n\n \n Are you willing to give those secular accounts the same influence as the Gospels? That is why if we are speaking strictly reference material they all should be treated the same as ideology or mandate towards behavior then the bar gets raised some.\n \n \nWhich major tenet of the faith was placed in doubt by minor word fluctuations? I don't know of any.\n \n They say some 97% of the NT can be recreated using non-biblical sources (Church fathers, etc.). \n \n \n Who is to say which is right and which is wrong. The originals are gone. The earliest complete copies are 200 - 300 years later. Those who were supposed to keep the NT did a poor job, adding or deleting verse to fit their own ideas. Below describes the single worst concept to infect the early church, a problem that can still be found today.\n \n There is evidence suggesting many things, but also remember the church was never understanding concerning teachings that did not conform to their view. Books and authors were sometimes burned together and punishment could be swift and severe for even knowing of text banned by the church\n \n Saying that the NT can be reconstructed means only that by taking fragments from authors coming after the 2nd century thru the 15th you would be able to recreate most of the NT we have today. \n \n \n Even those Catholic theologians who defend Apostolicity as a test for the inspiration of the New Testament (see above) admit that it is not exclusive of another criterion, viz., Catholic tradition as manifested in the universal reception of compositions as Divinely inspired, or the ordinary teaching of the Church, or the infallible pronouncements of ecumenical councils. This external guarantee is the sufficient, universal, and ordinary proof of inspiration. The unique quality of the Sacred Books is a revealed dogma. Moreover, by its very nature inspiration eludes human observation and is not self-evident, being essentially superphysical and supernatural. Its sole absolute criterion, therefore, is the Holy inspiring Spirit, witnessing decisively to Itself, not in the subjective experience of individual souls, as Calvin maintained, neither in the doctrinal and spiritual tenor of Holy Writ itself, according to Luther, but through the constituted organ and custodian of Its revelations, the Church. All other evidences fall short of the certainty and finality necessary to compel the absolute assent of faith. (See Franzelin, \"De Divinâ Traditione et Scripturâ\"; Wiseman, \"Lectures on Christian Doctrine\", Lecture ii; also INSPIRATION.)\n \n This is from Ireneus and this is an example of some methods used to determine the Bible. Strange that for someone so assured he would be going UP to Heaven and heretics would be going DOWN to hell that niether of those are considered directions.\n \n It is not possible that the gospels can be either more or fewer in number than they are, since there are four directions of the world in which we live, and there are four principal winds. (adv. Haer. 3.11.8)\n \n \nNow, why don't you start showing us your wisdom by refuting the resurrection?? No one in 2,000 years has been able to do it.\n\n \n The resurrection cannot be proven without doubt as being true or false. The arguments that it is false are more compelling, being far more reasonable than those for it being true. \n \n Easy there is nothing that would change your mind that the resurrection happened and your are not alone. This fact has more to do with no one disproving it that any other reason.", 
   {}, 
   384071, 
   null, 
   1262255880.0
  ], 
  [
   384156, 
   null, 
   "Easyrider", 
   "Gentiles were the group most successfully indoctrinated into the early church. The Jewish population despite it's similarity were hesitant and within a few years Christianity started diverging from traditional Judaism, so that by 100 years later, very little was held in common between the two. \n\n \n Like I said, Christianity is the true fulfillment of OT Judaism. That many Jews would reject the NT and their Messiah was prophesied in the OT.\n \n \nAre you willing to give those secular accounts the same influence as the Gospels? \n\n \n Unless there's compelling evidence not to do so then yes. But you appear to want two different standards: One for secular accounts of ancient history and one for the Bible. That's evident because I don't see you wearing out the threads arguing against the death of Caesar in 44 B.C., or many other ancient accounts.\n \n \n \n \n Who is to say which is right and which is wrong. The originals are gone. The earliest complete copies are 200 - 300 years later....\n\n \n Is the New Testament Reliable?\n \n Conclusion: What can we conclude from this evidence? New Testament specialist Daniel Wallace notes that although there are about 300,000 individual variations of the text of the New Testament, this number is very misleading. Most of the differences are completely inconsequential--spelling errors, inverted phrases and the like. A side by side comparison between the two main text families (the Majority Text and the modern critical text) shows agreement a full 98% of the time.[18] \n \n Of the remaining differences, virtually all yield to vigorous textual criticism. This means that our New Testament is 99.5% textually pure. In the entire text of 20,000 lines, only 40 lines are in doubt (about 400 words), and none affects any significant doctrine.[19] \n \n Greek scholar D.A. Carson sums up this way: \"The purity of text is of such a substantial nature that nothing we believe to be true, and nothing we are commanded to do, is in any way jeopardized by the variants.\"[20] \n \n This issue is no longer contested by non-Christian scholars, and for good reason. Simply put, if we reject the authenticity of the New Testament on textual grounds we'd have to reject every ancient work of antiquity and declare null and void every piece of historical information from written sources prior to the beginning of the second millennium A.D. \n \n Stand to Reason: Is the New Testament Text Reliable?\n \n Is the new testament historically reliable?\n \n These and other data (not presented) provide very strong evidence that the writings in the NT as we have them now are accurate, reliable, and authentic. The natural conclusion is that they are trustworthy as a source of Jesus' life and teaching. The great classical scholar Sir Fredric Kenyon wrote:\n \n \"The interval then between the dates of original composition and the earliest extant evidence becomes so small as to be in fact negligible, and the last foundation for any doubt that the Scriptures have come down to us as substantially as they were written has now been removed. Both the authenticity and the general integrity of the books of New Testament may be regarded as finally established.\"\n \n Is The New Testament Historically Reliable? | New Life Church\n \n JESUS IS LORD!", 
   {}, 
   384152, 
   null, 
   1262260980.0
  ], 
  [
   384178, 
   null, 
   "pappillion001", 
   "Like I said, Christianity is the true fulfillment of OT Judaism. That many Jews would reject the NT and their Messiah was prophesied in the OT.\n\n \n Biblical prophecy is more worthless that typical prophecy. I posted using the same methods to show Jesus as Messiah that a rooster is Messiah and the site I got it from also was able to make Tiger Woods the Messiah (done pre cheating husband days)\n \n \nUnless there's compelling evidence not to do so then yes. But you appear to want two different standards: One for secular accounts of ancient history and one for the Bible. That's evident because I don't see you wearing out the threads arguing against the death of Caesar in 44 B.C., or many other ancient accounts.\n\n \n Not at all. The gospels serve two functions. The first is insight for historical learning purposes. This doesn't matter if the documents are real or not as forged or altered documents can provide understanding about what was happening that caused that. All historical documents should be treated the same in this category. \n \n The second is the basis for ethical and moral conduct for Christians and indirectly everybody else in the world. Documents with this or similiar influence should be subject to far more stringent standards. \n \n So pipe up with something other than the bible that fits description 2 and I will offer my opinion. When Caesar died isn't going to influence anybodies vote or cause them to perform any number of actions today.\n \n \nIs the New Testament Reliable?\n \n Conclusion: What can we conclude from this evidence? New Testament specialist Daniel Wallace notes that although there are about 300,000 individual variations of the text of the New Testament, this number is very misleading. Most of the differences are completely inconsequential--spelling errors, inverted phrases and the like. A side by side comparison between the two main text families (the Majority Text and the modern critical text) shows agreement a full 98% of the time.[18] \n \n Of the remaining differences, virtually all yield to vigorous textual criticism. This means that our New Testament is 99.5% textually pure. In the entire text of 20,000 lines, only 40 lines are in doubt (about 400 words), and none affects any significant doctrine.[19] \n \n Greek scholar D.A. Carson sums up this way: \"The purity of text is of such a substantial nature that nothing we believe to be true, and nothing we are commanded to do, is in any way jeopardized by the variants.\"[20] \n \n This issue is no longer contested by non-Christian scholars, and for good reason. Simply put, if we reject the authenticity of the New Testament on textual grounds we'd have to reject every ancient work of antiquity and declare null and void every piece of historical information from written sources prior to the beginning of the second millennium A.D. \n \n Stand to Reason: Is the New Testament Text Reliable?\n \n Is the new testament historically reliable?\n \n These and other data (not presented) provide very strong evidence that the writings in the NT as we have them now are accurate, reliable, and authentic. The natural conclusion is that they are trustworthy as a source of Jesus' life and teaching. The great classical scholar Sir Fredric Kenyon wrote:\n \n \"The interval then between the dates of original composition and the earliest extant evidence becomes so small as to be in fact negligible, and the last foundation for any doubt that the Scriptures have come down to us as substantially as they were written has now been removed. Both the authenticity and the general integrity of the books of New Testament may be regarded as finally established.\"\n \n Is The New Testament Historically Reliable? | New Life Church\n\n JESUS IS LORD![/QUOTE]\n \n So what did the originals say? You don't know and nirther does anybody else. All the above are forced to make some assumptions and sometimes guess. These claims are made based on the assumption of what they believe the bible is supposed to say. The ealiest complete bible comes from the same period when Christians finally got together and decided what was acceptable and what was not. They destroyed everything else, so of course the differences should be within reason, but they aren't. \n \n One big issue is they didn't get together to decide until approximatly 300 years after Jesus died. Mostly to address the fact that there were to many different versions of to many different manuscripts. By that time nobody knew exactly which, if any were the exact correct version. One major criteria was that it had to conform to current beliefs held by the church at that time. There was not unamoius agreement on the books selected either, eventually yes but some folks had to be sent to hell and some had to be talked into it. \n \n So at the end of the day what you are left with is the best guess of 3rd - 6th generation Christians best guess based on what they thought was correct. \n \n By the way the new avatar is nice, but wouldn't posiedon be a conflict?", 
   {}, 
   384156, 
   null, 
   1262276760.0
  ], 
  [
   384180, 
   null, 
   "Easyrider", 
   "Biblical prophecy is more worthless that typical prophecy. I posted using the same methods to show Jesus as Messiah that a rooster is Messiah and the site I got it from also was able to make Tiger Woods the Messiah (done pre cheating husband days)\n\n \n Well, when you can show me one of the Messianic prophecies of Jesus that ever failed (just one - your best one) then you might have some credibility on that. And I'm not going to give you credit for any that are expected to be fulfilled at the 2nd Advent.\n \n \n\n So what did the originals say? You don't know and nirther does anybody else. All the above are forced to make some assumptions and sometimes guess. These claims are made based on the assumption of what they believe the bible is supposed to say. The ealiest complete bible comes from the same period when Christians finally got together and decided what was acceptable and what was not. They destroyed everything else, so of course the differences should be within reason, but they aren't. \n\n \n Sorry, sport, but scholars date virtually all of the NT within the life spans of those who traditionally wrote them. There's direct-line accounts from the Gospel writers to the earliest church fathers, and so on down the line. If you want to propose the originals said something entirely different then you'll have to make that case, because there's no credible evidence for it.\n \n \nOne big issue is they didn't get together to decide until approximatly 300 years after Jesus died. Mostly to address the fact that there were to many different versions of to many different manuscripts. By that time nobody knew exactly which, if any were the exact correct version. One major criteria was that it had to conform to current beliefs held by the church at that time. There was not unamoius agreement on the books selected either, eventually yes but some folks had to be sent to hell and some had to be talked into it. \n\n \n Today's scientists don't agree on everything, so shall we throw out all of their writings? That's another case of you judging the Bible different than you judge other works of antiquity, whether you admit it or not.\n \n The entire NT books were arguably complete by the end of the 1st century. \n \n \n\n By the way the new avatar is nice, but wouldn't posiedon be a conflict?\n\n \n Where does it say that's posiedon?\n \n I say it's the Lord.", 
   {}, 
   384178, 
   null, 
   1262278200.0
  ], 
  [
   384191, 
   null, 
   "trebor", 
   "\n \n So what did the originals say? You don't know and nirther does anybody else. All the above are forced to make some assumptions and sometimes guess. These claims are made based on the assumption of what they believe the bible is supposed to say. The ealiest complete bible comes from the same period when Christians finally got together and decided what was acceptable and what was not. They destroyed everything else, so of course the differences should be within reason, but they aren't. \n \n One big issue is they didn't get together to decide until approximatly 300 years after Jesus died. Mostly to address the fact that there were to many different versions of to many different manuscripts. By that time nobody knew exactly which, if any were the exact correct version. One major criteria was that it had to conform to current beliefs held by the church at that time. There was not unamoius agreement on the books selected either, eventually yes but some folks had to be sent to hell and some had to be talked into it. \n \n\n \n Does it really matter what the originals say? When the original source is incorrect, it doesn't matter how accurately it has been copied.\n \n When it can be shown that passages that proclaim 'prophecy' fulfilled are taking out of context phrases from the Jewish scriptures, and writing TO them, it makes 'prophecy' worthless.", 
   {}, 
   384178, 
   null, 
   1262283540.0
  ], 
  [
   384200, 
   null, 
   "pappillion001", 
   "Well, when you can show me one of the Messianic prophecies of Jesus that ever failed (just one - your best one) then you might have some credibility on that. And I'm not going to give you credit for any that are expected to be fulfilled at the 2nd Advent.\n\n \n Considering the verses in question were selected because they could be shown to have a relationship to Jesus showing them to not would be a little difficult. \n \n But prophecy, especially under the circumstances, has absolutley no meaning whatsoever. It helps people think there is more evidence than there really is. \n \n Why do you think it is necessary to fool people?\n Why was it necessary to change and mistranslate verses?\n Where is Jesus' 2nd coming prophecy?\n \n \n \nSorry, sport, but scholars date virtually all of the NT within the life spans of those who traditionally wrote them. There's direct-line accounts from the Gospel writers to the earliest church fathers, and so on down the line. If you want to propose the originals said something entirely different then you'll have to make that case, because there's no credible evidence for it.\n\n \n Easy how can you just BS like this? The first instance of gospel writings don't appear until Tertullian. To get the whole Bible as you claim wouldn't be possible for hundreds of years and even then it would still be missing 20-30 verses. \n \n Prior to that there are references to some books of the bible, but that hurts your case more than helps it. Papias references Mark and Matthew, but he says Mark is out of order or does he and Matthew was written in Hebrew or was it?\n \n Jewish-Christian Gospels - Wikipedia, the free encyclopedia\n \n Everything that you said as if fact isn't, your implications aren't and you addressing my points hasn't happened. \n \n \nToday's scientists don't agree on everything, so shall we throw out all of their writings? That's another case of you judging the Bible different than you judge other works of antiquity, whether you admit it or not.\n\n \n Huh?\n \n Think about the US Constitution. As historical reference material it is accepted pretty much at face value for study.\n \n As a document of influence over citizens of the US the meaning, significance and validity are not taken as easily at face value.\n \n There is no double standard. IT may appear that way since this being a religious forum which seems to debate Judaeo Christian issues 98% of the time.\n \n \n \nThe entire NT books were arguably complete by the end of the 1st century. \n\n \n Which means exactly what I said, nobody knows.\n \n \nWhere does it say that's posiedon?\n \n I say it's the Lord.\n\n \n Dude old Zues looking guy with trident, it's Posiedon. Do a google image search. Look similiar?\n \n poseidon - Google Images", 
   {}, 
   384180, 
   null, 
   1262296680.0
  ], 
  [
   384203, 
   null, 
   "pappillion001", 
   "Does it really matter what the originals say? When the original source is incorrect, it doesn't matter how accurately it has been copied.\n \n When it can be shown that passages that proclaim 'prophecy' fulfilled are taking out of context phrases from the Jewish scriptures, and writing TO them, it makes 'prophecy' worthless.\n\n \n Oh I agree with you. I just felt putting a big rock on top of the grave was necessary to keep it from coming back. Should have used a bigger rock though", 
   {}, 
   384191, 
   null, 
   1262296920.0
  ], 
  [
   384209, 
   null, 
   "Easyrider", 
   " \n But prophecy, especially under the circumstances, has absolutley no meaning whatsoever. It helps people think there is more evidence than there really is. \n\n \n If it's real, and I say Biblical prophecy is, then it is very meaningful and shows the omniscience of God, IMO.\n \n \n Why do you think it is necessary to fool people?\n\n \n You mean fooling them to think prophecy isn't real? You'll have to answer that one.\n \n \nWhy was it necessary to change and mistranslate verses?\n\n \n Are you talking copyist errors? Deliberate mistranslations? Or what? Give me your best (1) example along with your corresponding allegation (i.e. they purposefully mistranslated this, etc.). Otherwise your claim rings hollow.\n \n \nWhere is Jesus' 2nd coming prophecy?\n\n \n The Second Coming of Jesus Christ\n \n \n \n Easy how can you just BS like this? The first instance of gospel writings don't appear until Tertullian.\n\n \n The BS is yours. According to the scholars in the following link they were written (and thus \"appeared\") much, much sooner.\n \n Scholars Date New Testament\n \n Dating the NT\n \n You're not a scholar, are you? And you certainly didn't study up enough to know what I just referenced for you. Why is that?\n \n Also, why can't you Google something and study up on it yourself?\n \n \n Everything that you said as if fact isn't, your implications aren't and you addressing my points hasn't happened. \n\n \n You've been busted time and time again. And you haven't done squat to disprove prophecy, the birth of Christ, his life, miracles, resurrection, etc., etc. Let me know when you have something compelling, besides more generalities. Also, you will need to pray and get some Holy Spirit guidance before you can understand the Scriptures. Otherwise you're just going to remain in the dark.\n \n So, on your knees, sport. Pray to Christ. He can help remove the blinders from your eyes and ears.", 
   {}, 
   384200, 
   null, 
   1262299260.0
  ], 
  [
   384214, 
   null, 
   "Easyrider", 
   "Did Trebor ever answer the question as to whether Adolph Hitler is a Son of God? I think he was stumped.\n \n How about Stalin? Charles Manson?", 
   {}, 
   384209, 
   null, 
   1262300280.0
  ], 
  [
   384233, 
   null, 
   "Penfold", 
   "In the man's own words.....\n \n Hence today I believe that I am acting in accordance with the will of the Almighty Creator: by defending myself against the Jew, I am fighting for the work of the Lord.\n \n -Adolf Hitler (Mein Kampf)\n \n Even today I am not ashamed to say that, overpowered by stormy enthusiasm, I fell down on my knees and thanked Heaven from an overflowing heart for granting me the good fortune of being permitted to live at this time.\n \n -Adolf Hitler (Mein Kampf) \n \n I had so often sung 'Deutschland u:ber Alles' and shouted 'Heil' at the top of my lungs, that it seemed to me almost a belated act of grace to be allowed to stand as a witness in the divine court of the eternal judge and proclaim the sincerity of this conviction.\n \n -Adolf Hitler (Mein Kampf)\n \n Once again the songs of the fatherland roared to the heavens along the endless marching columns, and for the last time the Lord's grace smiled on His ungrateful children.\n \n -Adolf Hitler reflecting on World War I (Mein Kampf)", 
   {}, 
   384214, 
   null, 
   1262307480.0
  ], 
  [
   384236, 
   null, 
   "Easyrider", 
   "In the man's own words.....\n \n Hence today I believe that I am acting in accordance with the will of the Almighty Creator: by defending myself against the Jew, I am fighting for the work of the Lord.\n \n -Adolf Hitler (Mein Kampf)\n \n Even today I am not ashamed to say that, overpowered by stormy enthusiasm, I fell down on my knees and thanked Heaven from an overflowing heart for granting me the good fortune of being permitted to live at this time.\n \n -Adolf Hitler (Mein Kampf) \n \n I had so often sung 'Deutschland u:ber Alles' and shouted 'Heil' at the top of my lungs, that it seemed to me almost a belated act of grace to be allowed to stand as a witness in the divine court of the eternal judge and proclaim the sincerity of this conviction.\n \n -Adolf Hitler (Mein Kampf)\n \n Once again the songs of the fatherland roared to the heavens along the endless marching columns, and for the last time the Lord's grace smiled on His ungrateful children.\n \n -Adolf Hitler reflecting on World War I (Mein Kampf)\n\n \n Hitler a Christian / son of God? \n \n Jesus himself provided a number of clues as to what constituted a true Christian. First, he warned his followers about \"Wolves in sheep's clothing\" - an obvious indication that not everyone who will claim to follow Christ would be a Christian. History is full of these wolves and charlatans. But then, Jesus said one more thing that by which people would know who is and who is not a Christian: \"You shall know them by their fruits.\" Obviously, Hitler's \"fruits\" / works were heinous and against almost everything that Jesus taught. Instead of \"Love your neighbor,\" Hitler invaded and murdered his neighbors. He committed almost every despicable crime there was. So, I think anyone who wants to argue that Hitler was a Christian has to take that into consideration. \n \n We also have these quotations from Adolph Hitler that indicate his twisted mentality, and his hatred of true Christianity: \n \n \"Christianity is an invention of sick brains,\" Adolf Hitler, December 13, 1941.\n \"So it's not opportune to hurl ourselves now into a struggle with the Churches. The best thing is to let Christianity die a natural death,\" Adolf Hitler, October 14, 1941.\n \n Night of 11th-12th July, 1941: \n National Socialism and religion cannot exist together.... The heaviest blow that ever struck humanity was the coming of Christianity. Bolshevism is Christianity's illegitimate child. Both are inventions of the Jew. The deliberate lie in the matter of religion was introduced into the world by Christianity.... Let it not be said that Christianity brought man the life of the soul, for that evolution was in the natural order of things. (p 6 & 7) \n \n 10th October, 1941, midday: \n Christianity is a rebellion against natural law, a protest against nature. Taken to its logical extreme, Christianity would mean the systematic cultivation of the human failure. (p 43)\n \n \n 14th October, 1941, midday: \n The best thing is to let Christianity die a natural death.... When understanding of the universe has become widespread... Christian doctrine will be convicted of absurdity.... Christianity has reached the peak of absurdity.... And that's why someday its structure will collapse.... ...the only way to get rid of Christianity is to allow it to die little by little.... Christianity the liar.... We'll see to it that the Churches cannot spread abroad teachings in conflict with the interests of the State. (p 49-52) \n \n \n 19th October, 1941, night: \n The reason why the ancient world was so pure, light and serene was that it knew nothing of the two great scourges: the pox and Christianity. \n \n \n 21st October, 1941, midday: \n Originally, Christianity was merely an incarnation of Bolshevism, the destroyer.... The decisive falsification of Jesus' doctrine was the work of St.Paul. He gave himself to this work... for the purposes of personal exploitation.... Didn't the world see, carried on right into the Middle Ages, the same old system of martyrs, tortures, f@gg@ts? Of old, it was in the name of Christianity. Today, it's in the name of Bolshevism. Yesterday the instigator was Saul: the instigator today, Mardochai. Saul was changed into St.Paul, and Mardochai into Karl Marx. By exterminating this pest, we shall do humanity a service of which our soldiers can have no idea. (p 63-65) \n \n \n 13th December, 1941, midnight: \n Christianity is an invention of sick brains: one could imagine nothing more senseless, nor any more indecent way of turning the idea of the Godhead into a mockery.... .... When all is said, we have no reason to wish that the Italians and Spaniards should free themselves from the drug of Christianity. Let's be the only people who are immunized against the disease. (p 118 & 119) \n \n \n 14th December, 1941, midday: \n Kerrl, with noblest of intentions, wanted to attempt a synthesis between National Socialism and Christianity. I don't believe the thing's possible, and I see the obstacle in Christianity itself.... Pure Christianity-- the Christianity of the catacombs-- is concerned with translating Christian doctrine into facts. It leads quite simply to the annihilation of mankind. It is merely whole-hearted Bolshevism, under a tinsel of metaphysics. (p 119 & 120) \n \n 9th April, 1942, dinner: \n There is something very unhealthy about Christianity (p 339) \n \n 27th February, 1942, midday: \n It would always be disagreeable for me to go down to posterity as a man who made concessions in this field. I realize that man, in his imperfection, can commit innumerable errors-- but to devote myself deliberately to errors, that is something I cannot do. I shall never come personally to terms with the Christian lie. Our epoch Uin the next 200 years will certainly see the end of the disease of Christianity.... My regret will have been that I couldn't... behold .\" (p 278) \n \n Quotes from: Hitler's Secret Conversations 1941-1944 published by Farrar, Straus and Young, Inc.\n \n Was Hitler a Christian?\n \n And since Jesus is God, and we have his definition of who a follower of God is, then Penfold, you're busted!", 
   {
    "unicode_changes_made": true
   }, 
   384233, 
   null, 
   1262311320.0
  ], 
  [
   384242, 
   null, 
   "Penfold", 
   "As with your bible, all you have is redacted second hand reports by others of what they claim happened, yet have the gall to claim those to be more accurate than the publicly published words written by the man himself. (a creationist Christian!)\n \n Anyone who dares to lay hands on the highest image of the Lord commits sacrilege against the benevolent creator of this miracle and contributes to the expulsion from paradise.\n \n -Adolf Hitler (Mein Kampf)", 
   {}, 
   384236, 
   null, 
   1262314260.0
  ], 
  [
   384244, 
   null, 
   "Jo Bennett", 
   "It doesn't take a genius to work out that Hitler used faith for political ends. Just because he said or wrote something doesn't mean it's true or even what he actually believed. On the other hand who knows what happened in his bunker in 1945? Repentance and commitment to Christ can happen to anyone, at any time.", 
   {}, 
   384242, 
   null, 
   1262315700.0
  ], 
  [
   384248, 
   null, 
   "trebor", 
   "Hitler a Christian / son of God? \n \n Jesus himself provided a number of clues as to what constituted a true Christian. First, he warned his followers about \"Wolves in sheep's clothing\" - an obvious indication that not everyone who will claim to follow Christ would be a Christian. History is full of these wolves and charlatans. But then, Jesus said one more thing that by which people would know who is and who is not a Christian: \"You shall know them by their fruits.\" Obviously, Hitler's \"fruits\" / works were heinous and against almost everything that Jesus taught. Instead of \"Love your neighbor,\" Hitler invaded and murdered his neighbors. He committed almost every despicable crime there was. So, I think anyone who wants to argue that Hitler was a Christian has to take that into consideration. \n \n We also have these quotations from Adolph Hitler that indicate his twisted mentality, and his hatred of true Christianity: \n \n \"Christianity is an invention of sick brains,\" Adolf Hitler, December 13, 1941.\n \"So it's not opportune to hurl ourselves now into a struggle with the Churches. The best thing is to let Christianity die a natural death,\" Adolf Hitler, October 14, 1941.\n \n Night of 11th-12th July, 1941: \n National Socialism and religion cannot exist together.... The heaviest blow that ever struck humanity was the coming of Christianity. Bolshevism is Christianity's illegitimate child. Both are inventions of the Jew. The deliberate lie in the matter of religion was introduced into the world by Christianity.... Let it not be said that Christianity brought man the life of the soul, for that evolution was in the natural order of things. (p 6 & 7) \n \n 10th October, 1941, midday: \n Christianity is a rebellion against natural law, a protest against nature. Taken to its logical extreme, Christianity would mean the systematic cultivation of the human failure. (p 43)\n \n \n 14th October, 1941, midday: \n The best thing is to let Christianity die a natural death.... When understanding of the universe has become widespread... Christian doctrine will be convicted of absurdity.... Christianity has reached the peak of absurdity.... And that's why someday its structure will collapse.... ...the only way to get rid of Christianity is to allow it to die little by little.... Christianity the liar.... We'll see to it that the Churches cannot spread abroad teachings in conflict with the interests of the State. (p 49-52) \n \n \n 19th October, 1941, night: \n The reason why the ancient world was so pure, light and serene was that it knew nothing of the two great scourges: the pox and Christianity. \n \n \n 21st October, 1941, midday: \n Originally, Christianity was merely an incarnation of Bolshevism, the destroyer.... The decisive falsification of Jesus' doctrine was the work of St.Paul. He gave himself to this work... for the purposes of personal exploitation.... Didn't the world see, carried on right into the Middle Ages, the same old system of martyrs, tortures, f@gg@ts? Of old, it was in the name of Christianity. Today, it's in the name of Bolshevism. Yesterday the instigator was Saul: the instigator today, Mardochai. Saul was changed into St.Paul, and Mardochai into Karl Marx. By exterminating this pest, we shall do humanity a service of which our soldiers can have no idea. (p 63-65) \n \n \n 13th December, 1941, midnight: \n Christianity is an invention of sick brains: one could imagine nothing more senseless, nor any more indecent way of turning the idea of the Godhead into a mockery.... .... When all is said, we have no reason to wish that the Italians and Spaniards should free themselves from the drug of Christianity. Let's be the only people who are immunized against the disease. (p 118 & 119) \n \n \n 14th December, 1941, midday: \n Kerrl, with noblest of intentions, wanted to attempt a synthesis between National Socialism and Christianity. I don't believe the thing's possible, and I see the obstacle in Christianity itself.... Pure Christianity-- the Christianity of the catacombs-- is concerned with translating Christian doctrine into facts. It leads quite simply to the annihilation of mankind. It is merely whole-hearted Bolshevism, under a tinsel of metaphysics. (p 119 & 120) \n \n 9th April, 1942, dinner: \n There is something very unhealthy about Christianity (p 339) \n \n 27th February, 1942, midday: \n It would always be disagreeable for me to go down to posterity as a man who made concessions in this field. I realize that man, in his imperfection, can commit innumerable errors-- but to devote myself deliberately to errors, that is something I cannot do. I shall never come personally to terms with the Christian lie. Our epoch Uin the next 200 years will certainly see the end of the disease of Christianity.... My regret will have been that I couldn't... behold .\" (p 278) \n \n Quotes from: Hitler's Secret Conversations 1941-1944 published by Farrar, Straus and Young, Inc.\n \n Was Hitler a Christian?\n \n And since Jesus is God, and we have his definition of who a follower of God is, then Penfold, you're busted!\n\n \n \n There is plenty of reason to distrust the 'Secret conversational of Hitler' to be a total fraud. The stenographers who took down conversations would not testify to their accuracy, and it was all filtered through the highly anti-catholic Borhmann , who 'edited' it for 'purity', and then destroyed the originals. So, on one side, we have a clear, concise statements from Hitlers own writings, verses statements that were 'filtered' through someone who was very anti-christian, and edited the comments for 'purity' then destroyed the original transcriptions.", 
   {
    "unicode_changes_made": true
   }, 
   384236, 
   null, 
   1262317500.0
  ], 
  [
   384255, 
   null, 
   "pappillion001", 
   "If it's real, and I say Biblical prophecy is, then it is very meaningful and shows the omniscience of God, IMO.\n\n \n Well I say it's not and is an example of a need to convince oneself they are right. \n \n How about you show a prophecy stated in it's entirety at the time conveyed that was intended to be prophetic at that time and has undeniably come true\n \n \nYou'll have to answer that one.\n\n \n Ok. Because what Christians believed was more important than what the truth may have been. It's quite possible that there is little or no difference between the two, but most likely that isn't the case. At this point though we will most likely never know. \n \n So early Christians not having fully grasped the ideas of their new religion and having nobody or nothing to refer to did the best they could. They looked for as many pieces of evidence they could find or create to show they were right. \n \n Are you talking copyist errors? Deliberate mistranslations? Or what? Give me your best (1) example along with your corresponding allegation (i.e. they purposefully mistranslated this, etc.). Otherwise your claim rings hollow.\n \n \n \n \nThe Second Coming of Jesus Christ\n\n \n I didn't read the whole thing, where does it specificallyy say he will come, leave and then come back?\n \n \n \nThe BS is yours. According to the scholars in the following link they were written (and thus \"appeared\") much, much sooner.\n \n Scholars Date New Testament\n \n Dating the NT\n \n You're not a scholar, are you? And you certainly didn't study up enough to know what I just referenced for you. Why is that?\n \n Also, why can't you Google something and study up on it yourself?\n\n \n Easy killer, try following your own posts and your will develop some insight as to how you, at least in your mind are able to prove your points. It has a lot to do with providing supporting evidence against statements that nobody made. \n \n In essence your argument is the equivelant of me saying, Ha your busted I told you it was orange, go spend some time learning about what your talking about. \n \n you said\n Sorry, sport, but scholars date virtually all of the NT within the life spans of those who traditionally wrote them. There's direct-line accounts from the Gospel writers to the earliest church fathers, and so on down the line.\n \n \n To which I responded that the first time verse from the NT is used is by Tertullian and that to reconstruct the NT from other authors who quoted from it would take centuries and would still be short some 20-30 verses. \n \n Your response in which you \"busted me\" has nothing to do with what was being discussed and you still have not addressed my points.\n \n \nYou've been busted time and time again. And you haven't done squat to disprove prophecy, the birth of Christ, his life, miracles, resurrection, etc., etc. Let me know when you have something compelling, besides more generalities. Also, you will need to pray and get some Holy Spirit guidance before you can understand the Scriptures. Otherwise you're just going to remain in the dark.\n \n So, on your knees, sport. Pray to Christ. He can help remove the blinders from your eyes and ears.\n\n \n I have shown the fallacy of prophecy to which you have responded with you believe it's real\n \n I have shown problems with errors and validity of scripture, you responded to some argument you were having with your cat\n \n Based on the example set by Christians it is apparent the praying doesn't work", 
   {}, 
   384209, 
   null, 
   1262323020.0
  ], 
  [
   384290, 
   null, 
   "Easyrider", 
   "How about you show a prophecy stated in it's entirety at the time conveyed that was intended to be prophetic at that time and has undeniably come true?\n\n \n I don't have people from ages ago to question about what they might have believed or not believed. But here's a fulfilled prophecy from the Bible.\n \n The Rebirth of Israel\n \n Biblical Prophecy: Israel to be Restored as an Independent Nation in 1948\n \n \nSo early Christians not having fully grasped the ideas of their new religion and having nobody or nothing to refer to did the best they could. They looked for as many pieces of evidence they could find or create to show they were right. \n\n \n They had the Word of God, the prophets, Jesus, and the Holy Spirit. They weren't thrashing around in the dark like secular humanists.\n \n \nI didn't read the whole thing, where does it specificallyy say he will come, leave and then come back?\n\n \n Prophecies concerning Jesus\n \n Prophecies of Jesus Christ as Messiah\n \n \n\n Easy killer, try following your own posts and your will develop some insight as to how you, at least in your mind are able to prove your points. It has a lot to do with providing supporting evidence against statements that nobody made. \n \n In essence your argument is the equivelant of me saying, Ha your busted I told you it was orange, go spend some time learning about what your talking about. \n \n you said\n Sorry, sport, but scholars date virtually all of the NT within the life spans of those who traditionally wrote them. There's direct-line accounts from the Gospel writers to the earliest church fathers, and so on down the line.\n \n \n To which I responded that the first time verse from the NT is used is by Tertullian and that to reconstruct the NT from other authors who quoted from it would take centuries and would still be short some 20-30 verses. \n \n Your response in which you \"busted me\" has nothing to do with what was being discussed and you still have not addressed my points.\n\n \n The scholars I referenced say otherwise. They base their research on many things, including verbiage, type of instruments used, historical references, etc., etc. Here's some info that adds to the early dates they referenced.\n \n When were the Gospels Written, and by whom?\n \n When were the gospels written and by whom? | Christian Apologetics and Research Ministry\n \n When was the Book of Acts Written?\n \n When was the book of Acts written? | Christian Apologetics and Research Ministry\n \n Eatra-biblical references to the NT:\n \n http://www.carm.org/christianity/bible/non-biblical-accounts-new-testament-events-andor-people\n \n Wasn't the New Testament written hundreds of years after Christ?\n \n Paul the Apostle was a convert to Christianity. The book of Acts speaks of his conversion in Acts 9. Since Acts was written before 70 A.D. and Paul wrote the Pauline Epistles and we know that Paul died in 64 A.D., the Pauline Epistles were all written before that date. Furthermore, in 1 Cor. 15:3-4 is an early creed of the Christian church where Paul mentions that Jesus had died and risen. \"For I delivered to you as of first importance what I also received, that Christ died for our sins according to the Scriptures, 4 and that He was buried, and that He was raised on the third day according to the Scriptures,\" (1 Cor. 15:3-4). Notice that he says he received this information. From whom did he receive it? Most probably the apostles since he had a lot of interaction with them. This means that Paul received the gospel account from the eyewitnesses. They were, of course contemporaries; they all died before the turn of the century. Therefore, their writings were completed within the lifetime of the apostles of Jesus.\n http://www.carm.org/christianity/bible/wasnt-new-testament-written-hundreds-years-after-christ\n \n That's one of the reasons why many scholars date Acts in the 50's to 62 AD.\n \n \n\n I have shown the fallacy of prophecy to which you have responded with you believe it's real\n\n \n No, you haven't made your case. See above for a daggar in the heart of that viewpoint.\n \n \nI have shown problems with errors and validity of scripture, you responded to some argument you were having with your cat\n\n \n You've made claims. They haven't held up to close scrutiny.\n \n \nBased on the example set by Christians it is apparent the praying doesn't work\n\n \n Prayers are answered according to the will and grace of God. \n \n Did you ever come up with anything that disproves the resurrection? Not theories or what if's, but anything compelling? THAT'S PROBABLY THE ONLY WAY YOU'RE GOING TO MAKE ANY HEADWAY AROUND HERE.\n \n People, LIKE YOU, have been trying to discredit Christ and the Bible for 2,000 years. They die and the Word lives on. You think you're making any headway? LOL! If there were anything that could strike Christianity dead it would have already hit CNN, FOX, MSNBC, etc. It hasn't, and you don't have squat. You haven't even researched most of what you think is bogus. Greater minds than yours have tried to bust the NT, and many have become believers instead. That might be a goal for you in 2010.\n \n JESUS IS LORD!", 
   {}, 
   384255, 
   null, 
   1262361480.0
  ], 
  [
   384342, 
   null, 
   "jazyjason", 
   "\n \n People, LIKE YOU, have been trying to discredit Christ and the Bible for 2,000 years. They die and the Word lives on. You think you're making any headway? LOL! If there were anything that could strike Christianity dead it would have already hit CNN, FOX, MSNBC, etc. It hasn't, and you don't have squat. You haven't even researched most of what you think is bogus. Greater minds than yours have tried to bust the NT, and many have become believers instead. That might be a goal for you in 2010.\n \n JESUS IS LORD!\n\n \n Funny but you'd think 2000 years of preaching would yield a better method to touch peoples minds and hearts than your extreme zealotry and degredation of others.\n \n I just felt like saying that because honestly Easy your what my father calls an aggressive salesman. The same stale pitch and the same old tired below the belt insults. Not an ounce of love of your fellow man like Christ COMMANDED.\n \n \n All you have is condemnation and screaming like a spoiled child that must get their way all the time... Your posts are full of cynicism and sarcasm, and not an ounce of compassion toward others. All you and Archie do is justify your OWN belief or vindication of faith instead of trying to instill such virtue in others....", 
   {}, 
   384290, 
   null, 
   1262429760.0
  ], 
  [
   384375, 
   null, 
   "Easyrider", 
   "Funny but you'd think 2000 years of preaching would yield a better method to touch peoples minds and hearts than your extreme zealotry and degredation of others.\n\n \n What's a zealot, someone who buys into God and his Word more than Sodomites do?\n \n If you want to try to continue to subvert the church, society, and the Word of God then you going to be rebuked at every step. \n \n The only thing required for evil to prosper is for good men to say and do nothing.", 
   {}, 
   384342, 
   null, 
   1262446140.0
  ], 
  [
   384398, 
   null, 
   "pappillion001", 
   "I don't have people from ages ago to question about what they might have believed or not believed. But here's a fulfilled prophecy from the Bible.\n \n The Rebirth of Israel\n\n \n How very Christian, but why do they think Leviticus is years?\n Leviticus 26 is it a Time Prophecy \n \n \n Biblical Prophecy: Israel to be Restored as an Independent Nation in 1948\n \n \nThey had the Word of God, the prophets, Jesus, and the Holy Spirit. They weren't thrashing around in the dark like secular humanists.\n\n \n No, not like secular humanists, but thrashing about they were. No Jesus had been dead for a long time, same with any prophets, the Word of God was what they were trying to figure out and the Holy Spirit in this case is the same as crossing your fingers.\n \n \nThe scholars I referenced say otherwise. They base their research on many things, including verbiage, type of instruments used, historical references, etc., etc. Here's some info that adds to the early dates they referenced.\n \n When were the Gospels Written, and by whom?\n \n When were the gospels written and by whom? | Christian Apologetics and Research Ministry\n \n When was the Book of Acts Written?\n \n When was the book of Acts written? | Christian Apologetics and Research Ministry\n \n Eatra-biblical references to the NT:\n \n Non-biblical accounts of New Testament events and/or people | Christian Apologetics and Research Ministry\n \n Wasn't the New Testament written hundreds of years after Christ?\n \n Paul the Apostle was a convert to Christianity. The book of Acts speaks of his conversion in Acts 9. Since Acts was written before 70 A.D. and Paul wrote the Pauline Epistles and we know that Paul died in 64 A.D., the Pauline Epistles were all written before that date. Furthermore, in 1 Cor. 15:3-4 is an early creed of the Christian church where Paul mentions that Jesus had died and risen. \"For I delivered to you as of first importance what I also received, that Christ died for our sins according to the Scriptures, 4 and that He was buried, and that He was raised on the third day according to the Scriptures,\" (1 Cor. 15:3-4). Notice that he says he received this information. From whom did he receive it? Most probably the apostles since he had a lot of interaction with them. This means that Paul received the gospel account from the eyewitnesses. They were, of course contemporaries; they all died before the turn of the century. Therefore, their writings were completed within the lifetime of the apostles of Jesus.\n Wasn't the New Testament written hundreds of years after Christ? | Christian Apologetics and Research Ministry\n \n That's one of the reasons why many scholars date Acts in the 50's to 62 AD.\n\n \n Wow, that was a complete waste of everybody's time. Do you think you can respond to the questions posed next time? When the books of the NT were written isn't really relevant to this specific discussion. \n \n When they were written doesn't answer\n Are originals known to currently exist?\n At the time the bible was canonized were the originals present?\n If so were they known without any doubt as such?\n When Christians claim the NT can be reconstructed based on thrid party writings, what do they compare to confirm that?\n To recreate the NT from 3rd party authors, what is the earliest and who is the last or what is the span of time between the writings of the 1st to the last author.\n How many verses are left out even then?\n \n Why do believe scholars using the earliest dates over the scholars thinking much later dates?\n \n \nNo, you haven't made your case. See above for a daggar in the heart of that viewpoint.\n\n \n Dagger to the heart.... of the wrong person. So if as you claim prophecy is indeed valid and may be taken from scripture, then you have no problem with the prophetic verses showing the Messiah could be a rooster. \n \n Hindsight is 20/20 as they say. With a pool of verses to choose from the size of the OT and there being almost no criteria for what could be viewed as prophecy almost anybody could be considered the Messiah.\n \n Before you go off and ask to name someone, how do you know that all the verses you claim concern Jesus actually do? How do you know the Messiah hasn't come yet? Why do you include Daniel and Psalms as having verses fulfilled by Jesus?\n \n \nYou've made claims. They haven't held up to close scrutiny.\n\n \n What scrutiny? You respond with unrelated posts as much as related. The only consistancy is that they typically are made based on the assumtpion of Jesus and then presented to conform to the desired conclusion. You have not shown the ability to even grasp half of what I have said let alone refute it.\n \n \nDid you ever come up with anything that disproves the resurrection? Not theories or what if's, but anything compelling? THAT'S PROBABLY THE ONLY WAY YOU'RE GOING TO MAKE ANY HEADWAY AROUND HERE.\n\n \n Yes I did. It was far more compelling than the arguments you came up with \n Because\n LA LA LA LA LA LA\n and \n the Bible says so\n \n Do you have anything compelling to confirm your BELIEF something that cannot be disputed, that can confirm your FAITH? No you can't otherwise we would not be having this conversation. Nor would you be having it with anybody else. \n \n \nPeople, LIKE YOU, have been trying to discredit Christ and the Bible for 2,000 years. They die and the Word lives on. You think you're making any headway? LOL! If there were anything that could strike Christianity dead it would have already hit CNN, FOX, MSNBC, etc. It hasn't, and you don't have squat. You haven't even researched most of what you think is bogus. Greater minds than yours have tried to bust the NT, and many have become believers instead. That might be a goal for you in 2010.\n\n \n I know it often isn't Christian, but let's be fair. Christians have had 2000 years to come up with the arguments for Christianity. Re-writing, destroying and and subverting anything contrary. Based on the admitted behavior of the early church do you really think there is documentation still around that could topple Christianity? Of course you see no connection between the formation of the Canon and the inability to find any text of the NT prior to that. \n \n Go do some research on the criteria used to select the Canon and which made it and which didn't and try not to put your biased spin on it, understanding only what you want to understand and then come back to me with your inspired word mumbo jumbo.\n \n \n JESUS IS LORD![/QUOTE]", 
   {}, 
   384290, 
   null, 
   1262475120.0
  ], 
  [
   384414, 
   null, 
   "jazyjason", 
   "What's a zealot, someone who buys into God and his Word more than Sodomites do?\n \n If you want to try to continue to subvert the church, society, and the Word of God then you going to be rebuked at every step. \n \n The only thing required for evil to prosper is for good men to say and do nothing.\n\n \n \n And I suppose you have a little plaque on your wall that reads \"good man\". Oh and in case you forgot there are no good or righteous men dimwit... Or did you forget that while putting on your \"god hates fags\" t -shirt?", 
   {}, 
   384375, 
   null, 
   1262487060.0
  ], 
  [
   384437, 
   null, 
   "Easyrider", 
   "And I suppose you have a little plaque on your wall that reads \"good man\". \n\n \n No, but you've got one up everyday in these fora promoting and defending your illicit gay sex carnal hedonism.", 
   {}, 
   384414, 
   null, 
   1262533440.0
  ], 
  [
   384438, 
   null, 
   "Easyrider", 
   "How very Christian....\n \n Wow, that was a complete waste of everybody's time.\n \n Because\n LA LA LA LA LA LA\n and \n the Bible says so\n \n etc., etc. \n\n \n \n You're totally clueless. \n \n I'm not going to waste any more substantial amount of time trying to educate a dedicated Christ denier who throws out every bit of evidence he's provided. Like Jesus said,\n \n \"Do not give what is holy to the dogs; nor cast your pearls before swine, lest they trample them under their feet, and turn and tear you in pieces\" (Matthew 7:6).\n \n Go find someone else to entertain your antibiblical swill.", 
   {}, 
   384398, 
   null, 
   1262534040.0
  ], 
  [
   384452, 
   null, 
   "Penfold", 
   "You're totally clueless. \n \n I'm not going to waste any more substantial amount of time trying to educate a dedicated Christ denier who throws out every bit of evidence he's provided. Like Jesus said,\n \n \"Do not give what is holy to the dogs; nor cast your pearls before swine, lest they trample them under their feet, and turn and tear you in pieces\" (Matthew 7:6).\n \n Go find someone else to entertain your antibiblical swill.\n\n \n He tries to help you, but is confronted by a prideful wall of blindness and deafness, as prophesied.\n \n Jeremiah 5:21\n Hear now this, O foolish people, and without understanding; which have eyes, and see not; which have ears, and hear not:\n \n Isaiah 6:9-10\n And he said, Go, and tell this people, Hear you indeed, but understand not; and see indeed, but perceive not. \n Make the heart of this people fat, and make their ears heavy, and shut their eyes; lest they see with their eyes, and hear with their ears, and understand with their heart, and convert, and be healed.", 
   {}, 
   384438, 
   null, 
   1262541600.0
  ], 
  [
   384456, 
   null, 
   "Easyrider", 
   "He tries to help you, but is confronted by a prideful wall of blindness and deafness, as prophesied.\n \n Jeremiah 5:21\n Hear now this, O foolish people, and without understanding; which have eyes, and see not; which have ears, and hear not:\n \n\n \n That's you and him, not me. You two have been given enough information to save a hundred normal people, but you're too stiff-necked and spiritually constipated to receive it.", 
   {}, 
   384452, 
   null, 
   1262543280.0
  ], 
  [
   384469, 
   null, 
   "pappillion001", 
   "You're totally clueless. \n \n I'm not going to waste any more substantial amount of time trying to educate a dedicated Christ denier who throws out every bit of evidence he's provided. Like Jesus said,\n \n \"Do not give what is holy to the dogs; nor cast your pearls before swine, lest they trample them under their feet, and turn and tear you in pieces\" (Matthew 7:6).\n \n Go find someone else to entertain your antibiblical swill.\n\n \n I wouldn't go as far as clueless and the evidence that I disregard isn't for lack of reason. I can either show it to be incorrect, partially or in it's entirety through fact and/or the application of common rational sense. \n \n If you start with the supposition that God is Omnipotent, Omniscient, and benevolent and apply that to the Bible then whatever doesn't conform is not from God. \n \n It makes no sense for one of the 10 commandments to be Thou shalt not kill( actually should be murder) after commanding the Jews to commit Genocide. More than once, completely erase their existence from the world, every man, woman and child, cut down their groves, throw away gold and silver from their holy places. No talking to, no agreements with and no mercy towards.\n \n Christianity repeats certain themes often. One of the most stated is of glorifying God. God needs no validation from mankind, nor anything else man thinks is important. How arrogant to think that God requires your acknowledgement in order to feel happy or complete or secure or whatever is accomplished by repitiously praising him. \n \n With that in mind another frequent theme is \n \n Leviticus 19:18 'You shall not take vengeance, nor bear any grudge against the sons of your people, but you shall love your neighbor as yourself; I am the LORD.\n \n Matthew 7:12 \"In everything, therefore, treat people the same way you want them to treat you, for this is the Law and the Prophets.\n \n Matthew 19:19 HONOR YOUR FATHER AND MOTHER; and YOU SHALL LOVE YOUR NEIGHBOR AS YOURSELF.\"\n \n Matthew 22:39-40 And the second is like unto it, Thou shalt love thy neighbour as thyself \"On these two commandments depend the whole Law and the Prophets.\"\n \n John 13:34 \"A new commandment I give to you, that you love one another, even as I have loved you, that you also love one another.\n \n Romans 13:8 Owe nothing to anyone except to love one another; for he who loves his neighbor has fulfilled the law.\n \n Romans 13:10 Love does no wrong to a neighbor; therefore love is the fulfillment of the law.\n \n \n What would a God of the first statement get from sacrifice or suffering or denial of being or meaningless ceremony or buildings or anything else that Christians say are necessary. We can however co-exist with the whole of God's creation in a manner that would show that we are made in the image of God. \n \n God is portrayed as a parent and most parents primary goal is to raise kids who are successful. Not necessarily financially, but socially, intellectually and are responsible and self sufficient. Those are things that reflect good parenting and therefore glorify God.\n \n So I may indeed be clueless or this is all just meaningless drivel, but it makes sense to me and until you can come up with something worthwhile that is contrary, I am going to stick to it.", 
   {}, 
   384438, 
   null, 
   1262557800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are we all Sons and Daughters of God(s)?", 
  "url": "http://www.4forums.com/political/religion-debates/13741-we-all-sons-daughters-god-s.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13741, 
  "discussion_files": [
   [
    "32063.html", 
    "http://www.4forums.com/political/religion-debates/13741-we-all-sons-daughters-god-s-print.html"
   ], 
   [
    "32064.html", 
    "http://www.4forums.com/political/religion-debates/13741-we-all-sons-daughters-god-s-3-print.html"
   ], 
   [
    "32065.html", 
    "http://www.4forums.com/political/religion-debates/13741-we-all-sons-daughters-god-s-2-print.html"
   ]
  ], 
  "identifier": 13741
 }
]