[
 [
  [
   384520, 
   null, 
   "OldSarge", 
   "Not in 2009, FBI crime report shows. \n FBI's latest crime report, for the first half of 2009, shows America is a less violent place even though ownership of guns has surged. Deterrent effect may have a role, but others see no correlation. \n \n The oft-cited credo that more guns equal more crime is being tested by facts on the ground this year: Even as gun ownership has surged in the US in the past year, violent crime, including murder and robbery, has dropped steeply.\n \n Add to that the fact that many experts had predicted higher crime rates as the US grinds through a difficult recession, and the discrepancy has advocates on both sides of the Second Amendment debate rushing to their ramparts.\n \n After several years of crime rates holding relatively steady, the FBI is reporting that violent crimes - including gun crimes - dropped dramatically in the first six months of 2009, with murder down 10 percent across the US as a whole.\n \n Concurrently, the FBI reports that gun sales - especially of assault-style rifles and handguns, two main targets of gun-control groups - are up at least 12 percent nationally since the election of President Obama, a dramatic run on guns prompted in part by so-far-unwarranted fears that Democrats in Congress and the White House will curtail gun rights and carve apart the Second Amendment.\n http://www.csmonitor.com/USA/Society/2009/1223/More-guns-equal-more-crime-Not-in-2009-FBI-crime-report-shows.\n \n Well there is a serious blow to the pro slavery side. More guns and less crime instead of what all the drooling dimwits at the Brady Bunch predicted repeatedly. I wonder what caused it? Certainly not gun free zones as we know how they work. ", 
   {
    "post_info": {
     "post_title": "More guns equal more crime?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1262610660.0
  ], 
  [
   384539, 
   null, 
   "sinjin", 
   "Sure glad I didn't join the gun buying frenzy as it turns out to have been a marketing ploy. \n Expanding one's arsenal was a waste of money it seems.\n emoticon_xangel;)", 
   {}, 
   384520, 
   null, 
   1262627520.0
  ], 
  [
   384544, 
   null, 
   "NATO 556", 
   "Sure glad I didn't join the gun buying frenzy as it turns out to have been a marketing ploy. \n Expanding one's arsenal was a waste of money it seems.\n emoticon_xangel;)\n\n \n Having the necessary means to defend oneself is never a waste of money.", 
   {}, 
   384539, 
   null, 
   1262632380.0
  ], 
  [
   384546, 
   null, 
   "zsu2357", 
   "Sure glad I didn't join the gun buying frenzy as it turns out to have been a marketing ploy. \n Expanding one's arsenal was a waste of money it seems.\n emoticon_xangel;)\n\n \n Hate to say we told you so,but I will\"told you so, told you so,told you so\"but no arguments,no debate forum right,besides we all could use a few extra guns.emoticon_rolleyes", 
   {}, 
   384539, 
   null, 
   1262632920.0
  ], 
  [
   384549, 
   null, 
   "sinjin", 
   "An arms cache should be its own reward.emoticon_xkillemoticon_xgood", 
   {}, 
   384546, 
   null, 
   1262633880.0
  ], 
  [
   384550, 
   null, 
   "sinjin", 
   "Having the necessary means to defend oneself is never a waste of money.\nMy friend Vishnu says, \"You can never have too many arms\".emoticon_xclown", 
   {}, 
   384544, 
   null, 
   1262634120.0
  ], 
  [
   384551, 
   null, 
   "sinjin", 
   "from the same CSM article:\n \n \"But more pragmatically, groups like the Brady Campaign to Prevent Gun Violence have mostly targeted illegal sales and gun-show loopholes as the primary problem in America&#8217;s gun culture. They say such loopholes and lax enforcement allow violent criminals to get their hands on used, stolen, and inexpensive guns.\"\n \n sinjin - What are the pro-gun proposals to combat \"illegal sales\"?", 
   {}, 
   384550, 
   null, 
   1262634720.0
  ], 
  [
   384553, 
   null, 
   "JPSartre12", 
   "from the same CSM article:\n \n \"But more pragmatically, groups like the Brady Campaign to Prevent Gun Violence have mostly targeted illegal sales and gun-show loopholes as the primary problem in America's gun culture. They say such loopholes and lax enforcement allow violent criminals to get their hands on used, stolen, and inexpensive guns.\"\n \n sinjin - What are the pro-gun proposals to combat \"illegal sales\"?\n\n \n Arm law-abiding citizens, naturally, unless you're foolish enough to take a knife to a gunfight. emoticon_xkill\n \n BTW, in case you aren't aware, not too many gang bangers attend gun shows...... at least that's the case here in Detroit subs.", 
   {
    "unicode_changes_made": true
   }, 
   384551, 
   null, 
   1262635200.0
  ], 
  [
   384556, 
   null, 
   "sinjin", 
   "Arm law-abiding citizens, naturally, unless you're foolish enough to take a knife to a gunfight. emoticon_xkill\n\n In most states a \"law-abiding\" citizen can sell their firearms to anyone, no questions asked.\n \nBTW, in case you aren't aware, not too many gang bangers attend gun shows...... at least that's the case here in Detroit subs.\nThey just send their girlfriends or buy second hand from private parties.", 
   {}, 
   384553, 
   null, 
   1262636160.0
  ], 
  [
   384558, 
   null, 
   "NATO 556", 
   "sinjin - What are the pro-gun proposals to combat \"illegal sales\"?\n\n \n That would be no new laws that will ultimately do nothing.\n \n In other words, no more laws, but rather more law enforcement.", 
   {}, 
   384551, 
   null, 
   1262636940.0
  ], 
  [
   384559, 
   null, 
   "NATO 556", 
   "In most states a \"law-abiding\" citizen can sell their firearms to anyone, no questions asked.\n\n \n And you still haven't proven that this is a genuine problem that needs to be addressed.\n \n \nThey just send their girlfriends or buy second hand from private parties.\n\n \n So you admit straw purchasers are able to defeat various gun control laws. You've just eviscerated your side's argument for why we should have gun rationing and registration laws.", 
   {}, 
   384556, 
   null, 
   1262637180.0
  ], 
  [
   384560, 
   null, 
   "sinjin", 
   "And you still haven't proven that this is a genuine problem that needs to be addressed. \nTurned out to be for Steve McNair.\n \n \nSo you admit straw purchasers are able to defeat various gun control laws. You've just eviscerated your side's argument for why we should have gun rationing and registration laws.\nBut no straw purchaser is needed to buy second hand in most states. One problem at a time.", 
   {}, 
   384559, 
   null, 
   1262637660.0
  ], 
  [
   384563, 
   null, 
   "NATO 556", 
   "Turned out to be for Steve McNair.\n\n \n Always a case that slips through the cracks...\n \n \nBut no straw purchaser is needed to buy second hand in most states. One problem at a time.\n\n \n Well how about we focus on the genuine problem instead of making something else into a problem. Instead of playing the game \"what new law can we pass now\" let's do something to focus on the one million dangerous gang members we've got running around free. They've been linked to 80% of the crimes committed in the country, there's no justified excuse for not going after them.", 
   {}, 
   384560, 
   null, 
   1262639520.0
  ], 
  [
   384564, 
   null, 
   "sinjin", 
   "Always a case that slips through the cracks...\nDoes the Grand Canyon strike you as a \"crack\" as well?\n \n \nWell how about we focus on the genuine problem instead of making something else into a problem. Instead of playing the game \"what new law can we pass now\" let's do something to focus on the one million dangerous gang members we've got running around free.\nLike? What makes them so dangerous if it ain't their guns and their willingness to use them? \n \n \nThey've been linked to 80% of the crimes committed in the country, there's no justified excuse for not going after them.\nThis assumes that no DA is presently going after them. Something I highly doubt. \n Diversionary tactic on your part. Wouldn't making guns harder for them to acquire be helpful?", 
   {}, 
   384563, 
   null, 
   1262640660.0
  ], 
  [
   384567, 
   null, 
   "NATO 556", 
   "Does the Grand Canyon strike you as a \"crack\" as well?\n\n \n No, but such incidents appear to be isolated in nature. That is unless you're sitting on a piece of evidence that would prove second hand purchases more often than not lead to violence against others.\n \n \nLike? What makes them so dangerous if it ain't their guns and their willingness to use them?\n\n \n Their connections with the mexican drug cartel for one thing. They're local distributors for whatever drugs get smuggled across the border.\n \n \nThis assumes that no DA is presently going after them. Something I highly doubt.\n\n \n I haven't seen any headlines lately about increased prosecution of violent gang members.\n \n Have you?\n \n \nDiversionary tactic on your part. Wouldn't making guns harder for them to acquire be helpful?\n\n \n No it wouldn't, because there's no way to make guns harder to get in this country when it comes to violent individuals like gang members. The only thing you can accomplish is making it harder for honest people to acquire them for their own defense.\n \n If the drugs being distributed by the gang members are coming from across the mexican border, what would really prevent them from simply importing their weapons if the local sources were somehow magically dried up?\n \n Do try and keep up, this is a very serious matter. We're just short of qualifying as a full scale war.", 
   {}, 
   384564, 
   null, 
   1262642160.0
  ], 
  [
   384568, 
   null, 
   "OldSarge", 
   "from the same CSM article:\n \n \"But more pragmatically, groups like the Brady Campaign to Prevent Gun Violence have mostly targeted illegal sales and gun-show loopholes as the primary problem in America's gun culture. They say such loopholes and lax enforcement allow violent criminals to get their hands on used, stolen, and inexpensive guns.\"\n \n sinjin - What are the pro-gun proposals to combat \"illegal sales\"?\n\n \n In a word sin, enforcement. Seems with all those laws and knowing who and where the illegal straw purchases came from, there is very little done. An agenda perhaps?", 
   {
    "unicode_changes_made": true
   }, 
   384551, 
   null, 
   1262644860.0
  ], 
  [
   384569, 
   null, 
   "OldSarge", 
   "Turned out to be for Steve McNair.\n \n But no straw purchaser is needed to buy second hand in most states. One problem at a time.\n\n \n Yes straw purchase first then see if there is a real problem in secondary sales. So far you have come up with zero proof that it is a problem. Care to try?", 
   {}, 
   384560, 
   null, 
   1262644980.0
  ], 
  [
   384570, 
   null, 
   "OldSarge", 
   "Originally Posted by sinjin \n from the same CSM article:\n \n \"But more pragmatically, groups like the Brady Campaign to Prevent Gun Violence have mostly targeted illegal sales and gun-show loopholes as the primary problem in America&#8217;s gun culture. They say such loopholes and lax enforcement allow violent criminals to get their hands on used, stolen, and inexpensive guns.\"\n \n What used and inexpensive has to do with any thing is merely obfuscation by the Brady bunch. Who have been know to lie. Want to guess who one of the non-prosecuted straw purchasers is?\n \n \n\n This assumes that no DA is presently going after them. Something I highly doubt. \n Diversionary tactic on your part. Wouldn't making guns harder for them to acquire be helpful?\n\n \n Perhaps you could cite some examples to back up your case? So far you haven't shown any thing to back that up either. On the other hand crime is going down as gun sales go up. Care to explain that away?", 
   {}, 
   384564, 
   null, 
   1262645160.0
  ], 
  [
   384571, 
   null, 
   "JPSartre12", 
   "In most states a \"law-abiding\" citizen can sell their firearms to anyone, no questions asked.\n They just send their girlfriends or buy second hand from private parties.\n\n \n I'm curious. Have you EVER been to a gun show in your life? The reason I ask is because I have and I can count the number of women buying guns at the one's I've been to on less than one finger. emoticon_rolleyes", 
   {}, 
   384556, 
   null, 
   1262645520.0
  ], 
  [
   384581, 
   null, 
   "sinjin", 
   "Perhaps you could cite some examples to back up your case? So far you haven't shown any thing to back that up either. \n\n Feds announce nationwide raid on Mexican drug cartel\n \n \nOn the other hand crime is going down as gun sales go up. Care to explain that away? \nAre they even related? I could just as easily suggest that all those 22,000 gun laws are finally yielding some benefit. Not that I believe that.", 
   {}, 
   384570, 
   null, 
   1262649240.0
  ], 
  [
   384587, 
   null, 
   "sinjin", 
   "I'm curious. Have you EVER been to a gun show in your life? The reason I ask is because I have and I can count the number of women buying guns at the one's I've been to on less than one finger. emoticon_rolleyes\nNo, I've never been to a gun show.\n \n \"Straw purchasers who buy for people who can't legally acquire firearms because of age requirements (21 to buy a handgun; 18 to buy a long gun), or criminal record, or who want to buy them anonymously. Gang members frequently have their girlfriends buy guns for them. In one case, two handguns used in a gang-related drive-by murder were purchased by a father for his underage sons.\"\n Path of a Bullet | Dart Center for Journalism & Trauma\n \n sinjin - maybe the ladies prefer gun shops to large shows.", 
   {}, 
   384571, 
   null, 
   1262649780.0
  ], 
  [
   384590, 
   null, 
   "sinjin", 
   "...knowing who and where the illegal straw purchases came from, there is very little done. An agenda perhaps?\nThey know who and where how? Can't prosecute someone who simply says, \"I lost it\".", 
   {}, 
   384568, 
   null, 
   1262649960.0
  ], 
  [
   384596, 
   null, 
   "OldSarge", 
   "Feds announce nationwide raid on Mexican drug cartel\n Drugs have what to do with the topic? Proof of prosecutions under existing laws or?\n Are they even related? I could just as easily suggest that all those 22,000 gun laws are finally yielding some benefit. Not that I believe that.\n\n \n The run, dodge and jump again. One thing for sure the idea of more guns = more crime is not backed by the facts as suspected. So you tell me, are they related? ", 
   {}, 
   384581, 
   null, 
   1262650620.0
  ], 
  [
   384597, 
   null, 
   "zsu2357", 
   "I'm curious. Have you EVER been to a gun show in your life? The reason I ask is because I have and I can count the number of women buying guns at the one's I've been to on less than one finger. emoticon_rolleyes\n\n \n I realize this is aimed at sinjin, but couldn't help myself...I been to alot out here in Oregon and see lots of women handling lots of handguns and you name it,now\n if they bought I don't know, I didn't watch that long,other than they were interested it seemed more for themselves. 'mostly middle aged I'd say\".emoticon_cool", 
   {}, 
   384571, 
   null, 
   1262650740.0
  ], 
  [
   384598, 
   null, 
   "OldSarge", 
   "They know who and where how? Can't prosecute someone who simply says, \"I lost it\".\n\n \n Oh they have Sarah stating she gave it to her son. Didn't lose it. Straw purchase, 10 years for false statement on the 4473. You were provided with examples in another thread so don't play dumb. Use google and look. I did.", 
   {}, 
   384590, 
   null, 
   1262650740.0
  ], 
  [
   384600, 
   null, 
   "sinjin", 
   "Oh they have Sarah stating she gave it to her son. Didn't lose it. Straw purchase, 10 years for false statement on the 4473. You were provided with examples in another thread so don't play dumb. Use google and look. I did.\nI had no idea you were referring to Sarah Brady. I was asking about all those other purchases where we'll never know the purchase was for someone else. And if the weapon turns up the original buyer is legally untouchable.", 
   {}, 
   384598, 
   null, 
   1262651100.0
  ], 
  [
   384601, 
   null, 
   "sinjin", 
   "The run, dodge and jump again. One thing for sure the idea of more guns = more crime is not backed by the facts as suspected. So you tell me, are they related?\nI doubt they're related.", 
   {}, 
   384596, 
   null, 
   1262651220.0
  ], 
  [
   384603, 
   null, 
   "OldSarge", 
   "I had no idea you were referring to Sarah Brady. I was asking about all those other purchases where we'll never know the purchase was for someone else. And if the weapon turns up the original buyer is legally untouchable.\n\n \n That was one. Here's another. \n \n ATF Response to the City of New York's Report \"Gun Show Undercover: Report on Illegal Sales at Gun Shows\"\n The following statement is from W. Larry Ford, ATF Assistant Director, Office of Public and Government Affairs:\n \n \n \"ATF has received the \"Report on Illegal Sales at Gun Shows\" by New York City Mayor Michael Bloomberg, and is reviewing it along with the Department of Justice. ATF did not participate in the operations conducted at the gun shows highlighted in the report, but will assess the need to initiate any criminal investigations.\"\n \n Keep in mind that we already knew that the BATFE was considering criminal investigation--of the dealers. What I asked was whether or not any consideration was being given to investigating Bloomberg and his henchmen. That question remains unanswered.\n \n ", 
   {
    "unicode_changes_made": true
   }, 
   384600, 
   null, 
   1262651640.0
  ], 
  [
   384604, 
   null, 
   "OldSarge", 
   "I doubt they're related.\n\n \n Strange we have been hearing the opposite from the Brady bunch.", 
   {}, 
   384601, 
   null, 
   1262651700.0
  ], 
  [
   384606, 
   null, 
   "sinjin", 
   "Strange we have been hearing the opposite from the Brady bunch.\nWhy would that be \"strange\"?", 
   {}, 
   384604, 
   null, 
   1262652240.0
  ], 
  [
   384607, 
   null, 
   "zsu2357", 
   "from the same CSM article:\n \n \"But more pragmatically, groups like the Brady Campaign to Prevent Gun Violence have mostly targeted illegal sales and gun-show loopholes as the primary problem in America's gun culture. They say such loopholes and lax enforcement allow violent criminals to get their hands on used, stolen, and inexpensive guns.\"\n \n sinjin - What are the pro-gun proposals to combat \"illegal sales\"?\n\n \n O.K. given all the above.be they The Brady Bunch,VPA,or T.M.I.B. how are even\n the strictest of gun laws next to an all out ban gonna keep the so called straw\n purchasers from well doing their thing and purchasing?even if every last seller at the gunshows are above board.\n \n I just don't buy the no questions asked for a little extra cash(not worth it for the seller).If your squeaky clean your clean,no way around it(thats walking into a gunshop).Same as a gunshow.\n Enforce the laws they have now,forget the new ones that won't be enforced\n anymore than the ones they got now.emoticon_frazzled", 
   {
    "unicode_changes_made": true
   }, 
   384551, 
   null, 
   1262652420.0
  ], 
  [
   384608, 
   null, 
   "sinjin", 
   "My reading of Sarah Brady's firearm purchase for her son does not qualify as a \"straw purchase\" since her son was not a prohibited person and she filled out the form per the instructions:\n \n \"You are also the actual buyer if you are acquiring the firearm as a legitimate gift for a third party.\"", 
   {}, 
   384606, 
   null, 
   1262652540.0
  ], 
  [
   384609, 
   null, 
   "OldSarge", 
   "Why would that be \"strange\"?\n\n \n Surely you jest. But then the Brady bunch does play fast and loose with facts.", 
   {}, 
   384606, 
   null, 
   1262652540.0
  ], 
  [
   384610, 
   null, 
   "OldSarge", 
   "My reading of Sarah Brady's firearm purchase for her son does not qualify as a \"straw purchase\" since her son was not a prohibited person and she filled out the form per the instructions:\n \n \"You are also the actual buyer if you are acquiring the firearm as a legitimate gift for a third party.\"\n\n \n Want to try again? \"Are you the actual buyer of the firearm(s) listed on this form? Warning: You are not the actual buyer if you are acquiring\n the firearm(s) on behalf of another person. If you are not the actual buyer, the dealer cannot transfer the firearm(s) to you. \"\n \n I certify that the above answers are true and correct. I understand that answering &#8220;yes&#8221; to question 12a when I am not the actual buyer\n of the firearm is a crime punishable as a felony.\n http://www.thundertek.net/documents/4473.pdf \n \n Your reading turns out to be in error I believe.", 
   {}, 
   384608, 
   null, 
   1262652840.0
  ], 
  [
   384611, 
   null, 
   "sinjin", 
   "O.K. given all the above.be they The Brady Bunch,VPA,or T.M.I.B. how are even\n the strictest of gun laws next to an all out ban gonna keep the so called straw\n purchasers from well doing their thing and purchasing?even if every last seller at the gunshows are above board.\nNext to impossible I'd say but mandatory theft/loss reporting with stiff penalties for failure would be a step in the right direction. Unless you see it as a Constitutional right to \"not keep\" and bear firearms. I say if you're gonna keep them, then do so and not expect the rest of us to accept any excuse that amounts to it being unreasonable to expect you to know where all your guns are or where they might have gotten to. \n \n \nI just don't buy the no questions asked for a little extra cash(not worth it for the seller).If your squeaky clean your clean,no way around it(thats walking into a gunshop).Same as a gunshow.\n Enforce the laws they have now,forget the new ones that won't be enforced\n anymore than the ones they got now.emoticon_frazzled \nNo questions need to be asked for private firearm transactions in most states. Does anyone even verify that you're a resident of the state? \n I honestly don't know but can guess.", 
   {}, 
   384607, 
   null, 
   1262653080.0
  ], 
  [
   384612, 
   null, 
   "sinjin", 
   "Surely you jest. But then the Brady bunch does play fast and loose with facts.\nI meant what's strange about my opinion being different than the Brady folks?", 
   {}, 
   384609, 
   null, 
   1262653140.0
  ], 
  [
   384613, 
   null, 
   "sinjin", 
   "Want to try again? \"Are you the actual buyer of the firearm(s) listed on this form? Warning: You are not the actual buyer if you are acquiring\n the firearm(s) on behalf of another person. If you are not the actual buyer, the dealer cannot transfer the firearm(s) to you. \"\n \n I certify that the above answers are true and correct. I understand that answering &#8220;yes&#8221; to question 12a when I am not the actual buyer\n of the firearm is a crime punishable as a felony.\n http://www.thundertek.net/documents/4473.pdf \n \n Your reading turns out to be in error I believe.\n\n \n \n Not so fast.\n \n Instruction #1 on the back of the form:\n \n \n \"For purposes of this form, you are the actual buyer if you are purchasing the\n firearm for yourself or otherwise acquiring the firearm for yourself (for example, redeeming the firearm from pawn/retrieving it from consignment). \n \n You are also the actual buyer if you are acquiring the firearm as a legitimate gift for a third party.\n \n ACTUAL BUYER EXAMPLES: Mr. Smith asks Mr. Jones to purchase a firearm for\n Mr. Smith. Mr. Smith gives Mr. Jones the money for the firearm. Mr. Jones is NOT the actual buyer of the firearm and must answer &#8220;no &#8220; to question 12a. The licensee may not transfer the firearm to Mr. Jones. However, if Mr. Brown goes to buy a firearm with his own money to give to Mr. Black as a present, Mr. Brown is the actual buyer of the firearm and should answer &#8220;yes&#8221; to question 12a.\"\n \n sinjin - I'm not looking at the form so I'd appreciate you verifying the verbage.\n \n I can't look at your link.", 
   {}, 
   384610, 
   null, 
   1262653440.0
  ], 
  [
   384614, 
   null, 
   "OldSarge", 
   "Next to impossible I'd say but mandatory theft/loss reporting with stiff penalties for failure would be a step in the right direction. Unless you see it as a Constitutional right to \"not keep\" and bear firearms. I say if you're gonna keep them, then do so and not expect the rest of us to accept any excuse that amounts to it being unreasonable to expect you to know where all your guns are or where they might have gotten to. \n \n No questions need to be asked for private firearm transactions in most states. Does anyone even verify that you're a resident of the state? I honestly don't know but can guess.\n\n \n How do you prove knowledge of the owner knowing the firearm is missing? I have some I haven't seen in years. Another feel good do nothing law.\n \n You still haven't demonstrated that is a problem.", 
   {}, 
   384611, 
   null, 
   1262653500.0
  ], 
  [
   384615, 
   null, 
   "sinjin", 
   "[B]How do you prove knowledge of the owner knowing the firearm is missing? I have some I haven't seen in years. Another feel good do nothing law.\nYou put a \"should have known\" clause in the law. \n \n \nYou still haven't demonstrated that is a problem.\nMandatory theft/loss reporting would give a would-be straw purchaser something to consider.", 
   {}, 
   384614, 
   null, 
   1262653860.0
  ], 
  [
   384616, 
   null, 
   "OldSarge", 
   "You put a \"should have known\" clause in the law. \n \n Mandatory theft/loss reporting would give a would-be straw purchaser something to consider.\n\n \n ROFL you are joking right?\n \n Well if he or she is a straw purchaser then they wouldn't be in violation of your law would they?", 
   {}, 
   384615, 
   null, 
   1262654100.0
  ], 
  [
   384629, 
   null, 
   "zsu2357", 
   "Next to impossible I'd say but mandatory theft/loss reporting with stiff penalties for failure would be a step in the right direction. Unless you see it as a Constitutional right to \"not keep\" and bear firearms. I say if you're gonna keep them, then do so and not expect the rest of us to accept any excuse that amounts to it being unreasonable to expect you to know where all your guns are or where they might have gotten to. \n \n Theft/loss reporting?has to do with what about straw purchases?\n And you better believe I'll keep them,and I know where they are regardless of what the rest of \"us\"think,sinj.I'm gonna start calling you us ok.\n \nNo questions need to be asked for private firearm transactions in most states. Does anyone even verify that you're a resident of the state? \n I honestly don't know but can guess.\n\n Granted, for private firearms sales in some states 33 I think,no questions asked pretty much (which is the way it should be).emoticon_xkill", 
   {}, 
   384611, 
   null, 
   1262661120.0
  ], 
  [
   384641, 
   null, 
   "JPSartre12", 
   "No, I've never been to a gun show.\n \n \"Straw purchasers who buy for people who can't legally acquire firearms because of age requirements (21 to buy a handgun; 18 to buy a long gun), or criminal record, or who want to buy them anonymously. Gang members frequently have their girlfriends buy guns for them. In one case, two handguns used in a gang-related drive-by murder were purchased by a father for his underage sons.\"\n Path of a Bullet | Dart Center for Journalism & Trauma\n \n sinjin - maybe the ladies prefer gun shops to large shows.\n\n \n If that's the case, then what problem are you trying to solve by closing the so-called gun show loophole? emoticon_confused", 
   {}, 
   384587, 
   null, 
   1262664300.0
  ], 
  [
   384644, 
   null, 
   "OldSarge", 
   "If that's the case, then what problem are you trying to solve by closing the so-called gun show loophole? emoticon_confused\n\n \n A perceived one that is mythical?", 
   {}, 
   384641, 
   null, 
   1262668080.0
  ], 
  [
   384669, 
   null, 
   "JPSartre12", 
   "A perceived one that is mythical?\n\n \n The entire gun-grabbing agenda is based on myths and half-truths. It's liberal smoke and mirrors at its finest.", 
   {}, 
   384644, 
   null, 
   1262703900.0
  ], 
  [
   384700, 
   null, 
   "sinjin", 
   "If that's the case, then what problem are you trying to solve by closing the so-called gun show loophole? emoticon_confused\nThe lack of background checks on private sales applies to gun shows and sales transacted elsewhere. \n To say there's no \"gun show loophole\" is correct because the \"loophole\" extends well beyond gun shows.\n \n If it's reasonable to require a background check for the initial buyer, then why not every subsequent buyer?\n How can a private citizen know they're not selling to a \"prohibited person\"?", 
   {}, 
   384641, 
   null, 
   1262719020.0
  ], 
  [
   384703, 
   null, 
   "JPSartre12", 
   "The lack of background checks on private sales applies to gun shows and sales transacted elsewhere. \n To say there's no \"gun show loophole\" is correct because the \"loophole\" extends well beyond gun shows.\n \n If it's reasonable to require a background check for the initial buyer, then why not every subsequent buyer?\n How can a private citizen know they're not selling to a \"prohibited person\"?\n\n \n Let's recap your statements. \n First, you claimed that gang bangers were buying guns at gun shows. When shown the folly of that statement, you backpeddled to \"their girlfriends were buying them for them at the shows\".\n When that absurdity was exposed, you backpeddled to \"the GFs bought them at gun stores for their gang banging friends.\"\n If you backpeddle any further, you're going to find yourself stumbling off your cliff of liberaL absurdity and back to the real world where gun show sales aren't an issue.", 
   {}, 
   384700, 
   null, 
   1262719860.0
  ], 
  [
   384705, 
   null, 
   "NATO 556", 
   "The lack of background checks on private sales applies to gun shows and sales transacted elsewhere. \n To say there's no \"gun show loophole\" is correct because the \"loophole\" extends well beyond gun shows.\n\n \n I fail to see exactly how this qualifies as a loophole.\n \n \nIf it's reasonable to require a background check for the initial buyer, then why not every subsequent buyer?\n\n \n Because the initial buyer isn't a federally licensed individual subject to government sanctions and regulations. You can't expect private individuals to fill the same duties.\n \n \nHow can a private citizen know they're not selling to a \"prohibited person\"?\n\n \n Through the exercise of judgment and discretion.", 
   {}, 
   384700, 
   null, 
   1262720640.0
  ], 
  [
   384706, 
   null, 
   "JPSartre12", 
   "I fail to see exactly how this qualifies as a loophole.\n \n Because the initial buyer isn't a federally licensed individual subject to government sanctions and regulations. You can't expect private individuals to fill the same duties.\n \n Through the exercise of judgment and discretion.\n\n \n More smokescreens and mirrors from Sinjin. He's never attended a gun show, yet he's an expert on what occurs there. I've never attended the ballet, so I must be an expert on it. ;)", 
   {}, 
   384705, 
   null, 
   1262721180.0
  ], 
  [
   384707, 
   null, 
   "sinjin", 
   "Let's recap your statements. \n First, you claimed that gang bangers were buying guns at gun shows. When shown the folly of that statement, you backpeddled to \"their girlfriends were buying them for them at the shows\".\n When that absurdity was exposed, you backpeddled to \"the GFs bought them at gun stores for their gang banging friends.\"\n If you backpeddle any further, you're going to find yourself stumbling off your cliff of liberaL absurdity and back to the real world where gun show sales aren't an issue.\nPlease quote where I claimed gang bangers buy guns at gun shows.", 
   {}, 
   384703, 
   null, 
   1262722680.0
  ], 
  [
   384708, 
   null, 
   "sinjin", 
   "I fail to see exactly how this qualifies as a loophole.\nCall it what you like. It's a way to buy a gun when you're not allowed to.\n \n \nBecause the initial buyer isn't a federally licensed individual subject to government sanctions and regulations. You can't expect private individuals to fill the same duties.\nI don't expect them to fill duties. I expect them to go to someone who can make sure the transaction isn't illegal one way or the other.\n \n \nThrough the exercise of judgment and discretion. \nThat's rich. You know a felon when you see one or speak for a minutes to one?", 
   {}, 
   384705, 
   null, 
   1262722920.0
  ], 
  [
   384709, 
   null, 
   "sinjin", 
   "More smokescreens and mirrors from Sinjin. He's never attended a gun show, yet he's an expert on what occurs there. I've never attended the ballet, so I must be an expert on it. ;)\nNonsense. I quote part of the article linked in the OP that mentioned the Brady folks targeting \"illegal sales and gun show loopholes\". \n The rest is in your imagination.", 
   {}, 
   384706, 
   null, 
   1262723160.0
  ], 
  [
   384710, 
   null, 
   "sinjin", 
   "A perceived one that is mythical?\nSo what's the final word on Form 4473. \n Does it say in the instructions on the back what I posted?", 
   {}, 
   384644, 
   null, 
   1262723340.0
  ], 
  [
   384711, 
   null, 
   "OldSarge", 
   "Call it what you like. It's a way to buy a gun when you're not allowed to.\n Then the problem is obvious. Catch a prohibited person ie a felon with a firearm and turn him or her into spare parts. Solve your problem real quick.\n I don't expect them to fill duties. I expect them to go to someone who can make sure the transaction isn't illegal one way or the other.\n Well if you can demonstrate that is a real problem then perhaps a solution can be found. Since you don't know one way or the other its pass a law time right?\n That's rich. You know a felon when you see one or speak for a minutes to one?\n\n \n First of all most reasonable people won't sell firearms to someone they don't know. Second of all one can usually spot someone that is not quite on the up and up. Gang banger clothes, prison tatts, attitude, etc. ", 
   {}, 
   384708, 
   null, 
   1262723400.0
  ], 
  [
   384715, 
   null, 
   "OldSarge", 
   "B.S. \n I suppose those private sellers at the gun show want to get to know you first. \n Are they reasonable people or no? As to the BS I am sure you know all about that.\n Sure thing. I'm sure a felon never thought to clean up for court. \n Usually no since its their bottom feeding lawyers who \"advise\" them to do so. But you knew that.\n What's that suppose to mean asswipe?\n\n \n Gee you want to play insults? I'd hate to see you crying again about hostile environment. ", 
   {}, 
   384711, 
   null, 
   1262724540.0
  ], 
  [
   384717, 
   null, 
   "NATO 556", 
   "Call it what you like. It's a way to buy a gun when you're not allowed to.\n\n \n The government has no business invading into the private, legal activities of two individuals.\n \n \nI don't expect them to fill duties. I expect them to go to someone who can make sure the transaction isn't illegal one way or the other.\n\n \n And how is requirement able to defeat straw purchasers?\n \n \nThat's rich. You know a felon when you see one or speak for a minutes to one?\n\n \n If you don't feel comfortable making the sale, don't make it. It's as simple as that.", 
   {}, 
   384708, 
   null, 
   1262725200.0
  ], 
  [
   384718, 
   null, 
   "Tither", 
   "Call it what you like. It's a way to buy a gun when you're not allowed to.\n\n Humm! England and Australia have all of the gun control that you want and even more. Lets see just how well an Island nation does in keeping guns out of the hands of their criminal enterprises. Given the fact that the criminals have already paid off the cops to bring in drugs, that is.\n \n   Weapons sell for just £50 as suspects and victims grow ever younger \n Senior police officers have been warning for several months that a growing number of teenagers in big cities are becoming involved in gun crime. \n \n The age of victims and suspects has fallen over the past three years as the availability of firearms in some cities has risen. \n \n \"Illegal firearms have become increasingly accessible to younger offenders who appear more likely to use these firearms recklessly,\" a report on gun crime commissioned by the Home Office cautioned last year.\n\n England & Aust gun studies \n   Shotguns for £50: study reveals weapons culture  \n Sawn-off shotguns are still the weapon of choice for the more serious armed criminal and can now be bought illegally for between £50 and £200, according to Home Office research. A purpose-built 9mm handgun, which is easier to conceal than a shotgun, is available for £1,000-£1,400 on the back streets of Britain while those wanting \"a gangster image\" can buy a  machine gun  for £800.\n \n Even though those interviewed were in prison, many still viewed gun crime as a \"viable career option\" enabling them to overcome their deprived backgrounds to secure wealth and status. One man from Greater Manchester claimed he had earned £52,000 in a week from gun crime. The study shows that though Nottingham is dubbed Britain's gun crime capital, guns are far more available in Manchester, Liverpool, Birmingham and London.\n\n \n Here is another study produced by Australian Institute of Criminology (The Australian FBI) called   Weapons, drugs and crime Australian Institute of Criminology (AIC) \n \n And a article about the study here.\n Link  Australian Institute of Criminology study -- Tough new weapons laws 'miss hard core of criminal underworld' \nCANBERRA - The introduction of tough laws to control guns and knives appears to be failing to keep lethal weapons out of the hands of Australian criminals. .... reported that while new laws may have helped reduce the number of knives and guns in illicit circulation,  they have failed to deter hard-core criminals. It also pointed to a large firearms black market. \n\n \n I've just one more word to say on drug dealers importing Illegal Guns in with their drugs. Mexico! Enough said?", 
   {
    "unicode_changes_made": true
   }, 
   384708, 
   null, 
   1262726100.0
  ], 
  [
   384720, 
   null, 
   "JPSartre12", 
   "Please quote where I claimed gang bangers buy guns at gun shows.\n\n \n Here ya go. The comment in red is your response.\n \n\n Quote:\n Originally Posted by JPSartre12 \n Arm law-abiding citizens, naturally, unless you're foolish enough to take a knife to a gunfight. \n \n In most states a \"law-abiding\" citizen can sell their firearms to anyone, no questions asked.\n \n Quote:\n BTW, in case you aren't aware, not too many gang bangers attend gun shows...... at least that's the case here in Detroit subs. \n \n They just send their girlfriends or buy second hand from private parties.\n\n \n Now, anyone with a modicum of knowledge of the English language knows that the \"THEY\" you are referring to is the subject of my preceding statement \"gang bangers\". \n You, sir, have been hoisted on your own petard. emoticon_xkill", 
   {}, 
   384707, 
   null, 
   1262728680.0
  ], 
  [
   384721, 
   null, 
   "Doc Jones", 
   "Here ya go. The comment in red is your response.\n \n \n Now, anyone with a modicum of knowledge of the English language knows that the \"THEY\" you are referring to is the subject of my preceding statement \"gang bangers\". \n You, sir, have been hoisted on your own petard. emoticon_xkill\n\n \n Hardy, har har! It is nice to see sinjin is still \"hanging\" around :)", 
   {}, 
   384720, 
   null, 
   1262729460.0
  ], 
  [
   384724, 
   null, 
   "JPSartre12", 
   "Hardy, har har! It is nice to see sinjin is still \"hanging\" around :)\n\n \n He is getting a little testy, though. ;)\n \n\n What's that suppose to mean asswipe? \n", 
   {}, 
   384721, 
   null, 
   1262729940.0
  ], 
  [
   384725, 
   null, 
   "Doc Jones", 
   "He is getting a little testy, though. ;)\n\n \n Yeah, being thwarted, warted, and wanted does that to a gun grabber.\n \n I think he also belongs to NORMAL?", 
   {}, 
   384724, 
   null, 
   1262730120.0
  ], 
  [
   384750, 
   null, 
   "Doc Jones", 
   "More guns = more crimes? Something is sure wrong here. Kellerman data that the gun grabbers swear by should provide 43 times more deaths and the numbers are way too low. I guess we can expect a real surge in gun deaths shortly? <smirk<", 
   {}, 
   384725, 
   null, 
   1262732580.0
  ], 
  [
   384752, 
   null, 
   "OldSarge", 
   "More guns = more crimes? Something is sure wrong here. Kellerman data that the gun grabbers swear by should provide 43 times more deaths and the numbers are way too low. I guess we can expect a real surge in gun deaths shortly? <smirk<\n\n \n Its gone bust loose any second now. The FBI be lying!", 
   {}, 
   384750, 
   null, 
   1262732880.0
  ], 
  [
   384763, 
   null, 
   "zsu2357", 
   "Nonsense. I quote part of the article linked in the OP that mentioned the Brady folks targeting \"illegal sales and gun show loopholes\". \n The rest is in your imagination.\n\n This is the problem sinj.opps\"us\"your quoting the Brady Bunch.emoticon_xdonno", 
   {}, 
   384709, 
   null, 
   1262736720.0
  ], 
  [
   384764, 
   null, 
   "sinjin", 
   "Here ya go. The comment in red is your response.\n \n \n Now, anyone with a modicum of knowledge of the English language knows that the \"THEY\" you are referring to is the subject of my preceding statement \"gang bangers\". \n You, sir, have been hoisted on your own petard. emoticon_xkill\nIf \"they\" send a proxy then \"they\" aren't buying are \"they\"?\n I didn't bring gang members up in the first place. That was Nato.\n \n \nLet's recap your statements. \n First, you claimed that gang bangers were buying guns at gun shows. When shown the folly of that statement, you backpeddled to \"their girlfriends were buying them for them at the shows\".\nWhere's the \"First\" you claim I posted?", 
   {}, 
   384720, 
   null, 
   1262736780.0
  ], 
  [
   384765, 
   null, 
   "sinjin", 
   "The government has no business invading into the private, legal activities of two individuals.\nIt does when the law says there are people who cannot buy and it's impossible to know who's who without a background check. \n \n \nAnd how is requirement able to defeat straw purchasers?\nIt's not. It's meant to prevent felons from buying for themselves.\n \n \nIf you don't feel comfortable making the sale, don't make it. It's as simple as that.\nAnd if you're comfortable selling to whomever has the cash, your fellow citizens be damned. Swell.", 
   {}, 
   384717, 
   null, 
   1262738400.0
  ], 
  [
   384766, 
   null, 
   "sinjin", 
   "Your reading turns out to be in error I believe.\n\n \n \nSo what's the final word on Form 4473. \n Does it say in the instructions on the back what I posted?\n\n \n Well? I'd like a response.", 
   {}, 
   384610, 
   null, 
   1262738940.0
  ], 
  [
   384772, 
   null, 
   "sinjin", 
   "Gee you want to play insults?\n\n \n Because this:\n \n...one can usually spot someone that is not quite on the up and up. Gang banger clothes, prison tatts, attitude, etc. \n Of course in your case its a toss up IMHO.\n\n wasn't meant as an insult?\n \n Now let's here from you on the form 4473 instructions to those buying firearms as gifts.", 
   {}, 
   384715, 
   null, 
   1262740020.0
  ], 
  [
   384773, 
   null, 
   "OldSarge", 
   "Because this:\n \n wasn't meant as an insult?\n\n \n Well you tell me if you think it was. You seem to be the expert on insults XXX wipe or no. Perhaps you might be better served rereading it. Can you tell a felon or no?", 
   {}, 
   384772, 
   null, 
   1262740320.0
  ], 
  [
   384774, 
   null, 
   "OldSarge", 
   "Because this:\n \n wasn't meant as an insult?\n \n Now let's here from you on the form 4473 instructions to those buying firearms as gifts.\n\n \n The fast edit trick again original sin? It should be hear don'tja think mr spelling expert.", 
   {}, 
   384772, 
   null, 
   1262740440.0
  ], 
  [
   384776, 
   null, 
   "sinjin", 
   "[B]Well you tell me if you think it was. You seem to be the expert on insults XXX wipe or no. Perhaps you might be better served rereading it.\nIf it wasn't and I took it wrong I'd like to know so that I might apologize.\n \n \nCan you tell a felon or no?\nOf course not. There are plenty of stand up guys that fit your description.", 
   {}, 
   384773, 
   null, 
   1262740740.0
  ], 
  [
   384778, 
   null, 
   "OldSarge", 
   "If it wasn't and I took it wrong I'd like to know so that I might apologize.\n \n Of course not. There are plenty of stand up guys that fit your description.\n\n \n Then IMHO I was semi correct.", 
   {}, 
   384776, 
   null, 
   1262740920.0
  ], 
  [
   384779, 
   null, 
   "sinjin", 
   "The fast edit trick again original sin? It should be hear don'tja think mr spelling expert.\nYes, I fixed the typo in \"instruction\". Oh, the humanity.\n \n Will you be addressing Sarah Brady's \"straw purchase\" form 4473 again?", 
   {}, 
   384774, 
   null, 
   1262740920.0
  ], 
  [
   384781, 
   null, 
   "OldSarge", 
   "Yes, I fixed the typo in \"instruction\". Oh, the humanity.\n \n Will you be addressing Sarah Brady's \"straw purchase\" form 4473 again?\n\n \n No I think I'll let you stew some more. I gave you the link so you should have been able to access it. \n \n I will give you one thing though. All these ideas you come up with to punish the law abiding come right from the Brady bunch, don't they?", 
   {}, 
   384779, 
   null, 
   1262741280.0
  ], 
  [
   384787, 
   null, 
   "NATO 556", 
   "It does when the law says there are people who cannot buy and it's impossible to know who's who without a background check.\n\n \n Previously the government declared it had just cause to know about the marital activity of private citizens and what they did in their bedrooms at night. The Supreme Court ruled that they didn't.\n \n Simply because the government says that they have the right to know, doesn't mean they actually do.\n \n \nIt's not. It's meant to prevent felons from buying for themselves.\n\n \n And yet we have people like the Brady Campaign pointing to incidents of people with felony records being able to buy guns from gun stores. They're quick to blame the dealers for being corrupt and paint them as the problem. But considering the Nigerian was allowed to fly into this country, I think it has more to do with the government being lax in its duties.\n \n \nAnd if you're comfortable selling to whomever has the cash, your fellow citizens be damned. Swell.\n\n \n You know what, I'm tired of this game. In this post-9/11 world a lot of people are trying to push for the punishment of people who do wrongful acts, circumstances be damned. They don't care why they did it or what the reasons were, they just want blood.\n \n You can't prove that private sellers are knowingly and intentionally selling to a prohibited individual and in possession of mens rea. Therefore you can't prove that private sellers are the real problem, rather than just another victim in the chain of crimes.", 
   {}, 
   384765, 
   null, 
   1262744880.0
  ], 
  [
   384792, 
   null, 
   "zsu2357", 
   "Sarge I knew I saw this link, guess it was yours huh?emoticon_emb\n As an afterthought sinj,\"us\"check 12 c...follow on to important notice 6 exception 1 and be prepared to be scared\n because you will realize there are alot of felons out there that legally own and carry,you see there are many many many ways to be a felon without being a dangerous psychopath,there is absolutely no way to tell a felon on sight,I've heard\n that mentioned and\"us\"that is not altogether pointed at you.", 
   {
    "post_info": {
     "post_title": "http://www.thundertek.net/documents/4473.pdf"
    }
   }, 
   384787, 
   null, 
   1262750460.0
  ], 
  [
   384828, 
   null, 
   "sinjin", 
   "All these ideas you come up with to punish the law abiding come right from the Brady bunch, don't they?\nNot even one of them. Never. Not once.", 
   {}, 
   384781, 
   null, 
   1262814660.0
  ], 
  [
   384829, 
   null, 
   "NATO 556", 
   "Not even one of them. Never. Not once.\n\n \n Oh really?\n \n Mandatory storage requirements.\n Mandatory reporting of theft or loss.\n Mandatory registration.\n Mandatory documentation of all private transfers.\n \n Every one of these ideas you support is also supported by the Brady Campaign.", 
   {}, 
   384828, 
   null, 
   1262815680.0
  ], 
  [
   384832, 
   null, 
   "sinjin", 
   "Oh really?\nYes, really. I do my own thinking.\n \n \nMandatory storage requirements.\n Mandatory reporting of theft or loss.\n Mandatory registration.\n Mandatory documentation of all private transfers.\n \n Every one of these ideas you support is also supported by the Brady Campaign. \nI support mandatory storage for unattended firearms.\n I do not support mandatory registration.", 
   {}, 
   384829, 
   null, 
   1262819220.0
  ], 
  [
   384835, 
   null, 
   "zsu2357", 
   "Yes, really. I do my own thinking.\n \n I support mandatory storage for unattended firearms.\n I do not support mandatory registration.\n\n So what your saying is, THAT is all you support?\n \n \nMandatory reporting of theft or loss.\n Mandatory registration.\n Mandatory documentation of all private transfers.\n\n What about this other stuff Nato mentioned above?emoticon_confused", 
   {}, 
   384832, 
   null, 
   1262820000.0
  ], 
  [
   384843, 
   null, 
   "sinjin", 
   "You left off a couple there mr expert on asswipes.\nI was making qualifications to Nato's claims of that which I supposedly support.\n \n I am on record as supporting both background checks for all transfers of ownership and mandatory theft/loss reporting. \n I wasn't trying to be cagey.\n \n Keep bringing the hostility though.", 
   {}, 
   384832, 
   null, 
   1262820720.0
  ], 
  [
   384846, 
   null, 
   "OldSarge", 
   "I was making qualifications to Nato's claims of that which I supposedly support.\n \n I am on record as supporting both background checks for all transfers of ownership and mandatory theft/loss reporting. \n I wasn't trying to be cagey.\n \n Keep bringing the hostility though.\n\n \n Sure after calling me an asswipe I am bringing the hostility? get real. ", 
   {}, 
   384843, 
   null, 
   1262821320.0
  ], 
  [
   384850, 
   null, 
   "sinjin", 
   "Sure after calling me an asswipe I am bringing the hostility? get real.\nJust a thought but maybe you could stick to the topics at hand and stop making personal attacks? \n \n You never did explain what you meant by, \"In your case it's a toss up\". \n \n Funny, that little gem seems to have been edited out. \n Would that have been voluntary on your part or did someone else deem it offensive enough to strip out?", 
   {}, 
   384846, 
   null, 
   1262821980.0
  ], 
  [
   384851, 
   null, 
   "OldSarge", 
   "Just a thought but maybe you could stick to the topics at hand and stop making personal attacks? \n Yea its me making the personal attacks like calling you an asswipe. Get real.\n You never did explain what you meant by, \"In your case it's a toss up\". \n \n Funny, that little gem seems to have been edited out. \n Would that have been voluntary on your part or did someone else deem it offensive enough to strip out?\n\n \n You tell me. Since I have no idea what you are talking about. My comment was I doubt you wouldn't be able to tell a fellon or other shifty character. Sleeping in school or reading the white part, I have no idea. ", 
   {}, 
   384850, 
   null, 
   1262822340.0
  ], 
  [
   384853, 
   null, 
   "OldSarge", 
   "I do notice my post is gone but I didn't delete it. Did sin object? \n \n Originally Posted by sinjin \n B.S. \n I suppose those private sellers at the gun show want to get to know you first. \n Are they reasonable people or no? As to the BS I am sure you know all about that.\n Sure thing. I'm sure a felon never thought to clean up for court. \n Usually no since its their bottom feeding lawyers who \"advise\" them to do so. But you knew that.What's that suppose to mean asswipe?\n I see that one is gone also. Retract it or?", 
   {
    "post_info": {
     "post_title": "the censor at work?"
    }
   }, 
   384851, 
   null, 
   1262822940.0
  ], 
  [
   384856, 
   null, 
   "sinjin", 
   "You tell me. Since I have no idea what you are talking about.\nWhat a piece of work you are. \n \n \nMy comment was I doubt you wouldn't be able to tell a fellon or other shifty character.\nThat may have been what you meant and I did ask if I misunderstood but you chose to ignore my request. \n You said something like, \"But in your case it's a toss up IMHO\". \n \n \nSleeping in school or reading the white part, I have no idea.\nOr clue apparently.", 
   {}, 
   384851, 
   null, 
   1262823360.0
  ], 
  [
   384858, 
   null, 
   "sinjin", 
   "I do notice my post is gone but I didn't delete it. Did sin object? \nI didn't. I assume admin chose to clean things up on behalf of us both.\n \n Thanks admin and sorry for my momentary weakness.", 
   {}, 
   384853, 
   null, 
   1262823540.0
  ], 
  [
   384863, 
   null, 
   "OldSarge", 
   "What a piece of work you are. \n \n That may have been what you meant and I did ask if I misunderstood but you chose to ignore my request. \n You said something like, \"But in your case it's a toss up IMHO\". \n \n Or clue apparently.\n\n \n And yoiu still claim its me with the hostility? Ya got to be a liberal.", 
   {}, 
   384856, 
   null, 
   1262825040.0
  ], 
  [
   384864, 
   null, 
   "OldSarge", 
   " \n \n That may have been what you meant and I did ask if I misunderstood but you chose to ignore my request. \n You said something like, \"But in your case it's a toss up IMHO\". \n \n \n\n \n Its exactly what I meant. Most people with a command of English would recognize it as such. I'd apologize but don't think I need to after the asswipe comment.", 
   {}, 
   384856, 
   null, 
   1262825220.0
  ], 
  [
   384868, 
   null, 
   "sinjin", 
   "And you still claim its me with the hostility? Ya got to be a liberal.\nWhy yes I do since nearly every response of yours includes a personal swipe or snipe or snark. \n Even when you're just swapping spit with your amigos. \n \n You're doing it again with the above quote but I don't find being called a \"liberal\" particularly insulting, \n although I know you mean it as one.", 
   {}, 
   384863, 
   null, 
   1262825820.0
  ], 
  [
   384869, 
   null, 
   "sinjin", 
   "Its exactly what I meant. Most people with a command of English would recognize it as such. I'd apologize but don't think I need to after the asswipe comment.\nCan you see that one could infer that the \"toss up\" was meant to mean that I personally wore gang attire, had prison style tattooing and had an attitude and so it would be a \"toss up\" as to which identified me as looking like a felon?\n \n \n...one can usually spot someone that is not quite on the up and up. Gang banger clothes, prison tatts, attitude, etc. \n But in your case it's a toss up IMHO.\n", 
   {}, 
   384864, 
   null, 
   1262826120.0
  ], 
  [
   384870, 
   null, 
   "OldSarge", 
   "Why yes I do since nearly every response of yours includes a personal swipe or snipe or snark. \n Even when you're just swapping spit with your amigos. \n \n You're doing it again with the above quote but I don't find being called a \"liberal\" particularly insulting, \n although I know you mean it as one.\n\n \n I am sure you really believe that. Hence the liberal term. If you were a tank I'd send you off for sighting and fire control recalibration. However in your case it would have to be a depot rebuild. But what ever you perceive it pales in contrast to asswipe. About time to slink off claiming a toxic environment isn't it?", 
   {}, 
   384868, 
   null, 
   1262826480.0
  ], 
  [
   384871, 
   null, 
   "OldSarge", 
   "Can you see that one could infer that the \"toss up\" was meant to mean that I personally wore gang attire, had prison style tattooing and had an attitude and so it would be a \"toss up\" as to which identified me as looking like a felon?\n\n \n Only one in poor command of English or some sort of hostility percption complex would. I believe most people without those features would understand it meant you couldn't tell the difference. I believe it was Will Rodgers that said: when you find yourself in a hole the first thing to do is drop the shovel. ", 
   {}, 
   384869, 
   null, 
   1262826960.0
  ], 
  [
   384872, 
   null, 
   "sinjin", 
   "I am sure you really believe that. Hence the liberal term. If you were a tank I'd send you off for sighting and fire control recalibration. However in your case it would have to be a depot rebuild. But what ever you perceive it pales in contrast to asswipe. About time to slink off claiming a toxic environment isn't it?\nNo thanks. I've had about enough of your bully boy tactics. I eat bullies for breakfast. Always have. \n I think I'll just stick around to keep you guys honest. Lord knows it's needed.\n \n How about those instructions for gift gun buyers on the back of form 4473? Gonna own that one or what?", 
   {}, 
   384870, 
   null, 
   1262827320.0
  ], 
  [
   384874, 
   null, 
   "Doc Jones", 
   "No thanks. I've had about enough of your bully boy tactics. I eat bullies for breakfast. Always have.\n\n \n Advertising sinjin or just solicitation? Kalifornia huh? What kind of form do you have to fill out? Surely not a 4473 unless you count it as a gun which you mentioned once. emoticon_xclown", 
   {}, 
   384872, 
   null, 
   1262828880.0
  ], 
  [
   384889, 
   null, 
   "JPSartre12", 
   "If \"they\" send a proxy then \"they\" aren't buying are \"they\"?\n I didn't bring gang members up in the first place. That was Nato.\n\n \n You only claimed that they bought them via proxy after I said gang bangers don't attend gun shows. \n \n\n Where's the \"First\" you claim I posted?\n\n \n Really, Sinjin, feigning ignorance isn't helping your cause. emoticon_rolleyes", 
   {}, 
   384764, 
   null, 
   1262839920.0
  ], 
  [
   384929, 
   null, 
   "OldSarge", 
   "No thanks. I've had about enough of your bully boy tactics. I eat bullies for breakfast. Always have. \n I think I'll just stick around to keep you guys honest. Lord knows it's needed.\n \n How about those instructions for gift gun buyers on the back of form 4473? Gonna own that one or what?\n\n \n Still going for the high ground on the hostility issue? You do need some help. Flex them cyber muscles baby, I'm impressed. Going to whack us with your cyber purse or some thing? Strange being a liberal honest is relative to the situation. So you really don't know what it is. We will remind you. \n \n Since I gave you the link which you claimed you couldn't see (at work and blocked?) it is rather redundant. Right after your apology I will. Kinda makes the whole Brady bill a joke doesn't it? I buy and gift someone. As long as they are clean up to that moment I'm good. So much for your idea of all sales being checked tho isn't it. While we are at it is there an apology coming from you to me on the asswipe coment? I really don't expect it as being a liberal means never having to say sorry ya know. ", 
   {}, 
   384872, 
   null, 
   1262879760.0
  ], 
  [
   384930, 
   null, 
   "OldSarge", 
   "You only claimed that they bought them via proxy after I said gang bangers don't attend gun shows. \n \n \n Really, Sinjin, feigning ignorance isn't helping your cause. emoticon_rolleyes\n\n \n Best tread lightly there JP. The toxic atmosphere and hostility ya know. I do hope yer not a bully as old sin eats them for breakfast. I'd ask but I really don't want to know.", 
   {}, 
   384889, 
   null, 
   1262879880.0
  ], 
  [
   384954, 
   null, 
   "JPSartre12", 
   "Best tread lightly there JP. The toxic atmosphere and hostility ya know. I do hope yer not a bully as old sin eats them for breakfast. I'd ask but I really don't want to know.\n\n \n That's funny, I eat liberals for breakfast. I find them to be well-marbled and the lack of spine makes them easier to prepare. emoticon_xgood", 
   {}, 
   384930, 
   null, 
   1262892480.0
  ], 
  [
   384964, 
   null, 
   "OldSarge", 
   "That's funny, I eat liberals for breakfast. I find them to be well-marbled and the lack of spine makes them easier to prepare. emoticon_xgood\n\n \n Lordie its a good thing I wasn't taking a drink there!!!emoticon_xagree", 
   {}, 
   384954, 
   null, 
   1262893320.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  More guns equal more crime?", 
  "url": "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13749, 
  "discussion_files": [
   [
    "13734.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-print.html"
   ], 
   [
    "13735.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-7-print.html"
   ], 
   [
    "13736.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-5-print.html"
   ], 
   [
    "13737.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-4-print.html"
   ], 
   [
    "13738.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-6-print.html"
   ], 
   [
    "13739.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-3-print.html"
   ], 
   [
    "13740.html", 
    "http://www.4forums.com/political/gun-control-debates/13749-more-guns-equal-more-crime-2-print.html"
   ]
  ], 
  "identifier": 13749
 }
]