[
 [
  [
   384815, 
   null, 
   "NATO 556", 
   "EDITORIAL: The forgotten virtue of firearms - Washington Times\n \n \nDuring Christmas week, a registered sex offender with a conviction for attempted murder used a gun to take three hostages at a Wytheville, Va., post office. Not too surprisingly, the national media gave the crime extensive news coverage. Such sensationalism leaves a distorted image about what happens with guns every day in the United States. When guns work to stop crime, there's not nearly as much drama to sensationalize and, as a result, that much less coverage.\n \n In Oklahoma City the previous week, an armed citizen singlehandedly stopped an attack that surely would have resulted in a multiple-victim public shooting. The media gave the event scant attention. The scene went down when a Marine, who was on leave and came home for the holidays, started firing in an apartment parking lot. Before anyone was harmed, another man aimed his permitted concealed handgun at the attacker and ordered him to put down his weapon. The shooter dropped his gun and ran into his father's apartment, barricading himself in. Three-and-a-half hours later, the man surrendered to the police.\n \n A Marine with a gun who wanted to cause harm would surely be able to maim or kill a lot of people. Those dead bodies would have attracted exhaustive coverage. Of course, corpses are newsworthy in our sensational culture, but when an armed citizen stops an attack, the heroism rates barely a blip on the national radar screen. In this case, a search found just one television news story on the incident, and it left out the identity of the man who saved the day. In our confused times, murderers, it seems, are more interesting than heroes.\n \n An important detail that is neglected in news coverage is that all the multiple-victim public shootings in America - crimes in which more than three people were killed - happened where legal concealed handguns are banned. The Wytheville post office is such a gun-free zone, not to mention that the felon who committed the crime was banned from possessing a firearm anywhere. The Oklahoma City attack was stopped because the man who stopped it could carry a concealed handgun.\n \n Often what's true and what makes good TV are two different things. But either way, news standards don't give people any idea about the costs and benefits of people owning guns. Police are extremely important in stopping crimes, but police understand that they almost always arrive on the scene after a crime has occurred. Heroic actions of citizens who stop attacks deserve a lot more attention.\n", 
   {
    "post_info": {
     "post_title": "The forgotten virtue of firearms"
    }
   }, 
   null, 
   null, 
   1262806740.0
  ], 
  [
   384839, 
   null, 
   "OldSarge", 
   "EDITORIAL: The forgotten virtue of firearms - Washington Times\n\n \n That could have been a twofer! A Marine and lots of blood from guns! Just think two things the left hates.", 
   {}, 
   384815, 
   null, 
   1262820300.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The forgotten virtue of firearms", 
  "url": "http://www.4forums.com/political/gun-control-debates/13758-forgotten-virtue-firearms.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13758, 
  "discussion_files": [
   [
    "3958.html", 
    "http://www.4forums.com/political/gun-control-debates/13758-forgotten-virtue-firearms-print.html"
   ]
  ], 
  "identifier": 13758
 }
]