[
 [
  [
   385034, 
   null, 
   "pappillion001", 
   "I noticed that prophecy came into the posts of a few recent threads. I posted a response that showed a Rabbi who had taken 42 verses from the OT and applied them to his making chicken soup as being foretold in scripture. \n \n For me this presents several problems.\n 1) The OT being the size it is provides a large pool of verses to select from, which is then made even easier as no prophetic verses are together.\n \n 2) Some verse are fairly generic, being applicable to more than one person, place or event in history.\n \n 3) Since some prophetic verse are thought to be concerning Jesus' second coming, it would therefore not be unreasonable to also consider that he did not fulfill the prophecies or that they could be intended for someone in the future.\n \n 4) The existence of prophecy implies that the future is already determined and as such our actions. This would mean there is no free will and whatever we do is supposed to happen. It is not our decision whether to accept Jesus or not, we can only sit in anticipation to see what future has been established for us\n \n So how is it possible to know beyond a doubt that prophecy in the bible concerns Jesus and how can free will exist if the future has already been created?", 
   {
    "post_info": {
     "post_title": "The validity of prophecy"
    }
   }, 
   null, 
   null, 
   1262928060.0
  ], 
  [
   385187, 
   null, 
   "Easyrider", 
   "Here's something else you can sweep under the rug.\n \n Until Shiloh Comes\n \n In the 49th chapter of the book of Genesis there is another specific prophecy regarding the time of the Messiah's coming. In verse one we read of the last blessing that Jacob bestowed to his sons. \n \n \"And Jacob called his sons and said, 'Gather together, that I may tell you what shall befall you in the last days'\" Genesis 49:1 (NKJ) \n \n When he had gathered them together he began to prophesy over each of them. When he got to his son Judah, he gave a prophecy concerning the Messiah: \n \n \"The scepter shall not depart from Judah, nor a lawgiver from between his feet, until Shiloh comes; and to him shall be the obedience of the people.\" Genesis 49:10 (NKJ) \n \n Secondly, it is well documented (by Jews also) that the word \"Shiloh\" has been understood for millennia to be an idiom for the Messiah. \n \n When the members of the Sanhedrin found themselves deprived of their right over life and death, a general consternation took possession of them: they covered their heads with ashes, and their bodies with sackcloth, exclaiming: 'Woe unto us for the scepter has departed from Judah and the Messiah has not come'\"9,10,11 (emphasis added) \n \n The scepter was smitten from the hands of the tribe of Judah. The kingdom of Judea, the last remnant of the greatness of Israel, was debased into being merely a part of the province of Syria. \n \n While the Jews wept in the streets of Jerusalem, there was growing up in the city of Nazareth the young son of a Jewish carpenter, Jesus of Nazareth. The inescapable conclusion was that Shiloh had come! Only then was the Scepter removed! \n \n Until Shiloh Comes\n \n The Messiah had to appear before 70 A.D. Even the Jews knew it, as evidenced by their quotes in the link.", 
   {
    "post_info": {
     "post_title": "Until Shiloh Comes"
    }
   }, 
   385034, 
   null, 
   1263054720.0
  ], 
  [
   385191, 
   null, 
   "Easyrider", 
   "Daniel's Seventy Weeks prophecy: A detailed look at Daniel 9:24-27\n \n Another prophecy indicating the Messiah had to appear before 70 A.D.\n \n A chronological summary of Daniel 9:24-26\n \n 1. There would be a decree to rebuild Jerusalem.\n 2. Jerusalem and the Temple would be rebuilt.\n 3. Then an anointed one (messiah) would be \"cut off\" (an idiom for \"rejected\" or \"killed\").\n 4. Then Jerusalem and the Temple would be destroyed again.\n \n Specifics in the link below:\n \n Daniel's Seventy Weeks prophecy\n \n \"...at least a handful of ancient Rabbis agree that it is correct to view Daniel 9 as providing a timeline for the arrival of a Messiah. Below are a few examples that I copied verbatim from that Web site:\n \n \"1a. Maimonides (Rabbi Moses Ben Maimon): \"Daniel has elucidated to us the knowledge of the end times. However, since they are secret, the wise [rabbis] have barred the calculation of the days of Messiah's coming so that the untutored populace will not be led astray when they see that the End Times have already come but there is no sign of the Messiah\" (Igeret Teiman, Chapter 3 p.24.)\" More rabbinic quotes in the link above.\n \n Messianic Expectations in 1st Century Judaism\n --Documentation From Non-Christian Sources\n \n http://www.christian-thinktank.com/messiah.html", 
   {
    "unicode_changes_made": true
   }, 
   385187, 
   null, 
   1263055740.0
  ], 
  [
   385194, 
   null, 
   "Penfold", 
   "Prophecy can only be validated after the fact when spurious claims are redacted to fit reality. See Nostradamus.", 
   {}, 
   385191, 
   null, 
   1263056280.0
  ], 
  [
   385212, 
   null, 
   "MrWriteLA", 
   "Tom Paine on the topic of prophecy: \nI proceed to speak of the three principal means that have been employed in all ages, and perhaps in all countries, to impose upon mankind.\n \n Those three means are Mystery, Miracle, and Prophecy, The first two are incompatible with true religion, and the third ought always to be suspected...\n \n As Mystery and Miracle took charge of the past and the present, Prophecy took charge of the future, and rounded the tenses of faith. It was not sufficient to know what had been done, but what would be done. The supposed prophet was the supposed historian of times to come; and if he happened, in shooting with a long bow of a thousand years, to strike within a thousand miles of a mark, the ingenuity of posterity could make it point-blank; and if he happened to be directly wrong, it was only to suppose, as in the case of Jonah and Nineveh, that God had repented himself and changed his mind. What a fool do fabulous systems make of man!\n \n It has been shewn, in a former part of this work, that the original meaning of the words prophet and prohesying has been changed, and that a prophet, in the sense of the word as now used, is a creature of modem invention; and it is owing to this change in the meaning of the words, that the flights and metaphors of the Jewish poets, and phrases and expressions now rendered obscure by our not being acquainted with the local circumstances to which they applied at the time they were used, have been erected into prophecies, and made to bend to explanations at the will and whimsical conceits of sectaries, expounders, and commentators. Every thing unintelligible was prophetical, and every thing insignificant was typical. A blunder would have served for a prophecy; and a dish-clout for a type.\n \n If by a prophet we are to suppose a man to whom the Almighty communicated some event that would take place in future, either there were such men, or there were not. If there were, it is consistent to believe that the event so communicated would be told in terms that could be understood, and not related in such a loose and obscure manner as to be out of the comprehension of those that heard it, and so equivocal as to fit almost any circumstance that might happen afterwards. It is conceiving very irreverently of the Almighty, to suppose he would deal in this jesting manner with mankind; yet all the things called prophecies in the book called the Bible come under this description.\n \n But it is with Prophecy as it is with Miracle. It could not answer the purpose even if it were real. Those to whom a prophecy should be told could not tell whether the man prophesied or lied, or whether it had been revealed to him, or whether he conceited it; and if the thing that he prophesied, or pretended to prophesy, should happen, or some thing like it, among the multitunic of things that are daily happening, nobody could again know whether he foreknew it, or guessed at it, or whether it was accidental. A prophet, therefore, is a character useless and unnecessary; and the safe side of the case is to guard against being imposed upon, by not giving credit to such relations.\n \n Upon the whole, Mystery, Miracle, and Prophecy, are appendages that belong to fabulous and not to true religion. They are the means by which so many Lo heres! and Lo theres! have been spread about the world, and religion been made into a trade. The success of one impostor gave encouragement to another, and the quieting salvo of doing some good by keeping up a pious fraud protected them from remorse.\n \n -- excerpt from The Age of Reason, Chapter 17\nThomas Paine Excerpt", 
   {}, 
   385194, 
   null, 
   1263060480.0
  ], 
  [
   385229, 
   null, 
   "Easyrider", 
   "Prophecy can only be validated after the fact when spurious claims are redacted to fit reality. \n\n \n What's your evidence that the Gospel prophecies are \"spurious claims\"? Seems like you've bought into a scalding case of rational tunnel-vision (or political correctness, if you prefer).", 
   {}, 
   385194, 
   null, 
   1263065640.0
  ], 
  [
   385240, 
   null, 
   "trebor", 
   "What's your evidence that the Gospel prophecies are \"spurious claims\"? Seems like you've bought into a scalding case of rational tunnel-vision (or political correctness, if you prefer).\n\n \n I would say that anybody who looks at how the 'prophecy' phrases are used in the NT, and then look at what the phrases mean in context in the OT can see that the NT retrofitted phrases to be a prophecy where it wasn't, and inaccurately applied this out of context phrases to Jesus.", 
   {}, 
   385229, 
   null, 
   1263070800.0
  ], 
  [
   385243, 
   null, 
   "Easyrider", 
   "I would say that anybody who looks at how the 'prophecy' phrases are used in the NT, and then look at what the phrases mean in context in the OT can see that the NT retrofitted phrases to be a prophecy where it wasn't, and inaccurately applied this out of context phrases to Jesus.\n\n \n <SIC<\n \n <Flush<\n \n Once again Trebor, the spiritually challenged kibitzer, refuses to establish his own beliefs and defend them in a forum setting, so he goes after other people's religious beliefs.", 
   {}, 
   385240, 
   null, 
   1263072600.0
  ], 
  [
   385252, 
   null, 
   "Penfold", 
   "Prophecy is not a religious belief, it is apologetic mumbo jumbo. Put simply, the \"New\" testament is a sequel. Tailored to fit the prequel. Prophecy historicised.", 
   {}, 
   385243, 
   null, 
   1263086520.0
  ], 
  [
   385291, 
   null, 
   "Easyrider", 
   "Put simply, the \"New\" testament is a sequel. Tailored to fit the prequel. Prophecy historicised.\n\n \n You keep making that claim but I've seen no compelling evidence from you that supports your claim (Biblically speaking). And here's a prophecy that busts your claim wide open.\n \n THE SUN DARKENED AT NOON\n \n Circa 750 B.C.\n \n According to Amos 1:1, Amos prophesied during the reigns of Uzziah, king of Judah (767-739 B.C.), and Jeroboam, king of Israel (782-753 B.C.). The name \"Amos\" is derived from the Hebrew term meaning, \"lift a burden,\" or \"burden-bearer\" (note Isaiah 9:4, speaking of the coming Messiah as one who would carry our burdens, and also Matthew 11:28). His calling by God was to foretell of pending judgments upon a number of surrounding nations, and particularly of a coming judgment upon Israel. As is common with other Biblical prophets, along with the promise of impending judgment, God also gave Amos a glimpse of events that would soon occur in the life of the coming Messiah, though the significance of what was prophesied may or may not have been made known to Amos. And so it is in the Old Testament book of Amos that we find a prophecy that for many centuries was looked upon with wonder and curiosity:\n \n \"'In that day,' declares the Sovereign Lord, 'I will make the sun go down at noon and darken the earth in broad daylight....I will make that time like mourning for an only son, and the end of it like a bitter day.'\" (Amos 8:9-10)\n \n It probably wasn't until the day of the crucifixion of Jesus Christ in 32 A.D. that the prophecy of Amos took on clarity and meaning, for in Matthew 27:45 Jesus had just been nailed to the cross when the Bible records:\n \n \"From the sixth hour until the ninth hour darkness came over all the land.\"\n \n Just as the \"Star of Bethlehem\" marked the birth of Christ, so now God brought forth another celestial miracle to pronounce His death. This prophecy is one of those that is beyond the control of mortal man, and as such it dispels the theory that Christ could have manipulated events so as to make it appear that He was the Messiah. But is there any evidence that this really occurred? Did the sun go dark at noonday? In his book, Evidence That Demands a Verdict (Volume 1, pages 81-87), Josh McDowell provides the following historical evidence that what took place at Calvary was more that just fanciful mythology:\n \n Concerning the Samaritan-born historian Thallus, circa 52 A.D: (The writings of Thallus no longer exist, yet were alluded to by the historian Julius Africanus, as follows): \"Thallus, in the third book of his histories, explains away this darkness as an eclipse of the sun - unreasonably, as it seems to me - unreasonably, of course, because a solar eclipse could not take place at the time of a full moon, and it was at the season of the Paschal full moon that Christ died.\"\n \n Likewise, Africanus wrote concerning the writings of another first century historian by the name of Phlegon: \"....during the time of Tiberius Caesar an eclipse of the sun occurred during the full moon.\" \n \n Phlegon is also mentioned by the historian Origen in his work, \"Contra Celsum,\" book 2, sections 14, 39, and 59: \"Phlegon mentioned the eclipse that took place during the crucifixion of the Lord Christ....and this is shown by the historical account itself of Tiberius Caesar.\" Apparently at one time there were historical accounts of the strange darkness that came over the land that were kept in the official archives of Tiberius Caesar, though they are likely lost to history.\n \n Finally, the 2nd century Roman born jurist and theologian Tertullian referred to a Roman archives report of an \"unexplained darkness that took place during the reign of Tiberius Caesar, as can be seen in the archives of Pontius Pilate.\"\n \n The darkness spoken of in the book of Matthew occurred between noon and three P.M. in the afternoon (from the sixth to the ninth hours, as the Jews were noted as referring to the sixth and the ninth hours of daylight). Note that a solar eclipse will take less than an hour to complete, and a total solar eclipse lasts just a few minutes. This, coupled with the fact that a solar eclipse cannot occur during a full moon (the moon would be on the 'other' side of the earth), provides further evidence that what occurred was something other than an eclipse of the sun. Just what it was no one can say for sure, just that from recorded historical sources there was a strange darkness during the time of the crucifixion of Jesus Christ. From God's perspective, it surely was a time of mourning for His only begotten son. \n \n So there you have it: The Old Testament prophecy, the New Testament fulfillment, and extra-biblical confirmations.\n \n REFERENCE: McDowell, Josh. Evidence That Demands A Verdict (Vol. 1). Thomas Nelson Publishers. Nashville. 1972.", 
   {}, 
   385252, 
   null, 
   1263135300.0
  ], 
  [
   385317, 
   null, 
   "trebor", 
   "By golly by gosh, Easyrider puts the 'Sun Darkened at Noon', cut/paste again, something that has been blown away and shown to be false a number of times.\n \n His evidence that the 'sun darkened at noon'?? An apologist from 150 years later that is quoting someone who was born 20 years after the fact and whose original writings are no longer in existence that the 'darkening' might have been an eclipse, and the apologist trying to deny that. \n \n Not one contemporary reference, but merely a reference to a reference from someone born long after the fact.", 
   {}, 
   385291, 
   null, 
   1263149340.0
  ], 
  [
   385319, 
   null, 
   "Easyrider", 
   "By golly by gosh, Easyrider puts the 'Sun Darkened at Noon', cut/paste again, something that has been blown away and shown to be false a number of times.\n \n His evidence that the 'sun darkened at noon'?? An apologist from 150 years later that is quoting someone who was born 20 years after the fact and whose original writings are no longer in existence that the 'darkening' might have been an eclipse, and the apologist trying to deny that. \n \n Not one contemporary reference, but merely a reference to a reference from someone born long after the fact.\n\n \n Horse manure.\n \n You don't need to come around here like a man who thinks he knows what's going on, until you can produce your own beliefs and defend them. And you're too gutless to do that, aren't you?\n \n At least we put ours up for scrutiny. You run and hide like a coward when you're asked to put yours up. I have more respect for the Viet Cong and NVA. At least they showed up.", 
   {}, 
   385317, 
   null, 
   1263149820.0
  ], 
  [
   385321, 
   null, 
   "pappillion001", 
   "Daniel's Seventy Weeks prophecy: A detailed look at Daniel 9:24-27\n \n Another prophecy indicating the Messiah had to appear before 70 A.D.\n \n A chronological summary of Daniel 9:24-26\n \n 1. There would be a decree to rebuild Jerusalem.\n 2. Jerusalem and the Temple would be rebuilt.\n 3. Then an anointed one (messiah) would be \"cut off\" (an idiom for \"rejected\" or \"killed\").\n 4. Then Jerusalem and the Temple would be destroyed again.\n \n Specifics in the link below:\n \n Daniel's Seventy Weeks prophecy\n \n \"...at least a handful of ancient Rabbis agree that it is correct to view Daniel 9 as providing a timeline for the arrival of a Messiah. Below are a few examples that I copied verbatim from that Web site:\n \n \"1a. Maimonides (Rabbi Moses Ben Maimon): \"Daniel has elucidated to us the knowledge of the end times. However, since they are secret, the wise [rabbis] have barred the calculation of the days of Messiah's coming so that the untutored populace will not be led astray when they see that the End Times have already come but there is no sign of the Messiah\" (Igeret Teiman, Chapter 3 p.24.)\" More rabbinic quotes in the link above.\n \n Messianic Expectations in 1st Century Judaism\n --Documentation From Non-Christian Sources\n \n http://www.christian-thinktank.com/messiah.html\n\n \n The evidence you have given creates doubt without any additional help from me. \n \n Another prophecy indicating the Messiah  This should be Jesus to avoid confusion.\n \n at least a handful of ancient Rabbis agree that it is correct to view Daniel 9 as providing a timeline for the arrival of a Messiah.\n \n Only a handful? I am sure you can get more than that to agree it's a time line. Maybe only handful will agree it is a time line that coincides with Jesus (again only Messiah named)\n \n Instead of a lengthy explainaition from which you pick and choose what you want to argue, I offer two objections and if you can overcome those then I will provide several more and we can go from there.\n \n The Torah is broken up into 3 parts The Law, The Prophets and The Writings. Jesus claims to have come to fulfill The Law and The Prophets, but Daniel is part of The Writings. Why then do Christians attribute this to Jesus when he doesn't? \n \n The distinction being established prior to and then confirmed by Jesus' doing so in claiming Law and Prophets seperatly. Meaning it's not thought of being part of one of the others or implied.\n \n Additionally, you might find this interesting. \n \n http://www.arts.ualberta.ca/JHS/Articles/article_104.pdf\n \n It determines a time frame and person consistent with the theme of Daniel which is not Jesus and is well before his birth.", 
   {
    "unicode_changes_made": true
   }, 
   385191, 
   null, 
   1263150300.0
  ], 
  [
   385326, 
   null, 
   "Penfold", 
   "Horse manure. .... \n\n \n You got the franchise, but nobody wants to buy your fertiliser.", 
   {}, 
   385319, 
   null, 
   1263151260.0
  ], 
  [
   385330, 
   null, 
   "Easyrider", 
   "\n \n at least a handful of ancient Rabbis agree that it is correct to view Daniel 9 as providing a timeline for the arrival of a Messiah.\n \n Only a handful? I am sure you can get more than that to agree it's a time line. Maybe only handful will agree it is a time line that coincides with Jesus (again only Messiah named)\n\n \n That's so you'll know it wasn't just a Christian invention. So now it's you vs. Christians and selected Jewish Rabbis too, including the \"Great Maimonedes.\" \n \n \nInstead of a lengthy explainaition from which you pick and choose what you want to argue, I offer two objections and if you can overcome those then I will provide several more and we can go from there.\n \n The Torah is broken up into 3 parts The Law, The Prophets and The Writings. Jesus claims to have come to fulfill The Law and The Prophets, but Daniel is part of The Writings. Why then do Christians attribute this to Jesus when he doesn't? \n\n \n Tsk, tsk. Another subject you have failed to properly research.\n \n From a prior post:\n \n Was the Book of Daniel originally in the Prophetic Section of the Tanakh? \n \n &#8220;The Book of Daniel would not be out of place in the prophetic section, Joshua, Judges and Kinds are included in the Prophets, and the translators of the Septuagint version of the Jewish Scriptures placed Daniel there also.&#8221; Joseph D. Wilson, &#8220;Did Daniel Write Daniel,&#8221; page 84.\n \n &#8220;&#8230;the present position of the Book (of Daniel) in the Hebrew Canon is not its original position. We have it on the authority of the Jewish historian Josephus that that at the close of the first century A.D. the Canon of the Old Testament books was differently arranged from that at present accepted among the Jews; and it is also evident from the writings of the Early Fathers that a change must have been made in the arrangement of the Jewish Canon between the middle of the third and the end of the fourth century A.D.&#8221; - Charles Boutflower, &#8220;In and Around the Book of Daniel,&#8221; pages 276-277.\n \n Josephus in Contra Apionem 1:8 writes, &#8220;We have but twenty-two (books) containing the history of all time, books that are justly believed in; and of these, five are the books of Moses, which comprise the laws and earliest traditions from the creation of mankind down to his death. From the death of Moses to the reighn of Artaxerxes, King of Persia, successor of Xerxes, the prophets who succeeded Moses wrote the history of the events that occurred in their own time, in thirteen books. The remaining four documents comprise hymns to God and the practical precepts to men.&#8221; \n \n Daniel was included in those 13 books. \n \n Professor R.D. Wilson states: &#8220;All the direct evidence, then, that precedes the year 200 A.D., supports the view that Daniel was in the earliest times among the Prophets&#8230;..Thus Origen, at A.D. 250, and Jerome, at A.D. 400, both of whom were taught by Jewish Rabbis and claim to have gathered their information from Jewish sources, put Daniel among the Prophets and separate the strictly prophetical books from those which are more properly called historical.&#8221; R. D. Wilson, &#8220;Studies in the Book of Daniel,&#8221; page 49.\n \n Next thing you know you'll be claiming that Daniel wasn't regarded as being a prophet.\n \n Regarding your other questions (I stand by the timeline I provided), I recommend you do some research before bouncing out here again with unresearched claims.", 
   {}, 
   385321, 
   null, 
   1263151740.0
  ], 
  [
   385349, 
   null, 
   "pappillion001", 
   "Here's something else you can sweep under the rug.\n \n Until Shiloh Comes\n \n In the 49th chapter of the book of Genesis there is another specific prophecy regarding the time of the Messiah's coming. In verse one we read of the last blessing that Jacob bestowed to his sons. \n \n \"And Jacob called his sons and said, 'Gather together, that I may tell you what shall befall you in the last days'\" Genesis 49:1 (NKJ) \n \n When he had gathered them together he began to prophesy over each of them. When he got to his son Judah, he gave a prophecy concerning the Messiah: \n \n \"The scepter shall not depart from Judah, nor a lawgiver from between his feet, until Shiloh comes; and to him shall be the obedience of the people.\" Genesis 49:10 (NKJ) \n \n Secondly, it is well documented (by Jews also) that the word \"Shiloh\" has been understood for millennia to be an idiom for the Messiah. \n \n When the members of the Sanhedrin found themselves deprived of their right over life and death, a general consternation took possession of them: they covered their heads with ashes, and their bodies with sackcloth, exclaiming: 'Woe unto us for the scepter has departed from Judah and the Messiah has not come'\"9,10,11 (emphasis added) \n \n The scepter was smitten from the hands of the tribe of Judah. The kingdom of Judea, the last remnant of the greatness of Israel, was debased into being merely a part of the province of Syria. \n \n While the Jews wept in the streets of Jerusalem, there was growing up in the city of Nazareth the young son of a Jewish carpenter, Jesus of Nazareth. The inescapable conclusion was that Shiloh had come! Only then was the Scepter removed! \n \n Until Shiloh Comes\n \n The Messiah had to appear before 70 A.D. Even the Jews knew it, as evidenced by their quotes in the link.\n\n \n Only a few problems\n \n The sceptre shall not depart from Judah, nor the ruler's staff from between his feet, until Shiloh comes, and his shall be the obedience of the nations.\n \n Throughout the Hebrew Bible, a sceptre is the emblem of rulership:\n \n Esther 5:2\n \n When the king saw Queen Esther standing in the court, she found favor in his sight and he held out to Esther the golden sceptre that was in his hand, so Esther drew near and touched the top of the sceptre.\n \n Psalms 45:7\n \n Your throne, which is of G--d, shall stand for ever and ever; your royal sceptre is a sceptre of equity.\n \n Isaiah 14:5\n \n The L--rd has broken the staff of the wicked, the sceptre of the rulers....\n \n The verse under discussion foretells that once a descendant of Judah reigns over the kingdom of Judah, all subsequent legally elected Judean kings shall be of this tribe. The fulfillment of this promise began with David, a descendant of Judah:\n \n Numbers 26:20\n \n The sons of Judah according to their families were:...Perez....\n \n Ruth 4:18, 22\n \n Now these are the descendants of Perez....Jesse, the father of David.\n \n Ever since King David, all Judean kings have indeed been of Davidic extraction:\n \n II Chronicles 13:5\n \n Shouldn't you know that the L--rd, G--d of Israel, gave kingship over Israel to David forever, to him and his sons by a covenant of salt?\n \n The Messiah is to be a descendant of David as well, for \"until Shiloh comes\" means \"up to and including Shiloh\" (the Messiah); compare:\n \n Genesis 28:15\n \n Behold, I am with you [Jacob], and will keep you wherever you go, and I will bring you back to this land; for I will not leave you until I have done that which I have spoken of to you.\n \n Deuteronomy 7:24\n \n ...and no man will be able to stand before you until you have destroyed them.\n \n Missionaries claim that a sceptre symbolizes political independence, which they say was lost when the Roman Empire first taxed the Jews in 7 C.E. Jesus is said to have been born about thirteen years prior to this levy. Therefore, they conclude, the sceptre and the ruler's staff did not depart from Judah until the Messiah (i.e., Jesus) came.\n \n But this was not the first time the Jews had been subject to foreign rule. If liberty is really what a sceptre represents, then it was taken away centuries before the common era:\n \n Judges 3:14--15\n \n And the children of Israel served Eglon, the king of Moab, for eighteen years....The children of Israel sent tribute by [Ehud] to Eglon, the king of Moab.\n \n Judges 13:1\n \n And the children of Israel again did what was evil in the sight of the L--rd; and the L--rd delivered them into the hand of the Philistines for forty years.\n \n II Kings 15:29\n \n In the days of Pekah, king of Israel, Tiglath Pileser, king of Assyria, came and captured...and he carried the people away captive to Assyria.\n \n II Kings 25:21\n \n And the king of Babylon smote them and put them to death at Riblah, in the land of Hamath-thus Judah was exiled from its land.\n \n Rather, a sceptre refers exclusively to rulership, not political independence, as seen in the following passage.\n \n You keep asking for examples of verses that have been taken out of context and changed so I thought I would throw in a couple of those as well\n \n II Samuel 5:6--7\n And the king and his men went to Jerusalem against the Jebusites....David took the stronghold of Zion, the same is the city of David.\n \n New Testament Distortion\n \n Luke 2:4--5\n And Joseph also went up from Galilee, from the city of Nazareth, to Judea, to the city of David, which is called Bethlehem, because he was of the house and lineage of David, to be enrolled with Mary, his betrothed wife who was with child.\n \n Jerusalem, not Bethlehem, is called the \"city of David.\" \n \n \n And the children of Israel went into the midst of the sea on dry land; the waters were a wall to them on their right side and on their left.\n \n New Testament Distortion\n \n I Corinthians 10:1\n I want you to know, brethren, that our fathers were all under the cloud, and all passed through the sea, and all were baptized to Moses in the cloud and in the sea....\n \n One is baptized in water, not under a cloud, and the Jews stood on dry land, not in the sea itself.\n \n Galatians 3:16\n Now the promises were made to Abraham and to his seed. It does not say, \"and to his seeds,\" referring to many, but, referring to one, \"and to your seed,\" which is Christ.\n \n The Hebrew word zera (seed) is invariably used in the singular when referring to progeny, whether one person or many are meant. For example, wherever G--d promised to bless Abraham's \"seed,\" his descendants were intended:\n \n Genesis 13:16\n I will make your seed as the dust of the earth; so that if one could count the dust of the earth, then your seed would also be counted.\n \n Genesis 15:13\n Then the L--rd said to Abram: \"Know for sure that your seed will be sojourners in a land that is not theirs, and they will be slaves there, and they will be oppressed for four hundred years.\"\n \n Genesis 26:4\n ...and I will multiply your seed as the stars of heaven, and will give to your seed all these lands...\n \n Genesis 22:17\n ...I will surely bless you, and I will surely multiply your seed as the stars of heaven, and as the sand upon the seashore; and your seed shall possess the gate of their enemies; and through your seed shall all the nations of the earth be blessed, because you have hearkened to My voice.\n \n Deuteronomy 18:15\n \n The L--rd, your G--d, will raise up for you a prophet like me [Moses] from among you, of your brethren; to him you shall hearken....\n \n The New Testament claims that Jesus was this prophet, fraudulently adding:\n \n Acts 3:23\n \n And it shall be that every soul that does not listen to that prophet shall be destroyed from the people.\n \n Yet the verse under discussion refers not to any specific individual, but to future prophets in general. In ancient Israel, a great many men and women strove to be worthy of Divine Inspiration, attending special schools run by acknowledged prophets. The Hebrew Bible calls these students \"prophets\" and \"sons of the prophets\":137\n \n I Samuel 10:10\n \n And when they came to the hill, behold, a company of prophets met [Saul]; and the spirit of G--d came mightily upon him, and he prophesied among them.\n \n II Kings 2:7\n \n And fifty men of the sons of the prophets went and stood at some distance from [Elijah and Elisha] as they both stood by the Jordan.\n \n Amos 2:11\n \n \"And I raised up some of your sons as prophets, and some of your young men as Nazirites-is it not indeed so, O children of Israel?\" says the L--rd.\n \n Naturally, the competition and yearning for Divine communication were so intense that one was liable to wishfully believe oneself a prophet, or to deceitfully pass himself off as such. Consequently, the passage under discussion explains how to recognize a false prophet:\n \n Deuteronomy 18:20\n \n But the prophet who presumes to speak a word in My Name, which I have not commanded him to speak, or who speaks in the name of other gods, that prophet shall die.\n \n Deuteronomy 18:22\n \n When a prophet speaks in the Name of the L--rd, if the word does not come to pass, or come true, it is a word that the L--rd has not spoken; the prophet has spoken it presumptuously, you need not be afraid of him.\n \n Jesus was such a false prophet:\n \n Matthew 16:28\n \n Truly, I say to you, there are some standing here who will not taste death before they see the Son of man coming in his kingdom.\n \n That generation died nineteen centuries ago!\n \n Matthew 12:38--40\n \n Then some of the scribes and Pharisees said to him: \"Teacher, we wish to see a sign from you.\" But he answered them: \"An evil and adulterous generation seeks for a sign; but no sign shall be given to it except the sign of the prophet Jonah. For as Jonah was three days and three nights in the belly of the whale, so will the Son of man be three days and three nights in the heart of the earth.\"\n \n Jesus was \"in the heart of the earth\" for no more than thirty--six hours. He died Friday afternoon and was \"resurrected\" Sunday before dawn. When the women reached his tomb, he was already gone:\n \n Luke 23:54--24:3\n \n It was the day of Preparation, and the Sabbath was beginning. The women who had come with [Jesus] from Galilee followed, and saw the tomb, and how his body was laid; then they returned, and prepared spices and ointments. On the Sabbath they rested according to the commandment. But on the first day of the week, at early dawn, they went to the tomb, taking the spices which they had prepared. And they found the stone rolled away from the tomb, but when they went in they did not find the body.\n \n In fact, in the original Greek, Matthew 28:1 speaks not of \"the first day of the week, at early dawn\" but of \"late on the Sabbath as it was getting dusk, toward the first day of the week....\"138 This would mean that Jesus remained in the cave only from Friday afternoon until Saturday evening at nightfall-a total of about twenty--six hours!\n \n Psalms 16:10\n \n For You will not abandon my soul to the lower world, or allow Your godly one to see destruction.\n \n In this Psalm, King David joyously proclaims his trust in G--d:\n \n Psalms 16:9\n \n Therefore my heart rejoices and my soul is elated; my flesh also will rest assured.\n \n Psalms 16:11\n \n You will reveal to me the path of life; in Your presence there is fullness of joy, and delight at Your right hand forevermore.\n \n Although David is speaking on his own behalf, the New Testament claims that the verse under discussion is prophesying the \"resurrection\" of Jesus from hell (Acts 13:35)!\n \n \n Sorry it is so long but these are all things you have been asking for for awhile so I thought to oblige you.\n \n \n You can see more here\n \n A comprehensive anti-missionary counter-missionary book.", 
   {}, 
   385187, 
   null, 
   1263157560.0
  ], 
  [
   385351, 
   null, 
   "Easyrider", 
   "I'm not going to answer a zillion claims from a spiritually-stunted anti-Christian website. I'll stick with what I presented. \n \n Reread the part about Judah (vs. Israel). You confused those issues.\n \n p.s. What critical Christian person, truth, or event do you think you refuted in all that?", 
   {}, 
   385349, 
   null, 
   1263158100.0
  ], 
  [
   385352, 
   null, 
   "Penfold", 
   "So you have nothing but bluster as usual. How prophetic is that! emoticon_xgood", 
   {}, 
   385351, 
   null, 
   1263158340.0
  ], 
  [
   385356, 
   null, 
   "Easyrider", 
   "Pappilion: When a prophet speaks in the Name of the L--rd, if the word does not come to pass, or come true, it is a word that the L--rd has not spoken; the prophet has spoken it presumptuously, you need not be afraid of him.\n \n Jesus was such a false prophet:\n \n Matthew 16:28\n \n Truly, I say to you, there are some standing here who will not taste death before they see the Son of man coming in his kingdom.\n \n That generation died nineteen centuries ago! (END PAPILLION QUOTES)\n \n <Flush<\n \n \"My kingdom is not of this world. If my kingdom were of this world, my servants would have been fighting..\" John 18:36\n \n In John 3 He says unless one is born again he cannot see the Kingdom of God. \n \n Look further and you'll see Luke 17:20-22, which says that the \"Kingdom of God is within you.\"\n \n What is the Kingdom of God?\n \n \"For the kingdom of God is not a matter of eating and drinking, but of righteousness, peace and joy in the Holy Spirit...\" Romans 14:17\n \n So not only did the disciples see Jesus in his Kingdom with \"righteousness, peace and joy in the Holy Spirit,\" but they also saw him in his Godly resurrected body.\n \n And that website you cut and pasted from has a lot of those horse dung claims. They're liars, spiritually-stunted imbeciles who haven't even read the Bible.\n \n And you bought right into it. Almost every time you post something you get your clock cleaned.", 
   {}, 
   385351, 
   null, 
   1263159120.0
  ], 
  [
   385366, 
   null, 
   "Easyrider", 
   "\n \n And the king of Babylon smote them and put them to death at Riblah, in the land of Hamath-thus Judah was exiled from its land.\n \n Rather, a sceptre refers exclusively to rulership, not political independence, as seen in the following passage.\n\n \n You didn't bother to read the link, I see, which said:\n \n \"During the 70-year Babylonian captivity, from 606-537 B.C., the southern kingdom of Israel, Judah, had lost it's national sovereignty, but retained it's tribal staff or national identity.2 It is very significant that in the book of Ezra we read that during the 70-year Babylonian captivity the Jews still retained their own lawgivers or judges.3 The Jews maintained their identity and judicial authority over their own people even during 70 years of slavery. The scepter had not been lost during the Babylonian captivity.\"", 
   {}, 
   385349, 
   null, 
   1263160440.0
  ], 
  [
   385381, 
   null, 
   "pappillion001", 
   "That's so you'll know it wasn't just a Christian invention. So now it's you vs. Christians and selected Jewish Rabbis too, including the \"Great Maimonedes.\" \n\n \n \n Let me know when you catch one of those straws you are reaching for. The Rabbis you quote say nothing of Jesus being the Messiah they refer to. This is what happens when you have already decided what the words mean.\n \n \n \nTsk, tsk. Another subject you have failed to properly research.\n \n From a prior post:\n \n Was the Book of Daniel originally in the Prophetic Section of the Tanakh? \n \n \"The Book of Daniel would not be out of place in the prophetic section, Joshua, Judges and Kinds are included in the Prophets, and the translators of the Septuagint version of the Jewish Scriptures placed Daniel there also.\" Joseph D. Wilson, \"Did Daniel Write Daniel,\" page 84.\n \n \"...the present position of the Book (of Daniel) in the Hebrew Canon is not its original position. We have it on the authority of the Jewish historian Josephus that that at the close of the first century A.D. the Canon of the Old Testament books was differently arranged from that at present accepted among the Jews; and it is also evident from the writings of the Early Fathers that a change must have been made in the arrangement of the Jewish Canon between the middle of the third and the end of the fourth century A.D.\" - Charles Boutflower, \"In and Around the Book of Daniel,\" pages 276-277.\n \n Josephus in Contra Apionem 1:8 writes, \"We have but twenty-two (books) containing the history of all time, books that are justly believed in; and of these, five are the books of Moses, which comprise the laws and earliest traditions from the creation of mankind down to his death. From the death of Moses to the reighn of Artaxerxes, King of Persia, successor of Xerxes, the prophets who succeeded Moses wrote the history of the events that occurred in their own time, in thirteen books. The remaining four documents comprise hymns to God and the practical precepts to men.\" \n \n Daniel was included in those 13 books. \n \n Professor R.D. Wilson states: \"All the direct evidence, then, that precedes the year 200 A.D., supports the view that Daniel was in the earliest times among the Prophets.....Thus Origen, at A.D. 250, and Jerome, at A.D. 400, both of whom were taught by Jewish Rabbis and claim to have gathered their information from Jewish sources, put Daniel among the Prophets and separate the strictly prophetical books from those which are more properly called historical.\" R. D. Wilson, \"Studies in the Book of Daniel,\" page 49.\n\n \n Tsk Tsk Tsk, you shouldn't keep making things up like you do. Where does Josephus state that that Daniel was in the Prophets? I didn't notice where he listed the names of any books. How did you conclude that Daniel was in the Prophets from Josephus?\n \n That's nice. You have Christians 150 years after the death of Jesus deciding the order of what? Was this for the benefit of the Jewish people that Origen and Jerome were rearranging the order of their sacred texts? Of course not! \n \n Before you go patting yourself on the back perhaps you are the one who should consider looking at more than Christian sources for your biased ill thought out, less than truthful, lacking in common sense responses. \n \n As you may recall this was brought up before but you want to keep using Christian ideas on people who had no idea what a Christian was. Remember anything during or pre Jesus will have to be considered using a Jewish perspective. Jews at the time considered Malachi the last prophet. Prophecy was closed to Jews. Christians can add and delete and shuffle around all they want, but that doesn't make them right and is meaningless as evidence for what 2nd and 1st century BC Jews thought.\n \n Next thing you know you'll be claiming that Daniel wasn't regarded as being a prophet.\n \n Regarding your other questions (I stand by the timeline I provided), I recommend you do some research before bouncing out here again with unresearched claims.[/QUOTE]\n \n \n I have done my research and even applied it correctly. When you do the same then you can use sarcasm, but until then you shouldn't try to walk and chew gum at the same time.\n \n \n ...Of considerable significance, is the fact that the Book of Daniel was never grouped with the Hebrew Nevi'im (the Prophets) but has always belonged to the Ketuvim (the writings). If the author had been accepted to be a sixth century Jew of the Exile his work would have pre-dated Ezra and Nehemiah and would certainly have been considered authoritative enough to group it with the other prophets. [44]\n \n In addition, the canon of the Prophets (Nevi'im) was closed by about 200 BC with the composition of Malachi[45]. The apocryphal book of Sirach, written about 180 BC, contains a long section (chapters 44-50) in praise of \"famous men\" from Jewish history that does not include Daniel. However I Maccabees, composed about 100 BC, repeats much of that list with the addition of Daniel and the three youths in the fiery furnace, leading to the conclusion that these stories were likely added to Hebrew literature sometime after 180 BC.", 
   {
    "unicode_changes_made": true
   }, 
   385330, 
   null, 
   1263166200.0
  ], 
  [
   385386, 
   null, 
   "Easyrider", 
   "Where does Josephus state that that Daniel was in the Prophets? I didn't notice where he listed the names of any books. How did you conclude that Daniel was in the Prophets from Josephus?\n \n ...Of considerable significance, is the fact that the Book of Daniel was never grouped with the Hebrew Nevi'im (the Prophets) but has always belonged to the Ketuvim (the writings). \n\n \n ONCE AGAIN, YOU DIDN'T DO YOUR HOMEWORK.\n \n Against Apion 1:8 (Josephus) also defines which books he viewed as being in the Jewish Scriptures:\n \n \" For we have not an innumerable multitude of books among us, disagreeing from and contradicting one another, [as the Greeks have,] but only twenty-two books, (8) which contain the records of all the past times; which are justly believed to be divine; and of them five belong to Moses, which contain his laws and the traditions of the origin of mankind till his death. This interval of time was little short of three thousand years; but as to the time from the death of Moses till the reign of Artaxerxes king of Persia, who reigned after Xerxes, the prophets, who were after Moses, wrote down what was done in their times in thirteen books. The remaining four books contain hymns to God, and precepts for the conduct of human life...\" [/quote]\n \n Against Apion - Wikipedia, the free encyclopedia\n \n Josephus\n He wrote twenty years before Jamnia and over 300 years before the Talmud's Tractate Baba Bathra which is used to support the theory of the three-part development. \n He had the actual Temple scrolls in his possession as a gift from Titus. We would conclude from these facts that Josephus should be considered more authoritative than the Talmud regarding the first century view of the canon. \n Josephus had the same canon we do. \n He says there were 22 books in the canon of the Old Testament (see \"Against Apion\" 1:8, where he mentions 5 books of Moses, 13 Prophets, and 4 Writings).\n \n - This corresponds to our 39 books. Following typical Jewish tradition, he recognized Jer. and Lam. as one book, as he also did Judges & Ruth, I Sam. & II Sam., I Kings & II Kings, I Chron. & II Chron., and Ezra and Esther. The 12 Minor Prophets were also recognized as one book, called \"The Book of the Twelve.\" \n \n He included Daniel in the Prophets instead of in the Writings, which refutes an important part of the proof used to support the three-part theory, and the late-dating of Daniel. \n \n Josephus also indicates that there was unbroken succession of prophets from Moses to Malachi, and that the histories written since Malachi were not inspired, because there had been no succession of prophets since the time of Malachi. This reflects the consensus in Israel that the Apocraphal books were not canonical. \n The Canonicity Question\n \n And since Daniel is not a book of \"hymns to God\" or \"precepts for the conduct of human life,\" then according to Josephus Daniel had to be in the Prophets (as my other information noted). \n \n You're busted.", 
   {
    "unicode_changes_made": true
   }, 
   385381, 
   null, 
   1263168720.0
  ], 
  [
   385387, 
   null, 
   "Easyrider", 
   "Dating the Authorship of Daniel.\n \n You say 200 B.C.? Ha! \n \n Internal Evidence Supports an Early Writing. There is persuasive evidence that Daniel lived and wrote in the sixth century B.C. and that, therefore, his detailed descriptions of history were supernatural predictions.\n These events are presented as future. Their writing is dated by specific years of the reigns of kings of Babylon and Media-Persia (for example, the opening verses of chapters 2, 7, 9, 10, and 11). They were things that the wisest men in the greatest kingdom on earth could not divine (cf. Dan. 2:1&#8211;13). The text states explicitly that they were about the future, &#8220;what will be in the later days&#8221; (Dan. 2:28; cf. 9:24&#8211;29). It even declares that &#8220;the appointed time was long&#8221; in Daniel 10:1, indicating the distant future. Hence, an attack on the predictive nature of Daniel&#8217;s words is an attack on his character. Yet only Joseph among Old Testament figures shows the impeccable character of Daniel (cf. Dan. 1:4, 8; 6:3). Even his enemies recognized that they could not find fault in his character or dedication (Dan. 6:5).\n The historical parts of Daniel are such clear, detailed, and accurate descriptions of his times as to lend credibility to his discourse when they speak about the future. Daniel&#8217;s clear distinction of the present from the future alone is evidence that he was consciously writing prophecy, not history, in his great visions.\n Before the rise of modern antisupernaturalism, the sixth-century date for Daniel (and, hence, its predictive nature) was not questioned among biblical scholars. Interestingly, it was not discovery of some archaeological or historical fact that led modern scholars after Benedict Spinoza to attribute a second-century date to Daniel. Rather, the (unproved) philosophical presupposition of antisupernaturalism led them to assume a late date (see MIRACLE; MIRACLES, ALLEGED IMPOSSIBILITY OF).\n That Daniel&#8217;s prophecies were postdated in historical accounts shows his accuracy. Otherwise, why all the effort on the part of those who reject the supernatural origin of his prophecies to date them after the time in which events actually occurred?\n Witnesses Support an Early Writing. Josephus (see FLAVIUS JOSEPHUS), a Jewish historian from the time of Christ, listed Daniel among the Prophets (the second section of the Jewish Old Testament), not among the Writings (the third and last section). At that date, then, Daniel was considered a prophet, not a historian. Also, the Prophets were considered to be older. Indeed, one reason for the late dating of Daniel is that it was listed among the Writings in the later Jewish Talmud (A.D. 400). However, the normal Old Testament division by later Jewish scholars was the Law and the Prophets (see Dan. 9:2, 11&#8211;13; Zech. 7:12; Matt. 5:17; Luke 24:27). The unconventional Talmud listing may have been designed for liturgical, topical, or literary uses (see Geisler, chap. 14).\n Jesus confirmed that Daniel was a prophet. In fact, Jesus used the example of a prediction made by Daniel that was yet future in Jesus&#8217; day. Looking ahead to the coming destruction of Jerusalem and the temple by the Roman army of Titus, Jesus referred to abomination that causes desolation,&#8221; which would be standing in the holy place of the temple (Matt. 24:15). And there is strong historical evidence that the Synoptic Gospels were written before A.D. 70 (see ACTS, HISTORICITY OF; BIBLE CRITICISM; NEW TESTAMENT, HISTORICITY OF). The evidence supports Jesus&#8217; claim to be the Son of God. Such an intertwining of prophetic credentials means that to deny the predictive nature of Daniel&#8217;s prophecies is a step toward denial of the deity of Christ (see CHRIST, DEITY OF).\n Dead Sea manuscripts support an early Daniel. A fragment of Daniel from possibly the second century B.C. was found among the Dead Sea scrolls at Qumran. Since this was only a copy, it would place the book earlier.\n Daniel the man is mentioned in Ezekiel 14:14, 20; 28:3. Even critics recognize Ezekiel as contemporary with the sixth century. But if the only Daniel the prophet known in Old Testament times came from the sixth century, there is no reason to reject his prophecies as coming from this period as well. This is particularly true in view of the vivid, firsthand, eyewitness nature of the book.\n The Jewish Talmud attributes the book of Daniel to the prophet Daniel who lived in the sixth century B.C. This lends the support of later Jewish scholars.\n Even a Late Daniel Accurately Predicted. Even a late date of about 170 B.C. would make some of Daniel&#8217;s predictions still future and supernaturally accurate. Some of his most sensational predictions were fulfilled at the time of Christ. Daniel 9:24&#8211;27 predicted that Christ would die, having made &#8220;reconciliation for iniquity&#8221; and having brought in &#8220;everlasting righteousness&#8221; some 483 years after 444 B.C. According to the Jewish lunar year of 360 days there are exactly 483 between 444 B.C. and 33 A.D. For added to the 477 lunar years (444 + 33) must be another six years (= 483). There are five more days (365) in an actual year than in a lunar year (360). And five days times 477 is 2385 days. That adds up to another six and one-half years (see HOEHNER, X).\n Objections to a Predictive Daniel. Jewish Scripture Lists Daniel as a &#8220;Writing.&#8221; Why, critics ask, if Daniel was a prophet, is his book not listed among the Prophets in the Jewish Bible but only later among the Writings? As noted above, this was a late decision, about A.D. 400 Daniel was originally listed among the Prophets. In the first century A.D., the Jewish historian Josephus listed Daniel among the prophets (Against Apion 1.8). In the later division of the Prophets into Prophets and Writings it was understandable that Daniel would fit in the Writings. Chapters 1 through 6 contains much history. Also, Daniel was a prophet by gift but not office, since he had a significant political role to play in the Babylonian government.\n The Theology Is Too Highly Developed. Some critics assert that Daniel could not have written in the sixth century because the book&#8217;s highly developed view of angels, the Messiah, the resurrection, and the final judgment are known to exist only in a later period.\n This argument begs the question. If Daniel is an earlier book, then Daniel is proof that this &#8220;highly developed&#8221; theology existed at that time. Job and Isaiah are earlier books, and they refer to the resurrection (Job 19:25, 26; Isa. 26:19). Both Malachi and Zechariah were written before the second century, and they refer to the Messiah (Zech. 3:1; 6:12; Mal. 3:1; 4:2). Angels are prominent in Genesis (see chaps. 18, 19, 28) and throughout Zechariah.\n Daniel Allegedly Erred. Some critics charge that the book makes historical errors. This argument shows that what is actually in dispute is not the dating of Daniel, but the divine inspiration of Scripture. It would make more sense if an early Daniel would be historically inaccurate. A later writer would know what happened.\n However, none of the errors charged to Daniel has stood (see Archer, 380&#8211;93). For example, according to Daniel 5:31, the kingdom of Belshazzar fell to an invading army, and &#8220;Darius the Mede&#8221; became king. However, modern scholars have found no mention of such a person in ancient documents. Some modern scholars claim that the author of Daniel mistakenly thought that the Medes, rather than the Persians, conquered Babylon. They claim that this author confused Darius I, king of Persia (521&#8211;486 B.C.), with the conqueror of Babylon and identified this figure as Darius the Mede. This, they charged, appears to be an error in Daniel&#8217;s account.\n Modern archaeological evidence (see ARCHAEOLOGY, OLD TESTAMENT) shows that Darius the Mede could easily have been a different person than Darius I of Persia. Two men equally fit Daniel&#8217;s references. Cyrus the Great, who ruled a united Medo-Persian empire, may well have been from the Median side of this alliance and could have been known outside official communications as Darius the Mede. That Daniel identifies this Darius as Median fits the Persian context where that would have been noteworthy.\n A better candidate who has turned up in cuneiform texts is Gubaru, who was appointed by Cyrus to be governor over all of Babylonia. The common practice in Babylonian and Persian aristocracy, particularly for emigrants, was for private names to reflect an individual&#8217;s background and family, while an official name represented political realities of the person&#8217;s new allegiances. Daniel was known in his official capacities as Belteshazzar (Dan. 1:7). Shadrach, Meshach, and Abed-nego were Babylonian names for the Hebrew men Hananiah, Mishael, and Azariah.\n In the article &#8220;Daniel in the Historians&#8217; Den,&#8221; William Sierichs, Jr. affirms that Belshazzar was not the &#8220;son&#8221; of Nebuchadnezzar, and &#8220;Belshazzar was not the ruler as the Book of Daniel claims, and he was never king&#8221; (TSR, vol. 7.4, p. 8). But even the radical critic Dr. Philip R. Davies has admitted that both are &#8220;weak arguments&#8221; (Philip R. Davies, Daniel [Sheffield: JSOT Press, 1985], p. 31). He wrote:\n Critical commentaries, especially around the turn of the century, made much of the fact that Belshazzar was neither a son of Nebuchadnezzar nor king of Babylon. This is still sometimes repeated as a charge against the historicity of Daniel, and resisted by conservative scholars. But it has been clear since 1924 (J.. A. Montgomery, Daniel, International Critical Commentary [Edinburgh: T and T Clark/New York: C. Scribner&#8217;s Sons, 1927], pp. 66&#8211;67) that although Nabonidus was the last king of the Neo-Babylonian dynasty, Belshazzar was effectively ruling Babylon. In this respect, then, Daniel is correct. The literal meaning of &#8216;son&#8217; should not be pressed. . .&#8221; (pp. 30&#8211;31).\n Daniel&#8217;s Vocabulary is From a Later Period. Linguistic critics find terms in Daniel that supposedly were not in use until the second century B.C. It is alleged that such words as harp, sackbut, and psaltery originated in the later Maccabean period (second century B.C.) and not the sixth century. Old Testament scholar R. K. Harrison observes that &#8220;this argument no longer constitutes a problem in the criticism of the book, because as [William F.] Albright has shown, it is now well recognized that Greek culture had penetrated the Near East long before the Neo-Babylonian period&#8221; (Harrison, 1126). Further, this argument is logically a fallacy from ignorance. Just because a word is not known to have been used at any earlier period doesn&#8217;t mean it was not, unless we have omniscience about language use throughout a past society. And as more is known linguistically about ancient cultures, scholars are finding evidence of earlier usage (see Archer, 380&#8211;93).\n Conclusion. There is strong evidence that Daniel&#8217;s predictions come from the sixth century B.C., making them amazing predictions of the course of history from Babylon through Medo-Persia, Greece and Rome to after the time of Christ. Critics gain nothing by postdating Daniel. Their latest date still demands that Daniel wrote outstanding examples of supernatural predictive prophecy (Daniel 9). If those are true prophecies, why not the others?\n Sources\n G. L. Archer, Jr., A Survey of Old Testament Introduction\n &#8212;&#8212;&#8212;, An Encyclopedia of Biblical Difficulties\n N. L. Geisler, A Popular Survey of the Old Testament\n &#8212;&#8212;&#8212; and T. Howe, When Critics Ask\n H. Hoehner, Chronological Aspects of the Life of Christ\n R. K. Harrison, Introduction to the Old Testament\n J. McDowell, Daniel in the Critics Den\n J. Whitecomb, Darius the Mede\n \n Source: Baker Encyclopedia of Christian Apologetics\n \n By the way, Moses wasn't listed in the \"Prophets\" section either, and he was a prophet. So it wasn't a criteria that only prophets were included in the \"Prophets\".", 
   {}, 
   385386, 
   null, 
   1263169020.0
  ], 
  [
   385388, 
   null, 
   "Easyrider", 
   "What the critics have to believe if Daniel didn&#8217;t write the Book of Daniel\n \n &#8220;The (critics of Daniel) cannot believe in miracles and predictive prophecy which involve nothing but a simple faith in a wise and mighty and merciful God intervening in behalf of his people for his own glory and their salvation; BUT THEY (critics) CAN BELIEVE that a lot of obstreperous and cantankerous Jews who through all their history from Jacob and Esau down to the present time have disagreed and quarreled about almost everything, or nothing, could have accepted, unanimously and without a murmur, in an age when they were enlightened by the brilliant light of Plato&#8217;s philosophy, and Aristotle&#8217;s logic, and the criticism of the schools of Alexandria, a forged and ficticious document, untrue to the well remembered facts of their own experience and to the easily ascertained facts concerning their own past history and the history of the Babylonians, Medes, Persians, and Greeks of whom the author (of the book of Daniel) writes.\" R.D. Wilson, Studies in the Book of Daniel, pages 268, 269\n \n &#8220;The Sanhedrin of the second century B.C. was composed of men of the type of John Hyrcanus; men famed for their piety and learning; men who were heirs of all the proud traditions of the Jewish faith, and themselves the sons of successors of the heroes of the noble Maccabean revolt. And yet we are asked to believe (by the critics of Daniel) that these men, with their extremely strict views of inspiration and their intense reverence of for their sacred writings&#8230;.used their authority to smuggle into the Jewish Canon a book which, ex hypothesi, was a forgery, a literary fraud, and a religious novel of recent date.&#8221; R. Anderson, Daniel in the Critics Den, pages 104-105\n \n Pappillion, O ye of GREAT FAITH!", 
   {}, 
   385387, 
   null, 
   1263169200.0
  ], 
  [
   385389, 
   null, 
   "Easyrider", 
   "Points and Questions Pappillion has to answer in order to try and salvage his late dating (200 BC) of Daniel:\n \n The Date of the Book of Daniel\n \n 1) If Antiochus seems to fulfill the prophecies recorded in 8:8-12 then why is there is no evidence that he fulfilled vs 9 and 12? See also the lack of fulfillment of 11:36-45. Both Daniel 8:9-12 and 11:36-45 deal with the blasphemous character of the king of the north which go far beyond anything that we know about Antiochus. He never destroyed the temple (see Dan. 8:11) and his military accomplishments hardly match those \"recorded\" in 8:9, 12 and 11:22. And while verse 37 states that \"neither shall he regard the God of his fathers\" it is \"attested by Polybius and Livy [as being] the very opposite of his character. For he was more zealous in their worship, than any of the kings before him.\" [Pusey, 137] Even Towner notes that from 11:39 onwards Daniel does not fit with anything we know about Antiochus IV. [page 151--this is really disconcerting, to say the least, to the Maccabean hypothesis considering that the \"predicted end of Antiochus differs from the stories of his death in I and II Maccabees ...\" [William H. Brownlee, The Meaning of the Qumran Scrolls for the Bible. (Oxford, 1964): 35-6; Waltke (1976): 322; Baldwin (1978a)\n \n If Daniel was written as late as is claimed then how did he know of details about Babylon that had been lost within a half-century of its fall to Cyrus in 539 B.C. (Xerxes having destroyed its palaces, walls, and temples in 480 B.C.)? The typical Daniel, critic ignores this point.\n \n 17) Again, if the book was written during the Maccabean era to meet the current needs then why does so little of the book reflect the events that are recorded in 1 and 2 Maccabees? Why is there no call to arms? Why the silence concerning the revolt, its leaders, and heroes? This is especially surprising since the uprising began in 168 B.C.! [contra Graubart, 260; notice also that the book doesn't mention the asphyxiation of a thousand devout Jews (Hasidim) by Antiochus' troops in their desert caves--Trever, 89]\n \n 21) If the book was written under the Hellenizer Antiochus why is there so few Greek words in the text? To state it another way: if the book was written during a time of such intensive and extensive Greek influence then why are there *only* 3 Greek words in the entire text?[contra Lenormant who claims the book is \"interspersed .. in various places with Greek words\". cited by Montgomery, 74] In fact, Yamauchi and Boutflower are surprised \"that there are not more Greek words\" in this document if it was indeed written in the Maccabean age--note the deep influence of Greek culture and customs on the Books of Maccabees; and yet we see none of this in Daniel! [Edwin M. Yamauchi, Greece and Babylon. (Baker, 1967): 94; cited by Waltke (1976): 325; Emery, 21; Boutflower, 246] Baldwin points out that \"the fact that no more than three Greek words occur in the Aramaic of Daniel (and these are technical terms) argues against a second-century date for the writing of the book.\" [Baldwin (1978a): 34] This fact, as noted by Boutflower (page 246), is especially relevant in comparison with the 19 Persian loan words that are present in the text. Why should an older language assume such prominence in this work? This is the opposite of what we should expect given the normal custom of the ANE (or anywhere else for that matter). As Kitchen, professor of Egyptology at the University of Liverpool, notes: \"In Ancient Near Eastern literature, a later writer tends to deck his description of an earlier period with trappings of his *own* time, while retaining archaic features that have survived.\" [emphasis mine, Kitchen (1965): 49] \n \n It used to be claimed that the presence of these Greek words meant that the book was a late composition. For instance, the absence of Greek words was one of the details that led Driver to claim that \"... the Greek words demand ... a date after the conquest of Palestine by Alexander the Great (B.C. 332).\" [Driver, An Introduction to the Old Testament. (T. & T. Clark, 1898): 476, emphasis his; see also Acquistapace, 142; Larue (405) echoes Driver's remark without providing any support for it] Unfortunately, for the critics, the presence of Greek words has long been demonstrated by \"an avalanche of evidence\" to have entered into \"the Semitic milieu long before the sixth century B.C.\" [Vasholz, 316; Kitchen (1965): 44-48, Archer (1985): 21; McDowell, 98-102\n \n 23) If the book of Daniel was written in Palestine after a period of 160 years of influence and control by the Greeks then why didn't the writer use more Greek terms \"pertaining to government and administration\" rather than use long-forgotten Persian words -- and how did the author know these words? \n \n 24) In terms of the Aramaic of the text it has been concluded that the book could _*NOT*_ have been written *later than* 300 B.C.. [See the book review of Klaus Koch's Das Buch Daniel by Arthur Ferch in the Journal for the Study of the Old Testament, 23 (July 1982): 119-123] Stefanovic studied Old Aramaic inscriptions from the ninth to the seventh centuries B.C. and found significant similarity to the Aramaic used in Daniel. [Zdravko Stefanovic, Correlations between Old Aramaic Inscriptions and the Aramaic Section of Daniel. Ph.D. dissertation, Andrews University, 1987] \n \n 25) Koch also points out that the vocalization of the Aramaic of Daniel appears to be of Eastern type and the general context and royal figures point to the east. [See Koch's book, page 47] Also the famous Aramaic scholar E. Y. Kutscher has shown that the Aramaic of Daniel points to an Eastern origin. [Kutscher, 400; cited by Hasel, (1981): 219 and (1986): 132] A Western origin would be required if the Maccabean thesis were correct. This factor alone strongly suggests that a Maccabean source for the book is in error. \n \n 28) A \"linguistic analysis indicates that in morphology, vocabulary, and syntax\" of the Aramaic of Daniel is considerably earlier (on the order of several centuries) than that of Genesis Apocryphon (1QapGen) and the Targum of Job (11QtgJob) which date from either the late 3rd or 2nd century B.C.. [Archer (1985): 23 and (1974) 471; see also Vasholz, (Dec 1978): 315-321; and his Ph.D. dissertation A Philological Comparison of the Qumran Job Targum and its Implications for the Dating of Daniel. (Univ. of Stellenbosch, 1976); and his \"The Aramaic of the 'Genesis Apocryphon' Compared with the Aramaic of Daniel,\" New Perspectives on the Old Testament. Edited by J. B. Payne (1970): 160-169; Kutscher, \"The Language of the 'Genesis Apocryphon,'\" Aspects of the Dead Sea Scrolls. 2nd edition, (1965): 1-35; Kutscher, \"Dating the Language of the Genesis Apocryphon,\" Journal of Biblical Literature, vol. 76 (1957): 288-92. More information on the Job Targum can be found in: T. Muraoka, \"The Aramaic of the Old Targum of Job From Qumran Cave XI,\" Journal of Jewish Studies, vol 25 (1974) and S. A. Kaufman, \"The Job Targum From Qumran,\" JAOS vol 93 (1973)] Collins notes that the Aramaic of the Qumran community was only in use between 200 B.C. and 200 A.D.\". Therefore, since the Aramaic of Daniel is several centuries older than that of the Qumran community then Daniel had to have been written around 600-400 B.C..\n \n Vasholz concludes that \"the evidence now available from Qumran indicates a pre-second century date for the Aramaic of Daniel.\" One piece of evidence he points to is that of the spelling of the name of Darius. In Biblical Aramaic it is Dryw which agrees with the Meissner contract from 515 B.C. and the earliest Aramaic papyri (494 B.C.; whereas, in later times the name was spelt with a He (Dryhw). [page 320] On this Kitchen notes that if Daniel and Ezra were written in the late sixth to mid-fifth centuries then their preservation of the earlier form is understandable; but, if it was written \"in the third century BC of later, then their failure use the form with the h -- in constant use for a century by then (c. 420-330 BC) -- is quite incomprehensible.\" [Kitchen (1965): 59-60, emphasis mine] \n \n In fact, J. A. Montgomery points out that the \"the very language of the story [of Daniel (4:30)] is reminiscent of the Akkadian\" found on the Grotefend Cylinder. [\"The Book of Daniel,\" ICC. Vol. 23 (1927): 243] The point here is that in the Akkadian \"the verb normally falls at or near the end of the sentence\" whereas in the normal Aramaic of Palestine it would not. [Kitchen (1965): 76] This point \"proves that the Aramaic of Daniel (and Ezra) belongs to the early tradition of Imperial Aramaic (seventh-sixth to fourth centuries BC) as opposed to later and local Palestinian derivatives of Imperial Aramaic ...\" [Kitchen (1965): 76; Soggin, 409] \n \n Kutscher has also compared the Aramaic of Daniel with that found in the 5th century Elephantine papyri and found that it is contemporary with the Aramaic of Daniel although it is different in terms of spelling conventions. [See his article \"The Hermopolis Papyri,\" Israel Oriental Studies (1971): 103-119; see also W. St. Clair Tisdall, \"Egypt and the Book of Daniel--Or What Say the Papyri?\" Expositor 22:2 (Nov 1921): 340-57; contra EBD, 258] Vasholz notes the \"general consensus among the scholars\" about the proximity of the Aramaic in Daniel with that of Ezra and the Elephantine papyri. [contra Hartman and DiLella, 408 who claimed that the Aramaic of Daniel \"is certainly later than the Aramaic of the Elephantine papyri\"] In his footnote for this Vasholz cites G. Fohrer [Introduction to the Old Testament. Translated by D. E. Green (Abingdon, 1968) page 473 who \"states that the language of Daniel is Imperial Aramaic.\" [page 317, note 9; see also Davies (1988): 37] Collins has also pointed out the \"essential similarity of the Aramaic of Daniel to that of Ezra\".\n \n 34) If Daniel originated in Palestine in the 2nd century B.C. as alleged then why doesn't the language of the book reflect the Hebrew that was common at that time--i.e., as reflected in the Qumran scrolls? [Goldingay, xxv] Distinct differences have been noted and it has been shown that the Qumran documents have none of the distinct characteristics of the Hebrew chapters in Daniel. [For a detailed presentation see Archer (1974): 470-481] Archer concludes that \"in the areas of syntax, word order, morphology, vocabulary, spelling, and word-usage, there is absolutely no possibility of regarding Daniel as contemporary\" [to other second century documents]. He submits that \"centuries must have intervened between them.\" \n These findings mean that the Aramaic documents from Qumran *require* that Daniel was written far earlier than the Maccabean thesis allows and that the book was *not* written in Palestine.\n \n 40) After examining all of the linguistic indicators Kitchen concludes: \"One would--on the Greek and Persian evidence ...--prefer to put the Aramaic of Daniel in the late sixth, the fifth, or the fourth centuries BC, not the third or second. The latter is not ruled out, but is much less realistic and not so favoured by the facts as was once imagined.\" [Kitchen (1965): 50; cited by Baldwin (1978a): 34] Boutflower, page 257, reports that R. D. Wilson studied the composition of the various words found in Daniel in his article \"The Aramaic of Daniel,\" for Biblical and Theological Studies. (Princeton, 1912). Wilson then concluded, on page 304: \"we are abundantly justified in concluding that the dialect of Daniel, containing as it does so many Persian, Hebrew, and Babylonian elements, and so few Greek words, with not one Egyptian, Latin, or Arabic word, and being so nearly allied in grammatical form and structure to the older Aramaic dialects and in its conglomerate vocabulary to the dialects of Ezra and Egypto-Aramaic, must have been used at or near Babylon at a time not long after the founding of the Persian empire.\" \n \n 43) Harrison contends that a Maccabean dating for Daniel would not have left sufficient \"time for a Maccabean-era composition to be circulated, venerated, and accepted as canonical Scripture by a Maccabean sect.\" [Harrison (1969): 1127; Wegner, 115-6; Hill and Walton, 350--Walton refers the reader to D. W. Gooding, 73-4 to see this argument in detail] \n \n 48) R. D. Wilson did a study of Hebrew, Aramaic, and Greek lists of the canon and he found that they consistently placed Daniel among the \"Prophets\". [\"The Aramaic of Daniel,\" Biblical and Theological Studies. (Princeton, 1912): 9-64. Wilson also found that the Aramaic was of an Eastern type of the 6th century B.C..] It was in the post-Christian era (i.e. 2nd century A.D.) that Daniel was moved from the \"Prophets\" to the \"Writings\" [See also Audet, 145-6, 150; cited by Koch, Das Buch Daniel, 29 and (1985): 123] Barnes says that the change was because Daniel was being used by the Christians \"in their arguments against the Jews, to prove the Jesus was the Messiah.\" [Barnes, 40] \n \n 49) \"It is incontestably clear that the people of Qumran regarded Daniel as a prophet. In 4Q174 2:3 we read ['s]r ktwb bspr dny'l hnby' (\"[whi]ch is written in the book of Daniel the prophet the\"). The passage, called a florilegium by J. M. Allegro, contains a quotation from Dan. 11:32 and 12:10.\" [Yamauchi (March 1980): 14] The book of Daniel is seen with the same level of respect as the books of Isaiah and Ezekial. [Published by J. M. Allegro and A. A. Anderson, Discoveries in the Judean Desert of Jordan.\n \n 52) \"Daniel is included among the Major Prophets by the LXX [translated 285/2 - 246 B.C.] and the other early versions.\" [Archer (1985): 7] Collins agrees that the book of Daniel was \"classified with the Major Prophets in the LXX. [Collins (1992): 31; it is interesting to note that some critics never mention this fact, see, for instance, Dummelow, 529] Waltke points out that: \"According to the general consensus, the Prophets were translated before the end of the third century B.C. ...\" [Waltke (1979): 220;\n \n Once again, YOU HAVEN'T DONE YOUR HOMEWORK!\n \n Answer the points and questions now?", 
   {}, 
   385388, 
   null, 
   1263169380.0
  ], 
  [
   385394, 
   null, 
   "trebor", 
   "Uh , Mr Easyrider sir, you have not been doing your homework either.\n \n \n Daniel, Book of\n \n \n\n Daniel B is in its entirety a product of the reign of Antiochus IV, but it is not all from a single hand. It is the work of four apocalyptists, who have been designated as Apoc I, Apoc II, Apoc III, and Apoc IV. Apoc I comprises all of chapter 7 minus the verses and clauses which speak of an eleventh horn and an eleventh king (namely 8, 11a [minus &#1489;&#1468;&#1461;&#1488;&#1491;&#1463;&#1497;&#1460;&#1503; plus &#1495;&#1464;&#1494;&#1461;&#1492; &#1492;&#1458;&#1493;&#1461;&#1497;&#1514; &#1506;&#1463;&#1491; &#1491;&#1468;&#1460;&#1497;], 11b, 20 [from &#1493;&#1456;&#1488;&#1464;&#1495;&#1459;&#1512;&#1460;&#1497; on], 22, 24b&#8211;25). This apocalypse represents an updating of the dream and interpretation in chapter 2. For it, the fourth kingdom is not (as in ch. 2) the Greek kingdom (it is too far removed from the time when there was a single Greek kingdom either in fact or in theory), but the Seleucid kingdom. For it says of the fourth kingdom (24a), \"And the ten horns &#8211; ten kings will arise from that kingdom.\" The Seleucids regarded themselves as the legitimate successors of Alexander the Great, and Berosus, a subject of Antiochus I, notes that the latter is the third king after Alexander. For him to be the third, one of the joint kings who was recognized by the generals after Alexander's death &#8211; his half brother Philip and his posthumous son Alexander &#8211; must be disregarded; probably it was Philip, who died some years before Seleucus returned to Babylon, unlike Alexander, who lived to about that date, so that Seleucus could be regarded as his successor. The first ten kings of Asia, were then, according to the Seleucid canon: (1) Alexander I; (2) Alexander II; (3) Seleucus I; (4) Antiochus I; (5) Antiochus II; (6) Seleucus II; (7) Seleucus III; (8) Antiochus III; (9) Seleucus IV; and (10) Antiochus IV. There is now available a Seleucid king list from Babylonia, which apparently counts no king at all from Alexander's death to the accession of Alexander II in 317 (see Pritchard, Texts3, 567). The essential message of Apoc I is therefore this: The days of the wicked Seleucid kingdom are numbered; its present sovereign shall be its last. Yet Apoc I does not enlarge upon the wickedness of this particular king or hint at what his wickedness consisted of. This would hardly be conceivable after the paganization of the Temple and the outlawing of Judaism, which threatened it with early extinction. It would be conceivable, however, at any time from the beginning of Antiochus IV's reign, when he began to sell the high priesthood to the highest bidder and to encourage Hellenization, through the year 169 when he plundered the Temple down to the year 168 when he crushed a Jewish rebellion and abolished the temple state of Jerusalem, and established a pagan polis on the Akra and gave it control of the Temple. In fact its terminus ante quem is the paganization of the Temple and the proscription of Judaism at the very end of the year 167. After the latter developments, on the other hand, the absence of a specific allusion to them would be incomprehensible. That is why the author of the secondary matter (see above) in the chapter &#8211; who probably did not know the Seleucid king list &#8211; could not imagine that Antiochus IV was included among the ten kings of the original text and so added an eleventh. It is the author of Apoc IV who made all these additions (except perhaps verses 21&#8211;22, which may be from a still later hand), which we therefore designate by the siglum I&#8211;4. (For further characteristics of Apoc I, see above, the first paragraph under the heading \"Daniel B.\") Apoc II comprises the original matter in chapter 8, the secondary verses being 13&#8211;14, 16, 18&#8211;19, 26a, 27b. Verses 18&#8211;19 are from the author of Apoc III and are designated by the siglum II&#8211;3; the remaining interpolations are by the author of Apoc IV and are designated by the siglum II&#8211;4. Apoc II was written after the appalling developments of December 167, which it clearly reflects and the end of whose author it predicts. It adopts the form of a vision instead of a dream because the Hebrew word for \"vision\" (&#7717;azon) is the one used in the sense of \"prediction\" in Habakkuk 2:3, and the author wishes to stress that his &#7717;azon is, like Habakkuk's, for a future date (8:17). To Habakkuk, this circumstance is offered as a reason for the divine command to write down the &#7717;azon; in Apoc II it is further stressed that the future date in question is distant, and this, i.e., the fact that the &#7717;azon has no message for Daniel's contemporaries, is the reason which is given to Daniel (8:26) for the angel's instruction to \"conceal\" (to be discovered and opened in due course). Apoc III is the original part of chapters 10&#8211;12. Within this Apoc IV has transposed the two half verses 10:21b and 10:21a, and added 11:1&#8211;2a, 12:5&#8211;9, and 11&#8211;12 (unless, as is probable, verse 12 is still later). It is Apoc III who is the first to dispense with symbolic dreams or visions and to substitute a simple narration of future history by an angel who draws from memory upon \"that which is inscribed in the Book of Truth\" (10:21). Apoc III, like Apoc II, utilizes Habakkuk 2:3, but he departs further from its original sense. What he stresses is that more &#7717;azon (by which he means scheduled events) has yet to elapse until the final redemption (10:14; 11:27), and he has even inserted a remark to that effect in the work of Apoc II (8:19 with 8:18; cf. 10:9). But Apoc III is particularly noteworthy for identifying, on the one hand, the Assyria of Numbers 24:24 and of Isaiah's prophecies with the Seleucid Empire, and the impious Assyrian king of Isaiah with Antiochus IV Epiphanes; and, on the other hand, as follows: (a) the servant of Isaiah 52:13&#8211;53:12 with those who, during the Epiphanian persecution, instructed (it is thus that he interprets the yaskil of Isa. 52:13) the not willingly apostate but despairing masses in the meaning of the ancient prophecies, thereby encouraging them to resist, or \"justifying\" them; (b) \"the many\" of Isaiah 52 with those despairing masses in Daniel 11:33&#8211;34 (the last word is to be deleted as a variant of the similar one in verse 32) and 12:3; and (c) the willing Hellenizers with the wicked of Isaiah 66:24 (Dan. 11:32; 12:2; note the word &#1491;&#1468;&#1461;&#1512;&#1464;&#1488;&#1493;&#1465;&#1503;, which is confined to Isa. 66:24 and Dan. 12:2). Because Isaiah represents Assyria as the staff of the Lord's indignation and as destined to oppress Judah until the indignation has spent itself, Apoc III not only employs the same language about Antiochus (cf. notably 11:36b with Isa. 10:23, 25) but infers from Isaiah 26:19ff. that the end of the indignation will be followed by a resurrection of some of the dead (Dan. 12:2) &#8211; the earliest formulation of a doctrine of resurrection. Since Apoc III knows nothing of Antiochus' departure for the East in the summer of 165 and expects instead a third expedition against Egypt, the summer of 165 is its terminus ante quem. Apoc IV, finally, is chapter 9. Its contribution (see above Daniel B) is the scheme of weeks of years, with the outlawing of Judaism falling in the middle of the last week. Apoc IV has interpolated this view into each of its three predecessors (7:26ff.; 8:14; 12:7, 11[12]). In the course of his interpolation in Apoc I, the author of Apoc IV betrays the fact that he postdates the expedition, in the summer of 165, to the East, which added Artaxias of Armenia to the two kings of Egypt whom Antiochus had defeated in 169 and 168 (7:24ff.). On the other hand, he does not know of the king's proclamation of amnesty in the winter of 164, still less of the rededication of the Temple in December 164 and of the king's death in the spring of 163; he therefore antedates these.\n \n", 
   {}, 
   385389, 
   null, 
   1263171600.0
  ], 
  [
   385400, 
   null, 
   "Easyrider", 
   "You didn't answer the questions either, Trebor. Never could. Nor can you document your theological beliefs because you can't defend them.\n \n The Rabbis on Daniel\n \n Rabbi Judah, the main compiler of the Talmud said regarding the times referred to in Daniel&#8217;s (Messianic) prophecy, \"These times were over long ago.\" (Babylonian Talmud Sanhedrin.) \n \n In the 12th Century AD, Rabbi Moses Ben Maimon (Maimonides), one of the most respected rabbis in history, stated: \n \n \"Daniel has elucidated to us the knowledge of the end times. However, since they are secret, the wise [rabbis] have barred the calculation of the days of Messiah&#8217;s coming so that the untutored populace will not be led astray when they see that the End Times have already come but there is no sign of the Messiah.\"\n \n Rabbi Moses Abraham Levi said, \"I have examined and searched all the Holy Scriptures and have not found the time for the coming of Messiah clearly fixed, except in the words of Gabriel to the prophet Daniel, which are written in the 9th chapter of the prophecy of Daniel.\" \n \n From Maimonede&#8217;s Sixth Principle of Faith: \n \n \"Third, when a prophet receives prophecy, even though it was only a vision and by means of an angel, he would nevertheless be weakened by it and his body would shudder. He would be stricken with a very great fear almost to the point that his spirit would leave his body, as Daniel said when [the angel] Gavriel (Gabriel) spoke to him, \"No strength remained in me; my robustness changed to pallor, and I could retain no strength... and I was in a deep sleep upon my face, and my face was to the ground\". And as he says later, \"during the vision my joints shuddered and I could retain no strength\". (Daniel 10:8-9, 16). But Moshe, may he rest in peace, was not so, rather, the word came to him and he did not experience trembling and shivering in any way, as it says, \"And HaShem spoke to Moshe face to face, as a man speaks to his friend\" (Shemos [Exodus] 33:11). In other words, just as a man does not experience trembling from the speech of his fellow, Moshe did not tremble from the word even though it was face to face. This was due to his total attachment to the intellect, as we said earlier.\" \n \n The &#8220;Prophet Daniel&#8221; found in the Dead Sea Scrolls:\n \n &#8220;Comment: It is interesting to note that every chapter of Daniel is represented in these manuscripts, except for Dan 12. However, this does not mean that the Book lacked the final chapter at Qumran, since Dan 12:10 is quoted in the Florilegium (4Q174) - (Dead Sea Scrolls), which explicitly tells us that &#8216;it is written in the Book of Daniel the Prophet.&#8217; \n \n Jesus confirms Daniel is a Prophet\n \n The Lord Jesus Christ spoke of Daniel \"the prophet\" (Matthew 24:15; Mark 13:14). \n \n Alexander the Great and Daniel\n \n JOSEPHUS [Antiquities, 11.8.5] mentions that Alexander the Great had designed to punish the Jews for their fidelity to Darius, but that Jaddua (332 B.C.), the high priest, met him at the head of a procession and averted his wrath by showing him Daniel's prophecy that a Grecian monarch should overthrow Persia. Certain it is, Alexander favored the Jews, and JOSEPHUS' statement gives an explanation of the fact; at least it shows that the Jews in JOSEPHUS' days believed that Daniel was extant in Alexander's days, long before the Maccabees.\n \n Daniel - Chapter - Jamieson, Fausset, Brown Commentary on SearchGodsWord.org\n \n The Jewish Talmud refers to Daniel as a Prophet\n \n Hatach. Hatach is another name for the prophet Daniel. He was called Hatach (related to the Hebrew word for \"cut\") because he was \"cut down,\" demoted from his position of greatness, which he held at the courts of the previous kings (Megillah 15a). \n \n (virtualpurim)", 
   {}, 
   385394, 
   null, 
   1263172320.0
  ], 
  [
   385402, 
   null, 
   "pappillion001", 
   "Pappilion: When a prophet speaks in the Name of the L--rd, if the word does not come to pass, or come true, it is a word that the L--rd has not spoken; the prophet has spoken it presumptuously, you need not be afraid of him.\n \n Jesus was such a false prophet:\n \n Matthew 16:28\n \n Truly, I say to you, there are some standing here who will not taste death before they see the Son of man coming in his kingdom.\n \n That generation died nineteen centuries ago! (END PAPILLION QUOTES)\n \n <Flush<\n \n \"My kingdom is not of this world. If my kingdom were of this world, my servants would have been fighting..\" John 18:36\n \n In John 3 He says unless one is born again he cannot see the Kingdom of God. \n \n Look further and you'll see Luke 17:20-22, which says that the \"Kingdom of God is within you.\"\n \n What is the Kingdom of God?\n \n \"For the kingdom of God is not a matter of eating and drinking, but of righteousness, peace and joy in the Holy Spirit...\" Romans 14:17\n \n So not only did the disciples see Jesus in his Kingdom with \"righteousness, peace and joy in the Holy Spirit,\" but they also saw him in his Godly resurrected body.\n \n And that website you cut and pasted from has a lot of those horse dung claims. They're liars, spiritually-stunted imbeciles who haven't even read the Bible.\n \n And you bought right into it. Almost every time you post something you get your clock cleaned.\n\n \n The disciples are portrayed as XXXXXX in the Bible. Jesus being resurrected was probably more to convince them than anybody else. They repeatedly don't understand Jesus. Speaking in parables seems like the only way to communicate with them so please don't portray them as some enlightened all knowing example of Christian virture\n \n \n Yes they did read the bible or are you suggesting that they were able to respond to Christian verses through inspiration? Random guesses? Made it all up? \n \n You have just shown without question the problem that most Christians have. Notice that everything posted refutes Jesus as the Jewish Messiah, it really doesn't have to have much effect on the promise of salvation for Christians. Despite what Paul says it is possible for Jesus to have been a regular man, who was inspired and spoke as God's messenger. Christians needed to make Jesus bigger and better than the competition and God forbid their pride get in the way and have to admit maybe they made a mistake. Which is where you come in. Even though you often fail to utilize the common sense given to you by God, you insist you are right. Evidence contrary to your position is dismissed as wrong, made up or from imbeciles. How can you possibly be so sure that a couple illiterate fishermen and someone who never met the living Jesus or learned anything from those who did got it completely right or that those who came after faithfully understood and passed on the knowledge accurately? You can't and you know they didn't, but the XXXXXX are the one's who try and figure out what the truth is. \n \n I will let you know when you clean my clock since you appear not to be able to discern that for yourself.", 
   {}, 
   385356, 
   null, 
   1263173160.0
  ], 
  [
   385404, 
   null, 
   "gansao", 
   "Pappilion, excuse me for being lazy and maybe a little thick but are you suggesting that Christ may not have been divine and not actually resurrected.", 
   {}, 
   385402, 
   null, 
   1263174240.0
  ], 
  [
   385405, 
   null, 
   "trebor", 
   "You didn't answer the questions either, Trebor. Never could. Nor can you document your theological beliefs because you can't defend them.\n \n The Rabbis on Daniel\n \n Rabbi Judah, the main compiler of the Talmud said regarding the times referred to in Daniel's (Messianic) prophecy, \"These times were over long ago.\" (Babylonian Talmud Sanhedrin.) \n \n In the 12th Century AD, Rabbi Moses Ben Maimon (Maimonides), one of the most respected rabbis in history, stated: \n \n \"Daniel has elucidated to us the knowledge of the end times. However, since they are secret, the wise [rabbis] have barred the calculation of the days of Messiah's coming so that the untutored populace will not be led astray when they see that the End Times have already come but there is no sign of the Messiah.\"\n \n Rabbi Moses Abraham Levi said, \"I have examined and searched all the Holy Scriptures and have not found the time for the coming of Messiah clearly fixed, except in the words of Gabriel to the prophet Daniel, which are written in the 9th chapter of the prophecy of Daniel.\" \n \n From Maimonede's Sixth Principle of Faith: \n \n \"Third, when a prophet receives prophecy, even though it was only a vision and by means of an angel, he would nevertheless be weakened by it and his body would shudder. He would be stricken with a very great fear almost to the point that his spirit would leave his body, as Daniel said when [the angel] Gavriel (Gabriel) spoke to him, \"No strength remained in me; my robustness changed to pallor, and I could retain no strength... and I was in a deep sleep upon my face, and my face was to the ground\". And as he says later, \"during the vision my joints shuddered and I could retain no strength\". (Daniel 10:8-9, 16). But Moshe, may he rest in peace, was not so, rather, the word came to him and he did not experience trembling and shivering in any way, as it says, \"And HaShem spoke to Moshe face to face, as a man speaks to his friend\" (Shemos [Exodus] 33:11). In other words, just as a man does not experience trembling from the speech of his fellow, Moshe did not tremble from the word even though it was face to face. This was due to his total attachment to the intellect, as we said earlier.\" \n \n The \"Prophet Daniel\" found in the Dead Sea Scrolls:\n \n \"Comment: It is interesting to note that every chapter of Daniel is represented in these manuscripts, except for Dan 12. However, this does not mean that the Book lacked the final chapter at Qumran, since Dan 12:10 is quoted in the Florilegium (4Q174) - (Dead Sea Scrolls), which explicitly tells us that 'it is written in the Book of Daniel the Prophet.' \n \n Jesus confirms Daniel is a Prophet\n \n The Lord Jesus Christ spoke of Daniel \"the prophet\" (Matthew 24:15; Mark 13:14). \n \n Alexander the Great and Daniel\n \n JOSEPHUS [Antiquities, 11.8.5] mentions that Alexander the Great had designed to punish the Jews for their fidelity to Darius, but that Jaddua (332 B.C.), the high priest, met him at the head of a procession and averted his wrath by showing him Daniel's prophecy that a Grecian monarch should overthrow Persia. Certain it is, Alexander favored the Jews, and JOSEPHUS' statement gives an explanation of the fact; at least it shows that the Jews in JOSEPHUS' days believed that Daniel was extant in Alexander's days, long before the Maccabees.\n \n Daniel - Chapter - Jamieson, Fausset, Brown Commentary on SearchGodsWord.org\n \n The Jewish Talmud refers to Daniel as a Prophet\n \n Hatach. Hatach is another name for the prophet Daniel. He was called Hatach (related to the Hebrew word for \"cut\") because he was \"cut down,\" demoted from his position of greatness, which he held at the courts of the previous kings (Megillah 15a). \n \n (virtualpurim)\n\n \n How funny that you have to take the 'rabbi's words' about Daniel from a Christian site..\n \n Yawn... that give things soo much sense.\n \n The book of Daniel was not written by Daniel. It might be about Daniel, but it was placed in the writings for a reason... If it was by Daniel, it would have been placed in the Prophets. \n \n And, I personally won't accept what any Christian says about what Jews believe.", 
   {
    "unicode_changes_made": true
   }, 
   385400, 
   null, 
   1263174420.0
  ], 
  [
   385424, 
   null, 
   "pappillion001", 
   "Points and Questions Pappillion has to answer in order to try and salvage his late dating (200 BC) of Daniel:\n \n The Date of the Book of Daniel\n \n 1) If Antiochus seems to fulfill the prophecies recorded in 8:8-12 then why is there is no evidence that he fulfilled vs 9 and 12? See also the lack of fulfillment of 11:36-45. Both Daniel 8:9-12 and 11:36-45 deal with the blasphemous character of the king of the north which go far beyond anything that we know about Antiochus. He never destroyed the temple (see Dan. 8:11) and his military accomplishments hardly match those \"recorded\" in 8:9, 12 and 11:22. And while verse 37 states that \"neither shall he regard the God of his fathers\" it is \"attested by Polybius and Livy [as being] the very opposite of his character. For he was more zealous in their worship, than any of the kings before him.\" [Pusey, 137] Even Towner notes that from 11:39 onwards Daniel does not fit with anything we know about Antiochus IV. [page 151--this is really disconcerting, to say the least, to the Maccabean hypothesis considering that the \"predicted end of Antiochus differs from the stories of his death in I and II Maccabees ...\" [William H. Brownlee, The Meaning of the Qumran Scrolls for the Bible. (Oxford, 1964): 35-6; Waltke (1976): 322; Baldwin (1978a)\n \n If Daniel was written as late as is claimed then how did he know of details about Babylon that had been lost within a half-century of its fall to Cyrus in 539 B.C. (Xerxes having destroyed its palaces, walls, and temples in 480 B.C.)? The typical Daniel, critic ignores this point.\n \n 17) Again, if the book was written during the Maccabean era to meet the current needs then why does so little of the book reflect the events that are recorded in 1 and 2 Maccabees? Why is there no call to arms? Why the silence concerning the revolt, its leaders, and heroes? This is especially surprising since the uprising began in 168 B.C.! [contra Graubart, 260; notice also that the book doesn't mention the asphyxiation of a thousand devout Jews (Hasidim) by Antiochus' troops in their desert caves--Trever, 89]\n \n 21) If the book was written under the Hellenizer Antiochus why is there so few Greek words in the text? To state it another way: if the book was written during a time of such intensive and extensive Greek influence then why are there *only* 3 Greek words in the entire text?[contra Lenormant who claims the book is \"interspersed .. in various places with Greek words\". cited by Montgomery, 74] In fact, Yamauchi and Boutflower are surprised \"that there are not more Greek words\" in this document if it was indeed written in the Maccabean age--note the deep influence of Greek culture and customs on the Books of Maccabees; and yet we see none of this in Daniel! [Edwin M. Yamauchi, Greece and Babylon. (Baker, 1967): 94; cited by Waltke (1976): 325; Emery, 21; Boutflower, 246] Baldwin points out that \"the fact that no more than three Greek words occur in the Aramaic of Daniel (and these are technical terms) argues against a second-century date for the writing of the book.\" [Baldwin (1978a): 34] This fact, as noted by Boutflower (page 246), is especially relevant in comparison with the 19 Persian loan words that are present in the text. Why should an older language assume such prominence in this work? This is the opposite of what we should expect given the normal custom of the ANE (or anywhere else for that matter). As Kitchen, professor of Egyptology at the University of Liverpool, notes: \"In Ancient Near Eastern literature, a later writer tends to deck his description of an earlier period with trappings of his *own* time, while retaining archaic features that have survived.\" [emphasis mine, Kitchen (1965): 49] \n \n It used to be claimed that the presence of these Greek words meant that the book was a late composition. For instance, the absence of Greek words was one of the details that led Driver to claim that \"... the Greek words demand ... a date after the conquest of Palestine by Alexander the Great (B.C. 332).\" [Driver, An Introduction to the Old Testament. (T. & T. Clark, 1898): 476, emphasis his; see also Acquistapace, 142; Larue (405) echoes Driver's remark without providing any support for it] Unfortunately, for the critics, the presence of Greek words has long been demonstrated by \"an avalanche of evidence\" to have entered into \"the Semitic milieu long before the sixth century B.C.\" [Vasholz, 316; Kitchen (1965): 44-48, Archer (1985): 21; McDowell, 98-102\n \n 23) If the book of Daniel was written in Palestine after a period of 160 years of influence and control by the Greeks then why didn't the writer use more Greek terms \"pertaining to government and administration\" rather than use long-forgotten Persian words -- and how did the author know these words? \n \n 24) In terms of the Aramaic of the text it has been concluded that the book could _*NOT*_ have been written *later than* 300 B.C.. [See the book review of Klaus Koch's Das Buch Daniel by Arthur Ferch in the Journal for the Study of the Old Testament, 23 (July 1982): 119-123] Stefanovic studied Old Aramaic inscriptions from the ninth to the seventh centuries B.C. and found significant similarity to the Aramaic used in Daniel. [Zdravko Stefanovic, Correlations between Old Aramaic Inscriptions and the Aramaic Section of Daniel. Ph.D. dissertation, Andrews University, 1987] \n \n 25) Koch also points out that the vocalization of the Aramaic of Daniel appears to be of Eastern type and the general context and royal figures point to the east. [See Koch's book, page 47] Also the famous Aramaic scholar E. Y. Kutscher has shown that the Aramaic of Daniel points to an Eastern origin. [Kutscher, 400; cited by Hasel, (1981): 219 and (1986): 132] A Western origin would be required if the Maccabean thesis were correct. This factor alone strongly suggests that a Maccabean source for the book is in error. \n \n 28) A \"linguistic analysis indicates that in morphology, vocabulary, and syntax\" of the Aramaic of Daniel is considerably earlier (on the order of several centuries) than that of Genesis Apocryphon (1QapGen) and the Targum of Job (11QtgJob) which date from either the late 3rd or 2nd century B.C.. [Archer (1985): 23 and (1974) 471; see also Vasholz, (Dec 1978): 315-321; and his Ph.D. dissertation A Philological Comparison of the Qumran Job Targum and its Implications for the Dating of Daniel. (Univ. of Stellenbosch, 1976); and his \"The Aramaic of the 'Genesis Apocryphon' Compared with the Aramaic of Daniel,\" New Perspectives on the Old Testament. Edited by J. B. Payne (1970): 160-169; Kutscher, \"The Language of the 'Genesis Apocryphon,'\" Aspects of the Dead Sea Scrolls. 2nd edition, (1965): 1-35; Kutscher, \"Dating the Language of the Genesis Apocryphon,\" Journal of Biblical Literature, vol. 76 (1957): 288-92. More information on the Job Targum can be found in: T. Muraoka, \"The Aramaic of the Old Targum of Job From Qumran Cave XI,\" Journal of Jewish Studies, vol 25 (1974) and S. A. Kaufman, \"The Job Targum From Qumran,\" JAOS vol 93 (1973)] Collins notes that the Aramaic of the Qumran community was only in use between 200 B.C. and 200 A.D.\". Therefore, since the Aramaic of Daniel is several centuries older than that of the Qumran community then Daniel had to have been written around 600-400 B.C..\n \n Vasholz concludes that \"the evidence now available from Qumran indicates a pre-second century date for the Aramaic of Daniel.\" One piece of evidence he points to is that of the spelling of the name of Darius. In Biblical Aramaic it is Dryw which agrees with the Meissner contract from 515 B.C. and the earliest Aramaic papyri (494 B.C.; whereas, in later times the name was spelt with a He (Dryhw). [page 320] On this Kitchen notes that if Daniel and Ezra were written in the late sixth to mid-fifth centuries then their preservation of the earlier form is understandable; but, if it was written \"in the third century BC of later, then their failure use the form with the h -- in constant use for a century by then (c. 420-330 BC) -- is quite incomprehensible.\" [Kitchen (1965): 59-60, emphasis mine] \n \n In fact, J. A. Montgomery points out that the \"the very language of the story [of Daniel (4:30)] is reminiscent of the Akkadian\" found on the Grotefend Cylinder. [\"The Book of Daniel,\" ICC. Vol. 23 (1927): 243] The point here is that in the Akkadian \"the verb normally falls at or near the end of the sentence\" whereas in the normal Aramaic of Palestine it would not. [Kitchen (1965): 76] This point \"proves that the Aramaic of Daniel (and Ezra) belongs to the early tradition of Imperial Aramaic (seventh-sixth to fourth centuries BC) as opposed to later and local Palestinian derivatives of Imperial Aramaic ...\" [Kitchen (1965): 76; Soggin, 409] \n \n Kutscher has also compared the Aramaic of Daniel with that found in the 5th century Elephantine papyri and found that it is contemporary with the Aramaic of Daniel although it is different in terms of spelling conventions. [See his article \"The Hermopolis Papyri,\" Israel Oriental Studies (1971): 103-119; see also W. St. Clair Tisdall, \"Egypt and the Book of Daniel--Or What Say the Papyri?\" Expositor 22:2 (Nov 1921): 340-57; contra EBD, 258] Vasholz notes the \"general consensus among the scholars\" about the proximity of the Aramaic in Daniel with that of Ezra and the Elephantine papyri. [contra Hartman and DiLella, 408 who claimed that the Aramaic of Daniel \"is certainly later than the Aramaic of the Elephantine papyri\"] In his footnote for this Vasholz cites G. Fohrer [Introduction to the Old Testament. Translated by D. E. Green (Abingdon, 1968) page 473 who \"states that the language of Daniel is Imperial Aramaic.\" [page 317, note 9; see also Davies (1988): 37] Collins has also pointed out the \"essential similarity of the Aramaic of Daniel to that of Ezra\".\n \n 34) If Daniel originated in Palestine in the 2nd century B.C. as alleged then why doesn't the language of the book reflect the Hebrew that was common at that time--i.e., as reflected in the Qumran scrolls? [Goldingay, xxv] Distinct differences have been noted and it has been shown that the Qumran documents have none of the distinct characteristics of the Hebrew chapters in Daniel. [For a detailed presentation see Archer (1974): 470-481] Archer concludes that \"in the areas of syntax, word order, morphology, vocabulary, spelling, and word-usage, there is absolutely no possibility of regarding Daniel as contemporary\" [to other second century documents]. He submits that \"centuries must have intervened between them.\" \n These findings mean that the Aramaic documents from Qumran *require* that Daniel was written far earlier than the Maccabean thesis allows and that the book was *not* written in Palestine.\n \n 40) After examining all of the linguistic indicators Kitchen concludes: \"One would--on the Greek and Persian evidence ...--prefer to put the Aramaic of Daniel in the late sixth, the fifth, or the fourth centuries BC, not the third or second. The latter is not ruled out, but is much less realistic and not so favoured by the facts as was once imagined.\" [Kitchen (1965): 50; cited by Baldwin (1978a): 34] Boutflower, page 257, reports that R. D. Wilson studied the composition of the various words found in Daniel in his article \"The Aramaic of Daniel,\" for Biblical and Theological Studies. (Princeton, 1912). Wilson then concluded, on page 304: \"we are abundantly justified in concluding that the dialect of Daniel, containing as it does so many Persian, Hebrew, and Babylonian elements, and so few Greek words, with not one Egyptian, Latin, or Arabic word, and being so nearly allied in grammatical form and structure to the older Aramaic dialects and in its conglomerate vocabulary to the dialects of Ezra and Egypto-Aramaic, must have been used at or near Babylon at a time not long after the founding of the Persian empire.\" \n \n 43) Harrison contends that a Maccabean dating for Daniel would not have left sufficient \"time for a Maccabean-era composition to be circulated, venerated, and accepted as canonical Scripture by a Maccabean sect.\" [Harrison (1969): 1127; Wegner, 115-6; Hill and Walton, 350--Walton refers the reader to D. W. Gooding, 73-4 to see this argument in detail] \n \n 48) R. D. Wilson did a study of Hebrew, Aramaic, and Greek lists of the canon and he found that they consistently placed Daniel among the \"Prophets\". [\"The Aramaic of Daniel,\" Biblical and Theological Studies. (Princeton, 1912): 9-64. Wilson also found that the Aramaic was of an Eastern type of the 6th century B.C..] It was in the post-Christian era (i.e. 2nd century A.D.) that Daniel was moved from the \"Prophets\" to the \"Writings\" [See also Audet, 145-6, 150; cited by Koch, Das Buch Daniel, 29 and (1985): 123] Barnes says that the change was because Daniel was being used by the Christians \"in their arguments against the Jews, to prove the Jesus was the Messiah.\" [Barnes, 40] \n \n 49) \"It is incontestably clear that the people of Qumran regarded Daniel as a prophet. In 4Q174 2:3 we read ['s]r ktwb bspr dny'l hnby' (\"[whi]ch is written in the book of Daniel the prophet the\"). The passage, called a florilegium by J. M. Allegro, contains a quotation from Dan. 11:32 and 12:10.\" [Yamauchi (March 1980): 14] The book of Daniel is seen with the same level of respect as the books of Isaiah and Ezekial. [Published by J. M. Allegro and A. A. Anderson, Discoveries in the Judean Desert of Jordan.\n \n 52) \"Daniel is included among the Major Prophets by the LXX [translated 285/2 - 246 B.C.] and the other early versions.\" [Archer (1985): 7] Collins agrees that the book of Daniel was \"classified with the Major Prophets in the LXX. [Collins (1992): 31; it is interesting to note that some critics never mention this fact, see, for instance, Dummelow, 529] Waltke points out that: \"According to the general consensus, the Prophets were translated before the end of the third century B.C. ...\" [Waltke (1979): 220;\n \n Once again, YOU HAVEN'T DONE YOUR HOMEWORK!\n \n Answer the points and questions now?\n\n \n Almost all of this has been addressed in my 2nd post. It's a 20 page PDF that you have not said a word about. \n \n Additionally here is some more evidence for you\n \n where the author says that he had paid attention to the prophecy of Jeremiah concerning the seventy years, which prophecy became the basis for a new prophecy. This shows that the author was merely a disciple of the Prophets, one who reproduced the prophecies of his masters. His book, indeed, is not included in the section Nebiim.\n JewishEncyclopedia.com - DANIEL, BOOK OF\n \n 1. The Greek translation of the Hebrew Scriptures (The Septuagint or LXX c. 280-150 B.C.) divided the Old Testament according to subject matter which is the basis of the modern four-fold classification of the: five books of Law, twelve books of History, five books of Poetry, and seventeen books of Prophecy6\n \n 3. In the Hebrew canon Daniel is not included among the prophets\n \n 4. In the Hebrew canon Daniel is included among the writings with the \"historical\" books. This emphasis may well have been appropriate for the following reasons:\n \n a. Daniel is not in the role of a prophet who is speaking to the nation to repent of their ethical misdeeds\n \n b. Although Daniel certainly wrote down prophetic visions, they are a message to the nation to enable them to walk through their history with the confidence that God is working among them even though they are being dominated by the Gentiles. If historical literature is emphasizing a revelation (record) of the sovereign work of God in history, then Daniel certainly applies because the prophetic visions are also a record (in advance) of the sovereign work of God in history as the Gentiles overrun Israel (who is in sin), but as Israel is also going to be ultimately delivered. As in other historical literature, this book would enable Israel to walk more faithfully with God when they saw His inclusive plan for them.\n \n c. Perhaps the Masoretes did not consider Daniel to be a prophet since he was not appointed or ordained as a prophet in the text in the usual way; rather he was a servant of the government\n \n d. Much of Daniel's writing does not bear the character of prophecy, but rather of history\n \n \n \n Here it is explained and is applicable to almost every Christian claim. The below philosophy shows that the truth is secondary to the belief. \n \n Concerning the importance of this study Waltke writes, This is is of greatest importance for at least three reasons. First, the sovereignty of the revealed God in this book is at stake. If Daniel's God was able to predict the future, then there is reason to believe that the course of history is completely under Yahweh's sovereignty. On the other hand, if the predictions are fraudulent, then one must remain agnostic about Daniel's God. Second, the divine inspiration of the Bible hangs in the balance. If the book contains true predictions, then there is firm reason to believe that this book ultimately owes its origin to One who can predict the future. On the contrary, if it is a spurious, fraudulent, although well-intentioned piece of literature, then the reliability of other books in the canon of Scripture may legitimately be questioned. Third, one's understanding of the nature of Jesus Christ depends on the answer to the date of the book. Jesus Christ regarded the Book of Daniel as a prophetic preview of future history and indeed of the divine program for a future that still lies ahead (Matt. 24:15-16; Mark 13:14; Luke 21:20). If he is wrong in His interpretation of the book, then He must be less than the omniscient, inerrant God incarnate. On the other hand, if His appraisal is right, then His claim to deity cannot be questioned in this regard (Bruce K. Waltke, The Date of the Book of Daniel. Bibliotheca Sacra 133 (1976): 320).\n An Introduction to the Book of Daniel | Bible.org; NET Bible, Bible Study\n \n And here is a few more. Read up enjoy, maybe it will be an educational treat. You got to stay away from that religous biased writing if you want to get things staight. So your still grasping for straws and your head is barely above water. Give one of the other questions I asked a try maybe you will have better luck\n \n Daniel", 
   {
    "unicode_changes_made": true
   }, 
   385389, 
   null, 
   1263181560.0
  ], 
  [
   385428, 
   null, 
   "pappillion001", 
   "Pappilion, excuse me for being lazy and maybe a little thick but are you suggesting that Christ may not have been divine and not actually resurrected.\n\n \n Not in this particular thread. Here I am just questioning the validity of prophecy. This for 2 reasons 1 it is horribly unreliable and 2 if it is valid it means the future is determined and are choices have no meaning beyond letting us see what has been decided for us.\n \n Separately I am open to him not being divine (in the sense he was God in human form), but think at a minimum had some connection to God. I go back and forth on the resurrection, but not a physical one.\n \n I don't think it a requirement for Jesus to be the son of God/God to have a meaningful philosophy or insight into the problems and possible solutions for humanity.\n \n My hope is that discussions like this will encourage people (myself included) into having a better understanding of what we have, where we got it and what it means instead of just running around like sheep spewing forth the same regurgitated slop that got injected without any consideration given to whether it is valid or not.", 
   {}, 
   385404, 
   null, 
   1263182940.0
  ], 
  [
   385432, 
   null, 
   "pappillion001", 
   "ONCE AGAIN, YOU DIDN'T DO YOUR HOMEWORK.\n \n Against Apion 1:8 (Josephus) also defines which books he viewed as being in the Jewish Scriptures:\n \n \" For we have not an innumerable multitude of books among us, disagreeing from and contradicting one another, [as the Greeks have,] but only twenty-two books, (8) which contain the records of all the past times; which are justly believed to be divine; and of them five belong to Moses, which contain his laws and the traditions of the origin of mankind till his death. This interval of time was little short of three thousand years; but as to the time from the death of Moses till the reign of Artaxerxes king of Persia, who reigned after Xerxes, the prophets, who were after Moses, wrote down what was done in their times in thirteen books. The remaining four books contain hymns to God, and precepts for the conduct of human life...\" \n\n \n Against Apion - Wikipedia, the free encyclopedia\n \n Josephus\n He wrote twenty years before Jamnia and over 300 years before the Talmud's Tractate Baba Bathra which is used to support the theory of the three-part development. \n He had the actual Temple scrolls in his possession as a gift from Titus. We would conclude from these facts that Josephus should be considered more authoritative than the Talmud regarding the first century view of the canon. \n Josephus had the same canon we do. \n He says there were 22 books in the canon of the Old Testament (see \"Against Apion\" 1:8, where he mentions 5 books of Moses, 13 Prophets, and 4 Writings).\n \n - This corresponds to our 39 books. Following typical Jewish tradition, he recognized Jer. and Lam. as one book, as he also did Judges & Ruth, I Sam. & II Sam., I Kings & II Kings, I Chron. & II Chron., and Ezra and Esther. The 12 Minor Prophets were also recognized as one book, called \"The Book of the Twelve.\" \n \n He included Daniel in the Prophets instead of in the Writings, which refutes an important part of the proof used to support the three-part theory, and the late-dating of Daniel. \n \n Josephus also indicates that there was unbroken succession of prophets from Moses to Malachi, and that the histories written since Malachi were not inspired, because there had been no succession of prophets since the time of Malachi. This reflects the consensus in Israel that the Apocraphal books were not canonical. \n The Canonicity Question\n \n And since Daniel is not a book of \"hymns to God\" or \"precepts for the conduct of human life,\" then according to Josephus Daniel had to be in the Prophets (as my other information noted). \n \n You're busted.[/QUOTE]\n \n Nope, but you are. Read what I posted earlier. The difference is you assume based on your view of Daniel, while I stick to the facts. I don't say well it had to be X because it wouldn't be considered X. That is a weak argument, as bad as Origen a pillar of Christianity determining the order of Jewish scripture for Christians and saying that must be how the Jews did it. Stop making assumptions and stop trying to make it fit your Christian perceptions of what it is supposed to be. Whatever the date it's pre christian and for this arguement their concepts aren't applicable.", 
   {
    "unicode_changes_made": true
   }, 
   385386, 
   null, 
   1263183480.0
  ], 
  [
   385438, 
   null, 
   "gansao", 
   "Not in this particular thread. Here I am just questioning the validity of prophecy. This for 2 reasons 1 it is horribly unreliable and 2 if it is valid it means the future is determined and are choices have no meaning beyond letting us see what has been decided for us.\n \n Separately I am open to him not being divine (in the sense he was God in human form), but think at a minimum had some connection to God. I go back and forth on the resurrection, but not a physical one.\n \n I don't think it a requirement for Jesus to be the son of God/God to have a meaningful philosophy or insight into the problems and possible solutions for humanity.\n \n My hope is that discussions like this will encourage people (myself included) into having a better understanding of what we have, where we got it and what it means instead of just running around like sheep spewing forth the same regurgitated slop that got injected without any consideration given to whether it is valid or not.\n\n \n Excuse me for putting in a point that may not be relevant but could there be room for individual choice within the framework of a certainty of the events prophesised?\n Am I misunderstanding?", 
   {}, 
   385428, 
   null, 
   1263184500.0
  ], 
  [
   385477, 
   null, 
   "pappillion001", 
   "Excuse me for putting in a point that may not be relevant but could there be room for individual choice within the framework of a certainty of the events prophesised?\n Am I misunderstanding?\n\n \n No problem, I am not always clear and being out on the fringe doesn't make me any easier to figure out.\n \n Sorry I am not sure I understand your question. Do you mean choice in interpretation or acceptance or both or something else? \n \n As for the the certainty of prophesy I have a few issues. The first is, and these are all typical of biblical prophesy, there is often no way to tell if the a specific person is the one or coincidentally fits and is intended for someone else yet to come. The verses are spread throughout the bible. Having a paragraph or two worth helps credibility. One sentence considered prophecy while the one before and after are not doesn't. Typically only after the fact can one say a verse references a person or event. Taking any verse one wants from the bible almost anyone or place or circumstance can have been foretold. Many prophetic verses are generic and the cumulative effect isn't worth much if they can be applied to many people. It tends to be obscure almost guaranteeing that it won't be recognized until after the fact which at best becomes confirmation and in the case of Jesus one would think his impact would be significant enough that relying on prophecy (that has at times been made to fit) would not be the make or break issue.\n \n I am not sure if I answered your question or made you read a long bunch of not even close to what you were asking.", 
   {}, 
   385438, 
   null, 
   1263192960.0
  ], 
  [
   385488, 
   null, 
   "gansao", 
   "No problem, I am not always clear and being out on the fringe doesn't make me any easier to figure out.\n \n Sorry I am not sure I understand your question. Do you mean choice in interpretation or acceptance or both or something else? \n \n As for the the certainty of prophesy I have a few issues. The first is, and these are all typical of biblical prophesy, there is often no way to tell if the a specific person is the one or coincidentally fits and is intended for someone else yet to come. The verses are spread throughout the bible. Having a paragraph or two worth helps credibility. One sentence considered prophecy while the one before and after are not doesn't. Typically only after the fact can one say a verse references a person or event. Taking any verse one wants from the bible almost anyone or place or circumstance can have been foretold. Many prophetic verses are generic and the cumulative effect isn't worth much if they can be applied to many people. It tends to be obscure almost guaranteeing that it won't be recognized until after the fact which at best becomes confirmation and in the case of Jesus one would think his impact would be significant enough that relying on prophecy (that has at times been made to fit) would not be the make or break issue.\n \n I am not sure if I answered your question or made you read a long bunch of not even close to what you were asking.\n\n Thank you..", 
   {}, 
   385477, 
   null, 
   1263217560.0
  ], 
  [
   385557, 
   null, 
   "Easyrider", 
   " Stop making assumptions and stop trying to make it fit your Christian perceptions of what it is supposed to be. Whatever the date it's pre christian and for this arguement their concepts aren't applicable.\n\n \n Daniel was a prophet. Even Jewish rabbis, etc.. said so. So quit trying to confuse the issue. It's not working for you.", 
   {}, 
   385432, 
   null, 
   1263253560.0
  ], 
  [
   385560, 
   null, 
   "pappillion001", 
   "Daniel was a prophet. Even Jewish rabbis, etc.. said so. So quit trying to confuse the issue. It's not working for you.\n\n \n Your not reading the evidence I have given you. The only reason there is confusion is because you want to be right about this and there is overwhelming evidence and simple common sense that state otherwise. \n \n I alread posted this but once more\n \n 3. In the Hebrew canon Daniel is not included among the prophets\n \n 4. In the Hebrew canon Daniel is included among the writings with the \"historical\" books. This emphasis may well have been appropriate for the following reasons:\n \n a. Daniel is not in the role of a prophet who is speaking to the nation to repent of their ethical misdeeds\n \n b. Although Daniel certainly wrote down prophetic visions, they are a message to the nation to enable them to walk through their history with the confidence that God is working among them even though they are being dominated by the Gentiles. If historical literature is emphasizing a revelation (record) of the sovereign work of God in history, then Daniel certainly applies because the prophetic visions are also a record (in advance) of the sovereign work of God in history as the Gentiles overrun Israel (who is in sin), but as Israel is also going to be ultimately delivered. As in other historical literature, this book would enable Israel to walk more faithfully with God when they saw His inclusive plan for them.\n \n c. Perhaps the Masoretes did not consider Daniel to be a prophet since he was not appointed or ordained as a prophet in the text in the usual way; rather he was a servant of the government\n \n d. Much of Daniel's writing does not bear the character of prophecy, but rather of history\n \n This is over and above the date issue. Christians place more importance because of the Jesus prophecy they think it contains. \n \n So you are partially correct, but for this discussion what you are right about doesn't isn't really relevant and is making you wrong where it is relevant.\n \n There were other questions in the OP if you want to give one of those a try, or keep with this but your going to need to come at it differently.", 
   {
    "unicode_changes_made": true
   }, 
   385557, 
   null, 
   1263258720.0
  ], 
  [
   385564, 
   null, 
   "Easyrider", 
   "Your not reading the evidence I have given you. The only reason there is confusion is because you want to be right about this and there is overwhelming evidence and simple common sense that state otherwise. \n \n I alread posted this but once more\n \n 3. In the Hebrew canon Daniel is not included among the prophets\n \n 4. In the Hebrew canon Daniel is included among the writings with the &#8220;historical&#8221; books. This emphasis may well have been appropriate for the following reasons: etc., etc.\n\n \n Wrong. The information I previously provided shows Daniel was in with the Prophets. Even Jewish rabbis confirmed he was a prophet.\n \n And, since Jesus is God and confirmed Daniel was a prophet, then you lose.", 
   {}, 
   385560, 
   null, 
   1263260460.0
  ], 
  [
   385572, 
   null, 
   "pappillion001", 
   "Wrong. The information I previously provided shows Daniel was in with the Prophets. Even Jewish rabbis confirmed he was a prophet.\n \n And, since Jesus is God and confirmed Daniel was a prophet, then you lose.\n\n \n :xbanghead\n \n Christians put him in with the Prophets which was later. Read what I posted just because he exhibited something like prophecy doesn't automatically put it in with the Prophets. \n \n Do you understand this now. How the book can contain prophecy, but not be included with the other prophets?\n \n Here is more evidence from Blue Letter Bible\n \n Introduction to the Prophetical Books\n by A. R. Fausset\n \n This constitutes the second division, the others being the Law and Hagiographa. It included Joshua, Judges, First and Second Samuel, First and Second Kings, called the former prophets; and Isaiah, Jeremiah, Ezekiel, &c., to Malachi, the latter prophets. Daniel is excluded, because, though highly endowed with prophetic gifts, he had not filled the prophetic office: his book is therefore classed with the Hagiographa. Ezra probably commenced, and others subsequently completed, the arrangement of the canon.\n \n \n \n W. Sibley Towner writes: \"Daniel is one of the few OT books that can be given a fairly firm date. In the form in which we have it (perhaps without the additions of 12:11, 12), the book must have been given its final form some time in the years 167-164 B.C.(Harper's Bible Commentary, p. 696)\n \n Louis F. Hartman writes: \"Having lost sight of these ancient modes of writing, until relatively recent years Jews and Christians have considered Dn to be true history, containing genuine prophecy. Inasmuch as chs. 7-12 are written in the first person, it was natural to assume that Daniel in chs. 1-6 was a truly historical character and that he was the author of the whole book. There would be few modern biblical scholars, however, who would now seriously defend such an opinion. The arguments for a date shortly before the death of Antiochus IV Epiphanes in 164 are overwhelming.(The Jerome Biblical Commentary, vol. 1, p. 448)\n \n \n Daniel\n \n It really should not be this difficult. At this point your continued refusal to accept the facts is becoming ridiculous. Read your evidence and compare notice the wording and who it is coming from. Daniel is important to Christians for several reasons and just as you are doing must insist against all reason that Daniel is what they say. This is what happens when pride and arrogance get in the way of truth and fact. End result complete loss of credibility.\n \n emoticon_xhoho", 
   {}, 
   385564, 
   null, 
   1263262980.0
  ], 
  [
   385574, 
   null, 
   "Easyrider", 
   ":xbanghead\n \n Christians put him in with the Prophets which was later. Read what I posted just because he exhibited something like prophecy doesn't automatically put it in with the Prophets. \n \n Do you understand this now. How the book can contain prophecy, but not be included with the other prophets?\n \n Here is more evidence from Blue Letter Bible\n \n Introduction to the Prophetical Books\n by A. R. Fausset\n \n This constitutes the second division, the others being the Law and Hagiographa. It included Joshua, Judges, First and Second Samuel, First and Second Kings, called the former prophets; and Isaiah, Jeremiah, Ezekiel, &c., to Malachi, the latter prophets. Daniel is excluded, because, though highly endowed with prophetic gifts, he had not filled the prophetic office: his book is therefore classed with the Hagiographa. Ezra probably commenced, and others subsequently completed, the arrangement of the canon.\n \n \n \n W. Sibley Towner writes: \"Daniel is one of the few OT books that can be given a fairly firm date. In the form in which we have it (perhaps without the additions of 12:11, 12), the book must have been given its final form some time in the years 167-164 B.C.(Harper's Bible Commentary, p. 696)\n \n Louis F. Hartman writes: \"Having lost sight of these ancient modes of writing, until relatively recent years Jews and Christians have considered Dn to be true history, containing genuine prophecy. Inasmuch as chs. 7-12 are written in the first person, it was natural to assume that Daniel in chs. 1-6 was a truly historical character and that he was the author of the whole book. There would be few modern biblical scholars, however, who would now seriously defend such an opinion. The arguments for a date shortly before the death of Antiochus IV Epiphanes in 164 are overwhelming.(The Jerome Biblical Commentary, vol. 1, p. 448)\n \n \n Daniel\n \n It really should not be this difficult. At this point your continued refusal to accept the facts is becoming ridiculous. Read your evidence and compare notice the wording and who it is coming from. Daniel is important to Christians for several reasons and just as you are doing must insist against all reason that Daniel is what they say. This is what happens when pride and arrogance get in the way of truth and fact. End result complete loss of credibility.\n \n emoticon_xhoho\n\n \n I refer you back to the material I provided in which the Jewish historian Josephus confirmed Daniel was not in the Writings, but in with the Prophets.", 
   {}, 
   385572, 
   null, 
   1263265860.0
  ], 
  [
   385623, 
   null, 
   "pappillion001", 
   "I refer you back to the material I provided in which the Jewish historian Josephus confirmed Daniel was not in the Writings, but in with the Prophets.\n\n \n What is a Prophet?\n \n Many people today think of a prophet as any person who sees the future. While the gift of prophecy certainly includes the ability to see the future, a prophet is far more than just a person with that ability.\n \n A prophet is basically a spokesman for God, a person chosen by God to speak to people on God's behalf and convey a message or teaching. Prophets were role models of holiness, scholarship, and closeness to God. They set the standards for the entire community.\n \n The Hebrew word for a prophet, navi (Nun-Bet-Yod-Alef) comes from the term \"niv sefatayim\" meaning fruit of the lips, which emphasizes the prophet's role as a speaker.\n \n The Talmud teaches that there were hundreds of thousands of prophets: twice as many as the number of people who left Egypt, which was 600,000. But most of the prophets conveyed messages that were intended solely for their own generation and were not reported in scripture. Scripture identifies only 55 prophets of Israel.\n \n A prophet is not necessarily a man. Scripture records the stories of seven female prophets, listed below, and the Talmud reports that Sarah's prophetic ability was superior to Abraham's.\n \n A prophet is not necessarily a Jew. The Talmud reports that there were prophets among the Gentiles (most notably Balaam, whose story is told in Numbers 22-24), although they were not as elevated as the prophets of Israel (as the story of Balaam demonstrates). And some of the prophets, such as Jonah, were sent on missions to speak to the Gentiles.\n \n According to some views, prophecy is not a gift that is arbitrarily conferred upon people; rather, it is the culmination of a person's spiritual and ethical development. When a person reaches a sufficient level of spiritual and ethical achievement, the Shechinah (Divine Spirit) comes to rest upon him or her. Likewise, the gift of prophecy leaves the person if that person lapses from his or her spiritual and ethical perfection.\n \n The greatest of the prophets was Moses. It is said that Moses saw all that all of the other prophets combined saw, and more. Moses saw the whole of the Torah, including the Prophets, and the Writings that were written hundreds of years later. All subsequent prophecy was merely an expression of what Moses had already seen. Thus, it is taught that nothing in the Prophets or the Writings can be in conflict with Moses' writings, because Moses saw it all in advance.\n \n The Talmud states that the writings of the prophets will not be necessary in the World to Come, because in that day, all people will be mentally, spiritually, and ethically perfect, and all will have the gift of prophecy.\n Who are the Prophets of the Jewish Scriptures?\n \n The following list of prophets is based on the Talmud and Rashi.\n \n Abraham Genesis 11,26 - 25,10\n Isaac Genesis 21,1 - 35,29\n Jacob Genesis 25,21 - 49,33\n Moses Exodus 2,1 - Deuteronomy 34,5\n Aaron Exodus 4,14 - Numbers 33,39\n Joshua Exodus 17,9 - 14, 24,13, 32,17 - 18, 33,11; Numbers 11,28 - 29, 13,4 - 14,38; 27,18 - 27,23, Deuteronomy 1,38, 3,28, 31,3, 31,7-Joshua 24,29\n Pinchas Exodus 6,25; Numbers 25,7-25,11; Numbers 31,6; Joshua 22,13 - Joshua 24,33; Judges 20,28\n Elkanah I Samuel 1,1 - 2,20\n Eli I Samuel 1,9 - 4,18\n Samuel I Samuel 1,1 - I Samuel 25,1\n Gad I Samuel 22,5; II Samuel 24,11-19; I Chronicles 21,9-21,19, 29,29\n Nathan II Samuel 7,2 - 17; 12,1 - 25.\n David I Samuel 16,1 - I Kings 2,11\n Solomon II Samuel 12,24; 1 Kings 1,10 - 11,43\n Iddo II Chronicles 9,29, 12,15, 13,22\n Michaiah son of Imlah I Kings 22,8-28; II Chronicles 18,7-27\n Obadiah I Kings 18; Obadiah\n Ahiyah the Shilonite I Kings 11,29-30; 12,15; 14,2-18; 15,29\n Jehu son of Hanani I Kings 16,1 - 7; II Chronicles 19,2; 20,34\n Azariah son of Oded II Chronicles 15\n Jahaziel the Levite II Chronicles 20,14\n Eliezer son of Dodavahu II Chronicles 20,37\n Hosea Hosea\n Amos Amos\n Micah the Morashtite Micah\n Amoz (the father of Isaiah)\n Elijah I Kings 17,1 - 21,29; II Kings 1,10-2,15, 9,36-37, 10,10, 10,17\n Elisha I Kings 19,16-19; II Kings 2,1-13,21\n Jonah ben Amittai Jonah\n Isaiah Isaiah\n Joel Joel\n Nahum Nahum\n Habakkuk Habakkuk\n Zephaniah Zephaniah\n Uriah Jeremiah 26,20-23\n Jeremiah Jeremiah\n Ezekiel Ezekiel\n Shemaiah I Kings 12,22-24; II Chronicles 11,2-4, 12,5-15\n Barukh Jeremiah 32, 36, 43, 45\n Neriah (father of Barukh)\n Seraiah Jeremiah 51,61-64\n Mehseiah (father of Neriah)\n Haggai Haggai\n Zechariah Zechariah\n Malachi Malachi\n Mordecai Bilshan \n Oded (father of Azariah)\n Hanani (father of Jehu)\n Sarah Genesis 11,29 - 23,20\n Miriam Exodus 15,20-21; Num. 12,1-12,15, 20,1\n Deborah Judges 4,1 - 5,31\n Hannah I Samuel 1,1 - 2,21\n Abigail I Samuel 25,1 - 25,42\n Huldah II Kings 22,14-20\n Esther Esther\n \n Why is Daniel Not a Prophet?\n \n It is often asked why the Book of Daniel is included in the Writings section of the Tanakh instead of the Prophets section. Wasn't Daniel a prophet? Weren't his visions of the future true?\n \n According to Judaism, Daniel is not one of the 55 prophets. His writings include visions of the future, which we believe to be true; however, his mission was not that of a prophet. His visions of the future were never intended to be proclaimed to the people; they were designed to be written down for future generations. Thus, they are Writings, not Prophecies, and are classified accordingly.\n \n \n OK let's try a different approach\n \n Name the 13 and the 4. Since Josephus doesn't you will need to do a little research and perhaps that will enlighten you.", 
   {}, 
   385574, 
   null, 
   1263324900.0
  ], 
  [
   385651, 
   null, 
   "Easyrider", 
   "\n According to Judaism, Daniel is not one of the 55 prophets. His writings include visions of the future, which we believe to be true; however, his mission was not that of a prophet. His visions of the future were never intended to be proclaimed to the people; they were designed to be written down for future generations. Thus, they are Writings, not Prophecies, and are classified accordingly.\n\n \n That's their spiel. Jesus called Daniel a Prophet and so he was.\n \n \n\n OK let's try a different approach\n \n Name the 13 and the 4. Since Josephus doesn't you will need to do a little research and perhaps that will enlighten you.\n\n \n Was the Book of Daniel originally in the Prophetic Section of the Tanakh? \n \n \"The Book of Daniel would not be out of place in the prophetic section, Joshua, Judges and Kinds are included in the Prophets, and the translators of the Septuagint version of the Jewish Scriptures placed Daniel there also.\" Joseph D. Wilson, \"Did Daniel Write Daniel,\" page 84.\n \n \"...the present position of the Book (of Daniel) in the Hebrew Canon is not its original position. We have it on the authority of the Jewish historian Josephus that that at the close of the first century A.D. the Canon of the Old Testament books was differently arranged from that at present accepted among the Jews; and it is also evident from the writings of the Early Fathers that a change must have been made in the arrangement of the Jewish Canon between the middle of the third and the end of the fourth century A.D.\" - Charles Boutflower, \"In and Around the Book of Daniel,\" pages 276-277.\n \n Josephus in Contra Apionem 1:8 writes, \"We have but twenty-two (books) containing the history of all time, books that are justly believed in; and of these, five are the books of Moses, which comprise the laws and earliest traditions from the creation of mankind down to his death. From the death of Moses to the reighn of Artaxerxes, King of Persia, successor of Xerxes, the prophets who succeeded Moses wrote the history of the events that occurred in their own time, in thirteen books. The remaining four documents comprise hymns to God and the practical precepts to men.\" \n \n Daniel was included in those 13 books. \n \n Professor R.D. Wilson states: \"All the direct evidence, then, that precedes the year 200 A.D., supports the view that Daniel was in the earliest times among the Prophets.....Thus Origen, at A.D. 250, and Jerome, at A.D. 400, both of whom were taught by Jewish Rabbis and claim to have gathered their information from Jewish sources, put Daniel among the Prophets and separate the strictly prophetical books from those which are more properly called historical.\" R. D. Wilson, \"Studies in the Book of Daniel,\" page 49.", 
   {
    "unicode_changes_made": true
   }, 
   385623, 
   null, 
   1263341040.0
  ], 
  [
   385656, 
   null, 
   "pappillion001", 
   "That's their spiel. Jesus called Daniel a Prophet and so he was.\n\n \n Or dare I say it, perhaps Jesus was wrong. It is possible he was human at the time after all and this would not have been a sin. Actually Jesus didn't say he was. Jesus didn't write anything down, but an Apostle and a translator of an Apostle and a friend of a self proclaimed Apostle who actually never met Jesus say he did. Of course that assumes the Gospels were written by who they are named for. That is a different argument though so let's skip it for now.\n \n \nWas the Book of Daniel originally in the Prophetic Section of the Tanakh? \n \n \"The Book of Daniel would not be out of place in the prophetic section, Joshua, Judges and Kinds are included in the Prophets, and the translators of the Septuagint version of the Jewish Scriptures placed Daniel there also.\" Joseph D. Wilson, \"Did Daniel Write Daniel,\" page 84.\n\n \n would not be out of place that means he doesn't know. \n \n Go look at what the Hebrew Canon looks like compared to the Septuagint and the OT. You may be amazed at how 2 of them are almost identical and one is completely different. I wonder why?\n \n \n\"...the present position of the Book (of Daniel) in the Hebrew Canon is not its original position. We have it on the authority of the Jewish historian Josephus that that at the close of the first century A.D. the Canon of the Old Testament books was differently arranged from that at present accepted among the Jews; and it is also evident from the writings of the Early Fathers that a change must have been made in the arrangement of the Jewish Canon between the middle of the third and the end of the fourth century A.D.\" - Charles Boutflower, \"In and Around the Book of Daniel,\" pages 276-277.\n \n Josephus in Contra Apionem 1:8 writes, \"We have but twenty-two (books) containing the history of all time, books that are justly believed in; and of these, five are the books of Moses, which comprise the laws and earliest traditions from the creation of mankind down to his death. From the death of Moses to the reighn of Artaxerxes, King of Persia, successor of Xerxes, the prophets who succeeded Moses wrote the history of the events that occurred in their own time, in thirteen books. The remaining four documents comprise hymns to God and the practical precepts to men.\" \n\n \n Liar, Liar pants on fire. It says 22 books five of which are of Moses. 13 wrote the history of events that occurred in their own time (hardly prophetic) and then 4 hymns and precepts to men. Where does it say where the Book of Daniel is placed? Don't assume, just show me where, because I don't see it. Do you?\n \n So what books were left out? The Hebrew Canon is 24 books and if you had bothered to do the math and a little more research than cut and paste from Christian sites you would discover another problem. Go look let me know if you need it explained.\n \n \nDaniel was included in those 13 books.\n \n \n Based on the very authoritative evidence known as \"because I want it to\"\n Come up with something better or move on. Assumption makes for poor proof.\n \n \nProfessor R.D. Wilson states: \"All the direct evidence, then, that precedes the year 200 A.D., supports the view that Daniel was in the earliest times among the Prophets.....Thus Origen, at A.D. 250, and Jerome, at A.D. 400, both of whom were taught by Jewish Rabbis and claim to have gathered their information from Jewish sources, put Daniel among the Prophets and separate the strictly prophetical books from those which are more properly called historical.\" R. D. Wilson, \"Studies in the Book of Daniel,\" page 49.\n\n \n What direct evidence would that be? \n \n What is Origen famous for? Defending Christianity, having some of his work declared anathema and \n \n This brief article is an expanded version of the article appeared in the Eerdmans Dictionary of the Bible.\n \n The Hexapla was an important work of biblical criticism, the magnum opus of Origen (185-254). In his discussions with the Jews, Origen became aware of the significant differences between the Hebrew Bible used by the Jews and the Septuagint of Christians. Although he probably began the work while still in Alexandria, he completed it after moving to Caesarea. Most portions of the Hexapla consisted of six columns of parallel texts: (1) the Hebrew text, (2) the Hebrew text transliterated into Greek characters, (3) the Greek version of Aquila, (4) the Greek version of Symmachus, (5) the Septuagint, and (6) the Greek version of Theodotion.\n \n It would be much easier to understand by rearrainging the Hebrew to fit the layout of the others than vice versa. Also\n \n He used a defective translation in the Septuagint.[22] There are several examples of this in On First Principles\n \n Here is the link to see examples and read the footnotes to see what other pillars of Christian learning did the same.\n \n Origen of Alexandria (c.185 - c.254)\n \n I shouldn't need to go into Jerome.\n \n By the way what point are you trying to make with all this that has to do with the validity of prophecy? Shouldn't you be arguing whether what he said would happen really did instead of was he thought of as a prophet?", 
   {
    "unicode_changes_made": true
   }, 
   385651, 
   null, 
   1263353040.0
  ], 
  [
   385657, 
   null, 
   "Easyrider", 
   "Or dare I say it, perhaps Jesus was wrong. It is possible he was human at the time after all and this would not have been a sin. Actually Jesus didn't say he was. Jesus didn't write anything down, but an Apostle and a translator of an Apostle and a friend of a self proclaimed Apostle who actually never met Jesus say he did. Of course that assumes the Gospels were written by who they are named for. That is a different argument though so let's skip it for now.\n \n \n would not be out of place that means he doesn't know. \n \n Go look at what the Hebrew Canon looks like compared to the Septuagint and the OT. You may be amazed at how 2 of them are almost identical and one is completely different. I wonder why?\n \n \n \n Liar, Liar pants on fire. It says 22 books five of which are of Moses. 13 wrote the history of events that occurred in their own time (hardly prophetic) and then 4 hymns and precepts to men. Where does it say where the Book of Daniel is placed? Don't assume, just show me where, because I don't see it. Do you?\n \n So what books were left out? The Hebrew Canon is 24 books and if you had bothered to do the math and a little more research than cut and paste from Christian sites you would discover another problem. Go look let me know if you need it explained.\n \n \n \n Based on the very authoritative evidence known as \"because I want it to\"\n Come up with something better or move on. Assumption makes for poor proof.\n \n What direct evidence would that be? \n \n What is Origen famous for? Defending Christianity, having some of his work declared anathema and \n \n This brief article is an expanded version of the article appeared in the Eerdmans Dictionary of the Bible.\n \n The Hexapla was an important work of biblical criticism, the magnum opus of Origen (185-254). In his discussions with the Jews, Origen became aware of the significant differences between the Hebrew Bible used by the Jews and the Septuagint of Christians. Although he probably began the work while still in Alexandria, he completed it after moving to Caesarea. Most portions of the Hexapla consisted of six columns of parallel texts: (1) the Hebrew text, (2) the Hebrew text transliterated into Greek characters, (3) the Greek version of Aquila, (4) the Greek version of Symmachus, (5) the Septuagint, and (6) the Greek version of Theodotion.\n \n It would be much easier to understand by rearrainging the Hebrew to fit the layout of the others than vice versa. Also\n \n He used a defective translation in the Septuagint.[22] There are several examples of this in On First Principles\n \n Here is the link to see examples and read the footnotes to see what other pillars of Christian learning did the same.\n \n Origen of Alexandria (c.185 - c.254)\n \n I shouldn't need to go into Jerome.\n \n By the way what point are you trying to make with all this that has to do with the validity of prophecy? Shouldn't you be arguing whether what he said would happen really did instead of was he thought of as a prophet?\n\n \n Sorry, you haven't shown anything that would change my mind.\n \n I'm done with Daniel.\n \n Try busting the resurrection now?", 
   {}, 
   385656, 
   null, 
   1263353280.0
  ], 
  [
   385671, 
   null, 
   "pappillion001", 
   "Sorry, you haven't shown anything that would change my mind.\n \n I'm done with Daniel.\n \n Try busting the resurrection now?\n\n \n Is there anything that would?", 
   {}, 
   385657, 
   null, 
   1263369720.0
  ], 
  [
   385776, 
   null, 
   "Easyrider", 
   "I forgot to add one more thing from Daniel, which was written centuries before Christ appeared:\n \n \"In my vision at night I looked, and there before me was one like a son of man, coming with the clouds of heaven. He approached the Ancient of Days and was led into his presence. He was given authority, glory and sovereign power; all peoples, nations and men of every language worshiped him. His dominion is an everlasting dominion that will not pass away, and his kingdom is one that will never be destroyed.\"  - Daniel 7:13-14 NIV\n \n And the high priest answered and said to Him, &#8220;I put You under oath by the living God: Tell us if You are the Christ, the Son of God!&#8221; Jesus said to him, &#8220;It is as you said. Nevertheless, I say to you, hereafter you will see the Son of Man sitting at the right hand of the Power, and coming on the clouds of heaven.&#8221; - Matthew 26:63-64\n \n In Rabbinical literature much is said regarding the Messianic passage of Daniel 7:13. In the Talmud of Babylon Sanh. fol. 98.1, Daniel 7:13-14 is reconciled with Zechariah 9:9. Joshua ben Levy said, \"If Israel are worthy, the Messiah comes with the clouds of heaven; but if they are not worthy, he comes poor, and riding on an XXX.\" Samuel ben Nachman (270 C.E.) said that according to Daniel 7:13, the angels accompany the Messiah as far as their precincts allow, while God then conducts him to Himself, according to Jeremiah 30:21 (Midrash on Ps. 21:7). In Zohar, Gen. folio 85.4, reference is made to Daniel 7:13 as referring to the Messiah. The Hebrew name \"Anani\" meaning \"clouds\" is a name for the Messiah (alluding to Daniel 7:13) in the Targum translation of I Chron. 3:24. Mention is made of the name of a person, Anani, it is added, \"Who is the Messiah that is to be revealed,\"-a direct reference to Daniel 7:13. In the Talmud of Babylon Sanh. 96b the Messiah is named Bar-Naphle, the cloud-man. Rabbis Jarchi, Saadiah, Gaon, Aben Ezra, and R. Joshua expounded the text of Daniel 7:13 as referring to the Messiah. Outside of Rabbinical literature, Justin in his Dialogue 32.1 reports that the \"one like a son of man\" of Daniel 7:13 was identified with the King Messiah in mid-Second Century Judaism. \n \n LAWRENCE HILLIARD, LECTURER, EDUCATOR - TRACTS", 
   {}, 
   385671, 
   null, 
   1263428160.0
  ], 
  [
   385793, 
   null, 
   "trebor", 
   "I forgot to add one more thing from Daniel, which was written centuries before Christ appeared:\n \n \"In my vision at night I looked, and there before me was one like a son of man, coming with the clouds of heaven. He approached the Ancient of Days and was led into his presence. He was given authority, glory and sovereign power; all peoples, nations and men of every language worshiped him. His dominion is an everlasting dominion that will not pass away, and his kingdom is one that will never be destroyed.\"  - Daniel 7:13-14 NIV\n \n And the high priest answered and said to Him, &#8220;I put You under oath by the living God: Tell us if You are the Christ, the Son of God!&#8221; Jesus said to him, &#8220;It is as you said. Nevertheless, I say to you, hereafter you will see the Son of Man sitting at the right hand of the Power, and coming on the clouds of heaven.&#8221; - Matthew 26:63-64\n \n\n \n So the author of Matthew takes a very silly and stupid misinterpretation of what the passage in Daniel means, and twists it. And how is that supposed to show the validity of prophecy? So, the term 'Son of God' was used on mulitple times in the Jewish Scripture, meaning someone who supposedly 'got it right' with God for some reason. The use of a common phrase does not denote a prophecy. What nonsense.\n \n \n\n \n In Rabbinical literature much is said regarding the Messianic passage of Daniel 7:13. In the Talmud of Babylon Sanh. fol. 98.1, Daniel 7:13-14 is reconciled with Zechariah 9:9. Joshua ben Levy said, \"If Israel are worthy, the Messiah comes with the clouds of heaven; but if they are not worthy, he comes poor, and riding on an XXX.\" Samuel ben Nachman (270 C.E.) said that according to Daniel 7:13, the angels accompany the Messiah as far as their precincts allow, while God then conducts him to Himself, according to Jeremiah 30:21 (Midrash on Ps. 21:7). In Zohar, Gen. folio 85.4, reference is made to Daniel 7:13 as referring to the Messiah. The Hebrew name \"Anani\" meaning \"clouds\" is a name for the Messiah (alluding to Daniel 7:13) in the Targum translation of I Chron. 3:24. Mention is made of the name of a person, Anani, it is added, \"Who is the Messiah that is to be revealed,\"-a direct reference to Daniel 7:13. In the Talmud of Babylon Sanh. 96b the Messiah is named Bar-Naphle, the cloud-man. Rabbis Jarchi, Saadiah, Gaon, Aben Ezra, and R. Joshua expounded the text of Daniel 7:13 as referring to the Messiah. Outside of Rabbinical literature, Justin in his Dialogue 32.1 reports that the \"one like a son of man\" of Daniel 7:13 was identified with the King Messiah in mid-Second Century Judaism. \n \n LAWRENCE HILLIARD, LECTURER, EDUCATOR - TRACTS\n\n \n Out of context quotes from the Talmud, and a strong misunderstanding of what the Talmud is does not denote prophecy. It is either ignorance or purposeful deceit to try to twist the words of the talmud. Jewish Rabbi's often \n disagree with each other.. but I am sure that there is one thing.. not one of those rabbi's quoted (out of context I might add) thought that it was a 'prophecy' about Jesus.", 
   {}, 
   385776, 
   null, 
   1263432720.0
  ], 
  [
   385799, 
   null, 
   "Easyrider", 
   "So the author of Matthew takes a very silly and stupid misinterpretation of what the passage in Daniel means, and twists it. And how is that supposed to show the validity of prophecy? So, the term 'Son of God' was used on mulitple times in the Jewish Scripture, meaning someone who supposedly 'got it right' with God for some reason. The use of a common phrase does not denote a prophecy. What nonsense.\n \n Out of context quotes from the Talmud, and a strong misunderstanding of what the Talmud is does not denote prophecy. It is either ignorance or purposeful deceit to try to twist the words of the talmud. Jewish Rabbi's often disagree with each other.. but I am sure that there is one thing.. not one of those rabbi's quoted (out of context I might add) thought that it was a 'prophecy' about Jesus.\n\n \n Same old Trebor drivel - claiming misinterpretations, out of context, etc. \n \n Horse dung, Trebor. That was the context.", 
   {}, 
   385793, 
   null, 
   1263434880.0
  ], 
  [
   385803, 
   null, 
   "Penfold", 
   "Horse dung perhaps, but not from Trebor, who has consistently sought to drag the conversation up from your level.", 
   {}, 
   385799, 
   null, 
   1263437280.0
  ], 
  [
   385807, 
   null, 
   "trebor", 
   "Same old Trebor drivel - claiming misinterpretations, out of context, etc. \n \n Horse dung, Trebor. That was the context.\n\n \n Was it? Funny, from the Jewish commentary on Sanhedrin 98, we get\n \n \n In the Gemora (Sanhedrin 98) there are four opinions as to what will be the name of Moshiach. Some say Menachem, others say Shilo, a third opinion is Yinun and a fourth view is Chanina. The first letter of each one of these four names spells Moshiach. We are all eagerly awaiting the revelation of the redeemer who will lead us out of Golus. Not knowing for sure what his name will be, we call him Moshiach which is an acronym of the four different names for the redeemer. \n \n \n It is merely a discussion about 'what will be the name of the Messiah' between 4 rabbi's. They give various opinions, but say nothing about any specific passage being a 'prophecy'. \n \n And, the one thing you still have not acknowledged, not one of them thought that the messiah was 'Jesus of Nazareth\".", 
   {}, 
   385799, 
   null, 
   1263440820.0
  ], 
  [
   385903, 
   null, 
   "Easyrider", 
   "Was it? Funny, from the Jewish commentary on Sanhedrin 98, we get\n \n \n In the Gemora (Sanhedrin 98) there are four opinions as to what will be the name of Moshiach. Some say Menachem, others say Shilo, a third opinion is Yinun and a fourth view is Chanina. The first letter of each one of these four names spells Moshiach. We are all eagerly awaiting the revelation of the redeemer who will lead us out of Golus. Not knowing for sure what his name will be, we call him Moshiach which is an acronym of the four different names for the redeemer. \n \n \n It is merely a discussion about 'what will be the name of the Messiah' between 4 rabbi's. They give various opinions, but say nothing about any specific passage being a 'prophecy'. \n \n And, the one thing you still have not acknowledged, not one of them thought that the messiah was 'Jesus of Nazareth\".\n\n \n Big deal. You people didn't listen to Moses either.\n \n Take another lap around Mt. Sinai, Trebor.", 
   {}, 
   385807, 
   null, 
   1263513120.0
  ], 
  [
   385912, 
   null, 
   "trebor", 
   "Big deal. You people didn't listen to Moses either.\n \n Take another lap around Mt. Sinai, Trebor.\n\n \n This response makes you look so SMRT\n \n http://lolcat.com/images/lolcats/529.jpg", 
   {}, 
   385903, 
   null, 
   1263517620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The validity of prophecy", 
  "url": "http://www.4forums.com/political/religion-debates/13765-validity-prophecy.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13765, 
  "discussion_files": [
   [
    "25929.html", 
    "http://www.4forums.com/political/religion-debates/13765-validity-prophecy-print.html"
   ], 
   [
    "25930.html", 
    "http://www.4forums.com/political/religion-debates/13765-validity-prophecy-4-print.html"
   ], 
   [
    "25931.html", 
    "http://www.4forums.com/political/religion-debates/13765-validity-prophecy-3-print.html"
   ], 
   [
    "25932.html", 
    "http://www.4forums.com/political/religion-debates/13765-validity-prophecy-2-print.html"
   ]
  ], 
  "identifier": 13765
 }
]