[
 [
  [
   385561, 
   null, 
   "JPSartre12", 
   "Tell me honestly, if Rush Limbaugh or Trent Lott had said that Obama was a \"light-skinned\" African-American \"with no Negro dialect, unless he wanted to have one.\" do you think Obama and the Democrats would rally to their defense or call them redneck racists?\n \n So why is it that Harry Reid can make such statements with hardly a mention by the liberal press and a pass from the President?\n \n Once again, the liberal slant of the media is exposed.", 
   {
    "post_info": {
     "post_title": "Is Harry Reid a Redneck Racist?"
    }
   }, 
   null, 
   null, 
   1263259080.0
  ], 
  [
   385590, 
   null, 
   "OldSarge", 
   "Tell me honestly, if Rush Limbaugh or Trent Lott had said that Obama was a \"light-skinned\" African-American \"with no Negro dialect, unless he wanted to have one.\" do you think Obama and the Democrats would rally to their defense or call them redneck racists?\n \n So why is it that Harry Reid can make such statements with hardly a mention by the liberal press and a pass from the President?\n \n Once again, the liberal slant of the media is exposed.\n\n \n No just stupid in the Joe Biden type of stupidity. If the Juan William's are not jumping ugly then it must be good to go for the rest of us unwashed to say the same stuff. Of course we need to look at der schlickmeister telling Teddie \"a few years ago this guy would have been getting us coffee.\" That may be a tad worse IMHO.", 
   {}, 
   385561, 
   null, 
   1263289920.0
  ], 
  [
   385592, 
   null, 
   "Symbiote", 
   "Ethics in America have fundamentally devolved from the act-based ethics of the classical liberals (what did he do?) to the utilitarianism of a JS Mill (did it achieve desirable outcomes) to the intent based ethics of imagining whatever took place in someone's mind based on your stereotypes.\n \n A christian farmer mentions something about a black man? Racist. Rich Democrat? Not racist.", 
   {}, 
   385590, 
   null, 
   1263291180.0
  ], 
  [
   385594, 
   null, 
   "Archangel", 
   "Tell me honestly, if Rush Limbaugh or Trent Lott had said that Obama was a \"light-skinned\" African-American \"with no Negro dialect, unless he wanted to have one.\" do you think Obama and the Democrats would rally to their defense or call them redneck racists?\n \n So why is it that Harry Reid can make such statements with hardly a mention by the liberal press and a pass from the President?\n \n Once again, the liberal slant of the media is exposed.\n\n \n What this exposes is the hypocrisy and double standards which define the left today. Lot didn't even make a racist statement at all, he just made the comment that Strom Thurman would have made a good President in a toast at something like his 100th birthday party. And for that toast he was run out of the same office Reid currently holds. If Lott was guilty of racism, then surely Reid is yet Reid will get a pass from the hypocrites who are blind to their own double standards. emoticon_xgood", 
   {}, 
   385561, 
   null, 
   1263298020.0
  ], 
  [
   385600, 
   null, 
   "snakespit", 
   "What this exposes is the hypocrisy and double standards which define the left today. Lot didn't even make a racist statement at all, he just made the comment that Strom Thurman would have made a good President in a toast at something like his 100th birthday party. And for that toast he was run out of the same office Reid currently holds. If Lott was guilty of racism, then surely Reid is yet Reid will get a pass from the hypocrites who are blind to their own double standards. emoticon_xgood\n\n \n \"When Strom Thurmond ran for president, we voted for him. We&#8217;re proud of it. And if the rest of the country had followed our lead, we wouldn't have had all these problems over the years, either.\" -Trent Lott\n \n Given that Thurmond (not Thurman) ran as a segregationist...his comments seem a little more than just innocent praise. Read into them as you will. \n \n Also, taking into account the fact that Lott voted against renewing the civil rights act and the voting rights act...his comments take on an even darker (excuse the pun) tone. \n \n What Reid said was not the \"PC\" thing to say, certainly. The fact that Reid needed to mention \"light skinned\" or \"negro dialect\" at all is telling in and of itself. I wouldn't call it overtly racist...but I still don't see why he needs to make an exhibit of Obama's race. \n \n At the same time, people need to realize that much of the racism we cry foul about is simply false outrage that we conjour up in our own minds. In all honesty, if Obama is not offended, who cares? I'm not offended by either Lott or Reid...they have the right to say what they want. I have the right to not vote for them or listen to anything they have to say.", 
   {}, 
   385594, 
   null, 
   1263314640.0
  ], 
  [
   385622, 
   null, 
   "JPSartre12", 
   "\"When Strom Thurmond ran for president, we voted for him. We're proud of it. And if the rest of the country had followed our lead, we wouldn't have had all these problems over the years, either.\" -Trent Lott\n \n Given that Thurmond (not Thurman) ran as a segregationist...his comments seem a little more than just innocent praise. Read into them as you will. \n \n Also, taking into account the fact that Lott voted against renewing the civil rights act and the voting rights act...his comments take on an even darker (excuse the pun) tone. \n \n What Reid said was not the \"PC\" thing to say, certainly. The fact that Reid needed to mention \"light skinned\" or \"negro dialect\" at all is telling in and of itself. I wouldn't call it overtly racist...but I still don't see why he needs to make an exhibit of Obama's race. \n \n At the same time, people need to realize that much of the racism we cry foul about is simply false outrage that we conjour up in our own minds. In all honesty, if Obama is not offended, who cares? I'm not offended by either Lott or Reid...they have the right to say what they want. I have the right to not vote for them or listen to anything they have to say.\n\n \n My point in bringing it up in the first place was to show the liberal bias and tendency to give leftwingers a free pass when they say stupid things but crucify Republicans when they do the same. \n Lott made his comment at a party for Thurmond. It was a half-a$$ed attempt to make a joke.\n Another example of Dems getting a pass is Joe Biden's comment about Indians and 7-11's and Dunkin Donut stores. \n YouTube - Joe Biden's racist slip\n \n In my opinion, the media, and Washington in general, is too quick to punish the Right and too quick to absolve the Left.", 
   {
    "unicode_changes_made": true
   }, 
   385600, 
   null, 
   1263324780.0
  ], 
  [
   385642, 
   null, 
   "snakespit", 
   "My point in bringing it up in the first place was to show the liberal bias and tendency to give leftwingers a free pass when they say stupid things but crucify Republicans when they do the same. \n Lott made his comment at a party for Thurmond. It was a half-a$$ed attempt to make a joke.\n Another example of Dems getting a pass is Joe Biden's comment about Indians and 7-11's and Dunkin Donut stores. \n YouTube - Joe Biden's racist slip\n \n In my opinion, the media, and Washington in general, is too quick to punish the Right and too quick to absolve the Left.\n\n \n The media is merely a means of conveying the \"racist behavior\" to the public. I do agree that it often tends to gloss over stories involving democrats while harping on the republicans, but this is not the point I was making. My point is that each of us must decide if we view the actual behavior or comments as racism. I find that much of the outrage often seems to be simply based on partisan bias than actual disdain of racism. It is certainly fair to point out the hypocrisy of the media, but equally fair to point out the hypocrisy that lives in so many Americans.", 
   {}, 
   385622, 
   null, 
   1263336660.0
  ], 
  [
   385644, 
   null, 
   "JPSartre12", 
   "The media is merely a means of conveying the \"racist behavior\" to the public. I do agree that it often tends to gloss over stories involving democrats while harping on the republicans, but this is not the point I was making. My point is that each of us must decide if we view the actual behavior or comments as racism. I find that much of the outrage often seems to be simply based on partisan bias than actual disdain of racism. It is certainly fair to point out the hypocrisy of the media, but equal fair to point out the hypocrisy that lives in so many Americans.\n\n \n 100% agreement there. Feigned outrage is a joke from both sides of the aisle. The problem is that when Democrats yell racism the media jumps on the bandwagon, but when the Republicans yell racism for a similar statement, they rally their wagons around the Democrat. It's an inately unfair playing field.", 
   {}, 
   385642, 
   null, 
   1263337200.0
  ], 
  [
   385707, 
   null, 
   "simone", 
   "The question is ridiculous.", 
   {}, 
   385561, 
   null, 
   1263404880.0
  ], 
  [
   385709, 
   null, 
   "JPSartre12", 
   "The question is ridiculous.\n\n \n Only to a white liberal. Evidentally, it's not so ridiculous to Rev ML King's niece, though. She believes that it was Reid's way of calling Obama a \"house negro\" and explained where the term came from. \n \n \n\n '\"I don't care who said it,\" she told CNSNews.com. \"It doesn't matter to me. It's still wrong. It's outrageous to say that we are going to let a man have a position because he is light-skinned and he uses a Negro dialect when it is convenient.\n \n \"I think that's terrible,\" she said. \"What he's really saying is, 'Now we have a White House Negro.'\"\n \n \"A long time ago you had house Negros and field Negros. I don't think people are seeing it that way,\" King said in reference to terminology used during the time of American slavery. \"Basically, what he is saying is, if you have light skin and a particular education, we'll let you in the House. If not, you need to stay in the field. I'm sorry. That's what I hear.\"\n", 
   {
    "unicode_changes_made": true
   }, 
   385707, 
   null, 
   1263405420.0
  ], 
  [
   385711, 
   null, 
   "Ethmi", 
   "The question is ridiculous.\n\n \n Because it exposes the bias of the left?", 
   {}, 
   385707, 
   null, 
   1263405660.0
  ], 
  [
   385724, 
   null, 
   "JPSartre12", 
   "Because it exposes the bias of the left?\n\n \n Of course it does. Unfortunately, not all blacks are willing to play house negro for their elitist white liberal \"masters\" and say \"Is all right, masser Reid, we's forgives you\" ;)", 
   {}, 
   385711, 
   null, 
   1263411720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Harry Reid a Redneck Racist?", 
  "url": "http://www.4forums.com/political/politics-debates/13776-harry-reid-redneck-racist.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13776, 
  "discussion_files": [
   [
    "1290.html", 
    "http://www.4forums.com/political/politics-debates/13776-harry-reid-redneck-racist-print.html"
   ]
  ], 
  "identifier": 13776
 }
]