[
 [
  [
   385626, 
   null, 
   "JPSartre12", 
   "I found this article in the WSJ. It gives three examples of why the healthcare bills are unconstitutional. It was written by Sen. Orrin Hatch and others.\n \n \n\n Why the Health-Care Bills Are Unconstitutional \n If the government can mandate the purchase of insurance, it can do anything.\n \n By ORRIN G. HATCH, J. KENNETH BLACKWELL AND KENNETH A. KLUKOWSKI \n President Obama's health-care bill is now moving toward final passage. The policy issues may be coming to an end, but the legal issues are certain to continue because key provisions of this dangerous legislation are unconstitutional. Legally speaking, this legislation creates a target-rich environment. We will focus on three of its more glaring constitutional defects. \n \n First, the Constitution does not give Congress the power to require that Americans purchase health insurance. Congress must be able to point to at least one of its powers listed in the Constitution as the basis of any legislation it passes. None of those powers justifies the individual insurance mandate. Congress's powers to tax and spend do not apply because the mandate neither taxes nor spends. The only other option is Congress's power to regulate interstate commerce.\n \n Congress has many times stretched this power to the breaking point, exceeding even the expanded version of the commerce power established by the Supreme Court since the Great Depression. It is one thing, however, for Congress to regulate economic activity in which individuals choose to engage; it is another to require that individuals engage in such activity. That is not a difference in degree, but instead a difference in kind. It is a line that Congress has never crossed and the courts have never sanctioned. \n In fact, the Supreme Court in United States v. Lopez (1995) rejected a version of the commerce power so expansive that it would leave virtually no activities by individuals that Congress could not regulate. By requiring Americans to use their own money to purchase a particular good or service, Congress would be doing exactly what the court said it could not do.\n Some have argued that Congress may pass any legislation that it believes will serve the \"general welfare.\" Those words appear in Article I of the Constitution, but they do not create a free-floating power for Congress simply to go forth and legislate well. Rather, the general welfare clause identifies the purpose for which Congress may spend money. The individual mandate tells Americans how they must spend the money Congress has not taken from them and has nothing to do with congressional spending. \n \n A second constitutional defect of the Reid bill passed in the Senate involves the deals he cut to secure the votes of individual senators. Some of those deals do involve spending programs because they waive certain states' obligation to contribute to the Medicaid program. This selective spending targeted at certain states runs afoul of the general welfare clause. The welfare it serves is instead very specific and has been dubbed \"cash for cloture\" because it secured the 60 votes the majority needed to end debate and pass this legislation. \n \n A third constitutional defect in this ObamaCare legislation is its command that states establish such things as benefit exchanges, which will require state legislation and regulations. This is not a condition for receiving federal funds, which would still leave some kind of choice to the states. No, this legislation requires states to establish these exchanges or says that the Secretary of Health and Human Services will step in and do it for them. It renders states little more than subdivisions of the federal government.\n This violates the letter, the spirit, and the interpretation of our federal-state form of government. Some may have come to consider federalism an archaic annoyance, perhaps an amusing topic for law-school seminars but certainly not a substantive rule for structuring government. But in New York v. United States (1992) and Printz v. United States (1997), the Supreme Court struck down two laws on the grounds that the Constitution forbids the federal government from commandeering any branch of state government to administer a federal program. That is, by drafting and by deliberate design, exactly what this legislation would do. \n \n The federal government may exercise only the powers granted to it or denied to the states. The states may do everything else. This is why, for example, states may have authority to require individuals to purchase health insurance but the federal government does not. It is also the reason states may require that individuals purchase car insurance before choosing to drive a car, but the federal government may not require all individuals to purchase health insurance. \n This hardly exhausts the list of constitutional problems with this legislation, which would take the federal government into uncharted political and legal territory. Analysts, scholars and litigators are just beginning to examine the issues we have raised and other issues that may well lead to future litigation. \n America's founders intended the federal government to have limited powers and that the states have an independent sovereign place in our system of government. The Obama/Reid/Pelosi legislation to take control of the American health-care system is the most sweeping and intrusive federal program ever devised. If the federal government can do this, then it can do anything, and the limits on government power that our liberty requires will be more myth than reality. \n \n \n Mr. Hatch, a Republican senator from Utah, is a former chairman of the Senate Judiciary Committee. Mr. Blackwell is a senior fellow with the Family Research Council and a professor at Liberty University School of Law. Mr. Klukowski is a fellow and senior legal analyst with the American Civil Rights Union. Hatch, Blackwell and Klukowski: Why the Health-Care Bills Are Unconstitutional - WSJ.com \n", 
   {
    "post_info": {
     "post_title": "Why the Health-Care Bills Are Unconstitutional"
    }
   }, 
   null, 
   null, 
   1263325620.0
  ], 
  [
   385650, 
   null, 
   "44j", 
   "I found this article in the WSJ. It gives three examples of why the healthcare bills are unconstitutional. It was written by Sen. Orrin Hatch and others.\n\n \n I agree, I just do not understand how we can stop this bill when the Supreme Court is filled with liberals. They will not declare this unconstitutional even though they know it is because they all want what Obama wants and wants this bill to pass.", 
   {}, 
   385626, 
   null, 
   1263338640.0
  ], 
  [
   385654, 
   null, 
   "BKS01", 
   "It should be interesting reading if any of the Supreme Court justices are will to file briefs on their decisions. How can they possibly justify this horror.", 
   {}, 
   385650, 
   null, 
   1263349860.0
  ], 
  [
   385665, 
   null, 
   "JPSartre12", 
   "I agree, I just do not understand how we can stop this bill when the Supreme Court is filled with liberals. They will not declare this unconstitutional even though they know it is because they all want what Obama wants and wants this bill to pass.\n\n \n I don't consider this a liberal SCOTUS.", 
   {}, 
   385650, 
   null, 
   1263361560.0
  ], 
  [
   385670, 
   null, 
   "Steeeeve", 
   "As if anyone cares that the bill is unconstitutional. Sorry but that ship sailed many years ago and is lost at sea.\n \n And don't think the republicans didn't helped.", 
   {}, 
   385665, 
   null, 
   1263367320.0
  ], 
  [
   385676, 
   null, 
   "Archangel", 
   "Let's not forget the important special election which is taking place next tuesday on the 19th. Scott Brown of Massachusetts will be the 41st vote in the Senate if he wins, and what a message it will send to the dems when even the strongest democratic stronghold falls for the first time in over 40 years.\n He represents the first chance to break the filibuster proof majority currently enjoyed by Senate Democrats. Brown who enjoys the support of Massachusetts Citizens for Life represents a threat to the health care reform bill. So much so that the Boston Herald reports that should Scott Brown win Democrats will stall his swearing-in, in order to pass health-care reform. William Jacobson says that voters need to call the Democrats bluff:\n Scott Brown, the 41st Vote | Caffeinated Thoughts\n \n It would also expose their criminal leanings when they pull tricks like this in order to secure that vote if Brown does win.\n Voters need to call the Democrats' bluff. The deliberate delay of Brown's certification in order to push through the health care bill will cause a political explosion unlike anything we have seen before.\n \n There are certain red lines which no one has crossed before. And refusing to seat a duly elected Senator, for the sole purpose of excluding that Senator from voting on a particular piece of legislation, crosses that line.\n \n Democrats are threatening to break the democratic links which bind us as a nation. The electoral outrage at such a tactic will be generational, and the Democratic leadership in Washington knows it.\n \n If on the day of the health care vote, the duly elected Scott Brown shows up at the Senate to claim his seat for the vote, will Harry Reid instruct the Capitol Police to bar Brown from the chamber and from casting his vote? Will that be the legacy of health care \"reform\"? \n The voters of Massachusetts need to call the Democrats bluff on this.\n \n Will we have a revolution in Massachusetts underfoot? One can only hope so. Massachusetts has been a Democrat stronghold in a larger Northeast bastion of liberalism (where even the Republicans are largely liberal, Senator Judd Gregg (R-NH) notwithstanding, but he's retiring), but this race has become a losable race for the Democrats.", 
   {
    "unicode_changes_made": true
   }, 
   385670, 
   null, 
   1263384180.0
  ], 
  [
   385794, 
   null, 
   "44j", 
   "Let's not forget the important special election which is taking place next tuesday on the 19th. Scott Brown of Massachusetts will be the 41st vote in the Senate if he wins, and what a message it will send to the dems when even the strongest democratic stronghold falls for the first time in over 40 years.\n He represents the first chance to break the filibuster proof majority currently enjoyed by Senate Democrats. Brown who enjoys the support of Massachusetts Citizens for Life represents a threat to the health care reform bill. So much so that the Boston Herald reports that should Scott Brown win Democrats will stall his swearing-in, in order to pass health-care reform. William Jacobson says that voters need to call the Democrats bluff:\n Scott Brown, the 41st Vote | Caffeinated Thoughts\n \n It would also expose their criminal leanings when they pull tricks like this in order to secure that vote if Brown does win.\n Voters need to call the Democrats' bluff. The deliberate delay of Brown's certification in order to push through the health care bill will cause a political explosion unlike anything we have seen before.\n \n There are certain red lines which no one has crossed before. And refusing to seat a duly elected Senator, for the sole purpose of excluding that Senator from voting on a particular piece of legislation, crosses that line.\n \n Democrats are threatening to break the democratic links which bind us as a nation. The electoral outrage at such a tactic will be generational, and the Democratic leadership in Washington knows it.\n \n If on the day of the health care vote, the duly elected Scott Brown shows up at the Senate to claim his seat for the vote, will Harry Reid instruct the Capitol Police to bar Brown from the chamber and from casting his vote? Will that be the legacy of health care \"reform\"? \n The voters of Massachusetts need to call the Democrats bluff on this.\n \n Will we have a revolution in Massachusetts underfoot? One can only hope so. Massachusetts has been a Democrat stronghold in a larger Northeast bastion of liberalism (where even the Republicans are largely liberal, Senator Judd Gregg (R-NH) notwithstanding, but he's retiring), but this race has become a losable race for the Democrats.\n\n \n These are the unspeakable horrors that will be established unless we as citizens take drastic action and vote more republicans into office. Once people see the democrats real plan then they will realize what a mistake they made in the 2008 presidential elections and change their minds. At least, I hope.", 
   {
    "unicode_changes_made": true
   }, 
   385676, 
   null, 
   1263433320.0
  ], 
  [
   385795, 
   null, 
   "JPSartre12", 
   "These are the unspeakable horrors that will be established unless we as citizens take drastic action and vote more republicans into office. Once people see the democrats real plan then they will realize what a mistake they made in the 2008 presidential elections and change their minds. At least, I hope.\n\n \n IMO, we shouldn't automatically vote Republicans into office. They have shown the same disregard for fiscal constraint that the Democrats have. We need a \"real\" Conservative party.", 
   {}, 
   385794, 
   null, 
   1263433800.0
  ], 
  [
   385796, 
   null, 
   "44j", 
   "IMO, we shouldn't automatically vote Republicans into office. They have shown the same disregard for fiscal constraint that the Democrats have. We need a \"real\" Conservative party.\n\n \n Well, what do you mean by real? More educated, less corrupt members?", 
   {}, 
   385795, 
   null, 
   1263434220.0
  ], 
  [
   385811, 
   null, 
   "BKS01", 
   "JMO Morals and integrity", 
   {
    "post_info": {
     "post_title": "Real Conservatives"
    }
   }, 
   385796, 
   null, 
   1263448800.0
  ], 
  [
   385824, 
   null, 
   "Archangel", 
   "IMO, we shouldn't automatically vote Republicans into office. They have shown the same disregard for fiscal constraint that the Democrats have. We need a \"real\" Conservative party.\n\n \n \nWell, what do you mean by real? More educated, less corrupt members?\n\n \n \nJMO Morals and integrity\n\n \n I wish that Brown was running as an Independent, he would be even more attractive to me then. I wish we had Independents running in every single upcoming race because I would vote for them across the board in order to vote out as many Democrats and Republicans as possible. \n \n But since the two parties manipulated the system back in the 90s effectively eliminating the possibility of a third party incursion, the only option we have is to go back to the Republicans who are the lesser of two evils but in no way the ideal party. At least they will reverse this mindless drive toward absolute bankruptcy via an economic collapse. emoticon_xdonno", 
   {}, 
   385811, 
   null, 
   1263470040.0
  ], 
  [
   385832, 
   null, 
   "JPSartre12", 
   "Well, what do you mean by real? More educated, less corrupt members?\n\n \n I mean politicians that give more than lip service to the Constitution and its Conservative meaning. \n For example, the great \"Conservative Revolution\" in the 1994 Congressional Election had exactly what impact on governmental deficit spending? They were able to balance the budget for what.... 1 year? They couldn't even defund the NEA!\n When Bush came in after running as a Conservative, the first thing he did was get in bed with Ted Kennedy and come up with No Child Left Behind. \n Since that time, the Republican Party has outspend previous liberal Congresses.\n \n \nJMO Morals and integrity\n\n \n That's not enough. They also need to have a strong Conservative philosophy that is unswayed by popular opinion. If our politicians were more interested in doing the right thing rather than doing the politically-correct thing to get re-elected, we'd have a better government. Bring back the citizen legislator and get rid of the career politician! emoticon_angry\n \n \nI wish that Brown was running as an Independent, he would be even more attractive to me then. I wish we had Independents running in every single upcoming race because I would vote for them across the board in order to vote out as many Democrats and Republicans as possible. \n \n But since the two parties manipulated the system back in the 90s effectively eliminating the possibility of a third party incursion, the only option we have is to go back to the Republicans who are the lesser of two evils but in no way the ideal party. At least they will reverse this mindless drive toward absolute bankruptcy via an economic collapse. emoticon_xdonno\n\n \n We need a third party. We can't keep expecting Republicans to do the right thing. They have no recent track record, as a party, of being any different from the liberals in Congress. The only difference is in what programs they choose to spend America's future earnings on. :xcensored", 
   {}, 
   385824, 
   null, 
   1263483540.0
  ], 
  [
   385895, 
   null, 
   "44j", 
   "I mean politicians that give more than lip service to the Constitution and its Conservative meaning. \n For example, the great \"Conservative Revolution\" in the 1994 Congressional Election had exactly what impact on governmental deficit spending? They were able to balance the budget for what.... 1 year? They couldn't even defund the NEA!\n When Bush came in after running as a Conservative, the first thing he did was get in bed with Ted Kennedy and come up with No Child Left Behind. \n Since that time, the Republican Party has outspend previous liberal Congresses.\n \n \n \n That's not enough. They also need to have a strong Conservative philosophy that is unswayed by popular opinion. If our politicians were more interested in doing the right thing rather than doing the politically-correct thing to get re-elected, we'd have a better government. Bring back the citizen legislator and get rid of the career politician! emoticon_angry\n \n \n \n We need a third party. We can't keep expecting Republicans to do the right thing. They have no recent track record, as a party, of being any different from the liberals in Congress. The only difference is in what programs they choose to spend America's future earnings on. :xcensored\n\n \n Well as Archangel said, they will stop this giant government spending and stopped raising the national debt.", 
   {}, 
   385832, 
   null, 
   1263507960.0
  ], 
  [
   385906, 
   null, 
   "BKS01", 
   "I know this has morphed from the original question but how about politicians who do what they were originally intened to do!\n When the congress was originally established the people of an area sent a person from their area to vote what a majority of the wanted. They did not neccasarily care what that persons individual opinion was. Give me a candidate who will vote and represent what the majority from his are decide despite his personal beliefs and I will help re-elect him as long as he runs.\n The government was designed to be for the people and by the people!!\n \n This would require morals and integrity!!", 
   {}, 
   385895, 
   null, 
   1263514560.0
  ], 
  [
   385917, 
   null, 
   "Archangel", 
   "I know this has morphed from the original question but how about politicians who do what they were originally intened to do!\n When the congress was originally established the people of an area sent a person from their area to vote what a majority of the wanted. They did not neccasarily care what that persons individual opinion was. Give me a candidate who will vote and represent what the majority from his are decide despite his personal beliefs and I will help re-elect him as long as he runs.\n The government was designed to be for the people and by the people!!\n \n This would require morals and integrity!!\n\n \n This is a beautiful thought and I believe what originally existed in american politics. Unfortunately, what we have today are two monolithic parties which have agendas which have nothing to do with what the citizens of the individual districts want. I fully accept that Junior congressmen and senators go to Washington with honorable ideals to serve the interests of the people who elected them. But they soon find out they are a member of a large yet very private club of deal makers and players who are playing a chess game which leaves the local constituents in the proverbial dust. \n \n To think that the dems are writing into the healthcare bill the stipulation that future administrations and congresses can't undo what they have created is such a perversion of what is legal or constitutional, yet the arrogance of these people allows them to believe they can do it without answering to the people who elected them. Here's a story from todays News regarding another deal Obama made with Unions in order to ram this bill through.\n \n Democrats, Unions Reach Deal on Health Tax - WSJ.com\n \n Just look at the increased fees being considered and ask yourself if they wont be passed on to the consumers in the end? The answer is of course they will. These people are so out of touch with reality, and so committed to their agenda that they will ignore the long term consequences of their actions at all cost and with no concern at all for how this will affect the economy, america's healthcare industry or peoples ability to pay. Here's an excerpt from the posted link to show what I mean.\n To make up for the lost revenue-and to increase subsidies for lower earners to buy health insurance-negotiators are considering increasing the financial hit on drug makers, nursing homes and medical-device makers, according to people familiar with the discussions.\n \n Democrats are considering levying an additional $10 billion in fees on medical-device makers , for a total of $30 billion over 10 years, according to people familiar with the matter. Both the House and Senate bills called for about $20 billion in new fees for the industry.\n \n Congressional negotiators have also told drug makers they are considering decreasing reimbursements or increasing fees by an additional $10 billion over a decade, beyond the $80 billion in concessions the industry agreed to under a deal last year with the White House and the Senate Finance Committee, according to people familiar with the negotiations. And lawmakers are looking to push fees on nursing homes past the $14.6 billion over a decade that is in the Senate version.", 
   {
    "unicode_changes_made": true
   }, 
   385906, 
   null, 
   1263523200.0
  ], 
  [
   387156, 
   null, 
   "OldSarge", 
   "Unable to find the Constitution's \"Health-care Clause,\" which clearly outlines the government's role to forcibly provide health care for every citizen, some liberals are making the argument that providing universal health care is a moral duty. Since many of those same liberals are atheists, agnostics or, at the very least, strongly opposed to traditional religious values, we must ask: What is the basis of secular liberal morality? \n \n A belief in morals infers a belief in right and wrong. Deciding whether something is right or wrong means that there must be some kind of moral standard and a corresponding judgment as to whether a particular behavior complies with that standard. If an act is consistent with that particular standard, it is moral behavior. If it deviates from that standard, it is immoral. \n \n For most Americans, the source of morality is easy to identify - it comes from religion. When Christians, for example, are confronted with a question regarding morality, The Bible gives them a standard by which they can make decisions. \n \n What, then, is the moral standard for liberals who discard Christian and other religious guidance? If a liberal is thinking of committing, say, adultery or murder, what moral standard tells them it is wrong to do so? \n \n The dirty little secret of secular liberals is that they don't have a moral standard. No identifiable source affirmatively tells them what conduct is moral. Put quite simply, liberals don't believe in anything. \n \n If liberals don't believe in anything, you may ask, what is the basis of their politics? That's easy. While liberals don't believe in anything, they do believe against things. In other words, liberals have no independent moral philosophy - they merely look to traditional American or Christian views and oppose them. \n \n Most liberals argue that without universal health care, the \"rich\" are able to afford good health insurance, while the \"poor\" are not. Assuming, for the sake of argument, that the poor can't afford health insurance, why do liberals think this is wrong? \n \n Liberals say: \"Because it isn't fair.\" Why not? Saying that something isn't fair implies that there's a standard by which fairness can be judged. However, without a source of moral guidelines, how can liberals say that anything is unfair? They can't. \n \n Another popular liberal argument is that we have to be compassionate toward those without proper health care. After all, we can't have people dying in the streets, can we? Why not? What moral standard tells liberals that they have to be compassionate or help their fellow man? There is none. \n \n The lack of any affirmative morality is the Achilles' heel of liberalism. It exposes the intellectual bankruptcy of the left and the logical inability of liberals to make any moral arguments regarding health care, or any other issue. God help them. \n \n The myth of liberal morality\n \n With the embrace of moral relativism and situational ethic the left lost its moral compass. So for a leftist to claim the moral high ground is simply absurd. ", 
   {
    "post_info": {
     "post_title": "The myth of liberal morality"
    }, 
    "unicode_changes_made": true
   }, 
   385917, 
   null, 
   1264250820.0
  ], 
  [
   387161, 
   null, 
   "Archangel", 
   "Unable to find the Constitution's \"Health-care Clause,\" which clearly outlines the government's role to forcibly provide health care for every citizen, some liberals are making the argument that providing universal health care is a moral duty. Since many of those same liberals are atheists, agnostics or, at the very least, strongly opposed to traditional religious values, we must ask: What is the basis of secular liberal morality? \n \n A belief in morals infers a belief in right and wrong. Deciding whether something is right or wrong means that there must be some kind of moral standard and a corresponding judgment as to whether a particular behavior complies with that standard. If an act is consistent with that particular standard, it is moral behavior. If it deviates from that standard, it is immoral. \n \n For most Americans, the source of morality is easy to identify - it comes from religion. When Christians, for example, are confronted with a question regarding morality, The Bible gives them a standard by which they can make decisions. \n \n What, then, is the moral standard for liberals who discard Christian and other religious guidance? If a liberal is thinking of committing, say, adultery or murder, what moral standard tells them it is wrong to do so? \n \n The dirty little secret of secular liberals is that they don't have a moral standard. No identifiable source affirmatively tells them what conduct is moral. Put quite simply, liberals don't believe in anything. \n \n If liberals don't believe in anything, you may ask, what is the basis of their politics? That's easy. While liberals don't believe in anything, they do believe against things. In other words, liberals have no independent moral philosophy - they merely look to traditional American or Christian views and oppose them. \n \n Most liberals argue that without universal health care, the \"rich\" are able to afford good health insurance, while the \"poor\" are not. Assuming, for the sake of argument, that the poor can't afford health insurance, why do liberals think this is wrong? \n \n Liberals say: \"Because it isn't fair.\" Why not? Saying that something isn't fair implies that there's a standard by which fairness can be judged. However, without a source of moral guidelines, how can liberals say that anything is unfair? They can't. \n \n Another popular liberal argument is that we have to be compassionate toward those without proper health care. After all, we can't have people dying in the streets, can we? Why not? What moral standard tells liberals that they have to be compassionate or help their fellow man? There is none. \n \n The lack of any affirmative morality is the Achilles' heel of liberalism. It exposes the intellectual bankruptcy of the left and the logical inability of liberals to make any moral arguments regarding health care, or any other issue. God help them. \n \n The myth of liberal morality\n \n With the embrace of moral relativism and situational ethic the left lost its moral compass. So for a leftist to claim the moral high ground is simply absurd. \n\n \n My compliments on posting an excellent thesis Sarge. Truer words were never spoken which should drive the secular humanist and atheist leftists here completely apoplectic because as we both know, they hate the truth.", 
   {
    "unicode_changes_made": true
   }, 
   387156, 
   null, 
   1264259340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why the Health-Care Bills Are Unconstitutional", 
  "url": "http://www.4forums.com/political/health-debates/13779-why-health-care-bills-unconstitutional.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13779, 
  "discussion_files": [
   [
    "6204.html", 
    "http://www.4forums.com/political/health-debates/13779-why-health-care-bills-unconstitutional-print.html"
   ], 
   [
    "6205.html", 
    "http://www.4forums.com/political/health-debates/13779-why-health-care-bills-unconstitutional-2-print.html"
   ]
  ], 
  "identifier": 13779
 }
]