[
 [
  [
   386970, 
   null, 
   "Penfold", 
   "\" Former Democratic presidential candidate John Edwards has finally come forward to admit that he fathered a child with a videographer that he hired before his second White House bid. \"\n \n He strayed, denied it for a while, but now admits paternity and is paying up. A closet republican! Who Knew? \n \n Edwards admits he's the father of Hunter's child - washingtonpost.com", 
   {
    "post_info": {
     "post_title": "John Edwards. Closet Republican!"
    }
   }, 
   null, 
   null, 
   1264135800.0
  ], 
  [
   386973, 
   null, 
   "snakespit", 
   "No Penfold, if he was a closet republican, he would be a fat, drunk, rape-endorsing pig...just like Ted Kennedy was. :)", 
   {}, 
   386970, 
   null, 
   1264136700.0
  ], 
  [
   386976, 
   null, 
   "Archangel", 
   "Really? Are you suggesting he is unique as a democrat in a scandalous situation?\n Democrat scandals you wouldn't hear from the liberal mainstream media\n h1\n Below is a list of scandals involving leaders of the Democrat Party. 95% of which have probably never been mentioned by the liberal biased mainstream media. The republican list, which is a fraction the size of this list has been beaten to death by the liberal biased mainstream media.\n William Jefferson Clinton was barred from practicing law in his home state after being impeached. He was not tried as prescribed in the Constitution.\n \n \n It is true that the letter \"W\" was removed from White House typewriters and computer keyboards during Clinton's last days in office. While it may be true that the letter \"W\" was scratched into the famous desk in the Oval Office, it was reported that incoming president George Bush said that it looked to him like an \"M\".\n \n Neil Goldschmidt - Democrat - Oregon governor. Admitted to having an illegal sexual relationship with a 14-year-old teenager while he was serving as Mayor of Portland.\n \n Barney Frank - Democrat - U.S. Representative from Massachusetts. Admitted to having paid Stephen L. Gobie, a male prostitute, for sex and subsequently hiring Gobie as his personal assistant. Gobie used the congressman's Washington apartment for prostitution.\n \n Jerry Springer - Democrat - Resigned from Cincinnati City Council in 1974 after admitting to paying a prostitute with a personal check, which was found in a police raid on a massage parlor.\n \n Melvin Jay Reynolds - U.S. Representative from Illinois from 1993 to 1995. Convicted on sexual misconduct and obstruction of justice charges and sentenced to five years in prison.\n \n Former New Jersey Governor James McGreevey resigned his office and publically admitted his relationship with his croney/lover Golan Cipel who resigned from a $100,000/yr job created by McGreevey.\n \n Edward Kennedy - Democrat - U. S. Senator from Massachusetts. Pleaded guilty to leaving the scene of an accident, after his car plunged off a bridge on Chappaquiddick Island killing passenger Mary Jo Kopechne.\n \n DNC - The Federal Election Commission imposed $719,000 in fines against participants in the 1996 Democratic Party fundraising scandals involving contributions from China, Korea and other foreign sources. The Federal Election commission said it decided to drop cases against contributors of more than $3 million in illegal DNC contributions\n because the respondents left the country or the corporations are defunct.\n \n Sandy Berger - Democrat - National Security Advisor during the Clinton Administration. Berger became the focus of a criminal investigation after removing highly classified terrorism documents and handwritten notes from the National Archives during preparations for the Sept. 11 commission hearings.\n \n Robert Torricelli - Democrat - Withdrew from the 2002 Senate race with less than 30 days before the election because of controversy over personal gifts he took from a major campaign donor and questions about campaign donations from 1996.\n \n Sowande Ajumoke Omokunde - Democrat - the son of newly elected U.S. Rep. Gwen Moore, was booked on charges of criminal damage to property for allegedly slashing tires on 20 vans and cars rented by the Republican Party for use in Election Day voter turnout efforts.\n \n Daniel David Rostenkowski - Democrat - U.S. Representative from Illinois. Indicted on 17 felony charges- pleaded guilty to two counts of misuse of public funds and sentenced to seventeen months in federal prison.\n \n Charles Coles Diggs, Jr. - Democrat - U.S. Representative from Michigan from 1955 to 1980. Convicted on eleven counts of mail fraud and filing false payroll forms- sentenced to three years in prison.\n \n George Rogers - Democrat - Massachusetts State House of Representatives from 1965 to 1970. Member of Massachusetts State Senate from 1975 to 1978. Convicted of bribery in 1978 and sentenced to two years in prison.\n \n Don Siegelman - Democrat Governor Alabama - indicted in a bid-rigging scheme involving a maternity-care program. The charges accused Siegelman and his former chief of staff of helping Tuscaloosa physician \n Phillip Bobo rig bids. Siegelman was accused of moving $550,000 from the state education budget to the State Fire College in Tuscaloosa so Bobo could use the money to pay off a competitor for a state contract for maternity care.\n \n John Murtha, Jr. - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting, in which FBI agents impersonating Arab businessmen offered bribes to political figures; Murtha was cited as an unindicted co-conspirator\n \n Gerry Eastman Studds - Democrat - U.S. Representative from Massachusetts. The first openly gay member of Congress. Censured by the House of Representatives for having sexual relations with a teenage House page.\n \n James C. Green - Democrat - North Carolina State House of Representatives. Charged with accepting a bribe from an undercover FBI agent, but was acquitted. Convicted of tax evasion in 1997.\n \n Frederick Richmond - Democrat - U.S. Representative from New York. Arrested in Washington, D.C., in 1978 for soliciting sex from a minor and from an undercover police officer - pleaded guilty to a misdemeanor. Also - charged with tax evasion, marijuana possession, and improper payments to a federal employee - pleaded guilty.\n \n Raymond Lederer - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and sentenced to three years in prison and fined $20,000.\n \n Harrison Arlington Williams, Jr. - Democrat - U.S. Senator from New Jersey. Implicated in the Abscam sting. Allegedly accepted an 18% interest in a titanium mine. Convicted of nine counts of bribery, conspiracy, receiving an unlawful gratuity, conflict of interest, and interstate travel in aid of racketeering. Sentenced to three years in prison and fined $50,000.\n \n Frank Thompson, Jr. - Democrat - U.S. Representative from New Jersey. Implicated in the Abscam sting, convicted on bribery and conspiracy charges. Sentenced to three years in prison.\n \n Michael Joseph Myers - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and conspiracy; sentenced to three years in prison and fined $20,000; expelled from the House of Representatives.\n \n John Michael Murphy - Democrat - U.S. Representative from New York. Implicated in the Abscam sting. Convicted of conspiracy, conflict of interest, and accepting an illegal gratuity. Sentenced to three years in prison and fined $20,000.\n \n John Wilson Jenrette, Jr - Democrat - U.S. Representative from South Carolina. Implicated in the Abscam sting. Convicted on bribery and conspiracy charges and sentenced to prison\n \n Alcee Lamar Hastings - Democrat - U.S. Representative from Florida. Impeached and removed from office as federal judge in 1989 over bribery charges.\n \n Marion Barry - Democrat - mayor of Washington, D.C. Convicted of cocaine possession after being caught on videotape smoking crack cocaine. Sentenced to six months in prison.\n \n Mario Biaggi - Democrat - U.S. Representative from New York. Indicted on federal charges that he had accepted bribes in return for influence on federal contracts.Convicted of obstructing justice and accepting illegal gratuities. Tried in 1988 on federal racketeering charges and convicted on 15 felony counts.\n \n Lee Alexander - Democrat - Mayor of Syracuse, N.Y. Was indicted over a $1.5 million kickback scandal. Pleaded guilty to racketeering and tax evasion charges. Served six years in prison.\n \n Bill Campbell - Democrat - Mayor of Atlanta. Indicted and charged with fraud over claims he accepted improper payments from contractors seeking city contracts.\n \n Frank Ballance - Democrat - Congressman North Carolina. Pleaded guilty to one charge of conspiracy to commit mail fraud and money laundering related to mishandling of money by his charitable foundation.\n \n Hazel O'Leary - Democrat - Secretary of Energy during the Clinton Administration - O'leary took trips all over the world as Secretary with as many 50 staff members and at times rented a plane, which was used by Madonna during her concert tours.\n \n Mary Rose Oakar - Democrat - U.S. Representative from Ohio from 1977 to 1993.\n Pleaded guilty to two misdemeanor charges of funneling $16,000 through fake donors.\n \n David Giles - Democrat - candidate for U.S. Representative from Washington. Convicted in June 2000 of child rape.\n \n Gary Siplin - Democrat state senator Florida- found guilty of third-degree grand theft of $5,000 or more, a felony, and using services of employees for his candidacy.\n \n Edward Mezvinsky - Democrat - U.S. Representative from Iowa. Indicted on 56 federal fraud charges.\n \n Lena Swanson - Democrat - Member of Washington State Senate. Pleaded guilty to charges of soliciting unlawful payments from veterans and former prisoners of war.\n \n Abraham J. Hirschfeld - Democrat - candidate in Democratic primary for U.S. Senator from New York in 1974 and 1976. Offered Paula Jones $1 million to drop her sexual harassment lawsuit against President Bill Clinton. Convicted in 2000 of trying to hire a hit man to kill his business partner.\n \n Henry Cisneros - Democrat - U.S. Secretary of Housing and Urban Development from 1993 to 1997. Pleaded guilty to a misdemeanor charge of lying to the FBI.\n \n James A. Traficant Jr. - Member of House of Representatives from Ohio. Expelled from Congress after being convicted of corruption charges. Sentenced today to eight years in prison for accepting bribes and kickbacks.\n \n John Doug Hays - Democrat - member of Kentucky State Senate. Found guilty of mail fraud for submitting false campaign reports stemming from an unsuccessful run for judge. He was sentenced to six months in prison to be followed by six months of home confinement and three years of probation.\n \n Henry J. Cianfrani - Democrat - Pennsylvania State Senate. Convicted on federal charges of racketeering and mail fraud for padding his Senate payroll. Sentenced to five years in federal prison.\n \n David Hall - Democrat - Governor of Oklahoma. Indicted on extortion and conspiracy charges. Convicted and sentenced to three years in prison.\n \n John A. Celona - Democrat - A former state senator was charged with the three counts of mail fraud. Federal prosecutors accused him of defrauding the state and collecting hundreds of thousands of dollars from CVS Corp. and others while serving in the legislature. Celona has agreed to plead guilty to taking money from the CVS pharmacy\n chain and other companies that had interest in legislation. Under the deal, Celona agreed to cooperate with investigators. He faces up to five years in federal prison on each of the three counts and a $250,000 fine\n \n Allan Turner Howe - Democrat - U.S. Representative from Utah. Arrested for soliciting a policewoman posing as a prostitute.\n \n Jerry Cosentino - Democrat - Illinois State Treasurer. Pleaded guilty to bank fraud - fined $5,000 and sentenced to nine months home confinement.\n \n Joseph Waggonner Jr. - Democrat - U.S. Representative from Louisiana. Arrested in Washington, D.C. for soliciting a policewoman posing as a prostitute\n \n Albert G. Bustamante - Democrat - U.S. Representative from Texas. Convicted in 1993 on racketeering and bribery charges and sentenced to prison.\n \n Lawrence Jack Smith - Democrat - U.S. Representative from Florida. Sentenced to three months in federal prison for tax evasion.\n \n David Lee Walters - Democrat - Governor of Oklahoma. Pleaded guilty to a misdemeanor election law violation.\n \n James Guy Tucker, Jr. - Democrat - Governor of Arkansas. Resigned in July 1996 after conviction on federal fraud charges as part of the Whitewater investigation.\n \n Walter Rayford Tucker - Democrat - Mayor of Compton, California from 1991 to 1992; U.S. Representative from California from 1993 to 1995. Sentenced to 27 months in prison for extortion and tax evasion.\n \n William McCuen - Democrat - Secretary of State of Arkansas. Admitted accepting kickbacks from two supporters he gave jobs, and not paying taxes on the money. Admitted to conspiring with a political consultant to split $53,560 embezzled from the state in a sham transaction. He was indicted on corruption charges. Pleaded guilty to felony counts tax evasion and accepting a kickback. Sentenced to 17 years in prison.\n \n Walter Fauntroy - Democrat - Delegate to U.S. Congress from the District of Columbia. Charged in federal court with making false statements on financial disclosure forms. Pleaded guilty to one felony count and sentenced to probation.\n \n Carroll Hubbard, Jr. - Democrat - Kentucky State Senate from 1968 to 1975 and U.S. Representative from Kentucky from 1975 to 1993. Pleaded guilty to conspiring to defraud the Federal Elections Commission and to theft of government property; sentenced to\n \n Joseph Kolter - Democrat - member of Pennsylvania State House of Representatives from 1969 to 1982 and U.S. Representative from Pennsylvania from 1983 to 1993. Indicted by a Federal grand jury on five felony charges of embezzlement at the U.S. House post office. Pleaded guilty.\n \n Webster Hubbell - Democrat - Chief Justice of Arkansas State Supreme Court in 1983. Pleaded guilty to federal mail fraud and tax evasion charges - sentenced to 21 months in prison.\n \n Nicholas Mavroules - Democrat - U.S. Representative from Massachusetts from 1979 to 1993. Pleaded guilty to charges of tax fraud and accepting gratuities while in office.\n \n Carl Christopher Perkins - Democrat - Kentucky State House of Representatives from 1981 to 1984 and U.S. Representative from Kentucky from 1985 to 1993. Pleaded guilty to bank fraud in connection with the House banking scandal. Perkins wrote overdrafts totaling about $300,000. Pleaded guilty to charges of filing false statements with the\n Federal Election Commission and false financial disclosure reports. Sentenced to 21 months in prison.\n \n Richard Hanna - Democrat - U.S. Representative from California from 1963 to 1974. Received payments of about $200,000 from a Korean businessman in what became known as the \"Koreagate\" influence buying scandal. Pleaded guilty and sentenced to federal prison.\n \n Angelo Errichetti - Democrat - New Jersey State Senator was sentenced to six years in prison and fined $40,000 for his involvement in Abscam.\n Daniel Baugh Brewster - Democrat - U.S. Senator from Maryland. Indicted on charges of accepting illegal gratuity while in Senate.\n \n Thomas Joseph Dodd - Democrat - U.S. Senator from Connecticut. Censured by the Senate for financial improprieties, having diverted $116,000 in campaign and testimonial funds to his own use.\n \n Edward Fretwell Prichard, Jr. - Democrat - Delegate to Democratic National Convention from Kentucky. Convicted of vote fraud in federal court in connection with ballot-box stuffing. Served five months in prison.\n \n Guy Hamilton Jones, Sr. - Democrat -Arkansas State Senate. Convicted on federal tax charges and expelled from the Arkansas Senate.\n \n Daniel Flood - Democrat - U.S. Representative from Pennsylvania from 1945 to 1947, 1949 to 1953 and 1955 to 1980. Pleaded guilty to a conspiracy charge involving payoffs and sentenced to probation.\n \n Otto Kerner, Jr - Democrat - Governor of Illinois from 1961 to 1968. While serving as Governor, he and another official made a gain of over $300,000 in a stock deal. Convicted on 17 counts of bribery, conspiracy, perjury, and related charges. Sentenced to three years in federal prison and fined $50,000.\n \n George Crockett, Jr. - Democrat - U.S. Representative from Michigan. Served four months in federal prison for contempt of court following his defense of a Communist leader on trial for advocating the overthrow of the government.\n \n Cornelius Edward Gallagher - Democrat - U.S. Representative from New Jersey from 1959 to 1973. Indicted on federal charges of income tax evasion, conspiracy, and perjury.\n \n Mark B. Jimenez - Democrat fundraiser - sentenced to 27 months in prison on charges of tax evasion and conspiracy to defraud the United States and commit election financing offenses.\n \n Bobby Lee Rush - Democrat - U.S. Representative from Illinois. As a Black Panther, spent six months in prison on a weapons charge.\n \n Bolley \"Bo\" Johnson - Democrat - Former Florida House Speaker - received a two-year term for tax evasion.\n \n Roger L. Green - Democrat - Brooklyn Democrat Assemblyman. Pleaded guilty to a misdemeanor for accepting travel reimbursement for trips he did not pay for and was sentenced to fines and probation.\n \n Gloria Davis - Democrat - Bronx assemblywoman. Pleaded guilty to second-degree bribe-taking.\n \n Jim Johnson former chief of Fannie Mae, Obama advisor, and longtime Democratic Party power broker, and one of the Countrywide Six.\n \n Franklin Delano Raines, the former chairman and chief executive officer of Fannie Mae who served as White House budget director under President Bill Clinton, and one of the Countrywide Six.\n \n Donna Shalala, former Secretary of Health and Human Services, who in 1993, the Association of American Physicians and Surgeons, along with several other groups, filed a lawsuit against Donna Shalala over closed-door meetings related to the HillaryCare socialized health care plan, and since leaving the administration was embroiled in scandals\n at the University of Florida due to her extravagant lifestyle at the University's expense. She was also one of the Countrywide Six.\n \n Richard Holbrooke, former U.N. ambassador and assistant Secretary of State, who as U.N. Ambassador ignored whistleblower reports about the infamous Oil-for-Food scandals, and joined the Countrywide Six.\n \n Senator Christopher Dodd - D. Connecticut, who oversees the U.S. mortgage industry as chairman of the Senate Banking Committee, also a member of the Countrywide Six.\n \n Gaylord Kent Conrad - D. North Dakota, the chairman of the Senate Budget Committee and one of the first politicians to support Obama over Hillary. Plus, he was a member of the Countrywide Six.\n \n ROD BLAGOJEVICH, Governor of Illinois, stated that the Senate seat \"is a f'ing valuable thing, you just don't give it away for nothing.\" He had a good friend, too.\n \n Tony Rezko \"assisted Blagojevich in setting up the state's first Democratic administration in twenty years. Rezko was able to have business associates appointed onto several state boards. Rezko and several others were indicted on federal charges in October 2006, for using their connections to the state boards to demand kickbacks from\n businesses that wanted to do business with the state. While the others pleaded guilty to the charges, Rezko pleaded not guilty and was found guilty of 16 of the 24 charges filed against him.\" (Wiki)\n A federal grand jury is investigating how a company that advised Jefferson County, Alabama, on bond deals that threaten to cause the biggest municipal bankruptcy in U.S. history, did similar work in New Mexico after making contributions to Governor Bill Richardson's political action committees.\n In East St. Louis, Ill, A federal jury... convicted the chairman of the city's Democratic Party and four others of scheming to buy votes with cash, cigarettes and liquor last November. Prosecutors relied largely on secretly recorded audiotapes in which they say the accused could be heard talking about paying $5 per vote to get key Democrats elected. Charles Powell Jr., 61, the city's Democratic Party chairman, was found guilty along with the city's former director of regulatory affairs and three others. (AP)\n \n Clarence Norman Jr., the leader of one of the largest Democratic Party organizations in the nation, was found guilty yesterday of soliciting illegal campaign contributions.Democrat scandals you wouldn't hear from the liberal mainstream media | Fire Andrea Mitchell!", 
   {
    "unicode_changes_made": true
   }, 
   386970, 
   null, 
   1264137120.0
  ], 
  [
   386982, 
   null, 
   "electrolyte", 
   "Really? Are you suggesting he is unique as a democrat in a scandalous situation?\n\n Incredibly, I'm with Archie on this. Up to a point:\n \n \nBelow is a list of scandals involving leaders of the Democrat Party. 95% of which have probably never been mentioned by the liberal biased mainstream media. The republican list, which is a fraction the size of this list has been beaten to death by the liberal biased mainstream media.\n\n Balderdash. I've seen the compiled numbers. It's a dead heat. People succumb to idiocy regardless of party.\n (The only real difference -- and it's debatable that it even matters -- is that liberals don't tend to run on a platform that touts \"family values\" and then expose their lack of family values.)\n \n Given the opportunity to call out a stupid claim in a valid way, Archie still fails. Par for Archie.", 
   {}, 
   386976, 
   null, 
   1264141800.0
  ], 
  [
   386993, 
   null, 
   "jazyjason", 
   "Both parties have scandals.The only true issue is that more people are growing sick of both parties and are becoming independent voters.", 
   {}, 
   386982, 
   null, 
   1264159860.0
  ], 
  [
   387015, 
   null, 
   "OldSarge", 
   "\" Former Democratic presidential candidate John Edwards has finally come forward to admit that he fathered a child with a videographer that he hired before his second White House bid. \"\n \n He strayed, denied it for a while, but now admits paternity and is paying up. A closet republican! Who Knew? \n \n Edwards admits he's the father of Hunter's child - washingtonpost.com\n\n \n Well comic relief keep the laffs coming. I see you've been spanked already. Like truth you wouldn't recognize a republican if it bit you.", 
   {}, 
   386970, 
   null, 
   1264174800.0
  ], 
  [
   387016, 
   null, 
   "OldSarge", 
   "Both parties have scandals.The only true issue is that more people are growing sick of both parties and are becoming independent voters.\n\n \n The solution IMHO is vote the incumbents out until running for office makes you as one term wonder. Then they might get the idea. ", 
   {}, 
   386993, 
   null, 
   1264174920.0
  ], 
  [
   387028, 
   null, 
   "Archangel", 
   "Incredibly, I'm with Archie on this. Up to a point:\n \n \n Balderdash. I've seen the compiled numbers. It's a dead heat. People succumb to idiocy regardless of party.\n (The only real difference -- and it's debatable that it even matters -- is that liberals don't tend to run on a platform that touts \"family values\" and then expose their lack of family values.)\n \n Given the opportunity to call out a stupid claim in a valid way, Archie still fails. Par for Archie.\n\n \n Once again you are full of what makes the grass grow green lyte. According to my count we have around 81 Democratic scandals listed above, but I can't find an equivalent list for republicans. The liberal based lists include any scandal where the person involved was registered as a republican at any level of service, but not in congress. \n \n I will leave it to the objective observer to weed through these names and list the number of congressional republican senators and representatives involved in scandals within the same time span as the list I posted for dems above. Republican Sex Scandals - dKosopedia", 
   {}, 
   386982, 
   null, 
   1264177740.0
  ], 
  [
   387030, 
   null, 
   "Steeeeve", 
   "Both parties have scandals.The only true issue is that more people are growing sick of both parties and are becoming independent voters.\n\n \n Which is why we shouldn't pay attention to the political hacks on this forum. Yeah I'm talking to you Penfold.", 
   {}, 
   386993, 
   null, 
   1264178880.0
  ], 
  [
   387067, 
   null, 
   "simone", 
   "Archie, where are your citations and background information on all that crapola you spewed out?", 
   {}, 
   387030, 
   null, 
   1264192200.0
  ], 
  [
   387113, 
   null, 
   "Archangel", 
   "Archie, where are your citations and background information on all that crapola you spewed out?\n\n \n Anyone who even remotely follows the daily news would remember each and every scandal from when they were originally reported. I know I do. So what citations do you need simone other than the reference to each scandal itself which I have posted? But feel free to left click on each politicians name and search it out in google and I'm sure you'll get hits on many links to the scandal in question for that person. I've done my part by reminding you of the scandal.", 
   {}, 
   387067, 
   null, 
   1264221300.0
  ], 
  [
   387116, 
   null, 
   "Penfold", 
   "Anyone who even remotely follows the daily news would remember each and every scandal from when they were originally reported. I know I do. So what citations do you need simone other than the reference to each scandal itself which I have posted? But feel free to left click on each politicians name and search it out in google and I'm sure you'll get hits on many links to the scandal in question for that person. I've done my part by reminding you of the scandal.\n\n \n Translation. \"I don't know where they came from, I just regurgitated a load of crapola.\"", 
   {}, 
   387113, 
   null, 
   1264222500.0
  ], 
  [
   387124, 
   null, 
   "Archangel", 
   "Translation. \"I don't know where they came from, I just regurgitated a load of crapola.\"\n\n \n Really? Speaking of crapola, I challenge you to prove one of these stories is false or exaggerated in any way. Beside that, I'm speaking this forums common language, english, so it needs no translation at all. So rather than attempt to redefine what I say in your usual dishonest way, just put up or shut up and prove that any of these examples of democratic scandals are fictional in any way. I suspect though that as the troll that you are you will just continue to snipe rather than support anything you say with any facts at all.\n \n \nReally? Are you suggesting he is unique as a democrat in a scandalous situation?\n Democrat scandals you wouldn't hear from the liberal mainstream media\n h1\n Below is a list of scandals involving leaders of the Democrat Party. 95% of which have probably never been mentioned by the liberal biased mainstream media. The republican list, which is a fraction the size of this list has been beaten to death by the liberal biased mainstream media.\n William Jefferson Clinton was barred from practicing law in his home state after being impeached. He was not tried as prescribed in the Constitution.\n \n \n It is true that the letter \"W\" was removed from White House typewriters and computer keyboards during Clinton's last days in office. While it may be true that the letter \"W\" was scratched into the famous desk in the Oval Office, it was reported that incoming president George Bush said that it looked to him like an \"M\".\n \n Neil Goldschmidt - Democrat - Oregon governor. Admitted to having an illegal sexual relationship with a 14-year-old teenager while he was serving as Mayor of Portland.\n \n Barney Frank - Democrat - U.S. Representative from Massachusetts. Admitted to having paid Stephen L. Gobie, a male prostitute, for sex and subsequently hiring Gobie as his personal assistant. Gobie used the congressman's Washington apartment for prostitution.\n \n Jerry Springer - Democrat - Resigned from Cincinnati City Council in 1974 after admitting to paying a prostitute with a personal check, which was found in a police raid on a massage parlor.\n \n Melvin Jay Reynolds - U.S. Representative from Illinois from 1993 to 1995. Convicted on sexual misconduct and obstruction of justice charges and sentenced to five years in prison.\n \n Former New Jersey Governor James McGreevey resigned his office and publically admitted his relationship with his croney/lover Golan Cipel who resigned from a $100,000/yr job created by McGreevey.\n \n Edward Kennedy - Democrat - U. S. Senator from Massachusetts. Pleaded guilty to leaving the scene of an accident, after his car plunged off a bridge on Chappaquiddick Island killing passenger Mary Jo Kopechne.\n \n DNC - The Federal Election Commission imposed $719,000 in fines against participants in the 1996 Democratic Party fundraising scandals involving contributions from China, Korea and other foreign sources. The Federal Election commission said it decided to drop cases against contributors of more than $3 million in illegal DNC contributions\n because the respondents left the country or the corporations are defunct.\n \n Sandy Berger - Democrat - National Security Advisor during the Clinton Administration. Berger became the focus of a criminal investigation after removing highly classified terrorism documents and handwritten notes from the National Archives during preparations for the Sept. 11 commission hearings.\n \n Robert Torricelli - Democrat - Withdrew from the 2002 Senate race with less than 30 days before the election because of controversy over personal gifts he took from a major campaign donor and questions about campaign donations from 1996.\n \n Sowande Ajumoke Omokunde - Democrat - the son of newly elected U.S. Rep. Gwen Moore, was booked on charges of criminal damage to property for allegedly slashing tires on 20 vans and cars rented by the Republican Party for use in Election Day voter turnout efforts.\n \n Daniel David Rostenkowski - Democrat - U.S. Representative from Illinois. Indicted on 17 felony charges- pleaded guilty to two counts of misuse of public funds and sentenced to seventeen months in federal prison.\n \n Charles Coles Diggs, Jr. - Democrat - U.S. Representative from Michigan from 1955 to 1980. Convicted on eleven counts of mail fraud and filing false payroll forms- sentenced to three years in prison.\n \n George Rogers - Democrat - Massachusetts State House of Representatives from 1965 to 1970. Member of Massachusetts State Senate from 1975 to 1978. Convicted of bribery in 1978 and sentenced to two years in prison.\n \n Don Siegelman - Democrat Governor Alabama - indicted in a bid-rigging scheme involving a maternity-care program. The charges accused Siegelman and his former chief of staff of helping Tuscaloosa physician \n Phillip Bobo rig bids. Siegelman was accused of moving $550,000 from the state education budget to the State Fire College in Tuscaloosa so Bobo could use the money to pay off a competitor for a state contract for maternity care.\n \n John Murtha, Jr. - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting, in which FBI agents impersonating Arab businessmen offered bribes to political figures; Murtha was cited as an unindicted co-conspirator\n \n Gerry Eastman Studds - Democrat - U.S. Representative from Massachusetts. The first openly gay member of Congress. Censured by the House of Representatives for having sexual relations with a teenage House page.\n \n James C. Green - Democrat - North Carolina State House of Representatives. Charged with accepting a bribe from an undercover FBI agent, but was acquitted. Convicted of tax evasion in 1997.\n \n Frederick Richmond - Democrat - U.S. Representative from New York. Arrested in Washington, D.C., in 1978 for soliciting sex from a minor and from an undercover police officer - pleaded guilty to a misdemeanor. Also - charged with tax evasion, marijuana possession, and improper payments to a federal employee - pleaded guilty.\n \n Raymond Lederer - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and sentenced to three years in prison and fined $20,000.\n \n Harrison Arlington Williams, Jr. - Democrat - U.S. Senator from New Jersey. Implicated in the Abscam sting. Allegedly accepted an 18% interest in a titanium mine. Convicted of nine counts of bribery, conspiracy, receiving an unlawful gratuity, conflict of interest, and interstate travel in aid of racketeering. Sentenced to three years in prison and fined $50,000.\n \n Frank Thompson, Jr. - Democrat - U.S. Representative from New Jersey. Implicated in the Abscam sting, convicted on bribery and conspiracy charges. Sentenced to three years in prison.\n \n Michael Joseph Myers - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and conspiracy; sentenced to three years in prison and fined $20,000; expelled from the House of Representatives.\n \n John Michael Murphy - Democrat - U.S. Representative from New York. Implicated in the Abscam sting. Convicted of conspiracy, conflict of interest, and accepting an illegal gratuity. Sentenced to three years in prison and fined $20,000.\n \n John Wilson Jenrette, Jr - Democrat - U.S. Representative from South Carolina. Implicated in the Abscam sting. Convicted on bribery and conspiracy charges and sentenced to prison\n \n Alcee Lamar Hastings - Democrat - U.S. Representative from Florida. Impeached and removed from office as federal judge in 1989 over bribery charges.\n \n Marion Barry - Democrat - mayor of Washington, D.C. Convicted of cocaine possession after being caught on videotape smoking crack cocaine. Sentenced to six months in prison.\n \n Mario Biaggi - Democrat - U.S. Representative from New York. Indicted on federal charges that he had accepted bribes in return for influence on federal contracts.Convicted of obstructing justice and accepting illegal gratuities. Tried in 1988 on federal racketeering charges and convicted on 15 felony counts.\n \n Lee Alexander - Democrat - Mayor of Syracuse, N.Y. Was indicted over a $1.5 million kickback scandal. Pleaded guilty to racketeering and tax evasion charges. Served six years in prison.\n \n Bill Campbell - Democrat - Mayor of Atlanta. Indicted and charged with fraud over claims he accepted improper payments from contractors seeking city contracts.\n \n Frank Ballance - Democrat - Congressman North Carolina. Pleaded guilty to one charge of conspiracy to commit mail fraud and money laundering related to mishandling of money by his charitable foundation.\n \n Hazel O'Leary - Democrat - Secretary of Energy during the Clinton Administration - O'leary took trips all over the world as Secretary with as many 50 staff members and at times rented a plane, which was used by Madonna during her concert tours.\n \n Mary Rose Oakar - Democrat - U.S. Representative from Ohio from 1977 to 1993.\n Pleaded guilty to two misdemeanor charges of funneling $16,000 through fake donors.\n \n David Giles - Democrat - candidate for U.S. Representative from Washington. Convicted in June 2000 of child rape.\n \n Gary Siplin - Democrat state senator Florida- found guilty of third-degree grand theft of $5,000 or more, a felony, and using services of employees for his candidacy.\n \n Edward Mezvinsky - Democrat - U.S. Representative from Iowa. Indicted on 56 federal fraud charges.\n \n Lena Swanson - Democrat - Member of Washington State Senate. Pleaded guilty to charges of soliciting unlawful payments from veterans and former prisoners of war.\n \n Abraham J. Hirschfeld - Democrat - candidate in Democratic primary for U.S. Senator from New York in 1974 and 1976. Offered Paula Jones $1 million to drop her sexual harassment lawsuit against President Bill Clinton. Convicted in 2000 of trying to hire a hit man to kill his business partner.\n \n Henry Cisneros - Democrat - U.S. Secretary of Housing and Urban Development from 1993 to 1997. Pleaded guilty to a misdemeanor charge of lying to the FBI.\n \n James A. Traficant Jr. - Member of House of Representatives from Ohio. Expelled from Congress after being convicted of corruption charges. Sentenced today to eight years in prison for accepting bribes and kickbacks.\n \n John Doug Hays - Democrat - member of Kentucky State Senate. Found guilty of mail fraud for submitting false campaign reports stemming from an unsuccessful run for judge. He was sentenced to six months in prison to be followed by six months of home confinement and three years of probation.\n \n Henry J. Cianfrani - Democrat - Pennsylvania State Senate. Convicted on federal charges of racketeering and mail fraud for padding his Senate payroll. Sentenced to five years in federal prison.\n \n David Hall - Democrat - Governor of Oklahoma. Indicted on extortion and conspiracy charges. Convicted and sentenced to three years in prison.\n \n John A. Celona - Democrat - A former state senator was charged with the three counts of mail fraud. Federal prosecutors accused him of defrauding the state and collecting hundreds of thousands of dollars from CVS Corp. and others while serving in the legislature. Celona has agreed to plead guilty to taking money from the CVS pharmacy\n chain and other companies that had interest in legislation. Under the deal, Celona agreed to cooperate with investigators. He faces up to five years in federal prison on each of the three counts and a $250,000 fine\n \n Allan Turner Howe - Democrat - U.S. Representative from Utah. Arrested for soliciting a policewoman posing as a prostitute.\n \n Jerry Cosentino - Democrat - Illinois State Treasurer. Pleaded guilty to bank fraud - fined $5,000 and sentenced to nine months home confinement.\n \n Joseph Waggonner Jr. - Democrat - U.S. Representative from Louisiana. Arrested in Washington, D.C. for soliciting a policewoman posing as a prostitute\n \n Albert G. Bustamante - Democrat - U.S. Representative from Texas. Convicted in 1993 on racketeering and bribery charges and sentenced to prison.\n \n Lawrence Jack Smith - Democrat - U.S. Representative from Florida. Sentenced to three months in federal prison for tax evasion.\n \n David Lee Walters - Democrat - Governor of Oklahoma. Pleaded guilty to a misdemeanor election law violation.\n \n James Guy Tucker, Jr. - Democrat - Governor of Arkansas. Resigned in July 1996 after conviction on federal fraud charges as part of the Whitewater investigation.\n \n Walter Rayford Tucker - Democrat - Mayor of Compton, California from 1991 to 1992; U.S. Representative from California from 1993 to 1995. Sentenced to 27 months in prison for extortion and tax evasion.\n \n William McCuen - Democrat - Secretary of State of Arkansas. Admitted accepting kickbacks from two supporters he gave jobs, and not paying taxes on the money. Admitted to conspiring with a political consultant to split $53,560 embezzled from the state in a sham transaction. He was indicted on corruption charges. Pleaded guilty to felony counts tax evasion and accepting a kickback. Sentenced to 17 years in prison.\n \n Walter Fauntroy - Democrat - Delegate to U.S. Congress from the District of Columbia. Charged in federal court with making false statements on financial disclosure forms. Pleaded guilty to one felony count and sentenced to probation.\n \n Carroll Hubbard, Jr. - Democrat - Kentucky State Senate from 1968 to 1975 and U.S. Representative from Kentucky from 1975 to 1993. Pleaded guilty to conspiring to defraud the Federal Elections Commission and to theft of government property; sentenced to\n \n Joseph Kolter - Democrat - member of Pennsylvania State House of Representatives from 1969 to 1982 and U.S. Representative from Pennsylvania from 1983 to 1993. Indicted by a Federal grand jury on five felony charges of embezzlement at the U.S. House post office. Pleaded guilty.\n \n Webster Hubbell - Democrat - Chief Justice of Arkansas State Supreme Court in 1983. Pleaded guilty to federal mail fraud and tax evasion charges - sentenced to 21 months in prison.\n \n Nicholas Mavroules - Democrat - U.S. Representative from Massachusetts from 1979 to 1993. Pleaded guilty to charges of tax fraud and accepting gratuities while in office.\n \n Carl Christopher Perkins - Democrat - Kentucky State House of Representatives from 1981 to 1984 and U.S. Representative from Kentucky from 1985 to 1993. Pleaded guilty to bank fraud in connection with the House banking scandal. Perkins wrote overdrafts totaling about $300,000. Pleaded guilty to charges of filing false statements with the\n Federal Election Commission and false financial disclosure reports. Sentenced to 21 months in prison.\n \n Richard Hanna - Democrat - U.S. Representative from California from 1963 to 1974. Received payments of about $200,000 from a Korean businessman in what became known as the \"Koreagate\" influence buying scandal. Pleaded guilty and sentenced to federal prison.\n \n Angelo Errichetti - Democrat - New Jersey State Senator was sentenced to six years in prison and fined $40,000 for his involvement in Abscam.\n Daniel Baugh Brewster - Democrat - U.S. Senator from Maryland. Indicted on charges of accepting illegal gratuity while in Senate.\n \n Thomas Joseph Dodd - Democrat - U.S. Senator from Connecticut. Censured by the Senate for financial improprieties, having diverted $116,000 in campaign and testimonial funds to his own use.\n \n Edward Fretwell Prichard, Jr. - Democrat - Delegate to Democratic National Convention from Kentucky. Convicted of vote fraud in federal court in connection with ballot-box stuffing. Served five months in prison.\n \n Guy Hamilton Jones, Sr. - Democrat -Arkansas State Senate. Convicted on federal tax charges and expelled from the Arkansas Senate.\n \n Daniel Flood - Democrat - U.S. Representative from Pennsylvania from 1945 to 1947, 1949 to 1953 and 1955 to 1980. Pleaded guilty to a conspiracy charge involving payoffs and sentenced to probation.\n \n Otto Kerner, Jr - Democrat - Governor of Illinois from 1961 to 1968. While serving as Governor, he and another official made a gain of over $300,000 in a stock deal. Convicted on 17 counts of bribery, conspiracy, perjury, and related charges. Sentenced to three years in federal prison and fined $50,000.\n \n George Crockett, Jr. - Democrat - U.S. Representative from Michigan. Served four months in federal prison for contempt of court following his defense of a Communist leader on trial for advocating the overthrow of the government.\n \n Cornelius Edward Gallagher - Democrat - U.S. Representative from New Jersey from 1959 to 1973. Indicted on federal charges of income tax evasion, conspiracy, and perjury.\n \n Mark B. Jimenez - Democrat fundraiser - sentenced to 27 months in prison on charges of tax evasion and conspiracy to defraud the United States and commit election financing offenses.\n \n Bobby Lee Rush - Democrat - U.S. Representative from Illinois. As a Black Panther, spent six months in prison on a weapons charge.\n \n Bolley \"Bo\" Johnson - Democrat - Former Florida House Speaker - received a two-year term for tax evasion.\n \n Roger L. Green - Democrat - Brooklyn Democrat Assemblyman. Pleaded guilty to a misdemeanor for accepting travel reimbursement for trips he did not pay for and was sentenced to fines and probation.\n \n Gloria Davis - Democrat - Bronx assemblywoman. Pleaded guilty to second-degree bribe-taking.\n \n Jim Johnson former chief of Fannie Mae, Obama advisor, and longtime Democratic Party power broker, and one of the Countrywide Six.\n \n Franklin Delano Raines, the former chairman and chief executive officer of Fannie Mae who served as White House budget director under President Bill Clinton, and one of the Countrywide Six.\n \n Donna Shalala, former Secretary of Health and Human Services, who in 1993, the Association of American Physicians and Surgeons, along with several other groups, filed a lawsuit against Donna Shalala over closed-door meetings related to the HillaryCare socialized health care plan, and since leaving the administration was embroiled in scandals\n at the University of Florida due to her extravagant lifestyle at the University's expense. She was also one of the Countrywide Six.\n \n Richard Holbrooke, former U.N. ambassador and assistant Secretary of State, who as U.N. Ambassador ignored whistleblower reports about the infamous Oil-for-Food scandals, and joined the Countrywide Six.\n \n Senator Christopher Dodd - D. Connecticut, who oversees the U.S. mortgage industry as chairman of the Senate Banking Committee, also a member of the Countrywide Six.\n \n Gaylord Kent Conrad - D. North Dakota, the chairman of the Senate Budget Committee and one of the first politicians to support Obama over Hillary. Plus, he was a member of the Countrywide Six.\n \n ROD BLAGOJEVICH, Governor of Illinois, stated that the Senate seat \"is a f'ing valuable thing, you just don't give it away for nothing.\" He had a good friend, too.\n \n Tony Rezko \"assisted Blagojevich in setting up the state's first Democratic administration in twenty years. Rezko was able to have business associates appointed onto several state boards. Rezko and several others were indicted on federal charges in October 2006, for using their connections to the state boards to demand kickbacks from\n businesses that wanted to do business with the state. While the others pleaded guilty to the charges, Rezko pleaded not guilty and was found guilty of 16 of the 24 charges filed against him.\" (Wiki)\n A federal grand jury is investigating how a company that advised Jefferson County, Alabama, on bond deals that threaten to cause the biggest municipal bankruptcy in U.S. history, did similar work in New Mexico after making contributions to Governor Bill Richardson's political action committees.\n In East St. Louis, Ill, A federal jury... convicted the chairman of the city's Democratic Party and four others of scheming to buy votes with cash, cigarettes and liquor last November. Prosecutors relied largely on secretly recorded audiotapes in which they say the accused could be heard talking about paying $5 per vote to get key Democrats elected. Charles Powell Jr., 61, the city's Democratic Party chairman, was found guilty along with the city's former director of regulatory affairs and three others. (AP)\n \n Clarence Norman Jr., the leader of one of the largest Democratic Party organizations in the nation, was found guilty yesterday of soliciting illegal campaign contributions.Democrat scandals you wouldn't hear from the liberal mainstream media | Fire Andrea Mitchell!\n", 
   {
    "unicode_changes_made": true
   }, 
   386976, 
   null, 
   1264224600.0
  ], 
  [
   387135, 
   null, 
   "electrolyte", 
   "The liberal based lists include any scandal where the person involved was registered as a republican at any level of service, but not in congress.\n\n Uh, Archie, did you bother to read your own list? It includes Democrats not in Congress. Got another double standard for us?\n \n \nI will leave it to the objective observer to weed through these names and list the number of congressional republican senators and representatives involved in scandals within the same time span as the list I posted for dems above. Republican Sex Scandals - dKosopedia\n\n You can find a website to make an argument for either side. For example, this one. This one's more interesting: Parties neck and neck", 
   {}, 
   387028, 
   null, 
   1264230300.0
  ], 
  [
   387138, 
   null, 
   "Penfold", 
   "Really? Speaking of crapola, I challenge you to prove one of these stories is false or exaggerated in any way. Beside that, I'm speaking this forums common language, english, so it needs no translation at all. So rather than attempt to redefine what I say in your usual dishonest way, just put up or shut up and prove that any of these examples of democratic scandals are fictional in any way. I suspect though that as the troll that you are you will just continue to snipe rather than support anything you say with any facts at all.\n\n \n Confirmation if any were needed. You never read it yourself.", 
   {}, 
   387124, 
   null, 
   1264236600.0
  ], 
  [
   387142, 
   null, 
   "OldSarge", 
   "Translation. \"I don't know where they came from, I just regurgitated a load of crapola.\"\n\n \n Translation: Neither I nor simone have enough smarts to use a search engine so will obfuscate by claiming my favorite food group.", 
   {}, 
   387116, 
   null, 
   1264246260.0
  ], 
  [
   387143, 
   null, 
   "OldSarge", 
   "Confirmation if any were needed. You never read it yourself.\n\n \n Well comic relief you just proved Arch's case beyond the shadow of any doubt. You did provide a good laff tho.", 
   {}, 
   387138, 
   null, 
   1264246440.0
  ], 
  [
   387144, 
   null, 
   "OldSarge", 
   "Uh, Archie, did you bother to read your own list? It includes Democrats not in Congress. Got another double standard for us?\n \n So not in congress negates the crime then? Speaking of double standards that is.\n \n You can find a website to make an argument for either side. For example, this one. This one's more interesting: Parties neck and neck\n\n \n Most politicians are scumbags so what is your point. Mine is the democrats get a pass more often than not. What's the deal with Charlie Rangel, you think by now the ethics (snicker) committee would have a speedy result by now.", 
   {}, 
   387135, 
   null, 
   1264246620.0
  ], 
  [
   387159, 
   null, 
   "Archangel", 
   "Uh, Archie, did you bother to read your own list? It includes Democrats not in Congress. Got another double standard for us?\n\n \n The difference is that every example on the list I posted is of people who held HIGH office. The only link I could find on republicans pointed to county commissioners, and aids to politicians as examples of republican wrong doing. And your post below does exactly the same thing. I will post examples of that FACT below as evidence.\n \n \nYou can find a website to make an argument for either side. For example, this one. This one's more interesting: Parties neck and neck\n\n Randal David Ankeney is the Republican activist who was arrested on suspicion of sexual assault on a child with force. He was charged with six counts related to getting a 13-year-old girl stoned on pot and then having sex with her. Ankeny has also been accused of sexually assaulting another girl. Source: Denver ABC Article\n \n Jim Bakker is the infamous televangelist who worked with Pat Robertson at Robertson's Christian Broadcasting network. Sources at the time, and then later Jim himself, confirmed that he committed adultery with Jessica Hahn, and then used charitable donations to pay her hush money. Fellow televangelists have stated in the past that they believe he's gay. Bakker was indicted on 23 federal charges of fraud, tax evasion, and racketeering.\n \n Parker J. Bena was a Republican activist and a key player in the campaign to elect George W. Bush as President. Bena was charged and later pleaded guilty to possession of child pornography and lying to the FBI. Bena reportedly told the feds that he had received an unsolicited e-mail containing pictures of children (some as young as three years old) performing various sexual acts, but agents learned that he had in fact voluntarily entered a number of child pornography websites and downloaded the images himself. This is said to have involved acts with children as young as 3 years old, on his home computer. Parker J. Bena was sentenced to 30 months in federal prison and fined $18,000. Source: DemocracyUnderground.com\n \n Louis Beres is a past chairman of the Christian Coalition of Oregon. Three of his family members accuse him of molesting them as children, when they were pre-teens. In an Editor and Publisher article, in August 2006, Beres confessed to the accusations facing him. The Portland Mercury\n \n Matthew Glavin, president and CEO of the Southeastern Legal Foundation, was a big player in the Clinton Impeachment proceedings, and he has spearheaded a good number of anti-homosexual jihads. He has been arrested multiple times for public indecency, sources report, one time it was for fondling the crotch of the police officer who was arresting him at a national park. Opponents say his actions were treated \"with kid gloves\" and therefore inadequate.\n \n Neal Horsley is a political figure of the far right, and the author of a website devoted to his advocacy of militant pro-life, secessionist, and anti-gay views. He has called for the arrest of all homosexuals. He admitted on the Fox News Radio's The Alan Colmes Show, that he's had sex with mules. He put photographs on his Web site of naked men engaging in homosexual acts and a nude woman engaging in bestiality amid shots of grotesquely maimed fetuses. Drug dealer convicted of possession of hashish with intent to sell. He calls for \"the establishment of a new government, one that can obey God's plan for government.\"\n \n Lewis \"Scooter\" Libby is the former Assistant to the President and Chief of Staff to Vice President Dick Cheney who was convicted but recently exempted from having to serve his sentence by the President. In 1996, \"Scooter\" Libby published a novel containing bizarre sexual content, including bestiality and pedophilia. Other high level White House officials were said to have been involved in the book that Libby published.\n \n Rush Limbaugh is the infamous talk show pundit and advocate of moral values who has been divorced three times. A staunch anti-drug crusader, Limbaugh is in reality, a 30-pill a day drug addict. He also takes questionable trips to locations where many western men travel to buy sex under shady circumstances. It was a return from one of those possibly sordid journeys when one of his drug arrests occurred. Limbaugh was returning from the Dominican Republic. The Rush Limbaugh sex tourism story could seriously lead to his downfall if any of the allegations were founded. \"Turnabout is most certainly fair play,\" is how one news agency worded it. Then there is the report of Rush's use of Viagra while he was single. Sources: correntewire.com/The Smoking Gun.com\n And there are plenty more. But these prove that your side will refer to anyone who calls themselves a republican but isn't an elected official at all in order to slam all conservative elected officials with the same broad brush of scandal. emoticon_xdonno", 
   {
    "unicode_changes_made": true
   }, 
   387135, 
   null, 
   1264253580.0
  ], 
  [
   387177, 
   null, 
   "electrolyte", 
   "Most politicians are scumbags so what is your point. Mine is the democrats get a pass more often than not. What's the deal with Charlie Rangel, you think by now the ethics (snicker) committee would have a speedy result by now.\n\n Let's see: Jefferson (D) is out. Ensign (R) is still in. Craig (R) wasn't kicked out. Sanford (R) is still in. Spitzer (D) is out. Foley (R) is out. McGreevey (D) is out. Do you really want to argue that there's a double standard working against you? Hell, Ensign himself called for Clinton to resign.\n Yet, as I've stated before, I think it makes sense to call out the people who run on a platform of family values when they're involved in a sex scandal. It's one thing to be boffing a nurse after promoting a health care program. It's another to be boffing a reporter after parading your wife and kids around to show what a great husband you are and arguing for policy based on personal ethics.\n \n No, the prominence of the politician has nothing to do with the crime. Either we count every single \"scandal\" by anyone who has any ties to any politician anywhere, or we draw a line somewhere higher and don't have to pretend we can find all the village-level scandals.\n Of course, I don't actually think that you're too stupid to understand this; I suspect that you're simply being obtuse... probably because you realize that you don't have much of a leg to stand on.\n \n P.S.: You've inserted your words into a quotation of my words from the post before. Please learn how to use the quote feature of this forum properly so that people aren't left with the impression that I hold your foolish beliefs.\n \n \nThe difference is that every example on the list I posted is of people who held HIGH office. The only link I could find on republicans pointed to county commissioners, and aids to politicians as examples of republican wrong doing. And your post below does exactly the same thing.\n\n And so does yours. Which was my whole damn point. Why can't you read, Archie?\n \n But fine. Going back only five years, dkosopedia lists nine scandalous Republicans that were elected to national office or to a state governor's office.\n Mark Sanford\n \n John Ensign\n \n Vito Fossella\n \n Larry Craig\n \n Joseph M. McDade\n \n David Vitter\n \n Mark Foley\n \n Jim Gibbons\n \n Don Sherwood\n Now, you go through your list and weed out the stories that (1) implicate Democrats who were (a) not nationally elected office-holders or (b) state governors and (2) did not break in the last five years.\n \n You get one: Blagojevich. The only other three that meet these criteria aren't scandals at all: accusatory finger pointing at the \"Countrywide six\" (only two of whom fit the criteria) and a Representative who served time before being elected.\n \n Seriously, Archie, you suck at this.", 
   {}, 
   387159, 
   null, 
   1264276320.0
  ], 
  [
   387197, 
   null, 
   "Archangel", 
   "And so does yours. Which was my whole damn point. Why can't you read, Archie?\n \n But fine. Going back only five years, dkosopedia lists nine scandalous Republicans that were elected to national office or to a state governor's office.\n Mark Sanford\n \n John Ensign\n \n Vito Fossella\n \n Larry Craig\n \n Joseph M. McDade\n \n David Vitter\n \n Mark Foley\n \n Jim Gibbons\n \n Don Sherwood\n Now, you go through your list and weed out the stories that (1) implicate Democrats who were (a) not nationally elected office-holders or (b) state governors and (2) did not break in the last five years.\n \n You get one: Blagojevich. The only other three that meet these criteria aren't scandals at all: accusatory finger pointing at the \"Countrywide six\" (only two of whom fit the criteria) and a Representative who served time before being elected.\n \n Seriously, Archie, you suck at this.\n\n \n Who decided all of a sudden to go back only five years? I mean, when did I claim that my list only went back five years? And how do you know that the only scandals which go back 5 years on my list are the ones you listed since most of them aren't dated at all? Did you look up each and every one of them? By what standard do you make these assumptions and expect me to just accept them at face value? \n \n And why is it your MO and tactic to always attempt to redefine the debate when you can't challenge the facts as they exist? The LEFT must always play with numbers in order to manipulate the outcome in their favor when reality as it exists proves what they are. And by that I mean amoral and reprobates in most cases. You are also dishonest and philosophical cowards for the most part lyte, and personally speaking, your time away from here did nothing to improve your style or character at all.\n \n I resubmit my list of democrat offenders so the objective observer can see just how dishonest you are in the games you play with the truth.\n \n \nReally? Are you suggesting he is unique as a democrat in a scandalous situation?\n Democrat scandals you wouldn't hear from the liberal mainstream media\n h1\n Below is a list of scandals involving leaders of the Democrat Party. 95% of which have probably never been mentioned by the liberal biased mainstream media. The republican list, which is a fraction the size of this list has been beaten to death by the liberal biased mainstream media.\n \n William Jefferson Clinton was barred from practicing law in his home state after being impeached. He was not tried as prescribed in the Constitution.\n \n \n It is true that the letter \"W\" was removed from White House typewriters and computer keyboards during Clinton's last days in office. While it may be true that the letter \"W\" was scratched into the famous desk in the Oval Office, it was reported that incoming president George Bush said that it looked to him like an \"M\".\n \n Neil Goldschmidt - Democrat - Oregon governor. Admitted to having an illegal sexual relationship with a 14-year-old teenager while he was serving as Mayor of Portland.\n \n Barney Frank - Democrat - U.S. Representative from Massachusetts. Admitted to having paid Stephen L. Gobie, a male prostitute, for sex and subsequently hiring Gobie as his personal assistant. Gobie used the congressman's Washington apartment for prostitution.\n \n Jerry Springer - Democrat - Resigned from Cincinnati City Council in 1974 after admitting to paying a prostitute with a personal check, which was found in a police raid on a massage parlor.\n \n Melvin Jay Reynolds - U.S. Representative from Illinois from 1993 to 1995. Convicted on sexual misconduct and obstruction of justice charges and sentenced to five years in prison.\n \n Former New Jersey Governor James McGreevey resigned his office and publically admitted his relationship with his croney/lover Golan Cipel who resigned from a $100,000/yr job created by McGreevey.\n \n Edward Kennedy - Democrat - U. S. Senator from Massachusetts. Pleaded guilty to leaving the scene of an accident, after his car plunged off a bridge on Chappaquiddick Island killing passenger Mary Jo Kopechne.\n \n DNC - The Federal Election Commission imposed $719,000 in fines against participants in the 1996 Democratic Party fundraising scandals involving contributions from China, Korea and other foreign sources. The Federal Election commission said it decided to drop cases against contributors of more than $3 million in illegal DNC contributions\n because the respondents left the country or the corporations are defunct.\n \n Sandy Berger - Democrat - National Security Advisor during the Clinton Administration. Berger became the focus of a criminal investigation after removing highly classified terrorism documents and handwritten notes from the National Archives during preparations for the Sept. 11 commission hearings.\n \n Robert Torricelli - Democrat - Withdrew from the 2002 Senate race with less than 30 days before the election because of controversy over personal gifts he took from a major campaign donor and questions about campaign donations from 1996.\n \n Sowande Ajumoke Omokunde - Democrat - the son of newly elected U.S. Rep. Gwen Moore, was booked on charges of criminal damage to property for allegedly slashing tires on 20 vans and cars rented by the Republican Party for use in Election Day voter turnout efforts.\n \n Daniel David Rostenkowski - Democrat - U.S. Representative from Illinois. Indicted on 17 felony charges- pleaded guilty to two counts of misuse of public funds and sentenced to seventeen months in federal prison.\n \n Charles Coles Diggs, Jr. - Democrat - U.S. Representative from Michigan from 1955 to 1980. Convicted on eleven counts of mail fraud and filing false payroll forms- sentenced to three years in prison.\n \n George Rogers - Democrat - Massachusetts State House of Representatives from 1965 to 1970. Member of Massachusetts State Senate from 1975 to 1978. Convicted of bribery in 1978 and sentenced to two years in prison.\n \n Don Siegelman - Democrat Governor Alabama - indicted in a bid-rigging scheme involving a maternity-care program. The charges accused Siegelman and his former chief of staff of helping Tuscaloosa physician \n Phillip Bobo rig bids. Siegelman was accused of moving $550,000 from the state education budget to the State Fire College in Tuscaloosa so Bobo could use the money to pay off a competitor for a state contract for maternity care.\n \n John Murtha, Jr. - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting, in which FBI agents impersonating Arab businessmen offered bribes to political figures; Murtha was cited as an unindicted co-conspirator\n \n Gerry Eastman Studds - Democrat - U.S. Representative from Massachusetts. The first openly gay member of Congress. Censured by the House of Representatives for having sexual relations with a teenage House page.\n \n James C. Green - Democrat - North Carolina State House of Representatives. Charged with accepting a bribe from an undercover FBI agent, but was acquitted. Convicted of tax evasion in 1997.\n \n Frederick Richmond - Democrat - U.S. Representative from New York. Arrested in Washington, D.C., in 1978 for soliciting sex from a minor and from an undercover police officer - pleaded guilty to a misdemeanor. Also - charged with tax evasion, marijuana possession, and improper payments to a federal employee - pleaded guilty.\n \n Raymond Lederer - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and sentenced to three years in prison and fined $20,000.\n \n Harrison Arlington Williams, Jr. - Democrat - U.S. Senator from New Jersey. Implicated in the Abscam sting. Allegedly accepted an 18% interest in a titanium mine. Convicted of nine counts of bribery, conspiracy, receiving an unlawful gratuity, conflict of interest, and interstate travel in aid of racketeering. Sentenced to three years in prison and fined $50,000.\n \n Frank Thompson, Jr. - Democrat - U.S. Representative from New Jersey. Implicated in the Abscam sting, convicted on bribery and conspiracy charges. Sentenced to three years in prison.\n \n Michael Joseph Myers - Democrat - U.S. Representative from Pennsylvania. Implicated in the Abscam sting - convicted of bribery and conspiracy; sentenced to three years in prison and fined $20,000; expelled from the House of Representatives.\n \n John Michael Murphy - Democrat - U.S. Representative from New York. Implicated in the Abscam sting. Convicted of conspiracy, conflict of interest, and accepting an illegal gratuity. Sentenced to three years in prison and fined $20,000.\n \n John Wilson Jenrette, Jr - Democrat - U.S. Representative from South Carolina. Implicated in the Abscam sting. Convicted on bribery and conspiracy charges and sentenced to prison\n \n Alcee Lamar Hastings - Democrat - U.S. Representative from Florida. Impeached and removed from office as federal judge in 1989 over bribery charges.\n \n Marion Barry - Democrat - mayor of Washington, D.C. Convicted of cocaine possession after being caught on videotape smoking crack cocaine. Sentenced to six months in prison.\n \n Mario Biaggi - Democrat - U.S. Representative from New York. Indicted on federal charges that he had accepted bribes in return for influence on federal contracts.Convicted of obstructing justice and accepting illegal gratuities. Tried in 1988 on federal racketeering charges and convicted on 15 felony counts.\n \n Lee Alexander - Democrat - Mayor of Syracuse, N.Y. Was indicted over a $1.5 million kickback scandal. Pleaded guilty to racketeering and tax evasion charges. Served six years in prison.\n \n Bill Campbell - Democrat - Mayor of Atlanta. Indicted and charged with fraud over claims he accepted improper payments from contractors seeking city contracts.\n \n Frank Ballance - Democrat - Congressman North Carolina. Pleaded guilty to one charge of conspiracy to commit mail fraud and money laundering related to mishandling of money by his charitable foundation.\n \n Hazel O'Leary - Democrat - Secretary of Energy during the Clinton Administration - O'leary took trips all over the world as Secretary with as many 50 staff members and at times rented a plane, which was used by Madonna during her concert tours.\n \n Mary Rose Oakar - Democrat - U.S. Representative from Ohio from 1977 to 1993.\n Pleaded guilty to two misdemeanor charges of funneling $16,000 through fake donors.\n \n David Giles - Democrat - candidate for U.S. Representative from Washington. Convicted in June 2000 of child rape.\n \n Gary Siplin - Democrat state senator Florida- found guilty of third-degree grand theft of $5,000 or more, a felony, and using services of employees for his candidacy.\n \n Edward Mezvinsky - Democrat - U.S. Representative from Iowa. Indicted on 56 federal fraud charges.\n \n Lena Swanson - Democrat - Member of Washington State Senate. Pleaded guilty to charges of soliciting unlawful payments from veterans and former prisoners of war.\n \n Abraham J. Hirschfeld - Democrat - candidate in Democratic primary for U.S. Senator from New York in 1974 and 1976. Offered Paula Jones $1 million to drop her sexual harassment lawsuit against President Bill Clinton. Convicted in 2000 of trying to hire a hit man to kill his business partner.\n \n Henry Cisneros - Democrat - U.S. Secretary of Housing and Urban Development from 1993 to 1997. Pleaded guilty to a misdemeanor charge of lying to the FBI.\n \n James A. Traficant Jr. - Member of House of Representatives from Ohio. Expelled from Congress after being convicted of corruption charges. Sentenced today to eight years in prison for accepting bribes and kickbacks.\n \n John Doug Hays - Democrat - member of Kentucky State Senate. Found guilty of mail fraud for submitting false campaign reports stemming from an unsuccessful run for judge. He was sentenced to six months in prison to be followed by six months of home confinement and three years of probation.\n \n Henry J. Cianfrani - Democrat - Pennsylvania State Senate. Convicted on federal charges of racketeering and mail fraud for padding his Senate payroll. Sentenced to five years in federal prison.\n \n David Hall - Democrat - Governor of Oklahoma. Indicted on extortion and conspiracy charges. Convicted and sentenced to three years in prison.\n \n John A. Celona - Democrat - A former state senator was charged with the three counts of mail fraud. Federal prosecutors accused him of defrauding the state and collecting hundreds of thousands of dollars from CVS Corp. and others while serving in the legislature. Celona has agreed to plead guilty to taking money from the CVS pharmacy\n chain and other companies that had interest in legislation. Under the deal, Celona agreed to cooperate with investigators. He faces up to five years in federal prison on each of the three counts and a $250,000 fine\n \n Allan Turner Howe - Democrat - U.S. Representative from Utah. Arrested for soliciting a policewoman posing as a prostitute.\n \n Jerry Cosentino - Democrat - Illinois State Treasurer. Pleaded guilty to bank fraud - fined $5,000 and sentenced to nine months home confinement.\n \n Joseph Waggonner Jr. - Democrat - U.S. Representative from Louisiana. Arrested in Washington, D.C. for soliciting a policewoman posing as a prostitute\n \n Albert G. Bustamante - Democrat - U.S. Representative from Texas. Convicted in 1993 on racketeering and bribery charges and sentenced to prison.\n \n Lawrence Jack Smith - Democrat - U.S. Representative from Florida. Sentenced to three months in federal prison for tax evasion.\n \n David Lee Walters - Democrat - Governor of Oklahoma. Pleaded guilty to a misdemeanor election law violation.\n \n James Guy Tucker, Jr. - Democrat - Governor of Arkansas. Resigned in July 1996 after conviction on federal fraud charges as part of the Whitewater investigation.\n \n Walter Rayford Tucker - Democrat - Mayor of Compton, California from 1991 to 1992; U.S. Representative from California from 1993 to 1995. Sentenced to 27 months in prison for extortion and tax evasion.\n \n William McCuen - Democrat - Secretary of State of Arkansas. Admitted accepting kickbacks from two supporters he gave jobs, and not paying taxes on the money. Admitted to conspiring with a political consultant to split $53,560 embezzled from the state in a sham transaction. He was indicted on corruption charges. Pleaded guilty to felony counts tax evasion and accepting a kickback. Sentenced to 17 years in prison.\n \n Walter Fauntroy - Democrat - Delegate to U.S. Congress from the District of Columbia. Charged in federal court with making false statements on financial disclosure forms. Pleaded guilty to one felony count and sentenced to probation.\n \n Carroll Hubbard, Jr. - Democrat - Kentucky State Senate from 1968 to 1975 and U.S. Representative from Kentucky from 1975 to 1993. Pleaded guilty to conspiring to defraud the Federal Elections Commission and to theft of government property; sentenced to\n \n Joseph Kolter - Democrat - member of Pennsylvania State House of Representatives from 1969 to 1982 and U.S. Representative from Pennsylvania from 1983 to 1993. Indicted by a Federal grand jury on five felony charges of embezzlement at the U.S. House post office. Pleaded guilty.\n \n Webster Hubbell - Democrat - Chief Justice of Arkansas State Supreme Court in 1983. Pleaded guilty to federal mail fraud and tax evasion charges - sentenced to 21 months in prison.\n \n Nicholas Mavroules - Democrat - U.S. Representative from Massachusetts from 1979 to 1993. Pleaded guilty to charges of tax fraud and accepting gratuities while in office.\n \n Carl Christopher Perkins - Democrat - Kentucky State House of Representatives from 1981 to 1984 and U.S. Representative from Kentucky from 1985 to 1993. Pleaded guilty to bank fraud in connection with the House banking scandal. Perkins wrote overdrafts totaling about $300,000. Pleaded guilty to charges of filing false statements with the\n Federal Election Commission and false financial disclosure reports. Sentenced to 21 months in prison.\n \n Richard Hanna - Democrat - U.S. Representative from California from 1963 to 1974. Received payments of about $200,000 from a Korean businessman in what became known as the \"Koreagate\" influence buying scandal. Pleaded guilty and sentenced to federal prison.\n \n Angelo Errichetti - Democrat - New Jersey State Senator was sentenced to six years in prison and fined $40,000 for his involvement in Abscam.\n Daniel Baugh Brewster - Democrat - U.S. Senator from Maryland. Indicted on charges of accepting illegal gratuity while in Senate.\n \n Thomas Joseph Dodd - Democrat - U.S. Senator from Connecticut. Censured by the Senate for financial improprieties, having diverted $116,000 in campaign and testimonial funds to his own use.\n \n Edward Fretwell Prichard, Jr. - Democrat - Delegate to Democratic National Convention from Kentucky. Convicted of vote fraud in federal court in connection with ballot-box stuffing. Served five months in prison.\n \n Guy Hamilton Jones, Sr. - Democrat -Arkansas State Senate. Convicted on federal tax charges and expelled from the Arkansas Senate.\n \n Daniel Flood - Democrat - U.S. Representative from Pennsylvania from 1945 to 1947, 1949 to 1953 and 1955 to 1980. Pleaded guilty to a conspiracy charge involving payoffs and sentenced to probation.\n \n Otto Kerner, Jr - Democrat - Governor of Illinois from 1961 to 1968. While serving as Governor, he and another official made a gain of over $300,000 in a stock deal. Convicted on 17 counts of bribery, conspiracy, perjury, and related charges. Sentenced to three years in federal prison and fined $50,000.\n \n George Crockett, Jr. - Democrat - U.S. Representative from Michigan. Served four months in federal prison for contempt of court following his defense of a Communist leader on trial for advocating the overthrow of the government.\n \n Cornelius Edward Gallagher - Democrat - U.S. Representative from New Jersey from 1959 to 1973. Indicted on federal charges of income tax evasion, conspiracy, and perjury.\n \n Mark B. Jimenez - Democrat fundraiser - sentenced to 27 months in prison on charges of tax evasion and conspiracy to defraud the United States and commit election financing offenses.\n \n Bobby Lee Rush - Democrat - U.S. Representative from Illinois. As a Black Panther, spent six months in prison on a weapons charge.\n \n Bolley \"Bo\" Johnson - Democrat - Former Florida House Speaker - received a two-year term for tax evasion.\n \n Roger L. Green - Democrat - Brooklyn Democrat Assemblyman. Pleaded guilty to a misdemeanor for accepting travel reimbursement for trips he did not pay for and was sentenced to fines and probation.\n \n Gloria Davis - Democrat - Bronx assemblywoman. Pleaded guilty to second-degree bribe-taking.\n \n Jim Johnson former chief of Fannie Mae, Obama advisor, and longtime Democratic Party power broker, and one of the Countrywide Six.\n \n Franklin Delano Raines, the former chairman and chief executive officer of Fannie Mae who served as White House budget director under President Bill Clinton, and one of the Countrywide Six.\n \n Donna Shalala, former Secretary of Health and Human Services, who in 1993, the Association of American Physicians and Surgeons, along with several other groups, filed a lawsuit against Donna Shalala over closed-door meetings related to the HillaryCare socialized health care plan, and since leaving the administration was embroiled in scandals\n at the University of Florida due to her extravagant lifestyle at the University's expense. She was also one of the Countrywide Six.\n \n Richard Holbrooke, former U.N. ambassador and assistant Secretary of State, who as U.N. Ambassador ignored whistleblower reports about the infamous Oil-for-Food scandals, and joined the Countrywide Six.\n \n Senator Christopher Dodd - D. Connecticut, who oversees the U.S. mortgage industry as chairman of the Senate Banking Committee, also a member of the Countrywide Six.\n \n Gaylord Kent Conrad - D. North Dakota, the chairman of the Senate Budget Committee and one of the first politicians to support Obama over Hillary. Plus, he was a member of the Countrywide Six.\n \n ROD BLAGOJEVICH, Governor of Illinois, stated that the Senate seat \"is a f'ing valuable thing, you just don't give it away for nothing.\" He had a good friend, too.\n \n Tony Rezko \"assisted Blagojevich in setting up the state's first Democratic administration in twenty years. Rezko was able to have business associates appointed onto several state boards. Rezko and several others were indicted on federal charges in October 2006, for using their connections to the state boards to demand kickbacks from\n businesses that wanted to do business with the state. While the others pleaded guilty to the charges, Rezko pleaded not guilty and was found guilty of 16 of the 24 charges filed against him.\" (Wiki)\n A federal grand jury is investigating how a company that advised Jefferson County, Alabama, on bond deals that threaten to cause the biggest municipal bankruptcy in U.S. history, did similar work in New Mexico after making contributions to Governor Bill Richardson's political action committees.\n In East St. Louis, Ill, A federal jury... convicted the chairman of the city's Democratic Party and four others of scheming to buy votes with cash, cigarettes and liquor last November. Prosecutors relied largely on secretly recorded audiotapes in which they say the accused could be heard talking about paying $5 per vote to get key Democrats elected. Charles Powell Jr., 61, the city's Democratic Party chairman, was found guilty along with the city's former director of regulatory affairs and three others. (AP)\n \n Clarence Norman Jr., the leader of one of the largest Democratic Party organizations in the nation, was found guilty yesterday of soliciting illegal campaign contributions.Democrat scandals you wouldn't hear from the liberal mainstream media | Fire Andrea Mitchell!\n", 
   {
    "unicode_changes_made": true
   }, 
   386976, 
   null, 
   1264284660.0
  ], 
  [
   387206, 
   null, 
   "electrolyte", 
   "Who decided all of a sudden to go back only five years?\n\n I did, because I figured that it was a long enough time for a representative sample of modern parties without being so long that we both spend hours upon hours sifting through information. It was otherwise entirely arbitrarily picked: I didn't do a count before picking five years.\n But fine: You go back as far as you want, giving a count (and sources) for that far back, and include a justification for why going back as far as you did produces an accurate representation of the character of those parties today.\n \n \nI mean, when did I claim that my list only went back five years?\n\n You didn't, and I never said that you did. I didn't even imply it. \n \n \nAnd how do you know that the only scandals which go back 5 years on my list are the ones you listed since most of them aren't dated at all?\n\n I looked them up. If you want to provide evidence that I made any mistakes in my filtering, feel free to post it. Otherwise, quit feigning outrage: It's time to put up or shut up.\n \n \nAnd why is it your MO and tactic to always attempt to redefine the debate when you can't challenge the facts as they exist?\n\n But I do challenge the facts. You said that the list of Republican scandals was full of minor players. I pointed out that your list of Democratic scandals was littered with minor players. You claimed that the Democrats are notoriously worse when it comes to big-name scandals. I counted. You're wrong. The facts are on my side.\n \n \nyour time away from here did nothing to improve your style or character at all.\n\n Awww, you noticed that I was gone. You must have missed me. How sweet.\n Here's where I could pull an Archie and feign indignation with bold letters explaining that my \"time away from here\" had nothing to do with an attempt to improve my style or character. Frankly, I don't give a damn what you thinks about my character, because your thought processes have no grounding in reality.\n \n \nI resubmit my list of democrat offenders so the objective observer can see just how dishonest you are in the games you play with the truth.\n\n Glad you did. Now the readers can see (again) that your reason for crying foul about the list of Republicans also bites you right in the behind. What a joke.", 
   {}, 
   387197, 
   null, 
   1264287360.0
  ], 
  [
   387212, 
   null, 
   "electrolyte", 
   "My replies are in bold thank you.\n\n Yes, I pointed this out. Why did you think I needed to be told this if I mentioned it? Do you have as much trouble reading as Archie? (or, in the marc9000 school of thought: \"omg, I bet you ARE Archie using a sock puppet account! That's why Archie's last response to me was in bold, too! OMG CASE CLOSED I AER TEH WIN.)\n \n \nIf they are inserted into your quote which I do know how to use by the way,\n\n No, you clearly don't know how to use them: If you did, you would have used them properly. As it stands, it looks like I posted those words in bold.\n \n \nit is to refute a particular point.\n\n Then stop the quote and insert your comment at the original text level, just as forum etiquette demands.\n \n \nNow unless you can link to a specific post you are whistling in the dark.\n\n You need help scrolling up? I specifically said \"my words from the post before.\" But, as you are apparently as incompetent as you are obtuse, I mean here.\n \n \nBy the way Arch is beating you with facts like a rented mule.\n\n Yep, you must be an Archie sock puppet. There aren't many people who have as severe a counting problem as Archie, who apparently thinks that 9 is fewer than 1.\n Archie's beating himself. The more he posts, the more idiocy there is to rip to shreds. In that regard, a sock puppet isn't such a bad idea: sure, you still take nothing but savage beatings, but at least the clueless readers think you're only getting half of it.\n \n \nAs to foolish beliefs, you jest.\n\n Not at all. You-- er, Archie cried foul about minor politicians being on one list, so I pointed out the hypocrisy of his using a list including minor politicians. You-- er, me-- er, Archie-- er, you (sorry, it's so hard to keep straight when sock puppets can't use quote tags competently) foolishly suggested that I insinuated a lack of importance of scandals by minor players.", 
   {}, 
   387177, 
   null, 
   1264288260.0
  ], 
  [
   387214, 
   null, 
   "Penfold", 
   "The most obvious problem with these C&P lists is their notorious inaccuracy. When such a list starts with a nine year old lie, long debunked, then you know where it is coming from, and that it's going to the recycle bin.\n \n \"It is true that the letter &#8220;W&#8221; was removed from White House typewriters and computer keyboards during Clinton&#8217;s last days in office. While it may be true that the letter &#8220;W&#8221; was scratched into the famous desk in the Oval Office, it was reported that incoming president George Bush said that it looked to him like an &#8220;M&#8221;. \"\n \n Bush may have been that incurious. The rest is not true, And even if it were, is not a scandal involving a highranking Democrat.", 
   {}, 
   387206, 
   null, 
   1264288920.0
  ], 
  [
   387255, 
   null, 
   "OldSarge", 
   "Yes, I pointed this out. Why did you think I needed to be told this if I mentioned it? Do you have as much trouble reading as Archie? (or, in the marc9000 school of thought: \"omg, I bet you ARE Archie using a sock puppet account! That's why Archie's last response to me was in bold, too! OMG CASE CLOSED I AER TEH WIN.)\n \n You are a piece of work. Declare victory and slither off. \n \n No, you clearly don't know how to use them: If you did, you would have used them properly. As it stands, it looks like I posted those words in bold.\n \n Sorry but no one appointed you the board nanny. If you have a problem in reading comprehension that is your proble not mine.\n \n Then stop the quote and insert your comment at the original text level, just as forum etiquette demands.\n \n See above. As to ettiuette, you lost that with the snide insults.\n \n You need help scrolling up? I specifically said \"my words from the post before.\" But, as you are apparently as incompetent as you are obtuse, I mean here.\n \n The only incopetent here is you with the rolling out of apples to oranges and shifting goal posts.\n \n Yep, you must be an Archie sock puppet. There aren't many people who have as severe a counting problem as Archie, who apparently thinks that 9 is fewer than 1.\n \n Your logic is as flawed as your thinking or what passes for it is.\n \n Archie's beating himself. The more he posts, the more idiocy there is to rip to shreds. In that regard, a sock puppet isn't such a bad idea: sure, you still take nothing but savage beatings, but at least the clueless readers think you're only getting half of it.\n \n The only beating here is the one you are receiving from facts. Way to win friends and influence people, clueless readers! \n \n Not at all. You-- er, Archie cried foul about minor politicians being on one list, so I pointed out the hypocrisy of his using a list including minor politicians. You-- er, me-- er, Archie-- er, you (sorry, it's so hard to keep straight when sock puppets can't use quote tags competently) foolishly suggested that I insinuated a lack of importance of scandals by minor players.\n\n \n I can understand your confusion since you are evidently delusional. Drugs or a real life beating I am not sure which. Shame you don't have the power to define the situation. Keep trying and show the world how mentally incompetent you really are. Are you going to try to refute facts or just whip out your insults and drivel? emoticon_rolleyes", 
   {}, 
   387212, 
   null, 
   1264332360.0
  ], 
  [
   387256, 
   null, 
   "OldSarge", 
   "But fine: You go back as far as you want, giving a count (and sources) for that far back, and include a justification for why going back as far as you did produces an accurate representation of the character of those parties today.\n \n Well you haven't addressed any of the party in office that I pointed outhave you.\n \n I looked them up. If you want to provide evidence that I made any mistakes in my filtering, feel free to post it. Otherwise, quit feigning outrage: It's time to put up or shut up.\n \n He already did if you had the comprehension to see.\n \n But I do challenge the facts. You said that the list of Republican scandals was full of minor players. I pointed out that your list of Democratic scandals was littered with minor players. You claimed that the Democrats are notoriously worse when it comes to big-name scandals. I counted. You're wrong. The facts are on my side.\n \n Only in your mind.\n \n Glad you did. Now the readers can see (again) that your reason for crying foul about the list of Republicans also bites you right in the behind. What a joke.\n\n \n The real joke is you. Care to address the tax cheats in the current junta?", 
   {}, 
   387206, 
   null, 
   1264332660.0
  ], 
  [
   387270, 
   null, 
   "Archangel", 
   "But I do challenge the facts. You said that the list of Republican scandals was full of minor players. I pointed out that your list of Democratic scandals was littered with minor players. You claimed that the Democrats are notoriously worse when it comes to big-name scandals. I counted. You're wrong. The facts are on my side.\n\n \n The facts aren't on your side at all. That's the negative aspect of attempting to debate with your side which leaves me incredulous, since you all rationalize and manipulate facts in order to assume equal standing when there is no comparison at all in how our respective Parties deal with or acknowledge the sins of their members. For example, just look at the outcome for the Republican offenders on the list I posted for whatever sin they committed. They were forced to resign their positions or were ejected by their Party. Now look at the number of Democrat offenders who have been busted for moral and ethical offenses and see that they are still serving publicly, some in high office even after being shown to have been guilty of moral or legal failings. \n \n This is due to a double standard and hypocrisy by the LEFT which states that because they hold to no moral value system as a general rule of ethics, then they needn't take personal responsibility for the ethical and moral lapses of their members by ejecting them from public service until they are actually convicted of a crime. For example, Is William Jefferson in prison yet due to the 90,000 dollars in FBI marked bills he hid in his freezer? And didn't he continue to serve in his office until he lost re-election in his State? William Jefferson sentenced to 13 years in prison | Louisiana Politics & Government - - Louisiana Politics | State Legislature News - NOLA.com \n \n They are just getting around to convicting Sheila Dixon. The mayor of Baltimore is just now finally being forced to resign in a plea bargain. She will be forced to spend the rest of her life living on her $83,000 pension, which begins the day she resigns. POOR BABY!!!!! Mayor Dixon to Resign Tell me lyteboy, do you believe she deserves to keep her pension? \n \n They haven't even started Blago's criminal trial yet. And Burris is still sitting in the Senate.\n \n It seems the courts are very slow to prosecute Democrats for some reason.\n \n Ted Kennedy died from natural causes before he spent even one minute in jail for Chappaquiddick. For those with short memories, Kennedy DID plead guilty in court. So although you think in all of your pompous and arrogant sanctimony that 5 years is a reasonable amount of time to look back, where murder is concerned as in the case of Kennedy, there is no statute of limitation, unless one is a Kennedy, then he is just forgiven outright and continues to serve for life.", 
   {}, 
   387206, 
   null, 
   1264345680.0
  ], 
  [
   387344, 
   null, 
   "Easyrider", 
   "The real joke is you. Care to address the tax cheats in the current junta?\n\n \n I don't think Electrolyte has that many years left to be able to address them all.", 
   {}, 
   387256, 
   null, 
   1264364880.0
  ], 
  [
   387353, 
   null, 
   "electrolyte", 
   "For example, just look at the outcome for the Republican offenders on the list I posted for whatever sin they committed.\n\n Then you simply left out the ones who stayed in office, recently including Craig, Sanford, and Ensign.\n \n \nNow look at the number of Democrat offenders who have been busted for moral and ethical offenses and see that they are still serving publicly,\n\n Same with Republicans. You have no leg to stand on.\n \n \nsome in high office even after being shown to have been guilty of moral or legal failings.\n\n Yet those people were legally elected. Do you have a problem with our election system, Archie?\n \n \nThis is due to a double standard and hypocrisy by the LEFT which states that because they hold to no moral value system as a general rule of ethics,\n\n Slander. Retract it.\n \n \nthen they needn't take personal responsibility for the ethical and moral lapses of their members by ejecting them from public service until they are actually convicted of a crime.\n\n Do you have a problem with the \"innocent until proven guilty\" approach?\n \n \nAnd didn't he continue to serve in his office until he lost re-election in his State?\n\n You mean like Craig? And Sanford? And Ensign?\n \n \nWilliam Jefferson sentenced to 13 years in prison | Louisiana Politics & Government - - Louisiana Politics | State Legislature News - NOLA.com\n \n Really? You really want to go there?\n Scooter Libby convicted on multiple counts -- pardoned by Bush -- serves no jail time. This after Bush swears that the people responsible will be \"dealt with.\"\n \n \nTell me lyteboy, do you believe she deserves to keep her pension? \n\n No, but that decision wasn't up to me. That's the nature of the plea that was struck.\n \n \nIt seems the courts are very slow to prosecute Democrats for some reason.\n\n Which is why William Jefferson hasn't been tried and convicted? And why Sheila Dixon hasn't faced prosecution? Oh, wait...\n \n \nFor those with short memories, Kennedy DID plead guilty in court.\n\n So did Craig. Who then publicly stated that he didn't do anything. Either he was lying in court or lying to the people. About homosexual behavior. Which he argues against. Would you please accuse Democrats of having no morals or ethical standards again?\n \n \nSo although you think in all of your pompous and arrogant sanctimony that 5 years is a reasonable amount of time to look back, where murder is concerned as in the case of Kennedy, there is no statute of limitation, unless one is a Kennedy, then he is just forgiven outright and continues to serve for life.\n\n Fine, count it. Then go back that far for both parties and count. Really, go ahead.", 
   {}, 
   387270, 
   null, 
   1264366440.0
  ], 
  [
   387357, 
   null, 
   "electrolyte", 
   "Declare victory and slither off.\n\n No, I'm still here. You're still a sock puppet.\n \n \nSorry but no one appointed you the board nanny. If you have a problem in reading comprehension that is your proble not mine.\n\n I can read just fine. You can't tag properly.\n \n \nAs to ettiuette, you lost that with the snide insults.\n\n It's not a contest. I quote properly; you don't. Thus, your words appear as mine. This is unacceptable.\n \n \nThe only incopetent here is you with the rolling out of apples to oranges and shifting goal posts.\n\n What comparisons do you feel are disanalogous? And when have I shifted goalposts? You don't get to make blanket statements and expect us to believe you, puppet.\n \n \nYour logic is as flawed as your thinking or what passes for it is.\n\n A completely nonsensical -- and extremely Archie-like -- response. Fancy that.\n \n \nThe only beating here is the one you are receiving from facts.\n\n Yeah, you said that already. It wasn't true the first time, either. Jeez, you suck at this... just like Archie... hmmm...\n \n \nI can understand your confusion since you are evidently delusional.\n\n Because I think that nine is greater than one? Yes, clearly I have a problem... emoticon_rolleyes\n \n \nAre you going to try to refute facts or just whip out your insults and drivel?\n\n I don't refute facts. I expose them. I refute your lies. The fact that I put you-- uh, I mean, put Archie down as I do so doesn't change that he's full of hot air.", 
   {}, 
   387255, 
   null, 
   1264366980.0
  ], 
  [
   387360, 
   null, 
   "electrolyte", 
   "Well you haven't addressed any of the party in office that I pointed outhave [sic] you.\n\n I was addressing his list. I'm not denying that only one side has scandals. In fact, I counted. If you could read and understand why I mock your inability to contrast nine with one, you'd know that.\n \n \nHe already did if you had the comprehension to see.\n\n No, you-- er, he didn't. I laid out qualificatory criteria: one that Archie chose and one that I chose to simplify research. Archie didn't even follow his own criterion. I demanded that he apply it.\n \n \nOnly in your mind.\n\n And in reality. The invitation to prove me wrong stands.\n \n \nThe real joke is you. Care to address the tax cheats in the current junta?\n\n If you've got something, add it to the list. Blanket assertions with no meat still mean nothing.", 
   {}, 
   387256, 
   null, 
   1264367400.0
  ], 
  [
   387363, 
   null, 
   "OldSarge", 
   "Then you simply left out the ones who stayed in office, recently including Craig, Sanford, and Ensign.\n \n You mean Rangel, Molohan, Dodd and Murtha?\n \n \n Yet those people were legally elected. Do you have a problem with our election system, Archie?\n \n Pray inform us what commiting a crime and remaining in office has to do with elections?\n \n \"Originally Posted by Archangel \n This is due to a double standard and hypocrisy by the LEFT which states that because they hold to no moral value system as a general rule of ethics,\"\n Slander. Retract it.\n \n Prove your case for slander.\n Do you have a problem with the \"innocent until proven guilty\" approach?\n \n \n Really? You really want to go there?\n Scooter Libby convicted on multiple counts -- pardoned by Bush -- serves no jail time. This after Bush swears that the people responsible will be \"dealt with.\"\n \n Perhaps you need to revisit the Libby case. Libby was not elected to any office. He was appointed. Then again that's what you did with your original list which Arch refuted nicely with the facts. It was Armitage that admitted he done the deed of leaking to Novack.\n \n Fine, count it. Then go back that far for both parties and count. Really, go ahead.\n\n \n Nope that's your job. Have at it.", 
   {}, 
   387353, 
   null, 
   1264367760.0
  ], 
  [
   387370, 
   null, 
   "OldSarge", 
   "I was addressing his list. I'm not denying that only one side has scandals. In fact, I counted. If you could read and understand why I mock your inability to contrast nine with one, you'd know that.\n \n Well since you like to move the goalposts why complain?\n \n No, you-- er, he didn't. I laid out qualificatory criteria: one that Archie chose and one that I chose to simplify research. Archie didn't even follow his own criterion. I demanded that he apply it.\n \n Sorry charlie that is not how debate works. You may think you have the power to define the situation but you are wrong.\n \n And in reality. The invitation to prove me wrong stands.\n \n If you had any reading comprehension you'd note it has been done already. Stick a fork in you as your done.\n \n If you've got something, add it to the list. Blanket assertions with no meat still mean nothing.\n\n \n Oh I did and whoosh right over your head. ", 
   {}, 
   387360, 
   null, 
   1264368360.0
  ], 
  [
   387373, 
   null, 
   "OldSarge", 
   "I don't think Electrolyte has that many years left to be able to address them all.\n\n \n Nor the mental prowess to be able to count that high.", 
   {}, 
   387344, 
   null, 
   1264368660.0
  ], 
  [
   387381, 
   null, 
   "electrolyte", 
   "You mean Rangel, Molohan, Dodd and Murtha?\n\n I already told you: Add 'em to the list, if they meet the criteria.\n \n \nPray inform us what commiting a crime and remaining in office has to do with elections?\n\n Please pay attention, puppet. That specific remark was in response to Archie's comment that some Democrats were elected even after committing a crime and serving their jail sentences, not committing a crime in office and not being forced to leave.\n We already know that you have reading problems, puppet. Don't make it worse on yourself.\n \n \nProve your case for slander.\n\n Dems generally support hate crime bills. If they had no moral or ethical sense, they wouldn't support any crime bills, let alone hate crime bills.\n \n \nPerhaps you need to revisit the Libby case. Libby was not elected to any office. He was appointed. Then again that's what you did with your original list which Arch refuted nicely with the facts. It was Armitage that admitted he done the deed of leaking to Novack.\n\n Bush pardoned him. Bush was elected to a national office. Bush promised to \"deal with\" leaks in his administration. Well, he did: Bush pardoned Libby.\n Here's a comparison: Clinton pardoned Susan McDougal. The right was outraged. And rightly so. But she served jail time. Libby was pardoned lickety-split.\n \n \nNope that's your job. Have at it.\n\n Not really. I've done my count. 9 to 1.\n \n \nGee a devasting retort not. And if you had a brain you'd be dangerous.\n\n Yet with my alleged lack of a brain, I'm exposing the stupidity of your arguments, puppet. Funny that.\n \n \nSo far you haven't demonstrated it.\n\n Another lie. I'm quoting your words only.\n \n \nGood hope you continue find it so.\n\n Excellent. Just what I needed, puppet.\n \n \nWell if you weren't wrapped up in insult I'd tell you.\n\n No you wouldn't. You can't. You've got nothing. If you did, you'd say it and use it to pretend that you've got me on this one.\n \n \nSo far you haven't proven any thing beyord having to resort to insults. Which by the way clearly demonstrates you lost the debate.\n\n Balderdash. Just because I add flavor doesn't mean there's no meat. It's there, and in spades.\n \n \nNo because you can't figure out what to count.\n\n But I can figure out what to count: nationally elected officials and governors whose scandals broke in the last [choose a number] years. I chose five, you-- er, Archie objected, then both of you failed to present an alternative and the corresponding numbers. If someone here can't figure out what to count, that'd be you.\n \n \nWell so far like all the rest you haven't proven any lies. So I suspect this pure projection on your part.\n\n But I have: I showed that Archie's claim that the list of Republicans was overwhelmingly minor players was false. I also showed that his insinuation that the list of Democrats didn't include many minor players was false. Please pay attention, puppet.\n \n \nWell since you like to move the goalposts why complain?\n\n This is the second time you've accused me of moving the goalposts and the second time you've failed to identify what I've done that constitutes moving the goalposts.\n \n \nSorry charlie that is not how debate works. You may think you have the power to define the situation but you are wrong.\n\n I said explicitly that Archie can pick his own time frame as long as it is representative of today's parties, then he can count and post. Neither of you have done so. As both of you have failed to define the situation, even with the invitation to do so, then I very much do have the power to define the situation.\n \n \nIf you had any reading comprehension you'd note it has been done already.\n\n Where? About what? What did I get wrong? Be specific. Specific.\n \n \nStick a fork in you as your done.\n\n My done? Will you please make derogatory comments about my IQ as you talk more about my done, please?\n \n \nOh I did and whoosh right over your head.\n\n You added Rangel and Dodd and Molohan and Murtha.. without explaining what they did. Doing something that you don't like isn't s scandal, puppet.\n \n \nNor the mental prowess to be able to count that high.\n\n Says the guy who doesn't know that nine is greater than one? Why do I have to keep mentioning this?", 
   {}, 
   387357, 
   null, 
   1264371720.0
  ], 
  [
   387541, 
   null, 
   "Easyrider", 
   "Sarge - Electrolyte is obviously a Dumbocrat. There's no reasoning with those people. All you can do is rebuke the losers and feel sorry for them.", 
   {}, 
   387381, 
   null, 
   1264465380.0
  ], 
  [
   387543, 
   null, 
   "Penfold", 
   "Sarge - Electrolyte is obviously a Dumbocrat. There's no reasoning with those people. All you can do is rebuke the losers and feel sorry for them.\n\n \n This bilious spew from the \"Conservative Christian\" who, if he were any smarter, would need watering twice weekly.", 
   {}, 
   387541, 
   null, 
   1264467480.0
  ], 
  [
   387593, 
   null, 
   "Archangel", 
   "This bilious spew from the \"Conservative Christian\" who, if he were any smarter, would need watering twice weekly.\n\n \n Here's another example of the warped and twisted irrational rationalization of the radical leftist, and this example is given to us by the supreme leftist, messiah Yobama, himself. Here's the video: emoticon_xgood\n \n YouTube - Obama: 'I'd Rather Be Good One-Term President Than Mediocre Two-Termer'?Brit Hume: Really?\n \n As you can see, he says he would rather be a really good one term president than a mediocre two term president. Only a liberal would lose sight of the fact that if he was a really good president in his first term, worrying about his second term would be a non issue as the American people would want to re-elect him. Only a leftist could think that forcing unwanted policies that don't work, against the will of the people he was elected to SERVE, not rule over, is being a really good president. \n \n He is so arrogant he acts like he's a sacrificial lamb who is helping us to his own political detriment. When in fact he is attempting to fundamentally reshape America's freemarket capitalist system in the image of his socialist cabal of political Czars/hacks who needn't be confirmed by congress but are arbitrarily appointed by him, and answer not to the people but to him alone, just as he said he would do 5 days before the election.\n \n YouTube - Obama: \"Fundamentally Transforming the United States of America\"", 
   {}, 
   387543, 
   null, 
   1264524000.0
  ], 
  [
   387610, 
   null, 
   "Jo Bennett", 
   "You can have foresight and take steps that will have good long term consequences, but which are unpopular in the short term. Some decisions will not play out for months or even years after the election, and a good leader will make the right long term choice and damn the electoral consequences.\n \n Incidentally lefties don't have the monopoly on this, George Bush made some pretty unpopular choices (a lot of them with bad long term consequences but that's beside the point) and he only got away with them because he didn't need to be elected again. Incidentally, do you support the removal of term limits if you think politicians should always be publically accountable?", 
   {}, 
   387593, 
   null, 
   1264531680.0
  ], 
  [
   387616, 
   null, 
   "JPSartre12", 
   "You can have foresight and take steps that will have good long term consequences, but which are unpopular in the short term. Some decisions will not play out for months or even years after the election, and a good leader will make the right long term choice and damn the electoral consequences.\n \n Incidentally lefties don't have the monopoly on this, George Bush made some pretty unpopular choices (a lot of them with bad long term consequences but that's beside the point) and he only got away with them because he didn't need to be elected again. Incidentally, do you support the removal of term limits if you think politicians should always be publically accountable?\n\n \n I used to argue against term limits because I believed that it violated the \"people's will\", but as I've aged, I see that they are a necessity because sitting politicians will always manipulate the situation so that their re-election is more likely.\n Two examples: McCain-Feingold Campaign Reform Law and gerrymandering. \n \n Politicians are like dead fish, the longer they stick around, the more they smell. :xcensored", 
   {}, 
   387610, 
   null, 
   1264534620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John Edwards. Closet Republican!", 
  "url": "http://www.4forums.com/political/politics-debates/13822-john-edwards-closet-republican.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13822, 
  "discussion_files": [
   [
    "23252.html", 
    "http://www.4forums.com/political/politics-debates/13822-john-edwards-closet-republican-print.html"
   ], 
   [
    "23253.html", 
    "http://www.4forums.com/political/politics-debates/13822-john-edwards-closet-republican-3-print.html"
   ], 
   [
    "23254.html", 
    "http://www.4forums.com/political/politics-debates/13822-john-edwards-closet-republican-2-print.html"
   ]
  ], 
  "identifier": 13822
 }
]