[
 [
  [
   387264, 
   null, 
   "Easyrider", 
   "Except for African Americans, who gave him 95% of their vote, Mr. Obama did far better with Jews than with any other ethnic or religious group. Thus the Jewish vote for him was 25 points higher than the 53% he scored with the electorate as a whole; 35 points higher than the 43% he scored with whites; 11 points higher than the 67% he scored with Hispanics; 33 points higher than the 45% he scored with Protestants; and 24 points higher than the 54% he scored with Catholics. \n \n On abortion, gay rights, school prayer, gun control and assisted suicide, the survey data show that Jews are by far the most liberal of any group in America. \n \n Most American Jews sincerely believe that their liberalism, together with their commitment to the Democratic Party as its main political vehicle, stems from the teachings of Judaism and reflects the heritage of \"Jewish values.\" But if this theory were valid, the Orthodox would be the most liberal sector of the Jewish community. After all, it is they who are most familiar with the Jewish religious tradition and who shape their lives around its commandments.\n \n NORMAN PODHORETZ - Wall Street Journal Article\n \n Norman Podhoretz: Why Are Jews Liberals? - WSJ.com\n \n Why are most Jews liberals? IMO, it's the age old story - because for the most part, they, like so many liberal Christians, embrace the teachings of men vs. the teachings of God.\n \n Then some Pharisees and teachers of the law came to Jesus from Jerusalem and asked, \"Why do your disciples break the tradition of the elders? They don't wash their hands before they eat!\" \n Jesus replied, \"And why do you break the command of God for the sake of your tradition? For God said, 'Honor your father and mother' and 'Anyone who curses his father or mother must be put to death.' But you say that if a man says to his father or mother, 'Whatever help you might otherwise have received from me is a gift devoted to God,' he is not to 'honor his father' with it. Thus you nullify the word of God for the sake of your tradition. You hypocrites! Isaiah was right when he prophesied about you: \n \" 'These people honor me with their lips, \n but their hearts are far from me. \n They worship me in vain; \n their teachings are but rules taught by men. - Matthew 15:1-9", 
   {
    "post_info": {
     "post_title": "Why are Jews Liberals?"
    }
   }, 
   null, 
   null, 
   1264337520.0
  ], 
  [
   387265, 
   null, 
   "Easyrider", 
   "And that's why liberal people like Trebor are way out there in left field with the pagans and the infidels - because he has embraced the carnal teachings of man and thrown the written word of God under the bus.\n \n That ought to get your head spinning, Trebor.", 
   {}, 
   387264, 
   null, 
   1264337700.0
  ], 
  [
   387272, 
   null, 
   "Jo Bennett", 
   "Orthodox Jews are the successors of the Pharisees, placing more value on the letter of the law than trying to do what is right.\n \n Maybe Jews are pretty wary of people who come along talking about patriotism and family values because they, along with gays, gypsies, trade unionists, and socialists remember well where that road leads. The rhetoric from the right about \"real Americans\" must be particularly chilling.\n \n More generally, being in a minority does tend to make you more tolerant of the rights of other minorities, and less willing to ride rough shod over the personal choices of others to impose your own moral code.", 
   {}, 
   387265, 
   null, 
   1264346400.0
  ], 
  [
   387290, 
   null, 
   "Easyrider", 
   "Orthodox Jews are the successors of the Pharisees, placing more value on the letter of the law than trying to do what is right.\n\n \n If \"what is right\" above is contrary to what God wrote down and commanded the Jewish people, then it shouldn't be defended or practiced.\n \n \nMaybe Jews are pretty wary of people who come along talking about patriotism and family values because they, along with gays, gypsies, trade unionists, and socialists remember well where that road leads. The rhetoric from the right about \"real Americans\" must be particularly chilling.\n\n \n Maybe they should be more worried about people who flaunt illicit gay pride sin in their faces, bankrupt and subvert the country with big socialist spending and special favor trade unions, and who trade in Godly values for San Francisco values. Tolerance for ungodly values is no virtue.", 
   {}, 
   387272, 
   null, 
   1264351500.0
  ], 
  [
   387296, 
   null, 
   "trebor", 
   "If \"what is right\" above is contrary to what God wrote down and commanded the Jewish people, then it shouldn't be defended or practiced.\n \n \n \n Maybe they should be more worried about people who flaunt illicit gay pride sin in their faces, bankrupt and subvert the country with big socialist spending and special favor trade unions, and who trade in Godly values for San Francisco values. Tolerance for ungodly values is no virtue.\n\n \n Well, the reason most Jews are Liberal, is that 1) Compassion and 2) Intelligence. The lack of compassion goes along with the Conservative mind set, and, the extreme orthodox.\n \n Yes, there are a few neocon nuts out there, but thankfully, they are dying off.\n \n Tolerance for the bigotry and ranting of the Neocons should be zero, and is.\n Those are more ungodly values that anything else.", 
   {}, 
   387290, 
   null, 
   1264355340.0
  ], 
  [
   387297, 
   null, 
   "smiley", 
   "If \"what is right\" above is contrary to what God wrote down and commanded the Jewish people, then it shouldn't be defended or practiced.\n \n \n \n Maybe they should be more worried about people who flaunt illicit gay pride sin in their faces, bankrupt and subvert the country with big socialist spending and special favor trade unions, and who trade in Godly values for San Francisco values. Tolerance for ungodly values is no virtue.\n\n \n How quickly we get back to the gay sex.", 
   {}, 
   387290, 
   null, 
   1264355400.0
  ], 
  [
   387298, 
   null, 
   "Easyrider", 
   "Well, the reason most Jews are Liberal, is that 1) Compassion and 2) Intelligence. The lack of compassion goes along with the Conservative mind set, and, the extreme orthodox.\n\n \n Sure, Trebor. That really worked out well for them when they broke God's laws and wound up getting divine disaster after diasaster meted out to them.\n \n Just read Deuteronomy chapter 28 to see the blessings for obedience to God's laws, vs. the curses of disobedience for breaking His laws.\n \n How many laps around Mt. Sinai did they make before they found out their goo-goo liberal revisionism and San Francisco values weren't working?", 
   {}, 
   387296, 
   null, 
   1264356360.0
  ], 
  [
   387299, 
   null, 
   "Penfold", 
   "How quickly we get back to the gay sex.\n\n \n In his case, it's one degree of separation! You can see the Freudian logic behind his name, too.", 
   {}, 
   387297, 
   null, 
   1264356600.0
  ], 
  [
   387300, 
   null, 
   "trebor", 
   "Sure, Trebor. That really worked out well for them when they broke God's laws and wound up getting divine disaster after diasaster meted out to them.\n \n Just read Deuteronomy chapter 28 to see the blessings for obedience to God's laws, vs. the curses of disobedience for breaking His laws.\n \n How many laps around Mt. Sinai did they make before they found out their goo-goo liberal revisionism and San Francisco values weren't working?\n\n \n Meh. Is it working out better than it is for you??. With your ranting ,raving and hate, how happy are you with your life? Two divorces under your belt,.. and that is violating the words of Jesus. \n \n You need to use less starch in your underwear , and trade in Paul for James", 
   {}, 
   387298, 
   null, 
   1264357860.0
  ], 
  [
   387302, 
   null, 
   "Jo Bennett", 
   "If \"what is right\" above is contrary to what God wrote down and commanded the Jewish people, then it shouldn't be defended or practiced.\n\n \n Pretty much what the Pharisees said to Jesus.", 
   {}, 
   387290, 
   null, 
   1264358940.0
  ], 
  [
   387311, 
   null, 
   "Easyrider", 
   "Meh. Is it working out better than it is for you??. With your ranting ,raving and hate, how happy are you with your life? Two divorces under your belt,.. and that is violating the words of Jesus. \n \n You need to use less starch in your underwear , and trade in Paul for James\n\n \n You're a liar on everything you just said. Didn't the Lord tell you, O stiff-necked one, not to bear false witness against your neighbor? Then why are you doing it? Because your a flaming, paganized liberal.", 
   {}, 
   387300, 
   null, 
   1264362360.0
  ], 
  [
   387315, 
   null, 
   "Easyrider", 
   "Pretty much what the Pharisees said to Jesus.\n\n \n The pharisees weren't promoting God's Word, they were defending their man-made teachings and traditions, just like today's liberal Jews and liberal Christians.", 
   {}, 
   387302, 
   null, 
   1264362480.0
  ], 
  [
   387317, 
   null, 
   "simone", 
   "One might well ask, \"Why do people ask stupid questions?\"\n \n Obviously, ER, you don't know very many Jews.", 
   {}, 
   387264, 
   null, 
   1264362540.0
  ], 
  [
   387318, 
   null, 
   "Easyrider", 
   "One might well ask, \"Why do people ask stupid questions?\"\n \n Obviously, ER, you don't know very many Jews.\n\n \n Sure I do. You don't know what you're talking about either. Nor have you apparently ever read the Tanakh.\n \n You're another flaming liberal without any common sense, which is why you didn't like this week's Supreme Court decision. I loved it. We're having a wake for Obama's agenda later today, ha ha.", 
   {}, 
   387317, 
   null, 
   1264362720.0
  ], 
  [
   387319, 
   null, 
   "simone", 
   "And, Holly Mackerel! ER! You have no understanding of the Jewish understanding of the nature of God.", 
   {}, 
   387317, 
   null, 
   1264362720.0
  ], 
  [
   387320, 
   null, 
   "Easyrider", 
   "And, Holly Mackeral! ER! You have no understanding of the Jewish understanding of the nature of God.\n\n \n <Flush<\n \n You don't even know who God is - Jesus Christ. Obviously you're theologically stunted, which is why you're a flaming liberal.", 
   {}, 
   387319, 
   null, 
   1264362780.0
  ], 
  [
   387321, 
   null, 
   "simone", 
   "The pitiful thing, ER, is that I know Jesus Christ far better than you do. And you haven't the intelligence to realize that.", 
   {}, 
   387320, 
   null, 
   1264363080.0
  ], 
  [
   387326, 
   null, 
   "Easyrider", 
   "The pitiful thing, ER, is that I know Jesus Christ far better than you do. And you haven't the intelligence to realize that.\n\n \n I don't believe that for a minute. You're too far out in left field along with the pagans and infidels.", 
   {}, 
   387321, 
   null, 
   1264363560.0
  ], 
  [
   387327, 
   null, 
   "Accipiter", 
   "Ez, Jesus hates your guts.\n \n Go worship your gay idol and quite boring us with your drivel.", 
   {}, 
   387326, 
   null, 
   1264363980.0
  ], 
  [
   387329, 
   null, 
   "T.Q", 
   "Anyone else get the impression that our resident bible nut has no idea what Jo Bennet was talking about here?\n \n Easy, you're an embarassment. Do you honestly think that God would promote gloating and insulting behaviour?", 
   {}, 
   387327, 
   null, 
   1264364160.0
  ], 
  [
   387331, 
   null, 
   "simone", 
   "Naw, TQ, ER ain't got a clue.", 
   {}, 
   387329, 
   null, 
   1264364280.0
  ], 
  [
   387332, 
   null, 
   "Easyrider", 
   "\n Easy, you're an embarassment. Do you honestly think that God would promote gloating and insulting behaviour?\n\n \n 51\"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! 52Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him- 53you who have received the law that was put into effect through angels but have not obeyed it.\"\n \n The Stoning of Stephen \n \n 54When they heard this, they were furious and gnashed their teeth at him. 55But Stephen, full of the Holy Spirit, looked up to heaven and saw the glory of God, and Jesus standing at the right hand of God. 56\"Look,\" he said, \"I see heaven open and the Son of Man standing at the right hand of God.\" \n 57At this they covered their ears and, yelling at the top of their voices, they all rushed at him, 58dragged him out of the city and began to stone him. Meanwhile, the witnesses laid their clothes at the feet of a young man named Saul. - Acts 7\n \n When are you going to give up your assault on Christ and the Word of God? It's not working out for you.", 
   {
    "unicode_changes_made": true
   }, 
   387329, 
   null, 
   1264364400.0
  ], 
  [
   387335, 
   null, 
   "Easyrider", 
   "Ez, Jesus hates your guts.\n \n Go worship your gay idol and quite boring us with your drivel.\n\n \n Ah, a friend of TQ who wants everyone but his fellow Christ-deniers to be nice.\n \n But don't worry. TQ has a double standard and won't ever call you out on your hatred.", 
   {}, 
   387327, 
   null, 
   1264364460.0
  ], 
  [
   387352, 
   null, 
   "trebor", 
   "You're a liar on everything you just said. Didn't the Lord tell you, O stiff-necked one, not to bear false witness against your neighbor? Then why are you doing it? Because your a flaming, paganized liberal.\n\n \n Am I?? Or , perhaps you just don't want to admit your own sins. Not admitting your sins makes you unrepentant.. and you know what God does with unrepentant sinners in your own theology. \n \n Whine away old man, you know I am not one who is lying. Go through all the face saving you want.. it doesn't matter to me one bit, cause I KNOW you know the truth about your divorces. You blame them of course.", 
   {}, 
   387311, 
   null, 
   1264366140.0
  ], 
  [
   387362, 
   null, 
   "Jo Bennett", 
   "The pharisees weren't promoting God's Word, they were defending their man-made teachings and traditions, just like today's liberal Jews and liberal Christians.\n\n \n No, they were defending a legalistic, dogmatic reading of mosaic law, much as conservative Christians and Orthodox Jews do today.", 
   {}, 
   387315, 
   null, 
   1264367700.0
  ], 
  [
   387364, 
   null, 
   "Jo Bennett", 
   "Ez, Jesus hates your guts.\n \n\n \n Nope, Jesus loves EZ, he really does. I just pray that EZ will recognise that love and pass it on to others.", 
   {}, 
   387327, 
   null, 
   1264367820.0
  ], 
  [
   387369, 
   null, 
   "electrolyte", 
   "Why are most Jews liberals?\n\n \n \n2) Intelligence.\n\n It's interesting how Jews have this \"stigma\" of being intelligent and highly educated, and the vast majority of them lean left...\n \n \nHow quickly we get back to the gay sex.\n\n Easy just can't get over the imagery of throbbing penises doing naughty things.", 
   {}, 
   387302, 
   null, 
   1264368360.0
  ], 
  [
   387371, 
   null, 
   "T.Q", 
   "Ah, a friend of TQ who wants everyone but his fellow Christ-deniers to be nice.\n \n But don't worry. TQ has a double standard and won't ever call you out on your hatred.\n\n \n Care to translate that into something resembling a coherent thought at least somewhat connected to reality?", 
   {}, 
   387335, 
   null, 
   1264368360.0
  ], 
  [
   387378, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider:  The pharisees weren't promoting God's Word, they were defending their man-made teachings and traditions, just like today's liberal Jews and liberal Christians.\n \n \nNo, they were defending a legalistic, dogmatic reading of mosaic law, much as conservative Christians and Orthodox Jews do today.\n\n \n I stand by what I said. Jesus exposed their man made rules and clarified them with the Word of God.\n \n The conservative Christians I know teach both morals and grace. The liberal Jews and liberal Christians I know just promote the latter, making God's grace into a license to sin. They don't think God will do anything to them, or to their country. History shows otherwise.", 
   {}, 
   387362, 
   null, 
   1264369140.0
  ], 
  [
   387379, 
   null, 
   "Easyrider", 
   "It's interesting how Jews have this \"stigma\" of being intelligent and highly educated, and the vast majority of them lean left \n\n \n Don't confuse intelligence with wisdom. Like Bill Clinton, Obama is intelligent; they just aren't very wise. Otherwise Clinton wouldn't have gotten caught up with Lewinski, and Obama would (or should) have paid more attention to the people instead of pumping his 'bankrupt the USA' policies.\n \n Time for the NFL...", 
   {}, 
   387369, 
   null, 
   1264369680.0
  ], 
  [
   387382, 
   null, 
   "electrolyte", 
   "Don't confuse intelligence with wisdom.\n\n From the \"intelligent people are smart, wise people agree with me\" school of thought. Yeah, not buying that steaming pile of bovine feces, Easy.", 
   {}, 
   387379, 
   null, 
   1264371960.0
  ], 
  [
   387383, 
   null, 
   "Archangel", 
   "Except for African Americans, who gave him 95% of their vote, Mr. Obama did far better with Jews than with any other ethnic or religious group. Thus the Jewish vote for him was 25 points higher than the 53% he scored with the electorate as a whole; 35 points higher than the 43% he scored with whites; 11 points higher than the 67% he scored with Hispanics; 33 points higher than the 45% he scored with Protestants; and 24 points higher than the 54% he scored with Catholics. \n \n On abortion, gay rights, school prayer, gun control and assisted suicide, the survey data show that Jews are by far the most liberal of any group in America. \n \n Most American Jews sincerely believe that their liberalism, together with their commitment to the Democratic Party as its main political vehicle, stems from the teachings of Judaism and reflects the heritage of \"Jewish values.\" But if this theory were valid, the Orthodox would be the most liberal sector of the Jewish community. After all, it is they who are most familiar with the Jewish religious tradition and who shape their lives around its commandments.\n \n NORMAN PODHORETZ - Wall Street Journal Article\n \n Norman Podhoretz: Why Are Jews Liberals? - WSJ.com\n \n Why are most Jews liberals? IMO, it's the age old story - because for the most part, they, like so many liberal Christians, embrace the teachings of men vs. the teachings of God.\n \n Then some Pharisees and teachers of the law came to Jesus from Jerusalem and asked, \"Why do your disciples break the tradition of the elders? They don't wash their hands before they eat!\" \n Jesus replied, \"And why do you break the command of God for the sake of your tradition? For God said, 'Honor your father and mother' and 'Anyone who curses his father or mother must be put to death.' But you say that if a man says to his father or mother, 'Whatever help you might otherwise have received from me is a gift devoted to God,' he is not to 'honor his father' with it. Thus you nullify the word of God for the sake of your tradition. You hypocrites! Isaiah was right when he prophesied about you: \n \" 'These people honor me with their lips, \n but their hearts are far from me. \n They worship me in vain; \n their teachings are but rules taught by men. - Matthew 15:1-9\n\n \n Politically speaking, what is most astounding about the jewish support of liberals, and my argument is proven true right here on this forum, in that it is the liberals here and throughout the country who constantly defend the arab terrorists in Palestine against the Jews whom we conservative christians are the only defenders of. Even Jo Bennett condemns Israel as the aggressors in favor of defending the terrorists who strap bombs onto themselves and fire rockets indiscriminately into Jewish neighborhoods. \n \n Any so called christian who claims to Love the Lord Jesus, a JEW, but stands against Israel for political reasons has lost sight of the fact that God is working with Israel and His timing isn't our timing. We believers see that Israel isn't without sin, their support of liberals being one evidence of that flaw in their worldly character, but even then we don't abandon them since we know that Gods covenant with Israel through Abraham is never ending. Jo, having no such eternal perspective of world events sits by and pompously judges Israel rather than stand by her simply because salvation came to the world by way of the Jew and God will never forsake her.", 
   {}, 
   387264, 
   null, 
   1264373340.0
  ], 
  [
   387387, 
   null, 
   "electrolyte", 
   "the liberals here and throughout the country who constantly defend the arab terrorists in Palestine\n\n Really? I defend the Arab terrorists in Palestine? or elsewhere?\n No, I don't. So you lie.\n \n \nagainst the Jews whom we conservative christians are the only defenders of.\n\n And you accuse me of delusion and self-importance? \"Conservative Christians are the only defenders of\" the Jews? You're insane.\n \n \nEven Jo Bennett condemns Israel as the aggressors in favor of defending the terrorists who strap bombs onto themselves and fire rockets indiscriminately into Jewish neighborhoods.\n\n I can't speak for Jo, but I do know this: Both sides have done reprehensible things. Yes, probably one side more than the other, but to pretend that the Jews haven't reacted in poorly-decided ways is just delusional. (Parchie.)", 
   {}, 
   387383, 
   null, 
   1264375800.0
  ], 
  [
   387425, 
   null, 
   "Archangel", 
   "Really? I defend the Arab terrorists in Palestine? or elsewhere?\n No, I don't. So you lie.\n \n \n And you accuse me of delusion and self-importance? \"Conservative Christians are the only defenders of\" the Jews? You're insane.\n \n \n I can't speak for Jo, but I do know this: Both sides have done reprehensible things. Yes, probably one side more than the other, but to pretend that the Jews haven't reacted in poorly-decided ways is just delusional. (Parchie.)\n\n \n I don't remember mentioning your name at all so I don't know where you get off calling me a liar. And in usual fashion you claim you don't defend terrorists in the first paragraph while claiming the Jews are as bad as the terrorists in the third paragraph. How blatantly and consistently liberal of you, thanks for making my point. \n \n \nPolitically speaking, what is most astounding about the jewish support of liberals, and my argument is proven true right here on this forum, in that it is the liberals here and throughout the country who constantly defend the arab terrorists in Palestine against the Jews whom we conservative christians are the only defenders of. Even Jo Bennett condemns Israel as the aggressors in favor of defending the terrorists who strap bombs onto themselves and fire rockets indiscriminately into Jewish neighborhoods. \n \n Any so called christian who claims to Love the Lord Jesus, a JEW, but stands against Israel for political reasons has lost sight of the fact that God is working with Israel and His timing isn't our timing. We believers see that Israel isn't without sin, their support of liberals being one evidence of that flaw in their worldly character, but even then we don't abandon them since we know that Gods covenant with Israel through Abraham is never ending. Jo, having no such eternal perspective of world events sits by and pompously judges Israel rather than stand by her simply because salvation came to the world by way of the Jew and God will never forsake her.\n", 
   {}, 
   387383, 
   null, 
   1264388760.0
  ], 
  [
   387426, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider: Don't confuse intelligence with wisdom.\n \n \nFrom the \"intelligent people are smart, wise people agree with me\" school of thought. Yeah, not buying that steaming pile of bovine feces, Easy.\n\n \n So, Clinton getting it on with Lewinsky is a sign of intelligence? You can work for the Obama administration with those kinds of smarts. LOl!!", 
   {}, 
   387382, 
   null, 
   1264389720.0
  ], 
  [
   387428, 
   null, 
   "trebor", 
   "Originally Posted by Easyrider: Don't confuse intelligence with wisdom.\n \n \n \n So, Clinton getting it on with Lewinsky is a sign of intelligence? You can work for the Obama administration with those kinds of smarts. LOl!!\n\n \n I do declare I detect jealousy there. I guess the last wife left too long a time ago.", 
   {}, 
   387426, 
   null, 
   1264390320.0
  ], 
  [
   387437, 
   null, 
   "Archangel", 
   "Originally Posted by Easyrider: Don't confuse intelligence with wisdom.\n \n \n \n So, Clinton getting it on with Lewinsky is a sign of intelligence? You can work for the Obama administration with those kinds of smarts. LOl!!\n\n \n \nI do declare I detect jealousy there. I guess the last wife left too long a time ago.\n\n \n You declare jealousy in Easyrider's post regarding Clinton and Lewinsky as a sign of Clinton's intelligence? You're as big a whack job as Pinfold and simone combined. emoticon_xdonno", 
   {}, 
   387428, 
   null, 
   1264393800.0
  ], 
  [
   387451, 
   null, 
   "electrolyte", 
   "I don't remember mentioning your name at all so I don't know where you get off calling me a liar\n\n Okay then, I'll show you. You said,... my argument is proven true right here on this forum, in that it is the liberals here and throughout the country who constantly defend the arab terrorists in Palestine against the Jews...\nThat characterization includes me (liberals here). In fact, it includes me twice (throughout the country). Just because you didn't mention my name doesn't mean that your statement doesn't include me. So, you've said something that blatantly isn't true.\n And (and!) you took my bait! Let's look at this:\n \n \nAnd in usual fashion you claim you don't defend terrorists in the first paragraph while claiming the Jews are as bad as the terrorists in the third paragraph. How blatantly and consistently liberal of you, thanks for making my point.\n\n No no, thank you for making my point. I knew, knew that you'd take what I said and twist it around to pretend that I've proven your point. I absolutely, unequivocally, did not defend terrorism of any kind, nor have I defended the Palestinians. Your bottomless pit of logical vacuity doesn't allow you to realize that saying something true but unfavorable about one side doesn't equate to defending the other side.\n \n BUT! It gets even worse for you, Archie boy. You said that I \"claim[] the Jews are as bad as the terrorists,\" yet I specifically said that -- while both sides have done bad things -- one side is worse.Both sides have done reprehensible things. Yes, probably one side more than the other, but to pretend that the Jews haven't reacted in poorly-decided ways is just delusional.\nYou lied. Again. You're a liar. A habitual liar.\n \n \nSo, Clinton getting it on with Lewinsky is a sign of intelligence?\n\n I didn't say that. Didn't even imply it. Why can't you make an argument that stands on its own merits? Why do you have to lie about what I've said, Easy? Why do you lie so damn much, Easy? You and Archie lie so much. Lying for Jesus. Lying for the right. It's all you've got.", 
   {}, 
   387437, 
   null, 
   1264397280.0
  ], 
  [
   387452, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider: So, Clinton getting it on with Lewinsky is a sign of intelligence?\n \n \nI didn't say that. Didn't even imply it. Why can't you make an argument that stands on its own merits? Why do you have to lie about what I've said, Easy? Why do you lie so damn much, Easy? You and Archie lie so much. Lying for Jesus. Lying for the right. It's all you've got.\n\n \n Rotate, O stiff-necked one. If you don't WISE UP and quit thinking you're some kind of intellectual guru - which you aren't by any means - then you're going to wind up in the Pit (John 3:36). You still don't have an ounce of Godly wisdom, so quit pretending to be something you aren't.\n \n Not only that, but you need to wise up even more and listen to Archangel. You could learn a thing or two.", 
   {}, 
   387451, 
   null, 
   1264398120.0
  ], 
  [
   387468, 
   null, 
   "electrolyte", 
   "you're going to wind up in the Pit (John 3:36).\n\n God loves me so much that he'll have me tortured forever. Aw, love.\n Seriously, are you so incapable of comprehending anything other your own beliefs that you don't realize that threatening an atheist with God's wrath is just incredibly stupid?\n Wait, did I just ask that? How silly of me. Of course you don't realize that.\n \n \nYou still don't have an ounce of Godly wisdom,\n\n Whew! For a second there I was worried. I mean, why would I want \"Godly\" wisdom when I have a real education and functional logic capacity? God wanted Adam and Eve to avoid knowledge. In the real world, knowledge is a good thing.\n \n \nso quit pretending to be something you aren't.\n\n But I don't pretend to have Godly wisdom. I'm not nearly as moronic as people with \"Godly wisdom.\"\n \n \nNot only that, but you need to wise up even more and listen to Archangel. You could learn a thing or two.\n\n How to be an ignorant, delusional hack? You're not example enough?", 
   {}, 
   387452, 
   null, 
   1264407780.0
  ], 
  [
   387473, 
   null, 
   "Archangel", 
   "Okay then, I'll show you. You said,That characterization includes me (liberals here). In fact, it includes me twice (throughout the country). Just because you didn't mention my name doesn't mean that your statement doesn't include me. So, you've said something that blatantly isn't true.\n And (and!) you took my bait! Let's look at this:\n \n \n No no, thank you for making my point. I knew, knew that you'd take what I said and twist it around to pretend that I've proven your point. I absolutely, unequivocally, did not defend terrorism of any kind, nor have I defended the Palestinians. Your bottomless pit of logical vacuity doesn't allow you to realize that saying something true but unfavorable about one side doesn't equate to defending the other side.\n \n BUT! It gets even worse for you, Archie boy. You said that I \"claim[] the Jews are as bad as the terrorists,\" yet I specifically said that -- while both sides have done bad things -- one side is worse.You lied. Again. You're a liar. A habitual liar.\n \n \n I didn't say that. Didn't even imply it. Why can't you make an argument that stands on its own merits? Why do you have to lie about what I've said, Easy? Why do you lie so damn much, Easy? You and Archie lie so much. Lying for Jesus. Lying for the right. It's all you've got.\n\n \n I will leave it to the objective observer to decide which of us lies and is an irrational loon since even attempting to reason with you is an exercise in futility. :xbanghead\n \n \nPolitically speaking, what is most astounding about the jewish support of liberals, and my argument is proven true right here on this forum, in that it is the liberals here and throughout the country who constantly defend the arab terrorists in Palestine against the Jews whom we conservative christians are the only defenders of. Even Jo Bennett condemns Israel as the aggressors in favor of defending the terrorists who strap bombs onto themselves and fire rockets indiscriminately into Jewish neighborhoods. \n \n Any so called christian who claims to Love the Lord Jesus, a JEW, but stands against Israel for political reasons has lost sight of the fact that God is working with Israel and His timing isn't our timing. We believers see that Israel isn't without sin, their support of liberals being one evidence of that flaw in their worldly character, but even then we don't abandon them since we know that Gods covenant with Israel through Abraham is never ending. Jo, having no such eternal perspective of world events sits by and pompously judges Israel rather than stand by her simply because salvation came to the world by way of the Jew and God will never forsake her.\n", 
   {}, 
   387383, 
   null, 
   1264421640.0
  ], 
  [
   387498, 
   null, 
   "simone", 
   "ER is multiply married?\n \n A serial polygamist?", 
   {}, 
   387473, 
   null, 
   1264444860.0
  ], 
  [
   387518, 
   null, 
   "jyoshu", 
   "Orthodox Jews are the successors of the Pharisees, placing more value on the letter of the law than trying to do what is right.\n \n Maybe Jews are pretty wary of people who come along talking about patriotism and family values because they, along with gays, gypsies, trade unionists, and socialists remember well where that road leads. The rhetoric from the right about \"real Americans\" must be particularly chilling.\n \n More generally, being in a minority does tend to make you more tolerant of the rights of other minorities, and less willing to ride rough shod over the personal choices of others to impose your own moral code.\n\n \n Of course your view carries a number of presumptions that are unproven at best. That conservative equates to some extent with what happened the Jews. And that conservatism equates to some extent with imposing a moral code. Both are as much over-simplifications as holding to an assumption that liberalism equates to these as well. (Particularly when comparing very different religions.)\n \n In point of fact, anyone who is imposing a 'moral code' when they try to change society by limiting the allowable actions of others. That includes, for example, when liberals impose free speech limits on religion while using 'opposing-hate-speech' as an excuse.\n \n The reality is, this silly view of conservative = bad and liberal = good, OR vice-versa is absolutely flawed fundamentally. Died-in-the-wool arrogant liberals are often shocked when they discover that it's a known myth that those angelic liberals give more to charity than all those gholish conservatives; the truth is that conservatives give about 30% more than liberals. In fact, religious people give a LOT more than non-religious people.\n As as a good liberal, the facts are suppose to matter a lot to you, right?\n \n \" The Church Connection\n \n It turns out that this idea that liberals give more&#8230;is a myth. Of the top 25 states where people give an above average percent of their income, 24 were red states in the last presidential election.\n \n Arthur Brooks, the author of \"Who Really Cares,\" says that \"when you look at the data, it turns out the conservatives give about 30 percent more.\" He adds, \"And incidentally, conservative-headed families make slightly less money.\" \n Finally, the single biggest predictor of whether someone will be charitable is their religious participation.\n \n ....... Religious people are more likely to give to charity, and when they give, they give more money: four times as much. And Arthur Brooks told me that giving goes beyond their own religious organization:\n \n \"Actually, the truth is that they're giving to more than their churches,\" he says. \"The religious Americans are more likely to give to every kind of cause and charity, including explicitly non-religious charities.\" \" More at Who Gives and Who Doesn't? - ABC NewsWow, how's that for busting the tired 'ol liberal=only-good/conservative=dasterdly false assumption?", 
   {}, 
   387272, 
   null, 
   1264455900.0
  ], 
  [
   387519, 
   null, 
   "Jo Bennett", 
   "Of course your view carries a number of presumptions that are unproven at best. That conservative equates to some extent with what happened the Jews. And that conservatism equates to some extent with imposing a moral code. Both are as much over-simplifications as holding to an assumption that liberalism equates to these as well. (Particularly when comparing very different religions.)\n \n In point of fact, anyone who is imposing a 'moral code' when they try to change society by limiting the allowable actions of others. That includes, for example, when liberals impose free speech limits on religion while using 'opposing-hate-speech' as an excuse.\n \n The reality is, this silly view of conservative = bad and liberal = good, OR vice-versa is absolutely flawed fundamentally. Died-in-the-wool arrogant liberals are often shocked when they discover that it's a known myth that those angelic liberals give more to charity than all those gholish conservatives; the truth is that conservatives give about 30% more than liberals. In fact, religious people give a LOT more than non-religious people.\n As as a good liberal, the facts are suppose to matter a lot to you, right?\n \n \" The Church Connection\n \n It turns out that this idea that liberals give more...is a myth. Of the top 25 states where people give an above average percent of their income, 24 were red states in the last presidential election.\n \n Arthur Brooks, the author of \"Who Really Cares,\" says that \"when you look at the data, it turns out the conservatives give about 30 percent more.\" He adds, \"And incidentally, conservative-headed families make slightly less money.\" \n Finally, the single biggest predictor of whether someone will be charitable is their religious participation.\n \n ....... Religious people are more likely to give to charity, and when they give, they give more money: four times as much. And Arthur Brooks told me that giving goes beyond their own religious organization:\n \n \"Actually, the truth is that they're giving to more than their churches,\" he says. \"The religious Americans are more likely to give to every kind of cause and charity, including explicitly non-religious charities.\" \" More at Who Gives and Who Doesn't? - ABC NewsWow, how's that for busting the tired 'ol liberal=only-good/conservative=dasterdly false assumption?\n\n \n You're not comparing like with like, as in American a lot of Christians are conservatives, and it is religion rather than conservatism that is the driver of their giving. Also, conservative strains of Christianity are more donation focussed, that's how come they can afford mega-churches. That and the prosperity doctrine, where people are encouraged to give because they're told it will make them richer. That's not generosity, that's greed.", 
   {
    "unicode_changes_made": true
   }, 
   387518, 
   null, 
   1264456740.0
  ], 
  [
   387520, 
   null, 
   "jyoshu", 
   "You're not comparing like with like, as in American a lot of Christians are conservatives, and it is religion rather than conservatism that is the driver of their giving. Also, conservative strains of Christianity are more donation focussed, that's how come they can afford mega-churches. That and the prosperity doctrine, where people are encouraged to give because they're told it will make them richer. That's not generosity, that's greed.\n\n \n The article specified 'conservatives' gave more, and then as a different point, that religious people gave more. \n \n When someone is giving more than others percentage-wise, it's not logical that the one giving demonstrates more greed. Your attempting to equate conservatism with all-things-bad just isn't working, Jo. Accept the facts.", 
   {}, 
   387519, 
   null, 
   1264457700.0
  ], 
  [
   387521, 
   null, 
   "trebor", 
   "Orthodox Jews are the successors of the Pharisees, placing more value on the letter of the law than trying to do what is right.\n \n\n \n Uh.. No. While there are some orthodox that do that, in general, there are a number of orthodox principles that help people escape that trap. You do not understand Judaism very well if you make this statement with a straight face.\n \n For example, one principle is that if someone's life is at stake, then that carries more importance than 'not doing work on the sabbath'. The \"Pikuach nefesh \" states\n \n Pikuach nefesh (Hebrew: &#1508;&#1497;&#1511;&#1493;&#1495; &#1504;&#1508;&#1513;&#8206;, \"saving of human life\") is the principle in Jewish law that the saving of a human life is paramount, overriding virtually any other religious consideration. When the life of a specific human being is in danger, almost any negative commandment of the Torah may be broken, with just three exceptions.\n \n \n \n \n\n Maybe Jews are pretty wary of people who come along talking about patriotism and family values because they, along with gays, gypsies, trade unionists, and socialists remember well where that road leads. The rhetoric from the right about \"real Americans\" must be particularly chilling.\n \n More generally, being in a minority does tend to make you more tolerant of the rights of other minorities, and less willing to ride rough shod over the personal choices of others to impose your own moral code.\n\n \n That is one of the reasons that so many Jewish people took part in the civil rights demonstrations in the 1960's.", 
   {}, 
   387272, 
   null, 
   1264458180.0
  ], 
  [
   387545, 
   null, 
   "electrolyte", 
   "I will leave it to the objective observer to decide which of us lies and is an irrational loon since even attempting to reason with you is an exercise in futility. :xbanghead\n\n Yes, your attempting to reason with me truly is an exercise in futility. You bring no reason to the table. This is precisely why you must lie, misrepresent, feign indignation, and act holier-than-thou nonstop. Of course I'll leave it to the readers to decide which of us lies and which of us doesn't, as I just pasted multiple excerpts of your lying.", 
   {}, 
   387473, 
   null, 
   1264469760.0
  ], 
  [
   387558, 
   null, 
   "Easyrider", 
   "What Reform Jews Believe\n \n http://www.beliefnet.com/story/80/story_8054_1.html\n \n Belief in Deity\n \n Beliefs vary among adherents, including that of nonbelief or questioning belief, and all are welcome and considered personal, but the official stance is that there is one God Almighty--Creator, all-powerful, ever-present, and all knowing--formless, incorporeal spirit. \n \n \u0095 Incarnations\n None, as only God is worshipped. Moses was the greatest of all prophets. \n \n \u0095 Origin of Universe and Life\n Most believe that Genesis is to be understood symbolically. God created and controls all phenomena revealed by modern science. \n \n \u0095 After Death\n Reform Jews believe in the world to come and a messianic age (but no individual Messiah). Personal beliefs in the details of afterlife are diverse, as there is no official position. Some believe in heaven and hell but only as states of consciousness; some believe in reincarnation; some believe God is all-forgiving; and some may not believe in an actual afterlife. Regardless, Judaism generally focuses on living a virtuous life, rather than working toward reward after death. \n \n \u0095 Why Evil?\n No original sin. Most often, Satan is interpreted symbolically to represent selfish desires that are inherent within all. God gave people free will, and people are responsible for their actions. \n \n \u0095 Salvation\n The main emphasis is on living the kind of life that God commands, which will surely be rewarded if there is an afterlife. Most believe God is forgiving of all; there is no hell to which some are condemned. Salvation is achieved through faith and prayer to God, good works, concern for the earth and humanity, and behavior that does no harm to others. The extent to which one follows Jewish Law is an individual decision. \n \n \u0095 Undeserved Suffering\n God gave humans free will to feel pleasure and pain, and his purpose in allowing deep suffering of the innocent must be good even if mysterious. It is generally believed that God suffers along with the sufferer. More important than knowing why God allows suffering is to work to help those in need. \n \n \u0095 Contemporary Issues\n Judaism holds that human life begins upon first breath, and Jewish law requires abortion if necessary to save the mother's life prior to birth. Most believe potential human life should never be terminated casually, but it is generally regarded as a personal decision, especially within the first 40 days of pregnancy. Homosexuality: Homosexuals are God's creation, and Jewish instruction is to love our neighbors as ourselves. Reform (and Conservative) Judaism have a long history of support for homosexual rights. \n \n \n So, what we have here is a hodgepodge of beliefs that are all over the board, including even non-belief! Some say there is a Creator and some say there is no creator. There is no official recognition of an afterlife, or even a Jewish Messiah. If there is an afterlife, it's based on rewarding works - believing in God is not even necessary (note \"Belief in Deity\" paragraph above). This is somewhat humerous since who is it that's supposedly going to reward those works if God doesn't exist?). As noted in their beliefs, \"Most believe God is forgiving of all.\" One has to wonder then if Reform Jews will feel at ease in eternity with Adolph Hitler and Joseph Stalin and other serial murderers running loose in their midst? In addition, rather than embrace traditional Judaism which teaches that Homosexual relations are a sin, Reform Jews openly endorse gay sex, saying such behavior is God-created! What's more, reincarnation is in too if they want, which is a documented pagan belief contrary to reason and traditional Judaism. In short, Reform Judaism is pretty much whatever people want to believe, based on their man-made whims. Questions such as, \"What happens to you if you are not a Reform Jew,\" and, \"How many works, and what kind of works, does it take to be rewarded with the afterlife\" are obviously anyone's guess.  IMO, Reform Judaism is a hodgepodge philosophical structure which is ill-defined, often contradictory to traditional Judaism, etc., man-created, and can certainly incorporate and embrace pagan beliefs and subjective, politically-correct dogma. \n \n A Reform Jew discusses his religion:\n \n One of the great problems of Reform Judaism, and I am a Reform Jew, is its lack of definition....\n \n Reform Judaism correctly modified a Judaism that was only dependent on belief and added the mental tool of reason to the religion. Reason has all but destroyed faith or belief because it has concluded that all religious truths, including the Revalation at Sinai, the major source of Jewish ethical and ritual law, must be evaluated through logic and these truths or beliefs have only a relative authenticity,i.e., they must be evaluated with a consideration of the historical, social, economic and psychiologocal persectives of the ancient Jews. As a result of this process, the Reform Jew has eliminated all if not almost all binding Jewish Law, and therfore, all or almost all binding behavior. \n \n The Reform Jew identifies himself primarily on the basis of belief. He believes that Judaism authenticates ethics. Yet Christians, agnostics and aetheists appaer to be ethical, and thus Jewish mandated ethiocal behavior does not differentiate and define the Jew.\n \n Many Reform Jews believe that \"God is in us\" which is denounced by traditional Judaism; the traditional concept of God is One who is separate from us and transcends the natural world....At the recent Reform Convention, the President of the Reform Judaism announced his intent that Reform Jews should re-embrace spirituality. \n \n Reform Judaism is by far the largest branch of Judaism, and the loss of membership in Reform Judaism is staggering. Reform Judaism which constitutes the largest segment of liberal Jews needs help...It recognizes that it has a problem. The rabbis have recognized the problem for several decades, but they have been unable or unwilling to solve it.\n \n Mail.Liberal-Judaism Volume 7 Number 79", 
   {
    "unicode_changes_made": true
   }, 
   387545, 
   null, 
   1264482060.0
  ], 
  [
   387560, 
   null, 
   "Archangel", 
   "Yes, your attempting to reason with me truly is an exercise in futility. \n\n \n No kidding, that's why I said it.\n \n \n You bring no reason to the table. \n\n \n Again, that's just what I said about you. Have you nothing original to bring to the table?\n \n \n This is precisely why you must lie, misrepresent, feign indignation, and act holier-than-thou nonstop. \n\n \n Why is it that all of you militant atheistic liberals all sound alike? Haven't you anything creative or original to offer me? I swear the same person is registered here as TQ, the obvious child, accipiter, penfold, you and smiley. You all offer nothing more than the same ole drivel and inane insults which accomplish nothing more than exposing your own philosophical cowardice and inability to offer substantial arguments.\n \n \n Of course I'll leave it to the readers to decide which of us lies and which of us doesn't, as I just pasted multiple excerpts of your lying.\n\n \n Again you just parrot my sentiments precisely. As usual not an original thought in your pea brain.", 
   {}, 
   387545, 
   null, 
   1264483020.0
  ], 
  [
   387561, 
   null, 
   "smiley", 
   "Why is it that all of you militant atheistic liberals all sound alike? Haven't you anything creative or original to offer me? I swear the same person is registered here as TQ, the obvious child, accipiter, penfold, you and smiley. You all offer nothing more than the same ole drivel and inane insults which accomplish nothing more than exposing your own philosophical cowardice and inability to offer substantial arguments.\n\n We do nothing more that expose the truth. But then you would have no idea what that looks like, would you?", 
   {}, 
   387560, 
   null, 
   1264483200.0
  ], 
  [
   387562, 
   null, 
   "Archangel", 
   "We do nothing more that expose the truth. But then you would have no idea what that looks like, would you?\n\n \n You have proven at every opportunity offered you that you wouldn't know the truth if you tripped over it. You will learn one day that this is what your life represented unless you repent before it's too late for you.\n \n Jhn 8:44 You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.", 
   {}, 
   387561, 
   null, 
   1264483860.0
  ], 
  [
   387563, 
   null, 
   "smiley", 
   "You have proven at every opportunity offered you that you wouldn't know the truth if you tripped over it. You will learn one day that this is what your life represented unless you repent before it's too late for you.\n \n Jhn 8:44 You belong to your father, the devil, and you want to carry out your father's desire. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies.\n\n \n Your lies have been documented many times.\n \n And why do you keep threatening me with this superstitious drivel? It means nothing.", 
   {}, 
   387562, 
   null, 
   1264484220.0
  ], 
  [
   387564, 
   null, 
   "JPSartre12", 
   "One might well ask, \"Why do people ask stupid questions?\"\n \n Obviously, ER, you don't know very many Jews.\n\n \n I know lots of Jews. I even went to college with a boatload of NY Jews. While I can't swear that this applies to all Jews, I can tell you that IME, they were very self-centered and hypocritical. They spent their first 3 years of college banging gentiles, but their senior years looking for a \"good Jewish marriage partner\", both males and females.\n And after marriage, she closes her legs, he finds a mistress and she doesn't care as long as the bills are paid and she has her big house and 2 kids. That's liberalism, Jewish-style. emoticon_rolleyes", 
   {}, 
   387317, 
   null, 
   1264485600.0
  ], 
  [
   387565, 
   null, 
   "electrolyte", 
   "Why is it that all of you militant atheistic liberals all sound alike? Haven't you anything creative or original to offer me?\n\n No need to reinvent the wheel. Your ilk always make the same dumbass arguments (PRATTs) that have common responses.\n \n \nI swear the same person is registered here as TQ, the obvious child, accipiter, penfold, you and smiley.\n\n Yeah, marc already had that one checked out. He demanded that admin check to see if TQ and I are the same person. admin found no evidence of such because we're not the same person. I can't speak for anyone but myself, but I'm only one person here.\n I do find it interesting, though, that Old Sarge has disappeared now that I've called him out as a sock puppet.\n \n \nAgain you just parrot my sentiments precisely. As usual not an original thought in your pea brain.\n\n Yes, it's called mockery, Archie. But you can't even recognize that. You don't get it. I'm making fun of the stupidity of your claims straight to your face, and you don't even realize it. But I'm the pea brain? Not too bright, are you?", 
   {}, 
   387560, 
   null, 
   1264489740.0
  ], 
  [
   387566, 
   null, 
   "trebor", 
   "I know lots of Jews. I even went to college with a boatload of NY Jews. While I can't swear that this applies to all Jews, I can tell you that IME, they were very self-centered and hypocritical. They spent their first 3 years of college banging gentiles, but their senior years looking for a \"good Jewish marriage partner\", both males and females.\n And after marriage, she closes her legs, he finds a mistress and she doesn't care as long as the bills are paid and she has her big house and 2 kids. That's liberalism, Jewish-style. emoticon_rolleyes\n\n \n Perhaps what you think was 'self centered and hypocritical' was merely the psychological phenomena known as 'projection'.", 
   {}, 
   387564, 
   null, 
   1264494420.0
  ], 
  [
   387569, 
   null, 
   "Accipiter", 
   "Your ilk always make the same dumbass arguments (PRATTs) that have common responses.\n\n \n See arch it's more than just my opinion.", 
   {
    "unicode_changes_made": true
   }, 
   387565, 
   null, 
   1264501380.0
  ], 
  [
   387570, 
   null, 
   "pappillion001", 
   "Ah, a friend of TQ who wants everyone but his fellow Christ-deniers to be nice.\n \n But don't worry. TQ has a double standard and won't ever call you out on your hatred.\n\n \n Easy, you are one bitter Christian today. You need to check out for a day or two. Your not even arguing anymore your just throwing out insults, they same insults you have thrown out 10, 20 + times just in the past week. \n \n Get off the Paul/John stuff move over to James or psalms and have a couple cookies.", 
   {}, 
   387335, 
   null, 
   1264503480.0
  ], 
  [
   387588, 
   null, 
   "jazyjason", 
   "Easy, you are one bitter Christian today. You need to check out for a day or two. Your not even arguing anymore your just throwing out insults, they same insults you have thrown out 10, 20 + times just in the past week. \n \n Get off the Paul/John stuff move over to James or psalms and have a couple cookies.\n\n \n He can't. He has to beat his narrow minded faith into our heads until his weak spirit is vindicated to prove to himself his faith is valid. It's overcompensation clearly. A lack of faith. I have no problem with my beliefs. I know christ is the son of the living God and died on the cross for our sins and is the redeamer of the world.\n \n And that he loves us all and created us in His image and Christ's beatitudes are a perfect example of how hypocritical Easy and Archie both are.\n \n Odd that a flaming liberal XXXXX is more secure in his faith than these two charlatans....", 
   {}, 
   387570, 
   null, 
   1264520880.0
  ], 
  [
   387601, 
   null, 
   "JPSartre12", 
   "Perhaps what you think was 'self centered and hypocritical' was merely the psychological phenomena known as 'projection'.\n\n \n While the Jews in college were banging the Gentiles, I was courting my future wife. No projection there, pal, just the facts. \n They sowed their wild oats, both male and female and then looked for \"purity\" that didn't exist because their counterparts were doing the same. \n They wouldn't share lecture notes for fear that you might do better than them on tests, I could give you a hundred examples, but to what end?", 
   {}, 
   387566, 
   null, 
   1264526520.0
  ], 
  [
   387602, 
   null, 
   "trebor", 
   "He can't. He has to beat his narrow minded faith into our heads until his weak spirit is vindicated to prove to himself his faith is valid. It's overcompensation clearly. A lack of faith. I have no problem with my beliefs. I know christ is the son of the living God and died on the cross for our sins and is the redeamer of the world.\n \n And that he loves us all and created us in His image and Christ's beatitudes are a perfect example of how hypocritical Easy and Archie both are.\n \n Odd that a flaming liberal XXXXX is more secure in his faith than these two charlatans....\n\n \n I noticed you don't get upset when I point out the inconsistencies of any god belief, nor are you trying to impose your beliefs on to others. That shows a certain confidence in faith that some have lacking.", 
   {}, 
   387588, 
   null, 
   1264526580.0
  ], 
  [
   387656, 
   null, 
   "Easyrider", 
   "Easy, you are one bitter Christian today. You need to check out for a day or two. Your not even arguing anymore your just throwing out insults, they same insults you have thrown out 10, 20 + times just in the past week. \n \n Get off the Paul/John stuff move over to James or psalms and have a couple cookies.\n\n \n It doesn't do any good to give you the wisdom of God's Word. It just goes in your eyes and out your pie hole.", 
   {}, 
   387570, 
   null, 
   1264549860.0
  ], 
  [
   387855, 
   null, 
   "jazyjason", 
   "I noticed you don't get upset when I point out the inconsistencies of any god belief, nor are you trying to impose your beliefs on to others. That shows a certain confidence in faith that some have lacking.\n\n \n \n Like I said. Faith of any kind can only be from within. I cannot force you to believe.", 
   {}, 
   387602, 
   null, 
   1264667760.0
  ], 
  [
   387866, 
   null, 
   "Archangel", 
   "I noticed you don't get upset when I point out the inconsistencies of any god belief, nor are you trying to impose your beliefs on to others. That shows a certain confidence in faith that some have lacking.\n\n \n You know trebor, what is so sad about you and your ilk is that you appear to be totally oblivious to how warped and twisted your reasoning is. You actually seem to believe that jason's lack of desire to defend christianity against those who misrepresent and condemn it shows a confidence rather than a true lack of commitment to defend the God whom he claims is His savior. You prove with every post how wanting you remain in possessing any Godly wisdom at all. Salvation came to the world by way of the JEW trebor, what happened to you, my lost and forsaken friend?\n 1Ti 4:6 If you instruct the brethren in these things, you will be a good minister of Jesus Christ, nourished in the words of faith and of the good doctrine which you have carefully followed.\n 1Ti 4:7 But reject profane and old wives' fables, and exercise yourself toward godliness.\n 1Ti 4:8 For bodily exercise profits a little, but godliness is profitable for all things, having promise of the life that now is and of that which is to come.\n 1Ti 4:9 This [is] a faithful saying and worthy of all acceptance.\n 1Ti 4:10 For to this [end] we both labor and suffer reproach, [fn] because we trust in the living God, who is [the] Savior of all men, especially of those who believe.\n 1Ti 4:11 These things command and teach.", 
   {}, 
   387602, 
   null, 
   1264696920.0
  ], 
  [
   387868, 
   null, 
   "Accipiter", 
   "You know tremor, what is so sad about you and your ilk is that you appear to be totally oblivious to how warped and twisted your reasoning is.\n\n \n You are projecting here.", 
   {}, 
   387866, 
   null, 
   1264698240.0
  ], 
  [
   387870, 
   null, 
   "Penfold", 
   "Jews have their share of illiberals like those two Christianist taliban.", 
   {}, 
   387868, 
   null, 
   1264700040.0
  ], 
  [
   387885, 
   null, 
   "trebor", 
   "Jews have their share of illiberals like those two Christianist taliban.\n\n \n Well, it's obvious, Jews are people too. We must all suffer through a number of \n people who are not nice. However, one thing the Jews won't do is say that the XXXXXX are not 'true jews'.\n \n The only time a group that claims to be Jewish isn't is if they use the New Testament and think Jesus is the messiah.", 
   {}, 
   387870, 
   null, 
   1264704180.0
  ], 
  [
   387888, 
   null, 
   "Archangel", 
   "Well, it's obvious, Jews are people too. We must all suffer through a number of \n people who are not nice. However, one thing the Jews won't do is say that the XXXXXX are not 'true jews'.\n \n The only time a group that claims to be Jewish isn't is if they use the New Testament and think Jesus is the messiah.\n\n \n Wrong again trebor. The born again Jew is in fact the completed Jew, and is precisely what the Apostles became after Messiah's ascension and His Holy Spirit came upon them and all believers on the day of Pentecost. They are the truest Jews because they are what God intended all Jews to become before most of you fulfilled this passage.\n Mat 21:42 Jesus said to them, \"Have you never read in the Scriptures: 'The stone which the builders rejected Has become the chief cornerstone. This was the LORD's doing, And it is marvelous in our eyes' [fn] ?\n Mat 21:43 \"Therefore I say to you, the kingdom of God will be taken from you and given to a nation bearing the fruits of it.\n Mat 21:44 And whoever falls on this stone will be broken; but on whomever it falls, it will grind him to powder.\"\n Mat 21:45 Now when the chief priests and Pharisees heard His parables, they perceived that He was speaking of them. Sadly I must point out that you are the Pharisee in this parable trebor. emoticon_xdonno", 
   {}, 
   387885, 
   null, 
   1264705800.0
  ], 
  [
   387889, 
   null, 
   "Jo Bennett", 
   "Well, it's obvious, Jews are people too. We must all suffer through a number of \n people who are not nice. However, one thing the Jews won't do is say that the XXXXXX are not 'true jews'.\n\n \n Not strictly true. Orthodox Jews don't recognise Reform conversions to Judaism, and I've met at least one Jew who claims you can be atheist and Jewish but you can't be Christian and Jewish. The same Jew also claims that any Jew who criticises Israel is a self-hating Jew. There's plenty of idiocy to go around.", 
   {}, 
   387885, 
   null, 
   1264706940.0
  ], 
  [
   387907, 
   null, 
   "trebor", 
   "Not strictly true. Orthodox Jews don't recognise Reform conversions to Judaism, and I've met at least one Jew who claims you can be atheist and Jewish but you can't be Christian and Jewish. The same Jew also claims that any Jew who criticises Israel is a self-hating Jew. There's plenty of idiocy to go around.\n\n \n I know many Jews that say you can be Jewish and atheist/agnostic. Every Shule has their token atheist. A person of Jewish heritage who practices\n Christianity has given up his Jewish faith, just as a person of Christian heritage who practices Buddhism or Islam is no longer Christian.\n \n And, well, yes, there are orthodox that don't recognize Reform conversions, but that is due to other matters other than behavior. \n \n I will disagree with him that a Jewish person who criticizes Israel is a self-hating Jew, but I know many who think that way. I disagree with them.", 
   {}, 
   387889, 
   null, 
   1264709040.0
  ], 
  [
   388004, 
   null, 
   "pappillion001", 
   "It doesn't do any good to give you the wisdom of God's Word. It just goes in your eyes and out your pie hole.\n\n \n Wow that is a coincidence. It seems God has the same complaint about you.", 
   {}, 
   387656, 
   null, 
   1264749480.0
  ], 
  [
   388020, 
   null, 
   "Easyrider", 
   "Wow that is a coincidence. It seems God has the same complaint about you.\n\n \n You don't believe in God so why do you claim to know what he thinks? Obviously you don't know what you're talking about.", 
   {}, 
   388004, 
   null, 
   1264778220.0
  ], 
  [
   388027, 
   null, 
   "Penfold", 
   "You don't believe in God so why do you claim to know what he thinks? Obviously you don't know what you're talking about.\n\n \n You believe in God so why do you claim to know what he thinks? He's supposed to be ineffable, so how can you presume to eff him? Obviously you don't know what you're talking about.", 
   {}, 
   388020, 
   null, 
   1264781400.0
  ], 
  [
   388033, 
   null, 
   "Easyrider", 
   "You believe in God so why do you claim to know what he thinks? He's supposed to be ineffable, so how can you presume to eff him? Obviously you don't know what you're talking about.\n\n \n <Flush<\n \n John 3:36", 
   {}, 
   388027, 
   null, 
   1264782840.0
  ], 
  [
   388036, 
   null, 
   "Accipiter", 
   "You don't believe in God so why do you claim to know what he thinks? Obviously you don't know what you're talking about.\n\n \n Logical fallacy here. \n \n Just ignore this sleazy I know it went right over your head, just follow your programming and post something from your bible.", 
   {}, 
   388020, 
   null, 
   1264783800.0
  ], 
  [
   388042, 
   null, 
   "Easyrider", 
   "\n \n Just ignore this sleazy I know it went right over your head, just follow your programming and post something from your bible.\n\n \n \n The genus Accipiter is a group of birds of prey in the family Accipitridae, many of which are named as goshawks and sparrowhawks.\n \n Accipiter - Wikipedia, the free encyclopedia\n \n That explains your continuing folly. You're a bird-brain.\n \n emoticon_xchickenemoticon_xchicken", 
   {}, 
   388036, 
   null, 
   1264788180.0
  ], 
  [
   388046, 
   null, 
   "Accipiter", 
   "The genus Accipiter is a group of birds of prey in the family Accipitridae, many of which are named as goshawks and sparrowhawks.\n \n Accipiter - Wikipedia, the free encyclopedia\n \n That explains your continuing folly. You're a bird-brain.\n \n emoticon_xchickenemoticon_xchicken\n\n \n Why that's a mighty impressive piece of thinking there sleazy.\n \n This reinforces my theory about fundamentalist so thanks for that.", 
   {
    "unicode_changes_made": true
   }, 
   388042, 
   null, 
   1264789800.0
  ], 
  [
   388047, 
   null, 
   "Easyrider", 
   "Why that's a mighty impressive piece of thinking there sleazy.\n \n\n \n This reinforces my theory about secular god haters, so thanks for that.", 
   {
    "unicode_changes_made": true
   }, 
   388046, 
   null, 
   1264789980.0
  ], 
  [
   388056, 
   null, 
   "Penfold", 
   "<Flush<\n \n John 3:36\n\n \n Your elision is noted. \n You are as an ant who presumes to speak for the ant-farm owner, claiming to know her intent and thoughts.", 
   {}, 
   388033, 
   null, 
   1264792560.0
  ], 
  [
   388067, 
   null, 
   "Accipiter", 
   "This reinforces my theory about secular god haters, so thanks for that.\n\n \n It's not hate you block head it's indifference.\n \n What I hate is pious bigots like you.", 
   {
    "unicode_changes_made": true
   }, 
   388047, 
   null, 
   1264794900.0
  ], 
  [
   388150, 
   null, 
   "Easyrider", 
   "\n \n What I hate is pious bigots like you.\n\n \n Like I said before, you're Accipiter, the bird brain. \n \n http://en.wikipedia.org/wiki/Accipiter\n \n So nothing you say is to be taken seriously.\n \n John 8:44", 
   {}, 
   388067, 
   null, 
   1264809600.0
  ], 
  [
   388181, 
   null, 
   "pappillion001", 
   "Like I said before, you're Accipiter, the bird brain. \n \n Accipiter - Wikipedia, the free encyclopedia\n \n So nothing you say is to be taken seriously.\n \n John 8:44\n\n \n If the Devil was a murderer from the beginning, why is he also believed to have been a favorite of God's and secondly again if he always was this why did God make him that way?", 
   {}, 
   388150, 
   null, 
   1264821600.0
  ], 
  [
   388195, 
   null, 
   "T.Q", 
   "If the Devil was a murderer from the beginning, why is he also believed to have been a favorite of God's and secondly again if he always was this why did God make him that way?\n\n \n I was always curious about that one. Supposedly, Satan rebelled against god because he chose humans over the angels (ie-Satan was jealous), and provided people with free will. Sooo, if angels (which Satan was one of) didn't have free will, how exactly did he \"choose\" to rebel against god?\n \n Not trying to slam anyone, I'm honestly curious: What is the explanation as to how Lucifer \"chose\" to rebel against god when angels don't have free will?", 
   {}, 
   388181, 
   null, 
   1264831320.0
  ], 
  [
   388196, 
   null, 
   "electrolyte", 
   "What is the explanation as to how Lucifer \"chose\" to rebel against god when angels don't have free will?\n\n T.Q, you fool! You're not allowed to ask intelligent questions about religion!", 
   {}, 
   388195, 
   null, 
   1264832880.0
  ], 
  [
   388198, 
   null, 
   "T.Q", 
   "T.Q, you fool! You're not allowed to ask intelligent questions about religion!\n\n \n Woops! Sorry, don't know what got into me there", 
   {}, 
   388196, 
   null, 
   1264833960.0
  ], 
  [
   388199, 
   null, 
   "pappillion001", 
   "I was always curious about that one. Supposedly, Satan rebelled against god because he chose humans over the angels (ie-Satan was jealous), and provided people with free will. Sooo, if angels (which Satan was one of) didn't have free will, how exactly did he \"choose\" to rebel against god?\n \n Not trying to slam anyone, I'm honestly curious: What is the explanation as to how Lucifer \"chose\" to rebel against god when angels don't have free will?\n\n \n As I hear tell Satan for Jews was the one who would point out mans sins or create problems to trip man up, but only with God's consent. Which is not quite how Christians understand him as used in John. \n \n We don't have free will either, but since you brought it up. How would free will and prophecy be compatible? Free will suggests the outcome of a decision isn't known until made yet prophecy is able to describe events prior to them happening.", 
   {}, 
   388195, 
   null, 
   1264838220.0
  ], 
  [
   388202, 
   null, 
   "T.Q", 
   "As I hear tell Satan for Jews was the one who would point out mans sins or create problems to trip man up, but only with God's consent. Which is not quite how Christians understand him as used in John. \n \n We don't have free will either, but since you brought it up. How would free will and prophecy be compatible? Free will suggests the outcome of a decision isn't known until made yet prophecy is able to describe events prior to them happening.\n\n \n Sheesh, now look who's asking intelligent questions about religion ;)", 
   {}, 
   388199, 
   null, 
   1264839780.0
  ], 
  [
   388210, 
   null, 
   "Easyrider", 
   " What is the explanation as to how Lucifer \"chose\" to rebel against god when angels don't have free will?\n\n \n Who said angels don't have free will? Got a scripture on that? 1/3 of them rebelled against God, didn't they? \n \n Those who rebelled followed Satan, who wanted to be like God.\n \n I recommend you get a good study Bible. Something like the NIV Study Bible, or the Life Application Study Bible, or the MacArthur Study Bible.", 
   {}, 
   388195, 
   null, 
   1264858620.0
  ], 
  [
   388219, 
   null, 
   "Archangel", 
   "Who said angels don't have free will? Got a scripture on that? 1/3 of them rebelled against God, didn't they? \n \n Those who rebelled followed Satan, who wanted to be like God.\n \n I recommend you get a good study Bible. Something like the NIV Study Bible, or the Life Application Study Bible, or the MacArthur Study Bible.\n\n \n This is one of the great questions which we struggle with according to our human understanding. Accordingly, it seems obvious to many that because God allowed Angels to rebel against Him, they must have free will. But the bible neither clarifies or explains the full extent of Gods ancient relationship with the angelic hosts nor does it say they had the right to rebel. Very much like we have the power to murder, but not the right to, so it is with the angels who rebelled against God.\n \n What we do have is Gods plan for fallen humanity and for the fallen angels and through our understanding of this relationship we can surmise certain realities. By this I mean that God said that He made Man in His image and He sent His only begotten son in order to save us from Hell which He says clearly that was created for the devil and his angels.\n \n In other word, although angels had the right to rebel against the God who created them as servants, not as children for fellowship with free will to reject Him as He did Man, They didn't possess the free will to do it or else salvation would also be available to them as it is for Man. This is why I have argued here that angels do NOT have free will even though God has allowed their rebellion to stand for a specific amount of time based on aspects of their relationship which we are unaware of in this incarnation.", 
   {}, 
   388210, 
   null, 
   1264864080.0
  ], 
  [
   388224, 
   null, 
   "T.Q", 
   "OK, so you two work it out amongst yourselves then let the rest of us heathens know.", 
   {}, 
   388219, 
   null, 
   1264868520.0
  ], 
  [
   388272, 
   null, 
   "Archangel", 
   "OK, so you two work it out amongst yourselves then let the rest of us heathens know.\n\n \n I'm not sure there is anything to work out. This is not a salvation issue in any way, but is an issue I believe is revealed according to the light one is prepared to receive so we needn't agree on every issue which isn't clarified scripturally in the bible in order to be brothers in Christ.", 
   {}, 
   388224, 
   null, 
   1264894620.0
  ], 
  [
   388282, 
   null, 
   "JPSartre12", 
   "I was always curious about that one. Supposedly, Satan rebelled against god because he chose humans over the angels (ie-Satan was jealous), and provided people with free will. Sooo, if angels (which Satan was one of) didn't have free will, how exactly did he \"choose\" to rebel against god?\n \n Not trying to slam anyone, I'm honestly curious: What is the explanation as to how Lucifer \"chose\" to rebel against god when angels don't have free will?\n\n \n I'm not familiar with any Bible passage that states that angels DON'T have free will. Can you cite your reference?", 
   {}, 
   388195, 
   null, 
   1264904220.0
  ], 
  [
   388302, 
   null, 
   "Penfold", 
   "There may be something in the psalms, but they were mostly invented after the Lateran council decided God was Triune.\n \n Archie seems to agree with the premise.", 
   {}, 
   388282, 
   null, 
   1264909200.0
  ], 
  [
   388315, 
   null, 
   "trebor", 
   "I'm not familiar with any Bible passage that states that angels DON'T have free will. Can you cite your reference?\n\n \n In the Jewish Faith, that is tradition.. and has been since before the Book of Job was written", 
   {}, 
   388282, 
   null, 
   1264914420.0
  ], 
  [
   388325, 
   null, 
   "JPSartre12", 
   "In the Jewish Faith, that is tradition.. and has been since before the Book of Job was written\n\n \n Christianity and Judaism parted company with the birth of Christ.", 
   {}, 
   388315, 
   null, 
   1264924260.0
  ], 
  [
   388337, 
   null, 
   "Easyrider", 
   "There may be something in the psalms.... \n\n \n You might be better 'versed' if you read the Bible.", 
   {}, 
   388302, 
   null, 
   1264947120.0
  ], 
  [
   388340, 
   null, 
   "Easyrider", 
   "Originally Posted by JPSartre12 : I'm not familiar with any Bible passage that states that angels DON'T have free will. Can you cite your reference? \n \n \nIn the Jewish Faith, that is tradition.. and has been since before the Book of Job was written\n\n \n Prove it.\n \n That's what this thread is all about - people like you, Trebor, making up teachings and traditions that you can't point to in the Holy Scriptures. \n \n Like Isaiah said, \"The Lord says: \n \"These people come near to me with their mouth \n and honor me with their lips, \n but their hearts are far from me. \n Their worship of me \n is made up only of rules taught by men.\" - Isaiah 29:13", 
   {}, 
   388315, 
   null, 
   1264947420.0
  ], 
  [
   388363, 
   null, 
   "Penfold", 
   "Originally Posted by JPSartre12 : I'm not familiar with any Bible passage that states that angels DON'T have free will. Can you cite your reference? \n \n \n \n Prove it.\n \n That's what this thread is all about - people like you, Trebor, making up teachings and traditions that you can't point to in the Holy Scriptures. \n \n Like Isaiah said, \"The Lord says: \n \"These people come near to me with their mouth \n and honor me with their lips, \n but their hearts are far from me. \n Their worship of me \n is made up only of rules taught by men.\" - Isaiah 29:13\n\n \n Archie agrees that angels lack free will (somehow!) is he working to the man-rules too?", 
   {}, 
   388340, 
   null, 
   1264959240.0
  ], 
  [
   388399, 
   null, 
   "trebor", 
   "Christianity and Judaism parted company with the birth of Christ.\n\n \n There have been many christs. David is one of them. \"CHrist' Is merely the Greek for 'anointed' one, and the kings of israel , as well as the High Priests\n of the temple are anointed.\n \n Where Judaism and Christianity part is when Christianity insists that Jesus is 'The Christ', and is 'God'.. a very pagan idea.", 
   {}, 
   388325, 
   null, 
   1264972560.0
  ], 
  [
   388409, 
   null, 
   "pappillion001", 
   "Christianity and Judaism parted company with the birth of Christ.\n\n \n Technically wouldn't the split have been much later and I would think be attributable more to Paul than Jesus.", 
   {}, 
   388325, 
   null, 
   1264974660.0
  ], 
  [
   388466, 
   null, 
   "Archangel", 
   "There have been many christs. David is one of them. \"CHrist' Is merely the Greek for 'anointed' one, and the kings of israel , as well as the High Priests\n of the temple are anointed.\n \n Where Judaism and Christianity part is when Christianity insists that Jesus is 'The Christ', and is 'God'.. a very pagan idea.\n\n \n It isn't just Christianity that insists this, Jesus Himself insisted it. And when hundreds of people saw Him after His resurrection, His contemporaries, even those who never accepted Him as their savior never denied the resurrection. You seem to forget that this was a very small community where most everybody knew everybody else. Word traveled quickly and Jesus was a living revolution wherever He went. This is why the Sanhedrin feared Him so much. They believed He was bringing a new gospel rather than fulfilling the prophecies regarding Messiah which the Torah also promises. So you are wrong on all counts.", 
   {}, 
   388399, 
   null, 
   1264998120.0
  ], 
  [
   389179, 
   null, 
   "Easyrider", 
   "\n \n Where Judaism and Christianity part is when Christianity insists that Jesus is 'The Christ', and is 'God'.. a very pagan idea.\n\n \n Sorry, Jack, but the origins that speak of Christ are in the Old Testament. The stiff-necked Judaizers still won't believe or acknowledge it, though. These are the spiritual descendants of those who did laps around Mt. Sinai for 40 years due to their rebellion against God and the prophets. And you're one of them.", 
   {}, 
   388399, 
   null, 
   1265550000.0
  ], 
  [
   389283, 
   null, 
   "trebor", 
   "Sorry, Jack, but the origins that speak of Christ are in the Old Testament. The stiff-necked Judaizers still won't believe or acknowledge it, though. These are the spiritual descendants of those who did laps around Mt. Sinai for 40 years due to their rebellion against God and the prophets. And you're one of them.\n\n \n What you don't realize, due to a lack of intelligence and understanding , is the Jewish concept of the Messiah and the Christian concept are very different. The Jewish concept was a very extraordinary but totally human figure that will kick foreign occupation out of israel and restore the line of David to kingship.\n \n This whole 'Lets make our King a god' thing is very pagan.", 
   {}, 
   389179, 
   null, 
   1265577060.0
  ], 
  [
   389286, 
   null, 
   "Easyrider", 
   "What you don't realize, due to a lack of intelligence and understanding , is the Jewish concept of the Messiah and the Christian concept are very different. \n\n \n No, Trebor. YOUR concept is different. As I have documented time and time again, the OT clearly supports the Christian traditions on Christ.\n \n Psalm 2\n Isaiah 53\n Isaiah 7\n Jeremiah 23:5-6, etc.\n \n Those for starters.\n \n Take another lap around Mt. Sinai, Trebor.", 
   {}, 
   389283, 
   null, 
   1265577360.0
  ], 
  [
   389293, 
   null, 
   "trebor", 
   "No, Trebor. YOUR concept is different. As I have documented time and time again, the OT clearly supports the Christian traditions on Christ.\n \n Psalm 2\n Isaiah 53\n Isaiah 7\n Jeremiah 23:5-6, etc.\n \n Those for starters.\n \n Take another lap around Mt. Sinai, Trebor.\n\n \n I have taken many 'laps around Mt Sinai, trying to correct your errors with the Jewish Scriptures.\n \n Psalm 2 is about King David, and it demonstrates that the term 'Son of God' is used for someone exaulted by God , since David was a 'son of God' when he became King.\n \n Isaiah 53 is about that NATION of Israel, which if you actually read it in context it will become clear (and you use a proper translatoin, not this mishmash Christians came up with).\n \n Isaiah 7 is about Isaiahs son, and marks a time frame, not the specific person.\n \n etc etc etc.", 
   {}, 
   389286, 
   null, 
   1265578440.0
  ], 
  [
   389294, 
   null, 
   "Easyrider", 
   "I have taken many 'laps around Mt Sinai, trying to correct your errors with the Jewish Scriptures.\n \n Psalm 2 is about King David, and it demonstrates that the term 'Son of God' is used for someone exaulted by God , since David was a 'son of God' when he became King.\n \n Isaiah 53 is about that NATION of Israel, which if you actually read it in context it will become clear (and you use a proper translatoin, not this mishmash Christians came up with).\n \n Isaiah 7 is about Isaiahs son, and marks a time frame, not the specific person.\n \n etc etc etc.\n\n \n Bull. As usual you're all screwed up on that. They're about Christ. You need spiritual assistance to understand these things (1 Cor. 2:14).", 
   {}, 
   389293, 
   null, 
   1265578500.0
  ], 
  [
   389298, 
   null, 
   "trebor", 
   "Bull. As usual you're all screwed up on that. They're about Christ. You need spiritual assistance to understand these things (1 Cor. 2:14).\n\n \n \n That's the claim.. you keep on doing epic fails when trying to show it from the\n actual texts.. you have to go to the Christian indoctrination files to try to find support for that idea, but you can't support it from the Jewish scriptures without using the distortions of the New Testement", 
   {}, 
   389294, 
   null, 
   1265578680.0
  ], 
  [
   389300, 
   null, 
   "Easyrider", 
   "That's the claim.. you keep on doing epic fails when trying to show it from the\n actual texts.. you have to go to the Christian indoctrination files to try to find support for that idea, but you can't support it from the Jewish scriptures without using the distortions of the New Testement\n\n \n <Flush<\n \n You don't know what you're talking about.", 
   {}, 
   389298, 
   null, 
   1265578800.0
  ], 
  [
   389302, 
   null, 
   "Archangel", 
   "What you don't realize, due to a lack of intelligence and understanding , is the Jewish concept of the Messiah and the Christian concept are very different. The Jewish concept was a very extraordinary but totally human figure that will kick foreign occupation out of israel and restore the line of David to kingship.\n \n This whole 'Lets make our King a god' thing is very pagan.\n\n \n You are absolutely right about this being the Pharisee's definition of who Messiah would be when He finally appeared. BUT THEY WERE WRONG IN THAT INTERPRETATION. Wont you ever get that fact through your head? Jesus told the Jews the truth and the pharisee's rejected Him for it. You continue to demand that the erroneous interpretation and expectations of the lost pharisees is correct when Easy hit the nail right on the head in pointing out that you are carrying on the error which led to forty years of marching around Mt Sinai.", 
   {}, 
   389283, 
   null, 
   1265579280.0
  ], 
  [
   389315, 
   null, 
   "trebor", 
   "<Flush<\n \n You don't know what you're talking about.\n\n \n I know that you are 'giving' up on the debate when you either resort to 'flush', or insults. \n \n Which, is most of the time with most people.\n \n This shows you are totally incompetent when it comes to analysis", 
   {}, 
   389300, 
   null, 
   1265582460.0
  ], 
  [
   389316, 
   null, 
   "Easyrider", 
   "I know that you are 'giving' up on the debate when you either resort to 'flush', or insults. \n \n Which, is most of the time with most people.\n \n This shows you are totally incompetent when it comes to analysis\n\n \n <Flush<\n \n You still do not know what you're talking about.", 
   {}, 
   389315, 
   null, 
   1265582700.0
  ], 
  [
   389321, 
   null, 
   "trebor", 
   "<Flush<\n \n You still do not know what you're talking about.\n\n \n \n You, on the other hand, quite completely confirm my analysis of your 'debate' techniques. Pity that you are too incompetent to understand that. However, those people who are ex-Christians thank you for helping them come to their now 'ex' status.", 
   {}, 
   389316, 
   null, 
   1265585820.0
  ], 
  [
   389329, 
   null, 
   "Easyrider", 
   "You, on the other hand, quite completely confirm my analysis of your 'debate' techniques. Pity that you are too incompetent to understand that. However, those people who are ex-Christians thank you for helping them come to their now 'ex' status.\n\n \n Anyone you are talking about there were charlatans to begin with. Real born-again believers don't leave the faith (Philippians 1:6, etc.). Only the exposed imposters do.\n \n Once Saved, Always Saved\n \n So once again, you don't know what you're talking about. Take another lap around Mt. Sinai, preppie.", 
   {}, 
   389321, 
   null, 
   1265589420.0
  ], 
  [
   389347, 
   null, 
   "trebor", 
   "Anyone you are talking about there were charlatans to begin with. Real born-again believers don't leave the faith (Philippians 1:6, etc.). Only the exposed imposters do.\n \n Once Saved, Always Saved\n \n So once again, you don't know what you're talking about. Take another lap around Mt. Sinai, preppie.\n\n \n Ah yes, more indoctrination material that really doesn't mean a whole lot of squat about anything. It is a whole lot of garbage that is using the logical \n fallacy as 'Argument from personal belief', but it doesn't mean a whole hill of beans.\n \n Someday, you might post something of substance, but I am not holding my breath.\n \n The whole 'born again' phenomena is \"I can lie to myself and pretend I am better because I believe\" but it is a hollow belief.", 
   {}, 
   389329, 
   null, 
   1265591580.0
  ], 
  [
   389389, 
   null, 
   "Easyrider", 
   "Ah yes, more indoctrination material that really doesn't mean a whole lot of squat about anything. It is a whole lot of garbage that is using the logical \n fallacy as 'Argument from personal belief', but it doesn't mean a whole hill of beans.\n \n Someday, you might post something of substance, but I am not holding my breath.\n \n\n \n You might could get saved someday when you get educated on these issues.", 
   {}, 
   389347, 
   null, 
   1265598000.0
  ], 
  [
   389394, 
   null, 
   "Esdraelon", 
   "trebor:\n \n Um...just an observation, since we were speaking on the matter; whatever you note as 'ad hominem' responses from easyrider, you have to admit that it appears that he is genuinely concerned for you. \n \n Personally, I don't believe that God ever gives up on anyone and while what easyrider offers may be meaningless to you today, your perception may change at a later date. Far worse individuals than you have come to Christ and this is one 'fact' not to be denied. \n \n Time will tell, but on the other hand, you may get dressed tomorrow to go off to work and get flattened in your car by a 16 wheeler on the interstate. That's also another fact not to be denied...but again, I digress.", 
   {}, 
   389389, 
   null, 
   1265599320.0
  ], 
  [
   389411, 
   null, 
   "trebor", 
   "You might could get saved someday when you get educated on these issues.\n\n \n I am educated on the claims of Christians. I also know common sense, and that is why I know the concept of 'being saved' is unneeded.", 
   {}, 
   389389, 
   null, 
   1265601960.0
  ], 
  [
   389412, 
   null, 
   "Archangel", 
   "trebor:\n \n Um...just an observation, since we were speaking on the matter; whatever you note as 'ad hominem' responses from easyrider, you have to admit that it appears that he is genuinely concerned for you. \n \n Personally, I don't believe that God ever gives up on anyone and while what easyrider offers may be meaningless to you today, your perception may change at a later date. Far worse individuals than you have come to Christ and this is one 'fact' not to be denied. \n \n Time will tell, but on the other hand, you may get dressed tomorrow to go off to work and get flattened in your car by a 16 wheeler on the interstate. That's also another fact not to be denied...but again, I digress.\n\n \n Remember, the bible promises that the day will come when God will remove the scales from the eyes of the Jew and at least a remnant will see clearly at that time. Trebor may very well be one of those recipients and what we are telling him here may very well come back to bless him at that time. The word of God never comes back void after all. emoticon_xangel", 
   {}, 
   389394, 
   null, 
   1265602020.0
  ], 
  [
   389417, 
   null, 
   "gansao", 
   "I am educated on the claims of Christians. I also know common sense, and that is why I know the concept of 'being saved' is unneeded.\n\n \n Educated in the same way a eunuch can be educated on sex.\n Knowing all but gaining nothing from it.", 
   {}, 
   389411, 
   null, 
   1265603340.0
  ], 
  [
   389420, 
   null, 
   "Esdraelon", 
   "Educated in the same way a eunuch can be educated on sex.\n Knowing all but gaining nothing from it.\n\n \n Unfortunately, you are correct. But never count anyone out, at some date he may be able to do so.\n Excellent point though.", 
   {}, 
   389417, 
   null, 
   1265603700.0
  ], 
  [
   389422, 
   null, 
   "Easyrider", 
   " I also know common sense, and that is why I know the concept of 'being saved' is unneeded.\n\n \n Typical failed belief of Judaism. You think you're good enough of your own merits to achieve eternal life? You should know better than that. \n \n Isaiah 64:6 'But we are all as an unclean thing and all our righteous works are as filthy rags...'\n \n You're still trying to inject your failed political correctness into God's economy of salvation. And I'll warn you again - it won't work. You're in dire danger of winding up in the Pit unless you repent and receive Jesus Christ as your Lord God and Savior for the remission of your sins.\n \n You need to reread The Parable of the Wedding Feast:\n \n http://www.4forums.com/political/religion-debates/13850-hellbound-christ-deniers.html#post388215", 
   {}, 
   389411, 
   null, 
   1265605020.0
  ], 
  [
   389460, 
   null, 
   "trebor", 
   "Educated in the same way a eunuch can be educated on sex.\n Knowing all but gaining nothing from it.\n\n \n \n Or perhaps, being on the outside looking in, seeing that there is nothing to actually gain from the illusion it provides.\n \n After all, I see how such belief causes Easyrider and Archangel to be. \n \n And you.", 
   {}, 
   389417, 
   null, 
   1265645580.0
  ], 
  [
   389463, 
   null, 
   "gansao", 
   "Or perhaps, being on the outside looking in, seeing that there is nothing to actually gain from the illusion it provides.\n \n After all, I see how such belief causes Easyrider and Archangel to be. \n \n And you.\n\n \n The eunuch analogy is closer.\n Someone who studies something they dont believe in so they can berate the people who do could be compared with a frigid maiden aunt who reads Jackie Collins novels though:)", 
   {}, 
   389460, 
   null, 
   1265646000.0
  ], 
  [
   389471, 
   null, 
   "Esdraelon", 
   "The eunuch analogy is closer.\n Someone who studies something they dont believe in so they can berate the people who do could be compared with a frigid maiden aunt who reads Jackie Collins novels though:)\n\n \n Hey, you have a quick wit! Are you sure you're not Ann masquerading with us stinking unwashed?", 
   {}, 
   389463, 
   null, 
   1265648520.0
  ], 
  [
   389476, 
   null, 
   "trebor", 
   "Hey, you have a quick wit! Are you sure you're not Ann masquerading with us stinking unwashed?\n\n \n \n He thinks he is a wit.\n \n he, on the other hand, is only half right.", 
   {}, 
   389471, 
   null, 
   1265651040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why are Jews Liberals?", 
  "url": "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13830, 
  "discussion_files": [
   [
    "27517.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-print.html"
   ], 
   [
    "27518.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-9-print.html"
   ], 
   [
    "27519.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-7-print.html"
   ], 
   [
    "27520.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-5-print.html"
   ], 
   [
    "27521.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-4-print.html"
   ], 
   [
    "27522.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-6-print.html"
   ], 
   [
    "27523.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-8-print.html"
   ], 
   [
    "27524.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-3-print.html"
   ], 
   [
    "27525.html", 
    "http://www.4forums.com/political/religion-debates/13830-why-jews-liberals-2-print.html"
   ]
  ], 
  "identifier": 13830
 }
]