[
 [
  [
   387896, 
   null, 
   "Lurch907", 
   "I'm curious to find out what folks here thought about President Obama's State of the Union address. Below I quoted the only portion of the speech that pertained to this section of the forum.\n \n \nThis year -- this year, I will work with Congress and our military to finally repeal the law that denies gay Americans the right to serve the country they love because of who they are. It's the right thing to do\n\n \n I found it a bit interesting that he didn't mention DOMA at all, it was certainly a campaign issue. While I think he will try to overturn DADT I don't think he'll be able to pull it off. He is in nearly the exact same position as President Clinton and we saw how well that worked out. If he wanted to get this done he should have done it while he had 60% of the Senate. I would advise he hurry if he is going to try because I don't think the mid-term election is going to go well for Democrats.\n \n What do you think?", 
   {
    "post_info": {
     "post_title": "Obama State of the union"
    }
   }, 
   null, 
   null, 
   1264707720.0
  ], 
  [
   387942, 
   null, 
   "jyoshu", 
   "I'm curious to find out what folks here thought about President Obama's State of the Union address. Below I quoted the only portion of the speech that pertained to this section of the forum.\n \n I found it a bit interesting that he didn't mention DOMA at all, it was certainly a campaign issue. While I think he will try to overturn DADT I don't think he'll be able to pull it off. He is in nearly the exact same position as President Clinton and we saw how well that worked out. If he wanted to get this done he should have done it while he had 60% of the Senate. I would advise he hurry if he is going to try because I don't think the mid-term election is going to go well for Democrats.\n \n What do you think?\n\n \n It was the usual carrot and stick gig--just enough token commentary to keep the gay-issue special interest groups on a string.", 
   {}, 
   387896, 
   null, 
   1264717500.0
  ], 
  [
   387944, 
   null, 
   "Lurch907", 
   "It was the usual carrot and stick gig--just enough token commentary to keep the gay-issue special interest groups on a string.\n\n \n Yeah, he could just be paying lip service. If he does follow through, do you think he has a chance?", 
   {}, 
   387942, 
   null, 
   1264717680.0
  ], 
  [
   387946, 
   null, 
   "jyoshu", 
   "Yeah, he could just be paying lip service. If he does follow through, do you think he has a chance?\n\n \n No, the only chance he's got at this point is to move more centrist. If he moves even farther to the left it will just make it even harder for him, IMO.", 
   {}, 
   387944, 
   null, 
   1264718400.0
  ], 
  [
   387954, 
   null, 
   "josephdphillips", 
   "Didn't watch. He bores me to tears.", 
   {}, 
   387946, 
   null, 
   1264722300.0
  ], 
  [
   387958, 
   null, 
   "Lurch907", 
   "Didn't watch. He bores me to tears.\n\n \n Me too, I read the transcript this morning. Much faster and I don't have to listen to a robot read a teleprompter.", 
   {}, 
   387954, 
   null, 
   1264724040.0
  ], 
  [
   387960, 
   null, 
   "jyoshu", 
   "I watched most of it, actually. I think he did a decent job speaking-wise. I think he said what he politically needed to say. I don't think it's going to bail him out of his situation.\n What annoys me is that the WH is spinning the outrage in the country as a failure on their part to connect to the public rather that a realization that their policies themselves are what is generating the outrage.", 
   {}, 
   387958, 
   null, 
   1264724280.0
  ], 
  [
   387989, 
   null, 
   "Easyrider", 
   "Evidently Obama is still spiritually stunted, pushing for gays to be open in the military. Sin costs lives. The Old Testament is clear on that. And gay sex is a sin. Look what happened when only one man sinned (from Joshua 7):\n \n But the Israelites acted unfaithfully in regard to the devoted things [a] ; Achan son of Carmi, the son of Zimri, [b] the son of Zerah, of the tribe of Judah, took some of them. So the LORD's anger burned against Israel. \n 2 Now Joshua sent men from Jericho to Ai, which is near Beth Aven to the east of Bethel, and told them, \"Go up and spy out the region.\" So the men went up and spied out Ai. \n \n 3 When they returned to Joshua, they said, \"Not all the people will have to go up against Ai. Send two or three thousand men to take it and do not weary all the people, for only a few men are there.\" 4 So about three thousand men went up; but they were routed by the men of Ai, 5 who killed about thirty-six of them. They chased the Israelites from the city gate as far as the stone quarries [c] and struck them down on the slopes. At this the hearts of the people melted and became like water. \n \n 6 Then Joshua tore his clothes and fell facedown to the ground before the ark of the LORD, remaining there till evening. The elders of Israel did the same, and sprinkled dust on their heads. 7 And Joshua said, \"Ah, Sovereign LORD, why did you ever bring this people across the Jordan to deliver us into the hands of the Amorites to destroy us? If only we had been content to stay on the other side of the Jordan! 8 O Lord, what can I say, now that Israel has been routed by its enemies? 9 The Canaanites and the other people of the country will hear about this and they will surround us and wipe out our name from the earth. What then will you do for your own great name?\" \n \n 10 The LORD said to Joshua, \"Stand up! What are you doing down on your face? 11 Israel has sinned; they have violated my covenant, which I commanded them to keep. They have taken some of the devoted things; they have stolen, they have lied, they have put them with their own possessions. 12 That is why the Israelites cannot stand against their enemies; they turn their backs and run because they have been made liable to destruction. I will not be with you anymore unless you destroy whatever among you is devoted to destruction. \n \n 13 \"Go, consecrate the people. Tell them, 'Consecrate yourselves in preparation for tomorrow; for this is what the LORD, the God of Israel, says: That which is devoted is among you, O Israel. You cannot stand against your enemies until you remove it. \n \n Read the rest for yourselves.\n \n Obama is deluded, and a room full of people clapped for his ungodly decision. They're deluded too. Get them out of office before they get more people killed.\n \n Principle: Your sin has separated you from God (Isaiah 59). And then there are consequences. And while there are also heterosexual sinners, we don't need to be compounding the problem with a hoard of gay sex sinners who have a tendency to disrupt unit cohesiveness. Straight men don't want to be oogled in the shower, or hit upon by gays in the barracks and elsewhere.\n \n Obama is a walking disaster as a Christian. He's already approved of federal funding for abortions in his health care bill. Perhaps they should pour out the bloody remains of those innocent babies on his desk tomorrow and see how he likes that. He needs to read Jeremiah 1:5 and Psalm 139:13 on that.", 
   {}, 
   387960, 
   null, 
   1264738440.0
  ], 
  [
   387997, 
   null, 
   "Matthew S", 
   "Evidently Obama is still spiritually stunted, pushing for gays to be open in the military. Sin costs lives. The Old Testament is clear on that. And gay sex is a sin. Look what happened when only one man sinned (from Joshua 7):\n \n But the Israelites acted unfaithfully in regard to the devoted things [a] ; Achan son of Carmi, the son of Zimri, [b] the son of Zerah, of the tribe of Judah, took some of them. So the LORD's anger burned against Israel. \n 2 Now Joshua sent men from Jericho to Ai, which is near Beth Aven to the east of Bethel, and told them, \"Go up and spy out the region.\" So the men went up and spied out Ai. \n \n 3 When they returned to Joshua, they said, \"Not all the people will have to go up against Ai. Send two or three thousand men to take it and do not weary all the people, for only a few men are there.\" 4 So about three thousand men went up; but they were routed by the men of Ai, 5 who killed about thirty-six of them. They chased the Israelites from the city gate as far as the stone quarries [c] and struck them down on the slopes. At this the hearts of the people melted and became like water. \n \n 6 Then Joshua tore his clothes and fell facedown to the ground before the ark of the LORD, remaining there till evening. The elders of Israel did the same, and sprinkled dust on their heads. 7 And Joshua said, \"Ah, Sovereign LORD, why did you ever bring this people across the Jordan to deliver us into the hands of the Amorites to destroy us? If only we had been content to stay on the other side of the Jordan! 8 O Lord, what can I say, now that Israel has been routed by its enemies? 9 The Canaanites and the other people of the country will hear about this and they will surround us and wipe out our name from the earth. What then will you do for your own great name?\" \n \n 10 The LORD said to Joshua, \"Stand up! What are you doing down on your face? 11 Israel has sinned; they have violated my covenant, which I commanded them to keep. They have taken some of the devoted things; they have stolen, they have lied, they have put them with their own possessions. 12 That is why the Israelites cannot stand against their enemies; they turn their backs and run because they have been made liable to destruction. I will not be with you anymore unless you destroy whatever among you is devoted to destruction. \n \n 13 \"Go, consecrate the people. Tell them, 'Consecrate yourselves in preparation for tomorrow; for this is what the LORD, the God of Israel, says: That which is devoted is among you, O Israel. You cannot stand against your enemies until you remove it. \n \n Read the rest for yourselves.\n \n Obama is deluded, and a room full of people clapped for his ungodly decision. They're deluded too. Get them out of office before they get more people killed.\n \n Principle: Your sin has separated you from God (Isaiah 59). And then there are consequences. And while there are also heterosexual sinners, we don't need to be compounding the problem with a hoard of gay sex sinners who have a tendency to disrupt unit cohesiveness. Straight men don't want to be oogled in the shower, or hit upon by gays in the barracks and elsewhere.\n \n Obama is a walking disaster as a Christian. He's already approved of federal funding for abortions in his health care bill. Perhaps they should pour out the bloody remains of those innocent babies on his desk tomorrow and see how he likes that. He needs to read Jeremiah 1:5 and Psalm 139:13 on that.\n\n \n You keep bringing up the jewish fairy tale book. Why do you not just call for the death of gays as your jewish fairy tale book tells you too.", 
   {}, 
   387989, 
   null, 
   1264741500.0
  ], 
  [
   388010, 
   null, 
   "Archangel", 
   "I'm curious to find out what folks here thought about President Obama's State of the Union address. Below I quoted the only portion of the speech that pertained to this section of the forum.\n \n \n \n I found it a bit interesting that he didn't mention DOMA at all, it was certainly a campaign issue. While I think he will try to overturn DADT I don't think he'll be able to pull it off. He is in nearly the exact same position as President Clinton and we saw how well that worked out. If he wanted to get this done he should have done it while he had 60% of the Senate. I would advise he hurry if he is going to try because I don't think the mid-term election is going to go well for Democrats.\n \n What do you think?\n\n \n This president in name only, but by no means in character just proved how absolutely disconnected with both reality and the american people he is to have given such a staunchly militant liberal speech after the last 3 elections in Virginia, New Jersey and culminating with the very strong message which was just sent by the very liberal State of Massachusetts just last week in their special election. \n \n He proved he has no respect for the will of the people as he acted as a cheer leader in calling for the democratic majority to force their policies through even though the people oppose his attempt to fundamentally transform America from free market capitalism to a socialist state. They do this at their own peril.\n \n As for DADT, I doubt the Military authorities will submit to his request without a fight. And it will be interesting if the democratic majority will even dare to try to force a bill through at this point. And it is interesting, and typical cowardice on his part that he never even mentioned the main homosexual issue of DOMA. Good call on noticing that. emoticon_xagree", 
   {}, 
   387896, 
   null, 
   1264767000.0
  ], 
  [
   388022, 
   null, 
   "Easyrider", 
   "You keep bringing up the jewish fairy tale book. Why do you not just call for the death of gays as your jewish fairy tale book tells you too.\n\n \n You haven't provided any evidence the Bible is a fairy tale. But I do think you like the sound of those last two words in the previous sentence.\n \n It's God or the government (Romans 13) in the NT who dispense capital punishment. If you weren't so consumed with your illicit gay sex escapades to read the NT you would have known that.\n \n Keep screwing around and God himself just might take you and/or your buddy Jazy off the earth like he did with Annanias Sapphira in the Book of Acts.", 
   {}, 
   387997, 
   null, 
   1264778880.0
  ], 
  [
   388035, 
   null, 
   "Steeeeve", 
   "Does the military have a position on this or have any data to show it helps or hurts something? Really that is what it should come down to.", 
   {}, 
   388022, 
   null, 
   1264783200.0
  ], 
  [
   388037, 
   null, 
   "thelmoose", 
   "Does the military have a position on this or have any data to show it helps or hurts something? Really that is what it should come down to.\n\n \n There have been numerous studies, many commissioned by the DOD itself, dating as far back as the Crittenden Report of 1957, that shows gays in the military create no compromise in the effectivness of the armed forces.", 
   {}, 
   388035, 
   null, 
   1264784760.0
  ], 
  [
   388039, 
   null, 
   "josephdphillips", 
   "If your fighting comrade truly has your back, you don't care about his sexual orientation.\n \n Only Americans would waste time on this issue of gays in the military when we don't have enough soldiers as it is. The whole issue is just plain silly.", 
   {}, 
   388037, 
   null, 
   1264785780.0
  ], 
  [
   388055, 
   null, 
   "JPSartre12", 
   "Much has been made by the liberal media of the head shaking by Justics Alito while Obama was up there lying about the ramifications of their declaring McCain-Feingold unconstitutional. \n \n \n\n With all due deference to separation of powers, last week the Supreme Court reversed a century of law that, I believe, will open the floodgates for special interests, including foreign corporations, to spend without limit in our elections.\n \n\n \n Personally, I can see why Alito wouldn't sit there while the president lied directly in his face. Their ruling does NOT lead the way for foreign companies to influence an election because three times within the ruling it states that foreign companies are excluded from the ruling.\n \n \n\n David Johnson, on January 28th, 2010 at 4:04 pm Said: \n 2 U.S.C. Section 441e paragraph (b)\n \n (b) &#8220;Foreign national&#8221; defined\n As used in this section, the term &#8220;foreign national&#8221; means&#8212;\n (1) a foreign principal, as such term is defined by section 611 (b) of title 22, except that the term &#8220;foreign national&#8221; shall not include any individual who is a citizen of the United States; or\n (2) an individual who is not a citizen of the United States or a national of the United States (as defined in section 1101 (a)(22) of title and who is not lawfully admitted for permanent residence, as defined by section 1101 (a)(20) of title 8.\n \n From section 1 above &#8212; following to the referenced section 611(b) of title 22:\n (b) The term &#8220;foreign principal&#8221; includes&#8212;\n (1) a government of a foreign country and a foreign political party;\n (2) a person outside of the United States, unless it is established that such person is an individual and a citizen of and domiciled within the United States, or that such person is not an individual and is organized under or created by the laws of the United States or of any State or other place subject to the jurisdiction of the United States and has its principal place of business within the United States; and\n \n (3) a partnership, association, corporation, organization, or other combination of persons organized under the laws of or having its principal place of business in a foreign country. \n \n 2 U.S.C. Section 441e does include foreign corporations as specified in paragraph (3) above.\n http://wendygdphillips.wordpress.com/2010/01/27/citizens-united-v-fec-%E2%80%93-the-good-the-bad-and-the-ugly/#comment-119\n \n\n \n This was just one example of the most polarizing president in history. His polarizing numbers make GW Bush II look like Mr. Congeniality.", 
   {
    "post_info": {
     "post_title": "Alito's reaction"
    }
   }, 
   388039, 
   null, 
   1264792200.0
  ], 
  [
   388057, 
   null, 
   "Lurch907", 
   "Does the military have a position on this or have any data to show it helps or hurts something? Really that is what it should come down to.\n\n \n There are studies out the wazoo, but like most activist studies the conclusions tend to fit what the author wanted them to say. This is true for both sides. I haven't yet found a study by the DoD.\n \n Here is a link to a statment given by Sgt. Maj. Brian Jones to the House Arms Services subcommitee on Personnel. When people of this caliber speak, I tend to pay attention.\n \n http://cmrlink.org/fileuploads/HASC072308JonesTestimony.pdf", 
   {}, 
   388035, 
   null, 
   1264793220.0
  ], 
  [
   388073, 
   null, 
   "jitobear", 
   "If your fighting comrade truly has your back, you don't care about his sexual orientation.\n \n Only Americans would waste time on this issue of gays in the military when we don't have enough soldiers as it is. The whole issue is just plain silly.\n\n \n No kidding. First of all the idea that any homosexual is after some stupid homophobe anyway. WOOT! It would be like a black woman trying to hook up with a KKK member. If there is any disruption due to a homosexual being around it will be due to the homophobes, not the other way around. DODT is like having the doctor put a cast on your leg when you have a headache. If America denies themselves good soldiers due to this rampant paranoia - they deserve what they get.\n \n And I say that as an an American.", 
   {}, 
   388039, 
   null, 
   1264795920.0
  ], 
  [
   388075, 
   null, 
   "JPSartre12", 
   "There are studies out the wazoo, but like most activist studies the conclusions tend to fit what the author wanted them to say. This is true for both sides. I haven't yet found a study by the DoD.\n \n Here is a link to a statment given by Sgt. Maj. Brian Jones to the House Arms Services subcommitee on Personnel. When people of this caliber speak, I tend to pay attention.\n \n http://cmrlink.org/fileuploads/HASC072308JonesTestimony.pdf\n\n \n Maybe they should keep in a \"spooning exemption\"? ;)", 
   {}, 
   388057, 
   null, 
   1264796340.0
  ], 
  [
   388082, 
   null, 
   "Steeeeve", 
   "There are studies out the wazoo, but like most activist studies the conclusions tend to fit what the author wanted them to say. This is true for both sides. I haven't yet found a study by the DoD.\n \n Here is a link to a statment given by Sgt. Maj. Brian Jones to the House Arms Services subcommitee on Personnel. When people of this caliber speak, I tend to pay attention.\n \n http://cmrlink.org/fileuploads/HASC072308JonesTestimony.pdf\n\n \n This is a fine story to consider but doesn't give me an idea one way or the other.", 
   {}, 
   388057, 
   null, 
   1264797060.0
  ], 
  [
   388085, 
   null, 
   "JPSartre12", 
   "IMO, if you're putting your balls on the line for this country, I don't care where they swing.", 
   {}, 
   388082, 
   null, 
   1264797720.0
  ], 
  [
   388133, 
   null, 
   "Easyrider", 
   "\n \n \n This was just one example of the most polarizing president in history (OBama). His polarizing numbers make GW Bush II look like Mr. Congeniality.\n\n \n Exactly. Obama lied again. In fact, I do believe he is the biggest liar I have ever come across in my entire life. He's incapable of telling the truth. He lied about CSPAN, earmarks, going through spending bills line item by line item, and a lot of other things. But the liberals are fine with a liberal liar like Obama. \n \n They're snakes. Lying, imbecilic snakes.", 
   {}, 
   388055, 
   null, 
   1264807620.0
  ], 
  [
   388135, 
   null, 
   "JPSartre12", 
   "Exactly. Obama lied again. In fact, I do believe he is the biggest liar I have ever come across in my entire life. He's incapable of telling the truth. He lied about CSPAN, earmarks, going through spending bills line item by line item, and a lot of other things. But the liberals are fine with a liberal liar like Obama. \n \n They're snakes. Lying, imbecilic snakes.\n\n \n I agree with all of the above except for the word \"imbecilic\". They are incredibly adroit at lying and are cunningly smart. \n I'm still looking for that C-SPAN debate on healthcare. What channel was that on? ;)", 
   {}, 
   388133, 
   null, 
   1264807920.0
  ], 
  [
   388190, 
   null, 
   "thelmoose", 
   "There are studies out the wazoo, but like most activist studies the conclusions tend to fit what the author wanted them to say. This is true for both sides. I haven't yet found a study by the DoD.\n \n Here is a link to a statment given by Sgt. Maj. Brian Jones to the House Arms Services subcommitee on Personnel. When people of this caliber speak, I tend to pay attention.\n \n http://cmrlink.org/fileuploads/HASC072308JonesTestimony.pdf\n\n \n My, there's an open-minded fellow. \"activist studies?\" The wacky thing about studies is you can look at the methodology and determine their validity. You have provided testimonial. \n \n You have yet to find a DoD study? - it would have helped to actually look. There have been 3 really big ones, during the Eisenhower, Reagan and Clinton administrations. All 3 were concordant in concluding that gays in the military pose no security threat, are as fit to serve in the military as heterosexuals, and can be successfully integrated into the military. All three were commissioned by the Pentagon, but ignored because the findings were not to their liking.\n \n  See link.", 
   {}, 
   388057, 
   null, 
   1264826220.0
  ], 
  [
   388201, 
   null, 
   "Steamroller", 
   "\n You have yet to find a DoD study? - it would have helped to actually look. There have been 3 really big ones, during the Eisenhower, Reagan and Clinton administrations. All 3 were concordant in concluding that gays in the military pose no security threat, are as fit to serve in the military as heterosexuals, and can be successfully integrated into the military. All three were commissioned by the Pentagon, but ignored because the findings were not to their liking.\n\n \n I don't get it. DADT has been the perfect compromise. Why is it that gays are so compelled to advertise?\n \n I agree with your quote as far as the findings of the study are concerned with the exception of how \"successfully\" gays can be integrated, especially if they are allowed to flaunt.\n \n I believe you could say there was a slight problem with integration when a celebrated gay was thrown overboard in the middle if the Indian Ocean causing a rescue operation involving the unscheduled launch of the alert five helo's and turning the ship around.\n \n In addition, Pentegon studies are suspect. Every year I served, I filled out questionaire and was told to check \"yes\" to the question \"Do you support Equal Opportunity Employment?\"\n \n I was told that it would become part of my permanant record and I did not want that question answered any other way.......\n \n I believe homophobia is normal but somehow that makes me a bigot and a homo is normal and should be celebrated...... we're certainly not in Kansas anymore.", 
   {}, 
   388190, 
   null, 
   1264839360.0
  ], 
  [
   388203, 
   null, 
   "T.Q", 
   "I don't get it. DADT has been the perfect compromise. Why is it that gays are so compelled to advertise?\n\n Yeah, what's up with that? Isn't it enough that we allow them to exist?\n \n \nI agree with your quote as far as the findings of the study are concerned with the exception of how \"successfully\" gays can be integrated, especially if they are allowed to flaunt.\n\n \"Flaunt\"? Let me take a guess here: you think every gay guy is a flaming gay transvestite who talks with a lisp, don't you?\n \n \nI believe you could say there was a slight problem with integration when a celebrated gay was thrown overboard in the middle if the Indian Ocean causing a rescue operation involving the unscheduled launch of the alert five helo's and turning the ship around.\n\n Just so we're clear, a bunch of homophobes (you, by chance?) threw a guy overboard, and it's his fault?\n \n \nIn addition, Pentegon studies are suspect. Every year I served, I filled out questionaire and was told to check \"yes\" to the question \"Do you support Equal Opportunity Employment?\"\n \n I was told that it would become part of my permanant record and I did not want that question answered any other way.......\n\n So you'd rather advertise the fact that you're a racist? That's your right, but it sounds to me like your superiors were trying to protect you from yourself.\n \n \nI believe homophobia is normal but somehow that makes me a bigot\n\n Well, let's just check the definition of \"bigot\", shall we?\n Merriam-Webster:\n a person obstinately or intolerantly devoted to his or her own opinions and prejudices; especially : one who regards or treats the members of a group (as a racial or ethnic group) with hatred and intolerance\n \n You are the very definition of a bigot.\n \n \nand a homo is normal and should be celebrated\n\n Homosexuality is natural. The fact that you have a problem with it is just that-your problem.\n \n \n...... we're certainly not in Kansas anymore.\n\n Ah, Kansas, the land of XXXXXX. Where school boards are XXXXXX, and racist homophobes can be themselves.\n \n Yeah, too bad the rest of the world can't be more like Kansas.", 
   {}, 
   388201, 
   null, 
   1264840860.0
  ], 
  [
   388207, 
   null, 
   "Steamroller", 
   "\"Flaunt\"? Let me take a guess here: you think every gay guy is a flaming gay transvestite who talks with a lisp, don't you?\n\n \n I'm sorry if I offended you. But how would I know if a person was gay unless he let that information be known? BYW I was never intimidated by the gays.., somebody had to do the secretarial work.\n \n \nJust so we're clear, a bunch of homophobes (you, by chance?) threw a guy overboard, and it's his fault?\n\n \n I was in before DADT. At that time the military discharged gays, a system that worked just fine since it was made perfectly clear that gays were not welcome. And YES, it was his fault. Like a white man trying to join the black panthers he was thrown out..... once we fished him out if the water.emoticon_xangel\n \n \nSo you'd rather advertise the fact that you're a racist? That's your right, but it sounds to me like your superiors were trying to protect you from yourself.\n\n \n So now a homophobe, a group I am proud to be a member of, is a RACIST? So gays are a \"race\" now....\n \n \n \nWell, let's just check the definition of \"bigot\", shall we?\n Merriam-Webster:\n a person obstinately or intolerantly devoted to his or her own opinions and prejudices; especially : one who regards or treats the members of a group (as a racial or ethnic group) with hatred and intolerance\n \n You are the very definition of a bigot.\n\n \n Interesting..... As one of the first homophobes you know to come out of the closet, you choose to attack me with behavior that perfectly fits the above definition. In my post I said nothing derogatory toward anyone, and yet you respond so angerly.\n \n \n \nHomosexuality is natural. The fact that you have a problem with it is just that-your problem.\n\n \n Homophobia is just as natural as homosexuality is.., and yet I am the one with the problem? You'll have to explain that to me.\n \n I never said I had anything to do with deep sixing the homosexual. And frankly I don't care if a person is gay or not. You make the claim the being gay is \"natural\".., lets not even go there, you can take that arguement up with Easyrider or Archangel if you want to.\n \n But you can go back to your dictiionary and look up \"normal\" then try to fit your sexual orientation into that box. I think you'll have an easier time making \"homophobe\" fit that definition.", 
   {}, 
   388203, 
   null, 
   1264856160.0
  ], 
  [
   388214, 
   null, 
   "Matthew S", 
   "No kidding. First of all the idea that any homosexual is after some stupid homophobe anyway. WOOT! It would be like a black woman trying to hook up with a KKK member. If there is any disruption due to a homosexual being around it will be due to the homophobes, not the other way around. DODT is like having the doctor put a cast on your leg when you have a headache. If America denies themselves good soldiers due to this rampant paranoia - they deserve what they get.\n \n And I say that as an an American.\n\n \n It all comes down to that those men who have a problem with gays do not like and are afraid of being thought of or treated like they treat and think of women.", 
   {}, 
   388073, 
   null, 
   1264860720.0
  ], 
  [
   388216, 
   null, 
   "Easyrider", 
   "Gay dating site's Super Bowl ad rejected by CBS\n \n \"After reviewing the ad, which is entirely commercial in nature, our standards and practices department decided not to accept this particular spot,\" said CBS spokeswoman Shannon Jacobs.\"\n \n Super Bowl ad from gay dating site rejected by CBS - Jan. 29, 2010\n \n <Yes! Fist Pump< Gotta love it.\n \n emoticon_xagreeemoticon_xbouncer", 
   {}, 
   388214, 
   null, 
   1264861440.0
  ], 
  [
   388227, 
   null, 
   "T.Q", 
   "I was never intimidated by the gays.., somebody had to do the secretarial work.\n\n ok, so you equate gays with what are traditionally \"female\" roles. Nope, no attempt to be derogatory there...\n \n \n \n \nI was in before DADT. At that time the military discharged gays, a system that worked just fine since it was made perfectly clear that gays were not welcome. And YES, it was his fault. Like a white man trying to join the black panthers he was thrown out..... once we fished him out if the water.emoticon_xangel\n\n Or a black guy trying to enter a white restaurant. Got to keep those niggers in there place, right?\n \n \nSo now a homophobe, a group I am proud to be a member of, is a RACIST? So gays are a \"race\" now....\n\n I know it's tough to keep up, but please at least make an attempt. Let's see what I originally quoted and replied to:\n \nQuote:In addition, Pentegon studies are suspect. Every year I served, I filled out questionaire and was told to check \"yes\" to the question \"Do you support Equal Opportunity Employment?\"\n \n I was told that it would become part of my permanant record and I did not want that question answered any other way....... \n \n So you'd rather advertise the fact that you're a racist? That's your right, but it sounds to me like your superiors were trying to protect you from yourself.\n\n Yeah, in reference to \"Equal Opportunity Employment\", which was brought in to ensure people didn't turn down applicants based on race.\n \n \nInteresting..... As one of the first homophobes you know to come out of the closet, you choose to attack me with behavior that perfectly fits the above definition.\n\n Really? According to you, I'm a bigot because I point out that someone denying being a bigot is, by the very definition, a bigot? No, that would make me someon disgusted that a person like you exists.\n \n \nIn my post I said nothing derogatory toward anyone, and yet you respond so angerly.\n\n Your whole post was derogatory you simpleton!\n \n \nHomophobia is just as natural as homosexuality is.., and yet I am the one with the problem? You'll have to explain that to me.\n\n What's to explain? Seems pretty self explanatory to me. You don't like a certain group of people because of some arbitrary characteristic. That is unacceptable in todays society. Therefore, you are the one with the problem.\n \n \nI never said I had anything to do with deep sixing the homosexual. \n\n Yet you implied it. And in your response above, you confirmed it. Hmmm.\n \n \nAnd frankly I don't care if a person is gay or not.\n\n No, as long as they don't come near you or your family. Ugh, gay germs, yuck!\n \n \nYou make the claim the being gay is \"natural\".., lets not even go there\n\n Oh, let's. It's found through many many many animal species. Sounds natural to me.\n \n \nBut you can go back to your dictiionary and look up \"normal\" then try to fit your sexual orientation into that box.\n\n Sure \n \n \nI think you'll have an easier time making \"homophobe\" fit that definition.\n\n Not \"easier\", but just as easy. Definitions 2b, 3, 4b, and 7 all work just fine. Yup, looks like your reasons to justify your bigotry are kind of like you-worthless and full of XXXX.", 
   {}, 
   388207, 
   null, 
   1264869420.0
  ], 
  [
   388243, 
   null, 
   "Steeeeve", 
   "Well, let's just check the definition of \"bigot\", shall we?\n Merriam-Webster:\n a person obstinately or intolerantly devoted to his or her own opinions and prejudices; especially : one who regards or treats the members of a group (as a racial or ethnic group) with hatred and intolerance\n \n You are the very definition of a bigot.\n\n \n \nAh, Kansas, the land of XXXXXX. Where school boards are XXXXXX, and racist homophobes can be themselves.\n \n Yeah, too bad the rest of the world can't be more like Kansas.\nAnd you are the very definition of a bigot too", 
   {}, 
   388203, 
   null, 
   1264881000.0
  ], 
  [
   388252, 
   null, 
   "Steamroller", 
   "Really? According to you, I'm a bigot because I point out that someone denying being a bigot is, by the very definition, a bigot? No, that would make me someon disgusted that a person like you exists.\n\n \n Don't you see that you do exactly what you say you \"hate\" about me..... that just escapes you doesn't it.\n \n Here, I'll spell it out for you.... I don't care if you are a racist until your racism affects someone else. I don't care if you are gay until your homosexuality affects someone else\n \n I don't flaunt my homophobia until the acts of a homosexual affects me. I don't go to Castro street in San Fransisco and attempt to force gays to accept my point of view. \n \n In my limited experience, gays in the military can be disruptive to the mission. Is it the gays fault? Yes and No. It is not his fault that others are bothered by him, however it is a known and predictable reaction and the homosexual purposely puts himself in that environment. For that he must either except responsibility for letting his sexual orientation be known, keep it to himself, or join the peace corp.\n \n Is it right? Probably not. But DADT works. Case in point: how many openly gay players are there in the NFL?", 
   {}, 
   388227, 
   null, 
   1264885680.0
  ], 
  [
   388257, 
   null, 
   "GiantOreo", 
   "You haven't provided any evidence the Bible is a fairy tale. But I do think you like the sound of those last two words in the previous sentence.\n \n It's God or the government (Romans 13) in the NT who dispense capital punishment. If you weren't so consumed with your illicit gay sex escapades to read the NT you would have known that.\n \n Keep screwing around and God himself just might take you and/or your buddy Jazy off the earth like he did with Annanias Sapphira in the Book of Acts.\n\n \n Wow, everyone's just shakin' in their boots that your imaginary god will magick them off the earth! emoticon_xkillemoticon_xkillemoticon_xkill:xbanghead", 
   {}, 
   388022, 
   null, 
   1264888560.0
  ], 
  [
   388261, 
   null, 
   "thelmoose", 
   "\n I agree with your quote as far as the findings of the study are concerned with the exception of how \"successfully\" gays can be integrated, especially if they are allowed to flaunt.\n \n \n\n \n It isn't a quote. They are results of an inquiry.\n \n You agree except for the part you don't like. Despite your opinion, there is objective evidence that there is no problem with gays in the military. You clearly don't like that idea, but that doesn't change the facts. Your opinion has repeatedly been demonstrated to be wrong when evaluated in a systematic manner. \n \n The merest acknowledgement of one being gay apparently is \"flaunting\" to you. If you asked me if I was gay, and I said \"yes\", would that be \"flaunting\"?", 
   {}, 
   388201, 
   null, 
   1264890840.0
  ], 
  [
   388265, 
   null, 
   "Easyrider", 
   "Despite your opinion, there is objective evidence that there is no problem with gays in the military. \n\n \n That's horse dung. Normal guys don't want gays hitting on them or oogling them in the shower, or even touching them. It makes their skin crawl. It's not good for unit cohesion. I saw that in Vietnam personally.\n \n Plus gay sex is an abomination and God would not approve.", 
   {}, 
   388261, 
   null, 
   1264892760.0
  ], 
  [
   388347, 
   null, 
   "Matthew S", 
   "That's horse dung. Normal guys don't want gays hitting on them or oogling them in the shower, or even touching them. It makes their skin crawl. It's not good for unit cohesion. I saw that in Vietnam personally.\n \n Plus gay sex is an abomination and God would not approve.\n\n \n Something tells me that you were the one doing the oogling and the touching. It only makes sense since you are so obsessed with and who is have gay sex and weather we gays are going to hell. Glass haouses EZ", 
   {}, 
   388265, 
   null, 
   1264949820.0
  ], 
  [
   388352, 
   null, 
   "Archangel", 
   "Exactly. Obama lied again. In fact, I do believe he is the biggest liar I have ever come across in my entire life. He's incapable of telling the truth. He lied about CSPAN, earmarks, going through spending bills line item by line item, and a lot of other things. But the liberals are fine with a liberal liar like Obama. \n \n They're snakes. Lying, imbecilic snakes.\n\n \n \nI agree with all of the above except for the word \"imbecilic\". They are incredibly adroit at lying and are cunningly smart. \n I'm still looking for that C-SPAN debate on healthcare. What channel was that on? ;)\n\n \n I agree with Easy, and JPs expanded correction to the T. This tactic of lying and telling whatever group they are speaking before exactly what they want to hear, while going on and carrying out their agenda has been a leftist tactic for as long as I can remember. These professional deceivers will actively accuse the Right of doing precisely what they themselves are doing. And they can get away with it because they know that people recognize it but the citizenry is so uninformed that they can't label the people sent out to do the lying as Liberals. So by blaming the Right, many uninformed people believed the misinformation. But not so much anymore since FOX and Talk Radio has been so successful in exposing the agenda and tactics of the militant left to project upon conservatives what the Liberals themselves do.", 
   {}, 
   388135, 
   null, 
   1264953480.0
  ], 
  [
   388370, 
   null, 
   "Easyrider", 
   "Something tells me that you were the one doing the oogling and the touching. It only makes sense since you are so obsessed with and who is have gay sex and weather we gays are going to hell. Glass haouses EZ\n\n \n If I were king I'd deport your deluded butt and put a wallet-clearing deportation tax on you on your way out. That's what I think about your ungodly gay sex agenda.", 
   {}, 
   388347, 
   null, 
   1264963020.0
  ], 
  [
   388418, 
   null, 
   "jitobear", 
   "If I were king I'd deport your deluded butt and put a wallet-clearing deportation tax on you on your way out. That's what I think about your ungodly gay sex agenda.\n\n \n You really should go find a theocracy. You have more in common with Bin Laden than any decent American.", 
   {}, 
   388370, 
   null, 
   1264977240.0
  ], 
  [
   388432, 
   null, 
   "Easyrider", 
   "You really should go find a theocracy. You have more in common with Bin Laden than any decent American.\n\n \n Thomas Jefferson advocated drilling a hole in the noses of sodomites. Is he another Bin Laden?\n \n It's people like you who send people to hell by coddling and encouraging and defending their sin. Recommend you read Genesis 19.", 
   {}, 
   388418, 
   null, 
   1264981680.0
  ], 
  [
   388458, 
   null, 
   "Matthew S", 
   "Thomas Jefferson advocated drilling a hole in the noses of sodomites. Is he another Bin Laden?\n \n It's people like you who send people to hell by coddling and encouraging and defending their sin. Recommend you read Genesis 19.\n\n \n Once again I would rather burn in hell for eterinty then live a lie for one nanosecond. Also if heven is filled with people and a God who holds fyour beliefs and attitude then I would rather join the barbeque in hell. It seems that in your world I am lost no matter what choice I make. I live a lie to get into heaven which is hell or I live openly and go to hell. So it seems that I am going to hell no matter either way so I might as well live my live free from shame, self loathlng and enjoy life. I will gladly dance to hell and join the chior of devils. Who knows maybe I will get to use a pitch fork.", 
   {}, 
   388432, 
   null, 
   1264993440.0
  ], 
  [
   388509, 
   null, 
   "jitobear", 
   "Thomas Jefferson advocated drilling a hole in the noses of sodomites. Is he another Bin Laden?\n\n \n No. Althought such an idea is beyond vile and the man was completely wrong to suggest or think it, he did not support a theocracy, nor was he a religious whack-job. \n \n \nIt's people like you who send people to hell by coddling and encouraging and defending their sin. Recommend you read Genesis 19.\n\n \n I have read the Bible from cover to cover. So? Have also read \"Romeo and Juliet\", \"The Cather in the Rye\", \"The Lord of the Rings\" and countless other books. Its just a book to me. I do my very own thinking. \n \n I don't believe in your presentation of God or in coddling religious wing-nuts by encouraging or defending their bigotry.", 
   {}, 
   388432, 
   null, 
   1265069760.0
  ], 
  [
   388520, 
   null, 
   "Easyrider", 
   "\n \n I don't believe in your presentation of God or in coddling religious wing-nuts by encouraging or defending their bigotry.\n\n \n Anti-Christian bigots will get their due at the Judgment. And you don't have to like it.", 
   {}, 
   388509, 
   null, 
   1265079060.0
  ], 
  [
   388528, 
   null, 
   "jitobear", 
   "Anti-Christian bigots will get their due at the Judgment. And you don't have to like it.\n\n \n I know - and like a good Christian you will gleefully sit and eat popcorn and watch the show - cuz you are all loving like that.\n \n Seriously, you \"loving\" God makes my abusive ex-husband seem like a cuddle-bunny.\n \n By the way, go look up the meaning of the word \"bigot\". It doesn't mean what you think it does.", 
   {}, 
   388520, 
   null, 
   1265087940.0
  ], 
  [
   388558, 
   null, 
   "jazyjason", 
   "Today marks the first hearing on DADT in over 17 years.... It is a major step forward in repealing this policy that has cost lives and has cost the careers of so many upstanding men and women in uniform.\n \n I won't answer in turn to those who mask their prejudice behind faith, or their bitter distaste behind fantasy and what if scenario's. I will however say this. \n \n What someone does or is should not define the basis by which you serve. At the core of every person in uniform should or at least I hope would be a love for country. A personal zeal to focus and realize the fragility of our rights, and how central their service plays in affecting the lives of so many who have tasted freedom.\n \n Freedom and liberty does have a price. And it has been shed by the precious blood of the fallen from Valley Forge, to Iwo Jima, from the streets of Baghdad, to the Pacific Ocean... All of us here know exactly how much sacrifice means, yet many if us take such for granted, myself included.\n \n Knowing first hand the effect this policy has on lives of others not only myself, but that of my partner who now serves I can say that this issue is paramount. \n \n Gays have fought since the days of the Revolution. We have fought not just the battles for our country, but those within ourselves. To those who would try and say this would hurt morale, or would somehow damage credibility to our service I ask you to take a good hard look at what you are implying.\n \n This is not a matter of benefits or some sort of hand out or special treatment. It is the right and the ability to serve and to die for your country. Not in guilt, shame, or persecution, but in clear conscience and with honor.\n \n Our blood has been spilled and has mingled with our strait brothers in arms. We have shed not just blood, but tears and we have denied ourselves for the greater cause and denied and even lied about who we are as people, and whom we love.\n \n To deny and to mislead is false. No longer can this policy exist. We cannot allow the poison of self guilt. the feeling of dishonor tarnish those whom serve now. And history will judge us in how we honor those who have fallen.\n \n Dare we judge those who have fallen in a different light because they love someone else? Would we dare to do the same to those because of a different shade of skin? Or because they pray to a different deity?\n \n Today, my partner serves in the closet. He serves silently, afraid and terrified if anyone finds out he's gay because he fears physical harm, or a dishonorable discharge.\n \n I hope that soon, this anxiety will go away, as well as the bitter prejudices and stigmas that we brand each other with, and the bitter distrust toward one another we as Americans have had for so long. This is not about gays against straits or vise versa. This is about the fundamental core of this nation.\n \n The fundamental duty to honor all in uniform especially the fallen.... This policy cannot be stricken down soon enough...", 
   {}, 
   388528, 
   null, 
   1265135700.0
  ], 
  [
   388698, 
   null, 
   "Steamroller", 
   "Today, my partner serves in the closet. He serves silently, afraid and terrified if anyone finds out he's gay because he fears physical harm, or a dishonorable discharge.\n \n I hope that soon, this anxiety will go away, as well as the bitter prejudices and stigmas that we brand each other with, and the bitter distrust toward one another we as Americans have had for so long. This is not about gays against straits or vise versa. This is about the fundamental core of this nation.\n \n The fundamental duty to honor all in uniform especially the fallen.... This policy cannot be stricken down soon enough...\n\n \n So what would your partner do if DADT is overturned? Would he then go out and announce to his commrads in arms of his sexual orientation? If yes WHY?\n \n I really don't care about a persons sexual orientation, I don't care if a person is heterosexual, asexual or is addicted to sex...... I just don't want to hear about it. \n \n DADT is a policy that protects all service members. It is a compromise that works for those without an agenda. It's as close to \"live and let live\" as you can get. I will never understand a gay persons need or desire to shove thier behavior under other peoples nose.\n \n In your post you said your partner fears physical harm. If DADT is overturned do you believe that threat will disappear?\n \n DADT provides and environment of tolerance..... what you are demanding is an environment of acceptance......., good luck with that.\n \n I'll take a military suffering from the absence of a \"few good patriotic gays\", over a military suffering from the absence of a whole bunch of patriotic homophobes anyday!", 
   {}, 
   388558, 
   null, 
   1265173440.0
  ], 
  [
   388706, 
   null, 
   "jazyjason", 
   "So what would your partner do if DADT is overturned? Would he then go out and announce to his commrads in arms of his sexual orientation? If yes WHY?\n\n \n No he wouldn't \"announce \" anything. SO stop playing this like it's a big huge gay in your face pride disposition because it's not... We're both private people not just because of DADT either... But he wouldn't have to fear having his career ruined just because he's gay.\n \n \nI really don't care about a persons sexual orientation, I don't care if a person is heterosexual, asexual or is addicted to sex...... I just don't want to hear about it. \n\n \n No one is asking you to accept anything nor hear about it. There are gays serving at this very moment in the military in fear of losing their careers and possibly their lives..... \n \n \nDADT is a policy that protects all service members. It is a compromise that works for those without an agenda. It's as close to \"live and let live\" as you can get. I will never understand a gay persons need or desire to shove thier behavior under other peoples nose.\n\n \n No it doesn't. Did it protect Seaman August Provost from being shot in the head and having his body lit on fire because he was gay? Does it protect gay service members from being outed by third parties as a way to harass and intimidate?\n \n Does it bring honor and dignity to those who wear the uniform? Certainly not! There is no compromise here. It's either shut your mouth live in fear and lie about who you are... Or accept the status quo and get out...\n \n No one is shoving anyone's behavior under anyone's nose. SO stop playing to banter and prejudiced stigma!! These are upstanding men and women who are answering the call to serve their country. At least allow them to serve and possibly die with dignity and respect...\n \n \n \nIn your post you said your partner fears physical harm. If DADT is overturned do you believe that threat will disappear?\n\n \n Yes. the UCMJ will implement harassment laws and statutes protecting all service members from discrimination and harassment...\n \n \nDADT provides and environment of tolerance..... what you are demanding is an environment of acceptance......., good luck with that.\n\n \n Psh.... What you are demanding is making people live a lie and just deal with it. In your mind it's acceptance.... I dare you to look Dan Choi in the eye and say good luck...\n \n \nI'll take a military suffering from the absence of a \"few good patriotic gays\", over a military suffering from the absence of a whole bunch of patriotic homophobes anyday!\n\n \n I bet. Would you like another teabag in your cup? The only thing you roll over is any type of discussion without throwing in blatant prejudiced views... If you think or assume there would be a mass exodus of strait service members your dead wrong. Simply because their serving with gay members now!\n \n And I love your comment about absence of homophobes... Funny I assume your one of them?", 
   {}, 
   388698, 
   null, 
   1265175240.0
  ], 
  [
   388715, 
   null, 
   "Steamroller", 
   "And I love your comment about absence of homophobes... Funny I assume your one of them?\n\n \n As a matter of fact I am. And I bet you won't give me the same latitude for being homophobic as you are demanding from me about your sexual orientation.\n \n Interesting dynamic isn't it.", 
   {}, 
   388706, 
   null, 
   1265180100.0
  ], 
  [
   388717, 
   null, 
   "Jo Bennett", 
   "As a matter of fact I am. And I bet you won't give me the same latitude for being homophobic as you are demanding from me about your sexual orientation.\n \n Interesting dynamic isn't it.\n\n \n Yes, because his sexual orientation doesn't affect your life in the slightest, while your homophobia restricts his rights. Your right to swing your fist stops at his nose. Your hatred of his nose does not excuse you swinging your fist into it.", 
   {}, 
   388715, 
   null, 
   1265180760.0
  ], 
  [
   388742, 
   null, 
   "jazyjason", 
   "As a matter of fact I am. And I bet you won't give me the same latitude for being homophobic as you are demanding from me about your sexual orientation.\n \n Interesting dynamic isn't it.\n\n \n \n How am I demanding? You hate me obviously so whats the point in even trying to get my point across? This reminds me of Depeche Mode's \"People Are People\"\n \n And how is there any latitude when you obviously are so blinded with contempt and bitter discord toward others?\n \n Btw a phobia is a form of fear. So I assume your scared to death of prissy men with lispy voices and glitter on their faces raping you in a dark alley....", 
   {}, 
   388715, 
   null, 
   1265219820.0
  ], 
  [
   388758, 
   null, 
   "jazyjason", 
   " Your hatred of his nose does not excuse you swinging your fist into it.\n\n \n Darn it I always knew it was the nose.... Not the tight jeans or the Purple v necks it was my nose....\n \n \n Actually I'm more of a jeans and t shirt kind of guy with a leather jacket emoticon_xgood\n \n Oh and FYI he would never get the chance to swing at my nose I'd have his XXX on the deck in a matter of seconds if he tried....", 
   {}, 
   388717, 
   null, 
   1265223480.0
  ], 
  [
   388860, 
   null, 
   "Steamroller", 
   "Yes, because his sexual orientation doesn't affect your life in the slightest, while your homophobia restricts his rights. Your right to swing your fist stops at his nose. Your hatred of his nose does not excuse you swinging your fist into it.\n\n \n How do you know his sexual orientation doesn't affect my life in the slightest??????? \n \n And what do you know about how my homophobia restricts his rights????\n \n I'm not swinging my fist at anybody. I don't care if he is gay and I don't think his partner's military career should be jepordized by his sexual orientation either..... I just don't want to know about it!!\n \n That was the whole reason behind DADT. But go ahead and change it, go ahead and force your beliefs onto the rest of the military..., what is truly natural will work itself out in private.\n \n Of course you will take my last statement as a threat which it is not.... it's just a statement of fact, IMO.", 
   {}, 
   388717, 
   null, 
   1265267160.0
  ], 
  [
   388861, 
   null, 
   "Steamroller", 
   "Btw a phobia is a form of fear. So I assume your scared to death of prissy men with lispy voices and glitter on their faces raping you in a dark alley....\n\n \n How did you know????", 
   {}, 
   388742, 
   null, 
   1265267460.0
  ], 
  [
   388911, 
   null, 
   "jazyjason", 
   "\n \n That was the whole reason behind DADT. But go ahead and change it, go ahead and force your beliefs onto the rest of the military..., what is truly natural will work itself out in private.\n \n\n \n What is natural? Forcing beliefs? You just refuse to acknowledge there are honorable gay people serving in our military, and you hate to acknowledge the fact that they deserve respect and fair treatment for their service.", 
   {}, 
   388860, 
   null, 
   1265323140.0
  ], 
  [
   388912, 
   null, 
   "jazyjason", 
   "How did you know????\n\n \n I had a hunch........", 
   {}, 
   388861, 
   null, 
   1265323200.0
  ], 
  [
   388915, 
   null, 
   "gansao", 
   "Dont women serve with men in the armed forces?\n Do the men ogle their rear ends in the heat of battle", 
   {}, 
   388912, 
   null, 
   1265323680.0
  ], 
  [
   388925, 
   null, 
   "jyoshu", 
   "Dont women serve with men in the armed forces?\n Do the men ogle their rear ends in the heat of battle\n\n \n They do in terms of general service, but they don't share barracks, showers, bivouac tent, etc.", 
   {}, 
   388915, 
   null, 
   1265326620.0
  ], 
  [
   388926, 
   null, 
   "gansao", 
   "They do in terms of general service, but they don't share barracks, showers, bivouac tent, etc.\n\n \n Good point.\n I have no military experience so I havent a clue!", 
   {}, 
   388925, 
   null, 
   1265327100.0
  ], 
  [
   388928, 
   null, 
   "sinjin", 
   "Dont women serve with men in the armed forces?\n Do the men ogle their rear ends in the heat of battle\nI read once where 1 in 4 women joining the USN fleet come back preggers.", 
   {}, 
   388915, 
   null, 
   1265327340.0
  ], 
  [
   388929, 
   null, 
   "gansao", 
   "I read once where 1 in 4 women joining the USN fleet come back preggers.\n\n \n So many sailors, so little timeemoticon_xangel", 
   {}, 
   388928, 
   null, 
   1265327520.0
  ], 
  [
   388931, 
   null, 
   "sinjin", 
   "So many sailors, so little timeemoticon_xangel\nNow if straight guys were the minority in the military, they might have some legit beef.", 
   {}, 
   388929, 
   null, 
   1265329080.0
  ], 
  [
   388979, 
   null, 
   "jazyjason", 
   "They do in terms of general service, but they don't share barracks, showers, bivouac tent, etc.\n\n \n Oh please.. another stupid little inclination of what you assume goes on in military life Jyoshu.\n \n Let me explain something to you in lamens terms and perhaps maybe it will click but I doubt it....\n \n First on the issue of barracks, each person has a SEPARATE bed, rack, or whatever may suffice for space concerns.... simply put everyone has their own space.\n \n Showers, only in basic training as a way to break people down, and on shore commands with locker room style heads, are open bay. Even then there are individual shower stalls with curtains for privacy in the newer constructed heads.\n \n As far as tents I can't comment since I'm not Army or Marines but I assume you would be given an individual sleeping bag of some sort..\n \n Now lets get to the root of the problem on this issue. We all know gays are serving in the service at the moment right now correct? Why then is it that there aren't these \"cohesion\" issue that the homophobic quacks say there are?\n \n Why are not more strait men crying rape or sexual harassment from some gay guy oogling them in the shower? \n \n I'll put it bluntly. BECAUSE it DOESN'T happen! Whether you want to believe it or not gays and lesbians have restraint. If I happened to go into an open bay shower I wouldn't stare at another guys junk, especially if it was a person of higher rank. I just felt that out of a manner of respect.\n \n I felt these people to be brothers. Kind of if you by chance walked in on a blood brother showering that is how I took it. \n \n To be quite honest, this whole unit cohesion XXXX and this notion of shower rape by prying eyes is just another made up fantasy by people who clearly are ignorant on gay people, and have their own personal comfort issues with themselves.\n \n It's sadly just another misplaced misconception to steer the argument into the what if's and not look at the fact that the UCMJ could easily be extended to include gay people just like it includes women.... But of course old John flip flopper won't admit that...", 
   {}, 
   388925, 
   null, 
   1265381160.0
  ], 
  [
   388981, 
   null, 
   "gansao", 
   "So the problem is not that gay servicemen misbehave, it is a myth used as an excuse?", 
   {}, 
   388979, 
   null, 
   1265381640.0
  ], 
  [
   388986, 
   null, 
   "jazyjason", 
   "So the problem is not that gay servicemen misbehave, it is a myth used as an excuse?\n\n \n Point blank Gans. That's exactly what it is..... And IF gay service members did misbehave they would be subject to the strict guidelines of the UCMJ just like anyone else who serves. Like I said a simple extension of fraternization policy and sexual harassment policy to include gay people would suffice.", 
   {}, 
   388981, 
   null, 
   1265382420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama State of the union", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13843, 
  "discussion_files": [
   [
    "25660.html", 
    "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union-print.html"
   ], 
   [
    "25661.html", 
    "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union-5-print.html"
   ], 
   [
    "25662.html", 
    "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union-4-print.html"
   ], 
   [
    "25663.html", 
    "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union-3-print.html"
   ], 
   [
    "25664.html", 
    "http://www.4forums.com/political/gay-rights-debates/13843-obama-state-union-2-print.html"
   ]
  ], 
  "identifier": 13843
 }
]