[
 [
  [
   387727, 
   null, 
   "NATO 556", 
   "The gun markets of Pakistan - CNN.com\n \n \nBrooklyn, New York (VBS.TV) -- On January 22, 2006, the New York Times reported that all foreign journalists were being banned from Pakistan's tribal areas, which has been called \"the most dangerous place in the world.\" A week before that, the CIA fired missiles remotely from a Predator aircraft into the Waziristan tribal area. They were hoping to eradicate a bunch of al Qaeda operatives. Instead, they killed 18 women and children.\n \n One week before that, I arrived in Pakistan to visit Darra Adamkhel, the massive open-air market located deep in the tribal areas, where a frighteningly high percentage of Islamic holy warriors goes to buy their guns.\n \n Gaining access to the tribal areas was next to impossible. It took months of pre-planning with the consul general of Pakistan in Montreal and top officials in Peshawar. They repeatedly denied us entry because, according to them, the Pakistani Army had too many \"sensitive operations\" going on in that region. Without my personal advantage (a family friendship with the governor of the Northwest Frontier Province), we never would have gotten in.\n \n The government assigned me and my team a political agent named Naeem Afridi. He was born and raised in the tribal areas. He took care of us while we were there, and he was a godsend. You can't do anything in this part of the world without someone like Naeem.\n \n Our driver stopped at a security point just outside the town center, where we were introduced to the Frontier Agency militia, six angry-dad-looking guys with AKs and sidearms. They became our personal bodyguards, and followed us through the tight warren of gun shops and factories, barren little brick rooms where upward of 1,000 guns are manufactured every day. Most of the work is done by hand.\n \n The vendors are Pashtuns, who are basically the toughest people in the world. They comprised the majority of the mujahideen who kicked the Soviets out of Afghanistan in the late '80s.\n \n These days, the town is rumored to be completely overrun by the Taliban. They purchase the guns, then cross the border to fight the U.S. army in Afghanistan, or they drive through the mountains to the south to fight the Pakistani army.\n \n This summer, I went back to Pakistan, and found that the fuse on this powder keg has become even shorter. The Pakistani army has surged more troops into the tribal areas, attempting to eradicate the Taliban and al Qaeda. The U.S. and British troops are attempting to do the same thing on the other side of the border in Afghanistan. Meanwhile, Pakistan itself has seen violence spread to its major urban centers, where extremists have been detonating bombs and taking over police stations.\n \n But at the same time, there is a cultural explosion taking place, a vibrant art scene and metal and rock bands popping up everywhere. The whole situation has become ultra charged by the fact that there are tons of news channels operating uncensored by the insanely corrupt government.\n \n For Pakistan, it's a volatile, turbulent, and fascinating moment in time.\n\n \n So...what was all that bull**** about terrorists exploiting America's \"weak gun control laws\" in order to amass arsenals of deadly weapons?\n \n It seems to me that they don't need undercover operatives to come to America, forge documents and undergo background checks just to get civilian weapons. They've got their own arms manufacturing plants over there, they can make whatever they need or want.", 
   {
    "post_info": {
     "post_title": "The gun markets of Pakistan"
    }
   }, 
   null, 
   null, 
   1264612560.0
  ], 
  [
   387735, 
   null, 
   "sinjin", 
   "Did someone suggest that the Taliban were acquiring weapons in the U.S. \n to take back to the fight in Afghanistan or Pakistan?\n \n I've not heard that one.", 
   {}, 
   387727, 
   null, 
   1264617240.0
  ], 
  [
   387739, 
   null, 
   "NATO 556", 
   "Did someone suggest that the Taliban were acquiring weapons in the U.S. to take back to the fight in Afghanistan or Pakistan?\n \n I've not heard that one.\n\n \n Dude, where have you been? Brady, Galileo and their like have been constantly bringing up this fallacy like it were the truth.", 
   {}, 
   387735, 
   null, 
   1264618560.0
  ], 
  [
   387742, 
   null, 
   "sinjin", 
   "Dude, where have you been? Brady, Galileo and their like have been constantly bringing up this fallacy like it were the truth.\nWere they quoting a story? Point me at a thread.\n Got a link? Dude?", 
   {}, 
   387739, 
   null, 
   1264618980.0
  ], 
  [
   387750, 
   null, 
   "NATO 556", 
   "I'll get back to you on the thread in question that Beavis and Butthead posted in.\n \n For the time being here it is right from the horse's mouth. http://www.vpc.org/graphics/creditcardarmies.pdf\n \n \nAmerica&#8217;s gun laws are wide open compared to the rest of the developed\n world. Foreign groups promoting various forms of armed conflict, including &#8220;jihad,&#8221; have advised would-be warriors that, because of its lax gun laws, the United States is the ideal place to get guns and firearms training to prepare for armed conflict. \n \n These overseas groups understand that, with little more than a credit card and a driver&#8217;s license, terrorists can outfit themselves with military grade firepower&#8212;including 50 caliber sniper rifles, assault weapons, and exotic ammunition&#8212;get advanced combat training from a plethora of civilian schools, and then find plenty of ammunition and firing ranges to hone their shooting skills. The American gun culture has so pervaded the al Qaeda terror network that it used National Rifle Association targets for marksmanship training in terror training camps in Afghanistan.\n \n It is not surprising that international terrorists discovered the United States as a one stop firearms bazaar: they&#8217;ve had the role model of radical domestic groups openly arming and training themselves with weapons of war over the last several decades.\n\n \n Also VPC - Firearms Training For Jihad in America\n \n \nThe Violence Policy Center (VPC) has obtained a copy of the document, How Can I Train Myself for Jihad. The six-page document, which has reportedly been found in terrorist safe houses in Kabul, Afghanistan, advises that \"military training is an obligation in Islam upon every sane, male, mature Muslim, whether rich or poor, whether studying or working and whether living in a Muslim or non-Muslim country.\"1 It offers tips on various ways to make \"suitable preparations for battle,\" including physical training, martial arts, survival and outdoors training, firearms training, and military training. This report focuses on the firearms and military training aspects of the pamphlet.\n \n Origins of the Pamphlet. The pamphlet appears to have been originally posted on Azzam.com, run by the British company Azzam Publications, and on qoqaz.net, an affiliate of Azzam.2 Azzam was founded in late 1996 and is named after Sheikh Abdullah Azzam, a mentor to Osama bin Laden.3 Azzam has operated a site dedicated to worldwide jihad, from which funds have been steered to the Taliban in Afghanistan and to guerillas fighting the Russians in Chechnya.4 Azzam sites reportedly published explicit photographs of laughing mujahedeen warriors brandishing the body parts of Russian soldiers,5 and praised suicide bombers as \"martyrs.\"6 Some of those sites have been shut down, but archived sites contain duplicate information such as How Can I Train Myself for Jihad. The Violence Policy Center obtained its copy from one of those sites.\n \n Links to Al Qaeda Terrorists. In addition to the general support for worldwide jihad described above, the training pamphlet was posted on one of the Azzam-affiliated web sites, Qoqaz.de - Islam Resources and Information.This website is for sale! in Germany.7 After a hacker cracked the Azzam site, posted a list of subscribers to Azzam newsletters offered through the site, and turned the list over to authorities, it was discovered that Said Bahaji was apparently one of the subscribers.8 Authorities investigating the September 11, 2001, terror attacks on the United States have described Bahaji as the \"brains\" behind a key support cell that the investigation uncovered in Germany.9 German investigators say that Bahaji was responsible for logistics, including helping the suicide pilots who crashed jetliners into the World Trade Center obtain their visas to enter the United States.10\n \n Firearms and Military Training Urged in Pamphlet. In addition to urging would-be holy warriors to prepare themselves for jihad physically and through martial arts, the pamphlet notes the advantages the United States offers for firearms training and advises readers on how to exploit them:\n \n * \"Firearms training differs from country to country....In some countries of the World, especially the USA, firearms training is available to the general public. One should try to join a shooting club if possible and make regular visits to the firing range. There are many firearms courses available to the public in USA, ranging from one day to two weeks or more. These courses are good but expensive. Some of them are only meant for security personnel but generally they will teach anyone. It is also better to attend these courses in pairs or by yourself, no more. Do not make public announcements when going on such a course. Find one, book your place, go there, learn, come back home and keep it [to] yourself. Whilst on the course, keep your opinions to yourself, do not argue or debate with anyone, do not preach about Islam....You are going there to train for Jihad, not call people to Islam.\"\n \n * \"Useful courses to learn are sniping, general shooting and other rifle courses. Handgun courses are useful but only after you have mastered rifles.\"\n \n * \"In other countries, e.g. some states of USA, South Africa, it is perfectly legal for members of the public to own certain types of firearms. If you live in such a country, obtain an assault rifle legally, preferably AK-47 or variations, learn how to use it properly and go and practice in the areas allowed for such training.\"\n \n * \"Respect the laws of the country you are in and avoid dealing in illegal firearms. One can learn to operate many arms legally, so there is no need to spend years in prison for dealing in small, illegal firearms. Learn the most you can according to your circumstances and leave the rest to when you actually go for Jihad.\"\n", 
   {}, 
   387742, 
   null, 
   1264622220.0
  ], 
  [
   387752, 
   null, 
   "sinjin", 
   "I see nothing concerning the movement of arms from the U.S. civilian market to the Afghanistan/Pakistan theatre.", 
   {}, 
   387750, 
   null, 
   1264622580.0
  ], 
  [
   387754, 
   null, 
   "NATO 556", 
   "I see nothing concerning the movement of arms from the U.S. civilian market to the Afghanistan/Pakistan theatre.\n\n \n Then why would they supposedly be advising potential terrorists to come over to America, know the laws, and acquire weapons and training?", 
   {}, 
   387752, 
   null, 
   1264623360.0
  ], 
  [
   387755, 
   null, 
   "sinjin", 
   "Then why would they supposedly be advising potential terrorists to come over to America, know the laws, and acquire weapons and training?\nTo acquire skills, not equipment to bring back. \n Any firearms purchased could be used for a mission Stateside of course.", 
   {}, 
   387754, 
   null, 
   1264623420.0
  ], 
  [
   387756, 
   null, 
   "NATO 556", 
   "To acquire skills, not equipment to bring back.\n\n \n I don't think so. Otherwise these lunatics wouldn't continually go on and on about weak gun laws, and America being an open arms bazaar, how you can legally own military weaponry and AK-47s and such.\n \n If it were really about training, not hardware, the VPC wouldn't be blabbering about the \"easy availability of firearms in America\".\n \n And since when have terrorists sought out the training for professionalizing themselves? Their tactics involve guerrilla warfare and suicide bombings. What professional army have they had?\n \n \nAny firearms purchased could be used for a mission Stateside of course.\n\n \n Doubtful. Reports about domestic terrorist suspects typically involve them having some association with explosive devices rather than anything else.", 
   {}, 
   387755, 
   null, 
   1264623720.0
  ], 
  [
   387757, 
   null, 
   "sinjin", 
   "I don't think so. Otherwise these lunatics wouldn't continually go on and on about weak gun laws, and America being an open arms bazaar, how you can legally own military weaponry and AK-47s and such.\n \n If it were really about training, not hardware, the VPC wouldn't be blabbering about the \"easy availability of firearms in America\".\nYou personal speculations are immaterial.\n \n \nAnd since when have terrorists sought out the training for professionalizing themselves? Their tactics involve guerrilla warfare and suicide bombings.\nSome of the 9/11 crew attended flight school in the U.S. \n And what makes you think effective guerrilla warfare requires no training.\n \n \nDoubtful. Reports about domestic terrorist suspects typically involve them having some association with explosive devices rather than anything else.\nTo date. I said \"could\", not has been. \n \n If you started this thread in response to a specific claim made by another poster, suppose you quote them.\n Should be a cinch if they've been doing it \"constantly\".", 
   {}, 
   387756, 
   null, 
   1264624560.0
  ], 
  [
   387760, 
   null, 
   "NATO 556", 
   "You personal speculations are immaterial.\n\n \n Now don't go starting down that path. You've supplied a lot of your own personal speculation many times before.\n \n \nSome of the 9/11 crew attended flight school in the U.S.\n\n \n So?\n \n \nAnd what makes you think effective guerrilla warfare requires no training.\n\n \n The tactics don't match. Professional military training, like what the infantry gets, doesn't match with the actions of guerrilla fighters. Guerrillas are trained for sneak attacks, hit and run operations and that type. Hardly what would require the instructions of trained professionals running schools and other classes.\n \n And then there's the weapons used by the guerrillas over in the middle east. They've got weaponry dating back as far as World War One. That's hardly suggestive that they're seeking out modern day, professional training from our own soldiers.\n \n And there's also the biased news reports about the \"growing numbers of militia organizations in America\". They're constantly being tied to racists and white supremacists, but I'm not seeing any Arabs on the news coverage, or talk about domestic terrorist training.\n \n \nIf you started this thread in response to a specific claim made by another poster, suppose you quote them. Should be a cinch if they've been doing it \"constantly\".\n\n \n You want me to point you to the threads that rant about closing the \"terrorist gap in gun laws\" that were started by these wing nuts on here? The thread where Brady linked back to the VPC on the so called \"training manual\" is gone, but all his other nonsense is front and center.", 
   {}, 
   387757, 
   null, 
   1264626180.0
  ], 
  [
   387764, 
   null, 
   "sinjin", 
   "Now don't go starting down that path. You've supplied a lot of your own personal speculation many times before.\nGranted. But you're reading something into the VPC statements that isn't there.\n \n \nSo?\nThat's seeking professional training isn't it? If they've sought one kind here, they might have sought another.\n \n \nThe tactics don't match. Professional military training, like what the infantry gets, doesn't match with the actions of guerrilla fighters. Guerrillas are trained for sneak attacks, hit and run operations and that type. Hardly what would require the instructions of trained professionals running schools and other classes.\nWhat sort of war would these militia types be preparing for?\n \n \nAnd then there's the weapons used by the guerrillas over in the middle east. They've got weaponry dating back as far as World War One. That's hardly suggestive that they're seeking out modern day, professional training from our own soldiers.\nWho said they were seeking training from \"our own soldiers\"?\n \n \nAnd there's also the biased news reports about the \"growing numbers of militia organizations in America\". They're constantly being tied to racists and white supremacists, but I'm not seeing any Arabs on the news coverage, or talk about domestic terrorist training.\nI wonder if the WS militias might make an exception for those intending to go after Jews.\n \n \nYou want me to point you to the threads that rant about closing the \"terrorist gap in gun laws\" that were started by these wing nuts on here? The thread where Brady linked back to the VPC on the so called \"training manual\" is gone, but all his other nonsense is front and center. \nI want you to show where someone is claiming weapons bought on the civilian market in the U.S. are making their way back to Afghanistan or Pakistan. Anyone from any source. This is what your OP claims to refute.", 
   {}, 
   387760, 
   null, 
   1264627500.0
  ], 
  [
   387774, 
   null, 
   "Penfold", 
   "Granted. But you're reading something into the VPC statements that isn't there.\n \n ....\n \n I want you to show where someone is claiming weapons bought on the civilian market in the U.S. are making their way back to Afghanistan or Pakistan. Anyone from any source. This is what your OP claims to refute.\n\n \n Do you think it might have been a strawman?emoticon_xgood", 
   {}, 
   387764, 
   null, 
   1264629240.0
  ], 
  [
   387843, 
   null, 
   "NATO 556", 
   "Granted. But you're reading something into the VPC statements that isn't there.\n\n \n Like just what are they saying in their propaganda?\n \n \nThat's seeking professional training isn't it? If they've sought one kind here, they might have sought another.\n\n \n Now didn't we just talk about personal speculation?\n \n \nWhat sort of war would these militia types be preparing for?\n\n \n You'd have to ask someone else, I haven't partaken in any militia training.\n \n \nWho said they were seeking training from \"our own soldiers\"?\n\n \n Well if they're supposedly coming to America to exploit our weak laws and get training, I highly doubt they're seeking tactics employed by the British and French.\n \n \nI wonder if the WS militias might make an exception for those intending to go after Jews.\n\n \n I'd doubt it.\n \n \nI want you to show where someone is claiming weapons bought on the civilian market in the U.S. are making their way back to Afghanistan or Pakistan. Anyone from any source. This is what your OP claims to refute.\n\n \n I'll admit that in the debate I had gotten distracted from the original point. However I never made the argument in the opening post that terrorists were taking weapons back to their country of origin to wage war.\n \n However such an argument can easily be implied with all of this hyperbole about terrorists coming to America to exploit our nation's gun laws. The vagueness of the anti-gun fear doctrine is ambiguous enough to lead one to think such is their argument.\n \n To right this discussion: if the terrorists have arms manufacturing plants that can crank out approximately 1,000 guns per day, why the hell would they need to exploit our supposedly weak gun laws to arm themselves? If they can smuggle themselves into the country without being detected then it would be child's play to do the same with their weapons. The Mumbai terrorists sure brought their own, there's no reason to believe that invading Middle Eastern terrorists aren't able to do the same. Hell all they'd have to do is reach Mexico and cross the border with the rests of the illegal immigrants and nobody would ever find or catch them.", 
   {}, 
   387764, 
   null, 
   1264652580.0
  ], 
  [
   387863, 
   null, 
   "Penfold", 
   "Like just what are they saying in their propaganda? .... \n\n \n Where exactly?\n \n \n \n \n\n I'll admit that in the debate I had gotten distracted from the original point. However I never made the argument in the opening post that terrorists were taking weapons back to their country of origin to wage war.\n \n However such an argument can easily be implied with all of this hyperbole about terrorists coming to America to exploit our nation's gun laws. The vagueness of the anti-gun fear doctrine is ambiguous enough to lead one to think such is their argument.\n \n To right this discussion: if the terrorists have arms manufacturing plants that can crank out approximately 1,000 guns per day, why the hell would they need to exploit our supposedly weak gun laws to arm themselves? If they can smuggle themselves into the country without being detected then it would be child's play to do the same with their weapons. The Mumbai terrorists sure brought their own, there's no reason to believe that invading Middle Eastern terrorists aren't able to do the same. Hell all they'd have to do is reach Mexico and cross the border with the rests of the illegal immigrants and nobody would ever find or catch them.\n\n \n Nobody but you is making such claims until now. \"If's\" and \"possibly maybe\"'s don't cut it. You made assertions in the OP, and once more you avoid backing them up. Let's see links to back your empty claims. Your track record of wandering all over the landscape carrying the goalposts precedes you.", 
   {}, 
   387843, 
   null, 
   1264683780.0
  ], 
  [
   387871, 
   null, 
   "Tither", 
   " http://www.vpc.org/graphics/creditcardarmies.pdf\n America's gun laws are wide open compared to the rest of the developed\n world. Foreign groups promoting various forms of armed conflict, including \"jihad,\" have advised would-be warriors that, because of its lax gun laws, the United States is the ideal place to get guns and firearms training to prepare for armed conflict.\n \n These overseas groups understand that, with little more than a credit card and a driver's license, terrorists can outfit themselves with military grade firepower-including 50 caliber sniper rifles, assault weapons, and exotic ammunition-get advanced combat training from a plethora of civilian schools, and then find plenty of ammunition and firing ranges to hone their shooting skills. The American gun culture has so pervaded the al Qaeda terror network that it used National Rifle Association targets for marksmanship training in terror training camps in Afghanistan.\n\n\n Nato my friend, don't worry about what they say to you. This inference backs you up well. They may try to argue semantics, but most people aren't fooled, and those who have already drank the Kool Aid will never admit anything.", 
   {
    "unicode_changes_made": true
   }, 
   387750, 
   null, 
   1264700280.0
  ], 
  [
   387875, 
   null, 
   "sinjin", 
   "Nato my friend, don't worry about what they say to you. This inference backs you up well. They may try to argue semantics, but most people aren't fooled, and those who have already drank the Kool Aid will never admit anything.\nDo you believe weapons are being purchased on the civilian market in the U.S. and sent back to be used in Afghanistan and/or Pakistan? \n Does any nonsense floated here deserve your support simple because it comes from someone with which you imagine yourself politically aligned?", 
   {}, 
   387871, 
   null, 
   1264703040.0
  ], 
  [
   387876, 
   null, 
   "sinjin", 
   "I never made the argument in the opening post that terrorists were taking weapons back to their country of origin to wage war.\nNo, but you implied that some other poster(s) had. You have yet to quote them.", 
   {}, 
   387843, 
   null, 
   1264703160.0
  ], 
  [
   387880, 
   null, 
   "Tither", 
   "What I believe is: \n \n YAWN! \n \n Sorry. What is the question again? emoticon_smile \n \n Don't take offense cause none is offered. What I believe is that I don't care what you guys said in this thread, enough to argue a pointless argument. It all is semantics \n \n But hey, that is just my view! emoticon_xangel", 
   {}, 
   387876, 
   null, 
   1264703700.0
  ], 
  [
   387884, 
   null, 
   "sinjin", 
   "What I believe is: \n \n YAWN! \n \n Sorry. What is the question again? emoticon_smile \n \n Don't take offense cause none is offered. What I believe is that I don't care what you guys said in this thread, enough to argue a pointless argument. It all is semantics. \n \n But hey, that is just my view! emoticon_xangel\nYou care enough to give a hug to Nato but get sleepy when asked a direct question you'd prefer to avoid.", 
   {}, 
   387880, 
   null, 
   1264704180.0
  ], 
  [
   387890, 
   null, 
   "NATO 556", 
   "Where exactly?\n\n \n Anything that can be found on the websites of the Violence Policy Center or the Brady Campaign. They maintain the propaganda for all to see.\n \n \nNobody but you is making such claims until now.\n\n \n Then why are these left wing lunatics practically foaming at the mouth about the supposed \"terror gap in federal firearms laws\"? If they aren't worried about terrorists arming themselves for war then what's all the fear pandering about?\n \n \n\"If's\" and \"possibly maybe\"'s don't cut it.\n\n \n Meanwhile you, Sinjin, Brady, Galileo and Simone have freely been using junk science and unfounded fears to back up your arguments for why gun rights should be curtailed and why the government should be given even more authority over our lives.\n \n \nYou made assertions in the OP, and once more you avoid backing them up. Let's see links to back your empty claims. Your track record of wandering all over the landscape carrying the goalposts precedes you.\n\n \n Well you would certainly be the expert on such tactics. You come in, fire off an inflammatory post designed to detour the topic, and run off when we challenge you and fire right back in your direction.", 
   {}, 
   387863, 
   null, 
   1264706940.0
  ], 
  [
   387893, 
   null, 
   "sinjin", 
   "Meanwhile you, Sinjin, Brady, Galileo and Simone have freely been using junk science and unfounded fears to back up your arguments for why gun rights should be curtailed and why the government should be given even more authority over our lives.\nSpecifically, which gun rights have I suggested be curtailed?", 
   {}, 
   387890, 
   null, 
   1264707360.0
  ], 
  [
   387897, 
   null, 
   "NATO 556", 
   "No, but you implied that some other poster(s) had. You have yet to quote them.\n\n \n Well first there the manure shoveled by the likes of Brady here: http://www.4forums.com/political/369330-post1.html\n \n And Penfold's accusations that I'm a terrorist supporter just a few posts down: http://www.4forums.com/political/369330-post1.html\n \n Another rant by Brady, about selling .50 caliber rifles to terrorists who used them in their campaigns: http://www.4forums.com/political/369478-post15.html\n \n And then Brady accusing me of being a terrorist supporter just as Penfold did: http://www.4forums.com/political/369481-post16.html\n \n And then there's the constant banter about the Mexican drug cartel smuggling weapons back across the border into Mexico to wage their bloody campaign against everybody. While not terrorists in the sense that they come from the Middle East, they're undoubtedly terrorists in their actions of killing just about everyone who gets in their way.", 
   {}, 
   387876, 
   null, 
   1264707720.0
  ], 
  [
   387898, 
   null, 
   "Doc Jones", 
   "Specifically, which gun rights have I suggested be curtailed?\n\n \n The latest was your support for the 1,000 ft. school zone \"no guns allowed\" policy. That will suffice for now.\n \n I'm back :)", 
   {}, 
   387893, 
   null, 
   1264707960.0
  ], 
  [
   387899, 
   null, 
   "NATO 556", 
   "Specifically, which gun rights have I suggested be curtailed?\n\n \n Practically everything.\n \n You've voiced your support for mandatory storage regulations, which the Supreme Court ruled unconstitutional because they violate a person's rights and abilities to defend themselves immediately and effectively.\n \n You've voiced your support for mandatory firearms registration, even though there's sufficient evidence to prove that registration has and even will lead to confiscation of said firearms.\n \n You've voiced your support for mandatory reporting requirements, even though there's no evidence to prove its effectiveness or inability to be easily defeated, all you've offered in defense of it is the claim \"the police will get suspicious after a while\". The whole concept is basically criminalizing being a victim in an attempt to smoke out potential gun traffickers.\n \n And you've spoken out passionately against concealed carry using junk arguments.\n \n And let's not forget your position in the thread about the school expelling a student for not doing anything wrong.", 
   {}, 
   387893, 
   null, 
   1264708020.0
  ], 
  [
   387900, 
   null, 
   "sinjin", 
   "Not a shred about arms movements from the U.S. to Afghanistan/Pakistan.\n \n You cannot support your original assertion that weapons manufacturing in Pakistan negates any need for terrorists to obtain weapons from the U.S. civilian market, as was claimed by someone, somewhere. You forget who and when and where. \n \n Abandon ship NATO.", 
   {}, 
   387897, 
   null, 
   1264708260.0
  ], 
  [
   387901, 
   null, 
   "Doc Jones", 
   "Specifically, which gun rights have I suggested be curtailed?\n\n \n A better question I ask of you, which gun rights do you support without infringement or condition to your whims?\n \n I'll wait. emoticon_xclown", 
   {}, 
   387893, 
   null, 
   1264708500.0
  ], 
  [
   387903, 
   null, 
   "sinjin", 
   "Practically everything.\n \n You've voiced your support for mandatory storage regulations, which the Supreme Court ruled unconstitutional because they violate a person's rights and abilities to defend themselves immediately and effectively.\nFor unattended firearms, yes. You summary of the Heller ruling is in error. A lie repeated many times by you now.\n \n \nYou've voiced your support for mandatory firearms registration, even though there's sufficient evidence to prove that registration has and even will lead to confiscation of said firearms.\nI have not and challenge you to show where I have.\n \n \nYou've voiced your support for mandatory reporting requirements, even though there's no evidence to prove its effectiveness or inability to be easily defeated, all you've offered in defense of it is the claim \"the police will get suspicious after a while\". The whole concept is basically criminalizing being a victim in an attempt to smoke out potential gun traffickers.\nI support mandatory theft/loss reporting. What right does that curtail? A right ot negligence?\n \n \nAnd you've spoken out passionately against concealed carry using junk arguments.\nQuote me. I happen to support CCW.\n \n \nAnd let's not forget your position in the thread about the school expelling a student for not doing anything wrong. \nMy position was one of trying to understand how it was that the school felt it had no choice but to expel. I never explicitly said I supported the expulsion and don't.", 
   {}, 
   387899, 
   null, 
   1264708680.0
  ], 
  [
   387904, 
   null, 
   "sinjin", 
   "The latest was your support for the 1,000 ft. school zone \"no guns allowed\" policy. That will suffice for now.\n \n I'm back :)\nPlease quote me where I offer my personal support for \"gun free zones\".\n \n Let me help you:\n \n \n...I've never offered support for \"zero tolerance\" policies or \"gun free zones\". In fact I don't support \"zero tolerance\" policies or \"mandatory sentencing guidelines\" precisely because they remove judgement of the individual circumstances surrounding every case. I'm undecided on \"gun free zones\" and therefore remain neutral.\n", 
   {}, 
   387898, 
   null, 
   1264708740.0
  ], 
  [
   387905, 
   null, 
   "Doc Jones", 
   "Not a shred about arms movements from the U.S. to Afghanistan/Pakistan.\n \n You cannot support your original assertion that weapons manufacturing in Pakistan negates any need for terrorists to obtain weapons from the U.S. civilian market, as was claimed by someone, somewhere. You forget who and when and where. \n \n Abandon ship NATO.\n\n \n That is right strange to claim the U.S. didn't supply Afghanistan including stinger missles during the 80,s when they were engaged with Russia. \n \n You sure the U.S. didn't supply Pakistan any army weapons like they did with Iraq? Had to outfit the friendlies with pistols, M-16s and who knows what else?", 
   {}, 
   387900, 
   null, 
   1264708800.0
  ], 
  [
   387906, 
   null, 
   "sinjin", 
   "That is right strange to claim the U.S. didn't supply Afghanistan including stinger missles during the 80,s when they were engaged with Russia. \n \n You sure the U.S. didn't supply Pakistan any army weapons like they did with Iraq? Had to outfit the friendlies with pistols, M-16s and who knows what else?\nExcept that we're talking about civilian weapons here. Take the time to wake up a bit more.\n \n Glad you're back.", 
   {}, 
   387905, 
   null, 
   1264708920.0
  ], 
  [
   387908, 
   null, 
   "Doc Jones", 
   "Please quote me where I offer my personal support for \"gun free zones\".\n \n Let me help you:\n\n \n LOL, must have caught you editing your post :)\n \n 30 min rule in effect starting with this post.\n \n Nah, you go back and read the topic it is still just a few down. All you did was try to find some way the school was doing right, legal and lawful acts when they were not. You backed their thesis to the hilt and died on your own sword :)", 
   {}, 
   387904, 
   null, 
   1264709100.0
  ], 
  [
   387910, 
   null, 
   "Tither", 
   "You care enough to give a hug to Nato but get sleepy when asked a direct question you'd prefer to avoid.\n\n \n Yes. I addressed Mr 556 Nato directly and specifically. emoticon_smile It sounds like you had not noticed that point, until now. emoticon_smile Told ya this was pointless, he said she said, got ya, thread! emoticon_rolleyes", 
   {}, 
   387884, 
   null, 
   1264710000.0
  ], 
  [
   387911, 
   null, 
   "sinjin", 
   "LOL, must have caught you editing your post :)\n \n 30 min rule in effect starting with this post.\n \n Nah, you go back and read the topic it is still just a few down. All you did was try to find some way the school was doing right, legal and lawful acts when they were not. You backed their thesis to the hilt and died on your own sword :)\nTrying to discern their reasoning ain't the same as \"backing their thesis\". Objectivity eludes you guys, I know.", 
   {}, 
   387908, 
   null, 
   1264710000.0
  ], 
  [
   387913, 
   null, 
   "sinjin", 
   "Yes. I addressed Mr 556 Nato directly and specifically. emoticon_smile It sounds like you had not noticed that point, until now. emoticon_smile Told ya this was pointless, he said she said, got ya, thread! emoticon_rolleyes\nI got the \"he said\" part but Nato's having trouble finding the \"she said\" part.", 
   {}, 
   387910, 
   null, 
   1264710120.0
  ], 
  [
   387917, 
   null, 
   "NATO 556", 
   "For unattended firearms, yes.\n\n \n The Supreme Court didn't leave any such wiggle room.\n \n \nYou summary of the Heller ruling is in error. A lie repeated many times by you now.\n\n \n Can you point out how my summary is in error?\n \n \nI have not and challenge you to show where I have.\n\n \n Alright so maybe you haven't supported it in so many words. However your open support for the other standards could be argued as support for mandatory registration. Because unless the guns are registered and easily trackable, how could you ever enforce storage requirements? How would you be able to enforce the mandatory reporting agenda if you can't find out who owned it?\n \n The agendas you support need registration in order to even hope to function, without that you have two impotent standards that can't be used.\n \n \nI support mandatory theft/loss reporting. What right does that curtail? A right ot negligence?\n\n \n You still haven't proven that honest gun owners will intentionally fail to report a gun going missing. Mandatory reporting standards don't really accomplish anything because the responsible people will report anyway, the dishonest will lie, and innocent people will be made into criminals through bureaucratic red tape.\n \n \nQuote me. I happen to support CCW.\n\n \n http://www.4forums.com/political/327889-post124.html\n \n \nI do not support CCW for the average citizen.\n\n \n \nMy position was one of trying to understand how it was that the school felt it had no choice but to expel. I never explicitly said I supported the expulsion and don't.\n\n \n http://www.4forums.com/political/gun-control-debates/13778-common-sense-ca-style-2.html\n \n Take your pick from your earlier statements.", 
   {}, 
   387903, 
   null, 
   1264710960.0
  ], 
  [
   387922, 
   null, 
   "NATO 556", 
   "Trying to discern their reasoning ain't the same as \"backing their thesis\". Objectivity eludes you guys, I know.\n\n \n Should've used a different tone to your posts then. You didn't take what appeared a discerning approach to what you wrote on the subject, it looked like you were writing in support of what they did.", 
   {}, 
   387911, 
   null, 
   1264711200.0
  ], 
  [
   387928, 
   null, 
   "Penfold", 
   "Anything that can be found on the websites of the Violence Policy Center or the Brady Campaign. They maintain the propaganda for all to see. ...... \n\n \n \n If it was there then you could have linked it. You have nothing but bloviation, yet again. emoticon_rolleyes", 
   {}, 
   387890, 
   null, 
   1264711800.0
  ], 
  [
   387929, 
   null, 
   "sinjin", 
   "The Supreme Court didn't leave any such wiggle room. Can you point out how my summary is in error?\nYour error is that Scotus ruled that storage requirements that deny quick access for self-defense are UnConstitutional. Not any and all storage requirements. That's why many State laws requiring safe storage are still in effect. Like CA's CAP law. I've pointed this out before.\n \n \nAlright so maybe you haven't supported it in so many words. However your open support for the other standards could be argued as support for mandatory registration. Because unless the guns are registered and easily trackable, how could you ever enforce storage requirements? How would you be able to enforce the mandatory reporting agenda if you can't find out who owned it? \n \n The agendas you support need registration in order to even hope to function, without that you have two impotent standards that can't be used.\nFlail away. Documenting all transfers of ownership and mandatory theft/loss reporting have no need of registration.\n \n \nFlail away.You still haven't proven that honest gun owners will intentionally fail to report a gun going missing. Mandatory reporting standards don't really accomplish anything because the responsible people will report anyway, the dishonest will lie, and innocent people will be made into criminals through bureaucratic red tape.\nWhat about dishonest gun-owners or anti-government gun-owners? Will they report? Not. \n \n \nAnd you've spoken out passionately against concealed carry using junk arguments.\n\n \nI do not support CCW for the average citizen.\n\n \n Not particularly passionate but \"mea culpa\". \n I'd like to credit you and the other pro-gunners in causing me to slowly soften on this point.", 
   {}, 
   387917, 
   null, 
   1264711860.0
  ], 
  [
   387949, 
   null, 
   "NATO 556", 
   "Your error is that Scotus ruled that storage requirements that deny quick access for self-defense are UnConstitutional. Not any and all storage requirements. That's why many State laws requiring safe storage are still in effect. Like CA's CAP law. I've pointed this out before.\n\n \n Can you show where exactly in California law it specifies that you can keep certain firearms stored in an easily accessible manner, like a closed nightstand drawer, for your personal defense, and it's not a violation of the mandatory storage requirement?\n \n \nFlail away. Documenting all transfers of ownership and mandatory theft/loss reporting have no need of registration.\n\n \n No need of registration you say?\n \n How would you go about enforcing the reporting requirement when the gun sales and transfers are done face to face, without the government being able to maintain any sort of list showing who sold what, who bought what, and who has how many of what? \n \n If the police recover a gun, run a check on the serial number and found out the previous owner sold it, and it's changed hands several times, there's no way you're going to find the last proper owner of it. So the law mandating the reporting of a loss or theft is hollow and unenforceable in such instances.\n \n \nWhat about dishonest gun-owners or anti-government gun-owners? Will they report? Not.\n\n \n Still haven't proven why we should be forced by law to do what's the right thing.\n \n \nNot particularly passionate but \"mea culpa\".\n\n \n Would you prefer the quote where you insinuate people who do the legal concealed carry thing, might be prone to firing off into a crowd blindly and possibly hitting one of your kids?", 
   {}, 
   387929, 
   null, 
   1264720440.0
  ], 
  [
   387971, 
   null, 
   "sinjin", 
   "Can you show where exactly in California law it specifies that you can keep certain firearms stored in an easily accessible manner, like a closed nightstand drawer, for your personal defense, and it's not a violation of the mandatory storage requirement?\nRead it for yourself. \n \n \nHow would you go about enforcing the reporting requirement when the gun sales and transfers are done face to face, without the government being able to maintain any sort of list showing who sold what, who bought what, and who has how many of what? \n \n If the police recover a gun, run a check on the serial number and found out the previous owner sold it, and it's changed hands several times, there's no way you're going to find the last proper owner of it. So the law mandating the reporting of a loss or theft is hollow and unenforceable in such instances.\nIn CA you can't sell without your buyer submitting to NICS. What did you think I meant by documenting all transfers of ownership?\n \n \nStill haven't proven why we should be forced by law to do what's the right thing.\nIs driving under the speed limit \"the right thing\"?\n \n \nWould you prefer the quote where you insinuate people who do the legal concealed carry thing, might be prone to firing off into a crowd blindly and possibly hitting one of your kids? \nSure, bring it. That must be an oldie but goody. \n So I insinuate someone might do something that possibly? \n Pretty strong stuff. Let's review.", 
   {}, 
   387949, 
   null, 
   1264727400.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The gun markets of Pakistan", 
  "url": "http://www.4forums.com/political/gun-control-debates/13840-gun-markets-pakistan.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13840, 
  "discussion_files": [
   [
    "6467.html", 
    "http://www.4forums.com/political/gun-control-debates/13840-gun-markets-pakistan-print.html"
   ], 
   [
    "6468.html", 
    "http://www.4forums.com/political/gun-control-debates/13840-gun-markets-pakistan-3-print.html"
   ], 
   [
    "6469.html", 
    "http://www.4forums.com/political/gun-control-debates/13840-gun-markets-pakistan-2-print.html"
   ]
  ], 
  "identifier": 13840
 }
]