[
 [
  [
   388784, 
   null, 
   "jyoshu", 
   "It seems that for once, conservatives and pro-gays are actually agreeing on something. \n \n Considering how many times I've seen anti-conservatives on the gay issue indicate they would prefer to take away tax-exempt status from churches and in effect punish them for not performing gay marriages, I'm somewhat surprised gay-marriage advocates are supporting this. No doubt their motives are just to take away another reason for opposing gay marriage rather than genuine concern for clergy and churches, but it's still good news for clergy and churches. There's a real concern out there about this, and considering what we've seen in other countries that have supported gay marriage as well as the clear vindictiveness of some gay marriage proponents, it's a valid concern. Hopefully this could become a more widespread approach.\n \"Clergy members and churches would not face legal consequences for refusing to perform same-sex marriages, under a state bill being pushed by supporters of gay marriage.\n \n Same-sex marriage is illegal in California, but that could change with a court decision or at the ballot box. Supporters of same-sex marriage want to alleviate concerns of those with religious objections. They also want to emphasize the separation between civil and religious recognition of marriages.\n \n \"We heard through the Prop. 8 debate great concern from certain clergy that their freedom of religion could be infringed upon and their tax-exempt status revoked,\" said the bill's author, Sen. Mark Leno, D-San Francisco. \"We want to clarify that by putting the constitutional guarantee of the First Amendment, freedom of religion, into statute.\"\n \n The bill would apply to any religious objection to performing a marriage, not just between same-sex couples, and states that no clergy member would be required to solemnize a marriage that conflicts with his or her faith. The bill states that refusing to do so \"shall not affect the tax-exempt status of any entity.\"\n More at Bill would let clergy refuse to marry gays", 
   {
    "post_info": {
     "post_title": "Bill would let clergy refuse to marry gays"
    }
   }, 
   null, 
   null, 
   1265233200.0
  ], 
  [
   388801, 
   null, 
   "Matthew S", 
   "It seems that for once, conservatives and pro-gays are actually agreeing on something. \n \n Considering how many times I've seen anti-conservatives on the gay issue indicate they would prefer to take away tax-exempt status from churches and in effect punish them for not performing gay marriages, I'm somewhat surprised gay-marriage advocates are supporting this. No doubt their motives are just to take away another reason for opposing gay marriage rather than genuine concern for clergy and churches, but it's still good news for clergy and churches. There's a real concern out there about this, and considering what we've seen in other countries that have supported gay marriage as well as the clear vindictiveness of some gay marriage proponents, it's a valid concern. Hopefully this could become a more widespread approach.\n \"Clergy members and churches would not face legal consequences for refusing to perform same-sex marriages, under a state bill being pushed by supporters of gay marriage.\n \n Same-sex marriage is illegal in California, but that could change with a court decision or at the ballot box. Supporters of same-sex marriage want to alleviate concerns of those with religious objections. They also want to emphasize the separation between civil and religious recognition of marriages.\n \n \"We heard through the Prop. 8 debate great concern from certain clergy that their freedom of religion could be infringed upon and their tax-exempt status revoked,\" said the bill's author, Sen. Mark Leno, D-San Francisco. \"We want to clarify that by putting the constitutional guarantee of the First Amendment, freedom of religion, into statute.\"\n \n The bill would apply to any religious objection to performing a marriage, not just between same-sex couples, and states that no clergy member would be required to solemnize a marriage that conflicts with his or her faith. The bill states that refusing to do so \"shall not affect the tax-exempt status of any entity.\"\n More at Bill would let clergy refuse to marry gays\n\n \n This is just plian stupid. They have always had the freedom not to marry who they do not want to. Why on earth would any gay person want some rabidly anti gay christianist preacher marrying them. \n \n I just don't understand why people get secluar marriage and religious marriage confused. I strongly oppose any religious exepmtion for civil sevants. If you work for a state agency and it is your job to marry people and gays can marry then you better darn well do the job the tax payers are paying you to do and marry gay people.", 
   {}, 
   388784, 
   null, 
   1265238600.0
  ], 
  [
   388888, 
   null, 
   "gansao", 
   "This is just plian stupid. They have always had the freedom not to marry who they do not want to. Why on earth would any gay person want some rabidly anti gay christianist preacher marrying them. \n \n I just don't understand why people get secluar marriage and religious marriage confused. I strongly oppose any religious exepmtion for civil sevants. If you work for a state agency and it is your job to marry people and gays can marry then you better darn well do the job the tax payers are paying you to do and marry gay people.\n\n \n Excuse my denseness Matt but are you saying that you would not object tp churches refusing to marry gay couples without losing their tax exemption but a civil servant should not be allowed to refuse to marry gays because of their own personal beliefs?\n If you are then I totally agree with youemoticon_wow", 
   {}, 
   388801, 
   null, 
   1265309340.0
  ], 
  [
   388916, 
   null, 
   "jazyjason", 
   "Excuse my denseness Matt but are you saying that you would not object tp churches refusing to marry gay couples without losing their tax exemption but a civil servant should not be allowed to refuse to marry gays because of their own personal beliefs?\n If you are then I totally agree with youemoticon_wow\n\n \n No one should be forced to marry anyone.... And I'd advise against gay couples attempting to do so anyways....", 
   {}, 
   388888, 
   null, 
   1265323740.0
  ], 
  [
   388918, 
   null, 
   "gansao", 
   "No one should be forced to marry anyone.... And I'd advise against gay couples attempting to do so anyways....\n\n But surely a registrar that is employed by the state to marry couples should not object to marrying anyone that the state says is entitled to marry.\n Maybe you meant just the church.\n \n \n I was pretty sure that you would agree that churches should not be penalised for not marrying gay couples but Matt agreeing to it is a surprise..to say the least!\"", 
   {}, 
   388916, 
   null, 
   1265324100.0
  ], 
  [
   388980, 
   null, 
   "jazyjason", 
   "But surely a registrar that is employed by the state to marry couples should not object to marrying anyone that the state says is entitled to marry.\n Maybe you meant just the church.\n \n \n I was pretty sure that you would agree that churches should not be penalised for not marrying gay couples but Matt agreeing to it is a surprise..to say the least!\"\n\n \n \n Yeah I was saying in means of the church. If you work for the state that's a matter of the state and you should know what the job entails before you accept the position...", 
   {}, 
   388918, 
   null, 
   1265381340.0
  ], 
  [
   389018, 
   null, 
   "Lurch907", 
   "Yeah I was saying in means of the church. If you work for the state that's a matter of the state and you should know what the job entails before you accept the position...\n\n \n I would agree with this for the most part. If you take a job with the government you shouldn't object to what the job entails. Here is the rub though: what if the job changes after you have it. What if a clerk, judge, magistrate, etc. objects to performing same sex marriages but the laws change to allow them?", 
   {}, 
   388980, 
   null, 
   1265402940.0
  ], 
  [
   389020, 
   null, 
   "gansao", 
   "I would agree with this for the most part. If you take a job with the government you shouldn't object to what the job entails. Here is the rub though: what if the job changes after you have it. What if a clerk, judge, magistrate, etc. objects to performing same sex marriages but the laws change to allow them?\n\n .\n \n A Judge may not agree with new laws or guidlines for sentencing but is bound to conform to the new laws and guidelines\n The same should apply to all government employees.\n In the UK( If I remember correctly) when one marries in a registry office there is no mention of God so it is not necessarily a union before God.", 
   {}, 
   389018, 
   null, 
   1265403780.0
  ], 
  [
   389026, 
   null, 
   "Jo Bennett", 
   ".\n \n A Judge may not agree with new laws or guidlines for sentencing but is bound to conform to the new laws and guidelines\n The same should apply to all government employees.\n In the UK( If I remember correctly) when one marries in a registry office there is no mention of God so it is not necessarily a union before God.\n\n \n More than that it is emphatically not a union before God, because when civil marriages were introduced the CofE kicked up a fuss and insisted that the ceremony could not include any meniton of God or any religious sentiments. Consequently, you are not allowed to play \"Angels\" by Robbie Williams at a civil ceremony. Similarly when my grandad wanted to say a prayer at my uncle's wedding, the wedding ceremony had to be explicitly declared over in order to avoid falling foul of the law.", 
   {}, 
   389020, 
   null, 
   1265405640.0
  ], 
  [
   389060, 
   null, 
   "snakespit", 
   "I would agree with this for the most part. If you take a job with the government you shouldn't object to what the job entails. Here is the rub though: what if the job changes after you have it. What if a clerk, judge, magistrate, etc. objects to performing same sex marriages but the laws change to allow them?\n\n \n Clerks, judges, and magistrates are servants of the law.", 
   {}, 
   389018, 
   null, 
   1265420220.0
  ], 
  [
   389838, 
   null, 
   "Lurch907", 
   "Clerks, judges, and magistrates are servants of the law.\n\n \n Agreed, but, so are policemen yet they get to decide which laws to enforce or not enforce every day. Prosecutors are also servants of the law yet they get to decide which laws to prosecute or not prosecute based on the deal they want to make. \n Maybe, we should follow the military's leadership, a soldier can refuse to follow orders they find moraly objectionable (within guidelines). \n \n In a private sector setting, no problem, if the employee won't do what the boss says the job is I say show them the door. But, government is and should be held to a different standard. The first time a clerk gets fired for refusing to marry two men for religious reasons I hope that local government has lots of money in the budget for lawyers, particularly if marrying same sex couples is a change in the job description.", 
   {}, 
   389060, 
   null, 
   1265772360.0
  ], 
  [
   389847, 
   null, 
   "jyoshu", 
   "Agreed, but, so are policemen yet they get to decide which laws to enforce or not enforce every day. Prosecutors are also servants of the law yet they get to decide which laws to prosecute or not prosecute based on the deal they want to make. \n Maybe, we should follow the military's leadership, a soldier can refuse to follow orders they find moraly objectionable (within guidelines).\n \n In a private sector setting, no problem, if the employee won't do what the boss says the job is I say show them the door. But, government is and should be held to a different standard. The first time a clerk gets fired for refusing to marry two men for religious reasons I hope that local government has lots of money in the budget for lawyers, particularly if marrying same sex couples is a change in the job description.\n\n \n I can only say that in the state I live in from what I've witnessed firsthand, a clergy merely has to sign the certifcate for it be valid. I can't imagine a wedding where meetings with the clergy would not be conducted.", 
   {}, 
   389838, 
   null, 
   1265781900.0
  ], 
  [
   389857, 
   null, 
   "Iuris", 
   "Religious ceremony - religious consequences - religius criteria about who performs it and who it can be performed for. You can't wak into a church and demand you be married, the church may have rules preventing you from doing so.\n \n Civil procedure - actual legal consequences - you don't get to deny it to anyone except by the law's criteria. You deny it in spite of the legal criteria being met, you better prepare for a long unpleasant talk with your boss.\n \n Of course, if the state recognizes that if someone marries by church, they might as well just bring a coppy of the wedding certificate over and count the civil procedure as done.", 
   {}, 
   389847, 
   null, 
   1265797140.0
  ], 
  [
   389883, 
   null, 
   "Matthew S", 
   "Excuse my denseness Matt but are you saying that you would not object tp churches refusing to marry gay couples without losing their tax exemption but a civil servant should not be allowed to refuse to marry gays because of their own personal beliefs?\n If you are then I totally agree with youemoticon_wow\n\n \n They can currently not marry whom they don't want to. They don't want to marry that interracial hetero couple they don't have to. A catholic priest is well with in his rights of not marring a catholic and a protestant. That is always the way it has been and should be.I do not understand this loss of tax exemption status. Yes if they move into the political arena and back an amendment that barrs gays from secular state issued marriage licenses that have nothing to do with their religion then I would say yes tax them out of existence.", 
   {}, 
   388888, 
   null, 
   1265809800.0
  ], 
  [
   390013, 
   null, 
   "Easyrider", 
   "They can currently not marry whom they don't want to. They don't want to marry that interracial hetero couple they don't have to. A catholic priest is well with in his rights of not marring a catholic and a protestant. That is always the way it has been and should be.I do not understand this loss of tax exemption status. Yes if they move into the political arena and back an amendment that barrs gays from secular state issued marriage licenses that have nothing to do with their religion then I would say yes tax them out of existence.\n\n \n See what trouble you people have caused with your illicit gay sex sin?", 
   {}, 
   389883, 
   null, 
   1265854320.0
  ], 
  [
   390100, 
   null, 
   "Lurch907", 
   "Yes if they move into the political arena and back an amendment that barrs gays from secular state issued marriage licenses that have nothing to do with their religion then I would say yes tax them out of existence.\n\n \n So, if a group of religious people exersize their right to free speech and then vote according to their beliefs the government should \"tax them out of existence\". Wow.", 
   {}, 
   389883, 
   null, 
   1265932680.0
  ], 
  [
   390111, 
   null, 
   "Matthew S", 
   "So, if a group of religious people exersize their right to free speech and then vote according to their beliefs the government should \"tax them out of existence\". Wow.\n\n \n Yes if they place their religious beliefs into law that erase my civil rights then tax them tax them tax them. I want those religions who will not accept and full supprot gays to be removed from the earth.", 
   {}, 
   390100, 
   null, 
   1265951280.0
  ], 
  [
   390115, 
   null, 
   "jazyjason", 
   "Yes if they place their religious beliefs into law that erase my civil rights then tax them tax them tax them. I want those religions who will not accept and full supprot gays to be removed from the earth.\n\n \n First of all there are two sides to every coin Matthew. I hope you can see the fallacy in your my way or the highway remark.... How would you react if someone who was anti gay made the same statement about religions or churches that DO support gays?\n \n \n Do I think religion should influence government? NO that is why there is a separation of church and state. Should religions be able to preach what they wish? Certainly. In this country even the most debased cults from Satanists to the Neo Nazi movement, although hated and despised are still granted freedom of expression....\n \n \n Your comment shows the extreme view of gay rights Matt. Your very comments and mentality are what fuel the very fires of discontent and prejudice we try to quench!\n \n \n Please tell me I am not the only person here who see's this..... Even though these people say the most debased hate filled vile things and distort the truth to the very line of painting gays as a threat to children and families even to that degree they have a protection under the law to preach what they will.....\n \n We cannot force others to change, but lead by example and show them who we are in our daily lives and hold ourselves to a higher standard...", 
   {}, 
   390111, 
   null, 
   1265964300.0
  ], 
  [
   390133, 
   null, 
   "Matthew S", 
   "First of all there are two sides to every coin Matthew. I hope you can see the fallacy in your my way or the highway remark.... How would you react if someone who was anti gay made the same statement about religions or churches that DO support gays?\n \n \n Do I think religion should influence government? NO that is why there is a separation of church and state. Should religions be able to preach what they wish? Certainly. In this country even the most debased cults from Satanists to the Neo Nazi movement, although hated and despised are still granted freedom of expression....\n \n \n Your comment shows the extreme view of gay rights Matt. Your very comments and mentality are what fuel the very fires of discontent and prejudice we try to quench!\n \n \n \n Please tell me I am not the only person here who see's this..... Even though these people say the most debased hate filled vile things and distort the truth to the very line of painting gays as a threat to children and families even to that degree they have a protection under the law to preach what they will.....\n \n We cannot force others to change, but lead by example and show them who we are in our daily lives and hold ourselves to a higher standard...\n\n \n If they bring it into the public square and make laws based upon those religious beliefs then I want the right to vote on their right to hold those beliefs. If they keep it to themselves in their homes and churches and do not try and effect the lawss I have to live under then then more power to them. However the moment they try and force their religious beliefs on me through the law then it is time for those religious beliefs to be extinguished.\n \n It is time to stop this madness. I thought Prop 8 would have been a wake up call for you. NO MORE MR NICE GAY \n Where is the MCC the UCC or any other gay accepting church? Why haven't they backed us as strongly and publicly as the anti gay christianist churches have tried to extingush us?\n \n Civil rights are never just given to a minority by the majority. You must get out there and fight. March, protest and if need be riot. If Prop8 had been about taking away civil tights from african americans do you think for one moment that the several cities around california would not have gone up in flames? Read history no minority group have ever gained what should be theirs from the majority by meekly asking, as olver twist, \"may I have some more please?\"", 
   {}, 
   390115, 
   null, 
   1265979300.0
  ], 
  [
   390174, 
   null, 
   "Lurch907", 
   "Yes if they place their religious beliefs into law that erase my civil rights then tax them tax them tax them. I want those religions who will not accept and full supprot gays to be removed from the earth.\n\n \n So if a group holds an opinion on civil rights that differs from yours they should be punished by the government. How incredibly arrogant of you. \n \n Hate to break this to you Matt, but, everyone is entitled to their own opinions and beliefs. They are also entitled to advocate and vote in accordance with those opinion and beliefs. Your my way or the highway, those guy don't agree with me so punish them out of existence attitude is more befitting of places like Uganda then the United States.", 
   {}, 
   390111, 
   null, 
   1266009600.0
  ], 
  [
   390176, 
   null, 
   "JPSartre12", 
   "First of all there are two sides to every coin Matthew. I hope you can see the fallacy in your my way or the highway remark.... How would you react if someone who was anti gay made the same statement about religions or churches that DO support gays?\n \n \n Do I think religion should influence government? NO that is why there is a separation of church and state. Should religions be able to preach what they wish? Certainly. In this country even the most debased cults from Satanists to the Neo Nazi movement, although hated and despised are still granted freedom of expression....\n \n \n Your comment shows the extreme view of gay rights Matt. Your very comments and mentality are what fuel the very fires of discontent and prejudice we try to quench!\n \n \n Please tell me I am not the only person here who see's this..... Even though these people say the most debased hate filled vile things and distort the truth to the very line of painting gays as a threat to children and families even to that degree they have a protection under the law to preach what they will.....\n \n We cannot force others to change, but lead by example and show them who we are in our daily lives and hold ourselves to a higher standard...\n\n \n JJ, you obviously don't know Matt very well. He would rather torch religion completely than find a way to co-exist with it. \n And when it comes to tolerance, he's the most intolerant person on the board. I've been listening to his hysterical hyperbole on two boards for several years now. He's a one-note song and even that's a flat. ;)", 
   {}, 
   390115, 
   null, 
   1266012720.0
  ], 
  [
   390230, 
   null, 
   "Matthew S", 
   "So if a group holds an opinion on civil rights that differs from yours they should be punished by the government. How incredibly arrogant of you. \n \n Hate to break this to you Matt, but, everyone is entitled to their own opinions and beliefs. They are also entitled to advocate and vote in accordance with those opinion and beliefs. Your my way or the highway, those guy don't agree with me so punish them out of existence attitude is more befitting of places like Uganda then the United States.\n\n \n They are not happy to live and let live. They oppose gay civil rights. THey oppose our right to marry, to adopt, to be employed, and to have sex with who we choose. As long as they oppose these things through the law I will continue to oppose their religious freedom. If you have termites in your house do you allow them to eat your house or do you call an exterminator? Well my house is my civil rights and eqaulity as a citizen and the termites are the religious groups eating at my civil rights and freedoms.", 
   {}, 
   390174, 
   null, 
   1266067380.0
  ], 
  [
   390231, 
   null, 
   "Matthew S", 
   "JJ, you obviously don't know Matt very well. He would rather torch religion completely than find a way to co-exist with it. \n And when it comes to tolerance, he's the most intolerant person on the board. I've been listening to his hysterical hyperbole on two boards for several years now. He's a one-note song and even that's a flat. ;)\n\n \n That is just my #1 issue. You know very well that I believe in extreme taxation on the rich, extreme regluation of buisness for the public good. I belive their should be no drug laws, and the prostitution should be legal. I believe we should mind our own business and the military's only purpose is for defense. I believe that we should immediatly pull out of Iraq and Afghanistan. I am hardly a one note song.", 
   {}, 
   390176, 
   null, 
   1266067740.0
  ], 
  [
   390240, 
   null, 
   "jazyjason", 
   "If they bring it into the public square and make laws based upon those religious beliefs then I want the right to vote on their right to hold those beliefs. \n\n \n Matt look. I hate to say it but we're a minority..... Even IF you had your wish things would not change. I understand your frustration trust me. I've sat through many a hate filled sermon at Calvary Chapel Corona where the pastor made fun of gay people and compared us to inmates that wore pink for punishment.....\n \n Still, there is a fine line Matt. It's not faith that is the issue it is the prejudice that these people have that use religion to hide behind such prejudice. That is the issue at hand.\n \n \nIf they keep it to themselves in their homes and churches and do not try and effect the lawss I have to live under then then more power to them. \n\n \n And how about the laws we want. What about our right to marry? Do you not think it is a two way street? Matt the only way we will ever win this fight is to be better than those who hate us. We need to be the more rationale, passionate, and dedicated people and set ourselves to a higher standard...\n \n \n \nHowever the moment they try and force their religious beliefs on me through the law then it is time for those religious beliefs to be extinguished.\n\n \n Extinguished? Matt do you hear what you are saying? Such talk was uttered in the halls of the SS, and under the roofs of Franco..... Do not utter such a term when it has heavy weight for everyone it effects.... \n \n \n \n \nIt is time to stop this madness. I thought Prop 8 would have been a wake up call for you.\n\n \n Matt I marched in West Hollywood. I saw the people behind the temple fences throwing bottles at fellow marchers. I even shouted in the bullhorn in front of 3000 angry people going down Santa Monica Blvd.....\n \n But Matt having an all or nothing attitude is not going to solve anything. We have to plan the end game here. We need to be smarter, and wiser. We need to let those people who hate us and despise us hang themselves!\n \n People know our fight. It is time we play calm and rationale now Matt especially with November approaching. Now is not the time to point fingers. Now is the time to show others the dire importance of our cause....\n \n \n \n NO MORE MR NICE GAY \n Where is the MCC the UCC or any other gay accepting church? Why haven't they backed us as strongly and publicly as the anti gay christianist churches have tried to extingush us?\n\n \n Because those churches have the backing of political powers that use anti gay discrimination as a platform to garner votes Matt. This \"pro family\" dogma and such, it is all a vicious cycle.\n \n I have sat in a sermon with the president of the FRC basically accused gays of ruining America and families, and accused us of destabilizing today's young people, and sadly the crowd ate it up like candy...\n \n You see Matt? We MUST show these people the truth..... We cannot just demand acceptance it won't work especially if you are crying death to religion.... That is EXACTLY what these people want you to do.\n \n They want you to overreact and base everything off of emotion. These people are not stupid Matt they've been playing the game of lies and keeping the public memorized for years....\n \n \nCivil rights are never just given to a minority by the majority. You must get out there and fight. March, protest and if need be riot. \n\n \n I agree. We need to march and organize and have a grassroots effort. But I dare you to get a room full of self centered queens to do anything organized.... Many are in it for themselves sadly.... There is no unified movement anymore Matt. Not like it used to be....\n \n Many just do not care...\n \n \nIf Prop8 had been about taking away civil tights from african americans do you think for one moment that the several cities around california would not have gone up in flames?\n\n \n Do not equate Black civil rights to Gay rights they are different. This is about showing others the true us's, the true way we are. How much our partners mean to us, our children, our families. We need to show them that, not how XXXXXX off we are at the world.....\n \n \n Read history no minority group have ever gained what should be theirs from the majority by meekly asking, as olver twist, \"may I have some more please?\"\n\n \n No but history has never seen a minority win by not having proof of their cause either Matt. How can we show others our cause if the message is lost in hate and anger and animosity?\n \n Sorry to say but it won't succeed unless we face these people and confront them with fact, with reason, with steadfast zeal and extinguish the scorn and the prejudice with our cause and reason. That is the only way we will win.", 
   {}, 
   390133, 
   null, 
   1266071280.0
  ], 
  [
   390242, 
   null, 
   "jazyjason", 
   "JJ, you obviously don't know Matt very well. He would rather torch religion completely than find a way to co-exist with it. \n And when it comes to tolerance, he's the most intolerant person on the board. I've been listening to his hysterical hyperbole on two boards for several years now. He's a one-note song and even that's a flat. ;)\n\n \n \n I think you misunderstand Matt JP. He is tired of the Robertson's, the lies, the hate flung from the pulpit. In his eyes it is the crux of why we are denied rights and to a certain degree he is right!\n \n \n We are the scapegoat for these powers that be to garner fear, and bring out the worst in people through fear, and ignorance.... I can see where Matt is coming from but at the same token there cannot be all negative!\n \n \n There cannot be an all or nothing approach it simply won't work..... Like I stated religion is not the issue here it is the prejudice masked as faith that is the issue.....\n \n There are a myriad of factors and challenges here that need to be addressed, but we'll see....", 
   {}, 
   390176, 
   null, 
   1266071640.0
  ], 
  [
   390605, 
   null, 
   "Lurch907", 
   "They are not happy to live and let live. They oppose gay civil rights.\n\n \n They oppose your opinion of what civil rights should be. BTW there is no such thing as \"gay civil rights\" there are human civil rights. \n \n \nAs long as they oppose these things through the law I will continue to oppose their religious freedom.\n\n \n So, because they hold a different opinion than yours about civil rights, you think they should have a right taken away. A right specifically enumerated in the Bill of Rights. Let me know how that works out for you.\n \n \nIf you have termites in your house do you allow them to eat your house or do you call an exterminator? Well my house is my civil rights and eqaulity as a citizen and the termites are the religious groups eating at my civil rights and freedoms.\n\n \n Just so long as you understand that in their opinion your the termite and your attacking the moral underpinnings of society, aka the house.\n \n \n\n That is just my #1 issue. You know very well that I believe in extreme taxation on the rich, extreme regluation of buisness for the public good. I belive their should be no drug laws, and the prostitution should be legal. I believe we should mind our own business and the military's only purpose is for defense. I believe that we should immediatly pull out of Iraq and Afghanistan. I am hardly a one note song.\n\n \n You could have saved some wear on your fingers and just said \"I'm a socialist\". Unfortunately for your opinion, the United States isn't a socialist country. Not that the current crop of politicians in DC isn't trying. Fortunately, the majority of people in this country don't think someone should be punished for doing well, businesses shouldn't be punished for being profitable, and everybody doesn't have the right to everything just because they think they should. \n If you don't like the laws as they are you are free to lobby for change, but, everybody has that right, including those that don't agree with you. Your \"if you don't agree with me you should be punished\" attitude is despicable. The idea that you would punish a group because they speak out and vote in accordance with their beliefs puts you on the same moral level as the Ugandan government.", 
   {}, 
   390230, 
   null, 
   1266286620.0
  ], 
  [
   390609, 
   null, 
   "Matthew S", 
   "They oppose your opinion of what civil rights should be. BTW there is no such thing as \"gay civil rights\" there are human civil rights. \n \n \n \n So, because they hold a different opinion than yours about civil rights, you think they should have a right taken away. A right specifically enumerated in the Bill of Rights. Let me know how that works out for you.\n \n \n \n Just so long as you understand that in their opinion your the termite and your attacking the moral underpinnings of society, aka the house.\n \n \n \n You could have saved some wear on your fingers and just said \"I'm a socialist\". Unfortunately for your opinion, the United States isn't a socialist country. Not that the current crop of politicians in DC isn't trying. Fortunately, the majority of people in this country don't think someone should be punished for doing well, businesses shouldn't be punished for being profitable, and everybody doesn't have the right to everything just because they think they should. \n If you don't like the laws as they are you are free to lobby for change, but, everybody has that right, including those that don't agree with you. Your \"if you don't agree with me you should be punished\" attitude is despicable. The idea that you would punish a group because they speak out and vote in accordance with their beliefs puts you on the same moral level as the Ugandan government.\n\n \n What you seem not to understand is that I want equality. I was rasied that if some one takes something from you they should loose something of theirs. If I can not marry the person I choose then neither should they be able too. \n \n So then if I do not gain the right to marry because of someone elses relgious beliefs then they should lose the freedom to hold that belief. The point is that my civil rights have no effect on their lives what so ever. \n \n As far as socalism, goes I am further to the left then that. The only reason business should exist is for the service of people, not money or profit. Any money of profit they controll should go for the betterment of people and peoples lives.", 
   {}, 
   390605, 
   null, 
   1266287400.0
  ], 
  [
   390615, 
   null, 
   "Lurch907", 
   "What you seem not to understand is that I want equality. I was rasied that if some one takes something from you they should loose something of theirs. If I can not marry the person I choose then neither should they be able too. \n \n So then if I do not gain the right to marry because of someone elses relgious beliefs then they should lose the freedom to hold that belief. The point is that my civil rights have no effect on their lives what so ever. \n \n As far as socalism, goes I am further to the left then that. The only reason business should exist is for the service of people, not money or profit. Any money of profit they controll should go for the betterment of people and peoples lives.\n\n \n Like I said, despicable.", 
   {}, 
   390609, 
   null, 
   1266288660.0
  ], 
  [
   390642, 
   null, 
   "Matthew S", 
   "Like I said, despicable.\n\n \n So then they get to take something from me? So they get to force me to live by their religion?\n \n The neat thing about putting things on the ballot is that one day the majority might decide to do away with religious freedom. After all when you put some rights up for a popular vote all rights are no longer off limits. Here is to the growth of the atheist movement :)", 
   {}, 
   390615, 
   null, 
   1266294480.0
  ], 
  [
   390643, 
   null, 
   "JPSartre12", 
   "That is just my #1 issue. You know very well that I believe in extreme taxation on the rich, extreme regluation of buisness for the public good. I belive their should be no drug laws, and the prostitution should be legal. I believe we should mind our own business and the military's only purpose is for defense. I believe that we should immediatly pull out of Iraq and Afghanistan. I am hardly a one note song.\n\n \n Sorry. I forgot that you were a burger-flippin' gay socialist. emoticon_rolleyes", 
   {}, 
   390231, 
   null, 
   1266295320.0
  ], 
  [
   390683, 
   null, 
   "jazyjason", 
   "What you seem not to understand is that I want equality. I was rasied that if some one takes something from you they should loose something of theirs. If I can not marry the person I choose then neither should they be able too. \n\n \n \n That's a double standard. Your making conditions for peoples rights. I hate to say it Matt but what your wanting is conditional equality that only benefits your interests ....\n \n \nSo then if I do not gain the right to marry because of someone elses relgious beliefs then they should lose the freedom to hold that belief. The point is that my civil rights have no effect on their lives what so ever. \n\n \n But your making your rights have an effect Matt. It goes from a personal interest of marriage to an invasion of belief with condition. There has to be a two way street here Matt not only what you want. Besides this would be destructive if it were perceived this way as making a case for gay rights...\n \n \n \nAs far as socalism, goes I am further to the left then that. The only reason business should exist is for the service of people, not money or profit. Any money of profit they controll should go for the betterment of people and peoples lives.\n\n \n Ehh...... Disagree.", 
   {}, 
   390609, 
   null, 
   1266321540.0
  ], 
  [
   390723, 
   null, 
   "Matthew S", 
   "That's a double standard. Your making conditions for peoples rights. I hate to say it Matt but what your wanting is conditional equality that only benefits your interests ....\n\n \n What I want is for them to leave us alone, stop attacking us and let us live our lives in peace on an equal foot to them. Since they are still willing to fight our basic rights then I need to fight their basic rights.\n \n\n But your making your rights have an effect Matt. It goes from a personal interest of marriage to an invasion of belief with condition. There has to be a two way street here Matt not only what you want. Besides this would be destructive if it were perceived this way as making a case for gay rights...\n \n\n Being on an equal footing with heteros has nothing to do with those heteros. I can not believe I have to explain this to you. You and I are legally forced every second of the day to accept heteros, heterosexual marriage, and heterosexual behavior. If I am legally forced to accept them then they should be legally forced to accept me. Equality. I want the same acceptence and respect they demand from me. A piece of paper issued by the sate has nothing what so ever to do with religion at all. Just like a drivers license do you have to take a catechism class in order to drive a car?\n \n \n\n Ehh...... Disagree.\n\n \n Do you think Jesus was a capitalist?", 
   {}, 
   390683, 
   null, 
   1266334680.0
  ], 
  [
   390728, 
   null, 
   "jazyjason", 
   "What I want is for them to leave us alone, stop attacking us and let us live our lives in peace on an equal foot to them. Since they are still willing to fight our basic rights then I need to fight their basic rights.\n\n \n Matt you do not need to fight against their rights. You need to put your energy toward fighting for OUR rights! Make the case! Support the cause! Let them keep what they have as a testament to our lack of such!\n \n Taking away one's rights will solve nothing and detracts from our message of true equality and the legacy Harvey Milk fought for....\n \n \nBeing on an equal footing with heteros has nothing to do with those heteros. I can not believe I have to explain this to you. You and I are legally forced every second of the day to accept heteros, heterosexual marriage, and heterosexual behavior.\n\n \n Yes we are because that is the status of the majority Matt. You must see that we have made so many strides in 40 years..... I see your point here but this is where our energies must be made in showing the majority the necessity for us to have such rights...\n \n \n If I am legally forced to accept them then they should be legally forced to accept me. Equality. I want the same acceptence and respect they demand from me. A piece of paper issued by the sate has nothing what so ever to do with religion at all. Just like a drivers license do you have to take a catechism class in order to drive a car?\n\n \n No religion does not Matt so thus religion should not be effected.... You will never garner everyone's acceptance Matt you need to see this. You should not be fighting for acceptance but equal treatment under the law....\n \n People are influenced by morals and what make up their environment and upbringing. We need to show these people who we really truly are.... And unless the gay community screws it's head on right and stops XXXXX footing around with pointless drag shows, MR. Gay universe XXXX, and puts their energy toward unifying our cause we will NEVER achieve any sort of advance on changing the hearts and minds of others....\n \n \n Matt I hate to say it but I have sat through so many pride meetings in Virginia where my ex was treasurer. It was a one man show. Him. No one cared. No one gave a damn about equality, all they cared about was their 15 minutes of fame, the one run down bar in Norfolk, and what trick they may score....\n \n This is the very mentality we need to fight against.... I mean for Gods sake we were organizing for pride while the bar owner was dealing crack! It is this destructive behavior within the community and lack of caring and self centered selfish mentality that destroys any sort of progress we make.....\n \n \n \n \nDo you think Jesus was a capitalist?\n\n \n I think Jesus got it right. Give what is God's to God's and what is Cesar's Cesar's. If a business makes a profit as long as it is ethical and honest it's fine.", 
   {}, 
   390723, 
   null, 
   1266335340.0
  ], 
  [
   390758, 
   null, 
   "Lurch907", 
   "Ehh...... Disagree.\n\n \n Any rational, thinking person would.", 
   {}, 
   390683, 
   null, 
   1266342120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Bill would let clergy refuse to marry gays", 
  "url": "http://www.4forums.com/political/gay-rights-debates/13857-bill-would-let-clergy-refuse-marry-gays.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 13857, 
  "discussion_files": [
   [
    "12829.html", 
    "http://www.4forums.com/political/gay-rights-debates/13857-bill-would-let-clergy-refuse-marry-gays-print.html"
   ], 
   [
    "12830.html", 
    "http://www.4forums.com/political/gay-rights-debates/13857-bill-would-let-clergy-refuse-marry-gays-3-print.html"
   ], 
   [
    "12831.html", 
    "http://www.4forums.com/political/gay-rights-debates/13857-bill-would-let-clergy-refuse-marry-gays-2-print.html"
   ]
  ], 
  "identifier": 13857
 }
]