[
 [
  [
   389708, 
   null, 
   "NATO 556", 
   "Lil Wayne sentencing scheduled for Tuesday morning &#8211; The Marquee Blog - CNN.com Blogs\n \n \nOn Tuesday morning rapper Lil Wayne will formally be sentenced to a year-long prison term for gun possession in the Manhattan Supreme Court, CNN has learned.\n \n Although the exact time of sentencing is unknown, it's also likely that Wayne, whose real name is Dwayne Carter, will start his prison term Tuesday as well.\n \n This sentence has been a long time coming for Wayne, who pleaded guilty to felony gun charges in October 2009 stemming from a July 2007 arrest. Police said Carter and another man were smoking marijuana on a New York City street, and a .40-caliber pistol in Carter's possession.\n \n Up until his sentencing, Wayne has been working on his next album, \"Tha Carter IV,\" and he told Rolling Stone in an interview that he doesn't plan to stop working while he's in prison.\n \n To date, Wayne has sold millions of albums - \"Tha Carter III\" alone sold a million within its first week - since his solo debut, \"Tha Block is Hot,\" in 1999.\n\n \n So let's see...felony possession of a firearm, that's supposed to be a five year minimum sentence. And yet Wayne's getting off with just one fifth of that time.\n \n New York claims that they're getting tough on crime, and yet they're giving him only one year even though he pleaded guilty to the charge.", 
   {
    "post_info": {
     "post_title": "Tough on crime? Not likely"
    }
   }, 
   null, 
   null, 
   1265743980.0
  ], 
  [
   389712, 
   null, 
   "JPSartre12", 
   "Lil Wayne sentencing scheduled for Tuesday morning - The Marquee Blog - CNN.com Blogs\n \n \n \n So let's see...felony possession of a firearm, that's supposed to be a five year minimum sentence. And yet Wayne's getting off with just one fifth of that time.\n \n New York claims that they're getting tough on crime, and yet they're giving him only one year even though he pleaded guilty to the charge.\n\n \n Maybe he can borrow \"Flava Flav's\" clock to keep track of his time in prison. ;)", 
   {
    "unicode_changes_made": true
   }, 
   389708, 
   null, 
   1265744160.0
  ], 
  [
   389715, 
   null, 
   "sinjin", 
   "\"Wayne pleaded guilty to a class \"D\" violent felony of attempted criminal possession of a weapon in the second degree; \n the charges stem from a July 2007 arrest. \n \n Had the rapper not struck a deal with prosecutors, he could have been looking at a mandatory minimum of three and a half \n years in prison if he was found guilty by trial.\" \n \n sinjin - A plea bargain. In NY State a class \"D\" felony can carry a seven(7) year sentence.", 
   {}, 
   389712, 
   null, 
   1265744520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Tough on crime? Not likely", 
  "url": "http://www.4forums.com/political/crime-debates/13872-tough-crime-not-likely.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 13872, 
  "discussion_files": [
   [
    "3061.html", 
    "http://www.4forums.com/political/crime-debates/13872-tough-crime-not-likely-print.html"
   ]
  ], 
  "identifier": 13872
 }
]