[
 [
  [
   389479, 
   null, 
   "COBHC", 
   "I've just been wondering why all the anti-Zionists are complaining about how Israel violates the rights of Arab citizens. In fact, the Arab Government focus on human rights is nothing more than a political tool to demonize Israel. They have no real concern for human rights. I thought the Tyranny of Arab countries was common knowledge, but some are either too stupid or biased to accept it.\n \n Myths & Facts - Human Rights in Arab Countries\n \n \nMYTH: \"The governments of Arab states grant basic human rights to their citizens.\"\n \n FACT:\n \n While much attention has been focused on alleged Israeli human rights violations in the volatile West Bank and Gaza, the popular press has chosen to virtually ignore violations of fundamental human rights that take place daily in almost every Arab country. According to annual reports compiled by the State Department, most of the Arab states are ruled by oppressive, dictatorial regimes, which deny their citizens basic freedoms of political expression, speech, press and due process. The Arab Human Development Report published by a group of Arab researchers from the UN Development Program concluded that out of the seven regions of the world, Arab countries had the lowest freedom score. They also had the lowest ranking for \"voice and accountability,\" a measure of various aspects of the political process, civil liberties, political rights and independence of the media.1\n\n \n Saying that most Arab countries respect human rights is either a statement of utter ignorance, or a blatant lie. \n \n All the bold text except for \"MYTH\" and \"FACT\" is added by me.\n \n \nMYTH: \"Women's rights are now protected in the Arab world.\"\n \n FACT:In most Arab countries, the Shari'a, or Islamic law, defines the rules of traditional social behavior. Under the law, women are accorded a role inferior to that of men, and are therefore discriminated against with regard to personal rights and freedoms.\n \n As Middle East expert Daniel Pipes explains: \"In the Islamic view...female sexuality is thought of as being so powerful that it constitutes a real danger to society.\" Therefore, unrestrained females constitute \"the most dangerous challenge facing males trying to carry out God's commands.\" In combination, females' \"desires and their irresistible attractiveness give women a power over men which rivals God's.\"2\n \n \"Left to themselves,\" Pipes continues, \"men might well fall victim to women and abandon God,\" resulting in civil disorder among believers. In traditional thought, Pipes notes, women pose an internal threat to Islamic society similar to the external one represented by the infidel.\n \n So the Arabs not only deny women rights, but they strive to prevent women's rights as they believe it would be a bad thing. I hope all women from Western countries reading this stop and consider how lucky they are that they weren't born in any of these countries.\n \n Traditionally, the Arab woman marries at a young age to a man of her father's choice. A husband is entitled to divorce any time, even against his wife's will, by merely declaring verbally that this is his intention.\n \n Women in marriage countries don't even get to decide who they marry, and they can be forced to marry someone they don't love or maybe even completely despise. If you think that's bad, it gets worse.\n \n ..............................\n \n Wife-beating is a relatively common practice in Arab countries, and abused women have little recourse. As the State Department has noted regarding Jordan (and most of the Arab world): \"Wife beating is technically grounds for divorce, but the husband may seek to demonstrate that he has authority from the Koran to correct an irreligious or disobedient wife by striking her.\"\n \n So a woman may be forced to live with a wife-beater, and can be beaten for disobedience. I thought this was common knowledge, and I'm surprised that I even have to say this: married women in Arab countries are basically slaves to their husband. That's not even the worst part.\n \n ..............................\n \n According to the UN, \"utilization of Arab women's capabilities through political and economic participation remains the lowest in the world in quantitative terms....In some countries with elected national assemblies, women are still denied the right to vote or hold office. And one in ever two Arab women can neither read nor write.\"\n \n This reminds me of slaves on southern plantations in the 1800s. Plantation owners preferred less educated slaves, as they would be less likely to realize what a sucky life they had and rebel. The only thing they wanted their slaves to know was how to pick cotton. Likewise, the only thing the Arabs want their women to know is how to serve their husbands. The worst is yet to come.\n \n Moroccan law excuses the murder or injury of a wife who is caught in the act of committing adultery; yet women are punished for harming their husbands under the same circumstances.\n \n\n \n \nMYTH: \"Freedom for Palestinians in the Palestinian Authority includes the right to sell land to Jews.\"\n \n FACT: In 1996, the Palestinian Authority (PA) Mufti, Ikremah Sabri, issued a fatwa (religious decree), banning the sale of Arab and Muslim property to Jews. Anyone who violated the order was to be killed. At least seven land dealers were killed that year. Six years later, the head of the PA's General Intelligence Service in the West Bank, General Tawfik Tirawi, admitted his men were responsible for the murders.8\n \n On May 5, 1997, Palestinian Authority Justice Minister Freih Abu Middein announced that the death penalty would be imposed on anyone convicted of ceding \"one inch\" to Israel. Later that month, two Arab land dealers were killed. PA officials denied any involvement in the killings. A year later, another Palestinian suspected of selling land to Jews was murdered. The PA has also arrested suspected land dealers for violating the Jordanian law (in force in the West Bank), which prohibits the sale of land to foreigners.9 \n \n\n \n Another blatant lie from the Arabs.\n \n \nMYTH: \"The Palestinian Authority held a free, democratic election in 2005.\"\n \n FACT:\n Elections are not synonymous with democracy. Several Arab countries hold elections, including Egypt and Syria, but they have only one candidate, and there is no doubt about the outcome. The dictators are always reelected with nearly 100 percent of the vote. In those nations, no one seriously claims the elections are democratic.\n \n In the case of the Palestinian Authority (PA) elections held in January 2005, the standards were higher. These were advertised as an example of democracy and, compared to other Arab states, the voting was a considerable advancement toward free elections.\n \n Still, the election could hardly be called competitive as the outcome was never in doubt. Seven candidates ran for president, but the only question was the size of Mahmoud Abbas' margin of victory. He won with 62.3 percent of the vote. His nearest challenger was Mustafa Barghouti with 19.8 percent.12\n \n\n \n No person knowledgeable about the issue can say that the leaders of these countries are democratically elected with a straight face. \n \n Before you dismiss the article as Jewish propaganda, you'll have to prove that the entire bibliography for the article is also just Jewish propaganda or is biased in Israel's favor.\n \n \n\n 1 - Arab Human Development Report 2002, NY: UN, 2002.\n 2 - Daniel Pipes, In the Path of God: Islam and Political Power, (NY: Basic Books, 1983), p. 177.\n 3 - Arab Human Development Report 2002, NY: UN, 2002.\n 4 - U.S. State Department, Reports on Human Rights Practices for 1999.\n 5 - Martin Peretz, \"Remembering Saudi Arabia,\" The New Republic, (January 28, 2002).\n 6 - USA Today, (April 29, 2002).\n 7 - Al-Quds Al-Arabi (London), (December 4, 1999).\n 8 - Jerusalem Post, ,(August 19, 2002).\n 9 - State Department. Human Rights Report for the Occupied Territories, 1997, 1998.\n 10 - Associated Press, (March 28, 2004).\n 11 - Washington Post, (March 29, 2004).\n 12 - CNN.com (January 10, 2005).\n 13 - Aljazeera.Net, (January 11, 2005).\n 14 - CNN.com, (January 10, 2005); Herb Keinon, \"Observer teams validate PA elections,\" Jerusalem Post, (January 11, 2005).\n 15 - Herb Keinon, \"Sharansky: PA election not 'truly free,'\" Jerusalem Post, (January 11, 2005).\n 16 - Aljazeera.Net, (January 15, 2005); Jerusalem Post, (January 16, 2005).\n 17 - Herb Keinon, \"Sharansky: PA election not 'truly free,'\" Jerusalem Post, (January 11, 2005).\n 18 - Newsweek, (March 10, 2003).\n 19 - CBS News, (June 25, 2004).\n 20 - Washington Post, (December 4, 2001).\n 21 - Jewish Telegraphic Agency, (August 9, 2002).\n 22 - Jerusalem Report, (March 25, 2002).\n 23 - CNN, (August 16, 2001).\n 24 - Jerusalem Post, (July 1, 2002); BBC News, (August 11, 2002).\n 25 - Washington Post editorial, (October 11, 2001).\n 26 - Isabel Kershner, \"Below the Law,\" Jerusalem Report, (April 22, 2002), pp. 32-33.\n 27 - New York Times editorial, (October 18, 2003). \n \n", 
   {
    "post_info": {
     "post_title": "Arab Countries"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1265653260.0
  ], 
  [
   389480, 
   null, 
   "josephdphillips", 
   "I don't need to be pro-Arab or pro-Islam to be anti-Zionist. Any claim to real estate based on the scawled ravings of superstitious ancients is bogus on its face.\n \n The religious goofballs over there will never have peace, because that isn't what they want. Diplomacy is a waste of time.", 
   {}, 
   389479, 
   null, 
   1265653680.0
  ], 
  [
   389481, 
   null, 
   "COBHC", 
   "I don't know how you figure that the Arabs should be sympathized with over the Israelis, but I think I'd rather trust the people who don't call America the Great Satan or shout \"DEATH TO AMERICA!!\"\n \n On another note, if you want to complain about how religion is irrational, I suggest you move to another thread. Wether or not religion is true or rational is completely off-topic here. Personally, I believe that Israel wants peace. The Arabs don't, because they won't be happy until the world is under Sharia Law. The enemy of our enemy is our ally.", 
   {}, 
   389480, 
   null, 
   1265653920.0
  ], 
  [
   389482, 
   null, 
   "gansao", 
   "I don't know how you figure that the Arabs should be sympathized with over the Israelis, but I think I'd rather trust the people who don't call America the Great Satan or shout \"DEATH TO AMERICA!!\"\n \n On another note, if you want to complain about how religion is irrational, I suggest you move to another thread. Wether or not religion is true or rational is completely off-topic here. Personally, I believe that Israel wants peace. The Arabs don't, because they won't be happy until the world is under Sharia Law. The enemy of our enemy is our ally.\n\n \n +1emoticon_xhohoemoticon_xhoho", 
   {}, 
   389481, 
   null, 
   1265654460.0
  ], 
  [
   389486, 
   null, 
   "josephdphillips", 
   "I don't know how you figure that the Arabs should be sympathized with over the Israelis\n\n \n I don't sympathize with either. They're two sides of the same, corroded coin.\n \n \nI'd rather trust the people who don't call America the Great Satan or shout \"DEATH TO AMERICA!!\"\n\n \n I don't trust either, but the Saudis have an important economic relationship with the United States. The Israelis do not.\n \n Let the towelheads in the street slander the United States all they want. As long as the sheiks are taking our money, they're open to reason.\n \n \nif you want to complain about how religion is irrational, I suggest you move to another thread. Wether or not religion is true or rational is completely off-topic here.\n\n \n It isn't, because religion and politics are the same in Israel. It's a theocracy, no different than Iran's.\n \n \nI believe that Israel wants peace. The Arabs don't, because they won't be happy until the world is under Sharia Law. The enemy of our enemy is our ally.\n\n \n Israel is no ally. They are not keeping the Muslims in check, and never will. The country is simply too small and unimportant to make a difference.", 
   {}, 
   389481, 
   null, 
   1265656320.0
  ], 
  [
   389488, 
   null, 
   "Archangel", 
   "Just as it was the democrats who fought so hard against the integration of american blacks, so do they now stand firmly against Israel as they support the radical islamofascists who seek to make Islam the worlds one and only religion. As you say COBHC, these people are either too stupid or biased to discern the truth of what Islam represents over the lies and propaganda which they espouse.", 
   {}, 
   389482, 
   null, 
   1265656740.0
  ], 
  [
   389490, 
   null, 
   "JPSartre12", 
   "I don't sympathize with either. They're two sides of the same, corroded coin.\n\n \n I disagree. I've never heard of an Israeli suicide bomber, for instance.\n \n\n I don't trust either, but the Saudis have an important economic relationship with the United States. The Israelis do not.\n \n\n Again, I disagree. Israel never turned its back when we've needed support in the ME. ALL of the Arab states have at one time or another.\n \n\n Let the towelheads in the street slander the United States all they want. As long as the sheiks are taking our money, they're open to reason.\n \n\n So, you're OK with handing $700Billion/year to someone that is funding those trying to destroy the West? \n \n\n It isn't, because religion and politics are the same in Israel. It's a theocracy, no different than Iran's.\n \n\n Careful, your ignorance is showing.\n \n\n Israel is no ally. They are not keeping the Muslims in check, and never will. The country is simply too small and unimportant to make a difference.\n\n \n Wrong again. It is a well-armed non-Arab NUCLEAR POWER in a sea of hostile Arab states. If you believe it's insignificant, why can't the Arabs easily eliminate them? Every time they try, Israel picks up more real estate.", 
   {}, 
   389486, 
   null, 
   1265657460.0
  ], 
  [
   389491, 
   null, 
   "josephdphillips", 
   "I disagree. I've never heard of an Israeli suicide bomber, for instance.\n\n \n This is relevant how?\n \n I don't see any of the shieks blowing themselves up, either.\n \n \nIsrael never turned its back when we've needed support in the ME.\n\n \n When have we needed support from Israel?\n \n \nALL of the Arab states have at one time or another.\n\n \n We have military bases on Arab soil. We don't have them on Israeli soil.\n \n The Arabs have something we want. The Israelis do not.\n \n \nyou're OK with handing $700Billion/year to someone that is funding those trying to destroy the West?\n\n \n The sheiks aren't trying to destroy their customers. That doesn't make good business sense.\n \n It's Islam that's trying to destroy the west, not the sheiks. The latter may be Muslim, but they're businessmen first.\n \n \nIt is a well-armed non-Arab NUCLEAR POWER in a sea of hostile Arab states.\n\n \n Nuclear power doesn't mean much if you have no intent to use it. I'm sure the Zionists have nukes but they won't even test them in public. What's the point of that?\n \n \nIf you believe it's insignificant, why can't the Arabs easily eliminate them? Every time they try, Israel picks up more real estate.\n\n \n Israel remains insignificant precisely because it can manage on its own. If it doesn't need my pity or support, why are you asking for it on their behalf?", 
   {}, 
   389490, 
   null, 
   1265658780.0
  ], 
  [
   389516, 
   null, 
   "COBHC", 
   "I don't sympathize with either. They're two sides of the same, corroded coin.\n\n \n That is not true. When was the last time you heard of a Jew blowing himself up in an Arab marked or shooting up a Palestinian school?\n \n \nI don't trust either, but the Saudis have an important economic relationship with the United States. The Israelis do not.\n\n \n That doesn't excuse shooting up Israeli schools and hospitals, and you should know they're using the money we pay them to build nuclear weapons which will eventually be used agaisnt Israel and probably us as well.\n \n \nLet the towelheads in the street slander the United States all they want. As long as the sheiks are taking our money, they're open to reason.\n\n \n You must have a pretty broad definition of street slander, since it's what you call speeches by Ahmadinejad in which he states that Israel must be destroyed and that America is a Satan.\n \n \nIt isn't, because religion and politics are the same in Israel. It's a theocracy, no different than Iran's.\n\n \n Bull****! The Israeli Government has passed no laws based on Judaism as far as I know. If they have, which I highly doubt, it couldn't have possibly been anywhere near the extent of Muslim Sharia Law, in which the entire law is basically just the official version of the Quran. \n \n Not practicing Islam in Muslim countries will get you killed if you're caught. But Israel is open to a variety of sects of Islam, Judaism, and Christianity, and the law is not based on any of these religions. Saying that Israel is a theocracy is a massively ignorant statement.\n \n Once again, religion is a completely off-topic issue here. \n \n \nIsrael is no ally. They are not keeping the Muslims in check, and never will. The country is simply too small and unimportant to make a difference.\n\n \n Once again you demonstrate an appalling level of ignorance. The more you say about Israel the more I know how little you know about it. Israel has one of the strongest militaries on the face of the earth for a country of its size. Israel has picked up more land every time the Arabs have tried to conquer it. If Israel was as weak as you think it is, it wouldn't even exist anymore.", 
   {}, 
   389486, 
   null, 
   1265665860.0
  ], 
  [
   389520, 
   null, 
   "josephdphillips", 
   "That is not true. When was the last time you heard of a Jew blowing himself up in an Arab marked or shooting up a Palestinian school?\n\n \n Again, you haven't established why suicide-bombers in Israel or Saudi Arabia are relevant to me as an American. That has nothing to do with strategic relationships.\n \n \nThat doesn't excuse shooting up Israeli schools and hospitals, and you should know they're using the money we pay them to build nuclear weapons which will eventually be used agaisnt Israel and probably us as well.\n\n \n You can always stop consumption of petroleum, COBHC. Knock yourself out.\n \n Until the oil runs out, we'll be doing business with the Saudis, whether or not they have nukes.\n \n \nYou must have a pretty broad definition of street slander, since it's what you call speeches by Ahmadinejad in which he states that Israel must be destroyed and that America is a Satan.\n\n \n He hasn't said anything the towelheads have been saying for decades. Israel is still around. So is the United States.\n \n You don't recognize political rhetoric for what it is.\n \n \nThe Israeli Government has passed no laws based on Judaism as far as I know. If they have, which I highly doubt, it couldn't have possibly been anywhere near the extent of Muslim Sharia Law, in which the entire law is basically just the official version of the Quran.\n\n \n It calls itself a Jewish state, for one thing. Its immigration and zoning policies are based on religion. Need I say more?\n \n Comparing it to Sharia law doesn't matter. A theocracy is a theocracy.\n \n \nNot practicing Islam in Muslim countries will get you killed if you're caught. But Israel is open to a variety of sects of Islam, Judaism, and Christianity, and the law is not based on any of these religions. Saying that Israel is a theocracy is a massively ignorant statement.\n\n \n No, it's not. It's all about Zionism, and Zionism is all about religious discrimination.\n \n \nreligion is a completely off-topic issue here.\n\n \n It isn't. The topic is about peace in the Middle East, correct? Sectarian factionalism is why there is no peace there, and why there never will be peace there.\n \n \nIsrael has one of the strongest militaries on the face of the earth for a country of its size. Israel has picked up more land every time the Arabs have tried to conquer it. If Israel was as weak as you think it is, it wouldn't even exist anymore.\n\n \n I didn't say weak. I said unimportant.\n \n My point is the conflict over there is none of my business as an American, any more than the conflict between any two other nations.", 
   {}, 
   389516, 
   null, 
   1265667420.0
  ], 
  [
   389522, 
   null, 
   "JPSartre12", 
   " \n This is relevant how?\n \n I don't see any of the shieks blowing themselves up, either.\n\n \n No, but they're funding the people that do. Same thing, IMO.\n \n\n When have we needed support from Israel?\n\n Who blew up Iraq's nuclear plant under SH? Guess who provided the planes, bombs, logistics? \n \n\n We have military bases on Arab soil. We don't have them on Israeli soil.\n \n The Arabs have something we want. The Israelis do not.\n\n How naïve. We have military equipment pre-staged in Israel. We jointly develop new weapon systems, missile defense systems, etc., we hold annual joint military exercises with Israel. The list is long.\n \n\n The sheiks aren't trying to destroy their customers. That doesn't make good business sense.\n \n It's Islam that's trying to destroy the west, not the sheiks. The latter may be Muslim, but they're businessmen first.\n\n Again, your naivety is showing. The sheiks fund radical Muslim schools as a means to appease their radical opponents that would try to overthrow them. Their hold on power is very much dependent on them appearing hard-lined towards the West. \n \n\n Nuclear power doesn't mean much if you have no intent to use it. I'm sure the Zionists have nukes but they won't even test them in public. What's the point of that?\n\n No need for them to test them nor to brag about their existence. The knowledge that they have them is enough of a deterrent to keep their arab neighbors in check.\n \n\n Israel remains insignificant precisely because it can manage on its own. If it doesn't need my pity or support, why are you asking for it on their behalf?\n\n You claim that they are too small and unimportant to make a difference, yet you state above that they can manage on their own in a region in which they are severely outnumbered and strategically vulnerable. Now, either you're a fool making the first comment or you're a fool for making the second one. Which is it? emoticon_confused", 
   {
    "unicode_changes_made": true
   }, 
   389516, 
   null, 
   1265669040.0
  ], 
  [
   389523, 
   null, 
   "COBHC", 
   "Again, you haven't established why suicide-bombers in Israel or Saudi Arabia are relevant to me as an American. That has nothing to do with strategic relationships.\n\n \n You weren't at all concerned about how this affects you in your last post. The Arabs are only our friends until their nukes are ready. Their goal is worldwide Sharia law, and they'll do whatever it takes to acheive that goal.\n \n \nYou can always stop consumption of petroleum, COBHC. Knock yourself out.\n \n Until the oil runs out, we'll be doing business with the Saudis, whether or not they have nukes.\n\n \n There's two things we can do: one, find another source of oil that can replace the Arab abundance of oil, which would be expensive probably and Obama doesn't seem interested anyway. Two: don't let the Arabs get nuclear weapons. Muslim radicals have shown that they can't be trusted with nukes. I don't think we're doomed to Sharia law just because we're trading with Iran, but we can't let them finish their nuclear weapons. My reason for being pro-Israel is simple, and directly affects me as an American: as long as Israel stands, the Arabs will not be much of a threat to us.\n \n \nHe hasn't said anything the towelheads have been saying for decades. Israel is still around. So is the United States.\n \n You don't recognize political rhetoric for what it is.\n\n \n Of course he hasn't, because he hasn't successfully made a sufficient amount of nukes yet. You must be really naive if you think he doesn't intend on using them. Iran is not concerned about being attacked by Israel. They're hard at work on their plot to destroy Israel and the US. Ahmadinejad's comment was beyond political rhetoric; it was a sincere, honest threat and it should be taken seriously. \n \n \nIt calls itself a Jewish state, for one thing. Its immigration and zoning policies are based on religion. Need I say more?\n \n Comparing it to Sharia law doesn't matter. A theocracy is a theocracy.\n\n \n Bull****. What you're hearing about Israeli discrimination is nothing more than lies and propaganda from the Palestinians.\n \n Hopefully, this video will enlighten you.\n \n YouTube - Pallywood\n \n Most if not all claims that Israel is a theocracy are nothing but Arab lies and propaganda.\n \n \nNo, it's not. It's all about Zionism, and Zionism is all about religious discrimination.\n\n \n Once again, just Arab propaganda used by the Palestinians as a political weapon against Israel. The world sympathizes with the Palestinians because they don't see the Islamic Jihadists for the deceitful, malevolent bastards they are.\n \n \nIt isn't. The topic is about peace in the Middle East, correct? Sectarian factionalism is why there is no peace there, and why there never will be peace there.\n\n \n No, Islamic extremists are the entire cause of the problem. If Israel didn't want peace, they wouldn't have surrendered the Gaza strip.\n \n \nI didn't say weak. I said unimportant.\n\n \n It's not unimportant, as it is the only thing in the middle-east standing against the Arabs. And its stance against the Arabs is essential for its survival, as the Arabs are anti-semetic and constantly looking for ways to do anything they can against Israel. \n \n \nMy point is the conflict over there is none of my business as an American, any more than the conflict between any two other nations.\n\n \n If it wasn't your business, you wouldn't be commenting on it. But this conflict affects us here in the US, you would know that if you weren't another victim of Arab lies.\n \n The anti-zionist stance is based mostly on ignorance and propaganda.", 
   {}, 
   389520, 
   null, 
   1265669100.0
  ], 
  [
   389534, 
   null, 
   "josephdphillips", 
   "No, but they're funding the people that do.\n\n \n At least one source says the Saudi royal family members are the ones the suicide bombers are attacking.\n \n Saudi Suicide Bombing: Senior Prince Injured\n \n I don't think the sheiks are enamoured of the jihadists. It was the sheiks that booted OBL out of the country.\n \n \nWho blew up Iraq's nuclear plant under SH? Guess who provided the planes, bombs, logistics?\n\n \n The Israelis, but they didn't do it on our behalf, that's for sure.\n \n Many say we should not have gone into Iraq to save the Iraqis to begin with. Perhaps this \"ally\" called \"Israel\" could have done that for us?\n \n \nWe have military equipment pre-staged in Israel. We jointly develop new weapon systems, missile defense systems, etc., we hold annual joint military exercises with Israel.\n\n \n OK, and why do we need to continue training those folks? Or do you claim they need our help.\n \n An attack on Israel would not be considered an attack on the United States.\n \n Formal U.S.-Israel Agreements\n \n Contrast that with the agreement we have with South Korea, signed in 1953.\n \n When push comes to shove, Israel is on its own. Thus it is not our ally in the military sense.\n \n \nThe sheiks fund radical Muslim schools as a means to appease their radical opponents that would try to overthrow them. Their hold on power is very much dependent on them appearing hard-lined towards the West.\n\n \n So it's for show, as I stated.\n \n \nThe knowledge that they have them is enough of a deterrent to keep their arab neighbors in check.\n\n \n OK, so why do you care what happens over there, then. I sure don't. Let the games begin.", 
   {
    "unicode_changes_made": true
   }, 
   389522, 
   null, 
   1265673420.0
  ], 
  [
   389676, 
   null, 
   "JPSartre12", 
   "\n At least one source says the Saudi royal family members are the ones the suicide bombers are attacking.\n \n Saudi Suicide Bombing: Senior Prince Injured\n \n I don't think the sheiks are enamoured of the jihadists. It was the sheiks that booted OBL out of the country. \n\n They funded and built the radical Muslim mosques. Now the chickens are coming back to roost. \n SAUDI ARABIA'S EXPORT OF RADICAL ISLAM\n \n\n The Israelis, but they didn't do it on our behalf, that's for sure.\n \n Many say we should not have gone into Iraq to save the Iraqis to begin with. Perhaps this \"ally\" called \"Israel\" could have done that for us?\n\n We, purposefully, kept Israel out of the Iraq War so that we would have other arab states support. Eliciting the help of Israel would have been a bad PR move. That doesn't mean that they weren't helpful, however. Israel has always provided the US with good intelligence.\n As for our removing SH. It was the right move, but probably not the best way to do it. Under the circumstances, with our UNSC allies being bribed by SH to not sanction military action, I don't see how we could have gone about it differently, however. \n \n\n OK, and why do we need to continue training those folks? Or do you claim they need our help.\n\n Would you deny help from the world's only superpower if you were surrounded by antagonists?\n \n\n \n An attack on Israel would not be considered an attack on the United States.\n \n Formal U.S.-Israel Agreements\n \n Contrast that with the agreement we have with South Korea, signed in 1953.\n \n When push comes to shove, Israel is on its own. Thus it is not our ally in the military sense.\n\n The agreement with Korea was to prevent Chinese aggression. We really weren't too concerned with sand jockey aggression. They fight about as well as they dance. ;)\n \n\n So it's for show, as I stated.\n\n No, it was for appeasement as I stated.\n \n\n OK, so why do you care what happens over there, then. I sure don't. Let the games begin.\n\n We're not ready to cut the cheap oil apron strings yet and Israel is a good place to watch our \"friends in the ME\" from.", 
   {
    "unicode_changes_made": true
   }, 
   389534, 
   null, 
   1265733060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Arab Countries", 
  "url": "http://www.4forums.com/political/peace-middle-east/13870-arab-countries.html", 
  "breadcrumbs": [
   "Peace in the Middle East"
  ], 
  "id_number": 13870, 
  "discussion_files": [
   [
    "12962.html", 
    "http://www.4forums.com/political/peace-middle-east/13870-arab-countries-print.html"
   ]
  ], 
  "identifier": 13870
 }
]