[
 [
  [
   391020, 
   null, 
   "Esdraelon", 
   "Lawrence Livermore National Laboratory in California has now identified with certainty the heaviest element known to science.\n \n The new element, Pelosium (PL), has one neutron, 25 assistant neutrons, 88 deputy neutrons, and 198 assistant deputy neutrons, giving it an atomic mass of 312.\n \n These 312 particles are held together by forces called XXXXXX (severely mentally challenged), which are surrounded by vast quantities of lepton-like particles called peons.\n \n Pelosium is inert, and has no charge and no magnetism. Nevertheless, it can be detected because it impedes every reaction with which it comes into contact. A tiny amount of Pelosium can cause a reaction that would normally take less than a second, to take from 4 days to 4 years to complete.\n \n Pelosium has a normal half-life of 2 years. It does not decay, but instead undergoes a biennial reorganization in which a portion of the assistant neutrons and deputy neutrons exchange places.\n \n Pelosium mass will increase over time, since each reorganization will promote many XXXXXX (severely mentally challenged)to become isodopes.\n \n This characteristic of XXXXX promotion leads some scientists to believe that Pelosium is formed whenever XXXXXX reach a critical concentration. This hypothetical quantity is referred to as critical morass.\n \n When catalyzed with money, Pelosium becomes Senatorium, an element that radiates just as much energy as Pelosium since it has half as many peons but twice as many XXXXXX(severely mentally challenged).\n \n \n For the 'XXXXXX' just insert your favorite.", 
   {
    "post_info": {
     "post_title": "New Chemical Element Discovered"
    }
   }, 
   null, 
   null, 
   1266505200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New Chemical Element Discovered", 
  "url": "http://www.4forums.com/political/politics-debates/13910-new-chemical-element-discovered.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 13910, 
  "discussion_files": [
   [
    "31591.html", 
    "http://www.4forums.com/political/politics-debates/13910-new-chemical-element-discovered-print.html"
   ]
  ], 
  "identifier": 13910
 }
]