[
 [
  [
   391223, 
   null, 
   "Sandycane", 
   "Mr Stack allegedly flew his plane into an IRS building in Austin, TX yesterday.\n Following is a copy of his farewell letter...\n In your eyes, after reading the letter allegedly written by him, do you think he is a nutjob, a hero or something else?\n \n Suicide Letter by Joe Stack, Austin TX 2010\n \n If you&#8217;re reading this, you&#8217;re no doubt asking yourself, &#8220;Why did this have to happen?&#8221; The simple truth is that it is complicated and has been coming for a long time. The writing process, started many months ago, was intended to be therapy in the face of the looming realization that there isn&#8217;t enough therapy in the world that can fix what is really broken. Needless to say, this rant could fill volumes with example after example if I would let it. I find the process of writing it frustrating, tedious, and probably pointless&#8230; especially given my gross inability to gracefully articulate my thoughts in light of the storm raging in my head. Exactly what is therapeutic about that I&#8217;m not sure, but desperate times call for desperate measures.\n \n We are all taught as children that without laws there would be no society, only anarchy. Sadly, starting at early ages we in this country have been brainwashed to believe that, in return for our dedication and service, our government stands for justice for all. We are further brainwashed to believe that there is freedom in this place, and that we should be ready to lay our lives down for the noble principals represented by its founding fathers. Remember? One of these was &#8220;no taxation without representation&#8221;. I have spent the total years of my adulthood unlearning that XXXX from only a few years of my childhood. These days anyone who really stands up for that principal is promptly labeled a &#8220;crackpot&#8221;, traitor and worse.\n \n While very few working people would say they haven&#8217;t had their fair share of taxes (as can I), in my lifetime I can say with a great degree of certainty that there has never been a politician cast a vote on any matter with the likes of me or my interests in mind. Nor, for that matter, are they the least bit interested in me or anything I have to say.\n \n Why is it that a handful of thugs and plunderers can commit unthinkable atrocities (and in the case of the GM executives, for scores of years) and when it&#8217;s time for their gravy train to crash under the weight of their gluttony and overwhelming stupidity, the force of the full federal government has no difficulty coming to their aid within days if not hours? Yet at the same time, the joke we call the American medical system, including the drug and insurance companies, are murdering tens of thousands of people a year and stealing from the corpses and victims they cripple, and this country&#8217;s leaders don&#8217;t see this as important as bailing out a few of their vile, rich cronies. Yet, the political &#8220;representatives&#8221; (thieves, liars, and self-serving scumbags is far more accurate) have endless time to sit around for year after year and debate the state of the &#8220;terrible health care problem&#8221;. It&#8217;s clear they see no crisis as long as the dead people don&#8217;t get in the way of their corporate profits rolling in.\n \n And justice? You&#8217;ve got to be kidding!\n \n How can any rational individual explain that white elephant conundrum in the middle of our tax system and, indeed, our entire legal system? Here we have a system that is, by far, too complicated for the brightest of the master scholars to understand. Yet, it mercilessly &#8220;holds accountable&#8221; its victims, claiming that they&#8217;re responsible for fully complying with laws not even the experts understand. The law &#8220;requires&#8221; a signature on the bottom of a tax filing; yet no one can say truthfully that they understand what they are signing; if that&#8217;s not &#8220;duress&#8221; than what is. If this is not the measure of a totalitarian regime, nothing is.\n \n How did I get here? \n \n My introduction to the real American nightmare starts back in the early &#8216;80s. Unfortunately after more than 16 years of school, somewhere along the line I picked up the absurd, pompous notion that I could read and understand plain English. Some friends introduced me to a group of people who were having &#8216;tax code&#8217; readings and discussions. In particular, zeroed in on a section relating to the wonderful &#8220;exemptions&#8221; that make institutions like the vulgar, corrupt Catholic Church so incredibly wealthy. We carefully studied the law (with the help of some of the &#8220;best&#8221;, high-paid, experienced tax lawyers in the business), and then began to do exactly what the &#8220;big boys&#8221; were doing (except that we weren&#8217;t steeling from our congregation or lying to the government about our massive profits in the name of God). We took a great deal of care to make it all visible, following all of the rules, exactly the way the law said it was to be done.\n \n The intent of this exercise and our efforts was to bring about a much-needed re-evaluation of the laws that allow the monsters of organized religion to make such a mockery of people who earn an honest living. However, this is where I learned that there are two &#8220;interpretations&#8221; for every law; one for the very rich, and one for the rest of us&#8230; Oh, and the monsters are the very ones making and enforcing the laws; the inquisition is still alive and well today in this country.\n \n That little lesson in patriotism cost me $40,000+, 10 years of my life, and set my retirement plans back to 0. It made me realize for the first time that I live in a country with an ideology that is based on a total and complete lie. It also made me realize, not only how naive I had been, but also the incredible stupidity of the American public; that they buy, hook, line, and sinker, the XXXX about their &#8220;freedom&#8221;&#8230; and that they continue to do so with eyes closed in the face of overwhelming evidence and all that keeps happening in front of them.\n \n Before even having to make a shaky recovery from the sting of the first lesson on what justice really means in this country (around 1984 after making my way through engineering school and still another five years of &#8220;paying my dues&#8221;), I felt I finally had to take a chance of launching my dream of becoming an independent engineer.\n \n On the subjects of engineers and dreams of independence, I should digress somewhat to say that I&#8217;m sure that I inherited the fascination for creative problem solving from my father. I realized this at a very young age.\n \n The significance of independence, however, came much later during my early years of college; at the age of 18 or 19 when I was living on my own as student in an apartment in Harrisburg, Pennsylvania. My neighbor was an elderly retired woman (80+ seemed ancient to me at that age) who was the widowed wife of a retired steel worker. Her husband had worked all his life in the steel mills of central Pennsylvania with promises from big business and the union that, for his 30 years of service, he would have a pension and medical care to look forward to in his retirement. Instead he was one of the thousands who got nothing because the incompetent mill management and corrupt union (not to mention the government) raided their pension funds and stole their retirement. All she had was social security to live on.\n \n In retrospect, the situation was laughable because here I was living on peanut butter and bread (or Ritz crackers when I could afford to splurge) for months at a time. When I got to know this poor figure and heard her story I felt worse for her plight than for my own (I, after all, I thought I had everything to in front of me). I was genuinely appalled at one point, as we exchanged stories and commiserated with each other over our situations, when she in her grandmotherly fashion tried to convince me that I would be &#8220;healthier&#8221; eating cat food (like her) rather than trying to get all my substance from peanut butter and bread. I couldn&#8217;t quite go there, but the impression was made. I decided that I didn&#8217;t trust big business to take care of me, and that I would take responsibility for my own future and myself.\n \n Return to the early &#8216;80s, and here I was off to a terrifying start as a &#8216;wet-behind-the-ears&#8217; contract software engineer... and two years later, thanks to the fine backroom, midnight effort by the sleazy executives of Arthur Andersen (the very same folks who later brought us Enron and other such calamities) and an equally sleazy New York Senator (Patrick Moynihan), we saw the passage of 1986 tax reform act with its section 1706.\n \n For you who are unfamiliar, here is the core text of the IRS Section 1706, defining the treatment of workers (such as contract engineers) for tax purposes. Visit this link for a conference committee report (links deleted per forum rules) regarding the intended interpretation of Section 1706 and the relevant parts of Section 530, as amended. For information on how these laws affect technical services workers and their clients, read our discussion here (link deleted per forum rules). \n \n SEC. 1706. TREATMENT OF CERTAIN TECHNICAL PERSONNEL.\n \n (a) IN GENERAL - Section 530 of the Revenue Act of 1978 is amended by adding at the end thereof the following new subsection:\n \n (d) EXCEPTION. - This section shall not apply in the case of an individual who pursuant to an arrangement between the taxpayer and another person, provides services for such other person as an engineer, designer, drafter, computer programmer, systems analyst, or other similarly skilled worker engaged in a similar line of work.\n \n (b) EFFECTIVE DATE. - The amendment made by this section shall apply to remuneration paid and services rendered after December 31, 1986.\n \n Note: \n \n · \"another person\" is the client in the traditional job-shop relationship.\n \n · \"taxpayer\" is the recruiter, broker, agency, or job shop.\n \n · \"individual\", \"employee\", or \"worker\" is you.\n \n Admittedly, you need to read the treatment to understand what it is saying but it&#8217;s not very complicated. The bottom line is that they may as well have put my name right in the text of section (d). Moreover, they could only have been more blunt if they would have came out and directly declared me a criminal and non-citizen slave. Twenty years later, I still can&#8217;t believe my eyes.\n \n During 1987, I spent close to $5000 of my &#8216;pocket change&#8217;, and at least 1000 hours of my time writing, printing, and mailing to any senator, congressman, governor, or slug that might listen; none did, and they universally treated me as if I was wasting their time. I spent countless hours on the L.A. freeways driving to meetings and any and all of the disorganized professional groups who were attempting to mount a campaign against this atrocity. This, only to discover that our efforts were being easily derailed by a few moles from the brokers who were just beginning to enjoy the windfall from the new declaration of their &#8220;freedom&#8221;. Oh, and don&#8217;t forget, for all of the time I was spending on this, I was loosing income that I couldn&#8217;t bill clients.\n \n After months of struggling it had clearly gotten to be a futile exercise. The best we could get for all of our trouble is a pronouncement from an IRS mouthpiece that they weren&#8217;t going to enforce that provision (read harass engineers and scientists). This immediately proved to be a lie, and the mere existence of the regulation began to have its impact on my bottom line; this, of course, was the intended effect.\n \n Again, rewind my retirement plans back to 0 and shift them into idle. If I had any sense, I clearly should have left abandoned engineering and never looked back.\n \n Instead I got busy working 100-hour workweeks. Then came the L.A. depression of the early 1990s. Our leaders decided that they didn&#8217;t need the all of those extra Air Force bases they had in Southern California, so they were closed; just like that. The result was economic devastation in the region that rivaled the widely publicized Texas S&L fiasco. However, because the government caused it, no one gave a XXXX about all of the young families who lost their homes or street after street of boarded up houses abandoned to the wealthy loan companies who received government funds to &#8220;shore up&#8221; their windfall. Again, I lost my retirement.\n \n Years later, after weathering a divorce and the constant struggle trying to build some momentum with my business, I find myself once again beginning to finally pick up some speed. Then came the .COM bust and the 911 nightmare. Our leaders decided that all aircraft were grounded for what seemed like an eternity; and long after that, &#8216;special&#8217; facilities like San Francisco were on security alert for months. This made access to my customers prohibitively expensive. Ironically, after what they had done the Government came to the aid of the airlines with billions of our tax dollars &#8230; as usual they left me to rot and die while they bailed out their rich, incompetent cronies WITH MY MONEY! After these events, there went my business but not quite yet all of my retirement and savings.\n \n By this time, I&#8217;m thinking that it might be good for a change. Bye to California, I&#8217;ll try Austin for a while. So I moved, only to find out that this is a place with a highly inflated sense of self-importance and where damn little real engineering work is done. I&#8217;ve never experienced such a hard time finding work. The rates are 1/3 of what I was earning before the crash, because pay rates here are fixed by the three or four large companies in the area who are in collusion to drive down prices and wages&#8230; and this happens because the justice department is all on the take and doesn&#8217;t give a XXXX about serving anyone or anything but themselves and their rich buddies.\n \n To survive, I was forced to cannibalize my savings and retirement, the last of which was a small IRA. This came in a year with mammoth expenses and not a single dollar of income. I filed no return that year thinking that because I didn&#8217;t have any income there was no need. The sleazy government decided that they disagreed. But they didn&#8217;t notify me in time for me to launch a legal objection so when I attempted to get a protest filed with the court I was told I was no longer entitled to due process because the time to file ran out. Bend over for another $10,000 helping of justice.\n \n So now we come to the present. After my experience with the CPA world, following the business crash I swore that I&#8217;d never enter another accountant&#8217;s office again. But here I am with a new marriage and a boatload of undocumented income, not to mention an expensive new business asset, a piano, which I had no idea how to handle. After considerable thought I decided that it would be irresponsible NOT to get professional help; a very big mistake.\n \n When we received the forms back I was very optimistic that they were in order. I had taken all of the years information to Bill Ross, and he came back with results very similar to what I was expecting. Except that he had neglected to include the contents of Sheryl&#8217;s unreported income; $12,700 worth of it. To make matters worse, Ross knew all along this was missing and I didn&#8217;t have a clue until he pointed it out in the middle of the audit. By that time it had become brutally evident that he was representing himself and not me.\n \n This left me stuck in the middle of this disaster trying to defend transactions that have no relationship to anything tax-related (at least the tax-related transactions were poorly documented). Things I never knew anything about and things my wife had no clue would ever matter to anyone. The end result is&#8230; well, just look around.\n \n I remember reading about the stock market crash before the &#8220;great&#8221; depression and how there were wealthy bankers and businessmen jumping out of windows when they realized they screwed up and lost everything. Isn&#8217;t it ironic how far we&#8217;ve come in 60 years in this country that they now know how to fix that little economic problem; they just steal from the middle class (who doesn&#8217;t have any say in it, elections are a joke) to cover their asses and it&#8217;s &#8220;business-as-usual&#8221;. Now when the wealthy XXXX up, the poor get to die for the mistakes&#8230; isn&#8217;t that a clever, tidy solution.\n \n As government agencies go, the FAA is often justifiably referred to as a tombstone agency, though they are hardly alone. The recent presidential puppet GW Bush and his cronies in their eight years certainly reinforced for all of us that this criticism rings equally true for all of the government. Nothing changes unless there is a body count (unless it is in the interest of the wealthy sows at the government trough). In a government full of hypocrites from top to bottom, life is as cheap as their lies and their self-serving laws.\n I know I&#8217;m hardly the first one to decide I have had all I can stand. It has always been a myth that people have stopped dying for their freedom in this country, and it isn&#8217;t limited to the blacks, and poor immigrants. I know there have been countless before me and there are sure to be as many after. But I also know that by not adding my body to the count, I insure nothing will change. I choose to not keep looking over my shoulder at &#8220;big brother&#8221; while he strips my carcass, I choose not to ignore what is going on all around me, I choose not to pretend that business as usual won&#8217;t continue; I have just had enough. \n I can only hope that the numbers quickly get too big to be white washed and ignored that the American zombies wake up and revolt; it will take nothing less. I would only hope that by striking a nerve that stimulates the inevitable double standard, knee-jerk government reaction that results in more stupid draconian restrictions people wake up and begin to see the pompous political thugs and their mindless minions for what they are. Sadly, though I spent my entire life trying to believe it wasn&#8217;t so, but violence not only is the answer, it is the only answer. The cruel joke is that the really big chunks of XXXX at the top have known this all along and have been laughing, at and using this awareness against, fools like me all along.\n I saw it written once that the definition of insanity is repeating the same process over and over and expecting the outcome to suddenly be different. I am finally ready to stop this insanity. Well, Mr. Big Brother IRS man, let&#8217;s try something different; take my pound of flesh and sleep well.\n \n The communist creed: From each according to his ability, to each according to his need.\n \n The capitalist creed: From each according to his gullibility, to each according to his greed.\n Joe Stack (1956-2010)\n \n 02/18/2010\n \n Note: I can't post the required link because I have less than 10 posts. You can find a news article on any search of 'Joe Stack'.", 
   {
    "post_info": {
     "post_title": "Joe A. Stack"
    }
   }, 
   null, 
   null, 
   1266606960.0
  ], 
  [
   391229, 
   null, 
   "jazyjason", 
   "I just think he is another desperate American that is sadly a victim of this shattered economy. I heard an equally horrifying story where a local man here in So Cal murdered his entire family then killed himself because they defaulted on the mortgage and was going to lose the house....\n \n That being said, his actions are by no means justified, and no matter how deep his problems were gave him no right to take the life of another human being....", 
   {}, 
   391223, 
   null, 
   1266607980.0
  ], 
  [
   391244, 
   null, 
   "Sandycane", 
   "Knowing that The Powers That Be read message boards and blogs, I hesitate to post how I feel about what this guy did...if he actually did it.\n \n Some forum posts on another site suggest that he (his situation) may have been a tool used by the government to stir up trouble and that the letter wasn't even written by him but is a psy-ops job.\n \n That is believable, if you believe that the government is looking for an excuse to stamp out more American Freedoms under the guise of 'domestic terrorism'.", 
   {}, 
   391229, 
   null, 
   1266610560.0
  ], 
  [
   391249, 
   null, 
   "jazyjason", 
   "Knowing that The Powers That Be read message boards and blogs, I hesitate to post how I feel about what this guy did...if he actually did it.\n \n Some forum posts on another site suggest that he (his situation) may have been a tool used by the government to stir up trouble and that the letter wasn't even written by him but is a psy-ops job.\n \n That is believable, if you believe that the government is looking for an excuse to stamp out more American Freedoms under the guise of 'domestic terrorism'.\n\n \n Another nutty conspiracy theory...... Sigh.... Not even what two days and their already crawling from under their rocks with tin foil on their heads....", 
   {}, 
   391244, 
   null, 
   1266612000.0
  ], 
  [
   391271, 
   null, 
   "Penfold", 
   "Another nutty conspiracy theory...... Sigh.... Not even what two days and their already crawling from under their rocks with tin foil on their heads....\n\n \n Just don't let them know that the tinfoil actually focuses the mind-rays....emoticon_xgood", 
   {}, 
   391249, 
   null, 
   1266617100.0
  ], 
  [
   391310, 
   null, 
   "jazyjason", 
   "Just don't let them know that the tinfoil actually focuses the mind-rays....emoticon_xgood\n\n \n I just thought it was another trend actually. You know something conjured up by Bruno.....emoticon_xclown", 
   {}, 
   391271, 
   null, 
   1266631500.0
  ], 
  [
   391378, 
   null, 
   "snakespit", 
   "First off Sandycane...get a grip.\n \n Look, what the guy did was simply a deplorable action by a man who obviously had a deep seated hatred against not only the IRS, but the US government as a whole. Does anyone want to know why?\n \n His suicide manifesto is rather telling, and I am willing to bet that much of it is true simply by reading it. He obviously had a point to make with his action...one that we should all carefully consider and attempt to examine thoroughly. There is cetainly an element of truth to the general point the man was trying to make. However, killing and injuring innocent people by driving an aircraft into them is not the solution. Violence is not the only way. It is just the easiest and makes the largest impact. Real change is made by changing minds and hearts willingly, not by threat of force.", 
   {}, 
   391310, 
   null, 
   1266648060.0
  ], 
  [
   391385, 
   null, 
   "NATO 556", 
   "Another nutty conspiracy theory...... Sigh.... Not even what two days and their already crawling from under their rocks with tin foil on their heads....\n\n \n We've seen cases of the police planting drugs or smashing tail lights to justify an arrest of motorists.\n \n Why shouldn't we believe that the government might decide to operate in a similar manner?", 
   {}, 
   391249, 
   null, 
   1266649440.0
  ], 
  [
   391397, 
   null, 
   "snakespit", 
   "We've seen cases of the police planting drugs or smashing tail lights to justify an arrest of motorists.\n \n Why shouldn't we believe that the government might decide to operate in a similar manner?\n\n \n Have any evidence pointing to a government conspiracy? Thought not.\n \n Sometimes a cigar is just a cigar.", 
   {}, 
   391385, 
   null, 
   1266651360.0
  ], 
  [
   391398, 
   null, 
   "NATO 556", 
   "Have any evidence pointing to a government conspiracy? Thought not.\n\n \n How about the Tuskegee Experiment? During that period of time the government let 400 sick people die just to see what would happen. That's an example of a conspiracy right there. Why choose to believe that they're anymore honest now?\n \n \nSometimes a cigar is just a cigar.\n\n \n And sometimes a person is just an ostrich.", 
   {}, 
   391397, 
   null, 
   1266651660.0
  ], 
  [
   391428, 
   null, 
   "Penfold", 
   " ... And sometimes a person is just an ostrich.\n\n \n \n To each his own, but you should have your head in the sand, not your rectum. The man went postal with his plane instead of a gun, hoping to take more tax-men with him.", 
   {}, 
   391398, 
   null, 
   1266680280.0
  ], 
  [
   391431, 
   null, 
   "snakespit", 
   "How about the Tuskegee Experiment? During that period of time the government let 400 sick people die just to see what would happen. That's an example of a conspiracy right there. Why choose to believe that they're anymore honest now?\n\n I meant in this case. Sure, there are examples of government conspiracy in our past, but we should not just automatically assume everything is a conspiracy right out of the gate. If you have any actual evidence pointing to a government conspiracy is THIS case, bring it on. Otherwise, you are just talking out of you posterior.", 
   {}, 
   391398, 
   null, 
   1266681360.0
  ], 
  [
   391439, 
   null, 
   "Archangel", 
   "Mr Stack allegedly flew his plane into an IRS building in Austin, TX yesterday.\n Following is a copy of his farewell letter...\n In your eyes, after reading the letter allegedly written by him, do you think he is a nutjob, a hero or something else?\n \n Suicide Letter by Joe Stack, Austin TX 2010\n \n If you're reading this, you're no doubt asking yourself, \"Why did this have to happen?\" The simple truth is that it is complicated and has been coming for a long time. The writing process, started many months ago, was intended to be therapy in the face of the looming realization that there isn't enough therapy in the world that can fix what is really broken. Needless to say, this rant could fill volumes with example after example if I would let it. I find the process of writing it frustrating, tedious, and probably pointless... especially given my gross inability to gracefully articulate my thoughts in light of the storm raging in my head. Exactly what is therapeutic about that I'm not sure, but desperate times call for desperate measures.\n \n We are all taught as children that without laws there would be no society, only anarchy. Sadly, starting at early ages we in this country have been brainwashed to believe that, in return for our dedication and service, our government stands for justice for all. We are further brainwashed to believe that there is freedom in this place, and that we should be ready to lay our lives down for the noble principals represented by its founding fathers. Remember? One of these was \"no taxation without representation\". I have spent the total years of my adulthood unlearning that XXXX from only a few years of my childhood. These days anyone who really stands up for that principal is promptly labeled a \"crackpot\", traitor and worse.\n \n While very few working people would say they haven't had their fair share of taxes (as can I), in my lifetime I can say with a great degree of certainty that there has never been a politician cast a vote on any matter with the likes of me or my interests in mind. Nor, for that matter, are they the least bit interested in me or anything I have to say.\n \n Why is it that a handful of thugs and plunderers can commit unthinkable atrocities (and in the case of the GM executives, for scores of years) and when it's time for their gravy train to crash under the weight of their gluttony and overwhelming stupidity, the force of the full federal government has no difficulty coming to their aid within days if not hours? Yet at the same time, the joke we call the American medical system, including the drug and insurance companies, are murdering tens of thousands of people a year and stealing from the corpses and victims they cripple, and this country's leaders don't see this as important as bailing out a few of their vile, rich cronies. Yet, the political \"representatives\" (thieves, liars, and self-serving scumbags is far more accurate) have endless time to sit around for year after year and debate the state of the \"terrible health care problem\". It's clear they see no crisis as long as the dead people don't get in the way of their corporate profits rolling in.\n \n And justice? You've got to be kidding!\n \n How can any rational individual explain that white elephant conundrum in the middle of our tax system and, indeed, our entire legal system? Here we have a system that is, by far, too complicated for the brightest of the master scholars to understand. Yet, it mercilessly \"holds accountable\" its victims, claiming that they're responsible for fully complying with laws not even the experts understand. The law \"requires\" a signature on the bottom of a tax filing; yet no one can say truthfully that they understand what they are signing; if that's not \"duress\" than what is. If this is not the measure of a totalitarian regime, nothing is.\n \n How did I get here? \n \n My introduction to the real American nightmare starts back in the early '80s. Unfortunately after more than 16 years of school, somewhere along the line I picked up the absurd, pompous notion that I could read and understand plain English. Some friends introduced me to a group of people who were having 'tax code' readings and discussions. In particular, zeroed in on a section relating to the wonderful \"exemptions\" that make institutions like the vulgar, corrupt Catholic Church so incredibly wealthy. We carefully studied the law (with the help of some of the \"best\", high-paid, experienced tax lawyers in the business), and then began to do exactly what the \"big boys\" were doing (except that we weren't steeling from our congregation or lying to the government about our massive profits in the name of God). We took a great deal of care to make it all visible, following all of the rules, exactly the way the law said it was to be done.\n \n The intent of this exercise and our efforts was to bring about a much-needed re-evaluation of the laws that allow the monsters of organized religion to make such a mockery of people who earn an honest living. However, this is where I learned that there are two \"interpretations\" for every law; one for the very rich, and one for the rest of us... Oh, and the monsters are the very ones making and enforcing the laws; the inquisition is still alive and well today in this country.\n \n That little lesson in patriotism cost me $40,000+, 10 years of my life, and set my retirement plans back to 0. It made me realize for the first time that I live in a country with an ideology that is based on a total and complete lie. It also made me realize, not only how naive I had been, but also the incredible stupidity of the American public; that they buy, hook, line, and sinker, the XXXX about their \"freedom\"... and that they continue to do so with eyes closed in the face of overwhelming evidence and all that keeps happening in front of them.\n \n Before even having to make a shaky recovery from the sting of the first lesson on what justice really means in this country (around 1984 after making my way through engineering school and still another five years of \"paying my dues\"), I felt I finally had to take a chance of launching my dream of becoming an independent engineer.\n \n On the subjects of engineers and dreams of independence, I should digress somewhat to say that I'm sure that I inherited the fascination for creative problem solving from my father. I realized this at a very young age.\n \n The significance of independence, however, came much later during my early years of college; at the age of 18 or 19 when I was living on my own as student in an apartment in Harrisburg, Pennsylvania. My neighbor was an elderly retired woman (80+ seemed ancient to me at that age) who was the widowed wife of a retired steel worker. Her husband had worked all his life in the steel mills of central Pennsylvania with promises from big business and the union that, for his 30 years of service, he would have a pension and medical care to look forward to in his retirement. Instead he was one of the thousands who got nothing because the incompetent mill management and corrupt union (not to mention the government) raided their pension funds and stole their retirement. All she had was social security to live on.\n \n In retrospect, the situation was laughable because here I was living on peanut butter and bread (or Ritz crackers when I could afford to splurge) for months at a time. When I got to know this poor figure and heard her story I felt worse for her plight than for my own (I, after all, I thought I had everything to in front of me). I was genuinely appalled at one point, as we exchanged stories and commiserated with each other over our situations, when she in her grandmotherly fashion tried to convince me that I would be \"healthier\" eating cat food (like her) rather than trying to get all my substance from peanut butter and bread. I couldn't quite go there, but the impression was made. I decided that I didn't trust big business to take care of me, and that I would take responsibility for my own future and myself.\n \n Return to the early '80s, and here I was off to a terrifying start as a 'wet-behind-the-ears' contract software engineer... and two years later, thanks to the fine backroom, midnight effort by the sleazy executives of Arthur Andersen (the very same folks who later brought us Enron and other such calamities) and an equally sleazy New York Senator (Patrick Moynihan), we saw the passage of 1986 tax reform act with its section 1706.\n \n For you who are unfamiliar, here is the core text of the IRS Section 1706, defining the treatment of workers (such as contract engineers) for tax purposes. Visit this link for a conference committee report (links deleted per forum rules) regarding the intended interpretation of Section 1706 and the relevant parts of Section 530, as amended. For information on how these laws affect technical services workers and their clients, read our discussion here (link deleted per forum rules). \n \n SEC. 1706. TREATMENT OF CERTAIN TECHNICAL PERSONNEL.\n \n (a) IN GENERAL - Section 530 of the Revenue Act of 1978 is amended by adding at the end thereof the following new subsection:\n \n (d) EXCEPTION. - This section shall not apply in the case of an individual who pursuant to an arrangement between the taxpayer and another person, provides services for such other person as an engineer, designer, drafter, computer programmer, systems analyst, or other similarly skilled worker engaged in a similar line of work.\n \n (b) EFFECTIVE DATE. - The amendment made by this section shall apply to remuneration paid and services rendered after December 31, 1986.\n \n Note: \n \n · \"another person\" is the client in the traditional job-shop relationship.\n \n · \"taxpayer\" is the recruiter, broker, agency, or job shop.\n \n · \"individual\", \"employee\", or \"worker\" is you.\n \n Admittedly, you need to read the treatment to understand what it is saying but it's not very complicated. The bottom line is that they may as well have put my name right in the text of section (d). Moreover, they could only have been more blunt if they would have came out and directly declared me a criminal and non-citizen slave. Twenty years later, I still can't believe my eyes.\n \n During 1987, I spent close to $5000 of my 'pocket change', and at least 1000 hours of my time writing, printing, and mailing to any senator, congressman, governor, or slug that might listen; none did, and they universally treated me as if I was wasting their time. I spent countless hours on the L.A. freeways driving to meetings and any and all of the disorganized professional groups who were attempting to mount a campaign against this atrocity. This, only to discover that our efforts were being easily derailed by a few moles from the brokers who were just beginning to enjoy the windfall from the new declaration of their \"freedom\". Oh, and don't forget, for all of the time I was spending on this, I was loosing income that I couldn't bill clients.\n \n After months of struggling it had clearly gotten to be a futile exercise. The best we could get for all of our trouble is a pronouncement from an IRS mouthpiece that they weren't going to enforce that provision (read harass engineers and scientists). This immediately proved to be a lie, and the mere existence of the regulation began to have its impact on my bottom line; this, of course, was the intended effect.\n \n Again, rewind my retirement plans back to 0 and shift them into idle. If I had any sense, I clearly should have left abandoned engineering and never looked back.\n \n Instead I got busy working 100-hour workweeks. Then came the L.A. depression of the early 1990s. Our leaders decided that they didn't need the all of those extra Air Force bases they had in Southern California, so they were closed; just like that. The result was economic devastation in the region that rivaled the widely publicized Texas S&L fiasco. However, because the government caused it, no one gave a XXXX about all of the young families who lost their homes or street after street of boarded up houses abandoned to the wealthy loan companies who received government funds to \"shore up\" their windfall. Again, I lost my retirement.\n \n Years later, after weathering a divorce and the constant struggle trying to build some momentum with my business, I find myself once again beginning to finally pick up some speed. Then came the .COM bust and the 911 nightmare. Our leaders decided that all aircraft were grounded for what seemed like an eternity; and long after that, 'special' facilities like San Francisco were on security alert for months. This made access to my customers prohibitively expensive. Ironically, after what they had done the Government came to the aid of the airlines with billions of our tax dollars ... as usual they left me to rot and die while they bailed out their rich, incompetent cronies WITH MY MONEY! After these events, there went my business but not quite yet all of my retirement and savings.\n \n By this time, I'm thinking that it might be good for a change. Bye to California, I'll try Austin for a while. So I moved, only to find out that this is a place with a highly inflated sense of self-importance and where damn little real engineering work is done. I've never experienced such a hard time finding work. The rates are 1/3 of what I was earning before the crash, because pay rates here are fixed by the three or four large companies in the area who are in collusion to drive down prices and wages... and this happens because the justice department is all on the take and doesn't give a XXXX about serving anyone or anything but themselves and their rich buddies.\n \n To survive, I was forced to cannibalize my savings and retirement, the last of which was a small IRA. This came in a year with mammoth expenses and not a single dollar of income. I filed no return that year thinking that because I didn't have any income there was no need. The sleazy government decided that they disagreed. But they didn't notify me in time for me to launch a legal objection so when I attempted to get a protest filed with the court I was told I was no longer entitled to due process because the time to file ran out. Bend over for another $10,000 helping of justice.\n \n So now we come to the present. After my experience with the CPA world, following the business crash I swore that I'd never enter another accountant's office again. But here I am with a new marriage and a boatload of undocumented income, not to mention an expensive new business asset, a piano, which I had no idea how to handle. After considerable thought I decided that it would be irresponsible NOT to get professional help; a very big mistake.\n \n When we received the forms back I was very optimistic that they were in order. I had taken all of the years information to Bill Ross, and he came back with results very similar to what I was expecting. Except that he had neglected to include the contents of Sheryl's unreported income; $12,700 worth of it. To make matters worse, Ross knew all along this was missing and I didn't have a clue until he pointed it out in the middle of the audit. By that time it had become brutally evident that he was representing himself and not me.\n \n This left me stuck in the middle of this disaster trying to defend transactions that have no relationship to anything tax-related (at least the tax-related transactions were poorly documented). Things I never knew anything about and things my wife had no clue would ever matter to anyone. The end result is... well, just look around.\n \n I remember reading about the stock market crash before the \"great\" depression and how there were wealthy bankers and businessmen jumping out of windows when they realized they screwed up and lost everything. Isn't it ironic how far we've come in 60 years in this country that they now know how to fix that little economic problem; they just steal from the middle class (who doesn't have any say in it, elections are a joke) to cover their asses and it's \"business-as-usual\". Now when the wealthy XXXX up, the poor get to die for the mistakes... isn't that a clever, tidy solution.\n \n As government agencies go, the FAA is often justifiably referred to as a tombstone agency, though they are hardly alone. The recent presidential puppet GW Bush and his cronies in their eight years certainly reinforced for all of us that this criticism rings equally true for all of the government. Nothing changes unless there is a body count (unless it is in the interest of the wealthy sows at the government trough). In a government full of hypocrites from top to bottom, life is as cheap as their lies and their self-serving laws.\n I know I'm hardly the first one to decide I have had all I can stand. It has always been a myth that people have stopped dying for their freedom in this country, and it isn't limited to the blacks, and poor immigrants. I know there have been countless before me and there are sure to be as many after. But I also know that by not adding my body to the count, I insure nothing will change. I choose to not keep looking over my shoulder at \"big brother\" while he strips my carcass, I choose not to ignore what is going on all around me, I choose not to pretend that business as usual won't continue; I have just had enough. \n I can only hope that the numbers quickly get too big to be white washed and ignored that the American zombies wake up and revolt; it will take nothing less. I would only hope that by striking a nerve that stimulates the inevitable double standard, knee-jerk government reaction that results in more stupid draconian restrictions people wake up and begin to see the pompous political thugs and their mindless minions for what they are. Sadly, though I spent my entire life trying to believe it wasn't so, but violence not only is the answer, it is the only answer. The cruel joke is that the really big chunks of XXXX at the top have known this all along and have been laughing, at and using this awareness against, fools like me all along.\n I saw it written once that the definition of insanity is repeating the same process over and over and expecting the outcome to suddenly be different. I am finally ready to stop this insanity. Well, Mr. Big Brother IRS man, let's try something different; take my pound of flesh and sleep well.\n \n The communist creed: From each according to his ability, to each according to his need.\n \n The capitalist creed: From each according to his gullibility, to each according to his greed.\n Joe Stack (1956-2010)\n \n 02/18/2010\n \n Note: I can't post the required link because I have less than 10 posts. You can find a news article on any search of 'Joe Stack'.\n\n \n You seem to have misread this guys manifesto and missed the crux of his message. If this was a Right Wing Rant as leftist media sources have inferred then it might be proper to imply that this current government had some plot to use this to spread fear about the Tea Party movement, ala conservatism. But all one must do is read this manifesto and you can see the anarchist/leftist leanings to it which this guy adopted as a result of his observations and interpretation of the system we live under. He speaks against Banks, insurance companies and big business in such a way that perfectly reflects what Obama represents in his attempts at a socialist takeover of the US economy. It appears to me that it just wasn't happening fast enough for him. \n \n It is also true that he criticized the actions of both political parties in his observations regarding a corrupt government, but his leanings appear to be leftist rather than right wing in their focus. Much like Ted Kaszinsky, the uni-bomber was painted as a Right wing fanatic by the liberals, but His manifesto was a complete left wing rant by any objective standard of measure.\n \n \nKnowing that The Powers That Be read message boards and blogs, I hesitate to post how I feel about what this guy did...if he actually did it.\n \n Some forum posts on another site suggest that he (his situation) may have been a tool used by the government to stir up trouble and that the letter wasn't even written by him but is a psy-ops job.\n \n That is believable, if you believe that the government is looking for an excuse to stamp out more American Freedoms under the guise of 'domestic terrorism'.\n", 
   {
    "unicode_changes_made": true
   }, 
   391244, 
   null, 
   1266684300.0
  ], 
  [
   391451, 
   null, 
   "snakespit", 
   "Archie:\n \n Anarchist/Leftist don't really go together. Anarchists don't want any government. Leftists want government to control everything. \n \n \n But really, it's funny hnow as soon as something like this happens, we run right back to the R vs. D argument. Grow up a little. When are people going to realize that our government is really just one party with 2 wings? We don't just need to change our politicians, we need to change how the government does business. Unfortunately, most Americans are too politically and mentally challenged to understand that all the politicians (both republicans and democrats) do is make us fight amongst ourselves so they can in turn take the vast majority of our money and split it up among a small minority of people. If you read right vs. left out of his manifesto, it's because you wanted to.", 
   {}, 
   391439, 
   null, 
   1266687780.0
  ], 
  [
   391456, 
   null, 
   "simone", 
   "The man's a fregging terrorist. End of story.", 
   {}, 
   391223, 
   null, 
   1266691080.0
  ], 
  [
   391493, 
   null, 
   "jazyjason", 
   "We've seen cases of the police planting drugs or smashing tail lights to justify an arrest of motorists.\n \n Why shouldn't we believe that the government might decide to operate in a similar manner?\n\n \n Oh I dunno why in the hell would you blow up the one agency that collects your revenue? Genius I tells ya Genius!!!!", 
   {}, 
   391385, 
   null, 
   1266710160.0
  ], 
  [
   391512, 
   null, 
   "BKS01", 
   "The man's a fregging terrorist. End of story.\n\n \n Well stated!!\n \n It is seldom that you and I agree and we have very different political views.\n \n But.....Your post shows that in the end, when tragedy of any form strikes we can agree.", 
   {
    "post_info": {
     "post_title": "Simone"
    }
   }, 
   391456, 
   null, 
   1266712860.0
  ], 
  [
   391516, 
   null, 
   "jazyjason", 
   "I just wanna know who's the jackass that actually voted that this nut is the beginning of an American Revolution? The Oklahoma City Bombing comes to mind in stark contrast....", 
   {}, 
   391512, 
   null, 
   1266713160.0
  ], 
  [
   391520, 
   null, 
   "BKS01", 
   "I just wanna know who's the jackass that actually voted that this nut is the beginning of an American Revolution? The Oklahoma City Bombing comes to mind in stark contrast....\n\n \n It proves Ron White's theory!!", 
   {}, 
   391516, 
   null, 
   1266713760.0
  ], 
  [
   391527, 
   null, 
   "NATO 556", 
   "Did you guys even read the letter? Or are you just jumping on the \"I hate all conservatives\" bandwagon because it's convenient for you?", 
   {}, 
   391520, 
   null, 
   1266716460.0
  ], 
  [
   391654, 
   null, 
   "Sandycane", 
   "Archie:\n \n Anarchist/Leftist don't really go together. Anarchists don't want any government. Leftists want government to control everything. \n \n \n But really, it's funny how as soon as something like this happens, we run right back to the R vs. D argument. Grow up a little. When are people going to realize that our government is really just one party with 2 wings? We don't just need to change our politicians, we need to change how the government does business. Unfortunately, most Americans are too politically and mentally challenged to understand that all the politicians (both republicans and democrats) do is make us fight amongst ourselves so they can in turn take the vast majority of our money and split it up among a small minority of people. If you read right vs. left out of his manifesto, it's because you wanted to.\n\n \n 'We don't just need to change our politicians, we need to change how the government does business.'\n Absolutely.\n \n I don't know if Joe was a R or a D or, if he ever voted but, if you take his letter literally and don't try to read between the lines or guess what he was thinking, that he didn't say in the letter, it's obvious that he was severely ticked-off at the government.\n I also get the impression he wasn't a very good businessman which is mind-boggling because he comes across as a very intelligent person with some knowledge of tax law.\n \n What I don't understand and makes me lean towards some kind of 'conspiracy' is the fact that the letter was allowed to be posted on the internet the very day of the crash but, his web site was removed from the internet by the FBI. \"This website has been taken offline due to the sensitive nature of the events that transpired in Texas this morning and in compliance with a request from the FBI.\" \n I have to ask 'Why'? \n \n Was there contradicting evidence the FBI wanted to hide from the general public?\n How do we know that Joe actually wrote this letter?\n \n It is entirely possible that he didn't write it and that it was never on his web site.\n It is also possible that he was just ticked-off, decided to do some damage to the Austin IRS building and that was that.\n If this is the case, it's possible that the government decided to take this opportunity to stir up trouble among the masses - more liberal vs. republican vs. democrat vs. 'tea-baggers' (whatever they are) - more smoke to hide another government agenda to stamp out American liberties.\n \n I saw the most disturbing commercial last week on t.v. (I don't subscribe to t.v. but, watch it occasionally at my mother's home). It was a commercial for the 'benefits' of having On Star on your vehicle...supposedly to stop a car-jacker en-route. It showed a cop in hot pursuit of an SUV. The cop was talking to someone at On Star and then the vehicle was remotely disabled.\n Sure this is a great feature if your vehicle is stolen but, I would rather not have it than allow any form of the military, local or otherwise, to have the power to randomly and remotely disable any vehicle.\n If we had an honest and trustworthy government, I would say No Problemo but, we all know otherwise.\n \n Someone mentioned the Tuskegee experiments. That's just one. Others revolved around the Manhattan Project. \n \n I believe it is not only dangerous but, highly irresponsible to dismiss our government as above suspicion.\n \n 'Conspiracy Theories' are not theory if there are facts to back them up. In this case, I'm just wondering if there is more than meets the eye?", 
   {}, 
   391451, 
   null, 
   1266859260.0
  ], 
  [
   391662, 
   null, 
   "JPSartre12", 
   "The guy was a self-absorbed egotistical nerd that tried to use a tax loophole along with his nerd buddies in the 80's to avoid paying taxes and got burned.\n He, then, developed a strong anti-government mantra and used it to blame all of his own personal shortcomings. \n He gambled on a tax loophole ....and lost.\n He gambled on .com stocks .....and lost.\n He gambled moving to Texas without having the faintest idea of the difference in pay scale between Kalifornia and Texas.....and lost.\n \n And all of these lost gambles of his were projected onto Uncle Sam. The eventual outcome was his own destruction because he couldn't admit that HE was the root cause of his problems.", 
   {}, 
   391654, 
   null, 
   1266862860.0
  ], 
  [
   391664, 
   null, 
   "snakespit", 
   "If this is the case, it's possible that the government decided to take this opportunity to stir up trouble among the masses - more liberal vs. republican vs. democrat vs. 'tea-baggers' (whatever they are) - more smoke to hide another government agenda to stamp out American liberties.\n\n \n At the end of the day, aren't all of these government people intent on stamping out our liberties Americans themselves? Remember that any liberties that they stamp out, not only they must live with(out), but their families and friends as well. And while were at it...what liberties in specific? You seem to be eluding to some sort of conspiracy, lay it out for me? What exactly would the government be attempting to accomplish through these actions? \n \n A conspiracy theory sometimes makes sense, when there is evidence supporting it and a clear purpose behind it. In this case, I have seen nothing that satisfies either of these. Sometimes, conspiracy theories are little more than paranoid droolings of people so blinded by hate or mistrust that they lose sight of logic and reality.", 
   {}, 
   391654, 
   null, 
   1266864300.0
  ], 
  [
   391667, 
   null, 
   "Sandycane", 
   "The guy was a self-absorbed egotistical nerd that tried to use a tax loophole along with his nerd buddies in the 80's to avoid paying taxes and got burned.\n He, then, developed a strong anti-government mantra and used it to blame all of his own personal shortcomings. \n He gambled on a tax loophole ....and lost.\n He gambled on .com stocks .....and lost.\n He gambled moving to Texas without having the faintest idea of the difference in pay scale between Kalifornia and Texas.....and lost.\n \n And all of these lost gambles of his were projected onto Uncle Sam. The eventual outcome was his own destruction because he couldn't admit that HE was the root cause of his problems.\n\n \n Yeah, I get that impression, too, from the letter. But, what if he didn't actually write it?\n I want to know why the letter was allowed to be published but, his web site was not. Doesn't make sense.", 
   {}, 
   391662, 
   null, 
   1266865440.0
  ], 
  [
   391668, 
   null, 
   "Sandycane", 
   "At the end of the day, aren't all of these government people intent on stamping out our liberties Americans themselves? Remember that any liberties that they stamp out, not only they must live with(out), but their families and friends as well. And while were at it...what liberties in specific? You seem to be eluding to some sort of conspiracy, lay it out for me? What exactly would the government be attempting to accomplish through these actions? \n \n A conspiracy theory sometimes makes sense, when there is evidence supporting it and a clear purpose behind it. In this case, I have seen nothing that satisfies either of these. Sometimes, conspiracy theories are little more than paranoid droolings of people so blinded by hate or mistrust that they lose sight of logic and reality.\n\n \n The Patriot Act:\n 'The Act increases the ability of law enforcement agencies to search telephone, e-mail communications, medical, financial, and other records; eases restrictions on foreign intelligence gathering within the United States; expands the Secretary of the Treasury&#8217;s authority to regulate financial transactions, particularly those involving foreign individuals and entities; and broadens the discretion of law enforcement and immigration authorities in detaining and deporting immigrants suspected of terrorism-related acts. The act also expands the definition of terrorism to include domestic terrorism, thus enlarging the number of activities to which the USA PATRIOT Act&#8217;s expanded law enforcement powers can be applied.'\n \n The Americans implementing these laws are merely following orders and trying to keep their jobs.\n Are you familiar with the Denver Airport murals?", 
   {}, 
   391664, 
   null, 
   1266865980.0
  ], 
  [
   391669, 
   null, 
   "JPSartre12", 
   "Yeah, I get that impression, too, from the letter. But, what if he didn't actually write it?\n I want to know why the letter was allowed to be published but, his web site was not. Doesn't make sense.\n\n \n I agree. It doesn't make sense to censpr the website but not the manifesto. emoticon_confused", 
   {}, 
   391667, 
   null, 
   1266866820.0
  ], 
  [
   391693, 
   null, 
   "snakespit", 
   "The Patriot Act:\n 'The Act increases the ability of law enforcement agencies to search telephone, e-mail communications, medical, financial, and other records; eases restrictions on foreign intelligence gathering within the United States; expands the Secretary of the Treasury's authority to regulate financial transactions, particularly those involving foreign individuals and entities; and broadens the discretion of law enforcement and immigration authorities in detaining and deporting immigrants suspected of terrorism-related acts. The act also expands the definition of terrorism to include domestic terrorism, thus enlarging the number of activities to which the USA PATRIOT Act's expanded law enforcement powers can be applied.'\n \n The Americans implementing these laws are merely following orders and trying to keep their jobs.\n\n Because my life has been so terribly inconvenienced by the Patriot Act. emoticon_rolleyes Sure, I understand that the Patriot Act opens some disturbing avenues for the Feds to walk down without obstruction, but I also weigh that against the fact that the Patriot Act is aimed at gathering intel to prevent another 9/11 like attack on the US. But then again, something tells me that you are a 9/11 truther...am I right? Until I see abuses of American civil liberties in the name of the patriot act, I really see no reason to fear it. \n \n \nAre you familiar with the Denver Airport murals?\n\n You have been reported to the New World Order. And yes, of course I know about the murals....Denver airport is where I got my swastika tattoo, my gas mask, my supply of toxic gas to distribute in my assigned sector, and my little wrist watch transmitter that strangely looks like Abe Vigoda's head. emoticon_rolleyes\n \n ARE YOU SERIOUS? GET A GRIP. ", 
   {
    "unicode_changes_made": true
   }, 
   391668, 
   null, 
   1266870300.0
  ], 
  [
   391694, 
   null, 
   "Archangel", 
   "Yeah, I get that impression, too, from the letter. But, what if he didn't actually write it?\n I want to know why the letter was allowed to be published but, his web site was not. Doesn't make sense.\n\n \n \nI agree. It doesn't make sense to censpr the website but not the manifesto. emoticon_confused\n\n \n Maybe the website contained info which hit a little too close to home for the Governments comfort but the letter he left behind was a sufficient explanation for what he did. Or, the reality is that nothing the Government does today is what it appears to be on the surface. That the Government is in a constant mode of hiding its true agenda in favor of presenting that which benefits it. Just because we have no damning evidence one way or the other, I personally don't take anything our Government says at face value.\n \n For example, past murders I believe we were misled about where JFKs assassination, ML King's murder, RFK's murder and John Kennedy Jr's plane crash, and don't forget Ron Browns plane crash; None of these happened as advertised but that will never be proven in this world, especially since the door has been closed on there investigations.", 
   {}, 
   391669, 
   null, 
   1266870480.0
  ], 
  [
   391698, 
   null, 
   "Sandycane", 
   "Because my life has been so terribly inconvenienced by the Patriot Act. emoticon_rolleyes Sure, I understand that the Patriot Act opens some disturbing avenues for the Feds to walk down without obstruction, but I also weigh that against the fact that the Patriot Act is aimed at gathering intel to prevent another 9/11 like attack on the US. But then again, something tells me that you are a 9/11 truther...am I right? Until I see abuses of American civil liberties in the name of the patriot act, I really see no reason to fear it. \n \n \n You have been reported to the New World Order. And yes, of course I know about the murals....Denver airport is where I got my swastika tattoo, my gas mask, my supply of toxic gas to distribute in my assigned sector, and my little wrist watch transmitter that strangely looks like Abe Vigoda's head. emoticon_rolleyes\n \n ARE YOU SERIOUS? GET A GRIP. \n\n \n I have a grip...and yes, I am serious.\n \n '9/11 truther'? I suppose, if that means that I find all of the evidence, presented by all of the experts, leaning to the fact that all of the evidence doesn't add up to what the government says happened.\n \n So, you haven't been inconvenienced by the Patriot Act yet? I don't think I have been either - not directly.\n But, I have been a victim of the governments agenda for 50 years starting with water fluoridation. If saying that I disagree with government policy labels me a domestic terrorist, then yes, I am a victim of the Patriot Act.", 
   {}, 
   391693, 
   null, 
   1266872460.0
  ], 
  [
   391699, 
   null, 
   "Jo Bennett", 
   " starting with water fluoridation.\n\n \n Are you concerned about the effect on your precious bodily fluids? [/Kubrick]", 
   {}, 
   391698, 
   null, 
   1266872760.0
  ], 
  [
   391704, 
   null, 
   "JPSartre12", 
   "Are you concerned about the effect on your precious bodily fluids? [/Kubrick]\n\n \n We'll meet again...don't know where.....don't know when. One of my favorites. \n \n I loved the sign : \n 843rd Tactical Bomb Wing\n Peace is our business\n emoticon_xgood", 
   {}, 
   391699, 
   null, 
   1266874080.0
  ], 
  [
   391712, 
   null, 
   "NATO 556", 
   "Are you concerned about the effect on your precious bodily fluids? [/Kubrick]\n\n \n What business does the government have tampering with our drinking water, without either informing us, or getting our consent beforehand?", 
   {}, 
   391699, 
   null, 
   1266876240.0
  ], 
  [
   391715, 
   null, 
   "JPSartre12", 
   "What business does the government have tampering with our drinking water, without either informing us, or getting our consent beforehand?\n\n \n Come on now. Do you really want to be like the rotten toothed Brits?! I like fluoride in my water and at 53 have never had root canal. emoticon_xgood", 
   {}, 
   391712, 
   null, 
   1266876840.0
  ], 
  [
   391749, 
   null, 
   "snakespit", 
   "'9/11 truther'? I suppose, if that means that I find all of the evidence, presented by all of the experts, leaning to the fact that all of the evidence doesn't add up to what the government says happened.\n\n What doesn't add up? The 19 terrorists on the planes? The phone calls about middle eastern men with boxcutters taking hostages? The buildings falling? The fact that OBL personally took credit for the attacks? What? \n \n \nSo, you haven't been inconvenienced by the Patriot Act yet? I don't think I have been either - not directly.\n\n Right...so it is a poor example. \n \n \nBut, I have been a victim of the governments agenda for 50 years starting with water fluoridation. If saying that I disagree with government policy labels me a domestic terrorist, then yes, I am a victim of the Patriot Act.\n\n Saying that you disagree with government policy does not make you a terrorist. Going and blowing up the water company (or making concrete plans to) would. And yes, as distressing as healthy teeth are, I guess you'll just have to keep on being victimized until this whole \"dental hygiene\" thing blows over.", 
   {}, 
   391698, 
   null, 
   1266881400.0
  ], 
  [
   391764, 
   null, 
   "Sandycane", 
   "What business does the government have tampering with our drinking water, without either informing us, or getting our consent beforehand?\n\n \n Exactly....but, they do have a reason for doing it and it's not for our dental health.\n This is just one example of the government doing something 'for our own good' without our request or consent.", 
   {}, 
   391712, 
   null, 
   1266882180.0
  ], 
  [
   391767, 
   null, 
   "Sandycane", 
   "Come on now. Do you really want to be like the rotten toothed Brits?! I like fluoride in my water and at 53 have never had root canal. emoticon_xgood\n\n \n You have got to be joking.emoticon_mad", 
   {}, 
   391715, 
   null, 
   1266882240.0
  ], 
  [
   391772, 
   null, 
   "Sandycane", 
   "What doesn't add up? The 19 terrorists on the planes? The phone calls about middle eastern men with boxcutters taking hostages? The buildings falling? The fact that OBL personally took credit for the attacks? What? \n \n \n Right...so it is a poor example. \n \n \n Saying that you disagree with government policy does not make you a terrorist. Going and blowing up the water company (or making concrete plans to) would. And yes, as distressing as healthy teeth are, I guess you'll just have to keep on being victimized until this whole \"dental hygiene\" thing blows over.\n\n \n You are wrong. Anyone who speaks against government policy can be tagged as a domestic terrorist - and would be subject to scrutiny by the authorities. Blowing up a building would make me a criminal and land me in prison...two different critters.\n \n 'Dental hygiene' has nothing to do with the government allowing municipal water departments to dump sodium silicofluoride, which is a toxic waste by-product of the fertilizer industry, into the water supply.\n Do a little research before you make another wisecrack about it.", 
   {}, 
   391749, 
   null, 
   1266882600.0
  ], 
  [
   391783, 
   null, 
   "NATO 556", 
   "Saying that you disagree with government policy does not make you a terrorist. Going and blowing up the water company (or making concrete plans to) would. And yes, as distressing as healthy teeth are, I guess you'll just have to keep on being victimized until this whole \"dental hygiene\" thing blows over.\n\n \n What about the government carrying out the mandatory sterilization program back in the early 20th century?\n \n Mental illness, deafness, blindness, physical deformities, epilepsy, etc. they were all targets for government sanctioned sterilization in order to keep them from reproducing.\n \n Are you going to claim that they were doing this \"for our own good\"?", 
   {}, 
   391749, 
   null, 
   1266884340.0
  ], 
  [
   391785, 
   null, 
   "snakespit", 
   "You are wrong. Anyone who speaks against government policy can be tagged as a domestic terrorist - and would be subject to scrutiny by the authorities. Blowing up a building would make me a criminal and land me in prison...two different critters.\n\n Ok...provide me with a list of people who have been locked up as domestic terrorists since 9/11/01. \n \n \n'Dental hygiene' has nothing to do with the government allowing municipal water departments to dump sodium silicofluoride, which is a toxic waste by-product of the fertilizer industry, into the water supply.\n Do a little research before you make another wisecrack about it.\n\n \n Then why don't you educate me? I can't find any other reason that they add it to the water supply. And yes, it is a toxic substance...just like chlorine and many of the other substances that are added to our water...but in the concentrations they are used in, they are safe. Add to that, the benefits of the use of these chemicals far outweighs the risk.", 
   {}, 
   391772, 
   null, 
   1266884520.0
  ], 
  [
   391860, 
   null, 
   "JPSartre12", 
   "You have got to be joking.emoticon_mad\n\n \n Not kidding. 53 and got my first cavity at age 36. Teeth like steel thanks in part to fluoride. emoticon_xgood", 
   {}, 
   391767, 
   null, 
   1266898080.0
  ], 
  [
   391863, 
   null, 
   "JPSartre12", 
   "Ok...provide me with a list of people who have been locked up as domestic terrorists since 9/11/01. \n \n Then why don't you educate me? I can't find any other reason that they add it to the water supply. And yes, it is a toxic substance...just like chlorine and many of the other substances that are added to our water...but in the concentrations they are used in, they are safe. Add to that, the benefits of the use of these chemicals far outweighs the risk.\n\n \n Don't you know that it poisons your precious bodily fluid? It's a commie plot to dull your senses. Or not. ;)\n \n Actually, as little as 1ppm fluoride kills bacteria that like to eat away the enamel of your teeth. Don't believe me though, believe the commies at the American Dental Association. ADA.org: Federal and State Issues: Fluoride & Fluoridation", 
   {}, 
   391785, 
   null, 
   1266898440.0
  ], 
  [
   391876, 
   null, 
   "NATO 556", 
   "Not kidding. 53 and got my first cavity at age 36. Teeth like steel thanks in part to fluoride. emoticon_xgood\n\n \n That's all well and good. But would you feel the same if you found out your cousin was rendered sterile by the government because they were blind or deaf?", 
   {}, 
   391860, 
   null, 
   1266899820.0
  ], 
  [
   391884, 
   null, 
   "JPSartre12", 
   "That's all well and good. But would you feel the same if you found out your cousin was rendered sterile by the government because they were blind or deaf?\n\n \n Unless he was sterilized by fluorinated water, I don't see the connection between what I wrote and what you wrote.", 
   {}, 
   391876, 
   null, 
   1266902460.0
  ], 
  [
   391888, 
   null, 
   "NATO 556", 
   "Unless he was sterilized by fluorinated water, I don't see the connection between what I wrote and what you wrote.\n\n \n Back in the early-to-late 20th century the government, both federal and states, had a policy of sterilizing those they considered \"undesirable\" in nature, rendering them unable to have kids. These undesirables included the blind, deaf, deformed and mentally ill.", 
   {}, 
   391884, 
   null, 
   1266904980.0
  ], 
  [
   391893, 
   null, 
   "Jo Bennett", 
   "Back in the early-to-late 20th century the government, both federal and states, had a policy of sterilizing those they considered \"undesirable\" in nature, rendering them unable to have kids. These undesirables included the blind, deaf, deformed and mentally ill.\n\n \n Well, when you demonstrate that flouridation of water causes permanent, long term damage then you'll have a point. Until then... not so much.", 
   {}, 
   391888, 
   null, 
   1266909180.0
  ], 
  [
   391895, 
   null, 
   "NATO 556", 
   "Well, when you demonstrate that flouridation of water causes permanent, long term damage then you'll have a point. Until then... not so much.\n\n \n The point is, that the government has routinely acted in a manner that they claim is in our best interest, but they never once consulted us before implementing these procedures.\n \n Drugged drinking water, forced sterilization of the \"undesirables\", usurping our rights in the name of hunting terrorists, etc.", 
   {}, 
   391893, 
   null, 
   1266909960.0
  ], 
  [
   391898, 
   null, 
   "Jo Bennett", 
   "The point is, that the government has routinely acted in a manner that they claim is in our best interest, but they never once consulted us before implementing these procedures.\n \n Drugged drinking water, forced sterilization of the \"undesirables\", usurping our rights in the name of hunting terrorists, etc.\n\n \n Drugged... oh please. How is flouride in drinking water any different from chlorine? Both are there for anti-bacterial properties, but you only seem to object to one.", 
   {}, 
   391895, 
   null, 
   1266914760.0
  ], 
  [
   391928, 
   null, 
   "JPSartre12", 
   "Back in the early-to-late 20th century the government, both federal and states, had a policy of sterilizing those they considered \"undesirable\" in nature, rendering them unable to have kids. These undesirables included the blind, deaf, deformed and mentally ill.\n\n \n I'm very familiar with Eugenics. I don't see how it applies to fluorinated water, though, unless you're trying to draw a parallel to other governmental programs considered intrusive.\n Eugenics was supported by the likes of Alexander Graham Bell, H.G. Wells,Teddy Roosevelt,Planned Parenthood founder, Margaret Sanger and the Democratic Party.\n \n Sanger wrote in THE PIVOT OF CIVILIZATION\n \"The lack of balance between the birth-rate of the \"unfit\" and the \"fit,\"\n admittedly the greatest present menace to the civilization, can never be\n rectified by the inauguration of a cradle competition between these\n two classes. The example of the inferior classes, the fertility of the\n feeble-minded, the mentally defective, the poverty-stricken, should\n not be held up for emulation to the mentally and physically fit, and\n therefore less fertile, parents of the educated and well-to-do classes.\n On the contrary, the most urgent problem to-day is how to limit and\n discourage the over-fertility of the mentally and physically defective.\n Possibly drastic and Spartan methods may be forced upon American\n society if it continues complacently to encourage the chance and chaotic\n breeding that has resulted from our stupid, cruel sentimentalism.\n http://www.gutenberg.org/dirs/1/6/8/1689/1689.txt", 
   {}, 
   391898, 
   null, 
   1266937920.0
  ], 
  [
   391929, 
   null, 
   "NATO 556", 
   "I'm very familiar with Eugenics. I don't see how it applies to fluorinated water, though, unless you're trying to draw a parallel to other governmental programs considered intrusive.\n\n \n Not my fault that you're too dense to see how the government routinely acting in a manner that's not in our best interest.", 
   {}, 
   391928, 
   null, 
   1266938100.0
  ], 
  [
   391930, 
   null, 
   "JPSartre12", 
   "Not my fault that you're too dense to see how the government routinely acting in a manner that's not in our best interest.\n\n \n Sorry. I guess the tinfoil lining in MY hat works better than yours. I don't see a conspiracy around every corner. emoticon_rolleyes", 
   {}, 
   391929, 
   null, 
   1266938400.0
  ], 
  [
   391936, 
   null, 
   "NATO 556", 
   "Sorry. I guess the tinfoil lining in MY hat works better than yours. I don't see a conspiracy around every corner. emoticon_rolleyes\n\n \n Well look around better and maybe you'd understand a few things.\n \n What about the fact that anyone who speaks out against the war in the middle east is put on special watch lists for further observation and investigation? How would that qualify as being in our best interest?\n \n What about the fact that the FBI now has the ability to search through your banking records, for whatever reason, without a warrant, and they can justify it as looking for terrorist sympathizers?\n \n What about the government deciding that you can no longer be trusted to carry a four ounce bottle of liquid onto an airplane because you might be trying to construct a bomb?", 
   {}, 
   391930, 
   null, 
   1266939660.0
  ], 
  [
   391945, 
   null, 
   "JPSartre12", 
   "Well look around better and maybe you'd understand a few things.\n \n What about the fact that anyone who speaks out against the war in the middle east is put on special watch lists for further observation and investigation? How would that qualify as being in our best interest?\n\n I think the victims' families from Ft. Hood would see the value in it. \n \n\n What about the fact that the FBI now has the ability to search through your banking records, for whatever reason, without a warrant, and they can justify it as looking for terrorist sympathizers?\n \n\n I'm not a big fan of governmental intrusion in general, but there are guidelines and rules for what the FBI can do with the information obtained. It's my understanding that they're only interested in the funneling of money from the US to terrorist organizations outside of the country. Locally, the owner of a Mideastern restaurant chain was running a drug ring, using the restaurants to launder the money and then sending it to Hezbollah. La Shish Owner Indicted: Does Your Fave Mid-East Restaurant Fund Terror?\n Now, personally, I have no problem with the FBI undertaking such endeavors, do you?\n \n\n What about the government deciding that you can no longer be trusted to carry a four ounce bottle of liquid onto an airplane because you might be trying to construct a bomb?\n\n \n You have no Constitutional right to fly on an airplane. You fly at the discretion of the carrier. I'm sure that many people would stop flying if security rules were relaxed right now. If you're not a frequent flier, especially out of Detroit with our huge ME population, then I can see how it might bother you. But, trust me, get on a plane nowadays with half a planeload of Muslims and most welcome the added security for peace of mind.", 
   {
    "unicode_changes_made": true
   }, 
   391936, 
   null, 
   1266942720.0
  ], 
  [
   391949, 
   null, 
   "NATO 556", 
   "I think the victims' families from Ft. Hood would see the value in it.\n\n \n There's a difference between not supporting the war, and converting to the muslim religion.\n \n \n \nI'm not a big fan of governmental intrusion in general, but there are guidelines and rules for what the FBI can do with the information obtained. It's my understanding that they're only interested in the funneling of money from the US to terrorist organizations outside of the country. Locally, the owner of a Mideastern restaurant chain was running a drug ring, using the restaurants to launder the money and then sending it to Hezbollah. La Shish Owner Indicted: Does Your Fave Mid-East Restaurant Fund Terror?\n Now, personally, I have no problem with the FBI undertaking such endeavors, do you?\n\n \n So you don't have a problem with the government having the authority to peak into your private affairs without either just cause or a warrant, so long as they're not currently doing it? You've got no problem with them having the system all set up and just waiting for an excuse to use it?\n \n New York implemented a program where you had to get a permit to own a handgun. Originally it was designed to keep minorities from arming themselves, but today it's being used against everyone in the state.\n \n I don't tolerate systems that can allow for abuse sometime in the future when a changing of hands will lead to a changing of attitude about the people. Do you?", 
   {
    "unicode_changes_made": true
   }, 
   391945, 
   null, 
   1266943860.0
  ], 
  [
   391956, 
   null, 
   "JPSartre12", 
   "There's a difference between not supporting the war, and converting to the muslim religion.\n\n \n And do you think that difference can be discerned by peering into a non-intrusive crystal ball or do you think it takes some type of effort?emoticon_confused\n \n\n So you don't have a problem with the government having the authority to peak into your private affairs without either just cause or a warrant, so long as they're not currently doing it? You've got no problem with them having the system all set up and just waiting for an excuse to use it?\n \n\n I guess I'm just not as paranoid as you. Maybe as I get older, I am becoming less neurotic. \n \n\n New York implemented a program where you had to get a permit to own a handgun. Originally it was designed to keep minorities from arming themselves, but today it's being used against everyone in the state.\n \n\n And in NJ, I had to get fingerprinted and have a background check in order to buy long arms. That was 30 years ago. The Feds haven't been camping on my doorstep for 3 decades as a result. \n \n\n I don't tolerate systems that can allow for abuse sometime in the future when a changing of hands will lead to a changing of attitude about the people. Do you?\n\n I wish that I could wave a magic wand and put an end to corrupt politicians, but I have to live in the real world. They exist.....as do corrupt cops and other government officials. All we can do is be vigilant about reporting abuses and change those that we can't reasonable oversee.", 
   {}, 
   391949, 
   null, 
   1266946680.0
  ], 
  [
   391966, 
   null, 
   "NATO 556", 
   "And do you think that difference can be discerned by peering into a non-intrusive crystal ball or do you think it takes some type of effort?emoticon_confused\n \n I guess I'm just not as paranoid as you. Maybe as I get older, I am becoming less neurotic. \n \n And in NJ, I had to get fingerprinted and have a background check in order to buy long arms. That was 30 years ago. The Feds haven't been camping on my doorstep for 3 decades as a result. \n \n I wish that I could wave a magic wand and put an end to corrupt politicians, but I have to live in the real world. They exist.....as do corrupt cops and other government officials. All we can do is be vigilant about reporting abuses and change those that we can't reasonable oversee.\n\n \n So you freely admit that the government is full or corrupt individuals, and yet you still readily support the same government carrying out secret ops without the consent of the people they're supposed to serve?\n \n That's like saying you expect your rapist not to murder you.\n \n Government has 3 duties assigned to it\" protection of property, preserving contracts, and providing for the rule of law. Administering drugs, forcing sterilization, and maintaining secret watch lists of the American people don't fit anywhere within these duties.", 
   {}, 
   391956, 
   null, 
   1266950520.0
  ], 
  [
   391977, 
   null, 
   "JPSartre12", 
   "So you freely admit that the government is full or corrupt individuals, and yet you still readily support the same government carrying out secret ops without the consent of the people they're supposed to serve?\n \n That's like saying you expect your rapist not to murder you.\n \n Government has 3 duties assigned to it\" protection of property, preserving contracts, and providing for the rule of law. Administering drugs, forcing sterilization, and maintaining secret watch lists of the American people don't fit anywhere within these duties.\n\n \n You must live in a dream world. None of the activities that you described aren't known to the public. The full Patriot Act is available online, isn't it? We've been fluorinating water for 50 years. It isn't something that the average person isn't aware of. The forced sterilization of the past was based on legislation that was part of the public record at the time and didn't cause an uproar.\n The only thing on your list of paranoia that isn't common knowledge is the watch list. Making that public is, obviously, counter-productive.", 
   {}, 
   391966, 
   null, 
   1266953580.0
  ], 
  [
   392009, 
   null, 
   "Sandycane", 
   "You must live in a dream world. None of the activities that you described aren't known to the public. The full Patriot Act is available online, isn't it? We've been fluorinating water for 50 years. It isn't something that the average person isn't aware of. The forced sterilization of the past was based on legislation that was part of the public record at the time and didn't cause an uproar.\n The only thing on your list of paranoia that isn't common knowledge is the watch list. Making that public is, obviously, counter-productive.\n\n \n So...you are saying that because the government does something right under our noses, it's harmless?\n \n I feel the need to enlighten you on the water fluoridation issue...see you on the new thread...but, where it put it?\n \n here it is: \n http://www.4forums.com/political/health-debates/13947-water-fluoridation-myth-vs-facts.html#post392013", 
   {}, 
   391977, 
   null, 
   1266957300.0
  ], 
  [
   392014, 
   null, 
   "NATO 556", 
   "You must live in a dream world. None of the activities that you described aren't known to the public. The full Patriot Act is available online, isn't it? We've been fluorinating water for 50 years. It isn't something that the average person isn't aware of. The forced sterilization of the past was based on legislation that was part of the public record at the time and didn't cause an uproar.\n The only thing on your list of paranoia that isn't common knowledge is the watch list. Making that public is, obviously, counter-productive.\n\n \n Simply because we're aware of it, doesn't mean that we consented to it or gave permission for it to happen. It just means we discovered what kind of treachery our government has carried out against us without having a say on it.\n \n If you can show how public knowledge = public consent, then you might have something there. But you can't.", 
   {}, 
   391977, 
   null, 
   1266957900.0
  ], 
  [
   392027, 
   null, 
   "JPSartre12", 
   "Simply because we're aware of it, doesn't mean that we consented to it or gave permission for it to happen. It just means we discovered what kind of treachery our government has carried out against us without having a say on it.\n \n If you can show how public knowledge = public consent, then you might have something there. But you can't.\n\n \n The American public clamorred for Uncle Sam to do something after 9-11 and our politicians couldn't act fast enough for the masses, so not only did we know about them, we pushed them to act.", 
   {}, 
   392014, 
   null, 
   1266959280.0
  ], 
  [
   392032, 
   null, 
   "Sandycane", 
   "The American public clamorred for Uncle Sam to do something after 9-11 and our politicians couldn't act fast enough for the masses, so not only did we know about them, we pushed them to act.\n\n \n 'The Masses' are under the influence of fluoride intoxication.", 
   {}, 
   392027, 
   null, 
   1266959700.0
  ], 
  [
   392082, 
   null, 
   "snakespit", 
   "'The Masses' are under the influence of fluoride intoxication.\n\n \n Now that is funny.", 
   {}, 
   392032, 
   null, 
   1266966240.0
  ], 
  [
   392087, 
   null, 
   "JPSartre12", 
   "'The Masses' are under the influence of fluoride intoxication.\n\n \n Are you saying that you don't brush your teeth with toothpaste?", 
   {}, 
   392032, 
   null, 
   1266966900.0
  ], 
  [
   392092, 
   null, 
   "Sandycane", 
   "Are you saying that you don't brush your teeth with toothpaste?\n\n \n No, I didn't say that.\n I do brush my teeth, twice a day, with toothpaste - homemade, with peroxide and baking soda...and I rinse with tap water but, NEVER SWALLOW IT. emoticon_smile\n Went to the dentist last month and not one new cavity...which I find amazing since the last time I saw a dentist was 25 years ago.", 
   {}, 
   392087, 
   null, 
   1266967140.0
  ], 
  [
   392100, 
   null, 
   "NATO 556", 
   "The American public clamorred for Uncle Sam to do something after 9-11 and our politicians couldn't act fast enough for the masses, so not only did we know about them, we pushed them to act.\n\n \n Wrong. Once again an example of the government not telling us what they were doing. Instead they went ahead and did what they wanted. Even after September 11th, the public wouldn't have supported the Patriot Act if they'd known its many provisions and infringements.\n \n Care to try and worm your way out of the other examples of the government doing things without our permission?", 
   {}, 
   392027, 
   null, 
   1266968160.0
  ], 
  [
   392203, 
   null, 
   "Jo Bennett", 
   "No, I didn't say that.\n I do brush my teeth, twice a day, with toothpaste - homemade, with peroxide and baking soda...and I rinse with tap water but, NEVER SWALLOW IT. emoticon_smile\n Went to the dentist last month and not one new cavity...which I find amazing since the last time I saw a dentist was 25 years ago.\n\n \n You put bleach in your mouth and you're worried about flouride?!", 
   {}, 
   392092, 
   null, 
   1266999660.0
  ], 
  [
   392228, 
   null, 
   "Sandycane", 
   "I said I use baking soda and peroxide...and if you knew anything about fluoride, you would be worried about it, too.", 
   {}, 
   392203, 
   null, 
   1267028640.0
  ], 
  [
   392237, 
   null, 
   "NATO 556", 
   "Hygiene aside, the point still remains that there are numerous instances of the government conspiring against the people and enacting various plans without consent, or forewarning of any sort. These are usually the tactics of a shadow government that cares more about protecting its own existence rather than the well being of the people it's supposed to serve.\n \n Obama has promised government transparency to the American people. Perhaps a FOIA request will turn up countless secret ops carried out without public knowledge or consent.", 
   {}, 
   392228, 
   null, 
   1267030860.0
  ], 
  [
   392246, 
   null, 
   "JPSartre12", 
   "I said I use baking soda and peroxide...and if you knew anything about fluoride, you would be worried about it, too.\n\n \n I work with fluorides every day. The only fluorides that scares me are the acidic forms, H2SiF6 and HF. The neutralized salts don't. And the reason that they scare me is that they penetrate through the skin, often without any sensation, and head right to the bones, destroying everything along the way. If you've ever seen the results of an HF burn, you'd never handle it without proper gloves again. emoticon_wow", 
   {}, 
   392228, 
   null, 
   1267035120.0
  ], 
  [
   392249, 
   null, 
   "Sandycane", 
   "Pssst...we're over here now, remember? Oops, sorry, I forget you work with toxic chemicals. :-)\n http://www.4forums.com/political/health-debates/13947-water-fluoridation-myth-vs-facts-2.html#post392247", 
   {}, 
   392246, 
   null, 
   1267036320.0
  ], 
  [
   392254, 
   null, 
   "JPSartre12", 
   "Wrong. Once again an example of the government not telling us what they were doing. Instead they went ahead and did what they wanted. Even after September 11th, the public wouldn't have supported the Patriot Act if they'd known its many provisions and infringements.\n \n Care to try and worm your way out of the other examples of the government doing things without our permission?\n\n \n Please don't try to rewrite history.\n \n \n\n US REACTIONS TO 9/11\n ...........\n Meanwhile, President George Bush was able to win a broad mandate to act in the nation's defense. In a speech on September 20, he asked citizens to be \"calm and resolute, even in the face of a continuing threat\" and promised that the United States would triumph over terrorism -- \"stop it, eliminate it, destroy it where it grows.\" After the United States began military operations in Afghanistan in October, the President's approval rating soared to 90 percent. Congressional leaders responded too: They passed a $40 billion disaster-relief bill in September and, the next year, the USA Patriot Act, which gave investigators a great deal of leeway in their domestic-surveillance activities and made immigration laws more stringent.\n Despite such anti-terrorist measures, many Americans continued to feel uneasy. According to a study in the New England Journal of Medicine, nearly half of all Americans reported symptoms of stress and depression after the attacks. Many thousands of Americans lost loved ones on September 11. Millions more watched the unrelenting news coverage of the attacks, looked at the wrenching photographs in the newspaper and listened to heartbreaking interviews with firefighters, survivors and relatives of victims, and felt that at least in some small way - the trauma of the day was theirs too. Memorials, commemorative ceremonies and time have helped many to begin to heal, but for others the shock and horror of that day in September remains painfully fresh.\n \n US Response to 9/11 - 9/11 Attacks on America - History.com \n", 
   {}, 
   392100, 
   null, 
   1267038000.0
  ], 
  [
   392256, 
   null, 
   "NATO 556", 
   "Please don't try to rewrite history.\n\n \n Still not enough to support your position. Try again please.\n \n Public knowledge doesn't equal public consent.", 
   {}, 
   392254, 
   null, 
   1267038660.0
  ], 
  [
   392258, 
   null, 
   "JPSartre12", 
   "Still not enough to support your position. Try again please.\n \n Public knowledge doesn't equal public consent.\n\n \n Both the president's and Congress' approval ratings went up when they began writing anti-terrorist legislation. You've got your head buried in the sand if you think it was all done behind closed doors in the dark of night. Americans wanted action and the president and Congress gave it to them.", 
   {}, 
   392256, 
   null, 
   1267038960.0
  ], 
  [
   392263, 
   null, 
   "NATO 556", 
   "Both the president's and Congress' approval ratings went up when they began writing anti-terrorist legislation. You've got your head buried in the sand if you think it was all done behind closed doors in the dark of night. Americans wanted action and the president and Congress gave it to them.\n\n \n And currently what is the level of public support for secret watch lists, secret prisons, detention without legal council, and warrantless wiretappings and seizures?", 
   {}, 
   392258, 
   null, 
   1267039740.0
  ], 
  [
   392265, 
   null, 
   "JPSartre12", 
   "And currently what is the level of public support for secret watch lists, secret prisons, detention without legal council, and warrantless wiretappings and seizures?\n\n \n That's irrelevent. The public had a chance to kill the Patriot Act in 2005 by bringing pressure on Congress not to reauthorize it. They didn't. And I'm not seeing a Tea Party-like revolt today.", 
   {}, 
   392263, 
   null, 
   1267040100.0
  ], 
  [
   392269, 
   null, 
   "NATO 556", 
   "That's irrelevent. The public had a chance to kill the Patriot Act in 2005 by bringing pressure on Congress not to reauthorize it. They didn't. And I'm not seeing a Tea Party-like revolt today.\n\n \n I don't think so. Show me where the American public knew in detail what the Patriot Act held and what kind of havoc it had the potential to inflict on them.\n \n You made the argument that the public consented to being spied on in every facet of their lives, it's your job to back up your claims by showing that the American people actually declared that they'd let their phone calls be monitored, that they were alright with the government searching their library and bank account records without a warrant or probable cause, that they were alright with the government randomly selecting people and spiriting them away to detention facilities that officially don't exist.\n \n If there were public support for this nonsense, Guantanamo Bay wouldn't have been shut down. There wouldn't be lawsuits against the phone company for helping the government spy on people's calls. And there wouldn't be people flying Benjamin Franklin's famous quote: \"Those who choose security over freedom deserve neither.\"", 
   {}, 
   392265, 
   null, 
   1267040700.0
  ], 
  [
   392286, 
   null, 
   "JPSartre12", 
   "I don't think so. Show me where the American public knew in detail what the Patriot Act held and what kind of havoc it had the potential to inflict on them.\n \n You made the argument that the public consented to being spied on in every facet of their lives, it's your job to back up your claims by showing that the American people actually declared that they'd let their phone calls be monitored, that they were alright with the government searching their library and bank account records without a warrant or probable cause, that they were alright with the government randomly selecting people and spiriting them away to detention facilities that officially don't exist.\n \n\n I can't prove that everyone knew about all of the provisions. I can only say that the smart ones did.\n \n \n\n If there were public support for this nonsense, Guantanamo Bay wouldn't have been shut down. There wouldn't be lawsuits against the phone company for helping the government spy on people's calls. And there wouldn't be people flying Benjamin Franklin's famous quote: \"Those who choose security over freedom deserve neither.\"\n\n \n \n Newsflash for you. Gitmo's still open. \n \n\n Mr Obama originally set a January 22 deadline to close the prison camp. \n \n But he admitted last November that that deadline had slipped to later in 2010. BBC News - Obama reaffirms Guantanamo Bay prison closure plans \n", 
   {}, 
   392269, 
   null, 
   1267043220.0
  ], 
  [
   392291, 
   null, 
   "NATO 556", 
   "I can't prove that everyone knew about all of the provisions. I can only say that the smart ones did.\n\n \n If they were smart then why did they still support the whole mess?\n \n \nNewsflash for you. Gitmo's still open.\n\n \n The termination order has been signed, the camp is officially closing regardless of the deadline issue. Obviously there's no support for secret detention facilities.\n \n \n This has been a very interesting sidetrack of an argument, but it's done nothing to hide the fact that the government has carried out secret ops programs against the people it's supposed to serve, and offered no forewarning, received no consent, and has been criticized for maintaining a veil of secrecy against the people.\n \n In the end, whatever argument you offer up isn't going to hide the fact that the government doesn't care what the people want, it only cares about maintaining its control no matter what.", 
   {}, 
   392286, 
   null, 
   1267044360.0
  ], 
  [
   392296, 
   null, 
   "JPSartre12", 
   "If they were smart then why did they still support the whole mess?\n\n \n Some people, including yours truly, didn't.\n \n\n The termination order has been signed, the camp is officially closing regardless of the deadline issue. Obviously there's no support for secret detention facilities.\n \n\n There is support for keeping Gitmo open. I don't see how you can claim there isn't. emoticon_confused\n \n\n This has been a very interesting sidetrack of an argument, but it's done nothing to hide the fact that the government has carried out secret ops programs against the people it's supposed to serve, and offered no forewarning, received no consent, and has been criticized for maintaining a veil of secrecy against the people.\n \n\n \n I wasn't arguing that that wasn't the case. I was arguing the specific examples that you gave didn't fall into that category. The American public has supported many dubious measures that restricted our rights. Just look at gun control as a prime example. Even with the SCOTUS ruling the 2nd is an individual right, there are still proponents for increased gun control measures.\n Americans were too eager to trade their freedoms for security post 9-11 and I found that disheartening. I had hoped that once the hysteria was gone, so would be the Patriot Act. That wasn't the case in 2005 when it was \"re-upped\". \n \n \n\n In the end, whatever argument you offer up isn't going to hide the fact that the government doesn't care what the people want, it only cares about maintaining its control no matter what.\n\n \n The government is the people. We are the ones that allow career politicians to stay in office and corrupt our government for decade after decade. If we just threw the bums out after 1-2 terms, the fat cats in Washington wouldn't have so many cronies and be in bed with so many lobbyists. emoticon_angry", 
   {}, 
   392291, 
   null, 
   1267047540.0
  ], 
  [
   392298, 
   null, 
   "Sandycane", 
   "\n \n The government is the people. We are the ones that allow career politicians to stay in office and corrupt our government for decade after decade. If we just threw the bums out after 1-2 terms, the fat cats in Washington wouldn't have so many cronies and be in bed with so many lobbyists. emoticon_angry\n\n \n Do you really believe this?\n The last presidential election didn't offer much of a choice and I think most voters did what I did: pick the lesser of two evils. Not voting isn't an option because there will always be supporters of each side and the majority will win anyway - small though it may be...and the majority are those who bought the most propaganda.\n This is true with local election, too.\n \n I've always said there should be a 'None of the above' box and if NOTA gets the majority of the votes, pick new candidates and start over. ;)\n \n If you look at it from a global perspective, which is more accurate these days since we now have the European Union and will soon have the North American Union (to replace America, Canada and Mexico), and we all know the ballot boxes are fixed, WE don't really have a vote that counts because the agenda has already been set - sort of like Gods Plan - we don't know what it is or, exactly who's behind it but, it's going to happen whether or, not we like it.", 
   {}, 
   392296, 
   null, 
   1267048860.0
  ], 
  [
   392301, 
   null, 
   "JPSartre12", 
   "Do you really believe this?\n\n \n I believe that Presidents don't have as much impact as Congress and SCOTUS. The Presidency is a temporary job at best. We have lifelong members of Congress.:xcensored\n \n\n The last presidential election didn't offer much of a choice and I think most voters did what I did: pick the lesser of two evils. Not voting isn't an option because there will always be supporters of each side and the majority will win anyway - small though it may be...and the majority are those who bought the most propaganda.\n This is true with local election, too.\n\n \n I'm hoping that the American public is beginning to wake up. IMO, the Tea Party has demonstrated the need for voters to make their beliefs known more vociferously. It's about time that Joe Sixpack got off of the couch and did something useful. \n \n\n I've always said there should be a 'None of the above' box and if NOTA gets the majority of the votes, pick new candidates and start over. ;)\n \n\n I like the idea of candidates having to get a majority of the votes cast and having more than two candidates in the race. \n \n \n\n If you look at it from a global perspective, which is more accurate these days since we now have the European Union and will soon have the North American Union (to replace America, Canada and Mexico), and we all know the ballot boxes are fixed, WE don't really have a vote that counts because the agenda has already been set - sort of like Gods Plan - we don't know what it is or, exactly who's behind it but, it's going to happen whether or, not we like it.\n\n \n Wow! You're way more paranoid than I even imagined.", 
   {}, 
   392298, 
   null, 
   1267052700.0
  ], 
  [
   392313, 
   null, 
   "Sandycane", 
   "\n I'm hoping that the American public is beginning to wake up. IMO, the Tea Party has demonstrated the need for voters to make their beliefs known more vociferously. It's about time that Joe Sixpack got off of the couch and did something useful. \n ...or, Joe Stack? he might have done some good - in a weird sort of way. Time will tell.\n \n \nWow! You're way more paranoid than I even imagined.\n\n \n Not 'paranoid', alert. emoticon_rolleyes", 
   {}, 
   392301, 
   null, 
   1267055700.0
  ], 
  [
   392318, 
   null, 
   "NATO 556", 
   "It's better to be labeled as paranoid and always be asking the government \"Just what the hell do you think you're doing!?\" than to be ignorant and think that everything is alright.", 
   {}, 
   392313, 
   null, 
   1267056420.0
  ], 
  [
   392359, 
   null, 
   "snakespit", 
   "Not 'paranoid', alert. emoticon_rolleyes\n\n \n No, alert would be staying informed and looking at things with a rational and common sense approach. Paranoid is assuming that the government is always out to get you when you haven't taken the time to educate yourself or examine/know the facts. There is a difference. You are paranoid.", 
   {}, 
   392313, 
   null, 
   1267073220.0
  ], 
  [
   392361, 
   null, 
   "NATO 556", 
   "No, alert would be staying informed and looking at things with a rational and common sense approach. Paranoid is assuming that the government is always out to get you when you haven't taken the time to educate yourself or examine/know the facts. There is a difference. You are paranoid.\n\n \n Afraid not Snakes, there's little room for calling someone paranoid anymore.\n \n We've seen the evidence that the government instituted a warantless wiretapping scheme. We've seen that the no fly list has the names of children and boy scouts. We've seen everything held in the Patriot Act and how it violates every amendment in the Constitution. We've also seen the Tuskegee Experiment and how the government ran tests on black men without their knowledge or consent.", 
   {}, 
   392359, 
   null, 
   1267074120.0
  ], 
  [
   392365, 
   null, 
   "JPSartre12", 
   "Afraid not Snakes, there's little room for calling someone paranoid anymore.\n \n We've seen the evidence that the government instituted a warantless wiretapping scheme. We've seen that the no fly list has the names of children and boy scouts. We've seen everything held in the Patriot Act and how it violates every amendment in the Constitution. We've also seen the Tuskegee Experiment and how the government ran tests on black men without their knowledge or consent.\n\n \n Why stop there. The government gave LSD to soldiers without their knowledge. They made sailors stand on the decks of ships during H bomb tests. They traded arms for hostages in Iran. Want more?\n Do you think there's ANY government in the world that hasn't done the wrong thing......sometimes for the right reason, sometimes not?", 
   {}, 
   392361, 
   null, 
   1267075500.0
  ], 
  [
   392413, 
   null, 
   "snakespit", 
   "Afraid not Snakes, there's little room for calling someone paranoid anymore.\n \n We've seen the evidence that the government instituted a warantless wiretapping scheme. We've seen that the no fly list has the names of children and boy scouts. We've seen everything held in the Patriot Act and how it violates every amendment in the Constitution. We've also seen the Tuskegee Experiment and how the government ran tests on black men without their knowledge or consent.\n\n \n Yeah, I get it. Because the government has done some shady things in the past, we should assume that everything bad that happens in the US is due to a secret government plot. Where I come from, that's what we call paranoid. Terrorists couldn't have attacked us...Bush had the towers blown up. Fluoride can't actually be good for our teeth, the government is using it to control our minds. Joe Stack couldn't have just been a really XXXXXX off man, the government set him up. Paranoid, paranoid, paranoid. \n \n Don't get me wrong, I do not place the government above reproach, but to assume that everything bad that happens is a government conspiracy without a shred of credible evidence smacks of paranoia.", 
   {}, 
   392361, 
   null, 
   1267116960.0
  ], 
  [
   392415, 
   null, 
   "JPSartre12", 
   "Yeah, I get it. Because the government has done some shady things in the past, we should assume that everything bad that happens in the US is due to a secret government plot. Where I come from, that's what we call paranoid. Terrorists couldn't have attacked us...Bush had the towers blown up. Fluoride can't actually be good for our teeth, the government is using it to control our minds. Joe Stack couldn't have just been a really XXXXXX off man, the government set him up. Paranoid, paranoid, paranoid. \n \n Don't get me wrong, I do not place the government above reproach, but to assume that everything bad that happens is a government conspiracy without a shred of credible evidence smacks of paranoia.\n\n \n Well stated. emoticon_xhoho", 
   {}, 
   392413, 
   null, 
   1267117320.0
  ], 
  [
   392470, 
   null, 
   "Sandycane", 
   "Oh, there's plenty of evidence...you two just named some of them!\n \n That's okay, NATO and I will be better prepared than most when the time comes to duck for cover.\n When you come visit my shelter, the sign on the door will say, 'NO Vacancy!\" :p\n \n (I say this with tongue-in-cheek. I don't have a shelter. wink wink emoticon_xbye)", 
   {}, 
   392415, 
   null, 
   1267131060.0
  ], 
  [
   392504, 
   null, 
   "snakespit", 
   "Oh, there's plenty of evidence...you two just named some of them!\n \n That's okay, NATO and I will be better prepared than most when the time comes to duck for cover.\n When you come visit my shelter, the sign on the door will say, 'NO Vacancy!\" :p\n \n (I say this with tongue-in-cheek. I don't have a shelter. wink wink emoticon_xbye)\n\n \n Duck for cover from what? What are you afraid of?", 
   {}, 
   392470, 
   null, 
   1267151640.0
  ], 
  [
   392507, 
   null, 
   "NATO 556", 
   "Duck for cover from what? What are you afraid of?\n\n \n Those that praise government a little too much, and question too little.", 
   {}, 
   392504, 
   null, 
   1267152780.0
  ], 
  [
   392552, 
   null, 
   "Sandycane", 
   "Those that praise government a little too much, and question too little.\n\n \n emoticon_xhoho\n ...and continue to drink the Kool-aid.", 
   {}, 
   392507, 
   null, 
   1267206780.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Joe A. Stack", 
  "url": "http://www.4forums.com/political/news-forum/13920-joe-stack.html", 
  "breadcrumbs": [
   "News Forum"
  ], 
  "id_number": 13920, 
  "discussion_files": [
   [
    "24317.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-print.html"
   ], 
   [
    "24318.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-7-print.html"
   ], 
   [
    "24319.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-5-print.html"
   ], 
   [
    "24320.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-4-print.html"
   ], 
   [
    "24321.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-6-print.html"
   ], 
   [
    "24322.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-3-print.html"
   ], 
   [
    "24323.html", 
    "http://www.4forums.com/political/news-forum/13920-joe-stack-2-print.html"
   ]
  ], 
  "identifier": 13920
 }
]