[
 [
  [
   391611, 
   null, 
   "Brady", 
   "The Brady Center has released a report on President Obama's performance called President Obama's First Year: Failed Leadership, Lost Lives.\n \n The President's concessions to the \"guns anywhere\" mentality of the gun lobby and lack of leadership for common-sense gun laws has earned him a grade of \"F\".\n \n President Obama signed legislation letting people carry concealed weapons in national parks and in checked luggage on Amtrak trains, adopted the gun lobby's empty rhetoric about just \"enforcing the laws on the books,\" and muzzled Cabinet members who expressed support for stronger gun laws. \n \n In addition, the White House voiced no objection to people carrying guns near Presidential events and his White House staff removed statements from the White House website that declared support for gun violence prevention laws.\n \n \n What a traitor!", 
   {
    "post_info": {
     "post_title": "An F for Obama"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1266819780.0
  ], 
  [
   391614, 
   null, 
   "NATO 556", 
   "What a traitor!\n\n \n Traitor? More like the boy wised up on the matter.\n \n So, Brady, how's it feel to have all your work and hopes destroyed in the blink of an eye? How does it feel to know that your last best hope for a disarmed society has abandoned you by the side of the road, and you're now out of options and the only thing left to do is eat the crow?", 
   {}, 
   391611, 
   null, 
   1266820020.0
  ], 
  [
   391637, 
   null, 
   "Doc Jones", 
   "The Brady Center has released a report on President Obama's performance called President Obama's First Year: Failed Leadership, Lost Lives.\n \n The President's concessions to the \"guns anywhere\" mentality of the gun lobby and lack of leadership for common-sense gun laws has earned him a grade of \"F\".\n\n \n Whoooeeee!! That is almost certain to cost him (4) four votes.emoticon_xclown\n \n \nPresident Obama signed legislation letting people carry concealed weapons in national parks and in checked luggage on Amtrak trains, adopted the gun lobby's empty rhetoric about just \"enforcing the laws on the books,\" and muzzled Cabinet members who expressed support for stronger gun laws. \n \n In addition, the White House voiced no objection to people carrying guns near Presidential events and his White House staff removed statements from the White House website that declared support for gun violence prevention laws.\n \n What a traitor!\n\n \n Forgive me for laughing; no, not really ha, ha, ha ha ha :p\n Could it be that people here as well as Canada and the rest of the world has figured out your infantile \"grading system of States\" is a complete sham and your very reason for existing is but an anti-constitutional farce and has lost any claims you have or will make? emoticon_xbye You stand alone now brady, with simply a few still clinging to the false hope of having others pay for your failures and unConstitutional stance so you can sit on your hands while you keep harping on overturning the 2A. emoticon_xbye", 
   {
    "unicode_changes_made": true
   }, 
   391611, 
   null, 
   1266845760.0
  ], 
  [
   391640, 
   null, 
   "Doc Jones", 
   "The Brady Center has released a report on President Obama's performance called President Obama's First Year: Failed Leadership, Lost Lives.\n \n The President's concessions to the \"guns anywhere\" mentality of the gun lobby and lack of leadership for common-sense gun laws has earned him a grade of \"F\".\n \n President Obama signed legislation letting people carry concealed weapons in national parks and in checked luggage on Amtrak trains, adopted the gun lobby's empty rhetoric about just \"enforcing the laws on the books,\" and muzzled Cabinet members who expressed support for stronger gun laws. \n \n In addition, the White House voiced no objection to people carrying guns near Presidential events and his White House staff removed statements from the White House website that declared support for gun violence prevention laws.\n \n \n What a traitor!\n\n \n Talking about traitors, brady you are IT. Meanwhile on the other board you started previous to cutting and running like the coward you obviously are, Bryan posted a challenge to you. If you choose to accept the challenge which I have money that you do not accept, (so don't dissapoint me), be sure to read his guidelines so you will not make strawman arguments and red herring arguments. I am betting you cannot carry on a sustained debate without falling flat on your face emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   391611, 
   null, 
   1266847380.0
  ], 
  [
   391641, 
   null, 
   "COBHC", 
   "\n What a traitor!\n\n \n Or maybe it was his reaction to the outcome of Heller vs. DC, which resulted in the lowest number of homicides since 1966. The facts aren't on your side, Brady.\n \n This is probably the only thing Obama ever did politically that I agree with.", 
   {}, 
   391611, 
   null, 
   1266848220.0
  ], 
  [
   391796, 
   null, 
   "Brady", 
   "# There were 7,387 black homicide victims in the United States. Of these, 6,345 (86 percent) were male, and 1,042 (14 percent) were female.\n \n # The homicide rate for black victims in the United States was 20.86 per 100,000. In comparison, the overall national homicide rate was 5.30 per 100,000 and the national homicide rate for whites was 3.11 per 100,000.\n \n # For homicides in which the weapon used could be identified, 82 percent of black victims (5,743 out of 7,011) were killed with guns. Of these, 73 percent (4,204 victims) were killed with handguns. There were 701 victims killed with knives or other cutting instruments, 247 victims killed by bodily force, and 200 victims killed by a blunt object. \n \n Hes betrayed his own people!", 
   {}, 
   391641, 
   null, 
   1266885900.0
  ], 
  [
   391804, 
   null, 
   "NATO 556", 
   "# There were 7,387 black homicide victims in the United States. Of these, 6,345 (86 percent) were male, and 1,042 (14 percent) were female.\n \n # The homicide rate for black victims in the United States was 20.86 per 100,000. In comparison, the overall national homicide rate was 5.30 per 100,000 and the national homicide rate for whites was 3.11 per 100,000.\n \n # For homicides in which the weapon used could be identified, 82 percent of black victims (5,743 out of 7,011) were killed with guns. Of these, 73 percent (4,204 victims) were killed with handguns. There were 701 victims killed with knives or other cutting instruments, 247 victims killed by bodily force, and 200 victims killed by a blunt object. \n \n Hes betrayed his own people!\n\n \n It's all very interesting, but you left out a critical piece of information. You deliberately omitted the fact that most of the black victims were killed by fellow blacks. These weren't murders carried out by racist white guys, they're the examples of black on black violence.", 
   {}, 
   391796, 
   null, 
   1266886440.0
  ], 
  [
   391818, 
   null, 
   "Brady", 
   "It's all very interesting, but you left out a critical piece of information. You deliberately omitted the fact that most of the black victims were killed by fellow blacks. These weren't murders carried out by racist white guys, they're the examples of black on black violence.\n\n So what?\n Most of them are still getting killed with guns. \n \n A Red Herring is a fallacy in which an irrelevant topic is presented in order to divert attention from the original issue. The basic idea is to \"win\" an argument by leading attention away from the argument and to another topic. This sort of \"reasoning\" has the following form:\n \n 1. Topic A is under discussion.\n 2. Topic B is introduced under the guise of being relevant to topic A (when \n topic B is actually not relevant to topic A).\n 3. Topic A is abandoned.", 
   {}, 
   391804, 
   null, 
   1266887580.0
  ], 
  [
   391821, 
   null, 
   "NATO 556", 
   "So what? Most of them are still getting killed with guns.\n \n \n Most of them happening in the inner cities of Illinois, New York and California - states where the restricted access of firearms is supposedly designed to keep acts like these from happening.\n \n Who's the real traitor in this case; Obama for not passing your gun control package? Or the black guys that feel the need to kill their fellow black men for whatever reason motivates them?", 
   {}, 
   391818, 
   null, 
   1266887880.0
  ], 
  [
   391824, 
   null, 
   "Doc Jones", 
   "So what?\n Most of them are still getting killed with guns. \n \n A Red Herring is a fallacy in which an irrelevant topic is presented in order to divert attention from the original issue. The basic idea is to \"win\" an argument by leading attention away from the argument and to another topic. This sort of \"reasoning\" has the following form:\n \n 1. Topic A is under discussion.\n 2. Topic B is introduced under the guise of being relevant to topic A (when \n topic B is actually not relevant to topic A).\n 3. Topic A is abandoned.\n\n \n You just committed one then !\n \n Stick around brady, I reckon Bryan will be along directly?\n \n Always ask yourself, what would MLK say.", 
   {}, 
   391818, 
   null, 
   1266888240.0
  ], 
  [
   391827, 
   null, 
   "Doc Jones", 
   "So what?\n Most of them are still getting killed with guns. \n \n A Red Herring is a fallacy in which an irrelevant topic is presented in order to divert attention from the original issue. The basic idea is to \"win\" an argument by leading attention away from the argument and to another topic. This sort of \"reasoning\" has the following form:\n \n 1. Topic A is under discussion.\n 2. Topic B is introduced under the guise of being relevant to topic A (when \n topic B is actually not relevant to topic A).\n 3. Topic A is abandoned.\n\n \n No, most are not getting killed with guns! In fact, guns are far down the list of accidental deaths !", 
   {}, 
   391818, 
   null, 
   1266888420.0
  ], 
  [
   391875, 
   null, 
   "zsu2357", 
   "# There were 7,387 black homicide victims in the United States. Of these, 6,345 (86 percent) were male, and 1,042 (14 percent) were female.\n \n # The homicide rate for black victims in the United States was 20.86 per 100,000. In comparison, the overall national homicide rate was 5.30 per 100,000 and the national homicide rate for whites was 3.11 per 100,000.\n \n # For homicides in which the weapon used could be identified, 82 percent of black victims (5,743 out of 7,011) were killed with guns. Of these, 73 percent (4,204 victims) were killed with handguns. There were 701 victims killed with knives or other cutting instruments, 247 victims killed by bodily force, and 200 victims killed by a blunt object. \n \n Hes betrayed his own people!\n\n OMG Brady, he betrayed HIS PEOPLE? and I thought WE THE PEOPLE were his people.emoticon_rolleyes", 
   {}, 
   391796, 
   null, 
   1266899640.0
  ], 
  [
   391880, 
   null, 
   "COBHC", 
   "# There were 7,387 black homicide victims in the United States. Of these, 6,345 (86 percent) were male, and 1,042 (14 percent) were female.\n \n # The homicide rate for black victims in the United States was 20.86 per 100,000. In comparison, the overall national homicide rate was 5.30 per 100,000 and the national homicide rate for whites was 3.11 per 100,000.\n \n # For homicides in which the weapon used could be identified, 82 percent of black victims (5,743 out of 7,011) were killed with guns. Of these, 73 percent (4,204 victims) were killed with handguns. There were 701 victims killed with knives or other cutting instruments, 247 victims killed by bodily force, and 200 victims killed by a blunt object. \n \n Hes betrayed his own people!\n\n \n Because most black neighborhoods are in big cities, and most big cities have tough gun laws.", 
   {}, 
   391796, 
   null, 
   1266901140.0
  ], 
  [
   391899, 
   null, 
   "Clanard", 
   "So what?\n Most of them are still getting killed with guns. \n\n \n \n \n Yeah they were. Mostly killed by criminals with guns. Now prove that any legislation that Obama could have enacted would have prevented those deaths.\n \n \n \n \n \n I'm not holding my breath and I'm not expecting a rational response either...", 
   {}, 
   391818, 
   null, 
   1266914760.0
  ], 
  [
   391906, 
   null, 
   "jazyjason", 
   "I'd say Obama gets an \"F\" for fun!!!! emoticon_xgood", 
   {}, 
   391899, 
   null, 
   1266916620.0
  ], 
  [
   391959, 
   null, 
   "Bryan", 
   "The Brady Center has released a report on President Obama's performance called President Obama's First Year: Failed Leadership, Lost Lives.\n \n The President's concessions to the \"guns anywhere\" mentality of the gun lobby and lack of leadership for common-sense gun laws has earned him a grade of \"F\".\n \n President Obama signed legislation letting people carry concealed weapons in national parks and in checked luggage on Amtrak trains, adopted the gun lobby's empty rhetoric about just \"enforcing the laws on the books,\" and muzzled Cabinet members who expressed support for stronger gun laws. \n \n In addition, the White House voiced no objection to people carrying guns near Presidential events and his White House staff removed statements from the White House website that declared support for gun violence prevention laws.\n \n \n What a traitor!\n\n \n Here is the link to the report Brady mentions:\n \n http://www.bradycampaign.org/xshare/reports/fedleg/obama-1styear-report.pdfBrady\n \n I'm sorry, Brady, that you feel Obama has betrayed you by supporting (or at least not opposing) a few gun owner friendly initiatives. And here I thought this was supposed to be change you could believe in. Have you ever thought to consider he does so because he thinks it is the right thing to do? Are you willing to consider his motives and give him the benefit of the doubt? Probably not. You probably think he is just afraid to upset gun owners. And there is probably some truth in this. Based upon his past rhetoric I do not doubt that Obama would push gun control if he thought he could. But you have to look at things from his perspective-a \"what is best for me as politician\" viewpoint. \n \n You have only yourself to blame if you're disappointed in Obama. It was you and people like you at the BC who placed such unrealistic hopes in him without considering how little he needed your support. Guns were not an issue in his election, and contrary to whatever you might believe he does not owe his position to the support of the BC. Really now, with everything else he is trying to accomplish, what do the complaints of a fringe anti-gun group with limited membership matter to him? It's not like you and the other BC supporters are going to vote for Sarah Palin in the next election. At worst, Obama knows you could grow petulant and boycott him by refusing to vote at all in the next election. But he can calculate how few votes he would really loose. \n \n Look at it from his perspective, Brady. The BC competes directly with the NRA. Both organizations make their own arguments, use their own rhetoric, cite their own statistics and studies, and yet it is the NRA which dominates with membership. The bottom line is the NRA and BC have for years gone head to head in the free marketplace of ideas, and the BC has lost. It is the NRA which has several million members, not the BC. And, in addition to normal membership fundraising there are hundreds of non-profit tax-exempt Friends of the National Rifle Association fundraising committees nationwide. Friends of NRA, National Rifle Association of America Each one is a local grassroots organization made up of volunteer community business and social leaders, and each one hosts an annual banquet to raise money which is spent back in the local community-primarily for youth shooting sports and education to ensure the future of responsible gun ownership in America. The BC has no way to challenge this kind of grassroots power. The NRA offers a positive message to its members. You have the right to keep and bear arms. You can be trusted to make decisions about the security of yourself and your family. Punish the criminal, and leave the law abiding alone. The NRA dominates the political landscape because, like AARP, this message attracts millions of members. People who are willing to donate their time, their money, and cast their votes to support the RKBA. People like me, Brady, who have done more to fight gun crime this month than you have done in your entire life. \n \n Look at it from Obama's perspective, Brady. What does the BC offer to oppose this? It peddles fear. It offers tired complaints about how people cannot be trusted to care for themselves. It takes hypocritical positions which undermine its credibility. For example, it claimed the NRA's \"Eddie Eagle\" program message was ineffective, and then it decided to sell the exact same message under its own name. http://www.4forums.com/political/gun-control-debates/12966-chilling-resemblance-between-north-korean-indoctrination-eddie-eagle-program.html#post360048 It still offers a re-tread of a failed \"assault weapons ban\"-despite knowing it was a failure. And it has supporters like you, Brady-people who want the failed AW Ban back so bad they are willing to make up a lie to sell it to us, only to run away and hide when you got caught lying: http://www.4forums.com/political/gun-control-debates/11381-rise-police-deaths-because-no-ban-assault-weapons.html No, I haven't forgotten that one. \n \n Brady, you cannot expect Obama to waste political capital fighting against such a large number of gun owning voters over ideas so bankrupt you must make up lies to support them. And don't call him a traitor when you know you've given him no cause to feel confident in your own support of him. If he took on gun owners, then do you really think he can rely upon the support of someone like you who lies and then runs away at the first sign of a challenge? If you really want his support, then first offer him something he can actually sell to the public with a straight face and then give him some assurance you won't run away at the first sign of trouble.", 
   {
    "post_info": {
     "post_title": "Change you can believe in?"
    }, 
    "unicode_changes_made": true
   }, 
   391611, 
   null, 
   1266948900.0
  ], 
  [
   392234, 
   null, 
   "NATO 556", 
   "Just an observation on the subject.\n \n Obama's the current POTUS, a liberal, a democrat, and a long record voting in favor of gun control.\n \n Congress had a liberal, democrat supermajority that could override any conservative filibuster attempt and, at least in theory, pass through any and all laws they wanted, without debate, without obstruction, and get it bumped to Obama within the course of a day if they really wanted.\n \n These liberal democrats obviously aren't NRA members, they were passing bills that the public hated without hesitation because they were in charge and had free run of the place. So why, in this gun-hater's dream come true of congress, did they choose not to advance a single gun control bill and have it signed into law?\n \n They faced no opposition of any sort, they weren't likely to be moved by the concerned of the millions of NRA members in this country, and they likely felt duty bound to make gun control bills into law. But they didn't. In fact they helped tear down several previously standing gun control laws.\n \n So Brady, Penfold, Galileo, etc. one has to ask why? Could it be even liberals have no appetite for gun control anymore?", 
   {}, 
   391611, 
   null, 
   1267030500.0
  ], 
  [
   392290, 
   null, 
   "Doc Jones", 
   "HERE YA GO BRADY, ACCEPT BRYAN'S CHALLENGE AND WE WILL STAY OUT OF IT. JUST YOU AND HIM WITH HALF HIS BRAIN TIED BEHIND HIS BACK TO MAKE IT FAIR emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "brady:"
    }
   }, 
   392234, 
   null, 
   1267044180.0
  ], 
  [
   392292, 
   null, 
   "Doc Jones", 
   "all right brady, we will tie 3/4ths of his brain behind his back and stay out of it. Like those odds?", 
   {
    "post_info": {
     "post_title": "brady"
    }
   }, 
   392290, 
   null, 
   1267044360.0
  ], 
  [
   392294, 
   null, 
   "Doc Jones", 
   "all right brady, we will tie 3/4ths of his brain behind his back and stay out of it. Like those odds?\n\n \n What's that smell? Did someone leave the bathroom door open?", 
   {}, 
   392292, 
   null, 
   1267044840.0
  ], 
  [
   393652, 
   null, 
   "Galileo", 
   " So why, in this gun-hater's dream come true of congress, did they choose not to advance a single gun control bill and have it signed into law?\n \n\n I don't find it surprising. It's probably a strategic sacrifice on their part rather than a change in their personal views . They don't want to lose votes and possible support from gun owners for their priorities like health care reform because of a difference of opinion on gun control policy. They know that the Republicans are going to hit them with everything they've got during election time and exaggerated accusations about the Democrats wanting to take away people's guns would hurt them. The Republicans learned during the Clinton years that creating as much as paranoia as possible about the Democrats supporting big government is the way to regain a majority in Congress. It's all politics.", 
   {}, 
   392234, 
   null, 
   1268055180.0
  ], 
  [
   393660, 
   null, 
   "NATO 556", 
   "The Republicans learned during the Clinton years that creating as much as paranoia as possible about the Democrats supporting big government is the way to regain a majority in Congress. It's all politics.\n\n \n You call the signing of the 1994 \"Assault Weapons Ban\" into law, which banned the sale of so-called \"assault weapons\", simple paranoia?", 
   {}, 
   393652, 
   null, 
   1268061840.0
  ], 
  [
   393956, 
   null, 
   "IME", 
   "Its simple, all you XXXXXXX. If the President disarms America, the crinimals would still have guns. Not the good citizens of the US, leaving us defensless. This is exactly like the drug issues, we CANNOT fully stop the flow. This is the same with arms. Come the time of Anarchy, and guns have been banned, we are screwd. Think about it.", 
   {}, 
   391796, 
   null, 
   1268202480.0
  ], 
  [
   396792, 
   null, 
   "cabellman", 
   "[QUOTE=IME;393956]If the President disarms America, the crinimals would still have guns. Not the good citizens of the US, leaving us defensless. This is exactly like the drug issues, we CANNOT fully stop the flow. This is the same with arms. QUOTE]\n \n This is exactly right, if you wanted to sneak an illegal weapon (or anything for that matter) into the united states you could just hide it in a shipment of cocaine we all know that gets into the united states dispite the best efforts of the police", 
   {}, 
   393956, 
   null, 
   1270167960.0
  ], 
  [
   436560, 
   null, 
   "Bigley", 
   "Well, I am wondering that when the this president was elected in 2008, He \n claimed for the establishment of peace throughout the world, but he couldn't. \n He continued the Bush's policies. \n I wanna know that whats about the wars in Afghanistan and Iraq?\n NO use at all.\n A point to think a lot.", 
   {}, 
   391906, 
   null, 
   1312969860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  An F for Obama", 
  "url": "http://www.4forums.com/political/gun-control-debates/13932-f-obama.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13932, 
  "discussion_files": [
   [
    "27440.html", 
    "http://www.4forums.com/political/gun-control-debates/13932-f-obama-print.html"
   ], 
   [
    "27441.html", 
    "http://www.4forums.com/political/gun-control-debates/13932-f-obama-2-print.html"
   ]
  ], 
  "identifier": 13932
 }
]