[
 [
  [
   392238, 
   null, 
   "Tither", 
   "  Boom in Gun Sales Benefits WildlifeXAgencies \n Receipts for the Pitman-Robertson Fund, funded by an excise tax on guns and ammunition, are up 40 percent across the country. Adam Brooks, federal aid program manager for Montana Fish, Wildlife and Parks, said that has meant a $3.5 million increase in cash for wildlife conservation in the state.\n \n The tax, which is collected by the federal government, is levied on firearm and ammunition manufacturers, and the proceeds are distributed based on states' shares of hunters and habitat. Brooks said Montana's $12.5 million cut was delivered Feb. 12. \n\n Gun owners. That is who.", 
   {
    "post_info": {
     "post_title": "Who pays for wildlife conservation?"
    }
   }, 
   null, 
   null, 
   1267031160.0
  ], 
  [
   392245, 
   null, 
   "Doc Jones", 
   "  Boom in Gun Sales Benefits WildlifeXAgencies \n Gun owners. That is who.\n\n \n Indeed! and who bought the 'Park' to begin with? Hunters and fishermen through license fees, federal duck(migratory bird) stamps and fishing license fees as well as ammo, fishing tackle, archery, and other assorted fees. Who pays the park rangers? Gun owners and target shooters and fishermen, that's who.\n \n Strange they get uppity when a gun owner wants access to the land they paid for and somehow don't make the connection that those who carry those guns into their parks also bought them and pay for their salary.", 
   {}, 
   392238, 
   null, 
   1267034700.0
  ], 
  [
   392248, 
   null, 
   "NATO 556", 
   "I remember reading somewhere that hunting generates about $69 billion in revenue annually. That's quite a large chunk of change right there.", 
   {}, 
   392245, 
   null, 
   1267035960.0
  ], 
  [
   392250, 
   null, 
   "Doc Jones", 
   "I remember reading somewhere that hunting generates about $69 billion in revenue annually. That's quite a large chunk of change right there.\n\n \n The gun grabbers contribute hot air that causes \"global warming\". Not a fair contribution to humanity I would say...", 
   {}, 
   392248, 
   null, 
   1267036380.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who pays for wildlife conservation?", 
  "url": "http://www.4forums.com/political/gun-control-debates/13952-who-pays-wildlife-conservation.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 13952, 
  "discussion_files": [
   [
    "8553.html", 
    "http://www.4forums.com/political/gun-control-debates/13952-who-pays-wildlife-conservation-print.html"
   ]
  ], 
  "identifier": 13952
 }
]