[
 [
  [
   392776, 
   null, 
   "Esdraelon", 
   "One of the most problematic passages of the New Testament is where the gospel writers claim that the earth went dark during part of the time that Jesus hung on the cross. Some claim that it was just a literary device to stress the significance of the Crucifixion, and not a historical reference. After all, if darkness had fallen over the earth, wouldn't there be some mention of this extraordinary event outside the Bible?\n \n Dr. Gary Habermas has written about a historian named Thallus who in AD 52 wrote a history of the Mediterranean world since the Trojan War. Although Thallus's work has been lost, it was quoted by Julius Africanus in about AD 221-and it made reference to the darkness that the gospels had written about. \n In this passage, Africanus says 'Thallus , in the third book of his histories, explains away the darkness as an eclipse of the sun-unreasonably as it seems to me.\"\n \n So Thallus was apparently saying that there had been darkness at the time of the Crucifixion, and he speculated that it had been caused by an eclipse. Africanus then argues that it could not have been an eclipse given when the Crucifixion occurred.\n \n Scholar Paul Maiersaid of the darkness in a 1968 book , Pontius Pilate, \n This phenomenon was visible in Rome, Athens, and other Mediterranean cities. According to Tertullian....it was a 'cosmic' or 'world event'. Phlegon, a Greek author from Caria writing a chronology soon after 137 AD, reported that in the fourth year of the 202nd Olympiad (i.e. 33 AD)there was \"the greatest eclipse of the sun\" and that it became night in the sixth hour of the day (noon) so that the stars even appeared in the heavens. There was a great earthquake in Bithynia and many things were overturned in Nicaea.\" 1\n \n So there it is as Paul Maire points out, non-biblical attestation of the darkness that appeared at the time of Jesus' crucifixion. Apparently some found the need to try to give it a natural explanation by calling it an eclipse. \n \n 1-Paul L. Maier, Pontius Pilate,(Wheaton, Illinios, Tyndale House, 1968) 366 citing a fragment from Phlegon, Olympiades he Chronica 13, ed. Otto Keller, Rerum Naturalium Scriptores Graeci Minores, 1(Leipzig: Teurber, 1877), 101, translation by Maier.", 
   {
    "post_info": {
     "post_title": "The Day The Earth Went Dark"
    }
   }, 
   null, 
   null, 
   1267323060.0
  ], 
  [
   392783, 
   null, 
   "Easyrider", 
   "Amen, brother!\n \n The Sun Darkened at Noon\n \n Circa 750 B.C.\n \n According to Amos 1:1, Amos prophesied during the reigns of Uzziah, king of Judah (767-739 B.C.), and Jeroboam, king of Israel (782-753 B.C.). The name \"Amos\" is derived from the Hebrew term meaning, \"lift a burden,\" or \"burden-bearer\" (note Isaiah 9:4, speaking of the coming Messiah as one who would carry our burdens, and also Matthew 11:28). His calling by God was to foretell of pending judgments upon a number of surrounding nations, and particularly of a coming judgment upon Israel. As is common with other Biblical prophets, along with the promise of impending judgment, God also gave Amos a glimpse of events that would soon occur in the life of the coming Messiah, though the significance of what was prophesied may or may not have been made known to Amos. And so it is in the Old Testament book of Amos that we find a prophecy that for many centuries was looked upon with wonder and curiosity:\n \n \"'In that day,' declares the Sovereign Lord, 'I will make the sun go down at noon and darken the earth in broad daylight....I will make that time like mourning for an only son, and the end of it like a bitter day.'\" (Amos 8:9-10)\n \n It probably wasn't until the day of the crucifixion of Jesus Christ in 32 A.D. that the prophecy of Amos took on clarity and meaning, for in Matthew 27:45 Jesus had just been nailed to the cross when the Bible records:\n \n \"From the sixth hour until the ninth hour darkness came over all the land.\"\n \n Just as the \"Star of Bethlehem\" marked the birth of Christ, so now God brought forth another celestial miracle to pronounce His death. This prophecy is one of those that is beyond the control of mortal man, and as such it dispels the theory that Christ could have manipulated events so as to make it appear that He was the Messiah. But is there any evidence that this really occurred? Did the sun go dark at noonday? In his book, Evidence That Demands a Verdict (Volume 1, pages 81-87), Josh McDowell provides the following historical evidence that what took place at Calvary was more that just fanciful mythology:\n \n Concerning the Samaritan-born historian Thallus, circa 52 A.D: (The writings of Thallus no longer exist, yet were alluded to by the historian Julius Africanus, as follows): \"Thallus, in the third book of his histories, explains away this darkness as an eclipse of the sun - unreasonably, as it seems to me - unreasonably, of course, because a solar eclipse could not take place at the time of a full moon, and it was at the season of the Paschal full moon that Christ died.\"\n \n Likewise, Africanus wrote concerning the writings of another first century historian by the name of Phlegon: \"....during the time of Tiberius Caesar an eclipse of the sun occurred during the full moon.\" \n \n Phlegon is also mentioned by the historian Origen in his work, \"Contra Celsum,\" book 2, sections 14, 39, and 59: \"Phlegon mentioned the eclipse that took place during the crucifixion of the Lord Christ....and this is shown by the historical account itself of Tiberius Caesar.\" Apparently at one time there were historical accounts of the strange darkness that came over the land that were kept in the official archives of Tiberius Caesar, though they are likely lost to history.\n \n Finally, the 2nd century Roman born jurist and theologian Tertullian referred to a Roman archives report of an \"unexplained darkness that took place during the reign of Tiberius Caesar, as can be seen in the archives of Pontius Pilate.\"\n \n The darkness spoken of in the book of Matthew occurred between noon and three P.M. in the afternoon (from the sixth to the ninth hours, as the Jews were noted as referring to the sixth and the ninth hours of daylight). Note that a solar eclipse will take less than an hour to complete, and a total solar eclipse lasts just a few minutes. This, coupled with the fact that a solar eclipse cannot occur during a full moon (the moon would be on the 'other' side of the earth), provides further evidence that what occurred was something other than an eclipse of the sun. Just what it was no one can say for sure, just that from recorded historical sources there was a strange darkness during the time of the crucifixion of Jesus Christ. From God's perspective, it surely was a time of mourning for His only begotten son. \n \n Jesus once said, \"I am the light of the world.\" So it shouldn't be surprising that during his death there might be a time of darkness over the land. \n \n So there you have it: The prophecy, the Biblical fulfillment, and extra-biblical confirmations. History doesn't get any better than that.\n \n Jesus is Lord!", 
   {}, 
   392776, 
   null, 
   1267324740.0
  ], 
  [
   392786, 
   null, 
   "pappillion001", 
   "One of the most problematic passages of the New Testament is where the gospel writers claim that the earth went dark during part of the time that Jesus hung on the cross. Some claim that it was just a literary device to stress the significance of the Crucifixion, and not a historical reference. After all, if darkness had fallen over the earth, wouldn't there be some mention of this extraordinary event outside the Bible?\n \n Dr. Gary Habermas has written about a historian named Thallus who in AD 52 wrote a history of the Mediterranean world since the Trojan War. Although Thallus's work has been lost, it was quoted by Julius Africanus in about AD 221-and it made reference to the darkness that the gospels had written about. \n In this passage, Africanus says 'Thallus , in the third book of his histories, explains away the darkness as an eclipse of the sun-unreasonably as it seems to me.\"\n \n So Thallus was apparently saying that there had been darkness at the time of the Crucifixion, and he speculated that it had been caused by an eclipse. Africanus then argues that it could not have been an eclipse given when the Crucifixion occurred.\n \n Scholar Paul Maiersaid of the darkness in a 1968 book , Pontius Pilate, \n This phenomenon was visible in Rome, Athens, and other Mediterranean cities. According to Tertullian....it was a 'cosmic' or 'world event'. Phlegon, a Greek author from Caria writing a chronology soon after 137 AD, reported that in the fourth year of the 202nd Olympiad (i.e. 33 AD)there was \"the greatest eclipse of the sun\" and that it became night in the sixth hour of the day (noon) so that the stars even appeared in the heavens. There was a great earthquake in Bithynia and many things were overturned in Nicaea.\" 1\n \n So there it is as Paul Maire points out, non-biblical attestation of the darkness that appeared at the time of Jesus' crucifixion. Apparently some found the need to try to give it a natural explanation by calling it an eclipse. \n \n 1-Paul L. Maier, Pontius Pilate,(Wheaton, Illinios, Tyndale House, 1968) 366 citing a fragment from Phlegon, Olympiades he Chronica 13, ed. Otto Keller, Rerum Naturalium Scriptores Graeci Minores, 1(Leipzig: Teurber, 1877), 101, translation by Maier.\n\n \n This is long but comes across I think pretty fair concerning this. If your interested\n \n Thallus: an Analysis\n \n Personally I don't like Habermas. I think William Lane Craig is tops on debating for Christianity but that might be because he makes my head hurt after about 5 minutes", 
   {}, 
   392776, 
   null, 
   1267329720.0
  ], 
  [
   392788, 
   null, 
   "Esdraelon", 
   "This is long but comes across I think pretty fair concerning this. If your interested\n \n Thallus: an Analysis\n \n Personally I don't like Habermas. I think William Lane Craig is tops on debating for Christianity but that might be because he makes my head hurt after about 5 minutes\n\n \n Noted: Richard Cevantis Carrier (born 1 December 1969) is a published historian[1] and atheist philosopher,[2] best known for his writings on Internet Infidels (otherwise known as the Secular Web), where he served as Editor-in-Chief for several years.[3] As an advocate of metaphysical naturalism, he has published articles in books, journals and magazines, and also features on the documentary film The God Who Wasn't There where he is interviewed about his doubts on the historicity of Jesus.[4] He currently contributes to The God Contention, a web site comparing and contrasting various worldviews.\n \n There are Always going to be opposing views, but I believe the corroboration noted in my post is ....fair. All Carrier has done in his 'conclusion' is mention some counter-possibilities to muddie the water somewhat. As I noted in an unrelated post, even if you people could be given reasonable evidence outside of 'apologists' you would not accept it, so there is little I can do but let the lurkers here decide for themselves. Fair enough, and yes, I believe Carrier was fair. Thank you.", 
   {}, 
   392786, 
   null, 
   1267331100.0
  ], 
  [
   392791, 
   null, 
   "trebor", 
   "One of the most problematic passages of the New Testament is where the gospel writers claim that the earth went dark during part of the time that Jesus hung on the cross. Some claim that it was just a literary device to stress the significance of the Crucifixion, and not a historical reference. After all, if darkness had fallen over the earth, wouldn't there be some mention of this extraordinary event outside the Bible?\n \n Dr. Gary Habermas has written about a historian named Thallus who in AD 52 wrote a history of the Mediterranean world since the Trojan War. Although Thallus's work has been lost, it was quoted by Julius Africanus in about AD 221-and it made reference to the darkness that the gospels had written about. \n In this passage, Africanus says 'Thallus , in the third book of his histories, explains away the darkness as an eclipse of the sun-unreasonably as it seems to me.\"\n \n So Thallus was apparently saying that there had been darkness at the time of the Crucifixion, and he speculated that it had been caused by an eclipse. Africanus then argues that it could not have been an eclipse given when the Crucifixion occurred.\n \n Scholar Paul Maiersaid of the darkness in a 1968 book , Pontius Pilate, \n This phenomenon was visible in Rome, Athens, and other Mediterranean cities. According to Tertullian....it was a 'cosmic' or 'world event'. Phlegon, a Greek author from Caria writing a chronology soon after 137 AD, reported that in the fourth year of the 202nd Olympiad (i.e. 33 AD)there was \"the greatest eclipse of the sun\" and that it became night in the sixth hour of the day (noon) so that the stars even appeared in the heavens. There was a great earthquake in Bithynia and many things were overturned in Nicaea.\" 1\n \n So there it is as Paul Maire points out, non-biblical attestation of the darkness that appeared at the time of Jesus' crucifixion. Apparently some found the need to try to give it a natural explanation by calling it an eclipse. \n \n 1-Paul L. Maier, Pontius Pilate,(Wheaton, Illinios, Tyndale House, 1968) 366 citing a fragment from Phlegon, Olympiades he Chronica 13, ed. Otto Keller, Rerum Naturalium Scriptores Graeci Minores, 1(Leipzig: Teurber, 1877), 101, translation by Maier.\n\n \n \n We do not have any of Thallus' work at all. We only have a comment from Sextus Julius Africanus that claimed in his 3rd book of History , Thallus mentioned a darkness that he claimed was an eclipse. There were several eclipses around that time, as far as we know, it doesn't mention Jesus or a crucifixion at all. The assumption of Africanus in 221 that it was referring to the 'darkness' described in the Gospels is extreme speculation at best. \n \n Africanus states \"\"Thallus, in the third book of his histories, explains away this darkness as an eclipse of the sun.\" \n \n We can not demonstrate that Thallus was talking about the 'gospel' darkness at all. We can't even say positively when he did exist, when he wrote, or what he said. The 'writing in 52 c.e.' is pretty much speculation and fantasy\n \n The first time Thallus is mentioned at all is 180 C.E. and the only reference that is alleged that Thallus said anything past 109 bc was the eclipse. Since we have none of his actual writings, we don't know what he said, when he said it, or in what context. \n \n Sounds like grasping at straws to me.", 
   {}, 
   392776, 
   null, 
   1267335000.0
  ], 
  [
   392798, 
   null, 
   "Penfold", 
   "Trebor. If it can be made to support the delusion, it must be true. :xbanghead\n \n One pixel in this photo is where we live, and is all we have. Imagine a room, with sunlight shining in the window, illuminating a mote of dust. Then imagine an alien being who not only cares about such a mote, but is personally aware of every single microbe and it's family, and their entire history, which lives on that mote. It's not likely, is it? Let's look after the place a bit better.\n \n http://netcogito.com/blog/wp-content/uploads/2009/09/PaleBlueDot.jpg", 
   {}, 
   392791, 
   null, 
   1267362660.0
  ], 
  [
   392801, 
   null, 
   "Esdraelon", 
   "We do not have any of Thallus' work at all. We only have a comment from Sextus Julius Africanus that claimed in his 3rd book of History , Thallus mentioned a darkness that he claimed was an eclipse. There were several eclipses around that time, as far as we know, it doesn't mention Jesus or a crucifixion at all. The assumption of Africanus in 221 that it was referring to the 'darkness' described in the Gospels is extreme speculation at best. \n \n Africanus states \"\"Thallus, in the third book of his histories, explains away this darkness as an eclipse of the sun.\" \n \n We can not demonstrate that Thallus was talking about the 'gospel' darkness at all. We can't even say positively when he did exist, when he wrote, or what he said. The 'writing in 52 c.e.' is pretty much speculation and fantasy\n \n The first time Thallus is mentioned at all is 180 C.E. and the only reference that is alleged that Thallus said anything past 109 bc was the eclipse. Since we have none of his actual writings, we don't know what he said, when he said it, or in what context. \n \n Sounds like grasping at straws to me.\n\n \n Really...and what was your knowledge of Thallus before you read the top post? Nothing. Thought so. Get of your soap box, and stop reading the teleprompter, Obama.", 
   {}, 
   392791, 
   null, 
   1267365660.0
  ], 
  [
   392802, 
   null, 
   "Easyrider", 
   "Trebor. If it can be made to support the delusion, it must be true. \n\n \n The delusion is yours, Penfold, along with your spiritually-challenged brethren.", 
   {}, 
   392798, 
   null, 
   1267365840.0
  ], 
  [
   392803, 
   null, 
   "Easyrider", 
   "(To Trebor)Really...and what was your knowledge of Thallus before you read the top post? Nothing. Thought so. Get of your soap box, and stop reading the teleprompter, Obama.\n\n \n Trebor is a serial liar and has been caught manufacturing false information before to feed his bias. Here's one such example:\n \n http://www.4forums.com/political/religion-debates/12555-christianity-nut-shell-2.html#post349695", 
   {}, 
   392801, 
   null, 
   1267367760.0
  ], 
  [
   392806, 
   null, 
   "Esdraelon", 
   "This is long but comes across I think pretty fair concerning this. If your interested\n \n Thallus: an Analysis\n \n Personally I don't like Habermas. I think William Lane Craig is tops on debating for Christianity but that might be because he makes my head hurt after about 5 minutes\n\n \n And Craig is very, very good at his work, but there are so many scholars and theologians who defend the faith to call any one of them the top.\n \n And Easyrider: Regards the thread you noted. I read through it. Why am in not shocked?", 
   {}, 
   392786, 
   null, 
   1267373520.0
  ], 
  [
   392885, 
   null, 
   "pappillion001", 
   "Trebor is a serial liar and has been caught manufacturing false information before to feed his bias. Here's one such example:\n \n http://www.4forums.com/political/religion-debates/12555-christianity-nut-shell-2.html#post349695\n\n \n Says the man who has been led off the cliff many a time. \n \n When seeking to determine if one has provided a factual representation of what is being discussed, it is imperative to the process that the one making the assessment do so with evidence that is A) itself valid and truthful and B) is rebutted with something other than \"your wrong\" or similar less than enlightening phrase. In the event that B is the best response possible, it seems your accusation would not be correct.", 
   {}, 
   392803, 
   null, 
   1267445700.0
  ], 
  [
   392886, 
   null, 
   "pappillion001", 
   "Noted: Richard Cevantis Carrier (born 1 December 1969) is a published historian[1] and atheist philosopher,[2] best known for his writings on Internet Infidels (otherwise known as the Secular Web), where he served as Editor-in-Chief for several years.[3] As an advocate of metaphysical naturalism, he has published articles in books, journals and magazines, and also features on the documentary film The God Who Wasn't There where he is interviewed about his doubts on the historicity of Jesus.[4] He currently contributes to The God Contention, a web site comparing and contrasting various worldviews.\n \n There are Always going to be opposing views, but I believe the corroboration noted in my post is ....fair. All Carrier has done in his 'conclusion' is mention some counter-possibilities to muddie the water somewhat. As I noted in an unrelated post, even if you people could be given reasonable evidence outside of 'apologists' you would not accept it, so there is little I can do but let the lurkers here decide for themselves. Fair enough, and yes, I believe Carrier was fair. Thank you.\n\n \n Just wanted to point out the language you use here.\n \n You agree Carrier was fair in his presentation. With that in mind why do you consider these other possibilities being to muddle the water? My sense in reading this is resignation that despite reasonable evidence us people rely on unreasonable evidence. \n \n Maybe yours isn't as reasonable to others as theirs is unreasonable to you. \n \n Not a point to debate, but wondering do you view the evidence objectively or is the conclusion already there?", 
   {}, 
   392788, 
   null, 
   1267446840.0
  ], 
  [
   392889, 
   null, 
   "Easyrider", 
   "Says the man who has been led off the cliff many a time. \n \n When seeking to determine if one has provided a factual representation of what is being discussed, it is imperative to the process that the one making the assessment do so with evidence that is A) itself valid and truthful and B) is rebutted with something other than \"your wrong\" or similar less than enlightening phrase. In the event that B is the best response possible, it seems your accusation would not be correct.\n\n \n It just seems that way, to you.\n \n If you ever get born again you will be able to see the rest of the picture.", 
   {}, 
   392885, 
   null, 
   1267451400.0
  ], 
  [
   392892, 
   null, 
   "Esdraelon", 
   "Just wanted to point out the language you use here.\n \n You agree Carrier was fair in his presentation. With that in mind why do you consider these other possibilities being to muddle the water? My sense in reading this is resignation that despite reasonable evidence us people rely on unreasonable evidence. \n\n \n And your wording is a little ambiguous. Are we now debating 'reasonable'? Whose 'resignation'? You guys always insist on some 'non-apologetic' evidence as the general claim here is that Christians are 'liars' and 'apologetics' are simply to increase the depth of the 'lies', yet, you use an atheist whose 'objectivity' is already set from the start also. I am not overly concerned whether or not there was darkness at the time of the crucifixion, but find it interesting that there is mention of it by non-biblical sources. Of course, you guys Have to challenge such, for it any bit of evidence is available that you guys are wrong on the subject, the other aspects are called into question also. I don't have that problem, for I am not overly concerned about every detail of the matter.\n \n Let me ask you something: how long was it after the death of Alexander that his life story was written? \n \n There were several others mentioned other than Thallus, yet Carrier's article rested solely on Thallus and Africanus, as if Africanus has no basis of fact as well. \n \n \nMaybe yours isn't as reasonable to others as theirs is unreasonable to you. \n \n\n \n ??? I did not say Carrier was 'unreasonable', I said he took what was there was there and based his article on the negative approach. What can you say about the objectivity of the 'others'?\n \n \nNot a point to debate, but wondering do you view the evidence objectively or is the conclusion already there?\n \n\n \n The question is ironical considering that you guys already have your conclusion and it is likely not going to change, as you imply you have assessed ALL the available evidence and came to a verdict. All else is simply defense of that conclusion.\n \n I would say my 'objectivity' is approximately the same as those going at Freedom in the Evolution thread, which, no doubt, you will consider highly objective.", 
   {}, 
   392886, 
   null, 
   1267453920.0
  ], 
  [
   392893, 
   null, 
   "trebor", 
   "And your wording is a little ambiguous. Are we now debating 'reasonable'? Whose 'resignation'? You guys always insist on some 'non-apologetic' evidence as the general claim here is that Christians are 'liars' and 'apologetics' are simply to increase the depth of the 'lies', yet, you use an atheist whose 'objectivity' is already set from the start also. I am not overly concerned whether or not there was darkness at the time of the crucifixion, but find it interesting that there is mention of it by non-biblical sources. Of course, you guys Have to challenge such, for it any bit of evidence is available that you guys are wrong on the subject, the other aspects are called into question also. I don't have that problem, for I am not overly concerned about every detail of the matter.\n \n Let me ask you something: how long was it after the death of Alexander that his life story was written? \n \n There were several others mentioned other than Thallus, yet Carrier's article rested solely on Thallus and Africanus, as if Africanus has no basis of fact as well. \n \n \n \n ??? I did not say Carrier was 'unreasonable', I said he took what was there was there and based his article on the negative approach. \n \n \n \n The question is ironical considering that you guys already have your conclusion and it is likely not going to change, as you imply you have assessed ALL the available evidence and came to a verdict. All else is simply defense of that conclusion.\n \n I would say my 'objectivity' is approximately the same as those going at Freedom in the Evolution thread, which, no doubt, you will consider highly objective.\n\n \n Well, let's see those 'other sources'??? As for Alexander (by the way, that is a total straw man), we have contemporary sources that attest to his existence, .. in other words, writings written in the time frame that he was alive. \n \n Let's take a look at those other sources besides Africanas... and do the same kind of analysis of where, who and how.", 
   {}, 
   392892, 
   null, 
   1267454820.0
  ], 
  [
   392894, 
   null, 
   "Esdraelon", 
   "Well, let's see those 'other sources'??? As for Alexander (by the way, that is a total straw man), we have contemporary sources that attest to his existence, .. in other words, writings written in the time frame that he was alive. \n \n Let's take a look at those other sources besides Africanas... and do the same kind of analysis of where, who and how.\n\n \n You can straw all you like. 'Contemporary sources'? Surely you jest. The earliest 'complied biography' is almost 600 years after the death of Alexander, and most 'contemporary sources' use even later compilations. And historians find it acceptable. It is not a 'straw man', simply pointing out the point.", 
   {}, 
   392893, 
   null, 
   1267455360.0
  ], 
  [
   392896, 
   null, 
   "trebor", 
   "You can straw all you like. 'Contemporary sources'? Surely you jest. The earliest 'complied biography' is almost 600 years after the death of Alexander, and most 'contemporary sources' use even later compilations. And historians find it acceptable. It is not a 'straw man', simply pointing out the point.\n\n \n Nonsense. I am talking about the astrological diaries. We have the original clay tablets that mention him attacking a specific city, and the priests who made the clay tablets were basically astronomers that took astronomical observations, and made comments about historical events that happened at that same time. \n \n `While it does not confirm the details of his personal life, it confirms his existence, and some of the military events that are attributed to him.\n \n So, yes, we have contemporary evidence of the existence of Alexander in his life time. We also have a lot more independent references to Alexander, as well as first hand accounts of people viewing his body as it was on display. \n \n We also have the references of  Callisthenes who wrote about Alexander when Alexander was still alive. While we do not have his writings directly, the later sources you claim attributed their information to him.\n \n Now, as far as I can see, you brought up Alexander to distract from the weakness of your own claim. You are the one that brought up Africanius for the 'Darkness', then you are saying there are other sources when it was pointed out how much the evidence for the 'darkness' is exaggerated and pumped up. Then you claim 'other sources'. Let's see those 'other sources'.", 
   {}, 
   392894, 
   null, 
   1267457340.0
  ], 
  [
   392897, 
   null, 
   "Esdraelon", 
   "Nonsense. I am talking about the astrological diaries. We have the original clay tablets that mention him attacking a specific city, and the priests who made the clay tablets were basically astronomers that took astronomical observations, and made comments about historical events that happened at that same time. \n \n `While it does not confirm the details of his personal life, it confirms his existence, and some of the military events that are attributed to him.\n \n So, yes, we have contemporary evidence of the existence of Alexander in his life time. We also have a lot more independent references to Alexander, as well as first hand accounts of people viewing his body as it was on display. \n \n We also have the references of  Callisthenes who wrote about Alexander when Alexander was still alive. While we do not have his writings directly, the later sources you claim attributed their information to him.\n \n Now, as far as I can see, you brought up Alexander to distract from the weakness of your own claim. You are the one that brought up Africanius for the 'Darkness', then you are saying there are other sources when it was pointed out how much the evidence for the 'darkness' is exaggerated and pumped up. Then you claim 'other sources'. Let's see those 'other sources'.\n\n \n Where did I suggest I doubt the 'existence' of Alexander? And how many of those earliest works were lost in antiquity? The point is that the earliest accepted biography of Alexander that is available is nearly 600 years after his death. There are some earlier but generally not accepted. \n \n Go back and read the top post, there is no 'then you claim'.", 
   {}, 
   392896, 
   null, 
   1267457880.0
  ], 
  [
   392898, 
   null, 
   "trebor", 
   "Where did I suggest I doubt the 'existence' of Alexander?\n\n \n You said 'You can straw all you like. 'Contemporary sources'? Surely you jest. The earliest 'complied biography' is almost 600 years after the death of Alexander, and most 'contemporary sources' use even later compilations. And historians find it acceptable. It is not a 'straw man', simply pointing out the point.'\n \n Now, the one thing about the 'death of Alexander', it did not involve any 'supernatural' claims. \n \n The 'Darkness' does. \n \n We do see people dying every day. Verifiable supernatural events.. well, so far many claims, no tangible evidence.", 
   {}, 
   392897, 
   null, 
   1267458000.0
  ], 
  [
   392902, 
   null, 
   "Esdraelon", 
   "You said 'You can straw all you like. 'Contemporary sources'? Surely you jest. The earliest 'complied biography' is almost 600 years after the death of Alexander, and most 'contemporary sources' use even later compilations. And historians find it acceptable. It is not a 'straw man', simply pointing out the point.'\n\n \n \nNow, the one thing about the 'death of Alexander', it did not involve any 'supernatural' claims. \n\n \n Agreed.\n \n \nThe 'Darkness' does. \n \n\n \n Really? The 'sources' ALL attested to the fact of the 'darkness', however they attributed it to an eclipse.....\n \n \nWe do see people dying every day. Verifiable supernatural events.. well, so far many claims, no tangible evidence.\n \n\n \n And you veer off again. It is how authentication of history is done. 'Tangible' evidence of 'supernatural' events in the distant past is that which is generally accepted. I don't say that the top post is 'generally' accepted as I don't know, but I believe it is reasonable evidence. Atheists, naturally will not accept that.", 
   {}, 
   392898, 
   null, 
   1267459680.0
  ], 
  [
   392909, 
   null, 
   "trebor", 
   "\n Really? The 'sources' ALL attested to the fact of the 'darkness', however they attributed it to an eclipse.....\n \n\n \n Really?? Do they?? Let's see those sources. Like I pointed out, the main source quotes Thallus. We do not have the original words from Thallus, We have a quote from Africanus from Thallus that says Africanus does not think it was an eclipse, but we don't know what Thallus said.\n \n The earliest reference to any of Thallus' work is 180 C.E, and all other references to Thallus talk about his histories that are related to the period that end in 109 BC. We have no firm knowledge of the date he wrote, or if indeed his reference to an eclipse was in the 1st century at all. We don't know if he mentioned Jesus.\n \n Let's look at those other references.. and see when they were referenced, and let's see exactly what they said. You made the claim, you provide who/what and we can see about it.", 
   {}, 
   392902, 
   null, 
   1267464000.0
  ], 
  [
   392912, 
   null, 
   "trebor", 
   "And you veer off again. It is how authentication of history is done. 'Tangible' evidence of 'supernatural' events in the distant past is that which is generally accepted. I don't say that the top post is 'generally' accepted as I don't know, but I believe it is reasonable evidence. Atheists, naturally will not accept that.\n\n \n Well, I know that when it comes to the stories written about Alexander, I know that the events are phyiscally possible, but I am agnostic if they are correct in details.\n \n Let's see the actual words of someone who is reporting the 'darkness at noon', and not just references to those words. Africanus only mentioned Thallus talked about 'an eclipse'. We don't know what thallus said.\n \n Let's see some meat, and not some illusions.", 
   {}, 
   392902, 
   null, 
   1267464300.0
  ], 
  [
   393008, 
   null, 
   "pappillion001", 
   "And your wording is a little ambiguous. Are we now debating 'reasonable'? Whose 'resignation'? You guys always insist on some 'non-apologetic' evidence as the general claim here is that Christians are 'liars' and 'apologetics' are simply to increase the depth of the 'lies', yet, you use an atheist whose 'objectivity' is already set from the start also. I am not overly concerned whether or not there was darkness at the time of the crucifixion, but find it interesting that there is mention of it by non-biblical sources. Of course, you guys Have to challenge such, for it any bit of evidence is available that you guys are wrong on the subject, the other aspects are called into question also. I don't have that problem, for I am not overly concerned about every detail of the matter.\n\n \n \n The post was about mindset and the Christian position that fact must conform to scripture. I won't deny the opposite is true, but it happens less frequently. \n \n Resignation is your acceptance that \"we people\" argue and question for no better reason that something is uttered from the mouth of a Christian. People switch sides all the time.\n \n \n \n \nLet me ask you something: how long was it after the death of Alexander that his life story was written? \n\n \n Don't know, don't care, but I promise you as soon as 200 million people start using the life of Alexander to make everyday decisions that effect the rest of the world I will be right there with you placing those writings under a microscope to make sure they are accurate. Since his life is nothing more than interesting reading the accuracy isn't quite as important.\n \n \nThere were several others mentioned other than Thallus, yet Carrier's article rested solely on Thallus and Africanus, as if Africanus has no basis of fact as well. \n\n \n You lost me here. Carrier mentions a dozen other people stating both what was written and to what extent is it credible and why so. Also your talking about what someone said someone said as well as one or two more what someone said over a span of a couple hundred years\n \n \n??? I did not say Carrier was 'unreasonable', I said he took what was there was there and based his article on the negative approach. What can you say about the objectivity of the 'others'?\n\n Your statement implies reasonable evidence is not accepted, which leaves only unreasonable evidence\n \n \n...even if you people could be given reasonable evidence outside of 'apologists' you would not accept it...\n\n \n There should not be a negative or positive approach and that is my whole point. To take a positive approach is to view the evidence favorable to the desired conclusion, negative the opposite. I trust you see the problem with both of these approaches. \n \n It's hard to knock Carrier when everything and then some of what Habermas states is there. Does Habermas present his belief as it is what it is there is no other or of credible significance as an alternative?\n \n \n \nI would say my 'objectivity' is approximately the same as those going at Freedom in the Evolution thread, which, no doubt, you will consider highly objective.\n\n \n Granted you are better than many, but your faith dictates that you choose the the possibility that doesn't contradict that faith. I may be wrong but it seems harder to really lose faith, not have doubt, but complete denial than it is to gain it, going from denial to acceptance or maybe.\n \n Have not sen the evolution thread", 
   {}, 
   392892, 
   null, 
   1267492560.0
  ], 
  [
   393030, 
   null, 
   "Esdraelon", 
   "The post was about mindset and the Christian position that fact must conform to scripture. I won't deny the opposite is true, but it happens less frequently. \n\n \n I'm not so certain that fact must conform to scripture. It may appear as such, but I do not believe that is the case. Any person with any intellectual acumen would reject an obvious discrepancy in the reasoning some particular doctrine is reached, or how the foundation of Christianity is set, etc. \n \n \nResignation is your acceptance that \"we people\" argue and question for no better reason that something is uttered from the mouth of a Christian. People switch sides all the time.\n\n \n I don't feel any 'resignation' for the simple reason that it's not a critical matter if 'we people', as you put it, argue against it for arguments sake, but you certainly made a good point for what 'you people' actually appear to do. Yes, people do 'switch sides all the time', many who began by arguing everything uttered by a Christian, and they eventually 'switched sides'. To just name one of each, Lee Strobel was an atheist who used his career in investigative journalism to prove the falsity of Jesus and the Christian movement, he ended up becoming a Christian. He wrote several powerful books on the matter. Charles Templeton was a devout Christian, who was the right hand of Billy Graham on his early crusades, but lost his faith in crisis and became one of the most celebrated agnostics. \n \n I was saved when I was 12, and have been on a roller-coaster ride with faith ever since. It may not appear so, and I do not outwardly exhibit it, but I have been a powerful skeptic, and let's just say that this skepticism and lifelong search has strengthened my faith all these years. Notwithstanding some folks on this sites aspersions regarding my intelligence, nevertheless such aspersions are nothing but juvenile playground denunciations. I've looked at it from both sides. It is a reasonable faith, with reasonable evidence, based upon the general historical dearth of 'evidence' applying to any subject, to substantiate it by from modern standards. \n \n \nDon't know, don't care, but I promise you as soon as 200 million people start using the life of Alexander to make everyday decisions that effect the rest of the world I will be right there with you placing those writings under a microscope to make sure they are accurate. Since his life is nothing more than interesting reading the accuracy isn't quite as important.\n \n\n \n Just pointing out, as noted above, that much of original historical manuscripts are lost and evidence for practically any figure is can be argued as 'vague' or non-existent. Christianity has perhaps one of the best, if not the best, manuscriptural trail records of any subject. \n \n \nYou lost me here. Carrier mentions a dozen other people stating both what was written and to what extent is it credible and why so. Also your talking about what someone said someone said as well as one or two more what someone said over a span of a couple hundred years\n \n\n \n And they wrote down what they said, it appears. As I noted in the original post: \"Phlegon, a Greek author from Caria writing a chronology soon after 137 AD, reported that in the fourth year of the 202nd Olympiad (i.e. 33 AD)there was \"the greatest eclipse of the sun\" and that it became night in the sixth hour of the day (noon) so that the stars even appeared in the heavens. There was a great earthquake in Bithynia and many things were overturned in Nicaea.\" 1\n \n \n \nYour statement implies reasonable evidence is not accepted, which leaves only unreasonable evidence\n \n\n \n I would say that 99% of the evidence of Christianity is already found. It has been argued over the ages whether it is 'reasonable or not'. Certainly nothing new is going to transpire on this forum other than some individual finding that he knows far, far less than he proports to know, or learns something he did not know before. That's nothing new.\n \n \nThere should not be a negative or positive approach and that is my whole point. To take a positive approach is to view the evidence favorable to the desired conclusion, negative the opposite. I trust you see the problem with both of these approaches. \n\n \n I agree on this, but I don't speak for others. Take Carrier's argument, for example, should I reject the whole premise of what I posted simply because he writes an article that shows the 'possibility' that the Thallus/Africanus comments are fabricated to conform to historical Christianity record? I don't know about you, but I detest 'scientists' who manipulate data to conform to 'global warming', same as I would detest Christian 'scholars' who would create a fable to confirm a particular aspect of the gospels. \n \n \nIt's hard to knock Carrier when everything and then some of what Habermas states is there. Does Habermas present his belief as it is what it is there is no other or of credible significance as an alternative?\n \n\n \n That 'knock' is simply a note that He will go upon his already ingrained prejudices as most atheists, but as I noted, his conclusion seemed fair though, not conclusive to the argument. He did not blaze any new trails pro or con.\n \n \nGranted you are better than many, but your faith dictates that you choose the the possibility that doesn't contradict that faith. I may be wrong but it seems harder to really lose faith, not have doubt, but complete denial than it is to gain it, going from denial to acceptance or maybe.\n \n\n \n Well, thank you, but of course, what do you expect? Should I reject my faith on a 'possibility'? That is why it is called reasonable 'faith'. You have about as much 'proof' as you are going to get other than Jesus Christ standing in front of you.\n \n \nHave not sen the evolution thread\n\n \n That's the Creation vs Evolution forum up top. Interesting.", 
   {}, 
   393008, 
   null, 
   1267543320.0
  ], 
  [
   393041, 
   null, 
   "trebor", 
   "\n And they wrote down what they said, it appears. As I noted in the original post: \"Phlegon, a Greek author from Caria writing a chronology soon after 137 AD, reported that in the fourth year of the 202nd Olympiad (i.e. 33 AD)there was \"the greatest eclipse of the sun\" and that it became night in the sixth hour of the day (noon) so that the stars even appeared in the heavens. There was a great earthquake in Bithynia and many things were overturned in Nicaea.\" 1\n \n .\n\n \n \n Well, that is Africanus' claim. However, note the date that Phylegon wrote. He wrote over 100 years after the fact, so he was not even born then. Now, let's take a look at what Carrier said about the reliablity of that passage. From Thallus: an Analysis\n \n \n The Curious Case of Phlegon of Tralles\n \n The story gets more curious, however. For the quoted Africanus passage continues:\n \n In fact, let it be so. Let the idea that this happened seize and carry away the multitude, and let the cosmic prodigy be counted as an eclipse of the sun according to its appearance. Phlegon reports that in the time of Tiberius Caesar, during the full moon, a full eclipse of the sun happened, from the sixth hour until the ninth. Clearly this is our eclipse! What is common about an earthquake, an eclipse, rocks torn apart, a rising of the dead, and such a huge cosmic movement? At the very least, over a long period, no conjunction this great is remembered. But it was a godsent darkness, because the Lord happened to suffer, and the Bible, in Daniel, supports that seventy spans of seven years would come together up to this time.\n \n There is a lot of interesting material here, but I only wish to discuss what relates to Thallus. Most scholars have assumed that Africanus is here quoting Phlegon, too, as a witness to the darkness story--although we know for a fact that Phlegon wrote in the 140's AD, and was fond of fantastic stories, so it would not be surprising to find him borrowing this one from Christian literature. But Martin Routh noticed some telling details: the sentence mentioning Phlegon is grammatically and logically out of place.\n \n In Greek, new sentences are marked by certain special words, usually left untranslated, such as MEN or DE or OUN, etc. The Phlegon sentence is not marked. That is like not leaving a period at the end of the preceding sentence. Also, Africanus has just finished attacking Thallus' idea of a solar eclipse, yet here cites Phlegon favorably, who calls it the same exact thing. Moreover, the flow of thought is broken by this sentence. Africanus has begun a rhetorical argument with the phrase \"let it be so,\" which is otherwise interrupted by interjecting a historical note about Phlegon. Remove that sentence (and the added \"Clearly this is our eclipse!\") and we have a continuous stream of thought that makes more sense. The Phlegon sentence, for all of these reasons, does not belong here.\n \n In fact, the phrase \"Clearly this is our eclipse\" (literally \"clearly this is it\") is a telltale sign of an interlinear note by some other scribe. It appears that some copyist was copying or reading this passage in either Africanus or Syncellus and remembered the Phlegon connection, writing it as a note to the side or in between the lines. A later copyist then mistook this marginal note as text to be re-inserted, since, not having erasers, scribes who forgot a line would add it in the margins or between the lines (if they noticed the error at all). This was very common in the transmission of ancient and medieval books. There was no standard rule for distinguishing between added notes and re-inserted text. Both were marked and written the same way, leading to many marginal notes being read as re-inserted text and many lines of re-inserted text being mistook for marginal notes. Without further data, we might say that Syncellus mistook the marginal note of a previous owner of his copy of Africanus, or made the note himself while a later copier of Syncellus mistook it as text, or that the note and the mistake happened entirely before or after the involvement of Syncellus. But since Syncellus immediately follows the Africanus quote with a passage from Eusebius which quotes Phlegon correctly, it is almost certainly the case that the Phlegon passage here was inserted after Syncellus. This is further supported by the extent of the insertion's inaccuracy, which looks more like something that appears in the work of Agapius in the 10th century, or in Michael the Syrian in the 12th century.\n \n This leads us to the most important reason for supposing this line to be an insertion by someone other than Africanus (or Syncellus): Phlegon almost certainly said no such thing. Eusebius quotes Phlegon verbatim (the only one to do so), and what Phlegon actually said is telling--the text is attested in Syncellus in the original Greek, but also in the Latin of Jerome, the Syrian epitome, and the Armenian:\n \n Jesus Christ..underwent his passion in the 18th year of Tiberius [32 AD]. Also at that time in another Greek compendium we find an event recorded in these words: \"the sun was eclipsed, Bithynia was struck by an earthquake, and in the city of Nicaea many buildings fell.\" All these things happened to occur during the Lord's passion. In fact, Phlegon, too, a distinguished reckoner of Olympiads, wrote more on these events in his 13th book, saying this: \"Now, in the fourth year of the 202nd Olympiad [32 AD], a great eclipse of the sun occurred at the sixth hour [noon] that excelled every other before it, turning the day into such darkness of night that the stars could be seen in heaven, and the earth moved in Bithynia, toppling many buildings in the city of Nicaea.\"\n \n This quotation shows that Phlegon did not mention Jesus in this context at all (he may still have mentioned him in some other obscure context, if we believe Origen). Rather, Phlegon merely recorded a great earthquake in Bithynia, which is on the coast of the Black Sea, more than 500 miles away from Jerusalem--so there is no way this quake would have been felt near the crucifixion--and a magnificent noontime eclipse, whose location is not clear. If the eclipse was also in Bithynia, as the Phlegon quote implies but does not entail, it also could not have been seen in Jerusalem, any more than partially, since the track of a total eclipse spans only 100 miles and runs from west to east (Jerusalem is due south).\n \n In fact, the only coincidence with the gospel story is the year (although some modern scholars calculate the eclipse in question to have actually occurred in 29 AD) and time: it began at the sixth hour. Prigent suspects this last detail is a corruption by another scribe drawing from the gospel stories, although a noon eclipse is particularly startling and might get special mention (although the total eclipse would only occur at noon in one location--are we to suppose it was in Nicaea?). What is most important, however, is that Phlegon says nothing about the eclipse occuring during a full moon or lasting three hours (both physical impossibilities), yet these details are attributed to him in the lines added to Africanus. Clearly the quote has been altered over time.\n ", 
   {}, 
   393030, 
   null, 
   1267546920.0
  ], 
  [
   393045, 
   null, 
   "Esdraelon", 
   "Well, that is Africanus' claim. However, note the date that Phylegon wrote. He wrote over 100 years after the fact, so he was not even born then. Now, let's take a look at what Carrier said about the reliablity of that passage. From Thallus: an Analysis\n \n \n The Curious Case of Phlegon of Tralles\n \n The story gets more curious, however. For the quoted Africanus passage continues:\n \n In fact, let it be so. Let the idea that this happened seize and carry away the multitude, and let the cosmic prodigy be counted as an eclipse of the sun according to its appearance. Phlegon reports that in the time of Tiberius Caesar, during the full moon, a full eclipse of the sun happened, from the sixth hour until the ninth. Clearly this is our eclipse! What is common about an earthquake, an eclipse, rocks torn apart, a rising of the dead, and such a huge cosmic movement? At the very least, over a long period, no conjunction this great is remembered. But it was a godsent darkness, because the Lord happened to suffer, and the Bible, in Daniel, supports that seventy spans of seven years would come together up to this time.\n \n There is a lot of interesting material here, but I only wish to discuss what relates to Thallus. Most scholars have assumed that Africanus is here quoting Phlegon, too, as a witness to the darkness story--although we know for a fact that Phlegon wrote in the 140's AD, and was fond of fantastic stories, so it would not be surprising to find him borrowing this one from Christian literature. But Martin Routh noticed some telling details: the sentence mentioning Phlegon is grammatically and logically out of place.\n \n In Greek, new sentences are marked by certain special words, usually left untranslated, such as MEN or DE or OUN, etc. The Phlegon sentence is not marked. That is like not leaving a period at the end of the preceding sentence. Also, Africanus has just finished attacking Thallus' idea of a solar eclipse, yet here cites Phlegon favorably, who calls it the same exact thing. Moreover, the flow of thought is broken by this sentence. Africanus has begun a rhetorical argument with the phrase \"let it be so,\" which is otherwise interrupted by interjecting a historical note about Phlegon. Remove that sentence (and the added \"Clearly this is our eclipse!\") and we have a continuous stream of thought that makes more sense. The Phlegon sentence, for all of these reasons, does not belong here.\n \n In fact, the phrase \"Clearly this is our eclipse\" (literally \"clearly this is it\") is a telltale sign of an interlinear note by some other scribe. It appears that some copyist was copying or reading this passage in either Africanus or Syncellus and remembered the Phlegon connection, writing it as a note to the side or in between the lines. A later copyist then mistook this marginal note as text to be re-inserted, since, not having erasers, scribes who forgot a line would add it in the margins or between the lines (if they noticed the error at all). This was very common in the transmission of ancient and medieval books. There was no standard rule for distinguishing between added notes and re-inserted text. Both were marked and written the same way, leading to many marginal notes being read as re-inserted text and many lines of re-inserted text being mistook for marginal notes. Without further data, we might say that Syncellus mistook the marginal note of a previous owner of his copy of Africanus, or made the note himself while a later copier of Syncellus mistook it as text, or that the note and the mistake happened entirely before or after the involvement of Syncellus. But since Syncellus immediately follows the Africanus quote with a passage from Eusebius which quotes Phlegon correctly, it is almost certainly the case that the Phlegon passage here was inserted after Syncellus. This is further supported by the extent of the insertion's inaccuracy, which looks more like something that appears in the work of Agapius in the 10th century, or in Michael the Syrian in the 12th century.\n \n This leads us to the most important reason for supposing this line to be an insertion by someone other than Africanus (or Syncellus): Phlegon almost certainly said no such thing. Eusebius quotes Phlegon verbatim (the only one to do so), and what Phlegon actually said is telling--the text is attested in Syncellus in the original Greek, but also in the Latin of Jerome, the Syrian epitome, and the Armenian:\n \n Jesus Christ..underwent his passion in the 18th year of Tiberius [32 AD]. Also at that time in another Greek compendium we find an event recorded in these words: \"the sun was eclipsed, Bithynia was struck by an earthquake, and in the city of Nicaea many buildings fell.\" All these things happened to occur during the Lord's passion. In fact, Phlegon, too, a distinguished reckoner of Olympiads, wrote more on these events in his 13th book, saying this: \"Now, in the fourth year of the 202nd Olympiad [32 AD], a great eclipse of the sun occurred at the sixth hour [noon] that excelled every other before it, turning the day into such darkness of night that the stars could be seen in heaven, and the earth moved in Bithynia, toppling many buildings in the city of Nicaea.\"\n \n This quotation shows that Phlegon did not mention Jesus in this context at all (he may still have mentioned him in some other obscure context, if we believe Origen). Rather, Phlegon merely recorded a great earthquake in Bithynia, which is on the coast of the Black Sea, more than 500 miles away from Jerusalem--so there is no way this quake would have been felt near the crucifixion--and a magnificent noontime eclipse, whose location is not clear. If the eclipse was also in Bithynia, as the Phlegon quote implies but does not entail, it also could not have been seen in Jerusalem, any more than partially, since the track of a total eclipse spans only 100 miles and runs from west to east (Jerusalem is due south).\n \n In fact, the only coincidence with the gospel story is the year (although some modern scholars calculate the eclipse in question to have actually occurred in 29 AD) and time: it began at the sixth hour. Prigent suspects this last detail is a corruption by another scribe drawing from the gospel stories, although a noon eclipse is particularly startling and might get special mention (although the total eclipse would only occur at noon in one location--are we to suppose it was in Nicaea?). What is most important, however, is that Phlegon says nothing about the eclipse occuring during a full moon or lasting three hours (both physical impossibilities), yet these details are attributed to him in the lines added to Africanus. Clearly the quote has been altered over time.\n \n\n \n Methinks thou doth protesteth too much. You are willing to take only what those 'suspect' is a negative, and prefer to believe that Christian's 'altered' the record over time just continuing the great 'conspiracy' where the disciples stole away the body of Jesus and proclaimed to the world \"He has risen!\" \n \n I actually find my faith more buttressed by reading what the detractors write than what Christians write. You blaze no new trails either, though you do make a show of it.", 
   {}, 
   393041, 
   null, 
   1267548720.0
  ], 
  [
   393047, 
   null, 
   "trebor", 
   "Methinks thou doth protesteth too much. You are willing to take only what those 'suspect' is a negative, and prefer to believe that Christian's 'altered' the record over time just continuing the great 'conspiracy' where the disciples stole away the body of Jesus and proclaimed to the world \"He has risen!\" \n \n I actually find my faith more buttressed by reading what the detractors write than what Christians write. You blaze no new trails either, though you do make a show of it.\n\n \n Well, tell you what... can you show what Phegleon actually said from outside of the africanus quote? \n \n And, in My opinion, the 'protest too much' is a diversionary tactic showing you don't have anything beyond something filtered through Africanus, who had a very specific bias in attempting to prove Jesus and the resurrection.\n \n The criteria for finding the truth is very clear. You need to find a non-Christian reference to Phegleon's work from before Africanus's quote (220 C.E.\n \n This gives a 80 year window of opportunity there.", 
   {}, 
   393045, 
   null, 
   1267549920.0
  ], 
  [
   393050, 
   null, 
   "jyoshu", 
   "Well, tell you what... can you show what Phegleon actually said from outside of the africanus quote? \n \n And, in My opinion, the \\'protest too much\\' is a diversionary tactic showing you don\\'t have anything beyond something filtered through Africanus, who had a very specific bias in attempting to prove Jesus and the resurrection.\n \n The criteria for finding the truth is very clear. You need to find a non-Christian reference to Phegleon\\'s work from before Africanus\\'s quote (220 C.E.\n \n This gives a 80 year window of opportunity there.\n\n \n I suspect for any other topic, such a source as has been given here would at least be taken as evidence.\n You just don\\'t WANT it to be the case, Trebor. Clearly you\\'re starting with a premise and judging evidence by it, rather than starting with the evidence.", 
   {}, 
   393047, 
   null, 
   1267551900.0
  ], 
  [
   393052, 
   null, 
   "trebor", 
   "I suspect for any other topic, such a source as has been given here would at least be taken as evidence.\n You just don\\'t WANT it to be the case, Trebor. Clearly you\\'re starting with a premise and judging evidence by it, rather than starting with the evidence.\n\n \n In other words, you are accusing me of being stubborn, because you can not provide any primary evidence of this \\'Darkness\\' , nor can you provide any secondary evidence of this Darkness that doesn\\'t filter through Africanus. \n \n The entire argument about the Darkness comes down to \\'Africanus, writing almost 200 years after the facts, says that someone else says something\\', and that something either is totally absent , or there is indications things are modified.\n \n It seems you want to hide the fact that the evidence presented is woefully weak, filtered through a highly biased secondary source, and that it has no convergence of evidence from independent sources.", 
   {}, 
   393050, 
   null, 
   1267556460.0
  ], 
  [
   393077, 
   null, 
   "Esdraelon", 
   "Well, tell you what... can you show what Phegleon actually said from outside of the africanus quote? \n\n \n Of course not. I wasn\\'t there, neither were you. And, again, I state that it is \\'reasonable\\' evidence as pertaining as that than can be gleaned from historical writings on any subject dating back thousands of years. \n \n \nAnd, in My opinion, the \\'protest too much\\' is a diversionary tactic showing you don\\'t have anything beyond something filtered through Africanus, who had a very specific bias in attempting to prove Jesus and the resurrection.\n\n \n I don\\'t use \\'diversionary tactics\\' and such accusation is your attempt to bolster your somewhat self-contrived \\'expertise\\'. The accusation that \"Africanus, who had a very specific bias in attempting to prove Jesus and the resurrection.\" is solely your opinion, as it is the SAME accusation you use for ANY Christian source. With such a blanket accusation, truth could never be actualized even if it were true.\n \n \nThe criteria for finding the truth is very clear. You need to find a non-Christian reference to Phegleon\\'s work from before Africanus\\'s quote (220 C.E.\n \n This gives a 80 year window of opportunity there.\n \n \n\n \n WHOSE criteria? Yours?", 
   {}, 
   393047, 
   null, 
   1267570560.0
  ], 
  [
   393080, 
   null, 
   "Esdraelon", 
   "In other words, you are accusing me of being stubborn, because you can not provide any primary evidence of this 'Darkness' , nor can you provide any secondary evidence of this Darkness that doesn't filter through Africanus. \n\n \n Actually he is attesting your complete intransigence and since you noted your own 'stubbornness', obviously you are proud of that.\n \n \nThe entire argument about the Darkness comes down to 'Africanus, writing almost 200 years after the facts, says that someone else says something', and that something either is totally absent , or there is indications things are modified.\n\n \n So?\n \n \nIt seems you want to hide the fact that the evidence presented is woefully weak, filtered through a highly biased secondary source, and that it has no convergence of evidence from independent sources.\n \n\n \n No one is trying to 'hide' anything, it's all out there for everyone to see. Again it is 'reasonable evidence' based upon what the average unbiased person would consider reasonable.", 
   {}, 
   393052, 
   null, 
   1267571100.0
  ], 
  [
   393094, 
   null, 
   "trebor", 
   "\n No one is trying to 'hide' anything, it's all out there for everyone to see. Again it is 'reasonable evidence' based upon what the average unbiased person would consider reasonable.\n\n \n You see, you are definitely biased, because you are not addressing the points. \n \n 1) You are not addressing the point that we do not have the original writings.\n 2) You are not addressing the point about the evidence of alteration.\n 3) You are not addressing the point that Africanus has a definite agenda \n 4) You are not addressing the point that there WAS an eclipse that Phygelon might have been referring to, in 29 CE, not 33 C.E... but in the wrong time of the year. \n \n Rather than address those points, you attack me, and make the blanket statement that any 'unbiased person' will accept your point of view.\n \n To me, that points to the incredible weakness of your position.", 
   {}, 
   393080, 
   null, 
   1267575480.0
  ], 
  [
   393096, 
   null, 
   "Easyrider", 
   "(To Trebor)Actually he is attesting your complete intransigence and since you noted your own 'stubbornness', obviously you are proud of that.\n \n\n \n Trebor has been very predictable over the years. Whatever the evidence for Christianity is, Trebor is always on the opposing side.", 
   {}, 
   393080, 
   null, 
   1267576920.0
  ], 
  [
   393101, 
   null, 
   "Esdraelon", 
   "You see, you are definitely biased, because you are not addressing the points. \n \n 1) You are not addressing the point that we do not have the original writings.\n 2) You are not addressing the point about the evidence of alteration.\n 3) You are not addressing the point that Africanus has a definite agenda \n 4) You are not addressing the point that there WAS an eclipse that Phygelon might have been referring to, in 29 CE, not 33 C.E... but in the wrong time of the year. \n \n Rather than address those points, you attack me, and make the blanket statement that any 'unbiased person' will accept your point of view.\n \n To me, that points to the incredible weakness of your position.\n\n \n 1: We do NOT have the original writings. (Which we don't have with documents 2000 years old.)\n 2: There is NO 'evidence' of alteration. (you are constrained by your own standard of evidence)\n 3: There is NO evidence that Africanus had a definite agenda. (you are constrained by your own standard of evidence).\n 4: It is POSSIBLE, though you have not shown otherwise. ( you are constrained by your own standard of evidence)\n \n Attack you? My, my, such a thin skin when you feel you are on the receiving end and the situation warrants. Any 'unbiased' person will view it as 'reasonable evidence' whether they agree with the conclusion or not.\n \n 'Incredible weakness' is a 'relative opinion.' Yours.", 
   {}, 
   393094, 
   null, 
   1267579440.0
  ], 
  [
   393103, 
   null, 
   "trebor", 
   "1: We do NOT have the original writings. (Which we don't have with documents 2000 years old.)\n \n\n \n Nor do we have any copies of phygleon's books at all. \n \n \n\n 2: There is NO 'evidence' of alteration. (you are constrained by your own standard of evidence)\n \n\n \n Yes, we do. Richard Carrier pointed it out at Thallus: an Analysis\n \n \n\n There is a lot of interesting material here, but I only wish to discuss what relates to Thallus. Most scholars have assumed that Africanus is here quoting Phlegon, too, as a witness to the darkness story--although we know for a fact that Phlegon wrote in the 140's AD, and was fond of fantastic stories, so it would not be surprising to find him borrowing this one from Christian literature. But Martin Routh noticed some telling details: the sentence mentioning Phlegon is grammatically and logically out of place.\n \n In Greek, new sentences are marked by certain special words, usually left untranslated, such as MEN or DE or OUN, etc. The Phlegon sentence is not marked. That is like not leaving a period at the end of the preceding sentence. Also, Africanus has just finished attacking Thallus' idea of a solar eclipse, yet here cites Phlegon favorably, who calls it the same exact thing. Moreover, the flow of thought is broken by this sentence. Africanus has begun a rhetorical argument with the phrase \"let it be so,\" which is otherwise interrupted by interjecting a historical note about Phlegon. Remove that sentence (and the added \"Clearly this is our eclipse!\") and we have a continuous stream of thought that makes more sense. The Phlegon sentence, for all of these reasons, does not belong here.\n \n In fact, the phrase \"Clearly this is our eclipse\" (literally \"clearly this is it\") is a telltale sign of an interlinear note by some other scribe. It appears that some copyist was copying or reading this passage in either Africanus or Syncellus and remembered the Phlegon connection, writing it as a note to the side or in between the lines. A later copyist then mistook this marginal note as text to be re-inserted, since, not having erasers, scribes who forgot a line would add it in the margins or between the lines (if they noticed the error at all). This was very common in the transmission of ancient and medieval books. There was no standard rule for distinguishing between added notes and re-inserted text. Both were marked and written the same way, leading to many marginal notes being read as re-inserted text and many lines of re-inserted text being mistook for marginal notes. Without further data, we might say that Syncellus mistook the marginal note of a previous owner of his copy of Africanus, or made the note himself while a later copier of Syncellus mistook it as text, or that the note and the mistake happened entirely before or after the involvement of Syncellus. But since Syncellus immediately follows the Africanus quote with a passage from Eusebius which quotes Phlegon correctly, it is almost certainly the case that the Phlegon passage here was inserted after Syncellus. This is further supported by the extent of the insertion's inaccuracy, which looks more like something that appears in the work of Agapius in the 10th century, or in Michael the Syrian in the 12th century.\n \n\n \n And just as important a point, we have again from the Carrier page where he points out\n \n \n Africanus wrote in the early 3rd century. His contemporary, Origen, also cites Phlegon's mention of an earthquake and eclipse but does not repeat the exaggerations. Indeed, he expressly denies one of them in his commentary on Matthew, stating that \"Phlegon, who mentioned an eclipse during the reign of Tiberius Ceasar, did not say that it happened during the full moon.\" This suggests that the exaggerated quote, which would surely have been seized upon as a valuable testimony, did not yet exist, in Africanus or anywhere else. But it appears in Agapius in the 10th century. And by the time of Michael the Syrian, in the 12th century, the Phlegon quote had already gone way over the top, to include the astonishing sentence: \"the dead were resurrected, entered Jerusalem and said 'Woe to the Jews!'\" Syncellus wrote in the 9th century. So a copier of his work who had also read Agapius probably put two and two together and gullibly added the note, which was eventually pulled into the text as copies continued to be made by other scribes.\n \n \n \n \n\n \n 3: There is NO evidence that Africanus had a definite agenda. (you are constrained by your own standard of evidence).\n \n\n \n LOL. If you claim that, you are most definitely showing your agenda.Africanus was writing apologist .. and that is an agenda. \n \n You are being very predictable.. and you are showing denying,rather than addressing the points .", 
   {}, 
   393101, 
   null, 
   1267586400.0
  ], 
  [
   393107, 
   null, 
   "Esdraelon", 
   "Nor do we have any copies of phygleon's books at all. \n\n \n So? I just stated that in my previous response. You have a habit of repeating yourself.\n \n \nYes, we do. Richard Carrier pointed it out at Thallus: an Analysis\n\n \n LOL! And of course Richard Carrier does not have an agenda, huh? You are so transparent. His tangible 'evidence' for your 'Con' is no different than my tangible 'evidence' for 'Pro.' He makes an 'argumentative case' based upon what he , in his opinion considers appearances of what happened 2000 years ago,.\n \n \n \nAnd just as important a point, we have again from the Carrier page where he points out\n \n \n Africanus wrote in the early 3rd century. His contemporary, Origen, also cites Phlegon's mention of an earthquake and eclipse but does not repeat the exaggerations. Indeed, he expressly denies one of them in his commentary on Matthew, stating that \"Phlegon, who mentioned an eclipse during the reign of Tiberius Ceasar, did not say that it happened during the full moon.\" This suggests that the exaggerated quote, which would surely have been seized upon as a valuable testimony, did not yet exist, in Africanus or anywhere else. But it appears in Agapius in the 10th century. And by the time of Michael the Syrian, in the 12th century, the Phlegon quote had already gone way over the top, to include the astonishing sentence: \"the dead were resurrected, entered Jerusalem and said 'Woe to the Jews!'\" Syncellus wrote in the 9th century. So a copier of his work who had also read Agapius probably put two and two together and gullibly added the note, which was eventually pulled into the text as copies continued to be made by other scribes.\n \n \n\n \n ROFLMAO! YOU stated above: So a copier of his work who had also read Agapius probably put two and two together and gullibly added the note, which was eventually pulled into the text as copies continued to be made by other. 'Probably'.... your entire case is based on what you (and Carrier)can conjecture probably occurred. The same probably argument is commonly used by critics throughout scripture. You are making a typical argument before a jury and asking them to render a verdict based on probabilities.\n \n \nLOL. If you claim that, you are most definitely showing your agenda.Africanus was writing apologist .. and that is an agenda \n \n \n And LOL, Carrier is a thoroughly unbiased writer, huh? Again, he deals in probabilities, because he has no evidence to back himself up, only his probabilities. \n \n Do you think this is anything new?? Christian theologians already know the arguments critics are going to make. Your argument has been made before on this issue in the past, has been looked into, and deemed 'reasonable evidence'. \n \n Ah! And now you are mulling over my agenda......you piously do not have one yourself, do you?\n \n \n \nYou are being very predictable.. and you are showing denying,rather than addressing the points .\n\n \n LOL! I have addressed every point you have made. It doesn't get much 'address' if it is baseless. Are we now to argue over the definition of 'addressing'?", 
   {}, 
   393103, 
   null, 
   1267587900.0
  ], 
  [
   393110, 
   null, 
   "trebor", 
   "\n \n LOL! I have addressed every point you have made. It doesn't get much 'address' if it is baseless.\n\n \n Denying is not the same as addressing.\n \n Which, of course all you have done.", 
   {}, 
   393107, 
   null, 
   1267589100.0
  ], 
  [
   393112, 
   null, 
   "Esdraelon", 
   "Denying is not the same as addressing.\n \n Which, of course all you have done.\n\n \n LOL!!!! I have stated it is 'REASONABLE EVIDENCE'! Not denied anything.\n \n You have only refuted it by repeatedly stating what probably happend instead.\n \n That is the VERY BEST that critics of Jesus Christ can manage: they can give probability arguments. Their argument: \"NO! NO! NO! That did not happen as written! This is what, er...probably..happened instead.\"\n \n \"Not to worry, we'll come up with a better 'probability' explanation shortly\".......:xbanghead", 
   {}, 
   393110, 
   null, 
   1267589460.0
  ], 
  [
   393117, 
   null, 
   "trebor", 
   "LOL!!!! I have stated it is 'REASONABLE EVIDENCE'! Not denied anything.\n \n You have only refuted it by repeatedly stating what probably happend instead.\n \n That is the VERY BEST that critics of Jesus Christ can manage: they can give probability arguments. Their argument: \"NO! NO! NO! That did not happen as written! This is what, er...probably..happened instead.\"\n \n \"Not to worry, we'll come up with a better 'probability' explanation shortly\".......:xbanghead\n\n \n \n Woo hoo.. It seems your definition of 'reasonable evidence' is anything that makes you think Jesus is God,and you reject anything else.\n \n Unfortunately for you, what you call 'reasonable evidence' is weak beyond comparison. \n \n You give a biased account from an appologist from the third century , and you say that is 'reasonable' evidence, and you have nothing that is not filtered through him?\n \n Ok. What ever .", 
   {}, 
   393112, 
   null, 
   1267597920.0
  ], 
  [
   393123, 
   null, 
   "Esdraelon", 
   "Woo hoo.. It seems your definition of 'reasonable evidence' is anything that makes you think Jesus is God,and you reject anything else.\n \n Unfortunately for you, what you call 'reasonable evidence' is weak beyond comparison. \n \n You give a biased account from an appologist from the third century , and you say that is 'reasonable' evidence, and you have nothing that is not filtered through him?\n \n Ok. What ever .\n\n \n whaaaaatever...it's 'reasonable' compared to your 'probably'.....emoticon_xbye", 
   {}, 
   393117, 
   null, 
   1267620720.0
  ], 
  [
   393126, 
   null, 
   "Easyrider", 
   "whaaaaatever...it's 'reasonable' compared to your 'probably'.....emoticon_xbye\n\n \n The nail in Trebor's follies is the confirmations in the Gospel accounts for the darkened sun. \n \n The NT busts Trebor's chops all day long.", 
   {}, 
   393123, 
   null, 
   1267624800.0
  ], 
  [
   393133, 
   null, 
   "trebor", 
   "whaaaaatever...it's 'reasonable' compared to your 'probably'.....emoticon_xbye\n\n \n Lol. \n \n I notice you STILL can't show any of the primary sources for this 'Darkness' from before the 3rd century. You can't show what Phyelgon's original statement was except when filtered through CHristian Apologists. You can't even point to one non-Christian reference to Thallus to show what he said.\n \n Yes, this is a repeat, because you just give excuses about why not, but it doesn't really answer, it evades.", 
   {}, 
   393123, 
   null, 
   1267630500.0
  ], 
  [
   393136, 
   null, 
   "Esdraelon", 
   "Lol. \n \n I notice you STILL can't show any of the primary sources for this 'Darkness' from before the 3rd century. You can't show what Phyelgon's original statement was except when filtered through CHristian Apologists. You can't even point to one non-Christian reference to Thallus to show what he said.\n \n Yes, this is a repeat, because you just give excuses about why not, but it doesn't really answer, it evades.\n\n \n EVERYTHING of warrant regarding Christianity is 'LateDated' according to you. You are still arguing your 'probability' to a jury. Let them decide. emoticon_rolleyes\n \n As for me, I have to get to work.", 
   {}, 
   393133, 
   null, 
   1267630980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Day The Earth Went Dark", 
  "url": "http://www.4forums.com/political/religion-debates/13971-day-earth-went-dark.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 13971, 
  "discussion_files": [
   [
    "10950.html", 
    "http://www.4forums.com/political/religion-debates/13971-day-earth-went-dark-print.html"
   ], 
   [
    "10951.html", 
    "http://www.4forums.com/political/religion-debates/13971-day-earth-went-dark-3-print.html"
   ], 
   [
    "10952.html", 
    "http://www.4forums.com/political/religion-debates/13971-day-earth-went-dark-2-print.html"
   ]
  ], 
  "identifier": 13971
 }
]