[
 [
  [
   393044, 
   null, 
   "JPSartre12", 
   "To those of you that think giving Uncle Sam control of another 1/6th of our economy is a good idea, I submit for your consideration the following:\n \n\n Postmaster delivers bundle of bad news\n By Ed O'Keefe\n Washington Post Staff Writer\n Tuesday, March 2, 2010; 9:02 AM \n The U.S. Postal Service estimates $238 billion in losses in the next 10 years if lawmakers, postal regulators and unions don't give the mail agency more flexibility in setting delivery schedules, price increases and labor costs. \n Estimates released Tuesday also predict that letter carriers will deliver just 150 billion pieces of mail in 2020, a drop of about 26 billion pieces from 2009. Customers will continue to migrate to the Internet and to cheaper standard-mail options, and away from the Postal Service's signature product, first-class mail, Postmaster General John E. Potter reported Tuesday to a Washington meeting of congressional staffers, government watchdogs, postal union officials and major postal customers. Mounting labor costs are also complicating the agency's path to firm fiscal footing. \n The Postal Service experienced a 13 percent drop in mail volume last fiscal year, more than double any previous decline, and lost $3.8 billion. The projections anticipate steeper drops in mail volume and revenue over the next 10 years. For the first time, the agency is acknowledging that it seems unlikely mail volume will ever return to pre-recession levels. \n In an effort to offset some of the losses, the agency is pushing anew for a dramatic reshaping of how Americans get and send their letters and packages. Potter is seeking more flexibility in the coming year to set delivery schedules, prices and labor costs. The changes could mean an end to Saturday mail deliveries, longer delivery times for letters and packages, increases in postage-stamp prices that exceed the rate of inflation, and -- possibly -- future layoffs. \n \"At the end of the day, I'm convinced that if we make the changes that are necessary, we can continue to provide universal service for Americans for decades to come,\" Potter said Monday. \"We can turn back from the red to the black, but there are some significant changes we need to make.\" \n The postmaster general called for many of these changes last year but failed to convince lawmakers. This time he's armed with $4.8 million worth of outside studies that conclude that, without drastic changes, the mail agency will face even more staggering losses. \n Three studies -- by Accenture, the Boston Consulting Group and McKinsey and Co. -- reviewed the Postal Service's books and presented 50 options for cuts and new services. The agency's business model is so poor, consultants concluded, that privatizing it is untenable. \n As for Postal Service plans to sell banking, insurance and cellphone services through post offices, the consultants point to the agency's lack of start-up funds and inability to afford potential short-term losses. \n But the Postal Service will ask Congress to cut mail delivery to five days per week, a move backed by a June Gallup survey that found 52 percent of Americans support eliminating Saturday deliveries in order to reduce costs. \n Other possible changes carry much greater risk: Officials can seek permission from the Postal Regulatory Commission to increase prices beyond the rate of inflation, but doing so could scare away more customers. \n The agency also plans to explore offering \"hybrid mail products\" that deliver some mail to customers via e-mail, Potter said. \n Officials will also seek greater flexibility in forthcoming union negotiations, including addressing ballooning health-care costs, Potter said. \n He particularly wants Congress to reverse a 2006 law requiring the Postal Service to prepay its retiree health benefits, to the tune of $5 billion per year. No other federal agency or Fortune 500 company makes such payments, Potter said. \n The agency's call last year to consolidate about 3,000 post offices drew a firestorm of protest from the public and lawmakers. \n But the Postal Service is considering more next year, potentially closing thousands of locations and moving some products and services to nearby supermarkets, office supply stores and pharmacies. \n Postmaster delivers bundle of bad news \n", 
   {
    "post_info": {
     "post_title": "Uncle Sam's Track Recond Running Businesses"
    }
   }, 
   null, 
   null, 
   1267548000.0
  ], 
  [
   393135, 
   null, 
   "snakespit", 
   "They needed $4.8 million of outside studies to show that the PO is going down the tubes? I know that being a government agency, they certainly could not be trusted to do their own study...but 4.8 million...seriously?\n \n And if they really desire to cut costs, perhaps getting rid of the Postal Regulatory Commission would be a good place to start. Technology is killing the PO, and I think it's about time we scale it down to size or let it die.", 
   {}, 
   393044, 
   null, 
   1267630920.0
  ], 
  [
   393156, 
   null, 
   "JPSartre12", 
   "They needed $4.8 million of outside studies to show that the PO is going down the tubes? I know that being a government agency, they certainly could not be trusted to do their own study...but 4.8 million...seriously?\n \n And if they really desire to cut costs, perhaps getting rid of the Postal Regulatory Commission would be a good place to start. Technology is killing the PO, and I think it's about time we scale it down to size or let it die.\n\n \n 80% of the Post Offices expenses are salaries, a majority of those are unionized. Fat chance of Obama getting rid of them.", 
   {}, 
   393135, 
   null, 
   1267644660.0
  ], 
  [
   393198, 
   null, 
   "Steeeeve", 
   "The Post Office is probably the best run government agency besides the GAO....I'm ok paying a few billion for them and getting rid of the really bad agencies. We'd come out way ahead with this.", 
   {}, 
   393156, 
   null, 
   1267653540.0
  ], 
  [
   393269, 
   null, 
   "JPSartre12", 
   "The Post Office is probably the best run government agency besides the GAO....I'm ok paying a few billion for them and getting rid of the really bad agencies. We'd come out way ahead with this.\n\n \n I have no problem getting rid of at least 2/3 of all Federal employees.", 
   {}, 
   393198, 
   null, 
   1267717620.0
  ], 
  [
   393289, 
   null, 
   "josephdphillips", 
   "80% of the Post Offices expenses are salaries, a majority of those are unionized. Fat chance of Obama getting rid of them.\n\n \n Exactly. The USPS would make a profit if it broke its unions. The sooner, the better.", 
   {}, 
   393156, 
   null, 
   1267723200.0
  ], 
  [
   393297, 
   null, 
   "TRIGGER", 
   "The Post Office is probably the best run government agency besides the GAO....I'm ok paying a few billion for them and getting rid of the really bad agencies. We'd come out way ahead with this.\n\n \n That goes to show you that the post office is the best run and they can't keep up how about the others. Fanny Mae, Freddy Mac, Medicare, Medacaid, and Social Security all of them disasters and why would anyone in their right mind want to put 1/7th of the US economy (Health care) in the hands of the federal government.:xbanghead Isn't the definition of insanity doing the samething over and over and expecting a diffrent result.emoticon_mad", 
   {}, 
   393198, 
   null, 
   1267724820.0
  ], 
  [
   393642, 
   null, 
   "modulus", 
   "To those of you that think giving Uncle Sam control of another 1/6th of our economy is a good idea, I submit for your consideration the following:\n\n \n What is the track record of the U.S. insurance companies running business? Cost twice as high as in the rest of the OECD, and very little to show for it.\n \n For example the administrative cost of the single payer system in Taiwan is 2%. In comparison the administrative cost of Wellpoint is 30%!", 
   {}, 
   393044, 
   null, 
   1268031180.0
  ], 
  [
   393668, 
   null, 
   "Steeeeve", 
   "What is the track record of the U.S. insurance companies running business? Cost twice as high as in the rest of the OECD, and very little to show for it.\n \n For example the administrative cost of the single payer system in Taiwan is 2%. In comparison the administrative cost of Wellpoint is 30%!\n\n \n It's actually better to look at administrative costs for medicare to a US insurance company. While it is impossible to find an unbiased study these days, most of them I've seen (posted on these forums before) indicate that Medicare/Medicaid administration costs are basically the same as private minus profit margin minus costs of things private does that Medicare does not (such as fraud prevention). You also calculate it differently for Medicare vs private insurance so the comparison is not a fair one to begin with. \n \n More importantly, administrative costs account for next to nothing in terms of your health care dollar. Single payer wouldn't decrease your health care bill by any noticeable margin.\n \n I'll try and find my previous posts on this if you like...I think it was a PWC study that I referenced.", 
   {}, 
   393642, 
   null, 
   1268067900.0
  ], 
  [
   393671, 
   null, 
   "JPSartre12", 
   "What is the track record of the U.S. insurance companies running business? \n\n Compared to Uncle Sam, pretty darn good! They're not running a $12Trillion debt are they? emoticon_rolleyes\n \n\n Cost twice as high as in the rest of the OECD, and very little to show for it.\n \n For example the administrative cost of the single payer system in Taiwan is 2%. In comparison the administrative cost of Wellpoint is 30%!\n\n \n You're delusional in thinking that you can compare the quality of US healthcare with the rest of the world's on a $ for $ basis. \n First, global healthcare rankings are based on a flawed statistical analysis. How can you rate the quality of one's healthcare by looking at those without it? That's like examining the quality of concrete by looking at a dirt road. \n Second. Look where the rest of the world goes to learn how to be a doctor, particularly specialists. The smart ones come to the US.", 
   {}, 
   393642, 
   null, 
   1268069580.0
  ], 
  [
   393768, 
   null, 
   "Jo Bennett", 
   "You're delusional in thinking that you can compare the quality of US healthcare with the rest of the world's on a $ for $ basis. \n First, global healthcare rankings are based on a flawed statistical analysis. How can you rate the quality of one's healthcare by looking at those without it? That's like examining the quality of concrete by looking at a dirt road. \n Second. Look where the rest of the world goes to learn how to be a doctor, particularly specialists. The smart ones come to the US.\n\n \n A lot of them go to Guy's Teaching Hospital in London. A lot of them train in Cuba or India. Certainly most new treatments are developed in the west still, but by no means just in the US, plenty is done in the UK and in other countries. The US trains barely twice as many doctors as the UK from a population 5 times the size. I'd like to see you support your absurd claims with some evidence.\n EDIT: Cuba trains vast numbers of doctors and other medical staff from all over the developing world http://news.bbc.co.uk/1/hi/world/americas/8059287.stm", 
   {}, 
   393671, 
   null, 
   1268118720.0
  ], 
  [
   393771, 
   null, 
   "modulus", 
   "Compared to Uncle Sam, pretty darn good! They're not running a $12Trillion debt are they? emoticon_rolleyes\n \n \n You're delusional in thinking that you can compare the quality of US healthcare with the rest of the world's on a $ for $ basis. \n First, global healthcare rankings are based on a flawed statistical analysis. How can you rate the quality of one's healthcare by looking at those without it?\n\n \n Are you saying that those without it do not count?", 
   {}, 
   393671, 
   null, 
   1268119620.0
  ], 
  [
   393788, 
   null, 
   "Steeeeve", 
   "A lot of them go to Guy's Teaching Hospital in London. A lot of them train in Cuba or India. Certainly most new treatments are developed in the west still, but by no means just in the US, plenty is done in the UK and in other countries. The US trains barely twice as many doctors as the UK from a population 5 times the size. I'd like to see you support your absurd claims with some evidence.\nLikewise. Could you provide graduation numbers evidence? i searched on google for 1min and found nothing which is my time limit for this forum. I did find the US having 5 times the number of schools...roughly 150ish to 30ish.", 
   {}, 
   393768, 
   null, 
   1268150400.0
  ], 
  [
   393973, 
   null, 
   "Jo Bennett", 
   "Likewise. Could you provide graduation numbers evidence? i searched on google for 1min and found nothing which is my time limit for this forum. I did find the US having 5 times the number of schools...roughly 150ish to 30ish.\n\n \n Medical school - Wikipedia, the free encyclopedia\n Total US medical student numbers constant over decade\n \n Sorry guys, I screwed up, mismatched a graduating figure with a total number of students. \n \n The comparison with Cuba still stands.", 
   {}, 
   393788, 
   null, 
   1268209740.0
  ], 
  [
   394143, 
   null, 
   "modulus", 
   "It's actually better to look at administrative costs for medicare to a US insurance company. While it is impossible to find an unbiased study these days, most of them I've seen (posted on these forums before) indicate that Medicare/Medicaid administration costs are basically the same as private minus profit margin minus costs of things private does that Medicare does not (such as fraud prevention). You also calculate it differently for Medicare vs private insurance so the comparison is not a fair one to begin with. \n \n More importantly, administrative costs account for next to nothing in terms of your health care dollar. Single payer wouldn't decrease your health care bill by any noticeable margin.\n \n\n \n It certainly would.\n \n * On a per capita basis also the U.S. spent the highest with a total of $7,290 which is TWO-AND-HALF TIMES the OECD average\n \n * The public share of health care expenditure in the USA (45%) is less than any other OECD country\n \n * Despite spending the most, the U.S. provides health care coverage for only the elderly, disabled and some of the poor people\n \n * In comparison, the same amount is enough to provide universal health care insurance by the government for all citizens in other OECD countries\n \n * 35% of total health care expenditures is done by private health insurance which is the highest In OCED\n \n * Despite the high medical expenditure,there are fewer doctors per capita in the U.S. than most other OECD countries\n \n * Life expectancy in the U.S. is lower when compared with Japan,Switzerland, Canada and Australia\n \n * Infant morality rates in the U.S. is higher than most OECD countries. In 2006, it was 6.7 per live births relative to OECD average of 4.7\n \n Comparing U.S. Healthcare Spending with Other OECD Countries -- Seeking Alpha", 
   {}, 
   393668, 
   null, 
   1268292240.0
  ], 
  [
   394157, 
   null, 
   "Steeeeve", 
   "It certainly would.\n \n * On a per capita basis also the U.S. spent the highest with a total of $7,290 which is TWO-AND-HALF TIMES the OECD average\n \n * The public share of health care expenditure in the USA (45%) is less than any other OECD country\n \n * Despite spending the most, the U.S. provides health care coverage for only the elderly, disabled and some of the poor people\n \n * In comparison, the same amount is enough to provide universal health care insurance by the government for all citizens in other OECD countries\n \n * 35% of total health care expenditures is done by private health insurance which is the highest In OCED\n \n * Despite the high medical expenditure,there are fewer doctors per capita in the U.S. than most other OECD countries\n \n * Life expectancy in the U.S. is lower when compared with Japan,Switzerland, Canada and Australia\n \n * Infant morality rates in the U.S. is higher than most OECD countries. In 2006, it was 6.7 per live births relative to OECD average of 4.7\n \n Comparing U.S. Healthcare Spending with Other OECD Countries -- Seeking Alpha\n\n \n Thank you for that rambling but this doesn't address anything I said. If we assume single payer will be like Medicare...which is not a bad assumption (helps you out), we would not see lower costs from everything I've seen. It's that simple. Nothing you have shown is relevant to that.", 
   {}, 
   394143, 
   null, 
   1268318160.0
  ], 
  [
   394192, 
   null, 
   "JPSartre12", 
   "A lot of them go to Guy's Teaching Hospital in London. A lot of them train in Cuba or India. Certainly most new treatments are developed in the west still, but by no means just in the US, plenty is done in the UK and in other countries. The US trains barely twice as many doctors as the UK from a population 5 times the size. I'd like to see you support your absurd claims with some evidence.\n EDIT: Cuba trains vast numbers of doctors and other medical staff from all over the developing world BBC NEWS | Americas | Cuba pushes its 'medical diplomacy'\n\n \n Here's a list of the top 50 hospitals in the world, 36 are in the US. In fact ALL of the top 25 are in the US.\n I don't care how many doctors you teach if the school teaching them is a POS.\n \n \nAre you saying that those without it do not count?\n\n \n You don't compare the performance of cars by including horses do you?emoticon_rolleyes\n \n \nLikewise. Could you provide graduation numbers evidence? i searched on google for 1min and found nothing which is my time limit for this forum. I did find the US having 5 times the number of schools...roughly 150ish to 30ish.\n\n \n As I mentioned above, the number of graduates isn't an indication of the quality of the education. The two are unrelated.", 
   {}, 
   394157, 
   null, 
   1268331720.0
  ], 
  [
   394194, 
   null, 
   "JPSartre12", 
   "(modulus in black)It certainly would.\n \n * On a per capita basis also the U.S. spent the highest with a total of $7,290 which is TWO-AND-HALF TIMES the OECD average So? What's your point?\n \n * The public share of health care expenditure in the USA (45%) is less than any other OECD country That would be because healthcare in the US is predominantly a private industry\n * Despite spending the most, the U.S. provides health care coverage for only the elderly, disabled and some of the poor people Healthcare isn't a right. It is a service. A service that you pay for just like getting your shoes shined.\n * In comparison, the same amount is enough to provide universal health care insurance by the government for all citizens in other OECD countries Does that include all of the old people denied expensive operations?\n * 35% of total health care expenditures is done by private health insurance which is the highest In OCED No surprise there, either\n \n * Despite the high medical expenditure,there are fewer doctors per capita in the U.S. than most other OECD countries Higher wages, better doctors, no surprise there either.\n * Life expectancy in the U.S. is lower when compared with Japan, Switzerland, Canada and Australia. Prove a link between life expectancy and presence of universal healthcare in those countries. Stating random facts doesn't count. How about Switzerland and Canada have more ice per capita than the US, therefore, the presence of ice makes them live longer. See, I can string random facts together, too.\n * Infant morality rates in the U.S. is higher than most OECD countries. In 2006, it was 6.7 per live births relative to OECD average of 4.7. Did they account for illegals, drug addicts, etc., or does this ASSume a similar homogeneous population set between the OECD?\n\n Comparing U.S. Healthcare Spending with Other OECD Countries -- Seeking Alpha\n\n \n Like all statistics: Garbage in, garbage out.", 
   {
    "unicode_changes_made": true
   }, 
   394143, 
   null, 
   1268332440.0
  ], 
  [
   394213, 
   null, 
   "Jo Bennett", 
   "Where's your list, JP?\n EDIT: if it's the one I've found via google the methodology is very little to do with the quality of teaching or the quality of the graduates. It's about how well it presents itself on the web http://hospitals.webometrics.info/top1000.asp?offset=0", 
   {}, 
   394194, 
   null, 
   1268335320.0
  ], 
  [
   394219, 
   null, 
   "JPSartre12", 
   "Where's your list, JP?\n EDIT: if it's the one I've found via google the methodology is very little to do with the quality of teaching or the quality of the graduates. A big metric it uses is wealth, and that obviously gives the US institutions a big advantage, similarly with size, and what the hell does \"visibility\" have to do with quality?\n\n \n Oopsemoticon_emb\n World Hospitals' ranking on the Web: Top 1000 World Ranking\n \n Hey! No fair, you edited your post in the middle of my reply. ;)\n \n They used the \"Berlin Principles on Ranking of Higher Education Institutions\" according to their methodology. http://www.che.de/downloads/Berlin_Principles_IREG_534.pdf", 
   {}, 
   394213, 
   null, 
   1268335800.0
  ], 
  [
   394220, 
   null, 
   "Jo Bennett", 
   "I've edited again now I've found more detail about the methodology, it didn't mean what I thought it meant, but it's still not very relevant.", 
   {}, 
   394219, 
   null, 
   1268336100.0
  ], 
  [
   394221, 
   null, 
   "JPSartre12", 
   "I've edited again now I've found more detail about the methodology, it didn't mean what I thought it meant, but it's still not very relevant.\n\n \n Rich doesn't mean wealth in this instance.", 
   {}, 
   394220, 
   null, 
   1268336160.0
  ], 
  [
   394225, 
   null, 
   "josephdphillips", 
   "When it comes to health care, it's quantity that matters, not quality.\n \n Right now the United States has declared access to health care to be a luxury, not a right. The morality of such a policy is the issue.", 
   {}, 
   394221, 
   null, 
   1268338200.0
  ], 
  [
   394310, 
   null, 
   "Jo Bennett", 
   "Rich doesn't mean wealth in this instance.\n\n \n Quite right, but it doesn't mean much do to with quality of teaching either, it's to do with whether their website has spreadsheets on it.", 
   {}, 
   394221, 
   null, 
   1268377440.0
  ], 
  [
   394312, 
   null, 
   "modulus", 
   "(modulus in black)It certainly would.\n \n * On a per capita basis also the U.S. spent the highest with a total of $7,290 which is TWO-AND-HALF TIMES the OECD average So? What's your point?\n \n\n \n The point is that the private insurance has a lot worse record running business than publicly run health care systems.", 
   {
    "unicode_changes_made": true
   }, 
   394194, 
   null, 
   1268379420.0
  ], 
  [
   394344, 
   null, 
   "Steeeeve", 
   "The point is that the private insurance has a lot worse record running business than publicly run health care systems.\n\n \n Actually, they don't. You are trying to relate things that don't go together", 
   {}, 
   394312, 
   null, 
   1268410920.0
  ], 
  [
   394352, 
   null, 
   "JPSartre12", 
   "The point is that the private insurance has a lot worse record running business than publicly run health care systems.\n\n \n It does? What's your definition of worse? Seems to me they're making money while Uncle Sam is bleeding money and in debt up to his whiskers.", 
   {}, 
   394312, 
   null, 
   1268416020.0
  ], 
  [
   394370, 
   null, 
   "modulus", 
   "It does? What's your definition of worse?\n\n \n I mean paying twice as much for the same or worse quality of healtcare. Do you want me to quote the same statistics again? We are paying twice as much for healtcare than the rest of OECD with nothing to show for it. We are worse off in no. of doctors, preventable deaths, life expectancy, infant mortality.", 
   {}, 
   394352, 
   null, 
   1268419140.0
  ], 
  [
   394380, 
   null, 
   "JPSartre12", 
   "I mean paying twice as much for the same or worse quality of healtcare. Do you want me to quote the same statistics again? We are paying twice as much for healtcare than the rest of OECD with nothing to show for it. We are worse off in no. of doctors, preventable deaths, life expectancy, infant mortality.\n\n \n Your statistics don't mean a damn thing because they are measuring things that are unrelated to the quality of care. My daughter had an infection that caused the side of her face to swell. Do you know how long she had to wait for a CAT scan? 45 minutes!! Here's an article on Canadian wait times from 2007.\n \n\n Nova Scotia best for CT scans\n \n As in past years, patients also experienced significant waiting times for various diagnostic technologies across Canada: computed tomography (CT), magnetic resonance imaging (MRI) and ultrasound scans.\n \n The median wait for a CT scan across Canada was 4.8 weeks. British Columbia, Alberta, Ontario, New Brunswick and Nova Scotia had the shortest wait for CT scans (4.0 weeks), while the longest wait occurred in Manitoba (8.0 weeks).\n \n The median wait for an MRI across Canada was 10.1 weeks. Patients in Ontario experienced the shortest wait for an MRI (7.8 weeks), while Newfoundland and Labrador residents waited longest (20.0 weeks). \n \n Read more: CBC News - Health - Wait times for surgery in Canada at all-time high: study\n\n \n Is that your idea of quality? If so, move to Canada. I'm OK with mine. emoticon_xgood", 
   {}, 
   394370, 
   null, 
   1268421000.0
  ], 
  [
   394444, 
   null, 
   "modulus", 
   "Your statistics don't mean a damn thing because they are measuring things that are unrelated to the quality of care.\n \n \n It is exactly what they are measuring. Apparently waiting 45 minutes for CAT scan as opposed to 4 weeks does not improve your health. \n \n BTW, in Canada people are triaged. Those who need CAT scan within 45 minutes will get it within 25 minutes. Those who do not will wait. The scanners are utilized to their full capacity. Apparently those who wait do not have to have it within 45 minutes because Canadians do not die any more than Americans. This is a way to control cost. There is no point spending millions on idle CT scanners. Why do you complain about the government wasting money and not about the private health industry wasting money?\n \n \n \n\n Is that your idea of quality?\n\n \n Exactly. This is quality versus quantity. What counts is the outcome not how many peole had CAT scan how often.", 
   {}, 
   394380, 
   null, 
   1268465340.0
  ], 
  [
   394465, 
   null, 
   "Steeeeve", 
   "It is exactly what they are measuring. Apparently waiting 45 minutes for CAT scan as opposed to 4 weeks does not improve your health. \nIt most certainly does. But more importantly, the market figures out what is needed. Technically we could give everyone a CAT scan each year and probably detect some cancers much sooner increasing the probability of healing it. The cost, however, makes this not practical.\n \n Cancer survival rates are higher in the US then Canada...more importantly, early detection is more likely in the US.", 
   {}, 
   394444, 
   null, 
   1268524140.0
  ], 
  [
   394484, 
   null, 
   "modulus", 
   "It most certainly does. But more importantly, the market figures out what is needed. Technically we could give everyone a CAT scan each year and probably detect some cancers much sooner increasing the probability of healing it. The cost, however, makes this not practical.\n \n Cancer survival rates are higher in the US then Canada...more importantly, early detection is more likely in the US.\n\n \n I would like to know only one thing. If you are uninsured and you get cancer who will treat you, who will pay for it, who will even diagnose you?\n \n My wife's friend died of cancer a few months ago. He was a real estate agent and he had no insurance. He appeared very sick and he was saying that he had a kidney stone. For some strange reason no operation was performed. When he died the word came out that he had had cancer. I do not know if he was misdiagnosed or if he could not get any treatment so he invented the kidney stone not to alarm people. Now he is dead.", 
   {}, 
   394465, 
   null, 
   1268541840.0
  ], 
  [
   394486, 
   null, 
   "Steeeeve", 
   "I would like to know only one thing. If you are uninsured and you get cancer who will treat you, who will pay for it, who will even diagnose you?\nA cancer center, other people will basically pay for it with higher costs for things, a doctor.\n \n Hate to break it to you but uninsured still get treatment and insured sometimes don't. \n \n \nMy wife's friend died of cancer a few months ago. He was a real estate agent and he had no insurance. He appeared very sick and he was saying that he had a kidney stone. For some strange reason no operation was performed. When he died the word came out that he had had cancer. I do not know if he was misdiagnosed or if he could not get any treatment so he invented the kidney stone not to alarm people. Now he is dead.\nOk? Not sure how being misdiagnosed relates. I've had friends get misdiagnosed who were insured and it cost them big. Sorry to say this doesn't change dependent on the health care system you get. I can bring out stories of people in Canada having to wait too long to get care to the point where it was too late. I don't think it is as common as some here would have you believe and I don't believe it shows Canada has a bad health care system. I prefer facts and logic to make my points, not stories. I'm sorry for your wife's friends loss though.", 
   {}, 
   394484, 
   null, 
   1268543820.0
  ], 
  [
   394496, 
   null, 
   "modulus", 
   "A cancer center, other people will basically pay for it with higher costs for things, a doctor.\n \n\n \n I will take your word for it that if you show up at a canser center without an insurance card and say I have cancer they will treat you as anybody else, no questions asked.\n \n Here are the things I do not understand. How will you get diagnosed in the first place?\n \n What is the point forcing people in bankruptcy if you do not recover the cost anyway?", 
   {}, 
   394486, 
   null, 
   1268552220.0
  ], 
  [
   394498, 
   null, 
   "modulus", 
   "\n Cancer survival rates are higher in the US then Canada...more importantly, early detection is more likely in the US.\n\n \n Five year relative breast cancer survival rates from CONCORD study.\n Rank....Country....mean (95% confidence interval)\n 1..........Cuba..........84.0 (82.9, 85.2)\n 2..........US.............83.9 (83.7, 84.1)\n 3..........Canada......82.5 (81.9, 83.0)\n 4.........Sweden......82.0 (81.2, 82.7)\n 5.........Japan..........81.6 (79.5, 83.5)\n 6.........Australia.. ..80.7 (80.1, 81.3)\n 8.........France........79.8 (78.2, 81.4)\n 22.......England......69.8 (69.5, 70.2)\n \n First thing to note here is that the differences between the top countries are very small. The CONCORD study report warns that the ranking of the countries maybe unstable. There are differences between these countries that cannot be controlled for, and aspects of statistical analysis that are imprecise. While the CONCORD study defends its methods and says that the resulting biases are small, it also warns that when the differences between countries are small, then a small bias might make a big difference in the ranking. So, the bottom line is that from these data and the warnings provided by the study itself, we do not really know whether Cuba, the US, Canada, Sweden or Japan is 'the best' at treating breast cancer.\n \n Another thing the CONCORD study notes is that the results for the US may be inflated. The problem is that only a part of the population is covered by the cancer registries used for the US analysis, and there is evidence that these registries have higher survival rates than the population covered by other registries and the population as a whole. By contrast, the UK cancer registries used in the analysis cover 100% of the population\n \n Those low UK breast cancer survival rates: Will conservative proposals for reform lead the US to the UK?s problems? | The Seminal\n \n Do not know if we really can conclude that the astronomical cost and inordinate number of MRI scanners are the key to higher survival rates.", 
   {
    "unicode_changes_made": true
   }, 
   394465, 
   null, 
   1268555400.0
  ], 
  [
   394517, 
   null, 
   "Steeeeve", 
   "Five year relative breast cancer survival rates from CONCORD study.\n Rank....Country....mean (95% confidence interval)\n 1..........Cuba..........84.0 (82.9, 85.2)\n 2..........US.............83.9 (83.7, 84.1)\n 3..........Canada......82.5 (81.9, 83.0)\n 4.........Sweden......82.0 (81.2, 82.7)\n 5.........Japan..........81.6 (79.5, 83.5)\n 6.........Australia.. ..80.7 (80.1, 81.3)\n 8.........France........79.8 (78.2, 81.4)\n 22.......England......69.8 (69.5, 70.2)\n \n First thing to note here is that the differences between the top countries are very small. The CONCORD study report warns that the ranking of the countries maybe unstable. There are differences between these countries that cannot be controlled for, and aspects of statistical analysis that are imprecise. While the CONCORD study defends its methods and says that the resulting biases are small, it also warns that when the differences between countries are small, then a small bias might make a big difference in the ranking. So, the bottom line is that from these data and the warnings provided by the study itself, we do not really know whether Cuba, the US, Canada, Sweden or Japan is 'the best' at treating breast cancer.\n \n Another thing the CONCORD study notes is that the results for the US may be inflated. The problem is that only a part of the population is covered by the cancer registries used for the US analysis, and there is evidence that these registries have higher survival rates than the population covered by other registries and the population as a whole. By contrast, the UK cancer registries used in the analysis cover 100% of the population\n \n Those low UK breast cancer survival rates: Will conservative proposals for reform lead the US to the UK?s problems? | The Seminal\n \n Do not know if we really can conclude that the astronomical cost and inordinate number of MRI scanners are the key to higher survival rates.\nWe certainly can conclude the US has better screening and thus higher 5yr survival rates for cancer. That same study noted the US has better prevention and early detection testing than other countries. This can only occur if you have lots of equipment. Maybe it is not worth it, that's a different argument. I notice you decided to only look at breast cancer. If you look at all cancers from that same study the numbers come out 61-58 for women and higher for men", 
   {
    "unicode_changes_made": true
   }, 
   394498, 
   null, 
   1268580840.0
  ], 
  [
   394542, 
   null, 
   "modulus", 
   "We certainly can conclude the US has better screening and thus higher 5yr survival rates for cancer. That same study noted the US has better prevention and early detection testing than other countries. This can only occur if you have lots of equipment. Maybe it is not worth it, that's a different argument. I notice you decided to only look at breast cancer. If you look at all cancers from that same study the numbers come out 61-58 for women and higher for men\n\n \n I would still like to know how you get screened if you do not have health insurance.", 
   {}, 
   394517, 
   null, 
   1268600220.0
  ], 
  [
   394574, 
   null, 
   "JPSartre12", 
   "I would like to know only one thing. If you are uninsured and you get cancer who will treat you, who will pay for it, who will even diagnose you?\n \n My wife's friend died of cancer a few months ago. He was a real estate agent and he had no insurance. He appeared very sick and he was saying that he had a kidney stone. For some strange reason no operation was performed. When he died the word came out that he had had cancer. I do not know if he was misdiagnosed or if he could not get any treatment so he invented the kidney stone not to alarm people. Now he is dead.\n\n \n I'm sorry to sound so callous, but your friend was a fool. He was an employed real estate agent that chose not to pay for healthcare insurance. \n Did he also drive without car insurance?", 
   {}, 
   394484, 
   null, 
   1268612160.0
  ], 
  [
   394583, 
   null, 
   "modulus", 
   "I'm sorry to sound so callous, but your friend was a fool. He was an employed real estate agent that chose not to pay for healthcare insurance. \n Did he also drive without car insurance?\n\n \n This debate is about early diagnosis and how it happens for the 40 million uninsured.\n \n How do you know that my wife's fried was a fool as opposed to not being able to get health insurance due to pre-existing conditions?\n \n Do you know how expensive health insurance is for individuals? Given the real estate crisis maybe he simply could not afford it.", 
   {}, 
   394574, 
   null, 
   1268614620.0
  ], 
  [
   394590, 
   null, 
   "Steeeeve", 
   "I would still like to know how you get screened if you do not have health insurance.\nGo to a doctor or hospital.\n \n Now, you seem to just avoid my points and make up new ones of your own. If your points are so valid, why run away from them?", 
   {}, 
   394542, 
   null, 
   1268617740.0
  ], 
  [
   394612, 
   null, 
   "modulus", 
   "Go to a doctor or hospital.\n \n Now, you seem to just avoid my points and make up new ones of your own. If your points are so valid, why run away from them?\n\n \n Do people without insurance actually go to a doctor for early screening?\n \n Well, you avoided my point that the numbers were not so accurate and that the U.S. numbers may be inflated because the statistics do not cover the entire population.\n \n You simply asserted that the U.S. had higher survival rates because of better screening. Is the screening done by CAT scanners or MRI scanners? How do you explain that Cuba has the same breast cancer survival rate as the U.S.? Canada has practically the same survival rate for 2/3 of the cost.\n \n I am not changing the subject. I am trying to reconcile the alleged early screening with the 40 million uninsured. And I still do not know how you reconcile it. I am questioning if the early screening is really true. BTW, the health bill before the Congress has provisions and incentives for prevention and early detection.", 
   {}, 
   394590, 
   null, 
   1268624280.0
  ], 
  [
   394615, 
   null, 
   "Steeeeve", 
   "Do people without insurance actually go to a doctor for early screening?\nSome do some don't. Seeing as I am frequently at two state hospitals I see people come in without insurance a lot. I suspect people without insurance who are also poor are less likely to come unless a problem exists. \n \n \nWell, you avoided my point that the numbers were not so accurate and that the U.S. numbers may be inflated because the statistics do not cover the entire population.\nThat's because your point has no meaning. The study didn't say they were not accurate anyway. Read page 22-23 of the study: http://healthcare.procon.org/sourcefiles/CONCORDCancerSurvivalStudy.pdf\n \n \nYou simply asserted that the U.S. had higher survival rates because of better screening. Is the screening done by CAT scanners or MRI scanners? \nYou were talking about CAT scans. I merely extended this to brain tumors and then all cancers since brain tumor rates are harder to find for other countries. \n \n \nHow do you explain that Cuba has the same breast cancer survival rate as the U.S.? Canada has practically the same survival rate for 2/3 of the cost.\nHow many MRI and CAT scanners are used to detect breast cancer? What hospital do you go to!? Why are you only worried about breast cancer? \n \n \nI am not changing the subject. I am trying to reconcile the alleged early screening with the 40 million uninsured.\nNo, you are avoiding the point. You said a longer wait time for a CAT scan makes no difference in care. The types of cancers (so forth) that are detected by at CAT are more survivable in the US than in Canada. That includes our uninsured.", 
   {}, 
   394612, 
   null, 
   1268625540.0
  ], 
  [
   394629, 
   null, 
   "JPSartre12", 
   "This debate is about early diagnosis and how it happens for the 40 million uninsured.\n \n How do you know that my wife's fried was a fool as opposed to not being able to get health insurance due to pre-existing conditions?\n\n \n Considering that most people have health insurance from the time they start their working careers, there are few pre-existing conditions.....unless you have juvenile diabetes, that is. And even with pre-existing condition, you can get health insurance via a group plan that most bigger companies participate in.\n \n\n Do you know how expensive health insurance is for individuals? Given the real estate crisis maybe he simply could not afford it.\n\n \n Yeah, I do. My In-Laws retired before they were eligible for Medicare and paid ~$900-$1000/Mo. \n Certainly not cheap, but how much is your health worth to you? Is it worth buying a more affordable house or not having two new cars in the garage?\n I know people who say they can't afford healthcare insurance yet that have no problem \"keeping up with the Jones\" and spending their money on other things.", 
   {}, 
   394583, 
   null, 
   1268628540.0
  ], 
  [
   394848, 
   null, 
   "modulus", 
   "Some do some don't. Seeing as I am frequently at two state hospitals I see people come in without insurance a lot. I suspect people without insurance who are also poor are less likely to come unless a problem exists. \n \n That's because your point has no meaning. The study didn't say they were not accurate anyway. Read page 22-23 of the study: http://healthcare.procon.org/sourcefiles/CONCORDCancerSurvivalStudy.pdf\n \n You were talking about CAT scans. I merely extended this to brain tumors and then all cancers since brain tumor rates are harder to find for other countries. \n \n How many MRI and CAT scanners are used to detect breast cancer? What hospital do you go to!? Why are you only worried about breast cancer? \n \n No, you are avoiding the point. You said a longer wait time for a CAT scan makes no difference in care. The types of cancers (so forth) that are detected by at CAT are more survivable in the US than in Canada. That includes our uninsured.\n\n \n You think that 2 weeks difference in cancer detection makes any difference?\n \n It is you who is dancing around the point. If a significant portion of the uninsured (I suspect 90% of them) do not go to hospital for preventive screening than their cancer cannot be detected early.", 
   {}, 
   394615, 
   null, 
   1268720220.0
  ], 
  [
   394869, 
   null, 
   "JPSartre12", 
   "I see that you haven't responded to my last post above. What's the matter? Finding it difficult to argue against the facts? emoticon_confused", 
   {}, 
   394848, 
   null, 
   1268759880.0
  ], 
  [
   394962, 
   null, 
   "Steeeeve", 
   "You think that 2 weeks difference in cancer detection makes any difference?\nMore like four weeks by your own admission earlier. And yes, one month makes difference and the survival rates probably show that to be somewhat true..although I'm sure the two aren't totally related. \n \n \nIt is you who is dancing around the point. If a significant portion of the uninsured (I suspect 90% of them) do not go to hospital for preventive screening than their cancer cannot be detected early.\nChanging the focus and then saying I am dancing around it is a fallacy and will not work. Longer wait times for a CAT scan and MRI probably do make a difference and the stats back this up. \n \n If having single-payer healthcare causes us to have lower survival rates for many diseases, such as cancer, would this make sense to do? Granted, it isn't a forgone conclusion that single-payer is the reason why canada and europe have such terrible 5 year survivor rates but I suspect our technology has a little to do with it considering not much else is different.", 
   {}, 
   394848, 
   null, 
   1268775180.0
  ], 
  [
   394970, 
   null, 
   "JPSartre12", 
   "More like four weeks by your own admission earlier. And yes, one month makes difference and the survival rates probably show that to be somewhat true..although I'm sure the two aren't totally related. \n \n Changing the focus and then saying I am dancing around it is a fallacy and will not work. Longer wait times for a CAT scan and MRI probably do make a difference and the stats back this up. \n \n If having single-payer healthcare causes us to have lower survival rates for many diseases, such as cancer, would this make sense to do? Granted, it isn't a forgone conclusion that single-payer is the reason why canada and europe have such terrible 5 year survivor rates but I suspect our technology has a little to do with it considering not much else is different.\n\n \n A little interesting tidbit from your study stated that those in the US with private insurance had a higher survival rate than those with government insurance. I'll keep my private insurance, thank you. emoticon_xgood", 
   {}, 
   394962, 
   null, 
   1268776740.0
  ], 
  [
   395012, 
   null, 
   "josephdphillips", 
   "A little interesting tidbit from your study stated that those in the US with private insurance had a higher survival rate than those with government insurance. I'll keep my private insurance, thank you. emoticon_xgood\n\n \n Until you lose it, of course, after which you'll never get it back.\n \n Better use your benefits while you still can.", 
   {}, 
   394970, 
   null, 
   1268781660.0
  ], 
  [
   395070, 
   null, 
   "modulus", 
   "A little interesting tidbit from your study stated that those in the US with private insurance had a higher survival rate than those with government insurance. I'll keep my private insurance, thank you. emoticon_xgood\n\n \n Here is how your private insurance works. You get sick and you lose a number of days at work. So you get fired. Now you are on COBRA. The premiums are so high that your unemployment check will not cover it. So you will lose it too. If you have a serious ilness you have two choices. One of them is that you will die. If you are lucky they will treat you even though you cannot pay. Then they will send collectors after you, strip you of all your assets and force you into bankruptcy. Now you are a have not.", 
   {}, 
   394970, 
   null, 
   1268810340.0
  ], 
  [
   395085, 
   null, 
   "JPSartre12", 
   "Until you lose it, of course, after which you'll never get it back.\n \n Better use your benefits while you still can.\n\n \n There's little disagreement amongst people that portability is one area that needs to be addressed. It's one of the few areas in which both parties agree. \n \n \nHere is how your private insurance works. You get sick and you lose a number of days at work. So you get fired. Now you are on COBRA. The premiums are so high that your unemployment check will not cover it. So you will lose it too. If you have a serious ilness you have two choices. One of them is that you will die. If you are lucky they will treat you even though you cannot pay. Then they will send collectors after you, strip you of all your assets and force you into bankruptcy. Now you are a have not.\n\n \n Here's how it works in reality. You get sick. You go on short-term disability and get paid. The company can't fire you. It's illegal to do so.\n You move from short-term disability to long-term disability, which fortunately, you were smart enough to sign up for and you continue to get paid. If after a year or more, you are still unable to work, you are transitioned onto permanent disability and are eligible for Social Security Disability and SSI. \n Maybe you should learn a little about how things work in the US before making dumb statements.", 
   {}, 
   395070, 
   null, 
   1268838360.0
  ], 
  [
   395097, 
   null, 
   "josephdphillips", 
   "Here is how your private insurance works. You get sick and you lose a number of days at work. So you get fired. Now you are on COBRA. The premiums are so high that your unemployment check will not cover it. So you will lose it too. If you have a serious ilness you have two choices. One of them is that you will die. If you are lucky they will treat you even though you cannot pay. Then they will send collectors after you, strip you of all your assets and force you into bankruptcy. Now you are a have not.\n\n \n Yes, indeed. That is exactly how it works. I have first-hand knowledge of that.", 
   {}, 
   395070, 
   null, 
   1268845500.0
  ], 
  [
   395098, 
   null, 
   "josephdphillips", 
   "There's little disagreement amongst people that portability is one area that needs to be addressed. It's one of the few areas in which both parties agree.\n\n \n It doesn't mean anything will be done, by either. \n \n \nHere's how it works in reality. You get sick. You go on short-term disability and get paid. The company can't fire you. It's illegal to do so.\n\n \n No, that's not how it works at all. If you get sick, you get fired. Period. It's not illegal -- not in California, anyway. You can be fired here for any reason.\n \n \nYou move from short-term disability to long-term disability, which fortunately, you were smart enough to sign up for and you continue to get paid.\n\n \n Disability insurance doesn't cover sickness. It covers disability only, and the proof is on the claimant. That proof is hard to come by, and expensive.\n \n \nIf after a year or more, you are still unable to work, you are transitioned onto permanent disability and are eligible for Social Security Disability and SSI.\n\n \n Again, if you are able to work and can't find work, the government doesn't help you. And if you can find work but the work doesn't come with any benefits -- which is usually the case here in California -- the government doesn't help you.\n \n \nMaybe you should learn a little about how things work in the US before making dumb statements.\n\n \n The statements aren't dumb. They're well researched. First hand.", 
   {}, 
   395085, 
   null, 
   1268845800.0
  ], 
  [
   395101, 
   null, 
   "TRIGGER", 
   "The same people that have run the American economy into the ground now think they can run our health care system. Has anyone thought this through? Government loses money at virtually everything it does and touches. Virtually every level of government operates under a deficit.\n \n Government can't spell, let alone achieve profitability at anything. Government is the most disastrous and inept failure at everything it does of any organization in the world. It only survives its colossal mismanagement of everything by raising taxes and therefore confiscating more money from the private sector which is filled with people who are competent and do know how to run a business and achieve profitability. In other words, government only survives by confiscating money from smart people in the private sector to pay for its mismanagement, waste, corruption and nonstop failure and losses.\n \n Government runs Social Security. It is approaching bankruptcy. Government runs Medicare. It is approaching bankruptcy. Government runs education. Education spends tens of billions of dollars each year and yet somehow manages to produce worse results every year, and always demands more money in reward for it's failure. When government took over education, American children were ranked among the best in the world. Today our children's educational record is among the worst in the world.\n \n Government took over Amtrak in the same way it took over GM, promising a quick return to profitability. Amtrak acrews losses every year for the U.S. taxpayer. In 1970 when Amtrak was founded, $300 million was approved by Congress to run it. The government predicted profitability within 5 years. That was 39 years and over $30 billion dollars in losses since!\n \n Government has promised a quick return to profitability for GM. Yet these are the same government bureaucrats who have produced a deficit of $1.75 trillion per YEAR. These same government bureaucrats have produced a national debt of somewhere between $60 trillion and $100 trillion (depending on how many years out you predict the responsibilities of Social Security and Medicare). Our national debt is now larger than world GDP. Which of you actually believe that these same people could take over GM and turn a company that loses billions per year into a profitable company in a short period of time? The Government has put the world's most inept and corrupt bureaucrats in charge of GM, and expect improvement?\n \n Here is the clincher: In Nevada, prostitution is legal and is almost always profitable. It is next to impossible to lose money in the world's oldest profession. The most profitable brothel ever was the infamous Mustang Ranch. The owner earned tens of millions of dollars, and he grew fabulously wealthy. One problem: he \"forgot\" to pay his taxes. He was indicted for tax evasion, escaped to Brazil, and is still today a fugitive from justice. The U.S. government took over the Mustang Ranch. The Government took over managing the most successful and profitable brothel in America and bankrupt it in less than one year under . That is the capability of our Government buarucrats, no matter how you feel about brothels, this all you need to know about the ability of government to run a business to see what you are in for with government run health care.\n \n Nevada is a state where the constitution bans income taxes and career politicians, but welcomes guns in the hands of law-abiding citizens. They have common sense and plenty of it. If the federal government can't run a brothel, they certainly shouldn't run our health care system. The same people responsible for massive deficit and debt, losses, waste and mismanagement in every thing they touch, should not be put in charge of 16 percent of our GDP. If we put them in charge of our health care we are in deep trouble.", 
   {}, 
   395098, 
   null, 
   1268848380.0
  ], 
  [
   395103, 
   null, 
   "JPSartre12", 
   "Nice post Trigger. emoticon_xhoho", 
   {}, 
   395101, 
   null, 
   1268849460.0
  ], 
  [
   395104, 
   null, 
   "josephdphillips", 
   "The same people responsible for massive deficit and debt, losses, waste and mismanagement as far as the eye can see, should not be put in charge of 16 percent of our GDP. We are in deep trouble.\n\n \n Several assumptions are implied in this statement.\n \n 1. Health care's consumption of 16 percent of the country's gross domestic product is acceptable\n \n 2. The present delivery of health care to the privileged, and only to the privileged, is adequate\n \n 3. Only profitable enterprises are worth doing\n \n I have to question these assumptions.", 
   {}, 
   395101, 
   null, 
   1268849700.0
  ], 
  [
   395111, 
   null, 
   "TRIGGER", 
   "Several assumptions are implied in this statement.\n \n 1. Health care's consumption of 16 percent of the country's gross domestic product is acceptable.\n\n \n It dosn't comsume 16% of the GDP. Health care contributes 16% to the GDP. \n \n \n2. The present delivery of health care to the privileged, and only to the privileged, is adequate.\n\n \n I don't beleave you can call 90 to 95% of the US population the privalaged.\n \n \n3. Only profitable enterprises are worth doing.\n\n \n I'm not expecting them to turn a profit I expect them not to generate huge deficits.", 
   {}, 
   395104, 
   null, 
   1268852880.0
  ], 
  [
   395113, 
   null, 
   "JPSartre12", 
   "Several assumptions are implied in this statement.\n \n 1. Health care's consumption of 16 percent of the country's gross domestic product is acceptable\n \n It doesn't matter if it's acceptable or not, that's the fact.\n 2. The present delivery of health care to the privileged, and only to the privileged, is adequate\n Only people with money can eat at McDonalds, too. Until the public agrees that healthcare is something other than a paid for service, you get what you pay for. If you don't pay, you don't get.\n \n 3. Only profitable enterprises are worth doing\n \n As long as Uncle Sam is kept out of it, it should remain self-sufficient\n I have to question these assumptions.\n\n \n That's your prerogative. After all, freedom of speech, unlike healthcare, is a Constitutional Right. ;)", 
   {}, 
   395104, 
   null, 
   1268853120.0
  ], 
  [
   395119, 
   null, 
   "josephdphillips", 
   "It dosn't comsume 16% of the GDP. Health care contributes 16% to the GDP.\n\n \n It's not a contribution to those who wonder how long they'll live without health insurance. \n \n \nI don't beleave you can call 90 to 95% of the US population the privalaged.\n\n \n The United States census says it's less than 82 percent. And it's dropping.\n \n \nI'm not expecting them to turn a profit I expect them not to generate huge deficits.\n\n \n Spending on the military also generates huge deficits. I don't see anyone here arguing Americans have no right to a military.\n \n The bottom line is what kind of society we want to live in.", 
   {}, 
   395111, 
   null, 
   1268855940.0
  ], 
  [
   395120, 
   null, 
   "josephdphillips", 
   "It doesn't matter if it's acceptable or not, that's the fact.\n\n \n It's a fact, and it's unacceptable.\n \n \nOnly people with money can eat at McDonalds, too. Until the public agrees that healthcare is something other than a paid for service, you get what you pay for.\n\n \n And so the public will, eventually. When the present system implodes, as it inevitably will, and the majority do not have, or are not offered, health insurance, either at any price or at a price they can afford, the public will question why quality for the few is more important than quantity for the many.\n \n \nAs long as Uncle Sam is kept out of it, it should remain self-sufficient\n\n \n It's self-sufficient, by definition, in every other country in the world.\n \n The health insurance industry currently profits from killing off the sick and milking the healthy. In other societies, in other societies, that incentive, that health care delivery model, is considered immoral. It should be here, as well.", 
   {}, 
   395113, 
   null, 
   1268856300.0
  ], 
  [
   395125, 
   null, 
   "TRIGGER", 
   " The United States census says it's less than 82 percent. And it's dropping.\n\n \n Only if you leave in illegal aliens an those between 18 and 25 who can afford and chose not to have it then yes. \n \n \nSpending on the military also generates huge deficits. I don't see anyone here arguing Americans have no right to a military.\n\n \n You are compairing apples and oranges. The military is there to protect our country and it's intrerists around the world. \n \n \n \nThe bottom line is what kind of society we want to live in. \n\n \n One where a burucrate isn't standing in between you, your doctor and or your health care.", 
   {}, 
   395119, 
   null, 
   1268858700.0
  ], 
  [
   395155, 
   null, 
   "josephdphillips", 
   "Only if you leave in illegal aliens an those between 18 and 25 who can afford and chose not to have it then yes.\n\n \n That would be incorrect. Both my children are in that range. Their employers do not offer health insurance. Neither does mine.\n \n \nYou are compairing apples and oranges. The military is there to protect our country and it's intrerists around the world.\n\n \n Which doesn't really matter if the people they're defending don't have health insurance.\n \n \nOne where a burucrate isn't standing in between you, your doctor and or your health care.\n\n \n What is this \"my doctor\" nonsense? Who has his/her own doctor?\n \n Out here you get the doctor that comes with your plan -- if you have one. You don't get a choice.\n \n Furthermore the injection of politics in health care is a good thing. It's about time we had a national debate about how much health care should be available and at what cost.", 
   {}, 
   395125, 
   null, 
   1268866560.0
  ], 
  [
   395169, 
   null, 
   "TRIGGER", 
   "That would be incorrect. Both my children are in that range. Their employers do not offer health insurance. Neither does mine.\n\n \n So your saying you and you kids are repesentative of everyone?\n \n \n \n \nWhich doesn't really matter if the people they're defending don't have health insurance.\n\n \n Well this statement makes absolutly no sense.\n \n \n \n \nWhat is this \"my doctor\" nonsense? Who has his/her own doctor?\n \n Out here you get the doctor that comes with your plan -- if you have one. You don't get a choice.\n\n \n Boy am I glad Cali isn't representative of any other state. I chose my doctor but if this health care bill goes through everyone will get Cali care. You'll get what someone else thinks you should get. What you will get is health care not good health care just enough so that breaucrates can still collect your taxes. If you don't beleave me just read Tom Dashals book.\n \n \nFurthermore the injection of politics in health care is a good thing. It's about time we had a national debate about how much health care should be available and at what cost. \n\n \n You got to save some of that weed for me cause you got to be high to think that politics in health care to be a good idea. Yep putting a breaucrate in charge of your health care is a good idea. If the doctor makes a mistake you can sue, if a breaucrate does oh well your screwed. Yup thats a great idea.", 
   {}, 
   395155, 
   null, 
   1268873340.0
  ], 
  [
   395176, 
   null, 
   "modulus", 
   "\n Only people with money can eat at McDonalds, too. Until the public agrees that healthcare is something other than a paid for service, you get what you pay for. If you don't pay, you don't get.\n \n\n \n If you get what you paid for and you did not pay for health insurance and you get critically injured and bloody should you be ejected from an emergency room? If not why not? Do you get care if you have not paid for it? Make up your mind!", 
   {}, 
   395113, 
   null, 
   1268892420.0
  ], 
  [
   395177, 
   null, 
   "modulus", 
   "The same people that have run the American economy into the ground now think they can run our health care system. Has anyone thought this through? Government loses money at virtually everything it does and touches. Virtually every level of government operates under a deficit.\n \n Government can't spell, let alone achieve profitability at anything. Government is the most disastrous and inept failure at everything it does of any organization in the world. It only survives its colossal mismanagement of everything by raising taxes and therefore confiscating more money from the private sector which is filled with people who are competent and do know how to run a business and achieve profitability. In other words, government only survives by confiscating money from smart people in the private sector to pay for its mismanagement, waste, corruption and nonstop failure and losses.\n \n Government runs Social Security. It is approaching bankruptcy. Government runs Medicare. It is approaching bankruptcy. Government runs education. Education spends tens of billions of dollars each year and yet somehow manages to produce worse results every year, and always demands more money in reward for it's failure. When government took over education, American children were ranked among the best in the world. Today our children's educational record is among the worst in the world.\n \n Government took over Amtrak in the same way it took over GM, promising a quick return to profitability. Amtrak acrews losses every year for the U.S. taxpayer. In 1970 when Amtrak was founded, $300 million was approved by Congress to run it. The government predicted profitability within 5 years. That was 39 years and over $30 billion dollars in losses since!\n \n Government has promised a quick return to profitability for GM. Yet these are the same government bureaucrats who have produced a deficit of $1.75 trillion per YEAR. These same government bureaucrats have produced a national debt of somewhere between $60 trillion and $100 trillion (depending on how many years out you predict the responsibilities of Social Security and Medicare). Our national debt is now larger than world GDP. Which of you actually believe that these same people could take over GM and turn a company that loses billions per year into a profitable company in a short period of time? The Government has put the world's most inept and corrupt bureaucrats in charge of GM, and expect improvement?\n \n Here is the clincher: In Nevada, prostitution is legal and is almost always profitable. It is next to impossible to lose money in the world's oldest profession. The most profitable brothel ever was the infamous Mustang Ranch. The owner earned tens of millions of dollars, and he grew fabulously wealthy. One problem: he \"forgot\" to pay his taxes. He was indicted for tax evasion, escaped to Brazil, and is still today a fugitive from justice. The U.S. government took over the Mustang Ranch. The Government took over managing the most successful and profitable brothel in America and bankrupt it in less than one year under . That is the capability of our Government buarucrats, no matter how you feel about brothels, this all you need to know about the ability of government to run a business to see what you are in for with government run health care.\n \n Nevada is a state where the constitution bans income taxes and career politicians, but welcomes guns in the hands of law-abiding citizens. They have common sense and plenty of it. If the federal government can't run a brothel, they certainly shouldn't run our health care system. The same people responsible for massive deficit and debt, losses, waste and mismanagement in every thing they touch, should not be put in charge of 16 percent of our GDP. If we put them in charge of our health care we are in deep trouble.\n\n \n What does this rant have to do with the healthcare reform? Don't you think that these anti-government outbursts are getting repetitive? Do you have anything substantive to say? I wonder if Steve considers your contribution a honest debate about healthcare reform.", 
   {}, 
   395101, 
   null, 
   1268892660.0
  ], 
  [
   395197, 
   null, 
   "TRIGGER", 
   "What does this rant have to do with the healthcare reform? Don't you think that these anti-government outbursts are getting repetitive? Do you have anything substantive to say? I wonder if Steve considers your contribution a honest debate about healthcare reform.\n\n \n I kind of thought it was obvious. Government can't be trusted to run anything properly. To put them in charge of healthcare is to bankrupt the system and sell out our childrens future, then where will we be? With the government taking control of healthcare which is 1/7 th of our economy they could through mismanagment easly bankrupt the country. How difficult is that to understand. Is this the legacy you want for the future of our country and the next 3+ generations? Or is it your plan to just distroy this nation and it's future?", 
   {}, 
   395177, 
   null, 
   1268922300.0
  ], 
  [
   395201, 
   null, 
   "JPSartre12", 
   "If you get what you paid for and you did not pay for health insurance and you get critically injured and bloody should you be ejected from an emergency room? If not why not? Do you get care if you have not paid for it? Make up your mind!\n\n \n I see emergency care and long-term care as two dinstinctly-different scenarios. As a society, we value life. Emergency treatment of life-threatening illnesses/injuries are a manifestation of that value and are a burden that all share. \n But, your long-term health is YOUR responsibility in a free society. Uncle Sam can't tell you what to eat, drink, smoke, etc., YOU are responsible to be the keeper of your own body.", 
   {}, 
   395176, 
   null, 
   1268922660.0
  ], 
  [
   395211, 
   null, 
   "Steeeeve", 
   "Here is how your private insurance works. You get sick and you lose a number of days at work. So you get fired. Now you are on COBRA. The premiums are so high that your unemployment check will not cover it. So you will lose it too. If you have a serious ilness you have two choices. One of them is that you will die. If you are lucky they will treat you even though you cannot pay. Then they will send collectors after you, strip you of all your assets and force you into bankruptcy. Now you are a have not.\nEven if this were true, which it isn't, this doesn't speak to private vs public health care insurance. \n \n More importantly, it is rare, if ever, that someone is getting fired for being sick these days. Most every employer has some disability insurance since you will most likely get sued if you fire someone for being sick. \n \n Your scenario is absurd.", 
   {}, 
   395070, 
   null, 
   1268928240.0
  ], 
  [
   395214, 
   null, 
   "Steeeeve", 
   "I wonder if Steve considers your contribution a honest debate about healthcare reform.\nYou forced me to read that post...thanks emoticon_angry\n \n It is an honest question with reform albeit not a very useful post in terms of solving anything. Basically I think it would be easy to get real health care reform without a government takeover. With that said, I think if is foolish to think you don't need government at all. Health care really does deal with peoples lives and so at some point government has to have a minimal role (regulation or something close to that) which would cause higher costs and inefficiencies for the sole purpose of saving lives. BUT, this would be after every other possibility is off the table. Actually, that's my stance with every government action...only do it if it is totally crazy to have private do it....like own roads (no one wants competing interstate highways).", 
   {}, 
   395177, 
   null, 
   1268928600.0
  ], 
  [
   395221, 
   null, 
   "JPSartre12", 
   "You forced me to read that post...thanks emoticon_angry\n \n It is an honest question with reform albeit not a very useful post in terms of solving anything. Basically I think it would be easy to get real health care reform without a government takeover. With that said, I think if is foolish to think you don't need government at all. Health care really does deal with peoples lives and so at some point government has to have a minimal role (regulation or something close to that) which would cause higher costs and inefficiencies for the sole purpose of saving lives. BUT, this would be after every other possibility is off the table. Actually, that's my stance with every government action...only do it if it is totally crazy to have private do it....like own roads (no one wants competing interstate highways).\n\n \n Canada has been playing with private roads for quite some time now. Driving on the 407ETR, for example, is no bargain, that's for sure.emoticon_wow\n 407 ETR - Tolls & Fees", 
   {}, 
   395214, 
   null, 
   1268932920.0
  ], 
  [
   395231, 
   null, 
   "TRIGGER", 
   "If you get what you paid for and you did not pay for health insurance and you get critically injured and bloody should you be ejected from an emergency room? If not why not? Do you get care if you have not paid for it? Make up your mind!\n\n \n Well if you had been to an emergency room you would know that you can't be ejected and you will be treated whether you can pay or not, all you have to do is look around there are signs all over atesting to that fact.", 
   {}, 
   395176, 
   null, 
   1268940480.0
  ], 
  [
   395235, 
   null, 
   "TRIGGER", 
   "I beleave that if you want real reform start with a number of things to lower costs first, which will allow more people to enter the system. One of the major costs in health care is tort. Every doctor has to carry Malpractice Insurance which costs any where between $100,000 to $250,000 annualy, not to mention what hospital might pay for insurance, just imagine what this cost alone adds to your healthcare premiums. The way the system is set up it favors friviolus laws suits. When it's cheaper for insurance companies to settle a suit that to fight it this encourages unscruplus lawyers to bring these suits. Also even in the suits that have merit these suits are also taken advantage of by lawyers seeking astronomical settlements for their claiments. This could easly be rectified by making one who brings a law suit and looses to be responsable for the defendents court costs and lawyers fees. Another reform that could be implimented would be to not allow for pain and suffering as long as the claiment incures no irreperable or perminent dammage. \n \n Another thing that should be addressed is that health insurance companies be able to sell their policies nation wide like automobile insurance. This will allow these companies to compete which will also lower premiums.\n \n Also if the Federal Government gave tax incentives to bussiness to carry health insurance. These three things would help make health insurance more affordable for all bussinesses to carry insurance for all their employees and lower all healthcare costs.", 
   {}, 
   395231, 
   null, 
   1268944560.0
  ], 
  [
   395241, 
   null, 
   "JPSartre12", 
   "I beleave that if you want real reform start with a number of things to lower costs first, which will allow more people to enter the system. One of the major costs in health care is tort. Every doctor has to carry Malpractice Insurance which costs any where between $100,000 to $250,000 annualy, not to mention what hospital might pay for insurance, just imagine what this cost alone adds to your healthcare premiums. The way the system is set up it favors friviolus laws suits. When it's cheaper for insurance companies to settle a suit that to fight it this encourages unscruplus lawyers to bring these suits. Also even in the suits that have merit these suits are also taken advantage of by lawyers seeking astronomical settlements for their claiments. This could easly be rectified by making one who brings a law suit and looses to be responsable for the defendents court costs and lawyers fees. Another reform that could be implimented would be to not allow for pain and suffering as long as the claiment incures no irreperable or perminent dammage. \n \n Another thing that should be addressed is that health insurance companies be able to sell their policies nation wide like automobile insurance. This will allow these companies to compete which will also lower premiums.\n \n Also if the Federal Government gave tax incentives to bussiness to carry health insurance. These three things would help make health insurance more affordable for all bussinesses to carry insurance for all their employees and lower all healthcare costs.\n\n \n By establishing national standards of care, malpractice lawsuits can be dramatically curtailed as well. For example, a patient is diagnosed with X type cancer. The doctor looks up Cancer X on the computer and a set of protocols for treating it appear on the screen. As long as these protocols are followed, it should insulate the doctor from lawsuits. \n A similar protocol can be developed for new drugs that establishs testing program requirements and FDA review. If the FDA approves a new drug, then the manufacturer should be held harmless unless it can be shown that they fudged results.\n \n Along with your proposal above AND the elimination of contingency lawsuits, the cost of defensive medicine and prescription drugs should go down.", 
   {}, 
   395235, 
   null, 
   1268950500.0
  ], 
  [
   395244, 
   null, 
   "TRIGGER", 
   "By establishing national standards of care, malpractice lawsuits can be dramatically curtailed as well. For example, a patient is diagnosed with X type cancer. The doctor looks up Cancer X on the computer and a set of protocols for treating it appear on the screen. As long as these protocols are followed, it should insulate the doctor from lawsuits. \n A similar protocol can be developed for new drugs that establishs testing program requirements and FDA review. If the FDA approves a new drug, then the manufacturer should be held harmless unless it can be shown that they fudged results.\n \n Along with your proposal above AND the elimination of contingency lawsuits, the cost of defensive medicine and prescription drugs should go down.\n\n \n I concure with you. May be we should be hired to write the bill what do you think..emoticon_xgood", 
   {}, 
   395241, 
   null, 
   1268950920.0
  ], 
  [
   395245, 
   null, 
   "JPSartre12", 
   "I concure with you. May be we should be hired to write the bill what do you think..emoticon_xgood\n\n \n Works for me. emoticon_xhoho", 
   {}, 
   395244, 
   null, 
   1268950980.0
  ], 
  [
   395263, 
   null, 
   "josephdphillips", 
   "So your saying you and you kids are repesentative of everyone?\n\n \n Eventually, yes.\n \n Currently only 82 percent, more or less, have health insurance. It doesn't matter whether or not people voluntarily go without, or how people spend their money. Everyone eventually pays the price.\n \n Furthermore the percentage of insureds is dropping, and it doesn't have to drop to 50 percent before people call for reform. The implosion of the health care system will be palpable to everyone. It will be seen for what it is -- irreversible.\n \n \nWell this statement makes absolutly no sense.\n\n \n As more and more people are forced to drop out of private health care, they become sicker and even harder to insure. Many will join the military just to be insured and many more will wonder why we need to spend trillions to defend a country from attack when the country is eating itself from within.\n \n \nam I glad Cali isn't representative of any other state.\n\n \n It will be. Blue Cross, for instance, reimburses doctors even less than Medicare. More and more physicians are dropping out of PPOs, or are quitting the profession altogether.\n \n \nI chose my doctor but if this health care bill goes through everyone will get Cali care. You'll get what someone else thinks you should get.\n\n \n As it should be.\n \n \nWhat you will get is health care not good health care just enough so that breaucrates can still collect your taxes. If you don't beleave me just read Tom Dashals book.\n\n \n You're taking out of the health care system a lot more than you're putting in, which is why it's failing. Your calumnies against \"bureaucrats\" is just a smoke screen for wanting something for nothing. Eventually even you will be told which doctor is appropriate for your medical condition, whether or not you are permitted an organ transplant, whether or not you can receive experimental treatments -- even how long your connection to a ventilator is considered appropriate for the rest of the country.\n \n That's the way it's done over there, and they do it successfully. The only reason we don't do it here is because the rich want the poor to die.\n \n \nputting a breaucrate in charge of your health care is a good idea.\n\n \n It's better than nothing.\n \n When you have nothing, and you will, you'll agree.\n \n \nIf the doctor makes a mistake you can sue, if a breaucrate does oh well your screwed. Yup thats a great idea.\n\n \n It's still better than not getting treated at all.\n \n As previous posters have stated accurately, if you're diagnosed with cancer in the United States, and you don't have insurance, you die. That's it. End of discussion.\n \n Even if you can afford insurance, if you have any pre-existing condition at all (god help you if you're female, as well), you can't get covered at any price.\n \n So the question is whether or not we are supposed to trust private industry, which only makes money by soaking the healthy, and works very hard at killing off the sick, with the commonweal.", 
   {}, 
   395169, 
   null, 
   1268954520.0
  ], 
  [
   395290, 
   null, 
   "Steeeeve", 
   "Canada has been playing with private roads for quite some time now. Driving on the 407ETR, for example, is no bargain, that's for sure.emoticon_wow\n 407 ETR - Tolls & Fees\nIt is a bad and never cost effective idea. I'm ok having companies build the roads but having every road with a toll is basically a monopoly and will be treated as one because you aren't going to have competing roads with private companies. We won't see Interstate 95 competing with Interstate 97 build 50 feet to the left...what would they compete on? Better exits ramps?\n \n Somethings that just too annoying to let the free market work out...very rare...I just take the inefficiency for the convenience.", 
   {}, 
   395221, 
   null, 
   1268972880.0
  ], 
  [
   395291, 
   null, 
   "TRIGGER", 
   "Currently only 82 percent, more or less, have health insurance. It doesn't matter whether or not people voluntarily go without, or how people spend their money. Everyone eventually pays the price.\n\n \n As I said before that is only if you add in the illegals and those who by choice don't participate. If you remove the illegals between 20 to 30 million you cut the uninsured by half. and cut whats left in half again if you remove those who choose not to particpate. Or do you think the US should insure these people? If we just inforced our imigration laws and deported the illegals you are now at 91% more or less with out insurance. \n \n \nFurthermore the percentage of insureds is dropping, and it doesn't have to drop to 50 percent before people call for reform. The implosion of the health care system will be palpable to everyone. It will be seen for what it is -- irreversible.\n \n \n I would like to see your source for the number of the insured dropping and not tied to illegals or those unemployed. So what do you think will happen if the US is bankrupted by the government miss managment of healthcare? You'll be in even worse shape. \n \n \n \n \nAs more and more people are forced to drop out of private health care, they become sicker and even harder to insure.\n\n \n Source? If you lower healthcare costs by tort reform, establishing national standards of care, establish limits to pain a suffering pay outs, allow health insurance companies to sell their policies nation wide, and Federal and state tax incentives to bussiness who provide for health insurance for their employees. You would see costs fall and enrolment explode. But you will still have those who are between 18 and 28. Whe see them selves as being 6'2 eyes of blue and bullit proof who won't get health care even though they can afford it. \n \n \n \nMany will join the military just to be insured and many more will wonder why we need to spend trillions to defend a country from attack when the country is eating itself from within\n.\n \n If you let the government in to healthcare it will destroy its self and eat us in the process. \n \n \n \n \nIt will be. Blue Cross, for instance, reimburses doctors even less than Medicare. More and more physicians are dropping out of PPOs, or are quitting the profession altogether.\n \n \n I would like to see a source on this, since not only myself but also a friend of mine have had to change physicians in the past few years. I have had to do it 3 times in the past 15 years 1 moved to be nearer an ill family member, another moved out of state because of the cost of malpractice insurance and the third quit practicing for the same reason cost of malpractice insurance. We also lost a pediatrition to early retirment reason cited cost of malpractic insurance. One of my close friends had his neurologist retire early also said cost of malpractice insurance. Even Obamas second cousin who is a doctor says that this healthcare bill will destroy our healthcare system.\n \n The real kicker is The New England Journal of Medicine claims that if the Health care bill goes through we will lose 1/3rd of our health care professionals. \n \n \n \n \nYou're taking out of the health care system a lot more than you're putting in, which is why it's failing.\n\n \n Oh realy. Well just to let you know my company 3 years ago payed $2.4 million in premiums and the claims for that year added up to $377,000.\n \n \nYour calumnies against \"bureaucrats\" is just a smoke screen for wanting something for nothing.\n\n \n LOL You have got to be kidding. LOL Do you actualy beleave what you said? You are the one that pays absouloutly nothing for healthcare while I pay over $7,000 annualy for mine. And you are abdicating for government run healthcare so you don't have to pay for it and I will be responsable to pay for mine and yours. \n \n \nEventually even you will be told which doctor is appropriate for your medical condition, whether or not you are permitted an organ transplant, whether or not you can receive experimental treatments -- even how long your connection to a ventilator is considered appropriate for the rest of the country.\n \n \n And thats the type of healthcare you wish to force on all of us. One where government decides what your life is worth by what is best for the collective. So whos going to sit in judgment on your death panels? \n \n \nThat's the way it's done over there, and they do it successfully. The only reason we don't do it here is because the rich want the poor to die.\n\n \n No, over there when you have slaved your whole life for the collective with nothing to show for your sacrfice. They will with hold healthcare from you because you have out lived your usefullness and are discarded like and empty milk carton. \n \n \n \nWhen you have nothing, and you will, you'll agree.\n\n \n You may be willing to be a slave to the collective but I won't and 75% of the country agrees with me. \n \n \n \nEven if you can afford insurance, if you have any pre-existing condition at all (god help you if you're female, as well), you can't get covered at any price.\n\n \n That can be changed with very easly with regulations.\n \n \nSo the question is whether or not we are supposed to trust private industry, which only makes money by soaking the healthy, and works very hard at killing off the sick, with the commonweal. \n\n \n I trust them a hell of a lot more that government bureacrates.", 
   {}, 
   395263, 
   null, 
   1268980860.0
  ], 
  [
   395292, 
   null, 
   "modulus", 
   "I kind of thought it was obvious. Government can't be trusted to run anything properly. To put them in charge of healthcare is to bankrupt the system and sell out our childrens future, then where will we be? With the government taking control of healthcare which is 1/7 th of our economy they could through mismanagment easly bankrupt the country. How difficult is that to understand. Is this the legacy you want for the future of our country and the next 3+ generations? Or is it your plan to just distroy this nation and it's future?\n\n \n If the insurance companies did their job and controled cost it would not be 1/7 but 1/14 as it is in the rest of the developed countries. But then the governent would not have to take over.", 
   {}, 
   395197, 
   null, 
   1268981460.0
  ], 
  [
   395293, 
   null, 
   "modulus", 
   "You forced me to read that post...thanks emoticon_angry\n \n It is an honest question with reform albeit not a very useful post in terms of solving anything. Basically I think it would be easy to get real health care reform without a government takeover. With that said, I think if is foolish to think you don't need government at all. Health care really does deal with peoples lives and so at some point government has to have a minimal role (regulation or something close to that) which would cause higher costs and inefficiencies for the sole purpose of saving lives. BUT, this would be after every other possibility is off the table.\n\n \n There are several kinds of universal health care systems. There are \"government run\" single payers like in U.K. Canada or Taiwan., there are regulated competing insurance companies like in Switzerland. In France and Germany the system is not completely government run either. And there are several non-profit cooperatives like in Israel. I do not have any opinion which one is better. They all seem to perform roughly on par. The only one that sticks out like sore thumb is the American system. It is twice as expensive, it does not insure everybody and it barely provides the same quality of service.", 
   {}, 
   395214, 
   null, 
   1268982900.0
  ], 
  [
   395301, 
   null, 
   "JPSartre12", 
   "If the insurance companies did their job and controled cost it would not be 1/7 but 1/14 as it is in the rest of the developed countries. But then the governent would not have to take over.\n\n \n If you think that the insurance companies aren't doing anything to keep costs down, then you should talk to a physician that is part of an HMO. The facts dispute your claim.\n \n \nThere are several kinds of universal health care systems. There are \"government run\" single payers like in U.K. Canada or Taiwan., there are regulated competing insurance companies like in Switzerland. In France and Germany the system is not completely government run either. And there are several non-profit cooperatives like in Israel. I do not have any opinion which one is better. They all seem to perform roughly on par. The only one that sticks out like sore thumb is the American system. It is twice as expensive, it does not insure everybody and it barely provides the same quality of service.\n\n \n The enboldened statement is false. The cost of care in the US is higher, but so is the quality of care. Maybe tyhe next time I drive by a local hospital I'll take a picture of all of the Canadian plates in the parking lot for you. emoticon_rolleyes", 
   {}, 
   395293, 
   null, 
   1269008940.0
  ], 
  [
   395316, 
   null, 
   "josephdphillips", 
   "If you remove the illegals between 20 to 30 million you cut the uninsured by half.\n\n \n That number is greatly exaggerated, and I live in an area with many illegals.\n \n You only free up emergency rooms by controlling the border, which is fine with me, but it doesn't solve the problem of the uninsured.\n \n \ncut whats left in half again if you remove those who choose not to particpate. Or do you think the US should insure these people?\n\n \n Of course. It should not be a choice.\n \n \nIf we just inforced our imigration laws and deported the illegals you are now at 91% more or less with out insurance.\n\n \n Nope. Even if that were true, a figure of 9 percent of the population which is uninsured is scandalous. \n \n \nI would like to see your source for the number of the insured dropping and not tied to illegals or those unemployed. So what do you think will happen if the US is bankrupted by the government miss managment of healthcare? You'll be in even worse shape.\n\n \n By definition, the government cannot go bankrupt. The question is whether or not citizenship means you don't have to decide between feeding your family and going to the doctor, between paying the rent and paying for medication.\n \n There is plenty of money in the United States economy to support single-payer health care, particularly if the government rations it, as every other nation does, and as the U.S. government should, as well.\n \n \nSource?\n\n \n I worked for a trust fund that administered the health benefits for union workers in southern California. Blue Cross reimburses all services less than Medicare does. For the most common expense, a simple office visit, it only pays $24.\n \n \nIf you lower healthcare costs by tort reform, establishing national standards of care, establish limits to pain a suffering pay outs, allow health insurance companies to sell their policies nation wide, and Federal and state tax incentives to bussiness who provide for health insurance for their employees.\n\n \n It doesn't solve the problem. Health costs will continue to skyrocket because there are no incentives to control costs.\n \n You're also saying the uninsured should pay higher taxes (tax \"incentives\" have to be made up somewhere) to make it easier to get their own insurance -- yet another reason to nationalize health care.\n \n \nYou would see costs fall and enrolment explode.\n\n \n Enrollment would not explode unless you force people to enroll.\n \n \nyou will still have those who are between 18 and 28. Whe see them selves as being 6'2 eyes of blue and bullit proof who won't get health care even though they can afford it.\n\n \n It's hard to convince a young person making $15 an hour why he should pay $200-$300 a month for health insurance, especially when that person is paying a very high rent for a crackerbox apartment, paying back school loans and possibly having to care for his/her own child (which drives the cost of that person's insurance to $400-$500 per month).\n \n \nIf you let the government in to healthcare it will destroy its self and eat us in the process.\n\n \n It's not doing that in Canada, the United Kingdom, or in Cuba. Why should it here?\n \n The U.S. system is untenable because insureds never have to pay out-of-pocket. When the cost of blood pressure medication goes from $5 per month to $150 per month, and you're told that you can't get medical insurance because you have high blood pressure, supporters of privately-run health care have nothing to say.\n \n \nI would like to see a source on this, since not only myself but also a friend of mine have had to change physicians in the past few years. I have had to do it 3 times in the past 15 years 1 moved to be nearer an ill family member, another moved out of state because of the cost of malpractice insurance and the third quit practicing for the same reason cost of malpractice insurance. We also lost a pediatrition to early retirment reason cited cost of malpractic insurance. One of my close friends had his neurologist retire early also said cost of malpractice insurance. Even Obamas second cousin who is a doctor says that this healthcare bill will destroy our healthcare system.\n\n \n I read the Los Angeles Times every day. There are numerous articles about doctors dropping out of the profession, particularly obstetricians, about doctors dropping out of PPOs because reimbursements are so low, about the new trend toward boutique practices -- doctors who form groups to serve high-income patients exclusively.\n \n Tort reform won't spare the current system from inexorable collapse. The problem is that health care is better than it should be. People are taking out much more than they're paying into it, which is forcing those who pay the claims to increase their premiums.\n \n Higher premiums drive more people out of the insurable population, which exacerbates the cash flow problem for the payers. It's a death spiral, one the Canadians anticipated decades ago.\n \n \nThe real kicker is The New England Journal of Medicine claims that if the Health care bill goes through we will lose 1/3rd of our health care professionals.\n\n \n Probably, because the proposed legislation is all wrong. It doesn't address the problem.\n \n \nmy company 3 years ago payed $2.4 million in premiums and the claims for that year added up to $377,000\n\n \n That does not include all the claims your insurance company's claims adjusters denied. Also, how large is your company and what is the average age of its employees?\n \n \nYou are the one that pays absouloutly nothing for healthcare while I pay over $7,000 annualy for mine.\n\n \n I pay nothing only because I don't see doctors. I can't afford to.\n \n You'll be paying for my health care, however, when I require emergency medicine.\n \n These are not issues in the United Kingdom, for example. If you're sick, for any reason, you go to the doctor. You don't even think about it. That's the way it should be.\n \n \nyou are abdicating for government run healthcare so you don't have to pay for it and I will be responsable to pay for mine and yours.\n\n \n No, I still have to pay for it, just like everyone else.\n \n Of course if you still want your own private doctor, at your expense, and pay extra for it, that's fine with me.\n \n \nAnd thats the type of healthcare you wish to force on all of us.\n\n \n Yep.\n \n \nOne where government decides what your life is worth by what is best for the collective.\n\n \n Yep.\n \n \nSo whos going to sit in judgment on your death panels?\n\n \n It doesn't matter. National health policy should be decided by the voters, not by the rich.\n \n I should have a say, indirectly at least, in whether or not the country should be spending a million dollars or more to keep a premature baby alive when it has little chance of survival.\n \n I should have a say, indirectly, in whether or not a million dollars or more should be spent keeping a terminal patient alive, as well.\n \n If it is important to keep costs DOWN, we should be talking about a national policy governing the payment of such expenses.\n \n Right now NO ONE is talking about how MUCH health care people truly deserve and who should be paying for it.\n \n \nover there when you have slaved your whole life for the collective with nothing to show for your sacrfice. They will with hold healthcare from you because you have out lived your usefullness and are discarded like and empty milk carton.\n\n \n They don't slave their whole lives for the collective. The collective doesn't ask that much from its citizens, and the citizens pay less per capita for medical care than we do, and probably always will. Why? Because they are open to compromise in the name of the commonweal.\n \n Why aren't you?\n \n \nYou may be willing to be a slave to the collective but I won't and 75% of the country agrees with me.\n\n \n For the time being. They'll be singing a different tune 10 years from now, when only a few can afford health insurance. \n \n \nThat can be changed with very easly with regulations.\n\n \n Actually, it can't. You can TRY to force health insurers to cover the uninsurable but they will get around it -- and you, of all people, would expect them to.\n \n You, for example, are paying something like $7k per year for family health insurance. Your health insurance company is now forced to take on an uninsurable -- assuming it loses in court -- at a cost of, say, $100k per year.\n \n Your premium wasn't actuarily calculated in anticipation of this new requirement, so all the premiums of healthy insureds, including you, jump, say $2k or $3k per year. How do you like them apples?\n \n Employers will find their premiums going up, which means they have to refrain from hiring, or refrain from offering insurance to new employees, or increase the waiting time for the new employees to get insurance -- or maybe they just outsource to a company in a nation where health care is never an issue.\n \n \nI trust them a hell of a lot more that government bureaucrats.\n\n \n Enjoy it while you still can. Private health care is out of control and imploding. It can't be rescued from itself. It's just a matter of time.", 
   {}, 
   395291, 
   null, 
   1269019800.0
  ], 
  [
   395317, 
   null, 
   "Steeeeve", 
   "There are several kinds of universal health care systems. There are \"government run\" single payers like in U.K. Canada or Taiwan., there are regulated competing insurance companies like in Switzerland. In France and Germany the system is not completely government run either. And there are several non-profit cooperatives like in Israel. I do not have any opinion which one is better. They all seem to perform roughly on par. The only one that sticks out like sore thumb is the American system. It is twice as expensive, it does not insure everybody and it barely provides the same quality of service.\nKeep in mind our current system is kind of a half government half free market half (yes, three halves) controlled market hybrid monster. Switzerland is the closest thing to health care reform I would mind and it is the closest to a free market over Taiwan, UK, and Canada. This is extremely more expensive than UK and Canada but not as expensive as the US. We can also see that Switzerland has more CT and MRIs per million than both the UK and Canada but not even close to the US. \n \n So like I've always said, this is nothing more than a \"get what you pay for\" kinda thing. The less you pay the less access you get. It is obvious economics. We will reduce costs by either 1)reducing the services we currently receive or 2)paying for these same services and going into debt to cover the cost. There is a problem with having employers pay health insurance companies as it puts a huge burden on companies that could otherwise use the capital for other things but aside from that, the person paying has never been the big problem in the US. \n \n You want reduce costs and more people with insurance, pay the price of less access to care. It really is that simple.\n \n Now lets go over option 2 from above. This has actually been done. In 1999 or so Texas did an experiment to look at social security vs investing the money yourself in low risk bonds and then seeing who would get the higher payout at the end of the day. Most republicans would swear it was the free market way while most democrats would swear it was the social security way. Turns out, it was both if you look at it from a face value perspective. Social security was a better deal for low-wage earners or middle-wage with a spouse that never worked. For the vast majority (middle to high wage) it was better for a free market system. But the key aspect here was not that social security is better for the poor but that you can manipulate social security to be better, worse, or the same as a free market system when you KNOW what the free market system is. Social security can simply just pay out more money and increase the taxes OR keep just keep an unfunded balance like they do now. \n \n The point of the above story is that health care will operate the same way. We can lower costs and go into debt with the same coverage just like social security does now. You have to stop looking at two feet in front of your face and see the big picture of how this health care reform will shape medicine. It won't be what you thought. The government has no way of knowing how to handle health care.", 
   {}, 
   395293, 
   null, 
   1269020160.0
  ], 
  [
   395389, 
   null, 
   "modulus", 
   "It is a bad and never cost effective idea. I'm ok having companies build the roads but having every road with a toll is basically a monopoly and will be treated as one because you aren't going to have competing roads with private companies. We won't see Interstate 95 competing with Interstate 97 build 50 feet to the left...what would they compete on? Better exits ramps?\n \n Somethings that just too annoying to let the free market work out...very rare...I just take the inefficiency for the convenience.\n\n \n Does not a similar argument apply to healthcare?", 
   {}, 
   395290, 
   null, 
   1269069360.0
  ], 
  [
   395419, 
   null, 
   "modulus", 
   "More like four weeks by your own admission earlier. And yes, one month makes difference and the survival rates probably show that to be somewhat true..although I'm sure the two aren't totally related. \n \n Changing the focus and then saying I am dancing around it is a fallacy and will not work. Longer wait times for a CAT scan and MRI probably do make a difference and the stats back this up. \n \n\n \n If I remember it correctly it was 2 weeks. You do not need CAT scan to detect breast cancer or colon cancer. The tests are usually done once a year at most. If it were true that 1 month makes makes a difference you would have scan everybody once a month.\n \n I strongly doubt that we have better early detection. The uninsured do not get any preventabel screening and the pre-existing conditions provide an incentive NOT to get diagnosed.\n \n As the article I quoted mentioned the 5 yr survival statistics are themselves suspect. Eveil tongues say that you need to look at mortality because people could have died for other reason in the 5 years. I found one statistics\n \n Death from cancer by country. Definition, graph and map.\n \n According to it the U.S. has higher cancer mortality than e.g. U.K. or France. I do not know what to make out of those contradictory statistics. It is not that people in France are dying more for other reasons. Maybe indeed the U.S. survival statistics cover only a selected segment.\n \n But I will give you the benefit of a doubt. We are better in some things, they are better in some things. We are better in cancer treatment, they have higher life expectancy, fewer preventable deaths, lower infant mortality. So let us say that the quality of care is rougly the same. Now you have to explain why we are paying twice as much for it.", 
   {}, 
   394962, 
   null, 
   1269112020.0
  ], 
  [
   395513, 
   null, 
   "JPSartre12", 
   "Does not a similar argument apply to healthcare?\n\n \n Do you think the fast food consumer's interests would be better served if Uncle Sam said that all fast food chains except McDonalds were going to be changed?\n Since when does a monopoly generate competition and reductions in cost?emoticon_confused", 
   {}, 
   395389, 
   null, 
   1269213120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Uncle Sam's Track Recond Running Businesses", 
  "url": "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses.html", 
  "breadcrumbs": [
   "Health"
  ], 
  "id_number": 13983, 
  "discussion_files": [
   [
    "25479.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-print.html"
   ], 
   [
    "25480.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-6-print.html"
   ], 
   [
    "25481.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-4-print.html"
   ], 
   [
    "25482.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-5-print.html"
   ], 
   [
    "25483.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-3-print.html"
   ], 
   [
    "25484.html", 
    "http://www.4forums.com/political/health-debates/13983-uncle-sams-track-recond-running-businesses-2-print.html"
   ]
  ], 
  "identifier": 13983
 }
]