[
 [
  [
   392923, 
   null, 
   "Sandycane", 
   "I posted this here because the question is a scientific one and not a social one...not interested in who thinks same-sex marriages is socially acceptable on moral grounds.\n \n I'm interested in knowing why you think there are homosexuals in nature and what effect they will have on the overall human population.\n \n What is the scientific reason why nature would create beings who are incapable of reproducing with each other?\n \n Is there a scientific reason for people being attracted to the same sex?\n \n If it is caused by a genetic mutation, these genes cannot be passed on if there is no reproduction -unless these genes are mated with a heterosexual.\n \n Is it possible, that over time, there could be only homosexuals left, who can't reproduce, and in time the human race will become extinct?", 
   {
    "post_info": {
     "post_title": "Same Sex Extinction?"
    }
   }, 
   null, 
   null, 
   1267468560.0
  ], 
  [
   392973, 
   null, 
   "Jo Bennett", 
   "Some anthropologists have suggested that grown men with ties only to each other and to their tribe may have been useful for defence.\n \n As for a genetic cause of homosexuality leading to its elimination I don't see that happening. Current theories of male homosexuality indicate that a genetic cause is likely to be carried in the female line (i.e. on one X chromosome) but only exhibit in men. As In understand it, colour blindness is similar.", 
   {}, 
   392923, 
   null, 
   1267479480.0
  ], 
  [
   392974, 
   null, 
   "gansao", 
   "I posted this here because the question is a scientific one and not a social one...not interested in who thinks same-sex marriages is socially acceptable on moral grounds.\n \n I'm interested in knowing why you think there are homosexuals in nature and what effect they will have on the overall human population.\n \n What is the scientific reason why nature would create beings who are incapable of reproducing with each other?\n \n Is there a scientific reason for people being attracted to the same sex?\n \n If it is caused by a genetic mutation, these genes cannot be passed on if there is no reproduction -unless these genes are mated with a heterosexual.\n \n Is it possible, that over time, there could be only homosexuals left, who can't reproduce, and in time the human race will become extinct?\n\n \n As long as there are turkey basters humans will procreate", 
   {}, 
   392923, 
   null, 
   1267479600.0
  ], 
  [
   392979, 
   null, 
   "Sandycane", 
   "Some anthropologists have suggested that grown men with ties only to each other and to their tribe may have been useful for defence.\n\n I've read this somewhere before... but, didn't they go to the women of another tribe to procreate? Being in a tribe of only men doesn't necessarily mean they were sexually attracted to men. \n \n \nAs for a genetic cause of homosexuality leading to its elimination I don't see that happening. Current theories of male homosexuality indicate that a genetic cause is likely to be carried in the female line (i.e. on one X chromosome) but only exhibit in men. As In understand it, colour blindness is similar.\n\n \n Interesting. So, why would a woman have a gene that encourages homosexuality? If evolutionary gene mutation is supposed to be beneficial for the species survival... or, is this gene mutation caused by DNA damage from man-made sources?\n \n Hmmm. So, if a homosexual couple wanted to have a child and wanted to increase the homosexual population, they would be more successful if their surrogate/donor was the mother of a homosexual or, a homosexual of the opposite sex?\n This could definitely be harmful to the survival of the species, couldn't it? (I'm talking about hundreds of generations into the future)", 
   {}, 
   392973, 
   null, 
   1267481280.0
  ], 
  [
   392980, 
   null, 
   "Sandycane", 
   "As long as there are turkey basters humans will procreate\n\n \n emoticon_xclown\n \n This is strange:\n BBC News | HEALTH | Eggs fertilised without sperm\n and\n Two females can't fertilize a human egg right\n \n and this, on Parthenogenesis:\n Parthenogenesis: Nature, Embryology and A Female-Only Future\n \n Ha! Could it be that the evolution of humankind is to be only female? :p", 
   {}, 
   392974, 
   null, 
   1267482120.0
  ], 
  [
   392982, 
   null, 
   "Sandycane", 
   "The evolution of sex - Google Books\n This might answer some of the questions but, can someone explain it in English to me? :p", 
   {}, 
   392980, 
   null, 
   1267483680.0
  ], 
  [
   392995, 
   null, 
   "JPSartre12", 
   "I posted this here because the question is a scientific one and not a social one...not interested in who thinks same-sex marriages is socially acceptable on moral grounds.\n \n I'm interested in knowing why you think there are homosexuals in nature and what effect they will have on the overall human population.\n \n What is the scientific reason why nature would create beings who are incapable of reproducing with each other?\n \n Is there a scientific reason for people being attracted to the same sex?\n \n If it is caused by a genetic mutation, these genes cannot be passed on if there is no reproduction -unless these genes are mated with a heterosexual.\n \n Is it possible, that over time, there could be only homosexuals left, who can't reproduce, and in time the human race will become extinct?\n\n \n Not as long as there are bars and happy hours. emoticon_xhoho", 
   {}, 
   392923, 
   null, 
   1267485420.0
  ], 
  [
   407994, 
   null, 
   "Bennedict", 
   "\n If it is caused by a genetic mutation, these genes cannot be passed on if there is no reproduction -unless these genes are mated with a heterosexual.\n\n \n oh yes they can. some people make the assumption that redheads will become extinct. thats false, the gene for red hair is recessive so as long as there is random mating amongst people who have the red hair gene, dominant or recessive, the gene is still there and can appear in a later generation if it has not in it's parents. thats why some kids may have a different eye color from their parents - more like that of their grandpa, lets say. the same thing would happen for homosexuality if it were genetic - a hetereosexual couple could have a homosexual child, and the same 'gay gene' would be found in both the father's brother and the child. but i personally dont think homosexuality is genetic.\n \n \nIs it possible, that over time, there could be only homosexuals left, who can't reproduce, and in time the human race will become extinct?\n\n \n i dont think so, if it really came down to it, where... i suppose all straight people died for some reason and the human race were threatened, they would probably resort to artificial insemination. the whole situation of 'i wouldnt have sex with you if you were the last man alive' comes to mind and is pretty funny in my brain tank.", 
   {}, 
   392923, 
   null, 
   1279764300.0
  ], 
  [
   408133, 
   null, 
   "flaja", 
   "Some anthropologists have suggested that grown men with ties only to each other and to their tribe may have been useful for defence.\n\n \n How many situations like this have been documented throughout history? I can think of only 1 at the most: Sparta, which was always a militaristic society before the advent of Alexander the Great. However, Sodomy was found in all upper-crust Greek cities- not just Sparta. So the military connection is slim at best.", 
   {}, 
   392973, 
   null, 
   1279852380.0
  ], 
  [
   408134, 
   null, 
   "flaja", 
   "Even with the sequencing of the human genome I have yet to hear about the discovery of any gene that controls complex behavior like sex. If there is a genetic basis for sex, it would likely involve multiple genes acting together.\n \n But if sexual orientation were to be controlled by a single gene or by a collection of genes that act as if they were a single gene because they are inherited as a group because they are on the same chromosome (and assuming that no chromosomal rearrangement takes place during meiosis), genes for sexual orientation would follow Mendel's laws and the Hardy-Weinberg law, and the predicted outcome of these laws is not supported by real world data from the human population.\n \n In Mendelian genetics genes are either dominant, recessive or co-dominant in their phenotype, although genes for single traits (eye color or blood type for example) can have multiple forms with each distinct form being dominant, recessive or co-dominant to the other forms. But genes for any given trait exist in two distinct forms as far as their genotype goes.\n \n So genes can be represented by letters with capital letters being used for dominant genes and lowercase letters used for recessive genes.\n \n Since offspring get one copy of each gene from each of their parents you can have 3 different genotypes. AA means a dominant form of the gene represented by the letter a came from each parent. aa means that each parent gave a recessive form of the gene and Aa or aA means one parent gave a dominant gene and the other gave a recessive one.\n \n Assuming that heterosexuality is the dominant trait and homosexuality is the recessive trait, two AA parents can have only AA offspring and 100% of such offspring have a dominant phenotype and would be heterosexual. Two AA parents, i.e., two totally heterosexual parents can only have children that display heterosexual behavior.\n \n Two aa parents can have only aa offspring and 100% of their offspring have the recessive genotype so the mating of two Sodomites can produce only Sodomite children- but this is impossible in nature since humans reproduce only sexually.\n \n An AA parent mating with an aa parent gives only Aa offspring and 100% of the offspring have a dominant phenotype while also being a carrier for the recessive gene.\n \n Mating an Aa parent with another Aa parent can give AA offspring 1/4 of the time; Aa offspring 1/2 of the time and aa offspring 1/4 of the time. This would mean that at least 25% of the human population should be homosexual.\n \n So homosexual offspring can only come through the mating of two parents that have the recessive homosexual gene. Either an aa must mate with an Aa and each mating event has a 1/2 chance of producing a homosexual offspring; or two Aa parents must mate and each mating event has only a 1/4 chance of producing a homosexual offspring. So in a population of randomly-mating humans with an equal frequency of A and a genes the number of homosexuals should be somewhere between 25% and 50%. \n \n Mendel's laws can only predict the probable offspring for individual mating events. In order to explain the frequency of homosexuals in the entire human population you must use the Hardy-Weinberg law. And fortunately for politics (and unfortunately for Sodomites with a political agenda) Hardy-Weinberg uses mathematics to describe what a population's collective genetics mean.\n \n For a single gene with a dominant and recessive form the frequency with which the dominant form, A, is found in a population is designated as p, and q is used to represent the frequency of the recessive form, a. The combined frequencies, p + q, always equals 1, i.e., 100% of a stable randomly mating population will have either an A or an a gene.\n \n So, the frequency of the AA genotype is p-squared, and the frequency of the aa genotype is q-squared. And the frequency of the Aa genotype is 2pq.\n \n Given the number of heterosexuals in the human population (the total number of AA and Aa individuals) and the biggest estimate I have ever seen claimed for the number of homosexuals in the human population (the 10% claimed by politically-active Sodomites) the frequencies predicted by Mendel and Hardy-Weinberg don't match the number that has supposedly been observed in the real world- meaning that there is no genetic basis for homosexuality.", 
   {
    "unicode_changes_made": true
   }, 
   408133, 
   null, 
   1279853400.0
  ], 
  [
   408144, 
   null, 
   "gansao", 
   "Surely its a question of fertilty rather than sexuality.\n It seems that many homosexuals want to be parents so even if all men were gay and all women were lesbians if there were enough people that were fertile they could all happily reproduce and nurture.emoticon_idea\n Thats why we humans rule the world, we can work smart;)", 
   {}, 
   408134, 
   null, 
   1279884240.0
  ], 
  [
   408149, 
   null, 
   "flaja", 
   "Surely its a question of fertilty rather than sexuality.\n It seems that many homosexuals want to be parents so even if all men were gay and all women were lesbians if there were enough people that were fertile they could all happily reproduce and nurture.emoticon_idea\n Thats why we humans rule the world, we can work smart;)\n\n \n They wouldn't be able to mate in nature. There would be no sexual attraction between the sexes, so your scenario doesn't pan out unless you can document the existence of some gene that makes humans long for test tubes and Petri dishes.", 
   {
    "unicode_changes_made": true
   }, 
   408144, 
   null, 
   1279891560.0
  ], 
  [
   408150, 
   null, 
   "gansao", 
   "They wouldn't be able to mate in nature. There would be no sexual attraction between the sexes, so your scenario doesn't pan out unless you can document the existence of some gene that makes humans long for test tubes and Petri dishes.\n\n \n They wouldnt need to mate in nature.\n All they would need to do is collect the male sperm and inseminate the women.", 
   {
    "unicode_changes_made": true
   }, 
   408149, 
   null, 
   1279894380.0
  ], 
  [
   408151, 
   null, 
   "Bennedict", 
   "gansao is right. humans wouldnt lust for artificial insemination, they would need to do it to keep humanity alive. theres no doubt in my mind that there are gay people who are educated in assisted reproductive technology.\n \n maybe the original question is asking if humanity reverts back to early ancestory times, no knowledge of how test tubes work or limited communication skills, would humanity survive by just random mating amongst homosexuals?", 
   {}, 
   408150, 
   null, 
   1279895280.0
  ], 
  [
   408152, 
   null, 
   "gansao", 
   "gansao is right. humans wouldnt lust for artificial insemination, they would need to do it to keep humanity alive. theres no doubt in my mind that there are gay people who are educated in assisted reproductive technology.\n \n maybe the original question is asking if humanity reverts back to early ancestory times, no knowledge of how test tubes work or limited communication skills, would humanity survive by just random mating amongst homosexuals?\n\n \n In that case there really would have to no heterosexual men left on the Earth with access to women.\n In an uncivilised world the heterosexual men would rape and possibly enslave the lesbian women and that would lead to some of them becoming pregnant.", 
   {}, 
   408151, 
   null, 
   1279897260.0
  ], 
  [
   408155, 
   null, 
   "Penfold", 
   "If, as is claimed, homosexuality doesn't have a genetic cause, and they can't reproduce, then where are they all coming from?", 
   {}, 
   408152, 
   null, 
   1279908060.0
  ], 
  [
   408159, 
   null, 
   "flaja", 
   "They wouldnt need to mate in nature.\n\n \n Then natural selection wouldn't work, would it?", 
   {}, 
   408150, 
   null, 
   1279909920.0
  ], 
  [
   408161, 
   null, 
   "gansao", 
   "Then natural selection wouldn't work, would it?\n\n \n Natural selection would not be needed, would it?", 
   {}, 
   408159, 
   null, 
   1279910040.0
  ], 
  [
   408162, 
   null, 
   "flaja", 
   "gansao is right. humans wouldnt lust for artificial insemination, they would need to do it to keep humanity alive. theres no doubt in my mind that there are gay people who are educated in assisted reproductive technology.\n\n \n A very recent phenomenon. How would Sodomites produce offspring back before we had the technology for artificial insemination?", 
   {}, 
   408151, 
   null, 
   1279910040.0
  ], 
  [
   408164, 
   null, 
   "flaja", 
   "In that case there really would have to no heterosexual men left on the Earth with access to women.\n In an uncivilised world the heterosexual men would rape and possibly enslave the lesbian women and that would lead to some of them becoming pregnant.\n\n \n If lesbians do not have the natural desire to reproduce, they would not make decent mothers and society would collapse- just as it has done with feminists", 
   {}, 
   408152, 
   null, 
   1279910160.0
  ], 
  [
   408165, 
   null, 
   "gansao", 
   "A very recent phenomenon. How would Sodomites produce offspring back before we had the technology for artificial insemination?\n\n \n Those sodomites would have to grit their teeth and do what many sodomites have done in the past to hide their sodomite nature...have sex with a woman.", 
   {}, 
   408162, 
   null, 
   1279910220.0
  ], 
  [
   408166, 
   null, 
   "flaja", 
   "If, as is claimed, homosexuality doesn't have a genetic cause, and they can't reproduce, then where are they all coming from?\n\n \n Sin.\n \n Romans 1:24-27 Wherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves: Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen. For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature: And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.", 
   {}, 
   408155, 
   null, 
   1279910280.0
  ], 
  [
   408167, 
   null, 
   "flaja", 
   "Natural selection would not be needed, would it?\n\n \n Then what is Darwinism all about?", 
   {}, 
   408161, 
   null, 
   1279910340.0
  ], 
  [
   408168, 
   null, 
   "gansao", 
   "If lesbians do not have the natural desire to reproduce, they would not make decent mothers and society would collapse- just as it has done with feminists\n\n \n Women slaves have been raped by their owners and reared their offspring.\n Society didnt collapse.\n Society has not collapsed since the feminist movement began...\n \n Also many lesbians do have a natural desire to reproduce and have raised families.\n What book have you read that contained this drivel that you have posted?", 
   {}, 
   408164, 
   null, 
   1279910460.0
  ], 
  [
   408169, 
   null, 
   "flaja", 
   "Those sodomites would have to grit their teeth and do what many sodomites have done in the past to hide their sodomite nature...have sex with a woman.\n\n \n So which is it? Either Sodomy is perfectly natural and thus is an inevitable part of nature, or it is deviance that society has a right to stamp out.", 
   {}, 
   408165, 
   null, 
   1279910520.0
  ], 
  [
   408170, 
   null, 
   "gansao", 
   "Then what is Darwinism all about?\n\n \n Modern human society is not subject to darwinism... in the short term at least", 
   {}, 
   408167, 
   null, 
   1279910580.0
  ], 
  [
   408171, 
   null, 
   "gansao", 
   "So which is it? Either Sodomy is perfectly natural and thus is an inevitable part of nature, or it is deviance that society has a right to stamp out.\n\n \n Neither..try another choice", 
   {}, 
   408169, 
   null, 
   1279910700.0
  ], 
  [
   408172, 
   null, 
   "Sandycane", 
   "Sin.\n \n Romans 1:24-27 Wherefore God also gave them up to uncleanness through the lusts of their own hearts, to dishonour their own bodies between themselves: Who changed the truth of God into a lie, and worshipped and served the creature more than the Creator, who is blessed for ever. Amen. For this cause God gave them up unto vile affections: for even their women did change the natural use into that which is against nature: And likewise also the men, leaving the natural use of the woman, burned in their lust one toward another; men with men working that which is unseemly, and receiving in themselves that recompence of their error which was meet.\n\n \n You had me fooled with all the genetic info but, then you lost your credibility with this reply...and others...\n \nIf lesbians do not have the natural desire to reproduce, they would not make decent mothers and society would collapse- just as it has done with feminists \n\n \nSo which is it? Either Sodomy is perfectly natural and thus is an inevitable part of nature, or it is deviance that society has a right to stamp out.\n\n \n Shame on you. emoticon_emb", 
   {}, 
   408166, 
   null, 
   1279912920.0
  ], 
  [
   408177, 
   null, 
   "Bennedict", 
   "feminists do not make good mothers?\n \n this is......absurdly wrong.", 
   {}, 
   408172, 
   null, 
   1279917420.0
  ], 
  [
   408185, 
   null, 
   "flaja", 
   "[QUOTE=gansao;408168]Women slaves have been raped by their owners and reared their offspring.\n Society didnt collapse.\n Society has not collapsed since the feminist movement began...[QUOTE]\n \n By whose standards?", 
   {}, 
   408168, 
   null, 
   1279920600.0
  ], 
  [
   408186, 
   null, 
   "flaja", 
   "Modern human society is not subject to darwinism... in the short term at least\n\n \n How so? If humans are nothing more than animals and are thus a product of nature, then they are subject to the laws of nature- which according to theory of evolution include Darwin's natural selection. Any trait that impairs the bearer's ability to produce viable offspring is eventually eliminated by natural selection.", 
   {
    "unicode_changes_made": true
   }, 
   408170, 
   null, 
   1279920780.0
  ], 
  [
   408188, 
   null, 
   "flaja", 
   "Neither..try another choice\n\n \n What other choice is there?", 
   {}, 
   408171, 
   null, 
   1279920900.0
  ], 
  [
   408189, 
   null, 
   "flaja", 
   "You had me fooled with all the genetic info but, then you lost your credibility with this reply...and others...\n \n \n \n Shame on you. emoticon_emb\n\n \n Your point? The genetic information is based on my bachelor's degree in biology. The passage from the Book of Romans is based on my faith in God and the fact that humans are not animals, are not the products of nature and thus are subject to the laws of God, their creator.", 
   {}, 
   408172, 
   null, 
   1279921080.0
  ], 
  [
   408190, 
   null, 
   "gansao", 
   "How so? If humans are nothing more than animals and are thus a product of nature, then they are subject to the laws of nature- which according to theory of evolution include Darwin's natural selection. Any trait that impairs the bearer's ability to produce viable offspring is eventually eliminated by natural selection.\n\n \n Offspring would be not be viable 'in the wild' are produced by humans everyday. These offspring produce their own offspring.\n Natural selection is routinely overcome by technology/medicine", 
   {
    "unicode_changes_made": true
   }, 
   408186, 
   null, 
   1279921140.0
  ], 
  [
   408191, 
   null, 
   "flaja", 
   "feminists do not make good mothers?\n \n this is......absurdly wrong.\n\n \n Define good mother. Feminists do not make good mothers for the simple fact that they will put their career or anything else ahead of the best interests of their children. Just look as Sarah Palin.", 
   {}, 
   408177, 
   null, 
   1279921200.0
  ], 
  [
   408194, 
   null, 
   "gansao", 
   "Define good mother. Feminists do not make good mothers for the simple fact that they will put their career or anything else ahead of the best interests of their children. Just look as Sarah Palin.\n\n \n The best interests of children are subject to opinion.", 
   {}, 
   408191, 
   null, 
   1279921320.0
  ], 
  [
   408195, 
   null, 
   "flaja", 
   "Offspring would be not be viable 'in the wild' are produced by humans everyday. These offspring produce their own offspring.\n Natural selection is routinely overcome by technology/medicine\n\n \n Define \"the wild\". If humans are part of nature then any technology they devise would also have to be part of nature. But humans can devise technology precisely because they are not part of nature. They were created apart from nature. But that does not give them the right to use technology to compensate for their moral depravity.", 
   {}, 
   408190, 
   null, 
   1279921440.0
  ], 
  [
   408197, 
   null, 
   "gansao", 
   "Define \"the wild\". If humans are part of nature then any technology they devise would also have to be part of nature. But humans can devise technology precisely because they are not part of nature. They were created apart from nature. But that does not give them the right to use technology to compensate for their moral depravity.\n\n \n Without the life support system that is technology.\n \n \n Do you think that the use of vibrators is morally depraved?", 
   {}, 
   408195, 
   null, 
   1279921620.0
  ], 
  [
   408198, 
   null, 
   "gansao", 
   "[QUOTE=flaja;408185][QUOTE=gansao;408168]Women slaves have been raped by their owners and reared their offspring.\n Society didnt collapse.\n Society has not collapsed since the feminist movement began...\n\n \n By whose standards?\n\n \n By the definition of collapsed.\n Once again you are passing off opinion as fact.", 
   {}, 
   408185, 
   null, 
   1279921800.0
  ], 
  [
   408200, 
   null, 
   "gansao", 
   "What other choice is there?\n\n \n That sodomy is not a natural act but neither is it an abomination.\n Rather like oral sex but messier.", 
   {}, 
   408188, 
   null, 
   1279921980.0
  ], 
  [
   408213, 
   null, 
   "flaja", 
   "Without the life support system that is technology.\n\n \n You mean like the sticks and stones that man relied on to get food before he learned how to farm?\n \n The Darwinian biological definition of man is \"a tool-making animal\". What is any kind of tool if not technology? If man is legitimately part of nature, then man's technology is also part of nature. So if Sodomites cannot reproduce without the technology that has only been around for the past 30 years or so, Sodomy cannot be natural because it flies in the face of the laws of nature.\n \n \nDo you think that the use of vibrators is morally depraved?\n\n \n If you know what you are doing and thus know know how sex works, why would you need a vibrator?", 
   {
    "unicode_changes_made": true
   }, 
   408197, 
   null, 
   1279928340.0
  ], 
  [
   408214, 
   null, 
   "flaja", 
   "[QUOTE=gansao;408198][QUOTE=flaja;408185]\nWomen slaves have been raped by their owners and reared their offspring.\n Society didnt collapse.\n Society has not collapsed since the feminist movement began...\n \n By the definition of collapsed.\n Once again you are passing off opinion as fact.\n\n \n What in Hell definition do you use? If society hasn't collapsed since the womens' libbers took hold, explain this nation's drug problem, high school dropout rate, illegitimacy rate, crime rate etcetera, etcetera?", 
   {
    "unicode_changes_made": true
   }, 
   408198, 
   null, 
   1279928520.0
  ], 
  [
   408215, 
   null, 
   "gansao", 
   "You mean like the sticks and stones that man relied on to get food before he learned how to farm?\n \n The Darwinian biological definition of man is \"a tool-making animal\". What is any kind of tool if not technology? If man is legitimately part of nature, then man's technology is also part of nature. So if Sodomites cannot reproduce without the technology that has only been around for the past 30 years or so, Sodomy cannot be natural because it flies in the face of the laws of nature.\n .\n \n If you know what you are doing and thus know know how sex works, why would you need a vibrator?\n\n \n \n The sticks and stones of the hunter gatherers bears no resemblance to the life support system technology of today.\n \n A woman may prefer to use a vibrator to masterbate.", 
   {
    "unicode_changes_made": true
   }, 
   408213, 
   null, 
   1279928820.0
  ], 
  [
   408216, 
   null, 
   "gansao", 
   "[QUOTE=flaja;408214][QUOTE=gansao;408198]\n\n \n What in Hell definition do you use? If society hasn't collapsed since the womens' libbers took hold, explain this nation's drug problem, high school dropout rate, illegitimacy rate, crime rate etcetera, etcetera?\n\n \n Society is still functioning, it has not collapsed, it has changed.\n Do you think Womens libbers are responsible for the problems that you describe?\n I think Colonel Parker is far more culpable than Andrea Dworkin", 
   {
    "unicode_changes_made": true
   }, 
   408214, 
   null, 
   1279929180.0
  ], 
  [
   408219, 
   null, 
   "sinjin", 
   "Smells like misogyny in here.", 
   {}, 
   408216, 
   null, 
   1279930740.0
  ], 
  [
   408223, 
   null, 
   "gansao", 
   "Smells like misogyny in here.\n\n \n Reeks of it;)", 
   {}, 
   408219, 
   null, 
   1279931520.0
  ], 
  [
   408228, 
   null, 
   "Bennedict", 
   "Define good mother. Feminists do not make good mothers for the simple fact that they will put their career or anything else ahead of the best interests of their children. Just look as Sarah Palin.\n\n \n you bring up sarah palin of all people to describe this.\n \n my girlfriend's step mom (her and my girlfriend's dad have 2 kids together) is a feminist and has been for some time, and together, theyve raised their kids very well.\n \n you cant just make a claim like that, bring up sarah palin and consider that evidence for feminists making bad mothers.", 
   {}, 
   408191, 
   null, 
   1279932600.0
  ], 
  [
   408231, 
   null, 
   "flaja", 
   "The sticks and stones of the hunter gatherers bears no resemblance to the life support system technology of today.\n\n \n I didn't say they did. I was only pointing out that they are still technology and they were essential life support technology for their day and time (the alternative was starvation)- which you said could not part of nature.", 
   {
    "unicode_changes_made": true
   }, 
   408215, 
   null, 
   1279932900.0
  ], 
  [
   408232, 
   null, 
   "flaja", 
   "Looks like we've got a live one hereemoticon_xbouncer\n\n \n Your hostility is not called for.", 
   {}, 
   408189, 
   null, 
   1279933020.0
  ], 
  [
   408233, 
   null, 
   "gansao", 
   "I didn't say they did. I was only pointing out that they are still technology and they were essential life support technology for their day and time (the alternative was starvation)- which you said could not part of nature.\n\n \n The last eight words made no sense.", 
   {
    "unicode_changes_made": true
   }, 
   408231, 
   null, 
   1279933380.0
  ], 
  [
   408234, 
   null, 
   "flaja", 
   "you bring up sarah palin of all people to describe this.\n\n \n Yes. Sarah Palin has abandoned her children for the sake of having a political career. The end result is that her 16 years daughter ended up pregnant before she is mature enough to establish and maintain a stable relationship with her child's father.", 
   {
    "unicode_changes_made": true
   }, 
   408228, 
   null, 
   1279933380.0
  ], 
  [
   408235, 
   null, 
   "gansao", 
   "Your hostility is not called for.\n\n \n Hostility? How so?", 
   {}, 
   408232, 
   null, 
   1279933440.0
  ], 
  [
   408236, 
   null, 
   "Bennedict", 
   "Yes. Sarah Palin has abandoned her children for the sake of having a political career. The end result is that her 16 years daughter ended up pregnant before she is mature enough to establish and maintain a stable relationship with her child's father.\n\n \n exactly. and you use this example to display how feminists are bad mothers. sarah effing palin...of all people...you pick the worst mother...\n \n is she even a feminist? she seems far too stupid.\n \n edit:\n just because a woman is serious about her career doesnt mean shes a feminist.", 
   {
    "unicode_changes_made": true
   }, 
   408234, 
   null, 
   1279933620.0
  ], 
  [
   408240, 
   null, 
   "gansao", 
   "I am beginning to think that flaja's definition of a feminist is a woman who is ambitious which, as Bennedict points out , is wrong.\n \n As for Sarah Palin, I cannot believe that there are no cases of 16 year old girls getting pregnant who have doting mothers.", 
   {}, 
   408236, 
   null, 
   1279935120.0
  ], 
  [
   408243, 
   null, 
   "flaja", 
   "exactly. and you use this example to display how feminists are bad mothers. sarah effing palin...of all people...you pick the worst mother...\n \n is she even a feminist? she seems far too stupid.\n \n edit:\n just because a woman is serious about her career doesnt mean shes a feminist.\n\n \n She's following the feminist MO.", 
   {}, 
   408236, 
   null, 
   1279938060.0
  ], 
  [
   408245, 
   null, 
   "Bennedict", 
   "She's following the feminist MO.\n\n \n i dont think she is. first of all, shes against abortion which feminists strongly support.", 
   {}, 
   408243, 
   null, 
   1279938960.0
  ], 
  [
   408246, 
   null, 
   "Symbiote", 
   "Watch out, here comes the irrelevant historical anecdote and then a demand to see your qualifications.", 
   {}, 
   408245, 
   null, 
   1279939320.0
  ], 
  [
   408251, 
   null, 
   "Bennedict", 
   "Watch out, here comes the irrelevant historical anecdote and then a demand to see your qualifications.\n\n \n funny thing is, im actually a qualified pro-feminism debater.", 
   {}, 
   408246, 
   null, 
   1279939980.0
  ], 
  [
   408257, 
   null, 
   "flaja", 
   "i dont think she is. first of all, shes against abortion which feminists strongly support.\n\n \n Not all feminists are pro-abortion.\n \n Palin sees rise of anti-abortion feminists\n \n \"Sarah Palin predicted Friday that a new wave of anti-abortion feminists will win Senate seats in the November elections.\"", 
   {}, 
   408245, 
   null, 
   1279945680.0
  ], 
  [
   408263, 
   null, 
   "Sandycane", 
   "Your point? The genetic information is based on my bachelor's degree in biology. The passage from the Book of Romans is based on my faith in God and the fact that humans are not animals, are not the products of nature and thus are subject to the laws of God, their creator.\n\n \n The point was, scientific information can be verified to be true or not while your bible-quoting is not scientific at all.\n As I stated at the OP, 'I posted this here because the question is a scientific one and not a social one...not interested in who thinks same-sex marriages is socially acceptable on moral grounds.'\n \n Now, if this thread evolves into one including the social implications or causes of homosexuality, so be it. But, your bigoted opinions and bible verses will not be counted as being valid by me...or, I think it safe to say, others here.\n \n An ancient book of the most despicable cast of characters ever printed is evidence only of the perverted minds that constructed it.", 
   {}, 
   408189, 
   null, 
   1279948020.0
  ], 
  [
   408264, 
   null, 
   "Sandycane", 
   "[QUOTE=flaja;408214][QUOTE=gansao;408198]\n\n \n What in Hell definition do you use? If society hasn't collapsed since the womens' libbers took hold, explain this nation's drug problem, high school dropout rate, illegitimacy rate, crime rate etcetera, etcetera?\n\n \n Well, let's see...isn't the majority of the population of the US of the Christian persuasion? Think there might be a connection? emoticon_xagree", 
   {
    "unicode_changes_made": true
   }, 
   408214, 
   null, 
   1279948440.0
  ], 
  [
   408265, 
   null, 
   "Sandycane", 
   "Define good mother. Feminists do not make good mothers for the simple fact that they will put their career or anything else ahead of the best interests of their children. Just look as Sarah Palin.\n\n \n I'd rather not look at Sara Palin but, since you brought it up...\n She is most definitely not a feminist.\n Didn't I read in the news that she dragged her kids all over the country with her during the campaign? And wasn't that a baby strapped to her hip in those videos I saw?\n \n You obviously do not know what a feminist is and you obviously hate women who are not subservient.\n And, being 'pro-abortion' does not a feminist make. Feminists are pro-choice. That means they believe every woman has the right to use her free will to decide what is best.\n \n What do you call a man who puts his 'career or anything else ahead of the best interests of their children'? Hard-working? Ambitious? Successful? Bread-winner?", 
   {}, 
   408191, 
   null, 
   1279949220.0
  ], 
  [
   408266, 
   null, 
   "Sandycane", 
   "Define \"the wild\". If humans are part of nature then any technology they devise would also have to be part of nature. But humans can devise technology precisely because they are not part of nature. They were created apart from nature. But that does not give them the right to use technology to compensate for their moral depravity.\n\n \n And you have a degree in biology??? :p:p:p Did you get it from a Sears catalog?\n \n 'Moral depravity'? Speak for yourself, buddy...and your fellow bible-thumpers. You Christians are the ones born with a 'sinful nature'. Just because you chose to believe this doesn't mean you can project it on the rest of the population.", 
   {}, 
   408195, 
   null, 
   1279949580.0
  ], 
  [
   408283, 
   null, 
   "flaja", 
   "The point was, scientific information can be verified to be true or not while your bible-quoting is not scientific at all.\n\n \n When did I say it was?\n \n \nAs I stated at the OP, 'I posted this here because the question is a scientific one and not a social one...not interested in who thinks same-sex marriages is socially acceptable on moral grounds.'\n\n \n The laws of genetics indicate that there is no scientific basis for Sodomy. Therefore Sodomy is only a social issue.", 
   {}, 
   408263, 
   null, 
   1279981020.0
  ], 
  [
   408285, 
   null, 
   "flaja", 
   "[QUOTE=Sandycane;408264][QUOTE=flaja;408214]\n\n \n Well, let's see...isn't the majority of the population of the US of the Christian persuasion?\n\n \n No. Verifiable statistics regarding the religious beliefs/practices of Americans are pretty much impossible to obtain. But even if a majority of individual Americans self-identify themselves as Christian, they won't recognize each other as Christian because they hold particular beliefs that are mutually exclusive. Baptists don't believe that Roman Catholics are Christian and Roman Catholics don't believe that Baptists are Christian, for example. America has no majority that accepts the exact same set of \"Christian\" beliefs, so a majority of the U.S. population is not Christian.", 
   {}, 
   408264, 
   null, 
   1279981800.0
  ], 
  [
   408288, 
   null, 
   "flaja", 
   "I'd rather not look at Sara Palin but, since you brought it up...\n She is most definitely not a feminist.\n Didn't I read in the news that she dragged her kids all over the country with her during the campaign? And wasn't that a baby strapped to her hip in those videos I saw?\n\n \n She dragged her kids all over the country for the sake of her having a career and her children are being neglected in the process. She is the epitome of feminism.\n \n \nWhat do you call a man who puts his 'career or anything else ahead of the best interests of their children'? Hard-working? Ambitious? Successful? Bread-winner?\n\n \n The last time I checked men don't have functional breasts and thus are not naturally suited to be caregivers to young children. So naturally men are supposed to be breadwinners.", 
   {}, 
   408265, 
   null, 
   1279982160.0
  ], 
  [
   408290, 
   null, 
   "flaja", 
   "And you have a degree in biology??? :p:p:p Did you get it from a Sears catalog?\n \n 'Moral depravity'? Speak for yourself, buddy...and your fellow bible-thumpers. You Christians are the ones born with a 'sinful nature'. Just because you chose to believe this doesn't mean you can project it on the rest of the population.\n\n \n If you personally are not a sinner, why so much hostility? If you are not a sinner, what difference does what I say make?", 
   {}, 
   408266, 
   null, 
   1279982340.0
  ], 
  [
   408297, 
   null, 
   "Bennedict", 
   "actually flaja,\n \n i re-read your first post in this thread, and this is all stuff i learned in grade 11 biology. i am currently working on my BSc in biology and we're way beyond that.\n \n im not doubting that you have a BSc, but some post-BSc information would be great.", 
   {}, 
   408290, 
   null, 
   1279983960.0
  ], 
  [
   408303, 
   null, 
   "Sandycane", 
   "[QUOTE=flaja;408285][QUOTE=Sandycane;408264]\n\n \n No. Verifiable statistics regarding the religious beliefs/practices of Americans are pretty much impossible to obtain. But even if a majority of individual Americans self-identify themselves as Christian, they won't recognize each other as Christian because they hold particular beliefs that are mutually exclusive. Baptists don't believe that Roman Catholics are Christian and Roman Catholics don't believe that Baptists are Christian, for example. America has no majority that accepts the exact same set of \"Christian\" beliefs, so a majority of the U.S. population is not Christian.\n\n \n You quoted ganso in your reply but, I'm the one who said this \nWell, let's see...isn't the majority of the population of the US of the Christian persuasion?\n\n Impossible to obtain? That's a laugh. Let me assist you: percentage of christians in america - Google Search\n According to the CIA, about 76% are 'Christian' (Protestant, Catholic and Other combined):\n https://www.cia.gov/library/publications/the-world-factbook/geos/us.html", 
   {}, 
   408285, 
   null, 
   1279985700.0
  ], 
  [
   408308, 
   null, 
   "Sandycane", 
   "She dragged her kids all over the country for the sake of her having a career and her children are being neglected in the process. She is the epitome of feminism. \n emoticon_frazzled 'Neglected' would be if she left them home alone, not bringing them with her.\n \n \nThe last time I checked men don't have functional breasts and thus are not naturally suited to be caregivers to young children. So naturally men are supposed to be breadwinners.\n\n Oh. There's that Christian double standard, again. \n 'Functional breasts' are required for caring for the young? :p\n What about mothers who are 'naturally' unable to breast feed? Are they neglecting their children and bad mothers? Ridiculous! What about Grandmas and Grandpas? emoticon_wow\n \n No. What you are really saying is that it is the sole responsibility of women to 'nurture' young...while men are excused from being involved in the process for the sake of their jobs...the same exact option you accuse feminists of choosing yet deny them the right to do so.\n \n What you fail to see is that while women, historically, have had the responsibility to nurture children while men have not, in the present time, with equal rights for all (supposedly), mothers and fathers share the responsibility equally (in a well functioning family) - regardless of whether it is the mother or the father who works outside the home.\n \n What you are saying is that society has deteriorated because men are not able to properly nurture their children. \n It has nothing to do with women working.\n The majority of women have always had to work - except for the small % of wealthy elite, who had servants to work and raise their kids for them.\n \n The problem you and your fellow bible-thumpers have with working women now is that you feel threatened by our ability to achieve the same level of success that has been denied us in the past.\n \n Guess what? Women are just as capable of being the main bread winner of the family, while also handling the responsibility of nurturing their children.\n It's not our fault that men like you can't keep up and refuse to participate in the nurturing process.\n (I'm assuming you are a man)\n \n You are also saying that a single parent, a gay man or a pair of gay men aren't capable of raising children. What about two lesbians? According to your theory, a pair of lesbians trump a straight father and mother in nurturing ability. :)", 
   {}, 
   408288, 
   null, 
   1279987920.0
  ], 
  [
   408309, 
   null, 
   "Sandycane", 
   "If you personally are not a sinner, why so much hostility? If you are not a sinner, what difference does what I say make?\n\n \n Strange questions.\n Did you detect hostility in my replies? :)\n \n I was once compared to a mama grizzly bear when defending someone I deeply care about. It seems the same applies to me defending those I don't personally know but also care about...especially those who are falsely accused of being 'sinners'.\n \n What difference does what you say make? \n All the difference in the world.", 
   {}, 
   408290, 
   null, 
   1279988460.0
  ], 
  [
   408312, 
   null, 
   "Bennedict", 
   "Sarah Palin is NOT the epitome of feminism. if anything, currently the epitome of feminism is Jessica Valenti, who i personally dont like very much but she stands for a good cause and she has a lot of followers that are very good as well.\n \n first of all, Sarah Palin is a conservative, which the feminist movement is almost exclusively left-wing. not to say that all feminists are left-wingers, but most of them are. how can Sarah Palin be the poster girl for feminism if she doesnt even share the same political beliefs with 98% of the feminist movement?", 
   {}, 
   408309, 
   null, 
   1279989240.0
  ], 
  [
   408319, 
   null, 
   "flaja", 
   "actually flaja,\n \n i re-read your first post in this thread, and this is all stuff i learned in grade 11 biology. i am currently working on my BSc in biology and we're way beyond that.\n \n im not doubting that you have a BSc, but some post-BSc information would be great.\n\n \n Mendel's Laws and Hardy-Weinberg have been repealed? Tell me how these fundamental facts of biology don't govern Sodomite behavior if Sodomite behavior is determined by genetics.\n \n And, if you are still working on your own bachelor's degree, how would you recognize any post-bachelor's degree material?", 
   {
    "unicode_changes_made": true
   }, 
   408297, 
   null, 
   1279991100.0
  ], 
  [
   408320, 
   null, 
   "flaja", 
   "[QUOTE=Sandycane;408303][QUOTE=flaja;408285]\n\n \n You quoted ganso in your reply but, I'm the one who said this \n Impossible to obtain? That's a laugh. Let me assist you: percentage of christians in america - Google Search\n According to the CIA, about 76% are 'Christian' (Protestant, Catholic and Other combined):\n https://www.cia.gov/library/publications/the-world-factbook/geos/us.html\n\n \n And like I said, Protestants and Catholics are not both Christian because their beliefs are mutually exclusive. Just because someone says they are a Christian does not mean that they are really a Christian.", 
   {}, 
   408303, 
   null, 
   1279991220.0
  ], 
  [
   408321, 
   null, 
   "flaja", 
   "emoticon_frazzled 'Neglected' would be if she left them home alone, not bringing them with her.\n\n \n You've obviously have either been fortunate enough to have a decent mother (which I doubt)- or you have not yet realized how much your mother neglected you.", 
   {}, 
   408308, 
   null, 
   1279991340.0
  ], 
  [
   408322, 
   null, 
   "flaja", 
   "Strange questions.\n Did you detect hostility in my replies? :)\n\n \n \"'Moral depravity'? Speak for yourself, buddy...and your fellow bible-thumpers.\"", 
   {}, 
   408309, 
   null, 
   1279991460.0
  ], 
  [
   408323, 
   null, 
   "flaja", 
   "Sarah Palin is NOT the epitome of feminism. if anything, currently the epitome of feminism is Jessica Valenti, who i personally dont like very much but she stands for a good cause and she has a lot of followers that are very good as well.\n\n \n Who?\n \n \nfirst of all, Sarah Palin is a conservative, which the feminist movement is almost exclusively left-wing. \n\n \n Sarah Palin is not a conservative for the simple fact that she is not at home raising her children- choosing instead to have a \"career\". She is not upholding the traditional family structure (the only one known to actually work).", 
   {
    "unicode_changes_made": true
   }, 
   408312, 
   null, 
   1279991640.0
  ], 
  [
   408324, 
   null, 
   "Sandycane", 
   "[QUOTE=flaja;408320][QUOTE=Sandycane;408303]\n\n \n And like I said, Protestants and Catholics are not both Christian because their beliefs are mutually exclusive. Just because someone says they are a Christian does not mean that they are really a Christian.\n\n \n Just because someone says they are a Christian does not mean that they are really a Christian\n Ha! Ha! Ha! Now, there's an understatement - and I totally agree.\n \n Do Catholics, Protestants and 'Other Christians' not all believe in the same god and read the same bible?\n So the only real difference between them is their interpretation of the book.\n I've seen this before: 'If your interpretation is different than mine, then you are not a real Christian'. Bull pookey.\n You're all in the same boat as far as I'm concerned.", 
   {}, 
   408320, 
   null, 
   1279991700.0
  ], 
  [
   408326, 
   null, 
   "Sandycane", 
   "You've obviously have either been fortunate enough to have a decent mother (which I doubt)- or you have not yet realized how much your mother neglected you.\n\n \n You've just crossed the line. emoticon_xkill\n (Remember that grizzly I told you about?)", 
   {}, 
   408321, 
   null, 
   1279991940.0
  ], 
  [
   408328, 
   null, 
   "Sandycane", 
   "Who?\n \n \n \n Sarah Palin is not a conservative for the simple fact that she is not at home raising her children- choosing instead to have a \"career\". She is not upholding the traditional family structure (the only one known to actually work).\n\n \n 'traditional family structure'? Does that include the biblical, OT one?\n Yeah, that worked real well - Not.", 
   {
    "unicode_changes_made": true
   }, 
   408323, 
   null, 
   1279992180.0
  ], 
  [
   408332, 
   null, 
   "Sandycane", 
   "You've obviously have either been fortunate enough to have a decent mother (which I doubt)- or you have not yet realized how much your mother neglected you.\n\n \n Oh, and you've let the cat out of the bag.\n That's something a catty woman would say - you're not a man.", 
   {}, 
   408321, 
   null, 
   1279992960.0
  ], 
  [
   408360, 
   null, 
   "Jo Bennett", 
   "[QUOTE=flaja;408320][QUOTE=Sandycane;408303]\n\n \n And like I said, Protestants and Catholics are not both Christian because their beliefs are mutually exclusive. Just because someone says they are a Christian does not mean that they are really a Christian.\n\n \n That doesn't make sense. Just because some of them don't believe the others are Christians doesn't mean that they aren't Christians. Would you care to tell us what you mean by Christian?\n \n I would say that Christianity is defined by the ancient creeds which Christians agreed - the Apostles Creed, the Nicene Creed, and the Athanasian Creed. These outline beliefs common to members of the Orthodox, Roman Catholic, Anglican and almost all protestant churches.", 
   {}, 
   408320, 
   null, 
   1279999560.0
  ], 
  [
   408374, 
   null, 
   "Bennedict", 
   "when i say im an atheist, im not really an atheist.", 
   {}, 
   408360, 
   null, 
   1280005140.0
  ], 
  [
   408400, 
   null, 
   "flaja", 
   "[QUOTE=Sandycane;408324][QUOTE=flaja;408320]\n\n \n Just because someone says they are a Christian does not mean that they are really a Christian\n Ha! Ha! Ha! Now, there's an understatement - and I totally agree.\n \n Do Catholics, Protestants and 'Other Christians' not all believe in the same god and read the same bible?\n So the only real difference between them is their interpretation of the book.\n I've seen this before: 'If your interpretation is different than mine, then you are not a real Christian'. Bull pookey.\n You're all in the same boat as far as I'm concerned.\n\n \n Actually, no. I am hesitant to bother explaining this to someone who obviously is hostile to Christians, but self-proclaimed Christians don't all worship the same god or use the same Bible.\n \n The Roman Catholic Bible has books that are not included in the Protestant Bible. And then groups like the Mormons and Christian Scientists have their own holy books that they use in addition to the Bible.\n \n And among Protestants you have the issue of Bible translation. Some Baptists use only the King James of 1611 (and some of these Baptists don't consider themselves to be Protestant). Other Protestants use any number of other translations despite the fact that these translations are based on Bible manuscripts that don't agree with each other and don't agree with the manuscripts that the King James was translated from.\n \n Furthermore, Roman Catholics venerate saints and the Virgin Mary that gave birth to Christ. Protestants do not venerate anyone but God and (as far as I know) they don't accept the Catholic idea that Mary remained a virgin for her entire life. Protestants and Catholics are Trinitarians, but Mormons, Jehovah's Witnesses and Seventh Day Adventists are not.", 
   {
    "unicode_changes_made": true
   }, 
   408324, 
   null, 
   1280025780.0
  ], 
  [
   408401, 
   null, 
   "Bennedict", 
   "[QUOTE=flaja;408400][QUOTE=Sandycane;408324]\n\n \n Actually, no. I am hesitant to bother explaining this to someone who obviously is hostile to Christians, but self-proclaimed Christians don't all worship the same god or use the same Bible.\n \n The Roman Catholic Bible has books that are not included in the Protestant Bible. And then groups like the Mormons and Christian Scientists have their own holy books that they use in addition to the Bible.\n \n And among Protestants you have the issue of Bible translation. Some Baptists use only the King James of 1611 (and some of these Baptists don't consider themselves to be Protestant). Other Protestants use any number of other translations despite the fact that these translations are based on Bible manuscripts that don't agree with each other and don't agree with the manuscripts that the King James was translated from.\n \n Furthermore, Roman Catholics venerate saints and the Virgin Mary that gave birth to Christ. Protestants do not venerate anyone but God and (as far as I know) they don't accept the Catholic idea that Mary remained a virgin for her entire life. Protestants and Catholics are Trinitarians, but Mormons, Jehovah's Witnesses and Seventh Day Adventists are not.\n\n \n i fail to see the correlation between having different editions of the bible to being able to call one religion as opposed to another, Christian.", 
   {
    "unicode_changes_made": true
   }, 
   408400, 
   null, 
   1280026560.0
  ], 
  [
   408404, 
   null, 
   "flaja", 
   "'traditional family structure'? Does that include the biblical, OT one?\n Yeah, that worked real well - Not.\n\n \n What are you talking about? One man, one woman and their children is what God intended. However, humans doing then as they have done ever since, took it upon themselves to reject God's way and follow their own path. The turmoil that you see in the families of the OT reflect man's perversion of God's intent.", 
   {}, 
   408328, 
   null, 
   1280029680.0
  ], 
  [
   408406, 
   null, 
   "flaja", 
   "[QUOTE=Jo Bennett;408360][QUOTE=flaja;408320]\n\n \n That doesn't make sense. Just because some of them don't believe the others are Christians doesn't mean that they aren't Christians. \n\n \n That's not what I said. Protestants and Roman Catholics have beliefs that are mutually exclusive of each other. You cannot be a Protestant at the same time you are a Catholic and you cannot be a Catholic at the same time you are a Protestant- so they cannot both be Christian.\n \n \nWould you care to tell us what you mean by Christian?\n\n \n Would it do any good?\n \n \nI would say that Christianity is defined by the ancient creeds which Christians agreed - the Apostles Creed, the Nicene Creed, and the Athanasian Creed. These outline beliefs common to members of the Orthodox, Roman Catholic, Anglican and almost all protestant churches.\n\n \n What you don't understand is that things have been added to these creeds over time. And people like Mormons and Jehovah's Witnesses do not accept these creeds.", 
   {
    "unicode_changes_made": true
   }, 
   408360, 
   null, 
   1280030040.0
  ], 
  [
   408407, 
   null, 
   "flaja", 
   "[QUOTE=Bennedict;408401][QUOTE=flaja;408400]\n\n \n i fail to see the correlation between having different editions of the bible to being able to call one religion as opposed to another, Christian.\n\n \n The issue is not different editions, but rather different Bibles.", 
   {}, 
   408401, 
   null, 
   1280030100.0
  ], 
  [
   408408, 
   null, 
   "Sandycane", 
   "[QUOTE=Bennedict;408401][QUOTE=flaja;408400]\n\n \n i fail to see the correlation between having different editions of the bible to being able to call one religion as opposed to another, Christian.\n\n \n It's called a 'Superiority Complex'...or, just plain snooty. ;)", 
   {}, 
   408401, 
   null, 
   1280030100.0
  ], 
  [
   408409, 
   null, 
   "Sandycane", 
   "What are you talking about? One man, one woman and their children is what God intended. However, humans doing then as they have done ever since, took it upon themselves to reject God's way and follow their own path. The turmoil that you see in the families of the OT reflect man's perversion of God's intent.\n\n \n 'One man one woman\"??? Oh, please, what version of the bible do you read? :p", 
   {}, 
   408404, 
   null, 
   1280030220.0
  ], 
  [
   408411, 
   null, 
   "Sandycane", 
   "flaja, I don't know how or why you are doing it but, I wish you would stop quoting other members and assigning my name to the replies. It's confusing the flow of the thread.", 
   {}, 
   408409, 
   null, 
   1280030460.0
  ], 
  [
   408421, 
   null, 
   "flaja", 
   "'One man one woman\"??? Oh, please, what version of the bible do you read? :p\n\n \n The Gospel of Mark from the Authorized King James Bible\n \n 10:2-8 And the Pharisees came to him, and asked him, Is it lawful for a man to put away his wife? tempting him. And he answered and said unto them, What did Moses command you? And they said, Moses suffered to write a bill of divorcement, and to put her away. And Jesus answered and said unto them, For the hardness of your heart he wrote you this precept. But from the beginning of the creation God made them male and female. For this cause shall a man leave his father and mother, and cleave to his wife; And they twain shall be one flesh: so then they are no more twain, but one flesh.", 
   {}, 
   408409, 
   null, 
   1280035140.0
  ], 
  [
   408422, 
   null, 
   "flaja", 
   "flaja, I don't know how or why you are doing it but, I wish you would stop quoting other members and assigning my name to the replies. It's confusing the flow of the thread.\n\n \n You are incapable of paying attention to what you yourself have said?", 
   {}, 
   408411, 
   null, 
   1280035260.0
  ], 
  [
   408424, 
   null, 
   "Jo Bennett", 
   "[QUOTE=flaja;408406][QUOTE=Jo Bennett;408360]\n\n \n That's not what I said. Protestants and Roman Catholics have beliefs that are mutually exclusive of each other. You cannot be a Protestant at the same time you are a Catholic and you cannot be a Catholic at the same time you are a Protestant- so they cannot both be Christian.\n \n \n \n Would it do any good?\n \n \n \n What you don't understand is that things have been added to these creeds over time. And people like Mormons and Jehovah's Witnesses do not accept these creeds.\n\n \n The only thing added to the creeds is the filioque clause in the Nicene Creed as used in western churches, everything else is as it was when they were written. As for being both Catholic and Protestant, that's precisely what Anglicanism is - both Catholic and reformed is the phrasing used. To be a Christian is to be a follower of the way as described by Jesus Christ (the first Christians were called followers of the way). That doesn't mean you have to agree on everything that other followers do. There is, no doubt, a correct understanding of the nature of God, but having a slightly incorrect understanding (as we all do, given the complexity and mystery of God) does not prevent one following the way. You're correct that there are heterodox groups that reject what the Christian church has traditionally believed, as outlined in the creeds, but even in the US they make a up a tiny fraction of those who call themselves Christians (1.7% of the population is Mormon, for example).", 
   {
    "unicode_changes_made": true
   }, 
   408406, 
   null, 
   1280053680.0
  ], 
  [
   408439, 
   null, 
   "flaja", 
   "[QUOTE=Jo Bennett;408424][QUOTE=flaja;408406]\n\n \n The only thing added to the creeds is the filioque clause in the Nicene Creed as used in western churches, everything else is as it was when they were written.\n\n \n The Roman Catholics' purgatory is not found in any of these creeds. Neither is their veneration of the saints; the idolatry of their relics; infallibility of their Pope; the immaculate conception of their Virgin Mary; confessions to their priests or selling of their indulgences. Any one of these things negates a Roman Catholic's Christianity as far a Protestant is concerned.\n \n \nAs for being both Catholic and Protestant, that's precisely what Anglicanism is - both Catholic and reformed is the phrasing used.\n\n \n Which is why Puritanism came about. \n \n \nThat doesn't mean you have to agree on everything that other followers do. \n\n \n It does whenever doctrine is concerned. Change doctrine from what the Apostles taught and you end up following another way.", 
   {
    "unicode_changes_made": true
   }, 
   408424, 
   null, 
   1280068440.0
  ], 
  [
   408456, 
   null, 
   "Bennedict", 
   "You are incapable of paying attention to what you yourself have said?\n\n \n sandy is right though, look at post #88. I said that and you quoted sandycane.", 
   {}, 
   408422, 
   null, 
   1280072820.0
  ], 
  [
   408461, 
   null, 
   "Penfold", 
   "sandy is right though, look at post #88. I said that and you quoted sandycane.\n\n \n He is self-evidently incapable of paying attention to what others have said.", 
   {}, 
   408456, 
   null, 
   1280077380.0
  ], 
  [
   408465, 
   null, 
   "Sandycane", 
   "#88 & #87, which was poted by flaja, who quoted my name but the original was written by Jo. If you click on the arrow next to my name to go to the original reply, it takes you to one of mine (#69) that is not related. The original reply of Jo, quoted by flaja and assigned my name, is post #82.\n And, the post I was referring to in post #69 is #65 where flaja quoted me but assigned ganso's name to the quote.", 
   {}, 
   408461, 
   null, 
   1280078700.0
  ], 
  [
   408473, 
   null, 
   "flaja", 
   "sandy is right though, look at post #88. I said that and you quoted sandycane.\n\n \n I quoted what was in the post that I was replying to.", 
   {}, 
   408456, 
   null, 
   1280081880.0
  ], 
  [
   408474, 
   null, 
   "flaja", 
   "He is self-evidently incapable of paying attention to what others have said.\n\n \n There are certain of you that I am not wasting time on by reading anymore, but I will still reply to others who may quote posts from people I am now ignoring.", 
   {}, 
   408461, 
   null, 
   1280082000.0
  ], 
  [
   408475, 
   null, 
   "flaja", 
   "#88 & #87, which was poted by flaja, who quoted my name but the original was written by Jo. If you click on the arrow next to my name to go to the original reply, it takes you to one of mine (#69) that is not related. The original reply of Jo, quoted by flaja and assigned my name, is post #82.\n And, the post I was referring to in post #69 is #65 where flaja quoted me but assigned ganso's name to the quote.\n\n \n I am aware of this, but as I just explained I was quoting the post I was replying to.", 
   {}, 
   408465, 
   null, 
   1280082120.0
  ], 
  [
   408478, 
   null, 
   "gansao", 
   "I am aware of this, but as I just explained I was quoting the post I was replying to.\n\n \n You wasn't quoting the post that you was replying to.You was attributing the post to someone else.\n \n If you want to reply with the post you are replying to , you just click the quote symbol.\n You dont click the quote symbol and put somebody elses name on it.", 
   {}, 
   408475, 
   null, 
   1280083620.0
  ], 
  [
   408480, 
   null, 
   "Jo Bennett", 
   "[QUOTE=flaja;408439][QUOTE=Jo Bennett;408424]\n\n \n The Roman Catholics' purgatory is not found in any of these creeds. Neither is their veneration of the saints; the idolatry of their relics; infallibility of their Pope; the immaculate conception of their Virgin Mary; confessions to their priests or selling of their indulgences. Any one of these things negates a Roman Catholic's Christianity as far a Protestant is concerned.\n \n \n \n Which is why Puritanism came about. \n \n \n \n It does whenever doctrine is concerned. Change doctrine from what the Apostles taught and you end up following another way.\n\n \n You think every disagreement about doctrine means that one side is Christian and the other not? How about both sides are making an honest attempt to understand the will of God, and have reached different conclusions? The could both be wrong, but in making the attempt to follow Christ they are, by definition, Christians. As I said before, Christians are followers of the way, you can pick apart details about steps along the way, but that doesn't change the big picture.\n \n Puritanism came about because some people like to think they're holier than others, and they like certainty and being able to judge whether people are saved or damned.", 
   {
    "unicode_changes_made": true
   }, 
   408439, 
   null, 
   1280085060.0
  ], 
  [
   408483, 
   null, 
   "Symbiote", 
   "He is self-evidently incapable of paying attention to what others have said.\n\n \n What the hell is that supposed to mean, Flaja?", 
   {}, 
   408461, 
   null, 
   1280091480.0
  ], 
  [
   408492, 
   null, 
   "Bennedict", 
   "What the hell is that supposed to mean, Flaja?\n\n \n it doesnt make any sense.", 
   {}, 
   408483, 
   null, 
   1280098380.0
  ], 
  [
   408494, 
   null, 
   "Sandycane", 
   "it doesnt make any sense.\n\n \n Then what the hell did you say it for, flaja??\n \n (I think we have a 'Same Thread Extinction' going on here. lol)", 
   {}, 
   408492, 
   null, 
   1280100660.0
  ], 
  [
   408513, 
   null, 
   "mata", 
   "There are certain of you that I am not wasting time on by reading anymore, but I will still reply to others who may quote posts from people I am now ignoring.\n\n \n Apparently he's a legend in his own mind. Stay tuned folks, next stop, self-proclaimed Rain God Extraordinaire! (bitheway, thanks for the rain yesterday!)\n \n & the Full Moon last night was gorgeous! C'mon now, why not admit you had something to do with that? No need to be coy.\n \n Sheeesh, how goyish can you get?\n \n note to self: I may be really really sorry for that last question.", 
   {}, 
   408474, 
   null, 
   1280144160.0
  ], 
  [
   408514, 
   null, 
   "gansao", 
   "I doubt that anyone on this forum would care less if Flaja ignores them or not.", 
   {}, 
   408513, 
   null, 
   1280144520.0
  ], 
  [
   408531, 
   null, 
   "Bennedict", 
   "I doubt that anyone on this forum would care less if Flaja ignores them or not.\n\n \n whos flaja?", 
   {}, 
   408514, 
   null, 
   1280171580.0
  ], 
  [
   408555, 
   null, 
   "Sandycane", 
   "Well, this has got to be the most entertaining, off-topic conclusion to a thread I've seen yet. :pemoticon_xhoho", 
   {}, 
   408531, 
   null, 
   1280181660.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Same Sex Extinction?", 
  "url": "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction.html", 
  "breadcrumbs": [
   "Science and Math"
  ], 
  "id_number": 13980, 
  "discussion_files": [
   [
    "16836.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-print.html"
   ], 
   [
    "16837.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-8-print.html"
   ], 
   [
    "16838.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-6-print.html"
   ], 
   [
    "16839.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-4-print.html"
   ], 
   [
    "16840.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-5-print.html"
   ], 
   [
    "16841.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-7-print.html"
   ], 
   [
    "16842.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-3-print.html"
   ], 
   [
    "16843.html", 
    "http://www.4forums.com/political/science-math-debates/13980-same-sex-extinction-2-print.html"
   ]
  ], 
  "identifier": 13980
 }
]