[
 [
  [
   395171, 
   null, 
   "Zardoz", 
   "Borderline Personality Disorder.\n \n Does anyone here have any experience dealing with a friend, family member or loved one with this problem?", 
   {
    "post_info": {
     "post_title": "Borderline Personality Disorder"
    }
   }, 
   null, 
   null, 
   1268874600.0
  ], 
  [
   395376, 
   null, 
   "Steeeeve", 
   "Borderline Personality Disorder.\n \n Does anyone here have any experience dealing with a friend, family member or loved one with this problem?\n\n \n As a matter of fact I do. One of the only disorders where actually helping a person could end up hurting them...but not helping hurts them as well.\n \n It is a harsh disorder normally caused by abusive parent(s).", 
   {}, 
   395171, 
   null, 
   1269042960.0
  ], 
  [
   395452, 
   null, 
   "Zardoz", 
   "As a matter of fact I do. One of the only disorders where actually helping a person could end up hurting them...but not helping hurts them as well.\n \n It is a harsh disorder normally caused by abusive parent(s).\n\n \n That's so far my experience. Damned if you do and damned if you don't.\n And, being a person who's been VERY intricatly tied to this person for a LONG time...it's taking its toll on me too.\n \n I've been the (latest) victim of one of their 'distortion campaigns' for the past 5 years. And, despite actually having evidence to contradict their ceaseless and baseless allegations (as well as logic that would normally make their claims seem silly to anyone who thinks about it), I've had a hell of a time dispelling their claims to 3rd parties.\n \n I never knew it was caused by abusive family. That may explain why several counselors have asked about her parents.\n She has suffered from other things that I've heard of but, she ALWAYS portrays herself as a 'victim' and has defended her parents (other than in her journals) to all others.\n \n I've been trying to learn more about it and recently picked up the book 'Walking on Eggshells' as well as joined a forum board about it to learn more.\n \n There is a 'little' comfort that I'm not the only one who's dealt with someone with this ailment...but, I've had difficulty just coping with it.\n And, I'm not in an easy position to just walk away.\n \n Thanks.", 
   {}, 
   395376, 
   null, 
   1269147900.0
  ], 
  [
   395458, 
   null, 
   "Steeeeve", 
   "That's so far my experience. Damned if you do and damned if you don't.\n And, being a person who's been VERY intricatly tied to this person for a LONG time...it's taking its toll on me too.\n \n I've been the (latest) victim of one of their 'distortion campaigns' for the past 5 years. And, despite actually having evidence to contradict their ceaseless and baseless allegations (as well as logic that would normally make their claims seem silly to anyone who thinks about it), I've had a hell of a time dispelling their claims to 3rd parties.\nHa, I've been there...nothing like accounting for your whereabouts each day for 6 months. Your best bet is to be as far away from this person as you can unless that is not possible..ie family or something. If this is the case there are special programs for this disorder. I studied this in college for a few semesters since it interested me so much (borderline that is). I probably coulda minored in psychology looking back at it haha. Oh well, my father is a psychologist and he won't get near a borderline patient. That is just lawsuit waiting to happen.\n \n \nI never knew it was caused by abusive family. That may explain why several counselors have asked about her parents.\nIn general this is true. Oddly enough the borderline person is trying to get a predictable pattern by acting out as they do. So if you treat them with care, they generally aren't used to that so they cling and think you are the best thing since sliced bread. Next thing you know they turn on you. This is because they are used to the abandonment they normally got from mom or dad. This fear comes up and they basically have as self-fulfilling thing going on. I'm guessing one parent probably has been verbally abusive to the person and then buys that person stuff to make up for it. This is what creates that inconsistent relationship.\n \n \nShe has suffered from other things that I've heard of but, she ALWAYS portrays herself as a 'victim' and has defended her parents (other than in her journals) to all others.\nRight, the one good thing about Borderlines is they act out in extremely similar ways to other borderline girls making it easy to see if you know what to look for. This girl as probably attempted suicide but only to get attention. The girl I knew defended her mother all day. Again, goes back to abandonment.\n \n \nI've been trying to learn more about it and recently picked up the book 'Walking on Eggshells' as well as joined a forum board about it to learn more.\nThere are a few movies that portray it as well, ha.\n \n \nThere is a 'little' comfort that I'm not the only one who's dealt with someone with this ailment...but, I've had difficulty just coping with it.\n And, I'm not in an easy position to just walk away.\nYou can PM me about it anytime and I'd be happy to email as well. You may not be in an easy position to walk away but that is the best idea. The other is to have a limit set for this person. It really makes them mad but you have no choice. Don't let them praise you and don't let them make you feel good about anything you do for them. If you don't do that, you'll be sorry. \n \n Here are some other things this person may have done:[*]Had sex with many people saying they love them and then turning on them...sometimes they accuse the person of rape.[*]Substance abuse[*]obviously tried to be self-harming[*]really unstable self-image \"I'm fat\" type of thing...then you say \"no, you are pretty\" which is about the worst thing you coulda said.[*]Being a victim randomly often times saying they need you right away\n If she is under the age of 25 and so are you I bet I could tell you exactly what you and her have a relationship with scary accuracy. Normally symptoms tend to fade off after age 25 for some reason but this isn't always the case.\n \n Good luck my friend, you're gonna need it. I know I'm just an internet person but I've had more experience with Borderline than I ever wanted to and I know a hell of a lot about it. I'll try to dig up some of the resources I have from many moons ago and see if my father has anything new in the journals he reads.", 
   {}, 
   395452, 
   null, 
   1269155880.0
  ], 
  [
   395466, 
   null, 
   "Archangel", 
   "I've been the (latest) victim of one of their 'distortion campaigns' for the past 5 years. And, despite actually having evidence to contradict their ceaseless and baseless allegations (as well as logic that would normally make their claims seem silly to anyone who thinks about it), I've had a hell of a time dispelling their claims to 3rd parties.\n\n \n It sound like you are being accused of some indiscretion by a younger female who is being supported by others in the family since you referred to \"their distortion campaign.\" If you actually have evidence to disprove their claims and you feel their accusations are ruining your reputation, then do what the law allows for and sue her for libel/defamation of character and allow a court to settle the matter publicly. This will return your reputation in the community, unless you're concerned about the outcome, then you should hope they never make a legal issue of it.", 
   {}, 
   395452, 
   null, 
   1269181920.0
  ], 
  [
   395496, 
   null, 
   "Steeeeve", 
   "It sound like you are being accused of some indiscretion by a younger female who is being supported by others in the family since you referred to \"their distortion campaign.\" If you actually have evidence to disprove their claims and you feel their accusations are ruining your reputation, then do what the law allows for and sue her for libel/defamation of character and allow a court to settle the matter publicly. This will return your reputation in the community, unless you're concerned about the outcome, then you should hope they never make a legal issue of it.\n\n \n WOW!!!! DO NOT LISTEN TO THIS. This is probably the worst thing you can do. You can always tell someone who hasn't dealt with a Borderline.\n \n The very best thing that can happen from you suing is you are out lawyers fees. All you want is to give a boderline the platform to be a victim.\n \n I mean, just wow. Way off AA...way off.", 
   {}, 
   395466, 
   null, 
   1269200220.0
  ], 
  [
   395505, 
   null, 
   "Archangel", 
   "\n WOW!!!! DO NOT LISTEN TO THIS. This is probably the worst thing you can do. You can always tell someone who hasn't dealt with a Borderline.\n \n The very best thing that can happen from you suing is you are out lawyers fees. All you want is to give a boderline the platform to be a victim.\n \n I mean, just wow. Way off AA...way off.\n\n \n You assume the woman being referred to by our resident mocker, Zardoz \"IS actually someone with a borderline personality disorder.\" She may just be someone with a valid grievance against him who he is attempting to paint as mentally deficient. After all, he admitted that she isn't alone in her beliefs but us being supported by others who believe her claims. \n \n Also, if she is mentally ill, how else can he bring her symptoms to light other than proving her assertions are completely fabricated and figments of her imagination? That is why forcing the issue in a court of law would not only redeem his reputation which she is ruining if these accusations are false and will simultaneously get her medical help she needs.\n \n After all, one aspect of personality disorder is a chemical imbalance as this link makes clear.\n Chemical Imbalance\n According to the Mayo Clinic, some brain chemicals that regulate mood (such as serotonin) may be out of balance in borderline personality disorder, which may contribute to its cause.What Causes Borderline Personality Disorder? | eHow.com\n \n A chemical imbalance can only be treated with drug therapy so if in fact her accusations are fallacious, the only way to serve her needs are to challenge her accusations and prove them false since he says he has the evidence to do just that. Also, why are you so quick to accept his claim of her alleged illness when he himself said this?[Zardoz said:] I've been the (latest) victim of one of their 'distortion campaigns' for the past 5 years. And, despite actually having evidence to contradict their ceaseless and baseless allegations (as well as logic that would normally make their claims seem silly to anyone who thinks about it), I've had a hell of a time dispelling their claims to 3rd parties.\n In 2 sentences he himself admits 4 times \"they\" as in multiple people support this girls allegations against him. So why do you just assume we are dealing with a mentally disturbed person? Wouldn't those people closest to her clearly recognize that she is sick if that is the case? \n \n Excuse my skepticism, but with such vagaries as Zardoz has shared here, I can't help but think of how the criminal always uses the defense of indicting and blaming the victim in some way in order to attempt to exonerate themselves of any wrong doing. So before dismissing my opinion as way off, first prove we are actually dealing with a girl with borderline personality disorder and not a guilty person who is attempting to blame the victim and is seeking your insights to do it with.", 
   {}, 
   395496, 
   null, 
   1269209100.0
  ], 
  [
   395508, 
   null, 
   "Steeeeve", 
   "You assume the woman being referred to by our resident mocker, Zardoz \"IS actually someone with a borderline personality disorder.\" She may just be someone with a valid grievance against him who he is attempting to paint as mentally deficient. After all, he admitted that she isn't alone in her beliefs but us being supported by others who believe her claims. \nYou would not present it as he did if this is the case. And it really doesn't matter if we assume what he said is true my advice holds true. Frankly it is his life..not yours or mine and we aren't deciding this.\n \n \nAlso, if she is mentally ill, how else can he bring her symptoms to light other than proving her assertions are completely fabricated and figments of her imagination? That is why forcing the issue in a court of law would not only redeem his reputation which she is ruining if these accusations are false and will simultaneously get her medical help she needs.\nYou are wrong and a lot of other things that I cannot say on this forum. \n \n Why don't you stick with talking about things you know.", 
   {}, 
   395505, 
   null, 
   1269209700.0
  ], 
  [
   395509, 
   null, 
   "smiley", 
   "Archie has obviously never come across the use of 'they' to represent a single person, rather than plural people.\n \n For example:\n \n \"I went to see the doctor last week.\"\n \"What did they say?\"\n \n All Archie is trying to do here, is make an accusation against Zardoz by interpreting his words in a way that suits his own aganda.\n \n Who would have thunk it?", 
   {}, 
   395505, 
   null, 
   1269209760.0
  ], 
  [
   395522, 
   null, 
   "Zardoz", 
   "Their is 'singular' unless you want to include a small handful of others (minors) who get caught up in the psychosis. \n \n You know Archie, people who are willing to believe one-sided testimony that has no supporting evidence and aren't willing to allow the other person the opportunity of speaking in their own defense.\n People like the BPD's children, parents and close friends.\n \n In this case, she often cycles through BBF's pretty easily. One month, their (typically only friend in the world) friend is the greatest and has no flaws (perfect marriage, faith and practices, great kids, job...etc) and the next, they don't want to see them or made amends over a disagreement.\n \n \n And, yes AA, I HAVE considered lawsuits to try to bring the matter to court where I would have a chance to defend myself and hopefully either have the matter ended...or to have the (hopefully) sane 3rd parties actually see the erratic patterns this person has had in life.\n BUT, so far, I have tried to take a high road. Show mercy, compassion and forgiveness. To be optimisitc that things would become better. In effect, to show 'Christian' behavior to this person.\n And, IF this person is so mentally ill, I don't want to 'attack' her or give her any food for her to use against me.\n \n But, as time has gone on, I've been foreced more and more to deal with it.\n \n My pressing concern is that children are under her and I have great belief that she's engaging in 'abuse' against them. Well, not belief but from her own journal entries, her current statements (where she tries to put a spin on it to make her actions sound non-abusive ie 'I slammed my son against the wall because his shirt caught fire and I was trying to put it out'), and the statements of others. \n \n She just turned 39 and I believe she's 'reset' to 'charm mode'.\n \n \n \n On a related and ironic twist, one of my friends admitted last night that she has BPD. But, in her case, she's aware of it and desires to work on getting help. \n The relation to me, well, she lives in denial and professes that nothing is wrong with her. It's all everyone elses fault for every woe.\n \n I tend to be vague as I am not a type of person who airs every detail about my life. The only reason I've opened up here is because, as I've said...it's become increasingly difficult to cope and I really don't know how to deal with such a person.\n \n Do I seek to 'force' help onto them? Do I call CPS? Do I seek legal action?\n How do I deal with her family members who blindly believe her?\n There have been several counselors involved in the past but, I believe that whenever they start to see that the 'blame' lays with her and her stories don't hold up to critical scrutiny, she bails. She's just sought to find 'professonals' to lend credibility to her claims. \n \n An example of seeking the style of manipulation,\n Calling the police to make a report when I wasn't around and had witnesses that I wasn't around her. Police print out a 'call/run' report stating they showed up and what the call was about...no investigation.'\n She then runs around showing this type of thing as 'proof' to her allegations.\n Or, I'm at a store with others. I arrived there 1st. She then shows up, approaches me and starts chatting. Later, I hear from 3rd parties that she claims I was 'stalking' her on that day.\n \n And on and on and on.\n \n \n So, yes, Archie, I have thought to seek legal action. \n I have sought to detach myself from them and remain sane. And I definately make every attempt NOT to give them any fodder to use later against me. As Steve said...the best advice for dealing with these types is to RUN.\n But, with this person, it's very hard to do so.\n \n One of the main things I see happening with taking this to court is; even if I win, she'd say I lied, manipulated the legal system ('cause he's sooo damn smart) and was only doing this to seek revenge on her and further victimize her. \n \n Thanks.\n \n -Z", 
   {}, 
   395509, 
   null, 
   1269219420.0
  ], 
  [
   395524, 
   null, 
   "Steeeeve", 
   "And, yes AA, I HAVE considered lawsuits to try to bring the matter to court where I would have a chance to defend myself and hopefully either have the matter ended...or to have the (hopefully) sane 3rd parties actually see the erratic patterns this person has had in life.\n BUT, so far, I have tried to take a high road. Show mercy, compassion and forgiveness. To be optimisitc that things would become better. In effect, to show 'Christian' behavior to this person.\n And, IF this person is so mentally ill, I don't want to 'attack' her or give her any food for her to use against me.\nDon't do it!!!!!! For everything I have said on this forum that is the wisest advice I can give you.\n \n \nMy pressing concern is that children are under her and I have great belief that she's engaging in 'abuse' against them. Well, not belief but from her own journal entries, her current statements (where she tries to put a spin on it to make her actions sound non-abusive ie 'I slammed my son against the wall because his shirt caught fire and I was trying to put it out'), and the statements of others. \n \n She just turned 39 and I believe she's 'reset' to 'charm mode'.\nShe has kids? That's not good. If she is 39 and still acting like that then really your only option is treatment using drugs and therapy. Lucky the last decade or so has really been beneficial to helping those with BPD.\n \n \nI tend to be vague as I am not a type of person who airs every detail about my life. The only reason I've opened up here is because, as I've said...it's become increasingly difficult to cope and I really don't know how to deal with such a person.\nNo need to give details...I don't even know you and I probably already know :)\n \n \nDo I seek to 'force' help onto them? Do I call CPS? Do I seek legal action?\nno, no, and no. You will do more harm than good. CPS can't stop it because the kids will deny the parent is abusive and normally physical abuse is rare or disguised.\n \n \n \nHow do I deal with her family members who blindly believe her?\nNot much you can do about that. I wouldn't worry about it.\n \n \nThere have been several counselors involved in the past but, I believe that whenever they start to see that the 'blame' lays with her and her stories don't hold up to critical scrutiny, she bails. She's just sought to find 'professonals' to lend credibility to her claims. \nWell duh! For someone with abandonment issues and needing to be a victim to get love the last thing they want is someone not to give them that attention. A BPD person will have tons of therapists until they realize they do have a problem and that switching therapist is a symptom of it. Really there isn't much you can do if this person doesn't think a problem exists...she probably goes to the therapist to seek that \"love\" she needs. \n \n \nAn example of seeking the style of manipulation,\n Calling the police to make a report when I wasn't around and had witnesses that I wasn't around her. Police print out a 'call/run' report stating they showed up and what the call was about...no investigation.'\n She then runs around showing this type of thing as 'proof' to her allegations.\n Or, I'm at a store with others. I arrived there 1st. She then shows up, approaches me and starts chatting. Later, I hear from 3rd parties that she claims I was 'stalking' her on that day.\n \n And on and on and on.\nHaha, I bet if I told you my stories of me dealing with BPD you'd think it was all the same person.\n \n \nOne of the main things I see happening with taking this to court is; even if I win, she'd say I lied, manipulated the legal system ('cause he's sooo damn smart) and was only doing this to seek revenge on her and further victimize her. \nObviously. At least you understand how BPD works more.", 
   {}, 
   395522, 
   null, 
   1269222360.0
  ], 
  [
   395525, 
   null, 
   "Archangel", 
   "Archie has obviously never come across the use of 'they' to represent a single person, rather than plural people.\n \n For example:\n \n \"I went to see the doctor last week.\"\n \"What did they say?\"\n \n All Archie is trying to do here, is make an accusation against Zardoz by interpreting his words in a way that suits his own aganda.\n \n Who would have thunk it?\n\n \n Regarding the bolded: You're right, in proper english, I never have come across this phenomenon. \"They or their\" is a reference to a group, or more than one in proper english. And even though he waffles, even Zardoz has admitted that \"their\" did refer to others even if he does excuse them by saying they are minors with some shared psychosis. \n \n As for your example, it is as ignorant as your argument. It would be proper to say I went to the doctors office last week, they said I was fine. But if you said I went to my doctor last week, they said I was fine, any english teacher would ask you who this \"they\" you speak of is. And if you can't see that for the sake of taking sides on a debate forum, you just prove how slanted your perspective is for all to see. And my arguments to Zardoz stands until he can explain the actual particulars of the situation he is in since he raised the issue in the first place.\n \n It does him no good to bring up some vague yet nonspecific accusation that's being leveled against him by a non specific female as he specifically asks us to believe she has some psychosis without sharing the details of the situation. It just throws up all kinds of red flags to any rational person which is why I alone seem to recognize that fact so far.", 
   {}, 
   395509, 
   null, 
   1269222960.0
  ], 
  [
   395531, 
   null, 
   "smiley", 
   "Regarding the bolded: You're right, in proper english, I never have come across this phenomenon. \"They or their\" is a reference to a group, or more than one in proper english. And even though he waffles, even Zardoz has admitted that they did refer to others even if he does excuse them by saying they are minors with some shared psychosis. \n \n As for your example, it is as ignorant as your argument. It would be proper to say I went to the doctors office last week, they said I was fine. But if you said I went to my doctor last week, they said I was fine, any english teacher would ask you who this \"they\" you speak of is. And if you can't see that for the sake of taking sides on a debate forum, you just prove how slanted your perspective is for all to see. And my arguments to Zardoz stands until he can explain the actual particulars of the situation he is in since he raised the issue in the first place.\n \n It does him no good to bring up some vague yet nonspecific accusation that's being leveled against him by a non specific female as he specifically asks us to believe she has some psychosis without sharing the details of the situation. It just throws up all kinds of red flags to any rational person which is why I alone seem to recognize that fact so far.\n\n Well, Archie, you've come across the use of they/their in the singular form now. No excuses next time.", 
   {}, 
   395525, 
   null, 
   1269225420.0
  ], 
  [
   395532, 
   null, 
   "Archangel", 
   "Well, Archie, you've come across the use of they/their in the singular form now. No excuses next time.\n\n \n Uh, no, actually I haven't, not in proper english anyway. You just claiming it to be so isn't exactly evidence of anything at all. Especially since your defense of such foolishness is, well, just ignorant.", 
   {}, 
   395531, 
   null, 
   1269225840.0
  ], 
  [
   395534, 
   null, 
   "smiley", 
   "Uh, no, actually I haven't, not in proper english anyway. You just claiming it to be so isn't exactly evidence of anything at all. Especially since your defense of such foolishness is, well, just ignorant.\n\n The use of the singular 'they' is most common when either the number of people or the gender of the person is unknown.\n \n It's easy enough to look up.\n \n No more excuses Archie.", 
   {}, 
   395532, 
   null, 
   1269226920.0
  ], 
  [
   395536, 
   null, 
   "Archangel", 
   "The use of the singular 'they' is most common when either the number of people or the gender of the person is unknown.\n \n It's easy enough to look up.\n \n No more excuses Archie.\n\n \n Neither of which was true in Zardoz's case. He knew exactly who he was referring to and even admitted in his next post that others did agree with his accuser so he was using the term \"their\" in a literal and proper context. To then attempt to pass it off as meant in a singular form after admitting the opposite in the same post. Only you are dishonest enough to defend such a ridiculous notion. \n \n \nTheir is 'singular' unless you want to include a small handful of others (minors) who get caught up in the psychosis. \n\n \n How do you like this sentence for a contradiction in terms? On the one hand he was speaking in the singular, unless you count those pesky alleged minors who share her psychosis. Yet I'm the one whose english you see fit to attempt to correct. And you know what's most incredible about this exchange smiley? You don't even have the sense to be embarrassed. emoticon_xdonno", 
   {}, 
   395534, 
   null, 
   1269229500.0
  ], 
  [
   395538, 
   null, 
   "smiley", 
   "Neither of which was true in Zardoz's case. He knew exactly who he was referring to and even admitted in his next post that others did agree with his accuser so he was using the term \"their\" in a literal and proper context. To then attempt to pass it off as meant in a singular form after admitting the opposite in the same post. Only you are dishonest enough to defend such a ridiculous notion. \n \n \n \n How do you like this sentence for a contradiction in terms? On the one hand he was speaking in the singular, unless you count those pesky alleged minors who share her psychosis. Yet I'm the one whose english you see fit to attempt to correct. And you know what's most incredible about this exchange smiley? You don't even have the sense to be embarrassed. emoticon_xdonno\n\n Although it later turned out that the use of the word 'their' may have been used in the plural, the use of the word in this post could well have been the singular.\n \n \nThat's so far my experience. Damned if you do and damned if you don't.\n And, being a person who's been VERY intricatly tied to this person for a LONG time...it's taking its toll on me too.\n \n I've been the (latest) victim of one of their 'distortion campaigns' for the past 5 years. And, despite actually having evidence to contradict their ceaseless and baseless allegations (as well as logic that would normally make their claims seem silly to anyone who thinks about it), I've had a hell of a time dispelling their claims to 3rd parties.\n \n I never knew it was caused by abusive family. That may explain why several counselors have asked about her parents.\n She has suffered from other things that I've heard of but, she ALWAYS portrays herself as a 'victim' and has defended her parents (other than in her journals) to all others.\n \n I've been trying to learn more about it and recently picked up the book 'Walking on Eggshells' as well as joined a forum board about it to learn more.\n \n There is a 'little' comfort that I'm not the only one who's dealt with someone with this ailment...but, I've had difficulty just coping with it.\n And, I'm not in an easy position to just walk away.\n\n \n Note I also high-lighted 'a person' (to which 'their' applied).\n \n So, I have nothing to be embarrassed about.\n \n I am surprised that you had never come across the use of the singular 'they/their/them'. It goes all the way back to Chaucer's Canterbury Tales\n \n &#8220;And whoso fyndeth hym out of swich blame,\n They wol come up [...]&#8220;\n \n Lewis and Jane Austin also used it.\n \n So, at least you managed to learn something today.", 
   {}, 
   395536, 
   null, 
   1269230640.0
  ], 
  [
   395541, 
   null, 
   "Archangel", 
   "I'm not going to go in circles with you smiley, I will only repost my previous post which says it all. http://www.4forums.com/political/395536-post16.html", 
   {}, 
   395538, 
   null, 
   1269233160.0
  ], 
  [
   395571, 
   null, 
   "smiley", 
   "I'm not going to go in circles with you smiley, I will only repost my previous post which says it all. http://www.4forums.com/political/395536-post16.html\n\n So, I was wrong, you've learnt nothing.", 
   {}, 
   395541, 
   null, 
   1269273600.0
  ], 
  [
   395576, 
   null, 
   "Steeeeve", 
   "So, at least you managed to learn something today.\nDon't count on it", 
   {}, 
   395538, 
   null, 
   1269281760.0
  ], 
  [
   395596, 
   null, 
   "smiley", 
   "Don't count on it\n\n Your suspicions have already been confirmed.", 
   {}, 
   395576, 
   null, 
   1269285780.0
  ], 
  [
   395631, 
   null, 
   "Zardoz", 
   "Yeesh.\n \n Initially, I did use 'their' to refer to the singular (her).\n \n Yes, if you wish, you can lump in parroting others but the primary issue is the individual with BPD.\n \n As it currently stands...someone else jumped the gun some.\n The school of one of the kids called CPS on her recently and they visited her last week.\n \n Apparently, it takes a lot more than what happened to make a difference.\n \n But, at least my hands are clean of that...and at least others are showing some concern.\n \n I've spoken with others in regards to this issue and the concensus is to simply avoid her like the plague.\n I did speak to her briefly today when she notified me that the school called CPS. I stated maybe she should seek help.\n And, predictably, she denied that anything was wrong with her. She is fine and was 'insulted' by the implications.\n Once again, nothing was her fault. The kid was framing her. The school didn't know the whole story...etc. etc.\n \n Oh well, time to get a 10' pole to handle her with.", 
   {}, 
   395596, 
   null, 
   1269305760.0
  ], 
  [
   395632, 
   null, 
   "gansao", 
   "Sorry to hear you are having to cope with this XXXX Zardoz.\n I take it that these kids are yours .", 
   {}, 
   395631, 
   null, 
   1269306060.0
  ], 
  [
   395633, 
   null, 
   "Steeeeve", 
   "Yeesh.\n \n Initially, I did use 'their' to refer to the singular (her).\n \n Yes, if you wish, you can lump in parroting others but the primary issue is the individual with BPD.\n \n As it currently stands...someone else jumped the gun some.\n The school of one of the kids called CPS on her recently and they visited her last week.\n \n Apparently, it takes a lot more than what happened to make a difference.\n \n But, at least my hands are clean of that...and at least others are showing some concern.\n \n I've spoken with others in regards to this issue and the concensus is to simply avoid her like the plague.\n I did speak to her briefly today when she notified me that the school called CPS. I stated maybe she should seek help.\n And, predictably, she denied that anything was wrong with her. She is fine and was 'insulted' by the implications.\n Once again, nothing was her fault. The kid was framing her. The school didn't know the whole story...etc. etc.\n \n Oh well, time to get a 10' pole to handle her with.\n\n \n Textbook BPD if you ask me. \n \n Yeah, if you can, avoid at all costs. You can only tell her she needs help...you aren't trained to give it.", 
   {}, 
   395631, 
   null, 
   1269306660.0
  ], 
  [
   395684, 
   null, 
   "tester", 
   "Regarding the bolded: You're right, in proper english, I never have come across this phenomenon. \"They or their\" is a reference to a group, or more than one in proper english. And even though he waffles, even Zardoz has admitted that \"their\" did refer to others even if he does excuse them by saying they are minors with some shared psychosis. \n\n \n Grammatically, I'm with Archangel on this one (first for everything, I suppose! :)). \"Their\" should always be used as a possessive plural pronoun. It is often used incorrectly as a cop out when one does not want to specify gender for the possessive form of a singular pronoun. But, in such cases one should either commit to a gender or use something like \"his / her.\" Many style guides frown on using \"his / her\" but, technically, I think it would have been the best choice in this case.\n \n Yes: I recognize that it is silly for me to chime in at this point (the larger issue initially raised by Zardoz is much more significant), but IMHO incorrect statements about proper grammar were made to justify criticizing Archangel. Given the imprecise writing (no offense intended, Zardoz -- I make similar mistakes all the time), I believe that Archangel sincerely misinterpreted Zardoz's intended meaning.", 
   {}, 
   395525, 
   null, 
   1269364680.0
  ], 
  [
   395742, 
   null, 
   "smiley", 
   "Grammatically, I'm with Archangel on this one (first for everything, I suppose! :)). \"Their\" should always be used as a possessive plural pronoun. It is often used incorrectly as a cop out when one does not want to specify gender for the possessive form of a singular pronoun. But, in such cases one should either commit to a gender or use something like \"his / her.\" Many style guides frown on using \"his / her\" but, technically, I think it would have been the best choice in this case.\n \n Yes: I recognize that it is silly for me to chime in at this point (the larger issue initially raised by Zardoz is much more significant), but IMHO incorrect statements about proper grammar were made to justify criticizing Archangel. Given the imprecise writing (no offense intended, Zardoz -- I make similar mistakes all the time), I believe that Archangel sincerely misinterpreted Zardoz's intended meaning.\n\n Sorry tester, but you are wrong.\n \n The use of their/them/they in the singular form is a recognised mechanism in English grammar. Chaucer was one of the first to use it, as have C S Lewis and Jane Austin, amongst others.\n \n It really is an established part of proper English. Look it up.", 
   {}, 
   395684, 
   null, 
   1269386880.0
  ], 
  [
   395744, 
   null, 
   "tester", 
   "Sorry tester, but you are wrong.\n \n The use of their/them/they in the singular form is a recognised mechanism in English grammar. Chaucer was one of the first to use it, as have C S Lewis and Jane Austin, amongst others.\n \n It really is an established part of proper English. Look it up.\n\n \n Sorry for continuing to derail this thread, but I find myself quite intrigued by this because it is something I run into fairly often in my own writing.\n \n Following your advice, Smiley, I did make an attempt to look this up. I do stand corrected in that there is more debate about this than I thought. But, from what I've been able to find, those who advocate the use of singular they/their only do so when the the object of the pronoun is indeterminate in terms of quantity or identity. Notably, that is not the case here.\n \n Where, specifically, do you recommend I look this up? The only grammar book I still have is Strunk and White's _The Elements of Style_, and I don't believe this is covered. So, I've resorted to looking online, and it isn't clear to me what one should take as an authoritative source.\n \n The following is from the \"Q&A\" section of the Online Chicago Manual of Style, and I think it reflects the overall consensus for good writing:\n \n \nPronouns\n \n Q. I would swear that I saw a reference in your manual that approved of the use of \"their\" instead of a gender-biased singular pronoun. For example, \"If the user has completed installing the program, they should put the CD-ROM back in the package,\" instead of \"If the user has completed installing the program, s/he should put the CD-ROM back in the package,\" but on your Q&A, you dance around the answer to the question and suggest that you do NOT approve of the singular \"their.\" Can you tell us what is acceptable?\n \n A. Yes, you saw it at 2.98 (note 9) in the fourteenth edition, but there was some regret at having written it, and we decided not to second the idea in the fifteenth edition. Though some writers are comfortable with the occasional use of they as a singular pronoun, some are not, and it is better to do the necessary work to recast a sentence or, other options having been exhausted, use he or she. For a fuller discussion of this issue, see paragraphs 5.43 and 5.202-6 in CMOS 15, including the entry for \"he or she\" under the \"Glossary of Troublesome Expressions\" at paragraph 5.202. \n\n \n URL for the above excerpt: \n Chicago Style Q&A: Pronouns", 
   {
    "unicode_changes_made": true
   }, 
   395742, 
   null, 
   1269390600.0
  ], 
  [
   395745, 
   null, 
   "smiley", 
   "Sorry for continuing to derail this thread, but I find myself quite intrigued by this because it is something I run into fairly often in my own writing.\n \n Following your advice, Smiley, I did make an attempt to look this up. I do stand corrected in that there is more debate about this than I thought. But, from what I've been able to find, those who advocate the use of singular they/their only do so when the the object of the pronoun is indeterminate in terms of quantity or identity. Notably, that is not the case here.\n \n Where, specifically, do you recommend I look this up? The only grammar book I still have is Strunk and White's _The Elements of Style_, and I don't believe this is covered. So, I've resorted to looking online, and it isn't clear to me what one should take as an authoritative source.\n \n The following is from the \"Q&A\" section of the Online Chicago Manual of Style, and I think it reflects the overall consensus for good writing:\n \n \n \n URL for the above excerpt: \n Chicago Style Q&A: Pronouns\n\n True, this mechanism is pretty much only (with exceptions like laziness) used when gender or number is indeterminate.\n \n I was already aware of its existence and looked it up on the net just to confirm.\n \n As for an authoritative source, Chaucer is good enough for me. But it is certainly up to you whether you accept this.", 
   {}, 
   395744, 
   null, 
   1269391620.0
  ], 
  [
   395750, 
   null, 
   "Zardoz", 
   "Yesh. This grammatical stuff is funny.\n \n My intentions were to be vague as I stated. I eventually slipped and said 'she'. I'm not perfect. \n \n \n Here's something that may aid such.\n \n person 1: \"I went to see my doctor today.\"\n person 2: 'Oh really? What did ____ say?'\n \n fill in the blank. Or, replace 'my' with 'a' in person ones sentence.\n \n \n As for my experience in dealing with the BPD. When they are 'lucid' or see you in the 'white/perfect' mode, they are great. They can be charming and compassionate.\n But, when they switch out...or you become their enemy for some reason, typically slight or imaginary, they are highly vindictive and spiteful. If you can get out of their sight, they sometimes forget you. (Out of sight, out of mind).\n \n They seem to have a great fear of abandoment and when that doesn't happen, they can turn and seek to drive you away. A self-fulfilling prophecy which, to them, lends another layer of victimhood and an example to use to new people they meet.\n \n They tend to only see people and things as a reflection of themselves. Everything is related to them. It's 'all' about them. They can easily devolve into being 'takers.' Entitlement issues often abound.\n \n They are black/white people. Seeing things as extremes and very rarely acknowledging any middle ground...or grey areas.\n They thus have troubles seeing another person as 'human'. The other is either elevated to sainthood...or cast as a debased villain.\n \n What they 'feel' is their reality. Like Bush, they have their 'guts' to go by.\n \n Like Steeeve said, the best way to deal with them is by running. Self preservation.\n \n The problems I have are often an inability to run (in practice and in theory...I find it hard to accept that you have to abandon people just to survive) and in dealing with putting out the many 'fires' this person has caused and in helping others who are related to them.\n \n So far, about 50 to 70% of the people who know her tend to realize eventually that she has severe problems. The other 30%+ don't see this right away...and being humane, often want to side with the 'underdog/victim' and help. So, she can often find people to fight her battles for her and provide her with the allies she needs to support her version of reality. A version they often find themselves parroting.\n \n I don't blame the 3rd parties much. I was in their shoes in the past myself when her 'target' was someone else.", 
   {}, 
   395745, 
   null, 
   1269394980.0
  ], 
  [
   395753, 
   null, 
   "Archangel", 
   "Grammatically, I'm with Archangel on this one (first for everything, I suppose! :)). \"Their\" should always be used as a possessive plural pronoun. It is often used incorrectly as a cop out when one does not want to specify gender for the possessive form of a singular pronoun. But, in such cases one should either commit to a gender or use something like \"his / her.\" Many style guides frown on using \"his / her\" but, technically, I think it would have been the best choice in this case.\n \n Yes: I recognize that it is silly for me to chime in at this point (the larger issue initially raised by Zardoz is much more significant), but IMHO incorrect statements about proper grammar were made to justify criticizing Archangel. Given the imprecise writing (no offense intended, Zardoz -- I make similar mistakes all the time), I believe that Archangel sincerely misinterpreted Zardoz's intended meaning.\n\n \n \nSorry tester, but you are wrong.\n \n The use of their/them/they in the singular form is a recognised mechanism in English grammar. Chaucer was one of the first to use it, as have C S Lewis and Jane Austin, amongst others.\n \n It really is an established part of proper English. Look it up.\n\n \n \nSorry for continuing to derail this thread, but I find myself quite intrigued by this because it is something I run into fairly often in my own writing.\n \n Following your advice, Smiley, I did make an attempt to look this up. I do stand corrected in that there is more debate about this than I thought. But, from what I've been able to find, those who advocate the use of singular they/their only do so when the the object of the pronoun is indeterminate in terms of quantity or identity. Notably, that is not the case here.\n \n Where, specifically, do you recommend I look this up? The only grammar book I still have is Strunk and White's _The Elements of Style_, and I don't believe this is covered. So, I've resorted to looking online, and it isn't clear to me what one should take as an authoritative source.\n \n The following is from the \"Q&A\" section of the Online Chicago Manual of Style, and I think it reflects the overall consensus for good writing:\n \n \n \n URL for the above excerpt: \n Chicago Style Q&A: Pronouns\n\n \n I realize we rarely agree on anything Tester, but I appreciate your intellectual honesty in objectively judging this issue. Just be aware that smiley will never concede his error though, especially where opposing me is concerned. I can't be bothered repeating myself to stubborn people who refuse to actually read what a person says as they reinterpret it to serve their own preferred purpose. \n \n Even the link smiley posted clearly says that they/their is commonly used in reference to a singular generic application such as \"A person can't help their birth,\" But Zardoz was speaking about a particular person whom he stated had others who agreed with her accusation against him. So we know the singular person he was speaking of and that a group of people believe and support her. \n \n Only because he is vague do we not understand the precise situation and accusations she has made. I imagine they are sexual though or he wouldn't avoid sharing and she is a minor because he has said as much. I believe the they/their he was originally referring to though, was her immediate family like her parents. If my imagination is running wild, I apologize, it's only because he has offered no actual facts to go on. Only a self serving opinion that she has a personality disorder.\n \n I maintain that we only have his word that she has any type of mental issues at all and he has offered nothing specific except to waffle with each question and observation which has been offered here.", 
   {}, 
   395744, 
   null, 
   1269400020.0
  ], 
  [
   395754, 
   null, 
   "thelmoose", 
   "Yesh. This grammatical stuff is funny.\n \n My intentions were to be vague as I stated. I eventually slipped and said 'she'. I'm not perfect. \n \n \n Here's something that may aid such.\n \n person 1: \"I went to see my doctor today.\"\n person 2: 'Oh really? What did ____ say?'\n \n fill in the blank. Or, replace 'my' with 'a' in person ones sentence.\n \n \n As for my experience in dealing with the BPD. When they are 'lucid' or see you in the 'white/perfect' mode, they are great. They can be charming and compassionate.\n But, when they switch out...or you become their enemy for some reason, typically slight or imaginary, they are highly vindictive and spiteful. If you can get out of their sight, they sometimes forget you. (Out of sight, out of mind).\n \n They seem to have a great fear of abandoment and when that doesn't happen, they can turn and seek to drive you away. A self-fulfilling prophecy which, to them, lends another layer of victimhood and an example to use to new people they meet.\n \n They tend to only see people and things as a reflection of themselves. Everything is related to them. It's 'all' about them. They can easily devolve into being 'takers.' Entitlement issues often abound.\n \n They are black/white people. Seeing things as extremes and very rarely acknowledging any middle ground...or grey areas.\n They thus have troubles seeing another person as 'human'. The other is either elevated to sainthood...or cast as a debased villain.\n \n What they 'feel' is their reality. Like Bush, they have their 'guts' to go by.\n \n Like Steeeve said, the best way to deal with them is by running. Self preservation.\n \n The problems I have are often an inability to run (in practice and in theory...I find it hard to accept that you have to abandon people just to survive) and in dealing with putting out the many 'fires' this person has caused and in helping others who are related to them.\n \n So far, about 50 to 70% of the people who know her tend to realize eventually that she has severe problems. The other 30%+ don't see this right away...and being humane, often want to side with the 'underdog/victim' and help. So, she can often find people to fight her battles for her and provide her with the allies she needs to support her version of reality. A version they often find themselves parroting.\n \n I don't blame the 3rd parties much. I was in their shoes in the past myself when her 'target' was someone else.\n\n \n You've nailed it on the head.\n The borderline is a very black/white person. They will idolize you as wonderful one minute, but the second you don't fall into line to his/her/their realitiy , you are evil. If you don't meet her every need, she panics into a fear of abandonment and demonizes you as being like all the others.\n \n I write this to make a suggestion. Avoidance is a good idea if you can write this person out of your life. Minimize contact for sure, when you can, but otherwise you need to set strict unwavering limits. Be pleasant and compassionate but firm and dispassionate. Communicate simply, directly and clearly - leave no wiggle room or she will take it. \n \n I am sorry for you. I know it's hard to be compassionate to a person like this, because, almost by definition they behave like a complete pain is the XXX and can treat others terrribly. If it helps at all, remember she is suffering - this is not a happy person. Certainly most of her unhappiniess is self-induced, but her brain ain't working right. Not saying you ever need to put up with any XXXX, but remembering they are sick sometimes helps you/one/her/him to not take the affronts so personally. Above all, don't stop urging mental health intervention - if not to her, as that may escalate things, but certainly to those close to her.\n \n Good luck.", 
   {}, 
   395750, 
   null, 
   1269400320.0
  ], 
  [
   416304, 
   null, 
   "jharold", 
   "It's the most difficult thing in the world, and it blindsided me like nothing I've ever experienced. I'm still digging through the muck of what has been done, said, and now dealing with my own issues I've realized attracted me to this person, and it's a wake up call, to say the least.\n \n Right now my main interest is getting myself together and being strong, which is 10x harder than I ever thought.\n \n I guess the sea of legal navigation is going to kill me if this doesn't.", 
   {
    "post_info": {
     "post_title": "Yes, I am dealing with a soon-to-be ex that has this"
    }
   }, 
   395171, 
   null, 
   1288824180.0
  ], 
  [
   416328, 
   null, 
   "Steeeeve", 
   "It's the most difficult thing in the world, and it blindsided me like nothing I've ever experienced. I'm still digging through the muck of what has been done, said, and now dealing with my own issues I've realized attracted me to this person, and it's a wake up call, to say the least.\n \n Right now my main interest is getting myself together and being strong, which is 10x harder than I ever thought.\n \n I guess the sea of legal navigation is going to kill me if this doesn't.\n\n \n If the person has BPD run for the hills. You do no good trying to help them. In fact, it is worst thing you can do.\n \n After much research on this subject (including college study) the best thing you can do for BPD person is leave them.", 
   {}, 
   416304, 
   null, 
   1288891740.0
  ], 
  [
   417014, 
   null, 
   "Hailing", 
   "Postbulletin.com: Rochester, MN\n postbulletin. typepad. com/pulse_on_health/2010/11/mayo-clinic-facebook-controversy. html\n \n Imho any respectable clinic would surely fire that Slucis just at once. I don't actually know why Mayo is reluctant... their reputation isn't particularly getting better day by day. Well actually it's strange that american authorities keep silent... Usually they respond just at once. Take at least the case with the black professor who was arrested just at the door of his house. (Obama: Police who arrested professor 'acted stupidly' - CNN\n articles. cnn. com/2009-07-22/us/harvard. gates. interview_1_cambridge-police-gates-james-crowley?_s=PM:US) Obama himself tried to end the rift with a jug of beer!\n While now there's no reaction at all despite that the case may well turn out into an international row!! What if that disgrace of his profession Slucis not only \"would not be able to\" but actually \"was not able to\" treat Russians equally? What if he carried out experiments on them? Actually I do believe this ought to be thoroughly investigated and if Slucis is really guilty than he ought to be punished with the utmost rigor of the law. While if not... he is anyway has to be banned from the profession, imho...", 
   {
    "post_info": {
     "post_title": "A racist-doctor springs out in Mayo Clinic"
    }, 
    "unicode_changes_made": true
   }, 
   395171, 
   null, 
   1289668020.0
  ], 
  [
   421086, 
   null, 
   "MsDecided", 
   "My daughter is an adult and I am a Metaphysical Psychologist. She has SEVERE Borderline Personality Disorder and now I can see many signs in my 4 y.o. grandson. I MUST think of self-protection and BREAK the ties that bind. She is rich (car accident settlement) and has a great husband. She does NOT need me and all we do is trigger each other. HOWEVER each time (too many to count) thru the years that I have tried to BREAK the ties, she becomes VERY vindictive. I run 3 international agencies (including 1 non-profit mental health agency) and I can NOT afford her vindictiveness (part of why I have stayed and TRIED to manage but I no longer can as it is severely affecting my health). Therefore I am hoping YOUR group can help with ways to legally & non-legally protect myself, my privacy, my assets / property from her historical acts of vengeance. THANK YOU !! :xbanghead", 
   {
    "post_info": {
     "post_title": "HELP need advice..."
    }
   }, 
   395534, 
   null, 
   1294197360.0
  ], 
  [
   421191, 
   null, 
   "J Miro", 
   "My daughter is an adult and I am a Metaphysical Psychologist. She has SEVERE Borderline Personality Disorder and now I can see many signs in my 4 y.o. grandson. I MUST think of self-protection and BREAK the ties that bind. She is rich (car accident settlement) and has a great husband. She does NOT need me and all we do is trigger each other. HOWEVER each time (too many to count) thru the years that I have tried to BREAK the ties, she becomes VERY vindictive. I run 3 international agencies (including 1 non-profit mental health agency) and I can NOT afford her vindictiveness (part of why I have stayed and TRIED to manage but I no longer can as it is severely affecting my health). Therefore I am hoping YOUR group can help with ways to legally & non-legally protect myself, my privacy, my assets / property from her historical acts of vengeance. THANK YOU !! :xbanghead\n\n \n I am not an authority on this subject. It sounds like you're very clear about what you need in the situation, which is good.\n \n Maybe get a lawyer, a restraining order, and some very clear boundaries communicated through the courts, if she going to continue bothering you.", 
   {}, 
   421086, 
   null, 
   1294302840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Borderline Personality Disorder", 
  "url": "http://www.4forums.com/political/mental-health/14033-borderline-personality-disorder.html", 
  "breadcrumbs": [
   "Mental Health"
  ], 
  "id_number": 14033, 
  "discussion_files": [
   [
    "590.html", 
    "http://www.4forums.com/political/mental-health/14033-borderline-personality-disorder-print.html"
   ], 
   [
    "591.html", 
    "http://www.4forums.com/political/mental-health/14033-borderline-personality-disorder-3-print.html"
   ], 
   [
    "592.html", 
    "http://www.4forums.com/political/mental-health/14033-borderline-personality-disorder-2-print.html"
   ]
  ], 
  "identifier": 14033
 }
]