[
 [
  [
   395255, 
   null, 
   "Jim Colyer", 
   "ABBA page @ Rock n roll HOF\n ABBA: inducted in 2010 | The Rock and Roll Hall of Fame and Museum\n \n \n Agnetha Fältskog (vocals; born April 5, 1950),\n Benny Andersson (keyboards; born December 16, 1946),\n Björn Ulvaeus (guitar; born April 24, 1945),\n Anni-Frid Lyngstad (vocals; born November 15, 1945)\n \n ABBA rose out of Sweden in the Seventies to become one of the most successful and beloved pop groups in music history. Their success gave a more international &#64258;avor to popular music, broadening it beyond the English-speaking countries of origin. ABBA truly was an international phenomenon, topping charts and breaking records in England, France, Italy, Germany, Holland and Scandinavia. For a few years ABBA ranked second only to automaker Volvo as Sweden's biggest money-making export.\n \n The group has sold more than 100 million records worldwide. In the U.K. alone, these Swedish superstars charted 19 Top 10 singles (including nine that went to Number One) from 1974 to 1982. America proved somewhat more impervious to ABBA mania, as the group cracked the U.S. Top 10 only four times and hit Number One exactly once (with \"Dancing Queen,\" in 1977). However, America got belatedly on board when the \"jukebox musical\" Mamma Mia!, based on the songs of ABBA, became a Broadway sensation. In December 2009, it became the 12th-longest-running Broadway show in history as it closed in on its 3,400th performance. Mamma Mia!, which premiered in London in 1999, has played around the world to an estimated 40 million people. A &#64257;lm version and accompanying soundtrack were released in 2008. All of this further fueled ABBA mania, which remains in high throttle three decades after the group's breakup in 1982.\n \n The seeds for ABBA's decade of infectious, effervescent pop were sewn in 1966, when Benny Andersson and Björn Ulvaeus met. The two were already rock stars in Sweden, where Björn played guitar with the Hootenanny Singers and Benny was keyboardist with the Hep Stars (referred to in their homeland as \"the Swedish Beatles\"), They made some records as a duo, using the name Björn and Benny. In 1972 they recorded one of their songs using Björn's wife, Agnetha Fältskog, and Benny's wife-to-be, Anni-Frid Lyngstad (\"Frida,\" for short), as backing vocalists. Cut in a studio in Stockholm in March 1972, \"People Need Love\" was credited to \"Björn and Benny, Agnetha and Anni-Frid,\" as the ABBA acronym had not yet been devised. (Technically, the &#64257;rst \"B\" in ABBA is backward, according to the band's copyrighted logo.) \"People Need Love\" became a Swedish hit and was issued in America on Playboy Records (an offshoot of the magazine), which peculiarly amended the credit to \"Björn and Benny (with Svenska Flicka)\" - meaning \"Swedish girl.\"\n \n ABBA's breakthrough came in 1974, when their song \"Waterloo\" won the Eurovision Song Contest. It topped the charts in many countries, including Britain, and even hit Number Six in the U.S. With its ringing harmonies and surging melody, \"Waterloo\" recalled the tuneful, high-energy songs of the girl-group era and the British Invasion at a time when infectious pop songcraft was in short supply. There was much more to come from ABBA in this vein. A year after the success of Waterloo,\" they scored again with \"SOS,\" reaching Number Six in the U.K. and Number 15 in the U.S. ABBA became a &#64257;xture on the world charts.\n \n Their mounting success resulted in sustained chart feats of Beatles-like proportions. Over a six-year period, from late 1975 through early 1972, ABBA released 17 consecutive singles that placed in the U.K. Top Five. Eight of those were Number One hits: \"Mamma Mia,\" \"Fernando,\" \"Dancing Queen,\" \"Knowing Me Knowing You,\" \"The Name of the Game,\" \"Take a Chance on Me,\" \"The Winner Takes It All\" and \"Super Trouper.\" The singles \"Does Your Mother Know\" and \"I Have a Dream\" just fell short, reaching Number Two. Four others stopped at Number Three:\n \n \"Money, Money, Money,\" \"Angeleyes/ Voulez-Vous,\" \"Gimme Gimme Gimme (A Man after Midnight)\" and \"One of Us.\" All are driven by the soaring, harmonized lead vocals of Agnetha and Anna-Frid and the songwriting and production of Björn and Benny.\n \n From 1975 to 1980, ABBA spent 35 weeks atop Britain's album charts - a feat equaled by no one. By contrast, the group only topped the American album and singles charts once: in April 1977, when \"Dancing Queen\" hit Number One for a week. For this reason, as Billboard wrote, \"the members of ABBA consider America to be their only failure.\" Even so, they placed 20 songs in the Hot 100 and have seen eight of their albums certi&#64257;ed gold or platinum by the RIAA.\n \n In fact, much of ABBA's American success came belatedly, after their 1982 breakup. Internal tensions stemming from the divorces of the two couples recalled similar turbulence within Fleetwood Mac during the making of that band's Rumours. Agnetha and Björn separated in late 1978, and Benny and Anni-Frid split up in early 1981. They recorded their &#64257;nal album, The Visitors, before disbanding in 1982. Benny and Björn thereupon set about working on the musical Chess with Tim Rice, while Agnetha and Anni-Frid embarked on solo careers. ABBA has never regrouped.\n \n An ABBA revival in the Nineties was sparked by the incredible success of Gold - Greatest Hits, which has sold 26 million copies worldwide, including six million in the U.S. A comprehensive box set, Thank You for the Music, was released in 1994. The musical Mamma Mia! came at the end of the decade and carried the ABBA revival into the new millennium. In 2002, Universal Music remastered and reissued ABBA's eight studio albums in expanded versions. An even more exhaustive box set, The Complete Studio Recordings, appeared in 2005. With ABBA's 2010 induction into the Rock and Roll Hall of Fame, ABBA mania will continue for years to come.", 
   {
    "post_info": {
     "attachments": 1, 
     "post_title": "ABBA inducted into Rock n Roll Hall Of Fame"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1268951520.0
  ], 
  [
   395258, 
   null, 
   "gansao", 
   "ABBA never really took off in the States I believe.\n We love them in Europe.\n They remind me of my youthemoticon_xlove", 
   {}, 
   395255, 
   null, 
   1268952720.0
  ], 
  [
   395261, 
   null, 
   "jitobear", 
   "Yanks love ABBA, too. Probably the greatest pop group ever. Rock however, not so much. Nothing against pop, its just not rock any more that rock is jazz.", 
   {}, 
   395258, 
   null, 
   1268954280.0
  ], 
  [
   395264, 
   null, 
   "gansao", 
   "Yanks love ABBA, too. Probably the greatest pop group ever. Rock however, not so much. Nothing against pop, its just not rock any more that rock is jazz.\n\n \n Did they like them in the 70s Jito?", 
   {}, 
   395261, 
   null, 
   1268954700.0
  ], 
  [
   395289, 
   null, 
   "Esdraelon", 
   "Did they like them in the 70s Jito?\n\n \n I liked them in the 70's, more though in the 80's, although their popularity came late overall. \n Their harmonics and voices were awesome!", 
   {}, 
   395264, 
   null, 
   1268968860.0
  ], 
  [
   395374, 
   null, 
   "Easyrider", 
   "ABBA never really took off in the States I believe.\n We love them in Europe.\n They remind me of my youthemoticon_xlove\n\n \n ABBA is my all-time favorite group. Great sound. I have them on my iPod and with their songs I have one other song that sounds like them. That other song is \"Bright Eyes\" by the Brotherhood of Man. I think it's on iTunes.\n \n I never saw them in person. People said their studio music was richer and fuller because they 'layered' their vocals during their recordings. So in person they didn't sound as rich. But their recordings are awesome.", 
   {}, 
   395258, 
   null, 
   1269041160.0
  ], 
  [
   395439, 
   null, 
   "gansao", 
   "EZ and Jito agreeing on something thenemoticon_xgood", 
   {}, 
   395374, 
   null, 
   1269127440.0
  ], 
  [
   395983, 
   null, 
   "Easyrider", 
   "An ABBA reunion concert perhaps?\n \n The Way Old Friends Do? Abba offer hope to new generation of fans with reunion hint - Times Online\n \n The article says they previously turned down a $1 BILLION tour.\n \n \n As an aside, they have a number of their songs, etc., on YouTube. It's interesting to see their costumes, etc. Those girls could sing.", 
   {}, 
   395439, 
   null, 
   1269574080.0
  ], 
  [
   395990, 
   null, 
   "jitobear", 
   "Were you all dead in the 70s? Abba were huge in the US?\n \n To Easy's post - - \n \n Recrdings always sound better -\n \n But live, well nothing beats that energy.\n \n \n To me and Easy agreeing....\n Its hardly difficult to find debate for the big issues. Even Easy and I probably agree on more than we disagree on. I believe this is true for most of human kind. Its just so easy to capatalize on the disagreements.", 
   {}, 
   395983, 
   null, 
   1269585060.0
  ], 
  [
   396074, 
   null, 
   "gansao", 
   "Were you all dead in the 70s? Abba were huge in the US?\n \n To Easy's post - - \n \n Recrdings always sound better -\n \n But live, well nothing beats that energy.\n \n \n To me and Easy agreeing....\n Its hardly difficult to find debate for the big issues. Even Easy and I probably agree on more than we disagree on. I believe this is true for most of human kind. Its just so easy to capatalize on the disagreements.\n\n \n I was not dead in the 70s but I was not living in the States.\n I was under the impression that Abba was not successful in the States but did not have the advantage of the world wide web to ask my American cousins if this was the case.I could not afford to fly over there either.\n \n I was also under the impression that Diana Ross was not popular in South America maybe Winston will read this post one day and tell me I was dead in the 70s and 80s.", 
   {}, 
   395990, 
   null, 
   1269640920.0
  ], 
  [
   396141, 
   null, 
   "jitobear", 
   "I was not dead in the 70s but I was not living in the States.\n I was under the impression that Abba was not successful in the States but did not have the advantage of the world wide web to ask my American cousins if this was the case.I could not afford to fly over there either.\n \n I was also under the impression that Diana Ross was not popular in South America maybe Winston will read this post one day and tell me I was dead in the 70s and 80s.\n\n \n Sorry - no insult intended but I remember Abba being huge and me foaming at the mouth for the albums...", 
   {}, 
   396074, 
   null, 
   1269711120.0
  ], 
  [
   396147, 
   null, 
   "snakespit", 
   "ABBA gets in, but bands like Journey and Rush still sit on the sidelines? What a joke.", 
   {}, 
   396141, 
   null, 
   1269717720.0
  ], 
  [
   396201, 
   null, 
   "jitobear", 
   "ABBA gets in, but bands like Journey and Rush still sit on the sidelines? What a joke.\n\n \n I would agree. At least about Rush.... ;)\n \n There is no question that Rush is ten million times more ROCK than Abba. OK - even Journey is.\n \n Abba is a great POP group.", 
   {}, 
   396147, 
   null, 
   1269760440.0
  ], 
  [
   396281, 
   null, 
   "snakespit", 
   "I would agree. At least about Rush.... ;)\n \n There is no question that Rush is ten million times more ROCK than Abba. OK - even Journey is.\n \n Abba is a great POP group.\n\n \n The original intent of the R&RHOF was to honor groups that have been most influential in the shaping and direction of rock. ABBA really isn't even rock, and certainly has had very little influence on the style of music known as rock. A general \"Music Hall of Fame\"...perhaps. But putting ABBA into the R&RHOF simply cheapens what little was left of the honor of getting inducted. Personally, I think the Sex Pistols had it right.", 
   {}, 
   396201, 
   null, 
   1269834000.0
  ], 
  [
   396299, 
   null, 
   "Winston Smith", 
   "I was not dead in the 70s but I was not living in the States.\n I was under the impression that Abba was not successful in the States but did not have the advantage of the world wide web to ask my American cousins if this was the case.I could not afford to fly over there either.\n \n I was also under the impression that Diana Ross was not popular in South America maybe Winston will read this post one day and tell me I was dead in the 70s and 80s.\n\n \n if brain activity is needed to be alive, you are stiill dead, gansao\n \n by the way what do you know about South America to have any \"impressions\" about what is/was popular there and then ?", 
   {}, 
   396074, 
   null, 
   1269873060.0
  ], 
  [
   396300, 
   null, 
   "Winston Smith", 
   "The original intent of the R&RHOF was to honor groups that have been most influential in the shaping and direction of rock. ABBA really isn't even rock, and certainly has had very little influence on the style of music known as rock. A general \"Music Hall of Fame\"...perhaps. But putting ABBA into the R&RHOF simply cheapens what little was left of the honor of getting inducted. Personally, I think the Sex Pistols had it right.\n\n \n is Mozart in the Classical Music Hall of Fame ? :p", 
   {}, 
   396281, 
   null, 
   1269873720.0
  ], 
  [
   396326, 
   null, 
   "gansao", 
   "if brain activity is needed to be alive, you are stiill dead, gansao\n \n by the way what do you know about South America to have any \"impressions\" about what is/was popular there and then ?\n\n \n You dont have to know anything about South America to read that Diana Ross was not popular there.\n If that chip fell off your shoulder your life would lose its purpose amigo:p", 
   {}, 
   396299, 
   null, 
   1269893760.0
  ], 
  [
   396388, 
   null, 
   "Winston Smith", 
   "I like some of Diana Ross songs and also some of The Supremes songs and I am from South America\n \n I don't know what you read gansao? unless Fox News comes with subtitles what I doubt for Fox news watchers can't read.", 
   {}, 
   396326, 
   null, 
   1269922860.0
  ], 
  [
   396466, 
   null, 
   "gansao", 
   "I like some of Diana Ross songs and also some of The Supremes songs and I am from South America\n \n I don't know what you read gansao? unless Fox News comes with subtitles what I doubt for Fox news watchers can't read.\n\n \n Good for you Winston but one South American living in Australia does not make a great deal of difference to Diana Ross's success in the whole of South America.emoticon_xdonno\n Dont get hung up on it ....it was an aside to Jito's remark and believe it or not there was a small amount of levity intended..so you can get back into the box( You were the only South American on this forum so I mentioned you , seems to have pulled your chain somehow)\n I never watch Fox news.I watch BBC news or ITN..;)\n You will find that some news programmes have sub titles but for anyone but the deaf they are useless because they are way out of synch...I'll let you tell me why:)", 
   {}, 
   396388, 
   null, 
   1269970560.0
  ], 
  [
   396530, 
   null, 
   "Winston Smith", 
   "gansao:\n \n you are all levity :)", 
   {}, 
   396466, 
   null, 
   1270000200.0
  ], 
  [
   396584, 
   null, 
   "gansao", 
   "gansao:\n \n you are all levity :)\n\n \n Muchas gracias ameobaemoticon_xagree", 
   {}, 
   396530, 
   null, 
   1270065600.0
  ], 
  [
   410387, 
   null, 
   "Didymus", 
   "Great to hear. I always liked ABBA.\n \n emoticon_smile", 
   {}, 
   396299, 
   null, 
   1282473360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ABBA inducted into Rock n Roll Hall Of Fame", 
  "url": "http://www.4forums.com/political/entertainment-debates/14037-abba-inducted-into-rock-n-roll-hall-fame.html", 
  "breadcrumbs": [
   "Entertainment"
  ], 
  "id_number": 14037, 
  "discussion_files": [
   [
    "3817.html", 
    "http://www.4forums.com/political/entertainment-debates/14037-abba-inducted-into-rock-n-roll-hall-fame-print.html"
   ], 
   [
    "3818.html", 
    "http://www.4forums.com/political/entertainment-debates/14037-abba-inducted-into-rock-n-roll-hall-fame-2-print.html"
   ]
  ], 
  "identifier": 14037
 }
]