[
 [
  [
   396078, 
   null, 
   "COBHC", 
   "Quite a few people on here go out of their way to imply that conservatives are racist. The main culprit is one woman in particular, I'm sure you all know who I'm talking about. Unlike the person I'm talking to in this thread, I'm not implying that everyone who disagrees with me are racists and I don't think these quotes say anything about leftists in general.\n \n Against Blacks\n \n \nSome junior high nigger kicked Steve's XXX while he was trying to help his brothers out; junior high or sophomore in high school. Whatever it was, Steve had the nigger down. However it was, it was Steve's fault. He had the nigger down, he let him up. The nigger blindsided him.\n\n \n \nIs you their black-haired answer-mammy who be smart? Does they like how you shine their shoes, Condoleezza? Or the way you wash and park the whitey's cars?\n\n \n \nBlacks and Hispanics are too busy eating watermelons and tacos to learn how to read and write.\n \n (Funny, aren't white supremacists criticized all the time for this exact same ideology?)\n \n\n \n Black on Black\n \n \nIn the days of slavery, there were those slaves who lived on the plantation and [there] were those slaves that lived in the house. You got the privilege of living in the house if you served the master ... exactly the way the master intended to have you serve him. Colin Powell's committed to come into the house of the master. When Colin Powell dares to suggest something other than what the master wants to hear, he will be turned back out to pasture.\n\n \n \nA handkerchief-head, chicken-and-biscuit-eating Uncle Tom. (on Clarence Thomas)\n\n \n \nHe's married to a white woman. He wants to be white. He wants a colorless society. He has no ethnic pride. He doesn't want to be black.\n\n \n Against Jews\n \n \nYou f***ing Jew b******. (to Paul Fray)\n\n \n \nThe Jews don't like Farrakhan, so they call me Hitler. Well, that's a good name. Hitler was a very great man. He rose Germany up from the ashes.\n\n \n \nJews &#8212; that's J-E-W-S. (explaining why he thinks his daughter, Cynthia lost)\n\n \n Against Whites\n \n \nI want to go up to the closest white person and say: 'You can't understand this, it's a black thing' and then slap him, just for my mental health.\n\n \n \nCivil rights laws were not passed to protect the rights of white men and do not apply to them. (who made her the Chairwoman? emoticon_frazzled)\n\n \n \nThere are white niggers. I've seen a lot of white niggers in my time.\n\n \n \nThe white man is our mortal enemy, and we cannot accept him. I will fight to see that vicious beast go down into the lake of fire prepared for him from the beginning, that he never rise again to give any innocent black man, woman or child the hell that he has delighted in pouring on us for 400 years.\n\n \n \nWe have lost to the white racist press and to the racist reactionary Jewish misleaders.\n\n \n \nThere's no great, white bigot; there's just about 200 million little white bigots out there.\n\n \n \nThe white race is the cancer of human history.\n\n \n http://rightwingnews.com/quotes/leftwingracists.php", 
   {
    "post_info": {
     "post_title": "Leftists can be racist, too."
    }
   }, 
   null, 
   null, 
   1269642180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Leftists can be racist, too.", 
  "url": "http://www.4forums.com/political/politics-debates/14076-leftists-can-racist-too.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 14076, 
  "discussion_files": [
   [
    "17508.html", 
    "http://www.4forums.com/political/politics-debates/14076-leftists-can-racist-too-print.html"
   ]
  ], 
  "identifier": 14076
 }
]