[
 [
  [
   396429, 
   null, 
   "MarieAntoinette", 
   "Glad to see the federal government doing their job! \n \n \nAt least seven people, including some from Michigan, have been arrested in raids by a FBI-led Joint Terrorism Task Force in Michigan, Ohio and Indiana as part of an investigation into an Adrian-based Christian militia group, a person familiar with the matter said.\n \n The suspects are expected to make an initial appearance in U.S. District Court in Detroit on Monday.\n \n On Sunday, a source close to the investigation in Washington, D.C. confirmed that FBI agents were conducting activities in Washtenaw and Lenawee counties over the weekend in connection to Hutaree, a Christian militia group. Detroit FBI Special Agent Sandra Berchtold told The Detroit News the federal warrants in the case are under court seal and declined further comment.\n \n Sources have said the FBI was in the second day of raids around the southeastern Michigan city of Adrian that are connected to a militia group, known as the Hutaree, an Adrian-based group whose members describe themselves as Christian soldiers preparing for the arrival and battle with the anti-Christ.\n \n WXYZ-TV reports that helicopters were spotted in the sky for much of Saturday night, and agents set up checkpoints throughout the area. Witnesses told the station that it was like a small army had descended on the area. The Department of Homeland Security and the Joint Terrorism Task Force are also involved in the raids.\n \n Mike Lackomar, of Michiganmilitia.com, said both The Southeast Michigan Volunteer Militia and the Michiganmilitia.com were not a part of the raid.\n \n Lackomar said he heard from other militia members that the FBI targeted the Hutaree after its members made threats of violence against Islamic organizations.\n \n \"Last night and into today the FBI conducted a raid against homes belonging to the Hutaree. They are a religious cult. They are not part of our militia community,\" he said.\n \n Lackomar said he was told there were five arrests Saturday and another five early Sunday. The FBI declined to comment.\n \n One of the Hutaree members called a Michigan militia leader for assistance Saturday after federal agents had already began their raid, Lackomar said, but the militia member -- who is of Islamic decent and had heard about the threats -- declined to offer help. That Michigan militia leader is now working with federal officials to provide information on the Hutaree member for the investigation, Lackomar said Sunday.\n \n \"They are more of survivalist group and in an emergency they withdraw and stand their ground. They are actively training to be alongside Jesus,\" he said.\n \n Sources from the Michigan militia community said one of the FBI raids took place Saturday during a wake for a Hutaree member who had died of natural causes. A Hutaree leader was arrested during the wake while at the same time agents were conducting raids at other locations.\n \n The Associated Press is reporting that FBI spokesman Scott Wilson in Cleveland said agents arrested two people Saturday in northwest Ohio. A third arrest was made in Illinois on Sunday, a day after raids in northwest Indiana.\n \n Dawud Walid, executive director of the Council on Islamic-American Relations of Michigan, made an announcement Sunday during the group's 10th anniversary banquet about receiving a call from a network journalist about the alleged threat against Muslims.\n \n \"Don't allow this news to scare you away from practicing your faith,\" said Walid.\n \n Audible gaps were heard throughout the banquet hall when the news was announced. Walid said he will call local authorities about more information on the allegations. He urged local Muslims to recommitt themselves to their faith in light of the accusations.\n \n From The Detroit News: \n Seven arrested in FBI raids linked to Christian militia group | detnews.com | The Detroit News \n \n\n \n \n Archie, is that you in the article, cooperating with the authorities?\n \n Ethmi, Did you select the heavy metal piece for the promotional video at their website?\n \n HUTAREE.COM\n \n --------------\n \n These \"Christian\" \"Jesus-led\" terrorists need to be smoked out and Fed X'd up the river!", 
   {
    "post_info": {
     "post_title": "Feds Crack Down On Christian Militia Groups"
    }
   }, 
   null, 
   null, 
   1269960240.0
  ], 
  [
   396430, 
   null, 
   "Steeeeve", 
   "Are you suggesting Archie and Ethmi are \"christian\" terrorists?", 
   {}, 
   396429, 
   null, 
   1269960540.0
  ], 
  [
   396475, 
   null, 
   "chester", 
   "Are you suggesting Archie and Ethmi are \"christian\" terrorists?\n\n \n Perish the thought.\n \n So are they both, both HONORABLE men.;)", 
   {}, 
   396430, 
   null, 
   1269972060.0
  ], 
  [
   396509, 
   null, 
   "COBHC", 
   "Personally attacking people who haven't even showed up on this thread? Marie, Chester, you're both douchebags.", 
   {}, 
   396475, 
   null, 
   1269982560.0
  ], 
  [
   396513, 
   null, 
   "Easyrider", 
   "\n Archie, is that you in the article, cooperating with the authorities?\n \n \n\n \n Nope, that's not Archie. That's just another stiff-necked infidel who doesn't know the Scriptures (one of your clan, no doubt).", 
   {}, 
   396429, 
   null, 
   1269986460.0
  ], 
  [
   396540, 
   null, 
   "Archangel", 
   "Glad to see the federal government doing their job! \n \n Archie, is that you in the article, cooperating with the authorities?\n \n Ethmi, Did you select the heavy metal piece for the promotional video at their website?\n \n HUTAREE.COM\n \n --------------\n \n These \"Christian\" \"Jesus-led\" terrorists need to be smoked out and Fed X'd up the river!\n\n \n Point #1 is that the title of this thread is a complete lie since this is the first story of a christian based terrorist group I have ever read about in the USA, yet you must imply that the, and I quote:  Feds Crack Down On Christian Militia Groups ie a plural reference, as if there are many of them. \n \n Point #2, by what standard of rationale do you attempt to indict me or Ethmi as having any association with these people? Can you post any quotes of us endorsing violence against anyone at all? Please do, or run away from yet another bogus and baiting thread which clarifies nothing more than your irrational hatred for people who promote traditional morality and values. That you see us as evil is so telling and revealing as to how twisted and perverse your world view is in reality.\n \n \nPersonally attacking people who haven't even showed up on this thread? Marie, Chester, you're both douchebags.\n\n \n Hang around my friend, this is SOP for these philosophical cowards on the Left. Until they get a PM of course telling them not to respond to me in the hope of freezing me out. This coward actually thinks I don't know what's going on and that he can defeat me without actually debating me. This is the reason for telling people not to respond to me. A real positive tactic for a debate forum as it exposes the mentality of the leftist that they support free speech for \"EVERYONE\" as long as everyone agrees with them.", 
   {}, 
   396509, 
   null, 
   1270024200.0
  ], 
  [
   396543, 
   null, 
   "Winston Smith", 
   "The Lord's wrath will descend on Antonia and her offspring for ever and ever until the end time and beyond into an eternity in hell among other atheist heathens islamo-facist-marxist-liberal democrats-anti-gun pinko commies.\n \n Amen. emoticon_xangel", 
   {}, 
   396540, 
   null, 
   1270025280.0
  ], 
  [
   396559, 
   null, 
   "Archangel", 
   "The Lord's wrath will descend on Antonia and her offspring for ever and ever until the end time and beyond into an eternity in hell among other atheist heathens islamo-facist-marxist-liberal democrats-anti-gun pinko commies.\n \n Amen. emoticon_xangel\n\n \n Leave it to the atheist hypocrite to bring the threat of an angry God into every discussion. :xbanghead", 
   {}, 
   396543, 
   null, 
   1270048680.0
  ], 
  [
   396623, 
   null, 
   "Easyrider", 
   "Leave it to the atheist hypocrite to bring the threat of an angry God into every discussion.\n\n \n Well, tomorrow is their day. \n \n The Bible says, The fool says in his heart, \"There is no God.\" \n \n So God made a holiday for these stiff-necked people - April Fool's Day.\n \n Happy April Fool's Day, atheists!\n \n emoticon_xbouncer", 
   {
    "unicode_changes_made": true
   }, 
   396559, 
   null, 
   1270086360.0
  ], 
  [
   396631, 
   null, 
   "MarieAntoinette", 
   "The Lord's wrath will descend on Antonia and her offspring for ever and ever until the end time and beyond into an eternity in hell among other atheist heathens islamo-facist-marxist-liberal democrats-anti-gun pinko commies.\n \n Amen. emoticon_xangel\n\n \n emoticon_cry\n \n YouTube - When You're Evil Sing-Along\n \n emoticon_xhoho", 
   {}, 
   396543, 
   null, 
   1270092960.0
  ], 
  [
   396638, 
   null, 
   "NATO 556", 
   "Marie-\n \n Have you any proof that Christians are really bad people?\n \n Afterall it's not the Christian church currently in the spotlight for going out of its way to cover up reports of the sexual abuse of children by priests.", 
   {}, 
   396631, 
   null, 
   1270099080.0
  ], 
  [
   396646, 
   null, 
   "Winston Smith", 
   "what happens to a Christian millenialist fundamentalist who thinks that Argamedon is nigh, and the Anti-Christ is Obama, when he or she gets access to guns ?\n \n Answer: s(he) forms or joins a Christian militia and declares war on the governmemt.\n \n Now the funny thing is that Christian fundamentalists bent in destroying the government are called a Christian militia, whereas Islamic fundamentalists bent in destroying the government are called \"terrorists\", why is this so?\n \n Now, beware of this simple equation\n \n Archie is a Christian fundamentalist + he packs a gun = ?\n \n I don't know, you do the sum.\n \n :)", 
   {
    "post_info": {
     "post_title": "though experiment"
    }
   }, 
   396638, 
   null, 
   1270108560.0
  ], 
  [
   396647, 
   null, 
   "COBHC", 
   "what happens to a Christian millenialist fundamentalist who thinks that Argamedon is nigh, and the Anti-Christ is Obama, when she or she gets access to guns ?\n \n Answer: s(he) forms or joins a Christian militia and declares war on the governmemt.\n \n Now the funny thing is that Christian fundamentalists bent in destroying the government are called a Christian militia, whereas Islamic fundamentalists bent in destroying the government are called \"terrorists\", why is this so?\n \n Now, beware of this simple equation\n \n Archie is a Christian fundamentalist + he packs a gun = ?\n \n I don't know, you do the sum.\n \n :)\n\n \n You're very quick to make asinine assumptions about anyone who thinks differently than you.", 
   {}, 
   396646, 
   null, 
   1270108800.0
  ], 
  [
   396650, 
   null, 
   "Archangel", 
   "what happens to a Christian millenialist fundamentalist who thinks that Argamedon is nigh, and the Anti-Christ is Obama, when she or she gets access to guns ?\n \n Answer: s(he) forms or joins a Christian militia and declares war on the governmemt.\n \n Now the funny thing is that Christian fundamentalists bent in destroying the government are called a Christian militia, whereas Islamic fundamentalists bent in destroying the government are called \"terrorists\", why is this so?\n \n Now, beware of this simple equation\n \n Archie is a Christian fundamentalist + he packs a gun = ?\n \n I don't know, you do the sum.\n \n :)\n\n \n I almost didn't bother responding to this since it's just winny the troll making outrageous and ill-considered/irrational claims, but then figured it was necessary to blow his irrational thought processes apart. First of all, since you have targeted me specifically in your libelous rant; I have never been a member of any type of armed group where gun ownership was a necessary part of membership. \n \n Secondly, I have owned firearms since the mid 70s and have never used them for violence toward any human being, nor have I abused said ownership in any way that was anti-social. \n \n Thirdly, I have never supported or endorsed declaring war on my Government or anyone else because my God says to pray for my enemies, not to shoot them. This is what separates we christian fundys from islamic fundys who believe that anyone who disagrees with them MUST die. Nice job proving that slander is your only agenda here though, rather than accurately portraying those with whom you disagree. emoticon_xgood", 
   {}, 
   396646, 
   null, 
   1270119120.0
  ], 
  [
   396651, 
   null, 
   "Winston Smith", 
   "emoticon_cry\n \n YouTube - When You're Evil Sing-Along\n \n emoticon_xhoho\n\n \n one man's hell is another man's heaven.\n \n emoticon_xangel", 
   {}, 
   396631, 
   null, 
   1270119240.0
  ], 
  [
   396655, 
   null, 
   "Winston Smith", 
   "I almost didn't bother responding to this since it's just winny the troll making outrageous and ill-considered/irrational claims, but then figured it was necessary to blow his irrational thought processes apart. First of all, since you have targeted me specifically in your libelous rant; \n\n \n First of all I like the \"targeted me\". Nice pun\n \n \nI have never been a member of any type of armed group where gun ownership was a necessary part of membership.\n\n \n Have you ever been a member of any type of armed group where gun ownership was not a necessary part of membership?\n \n By the way, have you ever known of any armed group without guns ? emoticon_confused\n \n \n I have never supported or endorsed declaring war on my Government or anyone else because my God says to pray for my enemies, not to shoot them. emoticon_xgood\n\n \n So, if I understand the above correctly, if an 'enemy' attacks you, your reaction, defense if you will, will be to pray for him, right?\n \n Then, what do you need emoticon_xkill for? \n \n Thanks for your candor. I can see you have nothing to hide and your conscience is clear\n \n I realize also, reading your carefully worded defensive post, that you have your answers ready in case the FBI one day comes knocking at your door. Good on you, pilgrim emoticon_xangel", 
   {}, 
   396650, 
   null, 
   1270122600.0
  ], 
  [
   396657, 
   null, 
   "Winston Smith", 
   "Leave it to the atheist hypocrite to bring the threat of an angry God into every discussion. :xbanghead\n\n \n I may be an atheist, but I believe in God, just in case emoticon_xangel", 
   {}, 
   396559, 
   null, 
   1270122720.0
  ], 
  [
   396658, 
   null, 
   "Winston Smith", 
   "Are you suggesting Archie and Ethmi are \"christian\" terrorists?\n\n \n All Christians are good\n \n Some terrorists are Christians\n \n Therefore, all Christian terrorists are good", 
   {
    "post_info": {
     "post_title": "Holy silogism"
    }
   }, 
   396430, 
   null, 
   1270123020.0
  ], 
  [
   396659, 
   null, 
   "Winston Smith", 
   "Well, tomorrow is their day. \n \n The Bible says, The fool says in his heart, \"There is no God.\" \n \n So God made a holiday for these stiff-necked people - April Fool's Day.\n \n Happy April Fool's Day, atheists!\n \n emoticon_xbouncer\n\n \n so conversion to your faith, whatever it may be, cures a stiff neck ?\n \n are priests chiropractors ? emoticon_xangel", 
   {
    "unicode_changes_made": true
   }, 
   396623, 
   null, 
   1270123920.0
  ], 
  [
   396663, 
   null, 
   "Winston Smith", 
   "Leave it to the atheist hypocrite to bring the threat of an angry God into every discussion. :xbanghead\n\n \n Not because I don't believe in God, it means He doesn't exist.", 
   {}, 
   396559, 
   null, 
   1270125480.0
  ], 
  [
   396675, 
   null, 
   "NATO 556", 
   "Now the funny thing is that Christian fundamentalists bent in destroying the government are called a Christian militia, whereas Islamic fundamentalists bent in destroying the government are called \"terrorists\", why is this so?\n\n \n We don't declare war on the government. We just respond to the declaration of war that the government issued to us.\n \n We also don't advocate violence as an answer or blow up little kids and old people in crowded markets.\n \n Owning guns and being part of a militia group is no indication of being dangerous.\n \n The real terrorists are the ones who support government being expanded and allowed to take over more and more facets of life.\n \n Is there any reason for the government to be making decisions over what snack foods you're allowed to eat, and if you should be paying a sin tax for buying it?", 
   {}, 
   396646, 
   null, 
   1270131960.0
  ], 
  [
   396679, 
   null, 
   "JPSartre12", 
   "Perish the thought.\n \n So are they both, both HONORABLE men.;)\n\n \n Very clevel Chester. I wonder how many people failed to catch the Julius Caesar reference. ;)", 
   {}, 
   396475, 
   null, 
   1270133100.0
  ], 
  [
   396680, 
   null, 
   "Peeling", 
   "Is there any reason for the government to be making decisions over what snack foods you're allowed to eat, and if you should be paying a sin tax for buying it?\n\n \n If the government incurs costs as a consequence of unhealthy snacking (for instance through state-funded healthcare provision), yes.\n \n That's not an argument for or against state-funded healthcare, by the way; I'm just pointing out a conditional justification.", 
   {}, 
   396675, 
   null, 
   1270133340.0
  ], 
  [
   396682, 
   null, 
   "JPSartre12", 
   "If the government incurs costs as a consequence of unhealthy snacking (for instance through state-funded healthcare provision), yes.\n \n That's not an argument for or against state-funded healthcare, by the way; I'm just pointing out a conditional justification.\n\n \n That's the same type of thinking that brought us Prohibition. Nanny government taken to its ultimate level is a totalitarian state.", 
   {}, 
   396680, 
   null, 
   1270134240.0
  ], 
  [
   396685, 
   null, 
   "NATO 556", 
   "If the government incurs costs as a consequence of unhealthy snacking (for instance through state-funded healthcare provision), yes.\n\n \n Care to explain to the class how exactly that fits into one of the three specific duties the government is charged with?", 
   {}, 
   396680, 
   null, 
   1270136520.0
  ], 
  [
   396688, 
   null, 
   "JPSartre12", 
   "Care to explain to the class how exactly that fits into one of the three specific duties the government is charged with?\n\n \n I'd like to see that one myself. ;)", 
   {}, 
   396685, 
   null, 
   1270137300.0
  ], 
  [
   396690, 
   null, 
   "Steeeeve", 
   "If the government incurs costs as a consequence of unhealthy snacking (for instance through state-funded healthcare provision), yes.\n \n That's not an argument for or against state-funded healthcare, by the way; I'm just pointing out a conditional justification.\n\n \n The problem with state-funded healthcare is the problem you have with anything that is paid for by one person; you don't know what is best. \n \n For example, how much should a dairy farmer charge for a gallon of milk? Right now he looks at what everyone else is charging and adjusts accordingly. If less milk exists he can charge more. Basically the market maximizes the charge acceptable by the buyers. Now what happens if the state is the only buyer of milk? If the state says \"we will pay $5\" then you either get $5 or you get nothing. Furthermore, the state has no basis on which to come up with $5 since the market is only them. The state might come up with some formula that takes estimated costs plus a pre-determined profit margin. This doesn't help when circumstances change though. Like say slaughtering cows makes the farmer more money so instead of milking they make them steaks (I know you don't do that with dairy cows but whatever). Now you have a milk shortage since demand for milk was the same but less supply existed yet pricing never changed thanks to a formula. The opposite could occur too. You could pay too much and thus have too much milk. The best thing about a free market is you always get a price that reflects what people are willing. to pay and everything adapts automatically. The down side is, this leaves some people without milk. \n \n Anyway, my point is the down side with state-funded healthcare is that prices are much harder to pinpoint and healthcare can suffer or be too expensive as a result. Expand this globally and there is some evidence to suggest that it works if somebody out there has a market rate for the other governments to look at. The US might be the market guideline and countries can adjust accordingly. If that is gone then who knows....but this is just a theory.", 
   {}, 
   396680, 
   null, 
   1270142580.0
  ], 
  [
   396721, 
   null, 
   "simone", 
   "Marie-\n \n Have you any proof that Christians are really bad people?\n \n Afterall it's not the Christian church currently in the spotlight for going out of its way to cover up reports of the sexual abuse of children by priests.\n\n The current rather hellish situation the Vatican now faces does come to mind.", 
   {}, 
   396638, 
   null, 
   1270151340.0
  ], 
  [
   396727, 
   null, 
   "NATO 556", 
   "The current rather hellish situation the Vatican now faces does come to mind.\n\n \n They deserve to be facing a hellish situation right now. They went out of their way to cover up any incident of child abuse and molestation that their priests committed, shielding the offenders from the law and moving them to areas where nobody knew them, leaving them free to offend again.\n \n The Catholic church had two real options available to them: step up and deal with the problem, or step aside and let the authorities handle it. Instead they did neither of those. What they did was hide the fact that a problem existed and let it fester and grow like a malignant tumor, to the point they're at now.", 
   {}, 
   396721, 
   null, 
   1270152660.0
  ], 
  [
   396775, 
   null, 
   "MarieAntoinette", 
   "The best thing about a free market is you always get a price that reflects what people are willing. to pay and everything adapts automatically. The down side is, this leaves some people without milk.\n\n \n Yeah, well, when it comes to health care (which is a human right), on the down side, this leaves 45,000 Americans per year, d.e.a.d.", 
   {}, 
   396690, 
   null, 
   1270163160.0
  ], 
  [
   396779, 
   null, 
   "NATO 556", 
   "Yeah, well, when it comes to health care (which is a human right), on the down side, this leaves 45,000 Americans per year, d.e.a.d.\n\n \n Health care isn't a right, it's a privilege. Just like owning a home or a car is a privilege.\n \n Health care also can't be a right of the government can compel you to participate or face punishment for opting out. That would be like the government ordering you to take part in a public rally that you don't support.\n \n Being free from the government randomly searching your home, that's a human right. Being able to see a doctor because your throat hurts and not having to pay for it, that's nothing more than a privilege. It's as simple as that. It's spelled out that you have a right to life, liberty and pursuit of happiness. Nowhere is it specified that you have a right to a long and healthy life.", 
   {}, 
   396775, 
   null, 
   1270164060.0
  ], 
  [
   396785, 
   null, 
   "Steeeeve", 
   "Yeah, well, when it comes to health care (which is a human right), on the down side, this leaves 45,000 Americans per year, d.e.a.d.\n\n \n BS and health care is not a human right.", 
   {}, 
   396775, 
   null, 
   1270165440.0
  ], 
  [
   396860, 
   null, 
   "simone", 
   "BS and health care is not a human right.\n\n Only in advanced cultures.\n \n In primitive societies, health care IS NOT a human right.", 
   {}, 
   396785, 
   null, 
   1270225620.0
  ], 
  [
   396862, 
   null, 
   "simone", 
   "We don't declare war on the government. We just respond to the declaration of war that the government issued to us.\n \n We also don't advocate violence as an answer or blow up little kids and old people in crowded markets.\n \n Owning guns and being part of a militia group is no indication of being dangerous.\n \n The real terrorists are the ones who support government being expanded and allowed to take over more and more facets of life.\n \n Is there any reason for the government to be making decisions over what snack foods you're allowed to eat, and if you should be paying a sin tax for buying it?\n\n You opposed Bush's invasion of Iraq?\n \n I had no ideal!", 
   {}, 
   396675, 
   null, 
   1270225800.0
  ], 
  [
   396865, 
   null, 
   "NATO 556", 
   "Only in advanced cultures.\n\n \n What advanced cultures are you referring to exactly?\n \n Some countries, like Japan, feel it's absolutely necessary to spell out that you have to fact to have a job, move if you desire, or even marry. If they feel the need to say that you have the right to be married, that doesn't sound very much like an advanced culture to me.", 
   {}, 
   396860, 
   null, 
   1270226820.0
  ], 
  [
   396886, 
   null, 
   "Jo Bennett", 
   "Afterall it's not the Christian church currently in the spotlight for going out of its way to cover up reports of the sexual abuse of children by priests.\n\n \n Am I missing some irony here, or are you trying to to deny the faith of half the world's Christians?", 
   {}, 
   396638, 
   null, 
   1270240740.0
  ], 
  [
   396935, 
   null, 
   "NATO 556", 
   "Am I missing some irony here, or are you trying to to deny the faith of half the world's Christians?\n\n \n Just pointing out the fact that you shouldn't be so quick to point and say \"Look at what atrocities the Christians are committing now!\" until you're aware of what other faiths have been up to.\n \n People like you and Simone are so quick and ready to condemn Christians for what a few extremists might do, yet you're not aware of what the entire Catholic faith has been up to.", 
   {}, 
   396886, 
   null, 
   1270266060.0
  ], 
  [
   396954, 
   null, 
   "Steeeeve", 
   "Only in advanced cultures.\n \n In primitive societies, health care IS NOT a human right.\n\n \n Nope, in neither it is a human right...unless you can establish to me where human rights come from and where this is one.", 
   {}, 
   396860, 
   null, 
   1270299360.0
  ], 
  [
   397217, 
   null, 
   "JPSartre12", 
   "The problem with state-funded healthcare is the problem you have with anything that is paid for by one person; you don't know what is best. \n \n For example, how much should a dairy farmer charge for a gallon of milk? Right now he looks at what everyone else is charging and adjusts accordingly. If less milk exists he can charge more. Basically the market maximizes the charge acceptable by the buyers. Now what happens if the state is the only buyer of milk? If the state says \"we will pay $5\" then you either get $5 or you get nothing. Furthermore, the state has no basis on which to come up with $5 since the market is only them. The state might come up with some formula that takes estimated costs plus a pre-determined profit margin. This doesn't help when circumstances change though. Like say slaughtering cows makes the farmer more money so instead of milking they make them steaks (I know you don't do that with dairy cows but whatever). Now you have a milk shortage since demand for milk was the same but less supply existed yet pricing never changed thanks to a formula. The opposite could occur too. You could pay too much and thus have too much milk. The best thing about a free market is you always get a price that reflects what people are willing. to pay and everything adapts automatically. The down side is, this leaves some people without milk. \n \n Anyway, my point is the down side with state-funded healthcare is that prices are much harder to pinpoint and healthcare can suffer or be too expensive as a result. Expand this globally and there is some evidence to suggest that it works if somebody out there has a market rate for the other governments to look at. The US might be the market guideline and countries can adjust accordingly. If that is gone then who knows....but this is just a theory.\n\n \n You might want to rethink your milk example. The price of milk is fixed by the government.\n \n\n ....\n Consumer Level\n Several States regulate either the wholesale or the\n retail prices of fluid milk products, or both. States differ\n in the regulation of resale prices-some set minimum\n prices, some set maximum prices, and some set\n both minimums and maximums. For example,\n Pennsylvania essentially sets minimums at every market\n level for milk produced and marketed in the State.\n Minimum prices are set at a stop-loss level (conditions\n based on the estimated average cost of production),\n and market prices are generally above them. Other\n States, such as Nevada, set prices that retailers must\n pay for milk, but do not restrict the price the retailer\n charges consumers. State milk pricing regulations are\n much less prevalent than they used to be.\n http://www.ers.usda.gov/publications/aib761/aib761c.pdf\n", 
   {
    "unicode_changes_made": true
   }, 
   396690, 
   null, 
   1270482540.0
  ], 
  [
   397219, 
   null, 
   "Steeeeve", 
   "You might want to rethink your milk example. The price of milk is fixed by the government.\n\n \n Missing the point...", 
   {}, 
   397217, 
   null, 
   1270484280.0
  ], 
  [
   397227, 
   null, 
   "gansao", 
   "A respectful question regarding health care.\n If health care should be regarded as a human right, how much resources should be used to up hold that right?\n Anything less than unlimited resources available to each individual would constitute a denial of their human rights.\n This is a big problem in our NHS.\n No matter how much a treatment costs per patient it would be a denial of their rights if were deemed to be TOO costly.", 
   {}, 
   397219, 
   null, 
   1270486200.0
  ], 
  [
   397228, 
   null, 
   "simone", 
   "Primary health care, including basic dental care, optical care, basic health maintenance and education should be available to all.\n \n Obviously, there are not enough resources to sustain life forever and difficult decisions may have to be made where public resources are involved.\n \n Basic health care is a wise investment for a society, it beats the hell out of paying for ER care, or being forced to care for people after they've become seriously ill, especially if such illnesses could have been prevented through availability of basic health care.\n \n To be opposed to having such basic care available for everyone is unforgivable stupidity and unwise use of a nation's resources.", 
   {}, 
   397227, 
   null, 
   1270486740.0
  ], 
  [
   397231, 
   null, 
   "gansao", 
   "Primary health care, including basic dental care, optical care, basic health maintenance and education should be available to all.\n \n Obviously, there are not enough resources to sustain life forever and difficult decisions may have to be made where public resources are involved.\n \n Basic health care is a wise investment for a society, it beats the hell out of paying for ER care, or being forced to care for people after they've become seriously ill, especially if such illnesses could have been prevented through availability of basic health care.\n \n To be opposed to having such basic care available for everyone is unforgivable stupidity and unwise use of a nation's resources.\n\n \n Thank you for that Simone.", 
   {}, 
   397228, 
   null, 
   1270487220.0
  ], 
  [
   397243, 
   null, 
   "Steeeeve", 
   "To be opposed to having such basic care available for everyone is unforgivable stupidity and unwise use of a nation's resources.\nWhy not make this available to the world? Truth is, trying to have the government figure what is \"fair\" is an unwise used of a nation's resources and that is exactly what we are doing.", 
   {}, 
   397228, 
   null, 
   1270495860.0
  ], 
  [
   397304, 
   null, 
   "Peeling", 
   "That's the same type of thinking that brought us Prohibition. Nanny government taken to its ultimate level is a totalitarian state.\n\n \n Anything taken to its 'ultimate level' is generally a bad idea. You can kill yourself just by drinking too much water (and no, I'm not talking about drowning).\n \n Like I said already:\n \n That's not an argument for or against state-funded healthcare, by the way; I'm just pointing out a conditional justification.\n \n \nCare to explain to the class how exactly that fits into one of the three specific duties the government is charged with?\n\n \n Well - just for fun, you understand - say aliens attacked from outer space. They would count as a 'foreign enemy', right? You wouldn't expect the government to stand idly by just because the invaders were a different species. You know, like bacteria and viruses are different species... ;)\n \n Seriously, though, I would have a lot more more sympathy for hard-line free-market thinking if life were a functional meritocracy. But it isn't. Random happenstance plays such a dominant role in all our lives that - in my opinion at least - we owe it to each other to smooth out the bumps.", 
   {}, 
   396685, 
   null, 
   1270541280.0
  ], 
  [
   397306, 
   null, 
   "Symbiote", 
   "Smooth them as much as you want, just don't do it with government.", 
   {}, 
   397304, 
   null, 
   1270546320.0
  ], 
  [
   397310, 
   null, 
   "Peeling", 
   "Smooth them as much as you want, just don't do it with government.\n\n \n Any body with the power to accomplish such a task is de facto 'government'.", 
   {}, 
   397306, 
   null, 
   1270549440.0
  ], 
  [
   397314, 
   null, 
   "JPSartre12", 
   "Primary health care, including basic dental care, optical care, basic health maintenance and education should be available to all.\n\n \n I agree. They should be available to all, just as McDonald's, Target, Walmart, etc. are available to all.............that are capable and willing to pay.\n \n\n Obviously, there are not enough resources to sustain life forever and difficult decisions may have to be made where public resources are involved.\n \n\n What public resources would that be? The private resources confiscated from the wealthiest?\n \n\n Basic health care is a wise investment for a society, it beats the hell out of paying for ER care, or being forced to care for people after they've become seriously ill, especially if such illnesses could have been prevented through availability of basic health care.\n\n \n Your fiscal argument falls flat on its face when you look at reality. LBJ initiated a \"War on Poverty\" in the 60's to eliminate poverty. What was the effect of his war? It bred more poor people. Illegitimacy rates went through the roof and we created another generation of chronically-poor people. Prolonging the life of indigents isn't going to save taxpayers a dime. It will cost them more because the poor's healthcare needs will extend farther into the future and there will be even more of them. \n \n \n\n To be opposed to having such basic care available for everyone is unforgivable stupidity and unwise use of a nation's resources.\n\n You mean an unwise use of OTHER PEOPLE'S resources, don't you? The bills for your altruistic ambitions are borne by others, so it's easy to pontificate on what a civilized nation should do as long as it doesn't impact YOU. If you were TRULY that concerned, you could have given money to indigents and paid for their healthcare any time you felt the need. ............but you didn't, so save the speeches for someone that can't see through the façade. emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   397228, 
   null, 
   1270553220.0
  ], 
  [
   397320, 
   null, 
   "snakespit", 
   "Point #1 is that the title of this thread is a complete lie since this is the first story of a christian based terrorist group I have ever read about in the USA, yet you must imply that the, and I quote:  Feds Crack Down On Christian Militia Groups ie a plural reference, as if there are many of them. \n\n Really Archie? I guess the Klan doesn't count? Or the various others...Army of God, Lambs of Christ, The Order, The New Order, Aryan Nations, Montana Freemen, etc...? \n \n \nPoint #2, by what standard of rationale do you attempt to indict me or Ethmi as having any association with these people? Can you post any quotes of us endorsing violence against anyone at all? Please do, or run away from yet another bogus and baiting thread which clarifies nothing more than your irrational hatred for people who promote traditional morality and values. That you see us as evil is so telling and revealing as to how twisted and perverse your world view is in reality.\n\n Agree. There is no call for that type of personal attack.", 
   {}, 
   396540, 
   null, 
   1270555200.0
  ], 
  [
   397325, 
   null, 
   "Archangel", 
   "Really Archie? I guess the Klan doesn't count? Or the various others...Army of God, Lambs of Christ, The Order, The New Order, Aryan Nations, Montana Freemen, etc...?\n\n \n This is the difference between us snakespit, you will attribute any right wing type group which condones violence and happens to have cultural christians as members to be a christian hate group. I know enough not to attribute these types of groups to our savior, the Lord Jesus as \"Christian Based Groups\" because they don't represent his values or principles in any way at all. And neither does the group which this thread is based upon, for that matter.", 
   {}, 
   397320, 
   null, 
   1270557900.0
  ], 
  [
   397334, 
   null, 
   "Peeling", 
   "I agree. They should be available to all, just as McDonald's, Target, Walmart, etc. are available to all.............that are capable and willing to pay.\n\n \n I would agree too - if the ability to pay were not so profoundly dependent upon luck.", 
   {
    "unicode_changes_made": true
   }, 
   397314, 
   null, 
   1270563840.0
  ], 
  [
   397337, 
   null, 
   "Jo Bennett", 
   "This is the difference between us snakespit, you will attribute any right wing type group which condones violence and happens to have cultural christians as members to be a christian hate group. I know enough not to attribute these types of groups to our savior, the Lord Jesus as \"Christian Based Groups\" because they don't represent his values or principles in any way at all. And neither does the group which this thread is based upon, for that matter.\n\n \n Most of those groups try to claim biblical justification for their beliefs, and similar groups like the BNP in the UK do the same.\n \n In any case, right wing and condoning violence sounds like you to me; I'm pleased that you at least recognise that those views have nothing to do with the values of Jesus Christ.", 
   {}, 
   397325, 
   null, 
   1270567380.0
  ], 
  [
   397346, 
   null, 
   "JPSartre12", 
   "I would agree too - if the ability to pay were not so profoundly dependent upon luck.\n\n \n Funny. My employer never handed me a check and said I was being paid for my luck. emoticon_confused", 
   {}, 
   397334, 
   null, 
   1270574280.0
  ], 
  [
   397350, 
   null, 
   "snakespit", 
   "This is the difference between us snakespit, you will attribute any right wing type group which condones violence and happens to have cultural christians as members to be a christian hate group. I know enough not to attribute these types of groups to our savior, the Lord Jesus as \"Christian Based Groups\" because they don't represent his values or principles in any way at all. And neither does the group which this thread is based upon, for that matter.\n\n \n No, these groups invoke the name of christ as a central theme and use it as a justification for their actions, some more than others albeit. I understand that racism and overt violence are not values taught by christ in the bible. It's the same way many people talk about \"muslim extremists\" or \"muslim terrorists\". In reality, islam teaches peace over violence, much the same as christianity. That does not prevent people from corrupting it to their ends...much the same as many of these \"christian\" groups have.", 
   {}, 
   397325, 
   null, 
   1270577220.0
  ], 
  [
   397363, 
   null, 
   "Symbiote", 
   "Any body with the power to accomplish such a task is de facto 'government'.\n\n \n A government is an entity that maintains a territorial monopoly on violence by using violence against competitors. Unless you want to accomplish your smoothing by violence, there's no reason government should be the institution to do it. And if you do want to accomplish it by violence, you should be prepared for violence to be used against you.", 
   {}, 
   397310, 
   null, 
   1270584960.0
  ], 
  [
   397379, 
   null, 
   "Archangel", 
   " \n Really Archie? I guess the Klan doesn't count? Or the various others...Army of God, Lambs of Christ, The Order, The New Order, Aryan Nations, Montana Freemen, etc...?\n\n \n \n \n This is the difference between us snakespit, you will attribute any right wing type group which condones violence and happens to have cultural christians as members to be a christian hate group. I know enough not to attribute these types of groups to our savior, the Lord Jesus as \"Christian Based Groups\" because they don't represent his values or principles in any way at all. And neither does the group which this thread is based upon, for that matter.\n\n \n \nNo, these groups invoke the name of christ as a central theme and use it as a justification for their actions, some more than others albeit. I understand that racism and overt violence are not values taught by christ in the bible. It's the same way many people talk about \"muslim extremists\" or \"muslim terrorists\". In reality, islam teaches peace over violence, much the same as christianity. That does not prevent people from corrupting it to their ends...much the same as many of these \"christian\" groups have.\n\n \n Got any links that show that these groups cling to an honest and accurate interpretation of the gospel and principles of Christ? Of course you don't, because Jesus never preached anything that can be distorted to support or defend the acts of violence which these groups participate in allegedly. And I say allegedly because you haven't posted any actual accounts of violent acts of any groups at all. You have just named groups and claimed they are both christian and violent, NOW YOU NEED TO ACTUALLY PROVE IT!", 
   {}, 
   397350, 
   null, 
   1270588380.0
  ], 
  [
   397396, 
   null, 
   "Penfold", 
   "From wikipedia. Their Christian beliefs may not match yours, but yours are not mainstream either. They do seem to be prepared to die for them, as did the apostles. (allegedly)\n \n \" The Hutarees claim that an apocalypse is near but has not yet begun and will occur in the future.[6] In one position piece, the Hutaree suggested that Javier Solana, former Secretary General of NATO, and of the Western European Union, may be the Antichrist.[7] According to some sources the group is described as practicing survivalism.[8] Most of the members were active voters with unidentified political party affiliation, though one of them has been identified as a registered Democrat.[9]\n Many videos posted on the Hutaree's website support several right wing organizations, politicians, and news commentators. Their leader, David B. Stone Sr., is \"a Ron Paul fanatic\" according to a former fiancee, and several of their site videos include coverage of congressman Paul.[10] Some of their videos claimed that the aims of the United Nations were hostile to American values and philosophy, and also included unsupported assertions that the UN leadership and the US government were secretly plotting to subvert or destroy their own Charter Documents, namely the US Constitution and the UN's Declaration of Human Rights.\n The Hutaree insignia includes a sword, crossed spears, and the letters CCR which stands for \"Colonial Christian Republic\" .... \"\n \n \n It appears that someone cannot connect the words wikipedia and Hutaree, and asked for a link to be provided. I wonder who might demand evidence then scuttle off to admin with querulous whining when it is supplied?\n \n http://en.wikipedia.org/wiki/Hutaree", 
   {}, 
   397379, 
   null, 
   1270593780.0
  ], 
  [
   397403, 
   null, 
   "Peeling", 
   "Funny. My employer never handed me a check and said I was being paid for my luck. emoticon_confused\n\n I'm sure he hasn't :) But of the events in your life that culminated in your hand being the one in the right place to accept that cheque - and the cheque being there for you to take, for that matter - a sizeable proportion were entirely beyond your or anyone's control. \n \n For obvious reasons we like to believe we have more control over our lives than we really do. The wonderful, rational free market, for example, pays fund managers large sums based on the comforting assumption that their performance is related to personal acumen, when it is readily apparent from statistical analysis that it is not. Most people hailed as business visionaries prove incapable of repeating their successes. Whether a business thrives or fails is very often down to serendipity - or the lack of it. One person can struggle to make ends meet working two full time jobs, while their neighbour becomes an overnight millionaire writing an iphone app that farts on demand.\n \n Allowing everyone to sink or swim on their own merits simply makes no sense in the face of these truths. It's an ideological vision incompatible with reality.", 
   {}, 
   397346, 
   null, 
   1270601460.0
  ], 
  [
   397405, 
   null, 
   "Peeling", 
   "A government is an entity that maintains a territorial monopoly on violence by using violence against competitors.\n\n \n Surely a government is whatever we decide it should be?\n \n In any case, I simply meant that for a body to be capable of achieving the 'smoothing' it would have to be a government.", 
   {}, 
   397363, 
   null, 
   1270602000.0
  ], 
  [
   397406, 
   null, 
   "JPSartre12", 
   "I'm sure he hasn't :) But of the events in your life that culminated in your hand being the one in the right place to accept that cheque - and the cheque being there for you to take, for that matter - a sizeable proportion were entirely beyond your or anyone's control. \n \n For obvious reasons we like to believe we have more control over our lives than we really do. The wonderful, rational free market, for example, pays fund managers large sums based on the comforting assumption that their performance is related to personal acumen, when it is readily apparent from statistical analysis that it is not. Most people hailed as business visionaries prove incapable of repeating their successes. Whether a business thrives or fails is very often down to serendipity - or the lack of it. One person can struggle to make ends meet working two full time jobs, while their neighbour becomes an overnight millionaire writing an iphone app that farts on demand.\n \n Allowing everyone to sink or swim on their own merits simply makes no sense in the face of these truths. It's an ideological vision incompatible with reality.\n\n \n Well, you're wrong. I paid my way through college, majored in something that I knew I could make money doing and took risks like relocating. Add to that several patents, publications and an acknowledged industry-wide expertise in a chemistry niche after 25 years in the field and your concept of \"luck\" doesn't apply.\n IMO, calling someone's hard work to become successful \"luck\" is degrading to those that earned their way in life.", 
   {}, 
   397403, 
   null, 
   1270602480.0
  ], 
  [
   397408, 
   null, 
   "Winston Smith", 
   "said the conceited fool :p", 
   {}, 
   397406, 
   null, 
   1270604280.0
  ], 
  [
   397432, 
   null, 
   "Penfold", 
   "Well, you're wrong. I paid my way through college, majored in something that I knew I could make money doing and took risks like relocating. Add to that several patents, publications and an acknowledged industry-wide expertise in a chemistry niche after 25 years in the field and your concept of \"luck\" doesn't apply.\n IMO, calling someone's hard work to become successful \"luck\" is degrading to those that earned their way in life.\n\n \n You made calculated choices and took risks using the genetic and intellectual inheritance you were born with. All those gambles paid off. You were lucky.", 
   {}, 
   397406, 
   null, 
   1270648320.0
  ], 
  [
   397433, 
   null, 
   "gansao", 
   "You made calculated choices and took risks using the genetic and intellectual inheritance you were born with. All those gambles paid off. You were lucky.\n\n \n So if he sat on his backside and held his hand out because his father did the same he would be unlucky would he?\n Not only that but he would not be able to help it because his genetic and intellectual inheritance dictated that he should!\n It takes a lot of practice to produce this quality of twaddle.\n Does it run in the family?emoticon_xdonno", 
   {}, 
   397432, 
   null, 
   1270649580.0
  ], 
  [
   397436, 
   null, 
   "simone", 
   "You made calculated choices and took risks using the genetic and intellectual inheritance you were born with. All those gambles paid off. You were lucky.\n\n The critical question is:\n \n When did Sartre \"work\" his way through college?", 
   {}, 
   397432, 
   null, 
   1270652820.0
  ], 
  [
   397438, 
   null, 
   "gansao", 
   "The critical question is:\n \n When did Sartre \"work\" his way through college?\n\n \n Are you a 25 stone dockworker?", 
   {}, 
   397436, 
   null, 
   1270652880.0
  ], 
  [
   397440, 
   null, 
   "simone", 
   "Are you a 25 stone dockworker?\n\n No. Once upon a time, even in America, it was possible to work your way through college -- even if you were a waitress.", 
   {}, 
   397438, 
   null, 
   1270653120.0
  ], 
  [
   397442, 
   null, 
   "Jo Bennett", 
   "So if he sat on his backside and held his hand out because his father did the same he would be unlucky would he?\n Not only that but he would not be able to help it because his genetic and intellectual inheritance dictated that he should!\n It takes a lot of practice to produce this quality of twaddle.\n Does it run in the family?emoticon_xdonno\n\n \n Do you not accept that luck has a great deal to do with someone's success. Yes you have to take the opportunities that are offered and do some work, but the lack of millionaires in Zimbabwe tells you that accident of birth has a lot to do with things. Some of the kids I teach can't reliably read, write or count, do you think they'd be able to do calculus if they just worked a bit harder? Talent and ability are not something you can control, they are genetic and environmental, and have massive impacts on your future earning capacity.\n \n I have a masters degree from a good university, and I had to work hard for that, certainly. But I'm very much aware that I didn't have to work all that hard to get through my GCSEs, or my A Levels, with good grades. I look at the blood, sweat and tears that some of my students put into getting qualifications that I strolled through, and I cannot but be aware of my good fortune. I had a stable upbringing, supportive parents, encouragement to read, values and expectations that implied that getting a degree was the normal thing to do. That was sheer chance, an accident of birth which I have done nothing to cause or deserve. To suggest otherwise is absurd.", 
   {}, 
   397433, 
   null, 
   1270654980.0
  ], 
  [
   397444, 
   null, 
   "gansao", 
   "No. Once upon a time, even in America, it was possible to work your way through college -- even if you were a waitress.\n\n \n Went over your head.\n You questioned the honesty of a poster.\n I questioned yours.\n ven if JP was not the person he would have us believe it would not detract from the point he made.\n You just trolled", 
   {}, 
   397440, 
   null, 
   1270655220.0
  ], 
  [
   397445, 
   null, 
   "gansao", 
   "Do you not accept that luck has a great deal to do with someone's success. Yes you have to take the opportunities that are offered and do some work, but the lack of millionaires in Zimbabwe tells you that accident of birth has a lot to do with things. Some of the kids I teach can't reliably read, write or count, do you think they'd be able to do calculus if they just worked a bit harder? Talent and ability are not something you can control, they are genetic and environmental, and have massive impacts on your future earning capacity.\n \n I have a masters degree from a good university, and I had to work hard for that, certainly. But I'm very much aware that I didn't have to work all that hard to get through my GCSEs, or my A Levels, with good grades. I look at the blood, sweat and tears that some of my students put into getting qualifications that I strolled through, and I cannot but be aware of my good fortune. I had a stable upbringing, supportive parents, encouragement to read, values and expectations that implied that getting a degree was the normal thing to do. That was sheer chance, an accident of birth which I have done nothing to cause or deserve. To suggest otherwise is absurd.\n\n \n A few years ago the lefties insisted peoples shortcomings were due to nurture not nature.\n Here we have you insisting the opposite is true.\n Thats why I dont trust the chattering classes.\n Everything they believe is set in stone until it is expedient to think otherwise.\n \n You havent addressed my point..because you cant", 
   {}, 
   397442, 
   null, 
   1270655580.0
  ], 
  [
   397446, 
   null, 
   "simone", 
   "Went over your head.\n You questioned the honesty of a poster.\n I questioned yours.\n ven if JP was not the person he would have us believe it would not detract from the point he made.\n You just trolled\n\n What the devil are you talking about?", 
   {}, 
   397444, 
   null, 
   1270655760.0
  ], 
  [
   397447, 
   null, 
   "gansao", 
   "What the devil are you talking about?\n\n \n You asked if JP 'worked' his way through college when he clearly stated he did.\n It must be difficult for you to cope with such forgetfullness", 
   {}, 
   397446, 
   null, 
   1270656000.0
  ], 
  [
   397453, 
   null, 
   "simone", 
   "I don't doubt that Sartre worked his way through college. But, it is critical to know when he did it.", 
   {}, 
   397447, 
   null, 
   1270657800.0
  ], 
  [
   397454, 
   null, 
   "gansao", 
   "I don't doubt that Sartre worked his way through college. But, it is critical to know when he did it.\n\n \n In that case your post went over MY head...sorry", 
   {}, 
   397453, 
   null, 
   1270658040.0
  ], 
  [
   397480, 
   null, 
   "Jo Bennett", 
   "A few years ago the lefties insisted peoples shortcomings were due to nurture not nature.\n Here we have you insisting the opposite is true.\n Thats why I dont trust the chattering classes.\n Everything they believe is set in stone until it is expedient to think otherwise.\n \n You havent addressed my point..because you cant\n\n \n Read what I said. Nurture is the issue, generally, though genetics have some effect e.g. Down's syndrome, but you don't choose your nurture any more than you choose your nature. As I pointed out I was lucky to have competent, supportive parents, others aren't so lucky. Studies suggest that parental conversation makes a massive difference in the early months of life, and that those whose parents support their development well accelerate over ostensibly more intelligent peers at a very early age, before school starts, and long before you can start expecting the kids to take responsibility for themselves.\n \n I wasn't trying to address the point you were making, at least not in one go. I was asking you a question to ascertain what needed exploring.", 
   {}, 
   397445, 
   null, 
   1270666440.0
  ], 
  [
   397486, 
   null, 
   "gansao", 
   "Read what I said. Nurture is the issue, generally, though genetics have some effect e.g. Down's syndrome, but you don't choose your nurture any more than you choose your nature. As I pointed out I was lucky to have competent, supportive parents, others aren't so lucky. Studies suggest that parental conversation makes a massive difference in the early months of life, and that those whose parents support their development well accelerate over ostensibly more intelligent peers at a very early age, before school starts, and long before you can start expecting the kids to take responsibility for themselves.\n \n I wasn't trying to address the point you were making, at least not in one go. I was asking you a question to ascertain what needed exploring.\n\n \n Your version of luck is nothing without the hard work and effort that it takes to realise your own potential.\n Spouting about unfortunates in Zimbabwe and how he was lucky to have loving parents blah blah just trivialises his achievement.\n Some people are unlucky, some people live in enviroments that make it impossible to realise their potential.\n Your guilt complex should not let people who succeed feel guilty for being successful.", 
   {}, 
   397480, 
   null, 
   1270667760.0
  ], 
  [
   397488, 
   null, 
   "Penfold", 
   "A few years ago the lefties insisted peoples shortcomings were due to nurture not nature.\n Here we have you insisting the opposite is true.\n Thats why I dont trust the chattering classes.\n Everything they believe is set in stone until it is expedient to think otherwise.\n \n You havent addressed my point..because you cant\n\n \n \n False. Nurture or the lack of it can ameliorate or exacerbate what is naturally present, but no-one ever asserted that it could replace nature.", 
   {}, 
   397445, 
   null, 
   1270668060.0
  ], 
  [
   397491, 
   null, 
   "gansao", 
   "False. Nurture or the lack of it can ameliorate or exacerbate what is naturally present, but no-one ever asserted that it could replace nature.\n\n \n Yes they did.\n It was asserted that childrens intellect could be improved to an extremely high level by introducing them to certain stimulii while babies and even in the womb.\n The idea that nature was a significant factor in a childs potential was rejected by psychologists during the 70s and 80s.\n You probably dont remember..dementia is cruel", 
   {}, 
   397488, 
   null, 
   1270668660.0
  ], 
  [
   397496, 
   null, 
   "Jo Bennett", 
   "Your guilt complex should not let people who succeed feel guilty for being successful.\n\n \n It's not guilt. It's an acknowledgment of responsibility associated with the facts of the situation, specifically that people can work extremely hard, many do, and still not get anywhere. Lack of success is not a reliable indicator of lack of effort.", 
   {}, 
   397486, 
   null, 
   1270669560.0
  ], 
  [
   397503, 
   null, 
   "gansao", 
   "It's not guilt. It's an acknowledgment of responsibility associated with the facts of the situation, specifically that people can work extremely hard, many do, and still not get anywhere. Lack of success is not a reliable indicator of lack of effort.\n\n \n True. I take your point.\n I still maintain that to call a hard working capable person lucky because they are successful is to trivialise their success but I must acknowledge that you are right.", 
   {}, 
   397496, 
   null, 
   1270670340.0
  ], 
  [
   397594, 
   null, 
   "simone", 
   "There's also seizing the main chance -- which involves a bit of animal cunning.", 
   {}, 
   397503, 
   null, 
   1270749660.0
  ], 
  [
   397605, 
   null, 
   "NATO 556", 
   "Do you also think Obama was \"lucky\" to become president?", 
   {}, 
   397594, 
   null, 
   1270753440.0
  ], 
  [
   397617, 
   null, 
   "simone", 
   "The man was fairly voted in.\n \n No vote fixing as happened in Ohio in 2004.\n \n No right wing riots to shut down the vote count and other political thuggery in Florida in 2000, not to mention the divine intervention of SCOTUS to proclaim George Walker Bush Supreme Ruler of the U.S.", 
   {}, 
   397605, 
   null, 
   1270758900.0
  ], 
  [
   397621, 
   null, 
   "Steeeeve", 
   "The man was fairly voted in.\n \n No vote fixing as happened in Ohio in 2004.\n \n No right wing riots to shut down the vote count and other political thuggery in Florida in 2000, not to mention the divine intervention of SCOTUS to proclaim George Walker Bush Supreme Ruler of the U.S.\n\n \n It's been almost 10 years...get over the fact that you are wrong and Bush won. Geesh.:xbanghead", 
   {}, 
   397617, 
   null, 
   1270762620.0
  ], 
  [
   397631, 
   null, 
   "Jo Bennett", 
   "Do you also think Obama was \"lucky\" to become president?\n\n \n Luck played a part. Certainly being in the right place at the right time helped, following 8 years of Bush. He was lucky to have a supportive home and a good education that contributed to his development. He also worked pretty hard and made good use of his gifts.", 
   {}, 
   397605, 
   null, 
   1270772340.0
  ], 
  [
   397669, 
   null, 
   "Archangel", 
   "Luck played a part. Certainly being in the right place at the right time helped, following 8 years of Bush. He was lucky to have a supportive home and a good education that contributed to his development. He also worked pretty hard and made good use of his gifts.\n\n \n A good education? From an ignorant and deluded liberals perspective maybe; here's a guy who can't give a speech without a teleprompter and even then, when he has a word \"corpsman,\" which he must read 3 times in the same speech, he pronounces it corpse man all three times. Even hearing himself saying the word wasn't enough for him to self correct. Yeah Jo, he's a mental giant from the perspective of militant leftists who lie to themselves about every important issue facing the world today, so they can also lie about his education and his intelligence. emoticon_xgood", 
   {}, 
   397631, 
   null, 
   1270829520.0
  ], 
  [
   397670, 
   null, 
   "Archangel", 
   "The man was fairly voted in.\n \n No vote fixing as happened in Ohio in 2004.\n \n No right wing riots to shut down the vote count and other political thuggery in Florida in 2000, not to mention the divine intervention of SCOTUS to proclaim George Walker Bush Supreme Ruler of the U.S.\n\n \n LIAR!!! Just check out ACORN and the SEIU's activities during the last election and then say that with a straight face. emoticon_rolleyes", 
   {}, 
   397617, 
   null, 
   1270829700.0
  ], 
  [
   397672, 
   null, 
   "Penfold", 
   "Yes they did.\n It was asserted that childrens intellect could be improved to an extremely high level by introducing them to certain stimulii while babies and even in the womb.\n The idea that nature was a significant factor in a childs potential was rejected by psychologists during the 70s and 80s.\n You probably dont remember..dementia is cruel\n\n \n I recall it perfectly. Keep taking the Aricept. Your original claim that \"lefties\" asserted that nurture could replace nature is as nonsensical as Archies avoidance of the reality of the Hutaree's Christianist roots.", 
   {}, 
   397670, 
   null, 
   1270833960.0
  ], 
  [
   397690, 
   null, 
   "Jo Bennett", 
   "A good education? From an ignorant and deluded liberals perspective maybe; here's a guy who can't give a speech without a teleprompter and even then, when he has a word \"corpsman,\" which he must read 3 times in the same speech, he pronounces it corpse man all three times. Even hearing himself saying the word wasn't enough for him to self correct. Yeah Jo, he's a mental giant from the perspective of militant leftists who lie to themselves about every important issue facing the world today, so they can also lie about his education and his intelligence. emoticon_xgood\n\n \n All major politicians use teleprompters, and I've seen Obama speaking without a teleprompter and while of course he's not quite as fluent, he is still oratorically capable. In any case, public speaking is hardly the best measure of intelligence or education. Being President of Harvard Law Review suggests a respected intellect, and Harvard Law School counts as a good education in anyone's book, especially graduating magna cum laude. Compared to the tortures to which Bush subjected the English language, one uncertainty about pronounciation is pretty small beer.", 
   {}, 
   397669, 
   null, 
   1270855020.0
  ], 
  [
   397693, 
   null, 
   "Archangel", 
   "All major politicians use teleprompters, and I've seen Obama speaking without a teleprompter and while of course he's not quite as fluent, he is still oratorically capable. In any case, public speaking is hardly the best measure of intelligence or education. Being President of Harvard Law Review suggests a respected intellect, and Harvard Law School counts as a good education in anyone's book, especially graduating magna cum laude. Compared to the tortures to which Bush subjected the English language, one uncertainty about pronounciation is pretty small beer.\n\n \n This mor*n uses a teleprompter to give a speech to grammar schoolers, how is that evidence of intelligence? And my example is solid evidence that this mental midget can't even read a word correctly which has a soft p sound in it. And I will give him the benefit of the doubt and allow him to make the mistake the first time since he's in the flow of giving a speech. But when he doesn't catch the error and makes the same mispronunciation 2 more times in the same speech, that is solid evidence of an ignorant poser attempting to pass himself off as intelligent.\n \n Besides, has your messiah ever released these mythological college records Jo? Can you prove he ever accomplished these educational feats based on any real source beside his own claims. The fact is he has refused to release his college transcripts, kinda weird for a magna cum laude who is proud of his accomplishments. So what is he hiding Jo? Can you answer that question? Could it be that he is a poser to the core, from his citizenship to his educational accomplishments? I think that's a distinct possibility. I mean, how many magna cum laude recipients do you know who can't pronounce CORPSMAN properly?\n Obama's Years at Columbia Are a Mystery\n He Graduated Without Honors\n By ROSS GOLDBERG, Special to the Sun | September 2, 2008\n SHARE|PRINT|EMAIL\n Senator Obama's life story, from his humble roots, to his rise to Harvard Law School, to his passion as a community organizer in Chicago, has been at the center of his presidential campaign. But one chapter of the tale remains a blank - his education at Columbia College, a place he rarely speaks about and where few people seem to remember him.\n \n Contributing to the mystery is the fact that nobody knows just how well Mr. Obama, unlike Senator McCain and most other major candidates for the past two elections, performed as a student.\n \n The Obama campaign has refused to release his college transcript, despite an academic career that led him to Harvard Law School and, later, to a lecturing position at the University of Chicago. The shroud surrounding his experience at Columbia contrasts with that of other major party nominees since 2000, all whom have eventually released information about their college performance or seen it leaked to the public.\n \n For better or worse, voters have taken an interest in candidates' grades since 1999, when the New Yorker published President Bush's transcript at Yale and disclosed that he was a C student. Mr. Bush had never portrayed himself as a brain, but many were surprised to learn the next year that his opponent, Vice President Gore, did not do much better at Harvard despite his intellectual image. When Senator Kerry's transcript surfaced, reporters found that he actually had a slightly lower average at Yale than Mr. Bush did.\n \n Some political observers cite such disclosures as proof that candidates' intelligence cannot be judged solely by their political careers or the schools they attended. Grades provide a rare measure of intellect that is immune to political spin, proponents say.\n \n \"We like to pretend IQ doesn't matter, but it really does with a lot of jobs, including the presidency,\" a professor at Smith College who studies the effects of human intelligence on the economy, James Miller, said. \"We can't trust the information that candidates give us, so it's important to look for objective data that they can't falsify or distort.\" Obama's Years at Columbia Are a Mystery - September 2, 2008 - The New York Sun\n \n As you can see from this article, even though sanctimonious leftists like you continue to attack George Bush's intelligence, he scored a higher grade point average than both Gore and Kerry whom you have no qualms at all about claiming their superior intellect to Bush and any other conservatives we hold up for comparison. The fact is that your ilk constantly lies to yourself as you claim the left is ineffectually superior to conservatives when they in fact cling to philosophies and policies which have failed every time they have been attempted.", 
   {
    "unicode_changes_made": true
   }, 
   397690, 
   null, 
   1270857660.0
  ], 
  [
   397750, 
   null, 
   "simone", 
   "It's been almost 10 years...get over the fact that you are wrong and Bush won. Geesh.:xbanghead\n\n I will.\n \n As soon as present-day fools stop snorting about the election of Barack Obama and stop with the stupid racism and ugliness.", 
   {}, 
   397621, 
   null, 
   1270918140.0
  ], 
  [
   397751, 
   null, 
   "simone", 
   "LIAR!!! Just check out ACORN and the SEIU's activities during the last election and then say that with a straight face. emoticon_rolleyes\n\n Just who is the liar?\n \n Tale a look in the mirror, Archie, if it doesn't break, and see who the liar is.", 
   {}, 
   397670, 
   null, 
   1270918200.0
  ], 
  [
   397752, 
   null, 
   "simone", 
   "This mor*n uses a teleprompter to give a speech to grammar schoolers, how is that evidence of intelligence? And my example is solid evidence that this mental midget can't even read a word correctly which has a soft p sound in it. And I will give him the benefit of the doubt and allow him to make the mistake the first time since he's in the flow of giving a speech. But when he doesn't catch the error and makes the same mispronunciation 2 more times in the same speech, that is solid evidence of an ignorant poser attempting to pass himself off as intelligent.\n \n Besides, has your messiah ever released these mythological college records Jo? Can you prove he ever accomplished these educational feats based on any real source beside his own claims. The fact is he has refused to release his college transcripts, kinda weird for a magna cum laude who is proud of his accomplishments. So what is he hiding Jo? Can you answer that question? Could it be that he is a poser to the core, from his citizenship to his educational accomplishments? I think that's a distinct possibility. I mean, how many magna cum laude recipients do you know who can't pronounce CORPSMAN properly?\n Obama's Years at Columbia Are a Mystery\n He Graduated Without Honors\n By ROSS GOLDBERG, Special to the Sun | September 2, 2008\n SHARE|PRINT|EMAIL\n Senator Obama's life story, from his humble roots, to his rise to Harvard Law School, to his passion as a community organizer in Chicago, has been at the center of his presidential campaign. But one chapter of the tale remains a blank - his education at Columbia College, a place he rarely speaks about and where few people seem to remember him.\n \n Contributing to the mystery is the fact that nobody knows just how well Mr. Obama, unlike Senator McCain and most other major candidates for the past two elections, performed as a student.\n \n The Obama campaign has refused to release his college transcript, despite an academic career that led him to Harvard Law School and, later, to a lecturing position at the University of Chicago. The shroud surrounding his experience at Columbia contrasts with that of other major party nominees since 2000, all whom have eventually released information about their college performance or seen it leaked to the public.\n \n For better or worse, voters have taken an interest in candidates' grades since 1999, when the New Yorker published President Bush's transcript at Yale and disclosed that he was a C student. Mr. Bush had never portrayed himself as a brain, but many were surprised to learn the next year that his opponent, Vice President Gore, did not do much better at Harvard despite his intellectual image. When Senator Kerry's transcript surfaced, reporters found that he actually had a slightly lower average at Yale than Mr. Bush did.\n \n Some political observers cite such disclosures as proof that candidates' intelligence cannot be judged solely by their political careers or the schools they attended. Grades provide a rare measure of intellect that is immune to political spin, proponents say.\n \n \"We like to pretend IQ doesn't matter, but it really does with a lot of jobs, including the presidency,\" a professor at Smith College who studies the effects of human intelligence on the economy, James Miller, said. \"We can't trust the information that candidates give us, so it's important to look for objective data that they can't falsify or distort.\" Obama's Years at Columbia Are a Mystery - September 2, 2008 - The New York Sun\n \n As you can see from this article, even though sanctimonious leftists like you continue to attack George Bush's intelligence, he scored a higher grade point average than both Gore and Kerry whom you have no qualms at all about claiming their superior intellect to Bush and any other conservatives we hold up for comparison. The fact is that your ilk constantly lies to yourself as you claim the left is ineffectually superior to conservatives when they in fact cling to philosophies and policies which have failed every time they have been attempted.\n\n My! My! My! What a huge amount of hatred for a person who says he's \"in the company of the master.\" One wonders which master. Does the master burn red with with heat and carry a triton?", 
   {
    "unicode_changes_made": true
   }, 
   397693, 
   null, 
   1270918500.0
  ], 
  [
   397753, 
   null, 
   "simone", 
   "Obama's years at Columbia?\n \n Maybe he was a member of Mr. Goldberg's gang of hoods, does he have the same gang tattoos as Goldberg?", 
   {}, 
   397752, 
   null, 
   1270919040.0
  ], 
  [
   397761, 
   null, 
   "COBHC", 
   "I will.\n \n As soon as present-day fools stop snorting about the election of Barack Obama and stop with the stupid racism and ugliness.\n\n \n Yeah, those teabaggers are sooo racist. :)\n \n FOXNews.com - Black Tea Party Activists Called 'Traitors'\n \n You're just as bad as MarieAntoinette, anyone who disagrees with Obama is racist. I, for one, am happy to see that there are plenty of people who aren't too mesmerized by the nations first black president to think for themselves. You are not one of them.", 
   {}, 
   397750, 
   null, 
   1270920480.0
  ], 
  [
   397764, 
   null, 
   "NATO 556", 
   "I will.\n \n As soon as present-day fools stop snorting about the election of Barack Obama and stop with the stupid racism and ugliness.\n\n \n Obama's church preacher supported hatred of whites and violence against non-blacks. He was affiliated with the church until the news came out last year. So we've got a president who supported the message of violence and racism, just against a different group of people.", 
   {}, 
   397750, 
   null, 
   1270920960.0
  ], 
  [
   397774, 
   null, 
   "Jo Bennett", 
   "Obama's church preacher supported hatred of whites and violence against non-blacks. He was affiliated with the church until the news came out last year. So we've got a president who supported the message of violence and racism, just against a different group of people.\n\n \n Sure, cause everyone ALWAYS agrees with everything their church minister says. emoticon_rolleyes", 
   {}, 
   397764, 
   null, 
   1270932900.0
  ], 
  [
   397779, 
   null, 
   "NATO 556", 
   "Sure, cause everyone ALWAYS agrees with everything their church minister says. emoticon_rolleyes\n\n \n Well if Obama didn't agree with his minister's message of black power and \"kill whitey\" why would he have continued being a member until the presidential races? If you don't support the message of a race war then you don't remain with the speaker most of your life.", 
   {}, 
   397774, 
   null, 
   1270936860.0
  ], 
  [
   397780, 
   null, 
   "Archangel", 
   "This mor*n uses a teleprompter to give a speech to grammar schoolers, how is that evidence of intelligence? And my example is solid evidence that this mental midget can't even read a word correctly which has a soft p sound in it. And I will give him the benefit of the doubt and allow him to make the mistake the first time since he's in the flow of giving a speech. But when he doesn't catch the error and makes the same mispronunciation 2 more times in the same speech, that is solid evidence of an ignorant poser attempting to pass himself off as intelligent.\n \n Besides, has your messiah ever released these mythological college records Jo? Can you prove he ever accomplished these educational feats based on any real source beside his own claims. The fact is he has refused to release his college transcripts, kinda weird for a magna cum laude who is proud of his accomplishments. So what is he hiding Jo? Can you answer that question? Could it be that he is a poser to the core, from his citizenship to his educational accomplishments? I think that's a distinct possibility. I mean, how many magna cum laude recipients do you know who can't pronounce CORPSMAN properly?\n Obama's Years at Columbia Are a Mystery\n He Graduated Without Honors\n By ROSS GOLDBERG, Special to the Sun | September 2, 2008\n SHARE|PRINT|EMAIL\n Senator Obama's life story, from his humble roots, to his rise to Harvard Law School, to his passion as a community organizer in Chicago, has been at the center of his presidential campaign. But one chapter of the tale remains a blank - his education at Columbia College, a place he rarely speaks about and where few people seem to remember him.\n \n Contributing to the mystery is the fact that nobody knows just how well Mr. Obama, unlike Senator McCain and most other major candidates for the past two elections, performed as a student.\n \n The Obama campaign has refused to release his college transcript, despite an academic career that led him to Harvard Law School and, later, to a lecturing position at the University of Chicago. The shroud surrounding his experience at Columbia contrasts with that of other major party nominees since 2000, all whom have eventually released information about their college performance or seen it leaked to the public.\n \n For better or worse, voters have taken an interest in candidates' grades since 1999, when the New Yorker published President Bush's transcript at Yale and disclosed that he was a C student. Mr. Bush had never portrayed himself as a brain, but many were surprised to learn the next year that his opponent, Vice President Gore, did not do much better at Harvard despite his intellectual image. When Senator Kerry's transcript surfaced, reporters found that he actually had a slightly lower average at Yale than Mr. Bush did.\n \n Some political observers cite such disclosures as proof that candidates' intelligence cannot be judged solely by their political careers or the schools they attended. Grades provide a rare measure of intellect that is immune to political spin, proponents say.\n \n \"We like to pretend IQ doesn't matter, but it really does with a lot of jobs, including the presidency,\" a professor at Smith College who studies the effects of human intelligence on the economy, James Miller, said. \"We can't trust the information that candidates give us, so it's important to look for objective data that they can't falsify or distort.\" Obama's Years at Columbia Are a Mystery - September 2, 2008 - The New York Sun\n \n As you can see from this article, even though sanctimonious leftists like you continue to attack George Bush's intelligence, he scored a higher grade point average than both Gore and Kerry whom you have no qualms at all about claiming their superior intellect to Bush and any other conservatives we hold up for comparison. The fact is that your ilk constantly lies to yourself as you claim the left is ineffectually superior to conservatives when they in fact cling to philosophies and policies which have failed every time they have been attempted.\n\n \n \nMy! My! My! What a huge amount of hatred for a person who says he's \"in the company of the master.\" One wonders which master. Does the master burn red with with heat and carry a triton?\n\n \n Is this what you call refuting a post which offers evidence in support of an argument? Have you liars nothing real to offer in order to defend your position other than attacking my relationship with Christ? I mean, if I'm so wrong, it should be easy for you to actually prove it rather than just throw out ignorant and hate based snipes. And while you're at it, show me what I said that was a huge amount of hatred, I reposted my post for you and everything. emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   397752, 
   null, 
   1270938420.0
  ], 
  [
   397781, 
   null, 
   "Archangel", 
   "The man was fairly voted in.\n \n No vote fixing as happened in Ohio in 2004.\n \n No right wing riots to shut down the vote count and other political thuggery in Florida in 2000, not to mention the divine intervention of SCOTUS to proclaim George Walker Bush Supreme Ruler of the U.S.\n\n \n \nLIAR!!! Just check out ACORN and the SEIU's activities during the last election and then say that with a straight face. emoticon_rolleyes\n\n \n \nJust who is the liar?\n \n Tale a look in the mirror, Archie, if it doesn't break, and see who the liar is.\n\n \n Stay on point liar and respond to the subject at hand. You said vote fixing happened in 04 and I called you a liar based on the proven track record of ACORN and SEIU. You should respond with evidence that they are innocent of the accusations I make rather than act like a two year old with the response you give here. You know, like actual evidence like this? Atlas Shrugs: ACORN, SEIU: Democrat Racketeering Tools", 
   {}, 
   397751, 
   null, 
   1270939140.0
  ], 
  [
   397786, 
   null, 
   "Jo Bennett", 
   "Well if Obama didn't agree with his minister's message of black power and \"kill whitey\" why would he have continued being a member until the presidential races? If you don't support the message of a race war then you don't remain with the speaker most of your life.\n\n \n Or maybe it's one or two comments taken out of context, not a \"message of race war\" at all? Most people don't switch churches because of a few words the minister said that they disagree with, at least not round here.", 
   {}, 
   397779, 
   null, 
   1270941900.0
  ], 
  [
   397808, 
   null, 
   "Archangel", 
   "Or maybe it's one or two comments taken out of context, not a \"message of race war\" at all? Most people don't switch churches because of a few words the minister said that they disagree with, at least not round here.\n\n \n Wright's church has a culture and history of black liberation theology which promotes racism and separation between the races. It is an abhorrent theology which seeks to separate rather than unite the races. And he stayed in that church for 20 years, until \"Liberation Theology\" was exposed as a racist school of thought so we are dealing with much more than one or two comments here, but 2 decades of comments in a church that has mixed black muslim theology with a luke warm christian interpretation. Obama proves his hypocrisy by having stayed in such a church until its racist roots were exposed for all the world to see. Here, from CNN, the issues were raised and the questions asked during the campaign season. \n \n YouTube - Barack Obama's Black Liberation Theology\n \n I dare you and challenge you to watch this video and then disprove it as inaccurate or untruthful.\n \n Here, enjoy an interview with Mr Cones himself, the founder of Black Liberation Theology:\n \n http://www.youtube.com/watch?v=-1X5sZ6Q4Fw&feature=related", 
   {}, 
   397786, 
   null, 
   1270990920.0
  ], 
  [
   397831, 
   null, 
   "Steeeeve", 
   "I will.\n \n As soon as present-day fools stop snorting about the election of Barack Obama and stop with the stupid racism and ugliness.\n\n \n I don't see how those relate. Until we get rid of every racist person you are going to harp about W. Bush? Have fun?", 
   {}, 
   397750, 
   null, 
   1271007960.0
  ], 
  [
   397847, 
   null, 
   "simone", 
   "I don't see how those relate. Until we get rid of every racist person you are going to harp about W. Bush? Have fun?\n\n Oh we will never get rid of racism in America. There are too many inbred people around to keep it alive.\n \n Perhaps if we forbade cousins to marry each other and observed a few other rules on incest, it's a possibility, but incest is too much a part of American culture, particularly in the South.", 
   {}, 
   397831, 
   null, 
   1271015160.0
  ], 
  [
   397853, 
   null, 
   "Archangel", 
   "Oh we will never get rid of racism in America. There are too many inbred people around to keep it alive.\n\n \n Good point simone, but I'm surprised that you would admit to such a thing since it's the Progressive Leftists who are always playing the race card anytime \"we the people\" dare to question this Marxist Presidents socialist policies. I mean really, with a country which is 80% white we just elected a black President. But because we disagree with his policies you call the majority of us racist. \n \n \nPerhaps if we forbade cousins to marry each other and observed a few other rules on incest, it's a possibility, but incest is too much a part of American culture, particularly in the South.\n\n \n I would love to see some actual stats on incest in this country? Can you supply any or are we supposed to just accept your lies because this trash sounds good to you? And if you can supply stats on incest, would you then please produce stats that it is occurring in republican families rather than democrats? Because it is well known that democrats are the most ignorant among us since by their complete political world view they continue to promote the same policies which have always failed. It is the definition of stupidity for someone to continue to repeat the same mistakes over and over and over ad infinitum. :xbanghead", 
   {}, 
   397847, 
   null, 
   1271019120.0
  ], 
  [
   398022, 
   null, 
   "Peeling", 
   "Well, you're wrong. I paid my way through college, majored in something that I knew I could make money doing and took risks like relocating.\n\n You acknowledge taking risks - and they happened to pay off. If they hadn't, after all that hard work, would it have been your fault? What about all the unfortunate events that could have derailed you if they had happened - the kinds of events that undoubtedly have derailed others?\n \nAdd to that several patents, publications and an acknowledged industry-wide expertise in a chemistry niche after 25 years in the field and your concept of \"luck\" doesn't apply. IMO, calling someone's hard work to become successful \"luck\" is degrading to those that earned their way in life.\n\n Oh, absolutely, and I apologise if I gave that impression. I don't for one moment want to downplay the importance of hard work and dedication.\n \n Let me backtrack a bit and clarify: I don't believe in enforced equality. On the other hand, the undeniable role chance plays in all our lives prevents me endorsing raw sink-or-swim capitalism either. I don't even believe there is a definable one-size-fits-all 'happy medium'. \n \n What I believe is that the role of government ought to adapt to the prevailing circumstances: I think there are times when inequality is so great, and so difficult and slow for the free market to close, that it is not only more humane but in the long term better for everyone for that inequality to be reduced through policy and legislation. I personally think healthcare and education are key levelers of the playing-field: inequality there can easily overshadow the other differentials - like the dedication and hard work you are rightly proud of - which are deserving of reward.\n \n I also believe the complexity and interdependency of the global free market is at present too great to be rationally understood, and free market decisions must be rational in order for the system to function safely unsupervised. The recent banking collapse, which has heaped a generation of financial misery on billions while the instigators, by and large, parachuted to safety, can be directly attributed to such inevitable shortsightedness. \n \n Yes, it's self-correcting: as we speak financial models are being re-written. But the re-write won't incorporate an assumption that the rewrite is also wrong in some way - do you understand what I mean? Without some cautionary legislative grit in the gears, we'll be full steam ahead towards the next 'unexpected' global collapse.", 
   {}, 
   397406, 
   null, 
   1271162340.0
  ], 
  [
   398026, 
   null, 
   "Winston Smith", 
   "I don't see how those relate. Until we get rid of every racist person you are going to harp about W. Bush? Have fun?\n\n \n can you begin with Archie, then NATO, and then Dubya ? emoticon_xclown", 
   {}, 
   397831, 
   null, 
   1271164320.0
  ], 
  [
   404123, 
   null, 
   "Winston Smith", 
   "You couldn't have said it better. But, who is listening?\n \n All the best 'peeling' wherever you may be. You were far too intelligent, far too knowledgeable, far too reasonable and humane to be in this forum. \n \n It is like being sane and trying to reason with the insane. It would be insane to stay.\n \n -------------------------------------------\n \n Today is D-Day, I wonder if anyone remembers it.\n \n I did. I went to the photo galleries of Der Spiegel and browsed thru so many WWII photos of Germany in ruins, most of them poignant, sad really. Specially some of them aftermath of the firestorm attack on Dresden, in February, 1945 and the strafing survivors of the initial bombing who were massed on the city&#8217;s riverbanks. From some thirty miles away, Gerhard Richter one of my favouriite painters, as a boy of thirteen, witnessed the glow in the night sky of Dresden&#8217;s immolation. His \"Mustangs\" paintings refer to that massacre of civilians.\n \n \n I met a German in Adelaide who was posted at Normandy on that day, and being experienced in combat, when he saw the ships he skipped breakast for it is no good to have food in your stomach if you get a gut shot. I told him any gut shot is bad for your stomach.\n \n He survived that day, of course, and was the following year taken prisoner in Germany.\n \n Isn't it great that Germany hasn't been involved in any war since, apart from being dragged by the US into Afghanistan ?\n \n emoticon_xbye", 
   {}, 
   398022, 
   null, 
   1275832080.0
  ], 
  [
   404124, 
   null, 
   "Jo Bennett", 
   "You forgot the luftwaffe bombing Serbia.", 
   {}, 
   404123, 
   null, 
   1275832320.0
  ], 
  [
   404136, 
   null, 
   "gansao", 
   "\n \n Isn't it great that Germany hasn't been involved in any war since, apart from being dragged by the US into Afghanistan ?\n \n emoticon_xbye\n\n \n Ive tried to find something that isnt misinformed or stupid about your last sentence but so far I cant", 
   {}, 
   404123, 
   null, 
   1275847020.0
  ], 
  [
   404309, 
   null, 
   "lmno697", 
   "Well, the big story is the Supreme Court. President Obama has found his nominee. She is a Federal appeals judge. Sonia Sotomayor, I think her name is. A Latino woman, how about that? So, you know what that means. Ruth Bader Ginsburg no longer the hot chick on the court.\" --Jay Leno\"History was made today when President Obama nominated Judge Sonia Sotomayor as the first female Hispanic justice to serve in the U.S. Supreme court. Obama said this should help keep the court from leaning too far to the white.\" --Jimmy Fallon", 
   {
    "post_info": {
     "post_title": "Joke"
    }
   }, 
   396429, 
   null, 
   1276132680.0
  ], 
  [
   421608, 
   null, 
   "kowalskil", 
   "Leave it to the atheist hypocrite to bring the threat of an angry God into every discussion. :xbanghead\n\n \n Most people are neither professional scientists nor professional theologians. Some of them believe only in what theologians say, while others belive only in what scietists say. Some accept the authority of both and some are indifferent to both. Peaceful coexistence, between science and faith, is threaten by those who attack deism pretending to be scientists, and by those who atack science pretending to be theologians. It is also threatened by politicians who exploit people's beliefs (to promote wars and revolutions).", 
   {
    "unicode_changes_made": true
   }, 
   396559, 
   null, 
   1294532160.0
  ], 
  [
   421610, 
   null, 
   "NATO 556", 
   "Meanwhile what's the current situation going on with this accused group? What are the current charges against them? Where's the trial?", 
   {}, 
   421608, 
   null, 
   1294532340.0
  ], 
  [
   422200, 
   null, 
   "BrianAlleman", 
   "Obama's years at Columbia?\n \n Maybe he was a member of Mr. Goldberg's gang of hoods, does he have the same gang tattoos as Goldberg?\n\n \n Member of Mr. Goldberg's gang of hoods? Tatoos? Not at columbia.\n \n --\n Reverse Engineering", 
   {}, 
   397753, 
   null, 
   1294909440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Feds Crack Down On Christian Militia Groups", 
  "url": "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 14087, 
  "discussion_files": [
   [
    "4861.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-print.html"
   ], 
   [
    "4862.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-8-print.html"
   ], 
   [
    "4863.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-6-print.html"
   ], 
   [
    "4864.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-4-print.html"
   ], 
   [
    "4865.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-5-print.html"
   ], 
   [
    "4866.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-7-print.html"
   ], 
   [
    "4867.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-3-print.html"
   ], 
   [
    "4868.html", 
    "http://www.4forums.com/political/current-events-debates/14087-feds-crack-down-christian-militia-groups-2-print.html"
   ]
  ], 
  "identifier": 14087
 }
]