[
 [
  [
   396563, 
   null, 
   "44j", 
   "Cap and trade is as big a failure and as expensive as the healthcare bill!", 
   {
    "post_info": {
     "post_title": "Cap and Trade Poll"
    }
   }, 
   null, 
   null, 
   1270054800.0
  ], 
  [
   396566, 
   null, 
   "JPSartre12", 
   "Where's the box for HELL NO!", 
   {}, 
   396563, 
   null, 
   1270056120.0
  ], 
  [
   398334, 
   null, 
   "Archangel", 
   "I would have voted with the majority also, but the poll is already closed. emoticon_confused", 
   {}, 
   396563, 
   null, 
   1271354100.0
  ], 
  [
   398399, 
   null, 
   "daewoo", 
   "Where's the box for HELL NO!\n\n \n Come on, JP. The economy is in the crapper and not coming back anytime soon. Do you know how much money there is to be made in cap and trade for an entrepreneur who is quick on his feet? \n \n As long as there is a carbon offset program attached, and its definitions are broad enough to play with, why not? \n \n Seriously. You are smart enough that if you really think about the implications there you will see what I mean. There is a ton of money to be made there. Not even kidding. I can TOTALLY sell the open pit mine I own as a carbon offsetting activity. I already sold it to the state AND the feds as an environmental reclamation project. Not even kidding. Tax credits. Streamlined approvals. The whole nine yards. OPEN PIT MINE. And I say \"open pit mine\" because \"strip pit\" sounds so gauche. Since it is environmental reclamation I can surely pretend that somehow burning 2100 gallons of diesel fuel a week is a TOTAL carbon offsetting activity. \n \n Read the proposals that have actually been put forth so far. They are a goldmine for those who are willing to dig the environmentally friendly strip pit to get it :) \n \n Granted it will ultimately screw the middle and lower classes like you would not believe, but I think maybe they like it. Seriously. I can think of no other explanation. They like it when they get screwed over. That is why they make such a hobby of it.", 
   {}, 
   396566, 
   null, 
   1271396880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Cap and Trade Poll", 
  "url": "http://www.4forums.com/political/environmental-debates/14094-cap-trade-poll.html", 
  "breadcrumbs": [
   "Environmental"
  ], 
  "id_number": 14094, 
  "discussion_files": [
   [
    "3621.html", 
    "http://www.4forums.com/political/environmental-debates/14094-cap-trade-poll-print.html"
   ]
  ], 
  "identifier": 14094
 }
]