[
 [
  [
   27266, 
   null, 
   "VeniVedi", 
   "Propose: A less complex government\n \n 1.Automatically link each years government budget of 4% to the previous years GDP or GNP. This would control government spending. Make deficit spending illegal. \n \n 2. Everyone, young or old rich or poor, would be required to pay a 7 % (percent) flat tax on his or her increase each year. All citizens would then have a vested interested in America. \n \n 3. Voter Registration only would be by last years tax return receipt, proof of American citizenship and draft age. Incentive to become a legal American citizen.\n \n 4. Additional revenue would be from a progressive tax for those who wish to have additional government services. There would be a check off box on your tax return for each additional service proposed by the politicians (your individual tax percentage would increase by the percentage necessary to support each new governmental expense.) This way we the people could vote on their proposals or kill them as we paid our taxes each year. \n \n \n Result: \n Candidates would have to run on their ability to run government more efficiently rather than catering to special interests. \n There would be a decrease in size of government, especially the IRS and other superfluous bureaucracies\n Politicians would be more responsive to the taxpayers instead of special interest groups. \n Politicians would have create a work environment instead of a dole environment.(They would have an incentive to create more tax payers by encouraging private sector job creation.,)\n \n \n Let it be known that:\n I AM NOT SUGGESTING THAT THE TRULY NEEDY BE FORGOTTON!!", 
   {
    "post_info": {
     "post_title": "A less complex government"
    }
   }, 
   null, 
   null, 
   1071359040.0
  ], 
  [
   27289, 
   null, 
   "AMD4EVER", 
   "I completely agree with these measures. It seems to make perfect sense and it should receive more attention especially as we put ourselves further and further into debt without any end in sight.", 
   {}, 
   27266, 
   null, 
   1071382140.0
  ], 
  [
   28952, 
   null, 
   "epaphras_faith", 
   "I see some problems. By tying the government spending to the GDP or GNP then we necessarily tie government to corporate america. The little guy will now have little say. The corporations will control how laws are made because the legislature would be cow towing to the various large corporations. Not a place I want to put my family jewels.\n \n Your flat tax for the increase, would there be a concommittant return for a decrease each year. Some people actually lose money ya know. If that is the case then the government simply becomes a funnel for money from those who made it to those who didn't. Why work? I will sit back and sell things that I purchase at a loss over long periods of time. You have just invented socialism.\n \n Voter registration by tax return reciept. Not sure on this one, except to say that those will be as likely forged as any other legal document. You solve no problem only push it around to a new problem.\n \n M0ost government services are in place to support those that cannot afford them. To simply declare that those that want the services will pay more in taxes does not get to the heart of the issue which is assisting people in becoming self sufficient and productive. Here we only make people dependent on the government. \n \n Additionally, given your solutions above and their problems you will only create a quagmire.\n \n About the only reform that I would like to see is that the people of the various states will vote pay raises for their specific senators or representatives. They can also vote pay decreases (within a specified range). I don't like that congress gets to vote itself a pay raise.\n \n Beyond that, I think our system of government has it problems but still is the best on the planet.", 
   {}, 
   27289, 
   null, 
   1072230300.0
  ], 
  [
   29048, 
   null, 
   "montalban", 
   "Propose: A less complex government\n \n 1.Automatically link each years government budget of 4% to the previous years GDP or GNP. This would control government spending. Make deficit spending illegal. \n \n\n \n Hamstringing the government fiscally... that is what you're planning.\n \n What if the government makes a windfall in revenues ? - like if they got off their arses and actually prosecuted tax evasion as done by institutionalised cheaters at the top end of the market.", 
   {}, 
   27266, 
   null, 
   1072320840.0
  ], 
  [
   45386, 
   null, 
   "sglaine", 
   "Amen lets lay off the goverment. :xcensored :xcensored", 
   {}, 
   29048, 
   null, 
   1082675760.0
  ], 
  [
   46799, 
   null, 
   "pyromattiac", 
   "Your flat tax for the increase, would there be a concommittant return for a decrease each year. Some people actually lose money ya know. If that is the case then the government simply becomes a funnel for money from those who made it to those who didn't. Why work? I will sit back and sell things that I purchase at a loss over long periods of time. You have just invented socialism.\n\n \n \n I fail to see where in a flat tax proposal it mentions creating a \"funnel\"; nor do I see where it mentions anything about how the funds will be allocated. Not to mention the fact that the despised upper class will now have more money to spend which in turn would stimulate the economy and encourage growth. Which bring me to my next point:\n \n \nI see some problems. By tying the government spending to the GDP or GNP then we necessarily tie government to corporate america. The little guy will now have little say. The corporations will control how laws are made because the legislature would be cow towing to the various large corporations. Not a place I want to put my family jewels.\n\n \n I am not in favor of linking the budget to the GDP of GNP, but I must be missing something here too. It suddenly seems that companies are all for willingly decreasing their profits drastically if they are in favor of a proposed law. The suggested tying of the government to corporate america is false.\n I would like to reiterate that I do not support this at all, but I do not think that a corporation would be willing to cut profits and possibly go under because of its politcal agenda.", 
   {}, 
   28952, 
   null, 
   1083291720.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A less complex government", 
  "url": "http://www.4forums.com/political/government-debates/1410-less-complex-government.html", 
  "breadcrumbs": [
   "Government"
  ], 
  "id_number": 1410, 
  "discussion_files": [
   [
    "23010.html", 
    "http://www.4forums.com/political/government-debates/1410-less-complex-government-print.html"
   ]
  ], 
  "identifier": 1410
 }
]