[
 [
  [
   397096, 
   null, 
   "simone", 
   "Oh, the stuff you can learn from TeaBaggers!\n \n A whole new world of education:\n \nObama: Lier-In-Chief\n\n \nThe Borror Is the Slave of the Lender...\n\n \nMaking Me Pay for Other People's Homes and Credit Card Bills: Rediculous!\n\n \nAmericans\n Help Us Boycott Mexico\n Respect Are-Country\n Speak English!\n\n Womanist Musings\n \n I admit that English's complexities make it a hard language to learn, especially the hideous spellings, but Geeze! Don't tell others to speak English until you at least have a decent mastery of it!", 
   {
    "post_info": {
     "post_title": "English Is Our Language. No Excetions. Learn It."
    }
   }, 
   null, 
   null, 
   1270398660.0
  ], 
  [
   397106, 
   null, 
   "gansao", 
   "Bill Clinton had trouble with English..he could tell the difference between these two phrases.\n I did not have sex with that woman.\n OK the games up I did have sex with that woman.\n \n I think he may have had a different interpretation of teabagging tooemoticon_xbouncer", 
   {}, 
   397096, 
   null, 
   1270403400.0
  ], 
  [
   397220, 
   null, 
   "simone", 
   "You do have a thing for Clinton, don't you....", 
   {}, 
   397106, 
   null, 
   1270484700.0
  ], 
  [
   397222, 
   null, 
   "gansao", 
   "You do have a thing for Clinton, don't you....\n\n \n I keep him and Ted in my pocket to XXXXX liberal balloons.", 
   {}, 
   397220, 
   null, 
   1270485480.0
  ], 
  [
   397238, 
   null, 
   "jitobear", 
   "Bill Clinton had trouble with English..he could tell the difference between these two phrases.\n I did not have sex with that woman.\n OK the games up I did have sex with that woman.\n\n \n I don't think it was the English language he had trouble with there.....", 
   {}, 
   397106, 
   null, 
   1270493340.0
  ], 
  [
   398566, 
   null, 
   "jazyjason", 
   "I don't think it was the English language he had trouble with there.....\n\n \n I'm sorry but if I had to F%#& Hillary I'd cheat too...... Lets all be real here you all know you would if you were that man and Monica walked in...", 
   {}, 
   397238, 
   null, 
   1271591760.0
  ], 
  [
   398581, 
   null, 
   "Jo Bennett", 
   "I'm sorry but if I had to F%#& Hillary I'd cheat too...... Lets all be real here you all know you would if you were that man and Monica walked in...\n\n \n You get married, you keep your vows. It's that simple.", 
   {}, 
   398566, 
   null, 
   1271598360.0
  ], 
  [
   398612, 
   null, 
   "Penfold", 
   "To return to the topic from Gainsay's diversion. The authors of the OP phrases are supposed to represent the better educated segment of the USA. emoticon_rolleyes", 
   {}, 
   398581, 
   null, 
   1271625840.0
  ], 
  [
   398616, 
   null, 
   "gansao", 
   "http://www.4forums.com/political/attachment.php?attachmentid=391&stc=1&d=1271622108\n \n \n http://www.4forums.com/political/attachment.php?attachmentid=392&stc=1&d=1271622125\n \n \n http://www.4forums.com/political/attachment.php?attachmentid=393&stc=1&d=1271622143\n \n \n \n emoticon_xhoho", 
   {}, 
   398612, 
   null, 
   1271630400.0
  ], 
  [
   398624, 
   null, 
   "jazyjason", 
   "You get married, you keep your vows. It's that simple.\n\n \n Yeah but he should have gotten the 100k + mile warranty cause she's got alot of miles on her....", 
   {}, 
   398581, 
   null, 
   1271639460.0
  ], 
  [
   407600, 
   null, 
   "flaja", 
   "My maternal grandmother's family migrated from the Rhineland to America starting in the 1730s and eventually ended up on North Carolina. They used their Rhenish dialect of German as their everyday language up until the time of the Rebellion when it was replaced by English for everything but their Lutheran church services. However, their Rhenish did not totally die out until the 1930s- when my grandmother could remember hearing her grandparents use it whenever they wanted to say something that they didn't want the children to understand.\n \n The situation was pretty much the same among the Pennsylvania Dutch. The officers in Pennsylvania national guard units that went to France during World War I realized that if they spoke their Germanic dialect and French army officers spoke standard High German they could communicate more easily than if the Americans tried to speak French or the French tried to speak English.\n \n And then there was a Pennsylvania guard unit that strayed behind enemy lines and was about to be fired upon by a German artillery unit (due to their strange uniforms)- until the Americans started talking in their Germanic dialect and the Germans thought they were actually German.\n \n America has never been the linguistic monolith that some Republicans and self-proclaimed conservatives want to believe it was.\n \n Of course the stupidest thing I have ever seen from a tea partier was when I passed an SUV that had a bumper sticker: Taxed Enough Already- when the vehicle had a specialty license plate that the owner had to give the government extra money to get.", 
   {
    "unicode_changes_made": true
   }, 
   398624, 
   null, 
   1279479060.0
  ], 
  [
   407602, 
   null, 
   "simone", 
   "Good Lord! flaja, you've been indoctrinated in Lutheranism!\n \n My sympathies. Did you get a good dose of Pietism as well?", 
   {}, 
   407600, 
   null, 
   1279479240.0
  ], 
  [
   407603, 
   null, 
   "simone", 
   "Yeah but he should have gotten the 100k + mile warranty cause she's got alot of miles on her....\n\n Probably not as many miles and as much usage as thou, well-worn jason. emoticon_xangel", 
   {}, 
   398624, 
   null, 
   1279479420.0
  ], 
  [
   407607, 
   null, 
   "flaja", 
   "Good Lord! flaja, you've been indoctrinated in Lutheranism!\n \n My sympathies. Did you get a good dose of Pietism as well?\n\n \n Actually I haven't been. My mother's mother came from the earliest Lutheran families to settle in Western NC. My father's family were Baptist, but they all worshiped at the First Baptist Church of Budweiser.\n \n My mother's father was likely raised as a Baptist (his uncle was a Baptist pastor in NC), but he was a Roman Catholic for a while before my mother was born and I think he was RC again just before he died of lung cancer. But I never knew him to be anything but an atheist and all-around miserable excuse for a human being.\n \n My mother is, for all practical purpose, an atheist. So I was not raised as anything.\n \n Knowing what I know about Martin Luther's anti-Semitism, I would have told my Lutheran relatives where to go- if I had ever met any of them and they had chosen to press the issue.", 
   {
    "unicode_changes_made": true
   }, 
   407602, 
   null, 
   1279480560.0
  ], 
  [
   407707, 
   null, 
   "simone", 
   "Martin Luther was anti-semitic. It was the confounding sin of the time, meaning that virtually everyone was guilty of it.", 
   {}, 
   407607, 
   null, 
   1279577880.0
  ], 
  [
   407739, 
   null, 
   "flaja", 
   "Martin Luther was anti-semitic. It was the confounding sin of the time, meaning that virtually everyone was guilty of it.\n\n \n Actually Great Britain has very little history of anti-Semitism. You can count the number of documented anti-Jewish instances in British history on the fingers of just one or two hands. Even King Edward III's official expulsion of the Jews really didn't have any real world effect because practically nobody cared whether or not it was enforced. Britain has known nothing of the pogroms of France, Germany or Eastern Europe.\n \n Roman Catholic Church officials in Italy have often been anti-Semitic, but among ordinary Italians anti-Semitism has been essentially unknown. During World War II Jews intentionally sought refuge in Italy even though Italy was allied with Germany until the Allied invasion of 1943. Mussolini even had a Jewish mistress until Hitler found out. The Italians were always lax in enforcing the anti-Semitic laws that the Germans made them enact. And a higher percentage of Italian Jews than French Jews survived the Germans.\n \n Also, when Roman Catholic Spain expelled the Jews in 1492, they were welcomed into the Ottoman Empire by the Turks. Martin Luther-style anti-Semitism has not been universal by any means.", 
   {
    "unicode_changes_made": true
   }, 
   407707, 
   null, 
   1279588200.0
  ], 
  [
   409436, 
   null, 
   "J Miro", 
   "Sucede que me canso de ser hombre.\n Sucede que entro en las sastrerías y en los cines\n marchito, impenetrable, como un cisne de fieltro\n Navegando en un agua de origen y ceniza. \n El olor de las peluquerías me hace llorar a gritos.\n Sólo quiero un descanso de piedras o de lana,\n sólo quiero no ver establecimientos ni jardines,\n ni mercaderías, ni anteojos, ni ascensores. \n Sucede que me canso de mis pies y mis uñas\n y mi pelo y mi sombra.\n Sucede que me canso de ser hombre. \n Sin embargo sería delicioso\n asustar a un notario con un lirio cortado\n o dar muerte a una monja con un golpe de oreja.\n Sería bello\n ir por las calles con un cuchillo verde\n y dando gritos hasta morir de frío \n No quiero seguir siendo raíz en las tinieblas,\n vacilante, extendido, tiritando de sueño,\n hacia abajo, en las tapias mojadas de la tierra,\n absorbiendo y pensando, comiendo cada día. \n No quiero para mí tantas desgracias.\n No quiero continuar de raíz y de tumba,\n de subterráneo solo, de bodega con muertos\n ateridos, muriéndome de pena. \n Por eso el día lunes arde como el petróleo\n cuando me ve llegar con mi cara de cárcel,\n y aúlla en su transcurso como una rueda herida,\n y da pasos de sangre caliente hacia la noche. \n Y me empuja a ciertos rincones, a ciertas casas húmedas,\n a hospitales donde los huesos salen por la ventana,\n a ciertas zapaterías con olor a vinagre,\n a calles espantosas como grietas. \n Hay pájaros de color de azufre y horribles intestinos\n colgando de las puertas de las casas que odio,\n hay dentaduras olvidadas en una cafetera,\n hay espejos\n que debieran haber llorado de vergüenza y espanto,\n hay paraguas en todas partes, y venenos, y ombligos.\n Yo paseo con calma, con ojos, con zapatos,\n con furia, con olvido,\n paso, cruzo oficinas y tiendas de ortopedia,\n y patios donde hay ropas colgadas de un alambre:\n calzoncillos, toallas y camisas que lloran\n lentas lágrimas sucias. \n \n Pablo Neruda", 
   {
    "post_info": {
     "post_title": "It so happens .."
    }
   }, 
   407739, 
   null, 
   1281245340.0
  ], 
  [
   409439, 
   null, 
   "Jo Bennett", 
   "Sucede que me canso de ser hombre.\n Sucede que entro en las sastrerías y en los cines\n marchito, impenetrable, como un cisne de fieltro\n Navegando en un agua de origen y ceniza. \n El olor de las peluquerías me hace llorar a gritos.\n Sólo quiero un descanso de piedras o de lana,\n sólo quiero no ver establecimientos ni jardines,\n ni mercaderías, ni anteojos, ni ascensores. \n Sucede que me canso de mis pies y mis uñas\n y mi pelo y mi sombra.\n Sucede que me canso de ser hombre. \n Sin embargo sería delicioso\n asustar a un notario con un lirio cortado\n o dar muerte a una monja con un golpe de oreja.\n Sería bello\n ir por las calles con un cuchillo verde\n y dando gritos hasta morir de frío \n No quiero seguir siendo raíz en las tinieblas,\n vacilante, extendido, tiritando de sueño,\n hacia abajo, en las tapias mojadas de la tierra,\n absorbiendo y pensando, comiendo cada día. \n No quiero para mí tantas desgracias.\n No quiero continuar de raíz y de tumba,\n de subterráneo solo, de bodega con muertos\n ateridos, muriéndome de pena. \n Por eso el día lunes arde como el petróleo\n cuando me ve llegar con mi cara de cárcel,\n y aúlla en su transcurso como una rueda herida,\n y da pasos de sangre caliente hacia la noche. \n Y me empuja a ciertos rincones, a ciertas casas húmedas,\n a hospitales donde los huesos salen por la ventana,\n a ciertas zapaterías con olor a vinagre,\n a calles espantosas como grietas. \n Hay pájaros de color de azufre y horribles intestinos\n colgando de las puertas de las casas que odio,\n hay dentaduras olvidadas en una cafetera,\n hay espejos\n que debieran haber llorado de vergüenza y espanto,\n hay paraguas en todas partes, y venenos, y ombligos.\n Yo paseo con calma, con ojos, con zapatos,\n con furia, con olvido,\n paso, cruzo oficinas y tiendas de ortopedia,\n y patios donde hay ropas colgadas de un alambre:\n calzoncillos, toallas y camisas que lloran\n lentas lágrimas sucias. \n \n Pablo Neruda\n\n \n ......que?", 
   {}, 
   409436, 
   null, 
   1281260700.0
  ], 
  [
   409528, 
   null, 
   "J Miro", 
   "......que?\n\n \n Spanish is such a beautiful language, I wish I spoke it fluently. Here is a noble effort at translation by Robert Bly:\n \n It so happens I am sick of being a man.\n And it happens that I walk into tailorshops and movie\n houses\n dried up, waterproof, like a swan made of felt\n steering my way in a water of wombs and ashes.\n \n The smell of barbershops makes me break into hoarse\n sobs.\n The only thing I want is to lie still like stones or wool.\n The only thing I want is to see no more stores, no gardens,\n no more goods, no spectacles, no elevators.\n \n It so happens that I am sick of my feet and my nails\n and my hair and my shadow.\n It so happens I am sick of being a man.\n \n Still it would be marvelous\n to terrify a law clerk with a cut lily,\n or kill a nun with a blow on the ear.\n It would be great\n to go through the streets with a green knife\n letting out yells until I died of the cold.\n \n I don't want to go on being a root in the dark,\n insecure, stretched out, shivering with sleep,\n going on down, into the moist guts of the earth,\n taking in and thinking, eating every day.\n \n I don't want so much misery.\n I don't want to go on as a root and a tomb,\n alone under the ground, a warehouse with corpses,\n half frozen, dying of grief.\n \n That's why Monday, when it sees me coming\n with my convict face, blazes up like gasoline,\n and it howls on its way like a wounded wheel,\n and leaves tracks full of warm blood leading toward the\n night.\n \n And it pushes me into certain corners, into some moist\n houses,\n into hospitals where the bones fly out the window,\n into shoeshops that smell like vinegar,\n and certain streets hideous as cracks in the skin.\n \n There are sulphur-colored birds, and hideous intestines\n hanging over the doors of houses that I hate,\n and there are false teeth forgotten in a coffeepot,\n there are mirrors\n that ought to have wept from shame and terror,\n there are umbrellas everywhere, and venoms, and umbilical\n cords.\n \n I stroll along serenely, with my eyes, my shoes,\n my rage, forgetting everything,\n I walk by, going through office buildings and orthopedic\n shops,\n and courtyards with washing hanging from the line:\n underwear, towels and shirts from which slow\n dirty tears are falling.", 
   {}, 
   409439, 
   null, 
   1281328500.0
  ], 
  [
   409535, 
   null, 
   "gansao", 
   "Wasnt worth translatingemoticon_rolleyes", 
   {}, 
   409528, 
   null, 
   1281347760.0
  ], 
  [
   409768, 
   null, 
   "J Miro", 
   "Wasnt worth translatingemoticon_rolleyes\n\n \n He's considered one of the greatest modern poets in history.", 
   {}, 
   409535, 
   null, 
   1281506160.0
  ], 
  [
   409775, 
   null, 
   "gansao", 
   "He's considered one of the greatest modern poets in history.\n\n \n It must have been lost in translation then.\n How can he be considered one of the greatest modern poets in history?\n He could be considered one of the greatest poets in modern history though...I think Ive found the problem...", 
   {}, 
   409768, 
   null, 
   1281524700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  English Is Our Language. No Excetions. Learn It.", 
  "url": "http://www.4forums.com/political/education-debates/14106-english-our-language-no-excetions-learn.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 14106, 
  "discussion_files": [
   [
    "13608.html", 
    "http://www.4forums.com/political/education-debates/14106-english-our-language-no-excetions-learn-print.html"
   ], 
   [
    "13609.html", 
    "http://www.4forums.com/political/education-debates/14106-english-our-language-no-excetions-learn-2-print.html"
   ]
  ], 
  "identifier": 14106
 }
]