[
 [
  [
   397955, 
   null, 
   "simone", 
   "Ah, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n \n Nothing at all matters as much as the love of the right to bear arms.\n \n Carry Concealed", 
   {
    "post_info": {
     "post_title": "Love of the right to bear arms..."
    }
   }, 
   null, 
   null, 
   1271107140.0
  ], 
  [
   397961, 
   null, 
   "NATO 556", 
   "Would you like some cheese to go with that wine?\n \n Or maybe a shovel to go with that bull****?", 
   {}, 
   397955, 
   null, 
   1271111580.0
  ], 
  [
   397962, 
   null, 
   "Superlite27", 
   "\n \n The love that cancels out all else -- life and liberty, freedom...\n \n Carry Concealed\n\n \n No. Wrong.\n \n The love that ensures life, liberty, and freedom.\n \n Your head is on backwards.\n \n I've never seen a soldier fight for your right to open your mouth by volunteering to lay down his rifle.\n \n I've never met a veteran who ensured your right to peacably assemble by giving up his gun.\n \n I've never heard of a marine who guaranteed your freedom of religion by whining and crying instead of bleeding and fighting.\n \n You are an unarmed pacifist. You can never accomplish anything other than sanctimonious preaching and holier than thou mouth wagging. You have never sacrificed personal activity to physically provide or protect a right for anyone. \n \n You moan and complain about law abiding folks who actually take the time and responsibility to provide for their own safety instead of passively accepting their own propensity for victimhood such as you do. \n \n The one question I have never received an answer to:\n \n How is it that you consider it more responsible to require another human being to come running from another location and risk their life in order to save yours after something serious happens, than simply taking the initiative to do it for yourself beforehand?\n \n All it does is blatantly highlight your inadequacy and reliance upon others to perform an action you are too passive to take upon yourself.\n \n Out of all murdered victims that have ever existed, I wonder how many have been legally armed?\n \n Yet, if it were up to you, you would ensure we were all in the category containing the majority of victims.....because you, yourself, do not have the intestinal fortitude to do something you feel is acceptable for another human being with a shiny metal disk: protect your own life.\n \n You can rant. You can rave. You can decry the audacity of those who refuse to meekly submit to the victim mentality you would willingly force upon anyone with the capacity of self reliance greater than your own.\n \n There's one thing you will never do that ensures your eventual and inevitable failure:\n \n You will never do anything more than talk. You are incapable of doing anything else. To do anything else would require something entirely too alien to your passive nature: It would require effort and sacrifice to become self reliant. Like soldiers, police, and those who protect their own lives.\n \n And that is something you would willingly take away from anyone else.\n \n If you were to be successful, you would soon lose the things you state we are cancelling out, but are in fact ensuring for you: life, liberty, and freedom. There'd be no one left to fight for it.", 
   {}, 
   397955, 
   null, 
   1271111760.0
  ], 
  [
   397998, 
   null, 
   "COBHC", 
   "Ah, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n \n Nothing at all matters as much as the love of the right to bear arms.\n \n Carry Concealed\n\n \n Care to explain how taking away rights leads to freedom? Guns are only a threat to liberty when the government has them and you don't.", 
   {}, 
   397955, 
   null, 
   1271127600.0
  ], 
  [
   398042, 
   null, 
   "simone", 
   "I don't see any one nationally taking away the right to bear arms. All I see is a bunch of hysteria about the topic.\n \n Stop being so hysterical and screechy.", 
   {}, 
   397998, 
   null, 
   1271180100.0
  ], 
  [
   398051, 
   null, 
   "NATO 556", 
   "I don't see any one nationally taking away the right to bear arms. All I see is a bunch of hysteria about the topic.\n\n \n You aren't looking hard enough. Colorado, for example, is trying to pass a bill that takes away a person's rights if they're arrested, even if there's no conviction.\n \n \nStop being so hysterical and screechy.\n\n \n You first. You're nothing but ignorant and paranoid.", 
   {}, 
   398042, 
   null, 
   1271181840.0
  ], 
  [
   398055, 
   null, 
   "simone", 
   "You aren't looking hard enough. Colorado, for example, is trying to pass a bill that takes away a person's rights if they're arrested, even if there's no conviction.\n \n You first. You're nothing but ignorant and paranoid.\n\n Show me the bill. I very much doubt that if such a bill actually exists, that it has any chance of passage in the Colorado legislature.\n \n Ooh! Ooh! The Sky is Falling! The Sky is Falling?\n \n Golly gee, Little Chicken, take your tranks!", 
   {}, 
   398051, 
   null, 
   1271183280.0
  ], 
  [
   398060, 
   null, 
   "NATO 556", 
   "Show me the bill.\n\n \n http://www.leg.state.co.us/CLICS/CLICS2010A/csl.nsf/fsbillcont3/C1959E96A707A9D3872576E00073BDEA?Open&file=1391_01.pdf", 
   {}, 
   398055, 
   null, 
   1271185500.0
  ], 
  [
   398066, 
   null, 
   "sinjin", 
   "The bill seeks to keep in place existing provisions that are scheduled to be automatically repealed this July.\n \n The provisions disallow transfer of a firearm to someone arrested and or/charged where the case is ongoing. No acquittal or conviction yet.\n \n An arrest on one's record where the case is settled will not prevent you from buying a firearm, unless that arrest ended with a conviction \n that precludes one from legally buying firearms.\n \n Should one be able to stock up on weapons while out on bail, accused of a crime that if convicted, would cause forfeiture of one's 2A rights?", 
   {}, 
   398060, 
   null, 
   1271186820.0
  ], 
  [
   398075, 
   null, 
   "Doc Jones", 
   "The bill seeks to keep in place existing provisions that are scheduled to be automatically repealed this July.\n \n The provisions disallow transfer of a firearm to someone arrested and or/charged where the case is ongoing. No acquittal or conviction yet.\n \n An arrest on one's record where the case is settled will not prevent you from buying a firearm, unless that arrest ended with a conviction \n that precludes one from legally buying firearms.\n \n Should one be able to stock up on weapons while out on bail, accused of a crime that if convicted, would cause forfeiture of one's 2A rights?\n\n \n Gee slick, how does that work with other accused crimes; is one assumed guilty until they prove innocence? Are you allowed to work if you have been accused of theft or embezzlement? \n \n How does that work with CPS accusations?", 
   {}, 
   398066, 
   null, 
   1271189700.0
  ], 
  [
   398076, 
   null, 
   "Lurch907", 
   "\n Should one be able to stock up on weapons while out on bail, accused of a crime that if convicted, would cause forfeiture of one's 2A rights?\n\n \n The answer is Yes. Does the phrase innocent untill proven guilty ring a bell?", 
   {}, 
   398066, 
   null, 
   1271189700.0
  ], 
  [
   398083, 
   null, 
   "Tither", 
   "Ah, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n \n Nothing at all matters as much as the love of the right to bear arms.\n \n Carry Concealed\n\n Alright, I am going to have to call you on all of the above. Show us where this website says what you are claiming!\n \n What I see is, it is difficult it is to remain a law abiding citizen when there is so many different laws is each community one can drive through? Like the fact that it was a criminal offense to DRIVE through Tiffen Ohio while armed with a Concealed Carry permit. Let me inform you, the Tiffen police had no sense of humor because, in their eyes, Ignorance of their special Law is Absolutely No Excuse! Period! (Well, unless you are, in fact, a cop in one of the other cities, and one ran across an open carrier. Which is our Constitutional Right in Ohio. Then is seemed to be a very appropriate defense in their eyes. :) ) \n \n If you happened not know of Tiffen's law, because you are from another part of the state, you got a gun shoved into your neck, and put down on the ground face down with several police pointing their weapons at you because they Believe that You are a scum bag. Of course such an unjust law also fell before the Supreme Court of Ohio.\n \n Are you aware of how many laws one needs to learn before on can get the license to carry. Do you wish for people with a Concealed Handgun license to be uninformed? Are you aware of which state allows you to carry in their state with your states license? \n \n Why do you begrudge a website that will tell us these things. \n \n Oh I know, you must be one of them law deniers! supreme love... That love above all else... The love that cancels out all else -- life and liberty, freedom... \n \n Nothing at all matters as much as the denying the laws the Bill of Rights, and the Constitution of this nation.\n \n Too much over the top Simone?\n \n It is the LAW Simone. Obey it!", 
   {}, 
   397955, 
   null, 
   1271191380.0
  ], 
  [
   398084, 
   null, 
   "sinjin", 
   "The answer is Yes. Does the phrase innocent untill proven guilty ring a bell?\nAccused molester returns to chidcare position while awaiting trial?", 
   {}, 
   398076, 
   null, 
   1271191500.0
  ], 
  [
   398086, 
   null, 
   "Doc Jones", 
   "Accused molester returns to chidcare position while awaiting trial?\n\n \n Apples and oranges. One is a Constitutional right, the other is not.\n \n Is kalifornia a right to work state? Texas is. Neither can compare to a Constitutional right.\n \n Squirm so more little man :) emoticon_xgood", 
   {}, 
   398084, 
   null, 
   1271191860.0
  ], 
  [
   398087, 
   null, 
   "COBHC", 
   "I don't see any one nationally taking away the right to bear arms. All I see is a bunch of hysteria about the topic.\n \n Stop being so hysterical and screechy.\n\n \n No, you stop being so hysterical and screechy. You said that firearms are a threat to freedom; once again, why don't you explain how taking away rights leads to freedom?", 
   {}, 
   398042, 
   null, 
   1271192340.0
  ], 
  [
   398088, 
   null, 
   "Doc Jones", 
   "Let's cut to the chase!\n \n Remember Joe Horn? He was accused, his gun was taken, he replaced it and a jury acquitted him of all charges. \n \n The junkyard tenent in Dallas, shot two perps, his gun was taken, he replaced it with two more and finally was acquitted.\n \n I could go on and on but this should suffice.\n \n Even a convicted criminal has the right to self defense.\n \n Your call is for more loss of rights and more gun control. It is that simple and unConstitutional, against the very concept of Constitutional rights and the jury system...innocent until proven guilty. That is a valid point of law.", 
   {
    "post_info": {
     "post_title": "sinjin"
    }
   }, 
   398086, 
   null, 
   1271192640.0
  ], 
  [
   398089, 
   null, 
   "Lurch907", 
   "Accused molester returns to chidcare position while awaiting trial?\n\n \n Stupid comparison, the right to keep and bear arms is specificly enumerated in the BOR, I don't see \"right to work in a daycare\" on the list. In my state the judge would set such stipulations as you mentioned above as part of bail conditions.\n Are you advocating removing constitutional rights from people who are not convicted of anything?", 
   {}, 
   398084, 
   null, 
   1271193480.0
  ], 
  [
   398090, 
   null, 
   "simone", 
   "No, you stop being so hysterical and screechy. You said that firearms are a threat to freedom; once again, why don't you explain how taking away rights leads to freedom?\n\n Where did I say firearms are a threat to freedom? What was the context?\n \n Who is holding the firearms? Why is that person holding them?", 
   {}, 
   398087, 
   null, 
   1271193780.0
  ], 
  [
   398092, 
   null, 
   "COBHC", 
   "Where did I say firearms are a threat to freedom? What was the context?\n \n Who is holding the firearms? Why is that person holding them?\n \n\n \n Do you forget so quickly? :)\n \n \nAh, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n \n Nothing at all matters as much as the love of the right to bear arms.\n \n Carry Concealed\n", 
   {}, 
   398090, 
   null, 
   1271194380.0
  ], 
  [
   398093, 
   null, 
   "Doc Jones", 
   "Where did I say firearms are a threat to freedom? What was the context?\n\n \n I am not COBHC but it sure appears that way from your very first post:\n \n \nLove of the right to bear arms... \n \n --------------------------------------------------------------------------------\n \n Ah, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n Nothing at all matters as much as the love of the right to bear arms.\n \n\n \n \nWho is holding the firearms? Why is that person holding them?\n\n \n NOYFB :) emoticon_xgood\n \n You should go eat at the BBQ place in Alamagordo and get a dose of that spontaneous regularity. Course you got all that in Albaqurque in the sagebrush flat... emoticon_smile", 
   {}, 
   398090, 
   null, 
   1271194440.0
  ], 
  [
   398094, 
   null, 
   "simone", 
   "Oh, Young Grasshopper, it is not the guns, it is the love of the guns that cancels everything else out.", 
   {}, 
   398093, 
   null, 
   1271194740.0
  ], 
  [
   398095, 
   null, 
   "COBHC", 
   "Oh, Young Grasshopper, it is not the guns, it is the love of the guns that cancels everything else out.\n\n \n How is that?", 
   {}, 
   398094, 
   null, 
   1271194800.0
  ], 
  [
   398098, 
   null, 
   "simone", 
   "It is how I said it:\n \nLove of the right to bear arms... \n Ah, that supreme love...\n \n That love above all else...\n \n The love that cancels out all else -- life and liberty, freedom...\n Nothing at all matters as much as the love of the right to bear arms. \n\n Pay heed to what I said, not what you THINK I said.\n \n Do you understand, Young Grasshopper?", 
   {}, 
   398095, 
   null, 
   1271195280.0
  ], 
  [
   398100, 
   null, 
   "COBHC", 
   "It is how I said it:\n \n Pay heed to what I said, not what you THINK I said.\n \n Do you understand, Young Grasshopper?\n\n \n No, because you're just repeating the same delusional rant. If you actually understood pro-gun ideology, you'd realize that responsible gun owners stand for freedom. Not just the freedom to own guns, but everything garunteed in our Bill of Rights. You forget history pretty quickly simone. Don't you realize that the Irish were denied firearms in 1845, the Jews in Germany were denied firearms in 1939, the Ugandans were denied firearms in 1971, the North Koreans are denied firearms to this day. The list goes on.\n \n You obviously don't understand what you're ranting about.", 
   {}, 
   398098, 
   null, 
   1271195520.0
  ], 
  [
   398101, 
   null, 
   "sinjin", 
   "Are you advocating removing constitutional rights from people who are not convicted of anything?\nMore like a temporary suspension of a right when a conviction for the crime one is accused of would result in removal of that right.", 
   {}, 
   398089, 
   null, 
   1271195760.0
  ], 
  [
   398103, 
   null, 
   "Doc Jones", 
   "It is how I said it:\n \n Pay heed to what I said, not what you THINK I said.\n \n Do you understand, Young Grasshopper?\n\n \n None of the others would be possible without the right to keep and bear arms.\n \n Did you know Beretta has been making firearms since 1369 emoticon_xgood", 
   {}, 
   398098, 
   null, 
   1271195820.0
  ], 
  [
   398105, 
   null, 
   "Doc Jones", 
   "More like a temporary suspension of a right when a conviction for the crime one is accused of would result in their removal.\n\n \n No, more like evidence which under the 4A they are allowed to usually for about 90 days in most jurisdictions.\n Private property is private property.\n A picture works just dandy.", 
   {}, 
   398101, 
   null, 
   1271196180.0
  ], 
  [
   398107, 
   null, 
   "sinjin", 
   "...the right to keep and bear arms is specifically enumerated in the BOR, I don't see \"right to work in a daycare\" on the list.\n\n \n Does the phrase innocent untill proven guilty ring a bell?", 
   {}, 
   398089, 
   null, 
   1271196900.0
  ], 
  [
   398113, 
   null, 
   "Doc Jones", 
   "Does the phrase innocent untill proven guilty ring a bell?\n\n \n \n Not the same context slick but nice try. That would be more of a decision of the daycare center and parent concern.\n \n Apply it to CPS who seizes your kid from a complaint, that is a state action. \n Now you are put into the situation a man/woman exercising self defense is in; a right denied by a state action. Does the phrase, \"innocent until proven guilty ring a bell?\"\n \n In Louisiana, gun owners are still suing to get their guns back illegally seized from them by rogue authorities ignoring the Constitution. No crime, no accusation, no anything...just because they thought they could get away with it. Now put yourself in that context with CPS.", 
   {}, 
   398107, 
   null, 
   1271198100.0
  ], 
  [
   398114, 
   null, 
   "Lurch907", 
   "More like a temporary suspension of a right when a conviction for the crime one is accused of would result in removal of that right.\n\n \n Yeah, pretty much what I said. The fact that you would suspend someones constitutional rights based on the mere accusation of wrong doing is scary. My hope is that you are in a small minority with that line of thinking.", 
   {}, 
   398101, 
   null, 
   1271198100.0
  ], 
  [
   398115, 
   null, 
   "Lurch907", 
   "Does the phrase innocent untill proven guilty ring a bell?\n\n \n Nice try, way to journey out of context. There is a huge difference between minor bail restrictions and the suspension of someones constitutional rights. Why don't you try comparing apples to apples.", 
   {}, 
   398107, 
   null, 
   1271198280.0
  ], 
  [
   398117, 
   null, 
   "sinjin", 
   "Nice try, way to journey out of context. There is a huge difference between minor bail restrictions and the suspension of someones constitutional rights. Why don't you try comparing apples to apples.\nNot rights, one specific right. Would you consider taking one's passport away when one is granted bail a minor restriction or the suspension of a right? How about arrest. Is arresting someone who's \"innocent until proven guilty\" a suspension of rights?", 
   {}, 
   398115, 
   null, 
   1271198760.0
  ], 
  [
   398119, 
   null, 
   "NATO 556", 
   "Should one be able to stock up on weapons while out on bail, accused of a crime that if convicted, would cause forfeiture of one's 2A rights?\n\n \n As the others have said, yes. Because the person is accused, not proven guilty of anything.\n \n Back in the 17th century you used to kill women who were accused of being witches. But not a single one was ever proven to actually be a witch or in league with the devil.\n \n Take a lesson from history. I don't see why accusations should be allowed as reason for suspension of a constitutional right. If such were common practice all one would need to do is accuse you of being a terrorist sympathizer and you'd automatically lose your right to associate with others, because you might be plotting a bombing.", 
   {}, 
   398066, 
   null, 
   1271198880.0
  ], 
  [
   398121, 
   null, 
   "sinjin", 
   "As the others have said, yes. Because the person is accused, not proven guilty of anything.\n \n Back in the 17th century you used to kill women who were accused of being witches. But not a single one was ever proven to actually be a witch or in league with the devil.\n \n Take a lesson from history. I don't see why accusations should be allowed as reason for suspension of a constitutional right. If such were common practice all one would need to do is accuse you of being a terrorist sympathizer and you'd automatically lose your right to associate with others, because you might be plotting a bombing.\nWhat happens to one's driver license when one has been arrested for DUI and is awaiting trial?", 
   {}, 
   398119, 
   null, 
   1271199420.0
  ], 
  [
   398123, 
   null, 
   "NATO 556", 
   "What happens to one's driver license when one has been arrested for DUI and is awaiting trial?\n\n \n My guess would be it's suspended. However driving a car isn't a constitutional right, it's nothing more than a privilege. Your right to travel isn't contingent upon operation of a motor vehicle.\n \n However as has been explained time and time again, driving a car and owning a gun are NOT comparable! You can't get away with doing a compare and contrast on this one.\n \n go on. Try and justify why a person's Second Amendment rights should be suspended indefinitely while they're awaiting trial for something they might not even have done in the first place. Explain how that qualifies as constitutional and reasonable.", 
   {}, 
   398121, 
   null, 
   1271199900.0
  ], 
  [
   398126, 
   null, 
   "Lurch907", 
   "Not rights, one specific right. Would you consider taking one's passport away when one is granted bail a minor restriction or the suspension of a right? How about arrest. Is arresting someone who's \"innocent until proven guilty\" a suspension of rights?\n\n \n Your really bad at comparisons. Yes surrendering your passport is a minor bail restriction. suspending the right to keep and bear arms, as enumerated in the constitution, is not a minor bail restriction. \n Depending on what is done after the arrest, yes it can be a suspension of rights (arrest does not always entail incarceration). However, it is only done after following due process restrictions that have been found to be in line with the constitution. \n Again, you need to make apples to apples comparisons. This one is a little closer, say apples to melons, previously you were comparing apples to elephants.", 
   {}, 
   398117, 
   null, 
   1271200680.0
  ], 
  [
   398127, 
   null, 
   "Lurch907", 
   "What happens to one's driver license when one has been arrested for DUI and is awaiting trial?\n\n \n This would be one of the apples to elephants comparisons.", 
   {}, 
   398121, 
   null, 
   1271200740.0
  ], 
  [
   398128, 
   null, 
   "NATO 556", 
   "I don't see any one nationally taking away the right to bear arms. All I see is a bunch of hysteria about the topic.\n\n \n Well then simple Simone, meet H.R. 2401: Read The Bill: H.R. 2401 - GovTrack.us\n \n Specifies right in there, adding the no fly list to the NICS background check database. If your name appears on the government's secret list, which is over one million names in size, your rights are denied for life and that's it. And we've seen how a single name could be shared by several thousand people in the country. Even children are on the no fly list, children who weren't even born when September 11th went down.\n \n You wanna try your claim again?", 
   {}, 
   398042, 
   null, 
   1271200800.0
  ], 
  [
   398129, 
   null, 
   "NATO 556", 
   "It is how I said it:\n \n Pay heed to what I said, not what you THINK I said.\n \n Do you understand, Young Grasshopper?\n\n \n We understand that your ignorance knows no bounds.\n \n You've failed to explain how a love of the rights within the constitution poses a threat to anything or anyone.\n \n Try again.", 
   {}, 
   398098, 
   null, 
   1271200920.0
  ], 
  [
   398132, 
   null, 
   "sinjin", 
   "This would be one of the apples to elephants comparisons.\nI was using it simply to illustrate society's right to be protected from someone commiting the same crime again before they can be prosecuted for the first offence.\n \n Someone caught red-handed robbing or murdering someone with a firearm could get out on bail and immediately go replace the weapon taken from them by police. This is what you support?", 
   {}, 
   398127, 
   null, 
   1271202240.0
  ], 
  [
   398133, 
   null, 
   "NATO 556", 
   "I was using it simply to illustrate society's right to be protected from someone commiting the same crime again before they can be prosecuted for the first offence.\n\n \n Society's right to be protected against a repeat offender individual, doesn't outweigh the individual rights of the people found within the Constitution.\n \n \nSomeone caught red-handed robbing or murdering someone with a firearm could get out on bail and immediately go replace the weapon taken from them by police. This is what you support?\n\n \n Like many others who use fear and distrust of your neighbors to try and peddle your message, you draw an interesting picture. But you don't present anything to actually back it up. You don't offer any information on the rates at which accused murderers actually get out on bail. And you don't do anything to address the fact that a hardened criminal who somehow did manage to get out on bail, would be free to just acquire another gun from black market sources.\n \n Trying to suspend constitutional rights because of a pending trial does nothing to address the serious issues of actually allowing bail for truly dangerous individuals who should be held on remand. So don't try and sell it as such.", 
   {}, 
   398132, 
   null, 
   1271203140.0
  ], 
  [
   398134, 
   null, 
   "sinjin", 
   "NewsModo: Article Display - NRA loses legislative round Senate supports strong background checks\n \n \"Tuesday's Senate vote comes as a national spotlight shines on the gun issue in Colorado in the wake of last April's Columbine High School massacre.\n \n But the background check has more to do with another murder in the Denver suburbs, this one in Castle Rock in June.\n \n That's when Simon Gonzales bought a gun and used it a few hours later to kill his three daughters, then start a gunbattle with police that left him dead. He was able to buy the gun because the the Senate State Affairs Committee had dropped the state's background check program months before.\n \n The FBI's background check left in its place did not detect the restraining order taken out on Gonzales by his estranged wife. The state's more comprehensive databases would have caught the restraining order.\n 'This could almost be a bill named after those kids,' said Ari Zavaras, chief of the Colorado Department of Public Safety. Zavaras, Owens' point man on gun issues, also oversees the CBI.", 
   {}, 
   398133, 
   null, 
   1271203980.0
  ], 
  [
   398135, 
   null, 
   "Tither", 
   "I think that this topic has wandered far from Simone's original slimming of the 2nd Amendment Bill of Right, and Concealed Carry.\n \n Laws allowing Concealed Carry were proposed and passed in now 48 states because the government, who is charged with protecting We the People Cannot. Cops very rarely are there when a crime is committed so it leaves the Law abiding Citizen in a much worse predicament. \n \n Since the police freely admit that they cannot, and We the People were falling victims to these violent predatory thugs, legislatures allowed people to legally obtain licenses after prescribed training. \n \n Simone Lifted her link from this post. http://www.4forums.com/political/gun-control-debates/14115-gunslingers-causing-too-many-problems-3.html#post397986 Which also proves that the Wild West that the Anti's and the Anti-gun sympathizers assured everyone would happen, if CCW laws were passed, never did happen and now we have the Right to carry in 48 states. \n \n I'm figuring that Simone was embarrassed by the facts so she started this thread to continue to slime be innuendo and emotion, apart from any actual facts or proof.", 
   {}, 
   398132, 
   null, 
   1271204040.0
  ], 
  [
   398136, 
   null, 
   "sinjin", 
   "Trying to suspend constitutional rights because of a pending trial does nothing to address the serious issues of actually allowing bail for truly dangerous individuals who should be held on remand.\nAllowing bail? You're talking out of both sides of your mouth again. Since when do we \"allow\" Constitutional rights?\n \n The Bill of Rights: Bail, Fines, and Cruel and Unusual Punishments\n \n The Eighth Amendment reads as follows: \n \n Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\n \n sinjin - Truly dangerous, \"innocent until proven guily\" individuals you mean, right? Denying bail is exactly the same thing as denying the right to buy a gun in this case.", 
   {}, 
   398133, 
   null, 
   1271204640.0
  ], 
  [
   398137, 
   null, 
   "Tither", 
   "Link   18th Annual National Survey Results of Police Chiefs & Sheriffs  \n \n The following survey questions were posed by mail of 22,587 Chiefs of Police and Sheriffs in the United States. It represents a cross section of professional command officers involving every state. The survey was conducted for the 18th consecutive year by the National Association of Chiefs of Police. (321)264-0911. Home, policeinfo@aphf.org. Permission to reproduce in whole or part is given if credit is given to the National Association of Chiefs of Police © 2005.\n \n \n  FIREARMS \n ...... 6. Do you maintain that criminals currently are able to obtain basically  any type of firearm by illegal means? (Machine guns?) Yes = 94.9% \n \n 8. Will a national concealed handgun permit reduce rates of violent crime as recent studies in some states have already reflected?  Yes = 59.9%  \n Oh boy 60% of them say that CCW permits will reduce crime in their cities. \n \n Do you really think making gun laws will prevent criminals from getting firearms? emoticon_smile", 
   {}, 
   398136, 
   null, 
   1271205300.0
  ], 
  [
   398138, 
   null, 
   "Tither", 
   "  Amid cuts, Ohio judge tells citizens to carry guns \nOne judge's solution for citizens feeling less secure because of budget cuts in an Ohio county: Carry a gun.\n \n Judge Alfred Mackey of Ashtabula County Common Pleas Court advised residents Friday to be vigilant and arm themselves because the number of deputies has been cut about in half because of a tight budget. He also urged neighbors to organize anti-crime block watch groups.\n \n Mackey, whose comments were first broadcast Thursday by WKYC-TV in Cleveland, was expressing concerns with budget cuts that have trimmed the sheriff's department from 112 to 49 deputies in the county, which is Ohio's largest by land area.\n \n Asked by WKYC how people should respond to the cuts and limited patrols, he said, \"Arm themselves. Be very careful and just be vigilant because we're going to have to look after each other.\"\n \n", 
   {}, 
   398137, 
   null, 
   1271205780.0
  ], 
  [
   398139, 
   null, 
   "NATO 556", 
   "NewsModo: Article Display - NRA loses legislative round Senate supports strong background checks\n\n \n Well then Colorado is gonna have one f*** of a lawsuit on its hands for deciding to support this piece of ignorance. There's no way this bill, if signed into law, is going to pass constitutional muster.", 
   {}, 
   398134, 
   null, 
   1271206020.0
  ], 
  [
   398140, 
   null, 
   "Lurch907", 
   "I was using it simply to illustrate society's right to be protected from someone commiting the same crime again before they can be prosecuted for the first offence.\n\n \n Wrong, you were comparing a minor bail restriction like suspending someones drivers license to taking away (however temporarily) someones constitutionaly enumerated rights. Its a lame comparison and utterly fails to demonstrate your apparent belief that it is ok to suspend someones right to keep and bear arms based on an accusation of wrong doing.\n \n \nSomeone caught red-handed robbing or murdering someone with a firearm could get out on bail and immediately go replace the weapon taken from them by police. This is what you support? \n\n \n I would say that someone caught red-handed robbing or murdering someone could and should be remanded without bail, an action that would be well within the restrictions of due process. So no, what you stated is not what I support. Nice try though.", 
   {}, 
   398132, 
   null, 
   1271206680.0
  ], 
  [
   398141, 
   null, 
   "NATO 556", 
   "Allowing bail? You're talking out of both sides of your mouth again. Since when do we \"allow\" Constitutional rights?\n \n The Bill of Rights: Bail, Fines, and Cruel and Unusual Punishments\n \n The Eighth Amendment reads as follows: \n \n Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\n \n sinjin - Truly dangerous, \"innocent until proven guily\" individuals you mean, right? Denying bail is exactly the same thing as denying the right to buy a gun in this case.\n\n \n I'm not seeing it. If someone is fit to be out on bail rather than remanded to a holding cell until trial, that usually means there's not sufficient evidence to prove that they're an immediate danger to society. And if they're not an immediate danger that should be held in custody, there's no reason to deny them their firearm ownership rights until after trial proves the fact that they're innocent.", 
   {}, 
   398136, 
   null, 
   1271206860.0
  ], 
  [
   398174, 
   null, 
   "Tither", 
   "California.\n   Stanislaus County sheriff signs pledge to make gun permits easier \n People with a clean record who want to carry a gun will have a much better chance at snagging a concealed weapon permit, Sheriff Adam Christianson said Monday, drawing thunderous applause from firearms advocates.\n \n The stunning change in policy comes as Christianson prepares to lay off dozens of deputies because of budget cuts. He has released 300 inmates to comply with new state rules.\n \n \"I'm not going to infringe upon your right to protect yourselves,\" the sheriff said. \"You are more likely to get a gun permit when you apply for one.\"\n \n The pledge reads, in part: \"As sheriff, self-protection shall always constitute good cause for the issuance of a permit to carry a concealed wea-pon as that term is defined in (the) California Penal Code.\"\n", 
   {}, 
   398141, 
   null, 
   1271253900.0
  ], 
  [
   398175, 
   null, 
   "Tither", 
   "  Good Samaritan Stops Bank Robbery Suspect \n DETROIT - It's time to thank a hero for stopping a suspected bank robber. The man stepped up to help protect his city.\n \n \"It's up to us as citizens to say hey, enough's enough,\" said Michael Farrow. \"We can help out.\"\n \n Good Samartian Michael Farrow saw him running down the street and decided to get involved.\n \n Farrow has a CCW and was carrying a gun when he told the man to stop and get down.\n \n \"He actually thought I was a police officer at the time,\" he said.\n\n Although this turned out well, and he got Cert of appreciation from the Police chief, one must make absolutely sure one knows EXACTLY what one is doing. There a Lot of People who would love nothing more than to put a CCW permit holder in the greatest jackpot anyone can Imagine. \n \n Isn't that right Simone and Brady? \n \n Galileo would probably want to see him into a Militia training requirement just because he owns a gun. Not that Galileo would want to go into a structure of training himself. emoticon_xangel", 
   {}, 
   398174, 
   null, 
   1271254380.0
  ], 
  [
   398176, 
   null, 
   "Tither", 
   "  Joseph W. McQuaid: One gutsy lady \n New Hampshire women owe a big debt of gratitude to Alton's Pat Fuller. Her candid and courageous story of surviving a home invasion and sexual assault can help others not only survive, but make vicious criminals think twice before attacking.\n \n She has taken a course in handgun safety offered by the National Rifle Association. And she has joined the Second Amendment Sisters, a women's group advocating gun owner rights.\n \n She had a gun in her house, Fuller told our correspondent, Roger Amsden. But it was unloaded and locked up. That won't happen again, she said. (emoticon_smile)\n \n \"I don't advocate anyone just go out and buy a gun. You have to learn how to use it properly and I hadn't done that. But if you do buy one for self-defense, learn how to use it the right way.''\n \n That is exactly the way to go about it. Local firing ranges, gun clubs and shops, and the Gun Owners of New Hampshire are happy to provide advice and guidance.\n", 
   {}, 
   398175, 
   null, 
   1271255220.0
  ], 
  [
   398179, 
   null, 
   "Doc Jones", 
   "Not rights, one specific right. Would you consider taking one's passport away when one is granted bail a minor restriction or the suspension of a right? How about arrest. Is arresting someone who's \"innocent until proven guilty\" a suspension of rights?\n\n \n Actually it is. That is why you are entitled to an attorney even before a 1517 magistration because you have become the focus of State prosecution. You are also entitled to contest the arrest ASAP in court in an open evidenciary hearing. Many cases are culminated by this simple process.\n \n As you probably have surmised, one heck of a lot of accusations are frivilous and malicious with no good intent at all. Take for instance someone of your 'bent' with a twisted disreguard for laws and rights of gunowners. There are indeed LEOs who haven't gotten the message yet! It is an individual Constitutional right and nothing you can say can justify your adament hard on for gun owners in general.", 
   {}, 
   398117, 
   null, 
   1271258100.0
  ], 
  [
   398183, 
   null, 
   "NATO 556", 
   "We've already established that in numerous states and cities, various police forces will intentionally arrest you for performing an activity that's fully legal, even when the Attorney General spells out in concrete terms that they can no longer do that.\n \n That's reason enough for objecting to the \"deny on arrest\" approach that Colorado wants.", 
   {}, 
   398179, 
   null, 
   1271259300.0
  ], 
  [
   398192, 
   null, 
   "sinjin", 
   "I would say that someone caught red-handed robbing or murdering someone could and should be remanded without bail, an action that would be well within the restrictions of due process. So no, what you stated is not what I support. Nice try though.\nWhat is remand if not the temporary suspension of a Constitutional right absent a conviction?\n \n Isn't that the apples to apples your were demanding?", 
   {}, 
   398140, 
   null, 
   1271264400.0
  ], 
  [
   398193, 
   null, 
   "sinjin", 
   "Well then Colorado is gonna have one f*** of a lawsuit on its hands for deciding to support this piece of ignorance. There's no way this bill, if signed into law, is going to pass constitutional muster.\nOne might have expected a challenge before now. This goes back in Colorado to 1994.", 
   {}, 
   398139, 
   null, 
   1271264700.0
  ], 
  [
   398195, 
   null, 
   "sinjin", 
   "I'm not seeing it. If someone is fit to be out on bail rather than remanded to a holding cell until trial, that usually means there's not sufficient evidence to prove that they're an immediate danger to society. And if they're not an immediate danger that should be held in custody, there's no reason to deny them their firearm ownership rights until after trial proves the fact that they're innocent.\nHow do you square supporting the temporary suspension of one's Constitutional right to bail \n but not the right to arm oneself with a firearm when the reasoning appears to be the same?", 
   {}, 
   398141, 
   null, 
   1271265540.0
  ], 
  [
   398196, 
   null, 
   "Tither", 
   "One might have expected a challenge before now. This goes back in Colorado to 1994. \n \n Not that I am saying anything about Colorado and or it's law, because I haven't even been reading those posts. This is a point of logic instead. If I remember correctly, the DC gun ban started in 1976. \n \n When did it get challenged? And yet, it was found to be totally unconstitutional. \n \n Just because no one has challenged it yet, is not proof of it's constitutionality.\n \n However, this is actually a better question for our Bryan.", 
   {}, 
   398193, 
   null, 
   1271265720.0
  ], 
  [
   398197, 
   null, 
   "sinjin", 
   "Not that I am saying anything about Colorado and or it's law, because I haven't even been reading those posts. This is a point of logic instead. If I remember correctly, the DC gun ban started in 1976. \n \n When did it get challenged? And yet, it was found to be totally unconstitutional. \n \n Just because no one has challenged it yet, is not proof of it's constitutionality.\nPoint taken. It does not prove anything.\n \n I was responding to Nato's passion predicting an \"[expletive deleted] of a lawsuit\".\n \n @Nato - What's with the sudden fondness for profanity?", 
   {}, 
   398196, 
   null, 
   1271266020.0
  ], 
  [
   398200, 
   null, 
   "NATO 556", 
   "One might have expected a challenge before now. This goes back in Colorado to 1994.\n\n \n I thought the deny on arrest standard went into effect in 2000.\n \n And I'm sure the only reason a challenge wasn't filed was because of the sunset provision. But you make this permanent and it's gonna be like painting a bulls eye on the state.", 
   {}, 
   398193, 
   null, 
   1271267100.0
  ], 
  [
   398201, 
   null, 
   "NATO 556", 
   "How do you square supporting the temporary suspension of one's Constitutional right to bail but not the right to arm oneself with a firearm when the reasoning appears to be the same?\n\n \n Simply because you have the right to bail, doesn't mean your rights are denied when you're denied bail.\n \n The entire bail process is decided upon by a judge during the initial hearing to determine if there's sufficient evidence to go to trial. The motion to deny bail is based on a prosecutor's belief that the accused is either a danger to themselves and others, or if they're a flight risk and likely to leave the jurisdiction that can punish them.\n \n There's oversight and due process in determining if a suspect is fit to have bail or be held in a secure facility. However there's no due process with the deny on arrest process.", 
   {}, 
   398195, 
   null, 
   1271267400.0
  ], 
  [
   398202, 
   null, 
   "NATO 556", 
   "@Nato - What's with the sudden fondness for profanity?\n\n \n Contempt for legislature small minds who don't know their head from a hole in the ground and have no logical or real world thinking skills.\n \n It's really no different than Simone hurling out the phrase \"tea bagger\" all the time. Anybody with an internet connection can find out what act the phrase refers to and know what she's talking about.\n \n Between hurling sexual connotations, and hurling curses, I think the curses are more acceptable.", 
   {}, 
   398197, 
   null, 
   1271267640.0
  ], 
  [
   398203, 
   null, 
   "sinjin", 
   "I thought the deny on arrest standard went into effect in 2000.\nThe present form of the provisions did but I read this in the link I provided before:\n \n \"The ability to deny on arrest had been part of the state's program since 1994.\" \n \n \nAnd I'm sure the only reason a challenge wasn't filed was because of the sunset provision.\nSo the NRA is okay with laws that deprive citizens of their Constitutional rights that are temporary, \n but not laws that temporarily deprive citizens of their Constitutional rights? Got it.emoticon_xgood", 
   {}, 
   398200, 
   null, 
   1271267700.0
  ], 
  [
   398204, 
   null, 
   "sinjin", 
   "Simply because you have the right to bail, doesn't mean your rights are denied when you're denied bail.\n \n The entire bail process is decided upon by a judge during the initial hearing to determine if there's sufficient evidence to go to trial. The motion to deny bail is based on a prosecutor's belief that the accused is either a danger to themselves and others, or if they're a flight risk and likely to leave the jurisdiction that can punish them.\n \n There's oversight and due process in determining if a suspect is fit to have bail or be held in a secure facility. However there's no due process with the deny on arrest process.\nIs or is not the right to bail specifically enumerated in the BOR?", 
   {}, 
   398201, 
   null, 
   1271267820.0
  ], 
  [
   398205, 
   null, 
   "sinjin", 
   "Between hurling sexual connotations, and hurling curses, I think the curses are more acceptable.\nThe filters in place suggest otherwise.", 
   {}, 
   398202, 
   null, 
   1271267880.0
  ], 
  [
   398206, 
   null, 
   "NATO 556", 
   "So the NRA is okay with laws that deprive citizens of their Constitutional rights that are temporary, but not laws that temporarily deprive citizens of their Constitutional rights? Got it.emoticon_xgood\n\n \n I'm just speculating. \n \n Why didn't California gun owners sue over the state's registration and then confiscation of the SKS rifles?\n \n Also an interesting case. United States v. Hyppolite specified that under the \"abuse-of-discretion\" standard, appellate courts may overturn a fine that is arbitrary, capricious, or \"so grossly excessive as to amount to a deprivation of property without due process of law.\"\n \n So under that standard I don't see how the deny on arrest standard can be allowed to stand.\n \n \nIs or is not the right to bail specifically enumerated in the BOR?\n\n \n The 8th Amendment forbids excessive bail and fines. That's not the same as to say that bail shall be applied to everyone.\n \n \nThe filters in place suggest otherwise.\n\n \n At least I'm not accusing people of being sexual deviants and perverts.", 
   {}, 
   398205, 
   null, 
   1271268360.0
  ], 
  [
   398207, 
   null, 
   "Lurch907", 
   "What is remand if not the temporary suspension of a Constitutional right absent a conviction?\n \n Isn't that the apples to apples your were demanding?\n\n \n Nope, still not apples to apples. While remand is a temporary suspension of constitutional rights, it is done through a constitutionaly acceptable due process. Taking the right to keep and bear arms from someone who could not be remanded is not acceptable under a constitutionaly valid due process proceedure. \n I know, I know, that silly 8th ammendment keeps getting in your way.", 
   {}, 
   398192, 
   null, 
   1271269860.0
  ], 
  [
   398209, 
   null, 
   "sinjin", 
   "Nope, still not apples to apples. While remand is a temporary suspension of constitutional rights, it is done through a constitutionaly acceptable due process. Taking the right to keep and bear arms from someone who could not be remanded is not acceptable under a constitutionaly valid due process proceedure. \n I know, I know, that silly 8th ammendment keeps getting in your way.\nWalk me through the \"Constitutionally acceptable due process\" part of remand. The prosecutor tells the judge that this guy is dangerous and the judge agrees or disagrees. Is there more? \n \n Would you support \"deny on arrest\" if a judge reviewed the arrests and concurred?", 
   {}, 
   398207, 
   null, 
   1271271240.0
  ], 
  [
   398219, 
   null, 
   "Lurch907", 
   "Walk me through the \"Constitutionally acceptable due process\" part of remand. The prosecutor tells the judge that this guy is dangerous and the judge agrees or disagrees. Is there more? \n \n Would you support \"deny on arrest\" if a judge reviewed the arrests and concurred?\n\n \n Explaining the due process requirements would take far more time than I have to give here. I'm going to have to ask that you do your own research on this one. Sorry.", 
   {}, 
   398209, 
   null, 
   1271273220.0
  ], 
  [
   398226, 
   null, 
   "simone", 
   "Sinjin, have you ever considered the problem of murky, misinformed, not to mention willfully ignorant, understanding?\n \n It seems to be something that one encounters a lot in these here precincts.", 
   {}, 
   398219, 
   null, 
   1271274120.0
  ], 
  [
   398230, 
   null, 
   "Lurch907", 
   "Sinjin, have you ever considered the problem of murky, misinformed, not to mention willfully ignorant, understanding?\n \n It seems to be something that one encounters a lot in these here precincts.\n\n \n This coming from someone who tried to suggest that Confederate army soldiers and the terrorists Taliban are virtually the same thing.", 
   {}, 
   398226, 
   null, 
   1271274360.0
  ], 
  [
   398231, 
   null, 
   "NATO 556", 
   "Sinjin, have you ever considered the problem of murky, misinformed, not to mention willfully ignorant, understanding?\n \n It seems to be something that one encounters a lot in these here precincts.\n\n \n Primarily from your side of the aisle in all arguments. You really described yourself a T.", 
   {}, 
   398226, 
   null, 
   1271274420.0
  ], 
  [
   398236, 
   null, 
   "sinjin", 
   "Sinjin, have you ever considered the problem of murky, misinformed, not to mention willfully ignorant, understanding?\n \n It seems to be something that one encounters a lot in these here precincts.\nA problem that afflicts both ends of the spectrum IMO. The difference being that one end seems a bit more aggressive \n than the other IMO. Not really surprising given the fact that pacifists are at the other end.\n \n I myself am somewhat aggressive here and in the real world. I just lack any fondess for firearms and prefer to limit my violent responses when appropriate to fists and feet. That and the fact that having traveled extensively overseas, I am accustomed to a gun not being an option, so one must be prepared to go unarmed or not at all.", 
   {}, 
   398226, 
   null, 
   1271274900.0
  ], 
  [
   398240, 
   null, 
   "Doc Jones", 
   "A problem that afflicts both ends of the spectrum IMO. The difference being that one ends seems a bit more aggressive \n than the other IMO. Not really surprising given the fact that pacifists are at the other end.\n \n I myself am somewhat aggressive here and in the real world. I just lack any fondess for firearms and prefer to limit my violent responses when appropriate to fists and feet. That and the fact that having traveled extensively overseas, I am accustomed to a gun not being an option, so one must be prepared to go unarmed or not at all.\n\n \n Here lies little sinjin\n Who thought of himself as an Injun,\n He relied on bow arrow and knife\n That is why he lost his life.\n \n His wits didn't save him\n Because his skills betrayed him\n And for this simple reason\n There is a shortage of Injuns.", 
   {
    "post_info": {
     "post_title": "Epitath:"
    }
   }, 
   398236, 
   null, 
   1271275860.0
  ], 
  [
   398243, 
   null, 
   "sinjin", 
   "Explaining the due process requirements would take far more time than I have to give here. I'm going to have to ask that you do your own research on this one. Sorry.\nRemarkably, this response would work just as well for one who is lazy, ignorant or mistaken. Maybe even all three.", 
   {}, 
   398219, 
   null, 
   1271276100.0
  ], 
  [
   398244, 
   null, 
   "Doc Jones", 
   "Remarkably, this response would work just as well for one who is lazy, ignorant or mistaken. Maybe even all three.\n\n \n Your response is all three. You have described yourself rather well.\n \n I have ask before but will again, why do you persist in trying to argue something you know nothing about? This is mere troll behavior. You make illogical, unsubstantiated claims and then can't back them up and excuse your ignorance by placing them in your chair. :xcensored", 
   {}, 
   398243, 
   null, 
   1271276460.0
  ], 
  [
   398248, 
   null, 
   "sinjin", 
   "Denying Bail for a Dangerous Defendant - Lawyers.com", 
   {}, 
   398244, 
   null, 
   1271280960.0
  ], 
  [
   398249, 
   null, 
   "simone", 
   "Here lies little sinjin\n Who thought of himself as an Injun,\n He relied on bow arrow and knife\n That is why he lost his life.\n \n His wits didn't save him\n Because his skills betrayed him\n And for this simple reason\n There is a shortage of Injuns.\n\n Is this a paen in praise of the mass slaughter of the First Americans?", 
   {}, 
   398240, 
   null, 
   1271282340.0
  ], 
  [
   398251, 
   null, 
   "Doc Jones", 
   "Is this a paen in praise of the mass slaughter of the First Americans?\n\n \n Nice try but you missed again through lack of education perhaps?\n \n You do understand that the federal government denied the Indians firearms as well as firewater no doubt? ...or maybe you don't which is no surprise.\n \n Now we have people volunteering. ...and here you are auditioning for the second act. emoticon_xgood", 
   {}, 
   398249, 
   null, 
   1271282760.0
  ], 
  [
   398252, 
   null, 
   "sinjin", 
   "Guess I haven't been missing much.emoticon_xgood", 
   {}, 
   398251, 
   null, 
   1271282880.0
  ], 
  [
   398254, 
   null, 
   "Doc Jones", 
   "Guess I haven't been missing much.emoticon_xgood\n\n \n From your past performances, small talk would be about all you could comprehend :) emoticon_xgood", 
   {}, 
   398252, 
   null, 
   1271283120.0
  ], 
  [
   398256, 
   null, 
   "Doc Jones", 
   "A couple who had been married for 20 years and done well in life with a nice home and lots of money were approaching Christmas. The woman kept dropping subtle hints about a sporty car for her present. One day, not long before Christmas, she told her husband she wanted something that would go from 0 to 160 in less than 10 seconds.\n \n So, he got her a bathroom scale...and that is when the fight started.", 
   {}, 
   398254, 
   null, 
   1271283720.0
  ], 
  [
   398311, 
   null, 
   "Bryan", 
   " Sinjin, have you ever considered the problem of murky, misinformed, not to mention willfully ignorant, understanding?\n \n It seems to be something that one encounters a lot in these here precincts. \n\n \n Simone, I understand you claim this is a problem. But your complaint is like the person who is too lazy to go out and vote who nevertheless feels justified in complaining about what his representatives are doing. To both them and to you I say get up then and do something about it. Simone, you must be willing to put forth some effort if you want me to take your complaints seriously. Your threads are like a beach ball that keeps getting knocked out into water that&#8217;s over your head&#8212;and you refuse to swim out and retrieve them. This is why your threads keep getting hijacked like this. So why don&#8217;t you take off the water wings of raw emotion and sarcasm for a moment and join us in the deep end of the pool with some actual facts. Please, this is your thread&#8212;come on out and join us. I promise I won&#8217;t try to hold you under.\n \n Now, while I wait for you, let me talk to those who have already passed the swim test&#8230;.\n \n I do not believe that any right in our Bill of Rights is absolute. I have never made that claim about the RKBA, and I will never make the claim for the 8th. Amendment right to bail. The 8th. Amendment language in question uses qualifying language &#8220;Excessive bail shall not be required&#8221; much the same way that the 4th. Amendment uses the qualifying language &#8220;The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures&#8230;.&#8221; \n \n Oh, and by the way, there is that &#8220;right of the people&#8221; language showing up again, just like in the 1st. and 2nd. Amendments. For all those &#8220;2nd. Amendment only guarantees a collective right&#8221; fans out there, let me ask this: What is the source of the magic that takes the individual right phrase &#8220;the right of the people&#8221; in the 1st. Amendment, then transforms it into a collective right in the 2nd. Amendment, and then morphs it back into an individual right in the 4th. Amendment?\n \n But back to the right to bail&#8212;it is not absolute. \n \n \n Walk me through the \"Constitutionally acceptable due process\" part of remand. The prosecutor tells the judge that this guy is dangerous and the judge agrees or disagrees. Is there more? \n\n \n Sinjin, here is a case that I think answers your question. The case dealt with the federal law mentioned in the Lawyers.com article you cited earlier. Incidentally, Virginia (and I suspect many other states) modeled its bail laws to operate similarly after this case was decided. \n \n First, here are the facts as SCOTUS recites them:\n \n The Bail Reform Act of 1984 (Act) requires courts to detain prior to trial arrestees charged with certain serious felonies if the Government demonstrates by clear and convincing evidence after an adversary hearing that no release conditions &#8220;will reasonably assure . . . the safety of any other person and the community.&#8221; 18 U.S.C. § 3142(e) (1982 ed., Supp. III). The Act provides arrestees with a number of procedural rights at the detention hearing, including the right to request counsel, to testify, to present witnesses, to proffer evidence, and to cross-examine other witnesses. The Act also specifies the factors to be considered in making the detention decision, including the nature and seriousness of the charges, the substantiality of the Government's evidence, the arrestee's background and characteristics, and the nature and seriousness of the danger posed by his release. Under the Act, a decision to detain must be supported by written findings of fact and a statement of reasons, and is immediately reviewable. After a hearing under the Act, the District Court ordered the detention of respondents, who had been charged with 35 acts of racketeering activity. The Court of Appeals reversed, holding that § 3142(e)'s authorization of pretrial detention on the ground of future dangerousness is facially unconstitutional as violative of the Fifth Amendment's substantive due process guarantee.\n \n In this case, the defendants argued that the 8th Amendment guaranteed them a right to be free on bail pending trial. As you can see the 2nd. Circuit Court of Appeals essentially agreed and held the law to be unconstitutional. SCOTUS disagreed and held the law to be constitutional. An important factor for SCOTUS was the framework of procedural safeguards that were given to the suspect when the decision is made to grant or deny bail. SCOTUS also ruled that the governmental interest in denying bail for some persons can go beyond just flight to avoid prosecution but can also include consideration of the danger the person poses to society if not held until trial. Here is the portion of the ruling which I believe sets forth the reasoning why the right to be free on bail pending trial is not absolute and can be balanced against these &#8220;compelling&#8221; state interests: \n \n While we agree that a primary function of bail is to safeguard the courts' role in adjudicating the guilt or innocence of defendants, we reject the proposition that the Eighth Amendment categorically prohibits the government from pursuing other admittedly compelling interests through regulation of pretrial release. The above-quoted dictum in Stack v. Boyle is far too slender a reed on which to rest this argument. The Court in Stack had no occasion to consider whether the Excessive Bail Clause requires courts to admit all defendants to bail, because the statute before the Court in that case in fact allowed the defendants to be bailed. Thus, the Court had to determine only whether bail, admittedly available in that case, was excessive if set at a sum greater than that necessary to ensure the arrestees' presence at trial.\n \n The holding of Stack is illuminated by the Court's holding just four months later in Carlson v. Landon, 342 U.S. 524 (1952). In that case, remarkably similar to the present action, the detainees had been arrested and held without bail pending a determination of deportability. The Attorney General refused to release the individuals, &#8220;on the ground that there was reasonable cause to believe that [their] release would be prejudicial to the public interest and would endanger the welfare and safety of the United States.&#8221; Id., at 529 (emphasis added). The detainees brought the same challenge that respondents bring to us today: the Eighth Amendment [Page 754] required them to be admitted to bail. The Court squarely rejected this proposition:\n \n &#8220;The bail clause was lifted with slight changes from the English Bill of Rights Act. In England that clause has never been thought to accord a right to bail in all cases, but merely to provide that bail shall not be excessive in those cases where it is proper to grant bail. When this clause was carried over into our Bill of Rights, nothing was said that indicated any different concept. The Eighth Amendment has not prevented Congress from defining the classes of cases in which bail shall be allowed in this country. Thus, in criminal cases bail is not compulsory where the punishment may be death. Indeed, the very language of the Amendment fails to say all arrests must be bailable.&#8221; Id., at 545-546 (footnotes omitted).\n \n Carlson v. Landon was a civil case, and we need not decide today whether the Excessive Bail Clause speaks at all to Congress' power to define the classes of criminal arrestees who shall be admitted to bail. For even if we were to conclude that the Eighth Amendment imposes some substantive limitations on the National Legislature's powers in this area, we would still hold that the Bail Reform Act is valid. Nothing in the text of the Bail Clause limits permissible Government considerations solely to questions of flight. The only arguable substantive limitation of the Bail Clause is that the Government's proposed conditions of release or detention not be &#8220;excessive&#8221; in light of the perceived evil. Of course, to determine whether the Government's response is excessive, we must compare that response against the interest the Government seeks to protect by means of that response. Thus, when the Government has admitted that its only interest is in preventing flight, bail must be set by a court at a sum designed to ensure that goal, and no more. Stack v. Boyle, supra. We believe that when Congress has mandated detention on the basis of a compelling interest other than prevention [Page 755] of flight, as it has here, the Eighth Amendment does not require release on bail.\n \n III\n \n In our society liberty is the norm, and detention prior to trial or without trial is the carefully limited exception. We hold that the provisions for pretrial detention in the Bail Reform Act of 1984 fall within that carefully limited exception. The Act authorizes the detention prior to trial of arrestees charged with serious felonies who are found after an adversary hearing to pose a threat to the safety of individuals or to the community which no condition of release can dispel. The numerous procedural safeguards detailed above must attend this adversary hearing. We are unwilling to say that this congressional determination, based as it is upon that primary concern of every government &#8212; a concern for the safety and indeed the lives of its citizens &#8212; on its face violates either the Due Process Clause of the Fifth Amendment or the Excessive Bail Clause of the Eighth Amendment.\n \n United States v. Salerno, 481 U.S. 739, 753-755 (1987)\n \n Justice Breyer cites this case in his dissent in Heller. He claimed it supported his proposed &#8220;interest balancing inquiry&#8221; test for weighing the RKBA against the District of Columbia&#8217;s claimed governmental interest in the DC handgun ban. I believe he was wrong to suggest that Salerno supports his newly created and proposed &#8220;whatever the judge personally thinks about the issue&#8221; test, but that is an argument for another day&#8230;. \n \n Now even where rights are expressed in absolute terms the rights have not (and should not be) viewed as absolute. It does not get any more absolute, for example, than in the 1st Amendment: \n \n &#8220;Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.&#8221; \n \n Yet Congress can pass a law that says offering a human sacrifice to appease the god of your choice is murder. This is because SCOTUS has ruled that none of these rights are absolute, and even where a law impacts the right directly it can still be held to be constitutional. In many instances SCOTUS uses a &#8220;strict scrutiny&#8221; test for deciding whether the challenged law violates the constitutional right. Under this test, the state must first show that a legitimate and &#8220;compelling&#8221; state interest exists for the particular infringement of the right. It must then show that the infringement is &#8220;necessary&#8221; to accomplish that compelling interest. Finally, it must show that the infringement was &#8220;narrowly&#8221; and &#8220;precisely&#8221; drawn&#8212;that is, no more restrictive than necessary to achieve the &#8220;compelling&#8221; interest.\n \n That&#8217;s all I ask for with the RKBA. I have never argued that the 2nd. Amendment RKBA is any more absolute than the right of free speech, and neither did SCOTUS in Heller. \n \n I assume that SCOTUS will incorporate the 2nd. Amendment RKBA when it decides McDonald. However, I predict (and I truly hope) that the vast majority of state laws regulating the RKBA will survive incorporation. I do not argue for special treatment for the RKBA. I only want it to get the same treatment our other fundamental rights enjoy. \n \n What say you, Simone? Are you willing to talk with me? I say discretion is not the better part of valor. You know I pick on Brady for running away from me all the time. Now let me use him as a verb. \n \n Don&#8217;t go Brady on me, Simone.\n \n ---\n \n Let the man of learning, the man of lettered leisure, beware of that XXXXX and cheap temptation to pose to himself and to others as a cynic, as the man who has outgrown emotions and beliefs, the man to whom good and evil are as one. The poorest way to face life is to face it with a sneer. There are many men who feel a kind of twisted pride in cynicism; there are many who confine themselves to criticism of the way others do what they themselves dare not even attempt. There is no more unhealthy being, no man less worthy of respect, than he who either really holds, or feigns to hold, an attitude of sneering disbelief....A cynical habit of thought and speech, a readiness to criticize work which the critic himself never tries to perform, an intellectual aloofness which will not accept contact with life's realities - all these are marks, not as the possessor would fain to think, of superiority but of weakness. They mark the men unfit to bear their part painfully in the stern strife of living, who seek, in the affection of contempt for the achievements of others, to hide from others and from themselves in their own weakness. The role is easy; there is none easier, save only the role of the man who sneers alike at both criticism and performance. \n \n It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat. Shame on the man of cultivated taste who permits refinement to develop into fastidiousness that unfits him for doing the rough work of a workaday world. Among the free peoples who govern themselves there is but a small field of usefulness open for the men of cloistered life who shrink from contact with their fellows. Still less room is there for those who deride of slight what is done by those who actually bear the brunt of the day; nor yet for those others who always profess that they would like to take action, if only the conditions of life were not exactly what they actually are. The man who does nothing cuts the same sordid figure in the pages of history, whether he be a cynic, or fop, or voluptuary. There is little use for the being whose tepid soul knows nothing of great and generous emotion, of the high pride, the stern belief, the lofty enthusiasm, of the men who quell the storm and ride the thunder. Well for these men if they succeed; well also, though not so well, if they fail, given only that they have nobly ventured, and have put forth all their heart and strength. It is war-worn Hotspur, spent with hard fighting, he of the many errors and valiant end, over whose memory we love to linger, not over the memory of the young lord who \"but for the vile guns would have been a valiant soldier.&#8212;from Theodore Roosevelt&#8217;s speech at the Sorbonne, Paris, April 23, 1910, entitled \"Citizenship in a Republic\"", 
   {
    "post_info": {
     "post_title": "Come on in, Simone, the water's fine"
    }
   }, 
   398200, 
   null, 
   1271313180.0
  ], 
  [
   398358, 
   null, 
   "sinjin", 
   "Thank you Bryan as always.\n \n In light of what you've posted concerning bail, what do you make of \"deny on arrest\" provisions such as those sunsetting in Colorado?", 
   {}, 
   398311, 
   null, 
   1271361960.0
  ], 
  [
   398360, 
   null, 
   "simone", 
   "But, according to Bryan, the right to bear arms is always absolute, right?", 
   {}, 
   398358, 
   null, 
   1271362080.0
  ], 
  [
   398361, 
   null, 
   "Tither", 
   "But, according to Bryan, the right to bear arms is always absolute, right?\n\n In other words, you haven't read a word he said. emoticon_xgood", 
   {}, 
   398360, 
   null, 
   1271362260.0
  ], 
  [
   398363, 
   null, 
   "Doc Jones", 
   "But, according to Bryan, the right to bear arms is always absolute, right?\n\n \n Only when it is used to offer a human sacrifice for religious reasons simone emoticon_xgood", 
   {}, 
   398360, 
   null, 
   1271362980.0
  ], 
  [
   398364, 
   null, 
   "sinjin", 
   "But, according to Bryan, the right to bear arms is always absolute, right?\n\n \n Just the opposite:\n \n \nI do not believe that any right in our Bill of Rights is absolute. I have never made that claim about the RKBA...\n", 
   {}, 
   398360, 
   null, 
   1271363520.0
  ], 
  [
   398374, 
   null, 
   "NATO 556", 
   "But, according to Bryan, the right to bear arms is always absolute, right?\n\n \n What part of \"I do not believe that any right in our Bill of Rights is absolute. I have never made that claim about the RKBA, and I will never make the claim for the 8th. Amendment right to bail.\" did you not comprehend?", 
   {}, 
   398360, 
   null, 
   1271370720.0
  ], 
  [
   398380, 
   null, 
   "sinjin", 
   "I do not believe simone is here with the intention of actually discussing.\n \n It would seem that throwing stones is more her forte. \n Odd considering her choice of signature line.\n \n She is not the only one so inclined.\n \n God love her all the same. emoticon_love", 
   {}, 
   398374, 
   null, 
   1271374020.0
  ], 
  [
   398402, 
   null, 
   "Bryan", 
   "Thank you Bryan as always.\n \n In light of what you've posted concerning bail, what do you make of \"deny on arrest\" provisions such as those sunsetting in Colorado?\n\n \n Sinjin, \n \n Well none of the links posted so far go to the actual law, at least as far as I can see. I did goggle it and found a Colorado Bureau of Investigations webpage that tells people what to do if their firearm purchase was denied because of an old arrest on their record that did not show the final outcome of the charge: Colorado Department of Public Safety\n \n From what I can gather this looks like an instant check issue concerning the accuracy of criminal record histories maintained in Colorado. Colorado appears to use a computerized instant check background check system similar to Virginia&#8217;s, in which the purchaser has his record checked for approval while he is in the store. \n \n In Virginia the State Police run the instant check system, and they run the purchaser&#8217;s info through the national database, NCIC, and the Virginia database, called VCIN. It is the same record check information that I see every day at work, except that records I request for investigation purposes are printed out and temporarily stored in the file of the defendant the record was run on. \n \n I think I&#8217;ve got an idea of what&#8217;s going on in Colorado, but let me first explain how the record check system works. All this information is put into a state-wide database by the local jurisdiction (which shares it with the national NCIC system). Say a warrant or indictment is issued charging me with a crime. The locality is responsible for inputting that information into the database. In many cases this is done even before I am arrested if the warrant is obtained before my arrest. One purpose for this is to let any other agency in the nation who happens to pull me over and run my license know instantly that I am wanted in the local jurisdiction for the charged crime. The info will include the description of the charged crime and whether it is a felony or misdemeanor. It will list the jurisdiction and contain the date the charge was filed. It will also immediately list the outcome as &#8220;disposition not received,&#8221; which means that the local jurisdiction has not posted the outcome of the charge yet. Until the case is finished this is what an instant check computer record check operator will see if I try to buy a gun at a dealer. \n \n It is the responsibility of the local agency to report the outcome of the case once it is finished (thereby making it available for the instant check operator to see it). Once that outcome is reported the electronic criminal record for that charge will change from &#8220;disposition not received&#8221; to read (I&#8217;ll use Virginia data entries for examples) something like &#8220;guilty&#8221;, &#8220;not guilty&#8221;, &#8220;dismissed&#8221; (if, for example, it was thrown out on a technicality and not an acquittal on the merits), and &#8220;Nolle Prosequi&#8221; (where a Va. Prosecutor dropped the charge but has leave to bring it back again).\n \n Virginia has a pretty good track record of reporting these dispositions to NCIC, but I do occasionally see records that show &#8220;disposition not received&#8221; for very old charges&#8212;and that is the fault of the local jurisdiction for not reporting what happened to the case (I see it a lot with charges from other states, quite frankly). In Colorado I do not know if that end result reporting duty rests with the local law enforcement agency or (more properly) with the clerks of the court the case was finished in. \n \n This is how the information is supposed to get into the system to be checked when I go buy a gun. Now let me compare Virginia to what I can see of Colorado&#8217;s system, and use a felony charge as an example. Both states will block the sale if the instant check system shows a felony conviction. If, however, the charge still lists &#8220;disposition not received,&#8221; then the states appear to do different things. \n \n Virginia permits the sale without any further obligation on the buyer to do anything, and requires the dealer to deliver the transaction form to the State Police, which is charged with immediately researching the matter to determine whether a disqualifying conviction was not recorded properly. If the State Police find this to be so, then that agency immediately notifies the dealer and the local law enforcement agency of the problem. Virginia can do it this way without burdening the purchaser because our criminal record infrastructure is able to ensure a high degree of accuracy with Instant Check. The burden therefore rests with the state to make sure the system is accurate up front&#8212;something Virginia does very well. \n \n Colorado, on the other hand, appears to block the sale and puts the burden on the purchaser to go get the court documents from the local jurisdiction showing that the charge was ended without a conviction. The burden therefore rests with the person who wants to clear his name because a local official did not report the proper outcome of his charge. \n \n What I say from here on is based upon the above assumption of Colorado&#8217;s system. If I have misunderstood that system then I invite correction on it. But if this is the system, then I have mixed feelings about it. Remember that before Instant Check we were forced to endure an old &#8220;snail mail&#8221; background check process that used to take up to two weeks of mailing back and forth before you got an answer approving the sale. The federal &#8220;Brady Bill&#8221; Instant Check scheme was supposed to get rid of the delay, and the NRA (and I) supported it because it promised to be accurate enough to remove the delay by making accurate records instantly reviewable. After all, if the records could be accurately checked instantly then the reason for the delay in the purchase goes away&#8212;despite the ill intentions of those who wanted to continue to force weeks of delay on us. But I agree that if the records are inadequate then instant check should be abandoned in that case to make sure the person can legitimately have the gun. So in theory I don&#8217;t have a problem with Colorado&#8217;s &#8220;wait and check to make sure if the arrest does not show a disposition&#8221; process. \n \n BUT, I read in the article Sinjin cited from February 2, 2000: \n \n &#8220;No one list tracks those arrested all the way through court. Colorado officials are working on a computer program that will match arrests with what happened to the suspects in court. But that system, by its best measure, is only 35 percent effective.&#8221; (emphasis added)\n \n This to me is unacceptable, and here is why:\n \n Someone mentioned earlier in this thread that the Colorado &#8220;deny it first and make the buyer prove he was found not guilty when the system doesn&#8217;t show it&#8221; system went back to 1994. That&#8217;s probably true, for that was when the federal Brady Act was signed and Instant Check came online nationwide. I bet at that time Colorado&#8217;s criminal record history database, reporting procedures, and local reporting habits were not complete enough to handle Instant Check. That is, Colorado probably did not have the infrastructure in place to handle Instant Check and make it fully reliable in 1994 (unlike, I&#8217;m proud to say, Virginia&#8217;s system, which was ready and accurate enough). Therefore, at that time they had a justification for having a delay to make sure the records were right (although I do have a problem with placing this duty on the buyer to support the indifference, laziness, or incompetence of the state reporting system)\n \n But six years later and the system can be accurate, at best, only 35% of the time? It appears they did very little to fix the problem in the six years from 1994 to 2000. Is that the fault of the gun buyer? Should he have had to wait six years to be told &#8220;we can still only get it right 35% of the time, so we have decided to continue to make you carry our water for us if we fail to report you were acquitted of the crime&#8221;?\n \n I understand from reading further that there is supposed to be a 2010 &#8220;sunset&#8221; of this &#8220;auto-denial for an arrest that does not show a disposition&#8212;and make the buyer fix our mistake for us&#8221; law. My guess is that the legislature set this up because it planned to build up Colorado&#8217;s system to make Instant Check reliable enough within those ten years from 2000 until now&#8212;thereby taking away the need for the burdensome law. \n \n So what has been going on in Colorado for the last decade? I read with interest in Sinjin&#8217;s article that some legislators ten years ago trumpeted their defiance of the NRA and that they were proud to have kept the burden on the gun buyer to make sure the state accurately recorded his criminal record history. And now I see it appears that either they or others cut from the same cloth want to remove the sunset of that law and keep it around. So I ask again, what have they done in the last decade to fix the problem? Have they been able to get their accuracy rate over the 50% mark yet? Apparently not, since some of these legislators want to keep the same burden of fixing the problem on the buyer. So have they really done anything in ten years to fix this record history recording problem, or have they simply refused to address it because they wanted to keep it around as an excuse to continue to unduly burden the gun buyer? Did they all along intend to let the criminal records reporting problem fester because they didn&#8217;t like Instant Check in the first place and never intended to comply with it?\n \n All I can say is that in Colorado inadequate Instant Check records must still be the norm to justify a move to &#8220;un-sunset&#8221; this burdensome law and keep it around. And since these same models of legislative efficiency have decided not to &#8220;reset the sunset&#8221; it appears their true motive all along was to make the law permanent&#8212;to never fix an issue which honest people saw to be a problem but which they saw as a continued opportunity to harass otherwise innocent firearm purchasers. \n \n Would you vote for a guy who promised to fix the potholes in your city, and who six years later said we&#8217;ve only got 35% of them filled? I doubt it. And if you did, wouldn&#8217;t you at least check first to see if he owned a financial interest in a car alignment business? But say you did vote for him again, and ten more years go by in which you have to keep going out to fill in the pot holes he won&#8217;t deal with. He comes back to you and says &#8220;you know, I&#8217;ve had 16 years to get this done, but it&#8217;s still such a mess that I&#8217;ve decided to continue to make you fill in the potholes for me. Can I still count on you at the polls in November?&#8221; \n \n I know not what course others may take, but as for me, I&#8217;d say &#8220;See you later, I&#8217;m moving to Virginia.&#8221;\n \n And Simone, remember, &#8220;Virginia is for lovers&#8221;&#8212;and not just of guns. I know you stuck you toe in the water since my last post. If you find the water too chilly then fine, stay out for all I care. You can even continue to throw all the one-liner rocks you want. Your sticks and stones won&#8217;t break my bones. And if your aim is anything like your reading comprehension, then I&#8217;ll just turn my back to talk with others, tread water for a while, and watch &#8216;em sail high and wide overhead.", 
   {
    "post_info": {
     "post_title": "Virginia is for Lovers"
    }
   }, 
   398358, 
   null, 
   1271401020.0
  ], 
  [
   398418, 
   null, 
   "Doc Jones", 
   "Thank you Bryan as always.\n \n In light of what you've posted concerning bail, what do you make of \"deny on arrest\" provisions such as those sunsetting in Colorado?\n\n \n Colorado is pretty screwed up almost as bad as kalifornia.\n \n Since you are \"one of us\" now, this latest decision should cheer the cockles of your heart:\n \n David Kopel \u0095 April 15, 2010 1:17 pm \n \n Students for Concealed Carry on Campus v. Regents of the University of Colorado. Decided this morning by the Colorado Court of Appeals (a three-judge panel of Colorado's intermediate appellate court). In brief: Colorado's licensing statute for carrying a concealed handgun for lawful protection is explicitly preemptive. The University of Colorado bans concealed carry anyway, arguing that there is an implicit exception applicable to CU. The Mountain States Legal Foundation brings a suit on behalf of SCCC. The trial court dismisses for failure to state a claim. The Court of Appeals unanimously reverses the dismissal, and remands the case for further proceedings. The Court of Appeals holds that: 1. The statutory claim under the Concealed Carry Act should not have been dismissed, because there is no exemption for the University of Colorado. 2. The constitutional claim under the Colorado Constitution's right to arms provision should not have been dismissed; the proper standard of review, under Colorado case law, is \"reasonableness\", which is a higher standard than rational basis. The Court of Appeals expresses no opinion on the merits of the constitutional claim. emoticon_xhoho", 
   {
    "unicode_changes_made": true
   }, 
   398358, 
   null, 
   1271427960.0
  ], 
  [
   398429, 
   null, 
   "Tither", 
   " So I ask again, what have they done in the last decade to fix the problem? \n\n What have they done? What do they intend to do? Na, I think you said it yourself.\n \nI read with interest in Sinjin's article that some legislators ten years ago trumpeted their defiance of the NRA and that they were proud to have kept the burden on the gun buyer to make sure the state accurately recorded his criminal record history. \n\n Why is this acceptable when it is a Constitutionally Recognized as Inalienable Right we are talking about? The Constitution is the Supreme Law of the Land, but do they go even one step out of their way to make sure that they respect it or even obey it? \n \n Personally, I think that they believe that, the Constitutional Right of the individual a small price to pay when they can \"trumpeted their defiance of the NRA.\" emoticon_rolleyes Maybe they can even have a parade! emoticon_smile", 
   {
    "unicode_changes_made": true
   }, 
   398402, 
   null, 
   1271438760.0
  ], 
  [
   398442, 
   null, 
   "NATO 556", 
   "Assembly Bill 1934. It bans open carry in California.\n \n Assembly Bill 1810. It requires the registration of all long guns in California.\n \n I wonder how exactly Sinjin feels about these two pieces of legislation, and what he's telling his representatives.", 
   {}, 
   398254, 
   null, 
   1271447040.0
  ], 
  [
   398443, 
   null, 
   "Doc Jones", 
   "What have they done? What do they intend to do? Na, I think you said it yourself.\n \n Why is this acceptable when it is a Constitutionally Recognized as Inalienable Right we are talking about? The Constitution is the Supreme Law of the Land, but do they go even one step out of their way to make sure that they respect it or even obey it? \n \n Personally, I think that they believe that, the Constitutional Right of the individual a small price to pay when they can \"trumpeted their defiance of the NRA.\" emoticon_rolleyes Maybe they can even have a parade! emoticon_smile\n\n \n It is also a denial of honest service which could and should result in the prosecution of anyone involved in such a scheme. Probably a conspiracy charge also to defraud folks of their rights and failure to report. These are serious 1986 violations of civil rights! The feds should be on top of this and leading the charge if they were doing their jobs instead of allowing such chicanery to continue. The NCIS check is all that is required anyway. My personal opinion is that was never necessary before 1974 and brady got the Ncis process started late 1980's as I recall and Printz was decided in the early 1990's where the Court ruled it was an unfunded mandate on States and unConstitutional.\n \n We did just fine through most of my life without someone picking at a right to make a profit for their own sick cause. Now we got the nuts fully in charge and our very existence is challenged as is the future of our Republic.\n \n Example: Goldman Sachs is upside down on housing and Paulson shorted their long position and made out like a bandit. We got insider trading and our guards have no guards watching them play hide the weenie. I am tired and disgusted of the lack of morals and contempt for the rule of law.", 
   {}, 
   398429, 
   null, 
   1271447880.0
  ], 
  [
   398470, 
   null, 
   "zsu2357", 
   "A problem that afflicts both ends of the spectrum IMO. The difference being that one end seems a bit more aggressive \n than the other IMO. Not really surprising given the fact that pacifists are at the other end.\n \n I myself am somewhat aggressive here and in the real world. I just lack any fondess for firearms and prefer to limit my violent responses when appropriate to fists and feet. That and the fact that having traveled extensively overseas, I am accustomed to a gun not being an option, so one must be prepared to go unarmed or not at all.\n\n Nothing like a little hand to hand,but what if the other person don't see it that way?like they say\"sticks and stone's may break may bones(well yours) but baseball bats and Samurai knock off's will mess up your day.emoticon_smile", 
   {}, 
   398236, 
   null, 
   1271474400.0
  ], 
  [
   398473, 
   null, 
   "zsu2357", 
   "But, according to Bryan, the right to bear arms is always absolute, right?\n\n It sounds like Simone is willing or at least to open some dialog.(I'll bite my tongue later). \n Tither: you were kinda rude,maybe Simone just missed it..(I'll bite my tongue later). \n Doc: that wasn't nice.(I'll bite my tongue later). \n sinjin:I kinda thought you and Simone were two peas in a pod,but it came back to,Quote:\n Originally Posted by Bryan View Post\n I do not believe that any right in our Bill of Rights is absolute. I have never made that claim about the RKBA...[QUOTE]\n Nato ah Nato:You pretty much echoed sinjin and basically called Simone stupid.\n (I'll bite my tongue later). \n sinjin:How can Simone be here to discuss anything if know one is willing to discuss?at least up to the bottom of page 6.\n and later on I'll post a website where donations will be accepted for a tongue\n transplant.lol emoticon_rolleyesAnd as a footnote:no I have not crossed over to the anti's and yes sometimes I would like to thump Simone.", 
   {}, 
   398360, 
   null, 
   1271477880.0
  ], 
  [
   398553, 
   null, 
   "sinjin", 
   "Assembly Bill 1934. It bans open carry in California.\n \n Assembly Bill 1810. It requires the registration of all long guns in California.\n \n I wonder how exactly Sinjin feels about these two pieces of legislation, and what he's telling his representatives.\nif one could carry sans CCW in CA, I don't know why open carry would be attractive. \n Since one presently cannot, I'd not support an open carry ban. I might not even if one could carry concealed. \n I still think open carry a bad idea.\n \n Registration of long guns I do not support. I'd not support handgun registration if all transfers of ownership required NICS checks.\n \n What I may or may not tell my representatives is nunya.", 
   {}, 
   398442, 
   null, 
   1271559780.0
  ], 
  [
   398554, 
   null, 
   "sinjin", 
   "Nothing like a little hand to hand,but what if the other person don't see it that way?like they say\"sticks and stone's may break may bones(well yours) but baseball bats and Samurai knock off's will mess up your day.emoticon_smile\nI don't quite see your point. Are you asking if I'd wish I had a gun if attacked by someone with a bat or sword? \n I could have taken the trouble to carry a pistol all these years and I've yet to be attacked with a bat or sword. \n Would you immediately go for your gun if attacked by an unarmed man?", 
   {}, 
   398470, 
   null, 
   1271560200.0
  ], 
  [
   398577, 
   null, 
   "Tither", 
   "Would you immediately go for your gun if attacked by an unarmed man?\n\n This would have to be classified as Ignorance of the law is not excuse. emoticon_smile \n \n There are ruled for justifying the use of deadly force. However, remember my Assualt Weapons comparison? Under some circumstances an unarmed man can be considered a threat and one can easily be in fear for ones life. In fact, personal weapons, (hands, fists, feet, etc.) is approximately twice that of all rifle homicides and are most likely to be considered murders, and not justifiable homicides. \n \n Surely it can most always be said that Blunt objects (clubs, hammers, rocks, bottles pipes, golf clubs, etc.) are almost always laying around, which also constitutes a larger portion of murders than all rifle homicides too. Not to mention knives, which are very concealable. \n \n Circumstances are an important factor in an unarmed situation. For instance, I am a large individual. A women could easily consider me a threat, where you man not. But there again, you may consider me a threat too. Depends on the circumstances. \n \n But to the wording of your exact question. \"Would you immediately go for your gun if attacked by an unarmed man?\" Ignorance of the law is not excuse. emoticon_smile", 
   {}, 
   398554, 
   null, 
   1271597520.0
  ], 
  [
   398583, 
   null, 
   "Doc Jones", 
   "if one could carry sans CCW in CA, I don't know why open carry would be attractive.\n\n \n Is this meant to imply that one can carry sans(sic) without CCW but only openly then you don't know why it is attractive? Slobber, slobber, drool, drool.\n \n \nSince one presently cannot, I'd not support an open carry ban. I might not even if one could carry concealed.\n\n \n Good thinking since your first sentence was contradictory and more probably your true thoughts.\n \n \nI still think open carry a bad idea.\n\n \n Here is your 2cents.\n \n \nRegistration of long guns I do not support.\n\n \n What are you doing to stop the practice then?\n \n \nI'd not support handgun registration if all transfers of ownership required NICS checks.\n\n \n In reality, that is registration.\n \n \nWhat I may or may not tell my representatives is nunya.\n\n \n Good thinking!\n \n #99\n \nI don't quite see your point. Are you asking if I'd wish I had a gun if attacked by someone with a bat or sword?\n\n \n That is a good place to start; want to take a stab at answering it?\n \n \nI could have taken the trouble to carry a pistol all these years and I've yet to be attacked with a bat or sword.\n\n \n ME, ME, I - I. Know anyone who has like we read daily? Most did not have the luxury of \"taking the trouble to carry a pistol\". Women for instance had to rely on a \"G-D piece of paper\" while men were having to rely on nothing but wits ...and luck.\n \n [/QUOTE]Would you immediately go for your gun if attacked by an unarmed man?[/QUOTE]\n \n You betcha sweet bippy! If I had the time and space. You ask your reader to assume a lot here. Your first 'act of faith' would be to assume the man/men/women are unarmed. Just exactly how would you know this? I know you got superman eyes and all that stuff...I don't nor do I expect anyone else to make such a fatal error...except you. Such attackers don't telegraph stuff to you or tell you, \"get ready I am about to attack you\". The attacks come unexpected, from behind, side and/or short range. A CCW will try to avoid such a situation do you?\n \n Let us make it personal. Describe such a situation, time, place, distance etc. and how [B]you personally handled an attack[/B[ from \"an unarmed man\". In such a situation, even a super hero such as yourself would rely on force. F-O-R-C-E. You keep bragging about your martial arts abilities and inevitably, you think you are superior to anyone else and keep foisting the idea that anyone can defend themselves with hand to hand or with your feet while ignoring that the majority of people are female, elderly and/or handicapped ruling out such tactics.\n \n Use of a gun is justified F-O-R-C-E! Your criticism of means of defense is noted and your bias say volumes!\n People just like you scrambled for guns during kalifornia riots and were teed off that the waiting period they had foisted on others and unknowingly on themselves meant a 10 day wait. Many of Charlton Hesston's acquaintances begged him to loan them guns and ammo to their extreme disappointment were denied. Why do the real martial artist carry the ultimate defense------a pistol? I am talking about folks light years ahead of you in martial arts, Steven Segall and Chuck Norris for example. Could it be that they know something you don't :) They practice regularly and don't assume even they can take on a mob unarmed when the mob may well be armed so you just go ahead with your fantasy land rhetoric and dreams of superiority. You have no idea how many black belts I have seen get the living (edited by poster) kicked out of them in a fair fight by some local bad ***. One can only assume what would happen by design on the not so well lit street, elevator, or public square by those with bad intent. One can also assume what would happen to you if multiple attackers crashed into your home even in daylight. That is why you will not post a sign in your yard heralding your citizen disarmament belief. Maybe you could post a sign declaring your expertise in your martial arts abilities? :) ;)", 
   {
    "post_info": {
     "post_title": "If a man is too old to fight, he will just kill you!"
    }
   }, 
   398577, 
   null, 
   1271599980.0
  ], 
  [
   398687, 
   null, 
   "sinjin", 
   "This would have to be classified as Ignorance of the law is not excuse. emoticon_smile \n \n There are ruled for justifying the use of deadly force. However, remember my Assualt Weapons comparison? Under some circumstances an unarmed man can be considered a threat and one can easily be in fear for ones life. In fact, personal weapons, (hands, fists, feet, etc.) is approximately twice that of all rifle homicides and are most likely to be considered murders, and not justifiable homicides. \n \n Surely it can most always be said that Blunt objects (clubs, hammers, rocks, bottles pipes, golf clubs, etc.) are almost always laying around, which also constitutes a larger portion of murders than all rifle homicides too. Not to mention knives, which are very concealable. \n \n Circumstances are an important factor in an unarmed situation. For instance, I am a large individual. A women could easily consider me a threat, where you man not. But there again, you may consider me a threat too. Depends on the circumstances. \n \n But to the wording of your exact question. \"Would you immediately go for your gun if attacked by an unarmed man?\" Ignorance of the law is not excuse. emoticon_smile\nWhen found by police in the bar's parking lot at 2 am, unharmed with smoking gun in hand, standing over the dead, \n unarmed, average sized guy, it helps to be a woman.emoticon_xkill\n \n Point taken.\n \n Always being armed allows one to respond to any perceived threat as a slightly built woman might.\n \n If that works for you, fine.", 
   {}, 
   398577, 
   null, 
   1271705220.0
  ], 
  [
   398745, 
   null, 
   "zsu2357", 
   "I don't quite see your point. Are you asking if I'd wish I had a gun if attacked by someone with a bat or sword? \n I could have taken the trouble to carry a pistol all these years and I've yet to be attacked with a bat or sword. \n Would you immediately go for your gun if attacked by an unarmed man?\n\n Absolutely,attacked is attacked,he may look unarmed,as I would for that matter\n what if he's not?\n Let me drag this out of mothballs:I've yet to meet a drunk driver head on,so after all these years of trying to keep an eye out,emoticon_xkill I'm not going to stop because it hasn't happened yet. emoticon_xkillemoticon_xkill", 
   {}, 
   398554, 
   null, 
   1271729340.0
  ], 
  [
   398747, 
   null, 
   "zsu2357", 
   "Why do the real martial artist carry the ultimate defense------a pistol? I am talking about folks light years ahead of you in martial arts, Steven Segall and Chuck Norris for example. Could it be that they know something you don't They practice regularly and don't assume even they can take on a mob unarmed when the mob may well be armed\n\n OMG Doc are you saying Steven Segall and Chuck Norris aren't bullet proof?\n go figure.emoticon_rolleyes", 
   {}, 
   398745, 
   null, 
   1271730180.0
  ], 
  [
   398748, 
   null, 
   "sinjin", 
   "Absolutely,attacked is attacked,he may look unarmed,as I would for that matter\n what if he's not?\n Let me drag this out of mothballs:I've yet to meet a drunk driver head on,so after all these years of trying to keep an eye out,emoticon_xkill I'm not going to stop because it hasn't happened yet. emoticon_xkillemoticon_xkill\nSo were it not for the possibility of encountering a drunk driver, you'd drive with your eyes closed?\n Do you go about in a hard hat for fear of being struck by a meteorite?", 
   {}, 
   398745, 
   null, 
   1271730240.0
  ], 
  [
   398749, 
   null, 
   "sinjin", 
   "OMG Doc are you saying Steven Segall and Chuck Norris aren't bullet proof?\n go figure.emoticon_rolleyes\nMakes you wonder why they ever trained. Could have just gotten 2 guns instead.", 
   {}, 
   398747, 
   null, 
   1271730360.0
  ], 
  [
   398752, 
   null, 
   "zsu2357", 
   "So were it not for the possibility of encountering a drunk driver, you'd drive with your eyes closed?\n Do you go about in a hard hat for fear of being struck by a meteorite?\n\n Hey your good,actually golf ball size hail. LOL.", 
   {}, 
   398748, 
   null, 
   1271731560.0
  ], 
  [
   398754, 
   null, 
   "zsu2357", 
   "Makes you wonder why they ever trained. Could have just gotten 2 guns instead.\n\n Ever see them two mini-uzi's Chuck Norris packs?", 
   {}, 
   398749, 
   null, 
   1271731680.0
  ], 
  [
   398783, 
   null, 
   "Doc Jones", 
   "Makes you wonder why they ever trained. Could have just gotten 2 guns instead.\n\n \n Why don't you go slap the wee wee out of either one and correct the error of their thoughts emoticon_xgood\n \n A braggert like you shouldn't have any problems with that now should they? emoticon_xclown", 
   {}, 
   398749, 
   null, 
   1271769720.0
  ], 
  [
   398812, 
   null, 
   "sinjin", 
   "Hey your good,actually golf ball size hail. LOL.\nI would certainly carry if I thought the threat sufficient to warrant it. In my daily life I am not required to be places or do things that make me feel the threat is sufficient. I do not speak for others who live elsewhere and must negotiate dangerous settings routinely. Nor for people whose physicality is such that non-lethal force is not a viable option. It's all about risk assessment and risk management IMO. I have no intention of shooting someone for taking a swing at me for whatever reason. I also have no intention of getting killed in a shootout over the contents of my pockets.\n \n If carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.", 
   {}, 
   398752, 
   null, 
   1271789940.0
  ], 
  [
   398857, 
   null, 
   "Doc Jones", 
   "I would certainly carry if I thought the threat sufficient to warrant it. In my daily life I am not required to be places or do things that make me feel the threat is sufficient. I do not speak for others who live elsewhere and must negotiate dangerous settings routinely. Nor for people whose physicality is such that non-lethal force is not a viable option. It's all about risk assessment and risk management IMO. I have no intention of shooting someone for taking a swing at me for whatever reason. I also have no intention of getting killed in a shootout over the contents of my pockets.\n \n If carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.\n\n \n ...and a girl or woman who wears form fitting clothes is \"just asking for it\" ain't it slick?", 
   {}, 
   398812, 
   null, 
   1271809800.0
  ], 
  [
   398901, 
   null, 
   "jazyjason", 
   "I would love the right to bear arms. I mean jeez I can imagine walking around at work with those huge claws....", 
   {}, 
   398857, 
   null, 
   1271829840.0
  ], 
  [
   398960, 
   null, 
   "zsu2357", 
   "I would certainly carry if I thought the threat sufficient to warrant it. In my daily life I am not required to be places or do things that make me feel the threat is sufficient. I do not speak for others who live elsewhere and must negotiate dangerous settings routinely. Nor for people whose physicality is such that non-lethal force is not a viable option. It's all about risk assessment and risk management IMO. I have no intention of shooting someone for taking a swing at me for whatever reason. I also have no intention of getting killed in a shootout over the contents of my pockets.\n \n If carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.\n\n \n Every day you are in a potential place to be threated(store,stoplight,front yard)\n at anytime,who's to say when or where?unless you live in one of those crime free cities or states oh I know Utopia.\n Or,Or maybe you are some sort of Shaolin Monk.\n \n What if someone took a swing at ya with a baseball bat for dinging their door in(a tire iron would do).But then thats just foolhardy isn't it?\n \n Life is strange like that,not everyone out there shares your reasons,intentions\n or inclinations.So sorry.emoticon_loveemoticon_loveemoticon_love", 
   {}, 
   398812, 
   null, 
   1271892300.0
  ], 
  [
   399068, 
   null, 
   "Superlite27", 
   "I would certainly carry if I thought the threat sufficient to warrant it. In my daily life I am not required to be places or do things that make me feel the threat is sufficient. I do not speak for others who live elsewhere and must negotiate dangerous settings routinely. Nor for people whose physicality is such that non-lethal force is not a viable option. It's all about risk assessment and risk management IMO. I have no intention of shooting someone for taking a swing at me for whatever reason. I also have no intention of getting killed in a shootout over the contents of my pockets.\n \n If carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.\n\n \n \n \nIn my daily life I am not required to be places or do things that make me feel the threat is sufficient.\n\n \n What does \"feel\" have to do with reality? I can point out 32 folks who attended a place called Virginia Tech. Do you believe they \"felt\" a need for any method of self defense? Not just a firearm, ANY method? I would think one would \"feel\" safe on a college campus. But, as the proof is in the pudding, \"feeling\" safe didn't tranfer to reality very well, did it? These 32 people are now dead as doornails. In the moments before their death, I'm guessing their former feeling of safety quickly turned to a feeling of unsafety. In reality, how were they prepared to deal with this feeling? As far as I can tell, they could have been high on pot for all we know. They could have felt euphoric. They could have felt sad. They could have felt lustful. They could have felt bored.\n \n Please explain: How do \"felings\" have anything to do with the actual personal condition of BEING safe or BEING in danger?\n \n \nI also have no intention of getting killed in a shootout over the contents of my pockets.\n\n \n This is a good one. Please inform me of anyone who does. Are you saying that YOUR intentions are the ones that dictate outcome? If you encounter an armed criminal who DOES intend to kill you for the contents of your pockets, and you have NO intentions of getting killed in a shootout over the contents of your pockets, who's intentions take precedence? Does the armed robber, somehow, forfeit? Once again I ask:\n \n How do your intentions have any reflection on outcome? There is a robber with a gun. He intends on using it. You are now in a gunfight. He is now shooting you so that you will lie still as he rifles through your pockets.\n \n You have stated that your intentions are for this to NOT HAPPEN.\n \n How do your intentions take precedent over his? The murderer has the MEANS to enforce his. Your intentions, however nice and friendly they are, have no MEANS to be enacted while the robber has a very effective tool to ensure his intentions trump yours.\n \n \nIf carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.\n\n \n That's a big \"if\". While I do agree that having the means of preventing assault on one's person provides a certain comfort level, therefore, a person who posesses this means might \"feel\" safer than someone who doesn't. This may potentially lead them to take risks an unarmed person wouldn't (such as walking through bad neighborhoods rather than around them). This is the \"if\". I have found that carrying a firearm has FOCUSED my attention on this. In reality, I am MORE aware of places, surroundings, and areas were the likelyhood of actually having to use my firearm is greater. THEREFORE, in reality, I find myself paying closer attention to avoiding these places that I did when I was unarmed.\n \n It's kind of a catch 22. Before arming myself, I walked indifferently through places where I would have been a whole lot safer if I would have entered them armed. Now that I've taken the training and have been licenced to carry a firearm, I find myself avoiding these places. Hence: Now that I CAN protect myself, I have less of a need to do so. \n \n Now that I have the MEANS to enforce my desire to not get killed in a shootout over the contents of my pockets, I am actually safer, not because of the firearm, but because I am more concious of my surroundings.\n \n Now, I will agree that there are probably folks out there who have the exact opposite reaction: \"Hey, I've avoided these dangerous places before because I was helpless. Now that I'm armed, I'll just walk down so-and-so street because I have the MEANS to enforce my intention to not be killed in a shootout over the contents of my pockets.\"\n \n They have the \"feeling\" of safety provided by the tool they have chosen to carry, but as I have stated above, this \"feeling\" has just as much of an effect on reality as your \"feeling\" of safety does.\n \n The only difference is, the armed individual has the MEANS of affecting the outcome. The armed person has an effective argument. Whereas,unarmed, you do not.", 
   {}, 
   398812, 
   null, 
   1271954160.0
  ], 
  [
   399070, 
   null, 
   "NATO 556", 
   "I would certainly carry if I thought the threat sufficient to warrant it. In my daily life I am not required to be places or do things that make me feel the threat is sufficient. I do not speak for others who live elsewhere and must negotiate dangerous settings routinely. Nor for people whose physicality is such that non-lethal force is not a viable option. It's all about risk assessment and risk management IMO. I have no intention of shooting someone for taking a swing at me for whatever reason. I also have no intention of getting killed in a shootout over the contents of my pockets.\n\n \n That's all well and good. But one has to be prepared with a backup plan should risk assessment/management fail, and trouble comes looking for you like a guided missile.\n \n Seriously, there are plenty of stories in the news about someone coming back from the store to find their home broken into and the invader still there, or random women being raped in the park, or just plain bad things happening to random people for no damn reason.\n \n You look at the news, you can't help but seeing stuff like this happen. The only real question is when does one start to think \"This is happening to random people, what if it might happen to me next?\" and treat it like a real and tangible threat.\n \n \nIf carrying a gun inclines one to take avoidable risks one wouldn't otherwise if unarmed, I think it foolhardy.\n\n \n That's a very big \"if\" with no tangible evidence presented by anyone to prove it.", 
   {}, 
   398812, 
   null, 
   1271956320.0
  ], 
  [
   399071, 
   null, 
   "sinjin", 
   "That's all well and good. But one has to be prepared with a backup plan should risk assessment/management fail, and trouble comes looking for you like a guided missile.\n \n Seriously, there are plenty of stories in the news about someone coming back from the store to find their home broken into and the invader still there, or random women being raped in the park, or just plain bad things happening to random people for no damn reason.\n \n You look at the news, you can't help but seeing stuff like this happen. The only real question is when does one start to think \"This is happening to random people, what if it might happen to me next?\" and treat it like a real and tangible threat.\nIf your determination of the threat level leads you to the comfort of a handgun then more power to you. \n I am comfortable with my decision to go about without lethal force as my first line of defense.\n \n \n \nThat's a very big \"if\" with no tangible evidence presented by anyone to prove it. \nI'm not attempting to prove that someone armed automatically thinks this way, I suggesting some might.", 
   {}, 
   399070, 
   null, 
   1271958000.0
  ], 
  [
   399072, 
   null, 
   "NATO 556", 
   "If your determination of the threat level leads you to the comfort of a handgun then more power to you. I am comfortable with my decision to go about without lethal force as my first line of defense.\n\n \n It's not the first line of defense. That's something we can't seem to get certain people to understand. We don't just automatically shoot someone that might present a danger unless the circumstances warrant such action. There are times when fleeing, and not going down a particular street, just aren't going to be an option or enough of an answer to avoid trouble.\n \n Of course a good question would be what does one do when all of their risk management/assessment steps fail them at a critical moment.\n \n \nI'm not attempting to prove that someone armed automatically thinks this way, I suggesting some might.\n\n \n Cutting through a bad area of town to save a few minutes isn't the same as actively going out and looking for somebody to off because they're a known bad guy.\n \n It's not a very good hypothesis to be making. Even if one is more willing to do something they wouldn't normally do, so what? Why do we tolerate having bad neighborhoods in the first place? The whole concept sounds like a defeatist's attempt at appeasing the scum of society, like we're giving them certain areas of our city in exchange for them not coming after us in our areas of the city.\n \n I think this whole concept needs to be stopped and seriously rethought.", 
   {}, 
   399071, 
   null, 
   1271958540.0
  ], 
  [
   399081, 
   null, 
   "Superlite27", 
   "If your determination of the threat level leads you to the comfort of a handgun then more power to you. \n I am comfortable with my decision to go about without lethal force as my first line of defense.\n \n \n I'm not attempting to prove that someone armed automatically thinks this way, I suggesting some might.\n\n \n \nI am comfortable with my decision to go about without lethal force as my first line of defense.\n\n \n So am I. I am also comfortable going about without lethal force as my first line of defense. The thing is, I have more than one line. If your first line fails....what's your second line?\n \n \nI'm not attempting to prove that someone armed automatically thinks this way, I suggesting some might.\n\n \n You'd probably be right far more than some. I'm quite sure many think this way. The fact that a person has a defensive weapon doesn't make them bulletproof. Having a firearm doesn't magically make one invincible. Just as you \"feel\" that you don't need a firearm, there are others who \"feel\" that a firearm is some form of talisman to prevent danger.\n \n In both cases, \"feelings\" mean exactly squat. A person with a firearm is in just as much danger as one without. The only difference is, the one who posesses the firearm has an effective means of dealing with that danger, whereas, the one without only has the option of changing their feelings from \"safe\" to \"unsafe\".\n \n Your choice of dealing with the FEELING of danger has no relation to dealing with the REALITY of it. You are left with changing your feelings.\n \n My choice of dealing with the FEELING of danger will be quite different. I have more than one option. \n \n Yes, I know you also possess the ability to fight. I'm talking about effectiveness. I have the SAME TOOL that is being used against me. My effectiveness is equal to the threat. Moreso, if you'd care to take into account the extensive training and familiarity with my weapon I've developed. I practice drawing from concealment, target acquisition, tactical positioning, shooting at moving targets, shooting while moving myself, and numerous other simple defensive techniques quite regularly. Do you honestly believe he \"run of the mill\" mugger is anticipating an armed response? Or is he blindly relying on a typical reaction of....oh, let's say...SOMEONE WHO IS UNARMED?\n \n I agree with your suggestion that some might think this way. I'm even willing to offer that MANY think this way. However, I would add that nowhere have you offered any evidence that those who do would be WRONG.\n \n I'm simply suggesting that your typical criminal is fully prepared for your response. Do you even know what that will be?\n \n Do you think the typical mugger has prepared for mine as much as I have prepared for his?\n \n Who has the advantage? You, or me?\n \n Remember, we're dealing with reality, not feelings.", 
   {}, 
   399071, 
   null, 
   1271960280.0
  ], 
  [
   399084, 
   null, 
   "sinjin", 
   "I think you make way too much of my choice of the word \"feel\".\n \n I have determined that I have not enough reason to carry. Better?\n \n You don't know what my first, second or third line of defense might be. \n \n Nor do you know the likelihood of me personally being targeted over anyone else.\n \n I am as convinced that carrying is an overreaction to the actual threat in my life as \n you are of your ability to clear your holster with a gun pointed at you.\n \n Let's hope neither of us finds out differently.\n \n Are you more prepared for any eventuality? Of course.\n \n Could the mere detection of your firearm or an attempt to pull it get you shot when you might not have otherwise? \n I'd say quite possibly. That's your call.\n \n Why does it irk you that someone doesn't make the same choices as you?\n \n My aunts are nuns. They can't and won't carry guns. Are they just foolish?", 
   {}, 
   399081, 
   null, 
   1271962560.0
  ], 
  [
   399085, 
   null, 
   "NATO 556", 
   "I am as convinced that carrying is an overreaction to the actual threat in my life as you are of your ability to clear your holster with a gun pointed at you.\n\n \n I highly doubt anybody actually believes they can beat this presented scenario, it just doesn't happen.\n \n However if you're at the scene of a robbery and you're not the primary victim, getting your gun un-holstered and defusing the situation is entirely likely. Being at a convenience store when it's held up is entirely likely, and in cases like this it's usually the cashier that's the focus, not the individual customers.\n \n And then again you might just get lucky with a case like this: http://www.mlive.com/newsflash/michigan/index.ssf?/base/national-111/1268662486319400.xml&storylist=newsmichigan", 
   {}, 
   399084, 
   null, 
   1271963400.0
  ], 
  [
   399086, 
   null, 
   "Superlite27", 
   "Let's hope neither of us finds out differently.\n\n \n You'll get nothing but agreement from me on this point.\n \n But, to circle back around in an attempt (although feeble) to make this point relevant to the OP's topic:\n \n How can the desire to be prepared in the manner I choose get distorted and smeared into something like \"the love of the right to bear arms\" as something to be ashamed of?\n \n Evidently, some folks have no problems with the \"love of the right to freely express themselves\", or \"the love of the right to practice their chosen religion\", or even \"the love of the right to NOT be illegally searched\".\n \n Yet, my love of one particular right gets mocked and noses get looked down as if all other rights are superior, yet this right is for inferior, less than human, neanderthals.\n \n Once again, the BIGOT in simone rears its ugly head.", 
   {}, 
   399084, 
   null, 
   1271964420.0
  ], 
  [
   399087, 
   null, 
   "sinjin", 
   "I highly doubt anybody actually believes they can beat this presented scenario, it just doesn't happen.\nNo one believes that one might see the robber and his gun simultaneously? C'mon.\n I'm not a bank teller. Threaten me with the gun not in your hand and well...\n \n \nHowever if you're at the scene of a robbery and you're not the primary victim, getting your gun un-holstered and defusing the situation is entirely likely. Being at a convenience store when it's held up is entirely likely, and in cases like this it's usually the cashier that's the focus, not the individual customers.\nShoot straight, hero. Let's hope everyone thanks you and no one get killed because of you.", 
   {}, 
   399085, 
   null, 
   1271964720.0
  ], 
  [
   399088, 
   null, 
   "NATO 556", 
   "No one believes that one might see the robber and his gun simultaneously? C'mon.\n\n \n No I'm saying nobody I know would honestly believe, if they were held at gunpoint with the robber's full and undivided attention on you, that they could somehow beat them by drawing their gun and shooting faster than it would take the bad guy to pull the trigger.\n \n \nShoot straight, hero. Let's hope everyone thanks you and no one get killed because of you.\n\n \n There you go again. With that kind of talk it's no wonder people ridicule you and your affiliations.", 
   {}, 
   399087, 
   null, 
   1271965080.0
  ], 
  [
   399090, 
   null, 
   "sinjin", 
   "No I'm saying nobody I know would honestly believe, if they were held at gunpoint with the robber's full and undivided attention on you, that they could somehow beat them by drawing their gun and shooting faster than it would take the bad guy to pull the trigger.\nAnd what if that same robber sees that you have a gun under your coat? What then?\n \n \nThere you go again. With that kind of talk it's no wonder people ridicule you and your affiliations. \nIf you start the actual shooting, you become accountable for the outcome. It's conceivable that innocents could be in the crossfire. You could miss. The bad guy could miss. The bad guy might mistake another for the one shooting at him. Lots of possibilities.\n \n Notice I don't ridicule you for thinking your abilities guarantee the outcome?\n \n I am unaffiliated btw.", 
   {}, 
   399088, 
   null, 
   1271965440.0
  ], 
  [
   399094, 
   null, 
   "Superlite27", 
   "Ahhh, you've both run off the path of reason and into the bumpy ground of Hypothetical Land.\n \n Too creepy around here for my tastes. (After all, I've learned to avoid dangerous areas.)\n \n Anything can happen in this place. I'm headed for safer ground.", 
   {}, 
   399090, 
   null, 
   1271966400.0
  ], 
  [
   399095, 
   null, 
   "Doc Jones", 
   "And what if that same robber sees that you have a gun under your coat? What then?\n\n \n Oh goody, I love what if games. The one making the claims gets to choose unrealistic what ifs most favorable for their point :)\n \n \nIf you start the actual shooting, you become accountable for the outcome. It's conceivable that innocents could be in the crossfire. You could miss. The bad guy could miss. The bad guy might mistake another for the one shooting at him. Lots of possibilities.\n\n \n Just like the cops huh? If an innocent is injured the blame falls on the perp, not the victim or do you claim that a person legally armed is a perp also? In real law, the perp has to absorb all responsibility for injury or death caused by his actions. What the good guys that are armed have to consider is protection of their life, the armed perp doesn't get first shot before you can act. You can make all the claims you want but the burden is on the perp.\n \n \nNotice I don't ridicule you for thinking your abilities guarantee the outcome?\n \n I am unaffiliated btw.\n\n \n Did anyone question yours? Or ridicule you? How come we don't see you on UFC? :) You wouldn't have to worry about working for the city/state 2 or 3 days a week now since LA rates high on the list of cities with serious monetary problems which cannot be resolved.", 
   {}, 
   399090, 
   null, 
   1271967000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Love of the right to bear arms...", 
  "url": "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14129, 
  "discussion_files": [
   [
    "5889.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-print.html"
   ], 
   [
    "5890.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-9-print.html"
   ], 
   [
    "5891.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-7-print.html"
   ], 
   [
    "5892.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-5-print.html"
   ], 
   [
    "5893.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-4-print.html"
   ], 
   [
    "5894.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-6-print.html"
   ], 
   [
    "5895.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-8-print.html"
   ], 
   [
    "5896.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-3-print.html"
   ], 
   [
    "5897.html", 
    "http://www.4forums.com/political/gun-control-debates/14129-love-right-bear-arms-2-print.html"
   ]
  ], 
  "identifier": 14129
 }
]