[
 [
  [
   398351, 
   null, 
   "simone", 
   "\"I like big bucks and I cannot lie,\" they sang. \"You mortgage brothers can't deny.\"\n \n We're not making it up. According to documents released as part of a Congressional investigation, bankers from the failed Washington Mutual rewrote the lyrics to 1992's \"Baby Got Back\" to celebrate their dominance of the mortgage lending market.\n \n An apparent exhibit of misplaced hubris, Washington Mutual would later become the largest failed savings bank in US history, in part due to their exuberance in extending risky loans.\n\n Wamu bankers sang &#8216;I like big bucks and I cannot lie&#8217; before bank failed | Raw Story\n \n Ah! Capitalism! \n \n Ain't it totally wunnererful?", 
   {
    "post_info": {
     "post_title": "Wamu bankers sang \u0091I like big bucks and I cannot lie\u0092 before bank failed"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1271360340.0
  ], 
  [
   398353, 
   null, 
   "gansao", 
   "I hear that Communism is a far better form of governmentemoticon_xclown", 
   {}, 
   398351, 
   null, 
   1271360520.0
  ], 
  [
   398356, 
   null, 
   "Steeeeve", 
   "Wamu bankers sang 'I like big bucks and I cannot lie' before bank failed | Raw Story\n \n Ah! Capitalism! \n \n Ain't it totally wunnererful?\n\n \n It worked didn't it? They failed.", 
   {
    "unicode_changes_made": true
   }, 
   398351, 
   null, 
   1271360760.0
  ], 
  [
   398359, 
   null, 
   "simone", 
   "No, they didn't fail. They're now part of Chase Manhattan et al.", 
   {}, 
   398356, 
   null, 
   1271361960.0
  ], 
  [
   398369, 
   null, 
   "Steeeeve", 
   "No, they didn't fail. They're now part of Chase Manhattan et al.\n\n \n Yes they did...they filled for bankruptcy and their assets were sold off mostly the JP Morgan (same as Chase). You screw up you fail...the only ones that prevented this for the others was the federal government thanks to the bailouts. \n \n By the way, this doesn't mean I am for banks just failing like the 1920s...I think the government can seize the bank assets, clean them up, and sell them off after they failed. Screws a lot of people over but at least it protects the depositors.", 
   {}, 
   398359, 
   null, 
   1271368380.0
  ], 
  [
   398403, 
   null, 
   "Symbiote", 
   "The whole premise of fractional reserve banking is fraudulent.\n \n You deposit your money with the bank with the promise that you can withdraw it whenever you want. The bank then lends it out to a mortgagee who is contracted to pay it back over 30 years, with no obligation to return it any sooner.\n \n Essentially the bank has promised two people it can have full access to the same money at the same time. Hence in the 1920s, when people demand their money back, there isn't enough to go around.\n \n The solution? Obviously not the free market solution of punishing banks engaged in this duplicity for fraud, or at least allowing them to go under and hoping the rest learn something about what happens when you take this system too far, but instead the government underwrites the loans, putting the taxpayer on the hook for their slimy endeavours encouraging the banks to take on ever more leveraged positions.", 
   {}, 
   398369, 
   null, 
   1271406480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Wamu bankers sang \u0091I like big bucks and I cannot lie\u0092 before bank failed", 
  "url": "http://www.4forums.com/political/economics-debates/14149-wamu-bankers-sang-i-like-big-bucks-i-cannot-lie-before-bank.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 14149, 
  "discussion_files": [
   [
    "12810.html", 
    "http://www.4forums.com/political/economics-debates/14149-wamu-bankers-sang-i-like-big-bucks-i-cannot-lie-before-bank-print.html"
   ]
  ], 
  "identifier": 14149
 }
]