[
 [
  [
   398247, 
   null, 
   "Sandycane", 
   "Okay...\n Using references from the bible, describe Heaven to me...\n Where is it?\n How does one get there?\n What does one do there?\n Who is there?\n Can you leave if you get bored?\n etc...", 
   {
    "post_info": {
     "post_title": "Heaven"
    }
   }, 
   null, 
   null, 
   1271280780.0
  ], 
  [
   398250, 
   null, 
   "simone", 
   "Now, Sandycane, you know doggone well you got a snowball's chance in hell of getting into heaven.", 
   {}, 
   398247, 
   null, 
   1271282400.0
  ], 
  [
   398257, 
   null, 
   "Sandycane", 
   "Now, Sandycane, you know doggone well you got a snowball's chance in hell of getting into heaven.\n\n \n I want to know more about it before I commit to making a reservation. emoticon_xangel", 
   {}, 
   398250, 
   null, 
   1271283900.0
  ], 
  [
   398258, 
   null, 
   "Sandycane", 
   "Is heaven supposed to be a physical place or, is it a state of mind?", 
   {}, 
   398257, 
   null, 
   1271284140.0
  ], 
  [
   398262, 
   null, 
   "Easyrider", 
   "Okay...\n Using references from the bible, describe Heaven to me...\n Where is it?\n How does one get there?\n What does one do there?\n Who is there?\n Can you leave if you get bored?\n etc...\n\n \n Why not Google it and do some research? I know the irreligious left is dependent on Obama & others fending for them, but this is getting to be a little much. \n \n But I'll give you a clue or three on getting there: John 14:6; Acts 4:12; Ephesians 2:8-9; Romans 3:21-24; Romans 10:9-10; John 3:16\n \n emoticon_smile", 
   {}, 
   398247, 
   null, 
   1271285040.0
  ], 
  [
   398263, 
   null, 
   "Sandycane", 
   "Is heaven supposed to be a physical place or, is it a state of mind?\n \n 'Pearly Gates' and 'Thrones' imply an actual physical place. Is a physical body required for seeing the gate and sitting in the throne?\n Does this body wear clothes and require nourishment?\n \n If Heaven is a state of mind, are there physical limitations as to where the mind can wander?\n \n I'm serious here. Can someone tell me what is so great about Heaven?", 
   {}, 
   398257, 
   null, 
   1271285040.0
  ], 
  [
   398264, 
   null, 
   "Easyrider", 
   "\n I'm serious here. Can someone tell me what is so great about Heaven?\n\n \n It's love, joy, and peace forever. And no more tears, and no more sorrow. And you get your own place with no bills. That for starters.\n \n p.s. see my previous post to you in this thread.", 
   {}, 
   398263, 
   null, 
   1271285280.0
  ], 
  [
   398267, 
   null, 
   "Sandycane", 
   "Why not Google it and do some research? I know the irreligious left is dependent on Obama & others fending for them, but this is getting to be a little much. \n \n But I'll give you a clue or three on getting there: John 14:6; 12; .8;Ephesians 2:8-9 Romans 3:21-24; Romans 10:9-10; John 3:16\n \n emoticon_smile\n\n \n 3:16\"For God so loved the world that he gave his one and only Son,[a] that whoever believes in him shall not perish but have eternal life.\"\n \n This is the only verse that even remotely has anything to do with my questions...\n I did google, your name came up.\n \n Don't you know the answer? Can't you describe Heaven to me in your own words?", 
   {}, 
   398262, 
   null, 
   1271286000.0
  ], 
  [
   398270, 
   null, 
   "Easyrider", 
   "3:16\"For God so loved the world that he gave his one and only Son,[a] that whoever believes in him shall not perish but have eternal life.\"\n \n This is the only verse that even remotely has anything to do with my questions...\n I did google, your name came up.\n \n Don't you know the answer? Can't you describe Heaven to me in your own words?\n\n \n \n I already did.\n \n It's love, joy, and peace forever. And no more tears, and no more sorrows. And you get your own place with no bills. And no Christ bashers. That for starters. emoticon_xangel", 
   {}, 
   398267, 
   null, 
   1271286720.0
  ], 
  [
   398271, 
   null, 
   "Easyrider", 
   "Here's one description of heaven:\n \n My Trip to Heaven by Rev. Lonnie Honeycutt", 
   {}, 
   398270, 
   null, 
   1271286900.0
  ], 
  [
   398329, 
   null, 
   "Sandycane", 
   "Here's one description of heaven:\n \n My Trip to Heaven by Rev. Lonnie Honeycutt\n\n \n I want YOUR description of Heaven...in YOUR own words, please.\n Is that too hard a question to answer?", 
   {}, 
   398271, 
   null, 
   1271351520.0
  ], 
  [
   398375, 
   null, 
   "Sandycane", 
   "H E L L O???\n \n Whatsamatta U?\n Cat got your tongue?:p\n \n How can you be so eager to get to a place you know absolutely NOTHING about emoticon_confused", 
   {}, 
   398329, 
   null, 
   1271370780.0
  ], 
  [
   398381, 
   null, 
   "Easyrider", 
   "H E L L O???\n \n Whatsamatta U?\n Cat got your tongue?:p\n \n How can you be so eager to get to a place you know absolutely NOTHING about emoticon_confused\n\n \n Who said I know absolutely NOTHING about it? Have you ever read the entire Bible? \n \n So far you've cast aside almost everything provided you. Why then do you ask about heaven? Maybe you should do your own homework.", 
   {}, 
   398375, 
   null, 
   1271378460.0
  ], 
  [
   398388, 
   null, 
   "Archangel", 
   "What Does the Bible Say About Death, Eternal Life and Heaven?", 
   {}, 
   398381, 
   null, 
   1271384280.0
  ], 
  [
   398431, 
   null, 
   "Sandycane", 
   "Who said I know absolutely NOTHING about it? Have you ever read the entire Bible? \n Yes, many times over.\n \n \nSo far you've cast aside almost everything provided you. Why then do you ask about heaven? Maybe you should do your own homework.\n\n \n No, I haven't 'cast it aside'. I wanted a description In Your Own Words of what heaven is supposed to be about.\n That's fine if you don't want to answer... no other Christian here has volunteered to answer either.\n \n I'm just surprised that since you are all so vocal and eager to voice your opinions on many other topics that you would all be so hush-hush on the subject of Heaven.emoticon_confused", 
   {}, 
   398381, 
   null, 
   1271440860.0
  ], 
  [
   398440, 
   null, 
   "Sandycane", 
   "What Does the Bible Say About Death, Eternal Life and Heaven?\n\n \n Not bad...About.com: http://www.epm.org/articles/bibhvn.html\n is a bit more detailed.", 
   {}, 
   398388, 
   null, 
   1271446260.0
  ], 
  [
   398525, 
   null, 
   "Esdraelon", 
   "Scripture also says that it has been appointed for man once to die and after that, the judgment. I don't believe anyone has died, gone to heaven, came back to write a book about it. Of course, many have done the latter, though not the former.\n \n As far as Heaven is concerned, it depends upon what one is referring to. Scripture seems to say that while those ushered into 'heaven' will be given new bodies, it also appears to say that heaven will be right here on this changed earth, so apparently the physical parameters are still in play.\n \n Whatever, if they have latrine duty, doubtless it will fall on my feet.", 
   {}, 
   398440, 
   null, 
   1271527080.0
  ], 
  [
   398536, 
   null, 
   "pappillion001", 
   "Scripture also says that it has been appointed for man once to die and after that, the judgment. I don't believe anyone has died, gone to heaven, came back to write a book about it. Of course, many have done the latter, though not the former.\n \n As far as Heaven is concerned, it depends upon what one is referring to. Scripture seems to say that while those ushered into 'heaven' will be given new bodies, it also appears to say that heaven will be right here on this changed earth, so apparently the physical parameters are still in play.\n \n Whatever, if they have latrine duty, doubtless it will fall on my feet.\n\n \n The trick is to get a little angle away from your feet and don't do it against any wind or to close to a hard surface. Also shoes help. emoticon_xgood emoticon_xangel\n \n \n \n Couldn't resist", 
   {}, 
   398525, 
   null, 
   1271534160.0
  ], 
  [
   398537, 
   null, 
   "pappillion001", 
   "Not bad...About.com: http://www.epm.org/articles/bibhvn.html\n is a bit more detailed.\n\n \n You might find this interesting.\n \n Bishop: Christians don't go to heaven\n \n According to this Heaven is a lot farther away and possibly more familiar than popular belief.\n \n And you won't find to many more credible pro christian sources than this.", 
   {}, 
   398440, 
   null, 
   1271534700.0
  ], 
  [
   398541, 
   null, 
   "simone", 
   "What heaven is is when ER and Archie and OSS finally figure it out get it straight.", 
   {}, 
   398440, 
   null, 
   1271535480.0
  ], 
  [
   398542, 
   null, 
   "Easyrider", 
   "You might find this interesting.\n \n Bishop: Christians don't go to heaven\n \n According to this Heaven is a lot farther away and possibly more familiar than popular belief.\n \n And you won't find to many more credible pro christian sources than this.\n\n \n Hogwash. Let me show you just one example from your own link why this guy is a screwball. \n \n \nHe explained: \"There is Luke 23, where Jesus says to the good thief on the cross, 'Today you will be with me in paradise.' But in Luke, we know first of all that Christ himself will not be resurrected for three days, so 'paradise' cannot be a resurrection.\n\n \n Typical strawman argument. He confuses a PHYSICAL resurrection in three days with a SPIRITUAL ascension to heaven / paradise on the day of the crucifixion.\n \n To be absent from the body is to be present with the Lord.\n \n Have you ever read the Bible, pappi?", 
   {}, 
   398537, 
   null, 
   1271541300.0
  ], 
  [
   398543, 
   null, 
   "pappillion001", 
   "Hogwash. Let me show you just one example from your own link why this guy is a screwball.\n\n \n Lets see NT Wright \n \n Educated at Sedbergh School, Exeter College, Oxford, receiving his BA with First Class Honours in 1971. During that time he was president of the undergraduate Oxford Inter-Collegiate Christian Union. In 1973 he received a BA in theology with First Class Honours from Exeter.\n \n From 1971 to 1975 he studied for the Anglican ministry at Wycliffe Hall, Oxford, receiving his (Oxford) MA at the end of this period.\n \n 1975 junior research fellow at Merton College, Oxford and later also junior chaplain. \n From 1978 to 1981 he was a fellow and Chaplain at Downing College, Cambridge. \n 1981 he received his DPhil from Merton College, Oxford, \n \n assistant professor of New Testament Studies at McGill University, Montreal (1981-1986), \n Chaplain, Fellow and Tutor at Worcester College\n lecturer in New Testament in the University of Oxford (1986-1993).\n \n Oxford Dean of Lichfield Cathedral (1994-1999) \n Oxford as Visiting Fellow of Merton College, \n Canon Theologian of Westminster Abbey in 2000.\n \n In 2003, he became the Bishop of Durham.\n \n On 4 August 2006 he was appointed to the Court of Ecclesiastical Causes Reserved for a period of five years.\n \n VS.\n \n Easy Rider\n \n Named for a hippie movie\n Avatar is a pagan God\n Received BS in Theology from TV and cat\n Preaches from his zero gravity, double plush, ergonomic, swivel, 5 tone leather, double wide lazy boy recliner with built in remote and heat message.\n \n I think NT Wright has better credentials than you even if he didn't have a Phd or taught religious studies or wasn't the Bisop of Durham you would still have a hard time discrediting him or claiming to have a better understanding of scripture. Maybe you have read his 2003 book The Resurrection of the Son of God, which argued forcefully for a literal interpretation of that event.\n \n \n \nTypical strawman argument. He confuses a PHYSICAL resurrection in three days with a SPIRITUAL ascension to heaven / paradise on the day of the crucifixion.\n \n To be absent from the body is to be present with the Lord.\n\n \n Perfect example of you know what is right and that is all that matters. Here is someone who is without question vastly more knowledgeable than you on this subject and when his view is different than yours it's because he doesn't know what he is talking about. He is just ignorant of a physical resurrection and spiritual ascension, yes a Bishop doesn't have a clue. \n \n And you base your refutation on what? \n \n \n \n \nHave you ever read the Bible, pappi?\n\n \n Yes I have. I have worn the front and back cover off of it. Have you?\n Maybe a better question is what makes you think understand what you have read as was intended?\n \n By the way what happened to Jesus' physical body?", 
   {}, 
   398542, 
   null, 
   1271543580.0
  ], 
  [
   398544, 
   null, 
   "Easyrider", 
   "Lets see NT Wright \n \n Educated at Sedbergh School, Exeter College, Oxford, receiving his BA with First Class Honours in 1971. During that time he was president of the undergraduate Oxford Inter-Collegiate Christian Union. In 1973 he received a BA in theology with First Class Honours from Exeter.\n \n From 1971 to 1975 he studied for the Anglican ministry at Wycliffe Hall, Oxford, receiving his (Oxford) MA at the end of this period.\n \n 1975 junior research fellow at Merton College, Oxford and later also junior chaplain. \n From 1978 to 1981 he was a fellow and Chaplain at Downing College, Cambridge. \n 1981 he received his DPhil from Merton College, Oxford, \n \n assistant professor of New Testament Studies at McGill University, Montreal (1981-1986), \n Chaplain, Fellow and Tutor at Worcester College\n lecturer in New Testament in the University of Oxford (1986-1993).\n \n Oxford Dean of Lichfield Cathedral (1994-1999) \n Oxford as Visiting Fellow of Merton College, \n Canon Theologian of Westminster Abbey in 2000.\n \n In 2003, he became the Bishop of Durham.\n \n On 4 August 2006 he was appointed to the Court of Ecclesiastical Causes Reserved for a period of five years.\n \n VS.\n \n Easy Rider\n \n Named for a hippie movie\n Avatar is a pagan God\n Received BS in Theology from TV and cat\n Preaches from his zero gravity, double plush, ergonomic, swivel, 5 tone leather, double wide lazy boy recliner with built in remote and heat message.\n \n I think NT Wright has better credentials than you even if he didn't have a Phd or taught religious studies or wasn't the Bisop of Durham you would still have a hard time discrediting him or claiming to have a better understanding of scripture. Maybe you have read his 2003 book The Resurrection of the Son of God, which argued forcefully for a literal interpretation of that event.\n\n \n <yawn< \n \n <flush<\n \n The lowly disciples had more Christian wisdom than the \"learned\" pharisees. Once again, you confuse degrees and intelligence with Godly wisdom. \n \n The fact is, Jesus and the thief on the cross were in Paradise / Heaven that day of the crucifixion, and 3 days later Jesus returned to his body for the resurrection. 40 days thereafter Jesus, in his physical body, ascended into the clouds, as you can read about in the book of Acts. Jesus is no liar (and neither is the Bible), and you and your Anglican Bishop don't have a real answer to that, so all you can do is attack the messenger. \n \n Get a new dog. That mother won't hunt. At least on this subject.\n \n But he does have a number of other beliefs on other subjects that are in line with the Bible. You just have to know the Bible and watch out for those who seek to revise it based on suspect scholarship.", 
   {}, 
   398543, 
   null, 
   1271547240.0
  ], 
  [
   398548, 
   null, 
   "Penfold", 
   "That cherrypicked Jastrow quote cracks me up every time I see it. The scientist is climbing the misty mountain of knowledge when he comes upon the group. After a rest and some discussion, he asks what is further up, only to be told that they do not know, as their god placed them at that level, and they had never moved since. Rested, he carries on upward, examining every rock and handhold, while they follow on the wake of his new discoveries. Even the page number, added to give a false air of authenticity, is wrong. emoticon_rolleyes", 
   {}, 
   398544, 
   null, 
   1271551980.0
  ], 
  [
   398549, 
   null, 
   "Easyrider", 
   "Pappi is telling us Bishop N.T. Wright is a highly intelligent scholar, and lists all his degrees, etc.\n \n Well, whether it be one day or three days, Wright does believe Jesus is resurrected. Unless pappi is suddenly going to say Wright is now foolhardy for believing that, pappi needs to start taking the resurrection a lot more seriously. Otherwise, Wright isn't as smart or wise as pappi wants us to believe.\n \n Furthermore, Wright says Jesus is the Jewish Messiah:\n \n \"First, Jesus really is alive again. Second, therefore he really is the Messiah, the world&#8217;s true Lord.\"\n \n Next, Wright argues the earliest Christians would never have \"invented\" their Gospel accounts:\n \n And who is it that carries this stupendous message, this primal announcement of new creation, this heraldic proclamation of the king of kings and his imminent enthronement? It is Mary from Magdala. Considering the reputation subsequent history has given her, it comes as a surprise to learn that, apart from one reference in Luke, the only times Mary Magdalene shows up in the gospel stories is at the cross and the burial, and here at the resurrection. And in the one solitary reference in Luke she is not a prostitute; she is not identified with the woman who wipes Jesus&#8217; feet with her hair; she is someone who has been cured of terrible multiple demon-possession. But the real shock is not Mary&#8217;s character. It is her gender. This is perhaps the most astonishing thing about the resurrection narratives, granted the universal beliefs of the time in the unreliability of women in a lawcourt or almost anywhere else. It is one of the things which absolutely guarantees that the early Christians did not invent these stories. They would never, ever, ever have invented the idea that it was a woman &#8211; a woman with a known background of emotional instability, but the main point is that it was a woman &#8211; to whom had been entrusted the earth-shattering message that Jesus was alive again, that he was on the way to being enthroned as Lord of the World, and that &#8211; this is the significance of the emphatic &#8216;my Father and your Father, my God and your God&#8217; &#8211; he was opening to his followers, as a result of his victory over death itself, that same intimacy with the Father of all that he had enjoyed throughout his earthly life. It is Mary: not Peter, not John, not James the brother of the Lord, but Mary, who becomes the apostle to the apostles, the primary Christian witness, the first Christian evangelist.\n \n The Easter Vocation by the Bishop of Durham, Dr. N.T. Wright\n \n So, pappi, if you want to be intellectually honest about Bishop Wright's accuracy as a Biblical theologian, and ask Sandy and the rest of the posters here to buy into his scholarship, then you have to take him seriously and also believe in Jesus and his resurrection. Otherwise your defense of Wright as a knowledgable, Biblical theologian is an absolute farce.\n \n Shall we put you down as a Christian now?", 
   {}, 
   398548, 
   null, 
   1271554320.0
  ], 
  [
   398557, 
   null, 
   "pappillion001", 
   "<yawn< \n \n <flush<\n \n The lowly disciples had more Christian wisdom than the \"learned\" pharisees. Once again, you confuse degrees and intelligence with Godly wisdom.\n\n \n Do I or do you have to much ego in being right. That neck a little stiff there buddy?\n \n \nThe fact is, Jesus and the thief on the cross were in Paradise / Heaven that day of the crucifixion, and 3 days later Jesus returned to his body for the resurrection.\n \n \n That is a good guess, but not working well. Is the thief still in Heaven with his new resurrected body?\n \n \n40 days thereafter Jesus, in his physical body, ascended into the clouds, as you can read about in the book of Acts. Jesus is no liar (and neither is the Bible), and you and your Anglican Bishop don't have a real answer to that, so all you can do is attack the messenger. \n\n \n Which messenger would that be? Do you believe in a physical resurrection of the same body, different body but physical or spiritual?\n \n \nGet a new dog. That mother won't hunt. At least on this subject.\n \n\n \n Cause it's a good dog, don't chase no possum.\n \n \nBut he does have a number of other beliefs on other subjects that are in line with the Bible. You just have to know the Bible and watch out for those who seek to revise it based on suspect scholarship.\n\n \n Practice what you preach emoticon_xgood\n \n Are you sure it was 3 days? When I asked you what day Jesus was crucified your response was not consistant with the Gospel accounts.", 
   {}, 
   398544, 
   null, 
   1271564580.0
  ], 
  [
   398558, 
   null, 
   "pappillion001", 
   "Pappi is telling us Bishop N.T. Wright is a highly intelligent scholar, and lists all his degrees, etc.\n \n Well, whether it be one day or three days, Wright does believe Jesus is resurrected. Unless pappi is suddenly going to say Wright is now foolhardy for believing that, pappi needs to start taking the resurrection a lot more seriously. Otherwise, Wright isn't as smart or wise as pappi wants us to believe.\n \n Furthermore, Wright says Jesus is the Jewish Messiah:\n \n \"First, Jesus really is alive again. Second, therefore he really is the Messiah, the world's true Lord.\"\n \n Next, Wright argues the earliest Christians would never have \"invented\" their Gospel accounts:\n \n And who is it that carries this stupendous message, this primal announcement of new creation, this heraldic proclamation of the king of kings and his imminent enthronement? It is Mary from Magdala. Considering the reputation subsequent history has given her, it comes as a surprise to learn that, apart from one reference in Luke, the only times Mary Magdalene shows up in the gospel stories is at the cross and the burial, and here at the resurrection. And in the one solitary reference in Luke she is not a prostitute; she is not identified with the woman who wipes Jesus' feet with her hair; she is someone who has been cured of terrible multiple demon-possession. But the real shock is not Mary's character. It is her gender. This is perhaps the most astonishing thing about the resurrection narratives, granted the universal beliefs of the time in the unreliability of women in a lawcourt or almost anywhere else. It is one of the things which absolutely guarantees that the early Christians did not invent these stories. They would never, ever, ever have invented the idea that it was a woman - a woman with a known background of emotional instability, but the main point is that it was a woman - to whom had been entrusted the earth-shattering message that Jesus was alive again, that he was on the way to being enthroned as Lord of the World, and that - this is the significance of the emphatic 'my Father and your Father, my God and your God' - he was opening to his followers, as a result of his victory over death itself, that same intimacy with the Father of all that he had enjoyed throughout his earthly life. It is Mary: not Peter, not John, not James the brother of the Lord, but Mary, who becomes the apostle to the apostles, the primary Christian witness, the first Christian evangelist.\n \n The Easter Vocation by the Bishop of Durham, Dr. N.T. Wright\n \n So, pappi, if you want to be intellectually honest about Bishop Wright's accuracy as a Biblical theologian, and ask Sandy and the rest of the posters here to buy into his scholarship, then you have to take him seriously and also believe in Jesus and his resurrection. Otherwise your defense of Wright as a knowledgable, Biblical theologian is an absolute farce.\n \n Shall we put you down as a Christian now?\n\n \n Foolish mortal. How quickly you go from NT being an ignoramus to intelligent defender of the faith. Problem is you are twisting what I said and the context in which I said it to apply it to a different argument. \n \n You don't need to be intellectually honest, just honest.\n \n If I had a choice, which I did, I would find NT a more credible source than you. No surprise, you think you are a more credible source than him. Next my comments where directed towards his opinion on peoples beliefs regarding when they go to Heaven, that most have misunderstood and/or misinterpreted scripture, something I have repeatedly stated here. \n \n And no I don't have to buy into any of it or by agreeing with him on somethings doesn't mean I must on all things. To use him as you are I could then say the same to you. \n \n I hope you were not to proud of that argument, bolding it and all, but it just doesn't hold up. It doesn't even make a lot of sense, but it was a better attempt than usual, there was some actual thought behind it.", 
   {
    "unicode_changes_made": true
   }, 
   398549, 
   null, 
   1271565420.0
  ], 
  [
   398568, 
   null, 
   "jazyjason", 
   "Heaven to me is a Friday night alone at home first with an Art Pepper album put on. Then after sipping my first glass of wine lounging around and watching old episodes of Star Trek TNG. That and maybe a few fresh rolls of Sushi for dinner too.\n \n Yep... Heaven. And I didn't even have to feel guilty to get there either...\n \n If I want to go to Hell I'll just go down to a nice Gay club, down a couple Cosmo's and grind against some hawt guy in a mesh shirt for a couple hours. That may also be considered heaven too perhaps emoticon_xgood", 
   {}, 
   398558, 
   null, 
   1271592180.0
  ], 
  [
   398573, 
   null, 
   "Easyrider", 
   "\n \n If I had a choice, which I did, I would find NT a more credible source than you.\n\n \n If you thought the New Testament more credible than I you'd be a Christian, but instead you continue to be a spiritually-challenged, stiff-necked infidel.\n \n \nAnd no I don't have to buy into any of it or by agreeing with him on somethings doesn't mean I must on all things. To use him as you are I could then say the same to you.\n \n \n Once again, pappi, if you want to be intellectually honest about Bishop Wright's accuracy as a Biblical theologian, then you have to take him seriously and also believe in Jesus and his resurrection. Otherwise your defense of Wright as a knowledgable, Biblical theologian is an absolute farce. You can't have it both ways and talk out of both sides of your face and expect to be believable.", 
   {}, 
   398558, 
   null, 
   1271597040.0
  ], 
  [
   398574, 
   null, 
   "gansao", 
   "Dry humping another man in a gay club is your idea of heaven!\n Typical sailor....", 
   {}, 
   398568, 
   null, 
   1271597100.0
  ], 
  [
   398575, 
   null, 
   "Archangel", 
   "Heaven to me is a Friday night alone at home first with an Art Pepper album put on. Then after sipping my first glass of wine lounging around and watching old episodes of Star Trek TNG. That and maybe a few fresh rolls of Sushi for dinner too.\n\n \n What a blatant liar! You seek to paint a picture for us then you muddle it by implying that you would listen to this kind of music MySpace Player while simultaneously watching a TV Show like Star Trek which also has a musical soundtrack as background as evidenced here in a random example! YouTube - Star Trek: The Next Generation - The Outcast P1 And how do you like Peppers song selection titled \"Straight Life\", written just for your ilk? Would you really enjoy that playing in the background with TNG? No straight person would.\n \n \nIf I want to go to Hell I'll just go down to a nice Gay club, down a couple Cosmo's and grind against some hawt guy in a mesh shirt for a couple hours. That may also be considered heaven too perhaps emoticon_xgood\n\n \n I marvel at what you homosexual reprobates find enjoyable in life. The shallowness and spiritual shortsightedness you represent reveals how emotionally damaged you are for all to see. And what is so sad is that you aren't even aware of how pathetic your lifestyle is so that you actually boast about it.", 
   {}, 
   398568, 
   null, 
   1271597220.0
  ], 
  [
   398576, 
   null, 
   "Easyrider", 
   "And that's one of the main reasons why God destroyed Sodom and Gomorrah (Jude 7).", 
   {}, 
   398575, 
   null, 
   1271597340.0
  ], 
  [
   398578, 
   null, 
   "gansao", 
   "Looks like JJ has split up with his boyfriend and has gone a bit xxxx happy.\n \n \n Take no notice of himemoticon_rolleyes", 
   {}, 
   398576, 
   null, 
   1271597640.0
  ], 
  [
   398580, 
   null, 
   "Easyrider", 
   "Looks like JJ has split up with his boyfriend and has gone a bit xxxx happy.\n \n Take no notice of himemoticon_rolleyes\n\n \n It's sad and disgusting to see a person in that bad of a morally debased condition.", 
   {}, 
   398578, 
   null, 
   1271598180.0
  ], 
  [
   398585, 
   null, 
   "Esdraelon", 
   "If you thought the New Testament more credible than I you'd be a Christian, but instead you continue to be a spiritually-challenged, stiff-necked infidel.\n \n \n \n Once again, pappi, if you want to be intellectually honest about Bishop Wright's accuracy as a Biblical theologian, then you have to take him seriously and also believe in Jesus and his resurrection. Otherwise your defense of Wright as a knowledgable, Biblical theologian is an absolute farce. You can't have it both ways and talk out of both sides of your face and expect to be believable.\n\n \n That is true, if you quote Wright as a rebuttal, at least take him seriously......Also, Easy is correct on the physical/spiritual note.", 
   {}, 
   398573, 
   null, 
   1271602320.0
  ], 
  [
   398586, 
   null, 
   "Esdraelon", 
   "Looks like JJ has split up with his boyfriend and has gone a bit xxxx happy.\n \n \n Take no notice of himemoticon_rolleyes\n\n \n Unlikely, that's why they have the bathouses and public parks; for those 'loving and committed relationships'.", 
   {}, 
   398578, 
   null, 
   1271602560.0
  ], 
  [
   398592, 
   null, 
   "pappillion001", 
   "If you thought the New Testament more credible than I you'd be a Christian, but instead you continue to be a spiritually-challenged, stiff-necked infidel.\n\n \n The Bishops name is NT Wrirght, I was referring to him not The New Testament, heathen idolater\n \n \nOnce again, pappi, if you want to be intellectually honest about Bishop Wright's accuracy as a Biblical theologian, then you have to take him seriously and also believe in Jesus and his resurrection. Otherwise your defense of Wright as a knowledgable, Biblical theologian is an absolute farce. You can't have it both ways and talk out of both sides of your face and expect to be believable.\n\n \n You have been trained to believe that if you just keep saying the same thing over and over again you will just wear the side down. This is not the same as being right, nor even persistent. Stubborn, yes but wrong just the same. \n \n So do you believe that everyone is either right on all things or wrong on all things? Do you agree with everything person believes if you agree with one thing they believe? Because that is what your saying above. \n \n His credentials are fact, whether I agree or not means nothing regarding his academic and professional achievements. They are what they are. The fact that I agree with him on some things and disagree on others doesn't change that.\n \n So it was a good attempt the first time, but you went down with the ship the second time. Thanks for coming out though, emoticon_xbye\n \n Oh did you plan on addressing any of the questions I had or should I just put them with the others you have not answered?", 
   {}, 
   398573, 
   null, 
   1271616540.0
  ], 
  [
   398593, 
   null, 
   "pappillion001", 
   "That is true, if you quote Wright as a rebuttal, at least take him seriously......Also, Easy is correct on the physical/spiritual note.\n\n \n Nice, this should be directed to ER. I do take him seriously, otherwise I wouldn't have used him as evidence. Does it mean I think he is a joke if don't agree with everything he believes? \n \n Interestingly enough here is what easy first said about the bishop\n \n \nHogwash. Let me show you just one example from your own link why this guy is a screwball. \n\n \n \n \nGet a new dog. That mother won't hunt. At least on this subject.\n \n But he does have a number of other beliefs on other subjects that are in line with the Bible. You just have to know the Bible and watch out for those who seek to revise it based on suspect scholarship. \n\n \n Why is ER allowed to use him to make point regarding the resurrection, which he is in agreement with, but question his credentials and calls him a screwball when he does not agree with him?\n \n I disagree with ER on spiritual ascension with the thief vs physical resurrection as an explanation.\n \n Just a thought, nobody was allowed near the people who were crucified, so how does anyone know what was said?", 
   {}, 
   398585, 
   null, 
   1271617740.0
  ], 
  [
   398594, 
   null, 
   "pappillion001", 
   "And that's one of the main reasons why God destroyed Sodom and Gomorrah (Jude 7).\n\n \n Get real would you. That is pure speculation well after the fact.", 
   {}, 
   398576, 
   null, 
   1271617860.0
  ], 
  [
   398596, 
   null, 
   "Easyrider", 
   "Why is ER allowed to use him to make point regarding the resurrection, which he is in agreement with,\n\n \n \"ER allowed\"? Who are you, the Obama \"not-so-free-speech\" police?\n \n For the record, I didn't disagree with the resurrection, but when Jesus arose spiritually, vs. physically (the latter 3 days later). \n \n \nbut question his credentials and calls him a screwball when he does not agree with him?\n\n \n He was a screwball on that one issue. He was basically calling Jesus a liar or a nincompoop. Also, if you recall, I said he had a number of other beliefs that appeared to be ok.\n \n And please spare us the Appeal to Authority jive. I'm quite sure I have more degrees than you, if I decided to list them. That's not the point, though. Intelligence doesn't always equate with Godly wisdom, as we find in your case. Address the argument instead, which you were busted on.", 
   {}, 
   398593, 
   null, 
   1271618520.0
  ], 
  [
   398597, 
   null, 
   "Easyrider", 
   "Get real would you. That is pure speculation well after the fact.\n\n \n Nope. You have nothing to back up your claim. I do - the Word of God. That's the difference.", 
   {}, 
   398594, 
   null, 
   1271618640.0
  ], 
  [
   398602, 
   null, 
   "jazyjason", 
   "Dry humping another man in a gay club is your idea of heaven!\n Typical sailor....\n\n \n Hey I never said hump.. I said grind emoticon_xangel There is a difference. Actually I don't really dance that often I normally just hang out with a group of friends.", 
   {}, 
   398574, 
   null, 
   1271621160.0
  ], 
  [
   398603, 
   null, 
   "jazyjason", 
   "What a blatant liar! You seek to paint a picture for us then you muddle it by implying that you would listen to this kind of music MySpace Player while simultaneously watching a TV Show like Star Trek which also has a musical soundtrack as background as evidenced here in a random example! \n\n \n What? I would listen to the album first XXXXX.... Without the TV on... It's how I normally listen to Jazz and get most of my Improvisational ideas.... I wouldn't listen to Art Pepper while watching TNG......\n \n \n \n \n \n YouTube - Star Trek: The Next Generation - The Outcast P1 And how do you like Peppers song selection titled \"Straight Life\", written just for your ilk? Would you really enjoy that playing in the background with TNG? No straight person would.\n\n \n Archie your an XXXXX. Straight Life was one of the best songs Pepper ever made and is personally my favorite. I actually have all the written solo's and everything transcribed for both Eb and Bb respectively. Pepper is one of my favorite Alto Sax Soloists and is the pure example of why Bebop is still great...\n \n And once again.... I said NOT while watching TNG. You people really need to get a grip and stop grasping at air....\n \n \n \n \n \nI marvel at what you homosexual reprobates find enjoyable in life. The shallowness and spiritual shortsightedness you represent reveals how emotionally damaged you are for all to see. And what is so sad is that you aren't even aware of how pathetic your lifestyle is so that you actually boast about it.\n\n \n Naw. See I'm not \"emotionally damaged\" and I'm quite comfortable and at ease with my life. I just love your response because it just shows you'll jump on anything relative to homosexuality like a fly jumps on XXXX...\n \n Oh and P.S. I really don't care what your \"ideals\" are on my life Arch. To me your just another sad delusional religious extremist with nothing more than ancient texts to try and change peoples lives and the laws in this country to serve your own agenda's....", 
   {}, 
   398575, 
   null, 
   1271621580.0
  ], 
  [
   398604, 
   null, 
   "jazyjason", 
   "Looks like JJ has split up with his boyfriend and has gone a bit xxxx happy.\n \n \n Take no notice of himemoticon_rolleyes\n\n \n Actually he cheated on me so I dumped him... I was faithful to the fullest even while being screwed behind my back by him... And if your implying I'm in some sort of mental state due to the breakup no I'm not.\n \n Him and I still talk, just I don't trust him nor have any feelings anymore toward him...", 
   {}, 
   398578, 
   null, 
   1271621700.0
  ], 
  [
   398606, 
   null, 
   "jazyjason", 
   "It's sad and disgusting to see a person in that bad of a morally debased condition.\n\n \n Sad? I get laid and it's a \"morally debased condition.\" And how exactly would you analyze your other patients conditions Dr. Mengle?", 
   {}, 
   398580, 
   null, 
   1271621820.0
  ], 
  [
   398608, 
   null, 
   "gansao", 
   "Actually he cheated on me so I dumped him... I was faithful to the fullest even while being screwed behind my back by him... And if your implying I'm in some sort of mental state due to the breakup no I'm not.\n \n Him and I still talk, just I don't trust him nor have any feelings anymore toward him...\n\n \n You just seem a bit more full on than usual JJ.", 
   {}, 
   398604, 
   null, 
   1271622180.0
  ], 
  [
   398621, 
   null, 
   "jazyjason", 
   "You just seem a bit more full on than usual JJ.\n\n \n Yeah well maybe it's because of the crazy hours I've been working with 3 jobs and all plus the lack of sleep. Meh.", 
   {}, 
   398608, 
   null, 
   1271638560.0
  ], 
  [
   398622, 
   null, 
   "jazyjason", 
   "Unlikely, that's why they have the bathouses and public parks; for those 'loving and committed relationships'.\n\n \n Actually we've been through for roughly 3 weeks now. So I'm single, I have fun, and so what! Oh and that nice implying of the loving and committed relationships deal is so hilarious.\n \n Btw hows that Confederate History month going for you? Bet you busted out yer guns and fired off a few salvos when you heard that news....", 
   {}, 
   398586, 
   null, 
   1271638680.0
  ], 
  [
   398629, 
   null, 
   "pappillion001", 
   "\"ER allowed\"? Who are you, the Obama \"not-so-free-speech\" police?\n\n \n Making a point that what he felt was suffucient reasoin to make a comment towards my post he ignored yours which was actually guilty of what he stated I was doing. Which of course I wasn't, but you did.\n \n \nFor the record, I didn't disagree with the resurrection, but when Jesus arose spiritually, vs. physically (the latter 3 days later). \n \n He was a screwball on that one issue. He was basically calling Jesus a liar or a nincompoop. Also, if you recall, I said he had a number of other beliefs that appeared to be ok.\n\n \n Ok as long as you admit your a hypocrite I won't push it. \n \n Because the issue, which you keep avoiding, was your statement that I have to agree with everything he believes in order to use his opinion of a particular event. Which is exactly what you are saying above. Does this mean, as you put it, your argument is a farce or is this your way, of your words, being intellectually honest?\n \n \nAnd please spare us the Appeal to Authority jive. I'm quite sure I have more degrees than you, if I decided to list them. That's not the point, though. Intelligence doesn't always equate with Godly wisdom, as we find in your case. Address the argument instead, which you were busted on.\n\n \n I am not the one whose credentials you questioned. You made a statement about the Bissops qualifications, I pointed out that he has more than enough learning and training to be considered credible. Do you think you have more relevant education and professional experience than he does? \n \n No, I didn't think so either. \n \n No oh fountain of wisdom he was saying man has misinterpreted various parts of scripture. As for being spiritually ignorant, take a look in the mirror my friend. What do call it when someone does the kind of mental gymnastics you do to make everything work out?\n \n Busted, not yet by you. I have addressed every issue you have brought up. Your batting well below the Mendoza line in responses and going ofer when it comes to actually making your point.\n \n As I said your tactic of just keep saying the same thing whether true or not may have bored other people into just giving up, but I am patient. One day you will see the light and that stiffness will flow out of you. emoticon_smile", 
   {}, 
   398596, 
   null, 
   1271643480.0
  ], 
  [
   398631, 
   null, 
   "pappillion001", 
   "Nope. You have nothing to back up your claim. I do - the Word of God. That's the difference.\n\n \n I have the word of God. \n \n You have the word of Paul and your opinion.", 
   {}, 
   398597, 
   null, 
   1271643720.0
  ], 
  [
   398661, 
   null, 
   "Easyrider", 
   "You're busted, pappi. Every time you go up against the Word of God you're busted. Must be depressing for you to have to take such a whipping day in and day out. \n \n You'll know how busted you really are when you vapor lock and wind up in the Pit with yo spiritual daddy, the devil. Recommend you repent and receive Jesus Christ as your Lord and Savior for the remission of your sins.\n \n John 3:36", 
   {}, 
   398631, 
   null, 
   1271684160.0
  ], 
  [
   398671, 
   null, 
   "jazyjason", 
   "\n You'll know how busted you really are when you vapor lock and wind up in the Pit with yo spiritual daddy, the devil. \n \n\n \n So Easy now speaks in Ebonics? This is hilarious..... Maybe this is tongues for him....", 
   {}, 
   398661, 
   null, 
   1271694600.0
  ], 
  [
   398676, 
   null, 
   "Sandycane", 
   "So Easy now speaks in Ebonics? This is hilarious..... Maybe this is tongues for him....\n\n \n I noticed that, too. emoticon_xclown", 
   {}, 
   398671, 
   null, 
   1271700600.0
  ], 
  [
   398681, 
   null, 
   "Sandycane", 
   "My Trip to Heaven by Rev. Lonnie Honeycutt\n \n 'Again, the light I was bathed in seemed to permeate everything to such an extent that all I saw almost glowed from it. Yet, the light, being ever so bright, didn&#8217;t hurt my eyes.'\n \n 'One of the most enduring memories I have is of the breeze and the smell of Heaven. While walking along the road I felt the most wonderful breeze &#8211; not too warm or too chilly or too hard &#8211; but it was steady and constant. And, on that breeze, there was a smell unlike anything I can describe. It was so very, very sweet though not overpowering.' \n \n I was in Heaven all weekend...working in my yard. emoticon_xgoodemoticon_love\n \n I thought of this text often as I observed the Iris, Bleeding Heart, Redbud, Cherry and daffodil in bloom. Every breeze tickled me silly and the scent of Spice Bush, Lilacs, Lily of the Valley and Empress Tree made me tipsy. emoticon_xhoho\n \n If this is the best Heaven has to offer, I've got heaven right here on Earth!\n \n I have never heard mention of animals being in Heaven. Are there any?\n 'RevLon' didn't mention bees, butterflies, hummingbirds, Starlings, squirrels, rabbits or bunnies, either.\n Wouldn't want to be anyplace where there weren't any critter besides humans.emoticon_mad\n \n If Heaven, eternity with God, is the best perk for being a Christian then you Christians are going to have to do a better sales pitch that what I've seen here...\n and the threat of 'hell' is not a good substitute for selling me on Heaven - since I don't really believe either exist.\n \n Is this an accurate description of the Christian process of dying?:\n \n The Christian physical body dies, the 'Spirit' immediately goes to be with The Lord.\n All Christians stay in this state until the day Jesus creates a new physical Heaven and Earth at which time, they are all brought back into a physical body to live on the new Earth...where there is no more death or sorrow.\n \n After you answer this, I have some more questions. ;)", 
   {}, 
   398676, 
   null, 
   1271701860.0
  ], 
  [
   398684, 
   null, 
   "simone", 
   "Sandycane, if thou truly be an angel of the garden...\n \n Are you organic?", 
   {}, 
   398681, 
   null, 
   1271703060.0
  ], 
  [
   398685, 
   null, 
   "pappillion001", 
   "You're busted, pappi. Every time you go up against the Word of God you're busted. Must be depressing for you to have to take such a whipping day in and day out. \n \n You'll know how busted you really are when you vapor lock and wind up in the Pit with yo spiritual daddy, the devil. Recommend you repent and receive Jesus Christ as your Lord and Savior for the remission of your sins.\n \n John 3:36\n\n \n Is that what you think it means to be everyone's whipping boy? You just keep thinking that. It will all be ok soon. Maybe this will cheer you up\n \n Q: Why did the chicken cross the road?\n A: It was God's will.\n \n Q: Why did the turkey cross the road?\n A: That was also God's will.\n \n Q: Why did the heretic cross the road?\n A: To do something sinful on the other side.\n \n Q: Why did the heretic get run over by an ox-cart (or pick-up truck) while he was crossing the road?\n A: Because he was sinful and he deserved it.\n \n Q: Why did the true believer get run over by an ox-cart (or pick-up truck) while he was crossing the road?\n A: Because our godless enemies wish to destroy us and everything we stand for and therefore we must destroy them first.\n \n \"Knock, knock.\"\n \"Who's there?\"\n \"A woman.\"\n \"A woman who?\"\n \"A woman who would like an eighth grade education.\"\n \"You are an infidel and a whore and your husband needs to beat you far more frequently.\"\n \n Q: How many defenders of the true faith does it take to screw in a light bulb?\n A: What's a light bulb?\n \n Q: How can you tell a heretic from a true believer?\n A: The true believer will have been blessed by Almighty God with more goats (or pickup trucks) than the heretic. And if he hasn't, God in his wisdom has granted permission for the true believer to kill the heretic and take his goats (or pickup trucks).\n \n \n Go back to your drum circle hippie, before they eat all your brownies and leave you playing with seagulls and sand crabs.\n \n \n or make your point with something other than because you said so", 
   {}, 
   398661, 
   null, 
   1271703180.0
  ], 
  [
   398686, 
   null, 
   "pappillion001", 
   "My Trip to Heaven by Rev. Lonnie Honeycutt\n \n 'Again, the light I was bathed in seemed to permeate everything to such an extent that all I saw almost glowed from it. Yet, the light, being ever so bright, didn't hurt my eyes.'\n \n 'One of the most enduring memories I have is of the breeze and the smell of Heaven. While walking along the road I felt the most wonderful breeze - not too warm or too chilly or too hard - but it was steady and constant. And, on that breeze, there was a smell unlike anything I can describe. It was so very, very sweet though not overpowering.' \n \n I was in Heaven all weekend...working in my yard. emoticon_xgoodemoticon_love\n \n I thought of this text often as I observed the Iris, Bleeding Heart, Redbud, Cherry and daffodil in bloom. Every breeze tickled me silly and the scent of Spice Bush, Lilacs, Lily of the Valley and Empress Tree made me tipsy. emoticon_xhoho\n \n If this is the best Heaven has to offer, I've got heaven right here on Earth!\n \n I have never heard mention of animals being in Heaven. Are there any?\n 'RevLon' didn't mention bees, butterflies, hummingbirds, Starlings, squirrels, rabbits or bunnies, either.\n Wouldn't want to be anyplace where there weren't any critter besides humans.emoticon_mad\n \n If Heaven, eternity with God, is the best perk for being a Christian then you Christians are going to have to do a better sales pitch that what I've seen here...\n and the threat of 'hell' is not a good substitute for selling me on Heaven - since I don't really believe either exist.\n \n Is this an accurate description of the Christian process of dying?:\n \n The Christian physical body dies, the 'Spirit' immediately goes to be with The Lord.\n All Christians stay in this state until the day Jesus creates a new physical Heaven and Earth at which time, they are all brought back into a physical body to live on the new Earth...where there is no more death or sorrow.\n \n After you answer this, I have some more questions. ;)\n\n \n Seems a strange process and oddly probably won't work. It just repeats what God has already tried. Adam and Eve were not made to live forever. There is no point having a tree of life for an immortal. If he were able to give us a physical body that wasn't subject to sin and that was his intention wouldn't it make more sense to just start with the sinless physical body?\n \n Animals don't have souls so they don't get to go to heaven. I heard on the radio one woman was deeply concerned that if the rapture happened while she was driving the car may crash with her pet in it, so no longer took him with her in the car.\n \n Heaven to me is an expansion of what you have found. \n \n Matt 16:19 and I will give to thee the keys of the reign of the heavens, and whatever thou mayest bind upon the earth shall be having been bound in the heavens, and whatever thou mayest loose upon the earth shall be having been loosed in the heavens.' \n \n and\n \n Matt 18:18 Whatever things ye may bind upon the earth shall be having been bound in the heavens, and whatever things ye may loose\n on the earth shall be having been loosed in the heavens.\n \n This is our Heaven and it is what we make it.", 
   {
    "unicode_changes_made": true
   }, 
   398681, 
   null, 
   1271704740.0
  ], 
  [
   398689, 
   null, 
   "Sandycane", 
   "Sandycane, if thou truly be an angel of the garden...\n \n Are you organic?\n\n \n emoticon_love Absolutely! 100% \n ...well, except when it comes to red wasps - I break out the can of Raid for their little arses. emoticon_xkill", 
   {}, 
   398684, 
   null, 
   1271706480.0
  ], 
  [
   398691, 
   null, 
   "Sandycane", 
   "Seems a strange process and oddly probably won't work. It just repeats what God has already tried. Adam and Eve were not made to live forever. There is no point having a tree of life for an immortal. If he were able to give us a physical body that wasn't subject to sin and that was his intention wouldn't it make more sense to just start with the sinless physical body?\n\n I agree.\n If god has/had the power to create a world devoid of death and sorrow in the first place then it is purely sadistic to force creation to endure eons of pain, sorrow, suffering, and death. emoticon_xkill\n \n I've seen some Christians come back with 'He's just weeding out those who want to be with God from those who don't.' Well, duh! Who would not want to be with a God who created them in a Perfect World? emoticon_confused Free will or not, only a complete retard would opt for death. emoticon_rolleyes\n ...and what about free will...does it remain intack after death? Can you choose to leave Heaven after you get there and find it's not what you thought it would be?\n \nAnimals don't have souls so they don't get to go to heaven. I heard on the radio one woman was deeply concerned that if the rapture happened while she was driving the car may crash with her pet in it, so no longer took him with her in the car. \n\n Who says they don't have souls? If a dispicable human can have one then I see no reason why other life forms can't. emoticon_xhoho\n \n \nHeaven to me is an expansion of what you have found. \n \n Matt 16:19 and I will give to thee the keys of the reign of the heavens, and whatever thou mayest bind upon the earth shall be having been bound in the heavens, and whatever thou mayest loose upon the earth shall be having been loosed in the heavens.' \n \n and\n \n Matt 18:18 Whatever things ye may bind upon the earth shall be having been bound in the heavens, and whatever things ye may loose\n on the earth shall be having been loosed in the heavens.\n\n I don't know about the bible verses...emoticon_confused\n If that is true, then Heaven wouldn't be any different that living on earth:\n Gay's, crack-heads, political junkies and perverts of all kinds, cell phone and text messaging junkies, gossips, people who are unnaturally nice all the time...unless each individual has their own private Heaven designed just for them. That would be nice. emoticon_xgood\n \nThis is our Heaven and it is what we make it.\n\n \n Amen to that. emoticon_xangel", 
   {}, 
   398686, 
   null, 
   1271707500.0
  ], 
  [
   398694, 
   null, 
   "gansao", 
   "No one knows what heaven will be like and very few will find out, I suspect.", 
   {}, 
   398691, 
   null, 
   1271708220.0
  ], 
  [
   398699, 
   null, 
   "Sandycane", 
   "No one knows what heaven will be like and very few will find out, I suspect.\n\n \n If no one knows what Heaven will be like then why should anyone want to end up there for all eternity emoticon_confused", 
   {}, 
   398694, 
   null, 
   1271713560.0
  ], 
  [
   398703, 
   null, 
   "gansao", 
   "If no one knows what Heaven will be like then why should anyone want to end up there for all eternity emoticon_confused\n\n \n Good question.\n If the afterlife is anything like the life we have on Earth could you or me really want to live forever.\n A googleplex of years doing the same things and knowing it will NEVER end?", 
   {}, 
   398699, 
   null, 
   1271714280.0
  ], 
  [
   398721, 
   null, 
   "Sandycane", 
   "Good question.\n If the afterlife is anything like the life we have on Earth could you or me really want to live forever.\n A googleplex of years doing the same things and knowing it will NEVER end?\n\n \n I know! :xbanghead\n Even total bliss would become boring at some point in time, wouldn't it?\n I would think eventually, you'd want to just turn it off! emoticon_xclown Heck, I'll bet along with the lack of death and sorrow, there would be a lack of sleep. You couldn't even dream of being in a different place.\n \n Doesn't sound good to me.", 
   {}, 
   398703, 
   null, 
   1271717160.0
  ], 
  [
   398816, 
   null, 
   "simone", 
   "emoticon_love Absolutely! 100% \n ...well, except when it comes to red wasps - I break out the can of Raid for their little arses. emoticon_xkill\n\n Excellent! And I will intercede with Goddess on your behalf because of the red wasps. She says she has a nice harp and set of wings for you. Do you want your halo to have a decorative design or not?", 
   {}, 
   398689, 
   null, 
   1271790600.0
  ], 
  [
   398820, 
   null, 
   "Sandycane", 
   "Excellent! And I will intercede with Goddess on your behalf because of the red wasps. She says she has a nice harp and set of wings for you. Do you want your halo to have a decorative design or not?\n\n \n emoticon_loveemoticon_xangelemoticon_xgood\n \n Nah, decoration not necessary...", 
   {}, 
   398816, 
   null, 
   1271793360.0
  ], 
  [
   398871, 
   null, 
   "Easyrider", 
   "If no one knows what Heaven will be like then why should anyone want to end up there for all eternity emoticon_confused\n\n \n The only alternative is hell. You don't really want any part of that, do you? Five minutes down there and you'll want all the heaven you can get. emoticon_smile", 
   {}, 
   398699, 
   null, 
   1271820180.0
  ], 
  [
   398877, 
   null, 
   "pappillion001", 
   "The only alternative is hell. You don't really want any part of that, do you? Five minutes down there and you'll want all the heaven you can get. emoticon_smile\n\n \n Gee, why is it you are able to give such and informed description of Hell but can't even offer a guess at what Heaven is like?\n \n Are you keeping secrets?", 
   {}, 
   398871, 
   null, 
   1271822220.0
  ], 
  [
   398884, 
   null, 
   "jazyjason", 
   "The only alternative is hell. You don't really want any part of that, do you? Five minutes down there and you'll want all the heaven you can get. emoticon_smile\n\n \n \n Five minutes down \"there\" with you would be hell Easy....", 
   {}, 
   398871, 
   null, 
   1271826480.0
  ], 
  [
   398919, 
   null, 
   "Sandycane", 
   "The only alternative is hell. You don't really want any part of that, do you? Five minutes down there and you'll want all the heaven you can get. emoticon_smile\n\n \n 'The only alternative is hell'. \n You have not proven that 'Heaven' exists so, why would I believe there is a hell?\n Even if there is a heaven and hell, why would I believe that they are the only alternative?\n \n 'You don't really want any part of that, do you?'\n Like I said, without proof that either heaven or hell even exist, I don't believe that they are my only options.\n \n 'Five minutes down there and you'll want all the heaven you can get.'\n From what little that has been described of both, I wouldn't want either.\n \n If the only enticement there is for heaven is a threat of hell, then heaven can't be all that much.", 
   {}, 
   398871, 
   null, 
   1271863620.0
  ], 
  [
   398962, 
   null, 
   "Easyrider", 
   "'The only alternative is hell'. \n You have not proven that 'Heaven' exists so, why would I believe there is a hell?\n Even if there is a heaven and hell, why would I believe that they are the only alternative?\n \n 'You don't really want any part of that, do you?'\n Like I said, without proof that either heaven or hell even exist, I don't believe that they are my only options.\n \n 'Five minutes down there and you'll want all the heaven you can get.'\n From what little that has been described of both, I wouldn't want either.\n \n If the only enticement there is for heaven is a threat of hell, then heaven can't be all that much.\n\n \n Just because you don't believe in it doesn't mean it doesn't exist. The Lord Jesus who was raised from the dead spoke about it. And he ought to know.", 
   {}, 
   398919, 
   null, 
   1271892600.0
  ], 
  [
   398984, 
   null, 
   "pappillion001", 
   "Just because you don't believe in it doesn't mean it doesn't exist. The Lord Jesus who was raised from the dead spoke about it. And he ought to know.\n\n \n Revelations has some rather disturbing descriptions of Heaven and what goes on. There is a lot of praising God followed by more praising God and then after that everyone tells everyone else there how good God is. Other than that it pretty much describes a nightmare full of blood, half man - half animal things and other Dali paintings.", 
   {}, 
   398962, 
   null, 
   1271900880.0
  ], 
  [
   398997, 
   null, 
   "Easyrider", 
   "Revelations has some rather disturbing descriptions of Heaven and what goes on. There is a lot of praising God followed by more praising God and then after that everyone tells everyone else there how good God is. Other than that it pretty much describes a nightmare full of blood, half man - half animal things and other Dali paintings.\n\n \n That's the way it always seems to the Biblically-challenged. \n \n Here's a book you can start your Revelation education with:\n \n Amazon.com: The Book of Revelation For Dummies (9780470045213): Larry R. Helyer, Richard Wagner: Books", 
   {}, 
   398984, 
   null, 
   1271904300.0
  ], 
  [
   399002, 
   null, 
   "trebor", 
   "Just because you don't believe in it doesn't mean it doesn't exist. The Lord Jesus who was raised from the dead spoke about it. And he ought to know.\n\n \n Of course, you have yet to show any evidence outside of religious propoganda that 'Jesus was raised from the Dead'\n \n If Jesus came back from the dead, have him drop by my house friday night, and we can go over to the pub and talk about it over a beer.", 
   {}, 
   398962, 
   null, 
   1271905440.0
  ], 
  [
   399004, 
   null, 
   "trebor", 
   "That's the way it always seems to the Biblically-challenged. \n \n Here's a book you can start your Revelation education with:\n \n Amazon.com: The Book of Revelation For Dummies (9780470045213): Larry R. Helyer, Richard Wagner: Books\n\n \n \n So that's where you get your religious education from !!!\n \n Books written for 'Dummies'!!!", 
   {}, 
   398997, 
   null, 
   1271906460.0
  ], 
  [
   399067, 
   null, 
   "Sandycane", 
   "Just because you don't believe in it doesn't mean it doesn't exist. The Lord Jesus who was raised from the dead spoke about it. And he ought to know.\n\n \n ...and just because you believe it doesn't mean it does exist. emoticon_rolleyes\n \n What about what Pappillion said: eternity of doing nothing but worshiping god. Would they hand out band-aids for skinned knees? emoticon_xclown\n \n If there is a heaven where all dead souls are accumulating before the new heaven and Earth are created, what, exactly, are they doing and what, exactly, will they be doing in the new world?\n \n If human nature is such that we are free to think and do as we please - for better or for worse - then what will these new and improved versions be like? Seems to me, without feelings and emotions we would be nothing but mindless robots, wouldn't we?", 
   {}, 
   398962, 
   null, 
   1271952840.0
  ], 
  [
   399183, 
   null, 
   "Sandycane", 
   "Oh, come on, Christian Soldiers! \n \n This is like some Sci-fi movie - Return of the Zombies!\n \n Can it be that thousands of years of Christians have Never seriously considered the actual ramifications of an eternity in heaven?\n \n That they only have this misty, smeared water-color image of what it Might be like?\n That they have Never imagined exactly what an eternity in Heaven would be like?\n \n :xbanghead\n \n I would rather spend one mortal life living it to the fullest and spend an eternity in oblivion than go through life with blinders on and spend eternity as a mindless droid. emoticon_xhoho", 
   {}, 
   399067, 
   null, 
   1272046380.0
  ], 
  [
   399197, 
   null, 
   "Easyrider", 
   "Oh, come on, Christian Soldiers! \n \n This is like some Sci-fi movie - Return of the Zombies!\n \n Can it be that thousands of years of Christians have Never seriously considered the actual ramifications of an eternity in heaven?\n \n That they only have this misty, smeared water-color image of what it Might be like?\n That they have Never imagined exactly what an eternity in Heaven would be like?\n \n :xbanghead\n \n I would rather spend one mortal life living it to the fullest and spend an eternity in oblivion than go through life with blinders on and spend eternity as a mindless droid. emoticon_xhoho\n\n \n Lot's of Christians have been taken spiritually and seen heaven. I linked you to one of them previously. If you start watching PTL and Daystar you'll hear the testimonies of many more. Otherwise you'll remain in the dark. Your choice. emoticon_wow", 
   {}, 
   399183, 
   null, 
   1272051540.0
  ], 
  [
   399202, 
   null, 
   "trebor", 
   "Lot's of Christians have been taken spiritually and seen heaven. I linked you to one of them previously. If you start watching PTL and Daystar you'll hear the testimonies of many more. Otherwise you'll remain in the dark. Your choice. emoticon_wow\n\n \n LOL. Prove that. LOL You are so full of it that if you ever took a laxative you would disappear.", 
   {}, 
   399197, 
   null, 
   1272052200.0
  ], 
  [
   399208, 
   null, 
   "Sandycane", 
   "Lot's of Christians have been taken spiritually and seen heaven. I linked you to one of them previously. If you start watching PTL and Daystar you'll hear the testimonies of many more. Otherwise you'll remain in the dark. Your choice. emoticon_wow\n\n \n The description written by RevLon was not in the least inspiring...as I said, I already have that here.\n I have no desire to read about other whackos imagined trips to Heaven.\n First of all, if they were REALLY dead, which is a condition of getting into heaven, they would not have come back - to do so would trivialize the death and resurrection of Jesus...\n \n I wish you would quit referring to delusional visions of the derranged and really think about what an eternity in 'Heaven' would be like.\n If you were honest with me and yourself, you would admit that the reality of it would be much like hell...\n \n Seriously. In this life, we have an infinite number of choices to make. We can choose who we want to be and who we want to be with. Where we want to be and where we want to go. Some people would like to do nothing but sit on a river bank and fish for all their life, others would be bored out of their minds doing the same thing day in and day out.\n \n If Heaven is a 'perfect' place, what is it that makes it so?\n RevLon mentioned a road and buildings - who built them and who maintains them? Are there never any more than what there is? Who cleans them? If there is no dust, there is no dirt. No dirt, no trees.\n He mentioned trees and flowers. Who cultivates them and who cleans up the debris?\n Is there only life and no death?\n Do the trees grow continually? Or, are they just there - no death and no growth...Is that what it would be like for the people - no death, no growth, just always being the same...for all eternity???\n RevLon said there were no shadows. No shadows, no sun. No sun no seasons. No seasons, plants don't grow.\n Do the plants just keep growing? If there is no death, then there would be no deciduous trees to shed dead leaves, no dead limbs to pick up.\n \n Is it just 'no death' for humans?\n If so, someone will have to get busy keeping The Garden tidy...and that would require a boss and laborers...which would create a system much as we have right here. Is god the one and only Boss and all the rest of us are the slaves? Some slaves will be assigned the XXXX jobs and others will get the cushy jobs. That will cause mutiny at some point, I would imagine.\n \n No sadness and death (for humans only)? I would be sad if a tree I had been cultivating for 2,000 years died.\n \n ...and who is making all of the white robes emoticon_confused Are there sewing machines or does god just make them appear out of nothing?\n Or, is it all just an illusion to begin with, where nothing is real but only imagined?\n \n The only way the Christian concept of Heaven would work is if all the people were mindless droids, lacking any hint of free will, emotion, and all the wonderful qualities that make us human.\n I wouldn't want any part of it.emoticon_rolleyes\n \n Besides, even if these accounts are true (which they are not), there is a huge difference (eternally) between a 60 minute trip to heaven and that of being there forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and forever and ...\n \n Get my drift? emoticon_rolleyes", 
   {}, 
   399197, 
   null, 
   1272056400.0
  ], 
  [
   399232, 
   null, 
   "Easyrider", 
   "Sandy,\n \n Tsk tsk...\n \n Who said you had to be dead to have a vision or visions of heaven? Is that from your secular handbook on religion?  Because it's sure not Biblical.\n \n If you'd like to see into the spiritual world, along with another description of heaven, here you go. This has been on TV recently. And there's more from prior weeks you can click on, including visions of Jesus, healings, etc.\n \n Sid Roth - It's Supernatural Messianic Vision: John Fenn - Five Spiritual Senses\n \n It's Supernatural is on TV each week. I can see it on Daystar at 9:30 PM CST on Thursdays, and it was on today (Friday) at 6:30 PM CST on PTL network.", 
   {}, 
   399208, 
   null, 
   1272074640.0
  ], 
  [
   399243, 
   null, 
   "trebor", 
   "Sandy,\n \n Tsk tsk...\n \n Who said you had to be dead to have a vision or visions of heaven? Is that from your secular handbook on religion?  Because it's sure not Biblical.\n \n If you'd like to see into the spiritual world, along with another description of heaven, here you go. This has been on TV recently. And there's more from prior weeks you can click on, including visions of Jesus, healings, etc.\n \n Sid Roth - It's Supernatural Messianic Vision: John Fenn - Five Spiritual Senses\n \n It's Supernatural is on TV each week. I can see it on Daystar at 9:30 PM CST on Thursdays, and it was on today (Friday) at 6:30 PM CST on PTL network.\n\n \n Also known as 'Let's bilk the superstitious and the ignorant out of their money.", 
   {}, 
   399232, 
   null, 
   1272082140.0
  ], 
  [
   399266, 
   null, 
   "Easyrider", 
   "Also known as 'Let's bilk the superstitious and the ignorant out of their money.\n\n \n That sounds more like Jessee Jackson and Al Sharpton - two democrat shake-down artists and Obama Kool Aid drinkers.\n \n By the way, I've never heard the name Jesus Christ come out of either one of those men's lips.", 
   {}, 
   399243, 
   null, 
   1272113280.0
  ], 
  [
   399288, 
   null, 
   "trebor", 
   "That sounds more like Jessee Jackson and Al Sharpton - two democrat shake-down artists and Obama Kool Aid drinkers.\n \n By the way, I've never heard the name Jesus Christ come out of either one of those men's lips.\n\n \n That is because you don't listen. But, hey, what do you know. You are too busy being a racist (I noticed you named two people who are black to vent against), and hateful.", 
   {}, 
   399266, 
   null, 
   1272126000.0
  ], 
  [
   399298, 
   null, 
   "simone", 
   "The only alternative is hell. You don't really want any part of that, do you? Five minutes down there and you'll want all the heaven you can get. emoticon_smile\n\n Good God! Does that mean I'd have to spend eternity in Hell with you??\n \n That would be hell!", 
   {}, 
   398871, 
   null, 
   1272132180.0
  ], 
  [
   399335, 
   null, 
   "Easyrider", 
   "That is because you don't listen. But, hey, what do you know. You are too busy being a racist (I noticed you named two people who are black to vent against), and hateful.\n\n \n I'd get real upset with your lying swill, trebor, but then you'd probably hit me with your purse, wouldn't you?", 
   {}, 
   399288, 
   null, 
   1272154500.0
  ], 
  [
   399338, 
   null, 
   "trebor", 
   "I'd get real upset with your lying swill, trebor, but then you'd probably hit me with your purse, wouldn't you?\n\n \n Oh wow, I would be so hurt if you had any credibility what so ever.. \n \n I personally want you to keep on acting exactly how you are. Being such an 'Anti-Christian', I want everyone to look at you as an example of how a Christian person is kind, compassionate, intelligent and reasonable.", 
   {}, 
   399335, 
   null, 
   1272155040.0
  ], 
  [
   399356, 
   null, 
   "jazyjason", 
   "I'd get real upset with your lying swill, trebor, but then you'd probably hit me with your purse, wouldn't you?\n\n \n See? There is that wonderful example of \"Christian\" love ladies and gentlemen....\n \n I hope that God throws the book at your XXX....", 
   {}, 
   399335, 
   null, 
   1272186000.0
  ], 
  [
   399373, 
   null, 
   "Easyrider", 
   "See? There is that wonderful example of \"Christian\" love ladies and gentlemen....\n \n I hope that God throws the book at your XXX....\n\n \n I thought people like you approved of cross dressing, transvestites, and different kinds of perversion?", 
   {}, 
   399356, 
   null, 
   1272204300.0
  ], 
  [
   399376, 
   null, 
   "Archangel", 
   "I'd get real upset with your lying swill, trebor, but then you'd probably hit me with your purse, wouldn't you?\n\n \n \nSee? There is that wonderful example of \"Christian\" love ladies and gentlemen....\n \n I hope that God throws the book at your XXX....\n\n \n Speaking of christian love, is this your idea of it as the believer you claim to be? Why is it that you condemn the truthful opinion Easy offers while not living up to the standards you claim to honor with your life? Don't you know that's evidence of hypocrisy on your part? emoticon_rolleyes", 
   {}, 
   399356, 
   null, 
   1272204900.0
  ], 
  [
   399390, 
   null, 
   "unkerpaulie", 
   "Man I wish I jumped in earlier. Anyway, I think a pretty good description of what heaven is has been covered already here. The only thing I would amend is an upgrade to the dresscode. When the bible was written, white robes were the ultimate in top-of-the-line formal wear. I think if the writers were alive today they'd dress their heavenly residents in tuxedos and designer cocktail dresses rather than outdated white robes. But suits weren't invented yet.", 
   {}, 
   399376, 
   null, 
   1272209520.0
  ], 
  [
   399394, 
   null, 
   "trebor", 
   "Man I wish I jumped in earlier. Anyway, I think a pretty good description of what heaven is has been covered already here. The only thing I would amend is an upgrade to the dresscode. When the bible was written, white robes were the ultimate in top-of-the-line formal wear. I think if the writers were alive today they'd dress their heavenly residents in tuxedos and designer cocktail dresses rather than outdated white robes. But suits weren't invented yet.\n\n \n Nah. You see, since Heaven is one giant cube according to the bible description, there will just be rows and rows of little tiny alcoves, and people will wear black, with an eye implant. Black, but not a tux, but something more space looking.", 
   {}, 
   399390, 
   null, 
   1272214080.0
  ], 
  [
   399398, 
   null, 
   "unkerpaulie", 
   "The description written by RevLon was not in the least inspiring...as I said, I already have that here.\n I have no desire to read about other whackos imagined trips to Heaven.\n First of all, if they were REALLY dead, which is a condition of getting into heaven, they would not have come back - to do so would trivialize the death and resurrection of Jesus...\n\n As far as I know, the accounts of heaven are not from people who died and ressurected, but from people who weren't actually dead, but very close to dying. And for somebody to actually die and resurrect, I don't see why you'd say it would trivialize Jesus' own resurrection. Jesus himself resurrected other people during his walk on earth, its not like its exclusive just for him. \n \n \nI wish you would quit referring to delusional visions of the derranged and really think about what an eternity in 'Heaven' would be like.\n If you were honest with me and yourself, you would admit that the reality of it would be much like hell...\n \n Seriously. In this life, we have an infinite number of choices to make. We can choose who we want to be and who we want to be with. Where we want to be and where we want to go. Some people would like to do nothing but sit on a river bank and fish for all their life, others would be bored out of their minds doing the same thing day in and day out.\n \n If Heaven is a 'perfect' place, what is it that makes it so?\n RevLon mentioned a road and buildings - who built them and who maintains them? Are there never any more than what there is? Who cleans them? If there is no dust, there is no dirt. No dirt, no trees.\n He mentioned trees and flowers. Who cultivates them and who cleans up the debris?\n Is there only life and no death?\n Do the trees grow continually? Or, are they just there - no death and no growth...Is that what it would be like for the people - no death, no growth, just always being the same...for all eternity???\n RevLon said there were no shadows. No shadows, no sun. No sun no seasons. No seasons, plants don't grow.\n Do the plants just keep growing? If there is no death, then there would be no deciduous trees to shed dead leaves, no dead limbs to pick up.\n\n Its also interesting that trees and plants get to go to heaven, but animals don't because animals don't have souls. Maybe the heavenly trees are so perfect that they never have dead leaves or branches, don't grow or change, and just look like living trees in time-stasis. Then again, so wouls everybody else. I suppose all human inhabitants would normalize in age to their adult primes, perfect specimens of physical health, yet still recognizable by those who only knew them in their old age. The problem would be what about kids and babies that died and went to heaven, would they still be babies? Would they be able to walk around and feed themselves? \n \nIs it just 'no death' for humans?\n If so, someone will have to get busy keeping The Garden tidy...and that would require a boss and laborers...which would create a system much as we have right here. Is god the one and only Boss and all the rest of us are the slaves? Some slaves will be assigned the XXXX jobs and others will get the cushy jobs. That will cause mutiny at some point, I would imagine.\n \n No sadness and death (for humans only)? I would be sad if a tree I had been cultivating for 2,000 years died.\n\n No death. Period. Any form of work would be completely optional. \n \n \n...and who is making all of the white robes emoticon_confused Are there sewing machines or does god just make them appear out of nothing?\n\n Why stop at robes? White robes were the standard formal dresscode of the time. Why not designer jeans and cashmere sweaters? Italian suits? Deerhide sports jackets?\n \nOr, is it all just an illusion to begin with, where nothing is real but only imagined?\n \n The only way the Christian concept of Heaven would work is if all the people were mindless droids, lacking any hint of free will, emotion, and all the wonderful qualities that make us human.\n I wouldn't want any part of it.emoticon_rolleyes\n \n Besides, even if these accounts are true (which they are not), there is a huge difference (eternally) between a 60 minute trip to heaven and that of being there forever and forever and ...\n \n Get my drift? emoticon_rolleyes\n\n Wouldn't being a mindless droid be a prerequisite for even desiring to go to heaven? Or even moreso, people who believe that heaven even exist would have to be under some kind of mental short circuit. Christianity itself requires that you turn off part of your reasoning to accept nearly everything the bible. We all know that the answer to anything that challenges scripture against reality is \"goddidit youcantunderstandthethingsofgod\". The real true believers, the ones that can unquestionably believe what the bible says, the ones that would actually make it into heaven, are obviously of a similar mindset as archie and easyrider. They would probably have the capacity to enjoy such an existence.", 
   {}, 
   399208, 
   null, 
   1272218520.0
  ], 
  [
   399413, 
   null, 
   "pappillion001", 
   "What about bathrooms? Are they needed? Who cleans them if so? I have heard stories about rain, but then what would snow and hail be? emoticon_confused", 
   {}, 
   399398, 
   null, 
   1272222180.0
  ], 
  [
   399415, 
   null, 
   "Easyrider", 
   "There are/will be animals in heaven. Jesus returns on a white horse, n'est pas?\n \n From Revelation 19:\n \n 11 I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True. With justice he judges and makes war. 12 His eyes are like blazing fire, and on his head are many crowns. He has a name written on him that no one knows but he himself. 13 He is dressed in a robe dipped in blood, and his name is the Word of God. 14 The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean. 15 Out of his mouth comes a sharp sword with which to strike down the nations. \"He will rule them with an iron scepter.\" He treads the winepress of the fury of the wrath of God Almighty. 16On his robe and on his thigh he has this name written:\n KING OF KINGS AND LORD OF LORDS.", 
   {}, 
   399398, 
   null, 
   1272222240.0
  ], 
  [
   399453, 
   null, 
   "pappillion001", 
   "There are/will be animals in heaven. Jesus returns on a white horse, n'est pas?\n \n From Revelation 19:\n \n 11 I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True. With justice he judges and makes war. 12 His eyes are like blazing fire, and on his head are many crowns. He has a name written on him that no one knows but he himself. 13 He is dressed in a robe dipped in blood, and his name is the Word of God. 14 The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean. 15 Out of his mouth comes a sharp sword with which to strike down the nations. \"He will rule them with an iron scepter.\" He treads the winepress of the fury of the wrath of God Almighty. 16On his robe and on his thigh he has this name written:\n KING OF KINGS AND LORD OF LORDS.\n\n \n That doesn't seem like the Heaven described in the brochure and nothing like the commercial. Where is the love and peace? \n \n Usually when someone has that many names you really have to wonder why. \n \n This makes it seem like his mom wrote his name on his underwear before sending him off to camp and what is up with the fire eyes and bloody robe? Is the name on the thigh a tattoo?", 
   {}, 
   399415, 
   null, 
   1272255180.0
  ], 
  [
   399454, 
   null, 
   "pappillion001", 
   "There are/will be animals in heaven. Jesus returns on a white horse, n'est pas?\n \n From Revelation 19:\n \n 11 I saw heaven standing open and there before me was a white horse, whose rider is called Faithful and True. With justice he judges and makes war. 12 His eyes are like blazing fire, and on his head are many crowns. He has a name written on him that no one knows but he himself. 13 He is dressed in a robe dipped in blood, and his name is the Word of God. 14 The armies of heaven were following him, riding on white horses and dressed in fine linen, white and clean. 15 Out of his mouth comes a sharp sword with which to strike down the nations. \"He will rule them with an iron scepter.\" He treads the winepress of the fury of the wrath of God Almighty. 16On his robe and on his thigh he has this name written:\n KING OF KINGS AND LORD OF LORDS.\n\n \n So animals get a resurrected body also? Does their flesh cause them to sin? Do they have souls?", 
   {}, 
   399415, 
   null, 
   1272255900.0
  ], 
  [
   399472, 
   null, 
   "Sandycane", 
   "Sandy,\n \n Tsk tsk...\n \n Who said you had to be dead to have a vision or visions of heaven? Is that from your secular handbook on religion?  Because it's sure not Biblical.\n \n If you'd like to see into the spiritual world, along with another description of heaven, here you go. This has been on TV recently. And there's more from prior weeks you can click on, including visions of Jesus, healings, etc.\n \n Sid Roth - It's Supernatural Messianic Vision: John Fenn - Five Spiritual Senses\n \n It's Supernatural is on TV each week. I can see it on Daystar at 9:30 PM CST on Thursdays, and it was on today (Friday) at 6:30 PM CST on PTL network.\n\n \n Okay. Against my better judgment, I watched the video. \n Similar description of Heaven to the one by RevLon...except this guy saw his dead animals and heard music from the vegetation.\n \n All of my previous questions still apply...with an additional one: Do all animals go to heaven or only those owned by Christians? \n Will you please make an effort to answer them?", 
   {}, 
   399232, 
   null, 
   1272302100.0
  ], 
  [
   399513, 
   null, 
   "Easyrider", 
   "Okay. Against my better judgment, I watched the video. \n Similar description of Heaven to the one by RevLon...except this guy saw his dead animals and heard music from the vegetation.\n\n \n They were live animals. emoticon_rolleyes\n \n \nAll of my previous questions still apply...with an additional one: Do all animals go to heaven or only those owned by Christians? \n Will you please make an effort to answer them?\n\n \n If it's not in the Bible or from someone who has been there in the spirit, then I don't know the answer. Sorry. But I'm quite sure heaven is 10 gazillion times better than hell.", 
   {}, 
   399472, 
   null, 
   1272323220.0
  ], 
  [
   399581, 
   null, 
   "Sandycane", 
   "They were live animals. emoticon_rolleyes\n\n You didn't answer the question: Do all animals go to heaven or only those owned by Christians?\n \n \n \n \nIf it's not in the Bible or from someone who has been there in the spirit, then I don't know the answer. Sorry. But I'm quite sure heaven is 10 gazillion times better than hell.\n\n \n WHY are you sure heaven is better than hell?\n How can you know that either even exist at all?\n \n Can you admit that maybe the concept of heaven is something that only exists in the human mind?emoticon_rolleyes", 
   {}, 
   399513, 
   null, 
   1272384600.0
  ], 
  [
   399631, 
   null, 
   "Easyrider", 
   "You didn't answer the question: Do all animals go to heaven or only those owned by Christians?\n\n \n I still don't know. I think there's some Jewish animals up there.\n \n \n\n WHY are you sure heaven is better than hell?\n How can you know that either even exist at all?\n \n Can you admit that maybe the concept of heaven is something that only exists in the human mind?emoticon_rolleyes\n\n \n I believe what the Bible says about all that. Jesus talked about both. Heaven sounds a lot better than hell from what the scriptures portray.\n \n I'm done with this. Cheers...", 
   {}, 
   399581, 
   null, 
   1272408420.0
  ], 
  [
   399670, 
   null, 
   "jazyjason", 
   "I thought people like you approved of cross dressing, transvestites, and different kinds of perversion?\n\n \n At least I look good in pumps and a wig....emoticon_rolleyes", 
   {}, 
   399373, 
   null, 
   1272425700.0
  ], 
  [
   399671, 
   null, 
   "jazyjason", 
   "Speaking of christian love, is this your idea of it as the believer you claim to be? \n\n \n Sorry I'm not sticking a Jesus sticker my XXX and claiming to be full of \"love\" while crucifying people....\n \n \n \n \nWhy is it that you condemn the truthful opinion Easy offers while not living up to the standards you claim to honor with your life?\n\n \n Standards? Archie if you base the standards of salvation and ethical living on Easy's examples I should go shoot up an abortion clinic and tell them God says it's justified....\n \n \n \n \n Don't you know that's evidence of hypocrisy on your part? emoticon_rolleyes \n\n \n Please... The only hypocrisy shown here is your utter disregard for the love Christ teaches in scripture. You have taken hope and love and twisted it into a weapon of malice and utter venom in which to crucify those who don't align to your own utter warped views on religion....", 
   {}, 
   399376, 
   null, 
   1272426000.0
  ], 
  [
   399709, 
   null, 
   "Sandycane", 
   "I still don't know. I think there's some Jewish animals up there.\n \n \n \n I believe what the Bible says about all that. Jesus talked about both. Heaven sounds a lot better than hell from what the scriptures portray.\n \n I'm done with this. Cheers...\n\n \n So, once again, we have established that fear is the motivating factor behind believing in the bible - this time, believing in Heaven because you have a fear of Hell...and you have yet to prove that either even exist.\n \n It's odd to me that you and the other Christians on the board will obnoxiously shout your beliefs, defend them and attempt to cram them down the throats of others and yet, when it comes to answering a few rational, legitimate questions about exactly what Heaven is, where it is and what goes on there, you clam up and tuck tail and run.\n \n I suppose it's easier for some to believe the fantasy than to actually confront the truth. :xbanghead\n \n Cheers to you. emoticon_xhoho", 
   {}, 
   399631, 
   null, 
   1272469500.0
  ], 
  [
   399710, 
   null, 
   "trebor", 
   "So, once again, we have established that fear is the motivating factor behind believing in the bible - this time, believing in Heaven because you have a fear of Hell...and you have yet to prove that either even exist.\n \n It's odd to me that you and the other Christians on the board will obnoxiously shout your beliefs, defend them and attempt to cram them down the throats of others and yet, when it comes to answering a few rational, legitimate questions about exactly what Heaven is, where it is and what goes on there, you clam up and tuck tail and run.\n \n I suppose it's easier for some to believe the fantasy than to actually confront the truth. :xbanghead\n \n Cheers to you. emoticon_xhoho\n\n \n \n Oh god, now you are going to get that 'Christ Denier' epitaph thrown at you, or some annoying platitude from an out of context bible quote.", 
   {}, 
   399709, 
   null, 
   1272471540.0
  ], 
  [
   399732, 
   null, 
   "Easyrider", 
   "So, once again, we have established that fear is the motivating factor behind believing in the bible - this time, believing in Heaven because you have a fear of Hell...and you have yet to prove that either even exist.\n\n \n Believe whatever you want, Sandy. \n \n \nIt's odd to me that you and the other Christians on the board will obnoxiously shout your beliefs, defend them and attempt to cram them down the throats of others and yet, when it comes to answering a few rational, legitimate questions about exactly what Heaven is, where it is and what goes on there, you clam up and tuck tail and run.\n\n \n Naah. We gave you a fair number of decent responses, plus video references. But nothing's enough for you. \n \n Why don't you go to church and start asking some pastors? That is, if you're really interested in additional information. I suspect many will take a telephone call and try to help you out. But one thing I want to reiterate is that the Bible says of heaven that there are \n \n NO MORE TEARS AND NO MORE SORROWS. \n \n Saavy??\n \n If you're still banging your head after that it deserves to be banged. emoticon_xangel", 
   {}, 
   399709, 
   null, 
   1272494340.0
  ], 
  [
   399735, 
   null, 
   "Archangel", 
   "Sorry I'm not sticking a Jesus sticker my XXX and claiming to be full of \"love\" while crucifying people....\n\n \n Where does this insane statement come from? Here's the post this drivel is based on. http://www.4forums.com/political/399376-post89.html\n \n \nStandards? Archie if you base the standards of salvation and ethical living on Easy's examples I should go shoot up an abortion clinic and tell them God says it's justified....\n\n \n Really? Once again you prove the irrational and unstable reasoning of a true reprobate as you equate Easy's attempts to correct your unnatural proclivities to shooting up an abortion clinic. You're an embarrassment to common sense thinking.\n \n \nPlease... The only hypocrisy shown here is your utter disregard for the love Christ teaches in scripture. You have taken hope and love and twisted it into a weapon of malice and utter venom in which to crucify those who don't align to your own utter warped views on religion....\n\n \n I mourn for your sickness and your refusal to accept correction as if it's meant to hurt you rather than help you. You are so sold out to hatred and the need to satisfy only your fleshly desires that you perceive anyone who rejects your homosexuality as enemies, haters and homophobes when it is you we are concerned for rather than enabling your unnatural lifestyle. And yes jason, your complete world view is based on hypocrisy and double standards as you expect to live by different standards than you hold us to.", 
   {}, 
   399671, 
   null, 
   1272495960.0
  ], 
  [
   399742, 
   null, 
   "Easyrider", 
   "Originally Posted by Sandycane: It's odd to me that you and the other Christians on the board will obnoxiously shout your beliefs, defend them and attempt to cram them down the throats of others ....\n \n What is this \"cram them down the throats of others\" swill? You don't have to come around here. You don't have to read our posts. That's just more hysterical drivel from the radical left who voted for the abortionist-and-liar-in-chief, Obama.\n \n Now go repent, woman, before you wind up in the Pit. \n \n emoticon_xbouncer", 
   {}, 
   399732, 
   null, 
   1272498420.0
  ], 
  [
   399795, 
   null, 
   "Sandycane", 
   "Believe whatever you want, Sandy. \n \n \n \n Naah. We gave you a fair number of decent responses, plus video references. But nothing's enough for you. \n \n Why don't you go to church and start asking some pastors? That is, if you're really interested in additional information. I suspect many will take a telephone call and try to help you out. But one thing I want to reiterate is that the Bible says of heaven that there are \n \n NO MORE TEARS AND NO MORE SORROWS. \n \n Saavy??\n \n If you're still banging your head after that it deserves to be banged. emoticon_xangel\n\n \n So....in other words, when you go to Heaven your emotions will be neutered?\n \n Why are you passing the buck to some local pastor...do they know something you don't know? I doubt it! \n \n I think I proved my point: \n NO ONE KNOWS FOR SURE HEAVEN EVEN EXISTS AND THOSE WHO CLAIM IT DOES, KNOW NEXT TO NOTHING ABOUT THE DETAILS OF BEING THERE.\n \n I always read the fine print before signing up for something - you should try it.  emoticon_rolleyes", 
   {}, 
   399732, 
   null, 
   1272561840.0
  ], 
  [
   399796, 
   null, 
   "Sandycane", 
   "Originally Posted by Sandycane: It's odd to me that you and the other Christians on the board will obnoxiously shout your beliefs, defend them and attempt to cram them down the throats of others ....\n \n What is this \"cram them down the throats of others\" swill? You don't have to come around here. You don't have to read our posts. That's just more hysterical drivel from the radical left who voted for the abortionist-and-liar-in-chief, Obama.\n \n Now go repent, woman, before you wind up in the Pit. \n \n emoticon_xbouncer\n\n \n 'Now go repent, woman, before you wind up in the Pit.' \n \n This falls into the category of 'cram them down the throats of others' and with over 16,000 posts from both you and Archangel, I'd say 90% of them include this type of cramming. \n \n I come here because I like you and I am concerned for your eternal future.\n Repent before it is too late! emoticon_cry", 
   {}, 
   399742, 
   null, 
   1272562200.0
  ], 
  [
   399848, 
   null, 
   "Easyrider", 
   "You're the one who voted for the Liar-and-Socialist-in-Chief, Obama, so you repent.", 
   {}, 
   399796, 
   null, 
   1272581880.0
  ], 
  [
   399933, 
   null, 
   "Sandycane", 
   "...\n I'm done with this. Cheers...\n\n \n You said you were done with this...whahappened? emoticon_rolleyes\n \nYou're the one who voted for the Liar-and-Socialist-in-Chief, Obama, so you repent.\n\n \n Oh boy. Here we go.\n I've noticed that you and someone else, when you haven't got an answer, fall back on your default mode of hurling insults and hijacking the thread into a political debate.\n You did it with the Easter Bunny thread and now you're trying to do it here.\n \n Sorry, I'm not letting you off the hook this time.\n \n Answer the fookin questions I asked about where heaven is, who and what is there and what you will be doing there for all of eternity.\n \n I'll bet you a $bill, that if you seriously give this some thought, you'll realize that your accepted vision of heaven is thoroughly, seriously flawed.:xbanghead", 
   {}, 
   399631, 
   null, 
   1272639240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Heaven", 
  "url": "http://www.4forums.com/political/religion-debates/14144-heaven.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14144, 
  "discussion_files": [
   [
    "12369.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-print.html"
   ], 
   [
    "12370.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-8-print.html"
   ], 
   [
    "12371.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-6-print.html"
   ], 
   [
    "12372.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-4-print.html"
   ], 
   [
    "12373.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-5-print.html"
   ], 
   [
    "12374.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-7-print.html"
   ], 
   [
    "12375.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-3-print.html"
   ], 
   [
    "12376.html", 
    "http://www.4forums.com/political/religion-debates/14144-heaven-2-print.html"
   ]
  ], 
  "identifier": 14144
 }
]