[
 [
  [
   398923, 
   null, 
   "Jo Bennett", 
   "Da'rryl Durr on the death penalty | World news | The Guardian\n \n Even if you think the death penalty can be justified in principle (I disagree but that's another discussion, can we keep away from it please), surely it cannot be justified in practice as it appears to have occurred in this case. Can it ever be right to convict someone on the basis of a single eyewitness and condemn them to death? Surely when the case hinges on the testimony of one witness there must always be a failsafe to allow for the insincerity of that witness? Am I missing something in this case?", 
   {
    "post_info": {
     "post_title": "Was Da'rryl Durr guilty? [death penalty]"
    }
   }, 
   null, 
   null, 
   1271869920.0
  ], 
  [
   398926, 
   null, 
   "Steeeeve", 
   "I don't think there is any doubt he did it. \n \n The two rapes were clear cut and other small time evidence was brought up. I'm not a huge fan of the death penalty but it doesn't seem totally out of line compared to other cases where someone received the death penalty.", 
   {}, 
   398923, 
   null, 
   1271871660.0
  ], 
  [
   398927, 
   null, 
   "Jo Bennett", 
   "I don't think there is any doubt he did it. \n \n The two rapes were clear cut and other small time evidence was brought up. I'm not a huge fan of the death penalty but it doesn't seem totally out of line compared to other cases where someone received the death penalty.\n\n \n Guilty of the rapes I'm not disputing (don't know anything about those cases), but why does that automatically make him guilty of the rape and murder for which he was executed?", 
   {}, 
   398926, 
   null, 
   1271873040.0
  ], 
  [
   398929, 
   null, 
   "NATO 556", 
   "Guilty of the rapes I'm not disputing (don't know anything about those cases), but why does that automatically make him guilty of the rape and murder for which he was executed?\n\n \n Because he was found guilty of murdering a minor rather than an adult. Any crime committed by an adult against a child is more heinous in nature.", 
   {}, 
   398927, 
   null, 
   1271874240.0
  ], 
  [
   398930, 
   null, 
   "Jo Bennett", 
   "Because he was found guilty of murdering a minor rather than an adult. Any crime committed by an adult against a child is more heinous in nature.\n\n \n Way to miss the point.:xbanghead", 
   {}, 
   398929, 
   null, 
   1271874660.0
  ], 
  [
   398931, 
   null, 
   "NATO 556", 
   "Way to miss the point.:xbanghead\n\n \n I'm not missing the point, but you are. You talked about fail safes being present when there's only one credible eyewitness to give testimony. Often times there's only going to be one victimized party who can actually give testimony, but that doesn't mean that their suffering should receive any less consideration than that of an entire group.", 
   {}, 
   398930, 
   null, 
   1271875620.0
  ], 
  [
   398932, 
   null, 
   "Jo Bennett", 
   "I'm not missing the point, but you are. You talked about fail safes being present when there's only one credible eyewitness to give testimony. Often times there's only going to be one victimized party who can actually give testimony, but that doesn't mean that their suffering should receive any less consideration than that of an entire group.\n\n \n But how can you reliably convict when the only testimony available is a single eyewitness?", 
   {}, 
   398931, 
   null, 
   1271877240.0
  ], 
  [
   398933, 
   null, 
   "NATO 556", 
   "But how can you reliably convict when the only testimony available is a single eyewitness?\n\n \n How can you suggest that a single eyewitness isn't sufficient to warrant an actual conviction? We'd still put a rapist away if there was only one victim who could actually testify.\n \n It's very dangerous precedent to suggest that in cases where there's only one witness/victim that a conviction isn't fair, just, or whatever choice of wording one might use.", 
   {}, 
   398932, 
   null, 
   1271879100.0
  ], 
  [
   398935, 
   null, 
   "Penfold", 
   "Eyewitness testimony is notoriously unreliable. At best, it is what the witness believes to have happened, but that is not necessarily what actually happened. Without corroborating evidence conviction is unsafe, and execution is unthinkable in a civilised legal system", 
   {}, 
   398933, 
   null, 
   1271880780.0
  ], 
  [
   398939, 
   null, 
   "Steeeeve", 
   "Guilty of the rapes I'm not disputing (don't know anything about those cases), but why does that automatically make him guilty of the rape and murder for which he was executed?\n\n \n No, but I read some of the evidence and it looked pretty solid. If this person was sentenced to life in prison without parole would you question the verdict?", 
   {}, 
   398927, 
   null, 
   1271882700.0
  ], 
  [
   398969, 
   null, 
   "zsu2357", 
   "Guilty of the rapes I'm not disputing (don't know anything about those cases), but why does that automatically make him guilty of the rape and murder for which he was executed?\n\n \n If your not disputing he is guilty of rape(any rape)then justice is served.", 
   {}, 
   398927, 
   null, 
   1271896860.0
  ], 
  [
   398972, 
   null, 
   "zsu2357", 
   "Eyewitness testimony is notoriously unreliable. At best, it is what the witness believes to have happened, but that is not necessarily what actually happened. Without corroborating evidence conviction is unsafe, and execution is unthinkable in a civilised legal system\n\n \n Comrade P.:what if your wife or kid were murdered?only one eyewitness,ah still\n notoriously unreliable.\n Are you still gonna wait for the perfect corroborating evidenceto be sure execution is safe?", 
   {}, 
   398935, 
   null, 
   1271897640.0
  ], 
  [
   398973, 
   null, 
   "Penfold", 
   "If your not disputing he is guilty of rape(any rape)then justice is served.\n\n \n Rape does not carry the death penalty. Vengeance was served, not justice.", 
   {}, 
   398969, 
   null, 
   1271897760.0
  ], 
  [
   398980, 
   null, 
   "NATO 556", 
   "Rape does not carry the death penalty. Vengeance was served, not justice.\n\n \n There was also a murder involved, don't forget that.\n \n And forget about this nonsense about how a conviction with only one eyewitness/victim is unacceptable. There's going to be heinous crimes where there's only one victim who'll step forward and give testimony. \n \n Are we to just adopt the position that if only one person steps forward and claims to be raped, they should be told that their testimony isn't enough to warrant locking up the person that victimized them?", 
   {}, 
   398973, 
   null, 
   1271900100.0
  ], 
  [
   398983, 
   null, 
   "zsu2357", 
   "Rape does not carry the death penalty. Vengeance was served, not justice.\n\n Perhaps not,perhaps it should, if it can be shown there is no prior knowledge the two people have ever met.", 
   {}, 
   398973, 
   null, 
   1271900580.0
  ], 
  [
   398985, 
   null, 
   "zsu2357", 
   "There was also a murder involved, don't forget that.\n \n And forget about this nonsense about how a conviction with only one eyewitness/victim is unacceptable. There's going to be heinous crimes where there's only one victim who'll step forward and give testimony. \n \n Are we to just adopt the position that if only one person steps forward and claims to be raped, they should be told that their testimony isn't enough to warrant locking up the person that victimized them?\n\n \n Remember NATO, our little Comrade lives across the big water in the land of\n Utopia(never never land?)where they aren't learned on stuff like that because they are crime free.emoticon_rolleyes", 
   {}, 
   398980, 
   null, 
   1271901240.0
  ], 
  [
   398986, 
   null, 
   "Penfold", 
   "Perhaps not,perhaps it should, if it can be shown there is no prior knowledge the two people have ever met.\n\n \n There is no perhaps. Rape does not carry the death penalty in the US, so your inane aside to Jo was as meaningless as your slur toward me.", 
   {}, 
   398983, 
   null, 
   1271901600.0
  ], 
  [
   398988, 
   null, 
   "Penfold", 
   "There was also a murder involved, don't forget that.\n \n And forget about this nonsense about how a conviction with only one eyewitness/victim is unacceptable. There's going to be heinous crimes where there's only one victim who'll step forward and give testimony. \n \n Are we to just adopt the position that if only one person steps forward and claims to be raped, they should be told that their testimony isn't enough to warrant locking up the person that victimized them?\n\n \n Eyewitness accounts are at best, that witness's memory of what they believe happened, at worst a false allegation. Without corroboration, a conviction is not \"beyond reasonable doubt\" Luckily for the legal process, your cretinous opinion is irrelevant. To kill someone on the unsupported word of another is not justice. Your false dichotomy notwithstanding. (Cue goalpost shift, with optional stupid hypothetical.)", 
   {}, 
   398980, 
   null, 
   1271902020.0
  ], 
  [
   398991, 
   null, 
   "zsu2357", 
   "There is no perhaps. Rape does not carry the death penalty in the US, so your inane aside to Jo was as meaningless as your slur toward me.\n\n \n Why are you so afraid of the death penalty for rape?and yes there is a perhaps\n since there was a murder involved and as far as any inane aside to Jo;none meant.\n As far as a slur on your behalf?well I guess thats another perhaps since you bring it up.emoticon_rolleyes\n \n P.S.:instead of slurring NATO,did you read what he said?or what you wanted to think he said?", 
   {}, 
   398986, 
   null, 
   1271903040.0
  ], 
  [
   398995, 
   null, 
   "NATO 556", 
   "Eyewitness accounts are at best, that witness's memory of what they believe happened, at worst a false allegation.\n\n \n I fail to see the point. Are you arguing that the system we have in place simply isn't any good for administering justice?\n \n \nWithout corroboration, a conviction is not \"beyond reasonable doubt\" Luckily for the legal process, your cretinous opinion is irrelevant. To kill someone on the unsupported word of another is not justice. Your false dichotomy notwithstanding. (Cue goalpost shift, with optional stupid hypothetical.)\n\n \n Last I checked he was convicted by jury verdict. In other words 12 different people from different walks of life found the single witness testimony to be strong enough to warrant a conviction.\n \n Meanwhile your ilk wants a person's constitutional rights revoked based on hearsay without proof. You're a case of the pot calling the kettle black.", 
   {}, 
   398988, 
   null, 
   1271903580.0
  ], 
  [
   399001, 
   null, 
   "zsu2357", 
   "[QUOTE=Penfold;398988]\nEyewitness accounts are at best, that witness's memory of what they believe happened, at worst a false allegation.\n \n So what your saying is, an eyewitness account is good as worthless\n \nRape does not carry the death penalty. Vengeance was served, not justice.\n\n Ask the family the difference,perhapsas time goes by they may see a difference,for now I doubt it.Me personally I would be in it for vengeance. \n \nWithout corroboration, a conviction is not \"beyond reasonable doubt\" Luckily for the legal process, your cretinous opinion is irrelevant. To kill someone on the unsupported word of another is not justice. Your false dichotomy notwithstanding. (Cue goalpost shift, with optional stupid hypothetical.)\n\n His false dichotomy was divided 12 ways, found guilty, thats how we do justice.", 
   {}, 
   398988, 
   null, 
   1271905320.0
  ], 
  [
   399025, 
   null, 
   "Jo Bennett", 
   "Even for rape, eyewitness testimony from the victim isn't enough to convict in this country, I doubt it is in the US, at least in most cases. In cases where it is the word of one person against another, at the very least you need corroborating physical or psychological evidence of the attack. There's a reason conviction rates for rape are so low.\n \n People seem to be trying to evade the issue, there's one person, who says Durr raped and murdered Angel Vincent and no other evidence. How can that be proof beyond reasonable doubt? Surely it behoves on us, knowing the fallibility of the jury system (particularly, let's face it, when all white juries in certain areas try black suspects), to make punishments reversible?", 
   {}, 
   399001, 
   null, 
   1271917380.0
  ], 
  [
   399038, 
   null, 
   "NATO 556", 
   "Even for rape, eyewitness testimony from the victim isn't enough to convict in this country, I doubt it is in the US, at least in most cases. In cases where it is the word of one person against another, at the very least you need corroborating physical or psychological evidence of the attack. There's a reason conviction rates for rape are so low.\n\n \n Funny. As it is now a woman can have her husband charged with domestic violence, even if there's no proof to support it, even if there's no police report, eyewitnesses to corroborate her story, etc. And in most of these cases the husband is found guilty of domestic assault despite any incriminating evidence.\n \n \nPeople seem to be trying to evade the issue, there's one person, who says Durr raped and murdered Angel Vincent and no other evidence. How can that be proof beyond reasonable doubt?\n\n \n How could so many people believe Obama was the right pick for president when his message was so weak and flimsy? He ran on a platform of hope, change and \"yes we can!\" without ever explaining any of the hard questions that were presented. He won on flash, not substance. He pulled a rabbit out of his hat and everybody fell for it.\n \n \nSurely it behoves on us, knowing the fallibility of the jury system (particularly, let's face it, when all white juries in certain areas try black suspects), to make punishments reversible?\n\n \n I don't think so. His appeals were obviously turned down, meaning several other courts felt the evidence was strong enough to justify the death penalty. That's not easy to accomplish.\n \n Was he wrongfully convicted? Possibly. Is that grounds for undoing the system that's been in place for 230+ years? I don't think so. Is it reason to do away with the death penalty? Absolutely not.", 
   {}, 
   399025, 
   null, 
   1271919360.0
  ], 
  [
   399040, 
   null, 
   "Jo Bennett", 
   "Funny. As it is now a woman can have her husband charged with domestic violence, even if there's no proof to support it, even if there's no police report, eyewitnesses to corroborate her story, etc. And in most of these cases the husband is found guilty of domestic assault despite any incriminating evidence.\n\n \n Evidence for this claim? In any case you don't execute people for domestic violence.\n \n \n How could so many people believe Obama was the right pick for president when his message was so weak and flimsy? He ran on a platform of hope, change and \"yes we can!\" without ever explaining any of the hard questions that were presented. He won on flash, not substance. He pulled a rabbit out of his hat and everybody fell for it. \n\n \n Elections aren't supposed to be proof beyond reasonable doubt that the person on suited to the job, just the opinion of the electors. Non seqitur.\n \n \n\n I don't think so. His appeals were obviously turned down, meaning several other courts felt the evidence was strong enough to justify the death penalty. That's not easy to accomplish.\n \n Was he wrongfully convicted? Possibly. Is that grounds for undoing the system that's been in place for 230+ years? I don't think so. Is it reason to do away with the death penalty? Absolutely not.\n\n \n So you admit he may have been wrongly convicted yet you still have no qualms about him being killed? How would life in prison as opposed to execution make such a difference to your judicial system that you're not prepared to contemplate it even when you admit that there is doubt in some of the convictions?", 
   {}, 
   399038, 
   null, 
   1271919900.0
  ], 
  [
   399043, 
   null, 
   "NATO 556", 
   "Evidence for this claim? In any case you don't execute people for domestic violence.\n\n \n Hearsay Evidence in Domestic Violence Cases\n \n Dads of Michigan\n \n \nSo you admit he may have been wrongly convicted yet you still have no qualms about him being killed?\n\n \n Yes.\n \n \nHow would life in prison as opposed to execution make such a difference to your judicial system that you're not prepared to contemplate it even when you admit that there is doubt in some of the convictions?\n\n \n Every person we have serving a life conviction, when they would qualify for the death sentence, is one more person taking up room in a prison that could be used to house another inmate instead of letting them remain free on probation, or house arrest. We simply don't have the resources necessary to continue indefinitely housing those guilty of the most heinous crimes recognized by our judicial system.\n \n It was a trial by jury that lead to the hanging of Saddam Hussein. Are you going to try and apply your \"execution is unacceptable\" standard to a case like that?", 
   {}, 
   399040, 
   null, 
   1271920620.0
  ], 
  [
   399073, 
   null, 
   "Jo Bennett", 
   "Hearsay Evidence in Domestic Violence Cases\n \n Dads of Michigan\n \n \n \n Yes.\n \n \n \n Every person we have serving a life conviction, when they would qualify for the death sentence, is one more person taking up room in a prison that could be used to house another inmate instead of letting them remain free on probation, or house arrest. We simply don't have the resources necessary to continue indefinitely housing those guilty of the most heinous crimes recognized by our judicial system.\n \n It was a trial by jury that lead to the hanging of Saddam Hussein. Are you going to try and apply your \"execution is unacceptable\" standard to a case like that?\n\n \n I reject execution on moral grounds, but that is a case where the likelihood of legal mistakes is unlikely. There is no sensible reason (especially given the cost of the execution process in the US compared with life in prison) to execute people, and not doing it at all means you will always have the ability to reverse decisions that do go the wrong way, without having to second guess whether the jury was biased, misled, or mistaken in their decision. What percentage of executed persons can be innocent to make it acceptable? 1%? 5%? 10%? 50%?", 
   {}, 
   399043, 
   null, 
   1271958660.0
  ], 
  [
   399075, 
   null, 
   "NATO 556", 
   "There is no sensible reason (especially given the cost of the execution process in the US compared with life in prison) to execute people\n\n \n And I fail to see the sensible reason why we should keep somebody alive if they've been found guilty of mass murder.\n \n If we'd managed to catch the VT killer alive, bring him to trial, and find him guilty of 32 counts of first degree murder, would you still say that he didn't deserve the death penalty?\n \n I don't see why we should be trying so hard to be keeping scum and villainy alive. The prisons are overcrowded as is, and there's talk about more jails and prisons forcing to either close or release convicted inmates to meet budget cuts. And I'm not really comfortable with the idea of violent offenders being let go, knowing there there's one less prison they'll ever see the inside of the next time they're caught.\n \n \nand not doing it at all means you will always have the ability to reverse decisions that do go the wrong way, without having to second guess whether the jury was biased, misled, or mistaken in their decision. What percentage of executed persons can be innocent to make it acceptable? 1%? 5%? 10%? 50%?\n\n \n In all seriousness, how many death row inmates have had their convictions overturned because of the discovery of new evidence? What are the real figures on this matter? Because I'm really getting tired of arguing this point without the hard facts.", 
   {}, 
   399073, 
   null, 
   1271959440.0
  ], 
  [
   399101, 
   null, 
   "Jo Bennett", 
   "\n In all seriousness, how many death row inmates have had their convictions overturned because of the discovery of new evidence? What are the real figures on this matter? Because I'm really getting tired of arguing this point without the hard facts.\n\n \n It's a little out of date, but it gives a fair summary I think:\n Death Sentences Being Overturned in 2 of 3 Appeals\n 7% or more, of those who appeal. And a pretty damning indictment of the biases and failures of the system. I have no reason to believe anything much has changed in the last 10 years, or indeed since the production of 12 Angry Men.", 
   {}, 
   399075, 
   null, 
   1271969160.0
  ], 
  [
   399121, 
   null, 
   "zsu2357", 
   "Hey whatcha wanna bet Nato, that from Jo's view, poor old Charlie Manson is just a poor old misunderstood individual on death row that should be let loose.", 
   {}, 
   399101, 
   null, 
   1271982000.0
  ], 
  [
   399133, 
   null, 
   "snakespit", 
   "If this man had been given LWOP, nobody on here would even know his name. I submit that if we are willing to trust our legal system to lock people up for life, then we should also trust it to sentence someone to death. I appreciate the concerns of people who say that we should not execute someone on one persons testimony, but I am also not foolsih enough to believe that there was absolutely no additional evidence introduced in court. Regardless, a jury of 12 people found the man guilty. In our justice system, that is enough. \n \n But I must say...I loved this part:\n \n \nIn a last-minute attempt to stay his execution, Durr's lawyers submitted the argument that he was allergic to the anaesthetic used in the administration of the lethal injection. \n\n Really? Get the man a tissue and start the IV.", 
   {}, 
   399121, 
   null, 
   1271994780.0
  ], 
  [
   399143, 
   null, 
   "zsu2357", 
   "[QUOTE=snakespit;399133]If this man had been given LWOP, nobody on here would even know his name. I submit that if we are willing to trust our legal system to lock people up for life, then we should also trust it to sentence someone to death. I appreciate the concerns of people who say that we should not execute someone on one persons testimony, but I am also not foolsih enough to believe that there was absolutely no additional evidence introduced in court. Regardless, a jury of 12 people found the man guilty. In our justice system, that is enough. \n \n But I must say...I loved this part:\n \n \n\n In a last-minute attempt to stay his execution, Durr's lawyers submitted the argument that he was allergic to the anaesthetic used in the administration of the lethal injection.\n\n \n \nReally? Get the man a tissue and start the IV.\n\n You could bet your sweet a** I'd be all kinds of allergic to it,get a box of tissues.emoticon_xgood", 
   {}, 
   399133, 
   null, 
   1272001020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Was Da'rryl Durr guilty? [death penalty]", 
  "url": "http://www.4forums.com/political/crime-debates/14169-darryl-durr-guilty-death-penalty.html", 
  "breadcrumbs": [
   "Crime"
  ], 
  "id_number": 14169, 
  "discussion_files": [
   [
    "8674.html", 
    "http://www.4forums.com/political/crime-debates/14169-darryl-durr-guilty-death-penalty-print.html"
   ], 
   [
    "8675.html", 
    "http://www.4forums.com/political/crime-debates/14169-darryl-durr-guilty-death-penalty-3-print.html"
   ], 
   [
    "8676.html", 
    "http://www.4forums.com/political/crime-debates/14169-darryl-durr-guilty-death-penalty-2-print.html"
   ]
  ], 
  "identifier": 14169
 }
]