[
 [
  [
   398605, 
   null, 
   "simone", 
   "Check out this Rachel Maddow video to get the scoop:\n Rachel Maddow Show\n \n I knew that Bush would do it totally wrong.\n \n Which was one of the reasons I was rabidly opposed to going into Iraq.\n \n The man is a stupid, incompetent nincompoop! And the stupid, incompetent nincompoops and the U.S. Supreme Court who made him president!!!\n \n emoticon_xkill", 
   {
    "post_info": {
     "post_title": "Going Into Iraq Half-A$$ed"
    }
   }, 
   null, 
   null, 
   1271621760.0
  ], 
  [
   398607, 
   null, 
   "simone", 
   "Incompetent military contractors!\n \n Because we didn't actually have the military personnel necessary to go into Iraq!\n \n Great military planning! Bush! Cheney! Rumsfeld!\n \n emoticon_xkill", 
   {}, 
   398605, 
   null, 
   1271621880.0
  ], 
  [
   398610, 
   null, 
   "gansao", 
   "Very interesting post Simone.\n Thank you", 
   {}, 
   398607, 
   null, 
   1271623140.0
  ], 
  [
   398628, 
   null, 
   "COBHC", 
   "Just when I thought simone grew up and stopped whining about Bush.", 
   {}, 
   398610, 
   null, 
   1271643180.0
  ], 
  [
   398641, 
   null, 
   "jazyjason", 
   "Just when I thought simone grew up and stopped whining about Bush.\n\n \n There is a clown face on your avatar....", 
   {}, 
   398628, 
   null, 
   1271650620.0
  ], 
  [
   398642, 
   null, 
   "COBHC", 
   "There is a clown face on your avatar....\n\n \n The difference is that Barack Obama is the current president of the US. Bush is history, yet simone will be whining about how horrible he was until she takes her last breath.", 
   {}, 
   398641, 
   null, 
   1271650800.0
  ], 
  [
   398649, 
   null, 
   "jazyjason", 
   "The difference is that Barack Obama is the current president of the US. Bush is history, yet simone will be whining about how horrible he was until she takes her last breath.\n\n \n Well the stupidity and debauchery of his presidency is still felt to this day with the economic meltdown..... So it is still relative to present times...", 
   {}, 
   398642, 
   null, 
   1271665080.0
  ], 
  [
   398677, 
   null, 
   "simone", 
   "The difference is that Barack Obama is the current president of the US. Bush is history, yet simone will be whining about how horrible he was until she takes her last breath.\n\n The difference is that we are still cleaning up Bush's messes.\n \n When Bush's messes are all cleaned up and my country is restored, I will be silent.\n \n Alas, it looks like it will be a long time.", 
   {}, 
   398642, 
   null, 
   1271700900.0
  ], 
  [
   398742, 
   null, 
   "Baron", 
   "The difference is that we are still cleaning up Bush's messes.\n \n When Bush's messes are all cleaned up and my country is restored, I will be silent.\n \n Alas, it looks like it will be a long time.\n\n \n It will take even even longer to clean up the mess being created by Obama (may the prophet's blessings be with him). Aamof, your grand children, or perhaps even your great grand children will still be paying off Obama's IOUs.", 
   {}, 
   398677, 
   null, 
   1271724600.0
  ], 
  [
   398772, 
   null, 
   "COBHC", 
   "Well the stupidity and debauchery of his presidency is still felt to this day with the economic meltdown..... So it is still relative to present times...\n\n \n Irrelevant. There have probably been twenty different threads on this very same issue. It's time to stop whining about it.", 
   {}, 
   398649, 
   null, 
   1271738880.0
  ], 
  [
   398773, 
   null, 
   "COBHC", 
   "The difference is that we are still cleaning up Bush's messes.\n \n When Bush's messes are all cleaned up and my country is restored, I will be silent.\n \n Alas, it looks like it will be a long time.\n\n \n Compared to the mess we'll have to clean up two years from now, the days of Bush will be the days of Gold. But then again you're one of those people who thinks \"the more rights the government takes from me, the better.\"", 
   {}, 
   398677, 
   null, 
   1271738940.0
  ], 
  [
   398815, 
   null, 
   "simone", 
   "It will take even even longer to clean up the mess being created by Obama (may the prophet's blessings be with him). Aamof, your grand children, or perhaps even your great grand children will still be paying off Obama's IOUs.\n\n Oh Jaysus! Baron! And to think I once credited you with having a certain level of intelligence.", 
   {}, 
   398742, 
   null, 
   1271790300.0
  ], 
  [
   398847, 
   null, 
   "Easyrider", 
   "The difference is that we are still cleaning up Bush's messes.\n \n\n \n Give it a rest. If Bush hadn't taken out Saddam we'd be having to deal with Saddams' messes daily. He'd still be raping and murdering people and he'd still be shooting at coalition aircraft over the no-fly zones, and he'd still be playing games with our inspectors to where we still wouldn't know if he had WMD's or not. And he'd still be funding terrorism. And we'd now be on our 100th U.N. Resolution threatening him some more.\n \n You know, I really loved that one comment from that Williams guy I once referenced, which read:\n \n \"Their (the liberal's) inability to grasp the obvious leads them into that corner every time and once there, once diplomacy has run its course without results, they are out of business.\" \n \n In other words, After the appeasing liberals are done with their seemingly endless, hot-air, wind-jamming sessions at the inept and corrupt U.N. - after clinging desperately to the coat tails of Jacques Chirac and Rosie O'Donnell; after all their sophomoric Jane Fonda and Cindy Sheehan surrender rallies and Neville Chamberlain pseudo-peace ploys; and with the bad guys still refusing to budge one iota - they're done. Finis. Game over. That's all there is from the libs, there isn't any more. Not even a lethal dose of Viagra can possibly get them to stand up now. All that&#8217;s left for them is to go home, wring their hands, and wait for the WMD&#8217;s to come crashing down on their Greenpeace-utopian fantasyland. \n \n I'm also reminded of the John Kerry appeasers, who wouldn't even stand up to Saddam Hussein in the first Gulf War. If they had their way then, Saddam would not only still be raping and murdering people in Kuwait, but probably in Saudi Arabia as well. And, of course, I also recall the appeasement liberals protesting against going to war in Afghanistan to root out the Taliban and Al Queda. They'd still be there too, with their Jihad terrorist camps pumping out new bad guys, had not one courageous President blown them away.\n \n \n And the sub-prime mortgage mess started under Clinton and Barney Franks and Company nurtured it along the way. It was a typical big-government liberal shakedown - make the banks and morgage companies fund low interest loans to the poor, who couldn't afford to repay the mortgages. Another \"Help the poor and screw American taxpayers\" mess from the liberal elitists.\n \n Go home.", 
   {}, 
   398677, 
   null, 
   1271805180.0
  ], 
  [
   398863, 
   null, 
   "COBHC", 
   "Oh Jaysus! Baron! And to think I once credited you with having a certain level of intelligence.\n\n \n It's not like you've ever demonstrated your own political knowledge or understanding. You just keep screaming what the media feeds you. Look at Jo Bennett, JazyJason, and even Antonia; they all have their own opinions. I disagree with all of them on most issues, but at least they think for themselves rather than let the media think for them.", 
   {}, 
   398815, 
   null, 
   1271814180.0
  ], 
  [
   398880, 
   null, 
   "Baron", 
   "Oh Jaysus! Baron! And to think I once credited you with having a certain level of intelligence.\n\n \n Your response tells me that you have no clue what I am talking about.", 
   {}, 
   398815, 
   null, 
   1271823600.0
  ], 
  [
   398882, 
   null, 
   "NATO 556", 
   "What has Obama done to get us out of the middle east? Absolutely nothing.", 
   {}, 
   398880, 
   null, 
   1271824260.0
  ], 
  [
   398897, 
   null, 
   "jazyjason", 
   "Irrelevant. There have probably been twenty different threads on this very same issue. It's time to stop whining about it.\n\n \n The day unemployment stops being 12.5% here in Cali is the day I'll stop bitching about it.", 
   {}, 
   398772, 
   null, 
   1271829180.0
  ], 
  [
   398898, 
   null, 
   "jazyjason", 
   "What has Obama done to get us out of the middle east? Absolutely nothing.\n\n \n Troop with drawls so far. We've moved out of the major cities in Iraq as well and given over most security details to the Iraqi Army. \n \n I know... all of you guys hate Obama we get it. I'm not happy with him either. If Dan Choi has to chain himself to the White House again to get DADT repealed I'm gonna think either he's into BDSM or Obama just doesn't care...", 
   {}, 
   398882, 
   null, 
   1271829300.0
  ], 
  [
   398899, 
   null, 
   "jazyjason", 
   ". You just keep screaming what the media feeds you. Look at Jo Bennett, JazyJason, and even Antonia; they all have their own opinions. I disagree with all of them on most issues, but at least they think for themselves rather than let the media think for them.\n\n \n I don't have an opinion. I'm actually a computer made to spit out responses from MSNBC... Sorry to burst your bubble.\n \n \n Just kidding. Sorry you disagree with me on alot of issues. The day I shut off Fixed News and the rest is the day I woke up out of the Matrix...", 
   {}, 
   398863, 
   null, 
   1271829420.0
  ], 
  [
   398906, 
   null, 
   "COBHC", 
   "The day unemployment stops being 12.5% here in Cali is the day I'll stop bitching about it.\n\n \n And what does your unemployment rate have to do with Iraq? And why does your unemployment make you whine about Iraq?", 
   {}, 
   398897, 
   null, 
   1271845800.0
  ], 
  [
   398908, 
   null, 
   "COBHC", 
   "I don't have an opinion. I'm actually a computer made to spit out responses from MSNBC... Sorry to burst your bubble.\n \n \n Just kidding. Sorry you disagree with me on alot of issues. The day I shut off Fixed News and the rest is the day I woke up out of the Matrix...\n\n \n Actually the mainstream media is subtly, but strongly biased towards the left. My point is that you, Jo, and Antonia try to discuss things. People can have an actual discussion with you. But when I try to have a discussion with simone, she tells me that I don't understand the issue hoping that I won't ask for details. Then, to no surprise, when I ask her to explain what I supposedly don't understand, she changes the subject. It demonstrates that she doesn't really understand what she's talking about.", 
   {}, 
   398899, 
   null, 
   1271846160.0
  ], 
  [
   398937, 
   null, 
   "simone", 
   "What has Obama done to get us out of the middle east? Absolutely nothing.\n\n It's pretty darn hard to pull an entire nation out of George W. Bush's big, fat quagmire in Iraq and Afghanistan.\n \n George W. Bush, the one thing he's good at is totally bollaxing any of his endeavors.", 
   {}, 
   398882, 
   null, 
   1271881440.0
  ], 
  [
   398940, 
   null, 
   "Steeeeve", 
   "The day unemployment stops being 12.5% here in Cali is the day I'll stop bitching about it.\n\n \n The fact that California is a horribly run state is not the fault of any president. The fact that we had an economic meltdown is the fault of big banks, 20+ years of federal government making legislation to help big banks, and people believing they could afford a $500k house on a $40k salary.\n \n The day you finally realize this is the day you will stop bitching.", 
   {}, 
   398897, 
   null, 
   1271882940.0
  ], 
  [
   398944, 
   null, 
   "jyoshu", 
   "The fact that California is a horribly run state is not the fault of any president. The fact that we had an economic meltdown is the fault of big banks, 20+ years of federal government making legislation to help big banks, and people believing they could afford a $500k house on a $40k salary.\n \n The day you finally realize this is the day you will stop bitching.\n\n \n On the other hand, I think we need to be careful in this country to not over-punish banks because of these stupid people who are so financially irresponsible to get themselves in so much debt. Obama's approach seems to be to bail out the consumer for their own stupid mistakes (and therefore avoid the pitfalls of foreclosure) and rather make the banks the bad guy for it. Regulationists always try to find a so-called \"big\" thing to blame other than people who don't take responsibility: in the 90s it was \"big tobacco\", then \"big oil\", and now \"big banks\". The public is always going to be easily persuaded to make an enemy other than themselves as the culprit and therefore always take the path that most avoids personal responsibility.", 
   {}, 
   398940, 
   null, 
   1271885820.0
  ], 
  [
   399032, 
   null, 
   "jazyjason", 
   "On the other hand, I think we need to be careful in this country to not over-punish banks because of these stupid people who are so financially irresponsible to get themselves in so much debt.\n\n \n I have a secret word. I'll whisper it to you... Goldman Sachs............ HELLO???", 
   {}, 
   398944, 
   null, 
   1271918700.0
  ], 
  [
   399033, 
   null, 
   "jazyjason", 
   "Actually the mainstream media is subtly, but strongly biased towards the left. My point is that you, Jo, and Antonia try to discuss things. People can have an actual discussion with you. But when I try to have a discussion with simone, she tells me that I don't understand the issue hoping that I won't ask for details. Then, to no surprise, when I ask her to explain what I supposedly don't understand, she changes the subject. It demonstrates that she doesn't really understand what she's talking about.\n\n \n Well I at least try to think... Sometimes I just go on autopilot and wonder how in the hell did I wind up here?", 
   {}, 
   398908, 
   null, 
   1271918820.0
  ], 
  [
   399034, 
   null, 
   "jazyjason", 
   "And what does your unemployment rate have to do with Iraq? And why does your unemployment make you whine about Iraq?\n\n \n I'm not unemployed I actually have 3 jobs and you were talking about the economy... Unemployment = bad economy so I figured..... yeah...", 
   {}, 
   398906, 
   null, 
   1271918880.0
  ], 
  [
   399035, 
   null, 
   "jazyjason", 
   "The fact that California is a horribly run state is not the fault of any president. \n\n \n Perhaps. But the Executive Powers are not stagnant either...\n \n \n The fact that we had an economic meltdown is the fault of big banks, 20+ years of federal government making legislation to help big banks, and people believing they could afford a $500k house on a $40k salary.\n\n \n Well... that and the whole spin the roulette wheel on mortgages....\n \n \nThe day you finally realize this is the day you will stop bitching.\n\n \n I just realized it today! But I'm still bitching....", 
   {}, 
   398940, 
   null, 
   1271918940.0
  ], 
  [
   399048, 
   null, 
   "COBHC", 
   "I'm not unemployed I actually have 3 jobs and you were talking about the economy... Unemployment = bad economy so I figured..... yeah...\n\n \n No, I was talking about how Bush sending troops into Iraq has already been discussed over and over and is, or at least should be a dead issue. It's good to remember history, but we can't make any progress if we constantly live in the past. I find it more interesting why all Obama's promises to shorten the war in Iraq have so far come to nothing.", 
   {}, 
   399034, 
   null, 
   1271927220.0
  ], 
  [
   399091, 
   null, 
   "simone", 
   "No, I was talking about how Bush sending troops into Iraq has already been discussed over and over and is, or at least should be a dead issue. It's good to remember history, but we can't make any progress if we constantly live in the past. I find it more interesting why all Obama's promises to shorten the war in Iraq have so far come to nothing.\n\n How many of our personnel in Iraq have been casualties this year?", 
   {}, 
   399048, 
   null, 
   1271965800.0
  ], 
  [
   399093, 
   null, 
   "NATO 556", 
   "How many of our personnel in Iraq have been casualties this year?\n\n \n How many of our personnel has Obama gotten out of the middle east and brought back home? What are the current troop levels of today as compared to 2008?", 
   {}, 
   399091, 
   null, 
   1271966340.0
  ], 
  [
   399097, 
   null, 
   "jyoshu", 
   "No, I was talking about how Bush sending troops into Iraq has already been discussed over and over and is, or at least should be a dead issue. It's good to remember history, but we can't make any progress if we constantly live in the past. I find it more interesting why all Obama's promises to shorten the war in Iraq have so far come to nothing.\n\n \n Or why all the anti-war buffs are mostly silent over Obama and Afganistan given their hysteria over Iraq during Bush's presidency ...", 
   {}, 
   399048, 
   null, 
   1271968500.0
  ], 
  [
   399107, 
   null, 
   "Baron", 
   "How many of our personnel in Iraq have been casualties this year?\n\n \n You are so obvious Simone, so why don't you tell us what you already know.", 
   {}, 
   399091, 
   null, 
   1271976360.0
  ], 
  [
   399127, 
   null, 
   "COBHC", 
   "How many of our personnel in Iraq have been casualties this year?\n\n \n I think NATO had a more relevant question: How many troops has Obama brought home?", 
   {}, 
   399091, 
   null, 
   1271985900.0
  ], 
  [
   399140, 
   null, 
   "jazyjason", 
   "No, I was talking about how Bush sending troops into Iraq has already been discussed over and over and is, or at least should be a dead issue. It's good to remember history, but we can't make any progress if we constantly live in the past. I find it more interesting why all Obama's promises to shorten the war in Iraq have so far come to nothing.\n\n \n I also wonder why I even try to believe he'll pass DADT when hell freezes over... If you look in the Gay Rights thread I think you'll be surprised and yes I'm THAT XXXXXX...", 
   {}, 
   399048, 
   null, 
   1272000480.0
  ], 
  [
   399147, 
   null, 
   "COBHC", 
   "I also wonder why I even try to believe he'll pass DADT when hell freezes over... If you look in the Gay Rights thread I think you'll be surprised and yes I'm THAT XXXXXX...\n\n \n Campaign promises always make the future look brighter than actions do.", 
   {}, 
   399140, 
   null, 
   1272007860.0
  ], 
  [
   399149, 
   null, 
   "Winston Smith", 
   "I think NATO had a more relevant question: How many troops has Obama brought home?\n\n \n I think simone's question (the one you avoid) is the relevant one to the families of those killed for nothing. Oops! favorable oil contracts for the American oil companies is something to die for.emoticon_rolleyes", 
   {}, 
   399127, 
   null, 
   1272011160.0
  ], 
  [
   399154, 
   null, 
   "COBHC", 
   "I won't let Winston change the subject. Winston, if you don't know what people are talking about, don't try to join the discussion. The issue here is why simone is whining about Bush when Obama just keeps sending troops over to the Middle-East after all his promises to end the war.", 
   {}, 
   399149, 
   null, 
   1272022800.0
  ], 
  [
   399155, 
   null, 
   "Winston Smith", 
   "Oh Jaysus! Baron! And to think I once credited you with having a certain level of intelligence.\n\n \n How naive Simone, and generous of you at the same time, of thinking baron showed some signs of intelligence.\n \n I think the reason most Tea-party troopers such as baron, hate Obama apart from being Black (baron once joked that the White House should be now be called the Black House) is because he is intelligent, logic and reasonable. In other words the opposite of what they are.\n \n You can see the low intelligence but high malevolence of his post in the implying that Obama is a Muslim and as you know Islam is the religion of terrorists, enemies of the USA. So in one sentence he implies that Obama is a traitor and you what traitors deserve, right?\n \n Bill Clinton was right when he spoke of the present climate of hatred brought about by the congruence of racism, gun toting militiamen, distrust of the government, and the dire economic situation and the rise of the tea party extremists, makes you fear for the safety of Obama and his family.\n People such as baron are people to beware of.", 
   {}, 
   398815, 
   null, 
   1272023340.0
  ], 
  [
   399156, 
   null, 
   "COBHC", 
   "How naive of you, Simone and generous at the same time of thinking baron showed some signs of intelligence.\n \n \nI think the reason most Tea-party troopers such as baron, hate Obama apart from being Black (baron once joked that the White House should be now be called the Black House) is because he is intelligent, logic and reasonable. In other words the opposite of what they are.\n\n \n You can see the low intelligence but high malevolence of his post in the implying that Obama is a Muslim and as you know Islam is the religion of terrorists, enemies of the USA. So in one sentence he implies that Obama is a traitor and you what traitors deserve, right?\n \n Bill Clinton was right when he spoke of the present climate of hatred brought about by the congruence of racism, gun toting militiamen, distrust of the government, and the dire economic situation and the rise of the tea party extremists, makes you fear for the safety of Obama and his family.\n People such as baron are people to beware of.\n\n \n Yeah, look at how racist these teabaggers are. emoticon_rolleyes\n \n FOXNews.com - Black Conservatives Take Lead Role in Tea Party Movement\n \n Once again, you've managed to make a completely off-topic post. First off, I am not Baron, and I don't understand why you're bringing him up here.\n \n Second, the issue being discussed has nothing to do with race.\n \n Third, I'm not defending Baron here, but I suggest you try making responses relevant to the issue before you start talking about who's lacking intelligence. ;)\n \n I really shouldn't continue replying to your off-topic BS. From this point on, I'll ignore you until you have a relevant comment to make, which, frankly, I don't expect.", 
   {}, 
   399155, 
   null, 
   1272023580.0
  ], 
  [
   399157, 
   null, 
   "Winston Smith", 
   "I was amused by a cartoon recently, which depicts the members of the Tea Party, America's latest political movement, as mostly resentful white folks who have been ginned up with existential fear by right-wing demagogues.\n The cartoon shows one of them reacting to the instruction to fill out this year's Census form with a blue or black pen as if it were yet another attempt by the federal government (i.e., President Obama) to take away his freedom. So, to \"take [his] country back,\" he decides to fill it out with a red crayon, which symbolizes his infantile defiance. This, it occurred to me, illustrates the utterly fatuous nature of most Tea Party protests. \n \n I am all too mindful, however, that the irrational rage depicted in this cartoon does not capture the racism that motivates most its members (a.k.a. tea baggers). Nothing demonstrates this quite like the fact that George W. Bush has done more than any other president to plunge the country into debt by launching an ill-advised war in Iraq and funding supply-side tax breaks for the super rich. And, more to the point, he was the one who socialized the US economy by bailing out rich bankers on Wall Street. Frankly, this liberal record makes President Obama's move to save jobs in the auto industry and provide access to healthcare for poor people on Main Street seem, well, conservative. \n \n Yet few, if any, of these folks ever took to the streets to protest against Bush the way they are protesting against Obama. Among other things, they're accusing him of being \"a socialist\" who does not share their American values, and of running a \"gangsta administration\" that rammed healthcare reform down the throats of the American people. \n \n Never mind that, far from \"taking away their freedoms,\" Obama's plans to save manufacturing jobs and lower taxes (even for the vast majority of Tea Party members) will give them greater freedom to pursue their happiness in every respect. And the way they're going on about their guns you'd think that Obama has proposed a law to ban them. In point of fact, he has not even hinted at restricting the use of firearms...\n \n This should expose the big lie behind their Tea-Party label, which is a plainly cynical attempt to co-opt the just cause of Boston revolutionaries whose iconic tax revolt in 1773 led to the War of Independence. In fact, this craze is nothing more than a shrewd and willful attempt to wrap naked racism in the so-called traditional values of limited government and lower taxes. Of course, there is precedence for this: \n \n For not so long ago, everyone from presidents to chief justices of the Supreme Court cited nothing less than the Constitution for the proposition that black Americans were not entitled to the same civil rights as white Americans. Therefore, it's hardly surprising that a significant number of white people are now buying into the proposition that a black man is not entitled to be president of the United States. \n \n This is why Tea Party agitators were (and still are) propagating all of the nonsense about Obama being a Muslim who was not even born in this country. And it is why they are doing all they can to undermine his presidency. \n \n Not to mention that stoking the simmering racial resentment of these folks makes good politics for the Republican Party (i.e., its Southern strategy) as well as good business for conservative talk radio and Fox News. Why else would the governor of Virginia issue a proclamation to celebrate the glories of the Confederacy without bothering to mention that its racist determination to preserve and protect the institution of slavery was the primary cause of the Civil War? And how else could Sarah Palin have racked up over $12 million less than a year after quitting her job as governor of Alaska? \n \n The only question is whether the Tea Party has any greater power to return America back to the halcyon days when segregation made the prospect of a black president impossible, than the KKK had to stop the inexorable force of the racial integration that made Obama's election possible? \n \n It does not, ironically, in large measure because of the lessons of the Civil War and the Civil Rights Movement. And, despite spreading anti-Obama fever with their incendiary rants about him taking away people's freedoms and trampling over states' rights, not even rabble-rousing demagogues like Rush Limbaugh and Glen Beck believe that the Tea Party poses any real threat to Obama's presidency. Instead, for these pied pipers, all of this talk is just entertainment, and they use their artistic license to tell lies shamelessly...\n \n This is not to say that these Tea Party protests pose no danger. In fact, in an interview on Friday commemorating the Oklahoma City bombing of April 19, 1995, here's how no less a person than former President Bill Clinton drew comparisons between the anger and resentment of tea baggers and those of right-wing extremists who were venting during his presidency: \n \n \"Before the bombing occurred, there was a sort of fever. The fabric of American life had been unraveling... There were more and more people having trouble figuring out where they fit nit... we see some of that today...\n \n \"This tea party movement can be a healthy thing if they are making us justify every dollar of taxes we raise and every dollar of money we've spent. But when you get mad, sometimes you end up producing the exact opposite result of what you say you are for ... words really do matter.\" (politico.com) \n \n Unfortunately, there's nothing any government can do to protect us against a \"lone wolf\" like Timothy McVeigh. I will note, however, that because of his act of terrorism, the FBI is doing a much better job of infiltrating right-wing, anti-government militias. Because, on the one hand, the Tea Party just provides a venue for white, angry men - who feel the presumptions and prerogatives of their race are unraveling - to blow off steam. On the other hand, these militias actually train them for a day of reckoning when they can \"take their country back\" (to give back to the Indians, the original owners, perhaps...?). \n \n But the FBI proved its effectiveness in this respect by arresting nine anti-government militiamen just a few weeks ago for plotting a guerilla war against law enforcement officers. This is why I am less worried about Tea-Party rhetoric escalating into acts of domestic terrorism than I am about that rhetoric inciting some wacko to channel John Wilkes Booth by attempting to assassinate Obama: \n \n \"Let us pray that as Obama begins to look more and more like the truly inevitable Democratic nominee (and the next president of the United States), his Secret Service bodyguards will redouble their efforts to protect him. Because the last thing America needs right now is another assassination that triggers all of the lost hope and incendiary rage of the killing of John F. Kennedy, Robert F. Kennedy, and Martin Luther King Jr... combined!\" [Hillary wins New Hampshire; Defies pundits, but not her ill-fated destiny, TIJ, January 9, 2008] \n \n Ultimately, notwithstanding their protestations of political independence, when push comes to shove, I suspect tea baggers will turn out to be nothing more than temporarily insane Republicans. \n \n In the meantime, one can be forgiven for thinking that the Tea Party constitutes a far greater political force than is actually the case. But this is only because the media devote a disproportionate amount of coverage to the antics of its members. And they do so of course for the same reason they provide blanket coverage of train wrecks and freak shows: tea baggers make good television!\n \n Caribbean Net News: Commentary: America's Tea Party revolutionaries", 
   {
    "post_info": {
     "post_title": "Tea Party the Party of racists"
    }, 
    "unicode_changes_made": true
   }, 
   399156, 
   null, 
   1272026520.0
  ], 
  [
   399165, 
   null, 
   "COBHC", 
   "Seeing that Winston obviously didn't read the link I posted, I don't think trying to have a discussion with him is worth the effort.", 
   {}, 
   399157, 
   null, 
   1272038340.0
  ], 
  [
   399172, 
   null, 
   "Winston Smith", 
   "Why so serious ? emoticon_rolleyes", 
   {}, 
   399165, 
   null, 
   1272039480.0
  ], 
  [
   399178, 
   null, 
   "Baron", 
   "Seeing that Winston obviously didn't read the link I posted, I don't think trying to have a discussion with him is worth the effort.\n\n \n You got that right. Ignoring him is the most effective way of dealing with WS.", 
   {}, 
   399165, 
   null, 
   1272044820.0
  ], 
  [
   399185, 
   null, 
   "simone", 
   "How many of our personnel has Obama gotten out of the middle east and brought back home? What are the current troop levels of today as compared to 2008?\n\n My son-in-law is in Iraq. He's coming home in August or earlier.\n \n Have you ever had any skin in Bush's little war?", 
   {}, 
   399093, 
   null, 
   1272047100.0
  ], 
  [
   399251, 
   null, 
   "COBHC", 
   "My son-in-law is in Iraq. He's coming home in August or earlier.\n \n Have you ever had any skin in Bush's little war?\n\n \n And you can credit the return of one soldier to Obama? Well, by that logic, I have a cousin who came home from Iraq back in 2007. Praise be unto Bush!", 
   {}, 
   399185, 
   null, 
   1272088860.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Going Into Iraq Half-A$$ed", 
  "url": "http://www.4forums.com/political/politics-debates/14160-going-into-iraq-half-ed.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 14160, 
  "discussion_files": [
   [
    "16990.html", 
    "http://www.4forums.com/political/politics-debates/14160-going-into-iraq-half-ed-print.html"
   ], 
   [
    "16991.html", 
    "http://www.4forums.com/political/politics-debates/14160-going-into-iraq-half-ed-4-print.html"
   ], 
   [
    "16992.html", 
    "http://www.4forums.com/political/politics-debates/14160-going-into-iraq-half-ed-3-print.html"
   ], 
   [
    "16993.html", 
    "http://www.4forums.com/political/politics-debates/14160-going-into-iraq-half-ed-2-print.html"
   ]
  ], 
  "identifier": 14160
 }
]