[
 [
  [
   401225, 
   null, 
   "ShadowPikachu", 
   "Just a quick question. To those of you who are strong advocates of gun control. In your opinion, what would be \"Sensible\" Gun control laws?", 
   {
    "post_info": {
     "post_title": "What would be YOUR ideas for &quot;sensible&quot; Gun Control laws?"
    }
   }, 
   null, 
   null, 
   1273602060.0
  ], 
  [
   401240, 
   null, 
   "sinjin", 
   "NICS background checks for all firearm purchases, new or used, FFL or private party sales.\n \n Mandatory secure storage for firearms left in residences while the homeowner is away.", 
   {}, 
   401225, 
   null, 
   1273606020.0
  ], 
  [
   401265, 
   null, 
   "ShadowPikachu", 
   "NICS background checks for all firearm purchases, new or used, FFL or private party sales.\n \n\n I would agree. \n \n How do you propose getting it enforced for private party sales though? I'd think that would be hard to do. \n \n \n\n Mandatory secure storage for firearms left in residences while the homeowner is away.\n\n Gun safes?\n \n If so, I'd agree, no one should leave their guns easily steal-able while they are away.", 
   {}, 
   401240, 
   null, 
   1273613700.0
  ], 
  [
   401267, 
   null, 
   "zsu2357", 
   "Well Pikachu?sounds like you and Singin hit it off...by the way say hi to Caterpie.\n emoticon_xdonno", 
   {}, 
   401265, 
   null, 
   1273614780.0
  ], 
  [
   401269, 
   null, 
   "ShadowPikachu", 
   "Well Pikachu?sounds like you and Singin hit it off...by the way say hi to Caterpie.\n emoticon_xdonno\n\n LOL, I wouldn't say we've \"hit it off\". He simply listed two things that I would agree with. I am in no way liberal on gun rights. I just think its a good idea to lock up your guns when you're gone, and to make sure a felon isn't buying a weapon (something determined by a background check).\n \n But I will say hi to caterpie, LOL.", 
   {}, 
   401267, 
   null, 
   1273616160.0
  ], 
  [
   401270, 
   null, 
   "zsu2357", 
   "LOL, I wouldn't say we've \"hit it off\". He simply listed two things that I would agree with. I am in no way liberal on gun rights. I just think its a good idea to lock up your guns when you're gone, and to make sure a felon isn't buying a weapon (something determined by a background check).\n \n But I will say hi to caterpie, LOL.\n\n Hey, you got a sense of humor!wasn't sure if you got the by-play.\n Perhaps that could be up to the individual,but as far as someone saying you are\n going to lock them up won't happen regardless.\n \n I keep a 9mm under the bed loaded in arms reach...\n \n .What kind of felon?violent,non-violent?or your basic chicken sh## felony?", 
   {}, 
   401269, 
   null, 
   1273618560.0
  ], 
  [
   401271, 
   null, 
   "NATO 556", 
   "Mandatory background checks for all purchases only creates a mountain of paperwork for the police to sort through, and it only comes in handy if the legal buyer commits a crime, not some thug with a stolen weapon with the serial number obliterated and the bore scarred beyond recognition.\n \n Mandatory storage laws were ruled unconstitutional by the Supreme Court. Enough said on that one.", 
   {}, 
   401270, 
   null, 
   1273618740.0
  ], 
  [
   401275, 
   null, 
   "sinjin", 
   "Mandatory background checks for all purchases only creates a mountain of paperwork for the police to sort through, and it only comes in handy if the legal buyer commits a crime, not some thug with a stolen weapon with the serial number obliterated and the bore scarred beyond recognition.\nIt's a mountain already. Weak excuse.\n It's also already the law in CA.\n \n \nMandatory storage laws were ruled unconstitutional by the Supreme Court. Enough said on that one. \nWhere's your immediate access to your home protection when you're not home?\n The SCOTUS ruling was narrower than you suggest.", 
   {}, 
   401271, 
   null, 
   1273620180.0
  ], 
  [
   401279, 
   null, 
   "NATO 556", 
   "It's a mountain already.\n\n \n And how many criminals have you successfully brought to justice as a result?\n \n \nWeak excuse.\n\n \n Alright I've got a better one. Budgetary constraints.\n \n \nIt's also already the law in CA.\n\n \n It's also the law in CA -at least for Santa Clara County- that fast food places can't distribute happy meal toys unless they drop calorie counts.\n \n \nWhere's your immediate access to your home protection when you're not home? The SCOTUS ruling was narrower than you suggest.\n\n \n Not really. The Heller ruling made no exceptions like you suggest. They ruled mandatory storage laws were unconstitutional. There's no separate provision for unattended guns.", 
   {}, 
   401275, 
   null, 
   1273621680.0
  ], 
  [
   401292, 
   null, 
   "COBHC", 
   "For now I guess it'd be as long as you've never been convicted of a violent crime and you don't have any mental disorders, you can own whatever you want other than weapons meant to destroy buildings or vehicles (e.g. rocket launchers, flamethrowers, grenades, anti-aircraft guns, etc).\n \n Crime was low back in the 50s and 60s, at which point you could buy a firearm from a pawn shop.\n \n But alot of convicted felons were defending themselves. People being charged with a self-defense related crime is especially common in the UK. I would say \"just don't charge people who were defending themselves,\" but due to anti-gun fanatics who seem to be apologists for would-be home invaders, it's easier said than done.", 
   {}, 
   401279, 
   null, 
   1273631880.0
  ], 
  [
   401325, 
   null, 
   "sinjin", 
   "And how many criminals have you successfully brought to justice as a result?\nYou mean how many NICS checks resulted in a denial of sale? Miliions to date.\n \n \nAlright I've got a better one. Budgetary constraints.\nSociety better be able to afford to protect itself.\n \n \nIt's also the law in CA -at least for Santa Clara County- that fast food places can't distribute happy meal toys unless they drop calorie counts.\nHave you noticed all the obese kids around you these days?\n \n \nNot really. The Heller ruling made no exceptions like you suggest. They ruled mandatory storage laws were unconstitutional. There's no separate provision for unattended guns. \n\n \n The ruling found unConstitutional any, \"prohibition against rendering any lawful firearm in the home operable for the purpose of immediate\n self-defense.\"\n \n Storage laws dealing with unattended firearms would be a separate issue.", 
   {}, 
   401279, 
   null, 
   1273675260.0
  ], 
  [
   401336, 
   null, 
   "zsu2357", 
   "We've heard lock them up(perhaps to keep little hands off,perhaps),but how doe's that keep them from being stolen?unless you have a safe certified by Brinks or something,someone wants them bad enough they will take them safe and all.Good heavy duty safe says hey there must be some pretty good guns in\n there.\n \n Gun control?all that will do is control who owns them 10 minutes down the road as opposed to 2 or 3.\n \n Background checks mean nothing especially if the person has no record,the old\n \"infamous straw purchaser\"syndrome.Besides way would someone be willing to \n screw up there record?emoticon_confused", 
   {}, 
   401325, 
   null, 
   1273683060.0
  ], 
  [
   401337, 
   null, 
   "zsu2357", 
   "But really though in keeping with the thread I think a sensible \"gun control law\"\n would be mandatory target practice at least once a month and at least 20+rounds per weapon.\n All in agreement say yay.\n All against say nay.emoticon_xkillemoticon_xkill", 
   {}, 
   401336, 
   null, 
   1273683660.0
  ], 
  [
   401338, 
   null, 
   "sinjin", 
   "We've heard lock them up(perhaps to keep little hands off,perhaps),but how doe's that keep them from being stolen?unless you have a safe certified by Brinks or something,someone wants them bad enough they will take them safe and all.Good heavy duty safe says hey there must be some pretty good guns in\n there.\nSeatbelts save lives, but not all. I mean, why lock your doors if a professional burglar can defeat them?\n Is that your logic? Does the phrase, \"crime of opportunity\" ring a bell?\n \n \nBackground checks mean nothing especially if the person has no record,the old \"infamous straw purchaser\"syndrome.\nBG checks themselves will not prevent straw purchases. True enough. \n For that we'll need yet other regulations. Mandatory theft reporting for instance.", 
   {}, 
   401336, 
   null, 
   1273684080.0
  ], 
  [
   401343, 
   null, 
   "NATO 556", 
   "In other words, more government control over the people.\n \n This whole idea that \"bigger and more powerful government\" is the same as \"sensible gun control laws\" simply makes no sense.", 
   {}, 
   401338, 
   null, 
   1273689540.0
  ], 
  [
   401346, 
   null, 
   "sinjin", 
   "This whole idea that \"bigger and more powerful government\" is the same as \"sensible gun control laws\" simply makes no sense.\n\n This whole idea that every law we make means \"bigger and more powerful government\" simply makes no sense.", 
   {}, 
   401343, 
   null, 
   1273690920.0
  ], 
  [
   401349, 
   null, 
   "NATO 556", 
   "This whole idea that every law we make means \"bigger and more powerful government\" simply makes no sense.\n\n \n It does if there are new committees and subcommittees and departments created with the passage of any particular bill. Or if said bill puts more tasks and more authority in the hands of existing government.", 
   {}, 
   401346, 
   null, 
   1273691280.0
  ], 
  [
   401351, 
   null, 
   "sinjin", 
   "It does if there are new committees and subcommittees and departments created with the passage of any particular bill. Or if said bill puts more tasks and more authority in the hands of existing government.\nIs more government authority always bad?", 
   {}, 
   401349, 
   null, 
   1273691400.0
  ], 
  [
   401352, 
   null, 
   "Tither", 
   "But really though in keeping with the thread I think a sensible \"gun control law\"\n would be mandatory target practice at least once a month and at least 20+rounds per weapon.\n All in agreement say yay.\n All against say nay.emoticon_xkillemoticon_xkill\n\n That is sensible, but I would like to see more than 20 rnds.\n \n Also using two hands is good for gun control. \n \n As to all of the other demands for more and more and more and more and more, gun control, then a never ending list loopholes on all that is proposed, see the last 300 iterations of this exact same thread. (I know you were answering the man's question, but it is all a repeat.)\n \n That includes Illegal guns coming from Mexico as a new source of income, Like what happened in   England and Australia, the cost associated with an approved locking them up scam, being a Unconstitutional condition of participation in an Inalienable Right, and how there are at least 300 million guns in circulation already, so how do you propose to control the uncontrollable. And not to forget the 22 to 30 thousand laws on the books already, and when dealing with a Constitutional Right, all you are only allowed the bare minimum to keep society safe in general. All infringements must be few, and specifically targeted. To that part of the argument, there are the 2 most exhaustive studies ever done on Gun Control showing  What did they find?  \n \"the task Force found insufficient evidence to determine the effectiveness of any of the firearms laws or combinations of laws reviewed on violent outcomes.\" \n \n They studied Bans on specified firearms or ammunition.\n Restrictions on firearm acquisition.\n Waiting periods for firearm acquisition.\n Firearm registration and licensing of owners\n Child access prevention laws.\n Zero tolerance laws for firearms in schools.\n \n Having said all of this over time, I normally would say now PROVE what you say we should do, will work as you say it will work, before taking any more of an Inalienable, First and Fundamental Right. Don't you owe this to the American People? After all, it is not only yours to take, and it is not only ours to give! emoticon_smile", 
   {
    "unicode_changes_made": true
   }, 
   401337, 
   null, 
   1273691520.0
  ], 
  [
   401353, 
   null, 
   "Galileo", 
   "I have one simple proposal that I think would make a big difference:\n \n Handguns should be one of the categories of firearms regulated by the National Firearms Act of 1934. Considering that the NFA was passed to regulate gangster type weapons and that handguns are used much more often in crime than other types of firearms, I think this is totally reasonable. For example, 7,795 out of 10,177 firearm murders were committed with handguns in 2006.\n Expanded Homicide Data Table 7 - Crime in the United States 2006", 
   {}, 
   401343, 
   null, 
   1273691820.0
  ], 
  [
   401354, 
   null, 
   "sinjin", 
   "Taking \"part\" of a right is like taking \"part\" of a girl's virtue.\n \n Can't be done.", 
   {}, 
   401352, 
   null, 
   1273691940.0
  ], 
  [
   401355, 
   null, 
   "Doc Jones", 
   "Is more government authority always bad?\n\n \n \"Hello. L.A. CPS?\"", 
   {}, 
   401351, 
   null, 
   1273692060.0
  ], 
  [
   401358, 
   null, 
   "Doc Jones", 
   "I have one simple proposal that I think would make a big difference:\n \n Handguns should be one of the categories of firearms regulated by the National Firearms Act of 1934. Considering that the NFA was passed to regulate gangster type weapons and that handguns are used much more often in crime than other types of firearms, I think this is totally reasonable. For example, 7,795 out of 10,177 firearm murders were committed with handguns in 2006.\n Expanded Homicide Data Table 7 - Crime in the United States 2006\n\n \n The Sullivan Act was passed in NY at the behest of gangsters so they could use a law to protect their turf from rivals, mostly smuggling alchohol which had been banned. Big Tim Sullivan and Al Capone benefitted most from this because the politicians were already in their pocket as were the Kennedy family.\n \n Laws are a lot like sausage, you really don't want to see how they are made! emoticon_xgood\n \n Bad laws exist because good men do nothing...they don't have the money to buy off the \"law keepers\" (government).\n \n What is that \"shall not be infringed\" part you don't understand?", 
   {}, 
   401353, 
   null, 
   1273692600.0
  ], 
  [
   401360, 
   null, 
   "NATO 556", 
   "Is more government authority always bad?\n\n \n Look around at some of the more corrupt areas of government, then ask again.", 
   {}, 
   401351, 
   null, 
   1273692960.0
  ], 
  [
   401363, 
   null, 
   "NATO 556", 
   "Handguns should be one of the categories of firearms regulated by the National Firearms Act of 1934. Considering that the NFA was passed to regulate gangster type weapons and that handguns are used much more often in crime than other types of firearms, I think this is totally reasonable. For example, 7,795 out of 10,177 firearm murders were committed with handguns in 2006.\n Expanded Homicide Data Table 7 - Crime in the United States 2006\n\n \n You don't get to use criminal acts as a basis for taking rights away from the people. Their actions are an illegal misuse of something. Using logic like yours we should ban whatever vehicles are most used for smuggling purposes.\n \n In light of the Heller ruling, I'd like to see you explain just how this proposal of yours would ever pass constitutional muster.\n \n Go ahead and try.", 
   {}, 
   401353, 
   null, 
   1273693320.0
  ], 
  [
   401366, 
   null, 
   "sinjin", 
   "Look around at some of the more corrupt areas of government, then ask again.\nHave an example of a corrupt area of the U.S. government for me?", 
   {}, 
   401360, 
   null, 
   1273693800.0
  ], 
  [
   401367, 
   null, 
   "Doc Jones", 
   "Have an example of a corrupt area of the U.S. government for me?\n\n \n Have an example of one which isn't?", 
   {}, 
   401366, 
   null, 
   1273694100.0
  ], 
  [
   401371, 
   null, 
   "Doc Jones", 
   "I love childish one liners...they present such powerful points and add to the discussion in a null way, and a dull way, to change the subject usually meaning, \"I can't prove my point so can you please change the subject and let me off the hook\"! emoticon_xgood", 
   {}, 
   401367, 
   null, 
   1273694640.0
  ], 
  [
   401381, 
   null, 
   "zsu2357", 
   "Seatbelts save lives, but not all. I mean, why lock your doors if a professional burglar can defeat them?\n\n \nYour probably right about locking your doors, but it don't take a pro to go around back and kick it in or bust a window.\n\n Is that your logic? Does the phrase, \"crime of opportunity\" ring a bell?\n \nYup, if their gonna take them there gone.Course they gotta get by the dogs.\n\n \nBG checks themselves will not prevent straw purchases. True enough. \n For that we'll need yet other regulations. Mandatory theft reporting for instance.\n\n Sorry no more laws are needed,it would seem by this time they would really have\n to be using their imaginations(they are).\n As far as mandatory theft reporting go's I would think most people would for insurance reasons if nothing else or just to cover their a##.emoticon_idea", 
   {}, 
   401338, 
   null, 
   1273698540.0
  ], 
  [
   401382, 
   null, 
   "NATO 556", 
   "Have an example of a corrupt area of the U.S. government for me?\n\n \n Child protective services.\n \n Couple Sues Over Bath-time Photo Accusations - US - CBN News - Christian News 24-7 - CBN.com", 
   {}, 
   401366, 
   null, 
   1273699080.0
  ], 
  [
   401384, 
   null, 
   "sinjin", 
   "As far as mandatory theft reporting go's I would think most people would for insurance reasons if nothing else or just to cover their a##.emoticon_idea\nUnless they weren't actually stolen.", 
   {}, 
   401381, 
   null, 
   1273699320.0
  ], 
  [
   401385, 
   null, 
   "zsu2357", 
   "I have one simple proposal that I think would make a big difference:\n\n Now that is simple or Simon.Is that for real?\n \nHandguns should be one of the categories of firearms regulated by the National Firearms Act of 1934. Considering that the NFA was passed to regulate gangster type weapons and that handguns are used much more often in crime than other types of firearms, I think this is totally reasonable. For example, 7,795 out of 10,177 firearm murders were committed with handguns in 2006.\n Expanded Homicide Data Table 7 - Crime in the United States 2006\n\n Banned by NFA of1934 because gangsters used them?Guess baseball bats better be banned to.emoticon_xdonno", 
   {}, 
   401353, 
   null, 
   1273699440.0
  ], 
  [
   401386, 
   null, 
   "zsu2357", 
   "Taking \"part\" of a right is like taking \"part\" of a girl's virtue.\n \n Can't be done.\n\n \n sinjin: did you really think that one out good?not gonna go there.:xcensored\n LOLOLOLOLOLLOLOLOL", 
   {}, 
   401354, 
   null, 
   1273699740.0
  ], 
  [
   401444, 
   null, 
   "Doc Jones", 
   "Unless they weren't actually stolen.\n\n \n More proof you are a slimeball! I am tired of your smears. If people have to fear their exercise of an inalienable right they should be using the da** things already!!!!!!!!!!!!!!!\n \n You are bound and determined to portray any gun owner as a criminal.\n \n You are the actual seditionist who has already violated your oath you took in the NAVY. You aren't \"protecting This Constitution\", you are attacking it! That makes you an enemy.\n \n You overlook the fact that collecting insurance money under false pretenses is a crime but it is NOT A VIOLATION OF THE 2A. Your pitiful attempt to make gun owners total criminals is disgusting and character assasination. You deserve all the bad luck you get feller! Your abuse of the First Amendment is also noted!", 
   {}, 
   401384, 
   null, 
   1273750680.0
  ], 
  [
   401459, 
   null, 
   "Tither", 
   "  Public corruption is one of the FBI&#8217;s top investigative priorities \n Public corruption is one of the FBI&#8217;s top investigative priorities&#8212;behind only terrorism, espionage, and cyber crimes. Why? Because of its impact on our democracy and national security. Public corruption can affect everything from how well our borders are secured and our neighborhoods protected&#8230;to verdicts handed down in courts&#8230;to the quality of our roads and schools. And it takes a significant toll on our pocketbooks, too, siphoning off tax dollars. Learn more here about our national program and local investigations.\n\n \n   PUBLIC CORRUPTION -- Why It&#8217;s Our #1 Criminal Priority \n Question: Why is public corruption so high on the FBI&#8217;s list of investigative priorities? \n Answer: Because of its impact. Corrupt public officials undermine our country&#8217;s national security, our overall safety, the public trust, and confidence in the U.S. government, wasting billions of dollars along the way. This corruption can tarnish virtually every aspect of society. For example, a border official might take a bribe, knowingly or unknowingly letting in a truck containing weapons of mass destruction. Or corrupt state legislators could cast deciding votes on a bill providing funding or other benefits to a company for the wrong reasons. Or at the local level, a building inspector might be paid to overlook some bad wiring, which could cause a deadly fire down the road.\n \n Q: Can you describe the kinds of public corruption that the FBI investigates?\n A: It really runs the gamut. Bribery is the most common. But there&#8217;s also extortion, embezzlement, racketeering, kickbacks, and money laundering, as well as wire, mail, bank, and tax fraud. Right now, based on our intelligence on emerging trends, we are focused specifically on several major issues: corruption along our national borders; corrupt officials who take advantage of natural disasters or economic crises to divert some of the government&#8217;s aid into their own pockets; and a myriad of officials who may personally benefit from the economic stimulus funding.\n \n Q: Where do you find this corruption?\n A: Just about everywhere&#8212;at the federal, state, and local levels throughout the country. And I should point out, the vast majority of our country&#8217;s public officials are honest and work hard to improve the lives of the American people. But a small number make decisions for the wrong reasons&#8212;usually, to line their own pockets or those of friends and family. These people can be found&#8212;and have been found&#8212;in legislatures, courts, city halls, law enforcement departments, school and zoning boards, government agencies of all kinds (including those that regulate elections and transportation), and even companies that do business with government.\n\n \n   Economic Stimulus Fraud/Corruption \n The U.S. Government recently enacted various economic stimulus programs that are injecting vast amounts of funding into the national economy through localized spending. Unfortunately, valuable programs like these&#8212;including the American Recovery and Reinvestment Act, the Troubled Asset Relief Program, and the Neighborhood Stabilization Program&#8212;also create opportunities for corruption and fraud.\n Similar government fiscal spending responses to emergency situations, like Hurricane Katrina and the war on terrorism, have in the past resulted in numerous public corruption and government fraud investigations. To prevent and deter fraud from this latest spending, the FBI is working with its law enforcement partners to aggressively investigate allegations into the misuse of economic stimulus money.\n \n Examples of potential criminal acts include public officials using their position for personal gain, theft of government funds, extortion, contract bid-rigging, false appraisals, falsifying documents to qualify for funding, and contractor fraud. These criminal acts, especially when they are perpetrated by public officials, strike at the heart of government by eroding public confidence and undermining the strength of our democracy. And the investigation of public corruption is the FBI&#8217;s number one criminal investigative priority. It is also a mission for which the FBI is singularly situation: we have the skills and experience necessary to conduct undercover operations and court-authorized electronic surveillance.\n\n   Federal Election Crimes \n In democratic societies like the United States, the voting process is a means by which citizens hold their government accountable, conflicts are channeled into resolutions, and power transfers peacefully. Our system of representative government works only when honest ballots are not diluted by fraudulent ballots. When elections become corrupted, democracy becomes threatened.\n The FBI has a limited role in ensuring fair and free elections in the United States. Election crimes become federal cases when: \n · The ballot includes one or more federal candidates; \n · The crime involves an election official abusing his duties; \n · The crime pertains to fraudulent voter registration; \n · Voters are not U.S. citizens. \n Federal election crimes fall into three broad categories: \n 1. Campaign finance crimes\n 2. Voter/ballot fraud \n 3. Civil rights violations \n \n \n   MASSIVE CORRUPTION BUST Mayors, Rabbis, Politicians, and More  \n \n   COMBATING BORDER CORRUPTION -- Locally and Nationally  \n Imagine a U.S. border guard on the take waving through a truck filled with weapons, drugs, explosives, or even a dirty bomb.\n It&#8217;s that kind of scenario that keeps the FBI very focused on weeding out the occasional dishonest government official who accepts bribes to allow people or contraband into this country illegally.\n &#8230;.. &#8220;While it&#8217;s true that the most common acts of border corruption involve drug trafficking and human smuggling, a single incident of the wrong person getting into the country could result in a catastrophe.&#8221;\n\n \n   ABUSE OF TRUST The Case of the Crooked Border Official \n How it began\n In late 2004, Immigration and Customs Enforcement (ICE) contacted our field office in El Paso, Texas. One of their informants reported that Crispin was allowing shipments of illegal drugs into the U.S. through her border post in El Paso. \n Building the case\n Together with our partner agencies&#8212;ICE, the Department of Homeland Security&#8217;s Inspector General, Customs and Border Protection, and the Drug Enforcement Administration&#8212;we began surveilling Crispin. We learned that not long after she was hired, Crispin&#8212;who lived meagerly in El Paso&#8212;acquired two expensive homes in Mexico, along with several luxury vehicles, but she attempted to cover her tracks with straw buyers. We also discovered that she socialized with known drug traffickers. \n\n \n Oil for food. Un Corruption. \n \n   Video from the CATO Institute. Washington is riddled with corruption, much of which actually is legal. The politicians and other insiders claim...\n \n  Abscam in the 80's \n \n That congressman who got caught with 50 thousand dollars in his freezer. The Arizona Savings and Loan kickbacks\n Obama's seat up for sale in Illinois.\n Just to name a few more.", 
   {}, 
   401444, 
   null, 
   1273758120.0
  ], 
  [
   401480, 
   null, 
   "sinjin", 
   "sinjin: did you really think that one out good?not gonna go there.:xcensored\n LOLOLOLOLOLLOLOLOL\n\n \n vir·tue -noun\n \n 1. moral excellence; goodness; righteousness. \n \n 2. conformity of one's life and conduct to moral and ethical principles; uprightness; rectitude. \n \n 3. chastity; virginity: to lose one's virtue. \n \n sinjin - Yes, I believe I did.", 
   {
    "unicode_changes_made": true
   }, 
   401386, 
   null, 
   1273768740.0
  ], 
  [
   401487, 
   null, 
   "Doc Jones", 
   "vir·tue -noun\n \n 1. moral excellence; goodness; righteousness. \n \n 2. conformity of one's life and conduct to moral and ethical principles; uprightness; rectitude. \n \n 3. chastity; virginity: to lose one's virtue. \n \n sinjin - Yes, I believe I did.\n\n \n 2. conformity of one's life and conduct to moral and ethical principles; uprightness; rectitude.\n \n Nope, I reckon you didn't.", 
   {
    "unicode_changes_made": true
   }, 
   401480, 
   null, 
   1273771380.0
  ], 
  [
   401499, 
   null, 
   "zsu2357", 
   "Unless they weren't actually stolen.\n\n \n O.K. so that could be a problem,not mine maybe yours because if I want to sell something I sell it I just make sure I have bills of sales,you know names, dates,\n serial numbers stuff like that...no problemo.", 
   {}, 
   401384, 
   null, 
   1273776300.0
  ], 
  [
   401503, 
   null, 
   "sinjin", 
   "O.K. so that could be a problem,not mine maybe yours because if I want to sell something I sell it I just make sure I have bills of sales,you know names, dates,\n serial numbers stuff like that...no problemo.\nMy point was that while a law-abiding gun owner would naturally report a theft, if for no other reason than for insurance claim purposes, a straw purchaser would likely not. First, it would be a false report, making the requirement to file self-incriminating. They could use that as a defense why they didn't file. But that would require them to admit that the firearms weren't stolen in the first place. \n \n The absence of a theft report for a firearm recovered by police would at least alert LE that something needs to be investigated. \n Of course, not knowing who actually owned the weapon last would present a problem. Hence my support for NICS checks for all transfers of ownership and records kept with the FFL.", 
   {}, 
   401499, 
   null, 
   1273778280.0
  ], 
  [
   401603, 
   null, 
   "Doc Jones", 
   "My point was that while a law-abiding gun owner would naturally report a theft, if for no other reason than for insurance claim purposes, a straw purchaser would likely not. First, it would be a false report, making the requirement to file self-incriminating. They could use that as a defense why they didn't file. But that would require them to admit that the firearms weren't stolen in the first place. \n \n The absence of a theft report for a firearm recovered by police would at least alert LE that something needs to be investigated. \n Of course, not knowing who actually owned the weapon last would present a problem. Hence my support for NICS checks for all transfers of ownership and records kept with the FFL.\n\n \n Bryan has already visited this claim of yours twice. Nothing seems to sink in with you does it? :) Why don't you tell the nice folks the elements needed to prove a 'crime' in a court of law. You will answer your own question.", 
   {}, 
   401503, 
   null, 
   1273832580.0
  ], 
  [
   401620, 
   null, 
   "Tither", 
   "Have an example of a corrupt area of the U.S. government for me?\n\n I am not totally addressing this to just you Sinjin, but it is your question that started me thinking about this. I have been thinking about this for a while, and I have one more concern. I just can't get this one off my mind. We tend to think of corruption as only financial. However, there is a different kind of corruption that we are experiencing. \n \n If one likes big government, a Nanny state, and Big spending, one is probably very happy like a bug in a rug. However if you were one of the millions of Americans who specifically told your Congressional critters to knock it off, (Tarp, Health care, Bailouts, Cap and Trade, Stimulus, all increasing the deficit to unsustainable levels etc.) you probably believe that We the People lost control of Congress, and the country is pretty much being run by the two Parties Leadership. Note that I am saying that We the People threw out the Republicans, before we WILL through out the Dems as well.\n \n That is very real corruption. Constitutional Corruption. We need to get back to our Founding Principles, where elected officials owe their entire allegiance to the voting public. \n \n Now one can spin this anyway they want, but voted dissatisfaction is an ever present reality! They seem not to be swayed by either party's spin! \n \n However, one thing is very clear, unless one decides to fix elections, you need us to vote for you. That is where you politicians are toast!", 
   {}, 
   401366, 
   null, 
   1273845420.0
  ], 
  [
   401622, 
   null, 
   "sinjin", 
   "Try as we might, politics draws a certain sort.\n \n Most people railing against government don't grasp how it works in the first place.\n I think we all are guilty of this, myself included.\n \n Difficult to be pro_business but anti-PAC in American politics.\n \n I believe financial corruption in government to be relatively rare. \n Now legal, pork-belly type \"corruption\" in government? \n Common as dirt. That's business as usual. SOP. The American way. \n And it drives politics.\n \n Furthermore, as long as we elect the way we do, \"winner take all\" by district, \n the two parties will maintain a stranglehold on the process.", 
   {}, 
   401620, 
   null, 
   1273847880.0
  ], 
  [
   401670, 
   null, 
   "jim's trucking", 
   "Try as we might, politics draws a certain sort.\n \n Most people railing against government don't grasp how it works in the first place.\n I think we all are guilty of this, myself included.\n \n Difficult to be pro_business but anti-PAC in American politics.\n \n I believe financial corruption in government to be relatively rare. \n Now legal, pork-belly type \"corruption\" in government? \n Common as dirt. That's business as usual. SOP. The American way. \n And it drives politics.\n \n Furthermore, as long as we elect the way we do, \"winner take all\" by district, \n the two parties will maintain a stranglehold on the process.\nSurely, you jest!", 
   {}, 
   401622, 
   null, 
   1273881480.0
  ], 
  [
   401740, 
   null, 
   "sinjin", 
   "Surely, you jest!\nHow many people do we have in government that could take money and don't? Millions.", 
   {}, 
   401670, 
   null, 
   1273951560.0
  ], 
  [
   401901, 
   null, 
   "Doc Jones", 
   "How many people do we have in government that could take money and don't? Millions.\n\n \n Got any examples? Surely among millions???? you can list several hundred.", 
   {}, 
   401740, 
   null, 
   1274018640.0
  ], 
  [
   402032, 
   null, 
   "Addison48", 
   "Just a quick question. To those of you who are strong advocates of gun control. In your opinion, what would be \"Sensible\" Gun control laws?\n\n \n Background checks, if you have ever been convicted of a crime involving a firearm or violence against another person you cant have a gun, I wouldnt mind requiring an hour long class on gun safety before you buy your first weapon either, fully automatics should be legal. There is more but right now I cant seem to think correctly so I will come back to this later.", 
   {}, 
   401225, 
   null, 
   1274061240.0
  ], 
  [
   402097, 
   null, 
   "Doc Jones", 
   "Old Doc views crime as a pathogen. Pathogens need be treated with the strongest medicine available. Criminals should receive an injection each time there is a flareup and it needs to be repeated judiciously until the disease is stamped out.\n \n I suggest citizens should carry their own medicine and provide treatment for the infection where ever it is found and as often as needed until this virus is contained. \n \n Now, take two asprin and call me in the morning otherwise use the prescription available and immunize your self as the founders intended to ward off dangerous disease.", 
   {}, 
   402032, 
   null, 
   1274106300.0
  ], 
  [
   402103, 
   null, 
   "Winston Smith", 
   "what about sychopants? emoticon_confused", 
   {}, 
   402097, 
   null, 
   1274108400.0
  ], 
  [
   402104, 
   null, 
   "Winston Smith", 
   "Background checks, if you have ever been convicted of a crime involving a firearm or violence against another person you cant have a gun, I wouldnt mind requiring an hour long class on gun safety before you buy your first weapon either, fully automatics should be legal. There is more but right now I cant seem to think correctly so I will come back to this later.\n\n \n the later the better, it seems to me :)", 
   {}, 
   402032, 
   null, 
   1274108520.0
  ], 
  [
   402178, 
   null, 
   "zsu2357", 
   "the later the better, it seems to me :)\n\n \n Well you seem to use your head for something Addison48,unlike some we shall leave\n unnamed.\n By the way Whiny its later than you think. lol.emoticon_xangelemoticon_xkill", 
   {}, 
   402104, 
   null, 
   1274143440.0
  ], 
  [
   402190, 
   null, 
   "Addison48", 
   "the later the better, it seems to me :)\n\n \n Was this late enough for you?\n \n I dont believe you should have to apply for a gun license. You should be able to buy any legal weapon at age 18. All guns should be locked up if you are away from the house.", 
   {}, 
   402104, 
   null, 
   1274151960.0
  ], 
  [
   403359, 
   null, 
   "Brady", 
   "How about a sin tax of $100 each time you buy a gun and $10 each time you buy a bullet?\n Its fair because it would help pay for all the damage guns do to society. Rights come with responsibilities.", 
   {}, 
   402190, 
   null, 
   1275073080.0
  ], 
  [
   403360, 
   null, 
   "sarkar00ss405", 
   "Are u interested to buy any FORD car? \n please be free to contact me.\n As i will help u to get the car in the \n most competative rates(sarkar00ss405)", 
   {
    "post_info": {
     "post_title": "want to purchase any FORD CAR"
    }
   }, 
   401225, 
   null, 
   1275073260.0
  ], 
  [
   403362, 
   null, 
   "Doc Jones", 
   "How about a sin tax of $100 each time you buy a gun and $10 each time you buy a bullet?\n Its fair because it would help pay for all the damage guns do to society. Rights come with responsibilities.\n\n \n How about a sin tax of $100 dollars each time you log on and $10 dollars a word for each time you speak one?\n \n It's fair because it would help pay for all the lying propaganda damage you do to society. Rights come with responsibilities.\n \n On guns, no can do. SCOTUS has ruled many times that a right freely stated in the Constitution cannot be compelled to purchase a license nor a fee to exercise.\n \n NEXT!", 
   {}, 
   403359, 
   null, 
   1275076920.0
  ], 
  [
   403367, 
   null, 
   "jitobear", 
   "[*]Background checks - no selling to the bad guys.[*]Gun owner is legally responsible for any damage/injury/loss of life caused by a weapon he/she owns due to his/her negligence. (A minor blows his brains out because you keep your loaded weapon within reach, you get charged.)[*]No mandatory gun ownership", 
   {}, 
   403362, 
   null, 
   1275080940.0
  ], 
  [
   403369, 
   null, 
   "sinjin", 
   "How about a sin tax of $100 each time you buy a gun and $10 each time you buy a bullet?\n Its fair because it would help pay for all the damage guns do to society. Rights come with responsibilities.\nShould all drivers have to help pay for harm done by irresponsible drivers?", 
   {}, 
   403359, 
   null, 
   1275086040.0
  ], 
  [
   403372, 
   null, 
   "Doc Jones", 
   "I hope they are better than this List=1.\n \n \n[*]Background checks - no selling to the bad guys.\n\n \n How about the bad guys get felon or sex offender stamped on their I.D. such as DL and a sign put up over their house doors and license plate reads Felon 1,2,3 etc.? Whoops, court ruled couldn't do that.\n \n \n[*]Gun owner is legally responsible for any damage/injury/loss of life caused by a weapon he/she owns due to his/her negligence. (A minor blows his brains out because you keep your loaded weapon within reach, you get charged.)\n\n \n Already like that. What would you change?\n I suppose you would be against rewarding those folks for intervening in a robbery of your home or preventing thugs from killing you or your family? Why don't we have a reward system for these folks that take care of themselves and others? Let's set a price limit for every crime they prevent by use of a gun at their own risk.\n \n \n[*]No mandatory gun ownership\n\n \n Oh, heavens no. We wouldn't want you to actually mind your own business and protect yourself and family. Why the next thing you know you might be asked to actually defend your country and serve in the military who aren't getting the care and attention nor money they deserve. We sure wouldn't ask anyone to exercise all their rights. What you have is half open eyes and see only one side even though it has been beat to death on this board. We surely couldn't expect you to take responsibility for your life and family, that would just be asking too much and take up time you can gripe about the cops having NO DUTY TO DEFEND YOU. How long have you been suffering from 'hopolophobia'?", 
   {
    "post_info": {
     "post_title": "I just have to assume you have thought this out: List 1 seems like more coming?"
    }
   }, 
   403367, 
   null, 
   1275087480.0
  ], 
  [
   403428, 
   null, 
   "jitobear", 
   "I hope they are better than this List=1.\n How about the bad guys get felon or sex offender stamped on their I.D. such as DL and a sign put up over their house doors and license plate reads Felon 1,2,3 etc.? Whoops, court ruled couldn't do that.\n\n \n Interesting idea. Certainly would be quicker. What was the reason for the ruling against it?\n \n \nAlready like that. What would you change?\n I suppose you would be against rewarding those folks for intervening in a robbery of your home or preventing thugs from killing you or your family? Why don't we have a reward system for these folks that take care of themselves and others? Let's set a price limit for every crime they prevent by use of a gun at their own risk.\n\n \n Society does not reward us for good like that and you know it, but it is punitive against crime. Your right to own a gun does not supercede another's (an innocent) right to not be harmed or killed. Guns are a big deal. They can do a lot of damage. If you aren't willing to take FULL responsibility for a weapon you own, you are a poor gun owner.\n \n \nOh, heavens no. We wouldn't want you to actually mind your own business and protect yourself and family. Why the next thing you know you might be asked to actually defend your country and serve in the military who aren't getting the care and attention nor money they deserve. We sure wouldn't ask anyone to exercise all their rights. What you have is half open eyes and see only one side even though it has been beat to death on this board. We surely couldn't expect you to take responsibility for your life and family, that would just be asking too much and take up time you can gripe about the cops having NO DUTY TO DEFEND YOU. How long have you been suffering from 'hopolophobia'?\n\n \n You need to take this angst elsewhere. I FULLY support the constitution and your right to own and even carry a weapon. My son hunts and goes shooting often. There are a miriad of reasons a person may not wish to own a gun (religion, mental or physical issues that make owning one inpractical or even unwise, just don't want to). You want people to respect and support your freedom to own a weapon, but you deride those who choose not to? Hypocrite.\n \n I live in an inner city neighborhood and have for ten years. I have never felt that I needed to own a weapon. Although it is possible you could be in a situation where a gun could save your life. Its also possible it could get used against you or found and misused by a minor or his/her friends. In my situation it would more likely be stolen when I was at work than defend me when I am home. That or my nearly blind=a$$ would end up shotting my foot off....", 
   {}, 
   403372, 
   null, 
   1275192540.0
  ], 
  [
   403429, 
   null, 
   "NATO 556", 
   "I take a short vacation due to technical problems, and you come back with this kind of nonsense?\n \n \nHow about a sin tax of $100 each time you buy a gun and $10 each time you buy a bullet?\n\n \n How is it a sin to exercise your constitutional rights? Why should the law-abiding have to pay such a tax? Why not let the criminals pay the tax since they're the ones who break the law?\n \n \nIts fair because it would help pay for all the damage guns do to society. Rights come with responsibilities.\n\n \n Your idea of responsibilities is twisted. Why should anyone other than the criminals, be required to pay a tax for the actions of criminals?\n \n By your logic the public should be paying fines that the media outlet would face for lying.", 
   {}, 
   403359, 
   null, 
   1275196500.0
  ], 
  [
   403430, 
   null, 
   "NATO 556", 
   "Your right to own a gun does not supercede another's (an innocent) right to not be harmed or killed.\n\n \n Actually no such right exists, for you or anybody else. Not in the US Constitution, not in the UN Declaration of Human Rights.\n \n \nGuns are a big deal. They can do a lot of damage.\n\n \n So what?\n \n \nIf you aren't willing to take FULL responsibility for a weapon you own, you are a poor gun owner.\n\n \n And what exactly is your idea of \"full responsibility\"?\n \n \nYou want people to respect and support your freedom to own a weapon, but you deride those who choose not to? Hypocrite.\n\n \n Just like gay people demand we respect their way of life, but they don't want to show respect for our way or life.\n \n Or the mexican students that got offended by the five who wore the American flag to school on Cinco de Mayo.\n \n \nIts also possible it could get used against you\n\n \n This is one of the biggest BS excuses anybody has ever uttered. \"If you carry a gun the criminal could take it away from you and use it against you instead.\" HTF is that gonna happen? Who the hell it going to let a dangerous individual get close enough to them that they could actually pull the gun right out of their hands after it's been drawn? And how's the criminal gonna know who's carrying when it's concealed?\n \n \nor found and misused by a minor or his/her friends.\n\n \n Not a good enough excuse. If you have kids of your own then you raise them to not be awed and mystified by a gun being in the house. And if you're talking about neighbor kids, then what you're describing would be the actions of criminals.", 
   {}, 
   403428, 
   null, 
   1275197880.0
  ], 
  [
   403445, 
   null, 
   "jitobear", 
   "Actually no such right exists, for you or anybody else. Not in the US Constitution, not in the UN Declaration of Human Rights.\n\n \n Really? Why don't you go out and start randomly hurting and killing people and see how far that argument gets you in court.\n \n \nSo what?\n And what exactly is your idea of \"full responsibility\"?\n\n \n Why is it that so many gun ownership advocates seem to be the last people I would want to see owning a gun? The world is not a Hollywood film or a video game. If you can't figure out why it is a big deal that guns can cause a lot of damage and need to be handled be responsibly, then frankly, in my opinion, you should not own one. (Granted I would not deny you the right. As I stated earlier, I support people's constitutional right to own a weapon.)\n \n Full responsibility means a dead two year old due to your loaded gun being left around unmonitored is a crime and you bear the criminal responsibility of that death. \n \n \nJust like gay people demand we respect their way of life, but they don't want to show respect for our way or life.\n\n \n Really? I challenge you to find a single initiative by gay people asking you to change your way of life. To marry someone of same sex or stay single. To have your consentual adult sexual activity criminalized. To have parenthood, housing or jobs be denied you due to your sexual orientation.\n \n Not being able to force your way of life on others does not mean you are denied it yourself.\n \n \nOr the mexican students that got offended by the five who wore the American flag to school on Cinco de Mayo.\n\n \n This is not relevant to the debate at all. I shall not indulge your racism. Its not worth one iota of energy.\n \n \nThis is one of the biggest BS excuses anybody has ever uttered. \"If you carry a gun the criminal could take it away from you and use it against you instead.\" HTF is that gonna happen? Who the hell it going to let a dangerous individual get close enough to them that they could actually pull the gun right out of their hands after it's been drawn? And how's the criminal gonna know who's carrying when it's concealed?\n\n \n Its not BS. Stats prove it out. People are hurt and killed by their own weapons. It happens. Not necesarily by stranger, it could be your angry spouse. I am not saying that you can not or should not own a gun because of this, I am just saying it happens.\n \n \nNot a good enough excuse. If you have kids of your own then you raise them to not be awed and mystified by a gun being in the house. And if you're talking about neighbor kids, then what you're describing would be the actions of criminals.\n\n \n Of course. But children, especially small ones, do not have the comprehension skills or impulse control to simply be trusted around weapons without supervision. If you can't comprehend that, not only are you a poor gun owner, you are a poor excuse for a parent.\n \n Gun ownership comes with responsibilities. You can not and should not be allowed to go willfully and irresponsibly packing heat anymore than you can get loaded on a 12 pack of beer then go flying down the freeway at 90MPH.", 
   {}, 
   403430, 
   null, 
   1275230040.0
  ], 
  [
   403446, 
   null, 
   "Tither", 
   "jitobear\n Doc was being sarcastic in his responses to your idea of what our Freedoms should be. He is saying that the police do not have the responsibility to protect you as an individual. Just the community at large. In the end it may end up to be your responsibility to protect yourself and your loved ones. \n \n If you do not want to own a gun that is your decision. He is not calling you a hypocrite for that. \n \n The court rulings show how much Constitutional protection MUST be given to criminals, and therefore our Constitutional protections are equally as strong. \n \n The philosophy of our Constitution is that we are all born with certain Inalienable Rights that exist beyond the preview of government. And in fact, governments are instituted to protect those rights. Society and governments can limit those rights to the extent that the infringements they seek are specifically targeted to meet an overwhelming need, and specifically tailored to meet a minimum standard. In other words, you are not allowed to have all of the gun control you want. Just the bare minimum. \n \n Doc thinks what you ask for is far beyond the minimum standards for an Inalienable, and therefore recognized by our Constitution as protected from infringements, Right.", 
   {}, 
   403428, 
   null, 
   1275230940.0
  ], 
  [
   403453, 
   null, 
   "NATO 556", 
   "Really? Why don't you go out and start randomly hurting and killing people and see how far that argument gets you in court.\n\n \n Because there's a vast difference between something that's the law, and something that's a right.\n \n And in case you hadn't noticed, the application of rights only applies when the government is involved. The Supreme Court has determined that your rights aren't violated by a private party, they can only be violated by the government or one of its entities.\n \n \nWhy is it that so many gun ownership advocates seem to be the last people I would want to see owning a gun? The world is not a Hollywood film or a video game. If you can't figure out why it is a big deal that guns can cause a lot of damage and need to be handled be responsibly, then frankly, in my opinion, you should not own one.\n\n \n Well fortunately you're not the one in charge and making these decisions. Last I checked the world wasn't a nice place, and there was no guarantee that your life was going to be neutral or moderate, or free from unpleasant and downright dangerous things. There's no ground to argue that the Constitution only protects things that can't ever cause harm to someone.\n \n \nFull responsibility means a dead two year old due to your loaded gun being left around unmonitored is a crime and you bear the criminal responsibility of that death.\n\n \n And if said two year old is killed in the commission of pulling on the cord of an unattended iron and it falls on their head, should the owner of the iron bear criminal responsibility of that death as well?\n \n \nReally? I challenge you to find a single initiative by gay people asking you to change your way of life. To marry someone of same sex or stay single. To have your consentual adult sexual activity criminalized. To have parenthood, housing or jobs be denied you due to your sexual orientation.\n\n \n http://www.4forums.com/political/gay-rights-debates/14267-dc-mayor-pfox.html\n \n \nThis is not relevant to the debate at all. I shall not indulge your racism. Its not worth one iota of energy.\n\n \n And the thing about gays somehow is relevant?\n \n \nIts not BS. Stats prove it out. People are hurt and killed by their own weapons. It happens.\n\n \n No they don't, otherwise you'd have some actual evidence of a person, such as a woman with a concealed carry permit, having her gun taken right out of her hands, and being shot with it by the person who intended to mug her, thus warranting her to pull it on him.\n \n \nNot necesarily by stranger, it could be your angry spouse. I am not saying that you can not or should not own a gun because of this, I am just saying it happens.\n\n \n Such examples aren't a good enough excuse to suggest it'd be better to not be armed. If anything it's all the better to be armed.\n \n \nOf course. But children, especially small ones, do not have the comprehension skills or impulse control to simply be trusted around weapons without supervision. If you can't comprehend that, not only are you a poor gun owner, you are a poor excuse for a parent.\n\n \n If you can't teach your children to actually behave and obey, then you're the one that's a bad parent. If they don't want to learn, discipline them until they do.\n \n \nGun ownership comes with responsibilities. You can not and should not be allowed to go willfully and irresponsibly packing heat anymore than you can get loaded on a 12 pack of beer then go flying down the freeway at 90MPH.\n\n \n Owning a gun isn't willful irresponsibility. Neither is choosing to not own a solid steel locking safe, or gun locks that serve absolutely no point. Those that choose to not teach their children to be careful and responsible are the ones that should be punished for their actions.\n \n You wouldn't make the decision to not teach your children about the traffic light system, then there's no excuse for teaching them to avoid things that aren't toys.", 
   {}, 
   403445, 
   null, 
   1275244860.0
  ], 
  [
   403455, 
   null, 
   "Tither", 
   "Why is it that so many gun ownership advocates seem to be the last people I would want to see owning a gun? \n\n And yet you said you believed in the Constitution. Humm.\n \n Just ONE person plus The Constitution equals an unconquerable, undeniable Super Majority! That is the difference between a Democracy and a Republic. It is the Rule of Law! In a Democracy 50% plus one person can decide to kill you and take everything you and your family has. Drastic example but an accurate one. In A Republic EVERYONE MUST obey the law! The President, Congress Cops and Citizens! We are all the same under the Constitution and the laws of this great Nation! \n \n Makes one wonder what other Constitutionally Recognized as Inalienable, therefor protected Rights you and others would deny other Americans, if they only could! It makes one grateful that our Founding Fathers immortalized these Rights into our Constitution's Bill of Rights!", 
   {}, 
   403445, 
   null, 
   1275247740.0
  ], 
  [
   403489, 
   null, 
   "Galileo", 
   "James Madison said, \"If men were angels, no government would be necessary. If angels were to govern men, neither external nor internal controls on government would be necessary.\"\n \n Government is necessary to stop people from violating the rights of each other. This wouldn't be necessary if men were angels but that obviously isn't the case. Gun control is justified because it's one of the ways that can government can protect the rights of people. Gun control is necessary because gun owners, being men, are not angels. Of course, people in government are not angels either so there must be checks and balances in government to deal with abusive people in positions of power.", 
   {}, 
   403455, 
   null, 
   1275285240.0
  ], 
  [
   403490, 
   null, 
   "NATO 556", 
   "Government is necessary to stop people from violating the rights of each other.\n\n \n Wrong. The job of the government isn't to stop people from violating the rights of others. Even if it were, the government itself is busy violating our rights. \n \n The three duties of government: 1. Protect property 2. preserve contracts 3. provide for the rule of law. Nowhere in there, is there anything about keeping a person from violating the rights of their neighbor.\n \n \nThis wouldn't be necessary if men were angels but that obviously isn't the case.\n\n \n Government hardly qualifies as an angel.\n \n \nGun control is justified because it's one of the ways that can government can protect the rights of people. Gun control is necessary because gun owners, being men, are not angels. Of course, people in government are not angels either so there must be checks and balances in government to deal with abusive people in positions of power.\n\n \n The Supreme Court has said no to this statement. Gun control isn't justified when it infringes on the rights of the people to actually exercise their rights.\n \n DC tried to justify their gun ban with a similar argument, the Supreme Court shot them down and left no wiggle room for them. They lost the argument, you lost the argument. Pack up and move on.", 
   {}, 
   403489, 
   null, 
   1275285900.0
  ], 
  [
   403534, 
   null, 
   "Tither", 
   " Gun control is justified because it's one of the ways that can government can protect the rights of people. Gun control is necessary because gun owners, being men, are not angels. Of course, people in government are not angels either so there must be checks and balances in government to deal with abusive people in positions of power.\n\n \n A loose translation of 1 Timothy 1:9. Laws are made to restrain the wicked, and evil. \n \n Not to restrain the law-abiding and the Righteous!", 
   {}, 
   403489, 
   null, 
   1275332640.0
  ], 
  [
   403580, 
   null, 
   "jitobear", 
   "And yet you said you believed in the Constitution. Humm.\n \n Just ONE person plus The Constitution equals an unconquerable, undeniable Super Majority! That is the difference between a Democracy and a Republic. It is the Rule of Law! In a Democracy 50% plus one person can decide to kill you and take everything you and your family has. Drastic example but an accurate one. In A Republic EVERYONE MUST obey the law! The President, Congress Cops and Citizens! We are all the same under the Constitution and the laws of this great Nation! \n \n Makes one wonder what other Constitutionally Recognized as Inalienable, therefor protected Rights you and others would deny other Americans, if they only could! It makes one grateful that our Founding Fathers immortalized these Rights into our Constitution's Bill of Rights!\n\n \n How many times do I need to say I support people's right to own/carry a weapon? You boys all too busy looking at your big guns to read properly?\n \n I fully admit I would rather irreponsible, trigger happy fools did not own weapons. I also would rather not see Jack Nicolson walking down the street in women's lingerie. Doesn't mean I am going to make attempts to stop either.", 
   {}, 
   403455, 
   null, 
   1275364920.0
  ], 
  [
   403581, 
   null, 
   "jitobear", 
   "Because there's a vast difference between something that's the law, and something that's a right.\n \n And in case you hadn't noticed, the application of rights only applies when the government is involved. The Supreme Court has determined that your rights aren't violated by a private party, they can only be violated by the government or one of its entities.\n\n \n You want to split hairs - fine. Your right to own a gun does not automatically trump laws that protect the lives of innocent citizens who are not a threat to you.\n \n \nWell fortunately you're not the one in charge and making these decisions. Last I checked the world wasn't a nice place, and there was no guarantee that your life was going to be neutral or moderate, or free from unpleasant and downright dangerous things. There's no ground to argue that the Constitution only protects things that can't ever cause harm to someone.\n\n \n I never said otherwise. But if one can not comprehend why the destruction done by guns is a big deal and that they need to be responsible with their weapon, not only are they a poor gun owner, they are bleedin' stupid.\n \n \nAnd if said two year old is killed in the commission of pulling on the cord of an unattended iron and it falls on their head, should the owner of the iron bear criminal responsibility of that death as well?\n\n \n Yes. If someone, in partcular a child, dies due to someone else's willful negligence it is/should be a manslaughter charge. A woman here a couple of years ago put her baby in the tub and walked away for a half hour of internet searching and her baby drown. That woman is now in prison.\n \n \nhttp://www.4forums.com/political/gay-rights-debates/14267-dc-mayor-pfox.html\n\n \n This is not an example. I asked for examples of where heterosexuals were being denied jobs, the right to marry etc. due to their sexual orientation. This thread is an argument about ex-gay therapy.\n \n \nAnd the thing about gays somehow is relevant?\n\n \n Probably not. \n \n \nNo they don't, otherwise you'd have some actual evidence of a person, such as a woman with a concealed carry permit, having her gun taken right out of her hands, and being shot with it by the person who intended to mug her, thus warranting her to pull it on him.\n\n \n Really? You don't believe people are injured by their own guns or guns in their homes? Due a google search of \"man shoots wife\" or \"boy shot by brother\". Below are the first page of a couple of google searches. Also, I never made any specific claims about a perp manhandling the weapon from you, you did. But as to your claim I found TWO stories of police officers who were shot with their own weapons after perps wrestled them away - and the police are far better trained in these matter than the average Joe. Certainly more so than me. \n \n man shoots wife - Google Search\n \n boy shot by brother - Google Search\n \n New Orleans Female Police Officer Killed With Own Gun While Arresting Rape Suspect - Local News | News Articles | National News | US News - FOXNews.com\n North Kingstown Police Officer Shot l WPRI.com\n \n \nSuch examples aren't a good enough excuse to suggest it'd be better to not be armed. If anything it's all the better to be armed.\n\n \n If that is what you believe after weighing the pros and cons, then fine. Allow me the same liberty. \n \n \nIf you can't teach your children to actually behave and obey, then you're the one that's a bad parent. If they don't want to learn, discipline them until they do.\n\n \n Have you ever raised children? Teaching and discipline is no guarantee of anything. Kids do stupid stuff all the time. Babies and toddlers are too young to understand. And teens are defiant, emotional roller-coasters. Ever heard of Columbine? Shall I find the stats on teen age suicide for you? If you are a gun-owner it is assumed that you are responsible grown-up. Act like one. Leaving a loaded weapon where a child can access it is risky, stupid parenting - and frankly negates the argument that you own the thing to \"protect your family\". Gun injury is one the leading causes of wrongful death in children (accidental, homocide, suicide). The stats are alarming. Keep guns away from kids.\n \n About Page\n \n \nOwning a gun isn't willful irresponsibility. \n\n \n No it isn't, but just trusting kids will have the brains, understanding, emotional maturity and impulse control to be trusted with them is.\n \n \nNeither is choosing to not own a solid steel locking safe, or gun locks that serve absolutely no point. Those that choose to not teach their children to be careful and responsible are the ones that should be punished for their actions.\n\n \n My brother is a former cop and currently does security work for the federal government. He owns a couple of hand-guns and uses them at work. His children are well schooled on gun safety and that they are not allowed to touch his guns. Ever. He also knows the reality of things and his guns are locked up when not on him. \n \n I told him about this debate, he agrees with me. Having your gun where kids can access it is irresponsible, and in many states illegal.\n \n \nYou wouldn't make the decision to not teach your children about the traffic light system, then there's no excuse for teaching them to avoid things that aren't toys.\n\n \n Of course every gun owner should teach their child about gun safety. But that does not mean you allow them access to weapons.\n \n When I was a child an aquaintance of our family had three year relative who blew his own brains out because his sorry-a$$ excuse for a daddy though it was safe to leave a loaded gun under his pillow and then take a nap.\n \n Maybe I should add IQ test as a prerequisite to gun ownership.......", 
   {}, 
   403453, 
   null, 
   1275367620.0
  ], 
  [
   403595, 
   null, 
   "Doc Jones", 
   "I sure enjoyed a nice Memorial Day weekend celebrating our soldiers who died not only fighting for our rights but for those in foreign lands. It was an honor and priviledge to be present and also to be surrounded by family.\n \n I see the fanatics are still busy trying to come up with excuses on this board here why the 2A should not be treated as any other right and to find ways to diminish that right if at all possible. A true American would be proud of their rights and freedoms and would understand that political ideas and speech leading to dictatorships have led to democide which has been the largest killer of all throughout history. I find it inexcusable for a man to not \"bring up a child in the way he should go\". From some of the comments on this board you would think 'suckling babes' were using firearms as pacifiers. It is a pitiful thing when a full grown man has to resort to the lowest common denominator such as himself as a measure of logic or interpretation of the BOR and the CONSTITUTION.\n \n \nYou want to split hairs - fine. Your right to own a gun does not automatically trump laws that protect the lives of innocent citizens who are not a threat to you.\n\n \n modus poens\n \n \nI never said otherwise. But if one can not comprehend why the destruction done by guns is a big deal and that they need to be responsible with their weapon, not only are they a poor gun owner, they are bleedin' stupid.\n\n \n Childish rant! I can see slobbering/wild eyes as he types. Hey Jack, do you know how many people are armed in the U.S. and are carrying their guns each day...around you? You sure are calling a lot of people names which belies the attempted claims you make. That is a sure sign of a poor upbringing and doesn't speak well for your parents. Didn't you learn long ago not to call people names or you would get your *** whipped? Should have been repeated by your parents when you got home but that is actually proof of irresponsibility. You are what you eat emoticon_frazzled\n \n \nYes. If someone, in partcular a child, dies due to someone else's willful negligence it is/should be a manslaughter charge. A woman here a couple of years ago put her baby in the tub and walked away for a half hour of internet searching and her baby drown. That woman is now in prison.\n\n \n What the &&& does this have to do with the topic? It is well known that drowning in 5 gallon buckets is a leading cause of children deaths. Drowning, not guns! Firearms are FAR down the list so there is plenty you should be ranting about but you got a hard on for the 2A?\n \n [STRIKE]This is not an example. I asked for examples of where heterosexuals were being denied jobs, the right to marry etc. due to their sexual orientation.[/STRIKE] \nThis thread is an argument about ex-gay therapy.\n\n \n No it is not! Go back and read the topic! You are so desperate you will jump to anything to try to salvage defeat from the jaws of victory.\n \n \nProbably not.\n \n \n You know it is not! You are rambling all over the place in search of support for the sublime to the ridiculous.\n \n \nReally? You don't believe people are injured by their own guns or guns in their homes? Due a google search of \"man shoots wife\" or \"boy shot by brother\". Below are the first page of a couple of google searches. Also, I never made any specific claims about a perp manhandling the weapon from you, you did. But as to your claim I found TWO stories of police officers who were shot with their own weapons after perps wrestled them away - and the police are far better trained in these matter than the average Joe. Certainly more so than me.\n\n \n It would have been so simple to introduce the Kelleman study of the debunked claims in it like 43:1. You are beating yourself up here. \n \n man shoots wife - Google Search\n \n boy shot by brother - Google Search\n \n New Orleans Female Police Officer Killed With Own Gun While Arresting Rape Suspect - Local News | News Articles | National News | US News - FOXNews.com\n North Kingstown Police Officer Shot l WPRI.com\n \n \n \n \nIf that is what you believe after weighing the pros and cons, then fine. Allow me the same liberty.\n \n \n It doesn't appear that anyone is keeping you from anything; on the other hand, it doesn't appear anyone agrees with you :)\n \n \nHave you ever raised children? Teaching and discipline is no guarantee of anything. Kids do stupid stuff all the time. Babies and toddlers are too young to understand. And teens are defiant, emotional roller-coasters.\n \n \n And some apparently never outgrow it. Like yourself for example. OTH, some \"children\" as young as 16 have fought in wars. children as young as 9 take hunter safety and hunt. 18 year olds become cops and soldiers and carry and use guns. Your point?\n \n \nEver heard of Columbine? Shall I find the stats on teen age suicide for you? If you are a gun-owner it is assumed that you are responsible grown-up. Act like one. Leaving a loaded weapon where a child can access it is risky, stupid parenting - and frankly negates the argument that you own the thing to \"protect your family\". Gun injury is one the leading causes of wrongful death in children (accidental, homocide, suicide). The stats are alarming. Keep guns away from kids.\n\n \n There you go again, standing on the stump talking down to people who know more than you...again.\n \n Tither has posted the accident/death models many times and you still want to move \"gun injury\" to the top of your list despite being WRONG.\n I don't have to provide you with a reason to own a gun, it is a RIGHT. You can find it in the BOR, Second Amendment. I think you chose the wrong model to base your arguement on and now you are desperate to be relieved of the burden of proving yourself right. Next time devote a bit more time and responsibility BEFORE you abuse the 1A. emoticon_xbouncer\n \n About Page\n \n \n \n No it isn't, but just trusting kids will have the brains, understanding, emotional maturity and impulse control to be trusted with them is.\n \n \n \n My brother is a former cop and currently does security work for the federal government. He owns a couple of hand-guns and uses them at work. His children are well schooled on gun safety and that they are not allowed to touch his guns. Ever. He also knows the reality of things and his guns are locked up when not on him. \n \n I told him about this debate, he agrees with me. Having your gun where kids can access it is irresponsible, and in many states illegal.\n \n \n \n Of course every gun owner should teach their child about gun safety. But that does not mean you allow them access to weapons.\n \n When I was a child an aquaintance of our family had three year relative who blew his own brains out because his sorry-a$$ excuse for a daddy though it was safe to leave a loaded gun under his pillow and then take a nap.\n \n Maybe I should add IQ test as a prerequisite to gun ownership.......[/QUOTE]", 
   {}, 
   403581, 
   null, 
   1275399420.0
  ], 
  [
   403600, 
   null, 
   "Doc Jones", 
   "About Page\n \n \n \n No it isn't, but just trusting kids will have the brains, understanding, emotional maturity and impulse control to be trusted with them is.\n\n \n Non sense! Most do, maybe you were an exception :)\n \n \nMy brother is a former cop and currently does security work for the federal government. He owns a couple of hand-guns and uses them at work. His children are well schooled on gun safety and that they are not allowed to touch his guns. Ever. He also knows the reality of things and his guns are locked up when not on him.\n\n \n Well that certainly is impressive :( Now explain exactly why this is so important to you and why you chose 'your brother' for a model. Is this your way of saying that 'the only ones' are entitled to exercise rights? I wouldn't call this an exercise of the 2A. More like a hired gun of the old West you so despise? \n \n \nI told him about this debate, he agrees with me. Having your gun where kids can access it is irresponsible, and in many states illegal.\n\n \n You are mixed up aren't you? You make the blanket claim that everyone but your brother (and you by default) leave their guns where kids can access them and are irresponsible and break State law. I would like to see you prove this assertion. Of course we know that badge toters are always experts, from the moment they pin one on and that is why we see so many of them shooting theirselves in the foot, rear ends and other places. You want to define your meaning of a 'kid'?\n \n \nOf course every gun owner should teach their child about gun safety. But that does not mean you allow them access to weapons.\n\n \n BS! A human being learns from both seeing, hearing and doing. That applies to everything. They should have supervised access when training. After that, you propose to put an age limit on responsibility? You jumped from 'kid' now to 'child'. Under brady definitions and other gun grabbers that would mean to 21 years old. \n \n \nWhen I was a child an aquaintance of our family had three year relative who blew his own brains out because his sorry-a$$ excuse for a daddy though it was safe to leave a loaded gun under his pillow and then take a nap.\n\n \n Yep, the old 'aquaintance' trick. Excuses you from having to prove anything except make a statement it happened and how. Got any more stories about how a friend of a friend who had told a friend who told you a story?\n \n \nMaybe I should add IQ test as a prerequisite to gun ownership.......\n\n \n Good idea. Let's make it a pre-requisite for posting on the board too. See we can apply it to all the BOR just to even things out. From what I have seen here on the board, you would be left out and unable to exercise any right.\n \n Yeah, you make all the rules for everyone and add anything you want and see how far you get. emoticon_xbye", 
   {
    "post_info": {
     "post_title": "Whoops, missed this part here and I don't want anyone to think I wrote this:"
    }
   }, 
   403595, 
   null, 
   1275401760.0
  ], 
  [
   403602, 
   null, 
   "Doc Jones", 
   "the situation the Israeli commandos got into onboard ships they were attempting to embargo and issued toy paint ball guns?\n \n That is the problem with perception and trying to play by someone else's rules.\n \n Taking a toy to a gun fight is not advisable. The only thing that saved them was the real pistols they had on their gear and had to ask permission to use it.\n \n Our wars overseas embody somewhat the same principles and restraint is sure to get some of our men to lose their life.", 
   {
    "post_info": {
     "post_title": "Did anyone notice:"
    }
   }, 
   403600, 
   null, 
   1275404700.0
  ], 
  [
   403609, 
   null, 
   "jitobear", 
   "I am going to try this one more time, and I will put it in great big letters in hopes that people will see it.\n \n I SUPPORT PEOPLE'S SECOND AMMENDMENT RIGHT TO OWN/CARRY A WEAPON.\n \n \nChildish rant! I can see slobbering/wild eyes as he types. Hey Jack, do you know how many people are armed in the U.S. and are carrying their guns each day...around you? You sure are calling a lot of people names which belies the attempted claims you make. \n\n \n No I am not. My arguments in all of these forums are about people who are IRRESPONSIBLE with their guns. I know lots of gun owners, and I even believe most are responsible (barring criminals who have guns), however there are some who are not and my condemnation of that irresponsibility stands.\n \n \nThat is a sure sign of a poor upbringing and doesn't speak well for your parents. Didn't you learn long ago not to call people names or you would get your *** whipped? Should have been repeated by your parents when you got home but that is actually proof of irresponsibility. You are what you eat emoticon_frazzled\n\n \n This whole paragragh is a lesson in hypocrisy. You condemn my insult of a hypothetical by insulting me and my family directly.\n \n \nWhat the &&& does this have to do with the topic? It is well known that drowning in 5 gallon buckets is a leading cause of children deaths. Drowning, not guns! Firearms are FAR down the list so there is plenty you should be ranting about but you got a hard on for the 2A?\n\n \n It was a parallel - an analogy. The point of this thread is what kind of laws should there be around gun ownershiip. In my opinion there are three - background checks (or some way to ensure you aren't selling to criminals), no mandatory gun ownership, gun owners should be accountable for damage done by their weapons due to their negligence. Leaving small children with unsupervised access to a weapon is negligence, the same way that leaving an infant alone in a tub of water is. The adult should be held accountable should the child be hurt. \n \n \n[STRIKE]This is not an example. I asked for examples of where heterosexuals were being denied jobs, the right to marry etc. due to their sexual orientation.[/STRIKE] \n \n No it is not! Go back and read the topic! You are so desperate you will jump to anything to try to salvage defeat from the jaws of victory.\n \n You know it is not! You are rambling all over the place in search of support for the sublime to the ridiculous.\n\n \n The post was about ex-gay therapy, and I did not bring up the topic, NATO did. And it is irrelevant here.\n \n \nIt would have been so simple to introduce the Kelleman study of the debunked claims in it like 43:1. You are beating yourself up here.\n \n \n I have not linked studies. They are news articles. You can't debunk them. They happened. \n \n People can and do get hurt by their own weapons. Its part of this debate because it is one of the reasons I choose not to own a gun myself. I also acknowledged that weapons also defend people. I have no problem with people carrying a weapon for their own protection, if they choose to.\n \n \nIt doesn't appear that anyone is keeping you from anything; on the other hand, it doesn't appear anyone agrees with you :)\n\n \n One of the things I got slammed for was \"no mandatory gun ownership\". There are places that have it. I don't agree with it. Thats not freedom, either. \n \n \nAnd some apparently never outgrow it. Like yourself for example. OTH, some \"children\" as young as 16 have fought in wars. children as young as 9 take hunter safety and hunt. 18 year olds become cops and soldiers and carry and use guns. Your point?\n\n \n Children like mine? My son has taken gun safety lessons, hunts and goes shooting. My point is that children/kids/teens do not have maturity to be given the same unfettered access to weapons as adults.\n \n Eighteen year olds are adults in the eyes of the law and not a child in my arguments.\n \n \nThere you go again, standing on the stump talking down to people who know more than you...again.\n\n \n This is not an argument, its an insult. \n \n \nTither has posted the accident/death models many times and you still want to move \"gun injury\" to the top of your list despite being WRONG.\n\n \n Its not my list. The stats quoted were from Childrens National Defense Organizations and Centers for Disease Control. And I am well aware that it is low on the list compared to auto accidents, falls, drownings. But it is still a problem. Too many kids are getting hurt with guns. None should be. I am sorry if its too much to ask ADULT gun owners to be careful with their guns when kids are around.\n \n \nI don't have to provide you with a reason to own a gun, it is a RIGHT. You can find it in the BOR, Second Amendment. I think you chose the wrong model to base your arguement on and now you are desperate to be relieved of the burden of proving yourself right. Next time devote a bit more time and responsibility BEFORE you abuse the 1A. emoticon_xbouncer\n\n \n See the big, bolded letters at the top and then take this rant to someone who actually disagrees with you.\n \n \nNon sense! Most do, maybe you were an exception :)\n\n \n Once again, not an argument.\n \n Children are not adults. There is a reason they have to live with grown ups, go to school, wait for specific ages to do things like drive, consume alcohol, work, operate heavy machinery, vote, own property, etc. A todler does not have the same reasoning skills and maturity as pre-schooler, a pre-schooler as a ten year old, a ten year old as a fifteen year old, a fifteen year old as an adult. This is medical fact, not nonsense.\n \n \nWell that certainly is impressive :( Now explain exactly why this is so important to you and why you chose 'your brother' for a model. Is this your way of saying that 'the only ones' are entitled to exercise rights? I wouldn't call this an exercise of the 2A. More like a hired gun of the old West you so despise? \n\n \n See big, bolded letters at the top.\n \n \nYou are mixed up aren't you? You make the blanket claim that everyone but your brother (and you by default) leave their guns where kids can access them and are irresponsible and break State law.\n \n \n I did no such thing. I said that doing so is irresponsible and illegal in some states. And for the record, I do not own a gun and do not want to. I am starting to suspect you have not read the entire history of these threads.\n \n \nI would like to see you prove this assertion. Of course we know that badge toters are always experts, from the moment they pin one on and that is why we see so many of them shooting theirselves in the foot, rear ends and other places. \n\n \n You do understand that they go through years of training to be a cop? I am not saying there are perfect or the only ones that can be trusted to act responsibly with guns - just that they have a particular and valid perspective of the issue. For starters they see the results of gun violence and domestic violence more than most.\n \n I did not peg you for one to insult those who serve.\n \n \nYou want to define your meaning of a 'kid'?\n\n \n Legal definition, under 18.\n \n \nBS! A human being learns from both seeing, hearing and doing. That applies to everything. They should have supervised access when training. After that, you propose to put an age limit on responsibility? You jumped from 'kid' now to 'child'. Under brady definitions and other gun grabbers that would mean to 21 years old. \n\n \n The bolded is the key word when it comes to guns and kids. See above for my definition of kid.\n \n \nYep, the old 'aquaintance' trick. Excuses you from having to prove anything except make a statement it happened and how. Got any more stories about how a friend of a friend who had told a friend who told you a story?\n\n \n How about three boys under fifteen being shot outside my home for being in the wrong place at the wrong time when a gang-banger came by with guns ablazing. I got to clean up the blood one of them left behind all over my yard.\n \n Bad things happen when bad or irresponsible people get their hands on guns. I am not saying that is justification for denying second ammendment rights, for I do not believe it is. But can't you enjoy your second ammendment right and still acknowledge these trajedies and support efforts to reduce or stop them?\n \n \nGood idea. Let's make it a pre-requisite for posting on the board too. See we can apply it to all the BOR just to even things out. From what I have seen here on the board, you would be left out and unable to exercise any right.\n\n \n First of all, it was a joke. Secondly, posting on this board does not potentially kill anyone. And finally, I fail to see how me not wanting to own a gun and wishing those who do to be responsible with them indicates a lack of intelligence on my part.\n \n \nYeah, you make all the rules for everyone and add anything you want and see how far you get. emoticon_xbye\n\n \n Once again, see the big bold letters at the top.", 
   {}, 
   403600, 
   null, 
   1275409200.0
  ], 
  [
   403617, 
   null, 
   "Tither", 
   "jitobear. First off you want special privileges to treat the 2nd Amendment as YOU wish. Then you try to make it seem not so radical by saying But you support the 2nd Amendment. In this way you are as radical as the Special Interest Gun control groups.\n \n Doc said that you make blanket claims, and I agree. That is my objection to what you post. You make it seem like this is an overwhelming epidemic, but then you finally have to admit things like this. \n \n \nMy arguments in all of these forums are about people who are IRRESPONSIBLE with their guns. I know lots of gun owners, and I even believe most are responsible (barring criminals who have guns), however there are some who are not and my condemnation of that irresponsibility stands.\n \n And I am well aware that it is low on the list compared to auto accidents, falls, drownings. But it is still a problem. Too many kids are getting hurt with guns. None should be.\n\n \n Yes. We all do. However, as to the guns and accidents argument, like other daily and household things like autos, swimming pools, lighters, electricity, falls, bicycles etc., we are soft skinned creatures and we live in a dangerous world to us. We ALL wish none of it happened, but you don't seem to be calling for special treatment of any of these other causes of deaths, and they are not even Constitutionally recognized as protected. I wonder how many people would be in jail if we applied your reasoning to everything dangerous. Kitchen implements, poisons, explosives like gasoline, welding gases, and propane etc.\n \n You just seem to want special treatment to something you seem to find objectionable. We as a responsible society are doing the hard work. \n \n  Firearm-Related Fatalities at Record Lows; -- Accidents Among Youths Down Significantly \n NEWTOWN, Conn.-A new report from the National Safety Council shows that accidental firearm-related fatalities remain at record lows, and accidents involving youths continue to decline significantly. \n \n The downward trends are occurring even as firearm ownership rises in the U.S.\n \n Statistics in the council's 2007 \"Injury Facts\" report show a 40 percent decrease in accidental firearm-related fatalities over a 10-year period ending in 2005.\n\n A graphical representation of this good news. http://www.nssf.org/share/images/declinemap.jpg\n \n Do you have any proof that, if we did all you suggested, would even work as you claim it will? Don't you owe it to the Constitution and our people before taking Freedoms that belong to all of us and out future generations? \n \n Freedoms that Doc already showed the actual cost to protect! That being in actual Lives and the blood of our Military Heros? \n \n Does you call for responsibility extend to our Constitution and our Rights that it recognizes as Inalienable? \n \n Or do you just want to take them because that is what you want?", 
   {
    "unicode_changes_made": true
   }, 
   403609, 
   null, 
   1275415020.0
  ], 
  [
   403620, 
   null, 
   "NATO 556", 
   "It's impossible to claim that you support a person's constitutional rights, while at the same time demanding special restrictions and limitations on the exercise of said rights.", 
   {}, 
   403617, 
   null, 
   1275416820.0
  ], 
  [
   403621, 
   null, 
   "jitobear", 
   "It's impossible to claim that you support a person's constitutional rights, while at the same time demanding special restrictions and limitations on the exercise of said rights.\n\n \n Tither/NATO - I am not asking for any limitations (outside of not selling to the bad guys).\n \n All I am saying is that if a gun owner is WILFULLY NEGLIGENT with their weapon and damage is done due to that NEGLIGENCE than the gun owner should be legally responsible. I feel this way about ANY kind of willful negligence - driving dangerously or under the influence, leaving babies unattended in bath tubs, leaving electricals open to water, running a furnace you know is emitting kill levels of CO2, letting a toddler play alone by a campfire, etc. \n \n I am also not interesting in quibbling about safety stats. Whether low or high - accidents happen and wilfull negligence is sometimes the cause.\n \n Having the right to a gun should not automatically negate responsibility.\n \n And further - I am not asking for any laws that would limit a law abiding citizen's access to guns. I do not support them. Just legal repercussions if WILFULL NEGLIGENCE leads to harm.\n \n And I don't approve of mandatory gun ownership which does not impede your right to own a weapon at all, so I don't know what people's beef is with that.", 
   {}, 
   403620, 
   null, 
   1275417660.0
  ], 
  [
   403625, 
   null, 
   "Doc Jones", 
   "It's impossible to claim that you support a person's constitutional rights, while at the same time demanding special restrictions and limitations on the exercise of said rights.\n\n \n He is tenacious and that is why he won't apply rights equally with other BOR, rights. He ought to be calling for silence from those (kids) under 18 years of age, no driving or drinking and no other right until they reach his ficticious \"age of majority\".\n \n \nThe right of the people to keep and bear arms shall not be infringed.' The right of the whole people, old and young, men, women and boys, and not militia only, to keep and bear arms of every description, and not such merely as are used by the militia, shall not be infringed, curtailed, or broken in upon, in the smallest degree; and all this for the important end to be attained: the rearing up and qualifying a well-regulated militia, so vitally necessary to the security of a free State. Our opinion is that any law, State or Federal, is repugnant to the Constitution, and void, which contravenes this right. [Nunn vs. State, 1 Ga. (1 Kel.) 243, at 251 (1846)]\n\n \n He thinks it is ok to infringe just a little bit as long as it fits his pet peeve he uses to try to support the indefensible.\n \n Those two \"boys\" that supposedly 'got shot by bangers' on his lawn and driveway pose a problem he considers solved by blaming someone else, like \"irresponsible gun owners\". It would best be solved by training those \"kids\" to protect themselves just like an adult and the bangers would be more reluctant to gun down unarmed victims. He creates this catagory the same as a gun free zone by having gun free victims under 21 having pistols to protect themselves. Criminals are adverse to take on armed adversaries.\n \n Where does the blame stop little bear in your humble opinion? Nunn v. State stated it plainly. Excuses cannot be made to curtail, infringe or break into a right, any right and it is not ok to pick and choose simply because you label something more dangerous. Curtail their other rights too like freedom of speech, unlawful searches and seizures, deprivation of counsel...all the rights you enjoy if you feel people under 18 cannot exercise their 2A rights they sure aren't entitled to exercise the others in the BOR and if you are the parent you face the lack of responsibility...or is that too horrid a thought to contemplate.\n \n Oh, you used the singular, people's instead of the group, peoples' rights. You also used ammendment instead of amendment but heck, I have made those mistakes myself but I took responsibility to correct my errors.\n \n Little bear is arguing this out of both sides of his mouth intending to place restrictions where there should be none, or more expressly any different from any other BOR.\n \n The hype of powerful, dangerous powerful means of gun destruction simply emotionalizes the topic all for naught. Your first post little bear, gave proof of the equality of the 2A as a second class right to be curtailed and broken into as opposed to any other right. Your accusations about gun owners not being 'responsible' as an excuse to curtail the right. Less than 1% of guns wind up in crime situations and crime has dropped with more gun and continues to drop despite agressive prosecution.\n \n The unalienable right to protect yourself is an indisputable law of nature! It is not incumbant on you to try to sliiiiiick people out of their rights simply because you happen to know or cite an instance that may or not be true. Always your target of wrath is the gun owner and increased punishment if you can label an action irresponsible then your solution is to hang the gun owner. You can't reconcile your \"solution\" to coincide with other BOR.", 
   {}, 
   403620, 
   null, 
   1275418920.0
  ], 
  [
   403628, 
   null, 
   "Doc Jones", 
   "\"The very purpose of a Bill of Rights was to withdraw certain subjects from the vicissitudes of political controversy, to place them beyond the reach of majorities and officials....fundamental rights may not be submitted to vote; they depend on the outcome of no elections.\" - Justice Jackson \n US Supreme Court. 1943 \n \n http://www.healylaw.com/cases/cockrum.htm \n \n Cockrum vs state of Texas\n \n \"The right of a citizen to bear arms, in a lawful defense of himself or\n state, is absolute. He does not derive it from the state government. It is\n one of High Powers, delegated directly to the citizen by the United States\n constitution, Amendment II, and is excepted out of the general powers of\n government. A law cannot be passed to infringe upon it or impair it, because\n it is above the law, and independent of the law - making power.\" -\n Supreme Court of Texas, Cockrum v. State of Texas (1859)", 
   {}, 
   403625, 
   null, 
   1275419520.0
  ], 
  [
   403632, 
   null, 
   "NATO 556", 
   "All I am saying is that if a gun owner is WILFULLY NEGLIGENT with their weapon and damage is done due to that NEGLIGENCE than the gun owner should be legally responsible. I feel this way about ANY kind of willful negligence - driving dangerously or under the influence, leaving babies unattended in bath tubs, leaving electricals open to water, running a furnace you know is emitting kill levels of CO2, letting a toddler play alone by a campfire, etc.\n\n \n Your definition of willful negligence is incredibly ambiguous in nature. Under your standard it could be argued that, if a person was open carrying and a kid with ADHD ran up to them, grabbed their gun and shot themselves in the head, the owner should be responsible for the kid's death.\n \n \nI am also not interesting in quibbling about safety stats. Whether low or high - accidents happen and wilfull negligence is sometimes the cause.\n\n \n A once in a blue moon incident isn't a good enough excuse.\n \n \nHaving the right to a gun should not automatically negate responsibility.\n\n \n Nobody said it did. However what some consider responsibility isn't that at all. DC's previous gun laws resemble what some consider to be responsibility, but the courts shot them down.\n \n \nAnd further - I am not asking for any laws that would limit a law abiding citizen's access to guns. I do not support them. Just legal repercussions if WILFULL NEGLIGENCE leads to harm.\n\n \n Then first prove that no such legal repercussions exist. You have no business asking for what's already in place.", 
   {}, 
   403621, 
   null, 
   1275419880.0
  ], 
  [
   403643, 
   null, 
   "Tither", 
   "Jitobear, First off, you have a right to your opinion. \n \n Having said that, this is the part of the debate where we parse what you say you want, and your reasoning, so don't feel put upon by our zeal to protect our Constitutional Rights. Statements like this do not help to ingratiate us to you. \nWhy is it that so many gun ownership advocates seem to be the last people I would want to see owning a gun? \n\n Like it or not you just slapped us in the face when you say some of the things you did. We are the gun ownership advocates. \n \n However, and that being the case, we now understand that you cannot really defend your idea of much more restrictive rights. That is OK. You still have the right to your opinion. \n \nAnd I don't approve of mandatory gun ownership which does not impede your right to own a weapon at all, so I don't know what people's beef is with that.\n\n If this is the law in your city, you have a few choices. Work to get the law changed, or leave that locality. Many Pro-gun people left California, and in Droves, because they could not abide those kind of laws. \n \n All we ask is for everyone to obey our laws. Us, you, law enforcement, and the government too. That is good citizenship!", 
   {}, 
   403621, 
   null, 
   1275424980.0
  ], 
  [
   403651, 
   null, 
   "jitobear", 
   "He is tenacious and that is why he won't apply rights equally with other BOR, rights. He ought to be calling for silence from those (kids) under 18 years of age, no driving or drinking and no other right until they reach his ficticious \"age of majority\".\n \n He thinks it is ok to infringe just a little bit as long as it fits his pet peeve he uses to try to support the indefensible.\n \n Those two \"boys\" that supposedly 'got shot by bangers' on his lawn and driveway pose a problem he considers solved by blaming someone else, like \"irresponsible gun owners\". It would best be solved by training those \"kids\" to protect themselves just like an adult and the bangers would be more reluctant to gun down unarmed victims. He creates this catagory the same as a gun free zone by having gun free victims under 21 having pistols to protect themselves. Criminals are adverse to take on armed adversaries.\n \n Where does the blame stop little bear in your humble opinion? Nunn v. State stated it plainly. Excuses cannot be made to curtail, infringe or break into a right, any right and it is not ok to pick and choose simply because you label something more dangerous. Curtail their other rights too like freedom of speech, unlawful searches and seizures, deprivation of counsel...all the rights you enjoy if you feel people under 18 cannot exercise their 2A rights they sure aren't entitled to exercise the others in the BOR and if you are the parent you face the lack of responsibility...or is that too horrid a thought to contemplate.\n \n Oh, you used the singular, people's instead of the group, peoples' rights. You also used ammendment instead of amendment but heck, I have made those mistakes myself but I took responsibility to correct my errors.\n \n Little bear is arguing this out of both sides of his mouth intending to place restrictions where there should be none, or more expressly any different from any other BOR.\n \n The hype of powerful, dangerous powerful means of gun destruction simply emotionalizes the topic all for naught. Your first post little bear, gave proof of the equality of the 2A as a second class right to be curtailed and broken into as opposed to any other right. Your accusations about gun owners not being 'responsible' as an excuse to curtail the right. Less than 1% of guns wind up in crime situations and crime has dropped with more gun and continues to drop despite agressive prosecution.\n \n The unalienable right to protect yourself is an indisputable law of nature! It is not incumbant on you to try to sliiiiiick people out of their rights simply because you happen to know or cite an instance that may or not be true. Always your target of wrath is the gun owner and increased punishment if you can label an action irresponsible then your solution is to hang the gun owner. You can't reconcile your \"solution\" to coincide with other BOR.\n\n [*]First of all, I am a woman.[*]Secondly, you are an unreasonable, hyper-senesitive, and putting words into my mouth. I am on your side. I will fight FOR second ammendment rights and yet you work to alienate me by being a jerk[*]Thirdly, I have not asked for any restrictions on legal gun-ownership at all. [*]Fourth, the examples of the boys who were shot outside my home (but not on property, one ran through afterwards - example of putting words in my mouth), and news stories about gun violence were not attempts to justify gun control - they were simply examples to support that it is important to be careful and that it is possible to be a victim of gun violence from your own gun/gun in your home. A right to a weapon does not mean you have the right to use it when, where and however you like with no regard to consequences.[*]Five, I NEVER claimed that all gun owners were irresponsible. As a matter of fact, I stated the opposite. What I said is that those that are should be held accountable when that irresponsibility causes harm.[*]Last, two of the boys shot outside my home (and many others here), are not the targets. They are in the wrong place at the wrong time, often hit by stray bullets. Had they been carrying a weapon, it would not have mattered. As a matter of fact the third one, the one who ran through my yard, the one who lived, the police belive was carrying one and they spent more than hour looking to see if he dumped it in my yard. I live in an area where gun violence is a reality. Linked below is the \"shots fired\" map from the week of May 18th. For the record I do not blame anyone but the criminals for this. I just don't appreciate your implication that my story was a lie or the idea that I am clueless about the realities of guns.\n \n http://www.ci.minneapolis.mn.us/police/crime-statistics/codefor/643_MinneapolisShotsFired.pdf.\n \n Now if all you are going to do is going into an unthinking diatribe and assign actions and opinions to me that are not my own, I am through debating with you.", 
   {}, 
   403625, 
   null, 
   1275428400.0
  ], 
  [
   403654, 
   null, 
   "jitobear", 
   "Jitobear, First off, you have a right to your opinion. \n\n \n Indeed. We all do.\n \n \nHaving said that, this is the part of the debate where we parse what you say you want, and your reasoning, so don't feel put upon by our zeal to protect our Constitutional Rights. Statements like this do not help to ingratiate us to you. \n\n \n And seeing people argue that they should not ever have to be held accountable for being responsible gun-owners makes a moderate like me sympathetic to those who would like to see the second ammendement bagged.\n \n \nLike it or not you just slapped us in the face when you say some of the things you did. We are the gun ownership advocates. \n\n \n You know, I am a car owner and a car owner advocate. I can still acknowledge that irresponsible drivers/car-owners exist and hear condemnation of that irresponsibility without getting offended and know I am not part of the problem.\n \n \nHowever, and that being the case, we now understand that you cannot really defend your idea of much more restrictive rights. That is OK. You still have the right to your opinion. \n\n \n What great restrictions have I asked for? Please, enlighten me.\n \n \nIf this is the law in your city, you have a few choices. Work to get the law changed, or leave that locality. Many Pro-gun people left California, and in Droves, because they could not abide those kind of laws. \n\n \n No, it is not the law here. If it were, I would fight it. I must say, I question whether such laws are even constitutional. There are those who do not own weapons for religious reasons.\n \n \nAll we ask is for everyone to obey our laws. Us, you, law enforcement, and the government too. That is good citizenship!\n\n \n OK.", 
   {}, 
   403643, 
   null, 
   1275429300.0
  ], 
  [
   403657, 
   null, 
   "jitobear", 
   "Your definition of willful negligence is incredibly ambiguous in nature. \n\n \n Agreed. And I do believe there is often a fine line between negligence and just plain accident. That is what investigation and the courts are for.\n \n \nUnder your standard it could be argued that, if a person was open carrying and a kid with ADHD ran up to them, grabbed their gun and shot themselves in the head, the owner should be responsible for the kid's death.\n\n \n I do not believe this is an example of negligence at all. \n \n About a week back, in Pine County MN, a seven year old and a three year old were left alone with a loaded rifle. The seven year old shot the three year old. That, in my opinion, was negligence - and its stuff like that, preventable things are what I would like to see reduced if not stopped.\n \n \nA once in a blue moon incident isn't a good enough excuse.\n\n \n Excuse for what? Expecting responsibility? \n \n \nNobody said it did. However what some consider responsibility isn't that at all. DC's previous gun laws resemble what some consider to be responsibility, but the courts shot them down.\n\n \n I have no idea what they were. \n \n In general my feelings on responsible gun ownership - and please note that these are simply my opinions and not suggestions for any kind of legal rule: \n [*]Guns out and loaded should be in control and posession of gun-owner/law abiding citizen. If not they should be locked up. Especially if kids are around. I also think guns and being impaired are not a good combination (serious mental health issues, learning disorders, when one is drunk or high).[*]Kids and guns. If you have kids and guns in the same house, the kids should not be allowed access without supervision, and should also have extension education on gun safety.\n \nThen first prove that no such legal repercussions exist. You have no business asking for what's already in place.\n\n \n Oh, I think they do in many places although they vary from state to state. In general I am comfortable with current gun law. But I admit I get mad when stupid people do stupid stuff with guns and people get hurt.", 
   {}, 
   403632, 
   null, 
   1275430260.0
  ], 
  [
   403674, 
   null, 
   "NATO 556", 
   "I do not believe this is an example of negligence at all.\n\n \n That would depend on how much latitude the prosecutor has in trying to make a case against open carry.\n \n \nAbout a week back, in Pine County MN, a seven year old and a three year old were left alone with a loaded rifle. The seven year old shot the three year old. That, in my opinion, was negligence - and its stuff like that, preventable things are what I would like to see reduced if not stopped.\n\n \n Was the family able to legally own the rifle in the first place? Or is this a case of a criminal family illegally possessing a firearm, which tends to be common in the big inner cities?\n \n If legality wasn't in question here, I certainly think this is a prime example of why it's best to work on teaching your kids not to play with guns, rather than choosing to leave them ignorant and instead focus your attention on mechanical restrictions.\n \n \nExcuse for what? Expecting responsibility?\n\n \n Simply because something is labeled responsibility doesn't mean that it is. There are times when accidents are unavoidable no matter what precautions you might take. That's why people die in vehicular collisions despite seat belts and air bags.\n \n You stated that you're not interested in statistics. If someone is truly concerned about safety, it makes me wonder why statistics wouldn't be used to try and make a case.\n \n \nI have no idea what they were.\n\n \n You came to this fight ill prepared.\n \n Under DC's old laws, and even under their new laws, you're not allowed to keep an operable gun in your home, under any circumstances. If you own a gun you have to keep it locked up and disassembled, stored in one room of your house, with the ammunition stored in an entirely separate room. You're not allowed to assemble your gun, not even in event of a break in, you're not allowed to load it, or take it from one room of your house to another. \n \n \n[*]Guns out and loaded should be in control and posession of gun-owner/law abiding citizen. If not they should be locked up. Especially if kids are around. I also think guns and being impaired are not a good combination (serious mental health issues, learning disorders, when one is drunk or high).\n\n \n Alright hold the phone. First off, no. A lot of people keep a rifle or shotgun within easy access at home should trouble arise. Under the Heller ruling you can't really expect people to keep them inaccessible to themselves. This especially applies in places like New York and California where carry permits are usually reserved for the rich and famous.\n \n Secondly, learning disorders should play no part on a person's ability to be armed. What even qualifies as a learning disorder in this situation?\n \n \n[*]Kids and guns. If you have kids and guns in the same house, the kids should not be allowed access without supervision, and should also have extension education on gun safety.\n\n \n I see you've changed your previous tune about educating children to practice safety and responsibility on their own.\n \n \nOh, I think they do in many places although they vary from state to state. In general I am comfortable with current gun law. But I admit I get mad when stupid people do stupid stuff with guns and people get hurt.\n\n \n Just because stupid stuff happens, that doesn't mean there are few or no legal repercussions in place. Look at drunk driving for example, it still goes on despite all the laws against such behavior.\n \n If you wanna get mad, get mad at those that're fueling the drug and gang cultures. They're the ones really hurting people, and not in isolated and easily preventable incidents. They're deliberately going out of their way to commit harm to others. Who else would intentionally murder a toddler in a stroller just to make a point?", 
   {}, 
   403657, 
   null, 
   1275436800.0
  ], 
  [
   403707, 
   null, 
   "Bryan", 
   "Just as an aside on the issue of leaving loaded firearms accessible to small children....You don't need a statute aimed only at gun owners. I don't know how it is punished in other states but in Virginia we have a very broad child abuse or neglect statute that we use to prosecute these cases. If death or serious bodily injury occurs, then this portion of the statute applies:\n \n Any parent, guardian, or other person responsible for the care of a child under the age of 18 who by willful act or omission or refusal to provide any necessary care for the child's health causes or permits serious injury to the life or health of such child shall be guilty of a Class 4 felony. For purposes of this subsection, \"serious injury\" shall include but not be limited to (i) disfigurement, (ii) a fracture, (iii) a severe burn or laceration, (iv) mutilation, (v) maiming, (vi) forced ingestion of dangerous substances, or (vii) life-threatening internal injuries.\n \n If the injury is not serious, or even if no injury occurs at all but only the substantial likelihood of injury exists, then this portion of the statute controls:\n \n Any parent, guardian, or other person responsible for the care of a child under the age of 18 whose willful act or omission in the care of such child was so gross, wanton and culpable as to show a reckless disregard for human life shall be guilty of a Class 6 felony.\n \n A class 4 felony is punished by 2-10 years imprisonment and a fine of up 100K. A class 6 felony is punished by 1-5 years imprisonment, or jail up to 12 months and a fine of up to $2,500.\n \n Our statute punishes both acts and omissions. A simple example of a willful act would be leaving a loaded revolver in a 3 year old child's toy basket, or leaving a child in an unventilated car for an hour while you go in the store to get the manicure/pedicure in 105 weather in August. By contrast, an \"omission\" is a failure to act. A simple example would be your child falls and suffers a life threatening injury, but you refuse to call for help because you know that if you do then you will be at the ER all night and you just have to stay home because you want to see who will win American Idol tonight. \n \n When you judge whether an act or omission qualifies as a crime under this statute, the following interpretations apply:\n \n \"The term 'willful act' imports knowledge and consciousness that injury will result from the act done. The act done must be intended or it must involve a reckless disregard for the rights of another [that] will probably result in an injury.\" Barrett, 268 Va. at 183, 597 S.E.2d at 111. Thus, the issue of intent requires an examination not only of the act that created the risk, but also of the degree to which the accused \"was [or should have been] aware of the danger\" that resulted from the act. Bean-Brewer v. Commonwealth, 49 Va. App. 3, 11, 635 S.E.2d 680, ___ (2006)\n \n and\n \n A showing of \"inattention and inadvertence,\" i.e., simple negligence, is insufficient to justify the imposition of a criminal penalty. Ellis, 29 Va. App. at 555-56, 513 S.E.2d at 457; see also Commonwealth v. Duncan, 267 Va. 377, 384, 593 S.E.2d 210, 214 (2004). Rather, the negligence must be \"gross negligence\" and must be \"accompanied by acts of commission or omission of a wanton or willful nature, showing a reckless disregard or indifferent disregard of the rights of others, under circumstances reasonably calculated to produce injury, or which make it not improbable that injury will be occasioned, and the offender knows, or is charged with the knowledge of, the probable result of [her] acts.\" Id.\n \n This is just an example of how we deal with this issue in my state.\n \n Now for Galileo....I agree government is necessary to prevent people from violating the rights of others. Thus, a person who commits murder is punished in part because he has denied another's right to life. But government must always be mindful that it is the bull within the china shop of our rights. It is little consolation to me if, in the name of preventing others from denying me my rights, government itself trods upon those same rights in the process. I think the sentiment was best expressed this way: \n \n Experience should teach us to be most on our guard to protect liberty when the Government's purposes are beneficent. Men born to freedom are naturally alert to repel invasion of their liberty by evil-minded rulers. The greatest dangers to liberty lurk in insidious encroachment by men of zeal, well-meaning but without understanding. Olmstead v. United States, 277 U.S. 438, 485 (1928) (Brandeis, dissenting).\n \n And so while I agree in principle with your \"government is necessary because...\" thought, I also believe that an equally important goal of government is to ensure that government respects our rights in all that it does.\n \n But hey, we are both talking nothing but vague theory here-which is usually what happens on this site because it allows one to escape into varying interpretations if our words are ever used against us. So let's get to some specifics and try to answer the question that started this thread. \n \n As far as sensible gun control laws go, these are not the only gun control laws in my state, but they are the ones we see most often in our courts. I have lived for years with these laws and I have no real problem with them.\n \n http://www.4forums.com/political/gun-control-debates/11357-example-states-firearm-restriction-laws.html\n \n Comment as you feel led.", 
   {
    "post_info": {
     "post_title": "gun control specifics"
    }, 
    "unicode_changes_made": true
   }, 
   403674, 
   null, 
   1275453000.0
  ], 
  [
   403731, 
   null, 
   "Tither", 
   "jitobear You say you don't want to argue statistics or fact. That is just too convenient. It seems that you just want to be rhetorical with no consequences for your statements. Is that being a responsible poster? emoticon_smile I said:\n \n Having said that, this is the part of the debate where we parse what you say you want, and your reasoning, so don't feel put upon by our zeal to protect our Constitutional Rights. \n\n To this, your answer comes directly out of Left field. \n \nAnd seeing people argue that they should not ever have to be held accountable for being responsible gun-owners makes a moderate like me sympathetic to those who would like to see the second ammendement bagged.\n\n This is the kind of blanket statements, and vague rhetoric that we are objecting to. Who said anything remotely like this? Yet you say that we are brow beating a 2nd Amendment supporter, and possibly turning you off from said support. Not only that, you say Doc is putting words into YOUR mouth? Who said anything like this? \n \n Doc repeatedly, and now Bryan have shown you that what you ask is already in practice, but yet you appear to want to ignore those laws and facts, and just keep harping on this as if this were a major problem that needs to be fixed! And It Need to be fixed RIGHT NOW. With a whole bunch of these. =< !!!!!!!!!! emoticon_smile You claim that we are being unreasonable in our defense of the 2nd, yet the very thing you ask for is already covered. \n \nWhat great restrictions have I asked for? Please, enlighten me.\n\n \n \n gun owners should be accountable for damage done by their weapons due to their negligence.\n \n If you aren't willing to take FULL responsibility for a weapon you own, you are a poor gun owner.\n \n Full responsibility means a dead two year old due to your loaded gun being left around unmonitored is a crime and you bear the criminal responsibility of that death.\n \n Having your gun where kids can access it is irresponsible, .....\n \n Of course every gun owner should teach their child about gun safety. But that does not mean you allow them access to weapons.\n \n You can not and should not be allowed to go willfully and irresponsibly packing heat.....\n \n Just legal repercussions if WILFULL NEGLIGENCE leads to harm. ....\n \n A right to a weapon does not mean you have the right to use it when, where and however you like with no regard to consequences.\n\n Keeping in mind that Doc and Bryan posts stating that laws already cover these. There are currently 22 to 30 thousand gun laws on the books now, and law to cover every meaning of all of this would be patently, and VERY unfair, for it would allow a lawsuit for everything under the sun, to include being sued for emotional distress for the Very Though that someone owns a weapon. emoticon_emb How dare they? \n \n Again, keeping in mind that Doc and Bryan posts stating that laws already cover these. \n \n Alright Jitobear time for you to get specific! If this didn't cover your argument, what additional laws do you want! What would it say! Time for you to defend your argument!", 
   {
    "unicode_changes_made": true
   }, 
   403654, 
   null, 
   1275485640.0
  ], 
  [
   403979, 
   null, 
   "jitobear", 
   "That would depend on how much latitude the prosecutor has in trying to make a case against open carry.\n\n \n Welcome to justice system. \n \n \nWas the family able to legally own the rifle in the first place? Or is this a case of a criminal family illegally possessing a firearm, which tends to be common in the big inner cities?\n \n If legality wasn't in question here, I certainly think this is a prime example of why it's best to work on teaching your kids not to play with guns, rather than choosing to leave them ignorant and instead focus your attention on mechanical restrictions.\n\n \n The article did not say whether they did, but I assume so since there was nothing in the article regarding charges for having weapons illegally. Pine County is out in the sticks, not the city.\n \n Even if taught not to play with guns, which they very well could have been, it is still foolish to leave children alone with a loaded weapon, especially that young. Kids are curious, willful creatures - that lesson is not a guarantee of their safety. \n \n \nSimply because something is labeled responsibility doesn't mean that it is. There are times when accidents are unavoidable no matter what precautions you might take. That's why people die in vehicular collisions despite seat belts and air bags.\n\n \n Of course. But that does not mean you disregard the things that will reduce those accidents.\n \n \nYou stated that you're not interested in statistics. If someone is truly concerned about safety, it makes me wonder why statistics wouldn't be used to try and make a case.\n\n \n This all stems from why I, me, Leslie, just me chooses not to own a gun. One reason is because it is possible that one can be hurt with their own weapon. People can quibble about the numbers all they want, whether its 2% or 20% does not matter to me and my decision. \n \n \nYou came to this fight ill prepared.\n\n \n The thread asks for my own opinion, I do not need to prep for my opinion.\n \n Also, I'm really not trying to fight anything. Just mystified that expecting gun owners to be responsible or the fact that I choose not to own a gun should cause such an uproar.\n \n \nUnder DC's old laws, and even under their new laws, you're not allowed to keep an operable gun in your home, under any circumstances. If you own a gun you have to keep it locked up and disassembled, stored in one room of your house, with the ammunition stored in an entirely separate room. You're not allowed to assemble your gun, not even in event of a break in, you're not allowed to load it, or take it from one room of your house to another. \n\n \n Thats a stupid law.\n \n \nAlright hold the phone. First off, no. A lot of people keep a rifle or shotgun within easy access at home should trouble arise. Under the Heller ruling you can't really expect people to keep them inaccessible to themselves. This especially applies in places like New York and California where carry permits are usually reserved for the rich and famous.\n\n \n I am not saying that the thing has to be glued to you at all times, just use some common sense and be sure that you are in charge of your weapon when its loaded. If you live in a household of capable adults you trust, leaving a loaded shut gun against the wall is not a problem - but lets say your buddies come over and they are drunk, or strangers show up, or you have a three year old running around - a slightly safer location may not be a bad idea. I am not asking for any restrictions here - just use your head.\n \n And I believe in holding people accountable. If an investigation and trial determines you have been irresonsible with your weapon you should be punished for that. (And I do believe this pretty much happens now anyway.)\n \n Really I gave my three points in my first thread I prett much felt I was stating what was for the most part in place, did not expect people to go all ca ca crazy on me.\n \n \nSecondly, learning disorders should play no part on a person's ability to be armed. What even qualifies as a learning disorder in this situation?\n\n \n A doctor's diagnosis. There are people who have the mental capalities of a three year old. There are people who are severely mentally ill and can not even live alone. They are considered \"vulnerable adults\" I think that allowing some of these vulnerable adults to own a weapon could be even more dangerous than allowing criminals to do so. I think doctors should be the ones who should make such a recomendation to a judge, though.\n \n \nI see you've changed your previous tune about educating children to practice safety and responsibility on their own.\n\n \n No, I have not. I challenge you to show me where I said children should not be educated about guns or their usage. Considering mine has been, you will be pretty hard pressed to do so. Just because such education has been provided does not mean that they should be allowed unfettered access to weapons. I teach my son about automobile safety and operation all the time and have done so for years. This does not mean that I will hand over the car keys, though. He will not be allowed that until he has demonstrated the maturity that he can drive responsibly and he is legally able to do so.\n \n \nJust because stupid stuff happens, that doesn't mean there are few or no legal repercussions in place. Look at drunk driving for example, it still goes on despite all the laws against such behavior.\n\n \n Yes, I know.\n \n \nIf you wanna get mad, get mad at those that're fueling the drug and gang cultures. They're the ones really hurting people, and not in isolated and easily preventable incidents. They're deliberately going out of their way to commit harm to others. Who else would intentionally murder a toddler in a stroller just to make a point?\n\n \n Gangs are part of every day life where I live. Trust me, they XXXX me off plenty.\n \n \n \njitobear You say you don't want to argue statistics or fact. That is just too convenient. It seems that you just want to be rhetorical with no consequences for your statements. Is that being a responsible poster? emoticon_smile I said:\n\n \n See my response to NATO on the stats above.\n \n \nTo this, your answer comes directly out of Left field. \n \n This is the kind of blanket statements, and vague rhetoric that we are objecting to. Who said anything remotely like this? Yet you say that we are brow beating a 2nd Amendment supporter, and possibly turning you off from said support. Not only that, you say Doc is putting words into YOUR mouth? Who said anything like this? \n\n \n What do you mean? 75% of the arguments on the thread stems from you guys being angry about my saying that gun owners should be held accountable should they be negligent with thier weapons and that negligence leads to harm. i.e., In my opinion, the seven year old who shot his three year old brother because they were left alone with a loaded gun, there is an adult that should be held accountable there. \n \n \nDoc repeatedly, and now Bryan have shown you that what you ask is already in practice, but yet you appear to want to ignore those laws and facts, and just keep harping on this as if this were a major problem that needs to be fixed! And It Need to be fixed RIGHT NOW. With a whole bunch of these. =< !!!!!!!!!! emoticon_smile You claim that we are being unreasonable in our defense of the 2nd, yet the very thing you ask for is already covered. \n \n Keeping in mind that Doc and Bryan posts stating that laws already cover these. There are currently 22 to 30 thousand gun laws on the books now, and law to cover every meaning of all of this would be patently, and VERY unfair, for it would allow a lawsuit for everything under the sun, to include being sued for emotional distress for the Very Though that someone owns a weapon. emoticon_emb How dare they? \n \n Again, keeping in mind that Doc and Bryan posts stating that laws already cover these. \n\n \n I already admitted that I believe this is pretty much in place and that I am fairly comfortable with current gun laws (minus places that have mandatory ownership laws.)\n \n \nAlright Jitobear time for you to get specific! If this didn't cover your argument, what additional laws do you want! What would it say! Time for you to defend your argument!\n\n \n I listed three things I want, I have acknowledged that they are pretty much in place. As I stated to NATO I when I originally posted I knew that and did not expect anyone to go all ape-$hit over my post.", 
   {}, 
   403731, 
   null, 
   1275672000.0
  ], 
  [
   403989, 
   null, 
   "Tither", 
   "jitobear, you have had your say and we have responded. It is pointless to continue this part of the dialog further. The one thing I have learned about you is that discussing things with you is pointless because you ignore facts and statistic and just emote your seeming distrust for us and firearms. That is your decision, and your decisions may be right for you, and still have no basis of fact in reality. \n \n However, on the subject of kids around guns.\n \n When I was growing up, my friends and I were taught the proper respect for dangerous items like Knives, Electricity, Playing in the street, looking both ways before crossing the street, and yes even guns. \n \n My father taught me that I could look at and handle his firearms whenever I wanted just as long as he was there and I asked his permission first. A huge emphasis on ANY TIME I WANTED! There was zero mystery about firearms when I was growing up, we were all taught pretty much the same thing. \n \n I was 13 when I got my first shotgun. My father took me hunting and to the range where he taught me safe handling of firearms, and the respect for the awesome power of a firearm to destroy a life. This is a privilege that I don&#8217;t EVER want you to take lightly, he said. You are now on notice of these things, and we all acted responsibly. When I turned 16 I also had a rifle and a handgun! I earned them, and earned the right to have them by my responsible actions, of never pointing a firearm at anything I was not willing to destroy, even if I knew for a fact that the guns were not loaded.   And here are the other rules.  \n \n Now you may think this is stupid but I don&#8217;t care what you think. emoticon_smile I know the discussions my friends and I had about safety and responsibility. You do not! This was the Supreme badge of the Responsibility and maturity for us and to violate this would be an unthinkable act! And in fact, when I heard my first burglar, I walked by a wall full of guns to get a butcher knife, because that was An Extremely unthinkable act! That is how well that was ingrained in us.\n \n While I was still 17 for a few days, the U.S. Army trained a bunch of 17,18,19 year old and had no fear of giving them weapons and ammo. So what does the Army do to make that kind of difference? Training.", 
   {}, 
   403979, 
   null, 
   1275674700.0
  ], 
  [
   404033, 
   null, 
   "NATO 556", 
   "Welcome to justice system.\n \n \n Justice system my ***, that's a witch hunt.\n \n \nThe article did not say whether they did, but I assume so since there was nothing in the article regarding charges for having weapons illegally. Pine County is out in the sticks, not the city.\n\n \n What about the shooting/stabbing at Target? How long did it take for the news to admit the two involved were rival gang members?\n \n \nEven if taught not to play with guns, which they very well could have been, it is still foolish to leave children alone with a loaded weapon, especially that young. Kids are curious, willful creatures - that lesson is not a guarantee of their safety.\n\n \n In most cases this is nothing more than an excuse used by parents who are too weak and disinterested to try and train their children properly. \n \n However it's not an acceptable excuse for trusting in mechanical safeguards that can only be used after the gun has been rendered harmless.\n \n Do you teach kids not to play with the kitchen knives because they're sharp, or do you instead teach them nothing and lock them away on a high up cupboard with a padlock?\n \n \nOf course. But that does not mean you disregard the things that will reduce those accidents.\n\n \n And if the kids can find the keys to the locks or the safe, then they've done no good. You yourself said kids are curious, they're bound to snoop around in things they have no business with.\n \n \nThis all stems from why I, me, Leslie, just me chooses not to own a gun. One reason is because it is possible that one can be hurt with their own weapon.\n\n \n You can be hurt a lot worse in ways you wouldn't believe. You could slip and crack your own skull in your bathtub and die of a concussion. Or you could sleepwalk, trip on the top stair, fall down the flight and break your neck.\n \n \nPeople can quibble about the numbers all they want, whether its 2% or 20% does not matter to me and my decision.\n\n \n Then kindly don't try and press your decision on others.\n \n \nThe thread asks for my own opinion, I do not need to prep for my opinion.\n\n \n You do need to reinforce your opinion so it can withstand the criticisms raised over its shortcomings.\n \n \nAlso, I'm really not trying to fight anything. Just mystified that expecting gun owners to be responsible or the fact that I choose not to own a gun should cause such an uproar.\n\n \n Your definition of responsibility isn't universal.\n \n \nThats a stupid law.\n\n \n That it is.\n \n \nI am not saying that the thing has to be glued to you at all times, just use some common sense and be sure that you are in charge of your weapon when its loaded. If you live in a household of capable adults you trust, leaving a loaded shut gun against the wall is not a problem -\n\n \n Adults aren't capable of doing stupid things?\n \n \nbut lets say your buddies come over and they are drunk,\n\n \n Then they'd be in trouble with the law, not me.\n \n \nor strangers show up,\n\n \n Breaking and entering, a criminal offense. Against they'd be in trouble, not me.\n \n \nor you have a three year old running around - a slightly safer location may not be a bad idea. I am not asking for any restrictions here - just use your head.\n\n \n Easily accessible doesn't mean out in the open in full view of everyone.\n \n \nAnd I believe in holding people accountable. If an investigation and trial determines you have been irresonsible with your weapon you should be punished for that. (And I do believe this pretty much happens now anyway.)\n\n \n Then why aren't you suggesting the same standards for gangster wannabees?\n \n \nA doctor's diagnosis. There are people who have the mental capalities of a three year old. There are people who are severely mentally ill and can not even live alone. They are considered \"vulnerable adults\" I think that allowing some of these vulnerable adults to own a weapon could be even more dangerous than allowing criminals to do so.\n\n \n Those aren't learning disorders, they're developmental disorders. \n \n \nI think doctors should be the ones who should make such a recomendation to a judge, though.\n\n \n Doctors can be wrong too. Look at how many kids are on Ritalin and similar drugs, and they're just in preschool.\n \n \nNo, I have not. I challenge you to show me where I said children should not be educated about guns or their usage.\n\n \n It's done when you argue that mechanical restrictions are a better option than educating the children so they can exercise their own safety.\n \n \nConsidering mine has been, you will be pretty hard pressed to do so.\n\n \n And what did their education consist of?\n \n \nJust because such education has been provided does not mean that they should be allowed unfettered access to weapons.\n\n \n Nobody really suggested such in this thread.", 
   {}, 
   403979, 
   null, 
   1275699780.0
  ], 
  [
   404035, 
   null, 
   "jitobear", 
   "Justice system my ***, that's a witch hunt.\n\n \n Each trial and its players will be different.\n \n \nWhat about the shooting/stabbing at Target? How long did it take for the news to admit the two involved were rival gang members?\n\n \n No idea. Mpls news tends to note what crimes are gang related right away.\n \n \nIn most cases this is nothing more than an excuse used by parents who are too weak and disinterested to try and train their children properly. \n\n \n Have you actually ever raised a child? My son is laaaaaaazzzzzyyyyyy about school work. Has been since junior high - in that time he has endured daily lectures, punishments, teacher/parent/coach meetings, tutors, you name it. His father and I have driven ourselves mad and lost sleep trying to conjur up new ways to get this very bright and capable child motivated. He's still a lazy bugger.\n \n You can't control anyone. Not even children. Children are not adults, you can't trust that they will handle grown up stuff (like cars, property management, complete self-reliance, guns) like a grown up.\n \n \nHowever it's not an acceptable excuse for trusting in mechanical safeguards that can only be used after the gun has been rendered harmless.\n\n \n I am not saying how to be a safe gun-owner, just be one, use your head and take reponsibility for your weapon (not saying you are not, speaking hypothetically here).\n \n \nDo you teach kids not to play with the kitchen knives because they're sharp, or do you instead teach them nothing and lock them away on a high up cupboard with a padlock?\n\n \n I teach them they are sharp and I keep them out of reach. I tell them medicine is not candy and keep it out of reach and in child-proof containers. When my son went through a phase where he was burning little peices of paper for entertainment I chewed him out, disciplined him AND hid the matches.\n \n \nAnd if the kids can find the keys to the locks or the safe, then they've done no good. You yourself said kids are curious, they're bound to snoop around in things they have no business with.\n\n \n True. You can only do what you can do. (Combination locks are probably better.) \n \n \nYou can be hurt a lot worse in ways you wouldn't believe. You could slip and crack your own skull in your bathtub and die of a concussion. Or you could sleepwalk, trip on the top stair, fall down the flight and break your neck.\n\n \n Yep. Still not going to own a gun. I have many reasons for that decision.\n \n \nThen kindly don't try and press your decision on others.\n\n \n I'm not. I have said several times I support people's right to own a gun. But I ask the same courtesy (for all citizens) which is why mandatory gun ownership ticks me off.\n \n \nYou do need to reinforce your opinion so it can withstand the criticisms raised over its shortcomings.\n\n \n Why? Either my opinion will change or it won't.\n \n \nYour definition of responsibility isn't universal.\n\n \n Nobody's definition of anything is, but to llive in a managable society of laws a legal definition needs to be in place. Somewhere in between the useless DC law and and being able to point and shoot at will.\n \n \nAdults aren't capable of doing stupid things?\n\n \n All too often.\n \n \nThen they'd be in trouble with the law, not me.\n\n \n But this would be one those times you can pretty much count on them to do something stupid, so I wouldn't let them play with my gun - but thats just me.\n \n \nBreaking and entering, a criminal offense. Against they'd be in trouble, not me.\n\n \n I am not talking about that - I am talking that they knock on the door, cable guy, etc. - someone that you may not know or be able to trust but may have access to your home. \n \n \nEasily accessible doesn't mean out in the open in full view of everyone.\n\n \n Agreed.\n \n \nThen why aren't you suggesting the same standards for gangster wannabees?\n\n \n What are you talking about? Anyone who owns a gun legally should be expected to responsible with it, anyone who owns one illegally should be prosecuted. Wannabes who do not have weapons and don't break the law may be obnoxious but are hardly something I am going to fret about.\n \n I am hardly fuzzy wuzzy about gangsters. They are a serious problem where I live.\n \n \nThose aren't learning disorders, they're developmental disorders. \n\n \n OK, I stand corrected. Or serious mental health disorders (i.e., schizophrenia).\n \n \nDoctors can be wrong too. Look at how many kids are on Ritalin and similar drugs, and they're just in preschool.\n\n \n I agree that small children are over-medicated for ADD or ADHD and it is hard to diagnose children. (I believe Adderal is the drug of choice for children with ADHD now, much more low-key than Ritalin.)\n \n This is not the case for adults. The seriously mentally have serious symptoms that are unmistakably a problem - spend ten minutes with a decompensating schizophrenic and you will see what I mean. (I used to be a mental health working in Dakota County.)\n \n \nIt's done when you argue that mechanical restrictions are a better option than educating the children so they can exercise their own safety.\n\n \n I support a combination of the two. \n \n \nAnd what did their education consist of?\n\n \n Just one kid. A class taught by the MN DNR on gun and hunting safety. He also does all his shooting and hunting with my cousin Bill and/or my brother. My brother is a trained police officer and my cousin a 20+ safe and experienced gun owner and instructor for the DNR. My son is not allowed unsupervised access to any gun except his pellet gun.\n \n \nNobody really suggested such in this thread.\n\n \n It was implied in the outraged response that gun owners be held accountable if they are negligent.", 
   {}, 
   404033, 
   null, 
   1275702840.0
  ], 
  [
   404073, 
   null, 
   "Doc Jones", 
   "Each trial and its players will be different.\n \n \n \n No idea. Mpls news tends to note what crimes are gang related right away.\n \n \n \n Have you actually ever raised a child? My son is laaaaaaazzzzzyyyyyy about school work. Has been since junior high - in that time he has endured daily lectures, punishments, teacher/parent/coach meetings, tutors, you name it. His father and I have driven ourselves mad and lost sleep trying to conjur up new ways to get this very bright and capable child motivated. He's still a lazy bugger.\n \n You can't control anyone. Not even children. Children are not adults, you can't trust that they will handle grown up stuff (like cars, property management, complete self-reliance, guns) like a grown up.\n \n \n \n I am not saying how to be a safe gun-owner, just be one, use your head and take reponsibility for your weapon (not saying you are not, speaking hypothetically here).\n \n \n \n I teach them they are sharp and I keep them out of reach. I tell them medicine is not candy and keep it out of reach and in child-proof containers. When my son went through a phase where he was burning little peices of paper for entertainment I chewed him out, disciplined him AND hid the matches.\n \n \n \n True. You can only do what you can do. (Combination locks are probably better.) \n \n \n \n Yep. Still not going to own a gun. I have many reasons for that decision.\n \n \n \n I'm not. I have said several times I support people's right to own a gun. But I ask the same courtesy (for all citizens) which is why mandatory gun ownership ticks me off.\n \n \n \n Why? Either my opinion will change or it won't.\n \n \n \n Nobody's definition of anything is, but to llive in a managable society of laws a legal definition needs to be in place. Somewhere in between the useless DC law and and being able to point and shoot at will.\n \n \n \n All too often.\n \n \n \n But this would be one those times you can pretty much count on them to do something stupid, so I wouldn't let them play with my gun - but thats just me.\n \n \n \n I am not talking about that - I am talking that they knock on the door, cable guy, etc. - someone that you may not know or be able to trust but may have access to your home. \n \n \n \n Agreed.\n \n \n \n What are you talking about? Anyone who owns a gun legally should be expected to responsible with it, anyone who owns one illegally should be prosecuted. Wannabes who do not have weapons and don't break the law may be obnoxious but are hardly something I am going to fret about.\n \n I am hardly fuzzy wuzzy about gangsters. They are a serious problem where I live.\n \n \n \n OK, I stand corrected. Or serious mental health disorders (i.e., schizophrenia).\n \n \n \n I agree that small children are over-medicated for ADD or ADHD and it is hard to diagnose children. (I believe Adderal is the drug of choice for children with ADHD now, much more low-key than Ritalin.)\n \n This is not the case for adults. The seriously mentally have serious symptoms that are unmistakably a problem - spend ten minutes with a decompensating schizophrenic and you will see what I mean. (I used to be a mental health working in Dakota County.)\n \n \n \n I support a combination of the two. \n \n \n \n Just one kid. A class taught by the MN DNR on gun and hunting safety. He also does all his shooting and hunting with my cousin Bill and/or my brother. My brother is a trained police officer and my cousin a 20+ safe and experienced gun owner and instructor for the DNR. My son is not allowed unsupervised access to any gun except his pellet gun.\n \n \n \n It was implied in the outraged response that gun owners be held accountable if they are negligent.\n\n \n OK Leslie, let's get down to what you are saying that conflicts with what you claim you are saying. Sounds innocent enough AT FIRST BLUSH, but it drew Bryan's attention as it does my diagnosis...repeatedly I might add much to your discontent and I am going to show you why...again. I have to assume you are an intelligent and reasonable and responsible person because you keep telling me you are. You keep assuring folks that all we have to do is accept your definition of \"responsible\" which shifts from your claim that \"all you want to do is prevent sales to the bad guys\" and then morph into your \"willfully negligent\" and \"legal responsibility\" credo. ...all of which is directed as a means for some type of legislative loophole and backdoor gun control and you are far from your claim that you \"just don't want the 'bad guys' to have guns\" then you embark an epithet in search of a definition, i.e. RESPONSIBLE, WILLFULLY NEGLIGENT AND LEGAL RESPONSIBILITY. There is no justification for using intrusive definitions that would render gun ownership insecure and deterring ownership by backdoor government coercion. Your attempt to switch horses from \"bad guys\" to broad definitions which would render 2A rights insecure by further intrusion by definition of what you call the \"justice system\" or 'community standards' or whatever else bureaucrats may deem desireable.\n \n You prove my point here: \nAnd further - I am not asking for any laws that would limit a law abiding citizen's access to guns. I do not support them. Just legal repercussions if WILFULL NEGLIGENCE leads to harm.\n \n \n Methinks the lady? protests too much. Lucky for us, women don't know when to shut their pie hole. The 2A says absolutely nothing about \"a law abiding citizens' access to guns\" except that the right SHALL NOT BE INFRINGED. i COULDN'T HELP BUT NOTICE YOU CONTINUE TO USE CITIZEN's as a singular possessive. Freudian slip?\n \n You again attempt to portray your forgotten assertion \"that all you want is to not sell to bad guys\" and morph into your real credo: \nHaving the right to a gun should not automatically negate responsibility.\n\n \n Despite having been shown existing law covers your claimed wants, it is obvious you want to expand a epithet which you are obviously not satisfied with and wish to leave the barn door open for further speculative definition to make it mean whatever the he double l you or some burrocrat or special interest group wants it to mean. \"see,\" as you stomp your little feet, \"now the bad guys don't have guns\" but there are still some \"bad guys\" out there that do have guns and we need more \"responsibility and someone else to be legally responsible\" so, as a government continues to violate the ultimate law of the land.\n \n That my dear, is what is wrong with your attempt at subversion, perversion and attempt to deceive. Shame your poor attempt at manipulation didn't work isn't it. You even share your family life with us to garner sympathy and portray yourself as a poor put upon mother just interested in GUN SAFETY which is not mentioned in the 2A. Like the Good Book, ye shall not add to nor take away!! It is so slick it probably was a thought of the hellion, Rebecca Peters or some such wild eyed shirker.\n \n Your retreat is always to the simple claim of bad guys = no guns but your speil belies your safe harbour and I am stuck in your craw!! and you can't spit me out :)\n \n You really should be more responsible and accept that responsibility for the safety of yourself and family without willfully shirking your legal responsibility to protect their and your own lives. That is every bit as damming as what you portray in your definition as: \n\"I feel this way about ANY kind of willful negligence - driving dangerously or under the influence, leaving babies unattended in bath tubs, leaving electricals open to water, running a furnace you know is emitting kill levels of CO2, letting a toddler play alone by a campfire, etc.\"\n but you stumble when it comes to actually protecting them from predators, sex offenders, gang members etc. simply because you refuse to use the tool most fit for the job and insist that others adopt your definition (which is but an epithet searching for a definition).", 
   {}, 
   404035, 
   null, 
   1275751560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What would be YOUR ideas for \"sensible\" Gun Control laws?", 
  "url": "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14235, 
  "discussion_files": [
   [
    "28329.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-print.html"
   ], 
   [
    "28330.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-7-print.html"
   ], 
   [
    "28331.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-5-print.html"
   ], 
   [
    "28332.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-4-print.html"
   ], 
   [
    "28333.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-6-print.html"
   ], 
   [
    "28334.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-3-print.html"
   ], 
   [
    "28335.html", 
    "http://www.4forums.com/political/gun-control-debates/14235-what-would-your-ideas-sensible-gun-control-laws-2-print.html"
   ]
  ], 
  "identifier": 14235
 }
]