[
 [
  [
   402782, 
   null, 
   "simone", 
   "Man Who Shot Police Had Antigovernment Views\n By THE ASSOCIATED PRESS\n Published: May 21, 2010 \n LITTLE ROCK, Ark. (AP) - An antigovernment Ohio man who had had several run-ins with the police around the country was identified Friday as one of two people suspected of gunning down two officers during a traffic stop in Arkansas.\n \n The Arkansas State Police on Friday identified the pair - killed Thursday during an exchange of gunfire with the police - as Jerry R. Kane Jr., 45, of Forest, Ohio, and his son Joseph T. Kane, believed to be 16.\n \n About 90 minutes before the shootout with the police, Sgt. Brandon Paudert, 39, and Officer Bill Evans, 38, were killed with AK-47 assault rifles after stopping a minivan on Interstate 40 in West Memphis, Ark., the authorities said.\n\n Man Who Shot Police Had Antigovernment Views - NYTimes.com\n \n Geesh! No wonder Canada and Mexico are totally creeped out by the gun nuts in this country!", 
   {
    "post_info": {
     "post_title": "Once Again Right Wing Nutjobs Take Out Some Cops..."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1274625420.0
  ], 
  [
   402789, 
   null, 
   "Baron", 
   "Man Who Shot Police Had Antigovernment Views - NYTimes.com\n \n Geesh! No wonder Canada and Mexico are totally creeped out by the gun nuts in this country!\n\n \n Why exactly is this man a right wing nut job. I say he must be left wing nut job.", 
   {}, 
   402782, 
   null, 
   1274628120.0
  ], 
  [
   402790, 
   null, 
   "Doc Jones", 
   "Why exactly is this man a right wing nut job. I say he must be left wing nut job.\n\n \n \n Yup! Sounds just like the views of the SEIU thugs.\n \n I wonder why he wasn't furnished a school bus? and chaffuer?", 
   {}, 
   402789, 
   null, 
   1274629080.0
  ], 
  [
   402802, 
   null, 
   "simone", 
   "Why exactly is this man a right wing nut job. I say he must be left wing nut job.\n\n Not according to your propaganda.\n \n All lefties want more and more government, they want a total nannystate government.\n \n You can't have it both ways.", 
   {}, 
   402789, 
   null, 
   1274632200.0
  ], 
  [
   402805, 
   null, 
   "simone", 
   "Yup! Sounds just like the views of the SEIU thugs.\n \n I wonder why he wasn't furnished a school bus? and chaffuer?\n\n He couldn't possibly do that! He's one of those \"sovereign\" sonsovitches who don't believe in unions, public schools, public buses.\n \n You can't lie out of both sides of your mouth. Only one-side lying is permitted.", 
   {}, 
   402790, 
   null, 
   1274632740.0
  ], 
  [
   402807, 
   null, 
   "Doc Jones", 
   "He couldn't possibly do that! He's one of those \"sovereign\" sonsovitches who don't believe in unions, public schools, public buses.\n\n \n That would be a public SCHOOL bus, 14 according to CNN so maybe they haven't graduated after 37 or so years? Are you one?\n \n You shouldn't talk about women that way. Or perhaps you are used to it emoticon_smile\n \n \nYou can't lie out of both sides of your mouth. Only one-side lying is permitted.\n\n \n A tip from the expert? That's right simone, you do plenty for both sides left and right. No others needed! emoticon_xclown If you have ever posted a fact it would be a first. emoticon_rolleyes", 
   {}, 
   402805, 
   null, 
   1274634660.0
  ], 
  [
   402846, 
   null, 
   "NATO 556", 
   "Simone,\n \n Kindly shut up. You and the rest of the leftists don't have room to even clear your throat on this issue.\n \n You seem to have a very short memory. You've forgotten that during Bush's presidency your side was guilty of the anti-government mindset. You held large public rallies and spoke out against the government, against the president, against the conservatives and anybody else that didn't support your ideals.\n \n Nobody has forgotten how there were \"retarded president\" jokes because of how he talked, and the comparisons of Bush to a chimpanzee because of facial expressions. Some of the stuff released by the left was really heinous by any measure.", 
   {}, 
   402782, 
   null, 
   1274652480.0
  ], 
  [
   402867, 
   null, 
   "daewoo", 
   "Simone,\n \n Kindly shut up. You and the rest of the leftists don't have room to even clear your throat on this issue.\n \n You seem to have a very short memory. You've forgotten that during Bush's presidency your side was guilty of the anti-government mindset. You held large public rallies and spoke out against the government, against the president, against the conservatives and anybody else that didn't support your ideals.\n \n Nobody has forgotten how there were \"retarded president\" jokes because of how he talked, and the comparisons of Bush to a chimpanzee because of facial expressions. Some of the stuff released by the left was really heinous by any measure.\n\n \n The retarded president jokes were not JUST because of how he talked. They were a product of the fact that the guy did not have the sense that god gave to a little green apple. \n \n As far as the OP is concerned.....\n \n The guy is a XXXXX.\n \n I am not necessarily against shooting police officers, but just shooting a couple and then getting gunned down yourself is stupid. If you are going to go to war, go to war. Dont make a kamakazi run. Fight like you intend to win.", 
   {}, 
   402846, 
   null, 
   1274660160.0
  ], 
  [
   402872, 
   null, 
   "Galileo", 
   "Sounds like this guy had taken lessons in speaking tea bag:\n YouTube - Learn to Speak Tea Bag\n \n Doesn't anyone know what true tyranny is anymore?", 
   {}, 
   402867, 
   null, 
   1274667300.0
  ], 
  [
   402878, 
   null, 
   "daewoo", 
   "Sounds like this guy had taken lessons in speaking tea bag:\n YouTube - Learn to Speak Tea Bag\n \n Doesn't anyone know what true tyranny is anymore?\n\n \n Tyranny.....hmmm.....you mean like when your government claims the right to secretly arrest anybody they want and hold them indefinitely, and make it a crime to even talk about it while at the same time passing unquestionably fascist bills that over 90% of your population opposes???", 
   {}, 
   402872, 
   null, 
   1274670180.0
  ], 
  [
   402946, 
   null, 
   "simone", 
   "Simone,\n \n Kindly shut up. You and the rest of the leftists don't have room to even clear your throat on this issue.\n \n You seem to have a very short memory. You've forgotten that during Bush's presidency your side was guilty of the anti-government mindset. You held large public rallies and spoke out against the government, against the president, against the conservatives and anybody else that didn't support your ideals.\n \n Nobody has forgotten how there were \"retarded president\" jokes because of how he talked, and the comparisons of Bush to a chimpanzee because of facial expressions. Some of the stuff released by the left was really heinous by any measure.\n\n I was opposed to the presidency of George W. Bush but I wouldn't have been a stupid and disrespectful sunnuvavitch who would show up at one of his appearances with a rifle, a gun, or signs threatening death. I never threatened George W. Bush. I seriously thought about tar and feathering him but I never voiced it.\n \n There is a distinct difference between the actions of those who opposed Bush and those who oppose Obama, a difference in terms of respect, overt actions and rhetoric.\n \n Admittedly, I did make a lot of fun about his soft, white girly hands, Bush's hands, but you got to give me a little leeway. And he had some weird, witless fool in his administration who loved to take pictures of George W. Bush's soft, white girly hands. I allus wondered about that.", 
   {}, 
   402846, 
   null, 
   1274718900.0
  ], 
  [
   402950, 
   null, 
   "Symbiote", 
   "I was opposed to the presidency of George W. Bush but I wouldn't have been disrespectful .\n\n \n And you are proud of that?", 
   {}, 
   402946, 
   null, 
   1274719620.0
  ], 
  [
   402951, 
   null, 
   "sinjin", 
   "Why exactly is this man a right wing nut job? I say he must be left wing nut job.\n\n Jerry Kane | Right Wing Watch", 
   {}, 
   402789, 
   null, 
   1274720220.0
  ], 
  [
   402956, 
   null, 
   "Tither", 
   "There are, and I fear that there always be, Wing Nuts. The hope is that no one here slides into one of these categories! emoticon_smile\n \n Just remember that JUST as soon as a Republican becomes president, you guys will switch places with us as Nato has already made that comparison! I'll get an early start. So how come you guys HATE our government! emoticon_smile\n \n Maybe someone will start a website watching you guys compare him or her to Hitler! I will also try to remember to blame every cop shooting on you too! emoticon_rolleyes\n \n I know, maybe it is STILL Bush's fault! emoticon_smile", 
   {}, 
   402951, 
   null, 
   1274723640.0
  ], 
  [
   402970, 
   null, 
   "simone", 
   "And you are proud of that?\n\n The problem is, one must to an extent respect the office while criticizing the hell out of it.\n \n The old respect for law and order which is sadly lacking in the gunnies.", 
   {}, 
   402950, 
   null, 
   1274728320.0
  ], 
  [
   402971, 
   null, 
   "COBHC", 
   "The problem is, one must to an extent respect the office while criticizing the hell out of it.\n \n The old respect for law and order which is sadly lacking in the gunnies.\n\n \n I'm guessing those involved in the American Revolution and the Warsaw Ghetto Uprising \"sadly lacked that that respect for law and order\" also.", 
   {}, 
   402970, 
   null, 
   1274728620.0
  ], 
  [
   402976, 
   null, 
   "sinjin", 
   "There are, and I fear that there always be, Wing Nuts. The hope is that no one here slides into one of these categories! emoticon_smile\n \n Just remember that JUST as soon as a Republican becomes president, you guys will switch places with us as Nato has already made that comparison! I'll get an early start. So how come you guys HATE our government! emoticon_smile\n \n Maybe someone will start a website watching you guys compare him or her to Hitler! I will also try to remember to blame every cop shooting on you too! emoticon_rolleyes\n \n I know, maybe it is STILL Bush's fault! emoticon_smile\n\n \n Firing Back on Right-Wing Domestic Terrorism | OurFuture.org", 
   {}, 
   402956, 
   null, 
   1274729280.0
  ], 
  [
   402987, 
   null, 
   "NATO 556", 
   "I was opposed to the presidency of George W. Bush but I wouldn't have been a stupid and disrespectful sunnuvavitch who would show up at one of his appearances with a rifle, a gun, or signs threatening death. I never threatened George W. Bush. I seriously thought about tar and feathering him but I never voiced it.\n\n \n Kindly point out the examples where somebody other than the Secret Service brought a gun directly to one of Obama's speeches, rather than the general location where he was going to be, when he wasn't even there.\n \n Being at a designated presidential speech zone, and armed and hour before the president shows up, simply doesn't count. Being a block away an armed doesn't count.\n \n Sharing the words of our Founding Fathers criticizing tyranny doesn't count as being disrespectful.\n \n The only way a sign such as \"It's time to water the tree of liberty\" could qualify as disrespectful, would be if you honestly believe the government has become tyrannical in nature.\n \n \nThere is a distinct difference between the actions of those who opposed Bush and those who oppose Obama, a difference in terms of respect, overt actions and rhetoric.\n\n \n No there isn't. There's no wiggle room in here.\n \n \nThe old respect for law and order which is sadly lacking in the gunnies.\n\n \n Show me the lack of respect for law and order that we're accused of displaying.", 
   {}, 
   402946, 
   null, 
   1274737140.0
  ], 
  [
   402992, 
   null, 
   "Shooterandproud", 
   "This thread is quite ironic, considering the fact that Simone has demonstrated to us the need for defending ourselves against these nutjobs.", 
   {}, 
   402987, 
   null, 
   1274739240.0
  ], 
  [
   403034, 
   null, 
   "Bryan", 
   "The problem is, one must to an extent respect the office while criticizing the hell out of it.\n \n The old respect for law and order which is sadly lacking in the gunnies.\n\n \n Speaking of law and order, whatever happened to the legal principle of individual responsibility? The belief that each man or woman is judged by how they act and what they say? Where no man is held accountable for the actions, undertaken without his knowledge or consent, of persons he has never met or even knew of beforehand?\n \n Right wing, left wing, midfielder, fullback, who cares? Is the Ohio man described in the article responsible for his own crimes-or am I as a \"gunnie\" somehow to blame? \n \n Stereotyping is such sweet poison for the mind. It makes things so simple: \"Even though in the past I have criticized my government I have always been a champion of law and order. Therefore, those who disagree with me-all the 'gunnies' out there-must have no respect for law and order. They must all have anti-government views similar to those of our alleged Ohio gunman. That's why people in Canada and Mexico are right to fear them as much as I do.\"\n \n Meanwhile, in the real world, some of us gunnies do actually work for the government in the field of law and order. Some of us actually work to hold people accountable for crimes committed with a gun. I'm not made of Play-Doh, Simone, and I refuse to fit into your one-size-fits-all mold. \n \n This type of mass dismissal by stereotyping is just another example of the hubris that underlies your desire to call everyone who disagrees with you a \"gun nut\": \"I know I'm smart, and I know I'm right, therefore your disagreement with me is proof of your insanity.\" I've had to deal with the issue of criminal insanity before, and for that reason I have a copy of the DMS IV for reference. I've searched it from cover to cover, and I can find no recognized disorder associated with the symptom \"does not agree with Simone.\" \n \n --\n \n \"God has entrusted me with myself.\"--Epictetus", 
   {
    "post_info": {
     "post_title": "individual responsibility"
    }, 
    "unicode_changes_made": true
   }, 
   402970, 
   null, 
   1274753220.0
  ], 
  [
   403045, 
   null, 
   "Galileo", 
   "Kindly point out the examples where somebody other than the Secret Service brought a gun directly to one of Obama's speeches, rather than the general location where he was going to be, when he wasn't even there.\n \n Being at a designated presidential speech zone, and armed and hour before the president shows up, simply doesn't count. Being a block away an armed doesn't count.\n \n Sharing the words of our Founding Fathers criticizing tyranny doesn't count as being disrespectful.\n \n The only way a sign such as \"It's time to water the tree of liberty\" could qualify as disrespectful, would be if you honestly believe the government has become tyrannical in nature.\n \n \n \n No there isn't. There's no wiggle room in here.\n \n \n \n Show me the lack of respect for law and order that we're accused of displaying.\n\n You're the one that said, \"And if the Founding Fathers could see what has become of the republic they fought so hard to create, they'd be calling for a massive rebellion of the people against the government.\"\n \n I don't know of anyone who opposed Bush who came close to saying that a mass rebellion was justified during the time he was president.", 
   {}, 
   402987, 
   null, 
   1274756340.0
  ], 
  [
   403047, 
   null, 
   "Symbiote", 
   "\n I don't know of anyone who opposed Bush who came close to saying that a mass rebellion was justified during the time he was president.\n\n \n Showing once again that the left has lost their balls, that was the perfect time for a mass rebellion, but instead you used it to elect someone with virtually identical policies.", 
   {}, 
   403045, 
   null, 
   1274758020.0
  ], 
  [
   403050, 
   null, 
   "Doc Jones", 
   "Showing once again that the left has lost their balls, that was the perfect time for a mass rebellion, but instead you used it to elect someone with virtually identical policies.\n\n \n Well, I suppose I shouldn't have been drinking coffee and reading at the same time emoticon_xgood", 
   {}, 
   403047, 
   null, 
   1274777400.0
  ], 
  [
   403061, 
   null, 
   "Tither", 
   "Firing Back on Right-Wing Domestic Terrorism | OurFuture.org\n\n Awe.. Isn't that cute. A little Left winged Blog. \n \n Well, alright. I will use the Left's sources too! \n \n From the Huff. Po.\n   G20 Protesters Ordered To Stop March By Pittsburgh Police \n The marchers included small groups of self-described anarchists, some wearing dark clothes and bandanas and carrying black flags. Others wore helmets and safety goggles.\n One banner read, \"No borders, no banks,\" another, \"No hope in capitalism.\" A few minutes into the march, protesters unfurled a large banner reading \"NO BAILOUT NO CAPITALISM\" with an encircled \"A,\" a recognized sign of anarchists.\n \n Protesters split into smaller groups. Some rolled large metal trash bins toward police, and a man in a black hooded sweat shirt threw rocks at a police car, breaking the front windshield. Protesters broke 10 windows in a few businesses, including a bank branch, a Boston Market restaurant and a BMW dealership, police said.\n\n Times London.\n   Police embroiled in violent battles with G20 protesters \n In riots which continued through evening rush hour, about 300 protesters were reported to have remained from an initial crowd of 2,000 in Bloomfield, Pittsburgh's Little Italy.\n \n \"In response to having sticks, bricks and rocks thrown at them in the Shady Side neighborhood of Pittsburgh, police responded with bean bag rounds and dispersed the crowd,\" Bill Crowley, an FBI agent, told the AFP news agency.\n", 
   {
    "unicode_changes_made": true
   }, 
   402976, 
   null, 
   1274795280.0
  ], 
  [
   403064, 
   null, 
   "simone", 
   "I'm guessing those involved in the American Revolution and the Warsaw Ghetto Uprising \"sadly lacked that that respect for law and order\" also.\n\n Um, actually, those folks were getting after the lawlessness of the East India Company.\n \n Ya know, the old rights of people vs the lawlessness of the corporation?", 
   {}, 
   402971, 
   null, 
   1274796420.0
  ], 
  [
   403065, 
   null, 
   "sinjin", 
   "What's one have to do with the other?", 
   {}, 
   403061, 
   null, 
   1274796480.0
  ], 
  [
   403066, 
   null, 
   "simone", 
   "Kindly point out the examples where somebody other than the Secret Service brought a gun directly to one of Obama's speeches, rather than the general location where he was going to be, when he wasn't even there.\n\n \nAug. 18 (Bloomberg) -- Armed protesters asserting their right to bear arms, including a man with a rifle slung over his shoulder, gathered yesterday near a Phoenix convention hall where President Barack Obama spoke, a police spokesman said.\n \n The protesters were taking advantage of an Arizona law that allows people to carry unconcealed guns, Phoenix Police Department spokesman Andy Hill said. Police made no arrests.\n \n \"Plainclothes police officers continually monitored the situation and no threats, either physical or verbal, were made,\" Hill said in an e-mail.\n \n The incident marked the third occasion in a week when guns have been linked to an Obama event. On Aug. 11, police arrested a man for having a loaded, unlicensed gun in his car near a New Hampshire school where Obama later held a health-care forum, USA Today reported. In a separate incident, another man outside that event displayed a gun in a holster on his leg, the paper said. \n\n Armed People Carry Guns Near Obama Event, Police Say (Update1) - Bloomberg.com\n \n \nBeing at a designated presidential speech zone, and armed and hour before the president shows up, simply doesn't count. Being a block away an armed doesn't count....\n\n That was George W. Bush's policies. He was so afraid of the American people he couldn't bear to be anywhere near them.", 
   {
    "unicode_changes_made": true
   }, 
   402987, 
   null, 
   1274796960.0
  ], 
  [
   403067, 
   null, 
   "Tither", 
   "What's one have to do with the other?\n\n Oh I don't know. One man calls another group terrorist for political gain, when reality may not appear to be what it seems! emoticon_smile \n \n At least I recognize that truth! \n \n Anti-government Anarchist are not the mainstream. Maybe one should watch what one labels another for political gain! We are all Americans with pretty much the same goals. A better America. \n \n See Brian's post to Simone.", 
   {}, 
   403065, 
   null, 
   1274797080.0
  ], 
  [
   403070, 
   null, 
   "sinjin", 
   "At least I recognize that truth!\nI've seen no evidence of this ability in you. \n \n \nAnti-government Anarchist are not the mainstream. Maybe one should watch what one labels another for political gain!\nAmerican anarchist have a considerably smaller following than say, the Teabaggers. \n \n \nWe are all Americans with pretty much the same goals. A better America.\nThank you Rodney King. What does that matter when our visions of a \"better\" America are vastly divergent?\n \n \n \nSee Brian's post to Simone.\nBryan's advice would apply to both sides of the aisle as I see it. Just swap \"gun grabber\" for \"gunnie\" and it reads just as well.", 
   {}, 
   403067, 
   null, 
   1274798940.0
  ], 
  [
   403072, 
   null, 
   "Penfold", 
   "Well, I suppose I shouldn't have been drinking coffee and reading at the same time emoticon_xgood\n\n \n \n That would be overtaxing your neurone a tad. emoticon_rolleyes", 
   {}, 
   403050, 
   null, 
   1274799960.0
  ], 
  [
   403075, 
   null, 
   "Tither", 
   "Sinjin. What all of this means is, have a nice day! emoticon_smile\n \n This whole thread is ridiculous, dividing, and baiting! I had my say, and I find no reason to comment further. emoticon_rolleyes", 
   {}, 
   403072, 
   null, 
   1274802960.0
  ], 
  [
   403076, 
   null, 
   "NATO 556", 
   "Armed People Carry Guns Near Obama Event, Police Say (Update1) - Bloomberg.com\n\n \n NEAR! As in close to but not in the direct company of. Sorry Simone, you lose yet again.\n \n Also note that the guy with the rifle was a black man. A soul brother to Obama, showing up armed for the protest. That shoots your racism theory to hell.\n \n \nThat was George W. Bush's policies. He was so afraid of the American people he couldn't bear to be anywhere near them.\n\n \n Kindly provide the evidence to support this statement.", 
   {}, 
   403066, 
   null, 
   1274803080.0
  ], 
  [
   403079, 
   null, 
   "sinjin", 
   "Also note that the guy with the rifle was a black man. A soul brother to Obama, showing up armed for the protest. That shoots your racism theory to hell.\nNot as it applies to you personally. Soul brother? You're too much.", 
   {}, 
   403076, 
   null, 
   1274804460.0
  ], 
  [
   403082, 
   null, 
   "simone", 
   "NEAR! As in close to but not in the direct company of. Sorry Simone, you lose yet again.\n \n Also note that the guy with the rifle was a black man. A soul brother to Obama, showing up armed for the protest. That shoots your racism theory to hell.\n \n Kindly provide the evidence to support this statement.\n\n \nAs president, Bush has widened his restrictions on demonstrations against his policies. Anti-Bush protesters are now relegated to what are euphemistically called Free Speech Zones. These areas are cordoned off as far as a mile away from the president and the main thoroughfares, so that Bush cannot see the demonstrators, or their signs of protest, nor hear their chants. \n\n What is a Free Speech Zone?\n \n Bush is innately afraid of people he does not know. Witness his idiotic behavior recently in Haiti where he was so stricken with fear after shaking the hand of a Haitian he had to wipe his hands on Bill Clinton's shirt.\n \n The guy is such an embarrassing scaredy cat we can't even allow him to go abroad where he will probably embarrass us.", 
   {}, 
   403076, 
   null, 
   1274807760.0
  ], 
  [
   403085, 
   null, 
   "Doc Jones", 
   "What is a Free Speech Zone?\n \n Bush is innately afraid of people he does not know. Witness his idiotic behavior recently in Haiti where he was so stricken with fear after shaking the hand of a Haitian he had to wipe his hands on Bill Clinton's shirt.\n \n The guy is such an embarrassing scaredy cat we can't even allow him to go abroad where he will probably embarrass us.\n\n \n News Flash! Bush is no longer President. He didn't run in 2008 and has been long gone.\n \n These protestors you speak of exercising their protest rights while armed, how far from the new president were they. What is changed? Besides a crumbling economy and promise of much higher taxes to take approximately 75% of peoples' paychecks and make America a third world nation? A move by the present occupant to get gun control through a backdoor U.N. treaty with the aid of Hilliary?\n \n Whatever the case, you can't blame Bush now...he is history. The new thugocracy belongs to Obama you better check out his plans.\n \n You milked this topic to death and now it is a sounding board for you malcontents to pound left wing dogma and propaganda on. It is done. Finished. If you want to continue your diatribe go ahead alone. I will post no more on this crud topic.", 
   {
    "post_info": {
     "post_title": "Update! Urgent:"
    }
   }, 
   403082, 
   null, 
   1274815080.0
  ], 
  [
   403086, 
   null, 
   "NATO 556", 
   "What is a Free Speech Zone?\n \n Bush is innately afraid of people he does not know. Witness his idiotic behavior recently in Haiti where he was so stricken with fear after shaking the hand of a Haitian he had to wipe his hands on Bill Clinton's shirt.\n \n The guy is such an embarrassing scaredy cat we can't even allow him to go abroad where he will probably embarrass us.\n\n \n Are these free speech zones still in place? Did Obama do away with them or has he left them to continue? If they're still in effect then is Obama a scaredy cat as well?", 
   {}, 
   403082, 
   null, 
   1274815620.0
  ], 
  [
   403097, 
   null, 
   "COBHC", 
   "Um, actually, those folks were getting after the lawlessness of the East India Company.\n \n Ya know, the old rights of people vs the lawlessness of the corporation?\n\n \n What? Everyone knows that the British government was definitely a huge factor in the American Revolution. \"No taxation without representation.\" But you and yours think \"the bigger the government, the better.\" And Obama thinks he can solve all problems by shoveling your money onto them.", 
   {}, 
   403064, 
   null, 
   1274823780.0
  ], 
  [
   403123, 
   null, 
   "Galileo", 
   "A lot of pro-gun activists give lip service to the idea of rebelling against the government. Then when a case like this comes along they take off running in the opposite direction, eager to distance themselves from anybody who would actually rebel against the government. Their bark is a lot scarier than their bite.", 
   {}, 
   403097, 
   null, 
   1274840400.0
  ], 
  [
   403124, 
   null, 
   "NATO 556", 
   "A lot of pro-gun activists give lip service to the idea of rebelling against the government. Then when a case like this comes along they take off running in the opposite direction, eager to distance themselves from anybody who would actually rebel against the government. Their bark is a lot scarier than their bite.\n\n \n Cold blooded murder isn't rebelling against the government.", 
   {}, 
   403123, 
   null, 
   1274841660.0
  ], 
  [
   403150, 
   null, 
   "Tither", 
   "Input the words 2nd Amendment in for the word race. \n   Race baiting \n Race baiting is the act of using racially derisive language, actions or other forms of communication to anger or intimidate a person or groups of people, or to make those persons behave in ways that are inimical to their personal or group interests. The term race in this context can be construed very broadly to include the social constructs which define race or racial difference, as well as ethnic, religious, (Tither's comment. Belief in the 2nd Amendment of the Constitution) gender and economic differences. Thus the use of any language or actions for the purpose of exploiting actual or perceived weaknesses in persons who can be identified as members of certain groups in order to do them some sort of harm can be contained within the concept of \"race baiting.\"\n \n \n Another definition says \n Race (2nd Amendment) baiting is the use of racially (2nd Amendment) derisive language, actions or other forms of communication, to anger, intimidate or incite a person or groups of people, or to make those persons behave in ways that are inimical, and often harmful to their personal or group interests. Race (2nd Amendment) baiting can also be accomplished by implying that there is an underlying race (2nd Amendment) -based motive in the actions of others towards the group baited, where none in fact exists. \n\n \n I have been giving this statement much thought,\n \nThank you Rodney King. What does that matter when our visions of a \"better\" America are vastly divergent?\n\n and I have decided to add, this, not just to you, Sinjin, but this is for everyone who believes this to be true. \n \n I asked in an earlier thread, about the idea of letting you guys have your very own form of a Progressive heaven, by letting you succeed from the Union! We could make arrangements to give you California, NY and or whatever states go along with your progressive ideals. \n \n It pains me to see you guys in so much distress! You desperately want to control us, but we don't want to be controlled by you, and it is our Constitutional RIGHT not to be controlled by you! \n \n These differences seem pretty much un-reconcilable, and is likely going to tear us apart! I don't think you guys are happy under this Constitutional Form of government called a Republic, and we despise what you are trying to change us into. Let us part ways amicably. It is a good solution to our divergent problems of control. \n \n Otherwise I say to ALL Americans, Our side and yours, Obey the Constitution, The Supreme law of our Land!", 
   {
    "unicode_changes_made": true
   }, 
   403124, 
   null, 
   1274881500.0
  ], 
  [
   403153, 
   null, 
   "sinjin", 
   "Why would one fold when holding a winning hand?\n \n I'm a Unionist. I don't want to secede.\n \n \n \n Whistle Dixie all you like, in the end we prevail.\n \n We being the non-Teabagging majority.\n \n \n What I found sad about the story in the OP was that a proud, loyal son had to die because \n his father was a nutter and filled the boy's head with conspiracy nonsense.", 
   {}, 
   403150, 
   null, 
   1274884380.0
  ], 
  [
   403156, 
   null, 
   "simone", 
   "News Flash! Bush is no longer President. He didn't run in 2008 and has been long gone.\n \n These protestors you speak of exercising their protest rights while armed, how far from the new president were they. What is changed? Besides a crumbling economy and promise of much higher taxes to take approximately 75% of peoples' paychecks and make America a third world nation? A move by the present occupant to get gun control through a backdoor U.N. treaty with the aid of Hilliary?\n \n Whatever the case, you can't blame Bush now...he is history. The new thugocracy belongs to Obama you better check out his plans.\n \n You milked this topic to death and now it is a sounding board for you malcontents to pound left wing dogma and propaganda on. It is done. Finished. If you want to continue your diatribe go ahead alone. I will post no more on this crud topic.\n\n Officially, George W. Bush is no longer the president but his wretched policies live on to continue to destroy us and our nation, and he has dozens of minions buried in various departments, Justice, Defense, Interior, Treasury, to carry out his policies.\n \n And Republican Senators balk at allowing Obama to install his own people in his own cabinet so I'm not sure that it's the Obama presidency yet. There are too many administrative holes in the administration that Republicans won't allow Obama to fill.", 
   {}, 
   403085, 
   null, 
   1274887140.0
  ], 
  [
   403157, 
   null, 
   "simone", 
   "What? Everyone knows that the British government was definitely a huge factor in the American Revolution. \"No taxation without representation.\" But you and yours think \"the bigger the government, the better.\" And Obama thinks he can solve all problems by shoveling your money onto them.\n\n \nThe British East India Company had controlled all tea trading between India and the British colonies. As a result of the tea tax, the colonies refused to buy the British tea. Instead, they smuggled tea in from Holland. This left the British East India Company with warehouses full of unsold tea, and the company was in danger of going out of business.\n \n The British government was determined to prevent the British East India Company from going out of business. It was going to force the colonists to buy their tea. In May 1773, Prime Minister North and the British parliament passed the Tea Act. The Tea Act allowed the British East India Company to sell tea directly to the colonists, bypassing the colonial wholesale merchants. This allowed the company to sell their tea cheaper than the colonial merchants who were selling smuggled tea from Holland.\n \n This act revived the colonial issue of taxation without representation. The colonies once again demanded that the British government remove the tax on tea. In addition, the dockworkers began refusing to unload the tea from ships.\n\n The Boston Tea Party", 
   {}, 
   403097, 
   null, 
   1274887320.0
  ], 
  [
   403159, 
   null, 
   "NATO 556", 
   "Officially, George W. Bush is no longer the president but his wretched policies live on to continue to destroy us and our nation, and he has dozens of minions buried in various departments, Justice, Defense, Interior, Treasury, to carry out his policies.\n \n And Republican Senators balk at allowing Obama to install his own people in his own cabinet so I'm not sure that it's the Obama presidency yet. There are too many administrative holes in the administration that Republicans won't allow Obama to fill.\n\n \n Bull****. Obama has his regulatory czars and they answer to nobody but him! They're beyond congressional oversight or approval.\n \n There's no such thing as an Obama presidency going on, because it's an Obama dictatorship. If you think for one minute that Obama, with all of his power to run this country into the ground, is impotent to change things that the Bush presidency set into place, you're more foolish than I thought.\n \n If the democrats could ram through that damn healthcare reform bill without republican support, then there's nothing stopping them from changing Bush-era policies at will.", 
   {}, 
   403156, 
   null, 
   1274888460.0
  ], 
  [
   403165, 
   null, 
   "simone", 
   "Given the reality of where your head is positioned, Nato, I can see that there is little purpose in arguing with you.", 
   {}, 
   403159, 
   null, 
   1274889480.0
  ], 
  [
   403170, 
   null, 
   "Baron", 
   "Given the reality of where your head is positioned, Nato, I can see that there is little purpose in arguing with you.\n\n \n Nor is there any purpose in arguing with you, Simone. It is clear that your head is positioned in the opposite direction.", 
   {}, 
   403165, 
   null, 
   1274889840.0
  ], 
  [
   403171, 
   null, 
   "NATO 556", 
   "Given the reality of where your head is positioned, Nato, I can see that there is little purpose in arguing with you.\n\n \n It takes a wise person to realize that they're in a fight they have no hope of winning.\n \n Glad to see that you've become wise for a change.", 
   {}, 
   403165, 
   null, 
   1274889900.0
  ], 
  [
   403174, 
   null, 
   "Tither", 
   "I sense a lot of HATE and Hostility here lately. Anyone else notice it? It is kind of like the wheels are falling off of all that the Progressives agenda, and all that they hoped to accomplish. \n \n \nWhy would one fold when holding a winning hand?\n \n I'm a Unionist. \n\n Which union? SEIU, AFL-CIO, teamsters? \n \nI don't want to secede.\n\n I see I misspelled a word. Good catch! Headache meds. I have to take them in order to survive it. But thanks for clarifying what I actually meant. Much appreciated!! emoticon_smile\n \nWhistle Dixie all you like, in the end we prevail.\n \n We being the non-Teabagging majority.\n\n I liked what you said here, but for one thing. I think this could be larger. Look at the power this has. \n \nWhistle Dixie all you like, in the end we prevail.\n\n This way it sounds much more ominous and seditious! \n \n \nWhat I found sad about the story in the OP was that a proud, loyal son had to die because his father was a nutter and filled the boy's head with conspiracy nonsense.\n\n Yeah. Me too! But this is not my fault, no matter how much you want to make it that it is, \n so that ==< \"in the end we prevail.\".\n \n I know, Maybe it is Bush's fault! emoticon_hb", 
   {}, 
   403153, 
   null, 
   1274890140.0
  ], 
  [
   403175, 
   null, 
   "sinjin", 
   "I sense a lot of HATE and Hostility here lately. Anyone else notice it? It is kind of like the wheels are falling off of all that the Progressives agenda, and all that they hoped to accomplish. \nI haven't an once of hate for you or any other fellow American. \n You are welcome in my America. Too bad you presume to tell me I'm not welcome in yours, especiallly since it ain't. \n \n \nWhich union? SEIU, AFL-CIO, teamsters?\nThe one the Civil War was fought to preserve. \n \n \nI see I misspelled a word. Good catch! Headache meds. I have to take them in order to survive it. But thanks for clarifying what I actually meant. Much appreciated!! emoticon_smile\nSorry for your pain.\n \n \nI liked what you said here, but for one thing. I think this could be larger. Look at the power this has. \n \n This way it sounds much more ominous and seditious!\nYou have open contempt for your own government and I'm the seditious one? \n \n \nYeah. Me too! But this is not my fault, no matter how much you want to make it that it is,\nNot your fault, the fault of those to which you provide aid and comfort, metaphorically speaking. \n \n \nso that ==< \"in the end we prevail.\".\nMe and the Mexicans. Gays too. \n \n \nI know, Maybe it is Bush's fault!\n\"W\" ain't no Teabagger. \n \"W\" recognizes the legitimately elected administration.", 
   {}, 
   403174, 
   null, 
   1274892240.0
  ], 
  [
   403177, 
   null, 
   "COBHC", 
   "The Boston Tea Party\n\n \n \nThe American Revolution was the political upheaval during the last half of the 18th century in which thirteen colonies in North America joined together to break free from the British Empire, combining to become the United States of America. They first rejected the authority of the Parliament of Great Britain to govern them from overseas without representation, and then expelled all royal officials. By 1774 each colony had established a Provincial Congress, or an equivalent governmental institution, to form individual self-governing states. Through representatives sent in 1775 to the Second Continental Congress, they joined together at first to defend their respective self-governance and manage the armed conflict against the British known as the American Revolutionary War (1775-83, also American War of Independence). Ultimately, the states collectively determined that the British monarchy, by acts of tyranny, could no longer legitimately claim their allegiance. They then severed ties with the British Empire in July 1776, when the Congress issued the Declaration of Independence, rejecting the monarchy on behalf of the new nation. The war ended with effective American victory in October 1781, followed by formal British abandonment of any claims to the United States with the Treaty of Paris in 1783.\n\n American Revolution - Wikipedia, the free encyclopedia\n \n You've drank enough Koolaid, simone.", 
   {
    "unicode_changes_made": true
   }, 
   403157, 
   null, 
   1274895660.0
  ], 
  [
   403178, 
   null, 
   "Tither", 
   "I haven't an once of hate for you or any other fellow American. \n You are welcome in my America. Too bad you presume to tell me I'm not welcome in yours, especiallly since it ain't. \n\n Let me return the kindness. The correct spelling is ==< especially \n \nYou have open contempt for your own government and I'm the seditious one? \n\n I Love my government and my Constitution! In fact many of us fought for it. Where did you pull that out of? Where your pants cover? emoticon_smile \n \n You do recognize the concept of tong and cheek, don't you? \n \n \nNot your fault, the fault of those to which you provide aid and comfort, metaphorically speaking. \n\n Lets see, Aid and comfort. Do you mean those who believe in the Constitution and the rule of law? That is who I give aid and comfort to! Why, where do you sit on the Constitution and the role of government defined by it? emoticon_smile\n \n \nMe and the Mexicans. Gays too. \n\n Personally, I think you presume Way too much! You flatter yourself thinking you speak for them, let alone me. emoticon_smile\n \n \n \"W\" ain't no Teabagger. \n \"W\" recognizes the legitimately elected administration.\n\n Really? I don't even know where George Bush stands on the Tea Party. \n \n What exactly is a Tea Bagger in your view? What is clear is your HATE and intolerance for the political views of other Americans that believe in the Constitution and the Rule of Law is quite evident! \n \n I know those who are in the Tea Party generally believe in a more limited government, abiding by our Constitution, and staying within our budget constraints, and not mortgaging our children's future, to China!\n \n Why, what LIES do you hope to pin on them? emoticon_smile\n \n I was wrong about this thread. It is both funny, and the hate filled rhetoric is quite revealing! emoticon_smile This is a HOOT! emoticon_smile", 
   {}, 
   403175, 
   null, 
   1274899740.0
  ], 
  [
   403179, 
   null, 
   "NATO 556", 
   "I think it's about time to deflate Simone yet again.\n \n First let's look at the shooter. Jerry Kane. According to the Brady Campaign site this guy has had a long rap sheet of criminal acts. Passing bad checks, criminal trespassing, drunk driving, felonious assault of a minor, etc. So obviously this was a bad dude all around, a criminal. Why exactly wasn't he serving time in a prison cell?\n \n So now that we've established this guy has a criminal history, his shootout with the cops wasn't a matter of \"right wing anti-government paranoia\", it was a criminal/felon deciding to go cop killing; a crime that's supposed to carry the death penalty in certain states.\n \n Second, let's look at the facts. Opening fire on a couple of cops isn't the course of action that would be taken by somebody supposedly rebelling against the government. A real matter of rebellion would be launching an attack on a company or organization with close ties to the liberal government and is getting considerable funding and favors from them. \n \n If this guy had blown up a bank or an IRS building, or opened fire on FEMA headquarters then you might have some sort of claim. But as it is with all of the facts, it was nothing more than an ambush by a criminal who should've been locked up in a prison cell, rather than being allowed to roam the streets like a free man.\n \n Sorry Simone, the facts simply aren't with you. You lose again.", 
   {}, 
   403178, 
   null, 
   1274900880.0
  ], 
  [
   403181, 
   null, 
   "simone", 
   "American Revolution - Wikipedia, the free encyclopedia\n \n You've drank enough Koolaid, simone.\n\n That would be:\n \n You've DRUNK enough Kool-Aid, COBHC.", 
   {}, 
   403177, 
   null, 
   1274901120.0
  ], 
  [
   403182, 
   null, 
   "sinjin", 
   "I Love my government and my Constitution! In fact many of us fought for it.\nSo have many who don't share your politics. \n \n \nYou do recognize the concept of tong and cheek, don't you?\nI think you mean tongue and cheek and no, it's often difficult to detect sarcasm in print. \n \n \nLets see, Aid and comfort. Do you mean those who believe in the Constitution and the rule of law? That is who I give aid and comfort to!\nPlenty of fruitcakes can make that claim. What else do they believe is the question?\n \n \nWhy, where do you sit on the Constitution and the role of government defined by it? emoticon_smile\nThird row center.\n \n \nPersonally, I think you presume Way too much! You flatter yourself thinking you speak for them, let alone me. emoticon_smile\nI'm speaking in support of them, not speaking in their place.\n \n \nReally? I don't even know where George Bush stands on the Tea Party.\nFar, far away. \n \n \nWhat exactly is a Tea Bagger in your view?\nSomeone foolish enough to believe Democrats are the enemy of our Democracy.\n \n \nWhat is clear is your HATE and intolerance for the political views of other Americans that believe in the Constitution and the Rule of Law is quite evident!\nAgain with the HATE. I believe in those same things without sharing your political opinions. You seem to find that incredible.\n \n \nI know those who are in the Tea Party generally believe in a more limited government, abiding by our Constitution, and staying within our budget constraints, and not mortgaging our children's future, to China!\nThose signs we keep seeing seem to go a bit further.\n \n \nWhy, what LIES do you hope to pin on them? emoticon_smile\nThey don't need my help showing their true colors.\n \n \nI was wrong about this thread. It is both funny, and the hate filled rhetoric is quite revealing! emoticon_smile This is a HOOT! emoticon_smile\nI don't find rhetoric that precipitates murder humorous.", 
   {}, 
   403178, 
   null, 
   1274901480.0
  ], 
  [
   403184, 
   null, 
   "COBHC", 
   "That would be:\n \n You've DRUNK enough Kool-Aid, COBHC.\n\n \n Wow, that really helped prove your point. emoticon_rolleyes", 
   {}, 
   403181, 
   null, 
   1274902260.0
  ], 
  [
   403186, 
   null, 
   "sinjin", 
   "So now that we've established this guy has a criminal history, his shootout with the cops wasn't a matter of \"right wing anti-government paranoia\", it was a criminal/felon deciding to go cop killing...\n\n \n Ohioan?s anti-government views built over years | The Columbus Dispatch", 
   {}, 
   403179, 
   null, 
   1274903940.0
  ], 
  [
   403193, 
   null, 
   "simone", 
   "Wow, that really helped prove your point. emoticon_rolleyes\n\n Just trying to up your communication skills a bit, COBHC, so you don't look like a total hick.", 
   {}, 
   403184, 
   null, 
   1274907720.0
  ], 
  [
   403194, 
   null, 
   "Brady", 
   "Bull****. Obama has his regulatory czars and they answer to nobody but him! They're beyond congressional oversight or approval.\n \n There's no such thing as an Obama presidency going on, because it's an Obama dictatorship. If you think for one minute that Obama, with all of his power to run this country into the ground, is impotent to change things that the Bush presidency set into place, you're more foolish than I thought.\n \n If the democrats could ram through that damn healthcare reform bill without republican support, then there's nothing stopping them from changing Bush-era policies at will.\n\n Please do all us all a favor - take your antipsychotic meds before posting!", 
   {}, 
   403159, 
   null, 
   1274908020.0
  ], 
  [
   403200, 
   null, 
   "NATO 556", 
   "Please do all us all a favor - take your antipsychotic meds before posting!\n\n \n Please do all of us a favor - stop blaming the conservatives and gun owners for the illegal actions of criminals.", 
   {}, 
   403194, 
   null, 
   1274912820.0
  ], 
  [
   403203, 
   null, 
   "Tither", 
   "So have many who don't share your politics. \n \n Plenty of fruitcakes can make that claim. What else do they believe is the question?\n \n Someone foolish enough to believe Democrats are the enemy of our Democracy.\n\n What politics are those? I am 62 years old and I have voted for more Democrats that you have! emoticon_smile\n \n My wife is Filipino and of Spanish decent to boot! I have an extended immediate Spanish family of 42, who I love dearly. It will be a little hard for you to paint me with the brush you so desperately want to paint me with! emoticon_smile \n \n The American People voted Obama in and gave all political power to the Democrats. However, NOW they have seen what they have done, and the values they have, and have begun to repudiate these Big, over bloated, government ideals. It is not because of racism, or they dislike Democrats, they just dislike THESE Democrats, and what they have done! emoticon_smile \n \n Like I said, the HATE and rhetoric in this thread is a hoot! Do you really think that We the American People are buying the stuff you are trying to sell them! emoticon_smile If so keep peddling it! \n \n \nI don't find rhetoric that precipitates murder humorous.\n\n Who does? If this were only a thread about murder then I wouldn't be posting to that kind of divisive, bating, rhetoric, but as I have posted to only political humor, the readers of this forum can decide for themselves if you just tried to deceive them yet again! emoticon_smile\n \n Please keep talking! I am sure the passersby are getting an eye, or ear full! I know I have, and I am seriously shocked at the level of intolerance you guys are displaying! \n \n You guys should be thanking your lucky stars that a lot of people do not tend this forum, but I am sure getting a hoot out of it! emoticon_smile", 
   {}, 
   403182, 
   null, 
   1274913720.0
  ], 
  [
   404051, 
   null, 
   "Galileo", 
   "Cold blooded murder isn't rebelling against the government.\n\n So what kind of rebellion would you favor? The US already had one civil war. It doesn't need another. I'm sure that if the US became a war zone like Iraq, Sudan, and Afghanistan have been in recent years that a lot of innocent Americans would die. Some people are too idealistic and not realistic enough.", 
   {}, 
   403124, 
   null, 
   1275726780.0
  ], 
  [
   404069, 
   null, 
   "NATO 556", 
   "So what kind of rebellion would you favor? The US already had one civil war. It doesn't need another. I'm sure that if the US became a war zone like Iraq, Sudan, and Afghanistan have been in recent years that a lot of innocent Americans would die. Some people are too idealistic and not realistic enough.\n\n \n Can you tell the difference between a criminal killing a person for no good reason, and soldiers fighting against foreign invaders to preserve what they believe is worth dying for?", 
   {}, 
   404051, 
   null, 
   1275750180.0
  ], 
  [
   404094, 
   null, 
   "Penfold", 
   "Can you tell the difference between a criminal killing a person for no good reason, and soldiers fighting against foreign invaders to preserve what they believe is worth dying for?\n\n \n Can you not tell the difference between a civil war and repelling an American invasion?", 
   {}, 
   404069, 
   null, 
   1275771060.0
  ], 
  [
   404095, 
   null, 
   "Tither", 
   "In order to put these unfair and bating comments into focus. Trying his best, in order to Slime our fellow Law-abiding Americans, the Instigator of a Civil War in chief, Galileo, Puked up this, about a Scum Bag Cop Killer! \n \nA lot of pro-gun activists give lip service to the idea of rebelling against the government. Then when a case like this comes along they take off running in the opposite direction, eager to distance themselves from anybody who would actually rebel against the government. Their bark is a lot scarier than their bite.\n\n You see, apparently to Galileo, participation on one's Constitutionally protected Rights = Criminal. \n \n (HATE the Constitution much Galileo? Do my Inalienable Rights bother you? emoticon_smile)\n \n To which Nato replied.\n \nCan you tell the difference between a criminal killing a person for no good reason, and soldiers fighting against foreign invaders to preserve what they believe is worth dying for?\n\n Then the instigator's helper Puked up this.\n \nCan you not tell the difference between a civil war and repelling an American invasion?\n\n Why is it that, HATE against Americans, Christians, and our Constitution is totally acceptable? Especially when you crucify everyone who the Left determine hateful? \n \n Doesn't the hypocrisy of this bother you? If not why not?\n \n And don't you feel at least a little uncomfortable showing this side of your persona to the rest of the World? Do you think others, not of your Liberal Mindset, can't see through these unfair, and bating a War comments? But hey, it is your little HATE Party. Who are we to spoil it? emoticon_smile", 
   {}, 
   404069, 
   null, 
   1275774360.0
  ], 
  [
   404105, 
   null, 
   "Penfold", 
   "The above spittle flecked rant thrashing hither and tither was regurgitated unwanted to you by the Christofascist NRAspeak service.", 
   {}, 
   404095, 
   null, 
   1275789720.0
  ], 
  [
   404108, 
   null, 
   "NATO 556", 
   "The above spittle flecked rant thrashing hither and tither was regurgitated unwanted to you by the Christofascist NRAspeak service.\n\n \n You just lost two IQ points for thinking we'd actually be impressed by that one.\n \n Fancy words don't mean a thing if you can't back them up with intelligent thought.", 
   {}, 
   404105, 
   null, 
   1275794400.0
  ], 
  [
   404110, 
   null, 
   "COBHC", 
   "Don't mind Penfold. He thinks using big words makes up for not having an argument. ;)", 
   {}, 
   404108, 
   null, 
   1275797400.0
  ], 
  [
   404204, 
   null, 
   "Galileo", 
   "In order to put these unfair and bating comments into focus. Trying his best, in order to Slime our fellow Law-abiding Americans, the Instigator of a Civil War in chief, Galileo, Puked up this, about a Scum Bag Cop Killer! \n \n You see, apparently to Galileo, participation on one's Constitutionally protected Rights = Criminal. \n \n (HATE the Constitution much Galileo? Do my Inalienable Rights bother you? emoticon_smile)\n \n To which Nato replied.\n \n Then the instigator's helper Puked up this.\n \n Why is it that, HATE against Americans, Christians, and our Constitution is totally acceptable? Especially when you crucify everyone who the Left determine hateful? \n \n Doesn't the hypocrisy of this bother you? If not why not?\n \n And don't you feel at least a little uncomfortable showing this side of your persona to the rest of the World? Do you think others, not of your Liberal Mindset, can't see through these unfair, and bating a War comments? But hey, it is your little HATE Party. Who are we to spoil it? emoticon_smile\n\n Because I condemn a crime which the Constituion also condemns, Tither accuses me of hating the US Constitution:\n \n \"Section 3. Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court. The Congress shall have power to declare the Punishment of Treason, but no Attainder of Treason shall work Corruption of Blood, or Forfeiture except during the Life of the Person attainted.\"\n \n \nCan you not tell the difference between a civil war and repelling an American invasion?\n\n She's just trying to muddy the waters.", 
   {}, 
   404094, 
   null, 
   1275945120.0
  ], 
  [
   404209, 
   null, 
   "NATO 556", 
   "Because I condemn a crime which the Constituion also condemns, Tither accuses me of hating the US Constitution:\n \n \"Section 3. Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court. The Congress shall have power to declare the Punishment of Treason, but no Attainder of Treason shall work Corruption of Blood, or Forfeiture except during the Life of the Person attainted.\"\n\n \n Kindly explain how this applies to this discussion.", 
   {}, 
   404204, 
   null, 
   1275948900.0
  ], 
  [
   404212, 
   null, 
   "Doc Jones", 
   "Kindly explain how this applies to this discussion.\n\n \n Because the shoe fits him and he is a bit uneasy with that little factoid that condemns him.", 
   {}, 
   404209, 
   null, 
   1275949560.0
  ], 
  [
   404219, 
   null, 
   "Tither", 
   "Because I condemn a crime which the Constituion also condemns, Tither accuses me of hating the US Constitution:\n\n Na, we all condemned it! ALL OF US! It is the trash you posted trying to instigate a Civil War! \n \n I did post your very words! \n \n A lot of pro-gun activists give lip service to the idea of rebelling against the government. Then when a case like this comes along they take off running in the opposite direction, eager to distance themselves from anybody who would actually rebel against the government. Their bark is a lot scarier than their bite.\n\n A theme you pushed even further with Nato. \n \n Hasn't there been enough bloodshed for you yet? What? Do you lust for even more? Why? So you can call for more of your anti-2nd Amendment Gun Grab? You know, the Constitution's Bill of Rights! That thing you walk all over with your dirty muddy feet most all of the time.\n \n This reminds me too much of a tactic from a desperate man. it is sad really!", 
   {}, 
   404204, 
   null, 
   1275963300.0
  ], 
  [
   404234, 
   null, 
   "Doc Jones", 
   "This topic was started by a nutcase based on a lie (false premise sounds better but means the same thing) which inspired other nutcases to pitch in and see how far they could go to insult and demean our Constitutional rights which they abhor simply because they depend on their government for everything and have no will to protect themselves nor others. Now one is regretting his mistake and admitted cowardice.\n \n In Flanders Fields PoemBy: Lieutenant Colonel John McCrae \n \n \n In Flanders Fields the poppies blow\n Between the crosses, row on row,\n That mark our place; and in the sky\n The larks, still bravely singing, fly\n Scarce heard amid the guns below.\n \n We are the Dead. Short days ago\n We lived, felt dawn, saw sunset glow,\n Loved, and were loved, and now we lie\n In Flanders fields.\n \n Take up our quarrel with the foe:\n To you from failing hands we throw\n The torch, be yours to hold it high.\n If ye break faith with us who die\n We shall not sleep, though poppies grow\n In Flanders fields.", 
   {}, 
   404219, 
   null, 
   1276004220.0
  ], 
  [
   406016, 
   null, 
   "grizzly6626", 
   "The single biggest problem in America today with getting anything done is trying to get people to stand togeather for a common cause. All folks know how to do is talk about doing something but they dont have the conviction to actually do it. We live in a me society where no one cares about right and wrong anymore so long as no one is making waves in their little pond. We are loosing our rights one by one and people turn a blind eye to it, and when someone actually tries to get support in fighting something that is wrong nobody wants to practice what they have preached and fight as well. We are allowing people to come here from other countries and change America, we allow the government to do as they please, and if we dont put asside our petty differences and stand togeather in a few years we wont have a country anymore, at least not the country we claim we love so much.", 
   {}, 
   402782, 
   null, 
   1277874480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Once Again Right Wing Nutjobs Take Out Some Cops...", 
  "url": "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14266, 
  "discussion_files": [
   [
    "12421.html", 
    "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops-print.html"
   ], 
   [
    "12422.html", 
    "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops-5-print.html"
   ], 
   [
    "12423.html", 
    "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops-4-print.html"
   ], 
   [
    "12424.html", 
    "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops-3-print.html"
   ], 
   [
    "12425.html", 
    "http://www.4forums.com/political/gun-control-debates/14266-once-again-right-wing-nutjobs-take-out-some-cops-2-print.html"
   ]
  ], 
  "identifier": 14266
 }
]