[
 [
  [
   402781, 
   null, 
   "Ripskar", 
   "Papal Visit\n Should the British tax-payers be expected to stump up millions for a religious leader to come in and make a few speeches? Would we we be expected to do the same if it was an Ayatollah?", 
   {
    "post_info": {
     "post_title": "Papal Visit costs"
    }
   }, 
   null, 
   null, 
   1274625180.0
  ], 
  [
   402783, 
   null, 
   "simone", 
   "Oh! Oh! Ripskar!\n \n Benny's going to beat you to a pulp with his rosary!", 
   {}, 
   402781, 
   null, 
   1274625540.0
  ], 
  [
   402786, 
   null, 
   "Easyrider", 
   "Papal Visit\n Should the British tax-payers be expected to stump up millions for a religious leader to come in and make a few speeches? \n\n \n Yeah, make the investment. It might do the godless heathens some good.", 
   {}, 
   402781, 
   null, 
   1274627040.0
  ], 
  [
   402787, 
   null, 
   "jyoshu", 
   "Papal Visit\n Should the British tax-payers be expected to stump up millions for a religious leader to come in and make a few speeches? Would we we be expected to do the same if it was an Ayatollah?\n\n \n The UK has a state church. So your tax dollars in a sense already pay for religion, so why should this be any different?", 
   {}, 
   402781, 
   null, 
   1274627520.0
  ], 
  [
   402804, 
   null, 
   "Jo Bennett", 
   "The UK has a state church. So your tax dollars in a sense already pay for religion, so why should this be any different?\n\n \n Actually, the Church of England and Church of Scotland (we have two state churches in the UK, one in England, one in Scotland) are not state funded, despite being established.\n \n On topic, this is a state visit, no different from if Obama comes to visit.", 
   {}, 
   402787, 
   null, 
   1274632680.0
  ], 
  [
   402811, 
   null, 
   "Ripskar", 
   "For policing and security, yes. \n For organising 3 masses? Tell me one other head of state where that would be part of the bill?", 
   {}, 
   402804, 
   null, 
   1274635200.0
  ], 
  [
   402815, 
   null, 
   "99%BEEF", 
   "As long as Dawkins arrests him for crimes agaisnt humanity it will be worth every penny.\n \n BBC News - Atheist Richard Dawkins backs campaign to arrest Pope", 
   {}, 
   402811, 
   null, 
   1274636220.0
  ], 
  [
   402882, 
   null, 
   "Jo Bennett", 
   "As long as Dawkins arrests him for crimes agaisnt humanity it will be worth every penny.\n \n BBC News - Atheist Richard Dawkins backs campaign to arrest Pope\n\n \n So long as we can arrest Dawkins for being a boring old hack afterwards, I agree.", 
   {}, 
   402815, 
   null, 
   1274670660.0
  ], 
  [
   402886, 
   null, 
   "Ripskar", 
   "Meh, It would be like the attempt to arrest Bush or Blair for Iraq.\n £7 million per mass? XXX are they spending it on?\n Of course 400,000 (rather optimistic figure given there's only 7 million Catholics in the country) people daft enough to trek across the country to see the bloke waffle on in a language they don't speak have got to be easy marks for some cheap plastic 'memorabilia'...emoticon_xgood", 
   {}, 
   402882, 
   null, 
   1274672700.0
  ], 
  [
   402892, 
   null, 
   "Iuris", 
   "As long as Dawkins arrests him for crimes agaisnt humanity it will be worth every penny.\n\n \nSo long as we can arrest Dawkins for being a boring old hack afterwards, I agree. \n\n \nMeh, It would be like the attempt to arrest Bush or Blair for Iraq.\n\n \n Y'know, this whole line of thought is beginning to sound better and better...", 
   {}, 
   402886, 
   null, 
   1274679060.0
  ], 
  [
   402911, 
   null, 
   "Winston Smith", 
   "For policing and security, yes. \n For organising 3 masses? Tell me one other head of state where that would be part of the bill?\n\n \n Shouldn't God pay for the visit ? emoticon_xangel\n \n Religion is the biggest longest most succesful con job in history", 
   {}, 
   402811, 
   null, 
   1274700960.0
  ], 
  [
   402912, 
   null, 
   "Winston Smith", 
   "As long as Dawkins arrests him for crimes agaisnt humanity it will be worth every penny.\n \n BBC News - Atheist Richard Dawkins backs campaign to arrest Pope\n\n \n The Little Children and Jesus ~ Luke 18:15-17\n \n 15 People were also bringing babies to Jesus to have him touch them. When the disciples saw this, they rebuked them. 16But Jesus called the children to him and said, \"Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these. 17I tell you the truth, anyone who will not receive the kingdom of God like a little child will never enter it.\" \n \n So what is wrong with bringing children to a priest, who is an 'apostle' by another name ? emoticon_rolleyes", 
   {}, 
   402815, 
   null, 
   1274701260.0
  ], 
  [
   402944, 
   null, 
   "Ripskar", 
   "Going by the figures they're expecting 1 in 14 Catholics to attend, or about two thirds of the regular congregation. Rather suggests that they're going to bus in every kid in a catholic school in the country (Which come to think of it is somewhere tax money goes...) Of course given the Church's and indeed the pope's personal reputation regarding children, I think we can guess the headlines now...", 
   {}, 
   402912, 
   null, 
   1274718180.0
  ], 
  [
   402949, 
   null, 
   "simone", 
   "The Little Children and Jesus ~ Luke 18:15-17\n \n 15 People were also bringing babies to Jesus to have him touch them. When the disciples saw this, they rebuked them. 16But Jesus called the children to him and said, \"Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these. 17I tell you the truth, anyone who will not receive the kingdom of God like a little child will never enter it.\" \n \n So what is wrong with bringing children to a priest, who is an 'apostle' by another name ? emoticon_rolleyes\n\n Folks used their own little feet and donkeys back in those days. That's the diff.", 
   {}, 
   402912, 
   null, 
   1274719320.0
  ], 
  [
   403006, 
   null, 
   "Winston Smith", 
   "The difference is that present day 'apostles' love children too much emoticon_rolleyes", 
   {}, 
   402949, 
   null, 
   1274744940.0
  ], 
  [
   403055, 
   null, 
   "Sandycane", 
   "The difference is that present day 'apostles' love children too much emoticon_rolleyes\n\n \n emoticon_xclown True. \n But, since they have 'repented' they can get away with it. :xbanghead", 
   {}, 
   403006, 
   null, 
   1274791320.0
  ], 
  [
   403056, 
   null, 
   "trebor", 
   "emoticon_xclown True. \n But, since they have 'repented' they can get away with it. :xbanghead\n\n \n That, and they get transferred to another country to avoid charges.", 
   {}, 
   403055, 
   null, 
   1274792160.0
  ], 
  [
   403125, 
   null, 
   "Winston Smith", 
   "If they move to the Vatican State, they are untouchables there, for that place is Holy Ground for them. emoticon_xangel", 
   {}, 
   403056, 
   null, 
   1274842140.0
  ], 
  [
   403129, 
   null, 
   "pappillion001", 
   "The Little Children and Jesus ~ Luke 18:15-17\n \n 15 People were also bringing babies to Jesus to have him touch them. When the disciples saw this, they rebuked them. 16But Jesus called the children to him and said, \"Let the little children come to me, and do not hinder them, for the kingdom of God belongs to such as these. 17I tell you the truth, anyone who will not receive the kingdom of God like a little child will never enter it.\" \n \n So what is wrong with bringing children to a priest, who is an 'apostle' by another name ? emoticon_rolleyes\n\n \n The answer is in front of you. The church liked to play games.\n \n A nother\n P riest\n O ffering\n S ex\n T o\n L ittle\n E vengilicals", 
   {}, 
   402912, 
   null, 
   1274843160.0
  ], 
  [
   403139, 
   null, 
   "Winston Smith", 
   "A tiny correction : evangelicals \n \n Good one. emoticon_xangel", 
   {}, 
   403129, 
   null, 
   1274864160.0
  ], 
  [
   403143, 
   null, 
   "trebor", 
   "The answer is in front of you. The church liked to play games.\n \n A nother\n P riest\n O ffering\n S ex\n T o\n L ittle\n E vengilicals\n\n \n And I thought it was that\n \n P edophile\n R esiding\n I n\n E very \n S mall \n T own.", 
   {}, 
   403129, 
   null, 
   1274873400.0
  ], 
  [
   403196, 
   null, 
   "Winston Smith", 
   "The Vatican is a small town emoticon_xangel", 
   {}, 
   403143, 
   null, 
   1274910720.0
  ], 
  [
   403202, 
   null, 
   "snakespit", 
   "On topic, this is a state visit, no different from if Obama comes to visit.\n\n \n Oh...come to discuss trade agreements and commerce? *snicker* State visit my arse.", 
   {}, 
   402804, 
   null, 
   1274913060.0
  ], 
  [
   403234, 
   null, 
   "Jo Bennett", 
   "Oh...come to discuss trade agreements and commerce? *snicker* State visit my arse.\n\n \n Oh come on, US presidential visits are never about that either. Those negotiations are carried out months in advance by subordinates. The visits are there to get the British PM on side by making him feel part of the club.", 
   {}, 
   403202, 
   null, 
   1274931180.0
  ], 
  [
   403245, 
   null, 
   "Winston Smith", 
   "Oh...come to discuss trade agreements and commerce? *snicker* State visit my arse.\n\n \n isn't religion a business ? emoticon_rolleyes", 
   {}, 
   403202, 
   null, 
   1274949180.0
  ], 
  [
   409142, 
   null, 
   "Ripskar", 
   "Worshippers will be asked to pay a \"pilgrim contribution\" of up to 25 pounds to attend Pope Benedict XVI's public appearances during his trip to Britain, the Catholic Church said Wednesday. Skip related content\n \n The disclosure came amid controversy in mainly Anglican Britain over the cost of the September trip, which officials have estimated at up to 12 million pounds (14 million euros, 18 million dollars).\n \n The Catholic Bishops' Conference of England and Wales said that dioceses which the pope would visit were being asked to \"contribute a fixed amount towards the cost of the coaches which will transport pilgrims\".\n \n \"Many have decided to ask for a pilgrim contribution,\" added the conference in a statement.\n \n Vatican spokesman Federico Lombardi stressed that \"those that cannot afford it will be exempt\", in comments to Italian daily Corriere della Sera.\n \n The most expensive event, at 25 pounds a head, will be a mass in Birmingham on September 19 which is expected to attract 70,000 people, said the statement from the bishops' conference.\n \n During the ceremony the pope will beatify theologian John Henry Newman, a Protestant who converted to Catholicism and died in 1890.\n \n The September 16 mass in Glasgow, Scotland, will cost 20 pounds and includes a performance by Susan Boyle, the singing sensation who won international fame after performing on the television show \"Britain's Got Talent\".\n \n The cheapest event will be a vigil in Hyde Park in London on September 17, with tickets selling at five pounds.\n \n Worshippers attending the events will receive a so-called \"pilgrim pack\". This is a drawstring bag which contains a range of items including a commemorative CD and a \"how to keep in touch\" postcard, said the Church.\n \n Benedict XVI will be only the second pope to visit Britain since King Henry VIII split with Rome in 1534, leading to the formation of the Anglican Church.\n \n Pope John Paul II visited Britain, where over four million of some 61 million inhabitants are Catholic, in 1982.\n\n \n Looks like the lemmings... ahem.. \"pilgrims\" will have to stump up after all.\n Mind you, a Man U ticket will cost 55 quid, guess we know which is more valuable to the punters.", 
   {}, 
   403245, 
   null, 
   1280967120.0
  ], 
  [
   409160, 
   null, 
   "snakespit", 
   "Looks like the lemmings... ahem.. \"pilgrims\" will have to stump up after all.\n Mind you, a Man U ticket will cost 55 quid, guess we know which is more valuable to the punters.\n\n \n What be \"punters\"? \n \n I almost asked about Man U, but then figured if it is GB we are talking about, it must be football...and figured that it was Manchester United. Am I correct?", 
   {}, 
   409142, 
   null, 
   1280975100.0
  ], 
  [
   409177, 
   null, 
   "Ripskar", 
   "Man U = Manchester United, its 55 quid for the Newcastle game.\n http://www.manutd.com/default.sps?pagegid={23A882F1-4E52-4C1A-816E-FB505E82E076}&newsid=6650276\n Punters = Paying Customers\n \"So what is that worth?\" would be the next question.\n five quid - the cost of the event in London = a Big Mac meal in the North of the UK, or a Big Mac (No fries, no drink) in London.", 
   {}, 
   409160, 
   null, 
   1281008640.0
  ], 
  [
   409954, 
   null, 
   "Ripskar", 
   "Apparently the Pope isn't worth a tenner.\n \nPope Mass briefs are returned\n \n DEBORAH ANDERSON\n \n 2 Aug 2010\n Thousands of Scotland's Catholics are returning tickets for the first papal visit in three decades to Church headquarters.\n \n Parishes have failed to take up their full ticket allocation for the visit of Pope Benedict XVI to Glasgow next month.\n Sources say that in some parishes, only one-sixth of pilgrims have taken tickets and in many cases parishes are returning more than half of their allocations.\n Last night there were fears the uptake would fall short of the 100,000 pilgrims expected to turn out for the historic mass at Bellahouston Park.\n It is the latest twist in the build-up for the open-air mass on September 16. Just days ago it emerged some Catholics were being asked to pay to see Pope Benedict XVI in Glasgow, despite the Church insisting there would be no individual fees for the visit.\n Priests have cited various reasons for the low uptake, including costs, suitability of the venue and the lack of time they have been given to apply for tickets.\n With the deadline now passed, the Papal Visit office will today be counting how many returns they have received.\n Parishes are understood to be concerned about arrangements for the event, including the fact that worshippers will be required to stand in an open-air venue for hours in a Scottish autumn - a probable far cry from the sun-soaked Mass at Bellahouston in 1982 by Pope John Paul II that was attended by 300,000.\n One east-coast community has ordered a large screen and plan to watch this year's event on television in their church hall and if many more follow suit, numbers for the open-air mass may be well below expectations.\n Those opting out of going to Bellahouston are blaming the organisers. It is understood many parishes in the west coast have a lower-than-anticipated number of worshippers wanting to attend the event, which is expected to cost £1.5 million.\n Some parishes with a 400-ticket allocation have returned more than half. \n One source said: \"It looks like the uptake for tickets is well below what was expected. There is a strong feeling among priests and the laity that the organisers have had no consideration for their wellbeing or safety while planning the Mass in the park.\n \"Pilgrims are being asked to be in the park by 3pm at the latest for the Mass, which is due to start at 5.15pm and end at 7.30pm, when it will be almost dark. But during all this time the Pilgrims are expected to stand without any cover from the elements or seating facilities. \n \"Most people will agree there is more chance of it being a wet windy night in September rather than a balmy autumn evening.\n \"Booking such a venue is being looked on as being an irresponsible decision made by people dreaming of having a repeat of Bellahouston in June 1982.\"\n Priests say the strict deadline for the ticket allocation has also affected uptake.\n The shortfall fears come just a week after Scots Catholics were told there was an expectation they would make a donation of £20 each to see the Pope in Glasgow, with the church insisting the cost was not an individual levy but a parish fee, and that anyone unable to pay would not have to.\n No-one from the Catholic Church was available for comment.\n\n Link", 
   {
    "unicode_changes_made": true
   }, 
   409177, 
   null, 
   1281824280.0
  ], 
  [
   409956, 
   null, 
   "gansao", 
   "John paul would be worth every penny but the German...no", 
   {}, 
   409954, 
   null, 
   1281825240.0
  ], 
  [
   412692, 
   null, 
   "Ripskar", 
   "Well the news got replaced by live coverage of the visit.\n No weather, no headlines, just a primary school choir (yes it was that bad) and the pontiff with a comedicly German accent. He sounded like Von Smallhausen.emoticon_wow\n Once we finally got some headlines it turned out that there'd been some terror suspects arrested, road sweepers apparently.", 
   {}, 
   409956, 
   null, 
   1284758220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Papal Visit costs", 
  "url": "http://www.4forums.com/political/religion-debates/14265-papal-visit-costs.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14265, 
  "discussion_files": [
   [
    "28053.html", 
    "http://www.4forums.com/political/religion-debates/14265-papal-visit-costs-print.html"
   ], 
   [
    "28054.html", 
    "http://www.4forums.com/political/religion-debates/14265-papal-visit-costs-3-print.html"
   ], 
   [
    "28055.html", 
    "http://www.4forums.com/political/religion-debates/14265-papal-visit-costs-2-print.html"
   ]
  ], 
  "identifier": 14265
 }
]