[
 [
  [
   27644, 
   null, 
   "Hank", 
   "If I can find the time, is anyone here interested in debating the virgin birth in the debate section? I would debate it didn&#8217;t happen.", 
   {
    "post_info": {
     "post_title": "Virgin birth"
    }
   }, 
   null, 
   null, 
   1071547320.0
  ], 
  [
   28292, 
   null, 
   "scott7", 
   "If I can find the time, is anyone here interested in debating the virgin birth in the debate section? I would debate it didn't happen.\n\n \n Actually Hank I agree with you. I don't believe it happened either. I am curious to hear your opinion on the matter.", 
   {
    "unicode_changes_made": true
   }, 
   27644, 
   null, 
   1071786780.0
  ], 
  [
   28356, 
   null, 
   "Hank", 
   "Actually Hank I agree with you. I don't believe it happened either. I am curious to hear your opinion on the matter.\n\n \n I'm not sure what to say Scott. I just don't believe it happened.", 
   {}, 
   28292, 
   null, 
   1071800580.0
  ], 
  [
   29627, 
   null, 
   "XQsThaiPoes", 
   "If I can find the time, is anyone here interested in debating the virgin birth in the debate section? I would debate it didn't happen.\n\n \n You have a problem. The term virgin birth is disputed, but I am sure Montalban will try to make you debate using the orthodox definition. If I were you I would not bother because if you use ecumenical definitions you will sink into a swamp of confusion. As soon as you make headway some one will say, \"he is God and can do any thing he wants\". It would make a horrible debate. Be kind to your self, and eat raging spoonfuls of killer bees my friend. \n \n Odder debates are was God acting as an incubus, was Jesus a homunculus, was original \"Nephilim\" (not the guys in Cannan) in the same class, and does God have the right to impregnate whom ever he wishes with out asking them since it does take away free will.", 
   {
    "unicode_changes_made": true
   }, 
   27644, 
   null, 
   1072864500.0
  ], 
  [
   29630, 
   null, 
   "montalban", 
   "You have a problem. The term virgin birth is disputed, but I am sure Montalban will try to make you debate using the orthodox definition. If I were you I would not bother because if you use ecumenical definitions you will sink into a swamp of confusion. As soon as you make headway some one will say, ?he is God and can do any thing he wants?. It would make a horrible debate. Be kind to your self, and eat raging spoonfuls of killer bees my friend. \n \n Odder debates are was God acting as an incubus, was Jesus a homunculus, was original ?Nephilim? (not the guys in Cannan) in the same class, and does God have the right to impregnate whom ever he wishes with out asking them since it does take away free will.\n\n \n What an interesting post. Not only have you stated one thing, you've also stated what I'd say. Time saving, as I don't need to present an argument, as you'll both present an argument, and say what I'd say too!", 
   {}, 
   29627, 
   null, 
   1072867980.0
  ], 
  [
   29644, 
   null, 
   "Hank", 
   "You have a problem. The term virgin birth is disputed, but I am sure Montalban will try to make you debate using the orthodox definition. If I were you I would not bother because if you use ecumenical definitions you will sink into a swamp of confusion. As soon as you make headway some one will say, &#8220;he is God and can do any thing he wants&#8221;. It would make a horrible debate. Be kind to your self, and eat raging spoonfuls of killer bees my friend.\n\n \n LOL. That was funny.\n \n Sounds like you didn&#8217;t thoroughly read my post. If it was in the debate section, only two people would be involved, therefore monty would not have a say. Also a third party would do the judging. Therefore anyone trying to &#8216;make&#8217; the debate go in a certain direction would be transparent to the judge.\n \n \nOdder debates are was God acting as an incubus, was Jesus a homunculus, was original &#8220;Nephilim&#8221; (not the guys in Cannan) in the same class, and does God have the right to impregnate whom ever he wishes with out asking them since it does take away free will.\n\n \n You could go to hell for even thinking that kind of thing. LOL\n \n Yes odder but much more difficult to debate.", 
   {}, 
   29627, 
   null, 
   1072881660.0
  ], 
  [
   29750, 
   null, 
   "Zeeener", 
   "Where's the evidence? So far there's a lot of pontificating, and \"I don't believe it,\" but there's nothing to support any conclusion in favor of, or against the virgin birth.\n \n \"I don't believe it\" is just as valid and rooted in truth as \"I believe it.\" It is not rooted in fact or historical or archaeological evidence.\n \n \n Zee", 
   {
    "post_info": {
     "post_title": "Evidence?"
    }
   }, 
   29644, 
   null, 
   1073007540.0
  ], 
  [
   29753, 
   null, 
   "Hank", 
   "Where's the evidence? So far there's a lot of pontificating, and \"I don't believe it,\" but there's nothing to support any conclusion in favor of, or against the virgin birth.\n \n \"I don't believe it\" is just as valid and rooted in truth as \"I believe it.\" It is not rooted in fact or historical or archaeological evidence.\n \n \n Zee\n\n \n Yes but the proposal was for a formal type debate judged by a third party. Here we are just discussing the debate so far.\n \n Welcome to the forum.", 
   {}, 
   29750, 
   null, 
   1073008440.0
  ], 
  [
   29787, 
   null, 
   "XQsThaiPoes", 
   "Yes but the proposal was for a formal type debate judged by a third party. Here we are just discussing the debate so far.\n \n Welcome to the forum.\n\n \n Another problem I sort of hinted at is what is going to be considered as reference, or evidence. The Jews don't believe in the virgin birth of Jesus, so are you going to bring out old rabbinical text to the debate? If you argue purely from a scientific POV your opponent can just walk down to a gynecologist office, and get a pamphlet on invitrofertilization. I remember our debate team once lost in Los Vegas (cigarette city USA). Arguing the for federal smoke free restaurant laws (I think it was a while ago) they said that smoking in restaurants, and bars was already illegal in California (where they live). The judge in Nevada made them throw out part of their evidence because they had no proof it was illegal in California then and it did not qualify as \"common knowledge\" at the time (at least in Nevada), for the laws was new.\n \n My point is the judge will really have to set finite rules on the scope of the argument, and what can be used as evidence, and what is \"common knowledge\", or considered a generally accepted \"fact\". So you may state Jesus existed as a fact, and Marry was fertile, for there is archeological proof Jesus existed and that Marry had more than one son. So she was not sterile, and not a virgin for long. \n \n Now days even sterile people have children that in no way share their genes. Scientist have theorized that even men can incubate a child, but it would have to be delivered premature since men don't have a uterus to shield their internal organs. If you guys got into the quagmire of nanotech (which reproduction is technically) throw your hands up. \n \n Like the Z man said it is not a debate. There is no soft tissue archeological proof for any side, and never will be since she was Jewish, and most likely laid out to decay in a tomb, then her bones put into a small box in the middle east like they did her son James. It is more blasphemous, but easier for you to argue Mary had a hyper religious delusion after having sex set off by fear of being stoned, or being raped by someone, and Joseph went along with it, for 1 in 5 people have schizophrenia (don't quote me on that stat I saw it in one of those p-BS specials) often triggered by stress during young adulthood.", 
   {}, 
   29753, 
   null, 
   1073021160.0
  ], 
  [
   29789, 
   null, 
   "Hank", 
   "Another problem I sort of hinted at is what is going to be considered as reference, or evidence. The Jews don't believe in the virgin birth of Jesus, so are you going to bring out old rabbinical text to the debate? If you argue purely from a scientific POV your opponent can just walk down to a gynecologist office, and get a pamphlet on invitrofertilization. I remember our debate team once lost in Los Vegas (cigarette city USA). Arguing the for federal smoke free restaurant laws (I think it was a while ago) they said that smoking in restaurants, and bars was already illegal in California (where they live). The judge in Nevada made them throw out part of their evidence because they had no proof it was illegal in California then and it did not qualify as \"common knowledge\" at the time (at least in Nevada), for the laws was new.\n \n My point is the judge will really have to set finite rules on the scope of the argument, and what can be used as evidence, and what is \"common knowledge\", or considered a generally accepted \"fact\". So you may state Jesus existed as a fact, and Marry was fertile, for there is archeological proof Jesus existed and that Marry had more than one son. So she was not sterile, and not a virgin for long. \n \n Now days even sterile people have children that in no way share their genes. Scientist have theorized that even men can incubate a child, but it would have to be delivered premature since men don't have a uterus to shield their internal organs. If you guys got into the quagmire of nanotech (which reproduction is technically) throw your hands up. \n \n Like the Z man said it is not a debate. There is no soft tissue archeological proof for any side, and never will be since she was Jewish, and most likely laid out to decay in a tomb, then her bones put into a small box in the middle east like they did her son James. It is more blasphemous, but easier for you to argue Mary had a hyper religious delusion after having sex set off by fear of being stoned, or being raped by someone, and Joseph went along with it, for 1 in 5 people have schizophrenia (don't quote me on that stat I saw it in one of those p-BS specials) often triggered by stress during young adulthood.\n\n \n It appears you are making an argument before the debate, if there is one, gets started.", 
   {}, 
   29787, 
   null, 
   1073021640.0
  ], 
  [
   29793, 
   null, 
   "XQsThaiPoes", 
   "It appears you are making an argument before the debate, if there is one, gets started.\n\n \n Not really. I didn't intend for it to sound that way. I was trying understand which angle you are using, and if it could be debated. I would really like to see a debate like this. So are you going to use science or theology?", 
   {}, 
   29789, 
   null, 
   1073022600.0
  ], 
  [
   29821, 
   null, 
   "Hank", 
   "Not really. I didn't intend for it to sound that way. I was trying understand which angle you are using, and if it could be debated. I would really like to see a debate like this. So are you going to use science or theology?\n\n \n I would use anything that I felt was appropriate and let the judge decide whether it was applicable and if so, if it was valid.\n \n In the end, no one is going to change their mind about the virgin birth, it would just be an exercise in thinking about it if the participants were good at making their points.", 
   {}, 
   29793, 
   null, 
   1073059440.0
  ], 
  [
   29865, 
   null, 
   "Zeeener", 
   "It is more blasphemous, but easier for you to argue Mary had a hyper religious delusion after having sex set off by fear of being stoned, or being raped by someone, and Joseph went along with it, \n\n \n ?!? \n \n Please explain why it would be easier to argue that point, with no historical or archaeological or anecdotal evidence to support such a position ... I think I'm seeing a lot of \"wild speculation\" being mis-labeled as \"bona-fide evidence\" here.\n \n Why have a judge, anyway? What qualifies a judge to judge in this forum? If it's all about a generating thought and argument, and not about changing minds, why make it a contest?\n \n Zee", 
   {}, 
   29787, 
   null, 
   1073094540.0
  ], 
  [
   29877, 
   null, 
   "Hank", 
   "Why have a judge, anyway? What qualifies a judge to judge in this forum? If it's all about a generating thought and argument, and not about changing minds, why make it a contest?\n\n \n The judge is picked by the two contestants in this forum. It&#8217;s based on who the contestants think can be impartial or fair in determining a winner. The reason for a judge and a contest is because with everyone contributing to a thread, it tends to get off subject easily and can turn into insult slinging. With just two people the thread will stay on topic and there is a tendency to refrain from insults because of that. At least that&#8217;s what I have seen so far.", 
   {}, 
   29865, 
   null, 
   1073097840.0
  ], 
  [
   29878, 
   null, 
   "XQsThaiPoes", 
   "?!? \n \n Please explain why it would be easier to argue that point, with no historical or archaeological or anecdotal evidence to support such a position ... I think I'm seeing a lot of \"wild speculation\" being mis-labeled as \"bona-fide evidence\" here.\n \n Why have a judge, anyway? What qualifies a judge to judge in this forum? If it's all about a generating thought and argument, and not about changing minds, why make it a contest?\n \n Zee\n\n \n It would be wild speculation, but statisticaly more probable; thats all I was saying. I think if he had some good math he could do it. I personally would argue pro \"virigin birth\", but like you said it is only speculation because you can't make a case.", 
   {}, 
   29865, 
   null, 
   1073099100.0
  ], 
  [
   29880, 
   null, 
   "Hank", 
   "It would be wild speculation, but statisticaly more probable; thats all I was saying. I think if he had some good math he could do it. I personally would argue pro \"virigin birth\", but like you said it is only speculation because you can't make a case.\n\n \n Just curious, would you mind telling me what your religious beliefs are?", 
   {}, 
   29878, 
   null, 
   1073102580.0
  ], 
  [
   29888, 
   null, 
   "montalban", 
   "Hank\n \n Of course, in making such a debate the person you oppose will have different sets of resources.\n \n If you debate a Protestant, then it's going to be a totally bible-only evidentiary argument.\n \n If you debate a JW then the bible-only debate will based on a totally different version of the Bible - with all the notions of Jesus as God crossed out, and 'liar' written in above in red crayon.\n \n And if you debate a Catholic/Copt/Orthodox you'll get the same Bible-arguments as the Protestants, plus Holy Tradition thrown in at no extra cost to credibility.", 
   {}, 
   29880, 
   null, 
   1073106840.0
  ], 
  [
   29889, 
   null, 
   "Hank", 
   "Hank\n \n Of course, in making such a debate the person you oppose will have different sets of resources.\n \n If you debate a Protestant, then it's going to be a totally bible-only evidentiary argument.\n \n If you debate a JW then the bible-only debate will based on a totally different version of the Bible - with all the notions of Jesus as God crossed out, and 'liar' written in above in red crayon.\n \n And if you debate a Catholic/Copt/Orthodox you'll get the same Bible-arguments as the Protestants, plus Holy Tradition thrown in at no extra cost to credibility.\n\n \n I don't care what they use.", 
   {}, 
   29888, 
   null, 
   1073108760.0
  ], 
  [
   29899, 
   null, 
   "Zeeener", 
   "It would be wild speculation, but statisticaly more probable; thats all I was saying. I think if he had some good math he could do it. I personally would argue pro \"virigin birth\", but like you said it is only speculation because you can't make a case.\n\n \n Good math and statistical probability? Those sound like techniques to argue against evolution.\n \n Actually, I think that it can be demonstrated that the Bible is historically accurate, verified repeatedly by archaeology and non-Biblical records, and is thus a credible source of information, making it more likely than not that the virgin birth actually occured.\n \n As far as a judge and jury for debating, it kind of defeats the purpose, if the purpose is spur thought, examine evidence, and refine argument. It seems to me to be a great idea, if the objective is to beat someone up and rub their nose in it. I'm not much for that second option.\n \n Zee", 
   {}, 
   29878, 
   null, 
   1073111520.0
  ], 
  [
   29904, 
   null, 
   "montalban", 
   "Good math and statistical probability? Those sound like techniques to argue against evolution.\n \n Actually, I think that it can be demonstrated that the Bible is historically accurate, verified repeatedly by archaeology and non-Biblical records, and is thus a credible source of information, making it more likely than not that the virgin birth actually occured.\n \n As far as a judge and jury for debating, it kind of defeats the purpose, if the purpose is spur thought, examine evidence, and refine argument. It seems to me to be a great idea, if the objective is to beat someone up and rub their nose in it. I'm not much for that second option.\n \n Zee\n\n \n There's already a discussion underway on this topic under 'religion' (see thread \"Theotokos\") where this thread belongs (subtle hint posted for admin) :)", 
   {}, 
   29899, 
   null, 
   1073115180.0
  ], 
  [
   29916, 
   null, 
   "Hank", 
   "\n As far as a judge and jury for debating, it kind of defeats the purpose, if the purpose is spur thought, examine evidence, and refine argument. It seems to me to be a great idea, if the objective is to beat someone up and rub their nose in it. I'm not much for that second option.\n \n Zee\n\n \n You haven&#8217;t been around here long enough to see what happens when everything is posted at random. Debates in the debate section tend to be much more organized and stay on topic. You can&#8217;t spur thought, examine evidence, and refine an argument when four or five people are slinging mud at each other because one person said they were the only one that knew the truth and everyone else is offended by that.", 
   {}, 
   29899, 
   null, 
   1073141040.0
  ], 
  [
   30054, 
   null, 
   "XQsThaiPoes", 
   "Hank\n \n Of course, in making such a debate the person you oppose will have different sets of resources.\n \n If you debate a Protestant, then it's going to be a totally bible-only evidentiary argument.\n \n If you debate a JW then the bible-only debate will based on a totally different version of the Bible - with all the notions of Jesus as God crossed out, and 'liar' written in above in red crayon.\n \n And if you debate a Catholic/Copt/Orthodox you'll get the same Bible-arguments as the Protestants, plus Holy Tradition thrown in at no extra cost to credibility.\n\n \n If you debate a JW then all that \"Holy Tradition thrown in\" will be sucked out like poison in wound. The entire Christian doctrine will be purged of any thing resembling indigenous customs, superstition, or pagan infiltration. In the end you will have a sterile debate about is Jesus really God's son. The same question the Jews asked. \n \n I am kidding about that poison remark, and the rest of them. I was just being cheeky. I liked Monte's crayon remark, reminded me of my bible when I was a kid. We really only use our bible personally because it keeps us from bringing 20 or 30 bibles to the table.", 
   {}, 
   29888, 
   null, 
   1073269380.0
  ], 
  [
   30074, 
   null, 
   "montalban", 
   "I am not sensative. It is just you are orthodox. We have been beaten by Russian orthodox in Georgia (former USSR) and have had our homes destroyed in \"sanctioned\" riots. If you are not as hostile as the Russians I apologise for prejudging you. \n \n If you think I am spreading a rumor. A brawl is on film at our media site. Also we are waiting for people to ban together to destory or disband us (like in the past). So the martyr's mentality is spot on.\n\n \n It is sad that they were beaten. If you really want to know what persecution is...\n By the hand of the Turks...(in just one century)\n GREEKS\n 1914 400,000 conscripts perished in forced labor brigades \n 1922 100,000 massacred or burned alive in Smyrna \n 1916-1922 350,000 Pontions massacred or killed during forced deportations \n 1914-1922 900,000 perish from maltreatment, starvation and massacres; total of all other areas of Asia Minor \n \n TOTAL: 1,750,000 Greek Christians martyred 1914-1922 \n \n ARMENIANS \n 1894-1896 300,000 massacred \n 1915-1916 1,500,000 perish in massacres and forced deportations (with subsidiaries to 1923) \n 1922 30,000 massacred or burned alive in Smyrna \n TOTAL: 1,800,000 Armenian Christians martyred 1894-1923 \n \n SYRIANS AND NESTORIANS \n \n 1915-1917 100,000 Christians massacred \n NB Nestorians are not Orthodox\n http://www.geocities.com/umaximov/moore.htm\n \n \n However, you might be interested in this..\n \"The Armenian Government has not registered Jehovah's Witnesses on the grounds that the organization's charter is incompatible with current Armenian law on compulsory military service. As of June 1997, the total number of churches and religious organizations registered in Armenia was. \"\n http://www.state.gov/www/global/human_rights/970722_relig_rpt_christian.html\n NB\n \"No subsequent attacks have been reported.\"\n Ibid", 
   {}, 
   29916, 
   null, 
   1073274960.0
  ], 
  [
   30086, 
   null, 
   "montalban", 
   "As for persecution, our Church has been occupited by Turks and Soviets over its long history.", 
   {}, 
   29916, 
   null, 
   1073285940.0
  ], 
  [
   30091, 
   null, 
   "XQsThaiPoes", 
   "As for persecution, our Church has been occupited by Turks and Soviets over its long history.\n\n \n Yeah, Stalin was a mess he sent us to Siberia. BTW did Hitler start rounding up you guys too? I think someone here (In my state) was trying to build and Arminian memorial.\n \n Oh btw JW's believe that all that bloodshed and peresecution from 1914-to 1919 was due to satan being cast down to earth by Jesus. What does you docterine say?", 
   {}, 
   30086, 
   null, 
   1073290500.0
  ], 
  [
   30096, 
   null, 
   "montalban", 
   "Yeah, Stalin was a mess he sent us to Siberia. BTW did Hitler start rounding up you guys too? I think someone here (In my state) was trying to build and Arminian memorial.\n \n Oh btw JW's believe that all that bloodshed and peresecution from 1914-to 1919 was due to satan being cast down to earth by Jesus. What does you docterine say?\n\n \n \n I don't believe that Orthodox doctrine deals directly with WWII. I am unfamiliar with such. Are you saying that the event you stated had a direct bearing on the cause of the war?\n \n Our doctrine would deal with evil, in general. But there may be Orthodox writers who have commented on the war. We are a Church with doctrine, but it would take more than a number of writers commenting on something to make it a 'doctrine'.\n \n \n Armenia was the first nation on earth to adopt Christianity.", 
   {}, 
   30091, 
   null, 
   1073298180.0
  ], 
  [
   30166, 
   null, 
   "XQsThaiPoes", 
   "I don't believe that Orthodox doctrine deals directly with WWII. I am unfamiliar with such. Are you saying that the event you stated had a direct bearing on the cause of the war?\n \n Our doctrine would deal with evil, in general. But there may be Orthodox writers who have commented on the war. We are a Church with doctrine, but it would take more than a number of writers commenting on something to make it a 'doctrine'.\n \n \n Armenia was the first nation on earth to adopt Christianity.\n\n \n Yes we cite the war as a fulfilled bible prophecy, and we were working heavily to convert Greek orthodox at that time. The president of the watchtower went to start a preaching campaign in Macedonia, the wars broke out, later we were shut down state side (1918 I believe), the governing body arrested, and freed 1919. The dates 1914 and 1919 are really big deals to JW's, but most people swear it was just a coincidence, and nothing prophetic. \n \n That was Byzantium right? Yeah we know, and JW's consider an empire adopting Christianity a bad thing.", 
   {}, 
   30096, 
   null, 
   1073343300.0
  ], 
  [
   30168, 
   null, 
   "montalban", 
   "Yes we cite the war as a fulfilled bible prophecy, and we were working heavily to convert Greek orthodox at that time. \n\n \n Which is probably why they'd be hostile.\n \n \nThe president of the watchtower went to start a preaching campaign in Macedonia, the wars broke out, later we were shut down state side (1918 I believe), the governing body arrested, and freed 1919. The dates 1914 and 1919 are really big deals to JW's, but most people swear it was just a coincidence, and nothing prophetic. \n\n \n Macedonia is Orthodox. It is already Christian. Why 'convert' Christians?\n \n \nThat was Byzantium right? Yeah we know, and JW's consider an empire adopting Christianity a bad thing.\n\n \n Armenia was an independent nation when it adopted Christianity\n \n Rome adopted Christianity about a 100 years later. The Roman Empire was divided for administrative purposes, and eventually the split became permanent. The western half collapsed in the 400s, but the eastern half considered it still as Roman, and continued to exist until the 1400s.\n \n It has been called various names, including the Byzantine Empire.", 
   {}, 
   30166, 
   null, 
   1073344800.0
  ], 
  [
   35426, 
   null, 
   "IMRAHIL", 
   "If I can find the time, is anyone here interested in debating the virgin birth in the debate section? I would debate it didn't happen.\n\n Your an idiot Hank. If god could create the world in 7 days then he sure as hell could get someone pregnant.", 
   {
    "unicode_changes_made": true
   }, 
   27644, 
   null, 
   1077336480.0
  ], 
  [
   35428, 
   null, 
   "XQsThaiPoes", 
   "Your an idiot Hank. If god could create the world in 7 days then he sure as hell could get someone pregnant.\n\n \n Since God is omnipotent that is true. Omni means all. Potent means able to have intercourse. Wow I think I may have won Hank's debate and the only proof you need is at dictionary.com", 
   {}, 
   35426, 
   null, 
   1077345300.0
  ], 
  [
   35429, 
   null, 
   "lurch", 
   "If god could create the world in 7 days then he sure as hell could get someone pregnant.\n \n So parthenegenic births are always female. Where did the X chromosome come from? Is this another case of \"POOF, it was a miracle\" when faced with reality?", 
   {}, 
   35428, 
   null, 
   1077350520.0
  ], 
  [
   35432, 
   null, 
   "XQsThaiPoes", 
   "So parthenegenic births are always female. Where did the X chromosome come from? Is this another case of \"POOF, it was a miracle\" when faced with reality?\n\n \n Where did Jesus get his magic powers from?\n \n BTW If angels could do the baby mama drama before the flood then God can too.", 
   {}, 
   35429, 
   null, 
   1077351660.0
  ], 
  [
   35443, 
   null, 
   "Hank", 
   "Your an idiot Hank. If god could create the world in 7 days then he sure as hell could get someone pregnant.\n\n \n What a nice way to initially address someone imrahil. You are a shining example of how Christ has changed your life and no doubt one of the reasons people are flocking to your religion.\n \n If there is a God, then no one doubts that he could get someone pregnant or create the world in 7 days. The question is, DID he do that just because he COULD do that. And the evidence for both is overwhelming no.\n \n BTW your group used to call people XXXXXX that thought the evidence showed the earth rotated around the sun because they said the Bible said it didn&#8217;t. Lately they have backed off of those statements.\n \n And it&#8217;s &#8220;you&#8217;re&#8221;, not &#8220;your&#8221;. :)", 
   {}, 
   35426, 
   null, 
   1077375240.0
  ], 
  [
   35444, 
   null, 
   "Hank", 
   "Since God is omnipotent that is true. Omni means all. Potent means able to have intercourse. Wow I think I may have won Hank's debate and the only proof you need is at dictionary.com\n\n \n Well as long as you ignore the evidence, why do you need proof. Blind faith works just fine.", 
   {}, 
   35428, 
   null, 
   1077375420.0
  ], 
  [
   35471, 
   null, 
   "mizmaxx", 
   "Your an idiot Hank. If god could create the world in 7 days then he sure as hell could get someone pregnant.\n\n Well, that aughta shut you up, eh Hank? LOL! :p \n \n Way to disprove the virgin birth, IMRAHIL. Of course neither the virgin birth story or the creation story are true. If a similar occurance were to happen today, the same ppl who believe it could have happened in antiquity would consider it ridiculous, and scrutinize the occurance to a degree they would never question their dogma.", 
   {}, 
   35428, 
   null, 
   1077400740.0
  ], 
  [
   35472, 
   null, 
   "Hank", 
   "Well, that aughta shut you up, eh Hank? LOL! :p \n \n Way to disprove the virgin birth, IMRAHIL. Of course neither the virgin birth story or the creation story are true. If a similar occurance were to happen today, the same ppl who believe it could have happened in antiquity would consider it ridiculous, and scrutinize the occurance to a degree they would never question their dogma.\n\n \n Yep, I&#8217;m pretty devastated.", 
   {}, 
   35471, 
   null, 
   1077401340.0
  ], 
  [
   36336, 
   null, 
   "Hank", 
   "?!? \n \n Why have a judge, anyway? What qualifies a judge to judge in this forum? If it's all about a generating thought and argument, and not about changing minds, why make it a contest?\n \n Zee\n\n \n Well it has started in the debate section. You might want to take a look to see if it is what you thought it would be.", 
   {}, 
   29865, 
   null, 
   1077764460.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Virgin birth", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1427-virgin-birth.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 1427, 
  "discussion_files": [
   [
    "16518.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1427-virgin-birth-print.html"
   ], 
   [
    "16519.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1427-virgin-birth-3-print.html"
   ], 
   [
    "16520.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/1427-virgin-birth-2-print.html"
   ]
  ], 
  "identifier": 1427
 }
]