[
 [
  [
   403906, 
   null, 
   "Superlite27", 
   "In another thread, someone voiced a challenge to point out one instance of someone using a gun to stop a shooting spree. Too easy. I just Googled Jeanne Assam, and TA-DA! \n \n So I wondered: Would it be as easy to point out a gun law that has stopped a shooting spree as it was for an armed citizen? So I googled \"Gun law saves life\". \n \n Guess what? EVERY SINGLE HIT was about how gun control was the biggest prepetuated farce in existence. So I Googled \"Victim shoots robber\". \n \n Instantly: HUNDREDS OF HITS about everyday folks responsibly defending themselves.\n \n Wow. Why is that? After all, I keep hearing about how gun control laws are so wonderful, and gun owners are so evil. You would think, if this has any shred of credibility, a simple search would back that up, right?\n \n So, I thought of a little experiment. \n \n How about posting links of search terms and their results? Don't you think this would lead to a general sense of which perspective is correct, and which perspective is a deluded exercise in whimsical fantasy? \n \n Why is it that searches for anything self-defense with a firearm related pumps out hundreds of results matching EXACTLY what you're looking for, yet searches attempting to find beneficial results of gun control laws pumps out hundreds of results of THE OPPOSITE of what you're looking for?\n \n Certainly, if gun control was the true face of all things good, it would be incredibly easy to just type in \"gun control\" and all that warm fuzzy goodness would just pop right up, huh?\n \n I've been trying, to no avail.\n \n gun control saves man's life - Google Search..... Think this will work? Nope. Just a bunch of individual names and instances of guns saving lives.\n \n victim shoots attacker - Google Search....Yup. Just what I was looking for. Pages and pages of incidents and individual names of folks saved by defensive handgun use.\n \n Gun control saves victim - Google Search.......... Nope. Just more instances of people saving their own lives with firearms. NOT what I was looking for.\n \n Ten minutes and I've already uncovered hundreds of individual names of folks saved by guns. Yet, no names of individuals saved by gun control. As a matter of fact, I keep searching for individuals saved by gun control and STILL get names of individuals saved by guns. Why is this? \n \n All I want is ONE, just one, name of a person saved by a gun control law. You would think it would be easy since all I ever hear about is how gun control is so great, right?\n \n Anyone else care to try?", 
   {
    "post_info": {
     "post_title": "Fun experiment for both sides!"
    }
   }, 
   null, 
   null, 
   1275624960.0
  ], 
  [
   403907, 
   null, 
   "NATO 556", 
   "Anybody who's life was supposedly \"saved by the existence of a gun control law\" lost their life due to either being stabbed, run over, poisoned, beaten, strangled, or just plain blown the **** up.", 
   {}, 
   403906, 
   null, 
   1275625140.0
  ], 
  [
   403908, 
   null, 
   "Superlite27", 
   "Any links? I'm looking for search links. Certainly a search will find all those folks who benefit from gun control laws?\n \n Here. Let me try this:\n \n innocent children saved by gun control - Google Search\n \n Darn it! Look at the results! All a bunch of articles on how gun control is a sham. \n \n I figured this would be a jackpot for finding folks saved by those wonderful gun control laws. After all, it was for the children!\n \n Why, oh why can't I find the truth? Am I supposed to believe that all these results are all a bunch of lies? Why aren't articles about the wonderful benefits of gun control popping up since they are supposedly touted by all the smart and intelligent folks here who support it?\n \n I mean, we gun owners are just a fringe group of nutcases, right? Certainly if gun control was the be all/end all that the masses believe it to be, the majority of results would back that up? Why would EVERY SINGLE SEARCH PERFORMED return a litany of pages and pages supporting such a tiny little fringe of society?", 
   {}, 
   403907, 
   null, 
   1275625920.0
  ], 
  [
   403931, 
   null, 
   "Steeeeve", 
   "I still haven't seen a more convincing argument for the right to bear arms than the need to keep your government honest.", 
   {}, 
   403908, 
   null, 
   1275634440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fun experiment for both sides!", 
  "url": "http://www.4forums.com/political/gun-control-debates/14302-fun-experiment-both-sides.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14302, 
  "discussion_files": [
   [
    "21716.html", 
    "http://www.4forums.com/political/gun-control-debates/14302-fun-experiment-both-sides-print.html"
   ]
  ], 
  "identifier": 14302
 }
]