[
 [
  [
   406245, 
   null, 
   "simone", 
   "Yes! According to Scientology screwball Sharron Angle that's true!\n \nSharron Angle may be giving the press the silent treatment now, but she hasn't always been so tight-lipped. Think Progress (via Alternet) has dug up some eyebrow-raising audio of a radio interview the Nevada Senate candidate did with Bill Manders back in January. The subject: abortion. Her stance: disgusting.\n \n Manders asks her whether there is \"any reason at all for an abortion,\" and she answers: \"Not in my book.\" For clarity, he says: \"So, in other words, rape and incest would not be something?\" And Angle replies with this reasoning: \"You know, I'm a Christian, and I believe that God has a plan and a purpose for each one of our lives and that he can intercede in all kinds of situations and we need to have a little faith in many things.\" You see, God planned your rape and pregnancy. Isn't that reassuring?\n\n Sharron Angle: God planned your rape, don't abort! - Broadsheet - Salon.com\n \n Nutcase Angle of Nevada is running again Senator Majority Leader Harry Reid in this fall's election.\n \n The question is, are there enough screwballs and nutcases in Nevada to elect her?", 
   {
    "post_info": {
     "post_title": "God planned your rape, don't abort!"
    }
   }, 
   null, 
   null, 
   1278184920.0
  ], 
  [
   406248, 
   null, 
   "NATO 556", 
   "Depends on how seriously p***ed off Harry Reid made the people, and how many of them want \"change\" just like when they voted Obama into office.\n \n We all saw what a nightmare that turned out to be.", 
   {}, 
   406245, 
   null, 
   1278185340.0
  ], 
  [
   406278, 
   null, 
   "jazyjason", 
   "Depends on how seriously p***ed off Harry Reid made the people, and how many of them want \"change\" just like when they voted Obama into office.\n \n We all saw what a nightmare that turned out to be.\n\n \n A Nightmare because the Republicans have used the filibuster as a weapon to stop legislation. Over 300 pieces of legislation have yet to be voted on and nearly double that in the senate that have already passed the house...\n \n Yeah don't try to hide behind that smokescreen...", 
   {}, 
   406248, 
   null, 
   1278215640.0
  ], 
  [
   406281, 
   null, 
   "NATO 556", 
   "A Nightmare because the Republicans have used the filibuster as a weapon to stop legislation. Over 300 pieces of legislation have yet to be voted on and nearly double that in the senate that have already passed the house...\n \n Yeah don't try to hide behind that smokescreen...\n\n \n With all the debt Obama has generated for our nation, he deserves to be filibustered into the ground. For too long the democrats had absolute power and ran amok and unchecked, answering to absolutely nobody and ignoring the will and the voice of the people.", 
   {}, 
   406278, 
   null, 
   1278216480.0
  ], 
  [
   406288, 
   null, 
   "Penfold", 
   "With all the debt Obama has generated for our nation, he deserves to be filibustered into the ground. For too long the democrats had absolute power and ran amok and unchecked, answering to absolutely nobody and ignoring the will and the voice of the people.\n\n \n Which planet in your parallel universe did this happen on? You should stick to topics on which you know something............... Oh, sorry, I see your problem.", 
   {}, 
   406281, 
   null, 
   1278249240.0
  ], 
  [
   406289, 
   null, 
   "gansao", 
   "Which planet in your parallel universe did this happen on? You should stick to topics on which you know something............... Oh, sorry, I see your problem.\n\n \n Said the troll that lives in the UKemoticon_xdonno", 
   {}, 
   406288, 
   null, 
   1278249780.0
  ], 
  [
   406310, 
   null, 
   "Easyrider", 
   "Which planet in your parallel universe did this happen on? You should stick to topics on which you know something............... Oh, sorry, I see your problem.\n\n \n The problem is you, Pinfold. You shouldn't be trying to educate these people when you don't have even an ouce of moral clarity to base anything on.", 
   {}, 
   406288, 
   null, 
   1278263160.0
  ], 
  [
   406319, 
   null, 
   "simone", 
   "Moral clarity, ER?\n \n Whenever did you achieve that?", 
   {}, 
   406310, 
   null, 
   1278271800.0
  ], 
  [
   406877, 
   null, 
   "Shooterandproud", 
   "With all the debt Obama has generated for our nation, he deserves to be filibustered into the ground. For too long the democrats had absolute power and ran amok and unchecked, answering to absolutely nobody and ignoring the will and the voice of the people.\n\n \n I get it, it was Obama that generated our debt and not the president who started a war that cost $1,015,002,700,000 and counting.\n \n Nice one. Did you honestly think you'd get away with that?", 
   {}, 
   406281, 
   null, 
   1278704280.0
  ], 
  [
   407020, 
   null, 
   "NATO 556", 
   "I get it, it was Obama that generated our debt and not the president who started a war that cost $1,015,002,700,000 and counting.\n \n Nice one. Did you honestly think you'd get away with that?\n\n \n The war isn't the reason banks shelled out millions of dollars to people who could never repay it. All that money came from somewhere, like corporations that expected to see a return on their investments. They got nothing, they laid off people as a result, which lead to the rates of unemployment and the housing fiasco.", 
   {}, 
   406877, 
   null, 
   1278861000.0
  ], 
  [
   407021, 
   null, 
   "Easyrider", 
   "Moral clarity, ER?\n \n Whenever did you achieve that?\n\n \n When I got saved.\n \n When are you people going to quit murdering the innocent unborn? \n \n You don't kill an innocent baby for the sins or personal convenience of the parents. Got it?", 
   {}, 
   406319, 
   null, 
   1278863460.0
  ], 
  [
   407029, 
   null, 
   "simone", 
   "Are you sure you're saved?\n \n Did God sign a contract with you?", 
   {}, 
   407021, 
   null, 
   1278877560.0
  ], 
  [
   407762, 
   null, 
   "Bennedict", 
   "When I got saved.\n \n When are you people going to quit murdering the innocent unborn? \n \n You don't kill an innocent baby for the sins or personal convenience of the parents. Got it?\n\n \n yea i got it.\n \n but what if a woman were to get raped. got pregnant, and got denied for an abortion. imagine telling your child when they ask \"where's my Daddy?\", \"your Daddy is a man who forced himself to have sex with me at a party.\" imagine the shame you would bring to your child, knowing theyre a product of hatred, abuse, cruelty, misogyny, everything bad in the world. its an incredibly serious issue that can be helped (not solved) through abortion. its never an easy process, emotionally, but it needs to be done. i argue in favour of evolution, gay rights and that type of thing, but nothing saddens me more than to see someone argue against helping a woman who has endured the worst act imaginable.", 
   {}, 
   407021, 
   null, 
   1279599180.0
  ], 
  [
   407811, 
   null, 
   "gansao", 
   "yea i got it.\n \n but what if a woman were to get raped. got pregnant, and got denied for an abortion. imagine telling your child when they ask \"where's my Daddy?\", \"your Daddy is a man who forced himself to have sex with me at a party.\" imagine the shame you would bring to your child, knowing theyre a product of hatred, abuse, cruelty, misogyny, everything bad in the world. its an incredibly serious issue that can be helped (not solved) through abortion. its never an easy process, emotionally, but it needs to be done. i argue in favour of evolution, gay rights and that type of thing, but nothing saddens me more than to see someone argue against helping a woman who has endured the worst act imaginable.\n\n \n I dont think that rape is the worst act imaginable.\n Covering someone with boiling water and sugar or cutting their thumbs off are worse acts IMO.\n Also avoiding telling your child that they were the product of rape seems a bit of a lame excuse to abort it!\n \n I believe that in a secular society we cannot force women to give birth to an unwanted child and that it may be acceptable to abort a child if it is done within a reasonable time but lets not get too emotionalemoticon_cry", 
   {}, 
   407762, 
   null, 
   1279658520.0
  ], 
  [
   407816, 
   null, 
   "Bennedict", 
   "I dont think that rape is the worst act imaginable.\n Covering someone with boiling water and sugar or cutting their thumbs off are worse acts IMO.\n Also avoiding telling your child that they were the product of rape seems a bit of a lame excuse to abort it!\n \n I believe that in a secular society we cannot force women to give birth to an unwanted child and that it may be acceptable to abort a child if it is done within a reasonable time but lets not get too emotionalemoticon_cry\n\n \n true, but i disagree with rape not being the worst act imaginable - reasonably. sure, you could think of worst things but theyre just ridiculous. rape actually happens.\n \n and its not so much telling the child that theyre a product of rape, but more the child actually being a product of rape.", 
   {}, 
   407811, 
   null, 
   1279663680.0
  ], 
  [
   407817, 
   null, 
   "gansao", 
   "true, but i disagree with rape not being the worst act imaginable - reasonably. sure, you could think of worst things but theyre just ridiculous. rape actually happens.\n \n and its not so much telling the child that theyre a product of rape, but more the child actually being a product of rape.\n\n \n Someone had boiling sugar solution poured over them while being tortured in England a few years back, it does happen.\n \n You defined the severity of the crime and you provided the scenario.\n Are you now changing the scenario from aborting the baby to avoid telling them that they were a product of rape to aborting the baby BECAUSE they are a product of rape?", 
   {}, 
   407816, 
   null, 
   1279663980.0
  ], 
  [
   407876, 
   null, 
   "Bennedict", 
   "Someone had boiling sugar solution poured over them while being tortured in England a few years back, it does happen.\n \n You defined the severity of the crime and you provided the scenario.\n Are you now changing the scenario from aborting the baby to avoid telling them that they were a product of rape to aborting the baby BECAUSE they are a product of rape?\n\n \n what the hell are you talking about? i never changed anything, i ment to say both of those things. the latter moreso than the former but still, both valid reasons for supporting abortion IMO.\n \n are you seriously arguing for the sake of arguing? you strike me as a person who is against rape (or i should hope so), and that being a reason to be pro-choice, like me, so what are you arguing about?", 
   {}, 
   407817, 
   null, 
   1279679880.0
  ], 
  [
   407935, 
   null, 
   "gansao", 
   "what the hell are you talking about? i never changed anything, i ment to say both of those things. the latter moreso than the former but still, both valid reasons for supporting abortion IMO.\n \n are you seriously arguing for the sake of arguing? you strike me as a person who is against rape (or i should hope so), and that being a reason to be pro-choice, like me, so what are you arguing about?\n\n \n I think the examples that you provided are too turgid and emotional for a realistic view of abortion.\n Most abortions are provided to pregnant women who do not want a baby because of financial or social reasons not because the pregnant woman was raped.\n A far more common scenario is a woman who's contraception has failed and she simply feels that she is not ready for motherhood or having more children.\n Abortion is a cynical and brutal solution to the problem of an unwanted child.\n Many pro choicers try to counteract this by dehumanising the fetus.\n Every abortion is a failure, it is a termination of the potential of a human being..not just ridding the mother of a problem.\n \n However, in a secular society there should be a provision to rid a mother of her unborn child provided the fetus is not developed enough to feel pain or fear...\n I believe everyone has the right to their own road to hell.\n \n Yes I am against rape.\n I am also against torture and death.\n I will give you two guesses to tell me what fate I would choose out of the two...", 
   {}, 
   407876, 
   null, 
   1279744260.0
  ], 
  [
   407939, 
   null, 
   "Bennedict", 
   "I think the examples that you provided are too turgid and emotional for a realistic view of abortion.\n Most abortions are provided to pregnant women who do not want a baby because of financial or social reasons not because the pregnant woman was raped.\n A far more common scenario is a woman who's contraception has failed and she simply feels that she is not ready for motherhood or having more children.\n Abortion is a cynical and brutal solution to the problem of an unwanted child.\n Many pro choicers try to counteract this by dehumanising the fetus.\n Every abortion is a failure, it is a termination of the potential of a human being..not just ridding the mother of a problem.\n \n However, in a secular society there should be a provision to rid a mother of her unborn child provided the fetus is not developed enough to feel pain or fear...\n I believe everyone has the right to their own road to hell.\n \n Yes I am against rape.\n I am also against torture and death.\n I will give you two guesses to tell me what fate I would choose out of the two...\n\n \n fair enough - probably the second one.\n it was just one example of many reasons to be pro-abortion, and youre right, most abortions are not due to rape, but some are and anti-abortion supporters are denying this procedure to help a woman who has been raped. i say again, its not ridding the mother of a problem, its helping her through a tough time that just got a million times tougher.\n \n anyways, like i said, thats just one example. mistakes happen sometimes no matter how carefully you make sure they dont. i think its unfair to say that someone now needs to spend the next 20+ years raising a child that was ultimately an accident to begin with - an adoptee or the parent themselves. and they have no choice - and if they do have a choice, theyre going to hell for eternity after they die if they choose to do it. the whole thing is just unfair to me.", 
   {}, 
   407935, 
   null, 
   1279745700.0
  ], 
  [
   407942, 
   null, 
   "gansao", 
   ":telephone\nfair enough - probably the second one.\n it was just one example of many reasons to be pro-abortion, and youre right, most abortions are not due to rape, but some are and anti-abortion supporters are denying this procedure to help a woman who has been raped. i say again, its not ridding the mother of a problem, its helping her through a tough time that just got a million times tougher.\n \n anyways, like i said, thats just one example. mistakes happen sometimes no matter how carefully you make sure they dont. i think its unfair to say that someone now needs to spend the next 20+ years raising a child that was ultimately an accident to begin with - an adoptee or the parent themselves. and they have no choice - and if they do have a choice, theyre going to hell for eternity after they die if they choose to do it. the whole thing is just unfair to me.\n\n \n I understand what you are saying Bennedict and I rightly assumed that you were robust enough to cope with a slightly argumentative response.\n \n I do not believe in a hell of eternal torment but I respect those who do.\n \n 'I believe everyone has the right to their own road to hell' is my way of saying that a secular society cannot be ruled by religious beliefs...even though I believe in God....", 
   {}, 
   407939, 
   null, 
   1279746720.0
  ], 
  [
   408333, 
   null, 
   "simone", 
   "Um, gansao, are you one of the a$$hats who advocates \"leaning back and enjoying,\" like those brainless zhombies of the last century?", 
   {}, 
   407942, 
   null, 
   1279993200.0
  ], 
  [
   408352, 
   null, 
   "gansao", 
   "Um, gansao, are you one of the a$$hats who advocates \"leaning back and enjoying,\" like those brainless zhombies of the last century?\n\n \n No.\n Why do you think that?I dont think that you have actually read my last posts", 
   {}, 
   408333, 
   null, 
   1279996140.0
  ], 
  [
   409084, 
   null, 
   "veiled", 
   "While I am politically pro-choice, I am pro-life for myself. I believe in small government, and the ability to make choices.\n \n My oldest child was conceived from rape. It happened soon before I was to leave for pre-med. I chose to have my son and raise him. I'd rather not discuss it farther, but that was my choice to make, and I'm glad that I made the choice I did.", 
   {}, 
   408352, 
   null, 
   1280903220.0
  ], 
  [
   409201, 
   null, 
   "simone", 
   "Veiled, I hope you will discuss your personal situation further.\n \n You are protected, I'd presume, by the anonymity of the net.\n \n I'd like to know if you were able to pursue your career goals despite your forced pregnancy -- and if you were able to support yourself and your new responsibility at a reasonable level, being able to live in decent housing, having enough food, clothing, the ability to educate your child, et al.", 
   {}, 
   409084, 
   null, 
   1281035820.0
  ], 
  [
   409232, 
   null, 
   "veiled", 
   "It had a serious impact upon my life, and I had to change my career goals. I struggled, and needed the help of my family for quite a while. I also suffered from depression. Thankfully, I was able to pull myself out of that situation, but it's not something I would wish upon anyone.\n \n I will never judge a woman for making a different choice. I know precisely how being in that situation feels, and I fully understand why many choose to end the pregnancy.", 
   {}, 
   409201, 
   null, 
   1281056760.0
  ], 
  [
   409273, 
   null, 
   "simone", 
   "I respect your decision, especially because of your stance that what you chose should not be forced upon anyone else.\n \n I wish that we did not live in a society which penalized women with children so much. \n \n In more advanced industrial nations, like those of continental Europe, you would have been able to have childcare and the security to pursue your career goals. We have the misfortune to live in a very backward and barbaric nation which values warfare above all else.\n \n Women and children can go to hell! But we can sure pour money into the war moachine.", 
   {}, 
   409232, 
   null, 
   1281117660.0
  ], 
  [
   409464, 
   null, 
   "Easyrider", 
   "\n \n Women and children can go to hell! But we can sure pour money into the war moachine.\n\n \n Oh, you'd rather speak Farsi and wear a Burkha?\n \n You liberal Kool Aid drinkers have no concept of what evil is or how to deal with it.\n \n You know, I really loved that one comment from that Williams guy I once referenced, which read:\n \n \"Their (the liberal's) inability to grasp the obvious leads them into that corner every time and once there, once diplomacy has run its course without results, they are out of business.\" \n \n In other words, \"After the appeasing liberals are done with their seemingly endless, hot-air, wind-jamming sessions at the inept and corrupt U.N. - after clinging desperately to the coat tails of Jacques Chirac and Rosie O'Donnell; after all their sophomoric Jane Fonda and Cindy Sheehan surrender rallies and Neville Chamberlain pseudo-peace ploys; and with the bad guys still refusing to budge one iota - they're done. Finis. Game over. That's all there is from the libs, there isn't any more. Not even a lethal dose of Viagra can possibly get them to stand up now. All that&#8217;s left for them is to go home, wring their hands, and wait for the WMD&#8217;s to come crashing down on their Greenpeace-utopian fantasyland. \n \n And, besides their godless infanticide against the innocent unborn, that's why liberals are dangerous.", 
   {}, 
   409273, 
   null, 
   1281280260.0
  ], 
  [
   409467, 
   null, 
   "Bennedict", 
   "Game over man! Game over!!!!", 
   {}, 
   409464, 
   null, 
   1281281760.0
  ], 
  [
   409485, 
   null, 
   "simone", 
   "You mean the rant wins?", 
   {}, 
   409467, 
   null, 
   1281296580.0
  ], 
  [
   409526, 
   null, 
   "Bennedict", 
   "Burkha's are cool, man. id wear one with a silk screened picture of Muhammed on it. and a kool-aid dispensing hat, of course.\n \n that would be awesome.", 
   {}, 
   409485, 
   null, 
   1281327420.0
  ], 
  [
   409851, 
   null, 
   "ms20150", 
   "greattttttttttt", 
   {
    "post_info": {
     "post_title": "hi"
    }
   }, 
   407816, 
   null, 
   1281619980.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  God planned your rape, don't abort!", 
  "url": "http://www.4forums.com/political/abortion-debates/14410-god-planned-your-rape-dont-abort.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 14410, 
  "discussion_files": [
   [
    "26827.html", 
    "http://www.4forums.com/political/abortion-debates/14410-god-planned-your-rape-dont-abort-print.html"
   ], 
   [
    "26828.html", 
    "http://www.4forums.com/political/abortion-debates/14410-god-planned-your-rape-dont-abort-3-print.html"
   ], 
   [
    "26829.html", 
    "http://www.4forums.com/political/abortion-debates/14410-god-planned-your-rape-dont-abort-2-print.html"
   ]
  ], 
  "identifier": 14410
 }
]