[
 [
  [
   406875, 
   null, 
   "NATO 556", 
   "The Volokh Conspiracy Iowa Federal Court Finds Sheriff Denied Concealed Carry Because of Applicant?s Political Activity, Orders Sheriff to Take a First Amendment Class\n \n \nThe case is Dorr v. Weber, decided yesterday (some citations omitted); the court ordered the sheriff to grant the permit, but also wrote:\n \n Paul [Dorr] was denied a permit precisely because Sheriff Weber believed that his free speech rights offended the majority of voters in Osceola County....\n \n In denying Paul a concealed weapons permit, Sheriff Weber single handedly hijacked the First Amendment and nullified its freedoms and protections. Ironically, Sheriff Weber, sworn to uphold the Constitution, in fact retaliated against a citizen of his county who used this important freedom of speech and association precisely in the manner envisioned by the founding members of our Nation who ratified the Bill of Rights on December 15, 1791. In doing so, this popularly elected Sheriff, who appears to be a fine man and an excellent law enforcement officer, in all other regards, blatantly caved in to public pressure and opinion and, in doing so, severely trampled the Constitution and Paul's First Amendment rights to freedom of speech and association. This is a great reminder that the First Amendment protects the sole individual who may be a gadfly, kook, weirdo, nut job, whacko, and spook, with the same force of protection as folks with more majoritarian and popular views....\n \n [Footnote:] Following trial, the court alerted the parties to the possibility that it might order Sheriff Weber to take a class to educate him on the First Amendment. It provided the parties with 10 days to file briefs relating to the court's authority to order such remedial relief. Sheriff Weber did not file a brief.\n \n Sheriff Weber's dramatic and stunning failure to appreciate, and to protect and defend, Paul's basic First Amendment rights, compels remedial relief.... Sheriff Weber ... must complete [a class that] ... must provide college level instruction on the United States Constitution, including - at least in part - a discussion of the First Amendment. Sheriff Weber shall attach his transcript or other proof of completion to the affidavit - Sheriff Weber must obtain a passing grade or obtain an otherwise satisfactory assessment of his participation in the class.\n \n More of the court's legal analysis follows:\n \n The court also finds that withholding a concealed weapons permit from an applicant [based on his past speech] would chill the speech of a person of ordinary firmness. The court recognizes that, \"it would trivialize the First Amendment to hold that harassment for exercising the right of free speech was always actionable no matter how unlikely to deter a person of ordinary firmness from that exercise.\" Naucke, 284 F.3d at 928 (citations omitted). However, the nature of a concealed weapons permit convinces the court that an applicant, who presumably seeks the permit in order to carry a pistol or revolver on their person, would reasonably be deterred from exercising their First Amendment rights if it led to a denial of the permit. Denial of the permit would prevent the applicant from carrying a pistol or revolver under the circumstances provided for in the permit .... and such a denial leaves the applicant with an unremedied concern for their own safety, or the safety of others....\n \n Sheriff Weber has been generally consistent on his reason for denying Paul's applications. In his deposition, which was admitted into evidence, Sheriff Weber was asked what had changed between 2006, the last year that he approved Paul's application for a permit, and 2007, the year Sheriff Weber first disapproved Paul's application for a permit. Sheriff Weber explained:\n \n Well, you brought up the OCTA, Mr. Dorr's affiliation with\n that. He started sending out letters to the editor, emails, [flyers] on doors and cars, handing out brochures. People talked about it....\n \n He interjected himself into the public view or conscience or whatever you want to call - the consciousness, whatever you want to call it. People started talking about him....\n \n So to answer your question, that's what's changed, is that he was a lot more active locally. I think a lot of his activities - I read a newspaper article, \"The Gospel According to Paul Dorr,\" where he does other work in other towns, other states and so forth. So we don't really hear that here, but - so he was kind of out of the public view, I - in my opinion.\n \n Following this response, Sheriff Weber was asked whether it was \"his\n work with the OCTA that brought him into your public view?\" Sheriff Weber replied, \"Correct, and people started talking about it saying things like, 'Oh, that guy's a nut job. Oh, that guy's whacko.'\" At trial, Sheriff Weber provided the same rationale for denying Paul's permit: Paul's involvement with the OCTA and the concern Sheriff Weber received from the public due to his involvement with the OCTA.\n \n I blogged in May about an earlier decision in the case. Iowa still has a discretionary concealed carry permit system, though it is shifting to a shall-issue system next year. Thanks to Fred Ray for the pointer.\n\n \n This is why no issuance officer should ever have discretionary say over who can have a permit and who can't. Because stuff like this can, will, and does happen.", 
   {
    "post_info": {
     "post_title": "A case for ending may-issue standards"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1278703680.0
  ], 
  [
   406886, 
   null, 
   "Doc Jones", 
   "The Volokh Conspiracy Iowa Federal Court Finds Sheriff Denied Concealed Carry Because of Applicant?s Political Activity, Orders Sheriff to Take a First Amendment Class\n \n \n \n This is why no issuance officer should ever have discretionary say over who can have a permit and who can't. Because stuff like this can, will, and does happen.\n\n \n Good snag! Long ago, The People v. Zerillo was heard in the Supreme Court and the ruling was that the right of the people to keep and bear arms cannot be made subject to the will of the Sheriff.\n \n Seems like a good law to follow and add \"any government official whether elected or appointed\".", 
   {}, 
   406875, 
   null, 
   1278708060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A case for ending may-issue standards", 
  "url": "http://www.4forums.com/political/gun-control-debates/14429-case-ending-may-issue-standards.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14429, 
  "discussion_files": [
   [
    "23788.html", 
    "http://www.4forums.com/political/gun-control-debates/14429-case-ending-may-issue-standards-print.html"
   ]
  ], 
  "identifier": 14429
 }
]