[
 [
  [
   406914, 
   null, 
   "WizeGuy2080", 
   "Gorege W. Bush --- We all heard of him. President for 2(two) term, started the Middle Eastern War, and dropped the ball on the economy. But yet he was elected, not only once, but twice. So he must have done something right. Don't you get it yet, he was not a bad Leader. He did what he could at the time. He had 9/11/01, Katrina, and two wars in the Middle East to deal with. Now first we will begin with 9/11. Beside the economy, this was the first major problem for Bush. World Trade Center hit by 2(two) Amercain 747s, which were hijacked by Arabian terroist. Major amount of people died and millions of dollar in property damage. This will lead to the war. A lot of people who at first against the war or were change into hating the war says that we should not have gone into Iraq and i say then what the hell should we have done? Stand there with are c%@ks in are A%@. We had to do something and sitting at home bombing the hell out of Iraq and Afganistan is not a way to win or stop terroism. There has to be boots on the ground to win a war. If we did not go into these countrys we would be attack again by these terroist and terroist funders. Not only we took out a evil dictator and made a goverment for Afganistan but we are trying to impove the lives of the people. The we got Katrina one of thw worst Hurricans, cause more damage than all of the tornados put to gether that year. \n \n Also the rouge wave that hit all those pacific islands. We had a Carrier docked in one of the citys in Indonesia that supplied power, water, food and medical care to the people there. It took several decades off the fuel supplies for the ship (which runs of two nuclear reactors). All this stuff happend in sort distance inbetween themselfs and bush handled in like a pro. But obama can't handdle dealing with the gulf oil spill and the war(which is pretty much over) And think he should bail out banks and companys and sorts. Obama's polls are lower than Bushes was at this time in date. He has done more failures than bush in 1.5 years. Now if you still think that Bush was a Bad leader comment on this what you think, because i want to hear your side.\n \n Now to the economy, it starts with Ronald Reagan, he start the reform called Reaganomics. It jumped the economy and then when Cliton came to the office he change the whole thing. Begining of his term, the enconomy was still on the rise, but after he change the reform in is own way the economy started to drop.This went through a couple of leader and all the way to Obama. If bush was not ocupied with the war and other events he could have done some. Obama on the other hand tryed and failed right off the bat. Please if you feel different, commant and make your peace.", 
   {
    "post_info": {
     "post_title": "Gorege W. Bush Listen to this."
    }
   }, 
   null, 
   null, 
   1278721680.0
  ], 
  [
   406915, 
   null, 
   "gansao", 
   "Reading this post was difficult because of the grammar and spelling.\n I gave up before the end.", 
   {}, 
   406914, 
   null, 
   1278722280.0
  ], 
  [
   406917, 
   null, 
   "WizeGuy2080", 
   "Then why post stuff on this if you feel that you can't read it.", 
   {
    "post_info": {
     "post_title": "..."
    }
   }, 
   406915, 
   null, 
   1278722700.0
  ], 
  [
   406924, 
   null, 
   "NATO 556", 
   "Then why post stuff on this if you feel that you can't read it.\n\n \n So you'll correct it and make it more coherent for people to actually read.", 
   {}, 
   406917, 
   null, 
   1278726420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gorege W. Bush Listen to this.", 
  "url": "http://www.4forums.com/political/politics-debates/14430-gorege-w-bush-listen.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 14430, 
  "discussion_files": [
   [
    "27623.html", 
    "http://www.4forums.com/political/politics-debates/14430-gorege-w-bush-listen-print.html"
   ]
  ], 
  "identifier": 14430
 }
]