[
 [
  [
   407038, 
   null, 
   "Penfold", 
   "Damn those legislators preventing citizens from having their number of guns restricted!\n \n \"A TWO-year-old boy was horrifically killed when his nine-year-old brother found a gun in their Los Angeles home and accidentally shot him, local TV station KTLA reported.\n \n Police arrived at the home Friday night in response to a report of a shooting and found the toddler with a gunshot wound to his upper torso.\n \n The little boy was rushed to a nearby hospital but died shortly after arriving.\n \n Police established that the child's brother had fired the fatal shot after questioning family members at their home in the city's North Hills district.\"\n \n \n Boy accidentally shot, killed two year old brother | Herald Sun", 
   {
    "post_info": {
     "post_title": "We need more guns in American homes. Not."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1278885240.0
  ], 
  [
   407039, 
   null, 
   "NATO 556", 
   "Dancing in the blood of the innocent, again, Penfold?\n \n This happened in California, where mandatory storage laws exist. There's also no way enacting a limit on the number of guns could have prevented this, so there goes your rant. Plus the police haven't yet filed any charges against anyone. And so far there's no proof that this wasn't a crime family where both parents are criminal offenders with records.\n \n Of course this all could have been easily avoided if children were still taught firearms safety, rather than learning stuff from movies and thinking its real.\n \n Come back when you have something more definite.", 
   {}, 
   407038, 
   null, 
   1278888600.0
  ], 
  [
   407045, 
   null, 
   "Penfold", 
   "Still splashing in the blood of innocents, killed by policies you promote. Murderer.", 
   {}, 
   407039, 
   null, 
   1278891240.0
  ], 
  [
   407050, 
   null, 
   "NATO 556", 
   "You can't stop stupid, or accidents, from happening. No matter what policy you might try and enact. Just look at all the school shootings in Germany of all places. All the school massacres in China.", 
   {}, 
   407045, 
   null, 
   1278897600.0
  ], 
  [
   407052, 
   null, 
   "Steeeeve", 
   "Like in the other thread, increasing the number of concealed handguns does not increase accidental shootings. This is tragic but guns don't increase this nor do they decrease this.", 
   {}, 
   407050, 
   null, 
   1278899520.0
  ], 
  [
   407093, 
   null, 
   "Easyrider", 
   "Still splashing in the blood of innocents, killed by policies you promote. Murderer.\n\n \n Coming from a far left radical promoter of everything that enslaves and eventually kills people, that's quite a statement.\n \n Is there any more of your snake oil coming or shall we look to your messiah, Obama?", 
   {}, 
   407045, 
   null, 
   1278979800.0
  ], 
  [
   407094, 
   null, 
   "Zorba", 
   "Damn those legislators preventing citizens from having their number of guns restricted!\n \n \"A TWO-year-old boy was horrifically killed when his nine-year-old brother found a gun in their Los Angeles home and accidentally shot him, local TV station KTLA reported.\n \n Police arrived at the home Friday night in response to a report of a shooting and found the toddler with a gunshot wound to his upper torso.\n \n The little boy was rushed to a nearby hospital but died shortly after arriving.\n \n Police established that the child's brother had fired the fatal shot after questioning family members at their home in the city's North Hills district.\"\n \n\n \n It's my first post so I can't offer a complete link, but this article makes my point that handguns aren't required for killings to occur. And there is nothing accidental about what is happening in China where all civilians are unarmed and unable to defend themselves. Does China's gun ban protect its citizens from senseless and violent crime against children? \n Chinese 'copycat' stabs 31 at kindergarten in THIRD school attack in weeks\n By MAIL FOREIGN SERVICE\n Last updated at 1:45 AM on 30th April 2010\n Comments (9)\n Videos\n Add to My Stories\n \n A A knife-wielding man attacked a kindergarten class of four-year-olds in eastern China today, slashing 28 children and three adults.\n Experts said the sickening attack was a copycat rampage of two other episodes at Chinese schools in the past month.\n A 47-year-old jobless man, Xu Yuyuan, burst into a classroom at the Zhongxin Kindergarten early today, waving an eight-inch knife and stabbing a security guard who tried to stop him, the official Xinhua News Agency reported.\n Five students were in critical condition following the attack in Jiangsu province's Taixing city and two teachers and the security guard were injured, said Zhu Guiming, an official with the Taixing propaganda department.\n \n Horror: A child is taken to hospital after being attacked at the Zhongxin Kindergarten in what an expert said was a copycat rampage of two other episodes at Chinese schools in the past month\n \n Scene: A policeman enters the Zhongxin Kindergarten, where 31 people were injured by a knife-wielding man\n Just yesterday, a teacher on sick leave due to mental illness broke into a primary school in Guangdong province's Leizhou city in southern China and wounded 15 students and a teacher in a knife attack.\n That attack came on the same day a man was executed for killing eight children last month in stabbings that shocked China.\n It was not known if Xu knew about the previous day's attack in Guangdong, but Zhou Xiaozheng, a sociology professor at Renmin University in Beijing, said these sorts of violent attacks often happen in clusters because one may trigger copycat attacks.\n 'It's like suicide, which is another type of mental health problem that can spread in a community,' said Zhou. \n 'Normally, with these kind of violent events we hope the media won't blow them up too much. Because that tends to make it spread.' \n Horror: Drops of blood are seen on the steps of the kindergarten in Taixing, where a knifeman injured 28 children, two teachers and a security guard today\n A series of school attacks in China in recent years have mostly been blamed on people with personal grudges or suffering from mental illness, leading to calls for improved security.\n China's inadequate mental health network has left millions of unstable people without the help they need. \n Many otherwise healthy Chinese also feel frustrated and powerless because they aren't able to adapt to the constant social upheaval and because they believe the changes favour the corrupt. \n That kind of anger has occasionally erupted in mass violence and in isolated attacks.\n It is not known why schools are targeted.\n \n Concern: Concerned parents gather outside the gate of the kindergarten where a class of 4-year-olds were attacked \n A survey of mental health in four Chinese provinces published in the Lancet in June concluded that China likely had about 173 million adults nationwide with mental health disorders.\n The report claimed that most, 158 million, had never gotten any professional help for their problems.\n But state media said Zheng Minsheng, 42, had no history of mental illness before he rampaged through a school in Fujian province in March, killing eight children.\n During his trial, Zheng said he killed the children because he had been upset after being jilted by a woman and treated badly by her wealthy family.\n The court also heard that Zheng lived with his 80-year-old grandmother in a one-bedroom apartment and slept on the balcony in summer and in the living room in winter. \n He testified that he had trouble dealing with people at work but had not gotten the help he needed from his boss, so he quit his job but was unable to find another one.\n Yu Jianrong of the Chinese Academy of Social Sciences has said China's sweeping social changes might be partially to blame for Zheng's anti-social rage.\n \n Concern: People concerned for their loved ones crowd outside the school building after the attack\n 'A social environment lacking fairness and justice, in which those who abide by the rules gain nothing, while those who do not can profit, could bring about resistance by the weak against the entire society,' Yu was quoted as saying by the Southern Weekly newspaper a few weeks after the attack.\n Zheng was executed yesterday, just weeks after his crime. Zhou, the Renmin University professor, said China's use of capital punishment helps fuel the cycle of violence by enforcing a belief in 'blood for blood'.\n He said China should abolish the death penalty, improve human rights and make its justice system more fair and transparent.\n After a 2004 attack at a school in Beijing that left nine students dead, the central government mandated tighter school security nationwide.\n The Ministry of Education did not immediately respond to a fax today asking whether the attacks would result in orders to step up school security.\n In yesterday's attack, in which a teacher stabbed fourth and fifth graders in their heads, backs and arms, Xinhua said the suspect suffered from mental illness and had been on sick leave from another school since February 2006. \n He is now in police custody.\n None of the victims in that case had life-threatening wounds, said the director of the command centre at the Leizhou Public Security Bureau, who gave his name as Qin.\n Two weeks ago, a mentally ill man hacked to death a second grader and an elderly woman with a meat cleaver in southern Guangxi, and wounded five other people. \n dailymail.co.uk/news/worldnews/article-1269742/Chinese-knifeman-injures-31-kindergarten-attack--fourth-school-stabbing-recent-weeks.html?ITO=1490", 
   {
    "unicode_changes_made": true
   }, 
   407038, 
   null, 
   1278982980.0
  ], 
  [
   407143, 
   null, 
   "zsu2357", 
   "Damn those legislators preventing citizens from having their number of guns restricted!\n \n \"A TWO-year-old boy was horrifically killed when his nine-year-old brother found a gun in their Los Angeles home and accidentally shot him, local TV station KTLA reported.\n \n Police arrived at the home Friday night in response to a report of a shooting and found the toddler with a gunshot wound to his upper torso.\n \n The little boy was rushed to a nearby hospital but died shortly after arriving.\n \n Police established that the child's brother had fired the fatal shot after questioning family members at their home in the city's North Hills district.\"\n \n \n Boy accidentally shot, killed two year old brother | Herald Sun\n\n \n \n United States Drunk Driving Car Accident Statistics (2008)\n \n * There were 11,773 drunk driving deaths in 2008.\n * 2008 showed a 9.7% decrease from 2007 in alcohol-impaired driving deaths.\n * Drunk driving deaths (11,773) accounted for 32% of the total amount of United States car accident deaths (37,261) in 2008.\n  * 1,347 chil * Along with the 1,347 child occupant fatalities, another 34 children died as pedestrians or bikers who were hit by drunk drivers.dren ages 14 and younger died as occupants in car accidents in 2008. Of those deaths, 216 (approx 16%) were the direct result of drunk drivers.\n \n * Nighttime drivers were four times more likely to die in drunk driving crashes in 2008 than those driving during the daytime.\n * In 2008, weekend drivers were twice as likely to be involved in drinking and driving car crashes than weekday drivers.\n * The 21-24 age group accounted for 34% of all alcohol-impaired-drivers who died in accidents in 2008. The 25-34 demographic accounted for 31%, while those from 35-44 years of age accounted for 25%.\n * Despite being under the legal drinking age, American teens from the ages of 16-20 were more likely to be killed while driving under the influence than adults ages 55-64. Teens accounted for 17% of all drivers who were involved in drunk driving crashes, while those from 55-64 accounted for 12%.\n * Of the drunk driving crashes where seat belt use was known, nearly 75% of all drunk drivers killed in accidents in 2008 weren't wearing seat belts.\n * In the United States, a Blood Alcohol Concentration (BAC) level of .08 or higher is considered above the legal limit in nearly every state. The most frequently recorded BAC level among drivers who were killed in alcohol-impaired-driving accidents in 2008 was .16, or twice the legal limit.\n * Drunk drivers who were over the legal limit when they died in 2008 were eight times more likely to have been previously convicted for drunk driving.\n * In 2008, 6,316 passenger vehicle drivers were over the legal limit when car crashes claimed their lives.\n * In 2008, it was more dangerous to drive drunk on a motorcycle than in any other vehicle. The percentage of bikers with a BAC level of .08 or greater when they died in a crash was higher than the amount of drunk drivers who died while operating other vehicle types.\n \n Damn them legislatorsemoticon_frazzled", 
   {
    "unicode_changes_made": true
   }, 
   407038, 
   null, 
   1279068840.0
  ], 
  [
   407145, 
   null, 
   "Galileo", 
   "I think the gun lobby contributes to the problem- rather than encouraging gun owners to be responsible and to store their firearms safely they inflate people's fears about criminals. As a result, some gun owners feel they always need to have a loaded gun around even if it's endangering their children. \n \n Merely hiding your guns is not enough. Children can find guns that are hidden. I remember staying at my grandfather's house during the summers as a child. After a little exploration, I found the rifle he kept down in the basement and the rifle and ammunition that was in one of the bedrooms on the ground floor. Guns need to be stored under lock and key to prevent children from accessing them. Trigger locks could help too.", 
   {}, 
   407143, 
   null, 
   1279070760.0
  ], 
  [
   407153, 
   null, 
   "NATO 556", 
   "I think the gun lobby contributes to the problem- rather than encouraging gun owners to be responsible and to store their firearms safely\n\n \n \"Safely\" being defined by people like you, of course. Unfortunately for you the Supreme Court ruled that your idea of \"safely storing firearms\" is unconstitutional. Move on.\n \n \nthey inflate people's fears about criminals.\n\n \n Inflate? As in letting people know they live in a dangerous world where the police won't always be available, and 911 is of no assistance when a dangerous individual is already inside your house?\n \n \nAs a result, some gun owners feel they always need to have a loaded gun around\n\n \n That's because they do. Try telling someone in a high-crime area, or along the border to Mexico, that they don't need to have a loaded gun, and see what kind of reactions you get from them.\n \n \neven if it's endangering their children.\n\n \n An ounce of prevention beats a pound of cure. If children are taught to be responsible then you wouldn't need safety locks and safes and all that useless ****.\n \n \nMerely hiding your guns is not enough. Children can find guns that are hidden.\n\n \n Education on safety is the best answer then.\n \n \nI remember staying at my grandfather's house during the summers as a child. After a little exploration, I found the rifle he kept down in the basement and the rifle and ammunition that was in one of the bedrooms on the ground floor.\n\n \n Well obviously you didn't shoot yourself or somebody else.\n \n \nGuns need to be stored under lock and key to prevent children from accessing them.\n\n \n That mandate is unconstitutional. Your support of it qualifies you as an enemy of the state.\n \n \nTrigger locks could help too.\n\n \n Nope, that's pure BS. Trigger locks are 100 percent useless. A trigger lock only works if the gun is already unlocked and unable to fire, it does nothing to enhance security. You could pull the trigger on an empty gun a million times and the only thing that would happen would be the firing pin breaking. There's no point in further disabling an unloaded weapon.\n \n You yourself admitted to being a snoop and looking in places you shouldn't have. What's to stop kids today from doing the same thing? What's to keep them from finding the keys to the locks/safe and using them when they think nobody's around? Do you have an answer for that? Does your answer involve realistic possibilities that don't cost thousands of dollars to implement?", 
   {}, 
   407145, 
   null, 
   1279078560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  We need more guns in American homes. Not.", 
  "url": "http://www.4forums.com/political/gun-control-debates/14437-we-need-more-guns-american-homes-not.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14437, 
  "discussion_files": [
   [
    "20647.html", 
    "http://www.4forums.com/political/gun-control-debates/14437-we-need-more-guns-american-homes-not-print.html"
   ]
  ], 
  "identifier": 14437
 }
]