[
 [
  [
   407234, 
   null, 
   "Freedom", 
   "I take the affirmative.\n -------------------------------------------\n Normally I think one would argue purely about the resolution, but in this case it is intertwined with many other subjects and to avoid creating multiple threads I am going to try to tie them together with this resolution by stating it's premises and the conclusions I draw from it.\n \n I. Premises and Conclusions \n I take this resolution to require the following premises:[*]Ideal means a standard of perfection or excellence, or what is most good.\n \n [*]Good and Evil exist and are given definition by a person&#8217;s standard of value.\n \n [*]Anyone who has values has two things, a axiomatic value (a value that is based on no other values) and personal judgment.\n \n [*]Anyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n \n [*]Anyone who seeks to remove choice and judgments from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgment of another, to take away their power to choose what they value and what they will do.\n \n [*]Man has natural rights proceeding from his nature (see above) that can be stated most abstractly as a right to liberty from unwanted interaction/interference by others.\n \n [*]In the social sphere that which is good (moral) can be objectively defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions.\n \n [*]Anyone who takes the standard of good to be human life and all that entails have no logical alternative but to conclude that the best society is the one that comes closest to the ideal; which is the violation of no rights; which is to say every human social interaction is voluntary.\n I take this resolution to have these further conclusions:\n [*]A volitional society holds the threat of force against only those who have already accepted it (those who used force first, and violated someone&#8217;s rights).\n \n [*]A volitional society holds that nothing can substitute for a person's consent, and that a person's consent is the only key to their life and product.\n \n [*]Therefore the ideal society has no legal forceful removal of wealth, forceful relocation, forceful anything applying to an innocent person (those who have not used force first, and have not violated anyone's rights.)\n \n [*]A volitional society does not have taxes (wealth removed on the authority of the collective not consent)\n \n [*]A volitional society does not have laws that do not relate to universal morality (such laws must be based of premises that are incompatible with the ones that formed a volitional society).\n \n [*]Since a volitional society is one in which no interaction is non-consensual the only moral economic activity is trade and charity, therefore a volitional society has no public entity with any rights save the impossible occasion of complete consensus.\n \n [*]Since there is no public entity all entities with wealth are private and therefore a volitional society is a capitalist society.\n #Note: The term public/private is used in the sense of the original ownership. Clearly someone can make something public by stating it is so. Meaning that the only truly public property is always a gift save for the impossibility of complete consensus.\n \n To those who take the negative, please choose one of the following options:\n [*]Those premises are insufficient to conclude the resolution. (invalid)[*]Those conclusions do not follow from the resolution. (invalid)[*]One (or more) of those premises are wrong -< so the resolution and/or the conclusions are wrong. (unsound)", 
   {
    "post_info": {
     "post_title": "A society based on volition is the ideal one."
    }
   }, 
   null, 
   null, 
   1279179180.0
  ], 
  [
   407493, 
   null, 
   "simone", 
   "[*]Ideal means a standard of perfection or excellence, or what is most good.\n\n Ideal. Schmideal. Word without meaning.\n \n[*]Good and Evil exist and are given definition by a persons standard of value.\n\n According to whom? By what standards? When were these standards established? Where? Why? What was the agenda behind the standards, the ideal?\n \n What is your agenda?\n \n[*]Anyone who has values has two things, a axiomatic value (a value that is based on no other values) and personal judgement.\n\n But ... are these values of value to any other individual?\n \n[*]Anyone who has personal judgement on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n\n Why? And should I place a value judgment on whether or not a person can spell judgment?\n \n[*]Anyone who seeks to remove choice and judgement from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgement of another, to take away their power to choose what they value and what they will do.\n\n What is the value in removing choice and judgment from another? One wishes to use force? One places great value on using force?\n \n[*]Man has natural rights proceeding from his nature (see above) that can be stated most abstractly as a right to liberty from unwanted interaction/interference by others.\n\n \"Natural\" rights extend as far as the end of an individual's nose.\n \n[*]In the social sphere that which is good (moral) can be objectivly defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions.\n\n Societal agreement?\n \n Unfortunately, an opportunist demagogue named Adolph Hitler engendered a great deal of universally conceived morality consistent with the \"historical\" observations and emotional outbursts of a particular religion.\n \n[*]Anyone who takes the standard of good to be human life and all that entails have no logical alternative but to conclude that the best society is the one that comes closest to the ideal; which is the violation of no rights; which is to say every human social interaction is voluntary....\n\n The question is, if humans are not held in check, will the earth survivie?", 
   {}, 
   407234, 
   null, 
   1279400880.0
  ], 
  [
   407499, 
   null, 
   "Symbiote", 
   "Ideal. Schmideal. Word without meaning.\n\n \n Yeah when someone defines a word for you, precisely, it's logical to complain that it has no meaning. That makes you look intelligent.\n \n As you've defined the debate, the ethics and argument for them you've proposed are virtually indistinguishable from Hoppe's argumentation ethics, themselves derivative mostly from Habermas. I have not heard a coherent argument against them. I don't know whether you're employing his argument here, or you have come across some parallel in libertarian philosophy that some other author has put together, Kinsella has something similar, I don't know who else.", 
   {}, 
   407493, 
   null, 
   1279402440.0
  ], 
  [
   407501, 
   null, 
   "simone", 
   "Oh dear!\n \n Article 48 and the Hindenburg proclamation!", 
   {}, 
   407499, 
   null, 
   1279403040.0
  ], 
  [
   407502, 
   null, 
   "simone", 
   "And, what about proportionate representation?\n \n Perhaps the two-party system, with all its flaws, is not so bad after all.", 
   {}, 
   407501, 
   null, 
   1279403340.0
  ], 
  [
   407526, 
   null, 
   "Freedom", 
   "Ideal. Schmideal. Word without meaning.\n\n So you do not have the concept of perfection?\n \n \nAccording to whom? By what standards? When were these standards established? Where? \n\n It seems the premise itself answers your questions.\n \n \nWhat is your agenda?\n\n It's my name. I believe that question was an off subject.\n \n \nBut ... are these values of value to any other individual?\n\n It is possible. I believe that question was an off subject.\n \n \nWhy?\n\n because others are the same form of being.\n In other words the logical root of the golden rule.\n \n \n And should I place a value judgment on whether or not a person can spell judgment?\n\n Thank you for pointing that out, the error has been fixed.\n \n \nWhat is the value in removing choice and judgment from another?\n\n I see none, criminals disagree with me.\n \nOne wishes to use force? One places great value on using force?\n\n Do their motivations matter?\n \n \n\"Natural\" rights extend as far as the end of an individual's nose.\n \n Societal agreement?\n \n Unfortunately, an opportunist demagogue named Adolph Hitler engendered a great deal of universally conceived morality consistent with the \"historical\" observations and emotional outbursts of a particular religion.\n \n The question is, if humans are not held in check, will the earth survivie?\n \n\n Please remove these from your post and I will do the same to this response per the Formal Debate rules.\n \n Please refrain from doing this again, you mixed some valid statements with these so I did respond but from now on I will simply report it.\n \n Oh, and should I place a judgment value on whether or not a person can spell survivie?", 
   {}, 
   407502, 
   null, 
   1279425060.0
  ], 
  [
   407595, 
   null, 
   "simone", 
   "Freedom?\n \n From responsibility?\n \n From accountability?\n \n Freedom from not having to pay your fair share for the services you receive?\n \n Is that what freedom means?", 
   {}, 
   407526, 
   null, 
   1279477680.0
  ], 
  [
   407674, 
   null, 
   "mata", 
   "I think they're speaking about the freedom to be a modern day Libertaryan?\n \n Which apparently is all about defending (rather than understanding or attempting to offer solutions) to the contradictions of the 'free?' market ideology. In other words, the freedom to be disconnected to reality.\n \n Oh & it also seems to be about the freedom to be an apologist for the 'invisible hand.'\n \n Oh & it also seems to be about offering baffling word salad 'band aids' & fantasizing about how? they will heal real wounds.\n \n Oh & it also seems to be about offering no solutions. (most vexing)\n \n & apparently they believe in time-travel.", 
   {}, 
   407595, 
   null, 
   1279545600.0
  ], 
  [
   407831, 
   null, 
   "simone", 
   "Freedom?\n \n From responsibility?\n \n From accountability?\n \n Freedom from not having to pay your fair share for the services you receive?\n \n Is that what freedom means?\n\n I merely wish to indicate that the concept of freedom is not easy to define. It cannot be reduced to simplistic terms.", 
   {}, 
   407595, 
   null, 
   1279666080.0
  ], 
  [
   407901, 
   null, 
   "Freedom", 
   "I merely wish to indicate that the concept of freedom is not easy to define. It cannot be reduced to simplistic terms.\n \n When I say freedom I mean especially the bolded definitions. Most precise is the philosophical definition #17. \n \n 1. the state of being free or at liberty rather than in confinement or under physical restraint: He won his freedom after a retrial. \n 2. exemption from external control, interference, regulation, etc.  \n 3. the power to determine action without restraint. \n 4. political or national independence. \n 5. personal liberty, as opposed to bondage or slavery: a slave who bought his freedom.  \n 6. exemption from the presence of anything specified (usually fol. by from ): freedom from fear. (unjust interference by other humans) \n 7. the absence of or release from ties, obligations, etc.  \n 8. ease or facility of movement or action: to enjoy the freedom of living in the country. \n 9. frankness of manner or speech. \n 10. general exemption or immunity: freedom from taxation.  \n 11. the absence of ceremony or reserve. \n 12. a liberty taken.  (all natural liberties) \n 13. a particular immunity or privilege enjoyed, as by a city or corporation: freedom to levy taxes. \n 14. civil liberty, as opposed to subjection to an arbitrary or despotic government. \n 15. the right to enjoy all the privileges or special rights of citizenship, membership, etc., in a community or the like. \n 16. the right to frequent, enjoy, or use at will: to have the freedom of a friend's library. \n 17. Philosophy . the power to exercise choice and make decisions without constraint from within or without; autonomy; self-determination. Compare necessity ( def. 7 ) .  \n \n Now my own definition. \n \n Freedom is equivalent to a state of universal absolute liberty, liberty that is defined as the lack of unwanted interference from other people. The 'terms' of the 'equation' of freedom are rights. \n \n Rights (proper ones at least) never specify a benefit only choices protected from other's force. \n \n i.e. A man does not have a right to a home, he has a right to build a home without interference from others. \n \n Rights can be determined simply using the following thought experiment. \n \n A man is alone on earth. \n \n The following premises apply: \n - If rights are natural and not the verdict of society then no society can be required for them to exist, so he must have all rights that a human can have. \n \n - If rights are natural then nature can never violate them. \n \n The only thing in this world that is absolutely inviolate is his inability to be coerced or coerce, to be killed or harmed by another human or to harm or kill a human. \n \n He does not have a right to life, to education, to free movement. \n \n Those are revealed to be short hand for the actual rights (which look more like: He has a right to try to live, he has the right to learn, he has the right to move himself.) \n \n It is only by realizing the actual nature of rights can you see that rights can never conflict and so any appeal made by collectivist about the necessity of society sacrificing some rights to preserve the greater amount is a noble name pasted onto the bane of rational existence.\n \n Now please, before you answer consider that this is a formal debate, that it would be proper for you to respond to the resolution instead of trying to psycho - analyze me. Make an argument, I asked that anyone taking the negative choose an option.", 
   {}, 
   407831, 
   null, 
   1279688940.0
  ], 
  [
   407910, 
   null, 
   "mata", 
   "Now please, before you answer consider that this is a formal debate, that it would be proper for you to respond to the resolution instead of trying to psycho - analyze me. Make an argument, I asked that anyone taking the negative choose an option.\n\n \n I'd like to take this opportunity to exercise my freedom to be improper, inappropriate, whatever.\n \n The 'True Believer' brand of Libertaryanism creates false dichotomy after false dichotomy ad nauseum, ad infinity. That is, to compare (& then prop up) implausible, unrealistic, idealized (however obviously advantageous) ideological choices to ANY opposing idea because said idea is not perfect. This is an example of the Nirvana Fallacy:\n \n \nThe choice is not between real world solutions and utopia; it is, rather, a choice between one realistic possibility and another which is merely better.\n Nirvana fallacy - Wikipedia, the free encyclopedia\n\n \n In the real world, there are very often no perfect solutions to a problem, especially when the problems to be solved are complicated, multilayered & very often interrelated. \n \n Positing nirvanic or utopian alternatives (with the awareness they have a snowball's chance in hell at coming to fruition) is what I very often refer to as mental masturbation. Mental masturbation as defined by the Urban Dictionary: \n \n \n\n [*]Intellectual activity that serves no practical purpose.[*]Intellectual activity that serves no practical purpose. Excessively theoretical, and therefore a distraction from more practicable matters.[*]Dr. Richard Dawkins, noted biological theorist, in response to a student's philosophical question about skeptical attitudes towards science and reality, cited the following anecdote: \n <paraphrasing< James Boswell asked, \"... nothing really exists unless there's somebody there to see it. How do you refute that?\" Samuel Johnson replied, \"I refute it thus!\", and kicked a stone out of his way. \n \n <\\paraphrasing< Dr. Dawkins, commenting on Boswell's question, and critiquing the attitude: \"If you want to mess about with that sort of mental masturbation, thats fine, but, ... but the science of reality is what gets you through the day, ... and makes things work!\"\n\n I'm usually not overly impressed with Dr. Dawkins & the first time I heard this expression was in a Woody Allen movie (I think) where the meaning differed because of the context in which it was used. Whatever.\n \n The biggest problem I can identify with the mental masturbatory nature of this way of thinking (this positing of nirvanic or utopian alternatives) is that it prevents anything from getting done! It serves no practical purpose, it produces no fruit. \n \n Which is one of the reasons why I believe it remains fruitless to debate a Libertaryan.\n \n Another one is this. The need for immediate gratification very often becomes a blind spot for viewing reality. It is not likely there is any ONE magical & IMMEDIATE solution to problems that have been growing for years & years. Wishful thinking maybe but really? \n \n These two reasons are perhaps interrelated? That is, the need for immediate gratification prompts one to seek to gratify this need by using mental masturbatory techniques.\n \n It may satisfy the need (to be right & to have control) immediately! But does it solve the problem? Does it serve any practical purpose? Actually, I think a case might be made that it perpetuates the problems by preventing any kindof action (however imperfect) from being taken, thus leading to stagnation. \n \n Where are the choices between one plausible possibility & another? \n \n Anyway I won't be back - my two cents - call me improper, inappropriate, whatever.\n \n Carry on!", 
   {
    "post_info": {
     "post_title": "Why I believe it remains fruitless to debate a Libertaryan"
    }, 
    "unicode_changes_made": true
   }, 
   407901, 
   null, 
   1279714980.0
  ], 
  [
   407918, 
   null, 
   "pappillion001", 
   "[QUOTE=Freedom;407234]I take the affirmative.\n -------------------------------------------\n Normally I think one would argue purely about the resolution, but in this case it is intertwined with many other subjects and to avoid creating multiple threads I am going to try to tie them together with this resolution by stating it's premises and the conclusions I draw from it.\n \n \nI. Premises and Conclusions \n I take this resolution to require the following premises:[*]Ideal means a standard of perfection or excellence, or what is most good.\n\n \n What is good for one is not going to be what is good for all. What is most good for most will not be most good for all. \n \n If a homeless family decides to ake shelter in your house. It is most good for them to have shelter when they might die from the elements, it is most good that they not starve or become sick from malnutrition. Is your excessive comfort better than their suffering or potential death?\n \n \n[*]Good and Evil exist and are given definition by a person&#8217;s standard of value.\n\n \n How does the collective agree to a standard with which to determine what is morally permissible and what is not if the choice remains the individuals. Your neighbor might like to line his fence with bird heads and hang dead squirrels from his trees because he finds art in death.\n \n \n \n[*]Anyone who has values has two things, a axiomatic value (a value that is based on no other values) and personal judgment.\n\n \n Abortion, minors, mentally incompetent and handicapped. Those who are incapable or lack the wisdom and experience to have sound personal judgment\n \n \n[*]Anyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n\n \n And when those judgments conflict how are they to be resolved when there is no clear evidence of one being superior to the other?\n \n PETA saying it is cruel to test products on animals vs. Corporations claiming the need to insure wanted products are safe for human use.\n \n or\n \n Abortion in cases of rape or incest as two examples\n \n \n[*]Anyone who seeks to remove choice and judgments from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgment of another, to take away their power to choose what they value and what they will do.\n\n \n Your neighbors decide they want a freeway and an airport to be built on their land one one each side of the house you just purchased. The value just plummeted you can't sell even to lose money. How do you resolve this. They will buy your property for 1/5 of what you paid and don't want a partner.\n \n \n[*]Man has natural rights proceeding from his nature (see above) that can be stated most abstractly as a right to liberty from unwanted interaction/interference by others.\n\n \n His nature is not so simple as to warrant just one right nor is his nature tend to his or others self interest. We currently build an and maintain an infrastructure in the event of emergencies that many feel is an unwanted interaction/interference by others until a fire or earthquake or other disaster strikes. In the case of fire do firefighters wait to respond until someone who was willing to pay for them to do nothing but be prepared in the event of fire has a need. How would they know who to respond to if a power failure knocks out a verification system?\n \n \n[*]In the social sphere that which is good (moral) can be objectively defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions.\n\n \n And when universal agreement can not be reached? \n \n \n[*]Anyone who takes the standard of good to be human life and all that entails have no logical alternative but to conclude that the best society is the one that comes closest to the ideal; which is the violation of no rights; which is to say every human social interaction is voluntary.\n\n \n It would be nice, but I can say so would a world where I could fly and teleport to wherever I wanted in the blink of an eye and everybody was good looking and we all agreed on everything which has about as much chance of happening as Freetopiaville\n \n I take this resolution to have these further conclusions:\n \n \n[*]A volitional society holds the threat of force against only those who have already accepted it (those who used force first, and violated someone&#8217;s rights).\n\n \n Then you permit yourself to respond to immoral acts by committing them yourself. The fatal flaw, retribution by related parties causes a breakdown of justice which no society can survive without. \n \n At what point is it sufficient to respond immorally and to what degree is that response permitted. Can I shoot someone for stealing my car, not dead just wound.\n \n \n[*]A volitional society holds that nothing can substitute for a person's consent, and that a person's consent is the only key to their life and product.\n\n \n Criminals most likely will not consent to anything that may interfere with their way of life. Bartenders couldn't say you have had to much to drink. Parents couldn't say go to school.\n \n \n[*]Therefore the ideal society has no legal forceful removal of wealth, forceful relocation, forceful anything applying to an innocent person (those who have not used force first, and have not violated anyone's rights.)\n\n \n To bad it is necessary to infringe on rights in order to determine guilt or it pays to be a good crook. \n \n \n[*]A volitional society does not have taxes (wealth removed on the authority of the collective not consent)\n\n \n It good that it will live in caves or houses that fall down when the wind blows since if it looked like we do know some other country would invade since we have no military to defend us and doubt we could build on sufficiently once the need was known and agreed to.\n \n \n[*]A volitional society does not have laws that do not relate to universal morality (such laws must be based of premises that are incompatible with the ones that formed a volitional society).\n\n \n Good luck with a consensus on that universal morality, which even if somehow achieved would be meaningless lacking true justice and equal protection.\n \n \n[*]Since a volitional society is one in which no interaction is non-consensual the only moral economic activity is trade and charity, therefore a volitional society has no public entity with any rights save the impossible occasion of complete consensus.\n\n \n I see back to Nobility and peasants it is \n \n \n[*]Since there is no public entity all entities with wealth are private and therefore a volitional society is a capitalist society.\n\n \n Some facist pacifist hybrid always at odds with itself\n \n \nTo those who take the negative, please choose one of the following options:\n [*]Those premises are insufficient to conclude the resolution. (invalid)[*]Those conclusions do not follow from the resolution. (invalid)[*]One (or more) of those premises are wrong -< so the resolution and/or the conclusions are wrong. (unsound)\n\n \n A & C", 
   {}, 
   407234, 
   null, 
   1279732860.0
  ], 
  [
   408023, 
   null, 
   "Freedom", 
   "What is good for one is not going to be what is good for all. What is most good for most will not be most good for all.\n \n You confused the concept of good with that of values. Each person will have different values based on their judgment, and their values will be 'good' to them.\n \n I would not refer to this subjective good except to use as a subjective premise (i.e. the ideal for Joe or Jane)\n \n For something to be good period it must be objectively good meaning not changing with the subject.\n \n That means the only true good period is that which is based on values common to everyone.\n \nIf a homeless family decides to ake shelter in your house. It is most good for them to have shelter when they might die from the elements, it is most good that they not starve or become sick from malnutrition. Is your excessive comfort better than their suffering or potential death?\n\n Since you asked me I will answer, however; my answer is based on my values not universal values.\n \n I would value those not starving or becoming sick over excessive comfort.\n \n You responded to the first premise but you did not seem to make an argument against it.\n \n \nHow does the collective agree to a standard with which to determine what is morally permissible and what is not if the choice remains the individuals.\n\n You have asked this question many times in different forms, I wonder if you will ever tire of being told that it is not society or the individual who decides without reason what is morally permissible.\n \n A person who has any values has already accepted morality, it is inescapable.\n \n You responded to the second premise but you did not seem to make an argument against it.\n \nAbortion, minors, mentally incompetent and handicapped. Those who are incapable or lack the wisdom and experience to have sound personal judgment\n\n You responded to the third premise but you did not seem to make an argument against it.\n \n \nAnd when those judgments conflict how are they to be resolved when there is no clear evidence of one being superior to the other?\n\n They are not resolved. I am not being sarcastic.\n \n If you cannot convince someone and you may not force them there is no alternative.\n \n The further premise which is often implied here is that the conflict must be resolved. A situation such as that is only possible as a result of rights violation.\n \n \nPETA saying it is cruel to test products on animals vs. Corporations claiming the need to insure wanted products are safe for human use.\n\n If PETA cannot convince Corporations to stop and it cannot be demonstrated that it is immoral there is no alternative for PETA.\n \n \nAbortion in cases of rape or incest as two examples \n\n I do not understand how this is an example.\n You responded to the fourth premise but you did not seem to make an argument against it.\n \n \nYour neighbors decide they want a freeway and an airport to be built on their land one one each side of the house you just purchased. The value just plummeted you can't sell even to lose money. How do you resolve this. They will buy your property for 1/5 of what you paid and don't want a partner.\n\n I move. (if I can't) I live with it.\n \n You responded to the fifth premise but you did not seem to make an argument against it.\n \nHis nature is not so simple as to warrant just one right\n\n We may give specific names to the specific consequences but this is the root.\n \nWe currently build an and maintain an infrastructure in the event of emergencies that many feel is an unwanted interaction/interference by others until a fire or earthquake or other disaster strikes. In the case of fire do firefighters wait to respond until someone who was willing to pay for them to do nothing but be prepared in the event of fire has a need. How would they know who to respond to if a power failure knocks out a verification system?\n\n I do not understand the question.\n \n You responded to the sixth premise but you did not seem to make an argument against it.\n \nAnd when universal agreement can not be reached? \n\n Universal agreement was not a term in the premise.\n \n You responded to the seventh premise but you did not seem to make an argument against it.\n \n \nIt would be nice, but I can say so would a world where I could fly and teleport to wherever I wanted in the blink of an eye and everybody was good looking and we all agreed on everything which has about as much chance of happening as Freetopiaville\n\n I do not hold your despair or ignorance as excuse for any immorality you may perpetrate under your delusion that what explicitly defined to be human choice is beyond control.\n \n You responded to the 8th premise but you did not seem to make an argument against it.\n \n \nThen you permit yourself to respond to immoral acts by committing them yourself.\n\n Why?\n \n \nAt what point is it sufficient to respond immorally and to what degree is that response permitted.\n\n No point\n \n You responded to the first conclusion but you did not seem to make an argument against it. (save if that is supposed to be an appeal to absurd conclusions?)\n \n \nCriminals most likely will not consent to anything that may interfere with their way of life. Bartenders couldn't say you have had to much to drink. Parents couldn't say go to school.\n\n I believe that was an appeal to absurd conclusions. I don't believe any save the last are even close to being valid.\n \n The last is not valid because such a command could be a condition on which care is given.\n \n \nTo bad it is necessary to infringe on rights in order to determine guilt or it pays to be a good crook. \n\n Please make an argument for that conclusion.\n \n \nIt good that it will live in caves or houses that fall down when the wind blows since if it looked like we do know some other country would invade since we have no military to defend us and doubt we could build on sufficiently once the need was known and agreed to.\n\n This is an Appeal to Consequences of a Belief fallacy, and not even one I will accept without proof.\n \n \nGood luck with a consensus on that universal morality\n\n Or near consensus, thank you.\n \nwhich even if somehow achieved would be meaningless lacking true justice and equal protection.\n\n Ah yes lacking the true 'peoples' justice, not the court of facts but of the proletariat.\n \n You responded to the fifth conclusion but you did not seem to make an argument against it. \n \n \nI see back to Nobility and peasants it is \n\n You responded to the sixth conclusion but you did not seem to make an argument against it. (save if that is supposed to be an appeal to negative consequences?)\n \n \nSome facist pacifist hybrid always at odds with itself\n\n You responded to the seventh conclusion but you did not seem to make an argument against it.\n \n \nA & C\n\n Both, well obviously since I wrote it I do not see how. The intention was for you to choose an option and explain why.\n \n Looking at all your responses it suddenly become very apparent why we weren't getting anywhere in the last thread.", 
   {}, 
   407918, 
   null, 
   1279773840.0
  ], 
  [
   408110, 
   null, 
   "pappillion001", 
   "\n\n \n \n \n What did you expect I can argue, but never claimed I could debate. There was a reason I didn't come over to formal debate but I will give it another try and see if I a can at least accommodate your request to present something close to rational reasons that you can respond to.", 
   {}, 
   408023, 
   null, 
   1279839240.0
  ], 
  [
   408112, 
   null, 
   "Freedom", 
   "What did you expect I can argue, but never claimed I could debate. There was a reason I didn't come over to formal debate but I will give it another try and see if I a can at least accommodate your request to present something close to rational reasons that you can respond to.\n\n Thank you. I would like to point out that debate is a synonym for argue.", 
   {}, 
   408110, 
   null, 
   1279840680.0
  ], 
  [
   408115, 
   null, 
   "pappillion001", 
   "\n \n I. Premises and Conclusions \n I take this resolution to require the following premises:[*]Ideal means a standard of perfection or excellence, or what is most good.\n\n \n ok\n \n \n[*]Good and Evil exist and are given definition by a person&#8217;s standard of value.\n\n \n ok\n \n \n[*]Anyone who has values has two things, a axiomatic value (a value that is based on no other values) and personal judgment.\n\n \n ok\n \n \n[*]Anyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n\n \n ok\n \n \n[*]Anyone who seeks to remove choice and judgments from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgment of another, to take away their power to choose what they value and what they will do.\n\n \n ok\n \n \n[*]Man has natural rights proceeding from his nature (see above) that can be stated most abstractly as a right to liberty from unwanted interaction/interference by others.\n\n \n The following is applicable to all the above statements as well.\n \n \n Let&#8217;s agree that man has natural rights proceeding from his nature. Your choosing a secondary aspect that in your society would not exist. Your foundation becomes irrelevant with the existance of your society.\n \n You don't seem to have considered the desire for liberty stems from the dominant aspect of man&#8217;s nature which is survival. If forced to choose man will, willingly or unwillingly, accept slavery, confinement or any number of violations to his person more times than not rather than death. This protection of self interest will interfere with his ability to act in his own best interest, to reach logical conclusions, to acknowledge and/or respect the decisions and value judgments of others. \n \n \n \n[*]In the social sphere that which is good (moral) can be objectively defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions.\n\n \n Below you acknowledge the impossible occurrence of consensus which if lacking the collective can have no objective morality to adopt from the individual as each individual will have a value judgment that stems from self interest. \n \n Your statements prohibit the collective from producing a universal morality. An individual must acknowledge the value judgment of another, his nature grants him liberty from unwanted interference or interaction and his power to choose may not be taken from him.\n \n There can be no stability or order. What man chooses today he cannot be compelled to choose the same tomorrow. His choice is his right, he has not used force on anyone by making another choice which leaves every aspect of society in limbo living moment by moment.\n \n \n \n[*]Anyone who takes the standard of good to be human life and all that entails have no logical alternative but to conclude that the best society is the one that comes closest to the ideal; which is the violation of no rights; which is to say every human social interaction is voluntary.\n\n \n That is an option question anyone who does and what of anyone who doesn't?\n \n \n[LIST=1][*]A volitional society holds the threat of force against only those who have already accepted it (those who used force first, and violated someone&#8217;s rights).\n \n\n \n You will always have this problem with justice and law. You can not have a justice system that can effectively promote law without the infringement on a persons rights sometimes. Police can't enter your house without consent OR a search warrant based on probable cause. Your society does not allow for probable cause something is either proven or it is not. A suspect unwilling to give consent leaves police without the ability to investigate a crime further.\n \n Police want to dig up a backyard thinking there may be bodies buried there they cannot prove it so in your society they cannot look without consent from the owner.\n \n \n \n[*]A volitional society holds that nothing can substitute for a person's consent, and that a person's consent is the only key to their life and product.\n\n \n see above\n \n \n[*]Therefore the ideal society has no legal forceful removal of wealth, forceful relocation, forceful anything applying to an innocent person (those who have not used force first, and have not violated anyone's rights.)\n\n \n see above\n \n \n[*]A volitional society does not have taxes (wealth removed on the authority of the collective not consent)\n \n\n \n ok\n \n \n[*]A volitional society does not have laws that do not relate to universal morality (such laws must be based of premises that are incompatible with the ones that formed a volitional society).\n\n \n impossible occurrence of consent is necessary and not binding as freedom to choose differently must be respected. \n \n \nTo those who take the negative, please choose one of the following options:\n [*]Those premises are insufficient to conclude the resolution. (invalid)[*]Those conclusions do not follow from the resolution. (invalid)[*]One (or more) of those premises are wrong -< so the resolution and/or the conclusions are wrong. (unsound)\n\n \n The premise is not consistent with human nature and the world as it is. On paper it sounds great, but without a universal change in man it is not possible.", 
   {}, 
   407234, 
   null, 
   1279841460.0
  ], 
  [
   408116, 
   null, 
   "pappillion001", 
   "Thank you. I would like to point out that debate is a synonym for argue.\n\n \n A Toyota and a Ferrari are both cars. That they are both cars doesn't make them the same though", 
   {}, 
   408112, 
   null, 
   1279841820.0
  ], 
  [
   408118, 
   null, 
   "Freedom", 
   "Let's agree that man has natural rights proceeding from his nature. Your choosing a secondary aspect that in your society would not exist. Your foundation becomes irrelevant with the existance of your society.\n\n I do not understand. Are you saying that for some reason a volitional society reverses the premises it is based on?\n \n \nYou don't seem to have considered the desire for liberty stems from the dominant aspect of man's nature which is survival. If forced to choose man will, willingly or unwillingly, accept slavery, confinement or any number of violations to his person more times than not rather than death. This protection of self interest will interfere with his ability to act in his own best interest, to reach logical conclusions, to acknowledge and/or respect the decisions and value judgments of others. \n\n Regard for one's own interest or advantage, esp. with disregard for others.\n \n Is the definition of self-interest, (even if it doesn't follow from the phrase).\n \n What in any of my premises uses this term?\n \n \nBelow you acknowledge the impossible occurrence of consensus which if lacking the collective can have no objective morality to adopt from the individual \n\n That was not one of my premises implied or otherwise.\n \n \neach individual will have a value judgment that stems from self interest. \n\n Please support this.\n \n \nYour statements prohibit the collective from producing a universal morality.\n\n Please support this.\n \n \nAn individual must acknowledge the value judgment of another (to remain consistent), his nature grants him liberty from unwanted interference or interaction and his power to choose may not be taken from him.\n\n That is one of my premises.\n \n \nWhat man chooses today he cannot be compelled to choose the same tomorrow.\n\n My premises imply that what any individual chooses is irrelevant to existence and shape of morality. (I did not call it objective as a joke)\n \n There is no choice that someone can make to avoid the dictates of morality. He/she must make no choices.\n \n It is not necessary to compel anyone to choose anything, merely to prevent it from happening.\n \n \nThat is an option question anyone who does and what of anyone who doesn't?\n\n They don't exist so far as I know.\n \n It is only the value of life that makes all other values possible.\n \n Even the most vicious raider must value his life to value his wealth.\n \n Even apparently selfless values are in root based on the individual's life.\n \n To say you value all the poor but not yourself is certainly a value you can have, but you cannot escape the fact that you must value your judgment or else the said value would have no value.\n \n \nYou will always have this problem with justice and law. You can not have a justice system that can effectively promote law without the infringement on a persons rights sometimes. Police can't enter your house without consent OR a search warrant based on probable cause. Your society does not allow for probable cause something is either proven or it is not. A suspect unwilling to give consent leaves police without the ability to investigate a crime further.\n\n We have been over this.\n \n You make that conclusion on the premise that it is known that the target is innocent.\n \n That is still an appeal to consequence of belief which is still a fallacy.\n \n From your statements about volition and rights it seems you are basically saying \"I don't know why exactly it isn't true, but it must be look at the crazy things it would mean.\"\n \n \nimpossible occurrence of consent is necessary.\n\n What exactly is a complete consensus necessary for?\n \n \nThe premise is not consistent with human nature and the world as it is. On paper it sounds great, but without a universal change in man it is not possible.\n\n I believe it is, and it would not require universal change I am ready now for this society to exist. I would change my behavior but not my beliefs.\n \n \nA Toyota and a Ferrari are both cars. That they are both cars doesn't make them the same though\n\n They both belong to the same category, that does not mean they are synonyms.", 
   {
    "unicode_changes_made": true
   }, 
   408116, 
   null, 
   1279844100.0
  ], 
  [
   408495, 
   null, 
   "pappillion001", 
   "Regard for one's own interest or advantage, esp. with disregard for others.\n \n Is the definition of self-interest, (even if it doesn't follow from the phrase).\n \n What in any of my premises uses this term?\n\n \n That is the point, you don't. You expect that all decisions will be rational and logical. No time in history has man ever done so consistently\n \n \n \nThat was not one of my premises implied or otherwise.\n\n \n It isn't one of mine either, I just used something you acknowledge exists so we don't have to argue over it. I applied the meaning you gave it to another scenario. \n \n You didn't respond to the scenario.\n \n \nPlease support this.\n\n \n Do you have the same values as me?\n \n Does everybody have the same values?\n \n # In the social sphere that which is good (moral) can be objectively defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions. \n\n \n How can something be defined objectively by something subjective as rights? Consensus is necessary by the collective unless all individuals have the same ideas which historically and generally has never happened in large group.\n \n \nMy premises imply that what any individual chooses is irrelevant to existence and shape of morality. (I did not call it objective as a joke)\n\n \n The choice to accept or disregard morality will always exist.\n \n \nThere is no choice that someone can make to avoid the dictates of morality. He/she must make no choices.\n\n \n That would interfere with their liberty would it not?\n \n \nIt is not necessary to compel anyone to choose anything, merely to prevent it from happening.\n\n \n That would be interfering with their liberty also. \n \n \nAnyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n\n \n Man is not always logical by your definition of logical. Circumstance will influence the logic of two individuals. The same is true concerning whether he will accept and/or respect the what others choose.\n \n \nAnyone who seeks to remove choice and judgments from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgment of another, to take away their power to choose what they value and what they will do.\n\n \n Coercion, by agreement by unrelated parties, by choice.\n \n How does this not conflict with the statements you make above?\n \n \n \nIt is only the value of life that makes all other values possible.\n \n Even the most vicious raider must value his life to value his wealth.\n \n Even apparently selfless values are in root based on the individual's life.\n\n \n So why is your morality based on liberty and not survival?\n \n Objective morality regardless of what is used as a premise will always exist within a human construction, because if man did not exist neither would morality. 2 rocks next to 2 different rocks will be 4 rocks before man existed and after he is extinct. Add 2 humans and then 2 more you have 4 humans and morality. Kill the humans and you have 4 rocks\n \n \nTo say you value all the poor but not yourself is certainly a value you can have, but you cannot escape the fact that you must value your judgment or else the said value would have no value.\n\n \n So it has little or no value. \n \n \nWe have been over this.\n \n You make that conclusion on the premise that it is known that the target is innocent.\n \n\n \n Be a waste of time to go after someone who is known to be innocent don't you think? \n \n I say he might be and as long as he might be your ability to have law and order is in serious trouble. \n \n Under your society it will be far more difficult to offer citizens protection. Unless you can figure out a way to have criminals volunteer cooperation you can't make them appear in court to determine guilt. You can't proceed with a trial without them because that would interfere with their freedom and if they are not there to defend themselves how can you find them guilty beyond reasonable doubt? Do you have a legal system that can protect and punish under your premise?\n \n \nThat is still an appeal to consequence of belief which is still a fallacy.\n\n \n You did not understand the answer obvious by your response. \n \n \nFrom your statements about volition and rights it seems you are basically saying \"I don't know why exactly it isn't true, but it must be look at the crazy things it would mean.\"\n\n \n Then respond to the statements I made that explain why it is flawed. \n I could counter with from your statements your basically saying \"Once everybody understands that I am right, then the problems will no longer be a consideration, I mean I don't consider them in my premise and look how good it sounds\"\n \n Again, it sounds great, but it doesn't take into consideration problems that prevent it from actually working. Get over those and you might have something\n \n \nWhat exactly is a complete consensus necessary for?\n\n \n Agreement among the masses prevents chaos, instability and anarchy and conflict becomes manageable.\n \n \nThey both belong to the same category, that does not mean they are synonyms.\n\n \n If there wasn't a difference between the two regardless of how small or immaterial one of them would not exist. Words create a distinction between concepts. When the word argue is used a meaning different than debate is conveyed even though both can be reduced to describe the same act loosely defined.\n \n Would you like to argue or debate?", 
   {
    "unicode_changes_made": true
   }, 
   408118, 
   null, 
   1280105580.0
  ], 
  [
   408511, 
   null, 
   "Freedom", 
   "That is the point, you don't. You expect that all decisions will be rational and logical. No time in history has man ever done so consistently\n\n I do not expect that.\n \n \n \nIt isn't one of mine either, I just used something you acknowledge exists so we don't have to argue over it. I applied the meaning you gave it to another scenario. \n \n You didn't respond to the scenario.\n\n I read what you wrote again and I still have no idea what you are talking about. What scenario have I not responded to?\n \n \n \nDo you have the same values as me?\n \n Does everybody have the same values?\n\n No\n \nHow can something be defined objectively by something subjective as rights?\n \n Rights are not subjective.\n \nConsensus is necessary by the collective unless all individuals have the same ideas which historically and generally has never happened in large group.\n\n Necessary for what?\n \n \n \nThe choice to accept or disregard morality will always exist.\n\n That choice will always exist, however; it is not identical to the choice to create or void reality or morality which does not itself exist.\n \n There will always be a choice between believing the earth is 6000 years old and believing it is 6 billion.\n \n \n \nThat would interfere with their liberty would it not?\n\n ~choices != violation of choice.\n \n \nThat would be interfering with their liberty also. \n\n How would the lack of compulsion equal compulsion\n \n \n \nMan is not always logical by your definition of logical.\n\n I know. My definition of logical is: reasoning in accordance with the principles of logic, as a person or the mind: logical thinking. \n \n \nCircumstance will influence the logic of two individuals.\n\n If a 'circumstance' is the same for both then it is a fact and it should influence their logic. If it is an emotional distortion then it is interfering with their logic not altering it.\n \n If a debater knocks his opponent out in a fit of rage he did not 'upgrade' his logic he abandoned it.\n \n \nThe same is true concerning whether he will accept and/or respect the what others choose.\n\n There is only one logical option concerning what choices to respect in others. Respect everything they choose as their choice except the choice to fail to respect others.\n \n\n Coercion, by agreement by unrelated parties, by choice.\n \n How does this not conflict with the statements you make above?\n\n I do not understand. What is this and how does it?\n \n \n \n \n \nSo why is your morality based on liberty and not survival?\n\n At the most basic level they are the same thing.\n \n The difference between objectivism and pragmatism is that the former integrates the concept of principles. Meaning that it states that since liberty is necessary for life it is always a contradiction to claim it is more practical to disregard it.\n \n It is necessary for life; consider trying to live without making and decisions. Now do not be confused by the easily made fallacy of saying \"well what if another person decides\" well that is just substituting one person's liberty for another.\n \n The question that is posed then is by what right some substitute their judgment for others.\n \n \nObjective morality regardless of what is used as a premise will always exist within a human construction, because if man did not exist neither would morality. 2 rocks next to 2 different rocks will be 4 rocks before man existed and after he is extinct. Add 2 humans and then 2 more you have 4 humans and morality. Kill the humans and you have 4 rocks\nI initially agreed but you modified the premises.\n Morality is a consequence of human existence, just as gravity would be 'real' without mass but meaningless.\n \n So I would say it would not exist without humans because it would be null.\n However then you use the example of mathematics which is also null without a mind capable of comprehending it.\n \n\n So it has little or no value. \n\n What is little or no value?\n \n \n \nBe a waste of time to go after someone who is known to be innocent don't you think? \n\n Indeed it would. Which means to the person who is pursuing the case he should never consider the person innocent which is how this so called dilemma is solved.\n \n \n \nI say he might be and as long as he might be your ability to have law and order is in serious trouble. \n\n No it is not, I have never said you cannot risk violating a right I said you cannot violate a right.\n \n There is a difference and I have pointed it out to you via analogy.\n \nUnder your society it will be far more difficult to offer citizens protection. Unless you can figure out a way to have criminals volunteer cooperation you can't make them appear in court to determine guilt. You can't proceed with a trial without them because that would interfere with their freedom and if they are not there to defend themselves how can you find them guilty beyond reasonable doubt?\nThat is a strawman\n \nDo you have a legal system that can protect and punish under your premise?\nI believe one could exist (obviously)\n \n \n \nYou did not understand the answer obvious by your response. \n\n Then I will wait for your clarification\n \n \n \nThen respond to the statements I made that explain why it is flawed. \n\n I didn't notice any.\n \nI could counter with from your statements your basically saying \"Once everybody understands that I am right, then the problems will no longer be a consideration, I mean I don't consider them in my premise and look how good it sounds\"\n\n Try it. What you are responding to is my observation that you are using an appeal to absurd conclusions which don't actually follow from the premises.\n I agree with what you just said, once everyone understands I am right then the problems will no longer be a consideration. You see the only problem I see so far is that you disagree with me.\n \n \nAgain, it sounds great, but it doesn't take into consideration problems that prevent it from actually working. Get over those and you might have something\n\n Done, next?\n \n \n \nAgreement among the masses prevents chaos, instability and anarchy and conflict becomes manageable.\n\n A vast majority is all that is required for that, criminals will always exist.", 
   {
    "unicode_changes_made": true
   }, 
   408495, 
   null, 
   1280122740.0
  ], 
  [
   408747, 
   null, 
   "pappillion001", 
   "I do not expect that.\n\n \n Anyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n \n \n You do\n \n I read what you wrote again and I still have no idea what you are talking about. What scenario have I not responded to?\n \n \n \n No\n \n \nRights are not subjective.\n They are not objective. Do rights exist outside of man? No they do not. \n Do you refer to all rights or just some? If choice is a right how does choosing to violate the right of another become immoral. \n \n A chooses to kill B A has the right to choose B has a right to not be killed B has a superior right to A Why?\n \n Necessary for what?\n \n \n \n \nThat choice will always exist, however; it is not identical to the choice to create or void reality or morality which does not itself exist.\n \n\n \n Reality exists for me whether I like it or not. Morality exists for me if I and everybody else acts accordingly.\n \n Reality is not a frame of mind or learned behavior.\n \n \nThere will always be a choice between believing the earth is 6000 years old and believing it is 6 billion.\n\n \n I will spot you a billion years, want to bet it is closer to 6 billion than 6000?\n \n Along those same lines people who think 6000 defy logic with their belief. They do not respect the choices of others and their value judgments. Things like this are what make your premise unstable, you assume rational logic must always agree and will decide any possible conflict.\n \n Your premise on choice may be rational but it is still a contradiction. IT is only logical to respect a person ability to choice except when it interferes with someone else's ability to choose. Which means there are times when it is not logical to respect someones ability to choose\n \n \n I know. My definition of logical is: reasoning in accordance with the principles of logic, as a person or the mind: logical thinking. \n \n \n If a 'circumstance' is the same for both then it is a fact and it should influence their logic. If it is an emotional distortion then it is interfering with their logic not altering it.\n \n If a debater knocks his opponent out in a fit of rage he did not 'upgrade' his logic he abandoned it.\n \n \n \nThere is only one logical option concerning what choices to respect in others. Respect everything they choose as their choice except the choice to fail to respect others.\n\n \n This is based on your subjective experience and evaluation. What makes sense to you based on an ideal. As you think it through I would bet there are considerations that you would not even consider based on personal preference, things that make you feel good about the outcome.\n \n \nAt the most basic level they are the same thing.\n\n \n No they are not, I already showed why.\n \n The difference between objectivism and pragmatism is that the former integrates the concept of principles. Meaning that it states that since liberty is necessary for life it is always a contradiction to claim it is more practical to disregard it.\n \n \nIt is necessary for life; consider trying to live without making and decisions. Now do not be confused by the easily made fallacy of saying \"well what if another person decides\" well that is just substituting one person's liberty for another.\n \n\n \n Never a consideration. It wasn't necessary to think it through that far. Why would I consider whether the ability to make decisions is necessary for life? You are stating that your objective morality is based on a value judgment. The ability to make choices is necessary for the life you would prefer and without it you believe life to have no value. People have lived entire lives as slaves, most not happily, but lived despite their condition. \n \n \nThe question that is posed then is by what right some substitute their judgment for others.\n\n \n Are you posing that question? because I didn't.\n \n \n \nI initially agreed but you modified the premises.\n Morality is a consequence of human existence, just as gravity would be 'real' without mass but meaningless.\n\n \n The various planets, suns, galaxies etc make it meaningful. It exists for real with or without man to explain it to himself.\n \n \nSo I would say it would not exist without humans because it would be null.\n\n \n It would still be there\n \n \nHowever then you use the example of mathematics which is also null without a mind capable of comprehending it.\n\n \n Your saying if a tree falls and there is no one to hear it it doesn't make a noise. 2 rocks next to 2 other rocks do not need me to observe them to exist as 4 rocks\n \n \nIndeed it would. Which means to the person who is pursuing the case he should never consider the person innocent which is how this so called dilemma is solved.\n\n \n You are missing the point or don't grasp our legal system or don't mean it when you say rights can't be violated. The person pursuing is not the one who determines guilt, he collects evidence and give that to some one else to prove guilt. The defendant under your system while not compelled to incriminate himself cannot be compelled to appear, evidence cannot be collected against his wishes, witness cannot be forced to testify. Do you not see this as a problem?\n \n \nNo it is not, I have never said you cannot risk violating a right I said you cannot violate a right.\n \n\n \n How can you have one without the other 100% of the time?\n \n \nThere is a difference and I have pointed it out to you via analogy.\n That is a strawman\n\n \n Bad analogy or your not understanding what I am saying.\n \n \n \nI agree with what you just said, once everyone understands I am right then the problems will no longer be a consideration. You see the only problem I see so far is that you disagree with me.\n \n \n Done, next?\n \n\n \n So much for rational logic.", 
   {
    "unicode_changes_made": true
   }, 
   408511, 
   null, 
   1280383080.0
  ], 
  [
   408755, 
   null, 
   "Freedom", 
   "You do\n\n I do not, if you can find where I say that please quote it.\n \n \nThey are not objective. Do rights exist outside of man? No they do not. \n\n They are objective, 'existing outside of man' is not a pre-condition for objectivity.\n \n They would exist for any being with reason and an individual mind, if you are getting hung up on our particular species.\n \n \nDo you refer to all rights or just some? If choice is a right how does choosing to violate the right of another become immoral. \n\n That is what I meant when I said integrating from the individual to the collective.\n \n I have been over the logic a thousand times and it is not contradictory.\n \n It is not violating a right to stop someone from doing so.\n \n I can give you examples of how you may always interact with the premises others wish to live by.\n \n The only choice they do not have is to alter reality and that choice is not taken by other people but by the universe.\n \n \nA chooses to kill B A has the right to choose B has a right to not be killed B has a superior right to A Why?\n\n I never said every choice was a right.\n \n A does not have the right to choose to kill B.\n \n This is the most common mistake I see when trying to lead people through the formation of objective morality.\n \n They are so focused on the collective for morality they cannot form a scenario with fundamental premises only.\n \n A's rights are absolute and he may choose to do whatever he can in nature.\n \n Only by assuming it is natural to kill or harm others can it be said that he has a right to do so.\n \n In fact Ayn Rand seemed to firmly believe that everyone and anyone who was opposed to liberty had at the root of their opposition the desire to leech off and control others.\n \n I certainly have not found anything contradictory to that in my dealings with those who are opposed to liberty.\n \n So let's integrate, we aren't allowed to add new rights because they cannot rely on society so lets see what we got.... Well we said no right could be violated by nature, a man alone cannot kill another so nature cannot violate the right to kill another human.\n \n Integration complete, it appears every human interaction period can never be a right but always a privilege, one of the sole discretion of the other.\n \n Funny how 8 different approaches always lead to the same conclusion... (consent) that's considered a sign of a strong conclusion in science.\n \n Oh I am afraid that is not as clear as I wanted it to be, well if you can follow along good else just tell me so.\n \n \n \nReality exists for me whether I like it or not. Morality exists for me if I and everybody else acts accordingly.\n\n Morality exists for you and me whether we like it or not.\n \n \nReality is not a frame of mind or learned behavior.\n\n Science is a frame of mind and learned behavior just as ethics is. Morality is not a frame of mind or learned behavior it's a concept that is known to various degrees with theories some sound and some unsound.\n \n \nI will spot you a billion years, want to bet it is closer to 6 billion than 6000?\n\n Come now I was just being poetic.\n \n \nAlong those same lines people who think 6000 defy logic with their belief. \n\n Precisely, they did not alter reality with their belief, they did not change logic with their belief.\n \n It is not sound to say that because they believe it's 6000 years old that the age of the earth is subjective and no one can claim to have the right answer we just have to go with what most people think.\n \n \nThey do not respect the choices of others and their value judgments.\n\n You're kidding right?\n \n When was the last time somebody tried to use violence to force some one to say the earth was 6000 years old?\n \n \nThings like this are what make your premise unstable, you assume rational logic must always agree and will decide any possible conflict.\n\n Rational logic must always agree that is true, but I do not require everyone to be logical, only so far as to establish principles of conduct, and even when I say \"I require\" all I mean is that which I would not peacefully tolerate otherwise.\n \n \nYour premise on choice may be rational but it is still a contradiction. IT is only logical to respect a person ability to choice except when it interferes with someone else's ability to choose. Which means there are times when it is not logical to respect someones ability to choose\n\n Well I'm good with examples so if you can come up with one that may be easier then assailing you with another abstract argument.\n \n \nThis is based on your subjective experience and evaluation. What makes sense to you based on an ideal. \n\n Actually it was based on the definition of rights which was in my opening posts.\n \n \nAs you think it through I would bet there are considerations that you would not even consider based on personal preference, things that make you feel good about the outcome.\n\n What do you mean?\n \n \nNo they are not, I already showed why.\n\n Not to me.\n \n \nNever a consideration. It wasn't necessary to think it through that far. Why would I consider whether the ability to make decisions is necessary for life? You are stating that your objective morality is based on a value judgment. The ability to make choices is necessary for the life you would prefer and without it you believe life to have no value. People have lived entire lives as slaves, most not happily, but lived despite their condition. \n\n Then you have thought that far because you just substituted the choices of the slave master for those of the slaves and claimed that because the slaves didn't make it, it wasn't necessary.\n \n \n \nThe various planets, suns, galaxies etc make it meaningful. It exists for real with or without man to explain it to himself.\n\n And?\n \n \nIt would still be there\n\n If a law that acts upon nothing exists, then morality exists with or without man.\n \n \nYour saying if a tree falls and there is no one to hear it it doesn't make a noise. 2 rocks next to 2 other rocks do not need me to observe them to exist as 4 rocks\n\n A noise is a sound disturbance and numbers are intrinsic to the universe. Yet you reversed the idea of a concept with that of the reality which is why I said you switched premises.\n \n Morality the concept does not exist without a mind capable of containing it, but it does exist in reality.\n \n The law of identity relates concept to reality.\n \n \nYou are missing the point or don't grasp our legal system or don't mean it when you say rights can't be violated. The person pursuing is not the one who determines guilt, he collects evidence and give that to some one else to prove guilt. The defendant under your system while not compelled to incriminate himself cannot be compelled to appear, evidence cannot be collected against his wishes, witness cannot be forced to testify. Do you not see this as a problem?\n\n All those things can be done.\n \n It is good and proper for us to say that someone is innocent until proven guilty, this is a safeguard and a reminder that only logic is an acceptable reason.\n \n Having a jury of peers, a judge, formal procedures it's all merely a system of verification. It is meant to avoid the case where someone is innocent but the trial (if any) was too speedy, too biased, too irrational.\n \n Why not 24 jurors? Can justice only be formed with 48?\n \n No, it is merely a precaution.\n \n A conviction by jury is no more proof of guilt than conviction by monarch, the only difference is that we have good reason to believe the former is better able to reach the logical conclusion given evidence.\n \n You seem to have these precautions so entrenched in your head you actually are thinking of them as laws of reality.\n \n I am here to tell you NO!\n \n Someone is not always innocent until proven guilty, to say that in the literal means you don't accept the existance of criminals who haven't gone to jail.\n \n Anyway, anyone who is pursuing some one for criminal activity MUST do so on the premise that they are criminals, anything else is irrational, and immoral.\n \n So then you come along and say \"You can't do that, they aren't criminals (yet)\".\n \n If they aren't criminals they shouldn't be put in jail no matter how formal your court system or how many jurors you have.\n \n \n \nHow can you have one without the other 100% of the time?\n\n How can I say \"I will never commit suicide\", and constantly drive around\n in a car when car accidents have been known to kill people?\n \n \n \nSo much for rational logic.\n\n You find that statement illogical? why?", 
   {}, 
   408747, 
   null, 
   1280390100.0
  ], 
  [
   409027, 
   null, 
   "pappillion001", 
   "I do not, if you can find where I say that please quote it.\n\n \n The paragraph above the one that prompted this response was yours in which you do\n \n \nThey are objective, 'existing outside of man' is not a pre-condition for objectivity.\n\n \n Meaning without man's bias or influence being a consideration in which case yes they are subjective. Only by using a less restrictive definition of objective can you say morality is objective.\n \n The argument that if they were subjective they could not exist therefore they must be objective is a fallacy. Just as law is subjective, its value acknowledged by consesnus so are morals. Just as law despite being sibjective is altered not by whim, but consensus.\n \n But let's pretend they are objective. How can you determine what is moral and what is not. You have decided that what is of benefit is good so morals must be based on what is good and beneficial, but how do you reach that conclusion without human bias or influence? You can't, morals by their nature are attached to human emotion.\n \n \nThey would exist for any being with reason and an individual mind, if you are getting hung up on our particular species.\n\n \n I can't wait to hear all about the morality of dolphins, parrotts or monkies\n \n \nThat is what I meant when I said integrating from the individual to the collective.\n\n \n Would that not be the same as that complete consensus you brought up and then didn't know what it meant?\n \n \nI have been over the logic a thousand times and it is not contradictory.\n \n It is not violating a right to stop someone from doing so.\n\n \n Who said all rights? This was concerning a specific right conflicting with a another right.\n \n \n \nI can give you examples of how you may always interact with the premises others wish to live by.\n \n The only choice they do not have is to alter reality and that choice is not taken by other people but by the universe.\n\n \n Every choice we make or do not make alters reality. It is not possible to not do so. \n \n The Universe the spackle that fills any hole, unknowable, indescribable yet always applicable.\n \n \n \nI never said every choice was a right.\n\n \n No you said choice is and should not be restricted\n \n \nA does not have the right to choose to kill B.\n \n This is the most common mistake I see when trying to lead people through the formation of objective morality.\n \n They are so focused on the collective for morality they cannot form a scenario with fundamental premises only.\n\n \n Then don't base a premise on an inaccurate statement. We therefore should not always respect the choice or value judgment of others because sometimes their logic is not to our liking. Leading to choices that we do not agree with.\n \n \nA's rights are absolute and he may choose to do whatever he can in nature.\n\n \n I see Hobb's idea of man's nature isn't your first choice, but how can there be a choice in determing what is man's nature? What immovable truth states that the basis by which morality is based a specific conditional state of man?\n \n \nOnly by assuming it is natural to kill or harm others can it be said that he has a right to do so.\n\n \n Does he not do so?\n \n \nIn fact Ayn Rand seemed to firmly believe that everyone and anyone who was opposed to liberty had at the root of their opposition the desire to leech off and control others.\n\n \n And 1500 Yuan will buy you a lot of rice in China. What do either of these statements have to do with the state of man?\n \n \n \nI certainly have not found anything contradictory to that in my dealings with those who are opposed to liberty.\n\n \n Happens when you try a convince some people an apple is a banana\n \n \nSo let's integrate, we aren't allowed to add new rights because they cannot rely on society so lets see what we got.... \n\n \n Bummer after all that time we spent on the collective a couple posts up we now learn they are unreliable.\n \n Where did the current ones come from again?\n \n \nWell we said no right could be violated by nature, a man alone cannot kill another so nature cannot violate the right to kill another human.\n\n \n Actually what you said is man doesn't in the natural state you choose to use for your analysis. \n \n And depsite not being able to he finds a way, often I might add, to kill another human. I would go so far as to suggest based on results and history and science it is in his nature to kill others. As a matter of fact we see this in most life forms. \n \n \n \nIntegration complete, it appears every human interaction period can never be a right but always a privilege, one of the sole discretion of the other.\n \n Funny how 8 different approaches always lead to the same conclusion... (consent) that's considered a sign of a strong conclusion in science.\n \n Oh I am afraid that is not as clear as I wanted it to be, well if you can follow along good else just tell me so.\n\n \n Maybe try being a little clearer because I don't think you hit the nail on the head.\n \n \nMorality exists for you and me whether we like it or not.\n\n \n It's there the problem is what does it consist of and what type of permanance does it have? Do we know or do we think we know?\n \n \nScience is a frame of mind and learned behavior just as ethics is. Morality is not a frame of mind or learned behavior it's a concept that is known to various degrees with theories some sound and some unsound.\n\n \n So 2+2 doesn't equal 4 when I am in a bad mood?\n \n So to various degress it is unknown and only some people have sound theories, but others disagree. \n \n Know many people who think 2+2 isn't 4? \n \n \nCome now I was just being poetic.\n\n \n So I take it that is a no?\n \n \nRational logic must always agree that is true, but I do not require everyone to be logical, only so far as to establish principles of conduct, and even when I say \"I require\" all I mean is that which I would not peacefully tolerate otherwise.\n\n \n A person must be logical only to the extent it keeps you from becoming violent. That could be said \"Don't pixx me of with your stxpid ideas.\n \n Your way sounds much friendlier\n \n \nThen you have thought that far because you just substituted the choices of the slave master for those of the slaves and claimed that because the slaves didn't make it, it wasn't necessary.\n\n \n Choice concerning whether to become a slave is not part of what I am talking about. I am not saying they willingly became slaves or were content to remain so. The point was about whether liberty was a necessary part of the will to live. It is a necessary part of how one would want to live. Certain animals will not tolerate captivity, they lose the will to live and die animal suicide if you will. Man for the most part does not exhibit this characteristic. The choice of slavery or incarceration or death (yes both are lousy choices) will result in choosing to live. The purpose is to show that liberty is not necessary but preferred.\n \n \n \nIf a law that acts upon nothing exists, then morality exists with or without man.\n\n \n My examples did not act upon nothing\n \n \nA noise is a sound disturbance and numbers are intrinsic to the universe. Yet you reversed the idea of a concept with that of the reality which is why I said you switched premises.\n\n \n You know what was meant and your combining two different staements with a response that doesn't fit.\n \n \nMorality the concept does not exist without a mind capable of containing it, but it does exist in reality.\n \n The law of identity relates concept to reality.\n\n \n The law of identity says it is what it is and will always be what it is and nothing else. Aspects of it may change but the thing itself is the same.\n \n So the concept can only exist as a result of the mind, but the mind is not necessary for it to be objective\n \n \n \nIt is good and proper for us to say that someone is innocent until proven guilty, this is a safeguard and a reminder that only logic is an acceptable reason.\n\n \n It is good and proper to mean it to.\n \n \nHaving a jury of peers, a judge, formal procedures it's all merely a system of verification. It is meant to avoid the case where someone is innocent but the trial (if any) was too speedy, too biased, too irrational.\n\n \n Really? We should call it a sentencing ceremony. How much money could be saved by just reverting to the police acting as judge and jury? At what point in the dog and pony show does the person get to defend themselves?\n \n \nWhy not 24 jurors? Can justice only be formed with 48?\n\n \n Why any? Since the only way to appear before a jury is if he has already been determined to be guilty. \n \n \n \nNo, it is merely a precaution.\n\n \n Precaution against what? If he is innocent his rights have already been violated, you mean against further violation? \n \n \nA conviction by jury is no more proof of guilt than conviction by monarch, the only difference is that we have good reason to believe the former is better able to reach the logical conclusion given evidence.\n\n \n and better reason that they are better than by the police or the public.\n \n \nYou seem to have these precautions so entrenched in your head you actually are thinking of them as laws of reality.\n \n I am here to tell you NO!\n \n Someone is not always innocent until proven guilty, to say that in the literal means you don't accept the existance of criminals who haven't gone to jail.\n\n \n \n If you would stop reading what you think I am saying instead of what I am actually saying this would not happen. \n \n A crime is committed when it is committed, not when someone is found guilty not when it is discovered, but when it occurs.\n \n Lets say there is a witness to a crime and upon giving a description to police they find 3 men who fit. They choose not to speak with police. To detain all 3 will violate the rights of at least 2 maybe all 3. To let them go will most likely result in the crime remaining unsolved. Do you take away their liberty until the witness can identify them or they can prove an aliby or do you let them go and letting justice become one of the vitims?\n \n \nAnyway, anyone who is pursuing some one for criminal activity MUST do so on the premise that they are criminals, anything else is irrational, and immoral.\n\n \n Long live police harrasment and racial profiling both a violation of individual rights and the result of guilty until proven innocent.\n \n \nSo then you come along and say \"You can't do that, they aren't criminals (yet)\".\n\n \n Sometimes they really aren't.\n \n \nIf they aren't criminals they shouldn't be put in jail no matter how formal your court system or how many jurors you have.\n\n \n That is true, not really pertinant, but nice.\n \n \nHow can I say \"I will never commit suicide\", and constantly drive around\n in a car when car accidents have been known to kill people?\n\n \n \n Because you just said you wouldn't and suicide isn't an accident not does someone suicide you.", 
   {}, 
   408755, 
   null, 
   1280789760.0
  ], 
  [
   409087, 
   null, 
   "Freedom", 
   "The paragraph above the one that prompted this response was yours in which you do\n\n I don't think so.\n \n \n \nMeaning without man's bias or influence being a consideration in which case yes they are subjective.\n\n I don't see why you think I can't follow you through these semantic twists.\n \n bias will always be a consideration, even in cases where it does not matter to the actual subject.\n \n \nOnly by using a less restrictive definition of objective can you say morality is objective.\n\n objective (&#601;b&#712;d&#658;&#603;kt&#618;v) \n \n - adj \n 1. existing independently of perception or an individual's conceptions: are there objective moral values?  \n 2. undistorted by emotion or personal bias \n 3. of or relating to actual and external phenomena as opposed to thoughts, feelings, etc \n \n I can appreciate the confusion that results when one forgets the law of identity but I do note share it.\n \n Morality is an advanced concept, it does not have a simple physical identity (such as a chair) but many of our concepts do not, ones that I am sure you take for granted.\n \n Weather for one. Weather is a combination of physical occurrences.\n \n If one asked you what Weather was and you just pointed to the sky and said it's the state of the atmosphere with respect to wind, temperature, cloudiness, moisture, pressure, etc. , the person who asked *assume he is an alien* might suspect weather is merely a concept that you invented and that it has no objective meaning simply because the only place weather seems to exist is in your mind.\n \n That is not true though, the concept of weather is a composite of other concepts which in the end are composed of simple facts.\n \n Morality too is a composite and though no one can point to a simple object in the real world it is composed of concepts which are composed of simple facts.\n \n Our existance is a fact, it is not an opinion by any sane definition of fact.\n \n The terms of morality are people and their beliefs and their actions as the terms of weather are air currents and moisture and temperature.\n \n You think it is subjective only because you are not looking for an absolute truth.\n \n If a scientist entered a field with the premise that he could only find results that apply to himself he would never publish any papers because that would simply be his arrogance to think others would use the same 'science' as him.\n \n You see me telling you something and claiming it is true beyond and regardless of my authority, yet all your life every moral claim you have ever heard has been on authority.\n \n You think it cannot be true because you cannot think of any 'laws' that make it true.\n \n I have told them to you, I have laid out the core of the logic but you didn't want to deal with that.\n \n Please don't become upset at that last statement, but it is true. You have a premise that morality is subjective so you had to assume that somewhere in my line of reasoning there was a subjective premise, one that is only true because I think it is true.\n \n You have said 'ah ha' many times to many of my premises because you thought you found it, but be honest with yourself please.\n \n (A) says that a chair exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an object\n which fits the definition of a chair.\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and actions which fit the definition of morality.\n \n You have said that morality is subjective because we define it, we define all our words.\n \n You have said morality is subjective because right & wrong, good & evil are subjective, I have pointed out that some of it is objective.\n \n I have told you that it exists because there can be no other logical alternative in belief systems, this is true and this is why some good and evil is objective.\n \n You want to distinguish this from other matters which are analogous but you cannot.\n \n I brought up the example of young earth vs the scientific fact of an old earth.\n \n The only reason it is an objectivly definable matter is because one is forced to one of the conclusions by logic.\n \n If for any reason that was not the case it would be subjective.\n \n What if I said chicken parmesan is the best dish on earth and you said sushi was?\n \n It is not objective and you can tell it is not because logic does not force a conclusion, all of this regardless of what someone claims to believe.\n \n Morality is the same, you have pointed out many times (in desperation it seems to me) that not everyone will agree on morality.\n \n That does not prove that any given person is not forced to a conclusion by logic any more than young earth creationist prove that the age of the earth cannot be an objective fact.\n \n Let yourself be concerned first with what are the logical conclusions then you may note that some ignore them.\n \n Now, to play devils advocate and to save you from merely repeating yourself I will tell you what you can do to disprove this.\n \n You can think of an example in which the premises of social behavior of one person logically contradict the possible interactions he/she may have.\n \n This would show that one is not forced to one conclusion, that you are correct in saying that morality is subjective.\n \n It would show that good and evil in social interactions can indeed be good for one and evil for another.\n \n A word of cation, do not forget the logical root of the golden rule.\n \n \nThe argument that if they were subjective they could not exist therefore they must be objective is a fallacy.\n\n Certainly no subjective fact exists.\n \n Subjective statements exist.\n \n There are many statements which are technically subjective but practically they are meant to be generalizations.\n \n \nJust as law is subjective, its value acknowledged by consesnus so are morals. Just as law despite being sibjective is altered not by whim, but consensus.\n\n A consensus of whim as opposed to individual whim. 10,000 people doing something for no reason as opposed to one person doing something for no reason.\n \n That makes it bearable to you, it distinguishes it from despotism in this society.\n \n Yet obviously it does not make it objectively true.\n \n You do not have a problem with that, but only because you have not followed that train of thought to it's ultimate conclusion.\n \n That society does not need to have an objectivly true foundation means that despotism, monarchy, communism, even anarchy are merely meaningless alternatives to democracy, republic, and constitution.\n \n In this world view of yours the only reason consensus is superior to dictate is because you think so, and at this time and place the military and political powers agree.\n \n A consensus of whim is a foundation of jello for any idea, and you wish to place the existance of civilization itself on this foundation.\n \n George Washington in response to question \"how could you betray the throne of England \"Everybody else was doing it..\" (fictional)\n \n \nBut let's pretend they are objective. How can you determine what is moral and what is not.\n\n In the social sphere it is the concept of liberty that is the most simplistic description of the results of all non-contradictory analysis of interaction.\n \n In other words the rights that are derived from the right to oneself and ones actions are how to easily tell if any given action is right or wrong.\n \n \nYou have decided that what is of benefit is good so morals must be based on what is good and beneficial,\n\n All that is beneficial is not good.\n \n All that is good is not beneficial.\n \n Try to avoid status adjectives without qualifiers, i.e. beneficial to what end and to whom?\n \n \nbut how do you reach that conclusion without human bias or influence? \n\n You don't make decisions based on emotion.\n \n I am sure you make objective decisions all the time, why do you keep asking how it's done?\n \nYou can't, morals by their nature are attached to human emotion.\n\n The only connection between morals and emotion I have ever made was that properly a persons emotions should be controlled by their beliefs on morality.\n \n \nI can't wait to hear all about the morality of dolphins, parrotts or monkies\n\n I don't think dolphins have reason, I am 99.9% sure that monkeys don't, and absolutely sure that parrots don't.\n \n \nWould that not be the same as that complete consensus you brought up and then didn't know what it meant?\n\n I haven't a clue what that means.\n \n I don't require or expect a complete consensus on anything. Complete consensus means agreement among all individuals.\n \n \nWho said all rights?\n\n Not me in my last post up till the point you responded to.\n \n \nThis was concerning a specific right conflicting with a another right.\n\n That doesn't happen, if you find such a contradiction one of your rights is incorrectly defined or incorrectly derived.\n \n \nEvery choice we make or do not make alters reality. It is not possible to not do so. \n\n The part that deals with what we are thinking nothing more.\n \n \nThe Universe the spackle that fills any hole, unknowable, indescribable yet always applicable.\n\n 1. the totality of known or supposed objects and phenomena throughout space; the cosmos; macrocosm. \n 2. the whole world, esp. with reference to humanity: a truth known throughout the universe. \n \n \nNo you said choice is and should not be restricted\n\n By others.\n \n This is a corollary observation about rights, it is getting to the right answer two different ways.\n \n I never meant choice without qualifier and I know this is the not one of the most precise analysis but the other ones I tried seemed you seemed to ignore.\n \n I really won't let you get into a semantic melee because you think you found a weakness in my argument that doesn't exist.\n \n That was a peremptory move to prevent you from equating the word choice without any qualifiers to how I was using it as the choices about one will believe or do while maintaining logical consistency.\n \n \nThen don't base a premise on an inaccurate statement. We therefore should not always respect the choice or value judgment of others because sometimes their logic is not to our liking. Leading to choices that we do not agree with.\n\n No we always should, the logical part comes in with how one interacts with someone.\n \n You may interact with anyone on their premises, not their stated beliefs but their premises.\n \n This hardly needs to be stated since you have little choice in the matter, you cannot forcibly alter another's thoughts.\n \n \nWhat immovable truth states that the basis by which morality is based a specific conditional state of man?\n\n The fact that our minds are all individual means the conditional is met.\n \n You are correct in observing that when ones goes to determine the shape of morality for an individual it is not the same as doing so for a collective.\n \n However simply note that the collective is a sum of individuals and nothing more.\n \n Therefore the collective (universal) morality is the sum of individual moralities.\n \n Let it be noted that I speak only of universal morality in my posts, personal morality would be anything you think is good (provided logical consistency).\n \n \nDoes he not do so?\n\n Yes, is all that men do natural to them?\n \n \nAnd 1500 Yuan will buy you a lot of rice in China. What do either of these statements have to do with the state of man?\n\n It was an interesting fact.\n \n \nWhere did the current ones come from again?\n\n I said they were anything that was inviolate in this circumstance.\n \n \nActually what you said is man doesn't in the natural state you choose to use for your analysis. \n\n Any other choice is fallacy.\n \n \nAnd depsite not being able to he finds a way, often I might add, to kill another human. I would go so far as to suggest based on results and history and science it is in his nature to kill others. As a matter of fact we see this in most life forms.\n \n Ayn Rand predicts the core beliefs of another collectivist (marks a 24 foot ledger).\n \n \nIt's there the problem is what does it consist of \n\n Formula which gives the boolean value: right/wrong as a function of individual behavior.\n \nand what type of permanance does it have? \n\n The premises it is based on appear to be very permanent.\n \nDo we know or do we think we know?\n\n You'll have to define the difference between those two for me.\n \n \nSo 2+2 doesn't equal 4 when I am in a bad mood?\n\n It does.\n \n Or should you say two plus two equals four. (just in case someone wants to make a snide remark using different number writing conventions)\n \n \nSo to various degress it is unknown and only some people have sound theories, but others disagree. \n\n I agree with that opinion.\n \n \nKnow many people who think 2+2 isn't 4? \n\n I know some who leave themselves no logical alternative but to say that it is four only because everyone says it is.\n \n \n \nSo I take it that is a no?\n\n What are you talking about? No I am not going to bet the earth's age is closer to 6000 than to 6 billion.\n \n \nA person must be logical only to the extent it keeps you from becoming violent.\n\n which happens to be the exact same extend required to keep them from becoming violent.\n \n Yes\n \n \nThat could be said \"Don't pixx me of with your stxpid ideas.\n\n I am sure I would understand that if I was in the right social circles...\n \n \nChoice concerning whether to become a slave is not part of what I am talking about. I am not saying they willingly became slaves or were content to remain so. The point was about whether liberty was a necessary part of the will to live. It is a necessary part of how one would want to live. Certain animals will not tolerate captivity, they lose the will to live and die animal suicide if you will. Man for the most part does not exhibit this characteristic. The choice of slavery or incarceration or death (yes both are lousy choices) will result in choosing to live. The purpose is to show that liberty is not necessary but preferred.\n\n The point was not made, someones liberty is always required.\n \n \nYou know what was meant and your combining two different staements with a response that doesn't fit.\n\n That's what I was saying about your question.\n \n If no one hears the sound the concept of that sound is never formed but the sound did exist.\n \n Morality is the same way, though it is different in that the creature conceptualizing is also the subject matter.\n \n Without man there is no subject matter and therefore no concept.\n \n Without air there is no sound and therefore no concept.\n \n There are men who have no concept of morality yet it exists for them just as much as anyone else.\n \n \nThe law of identity says it is what it is and will always be what it is and nothing else. Aspects of it may change but the thing itself is the same.\n \n So the concept can only exist as a result of the mind, but the mind is not necessary for it to be objective\n\n I would say objective is a concept only applicable to our thoughts.\n \n I would agree if you replace 'for it to be objective' with 'for it to exist'.\n \n \nReally? We should call it a sentencing ceremony. How much money could be saved by just reverting to the police acting as judge and jury? At what point in the dog and pony show does the person get to defend themselves?\n\n At their trial.\n \n \nWhy any? Since the only way to appear before a jury is if he has already been determined to be guilty. \n\n because it is much more unlikely for unsound reasoning to get past both the police and the jury than it is for just the police.\n \n The impartiality of jurors is simply part of a system designed to reduce irrationality and bias to the absolute minimum.\n \n \nPrecaution against what? If he is innocent his rights have already been violated, you mean against further violation? \n\n Yes, such as having to actually endure a sentence as opposed to being dragged to court and investigated.\n \n \nIf you would stop reading what you think I am saying instead of what I am actually saying this would not happen. \n\n That's the way I started...\n \n \nA crime is committed when it is committed, not when someone is found guilty not when it is discovered, but when it occurs.\n\n Indeed.\n \n \nLets say there is a witness to a crime and upon giving a description to police they find 3 men who fit. They choose not to speak with police. To detain all 3 will violate the rights of at least 2 maybe all 3. To let them go will most likely result in the crime remaining unsolved. Do you take away their liberty until the witness can identify them or they can prove an aliby or do you let them go and letting justice become one of the vitims?\n\n The former, yes that is one aspect of the current justice system that is incompatible with objective morality. You can't detain people you know haven't committed a crime.\n \n I think that helping the police within limits would be a good constitutional term.\n \n \nSometimes they really aren't.\n\n If they aren't by the time the police investigate...\n \n \nBecause you just said you wouldn't and suicide isn't an accident not does someone suicide you.\n\n Well that was strange grammar, but yes.\n \n An accident is not an intentional act.\n \n One can say \"I will never violate anyone's rights\", the normal implication is that one will never intentionally violate anyone's rights.\n \n I can think up plenty of far fetched yet 'possible' scenarios in which people can violate rights without knowing they are doing so.\n \n Many movies and books with interesting plots have elements such as that.", 
   {
    "unicode_changes_made": true
   }, 
   409027, 
   null, 
   1280919060.0
  ], 
  [
   409204, 
   null, 
   "simone", 
   "Can one write morality in stone?\n \n I wonder if the myth of the presentation of the Ten Commandments was not a metaphor for the ridiculousness of trying to set morality down in stone -- the shattering of the first set of commandments reflecting the idiocy of the attempt.\n \n Morality is rather fluid. Humanity has agreed on a few basic terms of morality -- in most cases forbidding murder and theft, but most of what lies beyond that is a construct of a time and place.", 
   {}, 
   409087, 
   null, 
   1281036180.0
  ], 
  [
   409241, 
   null, 
   "Freedom", 
   "Can one write morality in stone?\n\n If one has a chisel.\n \n \nI wonder if the myth of the presentation of the Ten Commandments was not a metaphor for the ridiculousness of trying to set morality down in stone -- the shattering of the first set of commandments reflecting the idiocy of the attempt.\n\n I suppose God making another one would be symbolic of the idiocy if shattering eternal truth as if it could change.\n \n \nMorality is rather fluid. Humanity has agreed on a few basic terms of morality -- in most cases forbidding murder and theft, but most of what lies beyond that is a construct of a time and place.\n\n This thread is about why that is not true, since the reports I have sent don't seem to be answered I suppose it is hopeless to expect a formal debate in earnest.\n \n I will try my best to emulate it by ignoring posts without arguments and yours was one such post.", 
   {}, 
   409204, 
   null, 
   1281068520.0
  ], 
  [
   409277, 
   null, 
   "simone", 
   "Eternal Truth?\n \n What an enormous conceit!", 
   {}, 
   409241, 
   null, 
   1281118320.0
  ], 
  [
   409364, 
   null, 
   "pappillion001", 
   "I don't see why you think I can't follow you through these semantic twists.\n\n \n You sometimes give me credit I have not earned\n \n \nbias will always be a consideration, even in cases where it does not matter to the actual subject.\n\n \n What would be a situation where a biased conclusion didn't matter?\n \n \nobjective (&#601;b&#712;d&#658;&#603;kt&#618;v) \n \n &#8212; adj \n 1. existing independently of perception or an individual's conceptions: are there objective moral values?  \n 2. undistorted by emotion or personal bias \n 3. of or relating to actual and external phenomena as opposed to thoughts, feelings, etc \n \n I can appreciate the confusion that results when one forgets the law of identity but I do note share it.\n\n \n ???\n \n \nMorality is an advanced concept, it does not have a simple physical identity (such as a chair) but many of our concepts do not, ones that I am sure you take for granted.\n \n\n \n I agree I don't not ponder the significance of everything I come across, should I?\n \n \nWeather for one. Weather is a combination of physical occurrences.\n \n If one asked you what Weather was and you just pointed to the sky and said it's the state of the atmosphere with respect to wind, temperature, cloudiness, moisture, pressure, etc. , the person who asked *assume he is an alien* might suspect weather is merely a concept that you invented and that it has no objective meaning simply because the only place weather seems to exist is in your mind.\n\n \n Since I would be pointing at something I can't imagine why he would think this. If one asked what is morality what would I point at? Someone telling the truth? That is being honest.\n \n \nThat is not true though, the concept of weather is a composite of other concepts which in the end are composed of simple facts.\n\n \n ok\n \n \nOur existance is a fact, it is not an opinion by any sane definition of fact.\n\n \n I never questioned it, but I am guessing I know why you make this statement.\n \n \nThe terms of morality are people and their beliefs and their actions as the terms of weather are air currents and moisture and temperature.\n \n\n \n Unlike morality weather and the chair exist independent of the mind. Since morality is only a concept it relies on the mind to exist. The mind is what determines what it is, what it will be like. The mind cannot exert that influence on the weather or chair.\n \n \nYou think it is subjective only because you are not looking for an absolute truth.\n\n \n I am looking for an absolute truth, but I understand I may not find it and should not settle.\n \n \nIf a scientist entered a field with the premise that he could only find results that apply to himself he would never publish any papers because that would simply be his arrogance to think others would use the same 'science' as him.\n\n \n That is science. What makes it objective is the ability for anyone the knowledge and equipment can reproduce the results. Removing at least to some degree any bias\n \n \nYou think it cannot be true because you cannot think of any 'laws' that make it true.\n\n \n It sure doesn't help change my mind.\n \n \nI have told them to you, I have laid out the core of the logic but you didn't want to deal with that.\n\n \n I found fault with your logic, which you seem just as eager to ignore. \n \n \nPlease don't become upset at that last statement, but it is true. You have a premise that morality is subjective so you had to assume that somewhere in my line of reasoning there was a subjective premise, one that is only true because I think it is true.\n\n \n The natural state of man is an assumption. Can you not base your premise on something that isn't a conceptual model and surrounded by a preference instead a primary force of man?\n \n \nYou have said 'ah ha' many times to many of my premises because you thought you found it, but be honest with yourself please.\n\n \n Sorry you feel that way\n \n \n(A) says that a chair exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an object\n which fits the definition of a chair.\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and actions which fit the definition of morality.\n\n \n Why must the wording change in order to remain valid? \n \n \nYou have said that morality is subjective because we define it, we define all our words.\n\n \n I wasn't referring to Webster when I said that\n \n \nYou have said morality is subjective because right & wrong, good & evil are subjective, I have pointed out that some of it is objective.\n\n \n An individual may have objective morality that is not univerasal\n \n \nI have told you that it exists because there can be no other logical alternative in belief systems, this is true and this is why some good and evil is objective.\n\n \n Isn't it must be A because it can't be B a fallacy?\n \n \nYou want to distinguish this from other matters which are analogous but you cannot.\n\n \n ???\n \n \nYou can think of an example in which the premises of social behavior of one person logically contradict the possible interactions he/she may have.\n \n This would show that one is not forced to one conclusion, that you are correct in saying that morality is subjective.\n \n It would show that good and evil in social interactions can indeed be good for one and evil for another.\n \n A word of cation, do not forget the logical root of the golden rule.\n\n \n Sex with minors with the intention to procreate is today considered immoral behavior. The logical argument as a young teen they are ill prepared for the responsibility, the practice leads to exploitation, physically they may be capable, but are more at risk, the emotional trauma etc. These were not considerations a few thousand years ago. It was the opposite when life expectancy was 30 or 40 and children were expected to be adults much earlier. Having children was necessary for survival, stable government and many times used to end feuds between waring villages, cities and countries. What was considered right and moral is no longer thought so in most, but not all of the world. If morality is objective then does man now understand morality or did he then. It is in man's nature to procreate and he is able at a certain age. If the logic is objective to reach the conclusion why the reasons have changed that the conclusion used in it's determination or again it was misunderstood. If we keep misunderstanding what morality is or the logic necessary to do so how can we be sure it is right this time?\n \n But it is also logical that morality fit the circumstances of what society would need it to be. What was moral then was necessary what is moral now is necessary. For morality to be of benefit to man it must be adaptable to man's needs. If not he will discard it. \n \n \nCertainly no subjective fact exists.\n \n Subjective statements exist.\n \n There are many statements which are technically subjective but practically they are meant to be generalizations.\n \n\n \n Used in that context they are synonymous, but this drifts.\n \n \nA consensus of whim as opposed to individual whim. 10,000 people doing something for no reason as opposed to one person doing something for no reason.\n\n \n Why must action always be whim with you? Subjective can have responsible purposeful action as well, but that would make your best argument that much less effective. \n \n \nThat makes it bearable to you, it distinguishes it from despotism in this society.\n\n \n Is this your way of asking about what the price in China is for rice? Can you even follow the rationale that made you feel this was necessary?\n \n \nYet obviously it does not make it objectively true.\n \n You do not have a problem with that, but only because you have not followed that train of thought to it's ultimate conclusion.\n \n That society does not need to have an objectively true foundation means that despotism, monarchy, communism, even anarchy are merely meaningless alternatives to democracy, republic, and constitution.\n\n \n Has not society experienced each, picking something it finds beneficial and molding it into a hybrid. So no meaningless is not not close, but objectively would be to stagnate, no change, no progress there would always be the rule that is unyielding and unbending. \n \n You choose to see through eyes and think with a mind incapable of shedding the influences of your age, birthplace and time, gender, social class, level of education, where you live as an adult, profession, what you watch on TV and what you read as well as your emotional state and countless other experiences. You can imagine no other possibility and trust your logic to somehow conclude you are right. Because it makes no sense to you is insufficient, unless you are that scientist you mentioned earlier\n \n \nIn this world view of yours the only reason consensus is superior to dictate is because you think so, and at this time and place the military and political powers agree.\n\n \n Do they agree? Is the world at peace? Are the masses content? You have connected imaginary dots to try and portray that I believe something that you have spent a fair amount of time trying to associate with negative concepts. You don't think I am going to say oh wow without objective morality civilization would crumble do you?\n \n \n \nA consensus of whim is a foundation of jello for any idea, and you wish to place the existance of civilization itself on this foundation.\n \n George Washington in response to question \"how could you betray the throne of England \"Everybody else was doing it..\" (fictional)\n\n \n \n \nYou don't make decisions based on emotion.\n \n The only connection between morals and emotion I have ever made was that properly a persons emotions should be controlled by their beliefs on morality.\n\n \n You never bought something you liked? You never went somewhere with someone you liked or went to meet them? \n \n \nI don't think dolphins have reason, I am 99.9% sure that monkeys don't, and absolutely sure that parrots don't.\n\n \n They all can. \n \n \nI never meant choice without qualifier and I know this is the not one of the most precise analysis but the other ones I tried seemed you seemed to ignore.\n\n \n This is the very first time you have acknowledged choice as anything but absolute with the exception of choosing to harm another and that with a spin.\n \n \nI really won't let you get into a semantic melee because you think you found a weakness in my argument that doesn't exist.\n\n \n I am not doing what you have spent much of this post claiming I am doing and doing yourself.\n \n \nThe fact that our minds are all individual means the conditional is met.\n\n \n Not condition like in a contract, but like the state he is in.\n \n \nThe point was not made, someones liberty is always required.\n\n \n The point was made. Show my example incorrect and then you can say that, but not until.\n \n \nIf no one hears the sound the concept of that sound is never formed but the sound did exist.\n \n Morality is the same way, though it is different in that the creature conceptualizing is also the subject matter.\n \n Without man there is no subject matter and therefore no concept.\n \n Without air there is no sound and therefore no concept.\n\n \n A concept is a construct of the mind. If it has no physical aspect it does not exist independent of the mind. Where can I see or touch or taste or hear or smell the physical aspect of morality? Not someone performing an action that could be called moral, but could be called something else also. Air is Air a chair is a chair and sound is sound and all have a physical aspect independent of the mind. The concept is not necessary for them to exist only for man to perceive them as such. Morality has no physical existence only conceptual. It is necessary for the mind to create it or it would not exist ever. Being a creation of the mind the accepts or denies what it is and what it will be since it can be only what the mind makes it.[/QUOTE]", 
   {}, 
   409087, 
   null, 
   1281175800.0
  ], 
  [
   409409, 
   null, 
   "Freedom", 
   "Eternal Truth?\n \n What an enormous conceit!\n\n If it is conceit to believe a fact exists, then all men have a choice between conceit and ignorance.\n \n \nWhat would be a situation where a biased conclusion didn't matter?\n\n Well I can think of some but for the sake of argument I'll say none.\n \n Since I would be pointing at something I can't imagine why he would think this. \n \n \nIf one asked what is morality what would I point at?\n\n If you had to point at something you would point at what morality eventualy reduces to in particular units. You would point at a person.\n \n \nI never questioned it, but I am guessing I know why you make this statement.\n\n I should hope so, I claimed it along with one other premise were all that were required to conclude morality and establish logic and thereby all knowledge.\n \n \nUnlike morality weather and the chair exist independent of the mind. Since morality is only a concept it relies on the mind to exist. \n\n As all concepts do, including those of weather and chairs.\n \nThe mind is what determines what it is\n\n That's true, but the mind cannot determine just anything it wants.\n \nThe mind cannot exert that influence on the weather or chair.\n\n or morality.\n \n \nI am looking for an absolute truth, but I understand I may not find it and should not settle.\n\n Fine then, consider this. I have not used any premises to conclude morality that are subjective.\n \n All you can be saying then is that what I concluded is not morality.\n \n Since you give definition to morality for yourself you have chosen to alter that definition from the one in the dictionary.\n \n Why did you do this?\n \n \nThat is science.\n\n This is science.\n \nWhat makes it objective is the ability for anyone the knowledge and equipment can reproduce the results.\n\n That is not what makes something objective, but morality meets that criteria.\n \n \nI found fault with your logic\n\n I do not recognize that happening.\n \n \n \nThe natural state of man is an assumption.\n\n Really, whose mind have you merged with lately?\n \n Any evidence at all that we are not all individuals please?\n \n \nWhy must the wording change in order to remain valid? \n\n Because a chair is singular and morality has multiple objects as well as actions.\n \n I didn't invent English, how would you show that something is plural?\n \n \n \nI wasn't referring to Webster when I said that\n\n No you were implying that there was no object(s) behind our definition like there are for other words.\n \n \n \nAn individual may have objective morality that is not univerasal\n\n Not without additional premises.\n \n \n \nIsn't it must be A because it can't be B a fallacy?\n\n Without another premise yes.\n \n C can only be A or B.\n C is not B\n C must be A\n \n is valid.\n \n \n \nSex with minors with the intention to procreate is today considered immoral behavior. The logical argument as a young teen they are ill prepared for the responsibility, the practice leads to exploitation, physically they may be capable, but are more at risk, the emotional trauma etc. These were not considerations a few thousand years ago. It was the opposite when life expectancy was 30 or 40 and children were expected to be adults much earlier. Having children was necessary for survival, stable government and many times used to end feuds between waring villages, cities and countries. What was considered right and moral is no longer thought so in most, but not all of the world. If morality is objective then does man now understand morality or did he then. It is in man's nature to procreate and he is able at a certain age. If the logic is objective to reach the conclusion why the reasons have changed that the conclusion used in it's determination or again it was misunderstood. If we keep misunderstanding what morality is or the logic necessary to do so how can we be sure it is right this time?\n \n But it is also logical that morality fit the circumstances of what society would need it to be. What was moral then was necessary what is moral now is necessary. For morality to be of benefit to man it must be adaptable to man's needs. If not he will discard it. \n\n That wasn't an example, and if it was meant to be an argument it was a begging the question fallacy.\n \n \nWhy must action always be whim with you?\n\n Not always, only when there is no reason, again not reason as in motivation reason as in logical conclusion on the course of action.\n \n \n \nYou choose to see through eyes and think with a mind incapable of shedding the influences of your age, birthplace and time, gender, social class, level of education, where you live as an adult, profession, what you watch on TV and what you read as well as your emotional state and countless other experiences. You can imagine no other possibility and trust your logic to somehow conclude you are right. Because it makes no sense to you is insufficient, unless you are that scientist you mentioned earlier\n\n This is rich.\n \n 'trust your logic to somehow conclude you are right' Yea that is about the only thing I trust without reservation.\n \n \nDo they agree? Is the world at peace? Are the masses content? You have connected imaginary dots to try and portray that I believe something that you have spent a fair amount of time trying to associate with negative concepts. You don't think I am going to say oh wow without objective morality civilization would crumble do you?\n\n No of course not, without absolute morality (which comes in the disguise of law) it would crumble.\n \n What you should realize is that your belief that morality cannot be absolute is incompatible with civilization.\n \n \nYou never bought something you liked? You never went somewhere with someone you liked or went to meet them? \n\n Of course I have.\n \n \nThey all can. \n\n Have fun proving it.\n \n \nThis is the very first time you have acknowledged choice as anything but absolute with the exception of choosing to harm another and that with a spin.\n\n I have no idea what you mean.\n \n \nNot condition like in a contract, but like the state he is in.\n\n He exists in a state of individuality.\n \n \nThe point was made. Show my example incorrect and then you can say that, but not until.\n\n Again, your example traded the liberty of the slave for the master, but someone still had to choose to do something for anyone to live.\n \n \nWhere can I see or touch or taste or hear or smell the physical aspect of morality?\n\n You can hear people, you can touch people, you can smell people the rest is not PG.\n \n \nThe concept is not necessary for them to exist only for man to perceive them as such.\n\n The same is true of morality.\n \nMorality has no physical existence only conceptual.\n\n i.e. imaginary. No it does has a physical existance just as real as other advanced concepts.", 
   {}, 
   409364, 
   null, 
   1281226860.0
  ], 
  [
   409518, 
   null, 
   "pappillion001", 
   "Well I can think of some but for the sake of argument I'll say none.\n\n \n Ok then we for the sake of argument say that bias effects morality and therefore it cannot be objective.\n \n \nIf you had to point at something you would point at what morality eventualy reduces to in particular units. You would point at a person.\n\n \n Why? I don't point to a tree and say that will one day be a chair or point at lake and say that will be rain. Morality has no physical properties, certain actions are attributed to being moral but can be described by other terms as well. Integrity, compassion or honor as examples.\n \n \nAs all concepts do, including those of weather and chairs.\n \n That's true, but the mind cannot determine just anything it wants.\n\n \n Only what it creates. It does not create weather or a chair and has no influence on them. The mind can't make rain nor can it change a rocking chair into a high chair but it can change moral to immoral.\n \n \nFine then, consider this. I have not used any premises to conclude morality that are subjective.\n\n \n You don't seem to get that all the experiences of your life contribute to how you perceive everything. What you conclude as rational is based on everything that you have seen, read, touched, learned, heard, smelled and tasted. Those experiences come together to determine what is good, bad, acceptable and unacceptable. If outside factors were not a consideration everything would be the same. \n \n \nAll you can be saying then is that what I concluded is not morality.\n\n \n No I could be saying that morality is not objective\n \n \nSince you give definition to morality for yourself you have chosen to alter that definition from the one in the dictionary.\n \n Why did you do this?\n\n \n &#8211;noun\n 9.\n the moral teaching or practical lesson contained in a fable, tale, experience, etc.\n 10.\n the embodiment or type of something.\n 11.\n morals, principles or habits with respect to right or wrong conduct.\n \n Where am I off?\n \n \nThat is not what makes something objective, but morality meets that criteria.\n\n \n What makes something objective?\n \n \nI do not recognize that happening.\n \n\n \n I am not surprised\n \n \nReally, whose mind have you merged with lately?\n \n Any evidence at all that we are not all individuals please?\n\n \n Individual is not a state of being, but if it was you make the assumption that there is anything that applies to man outside of his being an individual. That once he becomes part of something like society he is no longer completely in that state. He must choose which state will he be in and by which will he have a duty to. \n \n Another thing to consider if individual is a state of being morality is meaningless. There is him and that is it the concept and action you believe are representative of morality only have purpose when he leaves the state of individual\n \n \nBecause a chair is singular and morality has multiple objects as well as actions.\n \n I didn't invent English, how would you show that something is plural?\n\n \n Add and s don't add a new set of conditions to make the conclusion valid.\n \n \nThat wasn't an example, and if it was meant to be an argument it was a begging the question fallacy.\n\n \n I thought is was a good example for your question. What have I presumed true?\n \n You could answer anyway.\n \n \nNot always, only when there is no reason, again not reason as in motivation reason as in logical conclusion on the course of action.\n\n \n Every one of your responses assumes that there is never a logical reason. Assume there was would your response be the same?\n \n \nThis is rich.\n \n 'trust your logic to somehow conclude you are right' Yea that is about the only thing I trust without reservation.\n\n \n As I stated earlier your logic is biased. Not intentionally so, but still biased.\n \n \nNo of course not, without absolute morality (which comes in the disguise of law) it would crumble.\n\n \n Law is law morality is morality. A tree is not disguised as a chair and fog is not weather disguised as water vapor. Why does law change if it is objective morality incognito?\n \n \nWhat you should realize is that your belief that morality cannot be absolute is incompatible with civilization.\n\n \n Let me know when a change in morals is the sole cause of the demise of a civilization.\n \n \nHave fun proving it.\n\n \n Dolphins\n TPM: The Philosophers&#8217; Magazine | Dolphin people\n \n Monkey\n News in Science - That monkey can read your mind - 08/03/2005\n \n Parrot\n Edge: \"THAT DAMN BIRD\"\n \n There is plenty of science and spend some time with animals and you will see they are aware of much more than they are given credit for.\n \n So about morality for animals?\n \n \n \nHe exists in a state of individuality.\n\n \n He is an indivdual and so is every other living thing on the planet. Does all life therefore have the same rights as man because he is an individual?\n \n And again individual is not a state of being and this falls apart as soon as he finds another person.\n \n \nAgain, your example traded the liberty of the slave for the master, but someone still had to choose to do something for anyone to live.\n\n \n Why do some people have slaves? Why do some people accept human people as payment of debt? Why do some people sell themselves into bondage? Why do most who are or have been slaves not commit suicide? Because liberty is not the primary nature of man, living is and man regardless of why he has to make the choice will choose life over liberty.\n \n \nYou can hear people, you can touch people, you can smell people the rest is not PG.\n\n \n People are not morality. You are in effect saying that morality is dependent on people to exist or can you give an example of morality that needs nothing else in order to be?\n \n \nThe same is true of morality.\n\n \n No it isn't. Weather happened before man a chair will be a chair if every living thing on the planet died. The concept man has of both will no longer exist but each will continue being. Morality will not.\n \n \ni.e. imaginary. No it does has a physical existance just as real as other advanced concepts.\n\n \n No I didn't say imaginary. I am not saying morality is make believe or doesn't exist. \n \n Examples would be?", 
   {}, 
   409409, 
   null, 
   1281321840.0
  ], 
  [
   409529, 
   null, 
   "Freedom", 
   "Ok then we for the sake of argument say that bias effects morality and therefore it cannot be objective.\n\n Given that premise it cannot be objective.\n \n \nWhy?\n\n That's as good as it's going to get with composite concepts like morality and weather, and gravity, all the other field forces, government, corporations, the list goes on.\n \n \ncertain actions are attributed to being moral but can be described by other terms as well. Integrity, compassion or honor as examples.\n\n Irrelevant.\n \n \nOnly what it creates. It does not create weather or a chair and has no influence on them. The mind can't make rain nor can it change a rocking chair into a high chair but it can change moral to immoral.\n\n I know that is not true. A mind cannot change a fact because it wants to.\n \n \n \n \nYou don't seem to get that all the experiences of your life contribute to how you perceive everything.\n\n What you don't seem to get is that logic is not affected by emotion or anything but facts (premises).\n \n You may be unable to distinguish the difference between a baseless emotional reaction to something because of your childhood and a rational conclusion but I am.\n \n \nWhat you conclude as rational is based on everything that you have seen, read, touched, learned, heard, smelled and tasted.\n\n On the facts that I have accumulated yes. Logic takes facts and produces more facts.\n \n \nNo I could be saying that morality is not objective\n\n While insolently ignoring my derivation I suppose.\n \n \n \n-noun\n 9.\n the moral teaching or practical lesson contained in a fable, tale, experience, etc.\n 10.\n the embodiment or type of something.\n 11.\n morals, principles or habits with respect to right or wrong conduct.\n \n Where am I off?\n\n Well there are 8 more definitions, but if that is the definition of morality you are using you must admit I am talking about is morality.\n \n \nWhat makes something objective?\n\n 5. not influenced by personal feelings, interpretations, or prejudice; based on facts; unbiased: an objective opinion. \n 6. intent upon or dealing with things external to the mind rather than with thoughts or feelings, as a person or a book. \n 7. being the object of perception or thought; belonging to the object of thought rather than to the thinking subject ( opposed to subjective). \n 8. of or pertaining to something that can be known, or to something that is an object or a part of an object; existing independent of thought or an observer as part of reality. \n \n \nIndividual is not a state of being, but if it was you make the assumption that there is anything that applies to man outside of his being an individual. That once he becomes part of something like society he is no longer completely in that state. He must choose which state will he be in and by which will he have a duty to. \n \n Another thing to consider if individual is a state of being morality is meaningless. There is him and that is it the concept and action you believe are representative of morality only have purpose when he leaves the state of individual\n\n I did not see any evidence presented.\n \n \n \nAdd and s don't add a new set of conditions to make the conclusion valid.\n\n There were no new conditions.\n \n \n \nI thought is was a good example for your question. What have I presumed true?\n\n (if)\"You can think of an example in which the premises of social behavior of one person logically contradict the possible interactions he/she may have.\"\n \n This means an example with two or more people, their premises, and a contradiction between any one persons interactions and their premises.\n \n \nYou could answer anyway.\n\n \"If we keep misunderstanding what morality is or the logic necessary to do so how can we be sure it is right this time?\"\n \n We can know because the mistakes were not the consequent of correctly postulated ethical theory.\n \n \nEvery one of your responses assumes that there is never a logical reason. Assume there was would your response be the same?\n\n Yes it would be different. You must realize though that logic is universal. If there was a logical reason there is no reason to include the number of people who think there is.\n \n \nAs I stated earlier your logic is biased. Not intentionally so, but still biased.\n\n Logic cannot be biased.\n \n It can be correct or incorrect.\n \n If you wish to say my logic is incorrect because I have allowed emotional bias to cause me to ignore non- sequiturs I disagree.\n \n \nLaw is law morality is morality. A tree is not disguised as a chair and fog is not weather disguised as water vapor.\n \n That is true. (I love these ones that are easy to agree to).\n \n \nWhy does law change if it is objective morality incognito?\n\n Law is: the principles and regulations established in a community by some authority and applicable to its people, whether in the form of legislation or of custom and policies recognized and enforced by judicial decision.\n \n and will remain so.\n \n There is the definite connection in nearly every society that it is wrong to break the law and right to follow it.\n \n That directly relates law to morality.\n \n Without this correlation the only reason to follow any law is the military force backing it.\n \n Clearly although every society worth mention has had military force to back up its laws the vast majority of its members follow the laws because they believe it's the right thing to do, i.e. they don't break the laws even when they would be willing to take the risk.\n \n \nThere is plenty of science and spend some time with animals and you will see they are aware of much more than they are given credit for.\n \n So about morality for animals?\n\n I said reason not awareness, and not the ability to solve puzzles and act creatively is not reason.\n \n \n \nHe is an indivdual and so is every other living thing on the planet. Does all life therefore have the same rights as man because he is an individual?\n\n Only creatures which can have the concept of morality. Which is: only creatures who can reason.\n \n \nAnd again individual is not a state of being and this falls apart as soon as he finds another person.\n\n No I am on a planet of 6 billion and I am still an individual. Perhaps you mistook the word individual with alone?\n \n \n \nWhy do some people have slaves?\n\n The reasons a too various to state, in general they wish to have work done for them without consensual trade for it.\n \n \nWhy do some people accept human people as payment of debt?\n\n Some people believe other people can be property.\n \n \nWhy do some people sell themselves into bondage?\n\n They are really desperate for money :)\n \n \nWhy do most who are or have been slaves not commit suicide?\n\n Either they fear death or love life.\n \nBecause liberty is not the primary nature of man\n\n That does not follow.\n \n \nPeople are not morality. \n\n And the sky is not weather.\n \n \nYou are in effect saying that morality is dependent on people to exist\n\n Yes I said that already.\n \n \nNo it isn't. Weather happened before man\n\n Yet not before atmospheres.\n \n \na chair will be a chair if every living thing on the planet died.\n\n Yet a chair would not exist without man, man in fact creates it. Does that mean a chair is whatever he wants it to be?\n \n \nMorality will not.\n\n Because morality is a set of laws acting on people without any body to act on any physical law could be said not to exist.\n \n \nNo I didn't say imaginary. I am not saying morality is make believe or doesn't exist. \n\n I am saying that \"has no physical existence only conceptual.\" fits the definition of imaginary IMO.\n \n \nExamples would be?\n\n Of advanced concepts with physical existence? Was weather not an accurate one?\n \n You may attack this same wall from a thousand different directions but the only thing you may find are various semantic differences.\n \n You have said you don't make progress with me and that is true, I don't know how you have won previous arguments but I will not be worn down and I will not get lost in these mazes.", 
   {
    "unicode_changes_made": true
   }, 
   409518, 
   null, 
   1281328680.0
  ], 
  [
   409679, 
   null, 
   "pappillion001", 
   " your position\n\n \n So let's summarize\n \n 1) Only living beings that have a sufficient ability to reason can know morality\n 2) Man is the only known being with sufficient ability to reason to know morality\n 3) Morality has no physical properties except those actions man performs that you attribute to morality\n \n Even though morality can only be known by a mind capable of higher reasoning function and physically exists only by direct action of the mind it is completely independent of the mind which has no influence on it whatsoever.\n \n 1) The idea of objective morality is based on the natural state of man being an individual\n 2) From there the most logical value is liberty\n 3) The ideal society will be one where objective morality is universally accepted and personal liberty is the value which law is established\n \n The natural state of man as an individual has no need for morality. It has no worth until he is in his other natural state a social being. Even though man desires to be social more than he desires being an individual only the state of individual has been considered. From the beginning of recorded history man has willingly given up a portion of his liberty for social interaction. The entire span of mankind has valued survival and the benefits of society over liberty. \n \n \nWhat you don't seem to get is that logic is not affected by emotion or anything but facts (premises).\n \n You may be unable to distinguish the difference between a baseless emotional reaction to something because of your childhood and a rational conclusion but I am.\n\n \n If other factors did not influence the conclusions of people we would all arrive at the same conclusions. Differences in culture, values and society would not have as many distinctions as they do over history. Your entire perception and the way you process information is influenced by outside factors. Science tries to remove that influence and so does logic, but when parts of the problem and conclusion rely on judgment or preference as in this case you have to make adjustments.\n \n \nWell there are 8 more definitions, but if that is the definition of morality you are using you must admit I am talking about is morality.\n\n \n If you notice that may be the 9th definition, but the first in which it is used as a noun\n \n \n \nThere were no new conditions.\n\n \n (A) says that a chair exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an object\n which fits the definition of a chair.\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and actions which fit the definition of morality. \n \n This isn't a problem with expressing yourself using English, the conclusion must be the same to be valid. It doesn't matter what you replace chair with it won't work grammatically because it doesn't work logically. \n \n \nLaw is: the principles and regulations established in a community by some authority and applicable to its people, whether in the form of legislation or of custom and policies recognized and enforced by judicial decision.\n \n and will remain so.\n \n There is the definite connection in nearly every society that it is wrong to break the law and right to follow it.\n \n That directly relates law to morality.\n \n Without this correlation the only reason to follow any law is the military force backing it.\n \n Clearly although every society worth mention has had military force to back up its laws the vast majority of its members follow the laws because they believe it's the right thing to do, i.e. they don't break the laws even when they would be willing to take the risk.\n\n \n That definition establishes law based custom and community, the reason it is different from one country to the next. The choice to accept law as can just as easily be shown to be the result of the benefits both real and perceived that law causes. There is no definitive connection between accepting law as good and objective morality. Benefit also makes military might unnecessary.\n \n \nOf advanced concepts with physical existence? Was weather not an accurate one?\n \n You may attack this same wall from a thousand different directions but the only thing you may find are various semantic differences.\n \n You have said you don't make progress with me and that is true, I don't know how you have won previous arguments but I will not be worn down and I will not get lost in these mazes.\n\n \n Weather specific or a generalization it has physical properties. \n \n That seems to be an emotional position and not a logical one.", 
   {
    "unicode_changes_made": true
   }, 
   409529, 
   null, 
   1281477660.0
  ], 
  [
   409692, 
   null, 
   "Freedom", 
   "So let&#8217;s summarize\n \n 1) Only living beings that have a sufficient ability to reason can know morality\n 2) Man is the only known being with sufficient ability to reason to know morality\n 3) Morality has no physical properties except those actions man performs that you attribute to morality\n \n Even though morality can only be known by a mind capable of higher reasoning function and physically exists only by direct action of the mind it is completely independent of the mind which has no influence on it whatsoever.\n \n 1) The idea of objective morality is based on the natural state of man being an individual\n 2) From there the most logical value is liberty\n 3) The ideal society will be one where objective morality is universally accepted and personal liberty is the value which law is established\n\n An adequate summary except for 'it is completely independent of the mind which has no influence on it whatsoever.' It is completly independent of desire (I have been using the word whim to be action motivated solely by illogical or alogical desire), and objective morality will never be universally accepted.\n \n \nThe natural state of man as an individual has no need for morality.\n\n No need for social morality. I have already defined the difference so please don't waste my time by asking again.\n \n \nIt has no worth until he is in his other natural state a social being.\n\n He never leaves his natural state, it is the fallacy that says he stop being an individual in society that confuses men into believing morality is altered by society.\n \n \nIf other factors did not influence the conclusions of people we would all arrive at the same conclusions. Differences in culture, values and society would not have as many distinctions as they do over history. Your entire perception and the way you process information is influenced by outside factors. Science tries to remove that influence and so does logic, but when parts of the problem and conclusion rely on judgment or preference as in this case you have to make adjustments.\n\n No adjustments are needed;logic is the only factor in deriving morality, even if illogic, emotion, culture, ect.. are certainly factors in failing to derive it.\n \n \nIf you notice that may be the 9th definition, but the first in which it is used as a noun\n\n morality is a noun, perhaps those were the definitions of moral?\n \n \n(A) says that a chair exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an object\n which fits the definition of a chair.\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and actions which fit the definition of morality. \n \n This isn&#8217;t a problem with expressing yourself using English, the conclusion must be the same to be valid. It doesn&#8217;t matter what you replace chair with it won&#8217;t work grammatically because it doesn&#8217;t work logically. \n\n The concept of chair doesn't have actions in it, morality is an advanced concept and does, this isn't a problem with English but with logic you are correct, your idea of logic if you think adding actions matters to the point. here read this one:\n \n (A) says that weather exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an objects and interactions which fit the definition of weather .\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and interactions which fit the definition of morality. \n \n I just replaced chair with weather, they are grammatically identical. Am I to understand weather is subjective?\n \n \nThat definition establishes law based custom and community, the reason it is different from one country to the next. The choice to accept law as can just as easily be shown to be the result of the benefits both real and perceived that law causes. There is no definitive connection between accepting law as good and objective morality. Benefit also makes military might unnecessary.\n\n Common law is not applicable to those who gain benefit from it.\n \n You can't say that a murderer is gaining benefit from being imprisoned for life, it's the other people.\n \n To say the other people are gaining benefit from having him removed is true, but that is the law applying to him not to them.\n \n From their position the only benefit for them personally following the law is not getting thrown in prison (still).\n \n I will now ask you a question, if you really wanted to why wouldn't you kill someone?\n \n \nWeather specific or a generalization it has physical properties. \n\n As does morality. (a person is physical)\n \n \nThat seems to be an emotional position and not a logical one.\n\n I was merely warning you that I have not seen any new logic come from you for a while, you stopped trying new things after you accused me of hypocrisy.", 
   {}, 
   409679, 
   null, 
   1281481440.0
  ], 
  [
   409911, 
   null, 
   "pappillion001", 
   "An adequate summary, objective morality will never be universally accepted though.\n\n \n It would have a better chance if it existed someplace other tan the mind\n \n \nNo need for social morality. I have already defined the difference so please don't waste my time by asking again.\n\n \n We are talking about social interactions by a being whose dominate nature is social and you insist social morality is unnecessary because individual morality is sufficient. There is a need for both, but if you have to be rid of one, social morality will move civilization forward and is better suited to address concerns of the individual and the collective. Individual morality is stuck at 1.\n \n \nHe never leaves his natural state, it is the fallacy that says he stop being an individual in society that confuses men into believing morality is altered by society.\n\n \n Man willingly will give up a portion of his individual state in trade to a social state. He at best can be thought of as being in both, but you insist he must be an individual giving no consideration to his social state. You may say he begins as an individual and regardless of his social state remains so, but the reverse is also possible the very creation of man is not from a unique source, but two and the pattern of life is not one of individual as one or individual as self. \n \n His instinct is to congregate man is a pack animal and ignoring that fact leads to assumptions\n \n \nNo adjustments are needed;logic is the only factor in deriving morality, even if illogic, emotion, culture, ect.. are certainly factors in failing to derive it.\n\n \n Problem is you have only what outside influences shape your views on what is good and what isn't. As with my example 1000 - 2000 years ago people understood the idea of morality and what was moral then is not now. Because culture and society were factors in deciding good and bad in their attempts to understand morality. You say man has a right to his life and his property because of this, that and the other thing which are based on observations and reactions to circumstances which are collected and analyzed and then one person says I think that x is preferred to y and groups then say yes and others say no and some say maybe, but in the end it comes down to I think x is better than y. Marrying a 14 year old girl 2500 years ago was moral and necessary and today is immoral and unnecessary. She is better off doing so today than she was then, the anatomy is the same the change is cultural and at the society level.\n \n \n \nThe concept of chair doesn't have actions in it, morality is an advanced concept and does, this isn't a problem with English but with logic you are correct, your idea of logic if you think adding actions matters to the point. here read this one:\n \n (A) says that weather exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive an objects and interactions which fit the definition of weather .\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and interactions which fit the definition of morality. \n \n I just replaced chair with weather, they are grammatically identical. Am I to understand weather is subjective?\n\n \n (A) says that morality exists.\n (B) asks why that isn't just his opinion.\n (A) points to the fact that all senses available to A and B perceive the objects and interactions which fit the definition of morality. \n (B) points out that the existence of morality is not being questioned, it being objective and existing outside any construct of the mind.\n (B) also points to the fact that all senses available to A and B do not perceive the objects and interactions which fit the definition of objective morality or being independent of the mind. \n \n \n (B) Also notes that A asserts animals have no morality because they do not possess sufficient ability to understand the concept. This should only effect their understanding not the observable actions that result. They don't understand gravity, but remain attached to the planet surface. If morality is objective it should be present regardless of if it is understood. \n \n This way of thinking also places morality within the control of the mind. Unless the mind can understand it it does not effect the being.\n \n \n \nCommon law is not applicable to those who gain benefit from it.\n\n \n I see so law is only applicable to those who gain nothing from it. The benefits can't include order and stability an environment conducive to a longer more productive and fulfilling life?\n \n \nYou can't say that a murderer is gaining benefit from being imprisoned for life, it's the other people.\n\n \n Well good, being incarcerated for life isn't intended to benefit him, but he does benefit that he remains alive. He in turn is not murdered.\n \n \nTo say the other people are gaining benefit from having him removed is true, but that is the law applying to him not to them.\n\n \n This is the law benefiting the common. He is being punished as enforcement of the law\n \n From their position the only benefit for them personally following the law is not getting thrown in prison (still).[/QUOTE]\n \n Which would suggest that law has no value or beneficial qualities except for keeping one from being incarcerated, which would require breaking the law, which then would be applicable because it no longer benefits someone even though it seems it didn't before. I don't know how you hold on to this.\n \n I think your missing a piece of your puzzle on this one\n \n \nAs does morality. (a person is physical)\n\n \n A person is not morality. The actions that a person does are not proof of it's objectivity. What other advanced concept needs the mind to exist, not be understood but exist?\n \n \n \nI was merely warning you that I have not seen any new logic come from you for a while, you stopped trying new things after you accused me of hypocrisy.\n\n \n I did warn you.", 
   {}, 
   409692, 
   null, 
   1281741420.0
  ], 
  [
   410196, 
   null, 
   "Freedom", 
   "We are talking about social interactions by a being whose dominate nature is social and you insist social morality is unnecessary because individual morality is sufficient. There is a need for both, but if you have to be rid of one, social morality will move civilization forward and is better suited to address concerns of the individual and the collective. Individual morality is stuck at 1.\n\n You have not read what I wrote else you are intentionally reversing the meanings of terms I have used.\n \n \nMan willingly will give up a portion of his individual state in trade to a social state. He at best can be thought of as being in both, but you insist he must be an individual giving no consideration to his social state. You may say he begins as an individual and regardless of his social state remains so, but the reverse is also possible the very creation of man is not from a unique source, but two and the pattern of life is not one of individual as one or individual as self. \n\n I see no relevance in these statements.\n \n \nProblem is you have only what outside influences shape your views on what is good and what isn't.\n\n Only if you consider logic an outside influence.\n \n \nThis way of thinking also places morality within the control of the mind. Unless the mind can understand it it does not effect the being.\n\n All humans can understand morality.\n \n \nI see so law is only applicable to those who gain nothing from it.\n\n No I meant to say common law is not applicable to those who gain a net benefit from it.\n \n \nA person is not morality.\n\n A cloud is not weather.\n \n It was not claimed he/she is.\n \n \nWhat other advanced concept needs the mind to exist, not be understood but exist?\n\n Self-awareness or the concept of a mind or soul for one.\n \n Other than that I can think of none. (assuming you meant rational mind i.e. not including animals).\n \n You may have noticed that my answers are less comprehensive and I have responded to far less in this post.\n \n It seems to me you are not interested in debate (yes you did warn me) and so I no longer see the purpose in steering you back on subject.\n \n i.e. I will ignore irrelevant posting.", 
   {}, 
   409911, 
   null, 
   1282268760.0
  ], 
  [
   431989, 
   null, 
   "Sigma", 
   "Anyone who has values has two things, a axiomatic value (a value that is based on no other values) and personal judgment.\n\n \n The transmission of human behavior and even ways of thinking instead seems, in part at least, heritable. A blanket statement that our values are based upon something nebulous seems premature as a premise.\n \n \nAnyone who has personal judgment on what is good or not and what is true or not implies that it is good and proper for him to make decisions and choose values. The only way for this person to remain logically consistent is to cede that it is good and proper for others to make decisions and choose values.\n\n \n Why is this necessarily so? If I don't assign value to others as I do myself, then what is good and proper for me does not need to be good and proper for others.\n \n \nAnyone who seeks to remove choice and judgments from another has only one route to take: force. Therefore the only objectively bad or improper in human interaction is this precise situation: One human uses force to take away the personal judgment of another, to take away their power to choose what they value and what they will do.\n\n \n This seems a conclusion instead of a premise. You seem to be saying, essentially, \"Taking away other's right to choose is bad because they have to use force\". You didn't establish that force was a bad thing. One of the givens should be to establish that fact so that your conclusion follows. \n \n If the bad thing is taking away choice, then what is the point of including the fact they used force? It would be bad using any other method as well, wouldn't it? Or are you simply defining any method of taking away choice as force?\n \n You've also stated that at least some of our values are not chosen and all others are based upon those. So we never choose our values in the first place.\n \n \nMan has natural rights proceeding from his nature (see above) that can be stated most abstractly as a right to liberty from unwanted interaction/interference by others\n\n \n What nature? I didn't see any givens referring to \"man's nature\". How do we have a right to liberty from this nature?\n \n \nIn the social sphere that which is good (moral) can be objectively defined by the rights of each individual, that the integration of this concept from the individual to the collective can produce a universal concept of morality consistent with historical observations and general emotional reactions.\n\n \n You seem to be saying that if the community as a whole respects the right of liberty of each individual, which you've defined as moral, then... something. I'd need clarification on: \"universal concept of morality consistent with historical observations and general emotional reactions\". Are you saying that general emotional reactions are consistent with a universal moral code?\n \n \nAnyone who takes the standard of good to be human life and all that entails have no logical alternative but to conclude that the best society is the one that comes closest to the ideal; which is the violation of no rights; which is to say every human social interaction is voluntary.\n\n \n Just the opposite, in fact. Preservation of human life is not served well by universal liberty. Violating the rights of some, or even all, better serves the purpose of preserving human life since the prohibition can be enforced upon 'immoral' people.\n \n This society does not seem to take into account those who try to cheat the system. They would be labeled 'immoral', but it would destroy any ideal of any interaction being voluntary, which would naturally force an immoral reaction from other members of society trying to preserve their rights. The system would destroy itself.", 
   {}, 
   407234, 
   null, 
   1307778060.0
  ], 
  [
   431992, 
   null, 
   "Freedom", 
   "The transmission of human behavior and even ways of thinking instead seems, in part at least, heritable. A blanket statement that our values are based upon something nebulous seems premature as a premise.\n\n What did I say they were based on? (not that I don't have the answer)\n \n \nWhy is this necessarily so? If I don't assign value to others as I do myself, then what is good and proper for me does not need to be good and proper for others.\n\n It is not about valuing yourself or others it is about recognizing the empirical fact that other humans are the same type of creature you are. They may not share your values but you must apply your own values consistently. It is an act of intentional ignorance to pretend others don't have personal judgement or values.\n \n \nThis seems a conclusion instead of a premise.\n\n A statement can be both, this is supported by the previous statements.\n \n \nYou seem to be saying, essentially, \"Taking away other's right to choose is bad because they have to use force\".\n\n No, I said it is bad and force must be used. The bad is a universal negative value, universal because it applies to all humans with values and personal judgement (that's all of them pretty much) bad because of individual but identical value judgements.\n \n \nYou didn't establish that force was a bad thing.\n\n That is the purpose of this premise.\n \n \nIf the bad thing is taking away choice, then what is the point of including the fact they used force?\n\n Identification of the phenomenon which marks the evil for future use in the argument.\n \n \nIt would be bad using any other method as well, wouldn't it? Or are you simply defining any method of taking away choice as force?\n\n Well, this part is a little weak. Strictly speaking there are two methods, physical violence/force and fraud. There are some who would argue fraud is simply the psychological form of violence but you are correct, based on their common link to this premise of removing the judgement/choice of others.\n \n \nYou've also stated that at least some of our values are not chosen and all others are based upon those. So we never choose our values in the first place.\n\n Choice itself requires some values. Saying that is a removal of choice is like saying since we didn't choose the nature of the universe it was taken from us. You cannot lose what you never had, it is judgement and ones own actions that are the crucial values in this derivation. Objectivist hold that a man has to choose every single value he holds with the reservation that a complete absence of values is only possible with severe biological damage to the brain.\n \n \nWhat nature? I didn't see any givens referring to \"man's nature\".\n\n You don't have much power of interpolation do you? The nature of something is basically fundamental and inalienable properties it holds. This premise is meant to recognize and name the application of the force principle from before in the abstract.\n \n \nHow do we have a right to liberty from this nature?\n\n It is saying that is what liberty means, the right(i.e. morally right because it is an objective value) to ones own judgement in action in any practical use means exemption from their removal by others.\n \n \nYou seem to be saying that if the community as a whole respects the right of liberty of each individual, which you've defined as \n moral, then... something.\n\n That's a little self-projecting don't you think? I never said community as a whole, the majority or even particular opinions are not factors in this derivation.\n \n I have derived liberty as moral, the definition of moral is as easily looked up by me as you, and you will see it's terms are in my derivation. I admit if moral wasn't defined as it is I would not have derived morality, but as you say 'defined' you obviously mean arbitrarily and subjectivity asserted that it is A, B, and C. If however I can satisfy the definition of the word then I have derived it and not merely redefined it with my opinion.\n \n \nI'd need clarification on: \"universal concept of morality consistent with historical observations and general emotional reactions\". Are you saying that general emotional reactions are consistent with a universal moral code?\n\n That is correct. The natural human mental pattern is to choose values, and for those values to then generate emotional reactions. I could destroy a coat hanger or I could destroy your wife, only your values 'tell' you which one should enrage you.\n \n So if there is a universal value, it should produce an similar emotional response in everyone. (that is causes and quality not scale)\n \n This was merely a note of support based on a useful observation. It does not mean morality comes from emotion.\n \n \nJust the opposite, in fact. Preservation of human life is not served well by universal liberty. Violating the rights of some, or even all, better serves the purpose of preserving human life since the prohibition can be enforced upon 'immoral' people.\n\n Only someone who didn't understand pretty much anything before that statement could offer this as an objection.\n \n The human life phrase was to cover a loophole, A man must still hold his his (and therefore others) ability judge and act as a value but he could hate humans with fevor desire the non-ideal for man and the ideal for anti-man. This is not a failure of logic if he understands what things are and where he stands. Therefore in order to say he must accept a particular thing I had to add that. I don't see this as a problem because such an anomaly as a man who understands what if evil for his own nature and still chooses it I have never heard. Always it is a mistake, shielded by fallacy when people do this.\n \n No human life requires the violation of rights and I invite you to support your statements.\n \n \nThis society does not seem to take into account those who try to cheat the system.\n\n As the system is defined there is only one cheat, involuntary human interaction.\n \n \nThey would be labeled 'immoral', but it would destroy any ideal of any interaction being voluntary\n\n Why? Do you think throwing a criminal in jail is taking away their rights? They took away their own rights. Others can treat them on their own premises and it's their fault if they were derived incorrectly resulting in a life that is not proper to a human being.\n \n \nwhich would naturally force an immoral reaction from other members of society trying to preserve their rights. \n\n It is not immoral to stop someone who is or has violated rights. The instant they irrationally forget to consistently apply the universal value the reasoning which applies it to them breaks down because considering only the instance there is no evidence of value in the offender.\n \nThe system would destroy itself\n\n As opposed to one based on mobs of subjective opinions which scoff at philosophy and wonder why the world's society disgusts them?", 
   {}, 
   431989, 
   null, 
   1307783040.0
  ], 
  [
   432006, 
   null, 
   "Sigma", 
   "What did I say they were based on? (not that I don't have the answer)\n\n \n You didn't say they were based upon anything, which is why I said it was nebulous.\n \n \nIt is not about valuing yourself or others it is about recognizing the empirical fact that other humans are the same type of creature you are. They may not share your values but you must apply your own values consistently. It is an act of intentional ignorance to pretend others don't have personal judgement or values.\n\n \n I don't accept that. I cannot peer into the minds of others to verify they truly are creatures like myself (in that they have values or judgement), and further even if I accepted that they are creatures similar to myself that means they are merely similar to me while I am wholely myself. Empirically I can recognize that I have more in common with myself than with any other human therefore I can apply value to what is more like myself than those who are less like me.\n \n \nNo, I said it is bad and force must be used.\n\n \n You should rework this premise, then. The way it is worded implies that it is bad because force must be used.\n \n \nIdentification of the phenomenon which marks the evil for future use in the argument.\n\n \n By identifying the method, you've limited the premise to that method. To give it broader application this should be omitted.\n \n \nChoice itself requires some values. Saying that is a removal of choice is like saying since we didn't choose the nature of the universe it was taken from us. You cannot lose what you never had, it is judgement and ones own actions that are the crucial values in this derivation. Objectivist hold that a man has to choose every single value he holds with the reservation that a complete absence of values is only possible with severe biological damage to the brain.\n\n \n This seems incoherent. You cannot lose choice because you never had choice in your values since they stem, mechanically, from unchosen values. We did not choose our initial values because choice, itself, requires values. A premise about the removal of choice implies a contradiction, since we do not have choice.\n \n \nYou don't have much power of interpolation do you? The nature of something is basically fundamental and inalienable properties it holds. This premise is meant to recognize and name the application of the force principle from before in the abstract.\n\n \n A premise is meant to be explicit. You say \"see above\" without any precision. This premise should be restated to explicitly describe \"man's nature\", not simply a vague reference to a previous point.\n \n \nIt is saying that is what liberty means, the right(i.e. morally right because it is an objective value) to ones own judgement in action in any practical use means exemption from their removal by others.\n\n \n I am not asking what the right is, though it is good to include that, but how it is derived from \"man's nature\", which itself was undefined.\n \n \nThat's a little self-projecting don't you think? I never said community as a whole, the majority or even particular opinions are not factors in this derivation.\n [...]\n If however I can satisfy the definition of the word then I have derived it and not merely redefined it with my opinion\n\n \n You said: that which is good (moral) can be objectively defined by the rights of each individual. \n \n You've equated what is 'good' with respecting the rights of each individual. You've defined what is moral for the purpose of your argument. You're supposed to do that. You also have to define \"the social sphere\" and \"the collective\" a bit more explicitly. I assumed you meant people collectively in a social setting, which would be a community.\n \n \nThat is correct. The natural human mental pattern is to choose values, and for those values to then generate emotional reactions. I could destroy a coat hanger or I could destroy your wife, only your values 'tell' you which one should enrage you.\n \n So if there is a universal value, it should produce an similar emotional response in everyone. (that is causes and quality not scale)\n \n This was merely a note of support based on a useful observation. It does not mean morality comes from emotion.\n\n \n You've already disallowed choice in the realm of values until you clear up the apparent contradiction earlier in the post. However, you've opened the possibility of morality being caused by emotion instead of the other way around.\n \n \n\n No human life requires the violation of rights and I invite you to support your statements.\n \n As the system is defined there is only one cheat, involuntary human interaction.\n \n Why? Do you think throwing a criminal in jail is taking away their rights? They took away their own rights. Others can treat them on their own premises and it's their fault if they were derived incorrectly resulting in a life that is not proper to a human being.\n \n It is not immoral to stop someone who is or has violated rights. The instant they irrationally forget to consistently apply the universal value the reasoning which applies it to them breaks down because considering only the instance there is no evidence of value in the offender.\n\n \n You have not established situations where using force to take away choice can be moral or not immoral. Here you have arbitrarily defined incarceration as voluntary or, at least, not involuntary. \n \n I'm not sure how you are separating \"human life is good\" from \"preserving human life is good\". Clarification?\n \n \nAs opposed to one based on mobs of subjective opinions which scoff at philosophy and wonder why the world's society disgusts them?\n\n \n That does not make your 'ideal society' any more viable. As you say, involuntary social interaction is a cheat of your system, which opens it up to cheaters on a massive scale. On a practical level conflict over resources would have the result of involuntary social interaction. As a simplistic example, children fighting over something require the parent to separate the two and enforce a result. This is involuntary on the part of both parties, unless 'under threat of force' is a voluntary result.", 
   {}, 
   431992, 
   null, 
   1307812680.0
  ], 
  [
   432034, 
   null, 
   "Freedom", 
   "You didn't say they were based upon anything, which is why I said it was nebulous.\n\n Yea, this is where that empirical observation that you claimed couldn't support objective morality comes in. It is verifiable by experiment that humans have values.\n \n \nI don't accept that. I cannot peer into the minds of others to verify they truly are creatures like myself (in that they have values or judgement), \n\n This is what I mean when someone must be irrational to reject it. This 'unsupportable' experiment is called communication. I of course overlooked that we are all illusions so of course no knowledge of man is possible by observation :p\n \n \nand further even if I accepted that they are creatures similar to myself that means they are merely similar to me while I am wholely myself. Empirically I can recognize that I have more in common with myself than with any other human therefore I can apply value to what is more like myself than those who are less like me.\n\n You certainly can if you hold yourself to be the highest value (this is healthy). This derivation only uses one value, one common to all humans contradicted only in the degree of a man's unreason.\n \n \nYou should rework this premise, then. The way it is worded implies that it is bad because force must be used.\n\n No it doesn't, clearly from the fact that the connection between choice and force is first, before the conclusion that force is bad that is the direction of reasoning.\n \n \nYou cannot lose choice because you never had choice in your values since they stem, mechanically, from unchosen values. We did not choose our initial values because choice, itself, requires values. A premise about the removal of choice implies a contradiction, since we do not have choice.\n \n\n Of course you can, the only value which must exist for choice is the value of your own judgement. That doesn't mean you don't choose the rest.\n \n \nI am not asking what the right is, though it is good to include that, but how it is derived from \"man's nature\", which itself was undefined.\n\n The purpose of the previous premises was to identify a universal and therefore natural property of man a value of his own judgement. The right part comes from the integration of individual good (a value) to collective good (a moral principle, or what objectivist would call a social moral).\n \n \nYou've equated what is 'good' with respecting the rights of each individual.\n\n I've concluded.\n \n \nYou've defined what is moral for the purpose of your argument.\n\n Moral had a definition before this argument I am demonstrating that I can satisfy it using reason as opposed to say emotion, whim, or opinion.\n \n \nYou also have to define \"the social sphere\" and \"the collective\" a bit more explicitly.\n\n Social sphere is the intersection (of what particularly is specified) of the individuals in a collective. A collective is an array or group of human beings.\n \n \n \nYou've already disallowed choice in the realm of values until you clear up the apparent contradiction earlier in the post.\n\n I referenced the conditions of the pre-choice conditions in a premise.\n \n \nHowever, you've opened the possibility of morality being caused by emotion instead of the other way around.\n\n No I haven't.\n \n \nYou have not established situations where using force to take away choice can be moral or not immoral. \n\n There are none.\n \n \nHere you have arbitrarily defined incarceration as voluntary or, at least, not involuntary. \n\n Defined it as their choice, voluntary has more to do with whether they recognize the choice they made.\n \n \nI'm not sure how you are separating \"human life is good\" from \"preserving human life is good\". Clarification?\n\n ?\n \n \nThat does not make your 'ideal society' any more viable. As you say, involuntary social interaction is a cheat of your system, which opens it up to cheaters on a massive scale.\n\n You mean crime. That is why some brilliant chap came up with the idea of a police force.\n \n \nOn a practical level conflict over resources would have the result of involuntary social interaction. As a simplistic example, children fighting over something require the parent to separate the two and enforce a result. This is involuntary on the part of both parties, unless 'under threat of force' is a voluntary result.\n\n I doubt the fight was voluntary either.\n \n You are merely trying to repackage the discredited (by me) idea that rights conflict with each other, they don't. Fights don't exist if everyone is respecting everyone else's rights. If you are talking about claiming natural resources that is simply something society will have to agree upon.", 
   {}, 
   432006, 
   null, 
   1307829540.0
  ], 
  [
   432064, 
   null, 
   "Sigma", 
   "Yea, this is where that empirical observation that you claimed couldn't support objective morality comes in. It is verifiable by experiment that humans have values.\n \n This is what I mean when someone must be irrational to reject it. This 'unsupportable' experiment is called communication. I of course overlooked that we are all illusions so of course no knowledge of man is possible by observation :p\n\n \n Illusions, robots, zombies or liars. You have made an assumption in your formulation that is unproven: it is called the theory of other minds. \n \n You cannot directly observe 'values', so your claim that empirical observation has verified they exist is false. Further, your reply did not answer my question: What are your 'first values' based upon? You have left the issue nebulous.\n \n \nYou certainly can if you hold yourself to be the highest value (this is healthy). This derivation only uses one value, one common to all humans contradicted only in the degree of a man's unreason.\n\n \n Yes, I was using your value of holding creatures similar to myself as equal to myself. \n \n To apply my values consistently I do not need to respect that others have values and judgement. Since it is empirical fact that I am the most similar to myself, then my immediate family then my extended family, my respect can have gradients based on how similar they are to me.\n \n \nOf course you can, the only value which must exist for choice is the value of your own judgement. That doesn't mean you don't choose the rest.\n\n \n Nuh uh, you made a distinction between value and judgement when you gave everyone two things, and you also made the implication that values are based on that value at the same time.\n \n Since that value cannot be chosen (since choice itself must be based on values), your formulation becomes a house of cards.\n \n \nThe purpose of the previous premises was to identify a universal and therefore natural property of man a value of his own judgement. The right part comes from the integration of individual good (a value) to collective good (a moral principle, or what objectivist would call a social moral).\n\n \n That purpose was not well served, I think. The connections are not (and should be) made between specific points. While the 'right to liberty from interference' can be a restatment of a portion of premise #5, there is no logical flow from other premises. To say nothing of the sudden inclusion of 'collective good' into the mix. \n \n \nI've concluded.\n \n Moral had a definition before this argument I am demonstrating that I can satisfy it using reason as opposed to say emotion, whim, or opinion.\n \n Social sphere is the intersection (of what particularly is specified) of the individuals in a collective. A collective is an array or group of human beings.\n\n \n What is moral can have several definitions. Your responsibility is to define it for the purpose of your argument :P\n \n So a collective is a group of people, and the social sphere is the 'intersection' of the individuals in that group. I assume that 'intersection' involves social interaction. A group of people that socialize is generally called a community. So your premise seems to be that what is moral, defined as the rights of individuals to be free from interference, when generalized to the community 'produces' a universal morality that is consistent with the general emotional response.\n \n \nNo I haven't.\n\n \n You've referenced a correlation between the general emotional reaction and the morality of the situation. The entire argument would work just as well whether premise #7 defines morality as universal or not since the general emotional reaction (which would make morality subjective) apparently is consistent with what you consider the universal morality to be.\n \n \nDefined it as their choice, voluntary has more to do with whether they recognize the choice they made.\n \n You mean crime. That is why some brilliant chap came up with the idea of a police force.\n\n \n Back to the practical level. Not just crime, no, but it is worth it to point out that you've defined incarceration as voluntary. \n \n Since in your argumentation 'involuntary' seems to mean 'not chosen' (with the curious exception of punishment), there are thousands times thousands of social interactions that are undesired and unchosen by people every day. These can be deliberate by cheaters in the system to benefit from those who won't interfere with them, while they interfere with others. This does not necessarily need to be on a legal level if morality is defined this way.\n \n \nI doubt the fight was voluntary either.\n \n You are merely trying to repackage the discredited (by me) idea that rights conflict with each other, they don't. Fights don't exist if everyone is respecting everyone else's rights. If you are talking about claiming natural resources that is simply something society will have to agree upon.\n\n \n Whether rights conflict is somewhat immaterial. My point is that people conflict. It is amusing to hear this out of someone championing pure capitalism since that economic system thrives on controlling and manipulating scarcity of resources for profit, not agreement on its distribution.\n \n In any case, however, your philosophy and the conflict between us is similar to the conflict between Rousseau's idea of the noble savage as man and Hobbes belief in human nature as brutish. If, as you believe, humans are naturally cooperative and noble then the leviathan is unnecessary. Indeed, forcing people to delineate private property for the state to recognize would create the very greed and belligerence it is designed to control. Your 'ideal society' would be our birthright. However, if people are naturally nasty then the best we can hope for is an uneasy truce enforced by police and military might.", 
   {}, 
   432034, 
   null, 
   1307848680.0
  ], 
  [
   432076, 
   null, 
   "Freedom", 
   "Illusions, robots, zombies or liars. You have made an assumption in your formulation that is unproven: it is called the theory of other minds. \n \n You cannot directly observe 'values', so your claim that empirical observation has verified they exist is false. Further, your reply did not answer my question: What are your 'first values' based upon? You have left the issue nebulous.\n\n Of course you can, the first value is life but it is irrelevant to this thread.\n \n \nTo apply my values consistently I do not need to respect that others have values and judgement.\n\n Yes you do.\n \n \nSince it is empirical fact that I am the most similar to myself, then my immediate family then my extended family, my respect can have gradients based on how similar they are to me.\n\n You betray that you think of similarity as genetic divergence. Justify that please.\n \n \nNuh uh, you made a distinction between value and judgement when you gave everyone two things, and you also made the implication that values are based on that value at the same time.\n\n Yes and? You must value your judgement if you choose values.\n \n \nSince that value cannot be chosen (since choice itself must be based on values), your formulation becomes a house of cards.\n\n Explain. If we say B is the set of all values a man can hold, and I say that unless B is null value j is in it. Further values can only be added with method J but method J must first create value j before any others. That hardly means J cannot create other values.\n \n \nWhat is moral can have several definitions. Your responsibility is to define it for the purpose of your argument :P\nof, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong; ethical: moral attitudes.\n \n \nSo a collective is a group of people, and the social sphere is the 'intersection' of the individuals in that group. I assume that 'intersection' involves social interaction. A group of people that socialize is generally called a community. So your premise seems to be that what is moral, defined as the rights of individuals to be free from interference, when generalized to the community 'produces' a universal morality that is consistent with the general emotional response.\n\n Uh, a community I think is a subset of collective, it implies the choice to work together as opposed to just existing in a context.\n \n \nYou've referenced a correlation between the general emotional reaction and the morality of the situation. The entire argument would work just as well whether premise #7 defines morality as universal or not since the general emotional reaction (which would make morality subjective) apparently is consistent with what you consider the universal morality to be.\n\n Some have tried, but an emotional reaction is only as rational as the thinking of the person it comes from. The fundamental problem with that is of course connecting good and evil to their reasoning, something which deriving morality would require given it's definition.\n \n \nbut it is worth it to point out that you've defined incarceration as voluntary. \n\n No, I haven't. I have said that it is the result of unreason in the criminal.\n \n \nSince in your argumentation 'involuntary' seems to mean 'not chosen' (with the curious exception of punishment), there are thousands times thousands of social interactions that are undesired and unchosen by people every day. These can be deliberate by cheaters in the system to benefit from those who won't interfere with them, while they interfere with others. This does not necessarily need to be on a legal level if morality is defined this way.\n\n Punishment is not excepted, it is involuntary. Rights do not extend to criminals because they have chosen to contradict the premises rights are based on. That is technically a choice but that doesn't mean a criminal will suddenly understand the correlation, to him it is not contradictory to expect his rights to be respected while he does not respect others. Therefore he may not volunteer to do whatever is necessary to prevent further offense.\n \n \nWhether rights conflict is somewhat immaterial. My point is that people conflict. \n\n I am refering to the idea that issues can arise in which an objective moral system would be 'confused' or unable to apply. If rights do not conflict there is no occasion in which to fight except the irrationality of the aggressor. If you are talking about people getting angry or jealous of others morality \"doesn't care\".\n \n \nIt is amusing to hear this out of someone championing pure capitalism since that economic system thrives on controlling and manipulating scarcity of resources for profit, not agreement on its distribution.\n\n Capitalism is in essence agreeing on how wealth is distributed. Not from some central imaginary social bank account but the individual transfers known as trades.\n \n \nIn any case, however, your philosophy and the conflict between us is similar to the conflict between Rousseau's idea of the noble savage as man and Hobbes belief in human nature as brutish.\n\n ....\n \n \nIf, as you believe, humans are naturally cooperative and noble then the leviathan is unnecessary. Indeed, forcing people to delineate private property for the state to recognize would create the very greed and belligerence it is designed to control. Your 'ideal society' would be our birthright. However, if people are naturally nasty then the best we can hope for is an uneasy truce enforced by police and military might.\n\n I believe humans are naturally cooperative and noble. That is not a factor in this derivation.", 
   {}, 
   432064, 
   null, 
   1307852400.0
  ], 
  [
   432087, 
   null, 
   "Sigma", 
   "I believe humans are naturally cooperative and noble. That is not a factor in this derivation.\n\n \n This vision of an ideal society is a natural consequence of that noble savage mindset. So of course it's a factor :P\n \n \nOf course you can, the first value is life but it is irrelevant to this thread.\n\n \n That is false. You can observe brain activity and circumstancially reach conclusions based upon that, but you cannot empirically prove thought.\n \n \nYes you do.\n\n \n That is false. It is a logically consistent position based on the lack of verification that others have values and judgement. \n \n \nYou betray that you think of similarity as genetic divergence. Justify that please.\n\n \n I betray that genetic similarity is a rational standard, certainly. The justification would be similar to yours for the same premise, since you seem to based the 'respect' on the basis that others are similar creatures to yourself. The standard of 'similarity' is the same, so the justification for that standard would be the same would it not?\n \n \nYes and? You must value your judgement if you choose values.\n\n \n Since value is based upon value, what value is that based upon? Or is that value chosen? You've erased the distinction between value and judgement at this point.\n \n \nExplain. If we say B is the set of all values a man can hold, and I say that unless B is null value j is in it. Further values can only be added with method J but method J must first create value j before any others. That hardly means J cannot create other values.\n\n \n Except method J cannot create value j before any others because you need value j to use method J.\n \n \nof, pertaining to, or concerned with the principles or rules of right conduct or the distinction between right and wrong; ethical: moral attitudes.\n\n \n That's not how you've used it: In the social sphere that which is good (moral) can be objectively defined[...]\n \n \nUh, a community I think is a subset of collective, it implies the choice to work together as opposed to just existing in a context.\n\n \n Work together? I don't think that's necessary. Social interaction in a context (geographical location, shared interest, etc).\n \n So it seems what is moral in the community is the generalized rights of the individuals, and this is consistent between your univseral morality and the general emotional response.\n \n \nSome have tried, but an emotional reaction is only as rational as the thinking of the person it comes from. The fundamental problem with that is of course connecting good and evil to their reasoning, something which deriving morality would require given it's definition.\n\n \n That isn't a problem, since you've already agreed that the general emotional reaction is consistent with rational morality (since apparently universal morality is rational).\n \n \nNo, I haven't. I have said that it is the result of unreason in the criminal.\n\n \n That would be irrelvent since you've said there is no situation where involuntary interaction is correct. You would not be able to justify involuntary incarceration in that case.\n \n \nPunishment is not excepted, it is involuntary. Rights do not extend to criminals because they have chosen to contradict the premises rights are based on. That is technically a choice but that doesn't mean a criminal will suddenly understand the correlation, to him it is not contradictory to expect his rights to be respected while he does not respect others. Therefore he may not volunteer to do whatever is necessary to prevent further offense.\n\n \n Then conformity to the standard is not voluntary, but is done under threat of force. The ideal breaks down due to the inevitable presence of cheaters.\n \n \nI am refering to the idea that issues can arise in which an objective moral system would be 'confused' or unable to apply. If rights do not conflict there is no occasion in which to fight except the irrationality of the aggressor. If you are talking about people getting angry or jealous of others morality \"doesn't care\".\n\n \n Not so. As you've implicitly agreed there is need for a police force due to cheaters in the system. Cheaters have a rational purpose in cheating the system for personal gain. Defending against cheaters, either through prevention or retaliation, serves a rational purpose. Police are fine and dandy, but some areas are out of reach for practical purposes. Aggressive personal response is the norm in areas like that for this very reason.\n \n \nCapitalism is in essence agreeing on how wealth is distributed. Not from some central imaginary social bank account but the individual transfers known as trades.\n\n \n If you ignore the fact that pure capitalism tends to fall into oligopoly, capitalism has scarcity of resources/product as the driving force. Additionally, capitalism is essentially competitive where each company and person fights for his or her own benefit. Given the scarcity of resources, one person's benefit is another's loss. This is a breeding ground for the conflicts you wish to avoid.", 
   {}, 
   432076, 
   null, 
   1307861280.0
  ], 
  [
   432088, 
   null, 
   "Freedom", 
   "You can observe brain activity and circumstancially reach conclusions based upon that, but you cannot empirically prove thought.\n \n That is false. It is a logically consistent position based on the lack of verification that others have values and judgement. \n \n\n and these are the ideas that stand against morality. I wonder why I am so sure?\n \n Let the man who has not values or thought challenge it, I fear the possibility little.\n \n \nI betray that genetic similarity is a rational standard, certainly. The justification would be similar to yours for the same premise, since you seem to based the 'respect' on the basis that others are similar creatures to yourself. The standard of 'similarity' is the same, so the justification for that standard would be the same would it not?\n\n That's circular, the standard of similarity is the same because of creatures being similar?\n \n \nSince value is based upon value, what value is that based upon? Or is that value chosen? \n\n It is a necessary corollary of choosing.\n \n \nYou've erased the distinction between value and judgement at this point.\n\n lol, you mean you hope that you can't tell the difference.\n \n \nExcept method J cannot create value j before any others because you need value j to use method J.\n\n Why?\n \n \nThat's not how you've used it: In the social sphere that which is good (moral) can be objectively defined[...]\n\n Of course that is how I used it.\n \n A = B\n Q+F = B\n A = Q+F\n \n But that's not how you used it: A = B\n \n \nWork together? I don't think that's necessary. Social interaction in a context (geographical location, shared interest, etc).\n\n Fine, but it implies interaction and not merely existance together.\n \n \nSo it seems what is moral in the community is the generalized rights of the individuals\n\n integrated not generalized, they were already generalized when certain values were boiled down to the single principle of liberty.\n \n \nand this is consistent between your univseral morality and the general emotional response.\n\n Yes, do you not think I know where you are trying to go with this? Let me just cut you off, this does not mean that if people's average emotions disagree with morality something is wrong with this derivation. Can you guess why? Oh that's right perception not necessarily reality effects people's emotions. That is why I told you why it would not work with emotions.\n \n \nThat isn't a problem, since you've already agreed that the general emotional reaction is consistent with rational morality (since apparently universal morality is rational).\n\n Of course it's a problem. Just because some one's isolated emotions agree with rational morality on a value they cannot escape (individual) does not mean they correctly derived morality.\n \n \nThat would be irrelvent since you've said there is no situation where involuntary interaction is correct. You would not be able to justify involuntary incarceration in that case.\n\n There isn't one, and I am not trying to justify the situation; the situation became involuntary when the criminal made it so. \n \n \nThen conformity to the standard is not voluntary\n\n Lol, of course it is, as is the inconformity. What you are implying is that even though someone chooses to destroy their own claim to rights that they should somehow still exist. No, they contradicted the premise and you can only argue against them when condemning the threat or use of force.\n \n \nAs you've implicitly agreed there is need for a police force due to cheaters in the system.\n\n Let me explicitly state they are needed.\n \n \nCheaters have a rational purpose in cheating the system for personal gain.\n\n No they don't because morality is rational.\n \n \nIf you ignore the fact that pure capitalism tends to fall into oligopoly, capitalism has scarcity of resources/product as the driving force. Additionally, capitalism is essentially competitive where each company and person fights for his or her own benefit. Given the scarcity of resources, one person's benefit is another's loss. This is a breeding ground for the conflicts you wish to avoid.\n\n Almost everything in that paragraph is wrong. Capitalism is driven by trade not the scarcity of resources, you speak as if resources where the limiting factor on our economy, productive action is. Nobody fights for their own benefit they trade for their own benefit. No ones benefit is another's loss and if there is a limit on resources it would exist under any system it is as unique to capitalism as the idea of wealth.", 
   {}, 
   432087, 
   null, 
   1307873460.0
  ], 
  [
   432128, 
   null, 
   "Sigma", 
   "and these are the ideas that stand against morality. I wonder why I am so sure? Let the man who has not values or thought challenge it, I fear the possibility little.\n \n That's circular, the standard of similarity is the same because of creatures being similar?\n \n\n \n Your premise explicitly requires this presumption but only covertly assumes it. Your outcome is not the only logical one. This is an unproven assumption.\n \n The standard of similarity between your premise and my alternative is the same. Your premise rests upon recognizing the similarity between myself and other people and then apply the same logic to both. However, another logical outcome rests upon recognizing that I am more similar to myself than I am to other people (other people are fundamentally different) and my family is more similar to myself than other people, etc.\n \n \nIt is a necessary corollary of choosing.\n \n lol, you mean you hope that you can't tell the difference.\n \n Why?\n\n \n I wouldn't know why; you're the one who gave me that criteria.\n \n \nOf course that is how I used it.\n\n \n Well, no you didn't. The definition you provided is: \"concerned with the principles of right and wrong\". Your sentence says: \"[...]that which is good (moral) can be[...]\"\n \n You equated \"moral\" with \"good\", and then further defined what is \"good\" for your argument. \n \n \nFine, but it implies interaction and not merely existance together.\n\n \n Aye. A community is a group of people who socially interact.\n \n \nintegrated not generalized, they were already generalized when certain values were boiled down to the single principle of liberty.\n\n \n Then can you rephrase the premise? I don't know how you are using 'integrated' here.\n \n \nYes, do you not think I know where you are trying to go with this? Let me just cut you off, this does not mean that if people's average emotions disagree with morality something is wrong with this derivation. Can you guess why? Oh that's right perception not necessarily reality effects people's emotions. That is why I told you why it would not work with emotions.\n\n \n Except that your premise doesn't allow general human emotion to disagree with morality.\n \n \nOf course it's a problem. Just because some one's isolated emotions agree with rational morality on a value they cannot escape (individual) does not mean they correctly derived morality.\n\n \n This is not about isolated emotions, this is about the emotions that the community feels in general. Don't change the goalposts on me :P\n \n \nThere isn't one, and I am not trying to justify the situation; the situation became involuntary when the criminal made it so.\n\n \n The 'criminal' doesn't incarcerate himself ;) Someone has to do that to him. You've given contradictory indications: first that there is no situation that involuntary interaction is justified and that involuntary interaction is allowed toward those who do not voluntarily adhere to your standard.\n \n \nLol, of course it is, as is the inconformity. What you are implying is that even though someone chooses to destroy their own claim to rights that they should somehow still exist. No, they contradicted the premise and you can only argue against them when condemning the threat or use of force.\n [...]\n No they don't because morality is rational.\n \n\n \n Your argument rests upon the unproven assumption that the people in general would follow the rules because they want to, rather than being deterred from cheating due to threat of force (which would dissolve your whole vision). Given that you agree a police force is needed you are aware that cheaters are a given in the system, but do not seem to think cheating can ever have a rational purpose.\n \n Do you have any evidence for this point to debate? Otherwise it is a difference in philosophy that neither of us can conclusively prove.\n \n \nAlmost everything in that paragraph is wrong. Capitalism is driven by trade not the scarcity of resources, you speak as if resources where the limiting factor on our economy, productive action is. Nobody fights for their own benefit they trade for their own benefit. No ones benefit is another's loss and if there is a limit on resources it would exist under any system it is as unique to capitalism as the idea of wealth.\n\n \n Resources are a limiting factor of everything. There would be no reason for trade without scarcity because everyone would have everything they need. Instead we trade for what we need by giving what we have plenty of (or at least don't need).\n \n And, yes, it would exist under any system that uses capitalism but the difference is in the system we have now we use taxes to subvert capitalism on some items. Without this subversion many items would simply be out of reach of the lower class. Hungry and desperate people likely would not voluntarily adhere to your standard :P", 
   {}, 
   432088, 
   null, 
   1307917200.0
  ], 
  [
   432130, 
   null, 
   "Freedom", 
   "Your premise explicitly requires this presumption but only covertly assumes it. Your outcome is not the only logical one.\n \n The standard of similarity between your premise and my alternative is the same. Your premise rests upon recognized the similarity between myself and other people and then apply the same logic to both. However, another logical outcome rests upon recognizing that I am more similar to myself than I am to other people and my family is more similar to myself than other people, etc.\n \n The standard is the same.\n\n No it isn't, you are talking about degrees. I am talking about a single value. Similarity to one's self is not inherently valuable. You are confused, I am not even talking about valuing a person qua person.\n \n An identical value of judgement could exist in an alien which has less in common genetically than an ant.\n \n \nI wouldn't know why; you're the one who gave me that criteria.\n\n I don't think so. I said any value implies j, and I said J produces values but I am quite sure I never said J requires j if J is never used to create a value.\n \n \nWell, no you didn't. The definition you provided is: \"concerned with the principles of right and wrong\". Your sentence says: \"[...]that which is good (moral) can be[...]\"\n \n You equated \"moral\" with \"good\", and then further defined what is \"good\" for your argument. \n\n I equated good with moral because that is in the definition of moral.\n \n \nThen can you rephrase the premise? I don't know how you are using 'integrated' here.\n\n General can mean the mean or typical, it can also mean the abstract formula applicable to all elements. When I say integrated I mean the result is the sum where contradictions are canceled in the process. (think of integrating over x = -a,a for a function of y symmetrical about the y axis).\n \n Not all values are considered by this integration. Joe could like ice cream but that doesn't mean society does. Only a universal good survives the process. Another way to say the same thing is that among all the things that an individual thinks it is proper and good to do (those liberties he believes in) the only thing that is perfectly objective is that it is good and proper for an individual to choose what is good and proper.\n \n \nExcept that your premise doesn't allow general human emotion to disagree with morality.\n\n It allows individuals to disagree (which necessitates that collectives could disagree). It only claims these values are in extra evidence by common emotional reactions, it does not claim that emotions whether individual or collective are a function only of morality.\n \n The only way there would be a direct correlation would be if everyone was perfectly rational and recognized and consistently applied all values, aka they all performed this derivation.\n \n If a man get's upset that his liberty has been taken away his emotions reflect his values, that does not mean he has derived morality correctly and now respects others liberties. He could perfectly well ignore the whole thing and experiance emotions based on a irrational value system.\n \n \nThis is not about isolated emotions, this is about the emotions that the community feels in general. Don't change the goalposts on me :P\n\n I am trying to prevent you from constructing a new goal.\n \n \nThe 'criminal' doesn't incarcerate himself ;) \n\n No, but he did destroy his right to be immune from someone else doing it to him.\n \n \nfirst that there is no situation that involuntary interaction is justified\n\n and I will never try to justify a criminals behavior.\n \n \nYour argument rests upon the unproven assumption that the people in general would follow the rules because they want to, rather than being deterred from cheating due to threat of force (which would dissolve your whole vision).\n\n Most people already follow some form of morality because they believe it's true. I do hold the threat of force over the heads of anyone who would threaten it. That does not mean I am justifying an involuntary action, anything else would be justifying an involuntary action. Pretending that the argument for the criminals rights hold after he contradicted them would be to admit one doesn't understand how they were derived.\n \n \nGiven that you agree a police force is needed you are aware that cheaters are a given in the system, but do not seem to think cheating can ever have a rational purpose.\n\n Ultimately no. You of course realize that rational is simply the application of reason (logical and unbiased thought) in a context. In the context of the the real world it will never be rational. In a limited (limited by someones failure to think) it could be. For instance say someone thinks only about how badly they want a milkshake. In that context it could be rational to steal a milkshake.\n \n \nDo you have any evidence for this point to debate? Otherwise it is a difference in philosophy that neither of us can conclusively prove.\n\n I am not trying to prove that man is noble or that people want to be moral right now.\n \n \nResources are a limiting factor of everything. There would be no reason for trade without scarcity because everyone would have everything they need. \n\n Sure there would, I could give you 600 square miles of rich farm land, ore rich mountains, and teaming rivers and lakes, and you would not have everything you want even though you have more resources than pretty much anyone.\n \n hint: you need to produce wealth.\n \n \nInstead we trade for what we need by giving what we have plenty of (or at least don't need).\n\n What we have plenty of is most often our product.\n \n \nAnd, yes, it would exist under any system that uses capitalism but the difference is in the system we have now we use taxes to subvert capitalism on some items. Without this subversion many items would simply be out of reach of the lower class. Hungry and desperate people likely would not voluntarily adhere to your standard :P\n\n You say that like it's a good thing. Jealousy and hardship driving people to theft and other immoralities.", 
   {}, 
   432128, 
   null, 
   1307921220.0
  ], 
  [
   432136, 
   null, 
   "Sigma", 
   "No it isn't, you are talking about degrees. I am talking about a single value. Similarity to one's self is not inherently valuable. You are confused, I am not even talking about valuing a person qua person.\n\n \n Or to cede that it is good for others to make decisions and choose values. This is based upon your standard that others are fundamentally like yourself. This rests upon an unproven assumption. An alternative to to cede this based on what is verifiably like myself.\n \n \nI don't think so. I said any value implies j, and I said J produces values but I am quite sure I never said J requires j if J is never used to create a value.\n\n \n Sure, you said any value can be used for method J, and that method J can be used to create values, but you did indeed say that you need to base method J on a value. That would logically disallow value j being created by method J.\n \n \nI equated good with moral because that is in the definition of moral.\n\n \n That's what I was thinking, but then you start quoting other definitions.\n \n \nGeneral can mean the mean or typical\n\n \n Alright, so could you rephrase the premise? Since we've defined 'community' and 'integrated', it should make it clearer its purpose and direction.\n \n \n\n The only way there would be a direct correlation would be if everyone was perfectly rational and recognized and consistently applied all values, aka they all performed this derivation.\n\n \n And apparently they are, since this 'universal morality' is consistent with general emotional reactions.\n \n \nNo, but he did destroy his right to be immune from someone else doing it to him. and I will never try to justify a criminals behavior.\n\n \n Except, as explained, the right has two consequences. Not only do we have the right to not have someone interfere with us (which you suggest is nullified by the person's actions) but we also have no right to do it to someone else. This second one you've been adamant does not change.\n \n It was not explained as a \"right to interfere with others, but we're shielded by the right to non-intereference\". The 'criminal' does not need his actions justified, our reaction toward him does.\n \n \nMost people already follow some form of morality because they believe it's true. I do hold the threat of force over the heads of anyone who would threaten it. That does not mean I am justifying an involuntary action, anything else would be justifying an involuntary action. Pretending that the argument for the criminals rights hold after he contradicted them would be to admit one doesn't understand how they were derived.\n\n \n The vast majority either do not follow a consistent moral code or follow a moral code inconsistently, regardless of how true they believe it to be. Just look at how many people of the various religions require forgiveness :P\n \n If the threat of force is the primary reason that people do not cheat the system, then the standard is not adhered to through a desire to be noble, but instead out of a desire to avoid the consequences. The functioning of society may be similar, but not the ideal behind it.\n \n \nUltimately no. You of course realize that rational is simply the application of reason (logical and unbiased thought) in a context. In the context of the the real world it will never be rational. In a limited (limited by someones failure to think) it could be. For instance say someone thinks only about how badly they want a milkshake. In that context it could be rational to steal a milkshake.\n\n \n More than just their desire goes into the calculation, however. If you desire a milkshake, the attentiveness of the person behind the counter affects your action, as do whether there are any witnesses. A criminal does not want to be caught, and if he or she is able to achieve that end, then they have benefitted at little to no risk to themselves. That is a rational course of action in nearly any context. If the sentence for stealing milkshakes is death, that would also affect your behavior since the cost of being caught would likely far outweigh the benefit of getting away with it.\n \n A cost/benefit analysis of the situation can weigh in favor of criminal action.\n \n \nI am not trying to prove that man is noble or that people want to be moral right now.\n\n \n Indirectly you are. Your entire society rests upon the ideal that people generally and voluntarily adhere to your standard (if it is under threat of force it isn't really voluntary). \n \n \nSure there would, I could give you 600 square miles of rich farm land, ore rich mountains, and teaming rivers and lakes, and you would not have everything you want even though you have more resources than pretty much anyone.\n\n \n You're taking 'resource' a bit too literally. For example, I would need an additional resource and would have to trade for it based upon its scarcity. A workforce. The concept remains the same, though: If everyone had all of this, would I be able to trade any of it away? Someone has to not have it to want to trade for it.\n \n \nYou say that like it's a good thing. Jealousy and hardship driving people to theft and other immoralities.\n\n \n I don't consider it a good thing. However, it is a reality of capitalism that items that everyone needs won't necessarily be something everyone can afford. Without welfare and subsidies those on the lower rungs of society will likely be driven to, at the very least, theft. You cannot pretend that there would not be a rational purpose behind it, either. The system breeds the very conflicts you're trying to avoid.", 
   {}, 
   432130, 
   null, 
   1307924340.0
  ], 
  [
   432145, 
   null, 
   "Freedom", 
   "Or to cede that it is good for others to make decisions and choose values. This is based upon your standard that others are fundamentally like yourself. This rests upon an unproven assumption. An alternative to to cede this based on what is verifiably like myself.\n\n You don't understand the logic if you think you can replace a rational mind with genetics.\n \n \nyou did indeed say that you need to base method J on a value.\n\n If I said anything confusing about J and j, I'm sorry (still want you to show me where). I meant that they implied each other.\n \n \nThat's what I was thinking, but then you start quoting other definitions.\n\n Lol, no I was pointing out that the definition of morality has been satisfied by the reasoning so far, therefore if A = B and B equals morality morality can be defined as A.\n \n \nExcept, as explained, the right has two consequences. Not only do we have the right to not have someone interfere with us (which you suggest is nullified by the person's actions) but we also have no right to do it to someone else. This second one you've been adamant does not change.\n \n It was not explained as a \"right to interfere with others, but we're shielded by the right to non-intereference\". The 'criminal' does not need his actions justified, our reaction toward him does.\n\n There is only one right, to not be interfered with. A right is a property of an individual and is relevant only to others.\n \n \nThe vast majority either do not follow a consistent moral code or follow a moral code inconsistently, regardless of how true they believe it to be. Just look at how many people of the various religions require \n forgiveness :P\n\n Your point?\n \n \nIf the threat of force is the primary reason that people do not cheat the system, then the standard is not adhered to through a desire to be noble, but instead out of a desire to avoid the consequences. The functioning of society may be similar, but not the ideal behind it.\n\n The reason why people are and ought to be moral is another discussion.\n \n \nA criminal does not want to be caught, and if he or she is able to achieve that end, then they have benefitted at little to no risk to themselves. That is a rational course of action in nearly any context.\n\n I will not comment on ratios of a nearly infinitely diverse set. Fortunately the final context of the real world is not one where it is rational to be immoral.\n \n \nIndirectly you are. Your entire society rests upon the ideal that people generally and voluntarily adhere to your standard (if it is under threat of force it isn't really voluntary). \n\n If people do not voluntarily interact volitionally it isn't really voluntary? :p\n \n The society is ideal and voluntary, but not those do not interact volitionally.\n \n \nYou're taking 'resource' a bit too literally. For example, I would need an additional resource and would have to trade for it based upon its scarcity. A workforce.\n\n hehe, too literally you say. Capitalist don't trade humans they trade productive effort.\n \n \nThe concept remains the same, though: If everyone had all of this, would I be able to trade any of it away? Someone has to not have it to want to trade for it.\n\n No, no one would care for your ore rich mountains if they had their own. They would still trade what they primarily trade now, productive effort.\n \n \nI don't consider it a good thing. However, it is a reality of capitalism that items that everyone needs won't necessarily be something everyone can afford.\n\n Of course. Capitalism is honest, it doesn't 'make promises' based on mystical realms where product spontaneously appears for no better reason than people need it.\n \n \nWithout welfare and subsidies those on the lower rungs of society will likely be driven to, at the very least, theft.\n\n Both irrelevant and bull.\n \n \nYou cannot pretend that there would not be a rational purpose behind it, either. The system breeds the very conflicts you're trying to avoid.\n\n No, immorality does. One cannot advocate immorality by demanding it.", 
   {}, 
   432136, 
   null, 
   1307933820.0
  ], 
  [
   432148, 
   null, 
   "Sigma", 
   "You don't understand the logic if you think you can replace a rational mind with genetics.\n\n \n It seems pretty straightforward to me. Your premise is to 'cede that it is good for others to make decisions and choose values' based on the fact that others are similar to myself. I don't have to accept that as true since it is based upon an assumption that isn't verified. I can instead I can apply any logic that I apply to myself to those who are verifiably similar to me.\n \n The difference between degrees or a single value does not invalidate this. You would have to show how this is disallowed.\n \n \nIf I said anything confusing about J and j, I'm sorry (still want you to show me where). I meant that they implied each other.\n\n \n That was not a part of your premise, so it would be improper to change that now. Unless you are changing your premise. You stated clearly that method J requires a value. Certainly method J can imply that value j exists, but that still does not allow method J to explicitly create value j.\n \n Perhaps you did say something confusing. If you wish, restate the relationships from your premise.\n \n \nLol, no I was pointing out that the definition of morality has been satisfied by the reasoning so far, therefore if A = B and B equals morality morality can be defined as A.\n\n \n You weren't defining morality, you were defining what is moral in the sentence. You've defined it as what is 'good', and then went on to define what is 'good' in your premise which thus defines what is moral for your argument. The definition you quoted has no bearing on this, as far as I can see.\n \n \nThere is only one right, to not be interfered with. A right is a property of an individual and is relevant only to others.\n\n \n That is not how you've set up your system, however. Not only do we have the right to liberty (this is the right that apparently can be nullified), but you have taken away our power to impose force upon others involuntarily. While the 'criminal' does not have the right to liberty, none of us have the right to take liberty away.\n \n \nYour point? The reason why people are and ought to be moral is another discussion.\n\n \n My point is that your argument rests upon the unproven assumption that the people in general would follow the rules because they want to, rather than being deterred from cheating due to threat of force. People already don't follow self-imposed rules, which lends credence to the fact that only threat of force will reliably encourage people to follow your rules.\n \n However, this is not your vision of a voluntary society.\n \n \nI will not comment on ratios of a nearly infinitely diverse set. Fortunately the final context of the real world is not one where it is rational to be immoral.\n\n \n That's simply untrue. People do indeed steal things like milkshakes or other sundries, and I've provided you with a rational explanation.\n \n \n\n No, no one would care for your ore rich mountains if they had their own. They would still trade what they primarily trade now, productive effort.\n\n \n What would be the point? I could not trade anything since I possess nothing that others want. Scarcity is what drives people to trade.\n \n \nBoth irrelevant and bull.\n\n \n Which part. That people who cannot afford food starve? Or that starving people are rationally motivated to theft? This is relevant in that your system breeds the very problems you're trying to address.\n \n \nNo, immorality does. One cannot advocate immorality by demanding it.\n\n \n Immorality isn't why people cannot afford food, Freedom.", 
   {}, 
   432145, 
   null, 
   1307940780.0
  ], 
  [
   432153, 
   null, 
   "Freedom", 
   "It seems pretty straightforward to me. Your premise is to 'cede that it is good for others to make decisions and choose values' based on the fact that others are similar to myself.\n\n No based on the fact that others make decisions and choose values. Similarity is why they have values and make decisions, it is not others genes that tell us they are rational thinking beings it is their ability to communicate that makes this apparent.\n \n \nI don't have to accept that as true since it is based upon an assumption that isn't verified.\n\n Yes it is verified that others have values and judgement.\n \n \nI can instead I can apply any logic that I apply to myself to those who are verifiably similar to me.\n\n They are veritably similar to you in this matter.\n \n \nThe difference between degrees or a single value does not invalidate this. You would have to show how this is disallowed.\n\n It is your identification of degree that showed you were not thinking of a boolean but of genetic similarity.\n \n \nYou stated clearly that method J requires a value.\n\n Quote please.\n \n \nWhile the 'criminal' does not have the right to liberty, none of us have the right to take liberty away.\n\n You're confusing yourself. None of us have the right to take away the right to liberty. If the right has been contradicted (nullified) by an individual we aren't taking it away, they already did.\n \n \nMy point is that your argument rests upon the unproven assumption that the people in general would follow the rules because they want to, rather than being deterred from cheating due to threat of force.\n\n 1. Show me in my derivation where I assume anything about who will follow 'rules' and why.\n 2. Show me anywhere claiming that some people will not follow the 'rules' only because they fear retaliation.\n \n 2. Seems even more unlikely then 1. because I not only cede such people exist, I claim that there will always be people who do not follow the rules regardless of reason(morality), fear, or benefit.\n \n \nPeople already don't follow self-imposed rules, which lends credence to the fact that only threat of force will reliably encourage people to follow your rules.\n\n Yes people already follow self-imposed rules almost entirely.\n \n \nHowever, this is not your vision of a voluntary society.\n\n I think my vision of a volitional society is significantly brighter than anything you(specifically you) would expect to see ever existing.\n \n \nThat's simply untrue. People do indeed steal things like milkshakes or other sundries, and I've provided you with a rational explanation.\n\n Luckily I didn't say people don't steal milkshakes, I just said it is ultimately irrational.\n \n \nWhat would be the point? I could not trade anything since I possess nothing that others want.\n\n That's sad if true but I doubt it unless you are living off welfare and have your whole life.\n \n I know how to write and modify software, design and analyze electrical and mechanical devices, solve practical but not exactly simple math problems, clean, cook, create 3d and 2d models and art, pack boxes, lift motors, paint machines, sweep floors, etc.\n \n I have traded all of these abilities for wealth at some point or another in my life. I haven't mined an ounce of ore or (for other people) grown a single plant or otherwise used the land I live on for anything but living. Yet I still have wealth to trade.\n \n Is it scarcity driving my life or productive activity?\n \n \nScarcity is what drives people to trade.\n\n Perhaps you mean by scarcity, demand? It's been a long long time since humans were happy just wandering and picking things up that tasted good.\n \n \nWhich part. That people who cannot afford food starve? Or that starving people are rationally motivated to theft?\n\n Oh no, people who do not have the productive ability to feed themselves do starve without charity. It was bull that 'lower rungs of society' even means anything. It was bull that capitalism has any part at all in poverty.\n \n \nImmorality isn't why people cannot afford food, Freedom.\n\n It's what it's called when they steal, murder, and enslave whatever the excuse.\n \n The truth is that morality simply has nothing directly to do with our economic requirements. Indirectly having a system of morality based of man's nature produces a economic system geared towards his production which maximizes economic 'good times'.", 
   {}, 
   432148, 
   null, 
   1307946780.0
  ], 
  [
   435857, 
   null, 
   "simone", 
   "Morals are a religious Myth.. - Xcaliber\n How is Evil Immoral? - Xcaliber\n I am right until you prove otherwise - Xcaliber\n\n Oh geeze, Xcaliber, can't atheists have morals too? I have this ridiculous obsession with goodness and decency and I can't seem to shake it off.", 
   {}, 
   432153, 
   null, 
   1312055100.0
  ], 
  [
   435918, 
   null, 
   "Freedom", 
   "Oh geeze, Xcaliber, can't atheists have morals too?.\n\n That depends on if they are willing to throw out the dogmas of authority based morality vs subjective arbitrary morality. \n \n If one accepts the former yet rejects god (the most logical source of authority), he/she will probably (but not necessarily) reject other authorities as well, other men; and imaginary social meta beings as well. He/she will then conclude there is no authority and that morality is an arbitrary invention.\n \n If one accepts the later one will hold the moral consistency of jello, a code of right and wrong that is neither true nor constant is a tool for the psyche to justify what ever the hell it wants. You mentioned Hitler in this thread, Nazi's believed morality was whatever helped the Aryan race, the fatherland, and the fuhrer (pragmatism). One's own emotions as a standard of moral quality fall into the later as well.\n \n What basis is that when one cannot even predict or control one's own emotions. To follow your heart? This is not some special quality of man most animals could claim the same achievement.\n \n Any person who held to that with an ounce of interest in the truth would quickly become cynical of the whole idea of morality and attribute it's existance (for them just an emotional now or then) to some ancient evolutionary insticnt.\n \n So you see, false moral theories show themselves up in the end; and really do cause sentiments like xcalibers.", 
   {}, 
   435857, 
   null, 
   1312103580.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A society based on volition is the ideal one.", 
  "url": "http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one.html", 
  "breadcrumbs": [
   "Formal Open Debate"
  ], 
  "id_number": 14447, 
  "discussion_files": [
   [
    "32546.html", 
    "http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one-print.html"
   ], 
   [
    "32547.html", 
    "http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one-4-print.html"
   ], 
   [
    "32548.html", 
    "http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one-3-print.html"
   ], 
   [
    "32549.html", 
    "http://www.4forums.com/political/formal-open-debate/14447-society-based-volition-ideal-one-2-print.html"
   ]
  ], 
  "identifier": 14447
 }
]