[
 [
  [
   407277, 
   null, 
   "flaja", 
   "For the \"poor\".\n \n National Taxpayers Union - Who Pays Income Taxes?\n For tax year 2007 the top 1% of the wealthy, people with annual incomes over $410,096 a year, paid 40.42% of what the federal government collected in personal income taxes. The bottom 50%, people earning less than $32,879 a year, paid only 2.89% of the federal personal income tax take.\n \n http://www.ntu.org/main/page.php?PageID=155\n \n For tax year 2005 32.6% of all personal federal income tax returns came from people that did not pay anything in personal federal income taxes.\n \n Who pays taxes - and how much? A tax day perennial. - Apr. 15, 2009\n \n According to the Congressional Budget Office the top 1/5 of U.S. households earned 56% of the country's pre-tax income in 2006 but they paid 86% of the country's individual income tax burden. The top 1% of U.S. households earned 19% of the total pre-tax income for 2006 but paid 39% of the country's individual income tax burden.\n \n Counting all federal taxes (personal income, excise, corporate income and welfare taxes) the top 1/5 of U.S. households paid 69% of all federal taxes in 2006; the top 1% paid 28% of all federal taxes. \n \n So we have a situation where the poor outnumber the rich and thus outvote the rich. This means the poor can tax the rich while at the same time voting welfare for themselves that they are not legally obligated to pay for with taxes. The result is a $12 trillion federal debt. We will never control government spending as long as we allow people to benefit from government spending without having to pay for it.", 
   {
    "post_info": {
     "post_title": "Conservatives must support higher taxes"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1279227480.0
  ], 
  [
   407322, 
   null, 
   "Steeeeve", 
   "I'll use your numbers and through some stats out for ya (using 2007 data):\n \n The average tax rate for the bottom 4/5ths is about 11%. For the top 1/5th it is about 25%.\n \n If you raise the tax rate for the bottom 4/5ths to 25% (the same as the top rate aka a 127% increase)...which is every tax return under $100,000 you will generate about $258 billion more in tax revenue. To get that same revenue from the top 1/5th you'd only have to raise their rates by ~3.5% (a 14% increase). \n \n Of course that doesn't help out anything considering if we did both tax increases you would generate about a half billion which means only 1 trillion to go to balance the budget!", 
   {}, 
   407277, 
   null, 
   1279255500.0
  ], 
  [
   407323, 
   null, 
   "NATO 556", 
   "I think politicians and bureaucrats should be required to pay higher taxes than anybody. Look at the fortunes they're raking in. They shouldn't be allowed to get rich off fat salaries.", 
   {}, 
   407322, 
   null, 
   1279257000.0
  ], 
  [
   407345, 
   null, 
   "flaja", 
   "I'll use your numbers and through some stats out for ya (using 2007 data):\n \n The average tax rate for the bottom 4/5ths is about 11%. For the top 1/5th it is about 25%.\n \n If you raise the tax rate for the bottom 4/5ths to 25% (the same as the top rate aka a 127% increase)...which is every tax return under $100,000 you will generate about $258 billion more in tax revenue. To get that same revenue from the top 1/5th you'd only have to raise their rates by ~3.5% (a 14% increase). \n \n Of course that doesn't help out anything considering if we did both tax increases you would generate about a half billion which means only 1 trillion to go to balance the budget!\n\n \n \n If the tax burden were more evenly distributed across all income groups, then perhaps the people in the lower groups would decide they don't need as much welfare as they now get- meaning government spending could be reduced. That way the extra revenue from the higher taxes would be more significant.", 
   {}, 
   407322, 
   null, 
   1279291920.0
  ], 
  [
   407346, 
   null, 
   "NATO 556", 
   "meaning government spending could be reduced.\n\n \n Oh that's rich! Like that's ever gonna happen with the current congress in place. Obama has spend trillions of dollars we don't have, trying to get us out of an economic sinkhole that was put into place by Clinton and the previous democruds. And they haven't even slowed down on the spending, they just keep on writing more and more checks that they know they'll never be able to cash.", 
   {}, 
   407345, 
   null, 
   1279292520.0
  ], 
  [
   407355, 
   null, 
   "Steeeeve", 
   "If the tax burden were more evenly distributed across all income groups, then perhaps the people in the lower groups would decide they don't need as much welfare as they now get- meaning government spending could be reduced. That way the extra revenue from the higher taxes would be more significant.\n\n \n Wait, so you think if the poor get LESS money than that cause them to want even LESS? If anything it could drive up bankruptcies and foreclosures since the middle and lower class generally don't have a lot of disposable income. It would take me too long to calculate these numbers but a 127% increase in the tax rate would ruin people from what I've seen. \n \n Now, I think you could raise the tax on the middle class but not by as much as the rich are being taxed. Remember, the marginal value of $1 is lower and lower as you get richer and richer. So in terms of \"burden\" a progressive tax makes sense which is basically why we have one.", 
   {}, 
   407345, 
   null, 
   1279298640.0
  ], 
  [
   407356, 
   null, 
   "Steeeeve", 
   "Oh that's rich! Like that's ever gonna happen with the current congress in place. Obama has spend trillions of dollars we don't have, trying to get us out of an economic sinkhole that was put into place by Clinton and the previous democruds. And they haven't even slowed down on the spending, they just keep on writing more and more checks that they know they'll never be able to cash.\n\n \n Oh be fair! It wasn't just democrats, it was everybody..even outside of government. \n \n As for the deficit, it was during Reagan, Bush Jr., and Obama presidencies that we have seen the biggest increases (with Obama being the biggest).", 
   {}, 
   407346, 
   null, 
   1279298760.0
  ], 
  [
   407366, 
   null, 
   "flaja", 
   "Oh that's rich! Like that's ever gonna happen with the current congress in place. Obama has spend trillions of dollars we don't have, trying to get us out of an economic sinkhole that was put into place by Clinton and the previous democruds. And they haven't even slowed down on the spending, they just keep on writing more and more checks that they know they'll never be able to cash.\n\n \n You don't get it. We have outrageous government spending because most Americans don't have to pay the taxes needed to support it or pay off the debt that results from deficit spending. Make more people pay taxes, and more people may want less government spending.", 
   {}, 
   407346, 
   null, 
   1279305840.0
  ], 
  [
   407367, 
   null, 
   "flaja", 
   "Wait, so you think if the poor get LESS money than that cause them to want even LESS? If anything it could drive up bankruptcies and foreclosures since the middle and lower class generally don't have a lot of disposable income. It would take me too long to calculate these numbers but a 127% increase in the tax rate would ruin people from what I've seen. \n \n Now, I think you could raise the tax on the middle class but not by as much as the rich are being taxed. Remember, the marginal value of $1 is lower and lower as you get richer and richer. So in terms of \"burden\" a progressive tax makes sense which is basically why we have one.\n\n \n What entitles the poor and middle class that don't pay taxes to live off of the largesse of the rich just because the rich can afford to pay taxes?", 
   {}, 
   407355, 
   null, 
   1279305960.0
  ], 
  [
   407368, 
   null, 
   "Steeeeve", 
   "What entitles the poor and middle class that don't pay taxes to live off of the largesse of the rich just because the rich can afford to pay taxes?\n\n \n Would you prefer they be homeless and rob the rich at gunpoint instead? I'm not saying I like entitlements but welfare, unemployment, etc are not bad programs for temporary troubles of people. They can and have prevented people who are trying to work hard from losing everything and it can put them in a position to actually get a job. The problem is when they become dependent on it. \n \n Now, this has nothing to do with taxing the poor to make them less willing to be on welfare.", 
   {}, 
   407367, 
   null, 
   1279306440.0
  ], 
  [
   407371, 
   null, 
   "flaja", 
   "Would you prefer they be homeless and rob the rich at gunpoint instead? I'm not saying I like entitlements but welfare, unemployment, etc are not bad programs for temporary troubles of people. They can and have prevented people who are trying to work hard from losing everything and it can put them in a position to actually get a job. The problem is when they become dependent on it. \n \n Now, this has nothing to do with taxing the poor to make them less willing to be on welfare.\n\n \n Being robbed at the ballot box is no different than being robbed at gunpoint. As long as we tax the rich to give welfare to the poor in order keep the poor from rioting we are making the rich pay protection money.\n \n I am a conservative, and I don't mind a certain amount of welfare spending because I don't want a mass concentration of either wealth or poverty since both can disrupt society. I don't want the rich to oppress the poor by their power. But at the same time I don't want the poor to oppress the rich with their number. And at any rate the United States is broke- in large part due to welfare spending that goes for programs that are more a way of life than a temporary helping hand for their recipients.", 
   {
    "unicode_changes_made": true
   }, 
   407368, 
   null, 
   1279308060.0
  ], 
  [
   407374, 
   null, 
   "Steeeeve", 
   "Being robbed at the ballot box is no different than being robbed at gunpoint.\nYou obviously haven't been robbed at gunpoint. Crime creates fear and instability in a country. \n \n \nAs long as we tax the rich to give welfare to the poor in order keep the poor from rioting we are making the rich pay protection money.\nI'm ok with this. \n \n \nI am a conservative, and I don't mind a certain amount of welfare spending because I don't want a mass concentration of either wealth or poverty since both can disrupt society. I don't want the rich to oppress the poor by their power. But at the same time I don't want the poor to oppress the rich with their number. And at any rate the United States is broke- in large part due to welfare spending that goes for programs that are more a way of life than a temporary helping hand for their recipients.\nWhat do you consider welfare? You gotta keep in mind a lot of social programs are not paid for with income taxes.", 
   {
    "unicode_changes_made": true
   }, 
   407371, 
   null, 
   1279309380.0
  ], 
  [
   407376, 
   null, 
   "Symbiote", 
   "Disagree, but, also Steeeve, I disagree with your view on raising taxes on the rich.\n \n In my view cut spending severely, and if that isn't enough to turn things around, perhaps because of the size debt already accumulated and the repayments on that, declare bankruptcy, repudiate the debts and start over. It worked pretty well for the USSR.", 
   {}, 
   407374, 
   null, 
   1279309560.0
  ], 
  [
   407384, 
   null, 
   "Steeeeve", 
   "Disagree, but, also Steeeve, I disagree with your view on raising taxes on the rich.\n \n In my view cut spending severely, and if that isn't enough to turn things around, perhaps because of the size debt already accumulated and the repayments on that, declare bankruptcy, repudiate the debts and start over. It worked pretty well for the USSR.\n\n \n Because everyone wants to be Russia? It is clear spending cuts isn't enough. Rather than becoming a third world country overnight, I prefer to tax the rich.", 
   {}, 
   407376, 
   null, 
   1279311600.0
  ], 
  [
   407387, 
   null, 
   "Symbiote", 
   "Well in fairness, Russia was pretty 3rd world, now it's more like 2nd. The abolition of a government isn't necessarily a destructive force, e.g. the abolition of the British government in the USA to be replaced with the homegrown American government, or the same substition in many former colonies.\n \n I don't anticipate there would be any transformation into a 3rd world nation, if anything the country would be better off after a pretty rough transition.\n \n My problem with tax increases is that they do not dictate any sort of permanent or even semi-permanent solution - they merely provide a larger base on which the government can then acquire further loans. It's sort of like if someone has maxed out their credit cards and can barely meet the minimum repayment each month - they might think getting a higher paying job would help them out, but it's likely that at their higher pay level, they would simply find the opportunity to buy more goods on credit, and find themselves in the same situation soon enough again.", 
   {}, 
   407384, 
   null, 
   1279312380.0
  ], 
  [
   407396, 
   null, 
   "Steeeeve", 
   "Well in fairness, Russia was pretty 3rd world, now it's more like 2nd. The abolition of a government isn't necessarily a destructive force, e.g. the abolition of the British government in the USA to be replaced with the homegrown American government, or the same substition in many former colonies.\n \n I don't anticipate there would be any transformation into a 3rd world nation, if anything the country would be better off after a pretty rough transition.\nOr we get overrun by China. I'm not sure Japan or China would like losing a bunch of money.\n \n Not only that, but do you really think the average millionaire would rather pay 15% more in taxes or in an unstable country? With the exception of Steve Forbes, I don't see many rich people complaining about how high their taxes are. Warren Buffet certainly is all for it.\n \n \nMy problem with tax increases is that they do not dictate any sort of permanent or even semi-permanent solution - they merely provide a larger base on which the government can then acquire further loans. It's sort of like if someone has maxed out their credit cards and can barely meet the minimum repayment each month - they might think getting a higher paying job would help them out, but it's likely that at their higher pay level, they would simply find the opportunity to buy more goods on credit, and find themselves in the same situation soon enough again.\nWill, in reality this is probably what would happen and will happen. I'm saying that assuming you would want to balance the budget AND politicians were capable of being honest, we would have to lower spending and raise taxes. What I am saying is not out of the realm of possibilities but it certainly isn't remotely probable.", 
   {}, 
   407387, 
   null, 
   1279315380.0
  ], 
  [
   407397, 
   null, 
   "flaja", 
   "You obviously haven't been robbed at gunpoint. Crime creates fear and instability in a country.\n\n \n I have been burglarized so often over the past 30 years that I have lost count of the number of times. I well know what it is like to have things that I have worked and saved for be stolen. I know what it is like to come home not knowing what thug you may find inside your home. Also, my mother lost her business (a neighborhood grocery store) during my first year in college after she shot a killed a crackhead that came after her with a butcher knife. So don't lecture me about fear.\n \n \nI'm ok with this.\n\n \n You are an XXXXX.\n \n \nWhat do you consider welfare? You gotta keep in mind a lot of social programs are not paid for with income taxes.\n\n \n Name them. Which social programs are not paid for with a tax on income, wages or salaries? And explain how you can designate certain taxes to pay for certain things when you have had a continuous budget deficit for the past 40 (40+?) years?", 
   {}, 
   407374, 
   null, 
   1279318020.0
  ], 
  [
   407399, 
   null, 
   "flaja", 
   "In my view cut spending severely, and if that isn't enough to turn things around, perhaps because of the size debt already accumulated and the repayments on that, declare bankruptcy, repudiate the debts and start over. It worked pretty well for the USSR.\n\n \n We have about $12 trillion in federal debt. I cannot find up-to-date data for state and local debt, and American individuals owe something like $8 trillion in mortgages and consumer debt.\n \n I've been thinking more and more along these lines lately (see new thread). We could print money to pay off the public debt, but we would have to take steps to curtail consumer spending in order to avoid the kind of inflation that was found in the Weimar Republic when the Germans were printing money left and right to pay their World War I reparations (which were not severe and which the Germans deserved to pay).", 
   {
    "unicode_changes_made": true
   }, 
   407376, 
   null, 
   1279318500.0
  ], 
  [
   407417, 
   null, 
   "Steeeeve", 
   "I have been burglarized so often over the past 30 years that I have lost count of the number of times. I well know what it is like to have things that I have worked and saved for be stolen. I know what it is like to come home not knowing what thug you may find inside your home. Also, my mother lost her business (a neighborhood grocery store) during my first year in college after she shot a killed a crackhead that came after her with a butcher knife. So don't lecture me about fear.\nI'll lecture you as I please, thank you.\n \n My point is, paying more taxes to avoid numerous homelessness is much different, and better, than the alternative.\n \n \n \nYou are an XXXXX.\nI appreciate this well thought out response.\n \n \nName them. Which social programs are not paid for with a tax on income, wages or salaries?\nSocial Security, Medicare, Medicaid, Unemployment, disability benefits (a little unsure on this one...which are apart of SSA). Just look at your pay stub.\n \n \nAnd explain how you can designate certain taxes to pay for certain things when you have had a continuous budget deficit for the past 40 (40+?) years?\nThe law requires this.", 
   {}, 
   407397, 
   null, 
   1279328160.0
  ], 
  [
   407418, 
   null, 
   "flaja", 
   "I'll lecture you as I please, thank you.\n \n My point is, paying more taxes to avoid numerous homelessness is much different, and better, than the alternative.\n \n \n I appreciate this well thought out response.\n \n Social Security, Medicare, Medicaid, Unemployment, disability benefits (a little unsure on this one...which are apart of SSA). Just look at your pay stub.\n \n The law requires this.\n\n \n \n You made the claim that we have social programs that are not paid for with income taxes with the implication being that raising income taxes on the poor will not make the poor carry more of the burden of paying for these social programs. I asked you to name which social programs are not paid for by taxes on income, wages or salaries. You replied with: Social Security, Medicare, Medicaid, Unemployment, disability benefits. All of these social welfare programs are paid for by payroll taxes, i.e., taxes on income, wages and salaries.", 
   {}, 
   407417, 
   null, 
   1279332060.0
  ], 
  [
   407426, 
   null, 
   "Steeeeve", 
   "You made the claim that we have social programs that are not paid for with income taxes with the implication being that raising income taxes on the poor will not make the poor carry more of the burden of paying for these social programs. I asked you to name which social programs are not paid for by taxes on income, wages or salaries. You replied with: Social Security, Medicare, Medicaid, Unemployment, disability benefits. All of these social welfare programs are paid for by payroll taxes, i.e., taxes on income, wages and salaries. \n\n \n You do realize that the \"Income Tax\" is not the same as withholding or payroll taxes right? You specifically said \"tax on income\" which is traditionally thought of as the income tax and your first post talked about the income tax and figures for it. In fact, social security, the largest payroll tax, is taxed at 6.2% (for employee) up to the first $106k of income. So technically the tax rate is lower on total income for everyone making over that amount. Medicare is the same rate across the board.", 
   {}, 
   407418, 
   null, 
   1279337340.0
  ], 
  [
   407431, 
   null, 
   "Matthew S", 
   "What entitles the poor and middle class that don't pay taxes to live off of the largesse of the rich just because the rich can afford to pay taxes?\n\n \n Because the system is set up to exploit the poor in low wage jobs. It is a dog eat do system and only a few lucky ones get to rise to the top. Tax the rich to pay for the poor they exploit.", 
   {}, 
   407367, 
   null, 
   1279338720.0
  ], 
  [
   407433, 
   null, 
   "flaja", 
   "You do realize that the \"Income Tax\" is not the same as withholding or payroll taxes right? You specifically said \"tax on income\" which is traditionally thought of as the income tax and your first post talked about the income tax and figures for it. In fact, social security, the largest payroll tax, is taxed at 6.2% (for employee) up to the first $106k of income. So technically the tax rate is lower on total income for everyone making over that amount. Medicare is the same rate across the board.\n\n \n Federal Insurance Contributions Act tax - Wikipedia, the free encyclopedia\n \n The tax burden for FICA is shared by employees and employers. Each one pays half of the taxes that are collected and the amount an individual pays is based their income derived from their wages/salary. FICA is an income tax.\n \n And you will note that I included payroll taxes when I asked you to list social programs that are supported by taxes, so you still didn't pay attention to what I asked- or you are too ignorant to understand what I asked.", 
   {}, 
   407426, 
   null, 
   1279339200.0
  ], 
  [
   407435, 
   null, 
   "flaja", 
   "You specifically said \"tax on income\" \n\n \n I asked, \"Which social programs are not paid for with a tax on income, wages or salaries?\"\n \n What is a tax on wages and salary if not a payroll tax? And what is a wage or salary if not income?", 
   {}, 
   407426, 
   null, 
   1279339320.0
  ], 
  [
   407443, 
   null, 
   "Steeeeve", 
   "You gotta keep in mind a lot of social programs are not paid for with income taxes. \n\n \n \nI asked, \"Which social programs are not paid for with a tax on income, wages or salaries?\"\n\n \n You misunderstood me and I misunderstood what you were asking. Now what is your point?", 
   {}, 
   407435, 
   null, 
   1279346580.0
  ], 
  [
   407469, 
   null, 
   "flaja", 
   "You misunderstood me and I misunderstood what you were asking. Now what is your point?\n\n \n I didn't misunderstand you at all, and my point is that you are not paying attention to what is being said.", 
   {}, 
   407443, 
   null, 
   1279381440.0
  ], 
  [
   407471, 
   null, 
   "mata", 
   "Long story short. Corporate welfare is preferable to individual welfare?\n \n (I don't agree)\n \n Corporate welfare appears to be more costly in the long run than temporary individual welfare.", 
   {}, 
   407469, 
   null, 
   1279382220.0
  ], 
  [
   407497, 
   null, 
   "Steeeeve", 
   "I didn't misunderstand you at all, and my point is that you are not paying attention to what is being said.\nGreat than you realize I was talking about income taxes.\n \n Now, what is your point.", 
   {}, 
   407469, 
   null, 
   1279402260.0
  ], 
  [
   407518, 
   null, 
   "flaja", 
   "Long story short. Corporate welfare is preferable to individual welfare?\n \n (I don't agree)\n \n Corporate welfare appears to be more costly in the long run than temporary individual welfare.\n\n \n I don't support either form of welfare, but at least corporations pay for part of theirs through taxes.\n \n Individual welfare is seldom temporary and seldom paid for by the recipient. My father's older sister had 2 kids and was pregnant with her 3rd when her husband (a cop) was killed in a car wreck. She collected something like $250,000 in today's money in life insurance on her husband (back in the mid-1960s) and then collected a Social Security orphan's pension for each of her children until they turned 18. She collected more from the government each month than my mother was able to earn working 40-60 hours a week as a sales clerk and bookkeeper. My aunt collected far more in Social Security than she or husband could have ever paid in to Social Security.\n \n I have an elderly friend who has been in a nursing home since 2005. She never had more than a minimum wage job. She had a nervous breakdown when she was about 30 or so and has collected an SSI disability check every month for the 40+ years since then. Her check is about $900 a month. My mother, who worked for 30 years, had to go in SSI in 2001 due to lupus and arthritis, and it took 3 applications and a court fight to get Social Security to recognize her disability. The government then mandated that $5000 of her back benefits go to her lawyer and then because the government paid out the back benefits in a single amount she had to give a good bit of back to the government in income taxes. And her monthly check is only about $1400.\n \n I used to have a neighbor who has 3 children by 3 different men, only one of whom she was ever married to. She gets welfare of one sort or another for each of them when she hasn't worked in 20 years or more.", 
   {}, 
   407471, 
   null, 
   1279421760.0
  ], 
  [
   407519, 
   null, 
   "flaja", 
   "Great than you realize I was talking about income taxes.\n \n Now, what is your point.\n\n \n I intentionally asked you to name the welfare programs that are paid for by payroll taxes- because I assumed that you wouldn't understand that payroll taxes are just another form of income taxes.", 
   {
    "unicode_changes_made": true
   }, 
   407497, 
   null, 
   1279421880.0
  ], 
  [
   407531, 
   null, 
   "Steeeeve", 
   "I intentionally asked you to name the welfare programs that are paid for by payroll taxes- because I assumed that you wouldn't understand that payroll taxes are just another form of income taxes.\n\n \n So you intentionally misled me...kinda mean don't you think? \n \n \"income tax\" has a very specific meaning. Payroll taxes are unlike the income tax in that they don't always apply to all AGI. \n \n Now do you have a point or not? Stop stalling.", 
   {
    "unicode_changes_made": true
   }, 
   407519, 
   null, 
   1279427520.0
  ], 
  [
   407536, 
   null, 
   "flaja", 
   "So you intentionally misled me...kinda mean don't you think? \n\n \n I did not mislead you intentionally or otherwise. It is not my fault you have so little understanding of the issue I raised.\n \n \n\"income tax\" has a very specific meaning. Payroll taxes are unlike the income tax in that they don't always apply to all AGI.\n\n \n In a way they do, only the tax rate is lower. A tax that you must pay on what you receive in wages and salary which you earn as income is an income tax whether you say it is or not. Payroll taxes would be unconstitutional if not for the 16th Amendment. Before that Amendment had been ratified Congress tried several times to levy taxes on wages saying it was levying an excise tax on the production of labor. The Supreme Court always struck down these taxes because they are really income taxes.\n \n \nNow do you have a point or not? Stop stalling.\n\n \n My point is that the poor in this country do not pay enough in taxes in comparison to what they get in welfare benefits.", 
   {}, 
   407531, 
   null, 
   1279428960.0
  ], 
  [
   407539, 
   null, 
   "Steeeeve", 
   "I did not mislead you intentionally or otherwise. It is not my fault you have so little understanding of the issue I raised.\nShould I quote myself again? This entire thread you talked about income taxes then I said \"You gotta keep in mind a lot of social programs are not paid for with income taxes.\" to which you asked what programs are not paid for with taxes on income. I assumed you meant income tax...not that unreasonable of an assumption given you were responding to me, who said \"income tax\".\n \n \nMy point is that the poor in this country do not pay enough in taxes in comparison to what they get in welfare benefits.\nThey pay the same rate up to 106k (or whatever it is now) for the taxes that are used to pay for those programs...would you prefer they pay an even higher rate? do you want them to just pay for the full price of the program? Seems kinda worthless at that point.", 
   {}, 
   407536, 
   null, 
   1279429620.0
  ], 
  [
   407570, 
   null, 
   "flaja", 
   "Should I quote myself again? This entire thread you talked about income taxes then I said \"You gotta keep in mind a lot of social programs are not paid for with income taxes.\" to which you asked what programs are not paid for with taxes on income.\n\n \n No. I point-blank asked you to list social programs that are not paid for with taxes on income, wages or salaries. It is a favorite ploy of liberals to claim that payroll taxes are not taxes, but rather something akin to insurance premiums (retirement insurance, Medicare insurance, unemployment insurance etcetera). So I included payroll taxes in my question so you would have to include them in your answer. \n \n \nI assumed you meant income tax\n\n \n Only a fool would believe a tax on wages and salary is not a tax on income.\n \n \nThey pay the same rate up to 106k (or whatever it is now) for the taxes that are used to pay for those programs...would you prefer they pay an even higher rate?\n\n \n Seeing as how the government is flat broke and the poor are the main beneficiaries of these programs, yes. \n \n \ndo you want them to just pay for the full price of the program? Seems kinda worthless at that point.\n\n \n They could always do without the largesse of rich.", 
   {}, 
   407539, 
   null, 
   1279465980.0
  ], 
  [
   407582, 
   null, 
   "mata", 
   "I don't support either form of welfare, but at least corporations pay for part of theirs through taxes.\n\n \n \nThe Government Accountability Office said 72 percent of all foreign corporations and about 57 percent of U.S. companies doing business in the United States paid no federal income taxes for at least one year between 1998 and 2005.\n \n More than half of foreign companies and about 42 percent of U.S. companies paid no U.S. income taxes for two or more years in that period, the report said.\n \n During that time corporate sales in the United States totaled $2.5 trillion, according to Democratic Sens. Carl Levin of Michigan and Byron Dorgan of North Dakota, who requested the GAO study.\n Study says most corporations pay no U.S. income taxes | Reuters\n\n \n What compounds the problems associated with corporate welfare is the fact that corporations have no natural life spans (like people do). It's like providing welfare to immortals. In the financial sector, it has resulted in the American people funding a gambling casino on Wall Street. When they win, they keep the winnings, when they lose, we bail'em out. People act differently (bigtime) when there are natural consequences to behavior. \n \n There's an unholy alliance between government & big business (& legitimized by big religion but that, my friend, is another story). It's especially worrisome in the financial sector which provides much of the funding for big business. Big business is not just the USA, it's global.\n \n A recent USA Supreme Court ruling (you know the one) has guaranteed that corporations will continue to have special privileges granted to them (as opposed to people). \n \n Without corrective measures put into place (as in Glass Steagall types) - Why should anything change?\n \n One of the questions that springs to mind is, Is this way of doing things sustainable? i.e. is it self-sustaining or is it self-perpetuating?\n \n Another question is, what are corporations for? What is their purpose, their mission? In the case of the financial sector, is it providing financial services to actual people & corporations, or is it to generate profits for themselves? Or take the case of a corporation that's providing a more tangible product, a manufacturing corporation. What is their purpose, their mission? Is it to provide the product? Or is it to generate profits for themselves?\n \n The American people seem to have bought into an ideaology that suggests that a Corporation's purpose or mission is to generate a profit whether or not the 'product' is produced.\n \n China is a country which has continued to maintain a separation between commercial banking & the securities industries (similar to just one of the corrective measures or provisions of Glass Steagall). \n \n \nSecond Glass-Steagall Act \n The second Glass-Steagall Act, passed on June 16, 1933, and officially named the Banking Act of 1933, introduced the separation of bank types according to their business (commercial and investment banking), and it founded the Federal Deposit Insurance Corporation for insuring bank deposits. Literature in economics usually refers to this simply as the Glass-Steagall Act, since it had a stronger impact on US banking regulation. \n \n Impact on other countries \n The Glass-Steagall Act has had influence on the financial systems of other areas such as China which maintains a separation between commercial banking and the securities industries. In the aftermath of the financial panic of 2008-9, support for maintaining China's separation of investment and commercial banking remains strong. \n Glass-Steagall Act: Facts, Discussion Forum, and Encyclopedia Article \n\n \n \nIndividual welfare is seldom temporary and seldom paid for by the recipient. My father's older sister had 2 kids and was pregnant with her 3rd when her husband (a cop) was killed in a car wreck. She collected something like $250,000 in today's money in life insurance on her husband (back in the mid-1960s) and then collected a Social Security orphan's pension for each of her children until they turned 18. She collected more from the government each month than my mother was able to earn working 40-60 hours a week as a sales clerk and bookkeeper. My aunt collected far more in Social Security than she or husband could have ever paid in to Social Security.\n \n I have an elderly friend who has been in a nursing home since 2005. She never had more than a minimum wage job. She had a nervous breakdown when she was about 30 or so and has collected an SSI disability check every month for the 40+ years since then. Her check is about $900 a month. My mother, who worked for 30 years, had to go in SSI in 2001 due to lupus and arthritis, and it took 3 applications and a court fight to get Social Security to recognize her disability. The government then mandated that $5000 of her back benefits go to her lawyer and then because the government paid out the back benefits in a single amount she had to give a good bit of back to the government in income taxes. And her monthly check is only about $1400.\n \n I used to have a neighbor who has 3 children by 3 different men, only one of whom she was ever married to. She gets welfare of one sort or another for each of them when she hasn't worked in 20 years or more.\n\n \n Corporate welfare is \"seldom temporary & seldom paid for by the recipient\" (the last part of the statement is sortof oxymoronic, isn't it? - if it was paid for by the recipient, it wouldn't really be welfare?).\n \n I think there's a difference between people & corporations.\n \n \nLet your life be a counter friction to stop the machine.\n -Henry David Thoreau, Civil Disobedience\n", 
   {}, 
   407518, 
   null, 
   1279469880.0
  ], 
  [
   407591, 
   null, 
   "flaja", 
   "What compounds the problems associated with corporate welfare is the fact that corporations have no natural life spans (like people do). It's like providing welfare to immortals.\n\n \n Providing welfare to individuals in the same family generation after generation pretty much has the same effect. Welfare dependence generates welfare dependency.\n \n \nThere's an unholy alliance between government & big business (& legitimized by big religion but that, my friend, is another story).\n\n \n True. As a conservative I am generally opposed to big business because too much economic (and an awful lot of sociological) power is concentrated in them. Furthermore, an economy that is dominated by a few big companies is inherently unstable- think of what a bankruptcy for Walmart would do the world's economy. See nee thread on Walmart.\n \n \nA recent USA Supreme Court ruling (you know the one) has guaranteed that corporations will continue to have special privileges granted to them (as opposed to people). \n\n \n As long as big business is regulated by the government- and the Constitution is not changed- big business must have a right to lobby the government.\n \n \nOne of the questions that springs to mind is, Is this way of doing things sustainable? i.e. is it self-sustaining or is it self-perpetuating?\n\n \n Big business is inherently a destabilizing force.\n \n \nAnother question is, what are corporations for? What is their purpose, their mission? In the case of the financial sector, is it providing financial services to actual people & corporations, or is it to generate profits for themselves?\n\n \n Don't forget that a big corporation is only the sum of its shareholders. You cannot limit the rights a corporation without limiting the rights of the individual shareholders that ultimately own it.\n \n \nThe American people seem to have bought into an ideaology that suggests that a Corporation's purpose or mission is to generate a profit whether or not the 'product' is produced.\n\n \n Generating profit for shareholders [b]is[/i] the only purpose a corporation has. The procedures used to generate that profit don't matter in this regard even if particular procedures are immoral or otherwise detrimental to society.\n \n \n \n Quote:\n Second Glass-Steagall Act \n The second Glass-Steagall Act, passed on June 16, 1933, and officially named the Banking Act of 1933, introduced the separation of bank types according to their business (commercial and investment banking), and it founded the Federal Deposit Insurance Corporation for insuring bank deposits. Literature in economics usually refers to this simply as the Glass-Steagall Act, since it had a stronger impact on US banking regulation. \n \n Impact on other countries \n The Glass-Steagall Act has had influence on the financial systems of other areas such as China which maintains a separation between commercial banking and the securities industries. In the aftermath of the financial panic of 2008-9, support for maintaining China's separation of investment and commercial banking remains strong. \n Glass-Steagall Act: Facts, Discussion Forum, and Encyclopedia Article \n\n \n By and large I favor non-profit credit unions over banks of any kind for the sake of promoting local self-reliance. I don't like the idea of having big business control my personal economic decisions by controlling the marketplace.\n \n \nCorporate welfare is \"seldom temporary & seldom paid for by the recipient\" (the last part of the statement is sortof oxymoronic, isn't it? - if it was paid for by the recipient, it wouldn't really be welfare?).\n\n \n Then don't call it welfare. Call it insurance or investment- but don't take one person's money to pay for somebody else's insurance or investment.\n \n \nI think there's a difference between people & corporations.\n\n \n What is a corporation if not the sum of the individuals who own his stock?", 
   {
    "unicode_changes_made": true
   }, 
   407582, 
   null, 
   1279475100.0
  ], 
  [
   407608, 
   null, 
   "Steeeeve", 
   "Seeing as how the government is flat broke and the poor are the main beneficiaries of these programs, yes. \nSo what do you propose? Instead of 6.2% by the employee for SS would you would it to be what? And for who?", 
   {}, 
   407570, 
   null, 
   1279481040.0
  ], 
  [
   407614, 
   null, 
   "flaja", 
   "So what do you propose? Instead of 6.2% by the employee for SS would you would it to be what? And for who?\n\n \n If we did away with Social Security payments to people who haven't paid anything into Social Security (my aunt and her children, for instance), I don't think the tax rates would have to raised all that much.\n \n We could also allow people who are paying into Social Security to pay in at a higher rate for the sake of getting higher benefits.\n \n But then what we really need to do is privatize Social Security.", 
   {
    "unicode_changes_made": true
   }, 
   407608, 
   null, 
   1279485360.0
  ], 
  [
   407672, 
   null, 
   "mata", 
   "Providing welfare to individuals in the same family generation after generation pretty much has the same effect. Welfare dependence generates welfare dependency.\n\n \n Providing welfare to individuals is less costly. The \"Welfare Queens driving Welfare Cadillacs\" is a myth.\n \n There are Welfare Queens driving Welfare Cadillacs\n \n \nAs long as big business is regulated by the government- and the Constitution is not changed- big business must have a right to lobby the government.\n\n \n & the American people are left with the problems associated with a government being sold to the highest bidder. \n \n \n \nDon't forget that a big corporation is only the sum of its shareholders. You cannot limit the rights a corporation without limiting the rights of the individual shareholders that ultimately own it.\n\n \n Sounds like a modern day plantation or fiefdom.\n \n \nGenerating profit for shareholders [b]is[/i] the only purpose a corporation has. The procedures used to generate that profit don't matter in this regard even if particular procedures are immoral or otherwise detrimental to society.\n\n \n Sounds like a modern day plantation or fiefdom.\n \n \nBy and large I favor non-profit credit unions over banks of any kind for the sake of promoting local self-reliance. I don't like the idea of having big business control my personal economic decisions by controlling the marketplace.\n\n \n You'll have to time-travel back to before the American people allowed Glass Steagall to be dismantled.\n \n \n \nThen don't call it welfare. Call it insurance or investment- but don't take one person's money to pay for somebody else's insurance or investment.\n\n \n Tell that to the financial sector. They're all ears. Har har!\n \n \nWhat is a corporation if not the sum of the individuals who own his stock?\n\n \n Why is an economy based on the 'corporate' model any different than an economy based on the 'plantation' model?\n \n The plantation was the sum of the individuals who were associated with it, some (a small percentage) owned the land, others (a large percentage) worked the land. \n \n It's not as difficult to provide benefits (as in healthcare, education, pursuit of individual goals, more) when you only have to be concerned with a small percentage of the population.\n \n Not dissing the Constitution, however people sometimes act as if the Constitution was written as a Business Plan.", 
   {
    "unicode_changes_made": true
   }, 
   407591, 
   null, 
   1279544100.0
  ], 
  [
   407676, 
   null, 
   "flaja", 
   "Providing welfare to individuals is less costly. The \"Welfare Queens driving Welfare Cadillacs\" is a myth.\n\n \n It is not a myth. You obviously have never waited in the checkout line at the grocery store being barely able to afford hamburger while people ahead of you are buying steak with food stamps. I know this situation exists because it is my personal experience. It is not the cost of welfare that bothers me so much as it is the morality of welfare. \n \n \n& the American people are left with the problems associated with a government being sold to the highest bidder.\n\n \n We will always have this under the current Constitution. That highest bidder can be an individual person as easily as it can be a corporation. \n \n \nSounds like a modern day plantation or fiefdom.\n\n \n How so? Define plantation. Define fiefdom.\n \n \nYou'll have to time-travel back to before the American people allowed Glass Steagall to be dismantled.\n\n \n When did I say anything about having it dismantled?\n \n \nTell that to the financial sector. They're all ears. Har har!\n\n \n What are you talking about? Nobody is compelled to put their money in a bank, but some of us are compelled to pay taxes to support the welfare state.\n \n \nWhy is an economy based on the 'corporate' model any different than an economy based on the 'plantation' model?\n\n \n You tell me; you are the one making the comparison, not me.\n \n \nThe plantation was the sum of the individuals who were associated with it, some (a small percentage) owned the land, others (a large percentage) worked the land.\n\n \n The American plantation was also based on slavery. The shareholders of a corporation own the corporation and that corporation must pay its workers the prevailing market wage.", 
   {
    "unicode_changes_made": true
   }, 
   407672, 
   null, 
   1279547580.0
  ], 
  [
   407767, 
   null, 
   "Steeeeve", 
   "If we did away with Social Security payments to people who haven't paid anything into Social Security (my aunt and her children, for instance), I don't think the tax rates would have to raised all that much.\nSo you prefer no welfare or disability benefits or other benefits to people who have 1) never held a job or 2) are children. Interesting stance. That won't account for the unfunded liability we still have. How you propose we pay for that?\n \n \nWe could also allow people who are paying into Social Security to pay in at a higher rate for the sake of getting higher benefits.\nSomeone would only pay into social security MORE if they were going to get more out of it than they put in unless you keep it as an insurance policy against things like disability and what not. But at that point you really do make it an insurance program.\n \n \nBut then what we really need to do is privatize Social Security.\nThis is one of those good ideas on paper thing. I used to think that until I saw the zero benefits of it.", 
   {
    "unicode_changes_made": true
   }, 
   407614, 
   null, 
   1279600560.0
  ], 
  [
   407779, 
   null, 
   "mata", 
   "It is not a myth. You obviously have never waited in the checkout line at the grocery store being barely able to afford hamburger while people ahead of you are buying steak with food stamps. I know this situation exists because it is my personal experience. It is not the cost of welfare that bothers me so much as it is the morality of welfare.\n \n \n Conservatives/Libertaryans/Others seem to like to tell personal stories, 'homey' anecdotes or spin some sortof inane soundbite that, (to their credit) captures the essence of their beliefs on an issue.\n \n What is discreditable is how often this results in people (in a sheeplike or bovinish manner) being 'hooked in' by their emotions & often stop thinking any further about root causes, underlying factors, or more simply, what are the real questions we're facing? \n \n In this particular example & issue, Reagan, the Actor President, spun his stories, perpetuated the myths &, most importantly, diverted the American peoples' attention from the financial realities. From the above piece:\n \n \nIt diverted public attention from insider traders in their limousines to Welfare Queens in their Cadillacs, even though the former were stealing thousands of times more from the American people than the latter. Just one example of the cost of white collar crime would become apparent a few years later, when President Bush bailed out the Savings & Loans industry with $500 billion of the taxpayer's money -- enough to fund 20 years of federal AFDC. \n\n \n \nWe will always have this under the current Constitution. That highest bidder can be an individual person as easily as it can be a corporation.\n \n [*]This is as likely as hell freezing over.[*]In the unlikely chance this ever happened, the American people will happily give over their government to a dictactorship, monarchy, et cetera? Is this what we want?\n \nHow so? Define plantation. Define fiefdom.\n\n You already did & what's even more strange, you seem pleased.\n \n \nWhen did I say anything about having it dismantled?\n\n \n You offer no solutions.\n \n \nWhat are you talking about? Nobody is compelled to put their money in a bank, but some of us are compelled to pay taxes to support the welfare state.\n\n \n What is the alternative to putting money in banks? (again, no solutions)\n \n \n \nThe American plantation was also based on slavery. The shareholders of a corporation own the corporation and that corporation must pay its workers the prevailing market wage.\n\n \n I agree the American plantation was based on slavery. There are some who don't agree with this premise (see History subforum). \n \n Are you suggesting a paraphrase of Abraham Lincoln's famous quote?\nGovernment of the people, by the people, for the people, shall not perish from the Earth. \n Abraham Lincoln \n\n \n A Government of the Corporation, by the Corporation, for the Corporation, shall not perish from the Earth.\n \n Somehow, this just doesn't have the same ring to it.", 
   {}, 
   407676, 
   null, 
   1279628640.0
  ], 
  [
   407786, 
   null, 
   "flaja", 
   "So you prefer no welfare or disability benefits or other benefits to people who have 1) never held a job or 2) are children.\n\n \n I haven't said this. I am not complaining about welfare programs; they do help reduce mass concentrations of wealth and poverty so they do help maintain societal stability. What I object to is having people get benefits that they become dependent on or which that the country cannot afford. \n \n \nSomeone would only pay into social security MORE if they were going to get more out of it than they put in unless you keep it as an insurance policy against things like disability and what not. But at that point you really do make it an insurance program.\n\n \n Isn't Social Security supposed to be an insurance program? It isn't called social insurance for nothing, is it? And right now it isn't a matter of paying more to get more coverage because taxpayers don't have a choice about what they must pay since the law says what they must pay.\n \n \nThis is one of those good ideas on paper thing. I used to think that until I saw the zero benefits of it.\n\n \n If it has never been tried, how do you know it has zero benefits?\n \n See new thread.", 
   {
    "unicode_changes_made": true
   }, 
   407767, 
   null, 
   1279635900.0
  ], 
  [
   407788, 
   null, 
   "flaja", 
   "In this particular example & issue, Reagan, the Actor President, spun his stories, perpetuated the myths &, most importantly, diverted the American peoples' attention from the financial realities.\n\n \n Welfare spending went up under Reagan, so what are you libs complaining about? \n \n \n\n 1. This is as likely as hell freezing over. \n 2. In the unlikely chance this ever happened, the American people will happily give over their government to a dictactorship, monarchy, et cetera? Is this what we want?\n \n\n \n Why is it that you can complain that Americans have turned their nation over to rich corporations, but then insist that we'd never turn our nation over to rich individuals?\n \n \nYou offer no solutions.\n\n \n Did you ask for any solutions? I did say that I generally oppose banks and prefer credit unions.\n \n \nWhat is the alternative to putting money in banks? (again, no solutions)\n\n \n Credit unions, mattresses, private loans.\n \n \nAre you suggesting a paraphrase of Abraham Lincoln's famous quote? \n Quote:\n Government of the people, by the people, for the people, shall not perish from the Earth. \n Abraham Lincoln \n A Government of the Corporation, by the Corporation, for the Corporation, shall not perish from the Earth.\n\n \n No. I fully support the idea of reducing corporate influence in American politics, but it would take a constitutional amendment to do this. I wouldn't restrict a corporation's or anybody else's freedom of speech or freedom of the press. But I would amend the Constitution so no candidate for public office could accept campaign money from anyone other than individual persons who are qualified to vote for them.", 
   {
    "unicode_changes_made": true
   }, 
   407779, 
   null, 
   1279636740.0
  ], 
  [
   407797, 
   null, 
   "Steeeeve", 
   "I haven't said this. I am not complaining about welfare programs; they do help reduce mass concentrations of wealth and poverty so they do help maintain societal stability. What I object to is having people get benefits that they become dependent on or which that the country cannot afford.\nWell this is fine but you said we should stop giving the money to some people. I'm just wondering who and how much would this save? Furthermore, you gotta find a way to pay for the rest because those \"surpluses\" you hear about do not exist but are bonds that need to be repaid. \n \n \nIsn't Social Security supposed to be an insurance program?\nYou would think but in reality it is a giant pension-ish plan only with this plan the money is \"invested\" in t-bills (aka borrowed it to yourself). And people think the GM pension plan was messed up!\n \n \nIt isn't called social insurance for nothing, is it?\nI think we both no the answer to this one :p\n \n \nIf it has never been tried, how do you know it has zero benefits?\nBecause it has been tried on a limited basis. The result wasn't really a benefit...wasn't much of a negative either to be honest. If you had a gun to my head I would say the only thing that could be conceived as a benefit would be the fact that private companies generally cannot scr*w over the people as easy as the feds can...and the private companies can do it fairly easily.", 
   {
    "unicode_changes_made": true
   }, 
   407786, 
   null, 
   1279644060.0
  ], 
  [
   407818, 
   null, 
   "flaja", 
   "Well this is fine but you said we should stop giving the money to some people. I'm just wondering who and how much would this save?\n\n \n At this point I am more concerned with the societal effects of welfare than I am the financial effects. The financial cost of welfare is bad, but the disruptive effect welfare has on society is worse.\n \n I would end AFDC, food stamps, free/reduced school lunches, rent subsidies/public housing and government backed mortgage and college loans for any household with minor children:\n \n 1. Whenever any adult in the household with minor children is not married to the other parent of at least one of their children;\n \n 2. Whenever any school-age member of the household is truant from school more than twice in any given academic grading period or more than 3 times in any given school year;\n \n 3. Whenever any member of the household is convicted of any violent crime;\n \n 4. Whenever any member of the household is convicted of any drug offense;\n \n 5. Whenever any member of the household has more than one illegitimate child.\n \n I would also end daycare subsidies (society needs stay-at-home mothers and married parents), Head Start (a waste of money) and Kindergarten for children under the age of 5 (daycare under another name).\n \n \nFurthermore, you gotta find a way to pay for the rest because those \"surpluses\" you hear about do not exist but are bonds that need to be repaid.\n\n \n Programs that are now being paid for with Social Security money when the recipients haven't paid anything into Social Security should have never been paid for with Social Security taxes. We need to find other sources of revenue for these programs, or simply do away with them.\n \n \nYou would think but in reality it is a giant pension-ish plan only with this plan the money is \"invested\" in t-bills (aka borrowed it to yourself). And people think the GM pension plan was messed up!\n\n \n Social Security is, and always has been, an income re-distribution ponzi scheme. The program started with people who never paid into it getting benefits from it anyway.\n \n \nBecause it has been tried on a limited basis.\n\n \n When and where has Social Security ever been privatized?", 
   {
    "unicode_changes_made": true
   }, 
   407797, 
   null, 
   1279664340.0
  ], 
  [
   407829, 
   null, 
   "Steeeeve", 
   "When and where has Social Security ever been privatized?\nThe GAO did a study back some time ago on this...look it up or search this forum.", 
   {}, 
   407818, 
   null, 
   1279665780.0
  ], 
  [
   407837, 
   null, 
   "flaja", 
   "The GAO did a study back some time ago on this...look it up or search this forum.\n\n \n How can a mere study from God knows when, be pertinent to today's situation? The fact remains that when the Baby Boomers begin selling off the assets of their 401(k)s and IRAs to have money to live on, the market value of these assets will decline if there are no new investors with the willingness and wherewithal to buy them. Thus Boomers won't have as much retirement income as they had expected to have.", 
   {
    "unicode_changes_made": true
   }, 
   407829, 
   null, 
   1279668060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Conservatives must support higher taxes", 
  "url": "http://www.4forums.com/political/politics-debates/14450-conservatives-must-support-higher-taxes.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 14450, 
  "discussion_files": [
   [
    "26252.html", 
    "http://www.4forums.com/political/politics-debates/14450-conservatives-must-support-higher-taxes-print.html"
   ], 
   [
    "26253.html", 
    "http://www.4forums.com/political/politics-debates/14450-conservatives-must-support-higher-taxes-4-print.html"
   ], 
   [
    "26254.html", 
    "http://www.4forums.com/political/politics-debates/14450-conservatives-must-support-higher-taxes-3-print.html"
   ], 
   [
    "26255.html", 
    "http://www.4forums.com/political/politics-debates/14450-conservatives-must-support-higher-taxes-2-print.html"
   ]
  ], 
  "identifier": 14450
 }
]