[
 [
  [
   407989, 
   null, 
   "NATO 556", 
   "For a long time the various gun control organizations have been using California as a model of what the country could be, claiming that they're the safest state in the nation because of all the gun control laws that they've passed over the years. Well it seems that the Violence Policy Center has decided to admit that this is nothing more than a lie.\n \n VPC - Press Release - (07/21/2010) - National State-by-State Study of Drive-By Shootings Reveals Data on Victims, Time, Location\n \n \n# California led the nation in the number of drive-by shootings with 148 shootings, killing 40 and injuring 129. Following California were: Texas, 60 drive-by shootings, killing six and injuring 52; Florida, 48 drive-by shootings, killing 10 and injuring 42; Illinois, 38 drive-by shootings, killing 18 and injuring 53; and, Washington, 38 drive-by shootings, killing three and injuring 21.\n\n \n 148 drive by shootings in California, with all of their damn gun control laws. More than twice the number of Texas. More than three times the number of drive by shootings than in Florida, which gun control groups have claimed to be the most deadly of sates because they were the first to pass shall-issue concealed carry laws, and the castle doctrine.\n \n Now if gun control is supposed to work, how did 148 drive by shootings occur in just six months, in a state that earned an A rating from the Brady Campaign when they were handing out grade cards?", 
   {
    "post_info": {
     "post_title": "Gun control doesn't make anyone safer"
    }
   }, 
   null, 
   null, 
   1279762680.0
  ], 
  [
   407997, 
   null, 
   "sinjin", 
   "Could you please post something where CA(or?) is claiming to be the safest State in the Nation?\n \n Btw CA has 15 million more people than Texas and 20 mil more than Florida, for starters.", 
   {}, 
   407989, 
   null, 
   1279764900.0
  ], 
  [
   407998, 
   null, 
   "Galileo", 
   "A few cherry picked facts about California don't prove anything. People die in traffic accidents too. That doesn't mean that traffic laws don't make anyone safer.", 
   {}, 
   407997, 
   null, 
   1279765380.0
  ], 
  [
   408005, 
   null, 
   "NATO 556", 
   "Could you please post something where CA(or?) is claiming to be the safest State in the Nation?\n\n \n I said the Brady Campaign and other gun control groups made the statement of California being safe. Their message is that gun control makes people safer. They gave California an A rating for their high levels of gun control. Putting those two facts together they're endorsing California as being a safe state.", 
   {}, 
   407997, 
   null, 
   1279768980.0
  ], 
  [
   408006, 
   null, 
   "NATO 556", 
   "A few cherry picked facts about California don't prove anything.\n\n \n So says the master of cherry picking.\n \n \nPeople die in traffic accidents too. That doesn't mean that traffic laws don't make anyone safer.\n\n \n Drive by shootings aren't comparable to traffic accidents. One of them is just that, accidents. The other is an act of cold blooded murder. They're not the same thing.\n \n California has an A rating from the Brady Campaign, meaning they have the highest rate of gun control in the country. So what exactly is the excuse for them having the highest rate of drive by shootings in the entire country?", 
   {}, 
   407998, 
   null, 
   1279769340.0
  ], 
  [
   408032, 
   null, 
   "Galileo", 
   "So says the master of cherry picking.\n Drive by shootings aren't comparable to traffic accidents. One of them is just that, accidents. The other is an act of cold blooded murder. They're not the same thing.\n\n Of course they're not the same thing, but you're dodging the point- the mere fact that bad things happen does not disprove the ineffectiveness of laws that are intended to prevent those bad things from happening. \n \n \nCalifornia has an A rating from the Brady Campaign, meaning they have the highest rate of gun control in the country. So what exactly is the excuse for them having the highest rate of drive by shootings in the entire country?\n\n Having the highest total number of drive by shootings does not necessarily equate with having the highest rate of drive by shootings. I think Sinjin already pointed this out.", 
   {}, 
   408006, 
   null, 
   1279778880.0
  ], 
  [
   408036, 
   null, 
   "NATO 556", 
   "Of course they're not the same thing, but you're dodging the point- the mere fact that bad things happen does not disprove the ineffectiveness of laws that are intended to prevent those bad things from happening.\n\n \n Actually it does. Gangbangers and other criminals aren't allowed to possess firearms. Having an unregistered firearm is illegal in California. You need a license to own a handgun in California. Transporting an uncased, loaded firearm in California is a crime. Carrying a concealed weapon without a nearly impossible to get permit is a crime. Open carry of a loaded weapon is a crime. If the governor doesn't show some backbone then soon the open carry of an unloaded firearm will also be a crime.\n \n All of these acts are crimes. Plenty for the police to arrest the people doing the drive by shootings, plenty of offenses to file charges on. The police have all the tools they'd need for keeping the people of California safe, and yet California still has the highest number of drive by shootings in the entire nation.\n \n Wise up. Gun control laws are doing nothing to protect anyone. And if they were helping take \"guns off the streets\" and \"out of the hands of the bad guys\" then this high number wouldn't have happened.\n \n \nHaving the highest total number of drive by shootings does not necessarily equate with having the highest rate of drive by shootings. I think Sinjin already pointed this out.\n\n \n California still has the highest number of drive by shootings, and the highest rate of gun control at the same time. Obviously gun control is doing nothing to make California any safer, otherwise these numbers wouldn't be able to take place in such an alarmingly easy manner.", 
   {}, 
   408032, 
   null, 
   1279782120.0
  ], 
  [
   408057, 
   null, 
   "Tither", 
   "  The Brady campaign state gun law score card. \n California has 79 points. \n The legend tells us 75 points or more gives that state the highest possible rating which is 4 stars! Count them. ==< * * * * \n \n Ohio on the other hand, has only 11 points which equals one very lonely star. * \n\n \n According to the FBI's Uniform crime rate. \n   Violent crime rate per 100,000. Calif = 503.8 Ohio = 348.2  \n Am I cherry picking? Sinjin asked the question, and lives in California. I live in Ohio, but I only have one star on the Brady score card. \n \n Am I sad about only having one star and a violent crime rate of 348? \n \n Noooooooope!", 
   {}, 
   408036, 
   null, 
   1279813740.0
  ], 
  [
   408061, 
   null, 
   "Doc Jones", 
   "Gun control makes it safer for terrorists, tyrants and criminals.\n \n The right to KBA makes it safer for citizens and law abiding folks...of course the gun control they exercise is a firm two handed grip :)", 
   {
    "post_info": {
     "post_title": "Nato, I disagree with your premise:"
    }
   }, 
   408057, 
   null, 
   1279815840.0
  ], 
  [
   408068, 
   null, 
   "sinjin", 
   "I said the Brady Campaign and other gun control groups made the statement of California being safe. Their message is that gun control makes people safer. They gave California an A rating for their high levels of gun control. Putting those two facts together they're endorsing California as being a safe state.\n\n \n Actually, you said:\n \n \n...California as a model of what the country could be, claiming that they're the safest state in the nation because of all the gun control laws that they've passed over the years.\n\n \n An \"A\" rating equates to the Brady folks' approval of CA gun regulations. That's not a claim that CA is the \"safest State\".", 
   {}, 
   408005, 
   null, 
   1279817580.0
  ], 
  [
   408069, 
   null, 
   "Tither", 
   " An \"A\" rating equates to the Brady folks' approval of CA gun regulations. \n \n That's not a claim that CA is the \"safest State\".\n\n Yeah, because the Brady ratings and approval of a particular states gun laws has no bearing on reality as far as crime and safety goes! Which is Nato's real point!", 
   {}, 
   408068, 
   null, 
   1279817880.0
  ], 
  [
   408071, 
   null, 
   "sinjin", 
   "Yeah, because the Brady ratings and approval of a particular states gun laws has no bearing on reality as far as crime and safety goes! Which is Nato's real point!\nIncluding those laws providing for CCW.", 
   {}, 
   408069, 
   null, 
   1279818060.0
  ], 
  [
   408072, 
   null, 
   "sinjin", 
   "Here you go:\n \n New Hampshire named safest state in the country - Boston.com\n \n The Brady folks score it a 9/100:\n \n http://www.bradycampaign.org/stategunlaws/scorecard/NH\n \n The population of NH is just over 1.2 million people.\n Manchester, the largest town, has a population under 110,000.\n \n The population of just the City of Los Angeles is about three times that of the entire State of NH.\n The County of Los Angeles about eight times that of the entire State of NH.", 
   {}, 
   408071, 
   null, 
   1279818180.0
  ], 
  [
   408096, 
   null, 
   "sinjin", 
   "Apparently gun ownership doesn't make you safer either.\n \n Rates of Household Firearm Ownership and Homicide Across US Regions and States, 1988?1997\n \n Results \n In region- and state-level analyses, a robust association between rates of household firearm ownership and homicide was found. Regionally, the association exists for victims aged 5 to 14 years and those 35 years and older. At the state level, the association exists for every age group over age 5, even after controlling for poverty, urbanization, unemployment, alcohol consumption, and nonlethal violent crime.\n \n Conclusions \n Although our study cannot determine causation, we found that in areas where household firearm ownership rates were higher, a disproportionately large number of people died from homicide.\n \n sinjin - Hawaii has the lowest rate of household gun ownership and the lowest rate of gun homicide.\n \n http://www.cagvedfund.org/CAGV%20OpEd%20Gun%20Death.pdf", 
   {}, 
   408072, 
   null, 
   1279826220.0
  ], 
  [
   408099, 
   null, 
   "NATO 556", 
   "Sinjin-\n \n Well then let's hear from you. How exactly is California home to the greatest number of drive by shootings? What exactly is keeping the police from stopping stuff like this from happening. Exactly what new laws do you need, on top of the ones you already have, before you can actually start addressing the issue of armed gangs killing people for no good reason?", 
   {}, 
   407989, 
   null, 
   1279827240.0
  ], 
  [
   408102, 
   null, 
   "sinjin", 
   "Sinjin-\n \n Well then let's hear from you. How exactly is California home to the greatest number of drive by shootings?\nNearly 40 million people and home to the largest number of gang members of any State in the Union. That's how. \n \n \nWhat exactly is keeping the police from stopping stuff like this from happening.\nSheer numbers and an inability of LE to be everywhere all the time. \n That and the fact LE generally needs probable cause to pull you over. Pesky Constitution. \n \n \nExactly what new laws do you need, on top of the ones you already have, before you can actually start addressing the issue of armed gangs killing people for no good reason?\nThe gang members would disagree with your \"no good reason\" stance. \n I'm not asking for any new laws to address drive-by shootings. \n Do I believe such laws could be crafted? I have my doubts.\n \n http://www.popcenter.org/problems/drive_by_shooting/summary\n http://www.cops.usdoj.gov/files/ric/Publications/e02072864.pdf", 
   {}, 
   408099, 
   null, 
   1279830540.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun control doesn't make anyone safer", 
  "url": "http://www.4forums.com/political/gun-control-debates/14481-gun-control-doesnt-make-anyone-safer.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14481, 
  "discussion_files": [
   [
    "4434.html", 
    "http://www.4forums.com/political/gun-control-debates/14481-gun-control-doesnt-make-anyone-safer-print.html"
   ], 
   [
    "4435.html", 
    "http://www.4forums.com/political/gun-control-debates/14481-gun-control-doesnt-make-anyone-safer-2-print.html"
   ]
  ], 
  "identifier": 14481
 }
]