[
 [
  [
   408508, 
   null, 
   "zsu2357", 
   "Raging Against Self Defense:\n A Psychiatrist Examines The Anti-Gun Mentality\n \n By Sarah Thompson, M.D.\n righter@therighter.com\n \n \"You don't need to have a gun; the police will protect you.\"\n \n \"If people carry guns, there will be murders over parking spaces and neighborhood basketball games.\"\n \n \"I'm a pacifist. Enlightened, spiritually aware people shouldn't own guns.\"\n \n \"I'd rather be raped than have some redneck militia type try to rescue me.\" \n \n How often have you heard these statements from misguided advocates of victim disarmament, or even woefully uninformed relatives and neighbors? Why do people cling so tightly to these beliefs, in the face of incontrovertible evidence that they are wrong? Why do they get so furiously angry when gun owners point out that their arguments are factually and logically incorrect?\n \n How can you communicate with these people who seem to be out of touch with reality and rational thought?\n \n One approach to help you deal with anti-gun people is to understand their psychological processes. Once you understand why these people behave so irrationally, you can communicate more effectively with them.\n \n Defense Mechanisms\n \n Projection\n \n About a year ago I received an e-mail from a member of a local Jewish organization. The author, who chose to remain anonymous, insisted that people have no right to carry firearms because he didn't want to be murdered if one of his neighbors had a \"bad day\". (I don't know that this person is a \"he\", but I'm assuming so for the sake of simplicity.) I responded by asking him why he thought his neighbors wanted to murder him, and, of course, got no response. The truth is that he's statistically more likely to be murdered by a neighbor who doesn't legally carry a firearm1 and more likely to be shot accidentally by a law enforcement officer.1\n \n How does my correspondent \"know\" that his neighbors would murder him if they had guns? He doesn't. What he was really saying was that if he had a gun, he might murder his neighbors if he had a bad day, or if they took his parking space, or played their stereos too loud. This is an example of what mental health professionals call projection - unconsciously projecting one's own unacceptable feelings onto other people, so that one doesn't have to own them.3 In some cases, the intolerable feelings are projected not onto a person, but onto an inanimate object, such as a gun,4 so that the projector believes the gun itself will murder him.\n \n Projection is a defense mechanism. Defense mechanisms are unconscious psychological mechanisms that protect us from feelings that we cannot consciously accept.5 They operate without our awareness, so that we don't have to deal consciously with \"forbidden\" feelings and impulses. Thus, if you asked my e-mail correspondent if he really wanted to murder his neighbors, he would vehemently deny it, and insist that other people want to kill him.\n \n Projection is a particularly insidious defense mechanism, because it not only prevents a person from dealing with his own feelings, it also creates a world where he perceives everyone else as directing his own hostile feelings back at him.6\n \n All people have violent, and even homicidal, impulses. For example, it's common to hear people say \"I'd like to kill my boss\", or \"If you do that one more time I'm going to kill you.\" They don't actually mean that they're going to, or even would, kill anyone; they're simply acknowledging anger and frustration. All of us suffer from fear and feelings of helplessness and vulnerability. Most people can acknowledge feelings of rage, fear, frustration, jealousy, etc. without having to act on them in inappropriate and destructive ways.\n \n Some people, however, are unable consciously to admit that they have such \"unacceptable\" emotions. They may have higher than average levels of rage, frustration, or fear. Perhaps they fear that if they acknowledge the hostile feelings, they will lose control and really will hurt someone. They may believe that \"good people\" never have such feelings, when in fact all people have them.\n \n This is especially true now that education \"experts\" commonly prohibit children from expressing negative emotions or aggression. Instead of learning that such emotions are normal, but that destructive behavior needs to be controlled, children now learn that feelings of anger are evil, dangerous and subject to severe punishment.7To protect themselves from \"being bad\", they are forced to use defense mechanisms to avoid owning their own normal emotions. Unfortunately, using such defense mechanisms inappropriately can endanger their mental health; children need to learn how to deal appropriately with reality, not how to avoid it.8\n \n (This discussion of psychological mechanisms applies to the average person who is uninformed, or misinformed, about firearms and self-defense. It does not apply to the anti- gun ideologue. Fanatics like Charles Schumer know the facts about firearms, and advocate victim disarmament consciously and willfully in order to gain political power. This psychological analysis does not apply to them.)\n \n Denial\n \n Another defense mechanism commonly utilized by supporters of gun control is denial. Denial is simply refusing to accept the reality of a given situation.9 For example, consider a woman whose husband starts coming home late, has strange perfume on his clothes, and starts charging flowers and jewelry on his credit card. She may get extremely angry at a well-meaning friend who suggests that her husband is having an affair. The reality is obvious, but the wronged wife is so threatened by her husband's infidelity that she is unable to accept it, and so denies its existence.\n \n Anti-gun people do the same thing. It's obvious that we live in a dangerous society, where criminals attack innocent people. Just about everyone has been, or knows someone who has been, victimized. It's equally obvious that law enforcement can't protect everyone everywhere 24 hours a day. Extensive scholarly research demonstrates that the police have no legal duty to protect you10 and that firearm ownership is the most effective way to protect yourself and your family.11 There is irrefutable evidence that victim disarmament nearly always precedes genocide.12 Nonetheless, the anti-gun folks insist, despite all evidence to the contrary, that \"the police will protect you\", \"this is a safe neighborhood\" and \"it can't happen here\", where \"it\" is everything from mugging to mass murder.\n \n Anti-gun people who refuse to accept the reality of the proven and very serious dangers of civilian disarmament are using denial to protect themselves from the anxiety of feeling helpless and vulnerable. Likewise, gun owners who insist that \"the government will never confiscate my guns\" are also using denial to protect themselves from the anxiety of contemplating being forcibly disarmed and rendered helpless and vulnerable.\n \n Reaction Formation\n \n Reaction formation is yet another defense mechanism common among the anti-gun folks. Reaction formation occurs when a person's mind turns an unacceptable feeling or desire into its complete opposite.13 For example, a child who is jealous of a sibling may exhibit excessive love and devotion for the hated brother or sister.\n \n Likewise, a person who harbors murderous rage toward his fellow humans may claim to be a devoted pacifist and refuse to eat meat or even kill a cockroach.14 Often such people take refuge in various spiritual disciplines and believe that they are \"superior\" to \"less civilized\" folks who engage in \"violent behavior\" such as hunting, or even target shooting. They may devote themselves to \"animal welfare\" organizations that proclaim that the rights of animals take precedence over the rights of people.15 This not only allows the angry person to avoid dealing with his rage, it allows him actually to harm the people he hates without having to know he hates them.\n \n This is not meant to disparage the many wonderful people who are pacifists, spiritually inclined, vegetarian, or who support animal welfare. The key issue is not the belief itself, but rather the way in which the person experiences and lives his beliefs. Sincere practitioners seek to improve themselves, or to be helpful in a gentle, respectful fashion. They work to persuade others peacefully by setting an example of what they believe to be correct behavior. Sincere pacifists generally exhibit good will towards others, even towards persons with whom they might disagree on various issues.\n \n Contrast the sincere pacifist or animal lover with the strident, angry person who wants to ban meat and who believes murdering hunters is justified in order to \"save the animals\" - or the person who wants to outlaw self- defense and believes innocent people have the obligation to be raped and murdered for the good of society. For example, noted feminist Betty Friedan said \"that lethal violence even in self defense only engenders more violence.\"16 The truly spiritual, pacifist person refrains from forcing others to do what he believes, and is generally driven by positive emotions, while the angry person finds \"socially acceptable\" ways to harm, abuse, or even kill, his fellow man.\n \n In the case of anti-gun people, reaction formation keeps any knowledge of their hatred for their fellow humans out of consciousness, while allowing them to feel superior to \"violent gun owners\". At the same time, it also allows them to cause serious harm, and even loss of life, to others by denying them the tools necessary to defend themselves. This makes reaction formation very attractive from a psychological point of view, and therefore very difficult to counteract.\n \n Defense mechanisms are normal. All of us use them to some extent, and their use does not imply mental illness. Advocates of victim disarmament may be misguided or uninformed, they may be stupid, or they may be consciously intent on evil, but that doesn't necessarily mean they are \"mentally ill\".\n \n Some defense mechanisms, however, are healthier than others. A safe general rule is that a defense is healthy if it helps you to function better in your personal and professional life, and unhealthy if it interferes with your life, your relationships, or the well-being of others. Young children utilize projection and denial much more commonly than do healthy adults. On the other hand, \"if projection is used as a defense mechanism to a very great extent in adult life, the user's perception of external reality will be seriously distorted.\"17\n \n Defense mechanisms are also frequently combined, so that an anti-gun person may use several defense mechanisms simultaneously. For example, my unfortunate correspondent uses projection to create a world in which all his neighbors want to murder him. As a result, he becomes more angry and fearful, and needs to employ even more defense mechanisms to cope. So he uses projection to attribute his own rage to others, he uses denial that there is any danger to protect himself from a world where he believes he is helpless and everyone wants to murder him, and he uses reaction formation to try to control everyone else's life because his own is so horribly out of control.\n \n Also, it's important to remember that not all anti-gun beliefs are the result of defense mechanisms. Some people suffer from gun phobia18, an excessive and completely irrational fear of firearms, usually caused by the anti-gun conditioning they've been subjected to by the media, politicians, so-called \"educators,\" and others. In some cases, gun phobia is caused by an authentic bad experience associated with a firearm. But with all due respect to Col. Jeff Cooper, who coined the term \"hoplophobia\" to describe anti-gun people, most anti-gun people do not have true phobias. Interestingly, a person with a true phobia of guns realizes his fear is excessive or unreasonable,19 something most anti-gun folks will never admit.\n \n Defense mechanisms distort reality\n \n Because defense mechanisms distort reality in order to avoid unpleasant emotions, the person who uses them has an impaired ability to recognize and accept reality. This explains why my e-mail correspondent and many other anti-gun people persist in believing that their neighbors and co- workers will become mass murderers if allowed to own firearms.\n \n People who legally carry concealed firearms are actually less violent and less prone to criminal activity of all kinds than is the general population.20 A person who has a clean record, has passed an FBI background check, undergone firearms training, and spent several hundred dollars to get a permit and a firearm, is highly unlikely to choose to murder a neighbor. Doing so would result in his facing a police manhunt, a trial, prison, possibly capital punishment, and the destruction of his family, job, and reputation. Obviously it would make no sense for such a person to shoot a neighbor - except in self-defense. Equally obviously, the anti-gun person who believes that malicious shootings by ordinary gun owners are likely to occur is not in touch with reality.21\n \n The Common Thread: Rage\n \n In my experience, the common thread in anti-gun people is rage. Either anti-gun people harbor more rage than others, or they're less able to cope with it appropriately. Because they can't handle their own feelings of rage, they are forced to use defense mechanisms in an unhealthy manner. Because they wrongly perceive others as seeking to harm them, they advocate the disarmament of ordinary people who have no desire to harm anyone. So why do anti-gun people have so much rage and why are they unable to deal with it in appropriate ways? Consider for a moment that the largest and most hysterical anti-gun groups include disproportionately large numbers of women, African- Americans and Jews. And virtually all of the organizations that claim to speak for these \"oppressed people\" are stridently anti-gun. Not coincidentally, among Jews, Blacks and women there are many \"professional victims\" who have little sense of identity outside of their victimhood.\n \n Identity as Victim\n \n If I were to summarize this article in three sentences, they would be:\n \n (1) People who identify themselves as \"victims\" harbor excessive amounts of rage at other people, whom they perceive as \"not victims.\"\n \n (2) In order psychologically to deal with this rage, these \"victims\" utilize defense mechanisms that enable them to harm others in socially acceptable ways, without accepting responsibility or suffering guilt, and without having to give up their status as \"victims.\"\n \n (3) Gun owners are frequently the targets of professional victims because gun owners are willing and able to prevent their own victimization. \n \n Thus the concept of \"identity as victim\" is essential. How and why do members of some groups choose to identify themselves as victims and teach their children to do the same? While it's true that women, Jews, and African- Americans have historically been victimized, they now participate in American society on an equal basis. And other groups, most notably Asian-Americans, have been equally victimized, and yet have transcended the \"eternal victim\" mentality.\n \n Why, for example, would a 6'10\" NBA player who makes $10 million a year see himself as a \"victim\"? Why would a successful, respected, wealthy, Jewish physician regard himself as a \"victim\"? Conversely, why might a wheelchair bound woman who lives on government disability NOT regard herself as a victim?\n \n I would argue it's because the basketball player and the physician believe that their identities are dependent on being victims - not because they have actually been victimized, but because they're members of groups that claim victim status. Conversely, the disabled woman was probably raised to believe that she is responsible for her own success or failure.\n \n In fact, many people who have been victims of actual violent crime, or who have survived war or civil strife, support the right of self-defense. The old saying is often correct: \"a conservative is a liberal who has been mugged.\"\n \n Special Treatment and Misleading Leaders\n \n Two reasons for these groups to insist on \"victim\" status seem likely. First, by claiming victim status, members of these groups can demand (and get) special treatment through quotas, affirmative action, reparations, and other preferential treatment programs.\n \n Second, these people have been indoctrinated to believe that there is no alternative to remaining a victim forever. Their leaders remind them constantly that they are mistreated in every imaginable way (most of them imaginary!), attribute every one of life's misfortunes to \"racism\" or \"sexism\" or \"hate crimes\", and dream up ever more complex schemes for special treatment and favors.22 These leaders are the ones who preach that the entire Black experience is slavery and racism, or that Jewish history before and after the Holocaust is irrelevant,23 or that happily married women are really victims of sexual slavery.24\n \n Likewise, the NAACP is suing firearms manufacturers to put them out of business,25 and is especially opposed to the inexpensive pistols that enable the poor to defend themselves in gang-ridden inner cities. The Department of Housing and Urban Development (HUD) proposed evicting anyone who dares to keep a tool of self-defense in any of its crime-infested housing projects. Jewish leaders, especially those in the politically correct \"Reform\" branch, preach that gun control is \"a solemn religious obligation\",26 contrary to the teachings of their sacred scriptures and their own history.27 Law enforcement agencies falsely teach women that they are safest if they don't resist rapists and robbers,28 while women's organizations advocate gun control, thus rendering women and their children defenseless.\n \n Victimhood is good business for organizations that foster victim status. As victims, the members depend upon the organization to protect them, and the organization in turn relies on members for funding and political power. In the interest of self-preservation, these organizations work hard at preserving hatred and bigotry and at keeping their members defenseless - and therefore dependent.\n \n Anti-gun groups love victims!\n \n From my observations, pro-victimhood is a feature of all of the anti-gun special interest groups, not just the ones mentioned here. Every organization that supports gun control apparently wants its members to be helpless, terrified and totally dependent on someone else to control every aspect of their lives. It doesn't matter whether it's a religious, racial, ethnic, political, social, or charitable group. From Handgun Control, Inc. to the Anti- Defamation League to the Million Mom March, they all want you to live in fear. In this scheme, soccer moms are \"victims\" just as much as are inner-city minorities.\n \n If these organizations truly cared about the people for whom they claim to speak, they would encourage safe and responsible firearms ownership. They would help people to learn how to defend themselves and their families so that they wouldn't have to live in fear. They would tell everyone that one of the wonderful things about being an American is that you have the right to keep and bear arms, the right to defend yourself, and how these rights preserve the right to be free.\n \n The psychological price of being a victim\n \n In our current society, victimhood has many perceived benefits, but there are some serious drawbacks. Victims tend to see the world as a scary and threatening place. They believe that others treat them differently, unfairly, and even maliciously - and that they are helpless to do anything about it. This belief, that they are being mistreated and are helpless to resist, generates tremendous rage, and often, serious depression.\n \n But for victims to show rage openly can be dangerous, if not outright suicidal. For example, a battered woman who screams at or hits her attacker may provoke worse beatings or even her own murder. And a person who successfully defends himself loses his status as \"victim.\" For someone whose entire identity is dependent on being a victim, the loss of victim status is just as threatening as loss of life.\n \n So, unable psychologically to cope with such rage, people who view themselves as victims: (1) use defense mechanisms to displace it into irrational beliefs about neighbors killing each other, and the infallibility of police protection, and (2) attempt to regain control by controlling gun owners, whom they wrongly perceive as \"the enemy\".\n \n Say NO to being a victim!\n \n But no one needs to be a victim! Quite simply, it's not very easy to victimize a person who owns and knows how to use a firearm. If most women owned and carried firearms, rapes and beating would decrease.29 Thugs who target the elderly and disabled would find honest work once they realized they were likely to be looking down the barrel of a pistol or shotgun. It's nearly impossible to enslave, or herd into concentration camps, large numbers of armed people.\n \n Communicating with anti-gun people\n \n How can you communicate more effectively with an anti-gun person who is using unhealthy defense mechanisms? There are no quick and easy answers. But there are a few things you should keep in mind.\n \n Anger and attacks do not work\n \n Most gun owners, when confronted by an anti-gun person, become angry and hostile. This is understandable, because gun owners increasingly face ridicule, persecution and discrimination. (If you don't believe this, ask yourself if anyone would seriously introduce legislation to ban African- Americans, women, or Jews from post offices, schools, and churches. Even convicted felons aren't banned from such places - but peaceful armed citizens are!) But an angry response is counterproductive.\n \n It's not helpful to attack the person you're trying to persuade. Anything that makes him feel more fearful or angry will only intensify his defenses. Your goal is to help the person feel safe, and then to provide experiences and information that will help him to make informed decisions.\n \n Be Gentle\n \n You should never try to break down a defense mechanism by force. Remember that defense mechanisms protect people from feelings they cannot handle, and if you take that protection away, you can cause serious psychological harm. And because defense mechanisms operate unconsciously, it won't do any good to show an anti-gun person this article or to point out that he's using defense mechanisms. Your goal is gently and gradually to help the person to have a more realistic and rational view of the world. This cannot be done in one hour or one day.\n \n As you reach out to people in this way, you need to deal with both the illogical thought processes involved and the emotional reactions that anti-gun people have to firearms. When dealing with illogical thought processes, you are attempting to use reason and logic to convince the anti-gun person that his perception of other people and his perception of firearms are seriously inaccurate. The goal is to help him to understand that armed citizens and firearms are not threats, and may even save his life.\n \n Reversing Irrational thoughts\n \n The Mirror Technique\n \n One approach that can be helpful is simply to feed back what the anti-gun person is telling you, in a neutral, inquisitive way. So, when replying to my anonymous e-mail correspondent (above), I might respond, \"So you fear if your neighbors had guns, they would use them to murder you. What makes you think that?\" When you simply repeat what the person has said, and ask questions, you are not directly challenging his defenses. You are holding up a mirror to let him see his own views. If he has very strong defenses, he can continue to insist that his neighbors want to murder him. However, if his defenses are less rigid, he may start to question his position.\n \n Another example might be, \"Why do you think that your children's schoolteachers would shoot them?\" You might follow this up with something like, \"Why do you entrust your precious children to someone you believe would murder them?\" Again, you are merely asking questions, and not directly attacking the person or his defenses.\n \n Of course the anti-gun person might continue to insist that the teachers really would harm children, but prohibiting them from owning guns would prevent it. So you might ask how using a gun to murder innocent children is different from stabbing children with scissors, assaulting them with baseball bats, or poisoning the milk and cookies.\n \n It's important to ask \"open-ended\" questions that require a response other than \"yes\" or \"no\". Such questions require the anti-gun person actually to think about what he is saying. This will help him to re-examine his beliefs. It may also encourage him to ask you questions about firearms use and ownership.\n \n The \"What Would You Do?\" Technique\n \n Once you have a dialogue going with an anti-gun person, you might want to insert him into a hypothetical scenario, although doing so is a greater threat to his defenses, and is therefore more risky. You might ask how he would deal with a difficult or annoying co-worker. He will likely respond that he would never resort to violence, but \"other people\" would, especially if they had guns. (Projection again.) You can then ask him who these \"other people\" are, why they would shoot a co-worker, and what the shooter would gain by doing so.\n \n Don't try to \"win\" the argument. Don't try to embarrass the person you're trying to educate. Remember that no one likes to admit that his deeply held beliefs are wrong. No one likes to hear \"I told you so!\" Be patient and gentle. If you are arrogant, condescending, hurtful or rude to the anti-gun person, you will only convince him that gun owners are arrogant, hurtful people - who should not be trusted with guns!\n \n Defusing Emotional reactions\n \n The \"You Are There\" Technique\n \n Rational arguments alone are not likely to be successful, especially since many people \"feel\" rather than \"think\". You also need to deal with the emotional responses of the anti-gun person. Remember that most people have been conditioned to associate firearms with dead toddlers. So you need to change the person's emotional responses along with his thoughts.\n \n One way to do this is to put the anti-gun person (or his family) at a hypothetical crime scene and ask what he would like to have happen. For example, \"Imagine your wife is in the parking lot at the supermarket and two men grab her. One holds a knife to her throat while the other tears her clothes off. If I see this happening and have a gun, what should I do? What would happen next? What if after five minutes, the police still haven't arrived?\"\n \n Just let him answer the questions and mentally walk through the scenario. Don't argue with his answers. You are planting seeds in his mind than can help change his emotional responses.\n \n The Power of Empathy\n \n Another emotion-based approach that is often more successful is to respond sympathetically to the plight of the anti-gun person.\n \n Imagine for a moment how you would feel if you believed your neighbors and co-workers wanted to kill you and your family, and you could do nothing at all about it except to wait for the inevitable to occur.\n \n Not very pleasant, is it?\n \n This is the world in which opponents of armed self-defense live. All of us have had times in our lives when we felt \"different\" and had to contend with hostile schoolmates, co- workers, etc. So we need to invoke our own compassion for these terrified people. Say something like, \"It must be awful to live in fear of being assaulted by your own neighbors. I remember what it was like when I was the only (Jew, Mormon, African-American, Republican) in my (class, football team, workplace) - and even then I didn't think anyone was going to kill me.\" It's essential that you sincerely feel some compassion and empathy; if you're glib or sarcastic, this won't work.\n \n Using empathy works in several ways. First, it defuses a potentially hostile interaction. Anti-gun people are used to being attacked, not understood, by advocates of gun rights. Instead of an \"evil, gun-toting, extremist\", you are now a sympathetic, fellow human being. This may also open the door for a friendly conversation, in which you can each discover that your \"opponent\" is a person with whom you have some things in common. You may even create an opportunity to dispel some of the misinformation about firearms and self-defense that is so prevalent.\n \n This empathy technique is also useful for redirecting, or ending, a heated argument that has become hostile and unproductive. It allows you to escape from the dead end of \"guns save lives\" vs. \"the only reason to have a gun is to murder children.\" With empathy you can reframe the argument entirely. Instead of arguing about whether more lives are saved or lost as a result of gun ownership, you can comment on how terrifying it must be to live in a country where 80 million people own guns \"solely for the purpose of murdering children\".\n \n You should not expect any of these approaches to work immediately; they won't. With rare exceptions, the anti-gun person is simply not going to \"see the light,\" thank you profusely, and beg you to take him shooting. What you are doing is putting tiny chinks into the armor of the person's defenses, or planting seeds that may someday develop into a more open mind or a more rational analysis. This process can take months or years. But it does work!\n \n Corrective Experiences\n \n Perhaps the most effective way to dissolve defense mechanisms, however, is by providing corrective experiences30. Corrective experiences are experiences that allow a person to learn that his ideas about gun owners and guns are incorrect in a safe and non-threatening way. To provide a corrective experience, you first allow the person to attempt to project his incorrect ideas onto you. Then, you demonstrate that he is wrong by your behavior, not by arguing.\n \n For example, the anti-gun person will unconsciously attempt to provoke you by claiming that gun owners are uneducated \"rednecks,\" or by treating you as if you are an uneducated \"redneck.\" If you get angry and respond by calling him a \"stupid, liberal, socialist\", you will prove his point. However, if you casually talk about your M.B.A., your trip to the Shakespeare festival, your vegetable garden, or your daughter's ballet recital, you will provide him with the opportunity to correct his misconceptions.\n \n If you have used the above techniques, then you have already provided one corrective experience. You have demonstrated to the frightened, anti-gun person that gun owners are not abusive, scary, dangerous and sub-human monsters, but normal, everyday people who care about their families, friends and even strangers.\n \n As many gun owners have already discovered, the most important corrective experiences involve actually exposing the fearful person to a firearm. It is almost never advisable to tell someone that you carry a concealed firearm, but there are ways to use your own experience favorably.\n \n For example, if you're dealing with an anti-gun person with whom you interact regularly and have a generally good relationship - a coworker, neighbor, church member, etc. - you might indirectly refer to concealed carry. You should never say anything like \"I'm carrying a gun right now and you can't even tell,\" especially because in some states that would be considered illegal, \"threatening\" behavior. But you might consider saying something like, \"I sometimes carry a firearm, and you've never seemed to be uncomfortable around me.\" Whether to disclose this information is an individual decision, and you should consider carefully other consequences before using this approach.\n \n First-hand experience\n \n Ultimately, your goal is to take the anti-gun person shooting. Some people will accept an invitation to accompany you to the range, but others are too frightened to do so, and will need some preliminary experience.\n \n First, you want to encourage the anti-gun person to have some contact with a firearm in whatever way feels most comfortable to him. Many people seem to believe that firearms have minds of their own and shoot people of their own volition. So you might want to start by inviting him simply to look at and then handle an unloaded firearm. This also provides you the opportunity to show the inexperienced person how to tell whether a firearm is loaded and to teach him the basic rules of firearms safety.\n \n Encourage the newcomer to ask questions and remember that your role is to present accurate information in a friendly, responsible and non-threatening way. This is a good time to offer some reading material on the benefits of firearms ownership. But be careful not to provide so much information that it's overwhelming. And remember this is not the time to launch into anti-government rants, the New World Order, conspiracy theories, or any kind of political talk!\n \n Next, you can invite your friend to accompany you to the shooting range. (And if you're going to trust each other with loaded guns, you should consider yourselves friends!) Assure him that no one will force him to shoot a gun and he's free just to watch. Let him know in advance what he will experience and what will be expected of him. This includes such things as the need for eye and ear protection, a cap, appropriate clothing, etc. Make sure you have a firearm appropriate for your guest should s/he decide to try shooting. This means a lower caliber firearm that doesn't have too much recoil. If your guest is a woman, make sure the firearm will fit her appropriately. Many rifles have stocks that are too long for small women, and double-stack semi-autos are usually too large for a woman's hand.\n \n Remember that just visiting the range can be a corrective experience. Your guest will learn that gun owners are disciplined, responsible, safety-conscious, courteous, considerate, and follow the rules. He will see people of all ages, from children to the elderly, male and female, enjoying an activity together. He will not see a single \"beer-swilling redneck\" waving a firearm in people's faces.\n \n In my experience, most people who visit a range will decide they do want to try shooting. Remember to make sure your guest understands all the safety rules and range rules before allowing him to handle a firearm. If you don't feel competent to teach a newcomer to shoot, ask an instructor or range master to assist. Remember to provide lots of positive feedback and encouragement. If you're lucky, you'll recruit a new firearms enthusiast.\n \n But even if your guest decides that shooting is \"not for him\", he will have learned many valuable lessons. He will know basic rules of firearms safety, and how to clear a firearm should he need to do so. This may well save his life someday. He will know that guns do not fire unless a person pulls the trigger. He will know that gun owners are friendly, responsible people, not very different from him. Even if he chooses not to fire a gun ever again, he will be less likely to fear and persecute gun owners. And who knows - a few months or years later he may decide to become a gun owner.\n \n Why these techniques do not always work\n \n You should remember that you will not be successful with all anti-gun people. Some people are so terrified and have such strong defenses, that it's not possible for someone without professional training to get through. Some people have their minds made up and refuse to consider opening them. Others may concede that what you say \"makes sense,\" but are unwilling to challenge the forces of political correctness. A few may have had traumatic experiences with firearms from which they have not recovered.\n \n You will also not be successful with the anti-gun ideologues, people like Charles Schumer and Dianne Feinstein. These people have made a conscious choice to oppose firearms ownership and self-defense. They almost always gain power, prestige, and money from their anti-gun politics. They are not interested in the facts or in saving lives. They know the facts and understand the consequences of their actions, and will happily sacrifice innocent people if it furthers their selfish agenda. Do not use these techniques on such people. They only respond to fears of losing the power, prestige and money that they covet.31\n \n Conclusion\n \n By better understanding advocates of civilian disarmament, and by learning and practicing some simple techniques to deal with their psychological defenses, you will be much more effective in your efforts to communicate with anti-gun people. This will enable you to be more successful at educating them about the realities of firearms and self- defense, and their importance to our liberty and safety.\n \n Educating others about firearms is hard work. It's not glamorous, and it generally needs to be done one person at a time. But it's a very necessary and important task. The average American supports freedom of speech and freedom of religion, whether or not he chooses to exercise them. He supports fair trials, whether or not he's ever been in a courtroom. He likewise needs to understand that self- defense is an essential right, whether or not he chooses to own or carry a gun.\n \n \n © 2000, Sarah Thompson.\n \n Dr. Thompson is Executive Director of Utah Gun Owners Alliance, www.utgoa.org and also writes The Righter, www.therighter.com, a monthly column on individual rights.\n \n Notes\n \n 1 Lott, John R., Jr. 1998. More Guns, Less Crime. University of Chicago Press. Pp. 11-12; Proposition B: More Security Or Greater Danger?, St. Louis Post-Dispatch. March 21, 1999.\n \n 2 Lott 1998, Pp. 1-2.\n \n 3 Kaplan, Harold M. and Sadock, Benjamin J. 1990. Pocket Handbook of Clinical Psychiatry. Williams & Wilkins. P. 20.\n \n 4Brenner, Charles. 1973. An Elementary Textbook of Psychoanalysis (rev. ed.). Anchor Books. Pp. 91-93; Lefton, Lester A. 1994. Psychology (5th edition). Allyn & Bacon. Pp. 432-433.\n \n 5 Brenner 1973. P. 91.\n \n 6 Kaplan and Sadock 1990, p. 20; Lefton 1994, p. 432.\n \n 7 Talbott, John A., Robert E. Hales and Stuart C. Yudofsky, eds. 1988. Textbook of Psychiatry. American Psychiatric Press. P.137.\n \n 8 \"Kids Suspended for Playground Game.\" Associated Press. April 6, 2000.\n \n 9 Lightfoot, Liz. \"Gun Return to the Nursery School Toy Chest.\" The London Telegraph. May 22, 2000. Kaplan and Sadock 1990, p. 20; Lefton 1994, p. 433.\n \n 10 Stevens, Richard W. 1999. Dial 911 and Die. Mazel Freedom Press. [Analyzes the law in 54 U.S. jurisdictions]; see, e.g., Bowers v. DeVito, 686 F.2d 616, 618 (7th Cir. 1982) [no federal constitutional right to police protection.]\n \n 11 Kleck, Gary and Gertz, Marc. 1995. Armed Resistance to Crime: The Prevalence and Nature of Self- Defense with a Gun. Journal of Criminal Law & Criminology. Vol. 86 (Fall), pp. 150-187.\n \n 12 Simkin, Jay, Zelman, Aaron, and Rice, Alan M. 1994. Lethal Laws. Jews for the Preservation of Firearms Ownership.\n \n 13 Kaplan and Sadock 1990, p. 20; Lefton 1994, p. 433.\n \n 14 Brenner 1973, p. 85.\n \n 15 Veith, Gene Edward, Jr. 1993. Modern Fascism: Liquidating the Judeo-Christian Worldview. Saint Louis: Concordia Publishing. Pp. 39-40 [fascism exalts nature, animals and environment].\n \n 16 Japenga, A. 1994. Would I Be Safer with a Gun? Health. March/April, p. 54.\n \n 17 Brenner 1973, p. 92.\n \n 18 Kaplan and Sadock 1990, p. 219.\n \n 19 American Psychiatric Association. 1994. Diagnostic and Statistical Manual of Mental Disorders, Fourth Edition. P. 410.\n \n 20 Lott 1998, pp. 11-12.\n \n 21 Most American gun owners are not violent criminals and will not be potential killers. \"The vast majority of persons involved in life-threatening violence have a long criminal record and many prior contacts with the justice system.\" Elliott, Delbert S. 1998. Life Threatening Violence is Primarily a Crime Problem: A Focus on Prevention. University of Colorado Law Review. Vol. 69 (Fall), pp. 1081-1098, at 1093.\n \n 22 Sowell, Thomas. 2000. Blacks and bootstraps. Jewish World Review (Aug.14). http://www.jewishworldreview.com\n \n 23x Wein, Rabbi Berel. 2000. The return of a Torah scroll and confronting painful memories. Jewish World Review (July 12).\n \n 24 Dworkin, Andrea. \"Terror, Torture and Resistance\". http://www.igc.org/Womensnet/dworkin/TerrorTortureandResistance.html\n \n 25 Mfume, Kweisi, speech at the 90th annual NAACP meeting, July 12, 1999. http://www.naacp.org/president/speeches/90th%20Annual%20Meeting.htm\n \n 26 Yoffie, Rabbi Eric H. Speech supporting the Million Mom March, May 14, 2000. http://uahc.org/yoffie/mmm.html\n \n 27 \"If someone comes to kill you, arise quickly and kill him.\" The Talmud, Tractate Sanhedrin. 1994. The Schottenstein Edition. New York: Mesorah Publications. Vol. 2, 72a.\n \n 28 Rape and Sexual Assault, Dean of Students Office for Women's Resources and Services McKinley Health Education Dept., University Police, University of Illinois; Hazelwood, R. R. & Harpold, J. 1986. Rape: The Dangers of Providing Confrontational Advice, FBI Law Enforcement Bulletin. Vol. 55, pp. 1-5.\n \n 29 Lott 1998, pp. 78, 134-37.\n \n 30 Frank, Jerome D. 1961. Persuasion and Healing. The Johns Hopkins Press. Pp. 216-217.\n \n 31 Richardson, H. L. 1998. Confrontational Politics. Gun Owners Foundation. 1\n \n Long winded ain't it,wonder if any Anti's will bother?", 
   {
    "post_info": {
     "post_title": "An Anti-Gunner Must Read"
    }
   }, 
   null, 
   null, 
   1280115780.0
  ], 
  [
   408518, 
   null, 
   "Accipiter", 
   "Would you happen to have any statistics regarding the probability of needing to use your gun for self defense over the average lifetime?\n \n Not trying to start an argument, just curious.", 
   {}, 
   408508, 
   null, 
   1280151780.0
  ], 
  [
   408572, 
   null, 
   "zsu2357", 
   "Would you happen to have any statistics regarding the probability of needing to use your gun for self defense over the average lifetime?\n \n Not trying to start an argument, just curious.\n\n \n Fair enough and I realize your not.If you mean me personally the probability is\n there every night,I won't trust my neck to probability and stats.\n Most people here won't.\n And to trot this out again...what are the probability's that you are going to get creamed in a car wreak your fault or not?", 
   {}, 
   408518, 
   null, 
   1280196120.0
  ], 
  [
   408575, 
   null, 
   "Accipiter", 
   "And to trot this out again...what are the probability's that you are going to get creamed in a car wreak your fault or not?\n\n \n My guess is I am much more likely to get creamed in a car wreck then needing to use a gun for self defense over the average lifetime.", 
   {}, 
   408572, 
   null, 
   1280198520.0
  ], 
  [
   408578, 
   null, 
   "NATO 556", 
   "My guess is I am much more likely to get creamed in a car wreck then needing to use a gun for self defense over the average lifetime.\n\n \n That would depend entirely on which area of the country you live in.", 
   {}, 
   408575, 
   null, 
   1280201100.0
  ], 
  [
   408583, 
   null, 
   "Galileo", 
   "My guess is I am much more likely to get creamed in a car wreck then needing to use a gun for self defense over the average lifetime.\n\n \"Except that 16% of violent crimes do not result in the victim's death. In fact, only 0.35% of assaults result in death (Kleck table 5.8). 0.35%*80,000=300 lives saved with guns each year. This is an overestimate since it assumes that guns are 100% effective and that all of the 80,000 crimes that guns were used to defend against were assaults when in fact some were robberies and burglaries (which have lower fatality rates than assaults). Correcting for these would give an estimate of more like 200.\"\n How many lives are saved by defensive gun use? : Deltoid\n \n An estimated 200 lives saved by defensive gun use v. about 40,000 Americans dying in car crashes each year. Let me get out my calculator... \n So that means you are 200 times more likely to be killed in a car crash than have your life saved by defensive gun use.", 
   {}, 
   408575, 
   null, 
   1280209980.0
  ], 
  [
   408589, 
   null, 
   "Clanard", 
   "You're cherry picking...and the logic used in those statements is horribly flawed.", 
   {}, 
   408583, 
   null, 
   1280215080.0
  ], 
  [
   408591, 
   null, 
   "Galileo", 
   "You're cherry picking...and the logic used in those statements is horribly flawed.\n\n What claim has been supported with cherry picked facts?", 
   {}, 
   408589, 
   null, 
   1280216940.0
  ], 
  [
   408607, 
   null, 
   "NATO 556", 
   "An estimated 200 lives saved by defensive gun use v. about 40,000 Americans dying in car crashes each year. Let me get out my calculator... \n So that means you are 200 times more likely to be killed in a car crash than have your life saved by defensive gun use.\n\n \n Doesn't matter. Gun ownership is a constitutionally protected right. It doesn't have to achieve a single goal to retain this status. There's no requirement for a life to be saved in order for it to have its protected status.\n \n The government didn't heed to calls of the people to end the war in the Middle East despite all the public outcry. Since no results came one could argue that the First Amendment failed and should thus lose its constitutional protection. At least that's how the gun control logic goes with it.\n \n And let's not forget the liberals favorite old argument of \"If it saves one life then the cost, no matter how high, is well worth it.\" Using that logic then legal gun ownership is worth it, because at least one person in any given year will be able to prevent themselves from being murdered by a criminal.", 
   {}, 
   408583, 
   null, 
   1280240460.0
  ], 
  [
   408610, 
   null, 
   "Tither", 
   "What claim has been supported with cherry picked facts?\n\n Well, first of all, here is the credentials of your source. He has no research in the field of gun control. He is an anti-gun blogger who HATES John Lott, just like you! emoticon_smile\n   Tim Lambert \n Lecturer What I Teach: \n · Computer Graphics \n · Advanced Graphics \n · Engineering Design and Innovation \n · Computational Geometry \n · I use Java for teaching. \n \n What I Research: \n Here are some of my current research projects. \n My research interests are in the fields of Computer Graphics and Computational Geometry \n ...\n \n Other things...\n I have a blog where I write about science which is politically contreversial such as global warming, deaths in Iraq, and gun control.\n", 
   {
    "unicode_changes_made": true
   }, 
   408591, 
   null, 
   1280241840.0
  ], 
  [
   408621, 
   null, 
   "Accipiter", 
   "Doesn't matter. Gun ownership is a constitutionally protected right. It doesn't have to achieve a single goal to retain this status. There's no requirement for a life to be saved in order for it to have its protected status.\n \n The government didn't heed to calls of the people to end the war in the Middle East despite all the public outcry. Since no results came one could argue that the First Amendment failed and should thus lose its constitutional protection. At least that's how the gun control logic goes with it.\n \n And let's not forget the liberals favorite old argument of \"If it saves one life then the cost, no matter how high, is well worth it.\" Using that logic then legal gun ownership is worth it, because at least one person in any given year will be able to prevent themselves from being murdered by a criminal.\n\n Why is gun ownership a constitutionally protected right?\n \n In other words, what was the reason(s) that it was made a constitutionally protected right in the first place?", 
   {}, 
   408607, 
   null, 
   1280247660.0
  ], 
  [
   408623, 
   null, 
   "Doc Jones", 
   "Why is gun ownership a constitutionally protected right?\n \n In other words, what was the reason(s) that it was made a constitutionally protected right in the first place?\n\n \n I know you are an English subject but out of curiosity, how old are you?", 
   {}, 
   408621, 
   null, 
   1280251380.0
  ], 
  [
   408624, 
   null, 
   "Tither", 
   "Why is gun ownership a constitutionally protected right?\n \n In other words, what was the reason(s) that it was made a constitutionally protected right in the first place?\n\n Originally our Right to Keep and Bear Arms started with the English Bill of Rights. Blackstone as well as Heller discusses this in some detail.\n \n Now put yourself in the mindset of our Founders. They suffered a Tyrannical King George, who laid all kinds of burdens on the colony of America. The last straw came when The Revolutionary War started. The British came to both Lexington and Concord to seize the powder stores collecting individual's weapons along the way. \n \n   The Declaration of Independence \n When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.\n \n We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes;\n\n As a side note, one of the things we can observe in nature is how God, (or if you don't believe, Nature&#8217;s God) hard wired into every being the self preservation instinct. We call that the Fight or flight instinct.\n \n After the Revolution, We the victorious People had no desire, what so ever, to be ruled by a central government! Found at our Nation&#8217;s archives.   The Bill Of Rights ~ The First Ten Amendments to the Constitution \n Alexander Hamilton 1775\n \n The Sacred Rights of Mankind are not to be rummaged for among old parchment,. or musty records. They are written with a sun beam in whole volume of human nature, by the hand of the divinity itself,  and can never be erased or obscured by mortal power. \n \n The fact that the Constitution did not include a bill of rights to specifically protect Americans' hard-won rights sparked the most heated debates during the ratification process. To the Federalists, those who favored the Constitution, a bill of rights was unnecessary because the Federal Government was limited in its powers and could not interfere with the rights of the people or the states; also, most states had bills of rights. To the Anti-Federalists, those who opposed the Constitution, the prospect of establishing a strong central government without an explicit list of rights guaranteed to the people was unthinkable. Throughout the ratification process, individuals and state ratification conventions called for the adoption of a bill of rights. \n \n The Federalist Papers were written in order to sell the new constitution to the American People. Hamilton wrote in Fed 28, a reason why we could trust that the New Federal Government could not go rogue.  FEDERALIST No. 28 HAMILTON \n If the representatives of the people betray their constituents, there is then no resource left but in the exertion of that \n  original right of self-defense \n which is paramount to all positive forms of government, and which against the usurpations of the national rulers, may be exerted with infinitely better prospect of success than against those of the rulers of an individual state. \n In a single state, if the persons intrusted with supreme power become usurpers, the different parcels, subdivisions, or districts of which it consists, having no distinct government in each, can take no regular measures for defense.  The citizens must rush tumultuously to arms, without concert, without system, without resource; except in their courage and despair.  The usurpers, clothed with the forms of legal authority, can too often crush the opposition in embryo.\n \n The obstacles to usurpation and the facilities of resistance increase with the increased extent of the state, provided the citizens understand their rights and are disposed to defend them. \n\n \n   Preamble Bill of Rights \n THE Conventions of a number of the States having at the time of their adopting the Constitution, expressed a desire, in order to prevent misconstruction or abuse of its powers, that further declaratory and restrictive clauses should be added: And as extending the ground of public confidence in the Government, will best insure the beneficent ends of its institution \n\n The restrictions were what President Obama calls a list of negative Rights against the Government! \n \n The Constitution Society says:   From the Constitution Society \n There is considerable confusion about the legal theory underlying the \"right to keep and bear arms\". This is a brief outline for a clarification of the discussion of this issue. \n \n (1) The Second Amendment to the U.S. Constitution does not establish the right to keep and bear arms. None of the provisions of the Constitution establish any \"natural\" rights. They recognize such rights, but the repeal of such provisions would not end such rights. Such rights were considered by many of the Framers as obvious or \"self-evident\", but they were immersed in the prevailing republican thought of the day, as expressed in the writings of Locke, Montesquieu, Rousseau, Madison, Hamilton, and others, which discussed \"natural rights\" in some detail. Others argued that at least some of the rights needed to be made explicit in the Bill of Rights to avoid having future generations with less understanding of republican theory weaken in their defense of those rights. That has turned out to have been a good idea \n \n (2) The right to keep and bear arms is a natural right of individuals under the theory of democratic government. This was clearly the understanding and intent of the Framers of the U.S. Constitution and was a long-established principle of English common law at the time the Constitution was adopted, which is considered to be a part of constitutional law for purposes of interpreting the written Constitution. \n\n \n   V. Drafting of the Federal Bill of Rights \n When James Madison found himself cast in the unlikely role of father of the national bill of rights,[234] he was not forced to write upon a clean slate. His first step was to obtain a pamphlet which conveniently listed all state proposals, from the Pennsylvania minority onward.[235] The problem became one of editing; out of hundreds of proposals, many redundant and some questionable, a hard core of usable proposals had to be selected. The barriers to be surmounted required discarding all controversial proposals.\n ...\n Madison's decision to include a right to arms in his federal bill of rights is hardly surprising. Such a right had been demanded in virtually every call for a bill of rights; indeed, it had received twice the number of demands accorded freedom of speech.[238] Language praising the militia had received much less support, essentially having been appended to the right to arms clause in Virginia and the two following conventions.[239] But an adaptation of the Virginia/New York/North Carolina wording combining the two held unusual promise. One of Madison's major objectives was to \"bring in\" North Carolina.[240] He hoped to convince it to ratify the Constitution by offering an acceptable bill of rights. North Carolina could hardly object to a nearly verbatim acceptance of its demand.\n\n This is how the 2nd Amendment was born!", 
   {}, 
   408621, 
   null, 
   1280252100.0
  ], 
  [
   408626, 
   null, 
   "Accipiter", 
   "I know you are an English subject but out of curiosity, how old are you?\n\n Why do you ask?", 
   {}, 
   408623, 
   null, 
   1280256060.0
  ], 
  [
   408629, 
   null, 
   "Doc Jones", 
   "Why do you ask?\n\n \n Already answered. CURIOSITY!\n \n For example, your question above which ignores intent and ask for a repeat. It will help me guage your intent and sincereity. Trite one liners are kind of in the vogue here so your respones do not amount to much unless you are intentionally historically obtuse, pretend to be clever when we have discussed this same subject with you before or if you actually want to learn.\n \n No need to be ashamed either way but you will get more information instead of a response in kind as to your intent stated in your very first post here. Tolerance is a bit easier to accept from a youngster than for an intentional disrupter who is too lazy to do your own homework. You may be a waste of time in that case instead of wanting to actually learn. You do recall when we discussed you pen name and you didn't know it was a hawk? You just hatched or simply a da-- stupid middle aged Brit? Just a probe to see if you were up to a serious discussion or NOT.", 
   {}, 
   408626, 
   null, 
   1280260920.0
  ], 
  [
   408630, 
   null, 
   "Doc Jones", 
   "Why do you ask?\n\n \n Another thing, you did not thank Tither for taking the time to tediously answer your question with facts and sources. Instead, you hopped on my question as to your age. That my boy is not the mark of a mature nor serious debater despite your claim in your first post here on this board.\n \n Banty chickens do not soar with hawks...", 
   {}, 
   408626, 
   null, 
   1280262240.0
  ], 
  [
   408632, 
   null, 
   "Penfold", 
   "\"Except that 16% of violent crimes do not result in the victim's death. In fact, only 0.35% of assaults result in death (Kleck table 5.8). 0.35%*80,000=300 lives saved with guns each year. This is an overestimate since it assumes that guns are 100% effective and that all of the 80,000 crimes that guns were used to defend against were assaults when in fact some were robberies and burglaries (which have lower fatality rates than assaults). Correcting for these would give an estimate of more like 200.\"\n How many lives are saved by defensive gun use? : Deltoid\n \n An estimated 200 lives saved by defensive gun use v. about 40,000 Americans dying in car crashes each year. Let me get out my calculator... \n So that means you are 200 times more likely to be killed in a car crash than have your life saved by defensive gun use.\n\n \n This post has attracted nothing but avoidance and diversion from the pro gunners since it was made, nine posts ago.", 
   {}, 
   408583, 
   null, 
   1280262960.0
  ], 
  [
   408634, 
   null, 
   "Doc Jones", 
   "This post has attracted nothing but avoidance and diversion from the pro gunners since it was made, nine posts ago.\n\n \n \n Why don't you address it cheeky fellow?\n \n We considered both sources and found neither credible. Kind of like you who is afraid for your sign on to be shown.\n \n You got any other outstanding observations you would like to show your obtuseness on? :(", 
   {}, 
   408632, 
   null, 
   1280263260.0
  ], 
  [
   408638, 
   null, 
   "Doc Jones", 
   "You gun grabbers might consider sending some money to the last of the anti gun folks, seems they are begging and pleading since the anti gun Joyce Foundation quit funding them :) :)\n \n CONTACT: Violence Policy Center\n Kristen Rand, Violence Policy Center, 202-822-8200 x102, krand@vpc.org \n or Peter Hamm, Brady Campaign to Prevent Gun Violence, 202-289-5792, phamm@bradymail.org", 
   {}, 
   408634, 
   null, 
   1280263860.0
  ], 
  [
   408641, 
   null, 
   "Doc Jones", 
   "FYI, the ACLU is now taking second amendment issues and cases :) ;)", 
   {}, 
   408638, 
   null, 
   1280264340.0
  ], 
  [
   408663, 
   null, 
   "Accipiter", 
   "Doc, you make a pretty good case against letting people like you own guns with your little temper tantrum there.\n \n Not only that but you did not get a single point correct!\n \n Your a joke.", 
   {}, 
   408641, 
   null, 
   1280277960.0
  ], 
  [
   408667, 
   null, 
   "NATO 556", 
   "Doc, you make a pretty good case against letting people like you own guns with your little temper tantrum there.\n \n Not only that but you did not get a single point correct!\n \n Your a joke.\n\n \n And you make a very good case on why people like you should never be allowed in a public office. Somebody displays their outrage over how things are done, and you want them silenced and deprived of their rights for not agreeing with you in a manner of blind loyalty.", 
   {}, 
   408663, 
   null, 
   1280278920.0
  ], 
  [
   408671, 
   null, 
   "Accipiter", 
   "Wow you guys are good, you've managed to hijack a thread which agrees with your position and turn it in to an imbecile festival.", 
   {}, 
   408667, 
   null, 
   1280281560.0
  ], 
  [
   408675, 
   null, 
   "zsu2357", 
   "My guess is I am much more likely to get creamed in a car wreck then needing to use a gun for self defense over the average lifetime.\n\n I can in theory agree with that however in 37 years I haven't had a serious\n accident(knock on wood)but today I could, tonight could be the night our door gets kicked in.\n Its no big deal being prepared,bet you have a fire extinguisher don't you?:)", 
   {}, 
   408575, 
   null, 
   1280287260.0
  ], 
  [
   408676, 
   null, 
   "zsu2357", 
   "What claim has been supported with cherry picked facts?\n\n Come on StarGuy say it how it is,you are content to be or hope to be in that \n 16% that just gets the s*** beat out of them or your wife raped and beaten\n while you stand by wishing the cops would hurry up.\n \n Sure do hope them guys are up on the stats.And you are right about the cars\n Wow 40,000 a year I say tie to ban cars,or at least strictly regulate them.emoticon_xdonno", 
   {}, 
   408591, 
   null, 
   1280288220.0
  ], 
  [
   408678, 
   null, 
   "zsu2357", 
   "Wow you guys are good, you've managed to hijack a thread which agrees with your position and turn it in to an imbecile festival.\n\n \n Well Ace no one hijacked anything,if nothing else you and your buds proved a point,even when its spelled out you still argue it,its not about stats.its about whats right and guaranteed under the constitution.emoticon_xlove", 
   {}, 
   408671, 
   null, 
   1280289780.0
  ], 
  [
   408698, 
   null, 
   "Tither", 
   "Would you happen to have any statistics regarding the probability of needing to use your gun for self defense over the average lifetime?\n\n Stats like that do not exist. However the risk would depend on where one lives, and what kind of risky behavior one participates in. \n \n When I first became disabled, and lived in a Cleveland Housing Project, my risk was HUGE, even though I did not participate in risky behavior. In fact, I needed to carry a gun because of threats to my life, for trying to help clean up the debauchery I saw on a daily bases. \n \n Those who drank with drug dealers, pimps, and prostitutes or took drugs, and participated in open gambling, risked a TON! Those people would never be able to get a Concealed Handgun License, because of prior Criminal history.\n \n After I became reeducated, and now posses the Blessings of God, and now live in Fairview Park, my likelihood of needing a gun is Zero, Ziltch, Zippo Nada, nonexistent! But there again, I don't go into Cleveland much any more, except for an occasional shopping trip, or to attend an event.\n \n Those who have no choice but to live with the kind of filth I described above, having no help from Government, and not having much help from the police, truly need a firearm for protection on a daily bases. If you are careful and do not tick off the powers that be, drug dealers and criminals, one still has to deal with the junkies who rob and burgle houses for their daily fix of drugs.\n \n The Children are the real victims of this form of governmental abuse, and pure abdication of their societal responsibilities, and the duties of the offices they hold.", 
   {}, 
   408518, 
   null, 
   1280318100.0
  ], 
  [
   408703, 
   null, 
   "Steeeeve", 
   "Why is gun ownership a constitutionally protected right?\n \n In other words, what was the reason(s) that it was made a constitutionally protected right in the first place?\n\n \n Geesh, people can't answer questions sometimes on this forum.\n \n I'll answer your question...\n \n The 2nd amendment was created because it is the responsibility of the citizens to blow away their government should they continuously oppress the people.", 
   {}, 
   408621, 
   null, 
   1280327340.0
  ], 
  [
   408707, 
   null, 
   "Accipiter", 
   "Stats like that do not exist. However the risk would depend on where one lives, and what kind of risky behavior one participates in. \n \n When I first became disabled, and lived in a Cleveland Housing Project, my risk was HUGE, even though I did not participate in risky behavior. In fact, I needed to carry a gun because of threats to my life, for trying to help clean up the debauchery I saw on a daily bases. \n \n Those who drank with drug dealers, pimps, and prostitutes or took drugs, and participated in open gambling, risked a TON! Those people would never be able to get a Concealed Handgun License, because of prior Criminal history.\n \n After I became reeducated, and now posses the Blessings of God, and now live in Fairview Park, my likelihood of needing a gun is Zero, Ziltch, Zippo Nada, nonexistent! But there again, I don't go into Cleveland much any more, except for an occasional shopping trip, or to attend an event.\n \n Those who have no choice but to live with the kind of filth I described above, having no help from Government, and not having much help from the police, truly need a firearm for protection on a daily bases. If you are careful and do not tick off the powers that be, drug dealers and criminals, one still has to deal with the junkies who rob and burgle houses for their daily fix of drugs.\n \n The Children are the real victims of this form of governmental abuse, and pure abdication of their societal responsibilities, and the duties of the offices they hold.\n\n \n Thanks for the reply, you make a lot of sense.", 
   {}, 
   408698, 
   null, 
   1280332500.0
  ], 
  [
   408708, 
   null, 
   "Accipiter", 
   "Geesh, people can't answer questions sometimes on this forum.\n \n I'll answer your question...\n \n The 2nd amendment was created because it is the responsibility of the citizens to blow away their government should they continuously oppress the people.\n\n \n Yeah I think everybody knows that, I just wanted to see how the pro gunners spin it to make it applicable today.", 
   {}, 
   408703, 
   null, 
   1280332620.0
  ], 
  [
   408711, 
   null, 
   "Doc Jones", 
   "Wow you guys are good, you've managed to hijack a thread which agrees with your position and turn it in to an imbecile festival.\n\n \n The topic of the thread is/was: Has the reduction in FFLs been beneficial?\n \n Wanna try again or continue to suck your thumb? You haven't had a post on topic since your first post.", 
   {}, 
   408671, 
   null, 
   1280334360.0
  ], 
  [
   408712, 
   null, 
   "Doc Jones", 
   "...and this topic is: Raging Against Self Defense:\n A Psychiatrist Examines The Anti-Gun Mentality\n \n Do at least try.", 
   {}, 
   408711, 
   null, 
   1280334660.0
  ], 
  [
   408714, 
   null, 
   "Doc Jones", 
   "Both topics got co-mingled by star gazer in his habit of spamming every board with the same illogic: http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read.html#post408583\n \n He doesn't care what the topic is which in this case is Dr. Sarah Thomson's explanation of how the anti gun mentality works. One is by avoidance which is aptly illustrated by first star gazer and then yourself in the time worn attempt despite SCOTUS opinion to the contrary that somehow WE have to justify a right plainly stated in the Constitution and affirmed in the 2004 DOJ study and two recent SCOTUS decisions.\n \n So, that is the same claims made no matter what the topic is all the anti Constitutionalists can do is pretend the right doesn't exist. I expect ZSU thought it would be nice for the pagans to identify with some psychological proof of their fallacies and get a little self help instead of the same \"you gotta prove your right is valid and benefits are to my advantage because...I think___________________\"\n \n Dr. Thompson makes some good points in her thesis. The radicals, Penhead, star gazer and yourself would rather start off on a tangent about \"NEED\" AND PROOF OF NEED. It is a right which would exist no matter what, it is a fact of the nature of self preservation and was not \"created\" by a document but acknowledged as a pre-existing right.\n \n I suppose the answer is to point out her diagnosis to each of your claims and avoidance techniques. I will try harder :)", 
   {}, 
   408712, 
   null, 
   1280337180.0
  ], 
  [
   408715, 
   null, 
   "Tither", 
   "By Sonia Wolff\n \n   The reluctant gun owner -- I had never wanted a gun. Now I own a Smith & Wesson revolver. Why? \n ....... \n But things change. Our children left home. Our ability to slug it out with a baseball bat diminished. Home invasion robberies no longer seemed quite so abstract after a friend down the street was burglarized one day at noon, while she was in the shower. \n &#8230;.\n \n When he returned, my education about guns began: He had ordered the shotgun, and could pick it up after a 10-day waiting period, during which he would be screened for criminal activity or mental disability.\n &#8230;.\n My anxiety made me demanding. \"You must practice with that gun,\" I said. \"Learn to load it. Learn to shoot it. Make the process as habitual as unlocking our front door.\"\n \n \"What's gotten into you?\" he asked.\n \"Self-defense,\" I replied.\n &#8230;\n \"We should have a pistol,\" I finally declared. \"Something I can use.\"\n &#8230;\n Walt, a patient man with gray hair and bifocals, watched as I tried various revolvers before finally settling on a Smith & Wesson, which has a smaller grip than the Ruger and is more in sync with the size of my hand.\n \n It was only when I'd made my decision that I looked around at my fellow customers. I had imagined they would be skinheads or slick-haired, oily types who would poke at each other in amusement at my questions, my stance, my purchase.\n \n Instead, there was a clean-cut fellow wearing shorts and a Polo T-shirt. Several older guys were talking about deer and moose and elk. Everyone spoke softly. They were intent on business. Yes, one man did have a tattoo. But there was also a very nice-looking girl in her 20s, wearing one of those long black summer dresses with the little straps, looking quite glamorous. I saw her examining a Beretta. Obviously, her hands are stronger than mine, I thought, watching her pull back the slide. I resolved to exercise my hands &#8212; 20 minutes at the piano playing scales and Bach fugues every morning.\n\n   Author Sonia Wolff's Gun Essay. \n If I may, the truth is that you do not become someone else, you grow up. The reluctance Sonia describes is experienced by nearly everyone who contemplates defensive gun use. The real important thing to notice is that we are not really talking about becoming someone else, someone worse, someone angry, we remain ourselves in a new acumen of personal responsibility. Scary. Lots of self-doubt come with any large responsibility, lots of diligence comes, too. Lots of heat from others comes, too. With it comes a personal independence though, which Sonia does not seem to fear. Her frankness in her essay says that. \n \n Nor are we becoming capable of violence. Self-defense is not violence; we do not shoot to kill, we shoot to stay alive. What is the difference? The difference is that one is aggression and the other is defense. If you even tried to stop a child abduction, would that be violence or preventing violence? The first, unchecked, destroys families and whole communities, and the second protects individuals, families and whole communities.\n \n Free people live by the self-restraint of using lethal force only when facing such grave danger. A new gun owner needs to understand that she is not engaging in violence, but in resisting it. Reluctantly, but necessary. You are not the aggressor. \n", 
   {}, 
   408712, 
   null, 
   1280337300.0
  ], 
  [
   408728, 
   null, 
   "Galileo", 
   "Geesh, people can't answer questions sometimes on this forum.\n \n I'll answer your question...\n \n The 2nd amendment was created because it is the responsibility of the citizens to blow away their government should they continuously oppress the people.\nYeah I think everybody knows that, I just wanted to see how the pro gunners spin it to make it applicable today.\n\n Good question. I think in Heller they tried to replace the fears that the Founding Fathers had about standing armies endangering the liberty of the people with modern fears about intruders endangering people in their own homes. I think that's how pro-gun activists have tried to spin it to make it more relevant in today's world. \n \n \nBoth topics got co-mingled by star gazer in his habit of spamming every board with the same illogic: http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read.html#post408583\n \n\n I was responding to a comparison that was already being discussed.", 
   {}, 
   408714, 
   null, 
   1280360460.0
  ], 
  [
   408730, 
   null, 
   "Accipiter", 
   "The topic of the thread is/was: Has the reduction in FFLs been beneficial?\n \n Wanna try again or continue to suck your thumb? You haven't had a post on topic since your first post.\n\n I could care less about the whole thing, it's YOU who care about it, and it is YOU who sailed in here and made a steaming heap of poop out of it.\n \n Your a total bozo.", 
   {}, 
   408711, 
   null, 
   1280361240.0
  ], 
  [
   408731, 
   null, 
   "Galileo", 
   "The topic of the thread is/was: Has the reduction in FFLs been beneficial?\n \n Wanna try again or continue to suck your thumb? You haven't had a post on topic since your first post.\n\n No, you're confusing this thread with another thread-\n http://www.4forums.com/political/gun-control-debates/14498-has-reduction-ffls-been-beneficial.html\n \n From an article you might want to read:\n \"Dementia is the progressive deterioration in cognitive function - the ability to process thought (intelligence).\"\n What is Dementia? What Causes Dementia? Symptoms of Dementia", 
   {}, 
   408711, 
   null, 
   1280361780.0
  ], 
  [
   408735, 
   null, 
   "NATO 556", 
   "Good question. I think in Heller they tried to replace the fears that the Founding Fathers had about standing armies endangering the liberty of the people with modern fears about intruders endangering people in their own homes. I think that's how pro-gun activists have tried to spin it to make it more relevant in today's world.\n\n \n Despite your best claims to the contrary, there's absolutely nothing to suggest that the Second Amendment isn't relevant in today's world. If anything it's even more relevant today than it was 230+ years ago.", 
   {}, 
   408728, 
   null, 
   1280362620.0
  ], 
  [
   408748, 
   null, 
   "zsu2357", 
   "No, you're confusing this thread with another thread-\n http://www.4forums.com/political/gun-control-debates/14498-has-reduction-ffls-been-beneficial.html\n \n From an article you might want to read:\n \"Dementia is the progressive deterioration in cognitive function - the ability to process thought (intelligence).\"\n What is Dementia? What Causes Dementia? Symptoms of Dementia\n\n \n Doc I think Starguy just slammed you in his little starguyish way.emoticon_wow", 
   {}, 
   408731, 
   null, 
   1280383140.0
  ], 
  [
   408751, 
   null, 
   "zsu2357", 
   "Good question. I think in Heller they tried to replace the fears that the Founding Fathers had about standing armies endangering the liberty of the people with modern fears about intruders endangering people in their own homes. I think that's how pro-gun activists have tried to spin it to make it more relevant in today's world. \n\n Standing armies or intruders the 2nd amend.is what it says, Right To Keep And Bear Arms \n After over 200 years I guess, it grows on you.And yes the founding fathers might have wondered if the Englanders were gonna try a come back.;)", 
   {}, 
   408728, 
   null, 
   1280385900.0
  ], 
  [
   408761, 
   null, 
   "Tither", 
   "Good question. I think in Heller they tried to replace the fears that the Founding Fathers had about standing armies endangering the liberty of the people with modern fears about intruders endangering people in their own homes. I think that's how pro-gun activists have tried to spin it to make it more relevant in today's world. \n\n What? Our Founding fathers didn't fear crime, home invasions, burglars and the like? \n \n \"Laws that forbid the carrying of arms...disarm only those who are neither inclined nor determined to commit crimes. Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than prevent homicides, for an unarmed man may be attacked with greater confidence than an armed one.\"\n\n This is what Tomas Jefferson believed. How can that be spin? \n \n\n \"[A]rms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property. . . Horrid mischief would ensue were the law-abiding deprived of the use of them.\"1775 \n\n emoticon_smile", 
   {}, 
   408728, 
   null, 
   1280413200.0
  ], 
  [
   408763, 
   null, 
   "Doc Jones", 
   "Doc I think Starguy just slammed you in his little starguyish way.emoticon_wow\n\n \n \n Yep, he is still off topic and does not know where he is :) Kind of funny in a very strange way.\n \n I suppose we are lucky he didn't post any more Lambert stuff and spam the board with leftover anti gun screed from his small collection of sources and issues long dead.", 
   {}, 
   408748, 
   null, 
   1280414040.0
  ], 
  [
   408782, 
   null, 
   "Galileo", 
   "What? Our Founding fathers didn't fear crime, home invasions, burglars and the like Originally Posted by Thomas Jefferson\n \n \"Laws that forbid the carrying of arms...disarm only those who are neither inclined nor determined to commit crimes. Such laws make things worse for the assaulted and better for the assailants; they serve rather to encourage than prevent homicides, for an unarmed man may be attacked with greater confidence than an armed one.\"? \n \n This is what Tomas Jefferson believed. How can that be spin Originally Posted by Thomas Paine, of Pennsylvania\n \"[A]rms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property. . . Horrid mischief would ensue were the law-abiding deprived of the use of them.\"1775? \n \n emoticon_smile\n\n Cherry picking out a quote from Jefferson that was far removed from the debates surrounding the Second Amendment does not prove anything about the focus of the Second Amendment. As for the Thomas Paine quote let's look at it in more context:\n \n \"The supposed quietude of a good man allures the ruffian; while on the other hand, arms like laws discourage and keep the invader and the plunderer in awe, and preserve order in the world as well as property. The balance of power is the scale of peace. The same balance would be preserved were all the world destitute of arms, for all would be alike; but since some will not others dare not lay them aside. And while a single nation refuses to lay them down, it is proper that all should keep them up. Horrid mischief would ensue were one half the world deprived of the use of them; for while avarice and ambition have a place in the heart of man, the weak will become a prey to the strong. The history of every age and nation establishes these truths, and facts need but little arguments when they prove themselves.\"\n \n Notice how \"law abiding\" was cunningly substituted for \"one half the world\" in Tither's misquote of Paine. That was done to intentionally mislead people into believing that Paine is talking about the importance of self defense against criminals rather than the importance of national defense. \n \n \n \nYep, he is still off topic and does not know where he is :) Kind of funny in a very strange way.\n \n I suppose we are lucky he didn't post any more Lambert stuff and spam the board with leftover anti gun screed from his small collection of sources and issues long dead.\n\n Since you can't even keep track of what this thread is about you're in no position to determine if someone is trying to derail the thread.", 
   {}, 
   408763, 
   null, 
   1280434860.0
  ], 
  [
   408785, 
   null, 
   "Doc Jones", 
   "Cherry picking out a quote from Jefferson that was far removed from the debates surrounding the Second Amendment does not prove anything about the focus of the Second Amendment. As for the Thomas Paine quote let's look at it in more context:\n \n \"The supposed quietude of a good man allures the ruffian; while on the other hand, arms like laws discourage and keep the invader and the plunderer in awe, and preserve order in the world as well as property. The balance of power is the scale of peace. The same balance would be preserved were all the world destitute of arms, for all would be alike; but since some will not others dare not lay them aside. And while a single nation refuses to lay them down, it is proper that all should keep them up. Horrid mischief would ensue were one half the world deprived of the use of them; for while avarice and ambition have a place in the heart of man, the weak will become a prey to the strong. The history of every age and nation establishes these truths, and facts need but little arguments when they prove themselves.\"\n \n Notice how \"law abiding\" was cunningly substituted for \"one half the world\" in Tither's misquote of Paine. That was done to intentionally mislead people into believing that Paine is talking about the importance of self defense against criminals rather than the importance of national defense. \n \n \n \n Since you can't even keep track of what this thread is about you're in no position to determine if someone is trying to derail the thread.\n\n \n This post for instance, is related exactly how to the OP? Is it denial? Fear?\n What motivated this anti gun post of your'n? You got a link for that? I know you can't retain anything long enough to remember an exact quote. :)", 
   {}, 
   408782, 
   null, 
   1280436300.0
  ], 
  [
   408793, 
   null, 
   "Tither", 
   "Notice how \"law abiding\" was cunningly substituted for \"one half the world\" in Tither's misquote of Paine. That was done to intentionally mislead people into believing that Paine is talking about the importance of self defense against criminals rather than the importance of national defense. \n\n Speaking of Horrid Mischief. Now lets look at what Tither actually quoted.\n \n\"[A]rms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property. . . Horrid mischief would ensue were the law-abiding deprived of the use of them.\"1775 \n\n And here are some linked quotes that will likely clear up the game that Galileo plays. emoticon_smile\n   Quotes on the Second Amendment: \n \"The supposed quietude of a good man allures the ruffian; while on the other hand, arms like laws discourage and keep the invader and the plunderer in awe, and preserve order in the world as well as property. The same balance would be preserved were all the world destitute of arms, for all would be alike; but since some will not, others dare not lay them aside... Horrid mischief would ensue were one half the world deprived of the use of them....\" (I Writings of Thomas Paine at 56 [1894])\n \n \"Arms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property... Horrid mischief would ensue were the law-abiding deprived of the use of them.\" - Thoughts on Defensive War, 1775\n\n   Thomas Paine Quotes:\n \"Arms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property...Horrid mischief would ensue were the law-abiding deprived of the use of them.\" (Thomas Paine, Thoughts On Defensive War, 1775)\n", 
   {}, 
   408782, 
   null, 
   1280440680.0
  ], 
  [
   408805, 
   null, 
   "NATO 556", 
   "Cherry picking out a quote from Jefferson that was far removed from the debates surrounding the Second Amendment does not prove anything about the focus of the Second Amendment.\n \n \n It doesn't matter if it's related directly to the Second Amendment or not. Jefferson's quote spoke a great deal about the understood concept of armed self defense. And that's far more important than some supposed compulsory service to the government that would discard you like trash the second you've outlived your usefulness.\n \n \nNotice how \"law abiding\" was cunningly substituted for \"one half the world\" in Tither's misquote of Paine. That was done to intentionally mislead people into believing that Paine is talking about the importance of self defense against criminals rather than the importance of national defense.\n\n \n If people are being murdered off because the laws discourage or forbid self defense, there's absolutely no way one can contribute to and maintain the national defense.\n \n Use your brain. No excuses.", 
   {}, 
   408782, 
   null, 
   1280446980.0
  ], 
  [
   408808, 
   null, 
   "zsu2357", 
   "Cherry picking out a quote from Jefferson that was far removed from the debates surrounding the Second Amendment does not prove anything about the focus of the Second Amendment. As for the Thomas Paine quote let's look at it in more context:\n \n \"The supposed quietude of a good man allures the ruffian; while on the other hand, arms like laws discourage and keep the invader and the plunderer in awe, and preserve order in the world as well as property. The balance of power is the scale of peace. The same balance would be preserved were all the world destitute of arms, for all would be alike; but since some will not others dare not lay them aside. And while a single nation refuses to lay them down, it is proper that all should keep them up. Horrid mischief would ensue were one half the world deprived of the use of them; for while avarice and ambition have a place in the heart of man, the weak will become a prey to the strong. The history of every age and nation establishes these truths, and facts need but little arguments when they prove themselves.\"\n Starguy say...\n \nNotice how \"law abiding\" was cunningly substituted for \"one half the world\" in Tither's misquote of Paine. That was done to intentionally mislead people into believing that Paine is talking about the importance of self defense against criminals rather than the importance of national defense. \n\n \"Arms discourage and keep the invader and plunderer in awe, and preserve order in the world as well as property...Horrid mischief would ensue were the law-abiding deprived of the use of them.\" (Thomas Paine, Thoughts On Defensive War, 1775\n \n \nSince you can\\'t even keep track of what this thread is about you\\'re in no position to determine if someone is trying to derail the thread.\n\n\n So who can\\'t keep track of what?", 
   {}, 
   408782, 
   null, 
   1280447880.0
  ], 
  [
   408810, 
   null, 
   "Tither", 
   "So who can\\'t keep track of what?\n\n Ummm.   I\\'d like to point out the truth.  \n \n I quoted Paine Dead Accurately! Galileo snipped his diatribe from a different Paine quote from a different year. emoticon_smile The master of deception hopes people will not realize the Bate and Switch!", 
   {}, 
   408808, 
   null, 
   1280450460.0
  ], 
  [
   408816, 
   null, 
   "zsu2357", 
   "Ummm.   I'd like to point out the truth.  \n \n I quoted Paine Dead Accurately! Galileo snipped his diatribe from a different Paine quote from a different year. emoticon_smile The master of deception hopes people will not realize the Bate and Switch!\n\n I read the ramblings of the Starguy several times and it didn't add up so I needlessly checked his quote(Paine)and of course your were right,just wanted to rub\n his snout in it.\n Your Still The Tither! \n \n emoticon_xgood", 
   {}, 
   408810, 
   null, 
   1280458380.0
  ], 
  [
   408829, 
   null, 
   "Tither", 
   "All right. Perhaps there is some translation confusion. I did a hard search on the topic. BY FAR, the meaning the quote I referenced is the correct one! \n \n Google search. more than 20 pages of the same quote using law-abiding.  Thomas Paine \n Horrid mischief would ensue were (the law-abiding) deprived the use of them. Writings of Thomas Paine at 56 (1894) ..\n \n \n To include US history site  Thomas Paine quote  \n \n brainy quote  Thomas Paine quote \n \n And these scholarly papers.   Likewise, Thomas Paine both denied that arms controls would disarm criminals \n and deemed it a positive social good that decent people be armed against them:\n [T]he peaceable part of mankind will be continually overrun by the vile and abandoned, while they neglect the means of self-defense.... The supposed quietude of a good man allures the ruffian; ... [but] arms like laws discourage and keep the invader and the plunderer in awe, and preserve order in the world.... Horrid mischief would ensue were [the good] deprived of the use of them ... the weak will become a prey to the strong.[32]\n\n \n   From these premises it followed, as Thomas Paine wrote, \nthat \"the good man\" had both right and need for arms; moreover, no law would dissuade \"the invader and the plunderer\" from having them. So, \"since some will not, others dare not lay them aside.\" \"Horrid mischief would ensue were [the law-abiding] deprived of the use of them; ... the weak will become a prey to the strong.\"[16] Cesare Beccaria assailed arms bans as a paradigm of simplistic legislation reflecting \"False Ideas of Utility.\" His discussion deserves quotation in full, in part because Thomas Jefferson laboriously copied it in long-hand into his personal compilation of great quotations:(page.91)\n\n \n Galileo looks for points when none are due his side.", 
   {}, 
   408816, 
   null, 
   1280466000.0
  ], 
  [
   408832, 
   null, 
   "zsu2357", 
   "All right. Perhaps there is some translation confusion. I did a hard search on the topic. BY FAR, the meaning the quote I referenced is the correct one! \n\n Well there is no perhaps about it,the only confusion comes from friend Starguy.emoticon_confused<Starguy", 
   {}, 
   408829, 
   null, 
   1280469960.0
  ], 
  [
   408835, 
   null, 
   "Tither", 
   "It appears that the Thomas Paine quote is massaged, (for clarity, and nothing mischievous), into the common way in which I quoted it, and now we also have this paper showing our Founding Fathers thoughts and beliefs on Self Defense. \n \n   THE SECOND AMENDMENT AND THE IDEOLOGY OF SELF-PROTECTION \n \n Thanks Galileo. You made me search for the truth, and I found it. I also found the truth about our Founders belief in Self Defense in this paper! I think you are going to have a hard time saying that Our Founders didn't respect the Individual Right of Self Defense. Armed self Defense at that! emoticon_smile", 
   {}, 
   408832, 
   null, 
   1280498760.0
  ], 
  [
   408916, 
   null, 
   "Galileo", 
   "Ummm.   I'd like to point out the truth.  \n \n I quoted Paine Dead Accurately! Galileo snipped his diatribe from a different Paine quote from a different year. emoticon_smile The master of deception hopes people will not realize the Bate and Switch!\n\n \n \nIt appears that the Thomas Paine quote is massaged, (for clarity, and nothing mischievous), into the common way in which I quoted it, and now we also have this paper showing our Founding Fathers thoughts and beliefs on Self Defense. \n \n   THE SECOND AMENDMENT AND THE IDEOLOGY OF SELF-PROTECTION \n \n Thanks Galileo. You made me search for the truth, and I found it. I also found the truth about our Founders belief in Self Defense in this paper! I think you are going to have a hard time saying that Our Founders didn't respect the Individual Right of Self Defense. Armed self Defense at that! emoticon_smile\n\n I pointed out how you were misquoting Paine and for that you claimed I was trying to mislead people. Later, you admitted your own quoting of Paine was \"massaged\" but claim it doesn't matter anyway. So in other words you're not going to let the facts get in the way of the \"truth\". My argument has been that the Second Amendment was intended mainly as a protection against tyranny not against common criminals. However, I doubt that it is possible to have a constructive debate about that with anybody that can't be honest about a simple point and will try to play games every time something like this comes up.", 
   {}, 
   408835, 
   null, 
   1280607420.0
  ], 
  [
   408917, 
   null, 
   "Galileo", 
   "All right. Perhaps there is some translation confusion. I did a hard search on the topic. BY FAR, the meaning the quote I referenced is the correct one! \n \n Google search. more than 20 pages of the same quote using law-abiding.  Thomas Paine  \n \n\n Yes that misquote does come up a lot if you do a google search. That doesn't mean it's correct and I suspect it happens because your side tries to flood the internet with lies. I've had battles with people trying to flood the wikipedia article on Gun Politics with pro-gun propaganda. They want to shout down anyone who disagrees with them.", 
   {}, 
   408829, 
   null, 
   1280607960.0
  ], 
  [
   408919, 
   null, 
   "Tither", 
   "Later, you admitted your own quoting of Paine was \"massaged\" but claim it doesn't matter anyway.\n and\n Yes that misquote does come up a lot if you do a google search. That doesn't mean it's correct and I suspect it happens because your side tries to flood the internet with lies. I've had battles with people trying to flood the wikipedia article on Gun Politics with pro-gun propaganda. They want to shout down anyone who disagrees with them.\n\n All right dude. If you think that post fits you well after I spent all of that time proving you were the one who was correct, after a hard search of the facts, then go on and try to sell it then, big guy! I didn't even delete the post where I was wrong, even though my very own proof proved embarrassing to me! emoticon_smile", 
   {}, 
   408917, 
   null, 
   1280609400.0
  ], 
  [
   408921, 
   null, 
   "Tither", 
   "Was this a a Freudian slip that I enlarged here? \n My argument has been that the Second Amendment was intended mainly as a protection against tyranny not against common criminals. \n\n So you expect people to believe that We the People have a Right of Self Defense, that has been found to be individual, in Heller, but that right of self defense ONLY applies to governments, and that being the case, that right only applies when it is OUR government. What if our government ceases to exist, in one of your attacks against them? Does our Right cease to exist then? emoticon_smile\n \n Does any of that make any sense? What about Indian attacks? How about Bears? What was a frontiersman to do if another settler attacks him, and is trying to kill him? What if a band of marauders seeks someone out and the nearest city is 2 days away? emoticon_smile \n \n How do you explain this stuff? \n   The Bill Of Rights ~ The First Ten Amendments to the Constitution \n Alexander Hamilton 1775\n The Sacred Rights of Mankind are not to be rummaged for among old parchment, or musty records. They are written with a sun beam in whole volume of human nature, by the hand of the divinity itself, and can never be erased or obscured by mortal power. \n\n \n   \n The Declaration of Independence \nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\n\n \n How will you explain away the reasons of why the the 14th Amendment was necessary then? \n   Restoring the Privileges or Immunities Clause \n Such views are central to the historical backdrop that led the Radical Republicans to draft both the Civil Rights Act of 1866 and the 14th Amendment. In each case, they sought to protect African Americans and their white allies from the depredations of the former Confederate states, including the infamous Black Codes, which curtailed property rights, liberty of contract, free speech, and the right to keep and bear arms.\n\n The 14th Amendment was designed to stop Whites militia's and some government entities from disarming Freedmen or freed slaves, and engage in lynchings and the like. \n   Institute for Justice -- 14th Amendment \n 2. The history and adoption of the Fourteenth Amendment demonstrates the Framer&#8217;s specific and repeated concern that freedmen were being disarmed by state and local governments and militias, in violation of what those Framers understood to be an individual constitutional right to bear arms. In response to this Court&#8217;s previous refusal to enforce parts of the Bill of Rights directly against the States, and its holding that blacks were not citizens of the United States entitled to the rights of such citizens, the Framers set out to remedy the inability to enforce numerous constitutional rights against the States by incorporating them into the Fourteenth Amendment. Identification of the evils the 39th Congress sought to remedy &#8211; including the disarming of freedmen &#8211; the parallel legislative responses to that problem, and the specific explanations by the Framers of the purpose and function of the Fourteenth Amendment, all demonstrate that they viewed the existing constitutional right to bear arms as an individual right of personal security. And they understood and intended the language of the Fourteenth Amendment to secure such a right against the States and various militias, not merely in the service of the very entities seeking to disarm and abuse the freedmen. And by accomplishing that goal through the identification and extension of the rights of national citizens, the Framers of the Fourteenth Amendment also clarified and defined the underlying rights in the Second Amendment as well.\n", 
   {}, 
   408916, 
   null, 
   1280611740.0
  ], 
  [
   408922, 
   null, 
   "NATO 556", 
   "My argument has been that the Second Amendment was intended mainly as a protection against tyranny not against common criminals.\n\n \n You've never made such an argument.\n \n First you argued that the Second Amendment was a collective rights tool designed to ensure that each state had its own private militia.\n \n Then you argued that the Second Amendment was a racist tool designed purely and exclusively for the purpose of keeping blacks \"in their place\" under the thumb of their master.\n \n And now you're trying to argue that the Second Amendment only applies when the government acts up, but it doesn't exist when you face a mugger, rapist or arsonist?\n \n You've never made a coherent point yet. Try again!", 
   {}, 
   408916, 
   null, 
   1280612220.0
  ], 
  [
   408927, 
   null, 
   "Tither", 
   "  From the Constitution Society \n There is considerable confusion about the legal theory underlying the \"right to keep and bear arms\". This is a brief outline for a clarification of the discussion of this issue. \n \n < (1) The Second Amendment to the U.S. Constitution does not establish the right to keep and bear arms. None of the provisions of the Constitution establish any \"natural\" rights. They recognize such rights, but the repeal of such provisions would not end such rights. Such rights were considered by many of the Framers as obvious or \"self-evident\", but they were immersed in the prevailing republican thought of the day, as expressed in the writings of Locke, Montesquieu, Rousseau, Madison, Hamilton, and others, which discussed \"natural rights\" in some detail. Others argued that at least some of the rights needed to be made explicit in the Bill of Rights to avoid having future generations with less understanding of republican theory weaken in their defense of those rights. That has turned out to have been a good idea \n\n It has been suggested that, our Founding Fathers believed that defense against an over reaching government is a Natural Right, however our Founders must not have believe Personal Self Defense as a Natural Right endowed to us by our creator. Note the word self. \n \n What is a Natural Right? A Natural Right is, as the Declaration of Independence says, God, or Nature&#8217;s God, given Rights. They are Observable in most all of nature as evidence of God given. They are hard wired into our DNA so to speak. \n \n One would have to seemingly suggest that in the Bee kingdom for instance, the only time bees, (or and other animal, for that matter,) fights or takes to flight, is when the Queen Bee gets overbearingly tyrannical! Since our creator, with these Inalienable Natural Rights, endowed us, one must then say that nowhere in nature does an animal try to defend him or herself. They just roll over and accept death.\n \n I'll leave it to the readers of this forum to make up your own minds as to weather or not Personal Self Defense is observable in Nature or not.\n \n In fact the Right of Self Defense from a tyrannical government is inherited from our Personal Right to Self Defense, and not the other way around. If there is not a right to personal defense, then one could correctly argue that their is no right to self defense from government tyranny.", 
   {}, 
   408922, 
   null, 
   1280625240.0
  ], 
  [
   408933, 
   null, 
   "Doc Jones", 
   "The merit of our Constitution is not that it promotes democracy, but checks it. - HORATIO SEYMOUR", 
   {
    "unicode_changes_made": true
   }, 
   408927, 
   null, 
   1280630700.0
  ], 
  [
   408944, 
   null, 
   "Doc Jones", 
   "My argument has been that the Second Amendment was intended mainly as a protection against tyranny not against common criminals.\n \n \n Which is a sickness explained in the article which is the subject of this discussion. You keep spreading your illness before the world by denial. I will address your claim here though. Your advocation of government control of 2A rights, registration, confiscation etc. belies your intent to claim you actually believe it is to be used as \"protection against tyranny\" either. Your hoplophobia is killing you...and your arguments.\n \n \nHowever, I doubt that it is possible to have a constructive debate about that with anybody that can't be honest about a simple point and will try to play games every time something like this comes up.\n\n \n Nope, you try to derail every debate with the same line of BS which is foisted on the board by trying every time to attempt to define the \"militia\" as the only ones that can be armed by the government for the purpose of dispelling the tyrant which is the head duck in that same government. You want to ignore all written, historical findings by the Court as well as those of our own DOJ and past presidents. Your god is gun grabbing and the Constitution be d.....d. What the heck does an english subject know about a Constitution they don't have themselves? Your constant bait and switch always leads back to the same disproven claim, \"only the militia can have guns when the tyrant issues them to them\". Even a first grader could see that would be like giving spray paint to a tagger and claim that it couldn't be used to sniff to cause brain damage. You senseless circular argument remains overturned and disproven but you keep ranting away, foaming at the mouth with your buck teeth showing and swollen purple face. Ugly sight to be certain but you can't help yourself and you see no comparison in the Sarah Thompson article that diagnosis and self-help offers you? You are impotent, your claims have been rejected by the highest Court in the land 9-0 but you keep butting your head against the wall. Your .orgs are shambles and you are finished...get help.", 
   {}, 
   408916, 
   null, 
   1280673660.0
  ], 
  [
   408961, 
   null, 
   "Superlite27", 
   "Wow. This thread is very entertaining.\n \n Does anyone else find the anti-gunner's strict adherence to the characteristics described in the article while trying to convince everyone of its invalidity amusingly ironic?\n \n Note to antigunners:\n \n Completely ignoring questions regarding your denial fails miserably at convincing people the accusation is misplaced. As a matter of fact, it pretty much confirms it.\n \n Folks who ignore relevant questions pertinent to the topic, yet focus like a laser with incendentals like \"Why do you want to know my age?\" are a hoot. Denial much?\n \n Comments like \"They want to shout down anyone who disagrees with them.\" fare poorly when one keeps interjecting different forms of attack irrellevant to the original article. I love this statement. Projection much? \n \n Then Nato has to point out:\n \n \nFirst you argued that the Second Amendment was a collective rights tool designed to ensure that each state had its own private militia.\n \n Then you argued that the Second Amendment was a racist tool designed purely and exclusively for the purpose of keeping blacks \"in their place\" under the thumb of their master.\n \n And now you're trying to argue that the Second Amendment only applies when the government acts up, but it doesn't exist when you face a mugger, rapist or arsonist?\n\n \n Hmmmmm. Reaction Formation much?\n \n Wow. I didn't know refuting an analysis was possible by religiously adhering to the concepts you are trying to prove nonexistant.", 
   {}, 
   408805, 
   null, 
   1280699160.0
  ], 
  [
   408962, 
   null, 
   "Galileo", 
   "You've never made such an argument.\n \n First you argued that the Second Amendment was a collective rights tool designed to ensure that each state had its own private militia.\n \n Then you argued that the Second Amendment was a racist tool designed purely and exclusively for the purpose of keeping blacks \"in their place\" under the thumb of their master.\n \n And now you're trying to argue that the Second Amendment only applies when the government acts up, but it doesn't exist when you face a mugger, rapist or arsonist?\n \n You've never made a coherent point yet. Try again!\n\n You are not my spokesperson and if you were you'd soon be fired for incompetence!", 
   {}, 
   408922, 
   null, 
   1280700900.0
  ], 
  [
   408963, 
   null, 
   "Galileo", 
   "Which is a sickness explained in the article which is the subject of this discussion. You keep spreading your illness before the world by denial. I will address your claim here though. Your advocation of government control of 2A rights, registration, confiscation etc. belies your intent to claim you actually believe it is to be used as \"protection against tyranny\" either. Your hoplophobia is killing you...and your arguments.\n \n Nope, you try to derail every debate with the same line of BS which is foisted on the board by trying every time to attempt to define the \"militia\" as the only ones that can be armed by the government for the purpose of dispelling the tyrant which is the head duck in that same government. You want to ignore all written, historical findings by the Court as well as those of our own DOJ and past presidents. Your god is gun grabbing and the Constitution be d.....d. What the heck does an english subject know about a Constitution they don't have themselves? Your constant bait and switch always leads back to the same disproven claim, \"only the militia can have guns when the tyrant issues them to them\". Even a first grader could see that would be like giving spray paint to a tagger and claim that it couldn't be used to sniff to cause brain damage. You senseless circular argument remains overturned and disproven but you keep ranting away, foaming at the mouth with your buck teeth showing and swollen purple face. Ugly sight to be certain but you can't help yourself and you see no comparison in the Sarah Thompson article that diagnosis and self-help offers you? You are impotent, your claims have been rejected by the highest Court in the land 9-0 but you keep butting your head against the wall. Your .orgs are shambles and you are finished...get help.\n\n Another one of your rants. Too bad that people in la-la land have internet access. If you are under the delusion that Heller and McDonald rulings were 9-0 then you should check out the 5-4 Supreme Court Rulings thread. The controversial Roe v. Wade decision was 7-2. 5-4 decisions have even more reason to be controversial and questionable.", 
   {}, 
   408944, 
   null, 
   1280701500.0
  ], 
  [
   408967, 
   null, 
   "NATO 556", 
   "Another one of your rants. Too bad that people in la-la land have internet access. If you are under the delusion that Heller and McDonald rulings were 9-0 then you should check out the 5-4 Supreme Court Rulings thread. The controversial Roe v. Wade decision was 7-2. 5-4 decisions have even more reason to be controversial and questionable.\n\n \n Learn to use your brain before you speak.\n \n Your current claim is that the Second Amendment was designed only to be used against the federal government should it become tyrannical and need to be struck down.\n \n In the threads dealing with Chicago's handgun ban, you claimed that even if their ban was found unconstitutional under the Second Amendment it should still be allowed to remain in effect.\n \n In other threads you've made the argument that all manner of various gun control laws could be found to not violate the Second Amendment, and that nothing in the Constitution should prevent the government from passing any further gun control law that they find reasonable.\n \n Do you even comprehend how you contradict yourself with arguments like these? How could the Second Amendment be used against the government, if the government has the authority to infringe upon that right in whatever manner they see fit?\n \n You should really stop trying to talk out of both sides of your face at the same time.", 
   {}, 
   408963, 
   null, 
   1280703240.0
  ], 
  [
   408970, 
   null, 
   "Galileo", 
   "Learn to use your brain before you speak.\n \n Your current claim is that the Second Amendment was designed only to be used against the federal government should it become tyrannical and need to be struck down.\n \n In the threads dealing with Chicago's handgun ban, you claimed that even if their ban was found unconstitutional under the Second Amendment it should still be allowed to remain in effect.\n \n In other threads you've made the argument that all manner of various gun control laws could be found to not violate the Second Amendment, and that nothing in the Constitution should prevent the government from passing any further gun control law that they find reasonable.\n \n Do you even comprehend how you contradict yourself with arguments like these? How could the Second Amendment be used against the government, if the government has the authority to infringe upon that right in whatever manner they see fit?\n \n You should really stop trying to talk out of both sides of your face at the same time.\n\n You are trying to manufacture a contradiction by unjustifiably assuming a conflict between regulation and defense against tyranny. I have brought up this article before to expose this false assumption:\n \"As long as there have been guns in America there have been regulations governing their use and storage. Without government direction there would have been no body of Minutemen to muster on the town greens at Lexington and Concord. If the Founders had imbibed the strong gun rights ideology that drives today's gun debate we would all be drinking tea and singing, 'God save our gracious Queen.' \"\n It's Time for Gun Control Proponents to Reclaim the Constitutional High Ground\n \n Chief Justice Story voiced similar sentiments about the importance of regulation as I have pointed out before. He warned that a desire \"to be rid of all regulations\" could undermine the protection against tyranny intended by the Second Amendment:\n \"The right of the citizens to keep and bear arms has justly been considered, as the palladium of the liberties of a republic; since it offers a strong moral check against the usurpation and arbitrary power of rulers; and will generally, even if these are successful in the first instance, enable the people to resist and triumph over them. And yet, though this truth would seem so clear, and the importance of a well regulated militia would seem so undeniable, it cannot be disguised, that among the American people there is a growing indifference to any system of militia discipline, and a strong disposition, from a sense of its burthens, to be rid of all regulations. How it is practicable to keep the people duly armed without some organization, it is difficult to see. There is certainly no small danger, that indifference may lead to disgust, and disgust to contempt; and thus gradually undermine all the protection intended by this clause of our national bill of rights.\"\n http://www.4forums.com/political/gun-control-debates/12948-happy-4th-july-all-3.html#post360950", 
   {}, 
   408967, 
   null, 
   1280705040.0
  ], 
  [
   408971, 
   null, 
   "NATO 556", 
   "Another one of your rants. Too bad that people in la-la land have internet access. If you are under the delusion that Heller and McDonald rulings were 9-0 then you should check out the 5-4 Supreme Court Rulings thread. The controversial Roe v. Wade decision was 7-2.\n\n \n I can't even begin to fathom a court case that would make it all the way to the Supreme Court, and serve for the justices to ultimately rule that a person doesn't have a right to own a gun to defend themselves. Can you?\n \n Who would even make such a statement? Who's going to file a lawsuit and allege that a person doesn't have a right to own a gun for any reason? And even if you could find someone crazy enough to make such an argument, who is going to be crazy enough to try and argue that even if you have a right to own a gun, you have absolutely no right whatsoever to use it for defensive purposes against another?\n \n Do you even realize how crazy you are to be making such an argument? Who's going to go to court and argue such a position? What judge would be crazy enough to rule in favor of the plaintiff? Even if you did find one, what superior court would ever allow such a ruling to stand? What organization would have any standing to take the case all the way to the Supreme Court?\n \n Do you realize that if Heller and McDonald were overruled, determining that nobody may under any circumstances, keep a gun for legal purposes, that would essentially rule that no person may ever use lethal force to protect themselves against harm? Such a standard would be overturning many hundreds of years of established precedent as far as rule of law goes. Even back in colonial days the courts understood that it was acceptable to kill a criminal if it was necessary to protect the life of an innocent.\n \n \n5-4 decisions have even more reason to be controversial and questionable.\n\n \n No they don't. All Supreme Court decisions, regardless of the outcome, are a matter of established law and have as much validity as any other, and as much weight as any law passed by congress, if not more.\n \n Controversial? Questionable? Not even in the slightest. Even if they were, too bad, you lose.\n \n If you argue against the Second Amendment being an individual right to own a gun for lawful purposes, you're basically admitting that you lied about it being a tool to use against the government should it turn tyrannical.", 
   {}, 
   408963, 
   null, 
   1280705220.0
  ], 
  [
   408972, 
   null, 
   "NATO 556", 
   "You are trying to manufacture a contradiction by unjustifiably assuming a conflict between regulation and defense against tyranny. I have brought up this article before to expose this false assumption:\n\n \n Kindly learn to use your brain, or stop posting entirely.\n \n You've argued that laws regarding registration, purchasing limitation, bans on \"non-sporting firearms\", confiscation, etc. would be found reasonably legal under the Second Amendment. \n \n How exactly do you expect us to believe this new statement of yours, that the Second Amendment protects us against a tyrannical government, if the government has the authority to implement all these laws, how exactly are we supposed to defeat them should we need to? Do you expect us to do it with single shot rifles and BB guns, because the government found that our handguns and AR-15s aren't suitable for civilian ownership and banned them? Do you think we'll have much chance of knocking the tyrant from their throne with outdated, obsolete technology that possesses no battle edge in close quarter fighting?\n \n \n\"As long as there have been guns in America there have been regulations governing their use and storage. Without government direction there would have been no body of Minutemen to muster on the town greens at Lexington and Concord. If the Founders had imbibed the strong gun rights ideology that drives today's gun debate we would all be drinking tea and singing, 'God save our gracious Queen.' \"\n\n \n Where would we be if the Minute Men were required to wait ten days for government approval before they could take possession of their firearms?\n \n \nChief Justice Story voiced similar sentiments about the importance of regulation as I have pointed out before. He warned that a desire \"to be rid of all regulations\" could undermine the protection against tyranny intended by the Second Amendment:\n\n \n Story's sentiment has no standing, as the government outlawed the private militia from assembling and drilling. So unless the Supreme Court reverses its position and determines that the American people have the right to turn themselves into adequately equipped, highly trained fighting machines capable of rivaling the US army, you and Story are just babbling incoherently.", 
   {}, 
   408970, 
   null, 
   1280705880.0
  ], 
  [
   408979, 
   null, 
   "Doc Jones", 
   "You are trying to manufacture a contradiction by unjustifiably assuming a conflict between regulation and defense against tyranny. I have brought up this article before to expose this false assumption:\n \"As long as there have been guns in America there have been regulations governing their use and storage. Without government direction there would have been no body of Minutemen to muster on the town greens at Lexington and Concord. If the Founders had imbibed the strong gun rights ideology that drives today's gun debate we would all be drinking tea and singing, 'God save our gracious Queen.' \"\n It's Time for Gun Control Proponents to Reclaim the Constitutional High Ground\n \n Chief Justice Story voiced similar sentiments about the importance of regulation as I have pointed out before. He warned that a desire \"to be rid of all regulations\" could undermine the protection against tyranny intended by the Second Amendment:\n \"The right of the citizens to keep and bear arms has justly been considered, as the palladium of the liberties of a republic; since it offers a strong moral check against the usurpation and arbitrary power of rulers; and will generally, even if these are successful in the first instance, enable the people to resist and triumph over them. And yet, though this truth would seem so clear, and the importance of a well regulated militia would seem so undeniable, it cannot be disguised, that among the American people there is a growing indifference to any system of militia discipline, and a strong disposition, from a sense of its burthens, to be rid of all regulations. How it is practicable to keep the people duly armed without some organization, it is difficult to see. There is certainly no small danger, that indifference may lead to disgust, and disgust to contempt; and thus gradually undermine all the protection intended by this clause of our national bill of rights.\"\n http://www.4forums.com/political/gun-control-debates/12948-happy-4th-july-all-3.html#post360950\n\n \n Off topic and sick as Sarah mentioned. Heller was 9-0 that the 2A was an individual right.\n \n Justice Story was concerned that people like yourself would neglect the militia and responsibilities such as training. You are full filling his worst fears. How does it feel to be a slacker? emoticon_xgood He was diametrically opposed to what you want his text to say, you are trying to spin it into something it never was and never will be. Of course you antipodeans already shot your wad. :)", 
   {}, 
   408970, 
   null, 
   1280711040.0
  ], 
  [
   408983, 
   null, 
   "NATO 556", 
   "Galileo, like other anti-gunners, is fond of talking about the militia, about how if we people really cared about the Constitution, we'd push hard to get back our right to take part in militia duties and responsibilities.\n \n However when a militia group makes the news, these same anti-gunners are quick to paint them as dangerous, anti-government, and even racist extremists, and an example of why gun control needs to be further tightened.\n \n Why exactly are they arguing that we should engage in an activity that they refer to as hate mongering and extremism?", 
   {}, 
   408979, 
   null, 
   1280716560.0
  ], 
  [
   409001, 
   null, 
   "Tither", 
   "\"As long as there have been guns in America there have been regulations governing their use and storage. \n\n Storage? Really? Could you please show us the part of that statement that deals with how our Founders mandated regulations on private citizens dealing with the use of their private weapons, and how U.S. citizens were to store their individual weapons?\n \n That will be a hoot!\n \n Galileo, your argument fails because, although what you say is true, it is only half true. Their is more than one purpose for keeping arms. Yes our Founding Fathers did make many safeguards against a tyrannical government, and the Right to Keep and Bear Arms is to be the final check on a tyrannical government when all of the other checks and balances fails, however, neither the Bill of Rights nor the 2nd Amendment, gives us anything. The Bill of Rights merely enumerates or numbers SOME of our preexisting Inalienable Rights.\n \n   9th Amendment \n\n The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people. \n \n Rights Retained by the People Annotations  \n Aside from contending that a bill of rights was unnecessary, the \n \n Federalists responded to those opposing ratification of the Constitution because of the lack of a declaration of fundamental rights by arguing that inasmuch as it would be impossible to list all rights it would be dangerous to list some because there would be those who would seize on the absence of the omitted rights to assert that government was unrestrained as to those.\n\n Which is exactly the SCAM on our Inalienable preexisting Rights that you are trying to pull off now!\n \n Ohio's Constitution recognizes this.   § 1.01 Inalienable Rights (1851) \n All men are, by nature, free and independent, and have certain inalienable rights, among which are those of enjoying and defending life and liberty, acquiring, possessing, and protecting property, and seeking and obtaining happiness and safety. \n\n   § 1.04 Bearing arms; standing armies; military powers (1851) \n The people have the right to bear arms for their defense and security; but standing armies, in time of peace, are dangerous to liberty, and shall not be kept up; and the military shall be in strict subordination to the civil power. \n \n \n   Ohio&#8217;s Individual Right\n (A) The individual right to keep and bear arms, being a fundamental individual right that predates the United States Constitution and Ohio Constitution, and being a constitutionally protected right in every part of Ohio,\n\n Your heretical SCAM is over!", 
   {}, 
   408970, 
   null, 
   1280759340.0
  ], 
  [
   409002, 
   null, 
   "Tither", 
   "Justice Story was concerned that people like yourself would neglect the militia and responsibilities such as training. You are full filling his worst fears. How does it feel to be a slacker? emoticon_xgood He was diametrically opposed to what you want his text to say, you are trying to spin it into something it never was and never will be. Of course you antipodeans already shot your wad. :)\n\n Good point Doc. Galileo tell us of your Militia preparedness training, to include your Militia weapon or weapons you own, and other militia gear. \n \n Ooooooooor are you just another gun grabber utilizing any scam you can think up, like Nato and Doc says you are! \n \n This is the Time to put up, Militia preparedness guru! emoticon_smile", 
   {}, 
   408979, 
   null, 
   1280759940.0
  ], 
  [
   409017, 
   null, 
   "Tither", 
   " Heller was 9-0 that the 2A was an individual right.\n\n So Doc. Galileo is hoping that passersby will not understand that Heller was decided 5-4, and the Individual Right question was 9-0. It looks like you are incorrect to passersby. He is hoping that since it appears that you are wrong on Heller that you will appear wrong about everything. \n \n Could you explain the difference between the final division and a specific question of the 2nd Amendment being an Individual Right, please?", 
   {}, 
   408979, 
   null, 
   1280775780.0
  ], 
  [
   409022, 
   null, 
   "Doc Jones", 
   "So Doc. Galileo is hoping that passersby will not understand that Heller was decided 5-4, and the Individual Right question was 9-0. It looks like you are incorrect to passersby. He is hoping that since it appears that you are wrong on Heller that you will appear wrong about everything. \n \n Could you explain the difference between the final division and a specific question of the 2nd Amendment being an Individual Right, please?\n\n \n \n It has already been explained to him before, multiple times. Anyone can read the Heller decision themselves and see that:\n \n \nSubmitter's Note: Okay, you've read the Constitution, now read Justice John Paul Stevens' dissent (in which he was joined by the rest of the minority Justices). Pay special attention to the first paragraph: \"The question presented by this case is not whether the Second Amendment protects a 'collective right' or an 'individual right.' Surely it protects a right that can be enforced by individuals. But a conclusion that the Second Amendment protects an individual right does not tell us anything about the scope of that right.\"So the Supreme Court of the United States of America disagrees with you, 9-0 that \"there is certainly room for debate\" about the meaning of the amendment.\n\n \n McDonald incorporated that right into the XIVth Amendment against not only federal but STATES AND LOCAL GOVERNMENTS.", 
   {}, 
   409017, 
   null, 
   1280785020.0
  ], 
  [
   409023, 
   null, 
   "Doc Jones", 
   "Unfortunately for star gazer, the scope of that right is \"shall not be infringed\"! emoticon_xgood", 
   {}, 
   409022, 
   null, 
   1280785380.0
  ], 
  [
   409024, 
   null, 
   "Tither", 
   "It has already been explained to him before, multiple times. Anyone can read the Heller decision themselves and see that:\n\n Thanks Doc. That was very informative!!!", 
   {}, 
   409022, 
   null, 
   1280785920.0
  ], 
  [
   409026, 
   null, 
   "Doc Jones", 
   "Thanks Doc. That was very informative!!!\n\n \n H/T to whomever pointed that out very soon after the Heller decision! All I recall it was a lawyer who provided that insight and how to read a court decision.\n .\n .\n Oh, he probably wouldn't like \"the militia standard\" either.\n \n A Patriot should be able to nail a running liberal at a MINIMUM distance of 300 meters :)", 
   {}, 
   409024, 
   null, 
   1280787240.0
  ], 
  [
   409139, 
   null, 
   "Galileo", 
   "Galileo, like other anti-gunners, is fond of talking about the militia, about how if we people really cared about the Constitution, we'd push hard to get back our right to take part in militia duties and responsibilities.\n \n However when a militia group makes the news, these same anti-gunners are quick to paint them as dangerous, anti-government, and even racist extremists, and an example of why gun control needs to be further tightened.\n \n Why exactly are they arguing that we should engage in an activity that they refer to as hate mongering and extremism?\n\n There you go again- trying to manufacture another contradiction. The Founding Fathers would probably be horrified that you would equate such unconstitutional militia groups with the well regulated militia that is spoken of in the Constitution.", 
   {}, 
   408983, 
   null, 
   1280965020.0
  ], 
  [
   409143, 
   null, 
   "NATO 556", 
   "There you go again- trying to manufacture another contradiction. The Founding Fathers would probably be horrified that you would equate such unconstitutional militia groups with the well regulated militia that is spoken of in the Constitution.\n\n \n The \"well regulated militia\" you refer to isn't the National Guard. \"Well regulated\" didn't mean made subject to tens of thousands of laws and rules that would ultimately neuter them and render them moot. \"Well regulated\" back then meant that every Minute Man was a fighting machine, capable of fighting and killing effectively for the cause, capable of shooting down any enemy from as far away as their rifle could reach, and doing this in a repeatable fashion.\n \n Back then \"well regulated\" meant highly trained, highly skilled, and ready to fight against whatever enemy came along. Which is exactly what we want to be now. But anytime somebody tries to become such you break out the hate and fearmongering and compare such groups to the KKK and other white supremacists.\n \n And kindly show how today's militia groups could ever possibly be found as \"unconstitutional\" in nature. Unconstitutional is something over the government can be held standard to, not private citizens.", 
   {}, 
   409139, 
   null, 
   1280967120.0
  ], 
  [
   409145, 
   null, 
   "Galileo", 
   "Off topic and sick as Sarah mentioned. Heller was 9-0 that the 2A was an individual right.\n\n The numbers indicate how many justices sided with the majority opinion v. how many sided with dissenting opinion(s). Only five justices sided with the majority opinion in the Heller and McDonald rulings thus they were 5-4 decisions. You don't get to change the rules.\n \n \nJustice Story was concerned that people like yourself would neglect the militia and responsibilities such as training. You are full filling his worst fears. How does it feel to be a slacker? emoticon_xgood He was diametrically opposed to what you want his text to say, you are trying to spin it into something it never was and never will be. Of course you antipodeans already shot your wad. :)\n\n Unless you've joined the National Guard you're in no position to criticize someone for being a slacker.", 
   {}, 
   408979, 
   null, 
   1280968740.0
  ], 
  [
   409148, 
   null, 
   "Galileo", 
   "The \"well regulated militia\" you refer to isn't the National Guard. \"Well regulated\" didn't mean made subject to tens of thousands of laws and rules that would ultimately neuter them and render them moot. \"Well regulated\" back then meant that every Minute Man was a fighting machine, capable of fighting and killing effectively for the cause, capable of shooting down any enemy from as far away as their rifle could reach, and doing this in a repeatable fashion.\n \n Back then \"well regulated\" meant highly trained, highly skilled, and ready to fight against whatever enemy came along. Which is exactly what we want to be now. But anytime somebody tries to become such you break out the hate and fearmongering and compare such groups to the KKK and other white supremacists.\n \n\n What evidence do you have to support that claim? If you want to know what is meant by \"well regulated\" all you have to do is read Article 1 of the Constitution. Alexander Hamilton quotes directly from this part of the Constitution when talking about the regulation of the militia:\n \n \"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n \n \n\n And kindly show how today's militia groups could ever possibly be found as \"unconstitutional\" in nature. Unconstitutional is something over the government can be held standard to, not private citizens.\n\n Their idea of what a militia is does not pass constitutional muster. Again, read Article 1.", 
   {}, 
   409143, 
   null, 
   1280969520.0
  ], 
  [
   409149, 
   null, 
   "Galileo", 
   "And even if the claims of the gun activists in this thread are correct, what about the rights of others (those who do not own guns)?\n \n Sadly, some are so fixated on what they perceive as their own rights and their guns that they fail to take the rights of others seriously. It's important to recognize that non gun owners and children have rights as well as gun owners. These rights can be violated or endangered by gun owners. Thus it is desirable to adopt public policies that best protect the rights and freedoms of everyone and not just gun owners. A look at the percentage of child homicides committed with guns reveals the fallacy of the arguments of those who claim that the danger that guns present to children is insignificant. In 2002, 57.6% of child homicides were committed with guns. \n voiceofreason2005.blogspot.com/", 
   {}, 
   409148, 
   null, 
   1280970120.0
  ], 
  [
   409150, 
   null, 
   "NATO 556", 
   "The numbers indicate how many justices sided with the majority opinion v. how many sided with dissenting opinion(s). Only five justices sided with the majority opinion in the Heller and McDonald rulings thus they were 5-4 decisions. You don't get to change the rules.\n\n \n Neither do you. A five judge majority ruling means the matter is settled, and we won.\n \n \nUnless you've joined the National Guard you're in no position to criticize someone for being a slacker.\n\n \n The National Guard is moot in this discussion.", 
   {}, 
   409145, 
   null, 
   1280971140.0
  ], 
  [
   409152, 
   null, 
   "NATO 556", 
   "What evidence do you have to support that claim? If you want to know what is meant by \"well regulated\" all you have to do is read Article 1 of the Constitution. Alexander Hamilton quotes directly from this part of the Constitution when talking about the regulation of the militia:\n \n \"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n\n \n And exactly where in that, do you find grounds for stating that \"well regulated\" translates into \"made subject by whatever measure of law we find to be reasonable in order to regulate the purchase, carrying, storage, transfer and ownership of weapons\"?\n \n \nTheir idea of what a militia is does not pass constitutional muster. Again, read Article 1.\n\n \n That fails to explain how today's militia groups could be considered \"unconstitutional\". Unconstitutional is a standard that can be applied only to government, not regular citizens. And explain how today's militia groups aren't the same as those of colonial periods and thus not protected.\n \n Try again. And this time put an actual explanation in there.", 
   {}, 
   409148, 
   null, 
   1280971380.0
  ], 
  [
   409156, 
   null, 
   "Doc Jones", 
   "The numbers indicate how many justices sided with the majority opinion v. how many sided with dissenting opinion(s). Only five justices sided with the majority opinion in the Heller and McDonald rulings thus they were 5-4 decisions. You don't get to change the rules.\n\n \n CONUNDRUM AGAIN! http://www.4forums.com/political/409022-post73.html\n 9 to zip on an individual right.\n \n \n \nUnless you've joined the National Guard you're in no position to criticize someone for being a slacker.\n\n \n I am well in the position to criticize :) from long, long time ago. Now take that thumb out of your mouth....", 
   {}, 
   409145, 
   null, 
   1280972340.0
  ], 
  [
   409157, 
   null, 
   "NATO 556", 
   "And even if the claims of the gun activists in this thread are correct,\n\n \n \"Even if\"? That's usually the favorite term of somebody proposing a hypothetical situation, one that they usually don't believe in. Are you saying that we're outright lying about everything here?\n \n \nwhat about the rights of others (those who do not own guns)?\n\n \n What rights do you refer to? Anything specific you care to mention?\n \n \nSadly, some are so fixated on what they perceive as their own rights and their guns\n\n \n Excuse me? Gun ownership is a constitutional right, no exceptions. This is a matter of settled law, something you can't change. There's no \"perceived rights\" here, except for some of the things people like you support.\n \n \nthat they fail to take the rights of others seriously. It's important to recognize that non gun owners and children have rights as well as gun owners.\n\n \n We're aware of this fact. However you fail to recognize that gun owners have rights just like everyone else. And all your proposed laws violate our rights, especially the rights regarding private property.\n \n \nThese rights can be violated or endangered by gun owners.\n\n \n Kindly explain how we're violating the rights of anybody. We're not out committing rapes, murders, muggings, arson, drive by shootings, or any of that sort.\n \n \nThus it is desirable to adopt public policies that best protect the rights and freedoms of everyone and not just gun owners.\n\n \n And when exactly do we get that consideration? When do you stop treating us like we're different and inferior to everyone else? Where's the equality in this discussion?\n \n \nA look at the percentage of child homicides committed with guns reveals the fallacy of the arguments of those who claim that the danger that guns present to children is insignificant. In 2002, 57.6% of child homicides were committed with guns.\n\n \n And exactly what evidence is there that the law-abiding gun owners are responsible for child homicides? Any evidence at all?\n \n I've looked over the document you provided a link to, but I can't find anything regarding \"child homicides\" or \"57.6%\" anywhere. The only time children are mentioned is when they talk about infant mortality, as in babies.\n \n Try again.", 
   {}, 
   409149, 
   null, 
   1280973000.0
  ], 
  [
   409158, 
   null, 
   "Tither", 
   "Unless you've joined the National Guard you're in no position to criticize someone for being a slacker.\n\n I guess you do not practice what you pretend to preach then! emoticon_smile\n \n Even back in 1982 they didn't believe the hype you are trying to perpetrate! \n   THE RIGHT TO KEEP AND BEAR ARMS -- R E P O R T OF THE SUBCOMMITTEE ON THE CONSTITUTION OF THE COMMITTEE ON THE JUDICIARY \n That the National Guard is not the \"Militia\" referred to in the second amendment is even clearer today. Congress has organized the National Guard under its power to \"raise and support armies\" and not its power to \"Provide for organizing, arming and disciplining the Militia\".[65] This Congress chose to do in the interests of organizing reserve military units which were not limited in deployment by the strictures of our power over the constitutional militia, which can be called forth only \"to execute the laws of the Union, suppress insurrections and repel invasions.\" The modern National Guard was specifically intended to avoid status as the constitutional militia, a distinction recognized by 10 U.S.C. Sec 311(a).(p.12)\n \n The conclusion is thus inescapable that the history, concept, and wording of the second amendment to the Constitution of the United States, as well as its interpretation by every major commentator and court in the first half-century after its ratification, indicates that what is protected is an individual right of a private citizen to own and carry firearms in a peaceful manner.\n", 
   {}, 
   409145, 
   null, 
   1280973600.0
  ], 
  [
   409164, 
   null, 
   "zsu2357", 
   "WOW has this thread spun out of control or what?I will admit I'v made a few comments here and there,but it know longer(hasn't really)had much to do with the original article at all.\n Superlite27 brought it up at post #61 or something similar to it,and StarGuy is the only one on the topic of the original article.\n \n Not...just wanted to make you feel good StarGuy lol.", 
   {}, 
   409158, 
   null, 
   1280976120.0
  ], 
  [
   409254, 
   null, 
   "Tither", 
   "Maybe this is a good way to get this thread back on track!\n \n The Brady Campaign comes out for Concealed Carry! Antis, did you know about this stance from the Brady's?\n \n   Experts on both sides of gun control believe 54-year-old Flint man had right to defend himself \n Golden opened fire when they tried to rob him, killing one and wounding two other teens, police said. The two wounded teens were listed in good condition Thursday afternoon.\n \n The other three suspected robbers ran off before police arrived.\n \n A spokesman for a Washington, D.C.-based gun control advocacy group agreed that Golden had a right to protect himself.\n \n &#8220;We&#8217;ve never taken issue with law abiding citizens who have a weapon legally,&#8221; said Peter Hamm, communications director of the Brady Campaign to Prevent Gun Violence. &#8220;They have the right to defend themselves when in danger.&#8221;\n\n Galileo? They must also believe in an Individual Right.", 
   {}, 
   409164, 
   null, 
   1281102540.0
  ], 
  [
   409268, 
   null, 
   "Doc Jones", 
   "The numbers indicate how many justices sided with the majority opinion v. how many sided with dissenting opinion(s). Only five justices sided with the majority opinion in the Heller and McDonald rulings thus they were 5-4 decisions. You don't get to change the rules.\n\n \n Here is another dose to show how you twist your conundrums. There are over 500 references that mention the 9 to ZIP agreement that the 2A is an individual right!\n \n \n In a First, High Court Affirms Gun Rights - WSJ.com\n \n 9 TO ZIP ON THE INDIVIDUAL RIGHT IN HELLER\n \n \n\n Yet the lead dissent, by Justice John Paul Stevens, did not dispute that the Second Amendment protects an individual right. Rather, he wrote, the question was the \"scope of that right,\" which protected militia service but left additional regulation to the judgment of the legislature. The Second Amendment's drafting history revealed the founders' \"concern about the potential threat to state sovereignty that a federal standing army would pose,\" something that could be checked by state militias, he wrote, joined by Justices David Souter, Ruth Bader Ginsburg and Stephen Breyer.\n \n -Gary Fields and Louise Radnofsky contributed to this article.\n\n \n USATODAY.com", 
   {
    "unicode_changes_made": true
   }, 
   409145, 
   null, 
   1281115800.0
  ], 
  [
   409281, 
   null, 
   "sinjin", 
   "Maybe this is a good way to get this thread back on track!\n \n The Brady Campaign comes out for Concealed Carry! Antis, did you know about this stance from the Brady's?\n \n   Experts on both sides of gun control believe 54-year-old Flint man had right to defend himself \n Galileo? They must also believe in an Individual Right.\nCould you explain how this is a \"concealed carry\" story. He was in his yard, was he not?\n \n And how does the statement by the Brady representative amount to \"coming out\" in support of concealed carry?\n \n &#8220;We&#8217;ve never taken issue with law abiding citizens who have a weapon legally,&#8221; said Peter Hamm, communications director of the Brady Campaign to Prevent Gun Violence. &#8220;They have the right to defend themselves when in danger.&#8221;", 
   {}, 
   409254, 
   null, 
   1281121260.0
  ], 
  [
   409283, 
   null, 
   "Tither", 
   "Could you explain how this is a \"concealed carry\" story. He was in his yard, was he not?\n \n And how does the statement by the Brady representative amount to coming out in support of concealed carry?\n \n \"We've never taken issue with law abiding citizens who have a weapon legally,\" said Peter Hamm, communications director of the Brady Campaign to Prevent Gun Violence. \"They have the right to defend themselves when in danger.\"\n\n Would you try robbing a man holding a gun, or Open Carrying a gun? If the teens tried to rob someone doing one of those two things, they would have likely ruled the death and woundings suicide and attempted suicide. emoticon_smile\n \n If he did not have a CCW license, and he was carrying a gun concealed, he would be in violation of the law. A VERY serious Criminal offense with tons of jail time. If he was just holding a gun in his front yard, that would be brandishing. That is against the law. If he was harassed and stepped outside with the firearm, then shooting, their could be no Self Defense plea, incurring some very serious jail time. Would the Brady Campaign agreed with any of that?", 
   {
    "unicode_changes_made": true
   }, 
   409281, 
   null, 
   1281121980.0
  ], 
  [
   409284, 
   null, 
   "NATO 556", 
   "\"We've never taken issue with law abiding citizens who have a weapon legally,\" said Peter Hamm, communications director of the Brady Campaign to Prevent Gun Violence. \"They have the right to defend themselves when in danger.\"\n\n \n This statement is contradicted by their continual opposition to shall-issue concealed carry, and the fact that we can legally buy stuff like AR-15s and Mini-14s, with magazines that hold as many rounds of ammunition as physically possible.", 
   {
    "unicode_changes_made": true
   }, 
   409281, 
   null, 
   1281123000.0
  ], 
  [
   409286, 
   null, 
   "sinjin", 
   "Would you try robbing a man holding a gun, or Open Carrying a gun? If the teens tried to rob someone doing one of those two things, they would have likely ruled the death and woundings suicide and attempted suicide. emoticon_smile\n \n If he did not have a CCW license, and he was carrying a gun concealed, he would be in violation of the law. A VERY serious Criminal offense with tons of jail time. If he was just holding a gun in his front yard, that would be brandishing. That is against the law. If he was harassed and stepped outside with the firearm, then shooting, their could be no Self Defense plea, incurring some very serious jail time. Would the Brady Campaign agreed with any of that?\nOne is not in public when on one's own property. \n Can you not \"carry\" any way you like on your own property?", 
   {}, 
   409283, 
   null, 
   1281124440.0
  ], 
  [
   409287, 
   null, 
   "sinjin", 
   "This statement is contradicted by their continual opposition to shall-issue concealed carry, and the fact that we can legally buy stuff like AR-15s and Mini-14s, with magazines that hold as many rounds of ammunition as physically possible.\nI don't believe Mr. Hamm was refering to the issue of CCW at all, just the right to defend oneself while at home.", 
   {}, 
   409284, 
   null, 
   1281124560.0
  ], 
  [
   409298, 
   null, 
   "Doc Jones", 
   "One is not in public when on one's own property. \n Can you not \"carry\" any way you like on your own property?\n\n \n According to mayor Dealie you can't.\n \n Why don't you gun grabbers inform him of his errors?\n \n Chicago is a broke, failed city from mismanagement and corruption as well as outright theft by public servants. They are wasting a lot of money trying to defend suits that clearly will not stand any type of review from recent rulings.\n \n If it is true that the gun grabbers don't support his proposed laws then he is SOL. What are you doing to fight his unConstitutional demands of private property owners?\n \n Kalifornia is not far behind in this respect.", 
   {}, 
   409286, 
   null, 
   1281129120.0
  ], 
  [
   409300, 
   null, 
   "Doc Jones", 
   "I don't believe Mr. Hamm was refering to the issue of CCW at all, just the right to defend oneself while at home.\n\n \n \"while at home\" huh. When did your right to self-defense end at your property line?\n \n That is quite a stretch from an old bubble gum chewer even like yourself sliiiick.\n \n Thank G-d I live in Texas!!! Those facists states are already failed states so it is semantics anyway when the slaves get restless. criminals are a tyrants wanna be best friend.\n \n Everyone should know by now that the cops have no duty to defend anyone no matter the excuses...you are on your own. Everyday I read about the predator leos preying on the electorate so which is worse?", 
   {}, 
   409287, 
   null, 
   1281129600.0
  ], 
  [
   409301, 
   null, 
   "Doc Jones", 
   "How much more of this kind of stuff that is applauded by gun grabbers going to continue and be tolerated by what they, themselves have promoted?\n \n JANE ANN MORRISON: After inquests into police shootings, Gillespie vows to face facts - News - ReviewJournal.com\n \n News Headlines\n \n After cops kill his son, a local man fights Vegas PD | Local News | Colorado Springs Independent\n \n Ignorance of the Law Is No Excuse - Reason Magazine\n \n What does your heroine, Peter Hamm say about these atrocities? What weasel words can you attribute to him after years of disinformation and preaching hate against concerned citizens following the law?", 
   {}, 
   409300, 
   null, 
   1281130740.0
  ], 
  [
   409302, 
   null, 
   "Doc Jones", 
   "Don't run son, stay until you are \"burger\". That is your claim to fame, right?", 
   {}, 
   409301, 
   null, 
   1281130920.0
  ], 
  [
   409314, 
   null, 
   "NATO 556", 
   "One is not in public when on one's own property. \n Can you not \"carry\" any way you like on your own property?\n\n \n Mayor Daley of Chicago claims otherwise. Under Chicago's new laws you're not allowed to be in possession of a firearm in your front yard, back yard, porch, car, or garage, despite all of them being your private property.", 
   {}, 
   409286, 
   null, 
   1281135000.0
  ], 
  [
   409317, 
   null, 
   "sinjin", 
   "Mayor Daley of Chicago claims otherwise. Under Chicago's new laws you're not allowed to be in possession of a firearm in your front yard, back yard, porch, car, or garage, despite all of them being your private property.\nI don't know about new laws in Chicago but the incident happened in Flint, Michigan.", 
   {}, 
   409314, 
   null, 
   1281136500.0
  ], 
  [
   409323, 
   null, 
   "sinjin", 
   "Okay, so I read the new Chicago ordinance and it says in your home only.\n \n We'll see how that fares in court.", 
   {}, 
   409317, 
   null, 
   1281137700.0
  ], 
  [
   409335, 
   null, 
   "Tither", 
   "One is not in public when on one's own property. \n Can you not \"carry\" any way you like on your own property?\n\n Not in Ohio, but it might be legal in the city of Flint Michigan, I honestly don't know.\n \n However, and either way, this IS a Concealed Carry event and story then. No? emoticon_smile", 
   {}, 
   409286, 
   null, 
   1281139980.0
  ], 
  [
   409358, 
   null, 
   "zsu2357", 
   "Could you explain how this is a \"concealed carry\" story. He was in his yard, was he not?\n\n Well it didn't say he was jumping up and down brandishing a firearm.\n \nAnd how does the statement by the Brady representative amount to \"coming out\" in support of concealed carry?\n\n Perhaps the article didn't come right out and say support,but there did seem to be a lot of people living in the area that thought he did the right thing.Wonder\n if any were anti-gunners that maybe got a wake up call?\n You know like...hey this can happen in our neighborhood.", 
   {}, 
   409281, 
   null, 
   1281167280.0
  ], 
  [
   409359, 
   null, 
   "zsu2357", 
   "Would you try robbing a man holding a gun, or Open Carrying a gun? If the teens tried to rob someone doing one of those two things, they would have likely ruled the death and woundings suicide and attempted suicide. emoticon_smile\n \n If he did not have a CCW license, and he was carrying a gun concealed, he would be in violation of the law. A VERY serious Criminal offense with tons of jail time. If he was just holding a gun in his front yard, that would be brandishing. That is against the law. If he was harassed and stepped outside with the firearm, then shooting, their could be no Self Defense plea, incurring some very serious jail time. Would the Brady Campaign agreed with any of that?\n\n \n Tither I was answering sinjins post and hadn't got to yours yet ie brandishingkinda cool the way that worked out.", 
   {}, 
   409283, 
   null, 
   1281167640.0
  ], 
  [
   409386, 
   null, 
   "Tither", 
   "The actual quote \n\"We've never taken issue with law abiding citizens who have a weapon legally,\" said Peter Hamm, communications director of the Brady Campaign to Prevent Gun Violence. \"They have the right to defend themselves when in danger.\"\n\n Speaking generally of this quote to the whole board, where Sinjin interpenetrated the actual meaning of the quote above. \n \nI don't believe Mr. Hamm was refering to the issue of CCW at all, just the right to defend oneself while at home.\n\n \n This does prove one thing. A normal person cannot actually listed or read words from Anti-gun orgs, and their spokespeople, and assume that the words actually meant what was said or read. \n \n It takes an actual anti to correctly interpret their real meaning! emoticon_smile", 
   {
    "unicode_changes_made": true
   }, 
   409287, 
   null, 
   1281210840.0
  ], 
  [
   409432, 
   null, 
   "Galileo", 
   "Here is another dose to show how you twist your conundrums. There are over 500 references that mention the 9 to ZIP agreement that the 2A is an individual right!\n \n \n In a First, High Court Affirms Gun Rights - WSJ.com\n \n 9 TO ZIP ON THE INDIVIDUAL RIGHT IN HELLER\n \n \n \n USATODAY.com\n\n So you're claiming that supporting an individual right is consistent with supporting a gun ban? Watch Jonesie twist himself into a pretzel on this one.", 
   {}, 
   409268, 
   null, 
   1281236460.0
  ], 
  [
   409465, 
   null, 
   "Doc Jones", 
   "So you're claiming that supporting an individual right is consistent with supporting a gun ban? Watch Jonesie twist himself into a pretzel on this one.\n\n \n \n YAWNNNNN! emoticon_xgood :xcensored emoticon_xclown", 
   {}, 
   409432, 
   null, 
   1281280860.0
  ], 
  [
   409471, 
   null, 
   "Doc Jones", 
   "So you're claiming that supporting an individual right is consistent with supporting a gun ban? Watch Jonesie twist himself into a pretzel on this one.\n\n \n Has anyone made you aware of your cognative dissonance disorder?\n \n Seek help before it become fatal. Very similar characteristics are manifest as in Parkinsons' disease...smaller steps, repetition, off topic questions during conversations with others AND being an antipodean trying to manage affairs of another nation similar to the Oedipus Complex generated by exclusive attention of your mother...raulito for example. emoticon_smile emoticon_xclown", 
   {}, 
   409432, 
   null, 
   1281286200.0
  ], 
  [
   409641, 
   null, 
   "Galileo", 
   "What kind of people irritate me the most in the gun control debate? Intellectually shallow people who always and mistakenly think they are indisputably right.", 
   {}, 
   409471, 
   null, 
   1281405060.0
  ], 
  [
   409651, 
   null, 
   "NATO 556", 
   "What kind of people irritate me the most in the gun control debate? Intellectually shallow people who always and mistakenly think they are indisputably right.\n\n \n So you're basically saying that you irritate yourself. You always assume that you're right, that all your precious authors and professors are right despite the fact that they've been discredited on multiple occasions. Not a single one of your arguments has been proven as valid or true, and yet you keep making them.", 
   {}, 
   409641, 
   null, 
   1281407820.0
  ], 
  [
   409687, 
   null, 
   "Bryan", 
   "And even if the claims of the gun activists in this thread are correct, what about the rights of others (those who do not own guns)?\n \n Sadly, some are so fixated on what they perceive as their own rights and their guns that they fail to take the rights of others seriously. It's important to recognize that non gun owners and children have rights as well as gun owners. These rights can be violated or endangered by gun owners. Thus it is desirable to adopt public policies that best protect the rights and freedoms of everyone and not just gun owners. A look at the percentage of child homicides committed with guns reveals the fallacy of the arguments of those who claim that the danger that guns present to children is insignificant. In 2002, 57.6% of child homicides were committed with guns. \n voiceofreason2005.blogspot.com/\n\n \n Let me answer \"Voice of Reason.\" Does he blog here? I'd like to talk with him about this narrow view he has. The world is not as black and white and either/or as he wishes it to be. I support gun rights. But I reject his claim that because I do so then I must not take the rights of children and other innocent victims of gun violence seriously. I take gun violence very seriously, and I would venture to say that I have dealt with more victims of gun violence that Voice of Reason has.\n \n I also take drunk driving seriously. Now when a man kills or maims by driving recklessly or while intoxicated we don't blame the truck he drove or the Johnny Walker he drank. We don't lament America's love affair with SUVs or infatuation with bourbon. We don't seek to ban cars or bring back prohibition. We blame the criminal, and we prosecute him for his crime. No one demands, for example, that I surrender the beer in my fridge because another person just killed someone while driving drunk-under the theory that his crime means I cannot be trusted to have beer anymore. \n \n In America we protect the rights of innocents by recognizing their rights, making it a crime to violate them, and by punishing those who do so. We do not shift the blame onto the sword for the actions of the hand that wields it, nor do we seek to blame and punish the innocent for the crimes of the guilty. We do not hold a man accountable for crimes committed by others he did not know and had no influence over. We hold those who are a fault accountable-the person who chose to commit a wrongful act through an unjustifiable motive, be it anger, hatred, revenge, greed, etc. We hold accountable the person who knew right from wrong, who understood the nature and consequences of his actions, and who made a conscious choice to violate the law-in the case of murder the person who deliberately chose to take someone's life without a shred of legitimate excuse or justification. And we do not waiver or modify this view of individual responsibility merely because he chose to use a gun instead of a car or a bat to commit his crime.\n \n I know that we all would like to pretend we have the power to change the world, but for gun crimes you are dealing with the hardened hearts of men who are willing to take another's life. Ask yourself is it reasonable, merely because you feel powerless to stop murderers before they strike, to project blame for your inability to stop them on others whose only \"crime\" is to insist upon their right to lawfully and peacefully posses a firearm?\n \n As long as I live peacefully with my neighbors then my insistence that they respect all of my rights, including my RKBA, does not make me an enemy of the rights of non-gun owners. After all, do I not also have the same right to be free of gun violence? \n \n Setting aside felons for a moment, the crime does not lie in having a gun. The crime comes from using the gun (or any other weapon) to violate the rights of others. \n \n Voice of Reason, I say cast your blame at the feet of those who have earned it. Instead of blaming me, why not work with me to hold accountable those who chose to violate the rights all of us share? If you are serious about protecting the rights of the innocent, then first offer to help catch, convict, and imprison those who actually violate those rights.", 
   {
    "post_info": {
     "post_title": "Where to lay the blame"
    }, 
    "unicode_changes_made": true
   }, 
   409149, 
   null, 
   1281478740.0
  ], 
  [
   409708, 
   null, 
   "sinjin", 
   "Bryan,\n \n Do you support the prosecution of bartenders for serving someone already intoxicated that then drives drunk and kills someone?\n \n How about a store owner that sells alcohol to a minor that then drives drunk and kills someone?", 
   {}, 
   409687, 
   null, 
   1281484140.0
  ], 
  [
   409712, 
   null, 
   "Galileo", 
   "FYI, the ACLU is now taking second amendment issues and cases :) ;)\n\n \"Mainstream America is depending on you - counting on you - to draw your sword and fight for them. These people have precious little time or resources to battle misguided Cinderella attitudes, the fringe propaganda of the homosexual coalition, the feminists who preach that it's a divine duty for women to hate men, blacks who raise a militant fist with one hand, while they seek preference with the other., and all the New-Age apologists for juvenile crime, who see roving gangs as a means of youthful expression, sex as a means of adolescent merchandising, violence as a form of entertainment for impressionable minds, and gun bans as a means to lord-knows-what. We've reached that point in time when our national social policy originates on Oprah. I say it's time to pull the plug.\"\n -Charlton Heston\n The NRA and Charlton Heston\n \n \"in Hollywood there are more gun owners in the closet than homosexuals,\"\n -Charlton Heston\n Have Gun, Will Travel - TIME\n \n \"On issue after issue, liberals want to maximize autonomy by removing limits, barriers, and restrictions. The religious right, on the other hand, wants to structure personal, social, and political relationships in three dimensions and so create a landscape of purity and pollution where restrictions maintain the separation of the sacred and the profane.\"\n -Jonathan Haidt, associate professor of psychology at the University of Virginia\n The happiness hypothesis: finding ... - Google Books\n \n Ironic isn't it? Charlton Heston speaks of a cultural war and condemns his liberal enemies in that war while at the same time seeking to apply liberal values to gun ownership. However, for those that embrace an idea of expansive personal freedom with regards to gun ownership, the \"well regulated militia\" part of the Second Amendment is an inconvenient reminder of a time period when the government exercised extensive military authority over gun ownership. The real, historical Second Amendment died long ago and is unlikely to ever be resurrected, but you won't finding modern day pro-gun activists mourning its passing. They are too busy with their own agenda.", 
   {}, 
   408641, 
   null, 
   1281484680.0
  ], 
  [
   409761, 
   null, 
   "NATO 556", 
   "However, for those that embrace an idea of expansive personal freedom with regards to gun ownership, the \"well regulated militia\" part of the Second Amendment is an inconvenient reminder of a time period when the government exercised extensive military authority over gun ownership. The real, historical Second Amendment died long ago and is unlikely to ever be resurrected, but you won't finding modern day pro-gun activists mourning its passing. They are too busy with their own agenda.\n\n \n Bite on this.\n \n Powered by Google Docs\n \n Meaning of the phrase \"well-regulated\"\n \n Such examples pretty much blow your entire argument out of the water.\n \n \"Well regulated\" didn't mean anything even remotely similar to what you suggest it did back in colonial days. Back then \"well regulated\" meant highly trained and disciplined, capable of fighting in an effective manner against any threat, either foreign or domestic.\n \n Back then \"well regulated\" didn't translate into tens of thousands of rules dictating what you could carry, where you could carry, when you could carry, how much you could carry, etc. None of that. Your argument is dead, abandon it already.\n \n You claim that \"well regulated\" meant that the government exercised extensive authority over gun ownership. List absolutely every gun law that was on the books between the ratification of the Constitution, and 1900. Absolutely every last, single law that dictated minimum allowed barrel length, maximum allowed caliber, maximum number of purchases, who could buy, who could own, who could sell, requirements to buy, limitations on carry, maximum firing rate, etc.\n \n Show us the \"extensive authority\" that the government exercised over gun ownership. Show us or drop your argument and admit you were wrong.", 
   {}, 
   409712, 
   null, 
   1281493500.0
  ], 
  [
   409767, 
   null, 
   "Bryan", 
   "Bryan,\n \n Do you support the prosecution of bartenders for serving someone already intoxicated that then drives drunk and kills someone?\n \n How about a store owner that sells alcohol to a minor that then drives drunk and kills someone?\n\n \n It depends on the offense you want to prosecute them for.\n \n I say no to the drunk driving offense. The patron/driver is responsible for his own actions. If, however, a separate crime exists for serving someone who intoxicated to apparent observation then yes, prosecute the bartender for this crime. I also would not blame the other patron at the restaurant across the street for having a beer with his meal, and I would certainly not make the claim that his actions somehow show he is insensitive to the problem of drunk driving.\n \n My answer is the same with the store owner selling to a minor. You prosecute him for the crime of providing alcohol to a minor, but the drunk driving offense is the responsibility of the reckless driver.\n \n If a gun owner knowingly sells to a prohibited felon who commits a murder with the gun, then the felon alone is responsible for the murder. The gun owner's crime is giving the felon the firearm, and I have no problem with prosecuting that offense (and I have done so). \n \n Now if we have more information which suggests that the people in these examples knew that the underlying crime was going to be committed by the other person, that they approved of the crime, and that they chose to aid and abet that crime by providing the alcohol or firearm, then you would have accomplice liability.\n \n Say, for example, A has a handgun. B, a felon, comes to A and says he wants to borrow the gun. A knows B is a felon. If he gives B the gun and B, unknown to A, goes off and kills someone with the gun then B alone is responsible for the murder, and A is only responsible for providing a gun to a felon. But say B tells A the reason he wants the gun is he wants to get rid of his wife, and B asks to borrow the handgun for that purpose. If A gives him the gun on that request then A is now an accessory before the fact to the murder committed by B with the gun.", 
   {
    "unicode_changes_made": true
   }, 
   409708, 
   null, 
   1281501780.0
  ], 
  [
   409820, 
   null, 
   "Galileo", 
   "Bite on this.\n \n Powered by Google Docs\n \n Meaning of the phrase \"well-regulated\"\n \n Such examples pretty much blow your entire argument out of the water.\n \n \"Well regulated\" didn't mean anything even remotely similar to what you suggest it did back in colonial days. Back then \"well regulated\" meant highly trained and disciplined, capable of fighting in an effective manner against any threat, either foreign or domestic.\n \n Back then \"well regulated\" didn't translate into tens of thousands of rules dictating what you could carry, where you could carry, when you could carry, how much you could carry, etc. None of that. Your argument is dead, abandon it already.\n\n Your sources make the claim that well regulated does not mean well regulated by law based on what appear to be cherry picked quotations far removed from the debate surrounding the militia and the Second Amendment. \n I disagree and I've already addressed this:\n \n If you want to know what is meant by \"well regulated\" all you have to do is read Article 1 of the Constitution. Alexander Hamilton quotes directly from this part of the Constitution when talking about the regulation of the militia:\n \n \"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-6.html#post409148\n \n \n\n You claim that \"well regulated\" meant that the government exercised extensive authority over gun ownership. List absolutely every gun law that was on the books between the ratification of the Constitution, and 1900. Absolutely every last, single law that dictated minimum allowed barrel length, maximum allowed caliber, maximum number of purchases, who could buy, who could own, who could sell, requirements to buy, limitations on carry, maximum firing rate, etc.\n \n Show us the \"extensive authority\" that the government exercised over gun ownership. Show us or drop your argument and admit you were wrong.\n\n Don't you think it's kind of unreasonable to expect someone to include every single gun law that was enacted during a period of over 100 years in a single post? I've already posted examples of early gun laws and if you want to find more examples you'll have to do your own research. Why don't read what the Militia Act of 1792 says about the type of firearms that militia members were expected to own if you have questions about that?", 
   {}, 
   409761, 
   null, 
   1281568800.0
  ], 
  [
   409823, 
   null, 
   "Galileo", 
   "\"Thanks to the ubiquity of text on the Internet, not to mention the popularity of text-messaging on cell phones, we may well be reading more today than we did in the 1970s or 1980s, when television was our medium of choice. But it's a different kind of reading, and behind it lies a different kind of thinking... \n Wolf worries that the style of reading promoted by the Net, a style that puts 'efficiency' and 'immediacy' above all else, may be weakening our capacity for the kind of deep reading that emerged when an earlier technology, the printing press, made long and complex works of prose commonplace. When we read online, she says, we tend to become 'mere decoders of information.' Our ability to interpret text, to make the rich mental connections that form when we read deeply and without distraction, remains largely disengaged.\"\n Is Google Making Us Stupid? - Magazine - The Atlantic\n \n Before the internet was in common use, people would have read a book or perhaps an article in an academic journal in order to understand a subject. Now it's just spend a few minutes doing a google search and when you've found a website with the convenient quotations and statistics then copy and paste them here. The internet promotes the kind of shallow thinking that we are seeing examples of in this thread. First it was the Paine misquote and then the cherry picked \"well regulated\" quotes.", 
   {
    "unicode_changes_made": true
   }, 
   409820, 
   null, 
   1281570000.0
  ], 
  [
   409824, 
   null, 
   "NATO 556", 
   "Your sources make the claim that well regulated does not mean well regulated by law based on what appear to be cherry picked quotations far removed from the debate surrounding the militia and the Second Amendment. \n I disagree and I've already addressed this:\n \n If you want to know what is meant by \"well regulated\" all you have to do is read Article 1 of the Constitution. Alexander Hamilton quotes directly from this part of the Constitution when talking about the regulation of the militia:\n\n \n How exactly is the Second Amendment supposed to be a safeguard against a tyrannical federal government, when the Constitution (at least as far as your argument goes) supposedly gives the government absolute authority to prevent such from happening?\n \n How exactly do you propose reconcile of these two highly contradictory positions?\n \n \n\"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n\n \n And how exactly does \"training the militia...\" translate to \"bogging down with excessive authoritative laws that ultimately render them inert and impotent\"? I'd like to see you put a spin on that one, try and explain that one away. Go ahead and give it a try.\n \n \nDon't you think it's kind of unreasonable to expect someone to include every single gun law that was enacted during a period of over 100 years in a single post?\n\n \n You made the claim that back in colonial days the government exercised extensive authority over firearms. Meaning they had extensive laws governing every possible aspect of guns. Since you made the claim, start posting the evidence.\n \n \nI've already posted examples of early gun laws and if you want to find more examples you'll have to do your own research.\n\n \n You've posted the bit about requiring the swearing of a loyalty oath, and the ordinance about storing gun powder in event of a fire. Neither of which counts, and neither of which will be considered in this debate. You'll have to try harder than that, much harder.\n \n \nWhy don't read what the Militia Act of 1792 says about the type of firearms that militia members were expected to own if you have questions about that?\n\n \n The MA92 is a completely separate document from the Second Amendment and isn't related in any manner. It's not a gun control law. It imposes absolutely no restrictions on size, caliber, capacity, firing rate, carrying, purchasing, ownership, registration, permits, storage, or any of that sort. It's inadmissible as evidence.\n \n There were absolutely no laws against minors, the mentally ill, or convicts being able to carry weapons of any sort. Cannons were commonly available to anybody who could afford them. Serial numbers didn't exist. Nobody ever needed a permit to buy, own or carry a weapon. There was nothing even remotely resembling the ATF. A person could make guns and grenades in their own home, and sell them to anybody they chose, and the government had absolutely no say in the matter.\n \n So you're going to have to try infinitely harder to prove that the government possessed and exercise \"extensive authority\" over firearms back in the day.", 
   {}, 
   409820, 
   null, 
   1281571200.0
  ], 
  [
   409825, 
   null, 
   "NATO 556", 
   "Before the internet was in common use, people would have read a book or perhaps an article in an academic journal in order to understand a subject. Now it's just spend a few minutes doing a google search and when you've found a website with the convenient quotations and statistics then copy and paste them here. The internet promotes the kind of shallow thinking that we are seeing examples of in this thread. First it was the Paine misquote and then the cherry picked \"well regulated\" quotes.\n\n \n The supposed \"misquote\" has already been covered, and I do believe you lost that argument entirely.\n \n As for \"well regulated\", you still haven't fulfilled your obligation to prove beyond all reasonable doubt that back in the day \"well regulated\" translated directly to \"governed by extensive rule of law covering any and all foreseeable aspects related to firearms, their use, and their ownership.\"\n \n Besides, you're the pot calling the kettle black. You easily copy and paste the dead brained diatribe of discredited people who have lost all competent standing in all related circles. Cornell, Bogus, Bellesiles, etc. they all put their reputations on the line by supporting the anti-rights position and they lost everything. Give up on them NOW!", 
   {}, 
   409823, 
   null, 
   1281571500.0
  ], 
  [
   409826, 
   null, 
   "Tither", 
   "Don't you think it's kind of unreasonable to expect someone to include every single gun law that was enacted during a period of over 100 years in a single post? I've already posted examples of early gun laws and if you want to find more examples you'll have to do your own research. Why don't read what the Militia Act of 1792 says about the type of firearms that militia members were expected to own if you have questions about that?\n\n You call quartermaster, gun laws? \n   Militia Act of 1792, \n IV. And be it further enacted, &#8230;\n The officers to be armed with a sword or hanger, a fusee, bayonet and belt, with a cartridge box to contain twelve cartridges; and each private of matoss shall furnish themselves&#8230;. , and to be armed with a sword and pair of pistols, the holsters of which to be covered with bearskin caps.\n \n Gun laws, and gun regulations! emoticon_smile", 
   {}, 
   409820, 
   null, 
   1281571620.0
  ], 
  [
   409828, 
   null, 
   "Tither", 
   "What is a Prefatory clause? Pre-fact \n \n 2nd Amendment says: A well regulated Militia being necessary to the security of a free State, the right of the people to keep and bear Arms shall not be infringed.\n \n Prefatory clause ==< A well regulated Militia being necessary to the security of a free State, \n \n   District of Columbia v. Heller (2008) \n Held: \n 1. The Second Amendment protects an individual right to possess a firearm unconnected with service in a militia, and to use that arm for traditionally lawful purposes, such as self-defense within the home.Pp. 2&#8211;53.\n \n (a) The Amendment&#8217;s prefatory clause announces a purpose, but does not limit or expand the scope of the second part, the operative clause. The operative clause&#8217;s text and history demonstrate that it connotes an individual right to keep and bear arms. Pp. 2&#8211;22.\n \n (b) The prefatory clause comports with the Court&#8217;s interpretation of the operative clause. The &#8220;militia&#8221; comprised all males physicallycapable of acting in concert for the common defense. The Antifederalists feared that the Federal Government would disarm the people in order to disable this citizens&#8217; militia, enabling a politicized standing army or a select militia to rule. The response was to deny Congress power to abridge the ancient right of individuals to keep and beararms, so that the ideal of a citizens&#8217; militia would be preserved. Pp. 22&#8211;28\n \n (d) The Second Amendment&#8217;s drafting history, while of dubious interpretive worth, reveals three state Second Amendment proposals that unequivocally referred to an individual right to bear arms. Pp. 30&#8211;32 \n\n \n The Constitution Society says.   The meaning of the phrase \"well-regulated\" in the 2nd amendment \nThe phrase \"well-regulated\" was in common use long before 1789, and remained so for a century thereafter. It referred to the property of something being in proper working order. Something that was well-regulated was calibrated correctly, functioning as expected. Establishing government oversight of the people's arms was not only not the intent in using the phrase in the 2nd amendment, it was precisely to render the government powerless to do so that the founders wrote it.\n", 
   {}, 
   409826, 
   null, 
   1281574740.0
  ], 
  [
   409985, 
   null, 
   "Galileo", 
   "How exactly is the Second Amendment supposed to be a safeguard against a tyrannical federal government, when the Constitution (at least as far as your argument goes) supposedly gives the government absolute authority to prevent such from happening?\n \n How exactly do you propose reconcile of these two highly contradictory positions?\n\n A well regulated militia was intended to minimize dependence on a standing army which the Founders thought was a threat to liberty. I'm not sure what you're claiming is a contradiction. \n \n \n\n And how exactly does \"training the militia...\" translate to \"bogging down with excessive authoritative laws that ultimately render them inert and impotent\"? I'd like to see you put a spin on that one, try and explain that one away. Go ahead and give it a try.\n\n What excessive authoritative laws are bogging down the National Guard?\n \n \n\n You made the claim that back in colonial days the government exercised extensive authority over firearms. Meaning they had extensive laws governing every possible aspect of guns. Since you made the claim, start posting the evidence.\n \n You've posted the bit about requiring the swearing of a loyalty oath, and the ordinance about storing gun powder in event of a fire. Neither of which counts, and neither of which will be considered in this debate. You'll have to try harder than that, much harder.\n\n What kind of game is this? You demand that people post evidence but then claim it doesn't count when they do. Damned if you do, damned if you don't.\n A link to examples of early gun laws that I have posted previously:\n http://www.4forums.com/political/politics-debates/14440-5-4-supreme-court-rulings-2.html#post408787 \n \n \n\n There were absolutely no laws against minors, the mentally ill, or convicts being able to carry weapons of any sort. Cannons were commonly available to anybody who could afford them. Serial numbers didn't exist. Nobody ever needed a permit to buy, own or carry a weapon. There was nothing even remotely resembling the ATF. A person could make guns and grenades in their own home, and sell them to anybody they chose, and the government had absolutely no say in the matter.\n \n So you're going to have to try infinitely harder to prove that the government possessed and exercise \"extensive authority\" over firearms back in the day.\n\n All you've managed to show is that gun ownership is not regulated in exactly the same way as it was 200 years ago. That's not same thing as showing that gun ownership was not regulated. And if you have complaints about modern day gun laws such as those that ban the mentally ill and felons from possessing arms then remember that recent Supreme Court rulings already have shown their approval for such laws.", 
   {}, 
   409824, 
   null, 
   1281913140.0
  ], 
  [
   409986, 
   null, 
   "Galileo", 
   "The Constitution Society says. The meaning of the phrase \"well-regulated\" in the 2nd amendment\n Quote:\n The phrase \"well-regulated\" was in common use long before 1789, and remained so for a century thereafter. It referred to the property of something being in proper working order. Something that was well-regulated was calibrated correctly, functioning as expected. Establishing government oversight of the people's arms was not only not the intent in using the phrase in the 2nd amendment, it was precisely to render the government powerless to do so that the founders wrote it. \n\n So the Founders intended for the Second Amendment to contradict what Article 1 says about Congress' and the states power over the militia? That's probably one of the most anti-Second Amendment and anti-Constitution claims I've read. This \"Constitution Society\" should rename itself to be \"The Anti-Constitution Society\".", 
   {}, 
   409828, 
   null, 
   1281913500.0
  ], 
  [
   409991, 
   null, 
   "NATO 556", 
   "[QUOTE]\nA well regulated militia was intended to minimize dependence on a standing army which the Founders thought was a threat to liberty. I'm not sure what you're claiming is a contradiction.\n\n \n How does this address your claim that the Second Amendment served as a defense against a tyrannical federal government? Are you moving the goalposts now?\n \n \nWhat excessive authoritative laws are bogging down the National Guard?\n\n \n the National Guard isn't part of this discussion. Don't bring them up. The Second Amendment applies to we the people, not any government authority. The National Guard works for the government, they're a standing army, they have no protection under the Second Amendment.\n \n Engage your brain to think before you open your mouth to speak.\n \n \nWhat kind of game is this? You demand that people post evidence but then claim it doesn't count when they do. Damned if you do, damned if you don't.\n\n \n You haven't proved anything along the lines of \"extensive authority over firearms\" that the government was allowed to exercise during colonial days. Either show evidence of such laws or give up the argument.\n \n \nAll you've managed to show is that gun ownership is not regulated in exactly the same way as it was 200 years ago. That's not same thing as showing that gun ownership was not regulated.\n\n \n Then prove it was. Show us the extensive regulations that existed in colonial days.\n \n \nAnd if you have complaints about modern day gun laws such as those that ban the mentally ill and felons from possessing arms then remember that recent Supreme Court rulings already have shown their approval for such laws.\n\n \n You're not going to slip out of this argument by posting such drivel. Where's the proof that the government could regulate any possible aspect of firearms that they wished to during the days of the Founders?", 
   {}, 
   409985, 
   null, 
   1281917340.0
  ], 
  [
   409992, 
   null, 
   "NATO 556", 
   "So the Founders intended for the Second Amendment to contradict what Article 1 says about Congress' and the states power over the militia? That's probably one of the most anti-Second Amendment and anti-Constitution claims I've read. This \"Constitution Society\" should rename itself to be \"The Anti-Constitution Society\".\n\n \n You don't seem to get it. And the only conclusion I can arrive at is that you're being intentionally idiotic because you don't like what you hear.\n \n Bearing arms was in no way dependent upon militia service. The militia wouldn't even exist if the people who made it up, were prevented from freely owning their own arms in whatever manner they chose. That's why the Militia Act of 1792 specified that each member would bring their own weapons, rather than falling out and being equipped with government issue.\n \n If gun ownership was contingent upon fulfilling a duty to the government that would've been the easiest way to enslave the populace; dissolve the militia, deny service to everyone, and confiscate their arms because they couldn't fulfill their duty.\n \n You argument fails and so do you.", 
   {}, 
   409986, 
   null, 
   1281917820.0
  ], 
  [
   409994, 
   null, 
   "Tither", 
   "Again Galileo, the 14th Amendment sinks you as it was primarily an amendment fixing the abuse of people like you and government denying the right to keep and bear arms to the freed slaves. The 14th Amendment makes it clear what it means, and who that Right belongs to! \n \nSo the Founders intended for the Second Amendment to contradict what Article 1 says about Congress' and the states power over the militia? That's probably one of the most anti-Second Amendment and anti-Constitution claims I've read. This \"Constitution Society\" should rename itself to be \"The Anti-Constitution Society\".\n\n Or could it be that you are pushing yet another bogus interpretation. I wonder which is more likely! emoticon_smile\n \n To regulate in our Founders day, was to make regular! Working properly. In the Old West   The Wild West's \"Billy The Kid\" -- The Lincoln County War \n According to Peter Watts' Dictionary of the Old West, regulators were \"men who organized in committees of vigilance when regular law had broken down.\" For men of a country like New Mexico, which far-off Washington City disregarded for more domestic arenas, taking the law into one's own hand was the quickest means of justice. Illegal, yes, but tell that to a party of men whose friend had just been murdered!\n\n \n It is clear that you hope to capitalize on the confusion, and you hope that people today will forget about the 2nd Amendment Heller case, and the 14th Amendment McDonald case, and believe that our Founders, who took up arms and fought the Most Powerful Army in the World, when they came to both Lexington and Concord to seize the powder stores collecting weapons along the way, intended to let Congress, disarm them? Really?\n \n Our Founders did not trust any government at that time, and it was easy to understand why. Found at our National Archives.   The Bill Of Rights ~ The First Ten Amendments to the Constitution \n The fact that the Constitution did not include a bill of rights to specifically protect Americans' hard-won rights sparked the most heated debates during the ratification process. To the Federalists, those who favored the Constitution, a bill of rights was unnecessary because the Federal Government was limited in its powers and could not interfere with the rights of the people or the states; also, most states had bills of rights. To the Anti-Federalists, those who opposed the Constitution, the prospect of establishing a strong central government without an explicit list of rights guaranteed to the people was unthinkable. Throughout the ratification process, individuals and state ratification conventions called for the adoption of a bill of rights. \n\n No Bill of Rights, No Constitution! \n   9th Amendment \n The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people. \n\n   The Bill Of Rights ~ The First Ten Amendments to the Constitution \n Alexander Hamilton 1775\n The Sacred Rights of Mankind are not to be rummaged for among old parchment,. or musty records. They are written with a sun beam in whole volume of human nature, by the hand of the divinity itself, and can never be erased or obscured by mortal power.  \n I think that means congress. No? emoticon_smile", 
   {}, 
   409986, 
   null, 
   1281918240.0
  ], 
  [
   410089, 
   null, 
   "Galileo", 
   "Again Galileo, the 14th Amendment sinks you as it was primarily an amendment fixing the abuse of people like you and government denying the right to keep and bear arms to the freed slaves. The 14th Amendment makes it clear what it means, and who that Right belongs to! \n \n Or could it be that you are pushing yet another bogus interpretation. I wonder which is more likely! emoticon_smile\n \n To regulate in our Founders day, was to make regular! Working properly. In the Old West   The Wild West's \"Billy The Kid\" -- The Lincoln County War \n \n It is clear that you hope to capitalize on the confusion, and you hope that people today will forget about the 2nd Amendment Heller case, and the 14th Amendment McDonald case, and believe that our Founders, who took up arms and fought the Most Powerful Army in the World, when they came to both Lexington and Concord to seize the powder stores collecting weapons along the way, intended to let Congress, disarm them? Really?\n \n Our Founders did not trust any government at that time, and it was easy to understand why. Found at our National Archives.   The Bill Of Rights ~ The First Ten Amendments to the Constitution \n No Bill of Rights, No Constitution! \n   9th Amendment \n   The Bill Of Rights ~ The First Ten Amendments to the Constitution  I think that means congress. No? emoticon_smile\n\n You are the one trying to capitalize on confusion by trying to make it seem that your claims refute anything I've said. It's time for you to step up to the plate and actually address my argument. How does regulation of the militia by Congress in accordance with Article 1 constitute a violation of the Second Amendment?", 
   {}, 
   409994, 
   null, 
   1282079520.0
  ], 
  [
   410090, 
   null, 
   "NATO 556", 
   "You are the one trying to capitalize on confusion by trying to make it seem that your claims refute anything I've said. It's time for you to step up to the plate and actually address my argument. How does regulation of the militia by Congress in accordance with Article 1 constitute a violation of the Second Amendment?\n\n \n If militia service was a prerequisite to being able to legally own your own guns, which were your private property, then dissolving the militia assembly would violate the Second Amendment by stripping the people of their right to be armed, without first providing the people due process.\n \n If the government had the authority to tell all people to turn in their arms because the crisis was passed, essentially saying that private property didn't exist under any circumstances, that would be a violation of the Second Amendment, and it would also violate the Fifth Amendment. See \"...nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation\" for further reading.\n \n The Militia Act of 179s specifies that all men between 18 and 45 years of age are in the militia and bound to serve. Does this mean that all women, as well as men of ages under 17 and above 46, were automatically without a right to bear arms because they couldn't serve in the militia?", 
   {}, 
   410089, 
   null, 
   1282080420.0
  ], 
  [
   410092, 
   null, 
   "Galileo", 
   "\n How does this address your claim that the Second Amendment served as a defense against a tyrannical federal government? Are you moving the goalposts now?\n\n \"If you deny the general government the power of calling out the militia, there must be a recurrence to a standing army. If you are really jealous of your liberties, confide in Congress.\"\n (Debate in Virginia Ratifying Convention, 14 June 1788 Elliot 3:417--28) \n \n The Founders thought that a large, powerful standing army would threaten the liberties of the people. A nation that depended mainly on a well regulated militia for its military needs could have a standing army that was smaller and less powerful.\n \n \n\n the National Guard isn't part of this discussion. Don't bring them up. The Second Amendment applies to we the people, not any government authority. The National Guard works for the government, they're a standing army, they have no protection under the Second Amendment.\n \n Engage your brain to think before you open your mouth to speak.\n\n If you really feel that way then you're free to advocate that the National Guard include a much larger portion of the population. Don't just give lip service to the idea because it's convenient in an argument. \n \n \"The passage of the National Defense Act of 1916 materially altered the status of the militias by constituting them as the National Guard.\"- Supreme Court, Maryland v. United States (1965)\n \n \n\n You haven't proved anything along the lines of \"extensive authority over firearms\" that the government was allowed to exercise during colonial days. Either show evidence of such laws or give up the argument.\n \n Then prove it was. Show us the extensive regulations that existed in colonial days.\n \n You're not going to slip out of this argument by posting such drivel. Where's the proof that the government could regulate any possible aspect of firearms that they wished to during the days of the Founders?\n\n Here are some examples of government authority over firearms in early America:\n \n -In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n \n -Almost thirty years ago, Edmund Morgan observed that white Virginians excluded African-Americans, Indians, and indentured servants from the body politic and denied them the most fundamental of rights. In 1998, Michael Bellesiles applied this observation to the issue of gun ownership, demonstrating that most colonial jurisdictions denied these groups the right to keep weapons.\n \n - When called upon by the Continental Congress to disarm non-associators, legislatures enacted a series of measures that ordered the disarmament of those refusing to take up arms against the king.\n \n -Pennsylvania's Test Act of 1777 marks the return to voluntary allegiance as the standard of membership in the body politic. It required all white men over eighteen to swear an oath declaring allegiance to the commonwealth, abjuring all allegiance to the British monarchy, and promising to do nothing injurious to the freedom and independence of the state. The act prohibited those refusing the test from voting, holding office, serving on juries, suing, and transferring land. It also ordered them disarmed.\n \n - Maryland instituted a test oath in 1777 and barred those refusing from the basic civil liberties of voting, holding office, serving on juries, suing, and keeping arms.\n \n - North Carolina followed suit, barring non-testors from basic liberties including the keeping of arms while promising that any who relented would be \"held and deemed a good subject of this state, and shall enjoy the privileges thereof.\"\n \n - Early American militia laws prohibited any use of guns on the day of muster unless expressly ordered by militia officers. They also required militiamen and other householders to bring their guns to the muster field twice a year so that militia officers could record which men in the community owned guns. Some colonies authorized door-to-door surveys of gun ownership.\n \n - Colonial governments expressed particular concern over the firing of guns after dark, in part because the traditional method of raising the alarm of an attack after dark involved the firing of several guns in succession. Thus, an amendment to New Hampshire's militia law prohibited the firing of guns after sunset during \"time of war or watch.\" Connecticut and Georgia enacted similar measures.\n \n - By 1770, the shooting of guns was prohibited in the cities of Philadelphia, New York, and Boston. The colonies of Pennsylvania and New York extended this prohibition to all other towns and boroughs. Delaware also prohibited the firing of guns within built-up areas, but made an exception for \"days of public rejoicing.\"\n \n - Rhode Island banned the placement of shooting ranges lying across a public highway. Pennsylvania banned gunfire \"on or near any of the King's highways.\" The legislature noted, however, that the fine did not extend \"to any person carrying a gun on the public highway.\" New Jersey also explicitly protected the carrying of guns on the highways.\n \n - Massachusetts regulated the manner of keeping arms as well as the manner of using them. As a precaution against the accidental wounding of firefighters, the state prohibited the storage of loaded guns in any house within the town of Boston. At least some of these laws, including the prohibition of storing loaded guns in Boston, provided for the confiscation of the gun as penalty. North Carolina and New Jersey both acted to prevent trespasses by hunters and to preserve their game populations by levying steep fines for abusive hunting practices. Each colony also provided that hunters without a \"settled habitation\" or residence in the colony would forfeit their guns.\n Robert H. Churchill | Forum: Rethinking the Second Amendment: Gun Regulation, the Police Power, and the Right to Keep Arms in Early America: The Legal Context of the Second Amendment | Law and History Review, 25.1 | The History Cooperative", 
   {}, 
   409991, 
   null, 
   1282081320.0
  ], 
  [
   410096, 
   null, 
   "NATO 556", 
   "\"If you deny the general government the power of calling out the militia, there must be a recurrence to a standing army. If you are really jealous of your liberties, confide in Congress.\"\n (Debate in Virginia Ratifying Convention, 14 June 1788 Elliot 3:417--28) \n \n The Founders thought that a large, powerful standing army would threaten the liberties of the people. A nation that depended mainly on a well regulated militia for its military needs could have a standing army that was smaller and less powerful.\n\n \n And if the government had absolute authority over the militia, what exactly prevented it from ordering the murder of all those who had dissenting opinions of government policy? Why didn't the government order the execution of everyone who took part in the Boston Tea Party if they felt the display threatened their nation?\n \n \nIf you really feel that way then you're free to advocate that the National Guard include a much larger portion of the population. Don't just give lip service to the idea because it's convenient in an argument. \n \n \"The passage of the National Defense Act of 1916 materially altered the status of the militias by constituting them as the National Guard.\"- Supreme Court, Maryland v. United States (1965)\n\n \n All of this doesn't answer any of the basic questions that have been asked time and time again. It's time for you to either answer the questions or concede absolute defeat.\n \n Exactly where was it determined that militia service was a prerequisite to being able to legally possess your privately owned firearm? Where was it orders that all those who were too young, too old, or women, were denied the ability to be armed because they couldn't serve in the militia, and thus their being armed wasn't in the interest of the government?\n \n \n-In Anglo-American law, the state may exercise extraordinary powers and even abridge basic civil liberties like the right to a trial, at moments of military emergency. The practice of impressment [confiscation of private property for public use] is, like the suspension of the writ of habeas corpus, an application of the state's military power.... Of ten states that practiced the impressment of arms during the Revolution, eight appear to have permanently discontinued the practice by 1787.\n\n \n Military emergency. Not everyday life. So there's absolutely no grounds to suggest that the government could, at any given moment, forcibly disarm regular citizens for no reason.\n \n Come back when you've got real proof.\n \n \n-Almost thirty years ago, Edmund Morgan observed that white Virginians excluded African-Americans, Indians, and indentured servants from the body politic and denied them the most fundamental of rights. In 1998, Michael Bellesiles applied this observation to the issue of gun ownership, demonstrating that most colonial jurisdictions denied these groups the right to keep weapons.\n\n \n Could these groups still take part in the militia? If so, but they couldn't bear arms, you've basically admitted that the two aren't the same thing and conceded defeat.\n \n \n- When called upon by the Continental Congress to disarm non-associators, legislatures enacted a series of measures that ordered the disarmament of those refusing to take up arms against the king.\n \n -Pennsylvania's Test Act of 1777 marks the return to voluntary allegiance as the standard of membership in the body politic. It required all white men over eighteen to swear an oath declaring allegiance to the commonwealth, abjuring all allegiance to the British monarchy, and promising to do nothing injurious to the freedom and independence of the state. The act prohibited those refusing the test from voting, holding office, serving on juries, suing, and transferring land. It also ordered them disarmed.\n \n - Maryland instituted a test oath in 1777 and barred those refusing from the basic civil liberties of voting, holding office, serving on juries, suing, and keeping arms.\n \n - North Carolina followed suit, barring non-testors from basic liberties including the keeping of arms while promising that any who relented would be \"held and deemed a good subject of this state, and shall enjoy the privileges thereof.\"\n \n - Early American militia laws prohibited any use of guns on the day of muster unless expressly ordered by militia officers. They also required militiamen and other householders to bring their guns to the muster field twice a year so that militia officers could record which men in the community owned guns. Some colonies authorized door-to-door surveys of gun ownership.\n \n - Colonial governments expressed particular concern over the firing of guns after dark, in part because the traditional method of raising the alarm of an attack after dark involved the firing of several guns in succession. Thus, an amendment to New Hampshire's militia law prohibited the firing of guns after sunset during \"time of war or watch.\" Connecticut and Georgia enacted similar measures.\n \n - By 1770, the shooting of guns was prohibited in the cities of Philadelphia, New York, and Boston. The colonies of Pennsylvania and New York extended this prohibition to all other towns and boroughs. Delaware also prohibited the firing of guns within built-up areas, but made an exception for \"days of public rejoicing.\"\n \n - Rhode Island banned the placement of shooting ranges lying across a public highway. Pennsylvania banned gunfire \"on or near any of the King's highways.\" The legislature noted, however, that the fine did not extend \"to any person carrying a gun on the public highway.\" New Jersey also explicitly protected the carrying of guns on the highways.\n \n - Massachusetts regulated the manner of keeping arms as well as the manner of using them. As a precaution against the accidental wounding of firefighters, the state prohibited the storage of loaded guns in any house within the town of Boston. At least some of these laws, including the prohibition of storing loaded guns in Boston, provided for the confiscation of the gun as penalty. North Carolina and New Jersey both acted to prevent trespasses by hunters and to preserve their game populations by levying steep fines for abusive hunting practices. Each colony also provided that hunters without a \"settled habitation\" or residence in the colony would forfeit their guns.\n\n \n Nope, not gonna happen. You're not allowed to cite local laws in this discussion. For so long you've been arguing that the US Constitution was about creating a federal government to run the entire country. You cite Article 1 of the US Constitution to try and back up your militia/gun control argument. But Article 1 mentions nothing about the authority of the states, it only talks about authority of the federal government. There's no authority for one state to call into service the militia of another state, nor set rules to regulate their behavior and training.\n \n You've basically hung yourself here. Local states and jurisdictions are out of bounds, their laws have no weight. In your argument for federal control you've severed any and all rights you had to cite local laws regarding guns, the militia, and anything of the like. You're effectively limited to federal laws only and nothing else.\n \n Now that we're cleared that up, start citing every single federal law that regulated firearms in any way, shape, or form, from the founding of the federal government, to 1900. Show us the laws set forth by the federal government that dictated who was allowed to be armed, where carrying a gun was banned, where maximum caliber and minimum overall length were specified, where limits on ammunition purchases existed, where owning a handgun was forbidden, where gun trafficking was spelled out as a crime, etc.\n \n Get to work.\n \n And don't bother posting the Militia Act any further. It doesn't count since it doesn't specify that you can't own firearms, or anything even remotely similar to that.", 
   {}, 
   410092, 
   null, 
   1282086540.0
  ], 
  [
   410103, 
   null, 
   "Tither", 
   "How does regulation of the militia by Congress in accordance with Article 1 constitute a violation of the Second Amendment?\n\n Uh. Passing Congressional Regulations for the militia has NOTHING to Do with The 2nd Amendment! emoticon_smile Nothing at all! Zero! Zip! Ziltch! Nada! emoticon_smile\n \n However passing gun regulations also has nothing to do a Well Regulated Militia either! You have 2 Supreme Court cases that say so, and the Constitution Society to tell us what was meant by Well Regulated at the time! \n \n The 14th Amendment also puts a fork in your little charade as well!   Institute for Justice -- 14th Amendment \n 2. The history and adoption of the Fourteenth Amendment demonstrates the Framer&#8217;s specific and repeated concern that freedmen were being disarmed by state and local governments and militias, in violation of what those Framers understood to be an individual constitutional right to bear arms. In response to this Court&#8217;s previous refusal to enforce parts of the Bill of Rights directly against the States, and its holding that blacks were not citizens of the United States entitled to the rights of such citizens, the Framers set out to remedy the inability to enforce numerous constitutional rights against the States by incorporating them into the Fourteenth Amendment.  Identification of the evils the 39th Congress sought to remedy &#8211; including the disarming of freedmen &#8211; the parallel legislative responses to that problem, and the specific explanations by the Framers of the purpose and function of the Fourteenth Amendment, all demonstrate that they viewed the existing constitutional right to bear arms as an individual right of personal security. And they understood and intended the language of the Fourteenth Amendment to secure such a right against the States and various militias, not merely in the service of the very entities seeking to disarm and abuse the freedmen. And by accomplishing that goal through the identification and extension of the rights of national citizens, the Framers of the Fourteenth Amendment also clarified and defined the underlying rights in the Second Amendment as well.\n \n Whatever the basis for incorporation, however, the history of the Fourteenth Amendment shows that the right to bear arms was intended to be incorporated, and thus should be read as it was understood at the time of such incorporation. \n\n After McDonald and Heller, that Proven to be the Supreme Law of the Land! \n \n However you can spin all you want, you Tasmanian Devil you! emoticon_smile Keep on talking like you actually have a point! It is a free country! And it is your Individual First Amendment Right just like the 2nd Amendment is an Individual Right as well! emoticon_smile\n \n Now if you want to talk about writing congressional Regulations for the Army, or for the unorganized Militia if it is ever called up, I suggest that you chose a different forum. This is a gun forum, not a Congressional Army Regulations forum! emoticon_smile", 
   {}, 
   410089, 
   null, 
   1282095420.0
  ], 
  [
   410105, 
   null, 
   "Tither", 
   "\"The passage of the National Defense Act of 1916 materially altered the status of the militias by constituting them as the National Guard.\"- Supreme Court, Maryland v. United States (1965)\n\n Really?\n 1982 COMMITTEE ON THE JUDICIARY UNITED STATES SENATE NINETY-SEVENTH CONGRESS SECOND SESSION says:\n \n   97th Congress 2d Session -- THE RIGHT TO KEEP AND BEAR ARMS \n (The passage below can be found here. Scroll up one sentence. )\n \n That the National Guard is not the \"Militia\" referred to in the second amendment is even clearer today. Congress has organized the National Guard under its power to \"raise and support armies\" and not its power to \"Provide for organizing, arming and disciplining the Militia\".[65] This Congress chose to do in the interests of organizing reserve military units which were not limited in deployment by the strictures of our power over the constitutional militia, which can be called forth only \"to execute the laws of the Union, suppress insurrections and repel invasions.\" The modern National Guard was specifically intended to avoid status as the constitutional militia, a distinction recognized by 10 U.S.C. Sec 311(a).(p.12)\n \n Conclusion \n The conclusion is thus inescapable that the history, concept, and wording of the second amendment to the Constitution of the United States, as well as its interpretation by every major commentator and court in the first half-century after its ratification, indicates that what is protected is an individual right of a private citizen to own and carry firearms in a peaceful manner.\n\n This is not to say that we cannot be called up, to serve our country in a time of emergency, however this has nothing to do with the 2nd Amendment. This is totally a separate thing all together. So says the Supreme Court!", 
   {}, 
   410092, 
   null, 
   1282096440.0
  ], 
  [
   410124, 
   null, 
   "Doc Jones", 
   "with and then begging the reader to take a leap of faith to Churchill and embracing yet another disgraced claiment, Bellesiles;\n \n \n\n -Almost thirty years ago, Edmund Morgan observed that white Virginians excluded African-Americans, Indians, and indentured servants from the body politic and denied them the most fundamental of rights. In 1998, Michael Bellesiles applied this observation to the issue of gun ownership, demonstrating that most colonial jurisdictions denied these groups the right to keep weapons. \n \n\n \n AND close to the truth by admitting gun control is racist. You got all screwed up on the timeline and post BTW. That is the most awkward statement I believe you have ever entered/spammed on this board. How come no linky to posty information? Did little mikey show you a photo of his ex-Bancroft prize? Pray tell us why he had to surrender that Bancroft award. :)\n \n Please spare us your muddled presentations from now on and quit spamming the board with meaningless information; all that does is show your conflicted ability to transfer instantly your claims before the Republic was formed and the Constitution when it was under the rule of King George and you made the grand leap instantly to..................................1998. Where would the world be without your ability of association for comparison?", 
   {
    "post_info": {
     "post_title": "what a leap for star gazer...going from a Kellerman claim he keeps spamming the board"
    }
   }, 
   410105, 
   null, 
   1282126080.0
  ], 
  [
   410131, 
   null, 
   "Tither", 
   "What evidence do you have to support that claim? If you want to know what is meant by \"well regulated\" all you have to do is read Article 1 of the Constitution. Alexander Hamilton quotes directly from this part of the Constitution when talking about the regulation of the militia:\n \n \"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n\n Alright! Alright! As much fun as it was to see Galileo twist the facts in order for him to find any way possible to ban guns, it is now time to end this Anti-gun Heresy of his, forever! emoticon_smile\n \n Meaning of Well Regulated from Alexander Hamilton, himself! \n   FEDERALIST No. 29 -- HAMILTON \n \"The project of disciplining all the militia of the United States is as futile as it would be injurious, if it were capable of being carried into execution. A tolerable expertness in military movements is a business that requires time and practice. It is not a day, or even a week, that will suffice for the attainment of it. To oblige the great body of the yeomanry, and of the other classes of the citizens, to be under arms for the purpose of going through military exercises and evolutions, as often as might be necessary to acquire the degree of perfection which would entitle them to the character of a well-regulated militia, would be a real grievance to the people, and a serious public inconvenience and loss. It would form an annual deduction from the productive labor of the country, to an amount which, calculating upon the present numbers of the people, would not fall far short of the whole expense of the civil establishments of all the States. \n\n emoticon_smile", 
   {}, 
   409148, 
   null, 
   1282132200.0
  ], 
  [
   410147, 
   null, 
   "Bryan", 
   "How does regulation of the militia by Congress in accordance with Article 1 constitute a violation of the Second Amendment? \n\n \n Let me get into the discussion. The short answer to the question is regulation of the militia and militia arms should have no impact on the individual RKBA protected in the 2nd. Amendment because, in my opinion, Article I Section 8 of the Constitution divorced individual arms from militia service.\n \n I think we need to understand the total historical context here. We know that before the Constitution was adopted a practice was, as U.S. v. Miller, 307 U.S. 174 (1939) noted, for men to appear for militia service \"bearing arms supplied by themselves and of a kind in common use at the time.\" Id at 179. We know that before the Constitution was adopted the control over the militias was exercised by the states. Consider, for example, my state of Virginia and its Constitution adopted June 12, 1776. Virginia spoke of its militia thus:\n \n \"That a well regulated militia, composed of the body of the people, trained to arms, is the proper, natural, and safe defense of a free state, therefore, the right of the people to keep and bear arms shall not be infringed; that standing armies, in time of peace, should be avoided as dangerous to liberty; and that in all cases the military should be under strict subordination to, and governed by, the civil power.\" Va. Constitution Art. 1 § 13\n \n Virginia also decided that this civil power was to be exercised by the Governor:\n \n \"The Governor shall be commander-in-chief of the armed forces of the Commonwealth and shall have power to embody such forces to repel invasion, suppress insurrection, and enforce the execution of the laws.\"\n Va. Constitution Art. 5 § 7\n \n And then the proposed federal Constitution comes along, which, if enacted, would radically alter the balance of control over the militia:\n \n Article I Section 8\n The Congress shall have power...\n To provide for organizing, arming, and disciplining, the militia, and for governing such part of them as may be employed in the service of the United States, reserving to the states respectively, the appointment of the officers, and the authority of training the militia according to the discipline prescribed by Congress.\n \n And, if adopted, the congressional powers described above would be absolute because of the Article VI \"supremacy clause\":\n \n \"The Federal Government holds a decided advantage in this delicate balance: the Supremacy Clause. U.S. Const., Art. VI. As long as it is acting within the powers granted it under the Constitution, Congress may impose its will on the States. Congress may legislate in areas traditionally regulated by the States. This is an extraordinary power in a federalist system. It is a power that we must assume Congress does not exercise lightly.\" Gregory v. Ashcroft, 501 U.S. 452, 460 (1991):\n \n Thus, if adopted, the new Federal Constitution granted Congress the exclusive power to choose how large the state militia will be, who will be considered a member and who will not, how they will be armed, and how they will be disciplined-and the states by consequence loose all power over arming their militias.\n \n This, to my mind, puts into context the arguments of Federalists and Anti-federalists over the militia and the fear of a standing army.\n \n Many anti-federalists complained that if Congress were given the exclusive power to arm the militias then Congress could effectively disarm the state militias simply be refusing to exercise its authority to arm them. \n \n The federalist response was essentially \"so what?\" They argued the people were already armed. See, for example, Noah Webster:\n \n \"Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.\" Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).\n \n The view clearly was that Congress cannot exercise a monopoly over arms because the people have a concurrent individual right to have arms-which would not be affected in any way if Congress is given absolute power to arm the militias-ie., the individual RKBA exists independent from the civic militia duty. If Congress formed an army of tyranny and both refused to arm the militias and forbade the states from providing arms to the militias, then the people in an emergency could provide these individually held arms for self-defense against a tyrant. \n \n Remember that this was the winning argument. The Constitution was adopted, and with it Congress was given the sole power over the arms of both the militias and a standing army-but not a single founder-not a single writer-suggested that Congress had thereby also been given power over individual arms. \n \n But I do not suggest that Article I Sec. 8 had no effect on the individual RKBA. On the contrary, what it did was divorce the individual RKBA from the militia. Regardless of the past system U.S. v. Miller talked about, under Article I Sec. 8 individuals can no longer provide their own arms for militia service. Congress, by having the exclusive power to choose how to arm the militias, also has the exclusive power to forbid you as an individual from using your own firearms in militia service. And it has the exclusive power to refuse to allow you to serve in a militia if you disobeyed the command and tried to use your own firearm.\n \n And here is a point that \"militia only\" interpreters of the 2nd. Amendment will not and cannot address: The federal grant of power to Congress in Article I Sec. 8 ended the relationship between individual arms and militia service. No longer would a militia rely upon men appearing bearing their own arms of different and often incompatible calibers. Now Congress was given total power to impose uniformity over militia arms, and the individual RKBA was absolutely excluded from the militia context (absent Congress consenting to or passing laws to continue the old practice-which it could do if it wanted to) In my opinion, the attempt to reinitiate that link between individual arms and militia service through a fraudulent \"militia only\" interpretation of the 2nd. Amendment is the height of folly. Here's why:\n \n The Amendment did nothing to repeal the Article I Sec. 8 Congressional power over arming the militias, and a militia-only RKBA interpretation of the 2nd. Amendment therefore becomes a nullity-\"you have a right to keep and bear arms if Congress allows you to have them.\" The argument has no basis in history, law, or common sense. Even Cruikshank refused to endorse this view:\n \n \"The right there specified is that of bearing arms for a lawful purpose.\" United States v. Cruishank 92 U.S. 542 (1876):\n \n Not \"for militia service\" but \"for a lawful purpose.\" \n \n And yet if \"the Right of the People\" to keep and bear arms is limited only to militia service then it is not a right at all-it merely becomes a privilege incidental to militia service which Congress has the total power to grant or withhold. This point was addressed in Heller:\n \n \"Besides ignoring the historical reality that the Second Amendment was not intended to lay down a \"novel principl[e]\" but rather codified a right \"inherited from our English ancestors,\" Robertson v. Baldwin, 165 U.S. 275, 281 (1897), petitioners' interpretation does not even achieve the narrower purpose that prompted codification of the right. If, as they believe, the Second Amendment right is no more than the right to keep and use weapons as a member of an organized militia, see Brief for Petititioners 8 - if, that is, the organized militia is the sole institutional [Slip Op. 27] beneficiary of the Second Amendment's guarantee - it does not assure the existence of a \"citizens' militia\" as a safeguard against tyranny. For Congress retains plenary authority to organize the militia, which must include the authority to say who will belong to the organized force.17 That is why the first Militia Act's requirement that only whites enroll caused States to amend their militia laws to exclude free blacks. See Siegel, The Federal Government's Power to Enact Color-Conscious Laws, 92 Nw. U. L. Rev. 477, 521-525 (1998). Thus, if petitioners are correct, the Second Amendment protects citizens' right to use a gun in an organization from which Congress has plenary authority to exclude them. It guarantees a select militia of the sort the Stuart kings found useful, but not the people's militia that was the concern of the founding generation.\" District Of Columbia v. Heller, 554 U.S. ___ 07290, 26-27 (2008)\n \n Ah, but what about the \"well-regulated militia\" preamble? I have dealt with the militia preamble before. \n \n http://www.4forums.com/political/gun-control-debates/6957-revisiting-militia-clause.html\n \n I still argue that the 2nd. Amendment militia clause is nothing more than a restatement of the policy goal of protecting liberty by relying on militias and avoiding standing armies. I argue that this preamble statement must be aimed at Congress, which even after adoption of the 2nd. Amendment retains the sole power to make the choice of trusting national security to either a standing army or the militias. And, if Congress took the advice and chose to rely only on militias, then Article I Sec 8 provided security from a federal tyrant seizing control over the militias by reserving to the states the control of appointment of officers, thus ensuring that their loyalty would be to the states (unlike with a standing army). \n \n The bottom line is you cannot read the 2nd. Amendment to recognize or grant an individual RKBA in militia service without placing it in direct conflict with the Article I Sec. 8 grant of exclusive control over militia arms to Congress. If you read the 2nd. Amendment thus then you must also argue that the Amendment repealed that portion of Article I Sec. 8. \n \n This was never the argument of the founders. See, for example, Tench Coxe's explanation of the Amendment:\n \n \"As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms.\" Tench Coxe, describing the proposed 2nd. Amendment in his Remarks on the First Part of the Amendments to the Federal Constitution. Published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1.\n \n An individual RKB private arms unconnected with militia service. That is the right the Amendment was intended to protect-and it is the same right which Noah Webster says grants us sufficient power to repel a tyrant. Oh, I have seen some adherents of the \"militia service arms only\" interpretation of the Amendment try to explain away this direct interpretation. I find the attempts unsuccessful. A favorite argument against this quote is to say \"well it wasn't widely read.\" In response I ask is there a quote from a founder to the contrary that was more widely read? You see, I would rather have doubters of Coxe's explanation offer a better counter quote from a founder telling us that in his opinion the Amendment only protected (as they argue) a right to bear arms in militia service-if only such a quote existed. \n \n I can offer this quote, however, from the King James version: \"Now faith is the substance of things hoped for, the evidence of things not seen.\" (Hebrews, 11:1) It is in my opinion a blind faith indeed that asks me to believe a \"militia only\" interpretation of the 2nd. Amendment individual RKBA when its adherents cannot offer a single piece of evidence to show this is what the founders actually intended. I am not willing to accept that the founders concealed their true thoughts on this view so completely from us-while founders like Coxe chose to make direct statements of opinion to the contrary. To me the \"militia arms only\" view asks me-some 200+ years after the fact-to get out the \"Ouiji board\" and hold it over the Constitution to divine a secret intention of repealing a portion of Article I Section 8, despite the lack of a single statement from a long dead founder saying this is what we meant, and while ignoring those who said \"no we meant an individual RKBA unconnected with militia service.\" I'm sorry, but I cannot do this.\n \n In the end I say militia arms used to be dependent on the individual RKBA, but Article I Sec. 8 kicked that bird out of the individual right nest. Now militia arms depend exclusively on the whim of Congress, and congressional regulation of the militia therefore has zero impact on the proper scope of the individual RKBA as protected by the 2nd. Amendment and recognized by Heller. \n \n But, that is just my view. Agree or disagree as you see fit....", 
   {
    "post_info": {
     "post_title": "Article I Sec 8 granted a divorce..."
    }, 
    "unicode_changes_made": true
   }, 
   410131, 
   null, 
   1282172160.0
  ], 
  [
   410524, 
   null, 
   "Galileo", 
   "Uh. Passing Congressional Regulations for the militia has NOTHING to Do with The 2nd Amendment! emoticon_smile Nothing at all! Zero! Zip! Ziltch! Nada! emoticon_smile\n\n Oh really? The last time I check the Second Amendment actually did make reference to a \"well regulated militia\" and Hamilton quoted directly from what became part of Article 1 of the Constitution when talking about the regulation of the militia:\n \n \"This desirable uniformity can only be accomplished by confiding the regulation of the militia to the direction of the national authority. It is, therefore, with the most evident propriety, that the plan of the convention proposes to empower the Union 'to provide for organizing, arming, and disciplining the militia, and for governing such part of them as may be employed in the service of the United States, RESERVING TO THE STATES RESPECTIVELY THE APPOINTMENT OF THE OFFICERS, AND THE AUTHORITY OF TRAINING THE MILITIA ACCORDING TO THE DISCIPLINE PRESCRIBED BY CONGRESS.' \"\n \n \n\n However passing gun regulations also has nothing to do a Well Regulated Militia either! You have 2 Supreme Court cases that say so, and the Constitution Society to tell us what was meant by Well Regulated at the time!\n \n\n And you conveniently ignore what Hamilton and the Constitution say about regulation of the militia in favor of what the \"Constitution Society\" says. \n \n \n\n The 14th Amendment also puts a fork in your little charade as well!   Institute for Justice -- 14th Amendment \n \n\n The 14th Amendment does not nullify the part of the Second Amendment that refers to a \"well regulated militia\". Dream on. \n \n \n\n After McDonald and Heller, that Proven to be the Supreme Law of the Land! \n However you can spin all you want, you Tasmanian Devil you! emoticon_smile Keep on talking like you actually have a point! It is a free country! And it is your Individual First Amendment Right just like the 2nd Amendment is an Individual Right as well! emoticon_smile\n \n Now if you want to talk about writing congressional Regulations for the Army, or for the unorganized Militia if it is ever called up, I suggest that you chose a different forum. This is a gun forum, not a Congressional Army Regulations forum! emoticon_smile\n\n I have been talking about the well regulated militia spoken of in the Constitution not regulation of the Army. You have been unable to address my argument and deliberately muddy the waters as much as possible.", 
   {}, 
   410103, 
   null, 
   1282531620.0
  ], 
  [
   410526, 
   null, 
   "NATO 556", 
   "Galileo-\n \n No more excuses, no more avoiding the issue. Answer the question, right now.\n \n Exactly where was it spelled out that a person's right to own a gun was dependent upon their service in a government sanctioned militia? Show us the federalist papers, or the law, that specified that only a militia individual was allowed to be armed, and that right was terminated as soon as they reached the retirement age of 46.\n \n Your arguments have been shot to hell. Everything you've posted has been torn down, eviscerated and buried. All your arguments are dead as stated by the Supreme Court. We won, you lost. Get over it and move on, and answer the f***in' question already!", 
   {}, 
   410524, 
   null, 
   1282534260.0
  ], 
  [
   410531, 
   null, 
   "Galileo", 
   "Let me get into the discussion. The short answer to the question is regulation of the militia and militia arms should have no impact on the individual RKBA protected in the 2nd. Amendment because, in my opinion, Article I Section 8 of the Constitution divorced individual arms from militia service.\n \n I think we need to understand the total historical context here. We know that before the Constitution was adopted a practice was, as U.S. v. Miller, 307 U.S. 174 (1939) noted, for men to appear for militia service &#8220;bearing arms supplied by themselves and of a kind in common use at the time.&#8221; Id at 179. We know that before the Constitution was adopted the control over the militias was exercised by the states. Consider, for example, my state of Virginia and its Constitution adopted June 12, 1776. Virginia spoke of its militia thus:\n \n \"That a well regulated militia, composed of the body of the people, trained to arms, is the proper, natural, and safe defense of a free state, therefore, the right of the people to keep and bear arms shall not be infringed; that standing armies, in time of peace, should be avoided as dangerous to liberty; and that in all cases the military should be under strict subordination to, and governed by, the civil power.\" Va. Constitution Art. 1 § 13\n \n Virginia also decided that this civil power was to be exercised by the Governor:\n \n \"The Governor shall be commander-in-chief of the armed forces of the Commonwealth and shall have power to embody such forces to repel invasion, suppress insurrection, and enforce the execution of the laws.\"\n Va. Constitution Art. 5 § 7\n \n And then the proposed federal Constitution comes along, which, if enacted, would radically alter the balance of control over the militia:\n \n Article I Section 8\n The Congress shall have power&#8230;\n To provide for organizing, arming, and disciplining, the militia, and for governing such part of them as may be employed in the service of the United States, reserving to the states respectively, the appointment of the officers, and the authority of training the militia according to the discipline prescribed by Congress.\n \n And, if adopted, the congressional powers described above would be absolute because of the Article VI &#8220;supremacy clause&#8221;:\n \n &#8220;The Federal Government holds a decided advantage in this delicate balance: the Supremacy Clause. U.S. Const., Art. VI. As long as it is acting within the powers granted it under the Constitution, Congress may impose its will on the States. Congress may legislate in areas traditionally regulated by the States. This is an extraordinary power in a federalist system. It is a power that we must assume Congress does not exercise lightly.&#8221; Gregory v. Ashcroft, 501 U.S. 452, 460 (1991):\n \n Thus, if adopted, the new Federal Constitution granted Congress the exclusive power to choose how large the state militia will be, who will be considered a member and who will not, how they will be armed, and how they will be disciplined&#8212;and the states by consequence loose all power over arming their militias.\n \n This, to my mind, puts into context the arguments of Federalists and Anti-federalists over the militia and the fear of a standing army.\n \n Many anti-federalists complained that if Congress were given the exclusive power to arm the militias then Congress could effectively disarm the state militias simply be refusing to exercise its authority to arm them. \n \n The federalist response was essentially &#8220;so what?&#8221; They argued the people were already armed. See, for example, Noah Webster:\n \n &#8220;Before a standing army can rule, the people must be disarmed; as they are in almost every kingdom of Europe. The supreme power in America cannot enforce unjust laws by the sword; because the whole body of the people are armed, and constitute a force superior to any bands of regular troops that can be, on any pretense, raised in the United States. A military force, at the command of Congress, can execute no laws, but such as the people perceive to be just and constitutional; for they will possess the power, and jealousy will instantly inspire the inclination, to resist the execution of a law which appears to them unjust and oppressive.&#8221; Noah Webster, \"An Examination into the Leading Principles of the Federal Constitution\" (1787) in Pamphlets on the Constitution of the United States (P. Ford, 1888).\n \n The view clearly was that Congress cannot exercise a monopoly over arms because the people have a concurrent individual right to have arms&#8212;which would not be affected in any way if Congress is given absolute power to arm the militias&#8212;ie., the individual RKBA exists independent from the civic militia duty. If Congress formed an army of tyranny and both refused to arm the militias and forbade the states from providing arms to the militias, then the people in an emergency could provide these individually held arms for self-defense against a tyrant.\n\n Webster seems to be expressing the idea that the fact that the militia is composed of the people themselves serves as a natural check on government power. Kind of like how a jury is composed of the people which serves as a protection against corrupt courts.\n \n \n\n Remember that this was the winning argument. The Constitution was adopted, and with it Congress was given the sole power over the arms of both the militias and a standing army&#8212;but not a single founder&#8212;not a single writer&#8212;suggested that Congress had thereby also been given power over individual arms. \n \n But I do not suggest that Article I Sec. 8 had no effect on the individual RKBA. On the contrary, what it did was divorce the individual RKBA from the militia. Regardless of the past system U.S. v. Miller talked about, under Article I Sec. 8 individuals can no longer provide their own arms for militia service. Congress, by having the exclusive power to choose how to arm the militias, also has the exclusive power to forbid you as an individual from using your own firearms in militia service. And it has the exclusive power to refuse to allow you to serve in a militia if you disobeyed the command and tried to use your own firearm.\n \n And here is a point that &#8220;militia only&#8221; interpreters of the 2nd. Amendment will not and cannot address: The federal grant of power to Congress in Article I Sec. 8 ended the relationship between individual arms and militia service. No longer would a militia rely upon men appearing bearing their own arms of different and often incompatible calibers. Now Congress was given total power to impose uniformity over militia arms, and the individual RKBA was absolutely excluded from the militia context (absent Congress consenting to or passing laws to continue the old practice&#8212;which it could do if it wanted to) In my opinion, the attempt to reinitiate that link between individual arms and militia service through a fraudulent &#8220;militia only&#8221; interpretation of the 2nd. Amendment is the height of folly.\n \n Here&#8217;s why:\n \n The Amendment did nothing to repeal the Article I Sec. 8 Congressional power over arming the militias, and a militia-only RKBA interpretation of the 2nd. Amendment therefore becomes a nullity&#8212;&#8220;you have a right to keep and bear arms if Congress allows you to have them.&#8221; The argument has no basis in history, law, or common sense. Even Cruikshank refused to endorse this view:\n \n &#8220;The right there specified is that of bearing arms for a lawful purpose.&#8221; United States v. Cruishank 92 U.S. 542 (1876):\n \n Not &#8220;for militia service&#8221; but &#8220;for a lawful purpose.&#8221; \n [/quo\n \n And yet if &#8220;the Right of the People&#8221; to keep and bear arms is limited only to militia service then it is not a right at all&#8212;it merely becomes a privilege incidental to militia service which Congress has the total power to grant or withhold. This point was addressed in Heller:\n \n &#8220;Besides ignoring the historical reality that the Second Amendment was not intended to lay down a &#8220;novel principl[e]&#8221; but rather codified a right &#8220;inherited from our English ancestors,&#8221; Robertson v. Baldwin, 165 U.S. 275, 281 (1897), petitioners' interpretation does not even achieve the narrower purpose that prompted codification of the right. If, as they believe, the Second Amendment right is no more than the right to keep and use weapons as a member of an organized militia, see Brief for Petititioners 8 &#8212; if, that is, the organized militia is the sole institutional [Slip Op. 27] beneficiary of the Second Amendment's guarantee &#8212; it does not assure the existence of a &#8220;citizens' militia&#8221; as a safeguard against tyranny. For Congress retains plenary authority to organize the militia, which must include the authority to say who will belong to the organized force.17 That is why the first Militia Act's requirement that only whites enroll caused States to amend their militia laws to exclude free blacks. See Siegel, The Federal Government's Power to Enact Color-Conscious Laws, 92 Nw. U. L. Rev. 477, 521-525 (1998). Thus, if petitioners are correct, the Second Amendment protects citizens' right to use a gun in an organization from which Congress has plenary authority to exclude them. It guarantees a select militia of the sort the Stuart kings found useful, but not the people's militia that was the concern of the founding generation.&#8221; District Of Columbia v. Heller, 554 U.S. ___ 07290, 26-27 (2008)\n \n Ah, but what about the &#8220;well-regulated militia&#8221; preamble? I have dealt with the militia preamble before. \n \n http://www.4forums.com/political/gun-control-debates/6957-revisiting-militia-clause.html\n \n I still argue that the 2nd. Amendment militia clause is nothing more than a restatement of the policy goal of protecting liberty by relying on militias and avoiding standing armies. I argue that this preamble statement must be aimed at Congress, which even after adoption of the 2nd. Amendment retains the sole power to make the choice of trusting national security to either a standing army or the militias. And, if Congress took the advice and chose to rely only on militias, then Article I Sec 8 provided security from a federal tyrant seizing control over the militias by reserving to the states the control of appointment of officers, thus ensuring that their loyalty would be to the states (unlike with a standing army). \n \n The bottom line is you cannot read the 2nd. Amendment to recognize or grant an individual RKBA in militia service without placing it in direct conflict with the Article I Sec. 8 grant of exclusive control over militia arms to Congress. If you read the 2nd. Amendment thus then you must also argue that the Amendment repealed that portion of Article I Sec. 8. \n \n This was never the argument of the founders. See, for example, Tench Coxe&#8217;s explanation of the Amendment:\n \n &#8220;As civil rulers, not having their duty to the people duly before them, may attempt to tyrannize, and as the military forces which must be occasionally raised to defend our country, might pervert their power to the injury of their fellow citizens, the people are confirmed by the article in their right to keep and bear private arms.&#8221; Tench Coxe, describing the proposed 2nd. Amendment in his Remarks on the First Part of the Amendments to the Federal Constitution. Published under the pseudonym, \"A Pennsylvanian\" in the Philadelphia Federal Gazette, June 18, 1789 at 2 Col. 1.\n \n An individual RKB private arms unconnected with militia service. That is the right the Amendment was intended to protect&#8212;and it is the same right which Noah Webster says grants us sufficient power to repel a tyrant. Oh, I have seen some adherents of the &#8220;militia service arms only&#8221; interpretation of the Amendment try to explain away this direct interpretation. I find the attempts unsuccessful. A favorite argument against this quote is to say &#8220;well it wasn&#8217;t widely read.&#8221; In response I ask is there a quote from a founder to the contrary that was more widely read? You see, I would rather have doubters of Coxe&#8217;s explanation offer a better counter quote from a founder telling us that in his opinion the Amendment only protected (as they argue) a right to bear arms in militia service&#8212;if only such a quote existed. \n \n I can offer this quote, however, from the King James version: &#8220;Now faith is the substance of things hoped for, the evidence of things not seen.&#8221; (Hebrews, 11:1) It is in my opinion a blind faith indeed that asks me to believe a &#8220;militia only&#8221; interpretation of the 2nd. Amendment individual RKBA when its adherents cannot offer a single piece of evidence to show this is what the founders actually intended. I am not willing to accept that the founders concealed their true thoughts on this view so completely from us&#8212;while founders like Coxe chose to make direct statements of opinion to the contrary. To me the &#8220;militia arms only&#8221; view asks me&#8212;some 200+ years after the fact&#8212;to get out the &#8220;Ouiji board&#8221; and hold it over the Constitution to divine a secret intention of repealing a portion of Article I Section 8, despite the lack of a single statement from a long dead founder saying this is what we meant, and while ignoring those who said &#8220;no we meant an individual RKBA unconnected with militia service.&#8221; I&#8217;m sorry, but I cannot do this.\n \n In the end I say militia arms used to be dependent on the individual RKBA, but Article I Sec. 8 kicked that bird out of the individual right nest. Now militia arms depend exclusively on the whim of Congress, and congressional regulation of the militia therefore has zero impact on the proper scope of the individual RKBA as protected by the 2nd. Amendment and recognized by Heller. \n \n But, that is just my view. Agree or disagree as you see fit....\n\n I don't agree with the claim that personally owned guns were entirely divorced from militia service. In fact, the Militia Act of 1792 required a man to purchase his own gun for militia service. It seems odd that a Congress in power just a few years after the ratification of the Constitution would fail to recognize this as a violation of Article 1 if it were indeed a violation. \n \n Elbridge Gerry said about the proposed conscientious objector clause:\n &#8220;I am apprehensive that this clause would give an opportunity to the people in power to destroy the constitution itself. They can declare who are the religiously scrupulous, and prevent them from bearing arms.\" \n \n And later on he is paraphrased as saying,\n \"Now, if we give a discretionary power to exclude those from militia duty who have religious scruples, we may as well make no provision on this head. For this reason, he wished the words to be altered so as to be confined to persons belonging to a religious sect scrupulous of bearing arms.\"\n Amendment II: House of Representatives, Amendments to the Constitution\n \n Notice that \"prevent them from bearing arms\" and \"exclude those from militia duty\" are used interchangeably. Gerry was afraid that such a clause would grant Congress absolute power over who was in the militia and who was not. Congress could simply claim someone was religiously scrupulous and then \"prevent them from bearing arms\". It doesn't seem likely that Gerry was worried about Congress using the the conscientious objector clause to prevent people from toting guns around for their own own private purposes. He was concerned with having an effective militia which concern is later echoed by Scott who fears that \"a militia can never be depended upon\" if large numbers of people are excluded from militia duty because of the conscientious objector clause.", 
   {}, 
   410147, 
   null, 
   1282536300.0
  ], 
  [
   410550, 
   null, 
   "Doc Jones", 
   "Webster seems to be expressing the idea that the fact that the militia is composed of the people themselves serves as a natural check on government power. Kind of like how a jury is composed of the people which serves as a protection against corrupt courts.\n \n \n I don't agree with the claim that personally owned guns were entirely divorced from militia service. In fact, the Militia Act of 1792 required a man to purchase his own gun for militia service. It seems odd that a Congress in power just a few years after the ratification of the Constitution would fail to recognize this as a violation of Article 1 if it were indeed a violation. \n \n Elbridge Gerry said about the proposed conscientious objector clause:\n \"I am apprehensive that this clause would give an opportunity to the people in power to destroy the constitution itself. They can declare who are the religiously scrupulous, and prevent them from bearing arms.\" \n \n And later on he is paraphrased as saying,\n \"Now, if we give a discretionary power to exclude those from militia duty who have religious scruples, we may as well make no provision on this head. For this reason, he wished the words to be altered so as to be confined to persons belonging to a religious sect scrupulous of bearing arms.\"\n Amendment II: House of Representatives, Amendments to the Constitution\n \n Notice that \"prevent them from bearing arms\" and \"exclude those from militia duty\" are used interchangeably. Gerry was afraid that such a clause would grant Congress absolute power over who was in the militia and who was not. Congress could simply claim someone was religiously scrupulous and then \"prevent them from bearing arms\". It doesn't seem likely that Gerry was worried about Congress using the the conscientious objector clause to prevent people from toting guns around for their own own private purposes. He was concerned with having an effective militia which concern is later echoed by Scott who fears that \"a militia can never be depended upon\" if large numbers of people are excluded from militia duty because of the conscientious objector clause.\n\n \n Heller and McDonald!! 1) A personal, individual RIGHT\n 2) Incorporated against all levels of government\n \n END OF STORY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! emoticon_xhoho", 
   {
    "unicode_changes_made": true
   }, 
   410531, 
   null, 
   1282563960.0
  ], 
  [
   410557, 
   null, 
   "Tither", 
   "Galileo, you act like the 14th Amendment was not passed, which the need for the 14th was that  Freed Blacks were prevented from owning arms! Which, by the way, set straight the truth about your Scam on the 2nd Amendment forever! \n \n What, are you claiming that they did not required Militia Duty for Freed citizens or something? Maybe they didn't know about your scam, I mean your argument, back then! They somehow must have been exempt or something? emoticon_smile Galileo, your argument does not even pass the smell test! \n \n Given the 14th Amendment, the facts are that the 2nd Amendment, Individual Right, was proposed, passed, and ratified, not only once, but now twice. If this were not a FACT, that the Right to Keep and Bear Arms was an Individual Right, the 14th Amendment would have been totally unnecessary, and NEVER PROPOSED! \n \n You continually deny that the   Heller and McDonald cases were decided  by the Supreme Courts! And not in favor of your argument.\n \n But you especially ignore Hamilton's very own  description of a Well Regulated Militia in Federalist 29 here.\n \n Yes, the 2nd Amendment is also the final check on the Federal Power, but it is NOT the only purpose for our Inalienable, Constitutionally recognized as protected Right! Which you are doing your best to steal from me/us!  District of Columbia v. Heller (2008) \n Held:\n 1. The Second Amendment protects an individual right to possess a firearm unconnected with service in a militia, and to use that arm for traditionally lawful purposes, such as self-defense within the home.Pp. 2&#8211;53.\n \n (a) The Amendment&#8217;s prefatory clause announces a purpose, but does not limit or expand the scope of the second part, the operative clause. The operative clause&#8217;s text and history demonstrate that it connotes an individual right to keep and bear arms. Pp. 2&#8211;22.\n \n (f) None of the Court&#8217;s precedents forecloses the Court&#8217;s interpretation.\n Neither United States v. Cruikshank, 92 U. S. 542, 553, nor\n Presser v. Illinois, 116 U. S. 252, 264&#8211;265, refutes the individual rights\n interpretation. United States v. Miller, 307 U. S. 174, does not\n limit the right to keep and bear arms to militia purposes, but rather\n limits the type of weapon to which the right applies to those used by\n the militia, i.e., those in common use for lawful purposes. Pp. 47&#8211;54.\n\n \n In light of all of this undeniable proof, don't you worry, even a little bit, about your credibility? Is stealing our Inalienable Right that important to you that you are willing to give up every last shred of decency and credibility?\n \n Maybe you and your ilk can consider going door to door collecting weapons from our citizens, if you feel that strongly about denying our Rights! emoticon_smile Maybe they will show you one of the reasons, but not the only reason, for the 2nd Amendment, and the one you seem to be arguing the most for. A check against someone stealing their Inalienable, Constitutionally recognized as Protected Rights! emoticon_smile\n \n That was just a thought. I was thinking out of the box for a moment! emoticon_smile", 
   {}, 
   410531, 
   null, 
   1282566720.0
  ], 
  [
   410560, 
   null, 
   "Tither", 
   "  The Second Amendment strikes back  \n Even some noted liberal professors admit the obvious. Harvard's Laurence Tribe says, \"The Fourteenth Amendment, which makes parts of the Bill of Rights applicable to the states, reflected a broad agreement that bearing arms was a 'privilege' of each citizen.\" Fellow Harvard liberal law professor Alan Dershowitz agrees, and scolds fellow liberals for twisting the words of the Second Amendment in a way that could come back to haunt them. \"Foolish liberals who are trying to read the Second Amendment out of the Constitution by claiming that it's not an individual right or that it's too much of a safety hazard,\" said Dershowitz, \"don't see the danger of the big picture.\" He added, \"They're courting disaster by encouraging others to use the same means to eliminate portions of the Constitution they don't like.\" \n", 
   {}, 
   410557, 
   null, 
   1282566960.0
  ], 
  [
   410610, 
   null, 
   "Bryan", 
   " Webster seems to be expressing the idea that the fact that the militia is composed of the people themselves serves as a natural check on government power. Kind of like how a jury is composed of the people which serves as a protection against corrupt courts. \n\n \n We will have to agree to disagree here.\n \n \n I don't agree with the claim that personally owned guns were entirely divorced from militia service. In fact, the Militia Act of 1792 required a man to purchase his own gun for militia service. It seems odd that a Congress in power just a few years after the ratification of the Constitution would fail to recognize this as a violation of Article 1 if it were indeed a violation. \n\n \n Ah, but I do not claim that the Militia Act of 1792 was a violation of Article I section 8. It was a congressional exercise of the power granted to it under the article. As I said:\n \n &#8220;Now Congress was given total power to impose uniformity over militia arms, and the individual RKBA was absolutely excluded from the militia context (absent Congress consenting to or passing laws to continue the old practice&#8212;which it could do if it wanted to)&#8221;\n \n This is exactly what Congress did with the Militia Act. With the Militia Act Congress merely chose to exercise its total Article I Sec. 8 control over militia arms by choosing (for the time being) to continue the prevailing system&#8212;all at a cost savings to itself (sort of like government today giving my children an extensive list of mandatory school supplies we must provide because government is broke and the schools cannot afford to provide them to my children anymore). Nothing in the 2nd. Amendment deprived Congress of the power to change its mind and abandon the 1792 Militia Act. The supply of militia arms remained at the complete mercy of the whim of Congress. And no constitutional crisis&#8212;no cry of depravation of an individual right to carry private arms in militia service&#8212;occurred when Congress simply changed its mind at a later date and abandoned the 1792 Militia Act. \n \n I think we are confusing the individual RKBA for a lawful purpose and the civic duty of militia service. Although they have been historically connected they are different. Congress could pass the 1792 Militia Act because providing militia arms was never viewed as a right of the people but rather a duty of citizenship which Article I sec 8 gave Congress control over. As you say &#8220;the Militia Act of 1792 required a man&#8221;&#8212;words inconsistent with a man exercising any &#8220;right&#8221; and consistent with a congressionally imposed &#8220;duty.&#8221; In contrast to this duty, the right was to keep and bear arms for a lawful purpose&#8212;and it was never dependent upon the militia duty for existence or justification. (IMO, the RKBA only becomes dependent upon militia duty in the minds of people who dislike guns and feel they can have no legitimate purpose other than within militia service. But there is not one single founder who ever expressed that restrictive view of firearm ownership.)\n \n The individual RKBA pre-existed the Constitution. Before Article I Sec 8 the practice was to draw upon that individual right when arming the militia&#8212;and when the Constitution was adopted Congress was given the power to continue or abolish that practice. But Congress was given power over the militia duty only and not the broader pre-existing RKBA. In one sense the obligation of militia service remained unchanged. It was a civic responsibility&#8212;a duty&#8212;before the Constitution was adopted, and it remains a civic duty even to this date. The Constitutional change was made by giving Congress complete control over the duty. And I admit I&#8217;m subject to that duty today. Congress could command me to appear today for militia service. Congress could exercise its power under Article I Sec. 8 by providing me a weapon of its choice, or it could command me to purchase a weapon of its choice at my expense, or it could even tell me to show up and bring a particular firearm I own. In each event it would be my duty to comply. IMO the fallacy comes from the belief that this power over the civic duty has somehow allowed Congress to swallow and abolish the individual RKBA for a lawful purpose outside of militia service&#8212;that because Congress has supplanted the individual right as the provider of militia arms then the individual right is abolished. This argument is akin to suggesting that when Congress repealed the Militia Act of 1792 it abolished the individual RKBA&#8212;and that Congress could give the RKBA back simply by reenacting a new version of the 1792 Militia Act. I can find no founder who suggests Congress should be given power to turn on and off &#8220;individual rights&#8221; like tap water. \n \n \n Elbridge Gerry said about the proposed conscientious objector clause:\n &#8220;I am apprehensive that this clause would give an opportunity to the people in power to destroy the constitution itself. They can declare who are the religiously scrupulous, and prevent them from bearing arms.\" \n \n And later on he is paraphrased as saying,\n \"Now, if we give a discretionary power to exclude those from militia duty who have religious scruples, we may as well make no provision on this head. For this reason, he wished the words to be altered so as to be confined to persons belonging to a religious sect scrupulous of bearing arms.\"\n Amendment II: House of Representatives, Amendments to the Constitution\n \n Notice that \"prevent them from bearing arms\" and \"exclude those from militia duty\" are used interchangeably. Gerry was afraid that such a clause would grant Congress absolute power over who was in the militia and who was not. Congress could simply claim someone was religiously scrupulous and then \"prevent them from bearing arms\". It doesn't seem likely that Gerry was worried about Congress using the conscientious objector clause to prevent people from toting guns around for their own own private purposes. He was concerned with having an effective militia which concern is later echoed by Scott who fears that \"a militia can never be depended upon\" if large numbers of people are excluded from militia duty because of the conscientious objector clause. \n\n \n I disagree. Gerry was not afraid that the proposed Amendment would grant Congress absolute power over who was in the militia and who was not. Gerry was complaining that Congress already had this power and the proposed Amendment did nothing to correct this imbalance. Your source goes on to quote him further: \n \n &#8220;Mr. Gerry objected to the first part of the clause, on account of the uncertainty with which it is expressed. A well regulated militia being the best security of a free State, admitted an idea that a standing army was a secondary one. It ought to read, \"a well regulated militia, trained to arms;\" in which case it would become the duty of the Government to provide this security, and furnish a greater certainty of its being done.&#8221; (bold emphasis added)\n \n Gerry is aware that Article I Sec. 8 gives Congress total power over the militias (save officer appointment)&#8212;and the power to chose to rely upon either a militia or its power to create a standing army. We know from other writings that Gerry passionately believed in the principle of avoiding standing armies and relying on militias. Gerry agrees that the militia preamble is a positive statement of this principle. But Gerry clearly does not like the militias being at the mercy of Congress, and he wishes to change the militia preamble to make it become more than a statement of principle and instead place an affirmative duty of government to rely upon militias. \n \n This proposed change is an admission by Gerry of what I have said earlier&#8212;that the Amendment as then written (and later adopted) does nothing to limit Congress&#8217; power over the militias&#8212;how many members, who can be a member, how they are armed, etc. This in turn makes the &#8220;militia only&#8221; RKBA a &#8220;right&#8221; that exists only at the whim of Congress. \n \n In contrast, Gerry&#8217;s proposed rewrite of the militia preamble would have been a radical transition away from the Constitution&#8217;s status quo&#8212;and would have been the \"repeal\" of a part of Article I Sec.8, a grant of power in Article I Sec 8 over the militias now amended to require a congressional duty to create and maintain an effective militia. And it is significant to me that he made this motion (which also failed) after he failed to strike the CO clause&#8212;for it puts into context his earlier argument against the CO clause. He knows when he makes his objection to the CO clause that Congress has the sole power to choose who can be excluded from a militia. Under these circumstances, If you also attach to the Constitution another statement of principle &#8220;but no person religiously scrupulous shall be compelled to bear arms&#8221; then you give Congress encouragement to use its unlimited power to write anyone (and as many people as) it wants out of militia service&#8212;providing Congress with a Constitutional justification for saying &#8220;we need a professional army because we think too many people are actually COs and we can&#8217;t enroll enough people to form an effective militia.&#8221; \n \n In short, Gerry is not talking about the second part of the Amendment&#8212;the individual right to keep and bear arms. He is instead focusing on the deficiency of the militia preamble to correct what he sees as the danger of absolute congressional control over the militia being coupled with language that gives Congress an excuse to use that power arbitrarily to destroy the militia. His argument is this: If you are going to allow Congress to retain the complete power to choose who can be in a militia then you had better not give Congress an excuse to exclude people from it unless you want Congress to use that excuse to destroy the militia. Or, to put it another way, since you refuse to listen to me and you want to keep the CO clause then you had better amend the militia preamble to change it from a statement of principle into a duty to force Congress to rely upon a militia&#8212;because if you don&#8217;t then there is nothing to prevent Congress from using the CO clause to declare the militia dead.\n \n In no part of this history do we see Gerry hinting that the subsequent phrase &#8220;the right of the people to keep and bear arms shall not be infringed&#8221; recognized only a right to bear arms in militia service&#8212;or that the broader individual RKBA is somehow dependent upon the militia preamble or in any way under the control of Congress. And, if you turn further to Mr. Scott then you see the clear train of thought being carried further. I agree, as you have quoted, that Scott says &#8220;&#8230;&#8220;for a militia can never be depended upon.&#8221; He further agrees with Gerry that if the CO clause remains then Congress could arbitrarily declare not enough men are left to for an effective militia, and he further says &#8220;and in this case recourse must be had to a standing army.&#8221; But we cannot exclude what Scott says between your quote and mine, which is this (from your source):\n \n &#8220;&#8230;for a militia can never be depended upon. This would lead to the violation of another article in the constitution, which secures to the people the right of keeping arms, and in this case recourse must be had to a standing army.&#8221; (bold emhasis added)\n \n We talk a great deal of &#8220;bearing arms,&#8221; and when talking about COs we see both men are speaking of militia service. But, as Mr. Scott points out, the amendment is not &#8220;bear arms&#8221; but &#8220;keep and bear arms&#8221;&#8212;which recognizes the right is far greater than simply bearing arms in the discharge of the militia duty. \n \n And so I stand by my argument that Article I Sec 8 gave Congress the power over the militia sword, and that Congress has absolute power to divorce the individual RKBA from the militia duty that once depended upon it for a source of arms (and Congress has done so). I continue to argue that the Amendment did nothing to alter this balance of power despite Gerry&#8217;s arguments that it should be changed to do so. Instead, the Amendment as adopted merely stated the principle that Congress should rely upon a militia system (over the &#8220;it should be a duty of Congress&#8221; objection of Gerry), and (as Scott argues) it recognized that Congress&#8217; power over the militia did not give it power over the broader individual RKBA. \n \n I see nothing here that is inconsistent with the 2nd. Amendment recognized individual RKBA unconnected with militia service.", 
   {
    "post_info": {
     "post_title": "The 1792 Militia Act, Gerry, and Scott"
    }
   }, 
   410560, 
   null, 
   1282598160.0
  ], 
  [
   410862, 
   null, 
   "Galileo", 
   "Galileo, you act like the 14th Amendment was not passed, which the need for the 14th was that  Freed Blacks were prevented from owning arms! Which, by the way, set straight the truth about your Scam on the 2nd Amendment forever!\n \n What, are you claiming that they did not required Militia Duty for Freed citizens or something? Maybe they didn't know about your scam, I mean your argument, back then! They somehow must have been exempt or something? emoticon_smile Galileo, your argument does not even pass the smell test!\n\n I don't see a coherent argument here- just another one of your scams. The fact that freed slaves participated in the militia after the Civil War does not mean that the militia was not regulated by the government. \n \n \n\n Given the 14th Amendment, the facts are that the 2nd Amendment, Individual Right, was proposed, passed, and ratified, not only once, but now twice. If this were not a FACT, that the Right to Keep and Bear Arms was an Individual Right, the 14th Amendment would have been totally unnecessary, and NEVER PROPOSED! \n \n You continually deny that the   Heller and McDonald cases were decided  by the Supreme Courts! And not in favor of your argument.\n\n Total straw man arguments. I've never claimed that Heller and McDonald are not Supreme Court rulings. I've never claimed these rulings agree with my position. \n \n \n\n But you especially ignore Hamilton's very own  description of a Well Regulated Militia in Federalist 29 here.\n\n You conveniently ignore the fact that Article 1 of the Constitution supersedes what Hamilton said about the regulation of the militia. \n \n \n\n Yes, the 2nd Amendment is also the final check on the Federal Power, but it is NOT the only purpose for our Inalienable, Constitutionally recognized as protected Right! Which you are doing your best to steal from me/us!  District of Columbia v. Heller (2008) \n\n Total bull. Heller considered the focus of the right to be on self defense against intruders not as a right to rebel against the federal government as happened in the Civil War. \n \n \n\n In light of all of this undeniable proof, don't you worry, even a little bit, about your credibility? Is stealing our Inalienable Right that important to you that you are willing to give up every last shred of decency and credibility?\n \n Maybe you and your ilk can consider going door to door collecting weapons from our citizens, if you feel that strongly about denying our Rights! emoticon_smile Maybe they will show you one of the reasons, but not the only reason, for the 2nd Amendment, and the one you seem to be arguing the most for. A check against someone stealing their Inalienable, Constitutionally recognized as Protected Rights! emoticon_smile\n \n That was just a thought. I was thinking out of the box for a moment! emoticon_smile\n\n And maybe you can go door to door shooting people if you feel so strongly about your claims.", 
   {}, 
   410557, 
   null, 
   1282873560.0
  ], 
  [
   410863, 
   null, 
   "Galileo", 
   "The author of this 700+ page thoroughly researched book, No Guarantee of a Gun: How and Why the Second Amendment Means Exactly What It Says, contacted me and says he wants to get the word out about this new book. He says the book proves that the Supreme Court was wrong in Heller. Just letting you know.", 
   {}, 
   410862, 
   null, 
   1282873920.0
  ], 
  [
   410864, 
   null, 
   "Sandycane", 
   "The author of this 700+ page thoroughly researched book, No Guarantee of a Gun: How and Why the Second Amendment Means Exactly What It Says, contacted me and says he wants to get the word out about this new book. He says the book proves that the Supreme Court was wrong in Heller. Just letting you know.\n\n \n Pardon me, just browsing...but, I have a question about this statement:\n \n He says the book proves that the Supreme Court was wrong in Heller.\n \n Now I know less than nothing about this subject but the first thing that came to mind was, 'So what?'\n Isn't a Supreme Court decision like a referee call in a ball game - even if you don't agree and it is proven on instant replay that it is wrong, it stands as called and tough noogies to the one who objects?\n \n Btw, I always thought that 'the right to bare arms' had to do with both the initiation by the State of a civilian militia in the case of an emergency and as a right of the citizens to protect themselves and their property and from a corrupt government.", 
   {}, 
   410863, 
   null, 
   1282876920.0
  ], 
  [
   410870, 
   null, 
   "NATO 556", 
   "I don't see a coherent argument here- just another one of your scams. The fact that freed slaves participated in the militia after the Civil War does not mean that the militia was not regulated by the government.\n\n \n You've conveniently ignored every single request and demand to prove that there was some law written somewhere, that gave the federal government absolute authority to regulate ALL privately owned firearms under militia guidelines. Either prove your case or give it up!\n \n Militia service was never, ever, under any circumstances, and prerequisite necessary for people to be able to legally exercise their constitutionally protected rights. And you can't prove otherwise. So until you do it's a matter of established principle in this debate that privately owned firearms couldn't be touched by the militia laws.\n \n Prove otherwise or drop it.\n \n \nYou conveniently ignore the fact that Article 1 of the Constitution supersedes what Hamilton said about the regulation of the militia.\n\n \n And you conveniently ignore the fact that there are no Supreme Court cases that support anything you say.\n \n Nowhere has it been shown, by you or anyone else, that militia service was a requirement before you could own a gun. For your argument to have any weight it would mean that anyone over 46, and anybody who was a woman, was denied the ability to own a firearm for the rest of their lives and there was absolutely nothing they could do about it.\n \n The Second Amendment isn't about a right to serve in the militia as a government owned slave.\n \n \nTotal bull. Heller considered the focus of the right to be on self defense against intruders not as a right to rebel against the federal government as happened in the Civil War.\n\n \n The Supreme Court said we have a right to own guns for any and all lawful purposes. That's the long and short of it. Defense inside the home was just the selected example, not the whole measure of the extent of the right. You lost that argument, get over it.\n \n We have a right to defend ourselves against ALL enemies, be they foreign or domestic.", 
   {}, 
   410862, 
   null, 
   1282879440.0
  ], 
  [
   410871, 
   null, 
   "NATO 556", 
   "The author of this 700+ page thoroughly researched book, No Guarantee of a Gun: How and Why the Second Amendment Means Exactly What It Says, contacted me and says he wants to get the word out about this new book. He says the book proves that the Supreme Court was wrong in Heller. Just letting you know.\n\n \n I looked up the author, but found nothing. The only John Massaros I'm finding are a guitarist, a former marine, and an opera composer. None of which has written the book you're advertising.\n \n Regardless of who the author is, it doesn't matter. The Supreme Court has final say on matters of the law, not some no-name author with an opinion. Supreme Court rulings are final, you have no authority to disregard them and carry on like it's business as usual. You don't get to say \"I don't like that ruling so I'm going to ignore it and pretend it was never made\". Settled law is just that, settled law. And all government agents and organizations are bound by it.\n \n No matter what you or anyone else says, this matter was settled in Heller and McDonald. We have a constitutionally right to be armed, that right protects every single lawful use, regardless of what that use might be. Neither you, your latest precious author, or any .org has the ability to change that fact or make it mean anything else.\n \n We've established a beachhead of victory. A long fought battle to prove that what we've been saying for so many decades was the undeniable proof. We've succeeded. And now that we have this beachhead we're going to push harder than ever to assure that victory is permanent in nature.\n \n If you don't like that fact then feel free to move to Afghanistan, Africa, Germany, China or some other country where the government tells you what rights you can have, when you can have them, when they don't apply because it's Tuesday, and that you have to have papers to move from one area of town to another.", 
   {}, 
   410863, 
   null, 
   1282880100.0
  ], 
  [
   410946, 
   null, 
   "Galileo", 
   "Pardon me, just browsing...but, I have a question about this statement:\n \n He says the book proves that the Supreme Court was wrong in Heller.\n \n Now I know less than nothing about this subject but the first thing that came to mind was, 'So what?'\n Isn't a Supreme Court decision like a referee call in a ball game - even if you don't agree and it is proven on instant replay that it is wrong, it stands as called and tough noogies to the one who objects?\n \n Btw, I always thought that 'the right to bare arms' had to do with both the initiation by the State of a civilian militia in the case of an emergency and as a right of the citizens to protect themselves and their property and from a corrupt government.\n\n Well, I certainly don't agree with the blind faith that people like Nato put in Supreme Court rulings. That kind of dark age thinking is a true obstacle to progress. In 1633, Galileo was convicted of heresy because he said that the Earth revolved around the sun and spent the rest of his life under house arrest. The court in Rome that tried him had the legal authority to decide what was right and wrong just like the Supreme Court does today about certain matters. The Natos of that day would have told people like me, \"Shut up. The court said Galileo is wrong so he is wrong.\" In Plessy v. Ferguson, the Supreme Court upheld segregation as being constitutional. Again, the Natos of that day would have told people like me, \"Shut up. The court said segregation is constitutional so it is.\"", 
   {
    "unicode_changes_made": true
   }, 
   410864, 
   null, 
   1283024580.0
  ], 
  [
   410948, 
   null, 
   "NATO 556", 
   "Well, I certainly don't agree with the blind faith that people like Nato put in Supreme Court rulings. That kind of dark age thinking is a true obstacle to progress. In 1633, Galileo was convicted of heresy because he said that the Earth revolved around the sun and spent the rest of his life under house arrest. The court in Rome that tried him had the legal authority to decide what was right and wrong just like the Supreme Court does today about certain matters. The Natos of that day would have told people like me, \"Shut up. The court said Galileo is wrong so he is wrong.\" In Plessy v. Ferguson, the Supreme Court upheld segregation as being constitutional. Again, the Natos of that day would have told people like me, \"Shut up. The court said segregation is constitutional so it is.\"\n\n \n This is no excuse for you deciding to rebel against society. There are laws and rules that we all have to abide by if we're going to live in a society. Even if you don't like them you have to abide by them. And one of those rules is that the Supreme Court has final say. If you don't like it then too bad, you're out of options. The legislature makes the laws. The courts determine the scope of the laws. And the people abide by the laws. And you, just like everyone else, has to abide by the rulings of Heller and McDonald. Period. That's your only option. This isn't multiple choice.\n \n Meanwhile you've been making two highly contradictory arguments, yet again.\n \n One argument is that the Second Amendment protected a right of the people to protect itself against a tyrannical federal government, and absolutely nothing else.\n \n The other argument is that nothing in the Constitution suggests that the people have a right to rebel against the government.\n \n So how exactly can the people use the Second Amendment to protect themselves against a tyrannical government, if they have absolutely no right to rebel against said government?\n \n Only one of your arguments can be valid, not both. So which argument are you going to stick with?", 
   {
    "unicode_changes_made": true
   }, 
   410946, 
   null, 
   1283030220.0
  ], 
  [
   410951, 
   null, 
   "Tither", 
   "Lets see. On this page we have Laurence Tribe and Alan Dershowitz two Harvard Constitutional law professors, two supreme court decided cases and now we have the U.S. Senate historians saying this: \n 1982   THE RIGHT TO KEEP AND BEAR ARMS -- R E P O R T OF THE SUBCOMMITTEE ON THE CONSTITUTION OF THE COMMITTEE ON THE JUDICIARY UNITED STATES SENATE NINETY-SEVENTH CONGRESS -- SECOND SESSION\n Following the Civil War, the legislative efforts which gave us three amendments to the Constitution and our earliest civil rights acts likewise recognized the right to keep and bear arms as an existing constitutional right of the individual citizen and as a right specifically singled out as one protected by the civil rights acts and by the Fourteenth Amendment to the Constitution, against infringement by state authorities. Much of the reconstruction effort in the South had been hinged upon the creation of \"black militias\" composed of the armed and newly freed blacks, officered largely by black veterans of the Union Army. In the months after the Civil War, the existing southern governments struck at these units with the enactment of \"black codes\" which either outlawed gun ownership by blacks entirely, or imposed permit systems for them, and permitted the confiscation of firearms owned by blacks. When the Civil Rights Act of 1866 was debated members both of the Senate and the House referred to the disarmament of blacks as a major consideration.[54] Senator Trumbull cited provisions outlawing ownership of arms by blacks as among those which the Civil Rights Act would prevent;[55] Senator Sulsbury complained on the other hand that if the act were to be passed it would prevent his own state from enforcing a law banning gun ownership by individual free blacks.[56] Similar arguments were advanced during the debates over the \"anti-KKK act\"; its sponsor at one point explained that a section making it a federal crime to deprive a person of \"arms or weapons he may have in his house or possession for the defense of his person, family or property\" was \"intended to enforce the well-known constitutional provisions guaranteeing the right in the citizen to 'keep and bear arms'.\"[57] Likewise, the debates over the Fourteenth Amendment Congress frequently referred to the Second Amendment as one of the rights which it intended to guarantee against state action.[58] \n\n The 2nd Amendment was not only proposed, passed, then ratified once, but now twice! emoticon_smile\n \n The 14th Amendment kills your argument Dead! The Right to Keep and Bear Arms IS Individual and it is our Right!", 
   {}, 
   410948, 
   null, 
   1283039100.0
  ], 
  [
   410969, 
   null, 
   "Tither", 
   "If anyone still doubts that the 14th Amendment was designed to stop the abuse of government and reaffirm the Right to Keep and Bear Arms, then SNORT THIS! \n \n   The Fourteenth Amendment and the Right To Keep and Bear Arms: The Intent of the Framers \n If African Americans were citizens, observed Chief Justice Taney in Dred Scott v. Sandford,[1] \"it would give to persons of the negro race ... the full liberty of speech ...; to hold public meetings upon political affairs, and to keep and carry arms wherever they went.\"[2] If this interpretation ignores that Articles I and II of the Bill of Rights designate the respective freedoms guaranteed therein to \"the people\" and not simply the citizens (much less a select group of orators or militia), contrariwise Dred Scott followed antebellum judicial thought in recognizing keeping and bearing arms as an individual right[3] protected from both federal and state infringement.[4] The exception to this interpretation were cases holding that the Second Amendment only protected citizens[5] from federal, not state,[6] infringement of the right to keep and bear arms, to provide judicial approval of laws disarming black freemen and slaves.\n \n &#8230;.. b. the civil rights act of 1866\n After the war was concluded, the slave codes, which limited access of blacks to land, to arms, and to the courts, began to reappear in the form of the black codes,[18] and United States legislators turned their attention to the protection of the freedmen. In support of Senate Bill No. 9, which declared as void all laws in the rebel states which recognized inequality of rights based on race, Sen. Henry Wilson (R., Mass.) explained in part: \"In Mississippi rebel State forces, men who were in the rebel armies, are traversing the State, visiting the freedmen, disarming them, perpetrating murders and outrages on them....\"[19] \n (And the Gun Control Minions going into the Wicked Witch of the West&#8217;s castle, singing:  Wo Ye Wo, Gun Control! Wo Ye Wo, Gun Control!)  \n \n When Congress took up Senate Bill No. 61, which became the Civil Rights Act of 1866,[20] Sen. Lyman Trumbull (R., Ill.), Chairman of the Senate Judiciary Committee, indicated that the bill was intended to prohibit inequalities embodied in the black codes, including those provisions which \"prohibit any negro or mulatto from having fire-arms.\"[21] &#8230;. Sen. William Saulsbury (D., Del.) added: \"In my State for many years, and I presume there are similar laws in most of the southern States, there has existed a law of the State based upon and founded in its police power, which declares that free negroes shall not have the possession of firearms or ammunition. This bill proposes to take away from the States this police power....\"  The Delaware Democrat opposed the bill on this basis, anticipating a time when \"a numerous body of dangerous persons belonging to any distinct race\" endangered the state, for \"the State shall not have the power to disarm them without disarming the whole population.\"[22] .. Still, supporters of the bill were soon to contend that arms bearing was a basic right of citizenship or personhood.\n \n And Rep. Josiah B. Grinnell (R., Iowa) complained: \"A white man in Kentucky may keep a gun; if a black man buys a gun he forfeits it and pays a fine of five dollars, if presuming to keep in his possession a musket which he has carried through the war.\"[24] Yet the right of blacks to have arms existed partly as self-defense against the state militia itself, which implied that militia needs were not the only constitutional basis for the right to bear arms.\n \n &#8230;. As debate returned to the Civil Rights Bill, Rep. Henry J. Raymond (R., N.Y.) explained of the rights of citizenship: \"Make the colored man a citizen of the United States and he has every right which you or I have as citizens of the United States under the laws and Constitution of the United States.... He has a defined status; he has a country and a home; a right to defend himself and his wife and children; a right to bear arms....\"[27] Rep. Roswell Hart (R., N.Y.) further states: \"The Constitution clearly describes that to be a republican form of government for which it was expressly framed. A government ... where 'no law shall be made prohibiting a free exercise of religion;' where 'the right of the people to keep and bear arms shall not be infringed;'....\"[28] He concluded that it was the duty of the United States to guarantee that the states have such a form of government.[29]\n Rep. Sidney Clarke (R., Kansas) &#8230;. Sir, I find in the Constitution of the United States an article which declares that \"the right of the people to keep and bear arms shall not be infringed.\" For myself, I shall insist that the reconstructed rebels of Mississippi respect the Constitution in their local laws....[33]\n Clarke added:\n Nearly every white man in that State that could bear arms was in the rebel ranks. Nearly all of their able-bodied colored men who could reach our lines enlisted under the old flag. Many of these brave defenders of the nation paid for the arms with which they went to battle.... The \"reconstructed\" State authorities of Mississippi were allowed to rob and disarm our veteran soldiers....[34](p.72)\n In sum, Clarke presupposed a constitutional right to keep privately held arms for protection against oppressive state militia.\n \n c. the fourteenth amendment\n The need for a more solid foundation for the protection of freedmen as well as white citizens was recognized, and the result was a significant new proposal--the Fourteenth Amendment. A chief exponent of the amendment, Sen. Jacob M. Howard (R., Mich.), referred to \"the personal rights guaranteed and secured by the first eight amendments of the Constitution; such as freedom of speech and of the press; ... the right to keep and bear arms....\"[35] \n George W. Julian (R., Ind.) noted that the act\n Is pronounced void by the jurists and courts of the South. Florida makes it a misdemeanor for colored men to carry weapons without a license to do so from a probate judge, and the punishment of the offense is whipping and the pillory. South Carolina has the same enactments... Cunning legislative devices are being invented in most of the States to restore slavery in fact.[37]\n \n (And the 2nd Amendment references go on, and on, and on, and on, and on!)\n \n In sum, in the understanding of Southern Democrats and Radical Republicans alike, the right to keep and bear arms, like other Bill of Rights freedoms, was made applicable to the states by the Fourteenth Amendment.\n \n The framers of the Fourteenth Amendment and of the civil rights acts of Reconstruction, rather than predicating the right to keep and bear arms on the needs of an organized state militia, based it on the right of the people individually to possess arms for protection against any oppressive force--including racist or political violence by the militia itself or by other state agents such as sheriffs. At the same time, the militia was understood to be the whole body of the people, including blacks. In discussion concerning the Civil Rights Act of 1875, Sen. James A. Alcorn (R., Miss.) defined the militia in these terms: \"The citizens of the United States, the Posse comitatus, or the militia if you please, and the colored man composes part of these.\"[68] Every citizen, in short, was a militiaman. With the passage of the Fourteenth Amendment, the right and privilege individually to keep and bear arms was protected from both state and federal infringement.[69]\n\n Galileo. Do you STILL want to steal our Inalienable Rights from us? Or do you want to admit that the Constitution Recognizes that we have an Inalienable Right to Keep and Bear Arms! It's OK. The readers of this forum already know! You can now admit it now! They know. This is public Record!", 
   {}, 
   410951, 
   null, 
   1283089620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  An Anti-Gunner Must Read", 
  "url": "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14493, 
  "discussion_files": [
   [
    "2267.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-print.html"
   ], 
   [
    "2268.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-11-print.html"
   ], 
   [
    "2269.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-9-print.html"
   ], 
   [
    "2270.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-7-print.html"
   ], 
   [
    "2271.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-5-print.html"
   ], 
   [
    "2272.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-4-print.html"
   ], 
   [
    "2273.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-6-print.html"
   ], 
   [
    "2274.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-8-print.html"
   ], 
   [
    "2275.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-10-print.html"
   ], 
   [
    "2276.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-3-print.html"
   ], 
   [
    "2277.html", 
    "http://www.4forums.com/political/gun-control-debates/14493-anti-gunner-must-read-2-print.html"
   ]
  ], 
  "identifier": 14493
 }
]