[
 [
  [
   411044, 
   null, 
   "Winston Smith", 
   "xxxxxxxxxxxxxxxxxxxxx", 
   {
    "post_info": {
     "post_title": "C'mon guys! Go easy on Easy"
    }
   }, 
   null, 
   null, 
   1283180700.0
  ], 
  [
   411051, 
   null, 
   "Sandycane", 
   "You forgot to mention the church's in Africa who torture innocent children...among other atrocities committed by 'the church' - past and present.", 
   {}, 
   411044, 
   null, 
   1283184420.0
  ], 
  [
   411056, 
   null, 
   "Easyrider", 
   "Now that Archie is gone the only man of the Bible left is the easy rider. \n The same as with Archie, he is an easy picking for the atheists. \n\n \n <Flush<\n \n I've busted your follies for years. You Christ-deniers are like the 450 prophets of Baal that one man and one God absolutely destroyed.\n \n So go get your lunch and your flashlight and some NoDoz, sport. And pray I take it easy on your deluded souls.", 
   {
    "post_info": {
     "post_title": "C'mon guys!  Go easy on Easy."
    }
   }, 
   411044, 
   null, 
   1283187420.0
  ], 
  [
   411067, 
   null, 
   "trebor", 
   "<Flush<\n \n I've busted your follies for years. You Christ-deniers are like the 450 prophets of Baal that one man and one God absolutely destroyed.\n \n So go get your lunch and your flashlight and some NoDoz, sport. And pray I take it easy on your deluded souls.\n\n \n You bust yourself more than anybody, and it is such a pity that you do not know the damage you do to bible believers. It's people like you that make the skeptics.", 
   {}, 
   411056, 
   null, 
   1283193180.0
  ], 
  [
   411071, 
   null, 
   "Easyrider", 
   "You bust yourself more than anybody.... \n\n \n <Flush<\n \n You're more deluded than the others. And for somebody who's lining up to be a hot lunch for Satan I would have thought you would be making better arguments.", 
   {}, 
   411067, 
   null, 
   1283193900.0
  ], 
  [
   411081, 
   null, 
   "Sandycane", 
   "I honestly thought Winston was actually defending EZ. \n \n Which is it, Winston? Were you being sarcastic or sincere? \n Hard to tell sometimes.", 
   {}, 
   411071, 
   null, 
   1283197020.0
  ], 
  [
   411090, 
   null, 
   "gansao", 
   "Why start a thread just to a member of the forum?\n What a pathetic little tool whiney is!", 
   {}, 
   411081, 
   null, 
   1283200260.0
  ], 
  [
   411144, 
   null, 
   "Sandycane", 
   "I am not defending easy's beliefs, he is a nasty person, but pathetic nevertheless and as I said easy picking for the bullies. Just leave the guy alone and get your kicks out of something else.\n So, my assumption was right - you were being sincere. How sweet, EZ has a bodyguard.:p\n \n \nIf the answers science give you are enough for you and you have no other questions, then, it is fine with me.\n I have plenty of questions...I just don't accept an invisible, reclusive, psychotic, sadistic 'god' as the answer to any of them.\n \n \nAt least eazy clutching his Bible attempts to trascend this life. He won't succeed but at least he seems to intuit that what we see is not all what we get, i.e. there is something more beyond the reach of science.\n What a pathetic description. I prefer the sciences and proven facts. Speculating about what happens after you die is a fine way to pass the time but, don't confuse it with reality. Witnessing what happens to every other life form on the planet is proof enough for me to what happens to humans after death - who are after all biologically like any other animal except for our ability to communicate out loud. ...Your body will decay and rot, unless you are cremated. There is absolutely no evidence that anything else lives on after death. No big deal, times up, that's it, game over. Very good reason, though to do the best you can with what you have while you are here. Religious folk behave out of fear of punishment after death. I do it for a love of life.\n \n How do you know other life forms don't communicate with each other using ESP? You don't. We can speculate that they do, just as we can speculate that an invisible being using ESP can communicate with us....but, there is no proof of either being a part of reality.\n \n \nBut, maybe I am wrong about eazy and archie, they are simply scared shi^less of dying.\n\n You really think so? I think they are afraid of living.;)\n \n Death is a natural part of living, our time is up and it's passed on to the next generation to do what they will.\n Hoping for the destruction of the world so you can come back and relive your life for all eternity drooling at the feet of an invisible being is, at the least, being selfish. It's also lunacy.\n \n On the one hand, you have science and humanity striving to make the world a better place for countless generations and trying to ensure the human race continues forever.\n On the other, you have the religious who can't wait for the destruction of the planet, get elated every time there is a natural or man made disaster thinking the End Time is near, hoping they will be floated off the planet to be with their god and everyone else will be sent to The Pit for eternal torture.\n \n Hmmm... which one makes the most sense? :xbanghead", 
   {}, 
   411081, 
   null, 
   1283228400.0
  ], 
  [
   411154, 
   null, 
   "snakespit", 
   "Easy brings it on himself, and in that light, he deserves no mercy. \n \n If Easy simply held personal beliefs and left it at that, I agree that he should be left alone. However, that is certainly not the case. Easy uses his personal beliefs as a justification to dictate what others can/should be allowed to do. Easy understands perfectly well that not everyone holds his beliefs, he just chooses to believe that his beliefs are superior to all others except those who are in lock-step with him. I for one will never give Easy or anyone like him safe harbour and sit idly by while he attempts to trample the rights and freedoms of others.", 
   {}, 
   411144, 
   null, 
   1283265600.0
  ], 
  [
   411179, 
   null, 
   "gansao", 
   "Easy brings it on himself, and in that light, he deserves no mercy. \n \n If Easy simply held personal beliefs and left it at that, I agree that he should be left alone. However, that is certainly not the case. Easy uses his personal beliefs as a justification to dictate what others can/should be allowed to do. Easy understands perfectly well that not everyone holds his beliefs, he just chooses to believe that his beliefs are superior to all others except those who are in lock-step with him. I for one will never give Easy or anyone like him safe harbour and sit idly by while he attempts to trample the rights and freedoms of others.\n\n What the hell are you on about?\n He posts his beliefs on a political forum, often repeating answers to the same questions that you and the anti Easy brigade ask.\n He is in no position to ' dictate ' to anyone.\n \n HE believes his views are superior does he? Then he is not alone\n \n There is no need for this thread , I can expect it from Winston, he posts rubbish on this forum and when he gets his arse kicked ,he announces that he is going to leave the forum then comes back later .\n At least Easy holds his ground.\n You're worth more than this snakespit..at least I thought you was.", 
   {}, 
   411154, 
   null, 
   1283286960.0
  ], 
  [
   411187, 
   null, 
   "snakespit", 
   "What the hell are you on about?\n He posts his beliefs on a political forum, often repeating answers to the same questions that you and the anti Easy brigade ask.\n He is in no position to ' dictate ' to anyone.\n\n He continuously uses his religious beliefs as an excuse to advocate oppression. And I am not anti-Easy, I am anti-bigot. It's a fine, often blurry line. \n \n \nHE believes his views are superior does he? Then he is not alone\n\n In a sense, we all hold our personal beliefs to be superior to others...perhaps superior was not the right word. My problem with Easy is that he believes that his beliefs should supercede the beliefs of others, and that he is in a position of superiority (here we go again) in which he can dictate (or suggest if you rather) what others should or should not be allowed to do. \n \n Example: gays.\n \n Easy believes that the bible says that homosexuality is a sin, and against the word of god. If Easy were simply to say that he does not condone or practice homosexuality, I would have no problem with it. But that is not what Easy does. Easy says 'it's against god and the bible, I believe in god and the bible, therefore everyone should think and do the same as me even if they do not believe in god or the bible'. \n \n He has demonstrated this line of (il)logic plenty of times, I'm sure I don't need to point them out to you. Easy does not seem to recognize that other people have the choice to decide what is personally right for them. When Easy ceases advocating bigotry, I will cease to call him on it. Until then...", 
   {}, 
   411179, 
   null, 
   1283289360.0
  ], 
  [
   411191, 
   null, 
   "gansao", 
   "He continuously uses his religious beliefs as an excuse to advocate oppression. And I am not anti-Easy, I am anti-bigot. It's a fine, often blurry line. \n \n \n In a sense, we all hold our personal beliefs to be superior to others...perhaps superior was not the right word. My problem with Easy is that he believes that his beliefs should supercede the beliefs of others, and that he is in a position of superiority (here we go again) in which he can dictate (or suggest if you rather) what others should or should not be allowed to do. \n \n Example: gays.\n \n Easy believes that the bible says that homosexuality is a sin, and against the word of god. If Easy were simply to say that he does not condone or practice homosexuality, I would have no problem with it. But that is not what Easy does. Easy says 'it's against god and the bible, I believe in god and the bible, therefore everyone should think and do the same as me even if they do not believe in god or the bible'. \n \n He has demonstrated this line of (il)logic plenty of times, I'm sure I don't need to point them out to you. Easy does not seem to recognize that other people have the choice to decide what is personally right for them. When Easy ceases advocating bigotry, I will cease to call him on it. Until then...\n\n \n You can and have argued with Easy over these points.\n Easy sees the bible as the word of God and his interpretation as the true one.\n You and others are quite capable of taking him on and exposing the flaws that you find in his posts.\n You do not need to subscribe to Winston's trolling thread to make this point.", 
   {}, 
   411187, 
   null, 
   1283290680.0
  ], 
  [
   411216, 
   null, 
   "Sandycane", 
   "There were several points in my opening statement which I didn't separate clearly, using 'bullets' for instance, for I abhor power point type of presentations, but, here we go:\n \n 1) It is easy to demolish any Biblical \"science\" in regard to the Creation and miracles and Jesus being the son of God, resurrections etc and even the existence of the Biblical God itself for there is no proof of any of the above. So laughing and mocking Easy is akin to mocking a child who believes in the existence of Santa Claus or the Tooth Fairy. In the same way that it is cruel to mock a child it is cruel to pick on Easy. It is specially cruel to mock Easy because easy will never outgrow his beliefs, which are all he has to make it thru life, whereas every child eventually ceases to believe in fairies.\n \n 2) He acts according to what he believes in. His interpretation of the Bible is coloured by his prejudices, hates, and fears. This I don't deny. However who doesn't interpret the Bible to his own convenience?\n \n 3) Christianity has given us our moral values and when I say Christianity I mean the sum of the Gospels and the Old Testament plus the influence of St Paul who added to it the moral and philosophical values of the Greek civilization. That we haven't lived up to those values is nothing new, but is not the fault of Religion per se. To fail to live by our proclaimed moral principles and then to blame religion for it, it is a bit rich.\n \n 4) Science is reductionist and an undercurrent of nihilism steers this reductionist method. Don't get me wrong, without reductionism you can't have science. Biblical explanations of the world are the opposite and end up in the dead end called God. However scientific reductionism ends up with our hands full of nothing. Just look at the mess string theory is.\n \n 5) Because of science being deterministic and reductionist it cannot explain how life happens to exist, how come that atoms and molecules under certain conditions become eventually alive. There is no 'life' property in the 'substances' studied by Chemistry or Physics. I have asked this question to people such as \"Peeling\" here in this forum and their answer is that the question is 'irrelevant' to science. Any question that science cannot answer is 'irrelevant' to science and by implication to mankind. This head in the sand attitude is necessary for science, I agree, however, this question is important if not the most important question of all. And there are other questions as well, that science has no answer for.\n \n So bottom line, for all the above reasons: live and let live.\n\n \n Very nice presentation, Winston.\n The problem with 'Live and let live' is that the christians and the muslims don't follow this rule and we, the unbelievers have to keep them in their place otherwise we will all be forced to either convert or die.", 
   {
    "unicode_changes_made": true
   }, 
   411191, 
   null, 
   1283312280.0
  ], 
  [
   411250, 
   null, 
   "Ripskar", 
   "Actually I would suggest that Ideologues are the most dangerous people in the world. The moment you start thinking that people can be killed to further an Ideology to whatever ends is the moment you cross a line. Beyond that the numbers become meaningless, Person A is not automatically better than person B because the ethnic groups targeted happen to be bigger or smaller.", 
   {}, 
   411216, 
   null, 
   1283369760.0
  ], 
  [
   411253, 
   null, 
   "Xcaliber", 
   "convert or die? how dramatic! emoticon_rolleyes\n \n The worst case of mass killings we know of was the 30 million or so who died in the Soviet Gulags, government planned famines and forced mass deportations, during the almost a century long totalitarian atheist government of the Soviet Union. The killings peaked during the reign of Big Brother Joseph Stalin. Intellectuals are the most dangerous people in this world, because they are always convinced of the certainty of their beliefs and the rectitude of their actions. The difference between religious believers and secular believers is that the Church can never be accused of doing what Stalin and Hitler and Pol Pot did. \n As long as intellectuals and, pseudo-intellectuals such as 'mata', only commit mental self-masturbation (I love tautology) in the privacy of their ivory towers and forums ('fora' for the Latin pedants) I don't mind. The danger is in when intellectuals are used to serve the purposes of evil people (oil companies and others) to foster their economic interests, or when the intellectuals themselves take matters in their own hands such as when Lenin and Hitler did. \n The Easys and Archies are inoffensive. Peace brothers and sisters.\n WS\n \n I almost forgot, pseudo-intellectuals have no original ideas, they just regurgitate (copy & paste) thoughts of others in what to me appear random fashion. They are entertaining though, for they are laughable.\n\n \n \n \n Atheism itself isn't a principle, cause, philosophy, or belief system which people fight, die, or kill for. Being killed by an atheist is no more being killed in the name of atheism than being killed by a tall person is being killed in the name of tallness.\n People were killed in communist nations for a lot of different reasons. Some were communists who disagreed with those in power and were killed because of that. Some were anti-communists opposed the government and were killed for that. Some were simply in the way or inconvenient and were killed for that. Some were Christians who stood against the communist beliefs and were killed not because they were Christians but because they opposed the communist government. These are political disagreements that people were being killed over, not murder in the name of atheism. \n \n \n \"My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before the fact that it was for this that He had to shed His blood upon the Cross. As a Christian I have no duty to allow myself to be cheated, but I have the duty to be a fighter for truth and justice... And if there is anything which could demonstrate that we are acting rightly it is the distress that daily grows. For as a Christian I have also a duty to my own people.\n \n\n -Adolf Hitler, in a speech on 12 April 1922 (Norman H. Baynes, ed. The Speeches of Adolf Hitler, April 1922-August 1939, Vol. 1 of 2, pp. 19-20, Oxford University Press, 1942)\n\n \n There have in fact been more innocent people slaughtered in this world in the name of a specific religion. Most of those deaths were caused by Christians...", 
   {
    "unicode_changes_made": true
   }, 
   411216, 
   null, 
   1283372340.0
  ], 
  [
   411257, 
   null, 
   "gansao", 
   "Atheism itself isn't a principle, cause, philosophy, or belief system which people fight, die, or kill for. Being killed by an atheist is no more being killed in the name of atheism than being killed by a tall person is being killed in the name of tallness.\n People were killed in communist nations for a lot of different reasons. Some were communists who disagreed with those in power and were killed because of that. Some were anti-communists opposed the government and were killed for that. Some were simply in the way or inconvenient and were killed for that. Some were Christians who stood against the communist beliefs and were killed not because they were Christians but because they opposed the communist government. These are political disagreements that people were being killed over, not murder in the name of atheism. \n \n \n \"My feelings as a Christian points me to my Lord and Savior as a fighter. It points me to the man who once in loneliness, surrounded by a few followers, recognized these Jews for what they were and summoned men to fight against them and who, God's truth! was greatest not as a sufferer but as a fighter. In boundless love as a Christian and as a man I read through the passage which tells us how the Lord at last rose in His might and seized the scourge to drive out of the Temple the brood of vipers and adders. How terrific was His fight for the world against the Jewish poison. To-day, after two thousand years, with deepest emotion I recognize more profoundly than ever before the fact that it was for this that He had to shed His blood upon the Cross. As a Christian I have no duty to allow myself to be cheated, but I have the duty to be a fighter for truth and justice... And if there is anything which could demonstrate that we are acting rightly it is the distress that daily grows. For as a Christian I have also a duty to my own people.\n \n \n There have in fact been more innocent people slaughtered in this world in the name of a specific religion. Most of those deaths were caused by Christians...\n\n \n So according to you the Yorkshire ripper a British serial killer who said that God told him to kill prostitutes was an example of Christian brutality?\n If you SAY you are a Christian and do unchristian acts against others its a crime that we can blame Christianity for?\n You can find many people in history who twisted the Christian message to suit their own greed and blood lust but they were NOT Christians.", 
   {}, 
   411253, 
   null, 
   1283374140.0
  ], 
  [
   411258, 
   null, 
   "Ripskar", 
   "\"No True Scotsman\" -check.", 
   {}, 
   411257, 
   null, 
   1283374980.0
  ], 
  [
   411262, 
   null, 
   "gansao", 
   "\"No True Scotsman\" -check.\n\n \n Absolutely wrong .\n The no true Scotsman fallacy attributes a race of people a character .\n A Christian is a follower and believer in Christ and his teachings.\n His teachings did not include mass murder or war mongering.\n Your check bouncedemoticon_xclown", 
   {}, 
   411258, 
   null, 
   1283375340.0
  ], 
  [
   411263, 
   null, 
   "Ripskar", 
   "Hardly. emoticon_rolleyes", 
   {}, 
   411262, 
   null, 
   1283375640.0
  ], 
  [
   411264, 
   null, 
   "gansao", 
   "Hardly. emoticon_rolleyes\n\n \n Hardly an argumentemoticon_xagree", 
   {}, 
   411263, 
   null, 
   1283376000.0
  ], 
  [
   411265, 
   null, 
   "snakespit", 
   "You can find many people in history who twisted the Christian message to suit their own greed and blood lust but they were NOT Christians.\n\n They weren't? How do you know?", 
   {}, 
   411257, 
   null, 
   1283376120.0
  ], 
  [
   411266, 
   null, 
   "Ripskar", 
   "Hardly an argumentemoticon_xagree\n\n \n By your position the global population of christians = 0.", 
   {}, 
   411264, 
   null, 
   1283376480.0
  ], 
  [
   411267, 
   null, 
   "gansao", 
   "They weren't? How do you know?\n\n \n Because a Christian is not someone who calls themself a Christian.They are people who live by the teachings of Christ.", 
   {}, 
   411265, 
   null, 
   1283376780.0
  ], 
  [
   411268, 
   null, 
   "gansao", 
   "By your position the global population of christians = 0.\n\n \n That is the great question.\n Apparently we are all to be judged by God.\n \n Although your post was meant to mock , it raises quite a good point;)", 
   {}, 
   411266, 
   null, 
   1283377080.0
  ], 
  [
   411270, 
   null, 
   "Sandycane", 
   "Because a Christian is not someone who calls themself a Christian.They are people who live by the teachings of Christ.\n\n \n emoticon_frazzled:p\n So, a well behaved atheist is really a christian but, a christian is not?\n What about a Taoist...are they christian? :p\n \n Is this kind of like that saying, 'If you think you are crazy, you're probably not'? lol", 
   {}, 
   411267, 
   null, 
   1283377680.0
  ], 
  [
   411274, 
   null, 
   "gansao", 
   "emoticon_frazzled:p\n So, a well behaved atheist is really a christian but, a christian is not?\n What about a Taoist...are they christian? :p\n \n Is this kind of like that saying, 'If you think you are crazy, you're probably not'? lol\n\n \n Obviously you would need to believe that Christ existed and was the sacrifice that changed the covenant between man and God.\n \n An athiest does not believe that Christ was divine so cannot be called a Christian..no more than he can be called a Sikh....even if he wears a turban.\n \n \n There may be more than one way to salvation. A Christian follows Christs way as near as he can.\n \n The main 'Christian' churches are not Christian.\n They say they are..but they are not. IMO", 
   {}, 
   411270, 
   null, 
   1283379360.0
  ], 
  [
   411281, 
   null, 
   "trebor", 
   "Absolutely wrong .\n The no true Scotsman fallacy attributes a race of people a character .\n A Christian is a follower and believer in Christ and his teachings.\n His teachings did not include mass murder or war mongering.\n Your check bouncedemoticon_xclown\n\n \n Nope.. it is not just a race, it is a group. \n \n And NO one has been able to tell me how luke 19:27 isn't advocating murder.", 
   {}, 
   411262, 
   null, 
   1283381340.0
  ], 
  [
   411287, 
   null, 
   "gansao", 
   "Nope.. it is not just a race, it is a group. \n \n And NO one has been able to tell me how luke 19:27 isn't advocating murder.\n\n \n Its NOT a group. A SCOTSMAN is a Scottish man.\n Come to the UK and publicly abuse the Scots and you will find out that you are a racist.\n Christians are not a group, a group of people who claim they are Christians are not necessarily ALL Christians.\n If you believe the Bible is the infallible word of God then Luke19.27 is advocating murder but the Bible is NOT the infallible word of God, is it?\n The word of God is there for the finding though....", 
   {}, 
   411281, 
   null, 
   1283382000.0
  ], 
  [
   411292, 
   null, 
   "Sandycane", 
   "Obviously you would need to believe that Christ existed and was the sacrifice that changed the covenant between man and God.\n \n An athiest does not believe that Christ was divine so cannot be called a Christian..no more than he can be called a Sikh....even if he wears a turban.\n \n \n There may be more than one way to salvation. A Christian follows Christs way as near as he can.\n \n The main 'Christian' churches are not Christian.\n They say they are..but they are not. IMO\n\n \n 'Salvation' from what?", 
   {}, 
   411274, 
   null, 
   1283382720.0
  ], 
  [
   411294, 
   null, 
   "gansao", 
   "'Salvation' from what?\n\n \n Good question..if God does not exist then salvation does not either", 
   {}, 
   411292, 
   null, 
   1283384160.0
  ], 
  [
   411311, 
   null, 
   "Ripskar", 
   "Its NOT a group. A SCOTSMAN is a Scottish man.\n Come to the UK and publicly abuse the Scots and you will find out that you are a racist.\n Christians are not a group, a group of people who claim they are Christians are not necessarily ALL Christians.\n If you believe the Bible is the infallible word of God then Luke19.27 is advocating murder but the Bible is NOT the infallible word of God, is it?\n The word of God is there for the finding though....\n\n \n Actually Scots are a Nationality not a race so you would be a nationalist if you were to abuse them.\n Regardless of which the methodology is still a Logical Fallacy.", 
   {}, 
   411287, 
   null, 
   1283390400.0
  ], 
  [
   411315, 
   null, 
   "snakespit", 
   "Because a Christian is not someone who calls themself a Christian.They are people who live by the teachings of Christ.\n\n \n By that rationale, I would say that Easy is certainly not a christian, although I suspect he would disagree. \n \n To the best of my understanding, to be a christian only requires you to believe one thing: -that jesus is your savior. The rest is simply subjective belief. I submit that there are many murderous, greedy, blood-lust filled people who believe that jesus is their savior. Sorry to be the one to break this to you, but there are indeed \"bad christians\" out there. \n \n It comes down to how you personally define a \"christian\"...which again would be subjective.", 
   {}, 
   411267, 
   null, 
   1283391840.0
  ], 
  [
   411316, 
   null, 
   "trebor", 
   "Its NOT a group. A SCOTSMAN is a Scottish man.\n Come to the UK and publicly abuse the Scots and you will find out that you are a racist.\n Christians are not a group, a group of people who claim they are Christians are not necessarily ALL Christians.\n If you believe the Bible is the infallible word of God then Luke19.27 is advocating murder but the Bible is NOT the infallible word of God, is it?\n The word of God is there for the finding though....\n\n \n That is the name of the fallacy..and the use a 'scottsman' as an example.\n \n But, it is not limited to race. It can refer to anything, such as saying someone isn't a 'True Muslim' or a 'True Christian'.\n \n It is a form of the fallacy known as 'begging the question'.", 
   {}, 
   411287, 
   null, 
   1283392380.0
  ], 
  [
   411317, 
   null, 
   "MrWriteLA", 
   "To the best of my understanding, to be a christian only requires you to believe one thing: -that jesus is your savior.\nI think that's a bit too reductionist.\n \n You also have to believe, at the very least, that (a) he was the son of God (implying that you believe there is such a thing as God, and (b) that he died on the cross for your (\"our\") sins and was resurrected.\n \n If he fished me out ocean on the point of drowning, he'd be my savior--but it wouldn't make me a Christian.\n \n Of course, the \"Christians\" on this forum make up their own rules as to what qualifies, and disregard Jesus actual WORDS (which they contrarily insist they literally are) at will. And conveniently, the Bible is so vague and self-contradictory that they can use it to support whatever evil cr@p they want to spew.", 
   {}, 
   411315, 
   null, 
   1283392620.0
  ], 
  [
   411319, 
   null, 
   "snakespit", 
   "I think that's a bit too reductionist.\n \n You also have to believe, at the very least, that (a) he was the son of God (implying that you believe there is such a thing as God, and (b) that he died on the cross for your (\"our\") sins and was resurrected.\n\n \n I meant \"savior\" in a spiritual sense. I figured these 2 points were implied as part of accepting jesus as your savior.", 
   {}, 
   411317, 
   null, 
   1283398500.0
  ], 
  [
   411342, 
   null, 
   "Xcaliber", 
   "1. Christian - relating to or characteristic of Christianity; \"Christian rites\"\n faith, religion, religious belief - a strong belief in a supernatural power or powers that control human destiny; \"he lost his faith but not his morality\"\n 2. christian - following the teachings or manifesting the qualities or spirit of Jesus Christ\n \n According to this dictionary meaning anyone who believes in the invisible man or the Jewish zombie can technically be called a Christian.", 
   {}, 
   411250, 
   null, 
   1283434740.0
  ], 
  [
   411356, 
   null, 
   "MrWriteLA", 
   "From Religious Tolerance, which I heartily recommend to all:\nDefining \"Christian\" as a follower of Jesus is a fairly common one. The problem is that there is no consensus on what Jesus expects of humans. The Bible seems to be quite ambiguous on this point. If you don't believe this, then organize a meeting involving a Roman Catholic, Southern Baptist, Assembly of God member, Jehovah's Witness, ELCA member, Mormon, etc. and ask them to reach a consensus on any topic--e.g. who are saved? It will be quite impossible for them to reach a consensus.[*]Ask a Southern Baptist whether they are a follower of Jesus. The answer will be yes.[*]Ask a Jehovah's Witness whether they are a follower of Jesus. The answer will be yes.[*]As a Southern Baptist whether Jehovah's Witnesses are followers of Jesus. The answer will probably be no.[*]As a Jehovah's Witness whether Southern Baptists are followers of Jesus. The answer will probably be no.. . .[*]there are many dozens of definition of \"Christian\"--perhaps hundreds--in common use. [*]there is no consensus on which is the \"true\" definition, [*]most people are supremely confident that their definition--alone--is the true one.It is like \"God:\"[*]there are many hundreds of definitions of God, including his/her/their/its name, location, attributes, expectations, etc. [*]there is no consensus on what God's name, attributes, etc. are. [*]most people are supremely confident that their definition--alone--is the true one.\nIn my personal experience from many years of visiting this site --which attempts to comprehensively and objectively cover many religion-based topics and issues--that there will always be some \"Christians\" who will throw hissy fits over it for not defining Christianity the way THEY personally do. \n \n But, as the authors repeatedly point out, they merely report the stats, consensuses, quotes and historical records, without judging any particular belief positively or negatively. They simply post facts... many, MANY facts...about a huge number of religious beliefs--not just Christian ones--and support them with (and link to) voluminous on- and off-line citations. But of course, to some Christians, when it comes to facts vs. belief... belief will always be the victor.\n \n Check this site out. I could spend--and have spent, believe me--hours there.", 
   {}, 
   411342, 
   null, 
   1283446740.0
  ], 
  [
   411370, 
   null, 
   "Accipiter", 
   "C'mon guys! Go easy on Easy?\n \n I'm not going to be nicer to him because I think he likes trading insults.\n \n I am sure he probably gets some kind of sick sexual thrill out of it.", 
   {}, 
   411356, 
   null, 
   1283459280.0
  ], 
  [
   411398, 
   null, 
   "Ripskar", 
   "Most ideologues are intellectuals. Hitler was an intellectual wich doesn't mean that he was intelligent and so was Lening. Stalin was just a pragmatic butcher. You opposed him and bang! you ended up in the Gulag. You didn't even need to oppose him to be shot dead. Stalin was just a cruel, sadistic tyrant in the vein of the old Russian tyrants. \n \n The Russian people after centuries of tyranny are acustomed to it, proof of it is that the relatives and friends of those 30 million plus who died under Communism have done nothing to punish the culprits. \n \n Putin is now turning the clock back and becoming another tyrant and only a tiny minority opposes him. Russia will never become a Western style democracy.\n\n \n You focus too much on the leader, it was Himler's underlings who believed in the ideology that did the killing, just as it was the members of NKVD who did the killing under Stalin.", 
   {}, 
   411250, 
   null, 
   1283472480.0
  ], 
  [
   411424, 
   null, 
   "Ripskar", 
   "It was the thugs in the Shutstaffel, the Gestpo and the NKVD who commited the crimes. Who's current fanboyz continue to attack with their own agendas.", 
   {}, 
   411398, 
   null, 
   1283516580.0
  ], 
  [
   411426, 
   null, 
   "pappillion001", 
   "You forgot to mention the church's in Africa who torture innocent children...among other atrocities committed by 'the church' - past and present.\n\n \n I am still pretending to be a defender of the faith so wouldn't blaming the church for Africa be like blaming Britain for BP?", 
   {}, 
   411051, 
   null, 
   1283517000.0
  ], 
  [
   411428, 
   null, 
   "Sandycane", 
   "Right! and it was the Wermacht that invaded Poland, France, the Soviet Union etc. \n \n zzzz there aren't many signs of intelligence in this forum. Apart from 'mental masturbators' such as 'mata' ejaculating the same posts over and over again what's here ?? \n \n Wouldn't it be nice if ... ? Impossible.\n \n emoticon_xbye\n\n \n And the most intelligent post you can offer is 'Don't Pick On EZ'.\n Wouldn't it be nice if... Possible.", 
   {}, 
   411424, 
   null, 
   1283524440.0
  ], 
  [
   411429, 
   null, 
   "Sandycane", 
   "I am still pretending to be a defender of the faith so wouldn't blaming the church for Africa be like blaming Britain for BP?\n\n \n I don't think so...it's more like blaming BP for the rig disaster - which is appropriate.\n BP is responsible for what it's company members and employees do just as 'the church' is responsible for it's members.\n \n If BP is aware of criminal activity by it's members, it is guilty if it does nothing to stop it.\n The same for the church.", 
   {}, 
   411426, 
   null, 
   1283524800.0
  ], 
  [
   411431, 
   null, 
   "Sandycane", 
   "All my posts are intelligent, perhaps too intelligent.\n \n My thread on eazy was not only intelligent but ... Christian. emoticon_xangel\n \n Yes, it would be nice, but alas, impossible.\n \n emoticon_xbye\n\n \n Too bad modesty and humility aren't in your christian bag of tricks, huh?\n Someone needs to stick a pin in that over-inflated ego of yours.\n Maybe you and Didymus can start your own, 'Snooty-tooty, Smarter Than Everyone Else Forums'.", 
   {}, 
   411428, 
   null, 
   1283529540.0
  ], 
  [
   411434, 
   null, 
   "pappillion001", 
   "I don't think so...it's more like blaming BP for the rig disaster - which is appropriate.\n BP is responsible for what it's company members and employees do just as 'the church' is responsible for it's members.\n \n If BP is aware of criminal activity by it's members, it is guilty if it does nothing to stop it.\n The same for the church.\n\n \n Now your getting into legal responsibility. In a civil trial fault can be established as low as 10%. A company may do everything possible to make sure it's employees don't drive drunk but should one do so they are still legally liable but I don't want to use morally responsible but outside of the legality issue is the company at fault? Of course if they toss him one for the road screw em they get what they get and they appreciate it.", 
   {}, 
   411429, 
   null, 
   1283534640.0
  ], 
  [
   411438, 
   null, 
   "Ripskar", 
   "Right! and it was the Wermacht that invaded Poland, France, the Soviet Union etc. \n\n \n The SS etc. went far beyond their orders. The Neo-nazis (despite claiming to be the next generation of the SS they tend to behave more like the SA) certainly aren't receiving orders from the nazi leadership. It is their ideology that makes them dangerous. They remain responsible for their own actions.", 
   {}, 
   411424, 
   null, 
   1283537640.0
  ], 
  [
   411445, 
   null, 
   "Sandycane", 
   "Now your getting into legal responsibility. In a civil trial fault can be established as low as 10%. A company may do everything possible to make sure it's employees don't drive drunk but should one do so they are still legally liable but I don't want to use morally responsible but outside of the legality issue is the company at fault? Of course if they toss him one for the road screw em they get what they get and they appreciate it.\n\n \n To quote Ripskar (speaking of the SS): \n It is their ideology that makes them dangerous. They remain responsible for their own actions.\n \n\n \n This is also true of the christian religious leaders in Africa...however, since they claim to be members of the cristian religion, they do not act as individuals, separate from the church...Especially since what they do is 'in christ's name'.\n It is the responsibility of the church to reprimand any members who are behaving immoral or, anti-christian. It is up to the global community as a whole, being represented by the UN, to legally condemn and punish those who are committing crimes against humanity.\n Since the church is not doing so, one is forced to assume that the church approves.\n We did it for the Jewish people of Germany. Why aren't they stepping in for the children of Africa?\n Could it be because the legal system is afraid to go up against the church?", 
   {}, 
   411434, 
   null, 
   1283549820.0
  ], 
  [
   411497, 
   null, 
   "pappillion001", 
   "To quote Ripskar (speaking of the SS): \n \n This is also true of the christian religious leaders in Africa...however, since they claim to be members of the cristian religion, they do not act as individuals, separate from the church...Especially since what they do is 'in christ's name'.\n It is the responsibility of the church to reprimand any members who are behaving immoral or, anti-christian. It is up to the global community as a whole, being represented by the UN, to legally condemn and punish those who are committing crimes against humanity.\n Since the church is not doing so, one is forced to assume that the church approves.\n We did it for the Jewish people of Germany. Why aren't they stepping in for the children of Africa?\n Could it be because the legal system is afraid to go up against the church?\n\n \n Things like this will always have shades of grey. Do people act contrary to the way they are supposed to, yes. Should the leadership within the organization distance itself from groups that claim affliation but do not conform to doctrine, yes. Should the RCC give the child molesters it protects, yes. \n \n Religion is smoke and mirrors with evidence constantly being shown that long held ideals of faith are based on incorrect information. The fear of just one more daming situation in a long string has them doing the dumbest things. Religion is mostly controlled by older men who have done nothing else and don't know how to do anything else. That pride and ego is a killer combo.\n \n Why this gets hard is the whacko nutjobs are a small % but represent the majority of media coverage. Not that they don't deserve it nor does religion suffer from this by itself. There are some good ones out there\n \n somewhere\n \n aren't there\n they used to be", 
   {}, 
   411445, 
   null, 
   1283569680.0
  ], 
  [
   411502, 
   null, 
   "Sandycane", 
   "Things like this will always have shades of grey. Do people act contrary to the way they are supposed to, yes. Should the leadership within the organization distance itself from groups that claim affliation but do not conform to doctrine, yes. Should the RCC give the child molesters it protects, yes. \n \n Religion is smoke and mirrors with evidence constantly being shown that long held ideals of faith are based on incorrect information. The fear of just one more daming situation in a long string has them doing the dumbest things. Religion is mostly controlled by older men who have done nothing else and don't know how to do anything else. That pride and ego is a killer combo.\n \n Why this gets hard is the whacko nutjobs are a small % but represent the majority of media coverage. Not that they don't deserve it nor does religion suffer from this by itself. There are some good ones out there\n \n somewhere\n \n aren't there\n they used to be\n\n \n :p\n Yes, there are. My father's side of the family (all of them) are Church of Christers. They are all good upstanding members of society (all of them). I'm a self-proclaimed Black Sheep....well, used to be, I've actually turned a very light shade of off-white. ;)\n \n BUT, and a very Big But, why aren't these good christians vocalizing and punishing the bad christians who are giving the good ones a bad name?\n \n They are just like doctors - they protect each other, no matter what the offense.\n My ex had been going to a chiropractor for about a year until one day he came home a cripple and I had to take him to a neurologist who told us in the hospital right after the surgery to repair a ruptured disk, that it was obviously the fault of the chiropractor. When we asked him if he would say this in court, he said absolutely NOT. They stick together like glue.\n \n This is why 'the church' as a whole should be held accountable for the bad actions of it's members. To ignore them is to condone them. IMO.", 
   {}, 
   411497, 
   null, 
   1283572320.0
  ], 
  [
   411512, 
   null, 
   "Ripskar", 
   "I wasn't talking about Neo Nazis.They may have Nazism as a model or an excuse for racist hooliganism but I don't know they have written a new Mein Kampf.\n\n \n There's no need to reinvent the wheel... If they're bright enough to find a copy.emoticon_rolleyes\n \n \nI was simply stating that the idea to exterminate the jews and the order to do it, came from Hitler. That his underlings enthusiastically carried it out does not detract from the fact that no Hitler no Holocaust. That the underlings were responsible for their own actions also doesn't change the fact that those actions were the carrying out of their leader directives.\n\n Along with Slavs, the mentally ill, Gypsies, Tartars, Arabs, French Colonial troops, Soviet Komissars, and various other groups...\n \n \nI strongly recommend your read \"Eichmann in Jerusalem\", for in it there is much to learn about the German mind, their ethics, institutions and bureacracy during the Nazi years\n\n \n I'm a wargamer, I already have an extensive library regarding Germany during '39-'45, next on the to buy list is Tapping Hitler's Generals.", 
   {}, 
   411438, 
   null, 
   1283599440.0
  ], 
  [
   411544, 
   null, 
   "pappillion001", 
   ":p\n Yes, there are. My father's side of the family (all of them) are Church of Christers. They are all good upstanding members of society (all of them). I'm a self-proclaimed Black Sheep....well, used to be, I've actually turned a very light shade of off-white. ;)\n \n BUT, and a very Big But, why aren't these good christians vocalizing and punishing the bad christians who are giving the good ones a bad name?\n \n They are just like doctors - they protect each other, no matter what the offense.\n My ex had been going to a chiropractor for about a year until one day he came home a cripple and I had to take him to a neurologist who told us in the hospital right after the surgery to repair a ruptured disk, that it was obviously the fault of the chiropractor. When we asked him if he would say this in court, he said absolutely NOT. They stick together like glue.\n \n This is why 'the church' as a whole should be held accountable for the bad actions of it's members. To ignore them is to condone them. IMO.\n\n \n It's all centered on an undeserved perception that religious people tend to be more good type people. A part of us wants to believe there are people who are good and they don't have to rely on their own judgment. So when the priest pimps out your daughter, puts pictures of your son on the internet, rapes your dog, steals your truck and collects the insurance after burning down your house you can honestly say you never saw it coming.\n \n I know to us simpletons that taking a stand and distancing an yourself from acts that are detrimental to your existence may cause some initial backlash, but will shield you in the bigger picture makes sense. All I can say is if you can't figure out by now your no good at keeping it a secret then a your an XXXXX and b stop trying to because God has yet to make it all go away.\n \n The insulting language although it does say you is not really you you but my temporary adopted cause you or them but in the you tense :p", 
   {}, 
   411502, 
   null, 
   1283648220.0
  ], 
  [
   411560, 
   null, 
   "Sandycane", 
   "It's all centered on an undeserved perception that religious people tend to be more good type people. A part of us wants to believe there are people who are good and they don't have to rely on their own judgment. So when the priest pimps out your daughter, puts pictures of your son on the internet, rapes your dog, steals your truck and collects the insurance after burning down your house you can honestly say you never saw it coming.\n \n I know to us simpletons that taking a stand and distancing an yourself from acts that are detrimental to your existence may cause some initial backlash, but will shield you in the bigger picture makes sense. All I can say is if you can't figure out by now your no good at keeping it a secret then a your an XXXXX and b stop trying to because God has yet to make it all go away.\n \n The insulting language although it does say you is not really you you but my temporary adopted cause you or them but in the you tense :p\n\n \n Are you a little tipsy tonight...or, am I dense?:p\n I have no idea what you just said.", 
   {}, 
   411544, 
   null, 
   1283657460.0
  ], 
  [
   411562, 
   null, 
   "trebor", 
   "Are you a little tipsy tonight...or, am I dense?:p\n I have no idea what you just said.\n\n \n Don't worry...it doesn't make sense as written.'. it's not you..", 
   {}, 
   411560, 
   null, 
   1283664240.0
  ], 
  [
   411565, 
   null, 
   "MrWriteLA", 
   "He talk pretty one day. ;)", 
   {}, 
   411562, 
   null, 
   1283682420.0
  ], 
  [
   411567, 
   null, 
   "pappillion001", 
   "Are you a little tipsy tonight...or, am I dense?:p\n I have no idea what you just said.\n\n \n As weird as this sounds my laptop motherboard fried so I am using my desktop and despite the ridiculous amount I paid for the keyboard and mouse it like pounding on a rock. I also am a three finger hunt and peck typist and trying to logically defend Christianity is proving to be not to hard until someone makes a rational comment so I am trying to make it Satan's fault for the computer keyboard, I am imperfect for not typing well and making no sense I attribute to playing Christian.\n \n or yes I am on about 10 hrs sleep over the last 2 days. Another hour or two and I will probably try and justify some dumb post with some other nonsense and the go to sleep thinking how clever I was.\n \n nah I will just go to to sleep.", 
   {}, 
   411560, 
   null, 
   1283684280.0
  ], 
  [
   411569, 
   null, 
   "MrWriteLA", 
   "It's OK, kiddo. We love you anyway. :)", 
   {}, 
   411567, 
   null, 
   1283685600.0
  ], 
  [
   411571, 
   null, 
   "Sandycane", 
   "As weird as this sounds my laptop motherboard fried so I am using my desktop and despite the ridiculous amount I paid for the keyboard and mouse it like pounding on a rock. I also am a three finger hunt and peck typist and trying to logically defend Christianity is proving to be not to hard until someone makes a rational comment so I am trying to make it Satan's fault for the computer keyboard, I am imperfect for not typing well and making no sense I attribute to playing Christian.\n \n or yes I am on about 10 hrs sleep over the last 2 days. Another hour or two and I will probably try and justify some dumb post with some other nonsense and the go to sleep thinking how clever I was.\n \n nah I will just go to to sleep.\n\n \n Ah ha! I knew there had to be a reasonable explanation.\n Sleep deprivation can also make you think you are thinking profound thoughts when you actually aren't. ;)\n And, please, stop trying to walk in christian shoes - their cutting off the circulation to your brain!!! emoticon_xbangheadxclown:", 
   {}, 
   411567, 
   null, 
   1283696700.0
  ], 
  [
   411640, 
   null, 
   "snakespit", 
   "Sleep deprivation can also make you think you are thinking profound thoughts when you actually aren't.\n\n \n As can oxygen deprivation, mental illness, crack, and spending too much time debating Easyrider. :p", 
   {}, 
   411571, 
   null, 
   1283752560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  C'mon guys! Go easy on Easy", 
  "url": "http://www.4forums.com/political/religion-debates/14575-cmon-guys-go-easy-easy.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14575, 
  "discussion_files": [
   [
    "29464.html", 
    "http://www.4forums.com/political/religion-debates/14575-cmon-guys-go-easy-easy-print.html"
   ], 
   [
    "29465.html", 
    "http://www.4forums.com/political/religion-debates/14575-cmon-guys-go-easy-easy-4-print.html"
   ], 
   [
    "29466.html", 
    "http://www.4forums.com/political/religion-debates/14575-cmon-guys-go-easy-easy-3-print.html"
   ], 
   [
    "29467.html", 
    "http://www.4forums.com/political/religion-debates/14575-cmon-guys-go-easy-easy-2-print.html"
   ]
  ], 
  "identifier": 14575
 }
]