[
 [
  [
   411437, 
   null, 
   "Xcaliber", 
   "My Question is simple. Are All Christians Hypocrites? Christians Claim to Follow the teachings of Jesus, but few Christians that I have ever known actually follow Him to the letter of his teachings. In Fact Most Christians that I know only follow the parts of the teachings that they choose to believe, anything else they always try to explain away using other parts of their Bible. A Case can be made that Most all Christians in fact don't follow the words as they are written. I'll give you some examples below...\n \n Jesus made a number of very clear statements about money and wealth in the Bible. For example:\n Matthew 6:19\n Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal; but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also. \n \n Luke 14:33\n Any of you who does not give up everything he has cannot be my disciple. \n \n Matthew 6:24\n \n No one can serve two masters; for either he will hate the one and love the other, or else he will be loyal to the one and despise the other. You cannot serve God and Money. \n \n Matthew 19:21-24\n \n Jesus answered, \"If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow me.\" When the young man heard this, he went away sad, because he had great wealth. Then Jesus said to his disciples, \"I tell you the truth, it is hard for a rich man to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\" \n \n Matthew 19:28-29\n \n Jesus said to them, \"I tell you the truth, at the renewal of all things, when the Son of Man sits on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel. And everyone who has left houses or brothers or sisters or father or mother or children or fields for my sake will receive a hundred times as much and will inherit eternal life. \n \n Luke 9:23-25\n \n Then he said to them all: \"If anyone would come after me, he must deny himself and take up his cross daily and follow me. For whoever wants to save his life will lose it, but whoever loses his life for me will save it. What good is it for a man to gain the whole world, and yet lose or forfeit his very self? \n \n Matt 13: 22\n \n The one who received the seed that fell among the thorns is the man who hears the word, but the worries of this life and the deceitfulness of wealth choke it, making it unfruitful. \n \n Hebrews 13:5\n \n Keep your lives free from the love of money and be content with what you have, because God has said, \"Never will I leave you; never will I forsake you.\" \n \n Phil 2:3\n \n Do nothing out of selfish ambition or vain conceit, but in humility consider others better than yourselves. \n \n Acts 2:44-45\n \n All the believers were together and had everything in common. Selling their possessions and goods, they gave to anyone as he had need. \n \n The message is clear. If you want to follow Jesus, you need to \"sell your possessions and give to the poor.\" It is a very simple message, and easy to do. Have you done it? The fact that you are reading this page would indicate that you have not. Chances are you own a computer, pay for an Internet connection every month, live in a home or apartment, have a car, etc. In other words, you live a life at a level of wealth unimaginable in Jesus' time. Meanwhile, billions of people on the planet live in startling, abject poverty.\n \n Why don't you sell everything and follow Jesus, as he requests in the Bible? I think the reason is simple: Jesus and God are imaginary, and you know it. If Jesus were real, you would do what he says.", 
   {
    "post_info": {
     "post_title": "Are Christians Hypocrites?"
    }
   }, 
   null, 
   null, 
   1283536800.0
  ], 
  [
   411444, 
   null, 
   "Sandycane", 
   "Buddhist monks are closer to being 'christian' than are those who claim to be christian.\n \n Seriously, you can't be serious!\n Don't you know how expensive it is to print up all that propaganda and spread 'the word' to the millions of heathen all over the globe?!?\n :p", 
   {}, 
   411437, 
   null, 
   1283548920.0
  ], 
  [
   411487, 
   null, 
   "unkerpaulie", 
   "It can actually argued that christians are not hypocrites. They simply obey the teachings of a self contradictory bible that allows them to justify whatever actions they want to. The oppression, torture, wars, murders and many other atrocities that happened throughout history that cited biblical justification were commited by christians who were not hypocrites. They simply obeyed the part of the bible they decided would help further the cause they wanted to pursue. Of course, by \"wanted to pursue\" we really mean what God told them to do. And by \"obeying part of the bible\" we mean following what they were convinced was the one true doctrine, interpretation or path of christianity. \n \n In order for you to be a hypocrite, wouldn't you first have to know the truth then act in a way contrary to what you say is the truth?", 
   {}, 
   411444, 
   null, 
   1283565840.0
  ], 
  [
   411492, 
   null, 
   "Xcaliber", 
   "\n In order for you to be a hypocrite, wouldn't you first have to know the truth then act in a way contrary to what you say is the truth?\n\n \n That is exactly what they seem to be doing is it not?... They know the truth according to their Bible , Yet show me one Christian who will sell everything he owns and give it to the poor... I say that is a bit Hypocritical.", 
   {}, 
   411487, 
   null, 
   1283567160.0
  ], 
  [
   411523, 
   null, 
   "Easyrider", 
   "My Question is simple. Are All Christians Hypocrites? \n\n \n Hey - just because the godless infidels don't have a compelling moral code to follow doesn't mean you are not without a steamy case of hypocrisy yourselves.\n \n Ever tell people to quit cursing, and then cursed yourself?\n \n Ever tell others not to steal, and then stole something yourself (money, things, time from your employer, etc.)?\n \n I could list hundreds of these. And the final tally would be that yes, you godless heathens are all hypocrites yourselves. Self-righteous hypocrites at that.\n \n At least most Christians are usually convicted by their sins and ask for forgiveness. You folks have squat to extradite yourselves from the Pit of Hades when you die.\n \n So fill up the measure of your own flaming hypocrisy first.\n \n Heathens...", 
   {}, 
   411437, 
   null, 
   1283631900.0
  ], 
  [
   411525, 
   null, 
   "Sandycane", 
   "Hey - just because the godless infidels don't have a compelling moral code to follow doesn't mean you are not without a steamy case of hypocrisy yourselves.\n \n Ever tell people to quit cursing, and then cursed yourself?\n \n Ever tell others not to steal, and then stole something yourself (money, things, time from your employer, etc.)?\n \n I could list hundreds of these. And the final tally would be that yes, you godless heathens are all hypocrites yourselves. Self-righteous hypocrites at that.\n \n At least most Christians are usually convicted by their sins and ask for forgiveness. You folks have squat to extradite yourselves from the Pit of Hades when you die.\n \n So fill up the measure of your own flaming hypocrisy first.\n \n Heathens...\n\n \n Soooo, in a word, 'Yes' would be your reply to the question?:p", 
   {}, 
   411523, 
   null, 
   1283632980.0
  ], 
  [
   411546, 
   null, 
   "Xcaliber", 
   "Hey - just because the godless infidels don't have a compelling moral code to follow doesn't mean you are not without a steamy case of hypocrisy yourselves.\n\n \n Just like a Zealot.. trying to answer a question by turning things around backwards... Can't you just give a simple YES....\n \n \nEver tell people to quit cursing, and then cursed yourself?\n\n \n Actually no.. I don't care if people curse or not so I've never asked someone not to.\n \n \nEver tell others not to steal, and then stole something yourself (money, things, time from your employer, etc.)?\n\n \n Just because I'm an atheist doesn't mean I'm a thief... And unlike you zealots I don't preach to others about how they lead their lives.\n \n \nI could list hundreds of these. And the final tally would be that yes, you godless heathens are all hypocrites yourselves. Self-righteous hypocrites at that.\n\n \n You should go ahead and make that list.. you might actually have a point or two out of hundreds...\n \n \nAt least most Christians are usually convicted by their sins and ask for forgiveness. You folks have squat to extradite yourselves from the Pit of Hades when you die.\n\n \n So really Christians just use their religion to make themselves feel better about the bad things they do, ? but isn't the religion supposed to teach you people not to do bad things in the first place?... that is Hypocritical....lol", 
   {}, 
   411523, 
   null, 
   1283649120.0
  ], 
  [
   411552, 
   null, 
   "Easyrider", 
   "\n \n So really Christians just use their religion to make themselves feel better about the bad things they do, ?\n\n \n You are so lost and misinformed. Have you ever read the Bible?\n \n \n\n but isn't the religion supposed to teach you people not to do bad things in the first place?... that is Hypocritical....lol\n\n \n The Bible states that ALL HAVE SINNED AND FALL SHORT OF THE GLORY OF GOD. THERE ARE NO PERFECT CHRISTIANS, understand? Everybody screws up. You too. You just don't know how bad you're screwing up because (1) you don't have the Holy Spirit to convict you of your sins, and (2) you haven't studied the Bible to the degree that you know what's going on. \n \n You need to read the following material on progressive sanctification. I doubt you've ever heard the term, much less studied it or understand it.\n \n \"Progressive Sanctification is that gracious work of God in a believer whereby He enables him to replace (sinful) works of the flesh with the fruit of the Spirit, thereby causing him (over time) to become more and more like the Lord Jesus Christ.\" It's a process that's never completed on earth.\n \n \"The process of progressive sanctification is described in Galatians 5:19-23. Progressive sanctification is the journey of producing less and less of the acts of the sinful nature (Galatians 5:19-21) and more and more of the fruit of the Holy Spirit (Galatians 5:22-23). Progressive sanctification is a process empowered by the Holy Spirit  (Ephesians 5:18) and enabled through prayer and the study of God's Word. 2 Timothy 3:16-17 tells us, \"All Scripture is God-breathed and is useful for teaching, rebuking, correcting and training in righteousness, so that the man of God may be thoroughly equipped for every good work.\" \n \n Progressive Sanctification\n \n p.s. If you ever find a perfect church, don't join it. You'll screw it up.", 
   {}, 
   411546, 
   null, 
   1283654220.0
  ], 
  [
   411553, 
   null, 
   "Easyrider", 
   "\n \n You should go ahead and make that list.. you might actually have a point or two out of hundreds...\n \n\n \n Get born again in the Holy Spirit and you won't be so impressed with your perceived self righteousness.", 
   {}, 
   411546, 
   null, 
   1283654580.0
  ], 
  [
   411554, 
   null, 
   "unkerpaulie", 
   "That is exactly what they seem to be doing is it not?... They know the truth according to their Bible , Yet show me one Christian who will sell everything he owns and give it to the poor... I say that is a bit Hypocritical.\n\n No brand of christianity obeys EVERYTHING in the bible. That would be impossible, because there are so many contradictory rules and mutually exclusive instructions that by following one commandment, you are at the same time breaking another. For example, the Jesus said that he came so that we could live life more abundantly. This is often interpreted as a commandment to be prosperous. Of course, no matter how prosperous you are, if you give all your belongings to the poor, you'll soon be among the poor hoping for the next prosperous believer to do what you did. In these cases, the church leader must then make the executive decision as to which side of the issue he should take, and that becomes the doctrine that the church followers blindly accept. So christianity can't be defined as the practice of obeying the bible, but more accurately as the practice of obeying the doctrine of the demonination associated with. And that doctrine is whatever parts of the bible the church leader says is the doctrine to follow. So a christian could wholeheartedly feel he can reject a part of the bible, or do the opposite of what is in the bible, and still follow his doctrine without being a hypocrite. If his church doesn't teach about giving all his belongings to the poor, then why would he think he should do so?", 
   {}, 
   411492, 
   null, 
   1283655240.0
  ], 
  [
   411555, 
   null, 
   "Xcaliber", 
   "You are so lost and misinformed. Have you ever read the Bible?\n\n \n I would bet money I know more about your Bible than you do... Don't assume because I am a non-believer that I have never read the Bible. \n \n \nGet born again in the Holy Spirit and you won't be so impressed with your perceived self righteousness.\n\n \n I was a BORN AGAIN CRISTIAN for over 20 years of my life, I have read the Bible cover to Cover at least 4 times.. I simply grew out of the delusion when I realized I was seeking something that is not real. YOU assume that just because I am now an Atheist that I am uninformed. I'm not the one acting self righteous... You are the one who is un-informed. Don't judge others for their beliefs.. isn't that what your Jesus is supposed to do?....", 
   {}, 
   411553, 
   null, 
   1283655480.0
  ], 
  [
   411564, 
   null, 
   "pappillion001", 
   "My Question is simple. Are All Christians Hypocrites? Christians Claim to Follow the teachings of Jesus, but few Christians that I have ever known actually follow Him to the letter of his teachings. In Fact Most Christians that I know only follow the parts of the teachings that they choose to believe, anything else they always try to explain away using other parts of their Bible. A Case can be made that Most all Christians in fact don't follow the words as they are written. I'll give you some examples below...\n \n Jesus made a number of very clear statements about money and wealth in the Bible. For example:\n Matthew 6:19\n Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal; but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also. \n \n Luke 14:33\n Any of you who does not give up everything he has cannot be my disciple. \n \n Matthew 6:24\n \n No one can serve two masters; for either he will hate the one and love the other, or else he will be loyal to the one and despise the other. You cannot serve God and Money. \n \n Matthew 19:21-24\n \n Jesus answered, \"If you want to be perfect, go, sell your possessions and give to the poor, and you will have treasure in heaven. Then come, follow me.\" When the young man heard this, he went away sad, because he had great wealth. Then Jesus said to his disciples, \"I tell you the truth, it is hard for a rich man to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\" \n \n Matthew 19:28-29\n \n Jesus said to them, \"I tell you the truth, at the renewal of all things, when the Son of Man sits on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel. And everyone who has left houses or brothers or sisters or father or mother or children or fields for my sake will receive a hundred times as much and will inherit eternal life. \n \n Luke 9:23-25\n \n Then he said to them all: \"If anyone would come after me, he must deny himself and take up his cross daily and follow me. For whoever wants to save his life will lose it, but whoever loses his life for me will save it. What good is it for a man to gain the whole world, and yet lose or forfeit his very self? \n \n Matt 13: 22\n \n The one who received the seed that fell among the thorns is the man who hears the word, but the worries of this life and the deceitfulness of wealth choke it, making it unfruitful. \n \n Hebrews 13:5\n \n Keep your lives free from the love of money and be content with what you have, because God has said, \"Never will I leave you; never will I forsake you.\" \n \n Phil 2:3\n \n Do nothing out of selfish ambition or vain conceit, but in humility consider others better than yourselves. \n \n Acts 2:44-45\n \n All the believers were together and had everything in common. Selling their possessions and goods, they gave to anyone as he had need. \n \n The message is clear. If you want to follow Jesus, you need to \"sell your possessions and give to the poor.\" It is a very simple message, and easy to do. Have you done it? The fact that you are reading this page would indicate that you have not. Chances are you own a computer, pay for an Internet connection every month, live in a home or apartment, have a car, etc. In other words, you live a life at a level of wealth unimaginable in Jesus' time. Meanwhile, billions of people on the planet live in startling, abject poverty.\n \n Why don't you sell everything and follow Jesus, as he requests in the Bible? I think the reason is simple: Jesus and God are imaginary, and you know it. If Jesus were real, you would do what he says.\n\n \n At first I thought you were setting someone up. The language you used played perfectly into whoever didn't realize how you have twisted scripture. Easy blew it, I thought for sure he would realize, but now I think you actually believe you have understood it correctly. So unknowingly you have made your point. \n \n To set the record straight though, No the verses above are not intended to convey only impoverished questions who have given away all their possessions will enter Heaven. First if that were so it would only be once as after the first time they would never have anything again. Jesus never says go be destitute, learn to recycle and become beggars.\n \n \n \n Matthew 6:19\n Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal; but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also. \n \n He is saying don't spend your life hoarding money and amassing wealth at the cost of not entering Heaven. If all you do is make yourself rich what have you done that is worthy of being in heaven. The money isn;t going with you. So instead of all your life you have a $1,000,000 dollars but to do so you spent almost no time acknowledging God. You can't buy your way into Heaven and you have shown what was more important while alive. \n \n Matt 13: 22\n \n The one who received the seed that fell among the thorns is the man who hears the word, but the worries of this life and the deceitfulness of wealth choke it, making it unfruitful. \n \n Hebrews 13:5\n \n Keep your lives free from the love of money and be content with what you have, because God has said, \"Never will I leave you; never will I forsake you.\" \n \n Phil 2:3\n \n Do nothing out of selfish ambition or vain conceit, but in humility consider others better than yourselves. \n \n \n Money can corrupt even those who have heard the word of God, even the very word of God so that those who think they are being righteous are being deceived by the prospect of money and not God making their lives worthwhile.\n \n Not keep your lives free from money, but the love of money. The safty that money offers is not worth the safety you give up by placing money before God. You can be happy with more God and less making money\n \n The man who strives to be rich does so for himself. He will mot treat his neighbor as he would treat himself. Relationships with others are important and you can't have relationships with people who think only of themselves and their needs\n \n \n Acts 2:44-45\n \n All the believers were together and had everything in common. Selling their possessions and goods, they gave to anyone as he had need. \n \n I like this one and have used it a few times, but I use the preceding verses where the husband and wife are killed for holding back some of the money and lying to Peter about it. Can't spin your way out with that part of the story. The only defense is it's Peter and after Jesus, is gone. So God and Jesus' integrity are intact but at least Peter if not all the Apostles are blacklisted, but you used just this part which is saying when everybody pitches in and looks out for each other everybody's needs are met. They are all haves and not haves and have nots. \n \n \n The point is clear, but not what you want it to be because then you can try and take a Christian to task. Had you run into a Protestant you could have had a field day. At least back in the late 1800 early 1900 they came up with since God rewards the faithful being rich was a sign of Gods favor. Nice huh, now that got some hypocrisy going on.\n \n \n Luke 14:33\n Any of you who does not give up everything he has cannot be my disciple. \n \n This last one you are not even in the same state with what is meant. Put back in context this is about what being a disciple. Notice it doesn't say give away, rather give up. The verses before and after are about to be a follower of Jesus isn't to be taken lightly. It wouldn't be easy and one had to be commuted and trust him that what they were doing was right. Jesus wasn't looking for mass numbers of people to blindly repeat similar words having no real understanding of what they were saying. He wanted a small group who walked the talk and lived as an example greater than what was expected of others. \n \n What makes your OP right is most have lost sight of this and do just as you claim they do. And just as Sandycane has pointed out far to many of the ones who don't tolerate the ones who do enough to where it is very hard to separate one from the other and often enough that innocent spouse type defense just doesn't cut it", 
   {}, 
   411437, 
   null, 
   1283681220.0
  ], 
  [
   411566, 
   null, 
   "pappillion001", 
   "Hey - just because the godless infidels don't have a compelling moral code to follow doesn't mean you are not without a steamy case of hypocrisy yourselves.\n\n \n The difference being being we don't find it necessary to make it someone else's problem or fault. \n \n \nEver tell people to quit cursing, and then cursed yourself?\n\n \n Yes. There is a time and place for everything. Sometimes I am the one being asked to quit Fuxxking mouthing off at some pexker-necked douxhebag who continues to breath my air and irratates the shxt out of me by existing. What is your point? that telling someone to be respectful is comparable to telling someone how to live their life because some pubescent boy lover needs more money to pay off the most recent parents who had the nerve to be upset about his interpretation of being filled with the Holy Spirit means? Try again, then try harder\n \n \nEver tell others not to steal, and then stole something yourself (money, things, time from your employer, etc.)?\n \n\n \n Read response to cursing. Add additional cursing of your choice\n \n \nI could list hundreds of these. And the final tally would be that yes, you godless heathens are all hypocrites yourselves. Self-righteous hypocrites at that.\n\n \n It's one of the perks of being Godless, since we have no moral compass we are just ignorant whats your excuse? I hope it is better than two wrongs make a right or well if you do it then you have no right to say anything when I do it. \n \n \nAt least most Christians are usually convicted by their sins and ask for forgiveness. You folks have squat to extradite yourselves from the Pit of Hades when you die.\n \n\n \n Your putting a lot of faith in I'm sorry. At what point does I'm sorry being said for the same behavior get to be understood as Christian for \"yeah whatever, sorry won't happen again, look I got a 12 year old doped up on Disney movies and tequila shots can we move this along?\n \n \n \n So fill up the measure of your own flaming hypocrisy first.\n \n Heathens...\n\n \n Oh my God your closing statement is \"What! Like you never did it.\" \n \n The real issue is not that us Godless heathens are better than you, but your the same as us while pretending to be better and then trying to make us be like your unwilling or incapable of being. Don't tell me I am going to burn for living with my girlfriend while your using the retirement pension of some old couple to burn through an 8th of meth and two gay prostitutes. emoticon_xdonnoemoticon_wow", 
   {}, 
   411523, 
   null, 
   1283683200.0
  ], 
  [
   411570, 
   null, 
   "Easyrider", 
   "I would bet money I know more about your Bible than you do... Don't assume because I am a non-believer that I have never read the Bible. \n\n \n You don't know 1/100th of what I know about the Bible. If you did you wouldn't be a godless infidel.\n \n Can you quote off the top of your head a progressive sanctification passage from the Old Testament?\n \n \n\n \n I was a BORN AGAIN CRISTIAN for over 20 years of my life\n\n \n Horse manure. If you were ever born again you would have experienced the Holy Spirit; you would have know it was real; you wouldn't have left the faith, and you would have buried yourself in Biblical studies. That's one of the first experiences with the Holy Spirit. And you'd know a lot more about the Bible than you're showing around here. Just going to church doesn't make you a born again Christian.\n \n \n I'm not the one acting self righteous...\n\n \n Yeah, you are. You are being self righteous. Christ is my righteousness by faith (Romans 3). You don't have Christ. All you have is yourself. And that's who you're taking to your Judgment.\n \n \n Don't judge others for their beliefs.. isn't that what your Jesus is supposed to do?....\n\n \n That's another doctrine from Matthew 7 you've twisted and never studied in depth.\n \n As for calling yourself an atheist, that's a load too. Nobody in your position can say they know with certainty that there is no God. You don't know everything there is to know in the universe. So you'd be better suited calling yourself an agnostic.", 
   {}, 
   411555, 
   null, 
   1283695920.0
  ], 
  [
   411572, 
   null, 
   "Easyrider", 
   "\n The real issue is not that us Godless heathens are better than you, but your the same as us while pretending to be better and then trying to make us be like your unwilling or incapable of being.\n\n \n I think anyone who gets born again and diligently follows God and the Holy Spirit is a better person than when they were godless infidels. But the credit should go to God since he's the one who makes it all possible.\n \n \n\n Don't tell me I am going to burn for living with my girlfriend while your using the retirement pension of some old couple to burn through an 8th of meth and two gay prostitutes. emoticon_xdonnoemoticon_wow\n\n \n You're weird. \n \n According to 1 Corinthians 6:9-10 no fornicators will enter the Kingdom of Heaven.\n \n John 3:36; John 8:24", 
   {}, 
   411566, 
   null, 
   1283696820.0
  ], 
  [
   411574, 
   null, 
   "Xcaliber", 
   "You don't know 1/100th of what I know about the Bible. If you did you wouldn't be a godless infidel.\n\n \n I seriously doubt that.. your view on the bible is one of Delusion.. I'm fairly certain you've actually never read the book for yourself. \n \n \n\n Can you quote off the top of your head a progressive sanctification passage from the Old Testament?\n\n \n What book would you like it from,Exodus, Leviticus or Numbers. Progressive sanctification is as much non-sense as the rest of the book.\n \n \n\n Horse manure. If you were ever born again you would have experienced the Holy Spirit; you would have know it was real; you wouldn't have left the faith, and you would have buried yourself in Biblical studies. That's one of the first experiences with the Holy Spirit. And you'd know a lot more about the Bible than you're showing around here. Just going to church doesn't make you a born again Christian.\n\n \n Oh you are so deluded ... Experiencing the holy spirit is a delusion of the mind, it's not real, never has been, and never will be. Waste your life blindly following a dream if you want but don't Judge me because I choose to live in reality. \n \n \n\n Yeah, you are. You are being self righteous. Christ is my righteousness by faith (Romans 3). You don't have Christ. All you have is yourself. And that's who you're taking to your Judgment.\n\n \n again you are wrong. I DON\"T NEED CHRIST is a better way to put it. You think just because you believe you are more righteous ... You don't even know the meaning of the word....\n \n \n\n That's another doctrine from Matthew 7 you've twisted and never studied in depth.\n\n \n another Judgment by a self righteous zealot who doesn't have a clue. \n \n \n\n As for calling yourself an atheist, that's a load too. Nobody in your position can say they know with certainty that there is no God. You don't know everything there is to know in the universe. So you'd be better suited calling yourself an agnostic.\n\n \n And just what position am I in? No unlike you I don't claim to know everything in the universe. I can say with CERTAINTY there is no GOD. that's not me claiming to know everything, just my personal opinion which I happen to believe is true. Agnostics sit on a fence waiting for the answers so they can decide which way to go... I sit on one side of the fence and that is the side of REALITY...\n \n \n Didn't you say in another thread you were done replying to me?.. Why don't you keep your word and just keep your opinions to yourself ... you don't have anything useful to contribute so what is your point in continuously calling names and preaching from your pulpit?.", 
   {}, 
   411570, 
   null, 
   1283699280.0
  ], 
  [
   411579, 
   null, 
   "Easyrider", 
   "\n Oh you are so deluded ... Experiencing the holy spirit is a delusion of the mind, it's not real, never has been, and never will be.\n\n \n \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit!\" Acts 7:51\n \n Like I said, you were never born again. Claiming that you were is the big delusion. You need to surrender your life and give it to the Lord and ask him to be your Lord and Savior for the remission of your sins. You probably forgot the surrender-your-life part (a common heathen mistake).\n \n Not only that, but for you to claim to know the Word of God when you have denied the Holy Spirit is still another joke.\n \n \"The man without the Spirit does not accept the things that come from the Spirit of God, for they are foolishness to him, and he cannot understand them, because they are spiritually discerned.\" - 1 Corinthians 2:14\n \n Anyway, you've been busted on this thread so if you want to start another topic I might drop in to show you the error of your way there.\n \n 1 John 2:22", 
   {}, 
   411574, 
   null, 
   1283703000.0
  ], 
  [
   411582, 
   null, 
   "Xcaliber", 
   "\"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit!\" Acts 7:51\n \n Like I said, you were never born again. Claiming that you were is the big delusion. You need to surrender your life and give it to the Lord and ask him to be your Lord and Savior for the remission of your sins. You probably forgot the surrender-your-life part (a common heathen mistake).\n \n Not only that, but for you to claim to know the Word of God when you have denied the Holy Spirit is still another joke.\n \n \"The man without the Spirit does not accept the things that come from the Spirit of God, for they are foolishness to him, and he cannot understand them, because they are spiritually discerned.\" - 1 Corinthians 2:14\n \n Anyway, you've been busted on this thread so if you want to start another topic I might drop in to show you the error of your way there.\n \n 1 John 2:22\n\n \n Well at one time I was indeed a Christian.. Or at least I called myself one. I learned the error of my ways,, you should do the same before it's too late. \n \n quoting scripture to an atheist.. how stupid are you ?... I don't believe in your GOD, I realize it's all made up delusions of men who simply seek immortality. You have no PROOF other than your personal belief that it's even real.. so please don't preach to me. \n \n You have busted nothing, explained nothing, made no legitimate point on the subject, or said anything worth repeating. \n \n YOUR bible is merely a tool .. every religion has their own version, you are simply one of a few billion delusional people who actually believe you are going to an imaginary place in the sky when you die... why don't you open YOUR eyes and live the life you are given and stop trying to push your religion on others.\n \n Now.. As I said in my previous post which you clearly didn't read ... Why don't you be a man of your word and stop replying to me... I have better things to do than reply to your delusional replies...", 
   {}, 
   411579, 
   null, 
   1283706000.0
  ], 
  [
   416556, 
   null, 
   "New Atheist", 
   "I would say that the overwhelming majority of Christians are hypocrites. Examples include those who adhere to prosperity theology, Bush II/Blackwater fanboys who portray the Jesus character as pro-war mongering, and essentially anyone who does not love his or her enemies.", 
   {}, 
   411437, 
   null, 
   1289241120.0
  ], 
  [
   416587, 
   null, 
   "Easyrider", 
   "I would say that the overwhelming majority of Christians are hypocrites. Examples include those who adhere to prosperity theology, Bush II/Blackwater fanboys who portray the Jesus character as pro-war mongering, and essentially anyone who does not love his or her enemies.\n\n \n I'd say the overwhelming majority of atheists are hypocrites too then, except they won't get a sermon on it or be convicted of their sins.", 
   {}, 
   416556, 
   null, 
   1289261040.0
  ], 
  [
   416666, 
   null, 
   "Matthew", 
   "Just going to church doesn't make you a born again Christian.\n\n \n Nor even does publicly declaring one's faith, or criticizing a lack of faith in others. To wit:\n \n \nChrist is my righteousness by faith (Romans 3). You don't have Christ. All you have is yourself. And that's who you're taking to your Judgment.\n\n \n See, my hypothesis is, the more aggressive someone is about his faith -- the more condemnations he hurls, the more he seeks to have the precepts of his faith mandated by law -- the shakier his faith really is.", 
   {}, 
   411570, 
   null, 
   1289328000.0
  ], 
  [
   416677, 
   null, 
   "New Atheist", 
   "I'd say the overwhelming majority of atheists are hypocrites too then, except they won't get a sermon on it or be convicted of their sins.\n\n \n What canon do atheists adhere to?", 
   {}, 
   416587, 
   null, 
   1289329380.0
  ], 
  [
   416707, 
   null, 
   "Easyrider", 
   "What canon do atheists adhere to?\n\n \n They're all over the board. Their values change like they change their underwear. Moral relativism is subjective, and changes over time and cultures. There's usually very little endearing or enduring about it. Hypocrisy comes in when they teach their children not to steal, but then steal time, objects, or affection from various people or employers. They say not to lie but ocasionally lie; say not to murder but many encourage abortion, etc., etc. And so on. Not all, but many.", 
   {}, 
   416677, 
   null, 
   1289346540.0
  ], 
  [
   416742, 
   null, 
   "pappillion001", 
   "They're all over the board. Their values change like they change their underwear. Moral relativism is subjective, and changes over time and cultures. There's usually very little endearing or enduring about it. Hypocrisy comes in when they teach their children not to steal, but then steal time, objects, or affection from various people or employers. They say not to lie but ocasionally lie; say not to murder but many encourage abortion, etc., etc. And so on. Not all, but many.\n\n \n I am sorry it sounds like you are describing everyone. In these things the God folk act the same as everybody else. If you really want to go down this path as athiests they have an excuse of they know no better believers on the other hand they do, but do it anyway. Who is worse?", 
   {}, 
   416707, 
   null, 
   1289359200.0
  ], 
  [
   416933, 
   null, 
   "Easyrider", 
   "I am sorry it sounds like you are describing everyone. In these things the God folk act the same as everybody else. If you really want to go down this path as athiests they have an excuse of they know no better believers on the other hand they do, but do it anyway. Who is worse?\n\n \n All have sinned and fallen short of the Glory of God and need Christ for salvation. The people who will have a real unpleasant time in eternity are the Christ deniers.", 
   {}, 
   416742, 
   null, 
   1289592000.0
  ], 
  [
   417061, 
   null, 
   "pappillion001", 
   "All have sinned and fallen short of the Glory of God and need Christ for salvation. The people who will have a real unpleasant time in eternity are the Christ deniers.\n\n \n You miss the point, Even Christians don't hold to all the moral values within the Bible and even though not always practiced most of those moral values had been in place for a very long time prior to the bible. You act is if the 10 commandments never existed prior to Moses walking down with them. \n \n Moral values are just works anyway and Christians don't concern themselves with works for salvation.", 
   {}, 
   416933, 
   null, 
   1289718240.0
  ], 
  [
   417065, 
   null, 
   "Easyrider", 
   "You miss the point, Even Christians don't hold to all the moral values within the Bible and even though not always practiced most of those moral values had been in place for a very long time prior to the bible. You act is if the 10 commandments never existed prior to Moses walking down with them. \n \n Moral values are just works anyway and Christians don't concern themselves with works for salvation.\n\n \n You still don't understand Christianity because you still refuse to recognize the work of the Holy Spirit in believer's lives. \n \n Here's a refresher for you:\n \n THE HOLY SPIRIT IN THE LIFE OF THE BELIEVER\n by Kevin Conner \n \n 1. The new birth is brought about by the Spirit (John 3:5-6).\n 2. The Spirit indwells the believer's spirit (Romans 8:9; I Corinthians 3:16; 6:17).\n 3. The Spirit gives assurance of salvation (Romans 8:16).\n 4. The Spirit fills the believer with Himself (Acts 2:4).\n 5. The Spirit speaks to the believer (Acts 8:29; I Timothy 4:1; Revelation 2:7).\n 6. The Spirit provides understanding about the things of God (I Corinthians 2:12)\n 7. The Spirit teaches and guides the believer (John 16:13; I John 2:27).\n 8. The Spirit imparts life (John 6:63; II Corinthians 3:6).\n 9. The Spirit brings about renewal (Titus 3:5).\n 10. The Spirit strengthens the believer's inner being (Ephesians 3:16).\n 11. The Spirit enables the believer to pray (Jude 20; Romans 8:26-28).\n 12. The Spirit enables the believer to worship in spirit and truth (John 4:23-24; Philippians 3:3; I Corinthians 14:15).\n 13. The Spirit leads the believer (Romans 8:14).\n 14. The Spirit enables the believer to put carnal works to death (Romans 8:13).\n 15. The Spirit helps produces Christ-likeness in character and fruit in the believer's life (Galatians 5:22, 23).\n 16. The Spirit gives a calling to the believer for special service (Acts 13:2-4).\n 17. The Spirit guides believers into their ministry (Acts 8:29; 16:6-7).\n 18. The Spirit empowers the believer to witness (Acts 1:8).\n 19. The Spirit imparts spiritual gifts as He wills (I Corinthians 12:7-11).\n 20. The Spirit will bring about the resurrection and immortality to the believers' bodies in the last day (Romans 8:11; I Corinthians 15:47-51; I Thes. 4:15-18).", 
   {}, 
   417061, 
   null, 
   1289742540.0
  ], 
  [
   418218, 
   null, 
   "Xcaliber", 
   "You still don't understand Christianity because you still refuse to recognize the work of the Holy Spirit in believer's lives. \n \n Here's a refresher for you:\n \n THE HOLY SPIRIT IN THE LIFE OF THE BELIEVER\n by Kevin Conner \n \n 1. The new birth is brought about by the Spirit (John 3:5-6).\n 2. The Spirit indwells the believer's spirit (Romans 8:9; I Corinthians 3:16; 6:17).\n 3. The Spirit gives assurance of salvation (Romans 8:16).\n 4. The Spirit fills the believer with Himself (Acts 2:4).\n 5. The Spirit speaks to the believer (Acts 8:29; I Timothy 4:1; Revelation 2:7).\n 6. The Spirit provides understanding about the things of God (I Corinthians 2:12)\n 7. The Spirit teaches and guides the believer (John 16:13; I John 2:27).\n 8. The Spirit imparts life (John 6:63; II Corinthians 3:6).\n 9. The Spirit brings about renewal (Titus 3:5).\n 10. The Spirit strengthens the believer's inner being (Ephesians 3:16).\n 11. The Spirit enables the believer to pray (Jude 20; Romans 8:26-28).\n 12. The Spirit enables the believer to worship in spirit and truth (John 4:23-24; Philippians 3:3; I Corinthians 14:15).\n 13. The Spirit leads the believer (Romans 8:14).\n 14. The Spirit enables the believer to put carnal works to death (Romans 8:13).\n 15. The Spirit helps produces Christ-likeness in character and fruit in the believer's life (Galatians 5:22, 23).\n 16. The Spirit gives a calling to the believer for special service (Acts 13:2-4).\n 17. The Spirit guides believers into their ministry (Acts 8:29; 16:6-7).\n 18. The Spirit empowers the believer to witness (Acts 1:8).\n 19. The Spirit imparts spiritual gifts as He wills (I Corinthians 12:7-11).\n 20. The Spirit will bring about the resurrection and immortality to the believers' bodies in the last day (Romans 8:11; I Corinthians 15:47-51; I Thes. 4:15-18).\n\n \n Only problem with this is that the so called \"Holy Spirit\" doesn't really exist. It's a figment of the imagination preached through a religion that is built on lies, among other things. There's no actual proof that any of it is true, only the Bible. In fact Outside the Bible , There's no evidence of GOD, Jesus, or the Holy Spirit... so posting this kind of response only shows you don't have a clue what reality is....\n \n Oh.. Hey EZ... I'm back from my Vacation... good to see ya....emoticon_xhoho", 
   {}, 
   417065, 
   null, 
   1291270740.0
  ], 
  [
   418275, 
   null, 
   "Easyrider", 
   "Only problem with this is that the so called \"Holy Spirit\" doesn't really exist. It's a figment of the imagination preached through a religion that is built on lies, among other things. There's no actual proof that any of it is true, only the Bible. In fact Outside the Bible , There's no evidence of GOD, Jesus, or the Holy Spirit... so posting this kind of response only shows you don't have a clue what reality is....\n\n \n You're the one who voted for Obama, aren't you? So what would you know about anything?\n \n \nOh.. Hey EZ... I'm back from my Vacation... good to see ya....emoticon_xhoho\n\n \n \n Hey! Welcome back. Did you go anyplace fun? emoticon_xbye", 
   {}, 
   418218, 
   null, 
   1291334760.0
  ], 
  [
   418289, 
   null, 
   "Xcaliber", 
   "You're the one who voted for Obama, aren't you? So what would you know about anything?\n\n \n I know a little yes.. enough to know God is a Joke and Jesus was just a man, if he was even that....\n \n \nHey! Welcome back. Did you go anyplace fun? emoticon_xbye\n\n \n Didn't do anything special, after the election I went teabag hunting for a weekend, that was pretty fun....lol...\n \n Na mate, I just kicked back and tried to get some work done... Didn't go anywhere special...", 
   {}, 
   418275, 
   null, 
   1291342560.0
  ], 
  [
   418295, 
   null, 
   "Easyrider", 
   "\n \n Na mate \n\n \n Aussie? New Zealand? England? What?", 
   {}, 
   418289, 
   null, 
   1291347060.0
  ], 
  [
   418402, 
   null, 
   "Xcaliber", 
   "lol.. American...\n \n I have a lot of Internet Contacts in England and other places so It's kind of a habit I picked up....", 
   {}, 
   418295, 
   null, 
   1291449060.0
  ], 
  [
   418593, 
   null, 
   "Easyrider", 
   "lol.. American...\n \n I have a lot of Internet Contacts in England and other places so It's kind of a habit I picked up....\n\n \n Cool.\n \n Got something for you:\n \n Bush Approval Rating Higher Than Obama's\n \n Bush job approval rating higher than Obama's - James Hohmann - POLITICO.com\n \n Gotta love it!!\n \n emoticon_xbouncer", 
   {}, 
   418402, 
   null, 
   1291681680.0
  ], 
  [
   418598, 
   null, 
   "Xcaliber", 
   "Cool.\n \n Got something for you:\n Bush Approval Rating Higher Than Obama's\n Bush job approval rating higher than Obama's - James Hohmann - POLITICO.com\n Gotta love it!!\n emoticon_xbouncer\n\n \n You're so desperate it's pathetic. Did you even READ the article or did you just post after reading the title?. I bet you wet yourself when you read the title...lol..\n \n His Approval rating when he left Office was an astounding 25%.. And that was after 8 years of being in office. Obama has been there 2 years and his approval rating is 46%.. Not great but still better than Bush.\n \n That stupid Gallop poll was probably the results of asking 1000 teabaggers what they thought but I seriously doubt the rest of the country feels the same... \n \n Nothing to worry about though, when the teabaggers Fail miserably to keep their promises they will be voted out in a reverse landslide and Obama will be re-elected...deal with it.", 
   {}, 
   418593, 
   null, 
   1291686300.0
  ], 
  [
   418632, 
   null, 
   "jazyjason", 
   "You're so desperate it's pathetic. Did you even READ the article or did you just post after reading the title?. I bet you wet yourself when you read the title...lol..\n \n His Approval rating when he left Office was an astounding 25%.. And that was after 8 years of being in office. Obama has been there 2 years and his approval rating is 46%.. Not great but still better than Bush.\n \n That stupid Gallop poll was probably the results of asking 1000 teabaggers what they thought but I seriously doubt the rest of the country feels the same... \n \n Nothing to worry about though, when the teabaggers Fail miserably to keep their promises they will be voted out in a reverse landslide and Obama will be re-elected...deal with it.\n\n \n \n I REALLY hope the GOP nominates Palin in 2012... Oh I really hope they do...", 
   {}, 
   418598, 
   null, 
   1291720140.0
  ], 
  [
   418637, 
   null, 
   "Xcaliber", 
   "I REALLY hope the GOP nominates Palin in 2012... Oh I really hope they do...\n\n \n lol.. it would only prove to the world that the GOP is not seriously concerned about the American People.. It would be fun to watch the fall of the GOP though...lol", 
   {}, 
   418632, 
   null, 
   1291738080.0
  ], 
  [
   418660, 
   null, 
   "Easyrider", 
   "I REALLY hope the GOP nominates Palin in 2012... Oh I really hope they do...\n\n \n At the rate your radical left-wing liberal Obama is going down the toilet she'll win, and then you can be even more miserable than you already are.", 
   {}, 
   418632, 
   null, 
   1291774560.0
  ], 
  [
   418712, 
   null, 
   "pappillion001", 
   "At the rate your radical left-wing liberal Obama is going down the toilet she'll win, and then you can be even more miserable than you already are.\n\n \n Talk about setting yourself up for disappointment, brother Republicans are on track to derail themselves again in their bid for power. They seem to think they have a mandate to throw everything Obama has done out the window and replace it with their idea of government. Not the case. What people want is for government to work. They really don't care about either side right now they just want it to work the way they expect it to.", 
   {}, 
   418660, 
   null, 
   1291832880.0
  ], 
  [
   418727, 
   null, 
   "Matthew", 
   "Talk about setting yourself up for disappointment, brother Republicans are on track to derail themselves again in their bid for power. They seem to think they have a mandate to throw everything Obama has done out the window and replace it with their idea of government. Not the case. What people want is for government to work. They really don't care about either side right now they just want it to work the way they expect it to.\n\n \n Indeed. Watching them claim a mandate would be hilarious, if it weren't for the fact that it will just make the problem worse.\n \n Every time Republicans are given a chance to govern they screw things up and then say, \"See! We told you government can't do anything right!\" It's why, to this day, I still regard Ronald Reagan's presidency as the worst political phenomenon of the last 100 years. The ideological repercussions of his affable incompetence are still being felt. W wouldn't have been possible without him.", 
   {}, 
   418712, 
   null, 
   1291852560.0
  ], 
  [
   418732, 
   null, 
   "Xcaliber", 
   "It's because they let God do their thinking for them, and Going by the condition the entire world is in we know That God is Incompetent to say the least... Oh wait he would have to exist first..lol...", 
   {}, 
   418727, 
   null, 
   1291855800.0
  ], 
  [
   418733, 
   null, 
   "Easyrider", 
   "\n \n Every time Republicans are given a chance to govern they screw things up and then say, \"See! We told you government can't do anything right!\" It's why, to this day, I still regard Ronald Reagan's presidency as the worst political phenomenon of the last 100 years. The ideological repercussions of his affable incompetence are still being felt. \n\n \n You're deluded, as usual. Carter and Obama are the two worst. Both were / are incompetent.\n \n Revisiting Liberal Myths - Reagan and the Deficit\n \n President Reagan entered the White House with an attitude of working honest deals with the Congress on spending. He wanted more defense spending, lower entitlement spending, lower tax rates which would boost the economy (and thus revenues) and seemed to achieve that agreement with Congress in both 1981 and 1982. However, despite getting concessions on taxes, the Democratic-controlled House of Representatives never once cut spending, and the actual budgets were higher than what Reagan asked for 7 out of 8 years. This attitude of \"cut spending later\" helped continue the debt trends that began under Ford and Carter. By the end of Reagans terms, debt had increased by $2 trillion.\n \n Actual budget figures in the link below:\n \n The President Reagan Information Page:Budget Myths\n \n President Reagan was able to sign into law the tax cuts in late 1981 after an attempt by congressional Democrats to block the cuts (i.e. \"gridlock\") failed...but at the reduced rate of 25%, and an effective rate of 23% since the cuts would be over three years (5% in 1981, retroactive; 10% for 1982; 10% for 1983). \n \n All taxpayers received these cuts, not just the rich as anti-Reagan revisionists would have you believe, as shown in the table of effective tax rates. And, also contrary to liberal recounting, the tax cuts helped spur the economy (see the expansion). In addition, income tax revenues increased during this period and the share of taxes paid by the rich increased also! In other words, the liberals have been lying to you. \n \n The Reagan Information Page:The Tax Cuts\n \n The smallest amount by which a Reagan budget was increased by the Democrat-controlled House of Representatives was $50 billion. The government shut down on numerous occasions because of budget battles between Reagan and Congress. Interestingly, back then no one blamed the Speaker of the House for shutting down the government. They blamed the President. \n \n When Reagan's tax plan was passed in 1982, there were supposed to be two dollars in spending cuts for every dollar of tax cuts. But spending never got cut. In the end, for every new dollar of tax revenue, the Democrats spent $1.80. Rather than cut spending, they let the government shut down and blamed Reagan. \n \n House Atreides - The Truth About Tax Cuts\n \n You're busted.", 
   {
    "unicode_changes_made": true
   }, 
   418727, 
   null, 
   1291857000.0
  ], 
  [
   418739, 
   null, 
   "Xcaliber", 
   "Wrong as Usual...\n \n When Reagan took Office the National Debt was 1 trillion dollars, it tripled in his 8 years.. and under Bush Senior running under the same policies the Debt increased another third to 4 trillion in his four years. Most of this increase came from the massive tax cuts in 1981 and the fact that the Government did not reduce spending. Just like with what is happening now, Bush's tax cuts reduced revenues something like 715 billion dollars, but he increased spending and took us into two wars. When are you Conservatives going to realize you can't have things both ways?. when you cut taxes thus reducing revenues you MUST coincide by cutting the spending. You want low taxes but you also want things that need to be paid for... it's simple math yet most politicians don't seem to be able to figure that out. \n \n Reagan was possibly one of the Worst Presidents we've ever had, next to Bush in my opinion. Now the GOP is playing hard ball to extend the very policies that got us into this mess, how stupid can people be.", 
   {}, 
   418733, 
   null, 
   1291861560.0
  ], 
  [
   418754, 
   null, 
   "jazyjason", 
   "At the rate your radical left-wing liberal Obama is going down the toilet she'll win, and then you can be even more miserable than you already are.\n\n \n \n Well looking at the tax compromise's it seems as if the Dems will go down with the ship with the republicans on this one cause we got no choice. You want Rome to really burn elect Gingrich.... he's the con man that is actually smart enough to run the country into the ground and pocket the money with all his special interest buddies.\n \n \n Sorry man. Now that I'm Union democrat all the way. I don't want some rich old fart (except Mr. Buffet) making profits off my work. let alone seeing all our jobs dry up just cause scrooge wants to reduce shipping or have even more of our imports drop off cause your buddies want a little more pocket change instead of employee's...\n \n The hottest trains that come out of our yard are UPS, Auto, and Ethanol. UPS is different since it comes from global. But Auto comes from the local Honda plant, and Ethanol from the local Chevron.\n \n Put a shark like Gingrich in place and we'd have furloughs and probably the yard shut down cause he'd get kickbacks from some Saudi.... Yeah screw that man...\n \n Taxes pay for infrastructure and this country has some of the WORST.... so hell a little bit more here and there for safer roads and safer Americans is by all means OK with me...", 
   {}, 
   418660, 
   null, 
   1291882620.0
  ], 
  [
   418766, 
   null, 
   "Xcaliber", 
   "All taxpayers received these cuts, not just the rich as anti-Reagan revisionists would have you believe, as shown in the table of effective tax rates. And, also contrary to liberal recounting, the tax cuts helped spur the economy (see the expansion). In addition, income tax revenues increased during this period and the share of taxes paid by the rich increased also! In other words, the liberals have been lying to you. \n\n \n I can see why this would be posted as a Myth.. \n \n EZ man, you can't honestly believe this is true?.. If so then there's no help for you.\n It's impossible to Lower taxes and at the same time increase revenues... While I will agree that Reagan did pass across the board tax cuts they in no way spurred the economy. The Decrease in Revenues added to the increased spending in FACT tripled the National Debt in 8 years. The Seemingly booming economy was merely an illusion created by propaganda to sell his bad policies to the American People. Behind closed doors all Reagan cared about was the rich cooperation's who pushed an Obscure Hollywood Actor into the White House. In My Opinion one of the Worst, and most dangerous Presidents of the last 100 years. Don't forget he did sell weapons to Iran....emoticon_frazzled\n \n \n And I'll admit.. I voted for the guy in his first term... He sold me with his lies too...", 
   {}, 
   418733, 
   null, 
   1291911840.0
  ], 
  [
   418867, 
   null, 
   "Easyrider", 
   "I can see why this would be posted as a Myth.. \n \n EZ man, you can't honestly believe this is true?.. If so then there's no help for you. It's impossible to Lower taxes and at the same time increase revenues... \n\n \n Tell that to JFK. He did the same thing Reagan did, and revenues increased both times. \n \n \"Kennedy blamed an early sixties economic slump in part on high taxes. Under his auspices, Congress cut the top rate down to 70%. As a result, the economy grew at a 42% clip and treasury reported a 62% revenue increase. Unfortunately, the end of the Vietnam War and Lyndon Johnson's Great Society slowed the growth. The economy sputtered through the seventies bottoming out in 1980. The country desperately turned to Ronald Reagan to restore the American dream. Reagan cut the top rate from 70% to 28%. Government revenues doubled from $500 billion in 1980 to over $1 trillion by 1990. A similar phenomenon occurred under the Bush tax cuts.\"\n \n Do Tax Cuts Lead to Increased Revenue? - National American history | Examiner.com", 
   {
    "unicode_changes_made": true
   }, 
   418766, 
   null, 
   1292019240.0
  ], 
  [
   418875, 
   null, 
   "Xcaliber", 
   "Tell that to JFK. He did the same thing Reagan did, and revenues increased both times. \n \"Kennedy blamed an early sixties economic slump in part on high taxes. Under his auspices, Congress cut the top rate down to 70%. As a result, the economy grew at a 42% clip and treasury reported a 62% revenue increase. Unfortunately, the end of the Vietnam War and Lyndon Johnson's Great Society slowed the growth. The economy sputtered through the seventies bottoming out in 1980. The country desperately turned to Ronald Reagan to restore the American dream. Reagan cut the top rate from 70% to 28%. Government revenues doubled from $500 billion in 1980 to over $1 trillion by 1990. A similar phenomenon occurred under the Bush tax cuts.\"\n\n \n Yeah I can find hundreds of reports claiming that Reagan's tax cuts increased revenue but that don't make it true. you're just mis-informed.. I guess there is no help for you.", 
   {
    "unicode_changes_made": true
   }, 
   418867, 
   null, 
   1292039340.0
  ], 
  [
   418888, 
   null, 
   "Easyrider", 
   "Yeah I can find hundreds of reports claiming that Reagan's tax cuts increased revenue but that don't make it true. you're just mis-informed.. I guess there is no help for you.\n\n \n Hey, Obama is your guy. He's pushing for the Bush tax cuts to be continued. So is Slick Willie Clinton. How do you like Obama now? Another promise broken by Obama. Looks like you're again on the wrong side of the tracks.", 
   {}, 
   418875, 
   null, 
   1292077080.0
  ], 
  [
   418891, 
   null, 
   "Xcaliber", 
   "Hey, Obama is your guy. He's pushing for the Bush tax cuts to be continued. So is Slick Willie Clinton. How do you like Obama now? Another promise broken by Obama. Looks like you're again on the wrong side of the tracks.\n\n \n Actually I'm disgusted with Obama, He has no balls to stand up against the GOP like Clinton did.\n The Democrats in the House and Senate ( Who are still in Charge) by the way, won't stand for the blackmail tactics of the GOP and those tax cuts will expire before they even agree on something . It was those tax cuts that started our current spiral into debt, just like the Reagan cuts did, and every other time some lame President decided that Votes were more important than balancing the budget.", 
   {}, 
   418888, 
   null, 
   1292082480.0
  ], 
  [
   418905, 
   null, 
   "Easyrider", 
   " It was those (Bush) tax cuts that started our current spiral into debt, just like the Reagan cuts did, and every other time some lame President decided that Votes were more important than balancing the budget.\n\n \n That's wrong. After the Bush tax cuts were instituted the economy picked up, and government revenues increased.\n \n It was the Clinton-era sub-prime lending mess that prom queen Barney Franks let fester under his watch that eventually led to the current economic mess.\n \n Bush tax cuts boosted federal revenue\n \n By 2003, Mr. Bush grasped this lesson. In that year, he cut the dividend and capital gains rates to 15 percent each, and the economy responded. In two years, stocks rose 20 percent. In three years, $15 trillion of new wealth was created. The U.S. economy added 8 million new jobs from mid-2003 to early 2007, and the median household increased its wealth by $20,000 in real terms. \n \n But the real jolt for tax-cutting opponents was that the 03 Bush tax cuts also generated a massive increase in federal tax receipts. From 2004 to 2007, federal tax revenues increased by $785 billion, the largest four-year increase in American history. \n \n DWYER: Bush tax cuts boosted federal revenue - Washington Times\n \n Why do you always buy into liberal lies? It makes you look stupid when you try to continue your left-wing fallacies. This must be the 10th time you've gone down in flames lately.", 
   {}, 
   418891, 
   null, 
   1292102340.0
  ], 
  [
   418906, 
   null, 
   "Xcaliber", 
   "you are truly delusional. The Bush tax cut made the Rich richer but did nothing for the economy. Reduced revenues added to increased spending led to this mess and you can deny it all you want. It's a matter of HISTORY that Reagan tripled the National debt, Bush senior added another 1 trillion to that and after Clinton Got it paid down and was running under a surplus Bush jr. came in and tripled the number his daddy left.. Matter of History so stay in denial all you want your wrong...", 
   {}, 
   418905, 
   null, 
   1292110260.0
  ], 
  [
   418922, 
   null, 
   "Easyrider", 
   "[QUOTE=Xcaliber;418906]you are truly delusional. The Bush tax cut made the Rich richer but did nothing for the economy.QUOTE]\n \n That's hog drivel.\n \n In the 8 Years Since the Bush Tax Cuts, Tax Revenues Increased 21.42% but Government Spending Increased 72.27%.\n \n December 8, 2010 \n \n Over the past 8 years since the Bush tax cuts went into effect, even with the recession, Federal revenues increased 21.42%. But during that same time period, Congress increased spending by 72.27%. The United States Government doesn't have a tax receipt problem, it has an out-of-control spending problem.\n \n In the 8 Years Since the Bush Tax Cuts, Tax Revenues Increased 21.42% but Government Spending Increased 72.27%. | Joshua Kennon\n \n You're busted again.", 
   {
    "unicode_changes_made": true
   }, 
   418906, 
   null, 
   1292171280.0
  ], 
  [
   418924, 
   null, 
   "Xcaliber", 
   "No I'm not busted you are simply mis-informed.\n Tax Cuts Raise Revenue COMPLETELY DEBUNKED\n \n \nUnder Reagan, the tax cuts led to stagnant government revenue from individual taxpayers. It wasn't until he started raising taxes the government revenue started to increase. However, Reagan spent like a \"tax and spend\" liberal, increasing the debt/GDP ratio in each year of his presidency from 33% to 51%.\n Under Bush II, the tax cuts led to a 6.7% decline in revenue for the first 4 years of his presidency. Because his spending increases far outpaced the decrease in government revenue, the total national debt outstanding increased 41%.\n To compare, Clinton increased taxes on the upper-income taxpayers, which led to a 97% increase in government revenue. He grew the economy at a health pace. He decreased the debt/GDP ratio in each year starting in 1995 of his presidency.\n\n \n Bush drove this country into a ditch , and when the Bush tax cuts expire and we finally see some Increase in revenues maybe, just maybe we can get back on the road to recovery.", 
   {}, 
   418922, 
   null, 
   1292175120.0
  ], 
  [
   419043, 
   null, 
   "jazyjason", 
   "=Easyrider;418922\n \n You're busted again.\n\n \n yeah a spending problem increasing our deficit by 800 BILLION  dollars by not taxing the muckety mucks that outsource American jobs to china. Oh and where is this borrowed revenue coming from to lets the super rich get a break? China.\n \n What are the Walton's the owners of wal mart getting by this deal? a 32 BILLION dollar TAX BREAK! I wonder what we could do with 32 BILLION dollars hmm?\n \n You think their going to increase employee wages? Healthcare? Pump it back into the economy? HELL NO....\n \n What a scandle. It's the end of this country as we flippin know it people and personally it makes my stomach hurl. Go ahead Easy. beg the Walton's for your lost job back, or your wages, or to pay for your kids books out of charity when the state funds run dry.... GO AHEAD AND BEG....", 
   {}, 
   418922, 
   null, 
   1292309160.0
  ], 
  [
   419137, 
   null, 
   "Easyrider", 
   "yeah a spending problem increasing our deficit by 800 BILLION  dollars by not taxing the muckety mucks that outsource American jobs to china. Oh and where is this borrowed revenue coming from to lets the super rich get a break? China.\n\n \n The problem with you is you have a warped view of things. The reason companies are outsourcing to other countries is because you flaming tax-and-spend liberals keep raising their taxes and burying them in tons of bureaucratic paperwork. Keep it up and the corporations themselves will move off-shore.\n \n In case you haven't noticed, corporations and the rich are bailing out of New York, New Jersey, California, and many other places where they've been over-taxed by your DUMBOCRATS. \n \n And you still don't get it. Go after the rich unfairly (anything above 40% taxes is unfair, IMO) and they won't play your STUPID GAMES. They'll move to another state or go offshore. Then who have you got left to go after? That's right - the middle class. People like you are bankrupting the country. You have zero common sense and you're evidently unable to see the big picture.\n \n From: David Brooks: Suffering paralysis of the state\n \n \"New Jersey can't afford to build its tunnel, but benefits packages for the state's employees are 41 percent more expensive than those offered by the average Fortune 500 company. These benefits costs are rising by 16 percent a year. \n \n \"New York City has to strain to finance its schools but must support 10,000 former cops who have retired before age 50. \n \n California can't afford new water projects, but state cops often receive 90 percent of their salaries when they retire at 50. The average corrections officer there makes $70,000 a year in base salary and $100,000 with overtime. (California spends more on its prison system than on its schools.) \n \n States across the nation will be paralyzed for the rest of our lives because they face unfunded pension obligations that, if counted accurately, amount to $2 trillion &#8211; or $87,000 per plan participant. \n \n All in all, governments can't promote future prosperity because they are strangling on their own self-indulgence.\"\n \n David Brooks: Suffering paralysis of the state | News for Dallas, Texas | Dallas Morning News | Opinion: Viewpoints\n \n All big spending, Democratic states. You are blind.\n \n \nGo ahead Easy. beg the Walton's for your lost job back, or your wages, or to pay for your kids books out of charity when the state funds run dry.... GO AHEAD AND BEG....\n\n \n Dry up.", 
   {}, 
   419043, 
   null, 
   1292425020.0
  ], 
  [
   419218, 
   null, 
   "jazyjason", 
   "The problem with you is you have a warped view of things. The reason companies are outsourcing to other countries is because you flaming tax-and-spend liberals keep raising their taxes and burying them in tons of bureaucratic paperwork. Keep it up and the corporations themselves will move off-shore.\n \n \n\n \n Wrong. It's all in the name of PROFIT Easy! Come on! What do the rich want more of? money! Duh! They don't want to pay health care or 401k or worker benefits! They would rather toss a bag of rice to some guy in China as their HMO and go to town working off his back!\n \n Taxes are irrelevant at this point. It's all about cheap labor. The only issue with taxes now is us borrowing the 800 billion to pay for the Waltons and other muckety mucks to go and invest it in themselves instead of the state and the government like everyone else!", 
   {}, 
   419137, 
   null, 
   1292480460.0
  ], 
  [
   419219, 
   null, 
   "Xcaliber", 
   "Go after the rich unfairly (anything above 40% taxes is unfair, IMO) \n\n \n Ok, so 40% in your own words is fair?...\n \n Under Clinton Taxes for the rich were 36%.. that's less than your 40% range. The economy was BOOMING... Bush Dropped that to 23%... As well as entered us into 2 wars and increased spending across the board. 36% down to 23% cost an estimated 800 billion decrease in revenues... However with the increase in spending plus the two wars we were forced to BORROW that 800 billion and it still wasn't enough. If the Bush tax cuts expire we will get that revenue back plus some because over the last ten years the rich have netted a 300% increase in their wealth. Simply Math EZ, you can't spend more than you earn, You Right Wing Fundies want your cake but you don't want to pay for it... that's why we are in the mess we are in.", 
   {}, 
   419137, 
   null, 
   1292481900.0
  ], 
  [
   419292, 
   null, 
   "Easyrider", 
   "Ok, so 40% in your own words is fair?...\n \n Under Clinton Taxes for the rich were 36%.. that's less than your 40% range. The economy was BOOMING... Bush Dropped that to 23%... As well as entered us into 2 wars and increased spending across the board. 36% down to 23% cost an estimated 800 billion decrease in revenues... However with the increase in spending plus the two wars we were forced to BORROW that 800 billion and it still wasn't enough. If the Bush tax cuts expire we will get that revenue back plus some because over the last ten years the rich have netted a 300% increase in their wealth. Simply Math EZ, you can't spend more than you earn, You Right Wing Fundies want your cake but you don't want to pay for it... that's why we are in the mess we are in.\n\n \n Listen, twinkle toes,  as of yesterday your fellow economic Einsteins, (mmm mmm mmm) Barack Hussein Obama, and Dirty Harry Reid, were still trying to cram a $1.1 TRILLION Omnibus bill loaded with 6,600 budget busting earmarks down our throats. But they were shut down by the Republicans. \n \n So save your fluff for someone who might believe it.", 
   {}, 
   419219, 
   null, 
   1292587440.0
  ], 
  [
   419297, 
   null, 
   "Xcaliber", 
   "Listen, twinkle toes,  as of yesterday your fellow economic Einsteins, (mmm mmm mmm) Barack Hussein Obama, and Dirty Harry Reid, were still trying to cram a $1.1 TRILLION Omnibus bill loaded with 6,600 budget busting earmarks down our throats. But they were shut down by the Republicans. \n\n \n Once again you change the subject once you've been proven wrong.\n \n as for your current statement... How is that any different than the GOP trying to add another trillion to the deficit by extending the tax cuts for their rich buddies?... don't you get it Doofus, All Politicians are bad, The GOP is no better than the Liberals.. Although in the last 50, 60 years the Democrats do have a better record concerning balanced budgets...that is fact so try all you want to prove that wrong...\n \n I place politicians just above religious nuttbags , at least most politicians are only concerned with taking my money ...", 
   {}, 
   419292, 
   null, 
   1292597520.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Are Christians Hypocrites?", 
  "url": "http://www.4forums.com/political/biblical-contradictions/14595-christians-hypocrites.html", 
  "breadcrumbs": [
   "Biblical Contradictions"
  ], 
  "id_number": 14595, 
  "discussion_files": [
   [
    "20026.html", 
    "http://www.4forums.com/political/biblical-contradictions/14595-christians-hypocrites-print.html"
   ], 
   [
    "20027.html", 
    "http://www.4forums.com/political/biblical-contradictions/14595-christians-hypocrites-4-print.html"
   ], 
   [
    "20028.html", 
    "http://www.4forums.com/political/biblical-contradictions/14595-christians-hypocrites-3-print.html"
   ], 
   [
    "20029.html", 
    "http://www.4forums.com/political/biblical-contradictions/14595-christians-hypocrites-2-print.html"
   ]
  ], 
  "identifier": 14595
 }
]