[
 [
  [
   412558, 
   null, 
   "TTT", 
   "That's a great shame for the entire country! The Latvian Minister of Defence Imants Liegis takes part in the flight of the old Latvian Nazi organization The Forest Brothers and prides himself being a son of Waffen SS vet. This time you can't say that the sins of the fathers mustn't be visited upon the children. That's Liegis' deliberate choice of political position. He admits that he'd grown up among Waffen SS legionaries. And such people get high offices in Latvia instead of answering for Fascist ideology propagation in International Anti-Fascist Organizations and various Shoah victims associations! No wonder that Latvia is one of the most odious dirty spots on the EU body. They are proud of their ancestors' co-operation with Hitler's army during WW II. They grant discounts to Forest Brothers. They oppress Jews and gypsies and other minority groups. It is very strange that Human Rights Watchers pay no attention to this ugly Nazi hotbed while being at arms against French government.", 
   {
    "post_info": {
     "post_title": "Fascist in the Latvian government"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1284656040.0
  ], 
  [
   414900, 
   null, 
   "INERinside", 
   "In April, 2010 US Department of Justice decided to stop actions of Office Special Investigations due to the fact that most part of Nazi accomplices and criminal has been died. Well, this is truth USA has a official version and so called run-time one as usual.\n So, all those tales about natural end of Nazi put up a smoke-screen. In fact, Washington is standing clear step by step of close-knit Fascism reproaching! More over Americans came to one thing that by their support in East Europe neo-Nazi moods is blowing! There are no doubts that with the present course of events the work of OSI could contravene for main policy of the White House!", 
   {
    "post_info": {
     "post_title": "USA phases down to detect Nazi criminals!"
    }
   }, 
   412558, 
   null, 
   1286989440.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Fascist in the Latvian government", 
  "url": "http://www.4forums.com/political/european-politics-economics/14622-fascist-latvian-government.html", 
  "breadcrumbs": [
   "European politics/Economics"
  ], 
  "id_number": 14622, 
  "discussion_files": [
   [
    "25180.html", 
    "http://www.4forums.com/political/european-politics-economics/14622-fascist-latvian-government-print.html"
   ]
  ], 
  "identifier": 14622
 }
]