[
 [
  [
   413892, 
   null, 
   "pandion", 
   "Survey: Americans don't know much about religion\n But atheists actually know more than Protestants and Catholics, Pew Forum finds\n \n After having read what christians on internet forums have to say for a number of years, this doesn't surprise me at all. One person commented that atheists have probably spent more time thinking about religion than protestants and catholics.\n \n Notice that the poll also revealed a correlation with education. The more educated a person is, the more they tend to know about religion. I wonder if that is related to the negative correlation between creationism and education (i.e., the more educated a person is, the less likely that person is to be a creationist.)?", 
   {
    "post_info": {
     "post_title": "Survey: Americans don't know much about religion"
    }
   }, 
   null, 
   null, 
   1285700460.0
  ], 
  [
   413896, 
   null, 
   "snakespit", 
   "Not surprising at all. My own experience was that the more I learned about religion, the more I turned away from it.", 
   {}, 
   413892, 
   null, 
   1285704240.0
  ], 
  [
   413898, 
   null, 
   "Xcaliber", 
   "Just proves that most Americans will believe anything they hear instead of reading it for themselves. Like others have said, the more I learned about delusion,,,, I mean religion , the further away from it I got.", 
   {}, 
   413896, 
   null, 
   1285704660.0
  ], 
  [
   413904, 
   null, 
   "Sandycane", 
   "Just proves that most Americans will believe anything they hear instead of reading it for themselves. Like others have said, the more I learned about delusion,,,, I mean religion , the further away from it I got.\n\n \n Me three but, it didn't start out that way. When I was a zealot, I tried to study all I could on religion to be better prepared for forum arguments with non-theists...but, as has been stated, the more I learned, the less I like about it.\n I suppose that's why the religion mandates that you believe on faith - in other words, take someone else's word for it and don't ask questions.emoticon_xdonno", 
   {}, 
   413898, 
   null, 
   1285709220.0
  ], 
  [
   413912, 
   null, 
   "sinjin", 
   "When it comes to religion, trust an atheist. Check!", 
   {}, 
   413904, 
   null, 
   1285711620.0
  ], 
  [
   413936, 
   null, 
   "Easyrider", 
   "When it comes to religion, trust an atheist. Check!\n\n \n <Flush<\n \n If you people knew what you think you know you'd be Bible-thumping Christians instead of Hell-bound, spiritually-challenged infidels.\n \n emoticon_xbouncer", 
   {}, 
   413912, 
   null, 
   1285718280.0
  ], 
  [
   413943, 
   null, 
   "sinjin", 
   "<Flush<\n \n If you people knew what you think you know you'd be Bible-thumping Christians instead of Hell-bound, spiritually-challenged infidels.\n\n \n The term \"spiritual\" has no meaning for me. \n It's a con, pure and simple.\n \n There are no spirits nor spiritual realm.", 
   {}, 
   413936, 
   null, 
   1285719480.0
  ], 
  [
   413948, 
   null, 
   "Xcaliber", 
   "<Flush<\n \n If you people knew what you think you know you'd be Bible-thumping Christians instead of Hell-bound, spiritually-challenged infidels.emoticon_xbouncer\n\n \n Haven't you realized by now that your threats of fire and brimstone mean nothing to someone with a brain?.. hell is another delusion pushed by bible thumping XXXXXX to try to scare people into la la land... \n \n <FLUSH<", 
   {}, 
   413936, 
   null, 
   1285722720.0
  ], 
  [
   413954, 
   null, 
   "Easyrider", 
   "Haven't you realized by now that your threats of fire and brimstone mean nothing to someone with a brain? \n\n \n First show me the brain. \n \n By the way, here's your left wing hero Obama, believing in Jesus Christ.\n \n Obama Talks About His Faith - NYTimes.com\n \n And according to Oprah and all the liberal rags, etc., he's the smartest man on earth.\n \n Now how are you going to act? ROTFLOL!", 
   {}, 
   413948, 
   null, 
   1285724160.0
  ], 
  [
   413964, 
   null, 
   "Sandycane", 
   "First show me the brain. \n \n By the way, here's your left wing hero Obama, believing in Jesus Christ.\n \n Obama Talks About His Faith - NYTimes.com\n \n And according to Oprah and all the liberal rags, etc., he's the smartest man on earth.\n \n Now how are you going to act? ROTFLOL!\n\n \n So...what...is he your Buddy now?\n First you bash him and then you use him to defend your religion. :xbanghead\n Does your head ever hurt from all the flip-flopping around you do?emoticon_wow\n \n Here is what he was quoted as saying...\n \n \"I'm a Christian by choice,\" the president said. \"My family, frankly, they weren't folks who went to church every week. My mother was one of the most spiritual people I knew but she didn't raise me in the church, so I came to my Christian faith later in life and it was because the precepts of Jesus Christ spoke to me in terms of the kind of life that I would want to lead. Being my brothers and sisters' keeper, treating others as they would treat me, and I think also understanding that Jesus Christ dying for my sins spoke to the humility we all have to have as human beings, that we're sinful and we're flawed and we make mistakes and we achieve salvation through the grace of God.\"\n \n Mr. Obama went on: \"But what we can do, as flawed as we are, is still see God in other people, and do our best to help them find their own grace. That's what I strive to do, that's what I pray to do every day.'' Yet he said that as president, he also \"deeply believes that part of the bedrock strength of this country is that it embraces people of many faiths and of no faith.''\n \n emoticon_cry I'm still waiting for the atheist to run for president. \n That would be one courageous man/woman! emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   413954, 
   null, 
   1285733280.0
  ], 
  [
   413966, 
   null, 
   "Xcaliber", 
   "I don't remember anyone here claiming that Obama was the Smartest man on earth?.. The truth is he could be a retarded caveman and he would still be smarter than you or your buddy George W. \n \n The fact that Obama believes in the Jebus Myth only shows that he is Human, and susceptible to delusion just like most XXXXXX are. Doesn't make him a bad guy just a bit deluded is all, and besides... he's not running around telling every non-believer that they are going to burn in a pit of fire. You are the only M-O-R-O-N that does that.....", 
   {}, 
   413964, 
   null, 
   1285733880.0
  ], 
  [
   413989, 
   null, 
   "pandion", 
   "I don't remember anyone here claiming that Obama was the Smartest man on earth?.. The truth is he could be a retarded caveman and he would still be smarter than you or your buddy George W.\n\n That's a fact! Dubya's grades at Yale were less than stellar. I think that he got in as a legacy only because of the status of his father. Moreover, Dubya didn't even have the balls to honorably attend meetings to complete his reserve obligation, when he got into the reserves because of strings pulled by, again, his father. When Dubya was beginning his mediocre education at Yale (not because of the school, because of the student. Dubya apparently characterized himself as only an average student.), my brothers and I were serving in the regular Army. My older brother was shot down in a chopper over the highlands of Nam. He twice turned down a star (offered by the commanding general, USASC) to stay in but retired as a colonel. My younger brother was hit by a .50 cal. round his second day in Nam (it went through and through the shoulder of his flack jacket without touching him). He was also overrun and went hand to hand at Cam Ranh, as well as being ambushed once while outside the defensive perimeter. Both survived. \n \n As for me, I was an artilleryman. I attended OCS at Fr. Sill. We artillerymen did our killing from several miles away. It was never personal. We just dialed in a specified deflection, a specified elevation, and loaded a specified charge, and pulled the lanyard. Nothing personal. For my younger brother, it got personal.\n \nThe fact that Obama believes in the Jebus Myth only shows that he is Human, and susceptible to delusion just like most XXXXXX are. Doesn't make him a bad guy just a bit deluded is all, and besides... he's not running around telling every non-believer that they are going to burn in a pit of fire. You are the only M-O-R-O-N that does that.....\n\n In fact, in this country, where anyone who doesn't claim to be a christian has an ice cube's chance in hell of being elected to office. Any politician's claims to belief in the Jebus Myth must always be suspect, especially if that person is intelligent. Dubya claimed to believe in the myth, and I think that he actually does. I suspect that it may be a result of his alcohol fried brain.\n \n And yet, there are some non-thinkers who claim that christians are persecuted in this country. But, Christ said that his followers would be persecuted (according to the myth). As a result, christians must believe that they are being persecuted or they couldn't possibly be christians, thus, the persecution complex. In fact, since the days of \"In hoc signo vinces\" in 312, it has been the christians who have been doing the persecution. Anyone who claims otherwise hasn't actually paid attention to history.", 
   {}, 
   413966, 
   null, 
   1285744620.0
  ], 
  [
   414004, 
   null, 
   "jyoshu", 
   "Not surprising at all. My own experience was that the more I learned about religion, the more I turned away from it.\n\n \n Just keep in mind that's not everyone's experience--I had the opposite experience and the more I learned about secularism, the more I turned away from it. Perhaps people just tend to 'grow out' from what they started with. But my religiosity and faith is a result of having weighed evidence, not due to a lack of it.", 
   {}, 
   413896, 
   null, 
   1285773840.0
  ], 
  [
   414019, 
   null, 
   "sinjin", 
   "But my religiosity and faith is a result of having weighed evidence, not due to a lack of it.\nPlease don't answer that jury summons.emoticon_xangel", 
   {}, 
   414004, 
   null, 
   1285787760.0
  ], 
  [
   414022, 
   null, 
   "Sandycane", 
   "Please don't answer that jury summons.emoticon_xangel\n\n \n emoticon_xhoho Good one!emoticon_xgoodemoticon_xgood", 
   {}, 
   414019, 
   null, 
   1285788960.0
  ], 
  [
   414040, 
   null, 
   "jyoshu", 
   "Please don't answer that jury summons.emoticon_xangel\n\n \n If the evidence is there, it'll sway me. Just like you.\n Just because your experience with religion was one way doesn't mean everyone elses' is the same.", 
   {}, 
   414019, 
   null, 
   1285800060.0
  ], 
  [
   414047, 
   null, 
   "sinjin", 
   "If the evidence is there, it'll sway me. Just like you.\n Just because your experience with religion was one way doesn't mean everyone elses' is the same.\nI never had any \"bad\" experiences with my religious upbringing. My jesting jab was directed at the obvious fact that what constitutes convincing evidence for you falls well short of the mark for me. Witness testimony is the weakest form of evidence there is. \n I could never convict on it alone.", 
   {}, 
   414040, 
   null, 
   1285804200.0
  ], 
  [
   414058, 
   null, 
   "jyoshu", 
   "I never had any \"bad\" experiences with my religious upbringing. My jesting jab was directed at the obvious fact that what constitutes convincing evidence for you falls well short of the mark for me. Witness testimony is the weakest form of evidence there is. \n I could never convict on it alone.\n\n \n Then I'd say it's you that needs to stay off juries. Witness testimony alone has always been considered adequate evidence. If 4 unrelated people are in a convenience store that gets held up, and all 4 of them recognize the same perpetrator in a line-up, it would be pretty stupid not to convict the perpetrator.", 
   {}, 
   414047, 
   null, 
   1285810080.0
  ], 
  [
   414126, 
   null, 
   "trebor", 
   "Then I'd say it's you that needs to stay off juries. Witness testimony alone has always been considered adequate evidence. If 4 unrelated people are in a convenience store that gets held up, and all 4 of them recognize the same perpetrator in a line-up, it would be pretty stupid not to convict the perpetrator.\n\n \n Of course, if 4 people testify in court, and they all use the same phrases, and word orders for things, even if their are variations, it would be obvious they were couched, and their testimony would be thrown out.", 
   {}, 
   414058, 
   null, 
   1285869600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Survey: Americans don't know much about religion", 
  "url": "http://www.4forums.com/political/religion-debates/14648-survey-americans-dont-know-much-about-religion.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14648, 
  "discussion_files": [
   [
    "4291.html", 
    "http://www.4forums.com/political/religion-debates/14648-survey-americans-dont-know-much-about-religion-print.html"
   ], 
   [
    "4292.html", 
    "http://www.4forums.com/political/religion-debates/14648-survey-americans-dont-know-much-about-religion-2-print.html"
   ]
  ], 
  "identifier": 14648
 }
]