[
 [
  [
   28651, 
   null, 
   "Parcum", 
   "Forced Abortion Revealed\n \n \n Rochester Area Right To Life\n \n \n Donna Santa Marie's Forced Abortion\n \n Lawsuit Would Ask Supreme Court to Tackle Botched Abortions\n \n Washington, DC -- In a case which will determine whether women injured by abortion have any rights under the law, Norma McCorvey, the former \"Roe\" of Roe v. Wade and Sandra Cano, the former \"Doe\" of Doe v. Bolton (the two cases that brought legalized abortion on demand to America) are announcing that they are joining with 700 women who have been seriously injured by abortion to file an Amicus Curiae petition brief asking the U.S. Supreme Court to hear the case of Donna Santa Marie Et Al v. Whitman, Et Al.\n \n In addition to \"Roe\" and \"Doe\", 700 women who have been injured by abortion in similar circumstances will also file a Friend of the Court brief to show the Court that these conditions are widespread in the abortion industry.\n \n Many of these women will appear at a Monday press conference to testify about their own personal experience in abortion clinics and to testify that it is time for the abuse of women to come to an end. There must be a remedy for this injustice. Women will be present to be interviewed from the following states Mississippi; Oklahoma, Tennessee, Iowa, Texas, Michigan, Nebraska, California, Connecticut, and Florida.\n \n The Donna Santa Marie case is the first case in the nation to reach the Supreme Court on Cert. Petition asking the Supreme Court to define the rights of women against the abortion industry.\n \n Donna Santa Marie was a 16-year-old girl who was forced by her parents and abortionist to have an abortion against her will. Her father even punched her in the stomach to try to induce a miscarriage. The abortionist had to be called in to perform an abortion without her consent.\n \n Despite these horrific facts, New Jersey Federal Courts have ruled that Donna Santa Marie cannot sue the doctor, the abortionist, because the infant was not born alive and have cited Roe v. Wade as justification. If Roe v. Wade is supposed to be based on a woman's choice, how can she be forced to have an abortion and have no remedy under the law.\n \n The other women in the case were misled and deceived into having abortions. One of the Plaintiffs, Rosa Acuna, specifically asked her doctor: \"Is it a baby?\" Her doctor replied, \"Don't be stupid! It's just a blob of tissue.\"\n \n Later, after several weeks of bleeding, she was admitted to an emergency room and when she asked what the problem was, the nurses told her, \"They left part of your baby in you when you had the abortion.\"\n \n Rosa Acuna began to study fetal development and came to the horrible realization that she had killed her own baby, with severe psychological effects.\n \n If Roe v. Wade is based on a woman's right to choose, shouldn't that choice be voluntary and fully informed? Shouldn't there be a remedy against an abortionist who does not fully inform a woman of the nature and consequences of abortion? The Federal Courts in New Jersey have said no. The Supreme Court will be asked to reverse this decision and allow women who are injured by abortion to sue the abortionist.", 
   {
    "post_info": {
     "post_title": "STOP forced abortions on teenage girls!"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1071969600.0
  ], 
  [
   28908, 
   null, 
   "superbuddhaman", 
   "Wow, parcum, whatever news source you are getting this from is way behind. This story came out at least four months ago, probably more. And I might point out that several judges have reviewed the claims and found them to be quite lacking. Whatever the plaintiff's motivations might be, they are stretching their rights quite a bit, especially in the case of \"roe\" who's case came to the supreme court a full 30 years ago. Actually, the story I read so long ago was in regards to her wanting to have the decision reversed, something that was considered laughable. The judge the article used as their \"expert\" said that she would have to prove that she had somehow been harmed by the outcome of the case- which might explain this lawsuit.\n It is not uncommon for a woman to feel remorse after having an abortion, some even become the rabid protestors who carry signs and abuse other women in the same predicament they themselves experienced. What is ridiculous is someone trying to reverse a supreme court decision 30 years after the fact. \n What's even more ridiculous is the idea that some people would want to get rid of an entire medical procedure because of their personal bad experiences with it. There have been numerous \"botched\" operations, including those where somehow the doctors missed large instruments in their hurry to close the incision. Does that mean we should forget doing surgery altogether?\n I'm pretty sure that the number of women who have had the procedure, have been grateful for that freedom, and have had no medical side effects of the procedure greatly outnumber the ones who have had otherwise.\n The article also alludes to the idea that these women were urged and pressured into having an abortion against their will, basically that their own wills were overpowered by another. Perhaps these women were victims of very bad self proclaimed \"counselors\" who have instilled in them a sense of doubt and guilt that they would not have had without those machinations of people with ulterior motives.", 
   {}, 
   28651, 
   null, 
   1072186440.0
  ], 
  [
   28947, 
   null, 
   "Parcum", 
   "I'm only counter-arguing Mizmax's post that pro-lifers (or, \"anti-choicers\") are trying to control women's body and shove their views down their throat. Obviously, pro-lifers aren't the only ones doing this. I know people who have been pressuerd to have abortions by family and lovers.", 
   {}, 
   28908, 
   null, 
   1072226700.0
  ], 
  [
   28988, 
   null, 
   "mizmaxx", 
   "People get forced to have abortions, just like they get forced to have sex, neither is right, and neither has to do with the right to choose abortion or sex. \n \n Parcum, I posted that to *warn* people about the danger they could face, not to make a point.", 
   {}, 
   28947, 
   null, 
   1072248780.0
  ], 
  [
   28994, 
   null, 
   "Parcum", 
   "As did I. Don't ever let anyone force you into having an abortion, and never see a Planned Parenthood specialist if you're pregnant! See a trusted medical doctor who will give you a non-biased list of ALL your options.", 
   {}, 
   28988, 
   null, 
   1072253640.0
  ], 
  [
   28995, 
   null, 
   "superbuddhaman", 
   "As did I. Don't ever let anyone force you into having an abortion, and never see a Planned Parenthood specialist if you're pregnant! See a trusted medical doctor who will give you a non-biased list of ALL your options.\n\n \n On the flip side, you should never let anyone force you into carrying out a pregnancy you do not want.\n as for planned parenthood vs doctors, planned parenthood counselors are required to give you unbiased information and referrals, as far as i know, a doctor is not required to do either. Just because you do not like the work that planned parenthood does, it gives you no right to malign them or their employees. You have never proved that these people are anything but compassionate and qualified care givers and medical professionals.", 
   {}, 
   28994, 
   null, 
   1072254360.0
  ], 
  [
   28998, 
   null, 
   "Parcum", 
   "You should never trick a woman into commiting murder. \n \n And no, Planned Parenthood makes more money by reccomending abortions. They ALWAYS highly reccomend abortion.", 
   {}, 
   28995, 
   null, 
   1072255200.0
  ], 
  [
   33202, 
   null, 
   "Carman", 
   "You should never trick a woman into commiting murder. \n \n And no, Planned Parenthood makes more money by reccomending abortions. They ALWAYS highly reccomend abortion.\n\n \n I didn't realize that every woman who has had an abortion was 'tricked'. \n Planned Parenthood does not ALWAYS highly recommend abortion.", 
   {}, 
   28998, 
   null, 
   1075529220.0
  ], 
  [
   33223, 
   null, 
   "Parcum", 
   "Knowing people who have used Planned Parenthood or worked at their clinics, I can safely say that Planned Parenthood usually reccomends abortion. Just go to the Planned Parenthood website- you'll see abortion everywhere.", 
   {}, 
   33202, 
   null, 
   1075541520.0
  ], 
  [
   33228, 
   null, 
   "Carman", 
   "Knowing people who have used Planned Parenthood or worked at their clinics, I can safely say that Planned Parenthood usually reccomends abortion. Just go to the Planned Parenthood website- you'll see abortion everywhere.\n\n \n I've been to Planned Parenthood... now you say they USUALLY recommend... before you said ALWAYS, and they don't.. I'm not saying they never do, I just know that they do not always suggest that.. and I can safely say that as well, and not from word of mouth.", 
   {}, 
   33223, 
   null, 
   1075542600.0
  ], 
  [
   33281, 
   null, 
   "Robbie", 
   " Donna Santa Marie was a 16-year-old girl who was forced by her parents and abortionist to have an abortion against her will. Her father even punched her in the stomach to try to induce a miscarriage. The abortionist had to be called in to perform an abortion without her consent.\n \n Despite these horrific facts, New Jersey Federal Courts have ruled that Donna Santa Marie cannot sue the doctor, the abortionist, because the infant was not born alive and have cited Roe v. Wade as justification. If Roe v. Wade is supposed to be based on a woman's choice, how can she be forced to have an abortion and have no remedy under the law.\n \n\n \n I think you guys are missing out on the fact that the Judge ruled that there was not injury done to Donna Santa Marie. So much for the arguement that the unborn human is part of the mother. What a disgusting and unfortunate case. It wasn't born alive, so it doesn't matter.\n \n What unsettles me the most is that some of you don't seem to care. You sound more worried about the possible blow to abortion than the women who have been hurt.", 
   {}, 
   28651, 
   null, 
   1075586280.0
  ], 
  [
   33311, 
   null, 
   "Parcum", 
   "Carmen, it's senseless not to believe that Abortion is Planned Parenthood's #1 reccomendation. Does Planned Parenthood offer pregnancy support? No. Do they offer ultrasounds? No. Do they have maternity wards? No. What do they do? They give out pregnancy tests and do abortions. That's where they get their money- a quarter of all their revenue is from pre 13-week abortions. This is not even countig their later more expensive abortons that are also so common! They get $40 million a year for abortions alone.", 
   {}, 
   33281, 
   null, 
   1075602960.0
  ], 
  [
   33349, 
   null, 
   "superbuddhaman", 
   "Carmen, it's senseless not to believe that Abortion is Planned Parenthood's #1 reccomendation. Does Planned Parenthood offer pregnancy support? No. Do they offer ultrasounds? No. Do they have maternity wards? No. What do they do? They give out pregnancy tests and do abortions. That's where they get their money- a quarter of all their revenue is from pre 13-week abortions. This is not even countig their later more expensive abortons that are also so common! They get $40 million a year for abortions alone.\n\n \n parcum, they are like any other medical facility, saying this is like saying that just because my physician just happens to be do some surgeries, he will always tell me I need to have a surgery- because of course, he will make more money off me then. You dont like the fact that planned parenthood performs abortions, and so you feel the need to slanderize them. Some rabid pro=lifer told you that, and you swallowed it hook, line and sinker. You obviously have no clue into the idea of customer service- which is the field I work in. You try to do whatever is in the best interest of the customer, even if it sends them to your competition. IN the case of planned parenthood, it is against their policy to recommend that a patient do anything but dicuss it with their own support system, be that friends, family, clergy or whatever. Any employee of theirs who breaks that policy is making them liable for legal recourse, and will also be likely to lose their job.\n \n \n I wonder, does your high school offer logic courses? Please do us all a favor and invest in one.", 
   {}, 
   33311, 
   null, 
   1075616040.0
  ], 
  [
   33356, 
   null, 
   "Parcum", 
   "Being pro-life was by my own choice you brainwashed ignorant bird. Since you have no evidence to back up your claim, I don't have any reason to beleive you. I've given you evidence, and you're just too closed minded to accept it. Sad.", 
   {}, 
   33349, 
   null, 
   1075624680.0
  ], 
  [
   33359, 
   null, 
   "Carman", 
   "Carmen, it's senseless not to believe that Abortion is Planned Parenthood's #1 reccomendation. Does Planned Parenthood offer pregnancy support? No. Do they offer ultrasounds? No. Do they have maternity wards? No. What do they do? They give out pregnancy tests and do abortions. That's where they get their money- a quarter of all their revenue is from pre 13-week abortions. This is not even countig their later more expensive abortons that are also so common! They get $40 million a year for abortions alone.\n\n \n Again, I did not say that they did not recommend abortion... they do offer it as an option, but I have never heard of anyone being 'forced' to have one by Planned Parenthood. All I was disputing was when you said that they ALWAYS recommended it. They do offer pregnancy counseling, along with pregnancy testing. They also offer birth control, gynecological care, STD testing, infertility testing, sexual education counseling, prenatal care, adoption referrals.. etc...Almost all of these things are offered by my regular doctor, and probably most other doctors as well. They don't have a maternity ward at Planned Parenthood because they aren't a hospital, and you can go to your own hospital to have an ultrasound done, but if a clinic does an abortion themselves, they have to do an ultrasound first, to determine how far along the pregnancy is, because there are different procedures for different amounts of weeks. If an ob/gyn sees an ultrasound with severe problems, they will sometimes recommend an abortion too.\n \n All in all, I just thought that your remark that Planned Parenthood always recommended an abortion was wrong. They also offer services to men too, do you think they recommend abortion to them as well??\n I have nothing wrong with you being pro-life... I honestly don't. I think it's good that you stand up for what you believe in. But when you make a statement on how a woman is wrong to have an abortion even if her own life is in danger, I find that a little ignorant. I'm not saying that you are ignorant yourself, but I don't think you are as well informed on everything as you seem to think you are.\n \n And can I ask, are you male? If you are, you will never, ever be in any type of situation like that, so how can you decide what a woman should do when SHE is faced with a situation?", 
   {}, 
   33311, 
   null, 
   1075626840.0
  ], 
  [
   33442, 
   null, 
   "Parcum", 
   "That last statement, Carmen, is a logical fallacy- Ad hominum tu quoque. Simply because I'm a male doesn't autmatiaclly mean I have no opinion on the issue. During World War II Americans wern't Jews or German. Does that mean they didn't have a right to speak up against what the Nazis were doing?\n \n You must understand that the fetus is, scientifically and logically, a human being. Killing is, morally, murder. \n \n \"Always\" in the english language isn't always literal. If I say the cup is full it doesn't nessecarily mean it's completely full. We're speaking english, darling, not Aramaic. ;)", 
   {}, 
   33359, 
   null, 
   1075670820.0
  ], 
  [
   33446, 
   null, 
   "ROCC", 
   "Planned Parenthood Protects Rapists and Hurts Underage Girls aka Children.\n \n By Jon Dougherty\n © 2002 WorldNetDaily.com \n \n A pro-life research organization says data collected as a result of an ongoing investigation into teen pregnancy show that the number of underage girls being \"sexually exploited\" by adult men has reached \"epidemic\" proportions in the U.S. and that Planned Parenthood facilities are knowingly concealing such sex-abuse crimes. \n \n The firm, Life Dynamics, Inc., based in Denton, Texas, said in an eight-page summary of its data that \"among girls 15 and younger who become pregnant, between 60 percent and 80 percent of them are impregnated by adult men.\" Some girls are even as young as 10 years old, said the summary. \n \n \"In America today, we have reached the point where a junior high-school girl is more likely to become pregnant by an adult than by someone close to her own age,\" said the summary. \"One study concluded that the average age of men who father children with girls under 14 is now higher than the average age of men who father children with 18-year-olds.\" \n \n Life Dynamics researchers say they also found \"irrefutable evidence\" that pro-abortion-rights organizations such as Planned Parenthood and the National Abortion Federation \"knowingly conceal\" the crimes of sexual abuse of minors \"while aiding and abetting the sexual predators who commit them.\" \n \n While the initial summary \"reveals only a fraction of the evidence we have uncovered so far,\" researchers said, \"what we can already reveal is that our country is experiencing an epidemic of child sexual abuse.\" \n \n In its summary, analysts described how one researcher portrayed a 13-year-old girl made pregnant by a 22-year-old boyfriend. The teen-girl imposter telephoned over 800 Planned Parenthood and NAF facilities across the country. \n \n \"Her story was that she wanted an abortion because she and her boyfriend did not want her parents to find out about the sexual relationship,\" the summary stated. \n \n In every instance, the group said, the ages of the girl and her boyfriend \"were made perfectly clear\" to clinic workers. \"It was also made clear,\" said the summary, \"that the motivation for the abortion was to conceal this illicit sexual activity from the girl's parents and the authorities.\" \n \n Among the findings: \n \n \n Many clinic workers openly acknowledged that the aforementioned situation was illegal and that they were required to report it, but an \"overwhelming majority readily agreed\" to keep secret the illegal sexual contact; \n \n Some employees coached the caller on ways to avoid detection, how to circumvent parental involvement laws and what to say or not say when she visited the clinic; \n \n In a \"significant\" number of cases, the Life Dynamics caller was encouraged to lie about her age, or conceal her age and her boyfriend's age, or to give a false name; \n \n One clinic official told the caller she was required by state law to inform a parent of the abortion, but went on to advise the caller to simply use a fictitious address when checking in; \n \n In many instances, abortion clinic employees advised the caller that if \"someone were to find out about this situation,\" the boyfriend could go to jail, leading Life Dynamics researchers to conclude that \"in those situations, it was unmistakable that our caller was being instructed to be more careful about what information she gave out and to whom\"; \n \n Researchers said it was \"not uncommon\" for clinic employees to interrupt the caller \"when she started talking about her age or the age of her boyfriend\"; \n \n In other cases, clinic employees would advise the caller she had already provided too much information for them to help her, but would give her \"the number of another family planning facility\" and encourage her \"to tell a different story when she called,\" advice which, at times, \"was quite specific. &#8230;\"; \n \n In states with parental involvement laws in place and in which only a judge could give permission to have the abortion without parental involvement, the caller \"was often &#8230; instructed not to voluntarily tell the judge about the age of her boyfriend. &#8230;\" In similar instances, the caller was even encouraged to lie to a judge about the age of her boyfriend; \n \n Other clinics in states with parental involvement laws advised the caller to seek her abortion in a neighboring state with no such legislation in place. \"In other words,\" the report stated, \"these people were suggesting to a minor girl that she travel outside the state in order to cover up a crime that was being committed against her. &#8230;\"; \n \n In other cases, the caller was advised on how to circumvent the parental involvement requirement altogether, by having her bring along someone older and who looked like he could be a parent so he could sign for her instead; \n \n In a number of cases, the report said, \"the [clinic] employee would not react at all to the age issue,\" causing researchers to \"question whether it had registered with them or not\"; \n \n One clinic worker told the caller \"if she came in with the cash, she could be any age she wanted to be\"; and \n \n In many cases, clinic workers said the caller could come to the clinic with her adult boyfriend to pick up birth control, meaning that \"even though [clinics] had evidence that a sexual crime was being committed against a 13-year-old child, they were not only willing to conspire with the perpetrator to cover it up, but they offered to provide him the means by which he could continue the abuse.\"\n \"In the final analysis,\" said the summary report, \"virtually every Planned Parenthood and NAF facility we contacted was willing to illegally conceal the sexual abuse of this 13-year-old girl. In every case, the clinic representative had never met this child, knew virtually nothing about her, had only engaged in a very brief telephone conversation with her, and was told nothing to indicate that her parents would be abusive if they discovered the sexual relationship. \n \n \"Nevertheless, they were willing &#8211; and in many cases, eager &#8211; to help this child hide from her parents and the authorities the fact that she was being sexually exploited,\" said the summary. \"To that end, they provided step-by-step instructions on how to circumvent state laws that were enacted specifically for the purpose of protecting children exactly like her in situations just like this.\" \n \n When contacted by WND, a spokeswoman for Planned Parenthood said she was late for an afternoon meeting and would return calls seeking comment, but failed to do so. A spokeswoman for NAF said she did not want to comment until she'd seen the Life Dynamics report. \n \n Mark Crutcher, president of Life Dynamics, said the evidence gathered thus far means the possibilities for future legal litigation \"are nothing less than staggering.\" And he says the problem has occurred in the first place because, he believes, the nation is \"sex-obsessed.\" \n \n \"We are all aware of the firestorm currently swirling around the Catholic Church regarding the issue of pedophile priests,\" Crutcher said. But \"if you look at the lawsuits\" surrounding the cases, he continued, \"the dioceses are not being sued because their priests molested children. They are being sued for negligence because they allegedly knew about the sexual abuse of the children and failed to report it to the authorities. \n \n \"Obviously, any organization or any individual that harbors pedophiles and conceals the sexual abuse of children deserves to be prosecuted,\" he added. \"But that's not what's happening. Instead, [some of these groups] are being given hundreds of millions in tax dollars while doing exactly the same things for which huge awards are being levied against the Catholic dioceses.\" \n \n Crutcher said concealing abortions from parents or failing to report underage pregnancies to authorities is bad enough, but he said providing teen girls with birth control so they can continue sexual relations with adult males could be viewed \"as participating in an ongoing or future crime.\" \n \n The issue, he says, changes from one of failure to report child sexual abuse or statutory rape, to \"actual complicity in child sexual abuse or statutory rape.\" \n \n \"That could be viewed as a felony rather than a misdemeanor,\" he said. \n \n Life Dynamics said it has established a new website &#8211; called ChildPredators.com &#8211; to \"educate children and parents who may have been victimized by these organizations about their litigation opportunities.\" \n \n Also, Crutcher said the group plans to take its message to the nation's 16,000-plus school districts, many of which allow Planned Parenthood and others on campus to teach sex education or provide counseling to students. \n \n Jon E. Dougherty is a staff reporter and columnist for WorldNetDaily", 
   {}, 
   33356, 
   null, 
   1075673100.0
  ], 
  [
   33448, 
   null, 
   "Draconis", 
   "How is atheism a logic fallacy ?\n \n P.S. can't we say specious logic, it sounds so less pretensious", 
   {
    "post_info": {
     "post_title": "Parcum"
    }
   }, 
   33446, 
   null, 
   1075674240.0
  ], 
  [
   33467, 
   null, 
   "Parcum", 
   "Atheism is a logical fallacy because on their belief that because God hasn't been proven he does not exist. THat's an Ad Hominum Ad Ignoratum.", 
   {}, 
   33448, 
   null, 
   1075684620.0
  ], 
  [
   33474, 
   null, 
   "Gormless", 
   "Atheism is a logical fallacy because on their belief that because God hasn't been proven he does not exist. THat's an Ad Hominum Ad Ignoratum.\n\n (a) Atheism makes no such claim: you are the one commiting a logical fallacy (a strawman) by making such a claim. Atheism is an absense of belief, not a belief in the absense.\n (b) An Ad Hominem is an attack upon what the person is claiming, based upon who is making the claim. This in no way resembles the atheist position you describe above.\n \n So in summary:\n (a) You do not understand what atheism is.\n (b) You do not understand what logical fallacies are.\n (c) Remember the bit in the bible about beams and splinters and apply it to yourself here, as the real logical fallacy is of your own making.", 
   {}, 
   33467, 
   null, 
   1075687380.0
  ], 
  [
   33492, 
   null, 
   "Carman", 
   "That last statement, Carmen, is a logical fallacy- Ad hominum tu quoque. Simply because I'm a male doesn't autmatiaclly mean I have no opinion on the issue. During World War II Americans wern't Jews or German. Does that mean they didn't have a right to speak up against what the Nazis were doing?\n \n You must understand that the fetus is, scientifically and logically, a human being. Killing is, morally, murder. \n \n \"Always\" in the english language isn't always literal. If I say the cup is full it doesn't nessecarily mean it's completely full. We're speaking english, darling, not Aramaic. ;)\n\n \n I'm sorry, I didn't mean to imply that because you are male, you shouldn't have an opinion.. I just meant that how can you know so much about what a woman should do if you will never be in that kind of situation?\n \n I do understand that biologically a fetus is a human being. I've never contested that. I don't necessarily agree with abortion in all cases, at all.. I do know that sometimes it medically becomes the only realistic option to the mother. (I've been through that). But in cases where the woman uses what I think are trivial reasons, such as they don't want to lose their figure, or they have to much to do before they have a child, I don't agree with it. A lot of my aquaintances have done it for those reasons, and that seems really irresponsible to me... \n In my opinion, it should be made an option for medical reasons, not the little trivial reasons like my friends used.. but even then to me it doesn't seem right... \n After what I just went through, I got a first hand look at how horrible it really is, and even though I knew that medically that was the only choice, morally and emotionally it still doesn't seem like it should have been that way. Maybe it's because I didn't want to do it, but knew I had to, as opposed to someone choosing to have it done, but I almost wish it hadn't been an option, because then you don't have to make that choice. It's a very hard thing to deal with, no matter what the reasons behind it, and knowing you can't change it.. but I do know if something like this happens again, it won't be an option to me, no matter how many doctors tell me otherwise. \n Again, I do apologize for the misunderstanding.. I didn't mean to say it that way, and yes I think men have rights and should have opinions too! :)", 
   {}, 
   33442, 
   null, 
   1075720020.0
  ], 
  [
   33541, 
   null, 
   "Parcum", 
   "I'm sorry, I didn't mean to imply that because you are male, you shouldn't have an opinion.. I just meant that how can you know so much about what a woman should do if you will never be in that kind of situation?\n\n \n I'm not a Nazi... so why should I care what happens to the Slavs? The fetus is a human being, and I want to protect it's little life. \n \n \nAgain, I do apologize for the misunderstanding.. I didn't mean to say it that way, and yes I think men have rights and should have opinions too! \n\n \n :)\n \n It's okay. At any rate, you are very conscious to the issue- you see it. That's good, because 30% of America doesn't. As a matter of fact, to some extent, 70% of America doesn't either. Pro-lifers are split. Only 30% of Ameriacns are really pro-life, 30% are pro-choice, and 40% would allow it in cases of rape and incest. The problem is, the fetus is still a child, even in rape and incest, so killing it is still murder. Although this is traumatizing to the mother, if the fetus was born, should it still be legal to kill it? Of course not. \n \n At any rate, you understand the issue quite well. Abortion is for times when the mother's life is seriously threatened. It's not good;abortion's never OK, it's always bad, but it's a nessecary evil in that case. \n \n Interesting fact that my Jewish aunt told me recently; in Orthodox Judaism, the tradition is that if the mother is pregnant with a child and her life is threatened, she has to have an abortion if she has other children.", 
   {}, 
   33492, 
   null, 
   1075765320.0
  ], 
  [
   33562, 
   null, 
   "Carman", 
   "I'm not a Nazi... so why should I care what happens to the Slavs? The fetus is a human being, and I want to protect it's little life. \n \n \n \n :)\n \n It's okay. At any rate, you are very conscious to the issue- you see it. That's good, because 30% of America doesn't. As a matter of fact, to some extent, 70% of America doesn't either. Pro-lifers are split. Only 30% of Ameriacns are really pro-life, 30% are pro-choice, and 40% would allow it in cases of rape and incest. The problem is, the fetus is still a child, even in rape and incest, so killing it is still murder. Although this is traumatizing to the mother, if the fetus was born, should it still be legal to kill it? Of course not. \n \n At any rate, you understand the issue quite well. Abortion is for times when the mother's life is seriously threatened. It's not good;abortion's never OK, it's always bad, but it's a nessecary evil in that case. \n \n Interesting fact that my Jewish aunt told me recently; in Orthodox Judaism, the tradition is that if the mother is pregnant with a child and her life is threatened, she has to have an abortion if she has other children.\n\n \n No, you're right, I don't think abortion is really ever 'ok'.. too much is involved in it to make it an absolute perfect thing. But, in a way I guess it is good to have an option if the mother's life in endangered... what you say your aunt said makes some sense... if there are other children, it would be a good thing to protect the mother for their sake... that's why I did what I did.. for my daughter, but I still don't feel like it was right. \n I'm glad that there are some pro-life people out there though. I can't say that I am really one way or another completely, because I agree with some points that pro-choicers and pro-lifers make, but if no one saw it for what it really was, I think the world would be a very scary place.\n I don't really agree with it in cases of rape. I can understand where the mother is coming from, because it isn't something she asked for, and that is a very unfair situation, but I don't think it's fair to the baby either. I can't say really, because I have never been in that situation, but that doesn't seem 'right' to me. My sister's friend was raped in college and got pregnant, but she kept her baby. She said she was scared because she didn't know anything about the father, and the whole thing was just a bad deal, but she said she didn't want to have an abortion because the baby didn't ask for any of that.", 
   {}, 
   33541, 
   null, 
   1075770660.0
  ], 
  [
   33622, 
   null, 
   "superbuddhaman", 
   "so you don't agree with abortion in the case of rape, huh? Let me give you just one of the many hypothetical situations. There is a woman who knows she is carrying a gene that has a high likelihood of being passed on the her children, therefore causing them serious disease and/or other medical problems. Because of this chance she has decided she never wants to be a mother. She cannot have herself sterilized because she is too young. She is not sexually active, so she is not on birth control. Then she is raped and finds herself pregnant. What does she do? Her own genes carry a 60% liklihood of giving her child this disease, not to mention she has no access to her attackers medical history. Does she take her chances on a miracle?", 
   {}, 
   33562, 
   null, 
   1075822920.0
  ], 
  [
   33675, 
   null, 
   "thebootfitter", 
   "so you don't agree with abortion in the case of rape, huh? Let me give you just one of the many hypothetical situations... Does she take her chances on a miracle?\n\n \n In response to your hypothetical:\n I'm not certain that beating the odds of a 60% chance would qualify as a 'miracle.' Even if this child develops the symptoms of the disease or other medical problems, who can say that the individual will not lead a happy and productive life? Regardless of your stance on the morality of abortion, this is a very weak argument for allowing an abortion whether in the case of rape or any other situation.\n \n Abortion is legal. Period. If someone wishes to have one in the U.S.A., they can have one with very few restrictions. Why try to rationalize it with arguments such as potential (or even certain) medical problems of the fetus/baby/entity/thing? There are many post-birth individuals living with various 'imperfect' bodies or minds who are very happy and productive members of society. It is possible that someone with some sort of 'imperfection' may not be happy or productive throughout their life, but it is also possible that they will be both happy and productive. You don't know what their life will be like. No one knows.\n \n In other words, if the potential for living an 'unhappy' or in any way 'imperfect' life is a good reason for having an abortion, then it could be argued that the opposite is just as good of a reason for NOT having an abortion. What if this child beats the odds and turns out to be perfectly healthy? When they find out the circumstances around their coming into existence, they are inspired to find a cure for this disease? In the grand scheme of things, this is certainly a possibility.\n \n It shouldn't really matter, but in case you missed some of my previous posts, I don't believe abortion is right or wrong... good or bad. It is what it is, and using semantics or playing to people's emotions doesn't change what it is in reality. I tend to be a pretty objective observer of the issue.", 
   {}, 
   33622, 
   null, 
   1075846680.0
  ], 
  [
   33807, 
   null, 
   "Parcum", 
   "Firstly Superbudd, the situation wouldn't only be rape- the child's life would also be severely damage. So that outweighs the fact that the mother was raped, and if her life was threatened, then abortion would be nessecary. However, these arn't the case. The mother of course didn't want to have a child because of what would happen, but it happened. If that child was born would it be OK to kill it? Might as well take away the child's misery now!", 
   {}, 
   33675, 
   null, 
   1075879260.0
  ], 
  [
   33820, 
   null, 
   "Carman", 
   "so you don't agree with abortion in the case of rape, huh? Let me give you just one of the many hypothetical situations. There is a woman who knows she is carrying a gene that has a high likelihood of being passed on the her children, therefore causing them serious disease and/or other medical problems. Because of this chance she has decided she never wants to be a mother. She cannot have herself sterilized because she is too young. She is not sexually active, so she is not on birth control. Then she is raped and finds herself pregnant. What does she do? Her own genes carry a 60% liklihood of giving her child this disease, not to mention she has no access to her attackers medical history. Does she take her chances on a miracle?\n\n \n Since that is hypothetical, it's a little hard to answer... every situation is different. I just don't particularly agree with it in rape cases on a whole.. but sometimes there are other circumstances involved. If the woman's life is in danger, the situation is a little more complex than just the rape itself.\n I'm not disagreeing that it would be a hard situation if a woman were raped and became pregnant. I think it would be an extremely hard situation, especially not knowing the father's background and medical history, and when a woman is raped and gets pregnant, that is something that has happened against her will... so that would be a very hard choice to make... I'm not disagreeing that either.", 
   {}, 
   33622, 
   null, 
   1075892640.0
  ], 
  [
   34172, 
   null, 
   "mizmaxx", 
   "Carmen, it's senseless not to believe that Abortion is Planned Parenthood's #1 reccomendation. Does Planned Parenthood offer pregnancy support? No. (...) What do they do? They give out pregnancy tests and do abortions. \n\n \n \nAgain, I did not say that they did not recommend abortion... they do offer it as an option, but I have never heard of anyone being 'forced' to have one by Planned Parenthood. All I was disputing was when you said that they ALWAYS recommended it. They do offer pregnancy counseling, along with pregnancy testing. They also offer birth control, gynecological care, STD testing, infertility testing, sexual education counseling, prenatal care, adoption referrals.. etc...\n\n LOL... Parcum, you speak with such authority about something about which you have no clue. Besides which, I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\n \n \nI wonder, does your high school offer logic courses? Please do us all a favor and invest in one.\n\n I've actually seen Parcum write that he took such a class. He obviously didn't pay much attention-\n \n \nThat last statement, Carmen, is a logical fallacy- Ad hominum tu quoque. Simply because I'm a male doesn't autmatiaclly mean I have no opinion on the issue.\n\n Again, and again, Parcum, please read the post I put up in the General section. You've incorrectly accused someone of ad hominem \"tu quoque\" a couple of times now. Pay close attention; \"tu quoque\" is latin for \"you too\", and ad hominem tu quoque is the logical fallacy equivalent to \"two wrongs make a right\"- that is, when you say \"I can do it because you did it too\".\n \n Further, it is not an ad hominem attack to say that you know less about being a woman because you aren't one. That's simply a fact. Ad hominem as a logical fallacy applies when someone says that what you are saying is wrong because of who you are. It isn't ad hominem to state that someone lacks a particular experience, it is ad hominem to say that it is this lack of experience which dismisses their point.\n \n \nKilling is, morally, murder.\n\n Not true. I'm sure in this case you meant to say that killing human beings specifically is morally murder, because otherwise you couldn't take a shower or take antibiotics. Nonetheless, the statement is still untrue. That is why people have made legal reasonable defenses, such as self-defense, intellectual deficiency, etc.\n \n \nWhy try to rationalize it with arguments such as potential (or even certain) medical problems of the fetus/baby/entity/thing?\n\n I agree. This is \"worst case scenario\" defense, and I don't believe that's necessary. I could be wrong, but I think superbuddhaman was just trying to see just how far Parcum will go in his anti-abortion zealotry.", 
   {}, 
   33820, 
   null, 
   1076134740.0
  ], 
  [
   34196, 
   null, 
   "Carman", 
   "LOL... Parcum, you speak with such authority about something about which you have no clue. Besides which, I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\n \n \n I've actually seen Parcum write that he took such a class. He obviously didn't pay much attention-\n \n \n Again, and again, Parcum, please read the post I put up in the General section. You've incorrectly accused someone of ad hominem \"tu quoque\" a couple of times now. Pay close attention; \"tu quoque\" is latin for \"you too\", and ad hominem tu quoque is the logical fallacy equivalent to \"two wrongs make a right\"- that is, when you say \"I can do it because you did it too\".\n \n Further, it is not an ad hominem attack to say that you know less about being a woman because you aren't one. That's simply a fact. Ad hominem as a logical fallacy applies when someone says that what you are saying is wrong because of who you are. It isn't ad hominem to state that someone lacks a particular experience, it is ad hominem to say that it is this lack of experience which dismisses their point.\n \n \n Not true. I'm sure in this case you meant to say that killing human beings specifically is morally murder, because otherwise you couldn't take a shower or take antibiotics. Nonetheless, the statement is still untrue. That is why people have made legal reasonable defenses, such as self-defense, intellectual deficiency, etc.\n \n \n I agree. This is \"worst case scenario\" defense, and I don't believe that's necessary. I could be wrong, but I think superbuddhaman was just trying to see just how far Parcum will go in his anti-abortion zealotry.\n\n \n emoticon_smile emoticon_smile", 
   {}, 
   34172, 
   null, 
   1076145000.0
  ], 
  [
   34327, 
   null, 
   "Parcum", 
   "LOL... Parcum, you speak with such authority about something about which you have no clue. Besides which, I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\n\n \n Since you obviously have some attentive problem, I will repeat what I have been saying- 1/3 of all of Planned Parenthood's profits come from abortion, and another great amount comes from donations. Please tell me again that Planned Parenthood's #1 industry is not abortion so that I can laugh as you humiliate yourself once again. \n \n \nI've actually seen Parcum write that he took such a class. He obviously didn't pay much attention-\n\n \n Seeing that neither you or Superbudd are capable of making logical proofs, I don't see how you ever have taken such a course. \n \n \nAgain, and again, Parcum, please read the post I put up in the General section. You've incorrectly accused someone of ad hominem \"tu quoque\" a couple of times now. Pay close attention; \"tu quoque\" is latin for \"you too\", and ad hominem tu quoque is the logical fallacy equivalent to \"two wrongs make a right\"- that is, when you say \"I can do it because you did it too\".\n\n \n Having also taken Latin for six years of my life, you shouldn't feel the need to translate. I'm really sick of your attempts to refute my fallacy statements. An Ad Hominum Tu Quoque means that the opponent attacks the person because \"he does not practice what is preached\". Simply because I'm a woman doesn't mean I cannot have a say in abortion! \n \n \nFurther, it is not an ad hominem attack to say that you know less about being a woman because you aren't one. That's simply a fact. Ad hominem as a logical fallacy applies when someone says that what you are saying is wrong because of who you are. It isn't ad hominem to state that someone lacks a particular experience, it is ad hominem to say that it is this lack of experience which dismisses their point.\n\n \n Of course it is. Many woman know nothing about pregnancy. A male doctor working on fetology or embryology certainly knows more about human life before birth than a woman, and an abortionist certianly knows more about abortion than a woman. It's undenyable that it is a logical fallacy. In fact, Carman clerified that she did not mean to say that I had no say in abortion because I was a male. She understands that that is not logical. \n \n \n \n \n Not true. I'm sure in this case you meant to say that killing human beings specifically is morally murder, because otherwise you couldn't take a shower or take antibiotics. Nonetheless, the statement is still untrue. That is why people have made legal reasonable defenses, such as self-defense, intellectual deficiency, etc.\n \n\n \n Mizmax, you took my statement completely out of context, which you can't seem to resist doing! \n \n \"You must understand that the fetus is, scientifically and logically, a human being. Killing (the fetus) is, morally, murder.\"\n \n Either way, you understood my statement. If I were making a statement outside of what I had just said, I would place it in a new paragraph.\n \n Hence, the killing of an innocent human being, it est the fetus, morally, is murder.", 
   {}, 
   34196, 
   null, 
   1076289420.0
  ], 
  [
   34345, 
   null, 
   "Carman", 
   "Since you obviously have some attentive problem, I will repeat what I have been saying- 1/3 of all of Planned Parenthood's profits come from abortion, and another great amount comes from donations. Please tell me again that Planned Parenthood's #1 industry is not abortion so that I can laugh as you humiliate yourself once again. \n \n \n \n Seeing that neither you or Superbudd are capable of making logical proofs, I don't see how you ever have taken such a course. \n \n \n \n Having also taken Latin for six years of my life, you shouldn't feel the need to translate. I'm really sick of your attempts to refute my fallacy statements. An Ad Hominum Tu Quoque means that the opponent attacks the person because \"he does not practice what is preached\". Simply because I'm a woman doesn't mean I cannot have a say in abortion! \n \n \n Of course it is. Many woman know nothing about pregnancy. A male doctor working on fetology or embryology certainly knows more about human life before birth than a woman, and an abortionist certianly knows more about abortion than a woman. It's undenyable that it is a logical fallacy. In fact, Carman clerified that she did not mean to say that I had no say in abortion because I was a male. She understands that that is not logical. \n \n\n \n You're right, I did clarify that because you are male doesn't mean you can't have an opinion, but it seems like you don't want to hear anyone else's opinions if they don't agree with yours, and I'm sorry to say it seems to me like you think you have more knowledge about this than anyone else. I just went through my 3rd pregnancy, which ended in an emergency termination, so I think it would be safe for me to say I have a little knowledge on the subjects of pregnancy and abortion, probably more than you do.\n Just because you read a lot of information on something doesn't necessarily mean you know more.", 
   {}, 
   34327, 
   null, 
   1076320980.0
  ], 
  [
   34350, 
   null, 
   "mizmaxx", 
   "Having also taken Latin for six years of my life, you shouldn't feel the need to translate. I'm really sick of your attempts to refute my fallacy statements.\n\n Well, it's alarming that after that amount of study you can continue to misunderstand ad hominem tu quoque. \n \n \nSimply because I'm a woman (sic) doesn't mean I cannot have a say in abortion! \n\n Which is not at all the same thing as saying that you do not practice what you preach. Saying that you shouldn't have a say in abortion is also not the same as saying that your statements regarding abortion can be dismissed because you are a man. The former is an opinion, the latter is an adhominem logically fallacious attack, and an example of circumstancial ad hominem, but not ad hominem tu quoque. Although I understand why you like writing it so much, it's a cool term and it does provide a certain aura of expertise.\n \n \nTu quoque or \"two wrongs make a right\": dodging the main argument by including the opposition in the blame (\"you did it to\"), or justifying an action because one's opponent has performed it. Examples: 1, 2.\n\n whole article on logical fallacies (morman site) here.\n \n \n1/3 of all of Planned Parenthood's profits come from abortion, and another great amount comes from donations. Please tell me again that Planned Parenthood's #1 industry is not abortion so that I can laugh as you humiliate yourself once again. \n\n *sigh* \n Parcum, you said \"Does Planned Parenthood offer pregnancy support? No. (...) What do they do? They give out pregnancy tests and do abortions.\" \n \n The first part of the statement was you naming services (pregnancy support, ultrasounds, delivery rooms) that you said PP does not provide. Then you named the services you think they do provide (pregnancy tests and abortions). As Carman and my posts state, both of your tenets are incorrect. You did not mention revenues, profits, or industry. PP is also a non-profit, so they can't really generate \"profits\" persay. Like many non-profits, most of their revenue comes from donations.", 
   {}, 
   34345, 
   null, 
   1076327820.0
  ], 
  [
   34354, 
   null, 
   "Carman", 
   "Since you obviously have some attentive problem, I will repeat what I have been saying- 1/3 of all of Planned Parenthood's profits come from abortion, and another great amount comes from donations. Please tell me again that Planned Parenthood's #1 industry is not abortion so that I can laugh as you humiliate yourself once again. \n \n\n \n No one has argued that PP doesn't offer abortion; who has the attentive problem here??", 
   {}, 
   34327, 
   null, 
   1076330820.0
  ], 
  [
   34367, 
   null, 
   "thebootfitter", 
   "This fallacy is committed when it is concluded that a person's claim is false because 1) it is inconsistent with something else a person has said or 2) what a person says is inconsistent with her actions. This type of \"argument\" has the following form: \n \n 1. Person A makes claim X. \n 2. Person B asserts that A's actions or past claims are inconsistent with the truth of claim X. \n 3. Therefore X is false. \n \n The fact that a person makes inconsistent claims does not make any particular claim he makes false (although of any pair of inconsistent claims only one can be true - but both can be false). Also, the fact that a person's claims are not consistent with his actions might indicate that the person is a hypocrite but this does not prove his claims are false. \n \n Examples of Ad Hominem Tu Quoque\n \n 1. Bill: \"Smoking is very unhealthy and leads to all sorts of problems. So take my advice and never start.\" \n Jill: \"Well, I certainly don't want to get cancer.\" \n Bill: \"I'm going to get a smoke. Want to join me Dave?\" \n Jill: \"Well, I guess smoking can't be that bad. After all, Bill smokes.\" \n 2. Jill: \"I think the gun control bill shouldn't be supported because it won't be effective and will waste money.\" \n Bill: \"Well, just last month you supported the bill. So I guess you're wrong now.\" \n 3. Peter: \"Based on the arguments I have presented, it is evident that it is morally wrong to use animals for food or clothing.\" \n Bill: \"But you are wearing a leather jacket and you have a roast beef sandwich in your hand! How can you say that using animals for food and clothing is wrong!\" \n \n Also Known as: Fallacious Appeal to Authority, Misuse of Authority, Irrelevant Authority, Questionable Authority, Inappropriate Authority, Ad Verecundiam", 
   {
    "post_info": {
     "post_title": "Description of Ad Hominem Tu Quoque"
    }
   }, 
   34327, 
   null, 
   1076344440.0
  ], 
  [
   34380, 
   null, 
   "Parcum", 
   " Just because you read a lot of information on something doesn't necessarily mean you know more.\n\n \n You seemed to have misinterpreted my statement. I did not say I knew more about the subject then you- that is for you to decide, and I cannot judge whether I know more than you or not. I simply stated that simply because I'm a male doesn't mean I don't know anything about the subject. It also doesn't cancel me out of being an expert on the issue. Many males are doctors.\n \n The Mormon site isn't very good- I like Stephen's guide to logical fallacies, and several books even better. Okay, it may not be a Tu Quoque Either way, her statement was clearly an Ad hominem, and most definitely a logical fallacy. \n \n \n Parcum, you said \"Does Planned Parenthood offer pregnancy support? No. (...) What do they do? They give out pregnancy tests and do abortions.\"\n\n \n Let's look at the quote again:\n \n \" They do offer pregnancy counseling, along with pregnancy testing. They also offer birth control, gynecological care, STD testing, infertility testing, sexual education counseling, prenatal care, adoption referrals.. etc...\n \n Now, I have never seen a single Planned Parenthood Clinic offer adoption prenatal care or adoption referrals (they simply do not have the equipment to do that. They do, however, offer referrals to prenatal care), but besides that, what do all these other programs offer? To find out about whether or not the mother is pregnant, or if she has illnesses. Birth control is not pregnancy support. Gynecological care is for woman, not the pregnancy. STD testing is to find out if you have an STD like AIDS, and it's not for the fetus. Infertility testing is to find out if it's OK to have sex or not, or how to get pregnant- NOT pregnancy support. Sexual Education is for teenagers to find out how to perform sex well, not for pregnancy support. Adoption referral is not direct pregnancy support, and neither are their prenatal care referrals direct from Planned Parenthood. Margaret Sanger wanted sexual rights, not pregnancy support.\n \n Here's my local Planned Parenthood service offerings. They also offer vasectomy! Great pregnancy help!\n \n \n The first part of the statement was you naming services (pregnancy support, ultrasounds, delivery rooms) that you said PP does not provide. Then you named the services you think they do provide (pregnancy tests and abortions). As Carman and my posts state, both of your tenets are incorrect. You did not mention revenues, profits, or industry. PP is also a non-profit, so they can't really generate \"profits\" persay. Like many non-profits, most of their revenue comes from donations.\n\n \n Planned Parenthood cannot gain company profits, but they can still have revenue, and can even have a fund if it's for \"charity\". This simply means the better the company does, the more people get paid. No, I'm not changing my argument- it's the same. Planned Parenthood does not offer pregnancy support. Their main offering is abortion, though they also offer some sexual health services.", 
   {
    "unicode_changes_made": true
   }, 
   34367, 
   null, 
   1076361180.0
  ], 
  [
   34426, 
   null, 
   "Carman", 
   "You seemed to have misinterpreted my statement. I did not say I knew more about the subject then you- that is for you to decide, and I cannot judge whether I know more than you or not. I simply stated that simply because I'm a male doesn't mean I don't know anything about the subject. It also doesn't cancel me out of being an expert on the issue. Many males are doctors.\n \n The Mormon site isn't very good- I like Stephen's guide to logical fallacies, and several books even better. Okay, it may not be a Tu Quoque Either way, her statement was clearly an Ad hominem, and most definitely a logical fallacy. \n \n \n \n Let's look at the quote again:\n \n \" They do offer pregnancy counseling, along with pregnancy testing. They also offer birth control, gynecological care, STD testing, infertility testing, sexual education counseling, prenatal care, adoption referrals.. etc...\n \n Now, I have never seen a single Planned Parenthood Clinic offer adoption prenatal care or adoption referrals (they simply do not have the equipment to do that. They do, however, offer referrals to prenatal care), but besides that, what do all these other programs offer? To find out about whether or not the mother is pregnant, or if she has illnesses. Birth control is not pregnancy support. Gynecological care is for woman, not the pregnancy. STD testing is to find out if you have an STD like AIDS, and it's not for the fetus. Infertility testing is to find out if it's OK to have sex or not, or how to get pregnant- NOT pregnancy support. Sexual Education is for teenagers to find out how to perform sex well, not for pregnancy support. Adoption referral is not direct pregnancy support, and neither are their prenatal care referrals direct from Planned Parenthood. Margaret Sanger wanted sexual rights, not pregnancy support.\n \n Here's my local Planned Parenthood service offerings. They also offer vasectomy! Great pregnancy help!\n \n \n \n Planned Parenthood cannot gain company profits, but they can still have revenue, and can even have a fund if it's for \"charity\". This simply means the better the company does, the more people get paid. No, I'm not changing my argument- it's the same. Planned Parenthood does not offer pregnancy support. Their main offering is abortion, though they also offer some sexual health services.\n\n \n They do offer pregnancy support/counseling. I don't know about all the centers in the country, but I know the ones in my area do. The centers in my area also handle adoption referrals, and prenatal care after you have had a baby, which is the same thing that my local Health Dept. and my doctor do. You can schedule a vasectomy through your doctor, and also a tubal ligation. I'm not going to dispute what Planned Parenthood does or does not do, abortion is one of their options and I have never said it wasn't. All I am saying is that the things that are offered through PP are also usually offered by a regular medical doctor.\n Sexual education is not intended to teach teenagers how to have sex well. (That's what sexual therapy is for). When I had to take sex ed at school, all they taught us was about the different sexual organs and different kinds of birth control, which I think was a good thing considering how many in my school were sexually active. I don't know what kind of sex ed class they give at your school, but if they teach you how to have better sex I wish they would have taught that to the boys at my school! haha", 
   {
    "unicode_changes_made": true
   }, 
   34380, 
   null, 
   1076392680.0
  ], 
  [
   34506, 
   null, 
   "mizmaxx", 
   "Sexual Education is for teenagers to find out how to perform sex well, not for pregnancy support.\n\n ROFL... As if! I'm with Carman, I wish boys learned sexual techniques in High School- it sure would have improved my experience of college. :xgood\n \n All we got were lots of pictures of STDs and cheesy movies about how \"it's okay to say no\". The only bonus was the year I went to Catholic private school I got sex ed with a nun... That was funny- she decided to make a \"question box\" where people could put questions they were afraid to ask... Let's just say that didn't last long, seeing as the class was more sexually experienced than she was...\n \n \nThey do, however, offer referrals to prenatal care), but besides that, what do all these other programs offer? \n\n Nonetheless, they do much more than just \"pregnancy tests and abortions\".\n \n \nThis simply means the better the company does, the more people get paid.\n\n Nonsense. That isn't how non-profits work. There are serious constraints on how revenues are spent in non-profits, and employee salaries being raised in relation to revenue is one thing that would surely be noticed by donators and the IRS. Non-profits are supposed to spend their money on programs, not high salaries, donators have access to the organization's budget to verify this. If revenue were spent on salaries in any way aside from normal raises, it would be to hire more people to open more centres. I've served on several BODs for non-profits in the past ten years. If you want to make a high salary you don't work in the non-profit sector. There are lots of resources available on-line and elsewhere if you want to be clearer on the differences between for-profit and non-profits.", 
   {}, 
   34426, 
   null, 
   1076484840.0
  ], 
  [
   34556, 
   null, 
   "Parcum", 
   " They do offer pregnancy support/counseling. I don't know about all the centers in the country, but I know the ones in my area do. The centers in my area also handle adoption referrals, and prenatal care after you have had a baby, which is the same thing that my local Health Dept. and my doctor do. You can schedule a vasectomy through your doctor, and also a tubal ligation. I'm not going to dispute what Planned Parenthood does or does not do, abortion is one of their options and I have never said it wasn't. All I am saying is that the things that are offered through PP are also usually offered by a regular medical doctor.\n\n \n Really? Where are you from? San Francisco's Planned Parenthood I believe is the provincial headquarters, so they offer all that Planned Parenthood has to offer. \n \n Planned Parenthood in New York City doesn't offer it.\n \n Nothing in Western Washington's Planned Parenthood... odd!\n \n \n No Prenatal care in Los Angeles!\n \n None in Philadelphia either...\n \n  International Planned Parenthood Federation doesn't seem to offer these services... and their mission seems to give people freedom for sexual health. That's not wrong (unless it's abortion), but it's not pregnancy. \n \n \n Sexual education is not intended to teach teenagers how to have sex well. (That's what sexual therapy is for). When I had to take sex ed at school, all they taught us was about the different sexual organs and different kinds of birth control, which I think was a good thing considering how many in my school were sexually active. I don't know what kind of sex ed class they give at your school, but if they teach you how to have better sex I wish they would have taught that to the boys at my school! Haha\n\n \n I know, I have been educated by these people. However, the classes were pretty much saying \"Don't have sex, but if you really want to... here's how you do it\". \n \n \n Nonetheless, they do much more than just \"pregnancy tests and abortions\".\n\n \n Now you're changing your argument. You were saying that they offer prenatal care. They don't. You were saying that they offer adoption assistance. They have some referrals, but it isn't listed in their services. My point wasn't that they only have pregnancy tests and abortions, obviously they have to have a bit more than that to stay in business, but that they don't offer pregnancy support, and their #1 service is abortion.\n \n \n Nonsense. That isn't how non-profits work. There are serious constraints on how revenues are spent in non-profits, and employee salaries being raised in relation to revenue is one thing that would surely be noticed by donators and the IRS. Non-profits are supposed to spend their money on programs, not high salaries, donators have access to the organization's budget to verify this. If revenue were spent on salaries in any way aside from normal raises, it would be to hire more people to open more centres. I've served on several BODs for non-profits in the past ten years. If you want to make a high salary you don't work in the non-profit sector. There are lots of resources available on-line and elsewhere if you want to be clearer on the differences between for-profit and non-profits.\n\n \n Having worked with non-profit organizations (The Boy Scouts of America, United for Life, Salvation Army), I can tell you that that is not how it works- I worked in accounting, so I saw all the accountants and heads of the areas make legal decisions. I worked with a Buisness Attorney in some occasions. The only requirement for a non-profit organization is that it's not primarily for profit, and that the organization is directed towards the good of the community. Also, it uses it's net profits only to expand the organization. Sure, it's wrong if they raise salaries, but it can easily be done. If the company says I work 60 hours a week and thus deserve a $100,000 paycheck, there's no stopping the company from doing that. That's $35 an hour- not that much money.", 
   {
    "unicode_changes_made": true
   }, 
   34506, 
   null, 
   1076545380.0
  ], 
  [
   34574, 
   null, 
   "mizmaxx", 
   " Now you?re changing your argument. You were saying that they offer prenatal care. They don?t. You were saying that they offer adoption assistance. They have some referrals, but it isn?t listed in their services.\n\n Actually I said \"I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\" I then said \nThe first part of the statement was you naming services (pregnancy support, ultrasounds, delivery rooms) that you said PP does not provide. Then you named the services you think they do provide (pregnancy tests and abortions). As Carman and my posts state, both of your tenets are incorrect.\n\n \n It seems to me that it is you who are changing your argument.\n \n \nThe only requirement for a non-profit organization is that it?s not primarily for profit, and that the organization is directed towards the good of the community. Also, it uses it?s net profits only to expand the organization. Sure, it?s wrong if they raise salaries, but it can easily be done.\n\n I didn't say it was impossible. I was responding to your contention that the way that non-profits re-allocate an increase in their revenues is to raise salaries accordingly. You were using this as an argument that Planned Parenthood counsellors have a vested interest in encouraging pregnant women to abort instead of keeping the pregnancy. Clearly, not all non-profits re-allocate their revenues this way, and this is not the only way that non-profits use their revenues. Therefore to say so does not support your argument re: PP. If you have evidence that a PP centre uses their revenues in this manner, I suggest you present it. I'm sure that donors and the National Office would find that very useful information.\n \n I suggest you look at the document here. If, as you are implying, people in the non-profits you worked with have been unethically and illegally getting personal benefits from the revenues of these organizations, I think you have a responsibility to expose this behaviour. That is a very serious allegation, and I doubt the Boy Scouts etc would appreciate you making it without basis.", 
   {}, 
   34556, 
   null, 
   1076559660.0
  ], 
  [
   34597, 
   null, 
   "Carman", 
   "Really? Where are you from? San Francisco's Planned Parenthood I believe is the provincial headquarters, so they offer all that Planned Parenthood has to offer. \n \n Planned Parenthood in New York City doesn't offer it.\n \n Nothing in Western Washington's Planned Parenthood... odd!\n \n \n No Prenatal care in Los Angeles!\n \n None in Philadelphia either...\n \n  International Planned Parenthood Federation doesn't seem to offer these services... and their mission seems to give people freedom for sexual health. That's not wrong (unless it's abortion), but it's not pregnancy. \n \n\n \n The site for IPPF you posted says exactly what you are saying it doesn't; this is a direct quote: \n 'IPPF's member associations provide reproductive health services, including counselling, information, and a choice of family planning methods and providers. They seek to convince governments and policy-makers to improve national health services. Many work to prepare adolescents for responsible parenthood; others offer such services as infertility treatment, premarital counselling, pregnancy testing and breast and cervical cancer screening.' \n \n The sites you posted aren't anywhere near my area, but nonetheless, I have been to Planned Parenthood for these types of services (not abortion), and they were offered to me, and I went there once for counselling. \n I'm finding it increasingly difficult to keep arguing about this, having actually used PP myself; I honestly don't remember them recommending abortion to me personally. The only point I was trying to get across was that they offer different services, not just abortion and not just for pregnancy, and again, most of these are the same things that I can get info on or have done through my own doctor (abortion included).", 
   {
    "unicode_changes_made": true
   }, 
   34556, 
   null, 
   1076586600.0
  ], 
  [
   34608, 
   null, 
   "Parcum", 
   "Mizmax, you're really something else. \n \n After I said that Planned Parenthood does NOT offer pregnancy support, you quoted Carman's statement about Planned Parenthood offering prenatal support, and said:\n \n  \"LOL... Parcum, you speak with such authority about something about which you have no clue. Besides which, I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\"\n \n Now that I have proven my thesis correct, you have changed your argument. \n \n \n I didn't say it was impossible.\n\n \n Correct; you said it was nonsense.\n \n \n I was responding to your contention that the way that non-profits re-allocate an increase in their revenues is to raise salaries accordingly. You were using this as an argument that Planned Parenthood counsellors have a vested interest in encouraging pregnant women to abort instead of keeping the pregnancy. Clearly, not all non-profits re-allocate their revenues this way, and this is not the only way that non-profits use their revenues. Therefore to say so does not support your argument re: PP. If you have evidence that a PP centre uses their revenues in this manner, I suggest you present it. I'm sure that donors and the National Office would find that very useful information\n\n \n Oh I'm positive many Planned Parenthood clinics do this. Planned Parenthood clinics are allowed to make money- the Planned Parenthood Federation isn't. \n \n \n \n The site for IPPF you posted says exactly what you are saying it doesn't; this is a direct quote: \n 'IPPF's member associations provide reproductive health services, including counselling, information, and a choice of family planning methods and providers. They seek to convince governments and policy-makers to improve national health services. Many work to prepare adolescents for responsible parenthood; others offer such services as infertility treatment, premarital counselling, pregnancy testing and breast and cervical cancer screening.'\n\n \n Unfortunately for your argument, the IPPF is not PPFA, simply a connected organization. \n \n \n \n The sites you posted aren't anywhere near my area, but nonetheless, I have been to Planned Parenthood for these types of services (not abortion), and they were offered to me, and I went there once for counselling. \n I'm finding it increasingly difficult to keep arguing about this, having actually used PP myself; I honestly don't remember them recommending abortion to me personally. The only point I was trying to get across was that they offer different services, not just abortion and not just for pregnancy, and again, most of these are the same things that I can get info on or have done through my own doctor (abortion included).\n\n \n I've been to Planned Parenthood before. Which is your Planned Parenthood clinic? I find it difficult to believe that they offer these services at your planned parenthood clinic and not at the major planned parenthood clinics.", 
   {
    "unicode_changes_made": true
   }, 
   34597, 
   null, 
   1076605020.0
  ], 
  [
   34639, 
   null, 
   "Carman", 
   "Mizmax, you're really something else. \n \n After I said that Planned Parenthood does NOT offer pregnancy support, you quoted Carman's statement about Planned Parenthood offering prenatal support, and said:\n \n  \"LOL... Parcum, you speak with such authority about something about which you have no clue. Besides which, I've already told you this, and quoted the PP website which says the same thing- they offer many services, for all kinds of people.\"\n \n Now that I have proven my thesis correct, you have changed your argument. \n \n \n \n Correct; you said it was nonsense.\n \n \n \n Oh I'm positive many Planned Parenthood clinics do this. Planned Parenthood clinics are allowed to make money- the Planned Parenthood Federation isn't. \n \n \n \n \n Unfortunately for your argument, the IPPF is not PPFA, simply a connected organization. \n \n \n \n \n I've been to Planned Parenthood before. Which is your Planned Parenthood clinic? I find it difficult to believe that they offer these services at your planned parenthood clinic and not at the major planned parenthood clinics.\n\n \n I'm not arguing about it anymore... it's gotten pointless.", 
   {
    "unicode_changes_made": true
   }, 
   34608, 
   null, 
   1076630460.0
  ], 
  [
   34647, 
   null, 
   "Parcum", 
   "No it hasn't gotten pointless- it's gotten ridiculous!", 
   {}, 
   34639, 
   null, 
   1076636700.0
  ], 
  [
   34652, 
   null, 
   "Carman", 
   "No it hasn't gotten pointless- it's gotten ridiculous!\n\n \n I agree....", 
   {}, 
   34647, 
   null, 
   1076640060.0
  ], 
  [
   34660, 
   null, 
   "mizmaxx", 
   "Correct; you said it was nonsense.\n\n Correct. What you said was nonsense. You said that the fact that PP is a non-profit means that increased revenue goes to increased salary. That is nonsense. You haven't offered any evidence that PP in particular does this, and although it is possible for a non-profit to do so, it is clear that this isn't the way non-profits generally work. Therefore, your statement was nonsense. Are you beginning to understand?\n \n \nOh I?m positive many Planned Parenthood clinics do this.\n\n Maybe you're also \"positive\" the tooth fairy exists. That doesn't make it true. They using evidence, (like a \"fact\" or something), because I really can't take your word for it.\n \n \nThe only point I was trying to get across was that they offer different services, not just abortion and not just for pregnancy, and again, most of these are the same things that I can get info on or have done through my own doctor (abortion included).(...)\n \n I'm not arguing about it anymore... it's gotten pointless.\n\n It's increasingly clear that the truth, facts, reality, etc., matter little to our friend Parcum. He lives in his own little world...", 
   {}, 
   34652, 
   null, 
   1076644080.0
  ], 
  [
   34682, 
   null, 
   "Carman", 
   "Correct. What you said was nonsense. You said that the fact that PP is a non-profit means that increased revenue goes to increased salary. That is nonsense. You haven't offered any evidence that PP in particular does this, and although it is possible for a non-profit to do so, it is clear that this isn't the way non-profits generally work. Therefore, your statement was nonsense. Are you beginning to understand?\n \n \n Maybe you're also \"positive\" the tooth fairy exists. That doesn't make it true. They using evidence, (like a \"fact\" or something), because I really can't take your word for it.\n \n \n It's increasingly clear that the truth, facts, reality, etc., matter little to our friend Parcum. He lives in his own little world...\n\n \n I love ya Mizmaxx cause you tell it like it is!", 
   {}, 
   34660, 
   null, 
   1076658600.0
  ], 
  [
   34685, 
   null, 
   "Parcum", 
   "Carman, you're one of the very few who think so. Welcome to the fantasy world of Mizmax, where everything she says goes! You say that pre-natal care is a big service in Planned Parenthood, I say it is not common and only in certian clinics, then you just rely on mizmax for support? \n \n \nCorrect. What you said was nonsense. You said that the fact that PP is a non-profit means that increased revenue goes to increased salary. That is nonsense. You haven't offered any evidence that PP in particular does this, and although it is possible for a non-profit to do so, it is clear that this isn't the way non-profits generally work. Therefore, your statement was nonsense. Are you beginning to understand?\n\n \n Hogwash! You're manipulating what I said to attack me. YOU said that it does not happen because that \"is not how non-profits work\". I told you how it DOES happen, then you change your argument saying \"I never said it was impossible\" (which is correct; you said it doesn't work that way, hence it doesn't happen). Does Planned Parenthood raise salaries with their paychecks? I'm sure of it. PPFA is simply too large to not have this kind of corruption.", 
   {}, 
   34682, 
   null, 
   1076660160.0
  ], 
  [
   34688, 
   null, 
   "mizmaxx", 
   "Carman, I guess this is what happens when Parcum gets proved wrong. He sputters about not making any sense. You don't look any better with egg on your face, Parcum.", 
   {}, 
   34685, 
   null, 
   1076660820.0
  ], 
  [
   34692, 
   null, 
   "Carman", 
   "Carman, you're one of the very few who think so. Welcome to the fantasy world of Mizmax, where everything she says goes! You say that pre-natal care is a big service in Planned Parenthood, I say it is not common and only in certian clinics, then you just rely on mizmax for support? \n\n \n I don't have to rely on Mizmaxx (or anyone for that matter) when I say that PP offers prenatal care, because I have had it through them, as well as pregnancy support. Isn't that bizzare, considering they don't offer it?! \n \n I also did not say prenatal care is a 'big service', I said it was OFFERED. There is a difference.\n In previous posts, you said it was not offered, not that it was uncommon and only in certain areas.\n \n \"Now, I have never seen a single Planned Parenthood Clinic offer adoption prenatal care or adoption referrals (they simply do not have the equipment to do that. They do, however, offer referrals to prenatal care)...NOT pregnancy support... \"\n \n I'm not sure if you mean adoption and prenatal care, or adoption prenatal care. Prenatal care is the same whether the baby is adopted or not; there isn't a special type of care for adopted babies.\n I'm not attacking you in any way either, just so you know.\n \n But I don't really need to rely on anyone to make statements, thank you... I'm an adult, I know how to think for myself and I actually do it quite often.\n As I said, this whole thing has gotten pointless.... it started out being about a girl being forced into an abortion (I think?), then it was an arguement over what Planned Parenthood does, and somehow we got a little refresher course in Latin thrown in for some reason. Ridiculous.", 
   {}, 
   34685, 
   null, 
   1076667360.0
  ], 
  [
   34716, 
   null, 
   "Parcum", 
   "The truth of the matter is abortion is wrong. Mizmax tries to distract everyone from seeing that it's wrong by telling us how great Planned Parenthood is and how corrupt any organization that disagrees with Planned Parenthood is. So, yes, it's ridiculous.", 
   {}, 
   34692, 
   null, 
   1076708280.0
  ], 
  [
   34792, 
   null, 
   "thebootfitter", 
   "The truth of the matter is abortion is wrong. Mizmax tries to distract everyone from seeing that it's wrong by telling us how great Planned Parenthood is and how corrupt any organization that disagrees with Planned Parenthood is. So, yes, it's ridiculous.\n\n \n No, Parcum. The truth of the matter is YOU BELIEVE abortion is wrong. Mizmaxx believes that abortion should be a legal option to women. Mizmaxx also has a different opinion than you do about the value of Planned Parenthood. Accept this. She is entitled to her opinion, just as you are to yours. \n \n To state without any qualifiers that abortion is 'wrong' is simply absurd. You may believe it's 'wrong' but somebody else may believe it is 'right.' (Or at least that it is A 'right,' whichever the case may be.) Who can say that you are more 'right' than anyone else, Parcum?\n \n What can be said (that cannot be reasonably argued) is that abortion terminates the biological life of a developing human entity inside the mother's body. This developing entity has everything that it needs (save oxygen, nourishment and a safe environment) to be able to grow into a full adult member of the species. Biologically speaking, it is a unique human entity that is in a different stage of development than you or I. --< Many people accept this simple biological fact and are still 'okay' with abortion, because they do not place the same value on that developing human entity as they do on a post-birth individual.\n \n Stick to the facts instead of trying to prove that somebody else is 'wrong' for believing what they believe, and it is likely that your fellow debaters will have more respect for you.\n \n My two cents...\n The Bootfitter", 
   {}, 
   34716, 
   null, 
   1076798040.0
  ], 
  [
   34795, 
   null, 
   "Parcum", 
   "Bootfitter, you don't seem to understand the issue clearly. The fetus is a human being- almost all Americans believe this, and science proves it. Becuase it is a human being, it automatically deserves life. The being is in a different stage of life than you and I, of course, but so is a toddler or infant- should we kill them as well? \n \n Yes I believe Abortion is wrong, and of course Mizmaxx is entitled to her opinion, but I'm not going to fiddle as Rome burns. Thousands lay victim to abortion in the US daily. There is no time to just have opinions- we've got to STOP what we're doing. \n \n FYI- 70% of americans are against abortion.", 
   {}, 
   34792, 
   null, 
   1076801040.0
  ], 
  [
   34799, 
   null, 
   "thebootfitter", 
   "Bootfitter, you don't seem to understand the issue clearly... The fetus is a human being- almost all Americans believe this, and science proves it.\n\n I would assert that I do understand the issue quite clearly. We are just looking at it from different perspectives.\n \n First of all... in order to call a fetus a 'human being,' you must have an agreed upon definition of 'human being.' Philisophically, one may assert that a 'being' must have some form of awareness, or any other such line of thought that precludes a pre-birth developing entity to be considered a 'being.' Legally, there is no black and white distinction whether or not a fetus can have any rights associated with a 'human being' or with 'personhood.' And as far as I am aware, science doesn't answer the question of whether or not that developing entity is a 'human being.' Science does assert that it is a unique new member of our species, but science cannot assign any value to it. That's not the job of science... it's a legal and philisophical question, not a scientific one.\n \n The fact that 'almost all Americans believe' that the fetus is a human being is irrelevant. This is an example of the fallacy of 'appeal to belief.' It doesn't matter if ALL citizens of our country believed it were true. That wouldn't make it true.\n \n \nBecuase it is a human being, it automatically deserves life.\n \n If the fetus were considered by all to be a 'human being' with the same legal rights as any other 'human being,' then abortion would be illegal. Again, there is a distinction here. You extrapolate from your opinion that a fetus automatically deserves life. But your initial premise is not based in fact. It would be just as 'logical' to say that the fetus is not a human being, therefore, it doesn't deserve the right to life.\n \n On the other hand, asserting that 1) a fetus is human; 2) a fetus is unique individual member of the species that has been developing and growing since the sperm fertilized the egg to create a zygote; and 3) a fetus needs only nourishment, oxygen, and a safe environment in order to be able to develop into an adult member of the species... These three points are fact. They are not reasonably debatable in physical terms. Do you see the distinction?\n \n \n\"The being is in a different stage of life than you and I, of course, but so is a toddler or infant- should we kill them as well?\"\n\n I don't know... should we? This is a separate question. It has no bearing on the topic of abortion unless pre-birth individuals are given the same rights and legal protection as post-birth individuals. Currently in our country, that is not the case. Moot point.\n \n \n\"There is no time to just have opinions- we've got to STOP what we're doing.\"\n\n There is no time to just have opinions? Time is all around us. I have opinions on a lot of things, and those opinions are independent of time. Time keeps on ticking. People have opinions. \n \n Your opinion is that \"we've got to stop what we're doing.\" Recognize that not everyone holds your opinion. You are never, ever, ever going to change that, no matter how hard you try... no matter how noble you believe your cause to be. Your efforts may or may not lead to a reduction in the number of abortions -- but even if you 'save' one baby through your efforts, I would guess that you feel your efforts are justified. Your efforts may even lead to laws in our country being changed such that fewer (or no) legal abortions are performed. But even if abortions are illegal, some people will still be of the opinion that to have an abortion is 'okay' or 'no big deal.' You cannot force someone to accept your opinions as their own. You cannot force someone to believe that your way of thinking is 'right' for themselves.\n \n \nFYI- 70% of americans are against abortion.\n\n Depending on how you phrase the question, you could conduct a survey to get just about any statistic that you were looking for. Many people are personally opposed to abortion for various reasons, but they do not believe they can impose their values on other people... and therefore believe that other people should have the option to have a legal abortion if that's what they want.", 
   {}, 
   34795, 
   null, 
   1076806740.0
  ], 
  [
   34813, 
   null, 
   "mizmaxx", 
   "*shrug* I don't think there's anything wrong with Parcum's fanaticism either, bootfitter. I don't think he's barking up the wrong tree, in fact he's nowhere near any tree at all, he's just barking.\n \n If, in fact, it were true that abortion was morally reprehensible on the scale of, say, Shell oil killing Nigerians, or COINTELPRO, I would be fighting it the same way I fight truly unnecessary immoral behavior. But it isn't.\n \n So although I understand Parcum's fervor, I just think it's sadly and terribly misplaced.", 
   {}, 
   34799, 
   null, 
   1076818440.0
  ], 
  [
   34814, 
   null, 
   "Parcum", 
   " First of all... in order to call a fetus a 'human being,' you must have an agreed upon definition of 'human being.' Philisophically, one may assert that a 'being' must have some form of awareness, or any other such line of thought that precludes a pre-birth developing entity to be considered a 'being.' Legally, there is no black and white distinction whether or not a fetus can have any rights associated with a 'human being' or with 'personhood.' And as far as I am aware, science doesn't answer the question of whether or not that developing entity is a 'human being.' Science does assert that it is a unique new member of our species, but science cannot assign any value to it. That's not the job of science... it's a legal and philisophical question, not a scientific one.\n\n \n Well of course we can get into the cracks and find the little technicalities for defining life, but it really isn't nessecary. Beings do not have to have forms of awareness, even though the fetus is aware after six weeks. Unconscious people aren't aware- are they not human? People in vegetative states are not aware... are they not human? Even when we're asleep, we have a level of unawareness... are we only partially human? Of course not. Of course it's necessary to have the ability to be aware to be considered a human being, but it isn't directly nessecary. Not all human beings are aware, we must understand. \n \n \n The fact that 'almost all Americans believe' that the fetus is a human being is irrelevant. This is an example of the fallacy of 'appeal to belief.' It doesn't matter if ALL citizens of our country believed it were true. That wouldn't make it true.\n\n \n It isn't a fallacy. It wasn't even supporting my argument, it's simply a fact I'm stating. It was a followup of your statement- \"Many people accept this simple biological fact and are still 'okay' with abortion, because they do not place the same value on that developing human entity as they do on a post-birth individual.\" It doesn't mean that I'm correct and your incorrect (that would mean that I would have to convert to Protestantism, since most Americans are protestant). \n \n \n If the fetus were considered by all to be a 'human being' with the same legal rights as any other 'human being,' then abortion would be illegal. Again, there is a distinction here. You extrapolate from your opinion that a fetus automatically deserves life. But your initial premise is not based in fact. It would be just as 'logical' to say that the fetus is not a human being, therefore, it doesn't deserve the right to life.\n\n \n The problem is, not all consider the fetus a human being- I never said all considered the fetus a human being. Some don't. I don't want to make a historical trivialization, but slavery was legal in the United States for 200 years. Obviously, some people didn't consider slaves completely human, so it remained legal. It's a completely logical statement. The fetus is a human being. All human beings deserve life. Therefore, the fetus deserves life. \n \n \n On the other hand, asserting that 1) a fetus is human; 2) a fetus is unique individual member of the species that has been developing and growing since the sperm fertilized the egg to create a zygote; and 3) a fetus needs only nourishment, oxygen, and a safe environment in order to be able to develop into an adult member of the species... These three points are fact. They are not reasonably debatable in physical terms. Do you see the distinction?\n\n \n I don't see your point at all. Are you saying that because the fetus is dependent it's not completely human? I simply do not see your point. \n \n \n I don't know... should we? This is a separate question. It has no bearing on the topic of abortion unless pre-birth individuals are given the same rights and legal protection as post-birth individuals. Currently in our country, that is not the case. Moot point.\n\n \n So, slavery was OK? Come on, you know perfectly well that's ridiculous. \n \n \n Your opinion is that \"we've got to stop what we're doing.\" Recognize that not everyone holds your opinion. You are never, ever, ever going to change that, no matter how hard you try... no matter how noble you believe your cause to be. Your efforts may or may not lead to a reduction in the number of abortions -- but even if you 'save' one baby through your efforts, I would guess that you feel your efforts are justified. Your efforts may even lead to laws in our country being changed such that fewer (or no) legal abortions are performed. But even if abortions are illegal, some people will still be of the opinion that to have an abortion is 'okay' or 'no big deal.' You cannot force someone to accept your opinions as their own. You cannot force someone to believe that your way of thinking is 'right' for themselves.\n\n \n I'm not saying that I'm saying any fetuses by debating with you, rather, I'm helping the pro-life cause which will eventually lead to the end of abortion. The point isn't to change people's minds; the point is to stop the killing. I don't care if some Americans or even most Americans are OK with abortion. Abortion is killing an innocent life and must be stopped. I'm not forcing anyone into my beliefs, I'm telling people things they don't know- the undeniable fact that abortion is the killing of an innocent human being, and therefore should not be practiced for all the illegitimate reasons given (can't afford a child, don't want a child, even rape). \n \n You see to be debating something different than I. I'm telling you that abortion is the killing of an innocent human being. Because killing innocent human beings is (almost) always wrong, abortion is wrong, and therefore must be outlawed.\n \n \n Depending on how you phrase the question, you could conduct a survey to get just about any statistic that you were looking for. Many people are personally opposed to abortion for various reasons, but they do not believe they can impose their values on other people... and therefore believe that other people should have the option to have a legal abortion if that's what they want.\n\n \n According to a CNN/Gallop Poll done last fall, 17% of Americans believe abortion is ALWAYS wrong, and 55% of Americans believe it is usually wrong.\n \n Mizmaxx, stop picking fights. You're very immature. It makes you look really weak, unintelligent, and peurile.", 
   {
    "unicode_changes_made": true
   }, 
   34813, 
   null, 
   1076818560.0
  ], 
  [
   34838, 
   null, 
   "thebootfitter", 
   "If, in fact, it were true that abortion was morally reprehensible on the scale of, say, Shell oil killing Nigerians, or COINTELPRO, I would be fighting it the same way I fight truly unnecessary immoral behavior. But it isn't.\n So although I understand Parcum's fervor, I just think it's sadly and terribly misplaced.\n\n From Parcum's perspective, though, IT IS TRUE that abortion is morally reprehensible on a scale bigger than any other tragedy ever seen in the history of the world. Abortion has forcibly terminated the development of over 40,000,000 unique members of our species in this country alone in the last 30 years. That's a pretty significant number no matter which side of the abortion fence someone is on. It's not reasonable to say that 40 million abortions have had no impact on our society. Think about it... if someone believes that a fetus is a human being that should have full rights just as any other human being in our country... abortion is pretty bad.\n \n All I'm saying is that he is standing on just as solid of ground as you are. Mizmaxx, your position in the matter is not 'right.' Neither is Parcum's. You both hold beliefs that are willing to argue for.", 
   {}, 
   34813, 
   null, 
   1076864400.0
  ], 
  [
   34850, 
   null, 
   "Parcum", 
   "Well here's the thing- if the fetus is a human being, abortion is always wrong, even in rape (and it is even bad when the mother's life is threatened, but of course there's no option). If, however, the fetus is not human, then abortion is always ok. There's no middle. Abortion is either ok or it's not.\n \n You must understand bootfitter that Mizmax has lost control of maturity during debate, and so many times I fall into the same behavior. It's not about saving fetuses- it's about pride.", 
   {}, 
   34838, 
   null, 
   1076886600.0
  ], 
  [
   34862, 
   null, 
   "thebootfitter", 
   "Well here's the thing- if the fetus is a human being, abortion is always wrong, even in rape (and it is even bad when the mother's life is threatened, but of course there's no option). If, however, the fetus is not human, then abortion is always ok. There's no middle. Abortion is either ok or it's not.\n\n \n I will attempt to clarify this one more time...\n \n A fetus [from human parents] is human. It certainly isn't a whale fetus. It's not an alien fetus. It is a human fetus. To argue otherwise is absurd (though some uneducated pro-choicers still use this argument). \n \n A fetus may or may not be considered a 'human being' or a 'person' with legal rights. This isn't a scientific fact that can be supported or proven false. This is an opinion. Someone else may hold a different opinion that is no more valid than yours.\n \n Here's where there is a perceived 'middle ground' that some people see that it seems you do not see from your perspective. Some will argue that yes, a fetus is human (duh!), but that doesn't necessarily make it a human being the same as you or I with equal rights according to the law.\n \n Additionally, not everything in daily life is always so black and white. There's no need to take this example to extremes, for it is only an example, but you could say that stealing (like abortion) is wrong, no matter what -- no middle ground. Is that true even for an orphan boy on the street who is stealing for the sole purpose of feeding the mouths of his two younger siblings?\n \n Believe me, Parcum, there exist individuals with higher IQ's and more education than you who have pondered and researched the topic far more than you have who still determine that there is nothing morally 'wrong' with abortion. That doesn't suggest that your opinion isn't valid. On the contrary, your opinion is just as valid as that of a doctor of philosophy (though more people will be likely to listen to the opinion of someone else with greater credentials). It just means you believe one thing and other people may believe another thing. Who's 'right'? You are, of course! No, wait, they are! No, you are! No, they are!\n \n I suspect your belief that abortion is 'wrong' is based primarily on faith/religious/spiritual values. (I may be mistaken, but that's the impression I get.) If God created those little human beings with a soul, and we are destroying them, then we are destroying God's work. And that can't be good. From this perspective, abortion does seem pretty terrible. But it's based on a belief that you (presumably) have about God. What if... consider for just a moment... what if God doesn't exist? Or what if God is completely different than the picture you have created in your mind that tells you who God is. What if the Buddhists actually have a better idea of what 'god' is than you do? From your perspective, that is absurd, because you believe so strongly in the God you know and that belief has been confirmed by your experiences in life. In your mind, you KNOW that God exists. But even if you believe this with all your heart, mind and soul, there is a possibility that God doesn't exist -- either at all or at least in the way that you picture God. Hmm... in the absence of God... in the absence of an eternal soul... is abortion really 'bad'? Others may not believe in God the same way you do, Parcum. So then, who is 'right' about anything.\n \n I don't want to say this to sound condescending or patronizing, but I am going to say it anyway... I encourage you to try something. Step down away from your pride. Consider life for a moment from a different perspective. It may be difficult, but try it... Consider that perhaps God is different than you believe God to be. Consider that perhaps Mizmaxx is just as 'right' as you are. I'm not suggesting you should give up any of your strongly held beliefs... just consider that there are other ways to look at the world. And to think that your way is the only way or the best way or the right way may be a pretty self-centered way to think of the world.\n \n Sorry... I've gone on too long already. I hope you read this with an open mind and don't think that I'm trying to convince you to believe something you don't want to believe in.", 
   {}, 
   34850, 
   null, 
   1076902500.0
  ], 
  [
   35188, 
   null, 
   "mizmaxx", 
   "From Parcum's perspective, though, IT IS TRUE that abortion is morally reprehensible on a scale bigger than any other tragedy ever seen in the history of the world. \n\n That's why I say I understand his fervor. If what he was saying were true, it would make sense to be so upset about it. It just isn't true.", 
   {}, 
   34862, 
   null, 
   1077173880.0
  ], 
  [
   35192, 
   null, 
   "Robbie", 
   "I agree with much of what you are saying bootfitter. It is extremely important to be able to try and see things from the other side. However I'm not in full agreement.\n \n You seem to beleive that there is no ultimately right answer. You say look at it from the one side - a woman should be able to have an safe, legal abortion for health reasons or to ensure that a child is born into a welcoming and prepared family. You say look at it from the other side - abortion is the legalized murder of our most innocent on a level beyond anything we've ever seen, it causes horrible pain from complications and to women and men who feel that they're complicit in murder or feel pressure from boyfriends and family.\n \n And you say that, in a way both are right. It only depends on your perspective. That's where I disagree. I do beleive there is a true right and wrong. It is a belief all in itself to say that there is no truly right belief.", 
   {}, 
   34862, 
   null, 
   1077176280.0
  ], 
  [
   35201, 
   null, 
   "thebootfitter", 
   "I agree with much of what you are saying bootfitter. It is extremely important to be able to try and see things from the other side. However I'm not in full agreement... And you say that, in a way both are right. It only depends on your perspective. That's where I disagree. I do beleive there is a true right and wrong. It is a belief all in itself to say that there is no truly right belief.\n\n I am not suggesting there is no objective truth. In fact, I believe there IS objective truth. At least when discussing the physical world, but perhaps even when discussing a metaphysical world.\n \n What I am suggesting is can you really know that your way of thinking is the 'right' way of thinking? How? What about the person who believes just as fervently that THEY are 'RIGHT'? In truth, both 'sides' ARE right, according to their beliefs.\n \n So, what is the objective truth in the case of abortion? The objective truth is that abortion intentionally terminates the development of a unique member of our species that contains everything that it needs (save nourishment, oxygen, and a safe environment) to be able to grow into an adult member of the species. Nobody can reasonably argue with that in a physical sense. It is objective truth. It is 'right' from both perspectives. \n \n More objective truth is that abortion can cause physical and psychological pain for the mother. (That is true of many other things besides abortion, but that doesn't make it untrue in the case of abortion, nor does it necessitate that it is ALWAYS true for abortion.) Is this good or bad? Depends... maybe the mother perceives that a 'greater good' came out of this 'bad' experience. Or maybe the mother perceives that something 'terrible' came out of this experience that she thought would be 'liberating.' Or maybe a million other things. \n \n More objective truth is that for almost every abortion that is performed, there is one less live birth. One less person that is born into the world. Good or bad? Depends on your perspective, really.\n \n Would our country or humanity be 'better' off if there were no legal abortions allowed? Hmm... that really depends on what you mean by 'better.' There would be no legal abortions in our country if all abortions were made illegal. That's objective truth. But to say that we would be better off? That's mere speculation and opinion.\n \n I would guess that the reason that you disagree with me is that you believe your perspective is really the 'right' perspective, and if you allow that someone else's perspective may also be 'right,' then that might make you 'wrong.' But you're not wrong... you just believe something different.\n \n So, Robbie... if there IS a 'right' way to look at abortion, then what is it?", 
   {}, 
   35192, 
   null, 
   1077181560.0
  ], 
  [
   36332, 
   null, 
   "Robbie", 
   "I am not suggesting there is no objective truth. In fact, I believe there IS objective truth. At least when discussing the physical world, but perhaps even when discussing a metaphysical world....\n \n I would guess that the reason that you disagree with me is that you believe your perspective is really the 'right' perspective, and if you allow that someone else's perspective may also be 'right,' then that might make you 'wrong.' But you're not wrong... you just believe something different.\n \n So, Robbie... if there IS a 'right' way to look at abortion, then what is it?\n\n \n Well, I do admit that I think I have the right perspective! \n \n What I'm saying is I think it looks like you beleive there is no true right or wrong moral perspective. Your saying its really just opinion. That's what I don't agree with. I believe that abortion is either wrong or right. I don't beleive that its all in the eye of the beholder. I think that mizmaxx and parcum agree - parcum beleives that he is right, mizmaxx beleives that she is right. They agree that one side is right - although they disagree on which side that is. \n \n I beleive that there is an absolute right and an absolute wrong. Something that is true morally whether I agree with it or not. If I don't agree with it, then I am wrong. \n \n I appreciate the facts you have upheld as objective truth, they are articulate and accurate. And, I see that you have said that you believe there may be an objective metaphysical truth. Given that, perhaps we are arguing past eachother's heads. Assuming that by metaphysical truth, you mean an absolute right and wrong moral truth, we do agree. In that case, I have misinterpreted your challenges to consider that the other side may be right as a beleif that neither is really right, when you are only trying to encourage open-mindedness.", 
   {}, 
   35201, 
   null, 
   1077762600.0
  ], 
  [
   36693, 
   null, 
   "thebootfitter", 
   "@Robbie\n I believe there is absolute truth. But as soon as you place a value on that truth and call it right or wrong or good or bad, it becomes subjective. Who is to say what is 'right' or 'wrong'? \n \n In order to have 'moral' values, one must first have a standard. Where does that standard come from? The standard can come from agreed upon values in a society through which laws tend to be made. But morals and laws and beliefs vary from culture to culture. Who can say which culture is 'more advanced' or 'more civilized' and better able to dictate absolute moral values than any other culture? There simply is not a consistent worldwide standard for morals and values.\n \n If an objective all-powerful God exists, then perhaps God is the ultimate standard. If there is a God, you could say that anything that God looks upon as 'good' or 'right' is an absolute moral value, therefore absolute moral values exist. However, no one knows with 100% certainty that God exists. And some people don't believe God exists at all. Individuals can only believe (perhaps very strongly) whether or not God exists. And even if God does exist, how can anyone claim to know with 100% certainty what God sees as 'good' or 'bad'? Individuals can only believe (again, perhaps quite strongly) that something is 'right' or 'wrong' in the eyes of God.\n \n What I am saying is that there is absolute truth in the physical realm. And there may even be an absolute 'right' and 'wrong' according to an objective but unknown standard (God, for example). But in the physical realm, we cannot KNOW what that objective 'right' and 'wrong' are. We can only believe we know -- as you stated in your response, \"Well, I do admit that I think I have the right perspective!\" [emphasis added] Of course you do! Otherwise it is unlikely that you would still have that perspective. But it is within the realm of possibilities that you may find out someday that you are completely 'wrong.' Or that it doesn't really matter in the end, and it is only what you make of it. There is nothing wrong with believing in something. There is nothing wrong with communicating your perspective to others in the 'hope' that they will see things from that perspective as well.\n \n There may be an objective moral 'right.' And maybe it coincides with your belief system. Or maybe it doesn't. But to believe that your way of thinking is 'right' and it's the only 'right' perspective and anybody who believes differently is absolutely 'wrong' ignores the fact that IF there IS an objective moral 'right' -- YOU may be WRONG! Can you accept that?", 
   {}, 
   36332, 
   null, 
   1077932460.0
  ], 
  [
   36728, 
   null, 
   "Robbie", 
   "Absolutely! I am well aware of the possibility that I am wrong. As I said in the above post - I do beleive there is an absolute moral standard, and if I don't agree with it then I am wrong. \n \n You are right that there are many different values from culture to culture. I think that evidence for the true moral standards may be hinted at by similairities between worldviews. C.S. Lewis said something to the effect of: Cultures disagree on whether a man should have one woman or several, but they have all agreed that he must not simply have any woman he likes! Apparently, C.S. Lewis studied the laws of widely different cultures and was impressed by the similarities - not the differences. I don't know if he wrote a book about it, its something that I plan to look up. It says in the Bible that God wrote basic truths about life in the hearts of everyone. \n \n The reason people debate is that they have different views on a subject and believe that they have the right one. This implies to me that they believe there is an ultimate right and wrong. I think there is, and by looking at the facts, the arguements, and other views we can decide which is most likely to be true.", 
   {}, 
   36693, 
   null, 
   1077957120.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  STOP forced abortions on teenage girls!", 
  "url": "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls.html", 
  "breadcrumbs": [
   "Abortion"
  ], 
  "id_number": 1465, 
  "discussion_files": [
   [
    "7770.html", 
    "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls-print.html"
   ], 
   [
    "7771.html", 
    "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls-5-print.html"
   ], 
   [
    "7772.html", 
    "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls-4-print.html"
   ], 
   [
    "7773.html", 
    "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls-3-print.html"
   ], 
   [
    "7774.html", 
    "http://www.4forums.com/political/abortion-debates/1465-stop-forced-abortions-teenage-girls-2-print.html"
   ]
  ], 
  "identifier": 1465
 }
]