[
 [
  [
   415959, 
   null, 
   "NATO 556", 
   "The gun control nuts love to ask the question \"Why would anybody have a need for (fill in the blank), conveniently overlooking the fact that a constitutional right doesn't warrant need or just cause to be exercised and enjoyed by the people in whatever manner they see fit.\n \n Not to get into such complicated discussion, here's a prime example of why people have a legitimate need for all manner of firearms and accessories.\n \n Trial of 'ninjas' accused of killing Florida couple to begin - CNN.com\n \n \nJury selection begins Monday in the double-murder trial of eight alleged \"ninjas\" accused of shooting and killing a Florida couple known for adopting special-needs children.\n \n Dressed as ninjas and wearing black masks, Leonard Gonzalez Jr. and seven others allegedly crept into the home of the couple on July 9, 2009.\n \n Prosecutors accuse Gonzalez Jr. of shooting and killing Melanie and Byrd Billings while one of the couple's special-needs children looked on.\n \n If convicted Gonzalez, 35, faces the death penalty in Pensacola, Florida.\n \n The gang of \"ninjas\" allegedly entered the home with hopes of stealing the family's home safe, which they believed contained upwards of $13 million.\n \n The Billingses cared for 13 special needs kids, nine of whom were home at the time.\n \n A small safe containing prescription medication, family documents and some jewelry was taken, and later found in the backyard of a woman who said she was a friend of Gonzalez, authorities have said.\n \n Two sources familiar with the investigation told CNN that a second safe at the home contained at least $100,000.\n \n Of the eight people arrested in the case, seven males are facing murder charges and home invasion robbery. One woman is accused of being an accessory after the fact.\n \n The seven males, including a 16-year-old charged as an adult, have pleaded not guilty to the charges.\n \n A nurse who works with special-needs children interviewed the boy, who has autism and speech issues, regarding the deaths of the Billingses.\n \n The nurse told police that the child said \"two bad men\" were wearing black masks when they knocked on the door. They woke Byrd Billings and said, \"You're going to die.\"\n \n Escambia County Sheriff David Morgan has said Gonzalez once worked for a car dealership Byrd Billings owned, and court documents state that Gonzalez received financial support from the family for a martial-arts studio that he ran.\n \n An attorney representing the Billingses has said that Byrd Billings made a nominal donation to Gonzalez's karate charity.\n \n The child, whose age was not given, said one of the men counted to three \"before he shot mom and dad,\" and his father kept screaming, \"No way, no way.\"\n \n Byrd Billings grabbed the back of one man's neck and struggled with him before he was shot, the child said. The boy said Melanie Billings \"got shot in her shirt.\"\n \n Another child told the same nurse he was upstairs in bed and stayed in his room when he heard the knock on the door. The second boy recalled hearing \"seven booms\" and crept into the hallway. He heard Melanie Billings scream, he said, but stayed upstairs until police arrived.\n \n It was unclear from the interviews whether the men knocked on the bedroom door or the front door of the home.\n \n The children's accounts were contained in hundreds of pages of documents released by the state attorney's office as part of the pretrial discovery process.\n \n Also in the documents is a police interview with Gonzalez, who told authorities in a July 22, 2009, interview that a group of car dealers did not like Byrd Billings and had gotten together to discuss this.\n \n Used car dealer Henry \"Cab\" Tice came to him, Gonzalez said, and told him the group wanted Billings killed, but he refused to do it.\n \n Another son of Billings told police that a man named \"Cab\" had \"double-crossed\" his father and that the son was present when the two men argued.\n\n \n A violent home invasion for a multiple-member gang who obviously had the full intention or murdering the people inside in order to get what they wanted.\n \n And before somebody tries to argue \"That's too rare of an occurrence to justify anything\" just remember, you use the non-existent issue of street gangs possessing the .50 BMG in order to argue for the banning of it from civilian possession.", 
   {
    "post_info": {
     "post_title": "Why do we need it?"
    }
   }, 
   null, 
   null, 
   1288389240.0
  ], 
  [
   415965, 
   null, 
   "Xcaliber", 
   "Machine Guns, Tommy Guns, M60's and all these other high powered weapons we have today did not exist when our constitution was written. I'm fairly certain if they had the Founding fathers would have written the law a bit different . The only way the Government can do anything about Guns would be to Ratify the Constitution to change the Law, they haven't done so in the 200 or so years we have been a country so chances are they won't do it now either. If they won't do that, then they should leave Gun owners alone, period. As long as the Constitution give people the right then any Law , Federal or State, in my opinion is unconstitutional. If a Criminal wants a Gun he'll find a way to get one, so regular everyday people should have that same option.", 
   {}, 
   415959, 
   null, 
   1288393080.0
  ], 
  [
   415969, 
   null, 
   "NATO 556", 
   "Machine Guns, Tommy Guns, M60's and all these other high powered weapons we have today did not exist when our constitution was written.\n\n \n Nor did cellphones, computers, the internet, cars, apartments, same sex marriage, interracial relations, minimum wage, quality of life standards, DNA and fingerprint analysis, abortion, or the threat of terrorism. What's your point?\n \n \nI'm fairly certain if they had the Founding fathers would have written the law a bit different.\n\n \n I'm fairly certain they wouldn't have.\n \n \nThe only way the Government can do anything about Guns would be to Ratify the Constitution to change the Law, they haven't done so in the 200 or so years we have been a country so chances are they won't do it now either.\n\n \n Hasn't stopped them from interfering in areas they don't have the authority to.", 
   {}, 
   415965, 
   null, 
   1288394400.0
  ], 
  [
   415972, 
   null, 
   "Xcaliber", 
   "\n Hasn't stopped them from interfering in areas they don't have the authority to.\n\n \n No it hasn't, that's my point. The Constitution Gives every free American the right to bear Arms.. I fully support that and all other Rights . The Government should stay out of it, but history proves they won't.", 
   {}, 
   415969, 
   null, 
   1288394940.0
  ], 
  [
   415974, 
   null, 
   "Doc Jones", 
   "No it hasn't, that's my point. The Constitution Gives every free American the right to bear Arms.. I fully support that and all other Rights . The Government should stay out of it, but history proves they won't.\n\n \n Correct, of all the freedoms most dear is the right to be left to **** alone.", 
   {}, 
   415972, 
   null, 
   1288395360.0
  ], 
  [
   415977, 
   null, 
   "NATO 556", 
   "It's still all beside the point. Cases like this are a prime example of the need for sufficient firepower to defend ourselves. There are times when a handgun with a 10 round magazine simply aren't going to cut it, and this is easily one of those times.\n \n So break out the AR-15s, break out the AK-47s and Mini-14s and SIG-556s and the Remington 11-87 shotguns. Load up those 30 round magazines, 'cause baby, it's dangerous out there.", 
   {}, 
   415974, 
   null, 
   1288398000.0
  ], 
  [
   415983, 
   null, 
   "Penfold", 
   "\n So break out the AR-15s, break out the AK-47s and Mini-14s and SIG-556s and the Remington 11-87 shotguns. Load up those 30 round magazines, 'cause baby, it's dangerous out there.\n\n \n Correct! The place is full of retarded nutters with AK-47's, Mini-14's, and SIG-55's!", 
   {}, 
   415977, 
   null, 
   1288401720.0
  ], 
  [
   415992, 
   null, 
   "NATO 556", 
   "Correct! The place is full of retarded nutters with AK-47's, Mini-14's, and SIG-55's!\n\n \n Just like the place is full of nutters who think it's better to let criminals run free as long as we restrict weapons, and people who think it's alright to attack our constitutional rights for stupid reasons?", 
   {}, 
   415983, 
   null, 
   1288406880.0
  ], 
  [
   416011, 
   null, 
   "Doc Jones", 
   "Just like the place is full of nutters who think it's better to let criminals run free as long as we restrict weapons, and people who think it's alright to attack our constitutional rights for stupid reasons?\n\n \n Have you ever noticed how much pinhead sounds like Josh Shuggerman?\n \n He doesn't realize the position he, himself puts and labels him as a true nutter by claiming \"everyone is crazy but me!\"\n \n And...an aside. Highly doubtful any honest gun grabbers will be posting this weekend since they only use their paid empoyer time to post on the board which has become evident and routine...", 
   {}, 
   415992, 
   null, 
   1288436220.0
  ], 
  [
   416012, 
   null, 
   "Doc Jones", 
   "The gun control nuts love to ask the question \"Why would anybody have a need for (fill in the blank), conveniently overlooking the fact that a constitutional right doesn't warrant need or just cause to be exercised and enjoyed by the people in whatever manner they see fit.\n \n Not to get into such complicated discussion, here's a prime example of why people have a legitimate need for all manner of firearms and accessories.\n \n Trial of 'ninjas' accused of killing Florida couple to begin - CNN.com\n \n \n \n A violent home invasion for a multiple-member gang who obviously had the full intention or murdering the people inside in order to get what they wanted.\n \n And before somebody tries to argue \"That's too rare of an occurrence to justify anything\" just remember, you use the non-existent issue of street gangs possessing the .50 BMG in order to argue for the banning of it from civilian possession.\n\n \n Nah, ol sliiiiick is so tough he could take on a bunch of armed 'ninjis' and prevailed without breaking a sweat. He wouldn't have even called the law because he would deem it just good clean fun. He maintains he doesn't need a gun...especially in his \"home\".", 
   {}, 
   415959, 
   null, 
   1288436580.0
  ], 
  [
   416061, 
   null, 
   "sinjin", 
   "It's still all beside the point. Cases like this are a prime example of the need for sufficient firepower to defend ourselves. There are times when a handgun with a 10 round magazine simply aren't going to cut it, and this is easily one of those times.\n \n So break out the AR-15s, break out the AK-47s and Mini-14s and SIG-556s and the Remington 11-87 shotguns. Load up those 30 round magazines, 'cause baby, it's dangerous out there.\nCivilians need these weapons to defend against the possibility of ninjas? Are you cracked?", 
   {}, 
   415977, 
   null, 
   1288492020.0
  ], 
  [
   416062, 
   null, 
   "sinjin", 
   "And before somebody tries to argue \"That's too rare of an occurrence to justify anything\" just remember, you use the non-existent issue of street gangs possessing the .50 BMG in order to argue for the banning of it from civilian possession.\nWhich \"street gangs\" are we talking about?\n \n Smugglers' deadly cargo: Cop-killing guns - CNN\n \n I'm not for banning it btw.", 
   {}, 
   415959, 
   null, 
   1288492380.0
  ], 
  [
   416067, 
   null, 
   "NATO 556", 
   "Civilians need these weapons to defend against the possibility of ninjas? Are you cracked?\n\n \n Not necessarily ninjas, but violent home invasions are a definite possibility and reality that has to be dealt with. And with the drug violence down in Arizona, Texas and other border states, where kidnappings are becoming more and more common, one needs to be prepared in case things go very wrong very fast.\n \n It's no different than having a smoke alarm in each room of the house, and a fire extinguisher on each floor.\n \n \nWhich \"street gangs\" are we talking about?\n\n \n Ask those that cite the Brady Campaign and Violence Policy Center, like Brady and Galileo.", 
   {}, 
   416061, 
   null, 
   1288494300.0
  ], 
  [
   416086, 
   null, 
   "Doc Jones", 
   "Which \"street gangs\" are we talking about?\n \n Smugglers' deadly cargo: Cop-killing guns - CNN\n \n I'm not for banning it btw.\n\n \n You are not sliiiiiick? Maybe it would be better if the fed gov't did it's job and repelled these invaders from entering the country in the first place?\n \n You know full well kalifornia is going to let illegal aliens vote too; that is the only chance you liberals have of keeping your screwey politicians in office but you don't say a thing about that. Gun control is NOT CRIME CONTROL. The government can't even do the enumerated task of enforcing immigration laws and drug laws so your solution is to ban guns. :xcensored\n \n You are one sick puppy! You ignore the fact that most of those \"smugglers\" were cops and federales. You try to associate their supply of guns from the U.S. and the ATF, FBI and MEXICAN gov't won't even make that claim themselves. We bought them enough military products including tanks and helicoptors and all kinds of weaponry with American Tax Dollars thanks to the present and past Presidents. Whole areas of American property, parks and wild land are open to the gangs and closed to Americans.\n \n Isn't it about time you had a nice hot cup of tea? Your liberal politicians broke the State, lined their pockets and smothered the U.S. in debt and I bet you will vote for the same liberal crooks again?....meanwhile trying to ditch a Constitutional and incorporated civil right. That is some doozy of a theory (lie) you keep coming up with.", 
   {}, 
   416062, 
   null, 
   1288532400.0
  ], 
  [
   416102, 
   null, 
   "sinjin", 
   "It's no different than having a smoke alarm in each room of the house, and a fire extinguisher on each floor.\nWhat happens when a fire extinguisher falls into the wrong hands?", 
   {}, 
   416067, 
   null, 
   1288547460.0
  ], 
  [
   416132, 
   null, 
   "Doc Jones", 
   "What happens when a fire extinguisher falls into the wrong hands?\n\n \n You prying for some way to make a bomb you little nutter?\n \n Have you ever seen what a fully loaded firetruck can do? Weapon of mass wetation. Go to the Mardi Gras sometime and see how a mob and the streets really get cleaned.", 
   {}, 
   416102, 
   null, 
   1288563480.0
  ], 
  [
   416140, 
   null, 
   "NATO 556", 
   "What happens when a fire extinguisher falls into the wrong hands?\n\n \n Then you make a police report, file an insurance claim, and then buy a new one. What else?", 
   {}, 
   416102, 
   null, 
   1288568880.0
  ], 
  [
   416168, 
   null, 
   "sinjin", 
   "Then you make a police report, file an insurance claim, and then buy a new one. What else?\nSince there is no rampant criminality associated with fire extinguishers, \n I think any suggestion of their equivalence with firearms ridiculous.", 
   {}, 
   416140, 
   null, 
   1288631220.0
  ], 
  [
   416170, 
   null, 
   "NATO 556", 
   "Since there is no rampant criminality associated with fire extinguishers, I think any suggestion of their equivalence with firearms ridiculous.\n\n \n And I think it's ridiculous that the possibility of criminal misuse of a legitimate piece of property, would be considered by some as sufficient grounds for calling for blatantly useless and unconstitutional restrictions. Your own children could be criminally mistreated, either by you or somebody in your neighborhood, but that isn't grounds for Social Services to come in and take them away from you.\n \n I also find it ridiculous that some people feel it's alright to differentiate when it comes to safety equipment and supplies, claiming that it's alright to use some and have them readily available in case of an emergency, but not others. It's like saying a person is only being reasonable when they wear a seat belt, but they're paranoid to be carrying a tire iron (especially since tire irons are used for criminal purposes at times.)", 
   {}, 
   416168, 
   null, 
   1288632600.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Why do we need it?", 
  "url": "http://www.4forums.com/political/gun-control-debates/14696-why-do-we-need.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14696, 
  "discussion_files": [
   [
    "7125.html", 
    "http://www.4forums.com/political/gun-control-debates/14696-why-do-we-need-print.html"
   ], 
   [
    "7126.html", 
    "http://www.4forums.com/political/gun-control-debates/14696-why-do-we-need-2-print.html"
   ]
  ], 
  "identifier": 14696
 }
]