[
 [
  [
   28709, 
   null, 
   "nick", 
   "Who needs the old crone? Right now a single parent so called mother on welfare can excercise the same political clout as a captain of industry like Branson who employs thousands of people. They both have the same one vote.Tell me that isnt insane.\n \n Who is that sp mother going to vote for but some politician who promises her yet more unearned money stolen from the taxpayer?\n \n A meritocracy would be better.Only those who own property or have a few hundred thousand in liquid assets should be able to vote.No one under 25,women,immigrants etc.\n \n Democracy is mob rule, rule by the lowest common denominator with a dumbed down electorate who are manipulated by appearance over reality.The experiment in mobocracy has gone far enough.Most people are too ignorant to have a vote and putting it in their hands it is like putting a gun in the hands of a child.\n \n Democracy doesnt work because two contrary forces of Capitalism and Socialism cannot be reconciled and there is a perpetual conflict betweeen them.Only a system that defends individual rights can work and that is laissez faire capitalism - not Democracy", 
   {
    "post_info": {
     "post_title": "Democracy Schamocracy"
    }
   }, 
   null, 
   null, 
   1072011420.0
  ], 
  [
   28725, 
   null, 
   "munkyman", 
   "Exactly, because over the 200 some odd years of the existance of the US its horrible system has not caused it to flourish. its not like americans enjoy a higher quality of life than most of the rest of the world. so obviously you are correct.", 
   {}, 
   28709, 
   null, 
   1072050840.0
  ], 
  [
   28761, 
   null, 
   "Broker", 
   "I'd have to echo that... in little more than 200 years the United States has become the most productive, wealthy, and powerful nation to ever grace the Earth. We enjoy the highest standard of living in the world...in fact, US standard of living outpaced Europe in the late 1790s...\n \n Do we have our problems? Of course. But who doesn't? Government by the rich and powerful period, bad idea.", 
   {}, 
   28725, 
   null, 
   1072075140.0
  ], 
  [
   29009, 
   null, 
   "superbuddhaman", 
   "I'd have to echo that... in little more than 200 years the United States has become the most productive, wealthy, and powerful nation to ever grace the Earth. We enjoy the highest standard of living in the world...in fact, US standard of living outpaced Europe in the late 1790s...\n \n Do we have our problems? Of course. But who doesn't? Government by the rich and powerful period, bad idea.\n\n \n \n Agreed, government by the rich and powerful is a very bad idea, although that is basically what we have in a lot of respects... powerful lobbyists do not work for people like me. Politicians are not impressed when the best I can offer them is a free breakfast at the hotel I work at.\n \n I thought this was a good standard, and at any rate, it is interesting.\n From the world almanac: \n \n Most and Least Livable Countries: UN Human Development Index, 2003\n The Human Development Index (HDI), published annually by the UN, ranks nations according to their citizens' quality of life rather than strictly by a nation's traditional economic figures. The criteria for calculating rankings include life expectancy, educational attainment, and adjusted real income.\n \n \n \"Most Livable\" Countries, 2003 \n 1. Norway \n 2. Iceland \n 3. Sweden \n 4. Australia \n 5. Netherlands \n 6. Belgium \n 7. United States \n 8. Canada \n 9. Japan\n 10. Switzerland \n \n btw, I looked up the stats on last year's GDP just for fun, and in 2002 we were a full $8,000 per capita behind Luxembourg, placing us at #2. We'll see what 2003 looks like very soon.", 
   {
    "unicode_changes_made": true
   }, 
   28761, 
   null, 
   1072270440.0
  ], 
  [
   29026, 
   null, 
   "Broker", 
   "I hate UN lists. They don't take into account taxes and other factors. :)\n \n Luxembourg has a non-standard way of measuring their GDP.", 
   {}, 
   29009, 
   null, 
   1072290060.0
  ], 
  [
   29036, 
   null, 
   "epaphras_faith", 
   "Nick:\n \n Actually, if folks had subscribed to your philosophy even a hundred years ago, guaranteed you would not be one of the ones voting. There are about a couple dozen people in your country that would be in control. Likely your monarchy would have much more power, and you would likely be shoveling sheep &^$&^ for some soup and bread. That is how human nature works.\n \n Anyway, Merry Christmas.", 
   {}, 
   29026, 
   null, 
   1072311660.0
  ], 
  [
   29051, 
   null, 
   "montalban", 
   "Who needs the old crone? Right now a single parent so called mother on welfare can excercise the same political clout as a captain of industry like Branson who employs thousands of people. They both have the same one vote.Tell me that isnt insane.\n \n Who is that sp mother going to vote for but some politician who promises her yet more unearned money stolen from the taxpayer?\n \n A meritocracy would be better.Only those who own property or have a few hundred thousand in liquid assets should be able to vote.No one under 25,women,immigrants etc.\n\n \n And of course Branson would vote for people who'd support him in his goals. Isn't that disgusting... people actually voting for vested interests, only you'd punish one group for doing so.\n \n What have you got against women?\n \n \nDemocracy is mob rule, rule by the lowest common denominator with a dumbed down electorate who are manipulated by appearance over reality.The experiment in mobocracy has gone far enough.Most people are too ignorant to have a vote and putting it in their hands it is like putting a gun in the hands of a child.\n \n Democracy doesnt work because two contrary forces of Capitalism and Socialism cannot be reconciled and there is a perpetual conflict betweeen them.Only a system that defends individual rights can work and that is laissez faire capitalism - not Democracy\n\n \n \n Churchill said that democracy was the worst system, except for all the others.", 
   {}, 
   28709, 
   null, 
   1072321620.0
  ], 
  [
   29075, 
   null, 
   "superbuddhaman", 
   "I hate UN lists. They don't take into account taxes and other factors. :)\n \n Luxembourg has a non-standard way of measuring their GDP.\n\n \n No matter what sources I provide, there will be those who deny them. I could put down stats from five different sources, and you would deny all of them.\n \n The fact remains that many other countries enjoy a very high standard of living, and that in most European and middle eastern countries, their educational attainment is much higher than ours.\n \n They all speak english... Can you speak Hindi, Arabic, or Portugese?\n \n A very good friend of mine is ranked as one of the top ten computer programmers/ systems analysts in the nation, do you know who his peers are? I can tell you one thing, they are not american.\n \n And I have to point out that quality of life is a relative term, I would venture as far to say that people living in extreme povery in rural mexico are happier than your high powered NY execs... I have seen both firsthand. I spent months down in mexico, and on a beach lined with familes on vacation, not once did you see any arguments, any violence, any disruption whatsoevr...\n the same is not true for a busy Catalina weekend.", 
   {}, 
   29026, 
   null, 
   1072375140.0
  ], 
  [
   29101, 
   null, 
   "Broker", 
   "If you give me a list from an organization that didn't rank Finland the best place to do business I probably wouldn't dismiss it.\n \n They do have a high standard of living. As high as the US? No. In my opinion we have the highest standard of living... it depends how you measure. In terms of social services, Europe is 500% better. But then you consider quality or the money in taxes you pay to use those services. \n \n Example: people like to attack the American health system. Well, in socialized systems you might have to wait several months for a vital procedure... it could take a month just to get an MRI or something. They have massive doctor and nurse shortages (since the government pays them they make very little), fewer specialists, and less/ older technology. \n \n So it really depends what you weigh.", 
   {}, 
   29075, 
   null, 
   1072414380.0
  ], 
  [
   29149, 
   null, 
   "epaphras_faith", 
   "No matter what sources I provide, there will be those who deny them. I could put down stats from five different sources, and you would deny all of them.\n \n The fact remains that many other countries enjoy a very high standard of living, and that in most European and middle eastern countries, their educational attainment is much higher than ours.\n \n They all speak english... Can you speak Hindi, Arabic, or Portugese?\n \n A very good friend of mine is ranked as one of the top ten computer programmers/ systems analysts in the nation, do you know who his peers are? I can tell you one thing, they are not american.\n \n And I have to point out that quality of life is a relative term, I would venture as far to say that people living in extreme povery in rural mexico are happier than your high powered NY execs... I have seen both firsthand. I spent months down in mexico, and on a beach lined with familes on vacation, not once did you see any arguments, any violence, any disruption whatsoevr...\n the same is not true for a busy Catalina weekend.\n\n \n I too have spent time in mexico, but on a missions trip for the truly impoverished. They are not that happy as they live in cardboard huts and the closest thing they have to a sewer is an open trench that runs through the streets. I went there with another group to build houses. Granted there are those charities that do that in the US, but the poor in the US have more than most rich in other countries. Nearly every single household regardless of income in the US has electricity, sewer, running water, two TV's, etc. That is what is meant by standard of living. Only in this country do people complain because the government doesn't pay their mortgage payments (yes, I have seen the government do it) and that they are entitled to a free ride.", 
   {}, 
   29075, 
   null, 
   1072460040.0
  ], 
  [
   29233, 
   null, 
   "montalban", 
   "If you give me a list from an organization that didn't rank Finland the best place to do business I probably wouldn't dismiss it.\n \n They do have a high standard of living. As high as the US? No. In my opinion we have the highest standard of living... it depends how you measure. In terms of social services, Europe is 500% better. But then you consider quality or the money in taxes you pay to use those services. \n \n Example: people like to attack the American health system. Well, in socialized systems you might have to wait several months for a vital procedure... it could take a month just to get an MRI or something. They have massive doctor and nurse shortages (since the government pays them they make very little), fewer specialists, and less/ older technology. \n \n So it really depends what you weigh.\n\n \n \n Funny that, because they tend to live longer - maybe because they're waiting in ques and don't want to die yet, until they see a doctor.\n \n Maybe que waiting is theraputic.", 
   {}, 
   29101, 
   null, 
   1072498140.0
  ], 
  [
   29261, 
   null, 
   "Broker", 
   "The difference in lifespan is because we have... um... too much access to food. America has a 65% obesity rate among adults. Canada, in comparison, has only a 25% obesity rate.", 
   {}, 
   29233, 
   null, 
   1072510680.0
  ], 
  [
   29268, 
   null, 
   "montalban", 
   "The difference in lifespan is because we have... um... too much access to food. America has a 65% obesity rate among adults. Canada, in comparison, has only a 25% obesity rate.\n\n \n Is it? Where are the UN figures to prove this is the reason Americans don't live so long... Surely Brits with their greasy chips and fish, or the Finns who eat tonnes of meat would be dying well before you guys. Australians have a higher life expectency, but drink heaps more beer. I'm not the one suggesting a connexion - you are.\n \n Are you suggesting that your excellent economic system is not then a good measure of quality of life - because you've all got too much money/time on your hands?\n \n How then do you now reconcile your belief that the USA is #1, yet you don't have one of the highest life expectancy rates?\n \n You are in effect saying \"We're the best nation in the world, in terms of lifestyle (despite what the figures say), and despite that Americans are dying from fat\"\n \n In other words, even your own argument is tinged with proof against your own flag-waving jingoistic ideas.", 
   {}, 
   29261, 
   null, 
   1072530900.0
  ], 
  [
   29295, 
   null, 
   "Broker", 
   "That's the point... we live too well. :-\\ \n \n If the US had the obesity rate of any of the countries you named our life expectancy would be higher. It's just like AIDS in Africa... that distorts life expectancy. If you don't have AIDS those figures are way off.", 
   {}, 
   29268, 
   null, 
   1072559340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Democracy Schamocracy", 
  "url": "http://www.4forums.com/political/politics-debates/1469-democracy-schamocracy.html", 
  "breadcrumbs": [
   "Politics"
  ], 
  "id_number": 1469, 
  "discussion_files": [
   [
    "25811.html", 
    "http://www.4forums.com/political/politics-debates/1469-democracy-schamocracy-print.html"
   ]
  ], 
  "identifier": 1469
 }
]