[
 [
  [
   416567, 
   null, 
   "simone", 
   "Just wondering.", 
   {
    "post_info": {
     "post_title": "Do Creationists Think and Reason?"
    }
   }, 
   null, 
   null, 
   1289245500.0
  ], 
  [
   416575, 
   null, 
   "Ripskar", 
   "Yes, though it's set on a self destructive path, attempting to preserve short term comfortable, familiar patterns at the expense of long term damage.\n \n \nCognitive Distortions\n \n We all have fallacious ways of thinking that result in us drawing incorrect and often limiting conclusions. To some extent, these mistakes are inevitable as our map of reality is inherently fallible.\n \n From the discipline of cognitive behavioural therapy, the concept of cognitive distortions identifies the limiting thoughts we that we may move past them. It is interesting to note that all these distortions are typical of little children. As we grow up, we develop more mature ways of thinking (empowering cognitions) that replace the childish thinking. However, most adults still engage in one or two immature patterns of thinking.\n \n This post outlines the types of cognitive distortions and the empowering cognitions we may use to replace them. Any time you feel limited or disempowered, use the following as a checklist to see where your thinking has been distorted.\n \n All or Nothing Thinking\n \n This type of cognitive distortion is characterized by black and white thinking or dichotomizing. When operating under this distortion, you are thinking in either/or terms. An example of this would be the separation of work and play. You can either be engaged in hard work or you can be enjoying what you are doing but not both.\n \n This type of thinking is very unrealistic and limiting. The solution to this distortion is synthesis or both/and thinking. This allows for the existence of the shades of gray. Life is complex and synthesis allows you to deal with the complexity. In reference to the above example, it allows for the possibility for hard work being enjoyable - it is far more empowering.\n \n Overgeneralization\n \n Overgeneralization occurs when you form an arbitrary conclusion based on limited external evidence. You believe that since something occurred once, it will occur over and over. One failed relationship means you will always be lonely. One failed business means you are not cut out to be an entrepreneur. Fear of rejection is commonly the result of overgeneralization. Asking someone out and having them say no to you doesn`t only mean that this specific person rejected you but that you will consistently be rejected in the future. What a limiting way of thinking!\n \n The solution to this cognitive distortion is contextual thinking. You examine the specifics of the situations and you realize that there were particular factors that created the result. Instead of thinking \"I will never a good relationship\", you recognize the poor choices you made in your behaviour. Hence, instead of the future repeating the past, the past becomes a resource you can use to create a better future.\n \n Filtering Out the Positive\n \n Filtering out the positive occurs when you excessively dwell on the negative of a situation. An example of this would be focusing on the one dirty spot on a clean floor or while being angry at someone, focusing exclusively on all the ways the person hurt you and blinding yourself to their positive qualities.\n \n To deal with this cognitive distortion, you must expand your perspective. This can be done by asking yourself questions about the situation such as What do I like about the situation? What would I like to change? How can I go about making the change? Perspective thinking allows you to see the entire picture without biasing towards the negative. From this place, you can take informed, intelligent action.\n \n Mind Reading\n \n Mind reading occurs when you assume you know what another person is thinking and acting as if that assumption was true. You don't take the time to check it out with the other person - you jump to a conclusion and treat that conclusion as indisputable fact. If someone doesn't say hi to you when you see them on the street, you assume that he doesn't like you anymore. However, in reality, you have no idea if this is the case since you haven't checked it out with the other person.\n \n The solution to this is focusing on current sensory information. Essentially, you drop the interpretation of the event or the story and focus on the concrete facts. The fact that he didn't say hi is sensory data. The idea that he doesn't like me anymore is the story and you have no way of knowing if it is true or false unless you check it out with the other person.\n \n Fortune Telling\n \n This cognitive distortion occurs when you project yourself into a future time and assume some negative event is going to occur. You then feel as if that negative future is indeed fact. Say that you are driving to work and you are running a little late. You imagine that you arrive late and that boss yells at you in front of the entire office. Now, you don't know if that will actually happen, but the mere act of imagining it makes it real to you.\n \n The empowering alternative is to use tentative predictive thinking. You make predictions about the future as they are necessary to function but you realize that your predictions are just educated guesses and you remain open to other possibilities. If you are running late, you realize that perhaps you might be late for work so you decide that in the future you will give yourself more time for travel and at the same time, you recognize that there is still a possibility you may make it on time.\n \n Emotional Reasoning\n \n Emotional reasoning is the act of treating your emotions as indisputable facts. The truth is, however, that your emotions follow from your thoughts and if your thoughts are distorted, so will your emotions be at times. When you use this cognitive distortion, you assume that if something feels a certain way, that's the way it is in reality. For example, consider the idea of asking someone out on a date. When thinking about it, many people get nervous and project that feeling onto the action. However, when actually doing it, it is usually far easier than you had imagined.\n \n In response to the distortion of emotional reasoning, you can use witness thinking. Here, instead of identifying with your emotions as indisputable facts, you just allow yourself to feel them fully without trying to repress or overemphasize them. Instead, you simply witness your emotions as they arise in your awareness.\n \n Should Statements\n \n Using the word should in your thinking often creates internal pressure. Although you do it with a positive intention, should-ing often makes you unmotivated because you feel that you don't have choice in the matter. When your behaviour falls short of what you think you \"should\" do, the resulting feelings are often shame and guilt.\n \n Choice thinking is a more empowering alternative to should statements. Here, you weigh the options available to you and select the most beneficial approach to your particular situation. Often this behaviour is the same as it would have been had you shoulded yourself. However, it now comes with a sense of ease and lightness because it was choice made freely.\n \n Labelling\n \n Labelling is the cognitive distortion of branding someone a particular way. However, a person is a complex, changing person who cannot be categorized as one thing or another. When someone behaves inconsiderately towards you and you call them a jerk, you are labelling.\n \n The solution to labelling is reality-testing. Instead of making someone's behaviour of someone into their identity, you simply acknowledge the behaviour as it is. In the previous example, you could identify that the person was engaged in inconsiderate behaviour at that time. That's jerky behaviour but it doesn't make them a jerk.\n \n Personalization/Blaming\n \n Personalization is assuming responsibility for something negative when you have no basis for doing so. This can often lead to enormous guilt. The flipside is blaming where you project responsibility for something negative onto another person. Both these are flawed in that they assume that if something negative happened, it must be somebody's fault. There is no allowance for genuine mistakes, only people that need to be punished for wrongdoing. \n \n Objective thinking provides the answer to this cognitive distortion. By simply analyzing what behaviour created a certain situation without making it about who you are as a person, you open yourself up to far more empowering alternatives.\n \n Catastrophizing\n \n We expect disaster to strike, no matter what. This is also referred to as &#8220;magnifying or minimizing.&#8221; We hear about a problem and use what if questions (e.g., &#8220;What if tragedy strikes?&#8221; &#8220;What if it happens to me?&#8221;).\n \n For example, a person might exaggerate the importance of insignificant events (such as their mistake, or someone else&#8217;s achievement). Or they may inappropriately shrink the magnitude of significant events until they appear tiny (for example, a person&#8217;s own desirable qualities or someone else&#8217;s imperfections).\n \n Control Fallacies\n \n If we feel externally controlled, we see ourselves as helpless a victim of fate. For example, &#8220;I can&#8217;t help it if the quality of the work is poor, my boss demanded I work overtime on it.&#8221; The fallacy of internal control has us assuming responsibility for the pain and happiness of everyone around us. For example, &#8220;Why aren&#8217;t you happy? Is it because of something I did?&#8221;\n \n Fallacy of Fairness\n \n We feel resentful because we think we know what is fair, but other people won&#8217;t agree with us. As our parents tell us, &#8220;Life is always fair,&#8221; and people who go through life applying a measuring ruler against every situation judging its &#8220;fairness&#8221; will often feel badly and negative because of it.\n \n Fallacy of Change\n \n We expect that other people will change to suit us if we just pressure or cajole them enough. We need to change people because our hopes for happiness seem to depend entirely on them.\n \n Always Being Right\n \n We are continually on trial to prove that our opinions and actions are correct. Being wrong is unthinkable and we will go to any length to demonstrate our rightness. For example, &#8220;I don&#8217;t care how badly arguing with me makes you feel, I&#8217;m going to win this argument no matter what because I&#8217;m right.&#8221; Being right often is more important than the feelings of others around a person who engages in this cognitive distortion, even loved ones.\n \n Heaven&#8217;s Reward Fallacy\n \n We expect our sacrifice and self-denial to pay off, as if someone is keeping score. We feel bitter when the reward doesn&#8217;t come.\n \n Utilize this list of cognitive distortions and their empowering alternatives any time you are feeling limited or upset. The empowering cognition will open up entirely new channels of behaviour and options to you, so that you can move forward with ease.\n", 
   {}, 
   416567, 
   null, 
   1289246940.0
  ], 
  [
   416583, 
   null, 
   "simone", 
   "Thanks! Nice scan of reasoning patterns.", 
   {}, 
   416575, 
   null, 
   1289255880.0
  ], 
  [
   416608, 
   null, 
   "Easyrider", 
   "It's the Christ-deniers who are lining up to be Satan's whipping boys for all eternity. Not too bright.", 
   {}, 
   416583, 
   null, 
   1289265780.0
  ], 
  [
   416617, 
   null, 
   "Bennedict", 
   "i think creationists do think and to a short extent, do reason as well, its just they dont think or reason in a scientific manner. look at Erelevant-Z, who only thinks with his bible. some are quite intelligent though, its just they have taken the wrong path when it comes to science. most of them (all except one that i know of) are not trained in any scientific field at all and know very little about science.", 
   {}, 
   416608, 
   null, 
   1289273400.0
  ], 
  [
   416621, 
   null, 
   "Accipiter", 
   "I think ez just answered your question simone.", 
   {}, 
   416617, 
   null, 
   1289273940.0
  ], 
  [
   416625, 
   null, 
   "simone", 
   "To be sure, accipiter.", 
   {}, 
   416621, 
   null, 
   1289275800.0
  ], 
  [
   416645, 
   null, 
   "olivortex", 
   "Sometimes I feel as if I'm in one of those funny sites like Landover Baptist dot com again. Even more scary than funny.", 
   {
    "post_info": {
     "post_title": "I love the way..."
    }
   }, 
   416625, 
   null, 
   1289312700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Do Creationists Think and Reason?", 
  "url": "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/14705-do-creationists-think-reason.html", 
  "breadcrumbs": [
   "Creation(Intelligent Design) vs Evolution"
  ], 
  "id_number": 14705, 
  "discussion_files": [
   [
    "14141.html", 
    "http://www.4forums.com/political/creation-intelligent-design-vs-evolution/14705-do-creationists-think-reason-print.html"
   ]
  ], 
  "identifier": 14705
 }
]