[
 [
  [
   416342, 
   null, 
   "NATO 556", 
   "Two men, Navy SEAL arrested for firearms trafficking &#8211; This Just In - CNN.com Blogs\n \n \nThree men, including an active duty U.S. Navy SEAL, have been arrested for allegedly selling machine guns and other firearms to an undercover law enforcement officer in Nevada and Colorado, the U.S. Attorney General's Office in Nevada told CNN.\n \n The weapons part of the alleged firearms trafficking were machineguns smuggled into the United States by special forces military personnel returning from Iraq and Afghanistan.\n \n Nicholas Bickle, 33, of San Diego, Richard Paul, 34, of Durango, Colorado, and Andrew Kaufman, 36, of Las Vegas, were arrested Wednesday.\n \n Court documents identify Bickle as a U.S. Navy SEAL assigned to a unit in the San Diego area. The machineguns were found to have a mark used by the Iraqi military to signify ownership, the the U.S. Attorney General's Office said.\n \n If convicted, the defendants face up to five years in prison on the conspiracy charge and a $250,000 fine.\n\n \n So...what was that, about needing to further restrict civilian access to firearms, because it's that legal access that's responsible for the violence down in Mexico?", 
   {
    "post_info": {
     "post_title": "Navy SEAL arrested for firearms trafficking"
    }
   }, 
   null, 
   null, 
   1288913880.0
  ], 
  [
   416343, 
   null, 
   "sinjin", 
   "Where's the part about Mexico in the story? \n I'll bet they planned to sell them to guys like you...\n \n Once again, regulation isn't necessarily restriction.", 
   {}, 
   416342, 
   null, 
   1288914540.0
  ], 
  [
   416349, 
   null, 
   "Doc Jones", 
   "Where's the part about Mexico in the story? \n I'll bet they planned to sell them to guys like you...\n \n Once again, regulation isn't necessarily restriction.\n\n \n Awwww, is little sliiiiiiicky still unhappy with the elections? Kiss Nancy again and cry on her shoulder we are tired of it. Let her wipe your snot nose and have a nice hot cup of tea. :) emoticon_xhoho\n \n While you are at it, exactly what is the difference between \"regulation\" and \"restriction\" ?\n \n I notice your dope sucking law didn't pass in kalifornia so is that going to stop you? IOW, if you don't get caught it is all right? Is that your standard for regulation or restriction?", 
   {}, 
   416343, 
   null, 
   1288917900.0
  ], 
  [
   416351, 
   null, 
   "Doc Jones", 
   "As far as I know, it is still illegal to bring back \"war trophies\" such as guns and swords and is strictly enforced by THE MILITARY.\n \n OTOH, how many AR-16s and Beretta pistols did the U.S. government GIVE the police and troops of Iraq those arms without any identification nor receipt of transfer?", 
   {}, 
   416349, 
   null, 
   1288918440.0
  ], 
  [
   416352, 
   null, 
   "Doc Jones", 
   "How come the liberals don't bother with the millions of illegals smuggled into the Republic against all law but a few weapons make front page news?\n \n A lot of folks got their priorities screwed up with a double standard.", 
   {}, 
   416351, 
   null, 
   1288919160.0
  ], 
  [
   416354, 
   null, 
   "NATO 556", 
   "Where's the part about Mexico in the story?\n\n \n Mexico doesn't need to be mentioned by name in this story in order to prove the point. We've got gun traffickers making illicit sales, and working for the government no less, in positions that are supposed to bring a high level of respect and authority. A Navy SEAL of all people, trafficking weapons that were smuggled into the country, weapons that never should have left Iraq to begin with.\n \n I think you're missing the point here.\n \n \nI'll bet they planned to sell them to guys like you...\n\n \n Come again?\n \n \nOnce again, regulation isn't necessarily restriction.\n\n \n Reread everything that's been proposed by the gun grabbers to \"address\" the problems down in Mexico. Then come back here and try to tell us that their suggestions don't amount to restrictions.", 
   {}, 
   416343, 
   null, 
   1288923600.0
  ], 
  [
   416355, 
   null, 
   "sinjin", 
   "Mexico doesn't need to be mentioned by name in this story in order to prove the point. We've got gun traffickers making illicit sales, and working for the government no less, in positions that are supposed to bring a high level of respect and authority. A Navy SEAL of all people, trafficking weapons that were smuggled into the country, weapons that never should have left Iraq to begin with.\n \n I think you're missing the point here. \nIf the point is that regulation of civilian firearm sales is pointless since a Navy Seal went bad, then yes, I miss it.", 
   {}, 
   416354, 
   null, 
   1288924260.0
  ], 
  [
   416356, 
   null, 
   "sinjin", 
   "Reread everything that's been proposed by the gun grabbers to \"address\" the problems down in Mexico. Then come back here and try to tell us that their suggestions don't amount to restrictions.\nAre you presently \"restricted\" from owning an full auto select weapon?", 
   {}, 
   416354, 
   null, 
   1288924380.0
  ], 
  [
   416360, 
   null, 
   "NATO 556", 
   "If the point is that regulation of civilian firearm sales is pointless since a Navy Seal went bad, then yes, I miss it.\n\n \n Yes you certainly are missing it. \n \n We've got drug fueled violence going on down in Mexico and America is being blamed for the country being a hellhole. We've got every nut coming out of the woodwork, pretending to be experts, claiming that since you can freely and readily own a gun in America, without absurd levels of government restriction, that \"easy access\" is the cause of the drug cartel being so damn powerful and nearly unstoppable.\n \n We've got right hating people claiming that we need to enact new restrictive laws to limit our constitutional rights, to make it harder for a person to legally get a gun, in order to do something about the problems down in Mexico. \n \n And then we hear the news about how people in our own government are trafficking arms in an illegal manner. We've got FedEx drivers stealing guns and selling them on the streets, we've got decorated police officers taking weapons and drugs from evidence and selling them, we've got FBI agents being convicted of gun running, and now we've got black ops members being arrested for trafficking illegal foreign weapons that never should've been able to get into this country in the first place.\n \n And despite all these accounts of government employees, paid with taxpayer money, engaging in reckless criminal behavior, there are still people with the balls to claim that it's our constitutional rights that're the problem.\n \n I'd certainly say you're missing the point. The government, military and police are exempt from all firearms regulations and restrictions that are a part of current law. What authority do they answer to? Who guards them? Who holds them to the same standards of \"responsibility\" that we're expected to be held to?\n \n \nAre you presently \"restricted\" from owning an full auto select weapon?\n\n \n Depends on how you feel about denial due to economic status. I certainly can't afford the $25,000 necessary for an MP5 submachine gun. Can you?\n \n The chief of police here has gone on record stating that despite the legality of the process, he won't be signing off on any of the paperwork necessary for someone to legally acquire any NFA items, be them machine guns, short barreled rifles, sound suppressors, or AOWs. my city's entire population is prohibited from owning anything covered by the National Firearms Act, all because one guy doesn't like what's legal to own.", 
   {}, 
   416355, 
   null, 
   1288929660.0
  ], 
  [
   416373, 
   null, 
   "Tither", 
   "Oh no! I know that I Did not just read this?\n \nI'll bet they planned to sell them to guys like you...\n\n \nCome again?\n\n Yeah, lets just slime Nato as a criminal! That's totally fair! He passes a background check by the FBI every time he purchases a new gun, but we will just slime him, and then we can just hang him without a trial too! emoticon_smile \n \n Understanding that we actually do know about Nato's good law-abiding standing, the question then becomes, can we really ever know about those on the Anti-Constitutional Rights side law-abiding status? \n \n Nato my friend, with the recent repudiation of the Democratic Party's ideals, (the election,) gun control went SCREAMING out the proverbial window with it! ~~BIG TIME!~~ \n \n I think Sinjin is going to need a moment before he gets over this heartbreak, and he starts thinking correctly! So just overlook this transgression for now! emoticon_smile \n \n For now.", 
   {}, 
   416354, 
   null, 
   1288970640.0
  ], 
  [
   416374, 
   null, 
   "NATO 556", 
   "Oh no! I know that I Did not just read this?\n \n Yeah, lets just slime Nato as a criminal! That's totally fair! He passes a background check by the FBI every time he purchases a new gun, but we will just slime him, and then we can just hang him without a trial too! emoticon_smile \n \n Understanding that we actually do know about Nato's good law-abiding standing, the question then becomes, can we really ever know about those on the Anti-Constitutional Rights side law-abiding status?\n\n \n I also became a citizen of the United States the legal way. Everybody seems to keep forgetting that.\n \n \nNato my friend, with the recent repudiation of the Democratic Party's ideals, (the election,) gun control went SCREAMING out the proverbial window with it! ~~BIG TIME!~~\n\n \n Well that would explain why Brady, Galileo and the others haven't been around recently.\n \n \nI think Sinjin is going to need a moment before he gets over this heartbreak, and he starts thinking correctly! So just overlook this transgression for now! emoticon_smile\n \n For now.\n\n \n Or he needs to come to terms with the realities of the problem and understand that certain proposed restrictions and regulations simply aren't allowable. He's seen the error of his ways with previous positions afterall.", 
   {}, 
   416373, 
   null, 
   1288971180.0
  ], 
  [
   416385, 
   null, 
   "sinjin", 
   "Oh no! I know that I Did not just read this?\n \n \n Yeah, lets just slime Nato as a criminal! That's totally fair! He passes a background check by the FBI every time he purchases a new gun, but we will just slime him, and then we can just hang him without a trial too! emoticon_smile \n \n Understanding that we actually do know about Nato's good law-abiding standing, the question then becomes, can we really ever know about those on the Anti-Constitutional Rights side law-abiding status? \n \n Nato my friend, with the recent repudiation of the Democratic Party's ideals, (the election,) gun control went SCREAMING out the proverbial window with it! ~~BIG TIME!~~ \n \n I think Sinjin is going to need a moment before he gets over this heartbreak, and he starts thinking correctly! So just overlook this transgression for now! emoticon_smile \n \n For now.\nSo he claims poverty with respect to affording to legally own automatics, has mistrust of the government, \n feels no one should know what arms he has or how many or have any way to trace one of his weapons should \n it be lost/stolen, but to suggest he might be the \"type\" that smugglers would look to sell to and I'm sliming?\n \n Why don't you stick to posting inconclusive CDC data ad nauseum?", 
   {}, 
   416373, 
   null, 
   1288989300.0
  ], 
  [
   416386, 
   null, 
   "sinjin", 
   "I certainly can't afford the $25,000 necessary for an MP5 submachine gun. Can you?\nNo, I can't but I sleep fine without one under my pillow.:)", 
   {}, 
   416360, 
   null, 
   1288989600.0
  ], 
  [
   416388, 
   null, 
   "NATO 556", 
   "No, I can't but I sleep fine without one under my pillow.:)\n\n \n I can't help but wonder why you don't seem to care about the fact that some people can't exercise their rights due to economic issues, which would essentially elevate a constitutional right to a privilege of the wealthy.\n \n Did you ever stop and wonder why those $125 Hi-Point pistols are such big sellers, or why anybody would actually choose to own a $150 Jiminez pistol?", 
   {}, 
   416386, 
   null, 
   1288989900.0
  ], 
  [
   416390, 
   null, 
   "NATO 556", 
   "So he claims poverty with respect to affording to legally own automatics,\n\n \n There's no legal excuse for a full-auto to cost the taxpaying citizen upwards of $25,000 or more, when the same thing can be had by the government for a small fraction of that price.\n \n \nhas mistrust of the government,\n\n \n Because history is filled with examples of the government screwing us over with one trick or another. You can only get reamed so many times before you start not wanting to drink the koolaid.\n \n \nfeels no one should know what arms he has or how many\n\n \n Do you feel anyone should know what you have in your home? Maybe the total net worth of your wife's jewelry? Or maybe how many controversial books you own?\n \n Seriously, how comfortable are you with the idea of opening up your private matters and putting them on public display?\n \n \nor have any way to trace one of his weapons should it be lost/stolen,\n\n \n Because I saw first hand just how such a system can be used against the people. The 1997 handgun ban in the UK, remember? I was there when it happened, I saw how the registered and traceable weapons were ordered to be confiscated and destroyed. Many tens of thousands of dollars worth of collectible pieces were lost forever.\n \n \nbut to suggest he might be the \"type\" that smugglers would look to sell to and I'm sliming?\n\n \n I have no criminal ties to suggest that I'd be a prime candidate customer for smugglers to look to supply to.\n \n What about you?", 
   {}, 
   416385, 
   null, 
   1288991700.0
  ], 
  [
   416391, 
   null, 
   "sinjin", 
   "I can't help but wonder why you don't seem to care about the fact that some people can't exercise their rights due to economic issues, which would essentially elevate a constitutional right to a privilege of the wealthy.\n \n Did you ever stop and wonder why those $125 Hi-Point pistols are such big sellers, or why anybody would actually choose to own a $150 Jiminez pistol?\nWhat's that got to do with $25,000 for a machine gun? You seem to think that guns should be provided to all free of charge. How did a right get to be an entitlement?", 
   {}, 
   416388, 
   null, 
   1288991760.0
  ], 
  [
   416395, 
   null, 
   "Doc Jones", 
   "What's that got to do with $25,000 for a machine gun? You seem to think that guns should be provided to all free of charge. How did a right get to be an entitlement?\n\n \n You still deny it is a Constitutional Right as well as a Civil Right? How much slower can you get?\n \n Even Andrew McKelvey, after spending 12 million on a faux gun group no one would join except someone like yourself, an anti gunner, threw in the towel and realized he had fooled no one. You must not be that bright? :)\n \n You posted lots of junk in favor of Americans for Gun Safety. Feel bad now about your wasted effort ? :)", 
   {}, 
   416391, 
   null, 
   1288997040.0
  ], 
  [
   416396, 
   null, 
   "Doc Jones", 
   "Even the Peterson prosecutors got a shellacking from the judge when he ruled that they had not proven that the 12\" barrel AR he possessed was against the law.\n \n Times changed son and you missed it. emoticon_xclown", 
   {}, 
   416395, 
   null, 
   1288997220.0
  ], 
  [
   416403, 
   null, 
   "Tither", 
   "Reported on Fox news at noon. 80 Fully Auto AK 47's and 2 Russian machine guns from the Battlefield, that the the sellers believed would end up in Mexico! There words, not mine! \n \n FROM THE BATTLE FIELD! Yet Sinjin wants to lay all of this at Nato's feet! Slimy sir, very slimy! \n \n \nWhy don't you stick to posting inconclusive CDC data ad nauseum?\n\n Yes Sir! Your wish is my command! \n \n In 2000 to 2002 The CDC conducted a systematic review of scientific evidence regarding the effectiveness of firearms laws in preventing violence, including violent crimes, suicide, and unintentional injury. The systematic review development team identified 51 studies that evaluated the effects of selected firearms laws on violence and met the inclusion criteria for this review. No study was excluded because of limitations in design or execution.\n \n  What did they find?  \n \"the task Force found insufficient evidence to determine the effectiveness of any of the firearms laws or combinations of laws reviewed on violent outcomes.\" \n\n The CDC did suggest more studies. Then a few years later the CDC got a second bite at the apple with The National Academy of Sciences studies. They, along with the Anti-gun Joyce foundation funded, the study. Data on Firearms and Violence Too Weak to Settle Policy Debates; Comprehensive Research Effort Needed\n \n Here is an article about the study Link  who issued a 328-page report based on 253 journal articles, 99 books, 43 government publications, a survey of 80 different gun-control laws and some of its own independent study. \nIn short, the panel could find no link between restrictions on gun ownership and lower rates of crime, firearms violence or even accidents with guns. \n\n Sinjin continually wants us to be totally Reckless with our Constitutional Rights Demanding more and more and more gun control, with this kind of a track record!\n \n Foolish Sir, very Foolish indeed!", 
   {
    "unicode_changes_made": true
   }, 
   416396, 
   null, 
   1289003160.0
  ], 
  [
   416404, 
   null, 
   "NATO 556", 
   "What's that got to do with $25,000 for a machine gun?\n\n \n What's it got to do with it? Everything. These cheap handguns wouldn't be around if it was easy enough to afford something by Kimber or Smith & Wesson. But thanks to government intrusion, inflation and price increase due to various legal reasons, it's not possible for somebody to exercise their constitutional rights with something of high quality. So they're forced to pick something of substandard quality because that's all they can afford.\n \n There's no excuse for requiring license and training fees that exceed the market price of the gun you want to buy.\n \n \nYou seem to think that guns should be provided to all free of charge. How did a right get to be an entitlement?\n\n \n I've made no such argument. However I've argued frequently against eliminating a person's Second Amendment rights by raising the prices out of their reach, which is a defacto ban on the basis of income. Basically it's saying that the poor have no rights.", 
   {}, 
   416391, 
   null, 
   1289003520.0
  ], 
  [
   416423, 
   null, 
   "NATO 556", 
   "More on the story\n \n Navy SEAL accused of smuggling illegal weapons from Iraq, Afghanistan - CNN.com\n \n\n The arrest of a Navy SEAL accused of trying to sell weapons smuggled from Iraq or Afghanistan has raised questions about how he managed to get 80 high-powered weapons into the U.S. through military transport.\n \n The questions were buzzing Friday inside the ranks of the U.S. military in the wake of an accusation that a Navy SEAL, one of America's elite warriors, was at the center of a weapons smuggling ring.\n \n The 18-page criminal complaint from the U.S. attorney's office in Las Vegas, Nevada, reads like a paperback thriller -- full of machine guns, cash, threats and bravado, a lot of it told to federal agents by a cooperative informant who had been facing domestic battery and robbery charges.\n \n The AK-47 rifles are described as fresh off the battlefield, marked with the Arabic letter that signifies they were part of the Iraqi Army arsenal -- or as one of the alleged conspirators said: \"There is still Iraqi sand in this [expletive].\"\n \n The Navy SEAL is identified as Nicholas Bickle. He talked tough, according to the complaint.\n \n \"If you ever [expletive] with me you know who we are. We're the government, we'll catch you,\" he told one person.\n \n From what little information could be gleaned from the Pentagon and Bickle's Naval Special Warfare Command in San Diego, California, he's 33 years old, enlisted in 2004, and pinned on the SEALs' trident insignia in 2005. Bickle deployed twice to Iraq, according to Kate Wallace, a spokeswoman at Naval Special Warfare Command.\n \n Bickle was to appear in a San Diego federal court on Friday.\n \n The military rules are clear: Everyone gets searched before heading home from deployment. Military screeners are trained by Customs and Border Protection officials and they screen the people, the luggage, the gear and the cargo, according to Wallace.\n \n \"Our special forces members don't have special waivers for customs inspections. They're subject to all the same rules and restrictions as anyone else in uniform,\" said Wallace.\n \n But the rules seem to bend a little for special operations forces.\n \n \"The regular guys go through a more robust search, but it's only a cursory search for special forces guys,\" one person with insider knowledge of military procedures told Pentagon Correspondent Chris Lawrence,\n \n A special forces team might travel with far more equipment, including classified hardware, have a shorter deployment, and might arrive and leave on a far different and less formal schedule than regular troops.\n \n Rank-and-file military get even more rigorous treatment than civilians might face in an airport line: Put the duffel on the conveyor belt, have it X-rayed, and then dump the contents out on a table and have it picked over. And then pack it up and have it X-rayed again before heading to the plane and home.\n \n Outside, before troops get to the military screeners, there are so-called \"Amnesty Boxes,\" a last chance for a military man or woman who might \"forget\" to hand in that battlefield souvenir or might have an extra live round in a pocket. They can drop items in the box with no questions asked. And the rules are strict about not bringing back weapons, apart from those assigned and supplied, which are placed in the aircraft hold.\n \n \"To bring any kind of war trophies back, you have to go through a process,\" Pentagon spokesman Col. Dave Lapan said Friday. Asked what might follow the arrest of Bickle, Lapan would only say, \"Too soon to tell.\"\n \n There are cases of troops taking unauthorized equipment from the battlefield, but almost all of those involve smuggling items home as personal souvenirs, according to the Defense official.\n \n \"This seems to go way beyond that. We have dangerous gangs operating just over that Southwest border, and here we have a SEAL arming the very guys we could be fighting,\" the Defense official said.\n \n The Naval Special Warfare Command is cooperating with the federal officials, but it is not conducting its own investigation into how Bickle allegedly smuggled in all the weapons as a SEAL.\n \n \"If it's determined we need to reassess procedures in place to make sure our members are not transporting items stateside, then we'll certainly do that,\" Wallace said.\n", 
   {}, 
   416342, 
   null, 
   1289015700.0
  ], 
  [
   416445, 
   null, 
   "Doc Jones", 
   "in order to exercise their right to keep and bear arms, they need arms. Therefore in the case of those who cannot afford arms, the government must provide them with arms, otherwise the government is violating their rights.\n \n It is logical, another example would be the one about the right to go anywhere you want, therefore if you cannot afford any means of transportation the government must provide you with free transport to anywhere anytime you feel like exercising your right to freedom to travel.\n \n Now, my favourite arm is a SAM and my favourite means of transport is humvee and I would like to travel around the world :p\n \n freedom of speech is good also. I want to express myself by making movies, therefore the government must bankroll my movie productions, books, etc \n \n ;)\n\n \n In that case, in your antipodean world of Australia, maybe you should complain about your non-existant rights and absence of a Constitution you once had and lost from neglect.\n \n Perhaps if you had tended to your own business when you had the chance you might have some rights left and not be a ward of the state living on public largess full of metaca and unable to get out of the basement of your mommie's house?\n \n You actually think your lard laden thoughts is something that should be taken seriously on a subject you have no idea about and seem to think you have the same RIGHTS as an American citizen who has the BOR now enshrined in the XIVth amendment?\n \n Your plan to drive around the world in a Humvee is something you should pursue with your load of SAM missles. Be sure and put it in 4 wheel drive over the Mireana Trench and perhaps your trip will be speeded up by the cracking of the Pacific plate :)\n \n Never forget you are a subject of the crown, offspring of criminals from England, Britain and it's colonies and not a free man. You can't go where you want because you can't get out of the basement...that is your own fault emoticon_xbouncer Your wanna be girlfriend was amazed that you wrote about hitchhiking a few miles to arrive unannounced as you claim in your writing which you seem to think of as a book with yourself being an author. emoticon_xagree it is good comedy.", 
   {}, 
   416391, 
   null, 
   1289065560.0
  ], 
  [
   416460, 
   null, 
   "NATO 556", 
   "in order to exercise their right to keep and bear arms, they need arms. Therefore in the case of those who cannot afford arms, the government must provide them with arms, otherwise the government is violating their rights.\n \n It is logical, another example would be the one about the right to go anywhere you want, therefore if you cannot afford any means of transportation the government must provide you with free transport to anywhere anytime you feel like exercising your right to freedom to travel.\n \n Now, my favourite arm is a SAM and my favourite means of transport is humvee and I would like to travel around the world :p\n \n freedom of speech is good also. I want to express myself by making movies, therefore the government must bankroll my movie productions, books, etc \n \n ;)\n\n \n Cute, but entirely wrong. The government isn't tasked with providing the populace with whatever means necessary to exercise their rights in whatever manner they choose.", 
   {}, 
   416391, 
   null, 
   1289076540.0
  ], 
  [
   416461, 
   null, 
   "sinjin", 
   "Cute, but entirely wrong. The government isn't tasked with providing the populace with whatever means necessary to exercise their rights in whatever manner they choose.\nAgreed. Nor does it set the price for any particular weapon available to civilians. \n I do not support licensing fees, training requirements or special taxes associated with owning common firearms.", 
   {}, 
   416460, 
   null, 
   1289078100.0
  ], 
  [
   416462, 
   null, 
   "sinjin", 
   "Sinjin continually wants us to be totally Reckless with our Constitutional Rights Demanding more and more and more gun control, with this kind of a track record!\n \n Foolish Sir, very Foolish indeed!\nI just want LE to have the ability to trace weapons recovered during criminal investigations. That requires documentation of transfers of ownership.\n \n \"Secondary markets encompass secondhand gun transactions made by non- licensed individuals. Approximately 30% to 40% of all guns sales occur in the secondhand market (Cook and Ludwig, 1996). Secondary market sellers are prohibited from knowingly transferring guns to ineligible purchasers (e.g., convicted felons and drug abusers). However, secondary transfers are not subject to federal record-keeping and background check requirements, thus making the secondary market largely unregulated and, consequently, a better source of guns for criminal users. In the secondary market, ineligible buyers may obtain guns (through collusion or misrepresentation) from a variety of legitimate and illegitimate gun owners: relatives, friends and other associates; fences and other street dealers; drug dealers and addicts; and persons selling through classified ads or at gun shows (e.g., see Beck et al., 1993; Harlow, 2001; Sheley and Wright, 1993; Wright and Rossi, 1986).\"\n http://www.ncjrs.gov/pdffiles1/nij/grants/221074.pdf", 
   {}, 
   416403, 
   null, 
   1289078340.0
  ], 
  [
   416467, 
   null, 
   "Doc Jones", 
   "I just want LE to have the ability to trace weapons recovered during criminal investigations. That requires documentation of transfers of ownership.\n\n \n No it doesn't! No gun control scheme nor tracking scheme such as NY or kanada has ever helped solve a crime.\n \n If there is no way to tie it to the criminal by forensics(DNA/FINGERPRINTS) and placing him at the scene of the crime they are SOL.\n \n What you want is registration which will not work and has been proven not to work. It is an infringement on a right and properly so. Your hate for gun owners is showing again so pull down your dress.\n \n Registration has alway preceeded genocide and democide...and no, don't say that there are instances where it hasn't happened.....yet.\n \n There are no criminologists nor honest cops that support this \"final solution\" you keep trying to force down our throats but we keep sticking it up yours :)\n \n You got a poor background in tracing but would eagerly clap to see a victim of gun theft held responsible for being a victim of theft or worse.\n \n How did your scheme to register long guns turn out in kalifornia? See! You comprise less than 25%. That means 75% of the people have better sense than you do and a better grasp on the subject. Why don't you tell Pelosi Galore what you want and stamp your widdle feet? More and more people are waking up to the fact that a fee cannot be charged to exercise a right freely stated in the Constitution. You are not going to get anything but more broke because you intend for gun owners to pay the fees for your outlandish wet dreams. How many crimes has NY or Chicago registration solved to date? How many has kalifornia solved to date? How many more times are you going to claim this when there is no proof and will never work? Canada is spending billions more on a failed system that never helped solve a crime.", 
   {}, 
   416462, 
   null, 
   1289084880.0
  ], 
  [
   416469, 
   null, 
   "Doc Jones", 
   "Oh, one more lie/myth you keep repeating is cops can't trace crime guns. They can and do it just doesn't work.\n \n Good luck on trying to prove your id i otic scheme works. Keep spreading the hubris thick and deep.", 
   {}, 
   416467, 
   null, 
   1289085120.0
  ], 
  [
   416470, 
   null, 
   "Doc Jones", 
   "Oh, sliiiiiick, you couldn't get a case in court like you desire in the four corners to even make a case.", 
   {}, 
   416469, 
   null, 
   1289085420.0
  ], 
  [
   416472, 
   null, 
   "Doc Jones", 
   "Agreed. Nor does it set the price for any particular weapon available to civilians. \n I do not support licensing fees, training requirements or special taxes associated with owning common firearms.\n\n \n What you propose above is all of these things. Sounds like AGS. McKelvey quit after spending 12 million on his fake .org and you keep regurgitating his plan. Who do you propose pays for this registration and \"special taxes and fees to track sale of private property? Who is going to pay for keeping the stinking records? Kalifornia is broke now, so is the U.S.\n You may say all this hubris but you know full well it will not work and gun owners will get stuck with the tab.\n \n How did your mary jane bill come out tooter? Wish in one hand and spit in the other. I am an old feller and personally I don't care what you scramble your brains with but I am against the 4A aspect of conviction. Say, that is a great idea, why don't you form an agency to register common drugs available to \"civilians\". I want to correct you on that term. anyone who is not paid by the DOD and in service in the military is a civilian, say a cop or State employee including the State police, governor or anyone else. You didn't learn that in your short stay in the military?", 
   {}, 
   416461, 
   null, 
   1289086560.0
  ], 
  [
   416473, 
   null, 
   "Doc Jones", 
   "One more difference sliiiiiick is that military has to abide by the Geneva Convention.\n \n You may be a civilian, I am a citizen.", 
   {}, 
   416472, 
   null, 
   1289086740.0
  ], 
  [
   416488, 
   null, 
   "NATO 556", 
   "well, if this is the case then the 2nd amendment ought to be amended for if I am unable to exercise my God given and Constitutionanlly sanctioned by the Holy Founding Fathers right to keep, bear (and sell to the Mexican drugs cartels) weapons, due to lack of purchasing power or any da-mn reason, then my afore mentioned right is being violated.\n \n Free guns for everyone is my motto. ;)\n\n \n The last time I checked you lived in Australia. What constitutional rights do you have?", 
   {}, 
   416460, 
   null, 
   1289099760.0
  ], 
  [
   416500, 
   null, 
   "Penfold", 
   "The last time I checked you lived in Australia. What constitutional rights do you have?\n\n \n The same as any immigrant such as yourself.", 
   {}, 
   416488, 
   null, 
   1289148600.0
  ], 
  [
   416502, 
   null, 
   "Doc Jones", 
   "The same as any immigrant such as yourself.\n\n \n Probably why he is excluded, you and star gazer:\n FindLaw | Cases and Codes\n \n \n(Note also, for whatever it's worth, that the First Amendment, as interpreted by the U.S. Supreme Court, allows the U.S. government broad authority to exclude visiting aliens based on the content and viewpoint of their speech, even if the speech is constitutionally protected. I express no opinion here about whether that constitutional rule is right or wrong; I just wanted to preclude arguments that the initial decision in this case was somehow a sign of how the UK provides substantially lesser free speech protections than the US - that's true in some instances, but not in this one.)\n \n", 
   {
    "unicode_changes_made": true
   }, 
   416500, 
   null, 
   1289151480.0
  ], 
  [
   416503, 
   null, 
   "Doc Jones", 
   "FindLaw | Cases and Codes", 
   {
    "post_info": {
     "post_title": "In case you didn't get it:"
    }
   }, 
   416502, 
   null, 
   1289151840.0
  ], 
  [
   416504, 
   null, 
   "NATO 556", 
   "The same as any immigrant such as yourself.\n\n \n At least I'm here in the country, and legally. The same can't be said for some others.", 
   {}, 
   416500, 
   null, 
   1289153820.0
  ], 
  [
   416543, 
   null, 
   "Doc Jones", 
   "last time you checked, how ?\n \n anyway, in Australia I don't need any right to bear, keep and sell to drug cartels weapons. \n For people who fell the nead to bear, keep etc there are psychiatrists who cure that mental illness free of charge, for we have free universal health care even of the mental kind.\n For those incurable , such as you, there is always the option of emigrating to the land of the gun and the home of the paranoid. emoticon_xkill\n\n \n From your own website Raulito. Sad tale of an imagined romance. Want to post your website again? :)\n \n Then you admit it and also the fact that you don't \"need\" a 2A. I would propose you don't need any right except free comidas sans the government.\n \n \"Free health care\" eh? Doctors there work for free?", 
   {}, 
   416488, 
   null, 
   1289228760.0
  ], 
  [
   416639, 
   null, 
   "Doc Jones", 
   "=Winston Smith;416591]what 'free universal health care' means is that anyone is entitled to medical care (kinda right, so that you understand it) free of charge. We pay our taxes gladly, and we tax the rich also.\n\n \n How come you always show up to attack NATO or myself for your own weakness and failings and are always off topic? Your ignorance proceeds you. Here, anyone that shows up at the ER gets treatment whether they can pay or not. We just resent ILLEGAL aliens using the facilities for all their medical care when they can go to kanada or UK (includes Australia). Nothing is \"free of charge\". Someone else pays for it and just because you do not does not make expensive medical care free. Then, you take liberties to assume to speak using \"we\"; you got a hole in your pocket?\n \n \nSo, come over, the psychiatric ward welcomes you, come in civies if possible. emoticon_rolleyes\n\n \n Appears you have hopolophobia so you just might take your own advice.\n \n \nYou can also go to Canada or the UK (your fellow gun crazy Nato can tell you more about it) or France or ... any of the hundred of countries where free universal medical care is available or ... vote Democrat emoticon_cool\n\n \n Uh, huh, we got kanadians that come every winter but they have to be back and see a Canadian doctor before 6 months expires or they lose their \"free medical care\". You have no idea what \"free universal medical care\" is or else they would pay for your treatment in the States, they don't. You stand in line and wait even if you need heart surgery. You sound like an excellent candidate? :)\n \n So you edited the post to remove your political statement \"to vote for a democrat\". The elections are over. The press is rightly calling it a \"SHELLACKING\". A surfer would call it a \"wipe out\".\n \n Now get on topic or don't expect replies; you are childish, petty and possibly a victim of a poor education as you can't seem to get anything right. :xcensored", 
   {}, 
   416543, 
   null, 
   1289302560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Navy SEAL arrested for firearms trafficking", 
  "url": "http://www.4forums.com/political/gun-control-debates/14703-navy-seal-arrested-firearms-trafficking.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14703, 
  "discussion_files": [
   [
    "1499.html", 
    "http://www.4forums.com/political/gun-control-debates/14703-navy-seal-arrested-firearms-trafficking-print.html"
   ], 
   [
    "1500.html", 
    "http://www.4forums.com/political/gun-control-debates/14703-navy-seal-arrested-firearms-trafficking-3-print.html"
   ], 
   [
    "1501.html", 
    "http://www.4forums.com/political/gun-control-debates/14703-navy-seal-arrested-firearms-trafficking-2-print.html"
   ]
  ], 
  "identifier": 14703
 }
]