[
 [
  [
   417518, 
   null, 
   "Easyrider", 
   "U.S. Gay Men's Astonishing HIV / STD Rates - by D Gregory Smith, MA ( a gay, HIV+ native Montanan )\n \n At the National STD Prevention Conference on Wednesday, the CDC (Centers for Disease Control and Prevention) released some astonishing data regarding rates of infection among MSM (Men who have Sex with Men). \n \n The data indicate that rates of HIV infection among gay men and other men who have sex with men (MSM) are more than 44 times higher than rates among heterosexual men and more than 40 times higher than women. Rates of syphilis, an STD that can facilitate HIV infection and, if left untreated, may lead to sight loss and severe damage to the nervous system, are reported to be more than 46 times higher among gay men and other MSM than among heterosexual men and more than 71 times higher than among women. \n \n U.S. Gay Men's Astonishing HIV/STD Rates | The Bilerico Project\n \n That, from a pro-gay blog.\n \n It's obvious, then, that the homosexual lifestyle (besides being unbiblical) is not a healthy lifestyle, and should not be presented as such by schools, universities, and other institutions. Discussion...", 
   {
    "post_info": {
     "post_title": "U.S. Gay Men\u0092s Astonishing HIV / STD Rates"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1290362580.0
  ], 
  [
   417524, 
   null, 
   "Bennedict", 
   "omfg. what, do you live in the 80s? this is the oldest, stupidest argument ever.", 
   {}, 
   417518, 
   null, 
   1290368280.0
  ], 
  [
   417526, 
   null, 
   "Easyrider", 
   "omfg. what, do you live in the 80s? this is the oldest, stupidest argument ever.\n\n \n I quoted a gay man in a pro-gay blog. So the gay man is stupid in your mind, right?\n \n Can't stand the truth, can you, Bennedict??\n \n p.s. quit lying in your tag line.", 
   {}, 
   417524, 
   null, 
   1290368640.0
  ], 
  [
   417528, 
   null, 
   "Steeeeve", 
   "omfg. what, do you live in the 80s? this is the oldest, stupidest argument ever.\n\n \n Other than your argument here...", 
   {}, 
   417524, 
   null, 
   1290368940.0
  ], 
  [
   417533, 
   null, 
   "Accipiter", 
   "ez you are utterly obsessed with gay topics, 99% of your posts are related to homosexuality and you don't think all that says something about you?\n \n ez doth protest too much, methinks.", 
   {}, 
   417528, 
   null, 
   1290373560.0
  ], 
  [
   417536, 
   null, 
   "Easyrider", 
   "ez you are utterly obsessed with gay topics, 99% of your posts are related to homosexuality... \n\n \n You're deluded. And your math is lousy.", 
   {}, 
   417533, 
   null, 
   1290376020.0
  ], 
  [
   417537, 
   null, 
   "Bottom Feeder", 
   "Any lifestyle can be unhealthy if certain precautions aren't taken. The argument is pretty silly.", 
   {}, 
   417536, 
   null, 
   1290376980.0
  ], 
  [
   417538, 
   null, 
   "MrWriteLA", 
   "Enormously silly.", 
   {}, 
   417537, 
   null, 
   1290379200.0
  ], 
  [
   417539, 
   null, 
   "Easyrider", 
   "Enormously silly.\n\n \n So what the pro gay HIV homosexual reported in the OP (The data indicate that rates of HIV infection among gay men and other men who have sex with men (MSM) are more than 44 times higher than rates among heterosexual men and more than 40 times higher than women) was silly?\n \n Sounds pretty pathetic to me. I don't see how anyone can support the unbiblical, homosexual lifestyle after that.", 
   {}, 
   417538, 
   null, 
   1290381420.0
  ], 
  [
   417540, 
   null, 
   "Accipiter", 
   "You're deluded. And your math is lousy.\n\n \n Well OK then, prove it.\n \n Should be easy enough to put some stats together to vindicate yourself, what are you waiting for?", 
   {}, 
   417536, 
   null, 
   1290382320.0
  ], 
  [
   417541, 
   null, 
   "Easyrider", 
   "Enormously silly.\n\n \n Center for Disease Control and Prevention Release:\n \n CDC Analysis Provides New Look at Disproportionate Impact of HIV and Syphilis Among U.S. Gay and Bisexual Men\n \n \"A data analysis released today by the Centers for Disease Control and Prevention underscores the disproportionate impact of HIV and syphilis among gay and bisexual men in the United States.\n \n The data, presented at CDC's 2010 National STD Prevention Conference, finds that the rate of new HIV diagnoses among men who have sex with men (MSM) is more than 44 times that of other men and more than 40 times that of women.\n \n The range was 522-989 cases of new HIV diagnoses per 100,000 MSM vs. 12 per 100,000 other men and 13 per 100,000 women.\n \n The rate of primary and secondary syphilis among MSM is more than 46 times that of other men and more than 71 times that of women, the analysis says. The range was 91-173 cases per 100,000 MSM vs. 2 per 100,000 other men and 1 per 100,000 women.\"\n \n Another shocker: \"Based on an analysis of nationally representative surveys, CDC estimated that MSM comprise 2.0 percent (range: 1.4-2.7 percent) of the overall U.S. population aged 13 and older, or 4 percent of the U.S. male population (range: 2.8-5.3 percent).\"\n \n CDC ? NCHHSTP Newsroom ? MSM Denominator Press Release March 10, 2010\n \n This is stunning. This is the U.S. Government speaking, and Mr LA Write calls it silly? No wonder so many gays have HIV and syphilis. They obviously don't care. \n \n I think we need to notify the schools and universities to start teaching that the active homosexual lifestyle is dangerous and should not be legitimized or recommended to our children.", 
   {}, 
   417538, 
   null, 
   1290382380.0
  ], 
  [
   417542, 
   null, 
   "Easyrider", 
   "Well OK then, prove it.\n \n Should be easy enough to put some stats together to vindicate yourself, what are you waiting for?\n\n \n I don't have to prove anything to you. In fact I'm placing you on Ignore.\n \n <click<\n \n <flush<\n \n Bye bye!\n \n emoticon_xbouncer", 
   {}, 
   417540, 
   null, 
   1290382620.0
  ], 
  [
   417547, 
   null, 
   "Accipiter", 
   "I don't have to prove anything to you. In fact I'm placing you on Ignore.\n \n <click<\n \n <flush<\n \n Bye bye!\n \n emoticon_xbouncer\n\n \n OK just be sure you put it in your sig, bitch.", 
   {}, 
   417542, 
   null, 
   1290383340.0
  ], 
  [
   417564, 
   null, 
   "Easyrider", 
   "I wonder why the incidence of HIV and STD's is so much higher with gay men than with straight men (see the OP)? \n \n Seems likely to me that the gay men are highly irresponsible.\n \n They don't listen to God and they don't listen to the Center for Disease Prevention and Control. This isn't just a new thing, either. There's been somewhat similar reports in times past.", 
   {}, 
   417547, 
   null, 
   1290393480.0
  ], 
  [
   417568, 
   null, 
   "Bottom Feeder", 
   "I wonder why the incidence of HIV and STD's is so much higher with gay men than with straight men (see the OP)? \n \n Seems likely to me that the gay men are highly irresponsible.\n \n They don't listen to God and they don't listen to the Center for Disease Prevention and Control. This isn't just a new thing, either. There's been somewhat similar reports in times past.\n\n \n It might have something to do with schools taking out sex education programs and replacing them with abstinence programs. Without the knowledge of what is out there, there is no way for anyone to make informed decisions.", 
   {}, 
   417564, 
   null, 
   1290394380.0
  ], 
  [
   417586, 
   null, 
   "jazyjason", 
   "It might have something to do with schools taking out sex education programs and replacing them with abstinence programs. Without the knowledge of what is out there, there is no way for anyone to make informed decisions.\n\n \n You can also count the inflation of teen pregnancy during the bush abstinence program as well.", 
   {}, 
   417568, 
   null, 
   1290404760.0
  ], 
  [
   417607, 
   null, 
   "jyoshu", 
   "Gay pride proponents never want to talk about this issue. But an issue it is. It may be the most important issue that gets swept under the rug in the name of political correctness.", 
   {}, 
   417586, 
   null, 
   1290458340.0
  ], 
  [
   417608, 
   null, 
   "Bottom Feeder", 
   "Gay pride proponents never want to talk about this issue. But an issue it is. It may be the most important issue that gets swept under the rug in the name of political correctness.\n\n \n I would be more than willing to discuss the issue if it wasn't being used as an offensive attack against my nature, or that of any other homosexual's. The subject matter is very important and it's not the subject that people don't want to address. It's the manner in which it is presented a majority of the time.", 
   {}, 
   417607, 
   null, 
   1290465120.0
  ], 
  [
   417636, 
   null, 
   "jitobear", 
   "I would be more than willing to discuss the issue if it wasn't being used as an offensive attack against my nature, or that of any other homosexual's. The subject matter is very important and it's not the subject that people don't want to address. It's the manner in which it is presented a majority of the time.\n\n \n EXACTLY.\n \n The fact that there is evidence of a high incidence of unsafe sex practices amongst gay men is a concern. But Easy isn't concerned. He is implying that it is justification for his prejudice. Its not. We do not hold disease stats up as justifcation for how we treat (or mistreat) any other group.\n \n This has nothing to do with orientation. A gay man who consistently practices safe sex is signifigantly more responsible and less likely to contract HIV than some straight horn dog who never wraps it up.", 
   {}, 
   417608, 
   null, 
   1290486780.0
  ], 
  [
   417696, 
   null, 
   "proecker", 
   "EXACTLY.\n \n The fact that there is evidence of a high incidence of unsafe sex practices amongst gay men is a concern. But Easy isn't concerned. He is implying that it is justification for his prejudice. Its not. We do not hold disease stats up as justifcation for how we treat (or mistreat) any other group.\n \n This has nothing to do with orientation. A gay man who consistently practices safe sex is signifigantly more responsible and less likely to contract HIV than some straight horn dog who never wraps it up.\n\n \n \n I don't see how cornholing another man and responsible can be tied together. \"Safe sex.\" That's not even sex, it is putting your penis in someones pooper. No wonder you get all kinds of STD's. \n \n I don't get it?", 
   {}, 
   417636, 
   null, 
   1290604020.0
  ], 
  [
   417706, 
   null, 
   "proudmom", 
   "I don't see how cornholing another man and responsible can be tied together. \"Safe sex.\" That's not even sex, it is putting your penis in someones pooper. No wonder you get all kinds of STD's. \n \n I don't get it?\n\n \n Just ask your straight male friends, they will be able to explain \"putting their penis in someones pooper\" to you very well since the stats show that so many of them practice this.", 
   {}, 
   417696, 
   null, 
   1290619620.0
  ], 
  [
   417713, 
   null, 
   "MrWriteLA", 
   "When they're not putting it in a woman's pisser.emoticon_rolleyes", 
   {}, 
   417706, 
   null, 
   1290627480.0
  ], 
  [
   417747, 
   null, 
   "Zorba", 
   "I don't see how cornholing another man and responsible can be tied together. \"Safe sex.\" That's not even sex, it is putting your penis in someones pooper. No wonder you get all kinds of STD's. \n \n I don't get it?\n\n \n Don't expect the immoral progressives who seek the lowest common denominator of any interpretation of a social freedom to get that. They will always defend the act rather than consider the consequences for performing the act.\n \n \nWhen they're not putting it in a woman's pisser.emoticon_rolleyes\n\n \n Really? I marvel at how clueless you homosexuals are of simple anatomy when you say such ignorant things, proving how completely uninformed you are. But I guess I shouldn't be that surprised after all since you practice such an unnatural sexual proclivity. That in itself proves how distorted your world view is.", 
   {}, 
   417713, 
   null, 
   1290692700.0
  ], 
  [
   417753, 
   null, 
   "Easyrider", 
   "EXACTLY.\n \n The fact that there is evidence of a high incidence of unsafe sex practices amongst gay men is a concern. But Easy isn't concerned. He is implying that it is justification for his prejudice. Its not. We do not hold disease stats up as justifcation for how we treat (or mistreat) any other group.\n \n\n \n We've been pointing these issues out to you people for decades, and you tell us we're crazy and that we don't know what we're talking about. And now the US government is telling you the same things we've been telling you. \n \n ARE YOU PEOPLE LISTENING NOW? WHAT ARE YOU GOING TO DO ABOUT IT?\n \n And why did it take you all these decades to wake up?\n \n p.s. I do believe there are divine consequences for ignoring God and his admonitions against gay sex. So wake up.", 
   {}, 
   417636, 
   null, 
   1290711060.0
  ], 
  [
   417766, 
   null, 
   "proudmom", 
   "We've been pointing these issues out to you people for decades, and you tell us we're crazy and that we don't know what we're talking about. And now the US government is telling you the same things we've been telling you. \n \n ARE YOU PEOPLE LISTENING NOW? WHAT ARE YOU GOING TO DO ABOUT IT?\n \n And why did it take you all these decades to wake up?\n \n p.s. I do believe there are divine consequences for ignoring God and his admonitions against gay sex. So wake up.\n\n \n The last I checked, this is a gay rights board, am I wrong? This is a very important issue and needs to be addressed but it is very apparant that instead of addressing and discussing how to care about and love the population this is harming. This is simply being used as a weapon, such as the same way many use their Bible. Studies such as these can be held up as I told you so's and this proves what I've said all along when in actuality it proves nothing except their is a portion of the gay community that has a high rate of hiv infection. This in no way takes away from the purpose of this board which is to discuss and hopefully advance the equality of the LGBT community. \n \n Statistics from any group of the population can be held up and exploited to try to gain a one up one another group. \n \n The very high rate of teen pregnancy and divorce especially among fundamentalit christians for example could be used as an attempt to try to demonize all fundamentalist christians but where does that get us? \n \n Really, this is only a ploy and everyone knows it. \n \n All this talk, Easy, about loving thy neighbor? Try coming up with some answers, some solutions to this epidemic instead of your feable attempt to exploit and use as a weapon.", 
   {}, 
   417753, 
   null, 
   1290740520.0
  ], 
  [
   417767, 
   null, 
   "Bennedict", 
   "Really? I marvel at how clueless you homosexuals are of simple anatomy when you say such ignorant things, proving how completely uninformed you are. But I guess I shouldn't be that surprised after all since you practice such an unnatural sexual proclivity. That in itself proves how distorted your world view is.\n\n \n oh please. he was clearly commenting on the absurdity of the statement \"penis in the pooper.\"", 
   {}, 
   417747, 
   null, 
   1290743640.0
  ], 
  [
   417769, 
   null, 
   "Zorba", 
   "oh please. he was clearly commenting on the absurdity of the statement \"penis in the pooper.\"\n\n \n There's nothing at all absurd about the statement as it is a disgusting and unnatural sexual proclivity, whoever practices it, be they straight or homosexual. For anyone to attempt to justify anal sex by homosexuals by saying that straights do it also is to promote the problem rather than find a solution for this epidemic of STDs within the gay community. \n \n And only a seriously misinformed person would suggest that men insert their penises up a woman's urinary tract which LA most assuredly said in clear terms. \n \n \n When they're not putting it in a woman's pisser.\n\n \n But why am I not surprised at all that you would jump to his defense while believing that we moral traditionalists are the problem for rejecting the immorality you progressives represent at every turn in these debates? And when will you people learn that it is you who are the problem and are tearing our society down around our ears with your narcissism and hedonism.", 
   {}, 
   417767, 
   null, 
   1290744840.0
  ], 
  [
   417779, 
   null, 
   "Bottom Feeder", 
   "Obviously, the issue here isn't ignorance. The issue is attitude. People such as Easy and Zorba, like Jito said, use these statistics as a way to say \"Ha! I told you being gay is wrong. Why else would they have such a high rate of HIV infection?\" Rather than attacking, they should be offering constructive criticism. Proper sex education in school or by parents would be a huge step. Promoting condom use and knowing your status is even better.\n \n There is no reason to justify anal sex by either gay men or straight couples. Justifying it, in no way, promotes an HIV epidemic. It isn't illegal and there is nothing to be ashamed of by doing it. You are the only one that can shame yourself.\n \n Zorba, who exactly is \"you people\"? You know, the ones tearing down society with narcissism and hedonism? Are you referring to gay people? Liberals? Democrats? Just seemed like a general blanket of a statement there.\n \n I don't know about MrWriteLA or anyone else here on the boards, but I'm more than happy to be PROGRESSive. I happen to believe in progress. Without progressives we'd still have segregation, slavery and witch hunts. Traditionalists would have us stuck in the Dark Ages.\n \n Easy, you may have been pointing to the issue for decades, but I believe you need to look at the manner in which you address it. When I read your posts it appears that your dislike of gays and what some of us do seeps out through your choice of words. You come off extremely aggressive, accusatory and sometimes downright rude. You seem to have a tendency to assume that your position is right and true without taking into consideration the other side's point of view. \n \n Proecker: Anal sex is sex otherwise the sex part wouldn't be attached.", 
   {}, 
   417769, 
   null, 
   1290771000.0
  ], 
  [
   417783, 
   null, 
   "Easyrider", 
   "The last I checked, this is a gay rights board, am I wrong? This is a very important issue and needs to be addressed but it is very apparant that instead of addressing and discussing how to care about and love the population this is harming. This is simply being used as a weapon, such as the same way many use their Bible. Studies such as these can be held up as I told you so's and this proves what I've said all along when in actuality it proves nothing except their is a portion of the gay community that has a high rate of hiv infection. This in no way takes away from the purpose of this board which is to discuss and hopefully advance the equality of the LGBT community. \n\n \n Gay sex is a sin and should not be legitimized in any way. We (Biblically-based Christians and Jews, etc.), will not be taking part in your regressive social experiments. We can be equal as far as the Constitution goes, but we're not going beyond that.\n \n \n\n The very high rate of teen pregnancy and divorce especially among fundamentalit christians for example could be used as an attempt to try to demonize all fundamentalist christians but where does that get us? \n\n \n Not very Biblical, is it? That's what happens with milquetoast Christians.\n \n Over one hundred years ago, Catherine Booth said, \"It is a bad sign for the Christianity of this day when it provokes so little opposition from the world. When the Church and the world can jog along together side by side comfortably, you may be sure there is something wrong.\" \n \n When the church commits fornication, it's a sin, and hopefully they'll feel convicted of their sins and repent. But when the world does it, it's doing what comes naturally to them.\n \n But trying to legitimize illicit gay sex sin by pointing to other people's sins (\"See, look what they're doing\") isn't going to help your cause. \n \n \n\n All this talk, Easy, about loving thy neighbor? \n\n \n Who is it that's trying to keep the pro-gay crowd out of Hell around here? It's certainly not you, proudmom. You're helping lead them down the path to perdition. And you call THAT love?? By the way, I wouldn't be so proud of defending iniquity if I were you.\n \n \n\n Try coming up with some\n answers, some solutions to this epidemic instead of your feable attempt to exploit and use as a weapon.\n\n \n Christ is the answer, but you'll never admit it because you've been blinded by all this pro-gay nonsense you've bought into. \n \n When you pick up a bull horn to pronounce LGBT rights, instead of picking up a Bible to defend the Word of God, then you can be sure something is wrong with your world view. Not real smart.", 
   {}, 
   417766, 
   null, 
   1290788940.0
  ], 
  [
   417799, 
   null, 
   "Bennedict", 
   "telling people they are less worthy than others, just because of their sexual orientation;\n \n telling people they need to be celebate for their entire lives, because you dont like what they do;\n \n telling people they will need to flip their entire lives around, the lives that they were born with and lived with since then;\n \n protesting homosexual's funerals;\n \n sending hate mail to gay rights groups;\n \n oh you know, just expressing the \"love thy neighbor\" lesson.", 
   {}, 
   417783, 
   null, 
   1290819360.0
  ], 
  [
   417801, 
   null, 
   "Easyrider", 
   "telling people they are less worthy than others, just because of their sexual orientation;\n \n telling people they need to be celebate for their entire lives, because you dont like what they do;\n \n telling people they will need to flip their entire lives around, the lives that they were born with and lived with since then;\n \n protesting homosexual's funerals;\n \n sending hate mail to gay rights groups;\n \n oh you know, just expressing the \"love thy neighbor\" lesson.\n\n \n <Flush<\n \n Liberals love to play the victims, but they don't want to hear about repentance of sins (ala gay sex sins). You will never hear that in gay discussions.", 
   {}, 
   417799, 
   null, 
   1290821400.0
  ], 
  [
   417802, 
   null, 
   "Bottom Feeder", 
   "<Flush<\n \n Liberals love to play the victims, but they don't want to hear about repentance of sins (ala gay sex sins). You will never hear that in gay discussions.\n\n \n That's because there is nothing to repent for.", 
   {}, 
   417801, 
   null, 
   1290821640.0
  ], 
  [
   417805, 
   null, 
   "Bennedict", 
   "<Flush<\n \n Liberals love to play the victims, but they don't want to hear about repentance of sins (ala gay sex sins). You will never hear that in gay discussions.\n\n \n i aint a victim. im just not going to guilt people for stupid reasons.\n \n how silly would you look if you spent your whole life trying to get gay people to be straight in order to save them from going to hell, and it turns out there is no hell afterall.", 
   {}, 
   417801, 
   null, 
   1290822840.0
  ], 
  [
   417812, 
   null, 
   "gansao", 
   "Stephen Fry, a famous gay man in the UK stated that women do not really like sex because they do not seek urgent sexual gratification like men.\n Although he back tracked after being slated by the press, he had a point albeit a twisted one.\n Men and women do have a different way of dealing with sexual opportunities and urges.Men will ( in the most part) be more promiscuous than women, given the opportunity( ok , lets say single men).\n So lets not be surprised if gay men are more promiscuous and less responsible between themselves than straight men who have the benefit of women as ' keepers of the gate'.\n I notice that lesbians do not seem to have the same rate of aids and stds as gay men( correct me if I am wrong).\n The answer to the high proportion of gay aids and stds is not to ' ban' gay sex( impossible) but lies in the gay community itself promoting less promiscuity and more use of condoms.\n \n Also from a Christian point of view we have a community of gay men having gay sex( sin) involving fornication (sin) and for the most part promoting this as being the correct way to live..why are surprised that a Christian is against this?", 
   {}, 
   417805, 
   null, 
   1290870960.0
  ], 
  [
   417819, 
   null, 
   "Accipiter", 
   "Stephen Fry, a famous gay man in the UK stated that women do not really like sex because they do not seek urgent sexual gratification like men.\n Although he back tracked after being slated by the press, he had a point albeit a twisted one.\n Men and women do have a different way of dealing with sexual opportunities and urges.Men will ( in the most part) be more promiscuous than women, given the opportunity( ok , lets say single men).\n So lets not be surprised if gay men are more promiscuous and less responsible between themselves than straight men who have the benefit of women as ' keepers of the gate'.\n I notice that lesbians do not seem to have the same rate of aids and stds as gay men( correct me if I am wrong).\n The answer to the high proportion of gay aids and stds is not to ' ban' gay sex( impossible) but lies in the gay community itself promoting less promiscuity and more use of condoms.\n \n Also from a Christian point of view we have a community of gay men having gay sex( sin) involving fornication (sin) and for the most part promoting this as being the correct way to live..why are surprised that a Christian is against this?\n\n \n What is the official Christian position regarding cigarette smoking?", 
   {}, 
   417812, 
   null, 
   1290876600.0
  ], 
  [
   417821, 
   null, 
   "gansao", 
   "What is the official Christian position regarding cigarette smoking?\n\n \n Thanks for admitting that you do not have a constuctive comment to make on my post.\n As far as I know there is no official Christian position on smoking.\n The Catholic church allows its priests to smoke,I whereas Jehovahs witnesses believe it is abuse of the body. Both churches believe themselves to be Christians.\n Hope this helps.", 
   {}, 
   417819, 
   null, 
   1290877140.0
  ], 
  [
   417834, 
   null, 
   "Bennedict", 
   "im not surprised, gan.\n \n i am a) disagreeing with the bible's position and people's choice to follow it, and b) frustrated that there are still people who cant get over the fact that other people are different from them.\n \n i have a gay friend back in calgary where i used to live, and his comment on \"gay sex sin\" was that he is ashamed of the countries, even Canada (who accepts gay sex and allows gays to be married) for being slow at accepting people as being equals. this should have happened a looong time ago, but the lack of progression means we might as well not do anything to advance the human race, just sit around on our porch rocking chairs making sure people dont loot our things.", 
   {}, 
   417821, 
   null, 
   1290880920.0
  ], 
  [
   417839, 
   null, 
   "Easyrider", 
   "That's because there is nothing to repent for.\n\n \n Ignorance is no excuse. And they'll find out more about that at the Judgment.", 
   {}, 
   417802, 
   null, 
   1290882480.0
  ], 
  [
   417841, 
   null, 
   "gansao", 
   "im not surprised, gan.\n \n i am a) disagreeing with the bible's position and people's choice to follow it, and b) frustrated that there are still people who cant get over the fact that other people are different from them.\n \n i have a gay friend back in calgary where i used to live, and his comment on \"gay sex sin\" was that he is ashamed of the countries, even Canada (who accepts gay sex and allows gays to be married) for being slow at accepting people as being equals. this should have happened a looong time ago, but the lack of progression means we might as well not do anything to advance the human race, just sit around on our porch rocking chairs making sure people dont loot our things.\n\n \n I know people who are not the slightest bit religious but do not like and do not accept gays.\n I think for me and my ilk( the great unwashed) its a mixture of the ick factor and human beings rejecting what is different.\n In my crude circles God botherers are no more welcome than gays.\n I am, kind of , repeating b I know but the point has to be made", 
   {}, 
   417834, 
   null, 
   1290882960.0
  ], 
  [
   417843, 
   null, 
   "Bennedict", 
   "I know people who are not the slightest bit religious but do not like and do not accept gays.\n I think for me and my ilk( the great unwashed) its a mixture of the ick factor and human beings rejecting what is different.\n In my crude circles God botherers are no more welcome than gays.\n I am, kind of , repeating b I know but the point has to be made\n\n \n that is true, but non-religious people could have various reasons for not liking gays - theyre not on the football team (stupid reason), they're feminine (stupid reason), they have HIV and coming into contact with them would be dangerous (stupid reason), but with religious people, they dont like gay people because of religion. bigotry is in their very belief system. then again, there are those religious people who treat gay people the same as they treat everyone else, which EZ would call them frauds or something. my point is that the religious people who dislike gay people dislike them because of religion.", 
   {}, 
   417841, 
   null, 
   1290883740.0
  ], 
  [
   417845, 
   null, 
   "gansao", 
   "that is true, but non-religious people could have various reasons for not liking gays - theyre not on the football team (stupid reason), they're feminine (stupid reason), they have HIV and coming into contact with them would be dangerous (stupid reason), but with religious people, they dont like gay people because of religion. bigotry is in their very belief system. then again, there are those religious people who treat gay people the same as they treat everyone else, which EZ would call them frauds or something. my point is that the religious people who dislike gay people dislike them because of religion.\n\n \n They also dont like adulterers and fornicators and in the past these people were killed for what they did...nowdays they are just not supposed to be married in church.\n The same will happen with gays.\n If they stop using mincing camp gay men as role models they will be accepted more readily by the general public too.\n but thats another argument...", 
   {}, 
   417843, 
   null, 
   1290884520.0
  ], 
  [
   417847, 
   null, 
   "Bennedict", 
   "They also dont like adulterers and fornicators and in the past these people were killed for what they did...nowdays they are just not supposed to be married in church.\n The same will happen with gays.\n If they stop using mincing camp gay men as role models they will be accepted more readily by the general public too.\n but thats another argument...\n\n \n very true. thats a good point actually, because fundies not only dont allow gay people to get married in their churches, they have a lot of political power as well in some countries like the US. they are stopping gay people from getting married all together - to satisfy THEIR OWN beliefs.\n \n ive screwed my girlfriend, we can get married - maybe even in a christian church, although that definitely wont happen - and thats against the christian code. why have christians been able to let that go but not homosexuality?", 
   {}, 
   417845, 
   null, 
   1290885000.0
  ], 
  [
   417849, 
   null, 
   "gansao", 
   "very true. thats a good point actually, because fundies not only dont allow gay people to get married in their churches, they have a lot of political power as well in some countries like the US. they are stopping gay people from getting married all together - to satisfy THEIR OWN beliefs.\n \n ive screwed my girlfriend, we can get married - maybe even in a christian church, although that definitely wont happen - and thats against the christian code. why have christians been able to let that go but not homosexuality?\n\n \n Its much easier to hide hetero sins( sometimes) than gay ones.\n If a church believes that there can be no divorce it cant really marry a divorcee.\n If a church believes gay sex is a sin it cant marry two gay men.\n A secular society allows the divorcee to legally marry in a registry office and eventually will allow gays to do the same thing.\n IMO everybody wins. The church is not forced to compromise its beliefs and the divorcees/ gays get their wedding.\n As for you screwing your girlfriend...................go on my son!!emoticon_xbouncer\n As we say in Blighty!", 
   {}, 
   417847, 
   null, 
   1290885720.0
  ], 
  [
   417853, 
   null, 
   "Bennedict", 
   "Its much easier to hide hetero sins( sometimes) than gay ones.\n If a church believes that there can be no divorce it cant really marry a divorcee.\n If a church believes gay sex is a sin it cant marry two gay men.\n A secular society allows the divorcee to legally marry in a registry office and eventually will allow gays to do the same thing.\n IMO everybody wins. The church is not forced to compromise its beliefs and the divorcees/ gays get their wedding.\n As for you screwing your girlfriend...................go on my son!!emoticon_xbouncer\n As we say in Blighty!\n\n \n yea, but gay people arent allowed to get married even outside of the church. fair enough if they dont allow it in their church, its their church they can do what they want, but lobbying the gov to do the same thing to every government controlled institution (including legal marriages)? nobody wins.\n \n PM me for pics.. JK dont. if i get a pm from you, youre going on ignore.", 
   {}, 
   417849, 
   null, 
   1290886680.0
  ], 
  [
   417858, 
   null, 
   "Accipiter", 
   "Thanks for admitting that you do not have a constuctive comment to make on my post.\n As far as I know there is no official Christian position on smoking.\n The Catholic church allows its priests to smoke,I whereas Jehovahs witnesses believe it is abuse of the body. Both churches believe themselves to be Christians.\n Hope this helps.\n\n \n You seam to be too dumb to understand the point I am making so I will try to explain it to you as simple as I can.\n \n You don't see Christians getting all pissy about smoking and that kills more people then all STDs and AIDs combined, why is that?", 
   {}, 
   417821, 
   null, 
   1290891300.0
  ], 
  [
   417865, 
   null, 
   "MrWriteLA", 
   "It's not being religious that makes them anti-gay... it's the \"ick factor\" that they then use their religion to justify.\n \n If their preacher gave a sermon saying bigotry against gays was wrong, they'd change churches in a New York minute. If Jesus himself appeared to tell them the same thing, they'd argue with him.\n \n This Leviticus argument is cr@p. 1) How many Levitical laws do THEY follow, apart from the obvious one? Ask them to specify them, and see what you get. 2) A few passages after the one they're so fond of, it says that men who this MUST BE PUT TO DEATH--why aren't they as insistent on that being carried out? 3) The Bible has something over 30 favorably described instances of men kissing and says ZIP against it... does anyone think Scratchy (sorry: Archie) or EZ wouldn't have a foam at the mouth conniption at the sight of that, or even holding hands??? It's more than hypocrisy, it's friggin blasphemy to use the word of your so-called messiah as a cover for your personal, ignorance-derived hatred towards your fellow humans!\n \n And we see it in spades here, day after day. \n \n To quote Woody Allen, if Jesus came back today and saw what was being done in his name, he would never stop throwing up.", 
   {}, 
   417858, 
   null, 
   1290893640.0
  ], 
  [
   417869, 
   null, 
   "Bennedict", 
   "ill argue that it IS religion that is the cause of bigotry amongst religious people. most religious people were raised in the faith, being taught that the bible says homosexuality is wrong yadda yadda... they then associate that teaching with \"ick\". for someone who picked up religion later on in life, they will use religion to justify their bigotry, but usually, its the case of the former.\n \n if you ask a religious person why they dont like gays, theyll most likely say one of two things. either a) it says so in the bible, in which case thats their only defense and if they dropped the faith, all that remains is b) \"ick\" which is an opinion they either had from before or picked up with religion. when asked why one holds that opinion, the answer will be \"it says so right here in the bible\".", 
   {}, 
   417865, 
   null, 
   1290896640.0
  ], 
  [
   417876, 
   null, 
   "MrWriteLA", 
   "I don't think being taught gay is a sin was common in most churches until relatively recently, with the rise of Anita Bryant and the Religious Right in the 60s. The word \"homosexual\" wasn't even included in a printed Bible until 1947. I certainly don't recall it being sermonized about when I was a kid and going to Presbyterian and Lutheran churches and Sunday schools in the 50s, or my grandparents saying peep about it. And its my contemporaries, who were taught the Bible in that same era, who are the most virulently \"religiously\" homophobic today.\n \n The younger generation, despite knowing nothing but the relatively recent, post-Anita Bryant, authoritarian, reactionary religions that preach \"gay is evil\" on TV and every Sunday are statistically shown to be turning against that teaching, and rejecting the religions in which they were raised as intolerant and \"hateful.\"\n \n The people who buy unthinkingly into homophobic religious blatherings aren't the kids. It's their older parents parents and grandparents--who for the most part never heard anything about it in church when they were growing up.", 
   {}, 
   417869, 
   null, 
   1290898440.0
  ], 
  [
   417899, 
   null, 
   "Easyrider", 
   "\n \n This Leviticus argument is cr@p. 1) How many Levitical laws do THEY follow, apart from the obvious one?\n\n \n Your theology is horse manure. \n \n You constantly confuse God's moral laws with other types of laws (civil laws, ceremonial laws, etc.). But the moral laws have never passed away. As Jesus and the New Testament confirm, adultery is still adultery, lying is still lying, thievery is still thievery, and so on. And gay sex is still a moral sin in the New Testament. \n \n So get your theology straight, Jack, and quit your self-serving misrepresentations.", 
   {}, 
   417865, 
   null, 
   1290943740.0
  ], 
  [
   417900, 
   null, 
   "gansao", 
   "You seam to be too dumb to understand the point I am making so I will try to explain it to you as simple as I can.\n \n You don't see Christians getting all pissy about smoking and that kills more people then all STDs and AIDs combined, why is that?\n \n \n\n \n \n I just told you that Jehovahs witnesses prohibit smoking but being the snivelling bitch that you are, you seem to have ignored this.\n You asked me a direct question and I gave you a direct answer and now you moan without even reading my post properly.", 
   {}, 
   417858, 
   null, 
   1290947100.0
  ], 
  [
   417901, 
   null, 
   "gansao", 
   "I don't think being taught gay is a sin was common in most churches until relatively recently, with the rise of Anita Bryant and the Religious Right in the 60s. The word \"homosexual\" wasn't even included in a printed Bible until 1947. I certainly don't recall it being sermonized about when I was a kid and going to Presbyterian and Lutheran churches and Sunday schools in the 50s, or my grandparents saying peep about it. And its my contemporaries, who were taught the Bible in that same era, who are the most virulently \"religiously\" homophobic today.\n \n The younger generation, despite knowing nothing but the relatively recent, post-Anita Bryant, authoritarian, reactionary religions that preach \"gay is evil\" on TV and every Sunday are statistically shown to be turning against that teaching, and rejecting the religions in which they were raised as intolerant and \"hateful.\"\n \n The people who buy unthinkingly into homophobic religious blatherings aren't the kids. It's their older parents parents and grandparents--who for the most part never heard anything about it in church when they were growing up.\n\n \n You overlook the fact that gay sex must be fornication to the church anyway as there is no provision for gay marriage within the church.\n Gay sex must fall into the same catergory as adultery and fornication to a Christian.", 
   {}, 
   417876, 
   null, 
   1290947460.0
  ], 
  [
   417913, 
   null, 
   "Bennedict", 
   "You overlook the fact that gay sex must be fornication to the church anyway as there is no provision for gay marriage within the church.\n Gay sex must fall into the same catergory as adultery and fornication to a Christian.\n\n \n but how about gay marriage without having sex before hand?", 
   {}, 
   417901, 
   null, 
   1290970380.0
  ], 
  [
   417915, 
   null, 
   "gansao", 
   "but how about gay marriage without having sex before hand?\n\n \n There is no provision for gay marriage in Christianity either in the Bible or by Christian tradition.\n Please correct me if I am wrong.", 
   {}, 
   417913, 
   null, 
   1290970560.0
  ], 
  [
   417919, 
   null, 
   "Easyrider", 
   "There is no provision for gay marriage in Christianity either in the Bible or by Christian tradition.\n Please correct me if I am wrong.\n\n \n You're correct. There's no gay marriages anywhere in the Bible. The practice of gay sex is a sin.", 
   {}, 
   417915, 
   null, 
   1290971520.0
  ], 
  [
   417922, 
   null, 
   "gansao", 
   "You're correct. There's no gay marriages anywhere in the Bible. The practice of gay sex is a sin.\n\n \n So as a commited Christian you CANNOT sanction gay sex without compromising your own Christian principles?", 
   {}, 
   417919, 
   null, 
   1290972240.0
  ], 
  [
   417925, 
   null, 
   "Bennedict", 
   "lol!!! damn EZ, you just keep coming out and going back in again. make up your mind already!", 
   {}, 
   417922, 
   null, 
   1290973440.0
  ], 
  [
   417980, 
   null, 
   "Easyrider", 
   "So as a commited Christian you CANNOT sanction gay sex without compromising your own Christian principles?\n\n \n OK'ing gay sex would be like approving adultery or pedophilia.", 
   {}, 
   417922, 
   null, 
   1290994440.0
  ], 
  [
   417982, 
   null, 
   "Easyrider", 
   "I don't think being taught gay is a sin was common in most churches until relatively recently, with the rise of Anita Bryant and the Religious Right in the 60s. \n\n \n Got a flash for you. Not only was sodomy against the law in virtually every state of the union in times past - laws put in place by a majority of voters who were also Christians, but even Thomas Jefferson considered sodomy a crime:\n \n \"Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.\" - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n \nThe word \"homosexual\" wasn't even included in a printed Bible until 1947.\n\n \n You really expect this sad, self-serving strawman argument to fly?\n \n A rose by any other name is still a rose. How many gay marriages were there in mainstream churches before 1947? Why do you think that is?", 
   {
    "unicode_changes_made": true
   }, 
   417876, 
   null, 
   1290994800.0
  ], 
  [
   417983, 
   null, 
   "gansao", 
   "OK'ing gay sex would be like approving adultery or pedophilia.\n\n \n That is part of the reason why I disrespect some of the numbnut athiests on this site, they accuse you of being a hypocrite because you WONT be a hypocrite and condone gay sex.", 
   {}, 
   417980, 
   null, 
   1290995220.0
  ], 
  [
   418007, 
   null, 
   "sinjin", 
   "Why does someone need others to \"condone\" their sex life if it involves consenting adults?\n \n I can think of many sexual practices not \"sanctioned\" in scripture.\n \n How does God feel about oral?", 
   {}, 
   417983, 
   null, 
   1291055760.0
  ], 
  [
   418008, 
   null, 
   "gansao", 
   "Why does someone need others to \"condone\" their sex life if it involves consenting adults?\n \n I can think of many sexual practices not \"sanctioned\" in scripture.\n \n How does God feel about oral?\n\n \n What if we take away the consenting adults...lets say a horny 15 year old?\n Whats the harm?\n Lets say a horny 14 year old?\n Wheres the harm there Sinjin?\n IF 18 why not 14?\n What about a 30 year old with a mental age of 14 or a 14 year old with a mental age of 30?\n You cant make laws to fit individuals so you make arbitary ones .\n Thats what the Christian church has done...made a decision to condemn a practice that it feels is immoral and presents a threat to the moral health of man.\n I dont agree that there should be a law against some sexual perversions including gay sex but I understand why a committed Christians do.\n I stops me repeating the same question and being surprised for getting the same answer\n \n \n I dont think there is any mention of oral sex in the bible( correct me if I am wrong) but I assume you cannot swallow on a Friday...hope this helps", 
   {}, 
   418007, 
   null, 
   1291056720.0
  ], 
  [
   418012, 
   null, 
   "sinjin", 
   "Can one be a Christian and have sexual practices not specifically sanctioned in the Bible?", 
   {}, 
   418008, 
   null, 
   1291062840.0
  ], 
  [
   418013, 
   null, 
   "gansao", 
   "Can one be a Christian and have sexual practices not specifically sanctioned in the Bible?\n\n \n That depends on whether you practices violate other Biblical rules or pursuit of those practices lessens your commitment to God.\n For instance..shagging a blow up doll may equate to worshipping idols or be considered masturbation.\n Masturbation may or may not be mentioned in the Bible but as one may have to think of fornicating while one masterbates.. this may lead us to the yearning to fornicate.\n I would advise just thinking about shagging a blow up doll while you are actually shag the aforesaid doll.\n This may create a loop hole or confuse God as to whether you are sinning or not..you may get the benefit of the doubt...hope this helps", 
   {}, 
   418012, 
   null, 
   1291063620.0
  ], 
  [
   418060, 
   null, 
   "jazyjason", 
   "I find it rather ironic that the focus here is on a purely sexual basis. If all relationships were based upon sex they'd end rather quickly I assume. Point being is the typical ignorant fundamentalist like Easy will take things only at a certain face value and common denominator to be broken down into simple black and white to more fit his world views.\n \n For example since a gay person is simply gay and may not engage in sexual activity that person is still going to hell. Or that person may be in a relationship with no sexual contact and still that person would go to hell.\n \n Easy and a couple other skewed members on this board simply cannot comprehend the complexity of different relationships. Just like in strait relationships gay relationships are just as complex and have many variations and variables in them.\n \n But attempting to explain this to someone with a mindset like easy is actually a waste of time and energy because he'll simply retort with some snide your going to burn because my version of a religion says so so I'm right remark.\n \n It's actually a vicious cycle on this board which is one of the reasons I no longer frequent these forums. I don't come here for advice or political insight on an intelligent level. because there simply is no intelligence to be found within these people!!\n \n I'm already happy in my life. I'll be moving to northern California starting a new career and living my life happily with my partner eventually. but even still I find it almost laughable that while I move on in life people here still go on the same pointless tyraid like Easy.\n \n If the last seven thousand posts didn't convince anybody of your point of view why do it Easy? Is it attention? or something of a personal satisfaction trying to score low blows against people you deem in your stereotypical mindset to be inferior in some way?\n \n Do you feel all gay men weak sissy people who cry after hearing your truth so you end up gaining some sort of devious glee from it? And why hasn't moderators on this board over the past year done something about it?\n \n Some of these posts from some users have been so damning, so insulting, so vile and underlying in filth and venom you'd be banned anywhere else! I've heard through the grapevine from other users that the mods excuse simply is \"not enough complaints\" which is bunk.\n \n If you cannot read your own posters comments and judge for yourself what is bannable and crossing the lines multiple times then perhaps it's time someone else take control over these boards...\n \n Seriously. it took Archie years to get banned literally years... And I for one personally am tired of the mud slinging and the scapegoat tactics employed not only by this member but others like him.\n \n No I'm not crying foul cause I'm a \"liberal\" so don't even try it you hawks. it's simply because there is no USEFUL discussion going on! This is a debate forum! Not a post scripture, rant and rave against gays like their the plague and leave forum.\n \n If you want to find a gay topic on yahoo and leave a comment. Ive been a member here since roughly 2005 and I can tell you the reason why all the people left is simply because it became nothing more than a yelling and shouting match with no merit in the word \"debate\" left anywhere on these boards.\n \n \n Ban me or prove me wrong. Either way things have gotta change here... And Gans for the love of God remove that disgusting sexual picture off your handle. I'm disgusted by it. Your so typical. cry about gay men but have two women sucking on a candy cane and it's Jesus approved!! Typical strait nonsense... Oh I don't mind me two women but two dudes? Come on!....", 
   {}, 
   418013, 
   null, 
   1291100460.0
  ], 
  [
   418067, 
   null, 
   "gansao", 
   "JJ..For example since a gay person is simply gay and may not engage in sexual activity that person is still going to hell. Or that person may be in a relationship with no sexual contact and still that person would go to hell\n \n I argued against the above paragraph but I was wrong...you are essentially right JJ .\n I do you or Easy no favours for arguing otherwise.\n \n \n However...\n \n The rest of your post is just a whine JJ.\n As for my avatar...two young ladies enjoying a xmas stick of rock simply cannot be seen as disgusting.\n You obviously have issues", 
   {}, 
   418060, 
   null, 
   1291121280.0
  ], 
  [
   418075, 
   null, 
   "jyoshu", 
   "I find it rather ironic that the focus here is on a purely sexual basis. If all relationships were based upon sex they'd end rather quickly I assume. Point being is the typical ignorant fundamentalist like Easy will take things only at a certain face value and common denominator to be broken down into simple black and white to more fit his world views.\n\n \n What I've always found amusing is that pride proponents seem to want the topic of gay-related issues discussed without the issue of sex ever being brought up. It's silly to want the topic only discussed in such a sterilized way. If straight people were the ones constantly trying to make an issue that they are straight, naturally the discussion of what that MEANS in terms of behavior would come up in discussion. \n \n \nSome of these posts from some users have been so damning, so insulting, so vile and underlying in filth and venom you'd be banned anywhere else! I've heard through the grapevine from other users that the mods excuse simply is \"not enough complaints\" which is bunk.\n \n If you cannot read your own posters comments and judge for yourself what is bannable and crossing the lines multiple times then perhaps it's time someone else take control over these boards...\n \n Seriously. it took Archie years to get banned literally years... And I for one personally am tired of the mud slinging and the scapegoat tactics employed not only by this member but others like him.\n\n \n Just to set the record straight, at least one of the people on your side got banned too, not just Archie and EZ's side. Saminh got banned--and it TOO took forever--and Foundit66 was obviously borderline (he apparently 'resigned', so to speak, probably because he was so close to being banned.) I've read hate-filled posts from your side of the aisle, Jazy, so don't pretend this is a one way street on this forum. People left the forum? That's their fault. This isn't a gay-pride support forum. it's a DEBATE forum. Here your position isn't gospel, it's up for debate. That's the whole point of this forum. If you can't handle that, then maybe this indeed isn't the place for you.\n \n More to the point: \n Gay related issues--even sexuality-related issues--can't be discussed in an honest way without the topic of sex coming up. It's just part of the discussion: get used to it. You might as well embrace it because it's a sexual issue and therefore discussion of that aspect is going to be part of the dialog. \n \n And guess what... religious fundies like EZ are here to stay. I don't like 'em either, but they're here to stay. You're not going to be able to avoid discussion with them if you are wanting to engage society on this topic. Homosexuality-related issues are still too non-mainstream to expect it to be discussed blithely and benignly.", 
   {}, 
   418060, 
   null, 
   1291136100.0
  ], 
  [
   418120, 
   null, 
   "Easyrider", 
   "I find it rather ironic that the focus here is on a purely sexual basis. If all relationships were based upon sex they'd end rather quickly I assume. Point being is the typical ignorant fundamentalist like Easy will take things only at a certain face value and common denominator to be broken down into simple black and white to more fit his world views.\n \n For example since a gay person is simply gay and may not engage in sexual activity that person is still going to hell. Or that person may be in a relationship with no sexual contact and still that person would go to hell.\n \n\n \n Tsk, tsk, tsk...\n \n Guess what? Yet another post from Jazy on homosexuality. Surprise! Does it ever end?\n \n Why don't you ever study the Bible, Jazy, instead of burying yourself constantly in dead-end homosexual issues?\n \n Here's a principle you need to learn that will help you out with your rant above. It comes from Matthew chapter 5, Jesus speaking:\n \n 27 &#8220;You have heard that it was said, &#8216;You shall not commit adultery.&#8217; 28 But I tell you that anyone who looks at a woman lustfully has already committed adultery with her in his heart.\"\n \n It's the same principle with homosexuals, thieves, etc. If any gay man or woman has looked lustfully at another member of the same sex, they have already committed homosexual fornication in their hearts, and need to repent.\n \n Not only that, but everyone - straight or gay - needs to repent and receive Christ as their Lord and Savior for the remission of their sins.\n \n So you're left without an out.\n \n Now I suppose you're going to try to sell people on the argument that celibate gays never lust in their hearts after another person of the same sex. You can try to argue that but I won't be buying it - ever. It's a loser argument.\n \n \nAnd I for one personally am tired of the mud slinging and the scapegoat tactics employed not only by this member but others like him.\n\n \n You're the one who just ranted about \"ignorant fundamentalists.\" \n \n So quit your hypocritical whining about ignorant fundamentalists and realize you have been the one who is engaging in ignorant arguments on these issues, not me.", 
   {}, 
   418060, 
   null, 
   1291162320.0
  ], 
  [
   418121, 
   null, 
   "gansao", 
   "Tsk, tsk, tsk...\n \n Guess what? Yet another post from Jazy on homosexuality. Surprise! Does it ever end?\n \n Why don't you ever study the Bible, Jason, instead of burying yourself constantly in dead-end homosexual issues?\n \n Here's a principle you need to learn that will help you out with your rant above. It comes from Matthew chapter 5, Jesus speaking:\n \n 27 \"You have heard that it was said, 'You shall not commit adultery.' 28 But I tell you that anyone who looks at a woman lustfully has already committed adultery with her in his heart.\"\n \n It's the same thing with homosexuals. If any gay man or woman has looked lustfully at another member of the same sex, they have committed homosexual fornication in their hearts, and need to repent.\n \n Not only that, but everyone - straight or gay - needs to repent and receive Christ as their Lord and Savior for the remission of their sins.\n \n So you're left without an out.\n \n Now I suppose you're going to try to sell people on the argument that none of you gays ever lust in your hearts after another person of the same sex. You can try to argue that but I won't be buying it - ever. It's a loser argument.\n \n So quit your whining about ignorant fundamentalists and realize you have been the one who is ignorant on these issues, not me.\n\n \n But if a gay man realises his lust is a sin and doesnt act on it then actually being intrinsically gay is not a sin , right?\n In the same way that a man who lusts after another mans wife would be forgiven if he realises its a sin and suppresses his lust", 
   {
    "unicode_changes_made": true
   }, 
   418120, 
   null, 
   1291162860.0
  ], 
  [
   418122, 
   null, 
   "Easyrider", 
   "But if a gay man realises his lust is a sin and doesnt act on it then actually being intrinsically gay is not a sin , right?\n\n \n No, it's still a sin, like Jesus said.\n \n Also, in James 1:15 it reads: Then when lust has conceived, it gives birth to sin; and when sin is accomplished, it brings forth death.\n \n \nIn the same way that a man who lusts after another mans wife would be forgiven if he realises its a sin and suppresses his lust\n\n \n But he's already sinned. All he needs to do then is confess his sin and ask for forgiveness from the Lord. See 1 John 1:9.\n \n Cheers...", 
   {}, 
   418121, 
   null, 
   1291163340.0
  ], 
  [
   418124, 
   null, 
   "gansao", 
   "No, it's still a sin, like Jesus said.\n \n Also, in James 1:15 it reads: Then when lust has conceived, it gives birth to sin; and when sin is accomplished, it brings forth death.\n \n \n \n But he's already sinned. All he needs to do then is confess his sin and ask for forgiveness from the Lord. See 1 John 1:9.\n \n Cheers...\n\n \n Sorry to labour the point Easy but I need clarification.\n \n If a man falls in love with another mans wife his lust for her is a sin .\n He must recognise this and repent.\n What does he do about the love he has for the woman?", 
   {}, 
   418122, 
   null, 
   1291164360.0
  ], 
  [
   418125, 
   null, 
   "Easyrider", 
   "Sorry to labour the point Easy but I need clarification.\n \n If a man falls in love with another mans wife his lust for her is a sin .\n He must recognise this and repent.\n What does he do about the love he has for the woman?\n\n \n The Bible says to flee from sin, so he needs to stay away from her. In time he'll get over it and he can find another love. Tears...", 
   {}, 
   418124, 
   null, 
   1291165560.0
  ], 
  [
   418126, 
   null, 
   "gansao", 
   "The Bible says to flee from sin, so he needs to stay away from her. In time he'll get over it and he can find another love. Tears...\n\n \n Big order for gays though.\n A gay man must be celibate and recognise that his lust for other men is a sin..ok but he would still be essentially gay so would this be enough?", 
   {}, 
   418125, 
   null, 
   1291166160.0
  ], 
  [
   418127, 
   null, 
   "Easyrider", 
   "Big order for gays though.\n A gay man must be celibate and recognise that his lust for other men is a sin..ok but he would still be essentially gay so would this be enough?\n\n \n I believe to the end of the earth that the Holy Spirit can straighten a gay person out to be a heterosexual. \n \n If I were gay (and I'm not) I would first receive Jesus as my Lord and Savior for the remission of my sins, and be born again in the Holy Spirit. Then I would submit myself to Jesus and the Holy Spirit and ask them to free me from homosexual bondage. I believe in time they would. God has changed many people's lives, and he can change gays.", 
   {}, 
   418126, 
   null, 
   1291167600.0
  ], 
  [
   418129, 
   null, 
   "gansao", 
   "I believe to the end of the earth that the Holy Spirit can straighten a gay person out to be a heterosexual. \n \n If I were gay (and I'm not) I would first receive Jesus as my Lord and Savior for the remission of my sins, and be born again in the Holy Spirit. Then I would submit myself to Jesus and the Holy Spirit and ask them to free me from homosexual bondage. I believe in time they would. God has changed many people's lives, and he can change gays.\n\n \n Thanks for your answer Easy. \n Your position is much clearer to me now.\n Cheers..", 
   {}, 
   418127, 
   null, 
   1291168140.0
  ], 
  [
   418130, 
   null, 
   "Bennedict", 
   "I believe to the end of the earth that the Holy Spirit can straighten a gay person out to be a heterosexual. \n \n If I were gay (and I'm not) I would first receive Jesus as my Lord and Savior for the remission of my sins, and be born again in the Holy Spirit. Then I would submit myself to Jesus and the Holy Spirit and ask them to free me from homosexual bondage. I believe in time they would. God has changed many people's lives, and he can change gays.\n\n \n lollie. change people in order for all people to be exactly the same, meaning there is no change in the human race at all. tada!\n \n i like how you had to specify that you are not gay, as if youre afraid of being threatened for being gay if you hadnt. are you afraid of being threatened EZ?\n \n i should start a religion which involves a sort of holy spirit which can change any heterosexual person gay. then ill make sure to let people know that heterosexuality is a sin. except i wont do that because im not a douche.", 
   {}, 
   418127, 
   null, 
   1291168380.0
  ], 
  [
   418132, 
   null, 
   "Easyrider", 
   "lollie. change people in order for all people to be exactly the same, meaning there is no change in the human race at all. tada!\n \n i like how you had to specify that you are not gay, as if youre afraid of being threatened for being gay if you hadnt. are you afraid of being threatened EZ?\n \n i should start a religion which involves a sort of holy spirit which can change any heterosexual person gay. then ill make sure to let people know that heterosexuality is a sin. except i wont do that because im not a douche.\n\n \n You don't know the power of God and the Holy Spirit, so please spare us your unbelief.\n \n Acts 7:51", 
   {}, 
   418130, 
   null, 
   1291170120.0
  ], 
  [
   418135, 
   null, 
   "jazyjason", 
   "\n As for my avatar...two young ladies enjoying a xmas stick of rock simply cannot be seen as disgusting.\n You obviously have issues\n\n \n I do not have issues and it has sexual overtones anyone can clearly see that. How would you like me to get a similar photo with two men? The whole board would be up in arms!", 
   {}, 
   418067, 
   null, 
   1291171020.0
  ], 
  [
   418136, 
   null, 
   "jazyjason", 
   "What I've always found amusing is that pride proponents seem to want the topic of gay-related issues discussed without the issue of sex ever being brought up. It's silly to want the topic only discussed in such a sterilized way. If straight people were the ones constantly trying to make an issue that they are straight, naturally the discussion of what that MEANS in terms of behavior would come up in discussion. \n\n \n And yet it's seen from the opposite end as nothing BUT on a pure sexual basis... that's the argument that they have. it's not the other relationship factors. And please don't call me a \"pride\" proponent. I'm in no way happy or thrilled with the state of the gay community at this point.\n \n \n \n \nJust to set the record straight, at least one of the people on your side got banned too, not just Archie and EZ's side. Saminh got banned--and it TOO took forever--and Foundit66 was obviously borderline (he apparently 'resigned', so to speak, probably because he was so close to being banned.) I've read hate-filled posts from your side of the aisle, Jazy, so don't pretend this is a one way street on this forum. People left the forum? That's their fault. This isn't a gay-pride support forum. it's a DEBATE forum. Here your position isn't gospel, it's up for debate. That's the whole point of this forum. If you can't handle that, then maybe this indeed isn't the place for you.\n\n \n Jyoshu come on. You of all people know that insulting others isn't a means of debate here... And it goes for both sides not just the far right on this board. I thought someone like you could grasp the simple concepts I outlined instead of attempting to pick the post apart..\n \n \n \n \n \nMore to the point: \n Gay related issues--even sexuality-related issues--can't be discussed in an honest way without the topic of sex coming up. It's just part of the discussion: get used to it. You might as well embrace it because it's a sexual issue and therefore discussion of that aspect is going to be part of the dialog. \n\n \n Ok fine then sex will be an issue. But sex doesn't DEFINE a relationship be it gay or strait. And if it does those relationships have proven to never last...\n \n \n \nAnd guess what... religious fundies like EZ are here to stay. I don't like 'em either, but they're here to stay. You're not going to be able to avoid discussion with them if you are wanting to engage society on this topic. Homosexuality-related issues are still too non-mainstream to expect it to be discussed blithely and benignly.\n\n \n I find it ironic that you would even say speaking with them would be a from of discussion.. More like flailing of hands, pitchforks, and guttural sounds... But i get your drift.", 
   {}, 
   418075, 
   null, 
   1291171320.0
  ], 
  [
   418139, 
   null, 
   "gansao", 
   "I do not have issues and it has sexual overtones anyone can clearly see that. How would you like me to get a similar photo with two men? The whole board would be up in arms!\n\n \n Try it and find out.\n \n Personally I couldnt care less.\n \n The sexual overtones are in the head of the viewer..there is no nudity, nor are the two girls touching..whats the problem?", 
   {}, 
   418135, 
   null, 
   1291171620.0
  ], 
  [
   418141, 
   null, 
   "jazyjason", 
   "Tsk, tsk, tsk...\n \n Guess what? Yet another post from Jazy on homosexuality. Surprise! Does it ever end?\n\n \n I dunno? Do you ever stop complaining about homosexuality? maybe if you didn't cram your view on it down our throats with venom filled posts we would have no need to have this discussion would we?\n \n \nWhy don't you ever study the Bible, Jazy, instead of burying yourself constantly in dead-end homosexual issues?\n\n \n Why don't you ever study something BUT the bible? Why don't you study constitutional law, or perhaps factual studies on gays instead of using archaic destitute scripture to demean and vilify my life, my rights, and my right to even breath on this planet?\n \n \nHere's a principle you need to learn that will help you out with your rant above. It comes from Matthew chapter 5, Jesus speaking:\n\n \n And here's another principle you need to learn: Respect is a two way street Easy. If your going to debate be formal, make your points on a pure objectionable religious context with respect to others without being a crazy, mudslinging fool...\n \n \n27 \"You have heard that it was said, 'You shall not commit adultery.' 28 But I tell you that anyone who looks at a woman lustfully has already committed adultery with her in his heart.\"\n\n \n I don't look at women with lust.....\n \n \nIt's the same principle with homosexuals, thieves, etc. If any gay man or woman has looked lustfully at another member of the same sex, they have already committed homosexual fornication in their hearts, and need to repent.\n\n \n I don't look upon other men with lust. I don't look upon my partner with lust. I look upon him with love, respect, and compassion. How hard is it for you to grasp that?\n \n \nNot only that, but everyone - straight or gay - needs to repent and receive Christ as their Lord and Savior for the remission of their sins.\n\n \n And yet that still is not enough for you to accept gay Christians into your fold... typical.\n \n \nSo you're left without an out.\n\n \n \nNow I suppose you're going to try to sell people on the argument that celibate gays never lust in their hearts after another person of the same sex. You can try to argue that but I won't be buying it - ever. It's a loser argument.\n\n \n I don't need you to buy anything Easy. Your only convincing yourself on your own self delusions steeped in bigotry and scriptural ignorance. That clearly is your issue not mine.\n \n \n \n \nYou're the one who just ranted about \"ignorant fundamentalists.\" \n\n \n Rant? I do not rant Easy your a perfect example of the word Rant. need proof? Look back at just about every post you've made on gays, gay rights, or heck even non gay people..\n \n \nSo quit your hypocritical whining about ignorant fundamentalists and realize you have been the one who is engaging in ignorant arguments on these issues, not me.\n\n \n Typical. Flip the argument, don't own up to your mistakes, and yet justify your own vile posts toward others with something of an air of pride and gumption. Go on Easy but I warn you your turning off more and more people by what you say and just prove what is wrong with the far right religious crowd today...", 
   {
    "unicode_changes_made": true
   }, 
   418120, 
   null, 
   1291171740.0
  ], 
  [
   418144, 
   null, 
   "jazyjason", 
   "Try it and find out.\n \n Personally I couldnt care less.\n \n The sexual overtones are in the head of the viewer..there is no nudity, nor are the two girls touching..whats the problem?\n\n \n \n I still wouldn't do it.", 
   {}, 
   418139, 
   null, 
   1291172040.0
  ], 
  [
   418149, 
   null, 
   "gansao", 
   "I still wouldn't do it.\n\n \n Then why moan when I do?\n \n You should lighten up.\n You are going to hell anyway .\n See you there.", 
   {}, 
   418144, 
   null, 
   1291173000.0
  ], 
  [
   418150, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n Tsk, tsk, tsk...\n \n Guess what? Yet another post from Jazy on homosexuality. Surprise! Does it ever end?\n\n \n \nI dunno? Do you ever stop complaining about homosexuality? maybe if you didn't cram your view on it down our throats with venom filled posts we would have no need to have this discussion would we?\n\n \n Looks who's talking - the pro-gay activist who has started 5 pages worth of threads on homosexual subjects.  \n \n http://www.4forums.com/political/search.php?searchid=260404\n \n That's a life's work right there. And there's no doubt that constitutes idol worship.\n \n \n \nWhy don't you study constitutional law, or perhaps factual studies on gays instead of using archaic destitute scripture to demean and vilify my life, my rights, and my right to even breath on this planet?\n\n \n Poor little jazy.... I must have missed all those court decisions in your favor. LOL!\n \n \n\n I don't look upon other men with lust. I don't look upon my partner with lust. \n\n \n I don't believe you.\n \n Your whole world is homosexual this and homosexual that. Face it, jazy, you're ate up with it. They say you are whatever you spend all your time on, and when you fill up 5 pages full of homosexual topics, then there's no arguing against it. \n \n So, jazy, that's your world - a world of wall to wall homosexuality. It's not mainstream America. And it's not of God.", 
   {}, 
   418141, 
   null, 
   1291174380.0
  ], 
  [
   418151, 
   null, 
   "Easyrider", 
   "\n \n (To Jazy)\n \n Then why moan when I do?\n \n You should lighten up.\n You are going to hell anyway...\n \n\n \n LOL! I do admire your wit. emoticon_xagree", 
   {}, 
   418149, 
   null, 
   1291174980.0
  ], 
  [
   418154, 
   null, 
   "Bennedict", 
   "You don't know the power of God and the Holy Spirit, so please spare us your unbelief.\n \n Acts 7:51\n\n \n are you afraid, EZ?", 
   {}, 
   418132, 
   null, 
   1291177020.0
  ], 
  [
   418157, 
   null, 
   "jazyjason", 
   "Then why moan when I do?\n \n You should lighten up.\n You are going to hell anyway .\n See you there.\n\n \n That's such a nice thing to say Gans. I'm sure Jesus approves...", 
   {}, 
   418149, 
   null, 
   1291190100.0
  ], 
  [
   418158, 
   null, 
   "jazyjason", 
   "Looks who's talking - the pro-gay activist who has started 5 pages worth of threads on homosexual subjects.  \n \n http://www.4forums.com/political/search.php?searchid=260404\n \n That's a life's work right there. And there's no doubt that constitutes idol worship.\n\n \n Yes subjects regarding gay rights. Not flame wars unlike yourself Easy. \n \n \n \n \n \nPoor little jazy.... I must have missed all those court decisions in your favor. LOL!\n\n \n Gee a few have been in my favor... I just love how you show your true Christianity by gushing over the determent of human rights like a NASCAR victory lap...\n \n \n \n \nI don't believe you.\n \n Your whole world is homosexual this and homosexual that. Face it, jazy, you're ate up with it. They say you are whatever you spend all your time on, and when you fill up 5 pages full of homosexual topics, then there's no arguing against it. \n So, jazy, that's your world - a world of wall to wall homosexuality. It's not mainstream America. And it's not of God.\n\n \n Oh it's not AMERICA *strike up a banjo* It's not God!! *strike up a dirge* please Easy... You REPLY to all those threads. you RESPOND to everything and put something regarding homosexuality into other threads toward other users as a means to insult!\n \n Pot paging kettle line one!\n \n Seriously easy mainstream America seems to have left you in the dust... And besides my world isn't a world of wall to wall homosexuality. I haven't even stepped into a gay bar in months simply because I don't have time and I'm consumed with work as it is and will be even more busy.\n \n But oh my God Everyone look at that!! A productive homosexual who is part of society, pays taxes, and contributes! oh no the sky must be falling, the moon turning to blood, and the horseman from revelation must have kicked the horse in his stirrups because it's the end of the world!!!", 
   {}, 
   418150, 
   null, 
   1291190460.0
  ], 
  [
   418160, 
   null, 
   "Easyrider", 
   "\n \n Oh it's not AMERICA *strike up a banjo* It's not God!! *strike up a dirge* please Easy... You REPLY to all those threads. you RESPOND to everything and put something regarding homosexuality into other threads toward other users as a means to insult!\n \n Pot paging kettle line one!\n \n\n \n Dry up. \n \n You're the author of 5 pages full of these pro-gay threads. I'm here to offset your unbiblical propagande and keep you honest so you don't lead others down the path to perdition.\n \n And I'll make you a deal (which I'm sure you'll decline - showing where your true heart lies): You quit posting on homosexual topics and I'll quit responding. And that goes for your other pro-gay pals too.\n \n (Who wants to bet jazy will choose instead to keep posting his pro-gay propaganda?)", 
   {}, 
   418158, 
   null, 
   1291200900.0
  ], 
  [
   418165, 
   null, 
   "gansao", 
   "That's such a nice thing to say Gans. I'm sure Jesus approves...\n\n \n You seem to be more concerned about Jesus's approval than I am.", 
   {}, 
   418157, 
   null, 
   1291210140.0
  ], 
  [
   418297, 
   null, 
   "jazyjason", 
   "Dry up. \n \n You're the author of 5 pages full of these pro-gay threads. I'm here to offset your unbiblical propagande and keep you honest so you don't lead others down the path to perdition.\n \n And I'll make you a deal (which I'm sure you'll decline - showing where your true heart lies): You quit posting on homosexual topics and I'll quit responding. And that goes for your other pro-gay pals too.\n \n (Who wants to bet jazy will choose instead to keep posting his pro-gay propaganda?)\n\n \n \n Fine. I'll bite. Lets see how long you can keep your mouse from clicking... besides I'm leaving for Nor Cal in 5 hours anyways so I got more important things to worry about than \"debating\" with you.\n \n Oh and it's not propaganda that's the Focus On the Family's job not mine...", 
   {}, 
   418160, 
   null, 
   1291347420.0
  ], 
  [
   418298, 
   null, 
   "jazyjason", 
   "You seem to be more concerned about Jesus's approval than I am.\n\n \n I find it ironic that you can judge the lives of gay people based upon your religious interpretation but yet fail to be concerned with the thoughts and opinions of your own Creator holding you to your own set of standards.", 
   {}, 
   418165, 
   null, 
   1291347480.0
  ], 
  [
   418340, 
   null, 
   "jitobear", 
   "Ignorance is no excuse.\n\n \n Further proof that your god is a dick.", 
   {}, 
   417839, 
   null, 
   1291398780.0
  ], 
  [
   418379, 
   null, 
   "Easyrider", 
   "Further proof that your god is a dick.\n\n \n Listen, potty-mouth, it's people like you who voted for or supported Obama, so why should anyone believe anything you spew against the wall? You've got absolutely zero credibility.\n \n p.s. Unemployment rose to 9.8% today. So, how did that smashing \"Summer of Recovery\" work out for you? ROTFLOL!", 
   {}, 
   418340, 
   null, 
   1291426920.0
  ], 
  [
   418385, 
   null, 
   "Bottom Feeder", 
   "Listen, potty-mouth, it's people like you who voted for or supported Obama, so why should anyone believe anything you spew against the wall? You've got absolutely zero credibility.\n \n p.s. Unemployment rose to 9.8% today. So, how did that smashing \"Summer of Recovery\" work out for you? ROTFLOL!\n\n \n What does anyone's voting record, or the unemployment rate, have to do with the subject?", 
   {}, 
   418379, 
   null, 
   1291432140.0
  ], 
  [
   418387, 
   null, 
   "jitobear", 
   "Listen, potty-mouth, !\n\n \n Better a potty mouth than a meany-head.\n \n \nit's people like you !\n\n \n ooooooooh! What are people like me like? Tell tell tell!!!! What did we have for dinner? How many loads of laundry did we wash today? How many trips to the grocery store? What was the last song we listened to? What will we watch on telly tonight? Where are we going on vacation? Who do we favor on Sunday - the Vikes or the Bills? What color panties are they wearing. I mean, I wanna get this right.\n \n \nwho voted for or supported Obama, !\n\n \n Yes I did. Still like him well enough.\n \n \nso why should anyone believe anything you spew against the wall? You've got absolutely zero credibility.!\n\n \n Well thats hardly fair as it would entirely depend on the subject matter. I am fluent in Spanish, so you can pretty much trust my judgement there. I am not a brain surgeon though, so you are certainly right when it comes that subject. However, when it comes to knowing my opinion, I am BRILLIANT.\n \n \np.s. Unemployment rose to 9.8% today. So, how did that smashing \"Summer of Recovery\" work out for you? ROTFLOL!\n\n \n The only thing I needed to recover from this summer was a sunburn.\n \n As to the economy, its in rough shape, but I never expected Obama to be able to fix it anyway. I never blame a single administration, person, etc. for the ups downs of the economy. Its entirely too complicated to be controlled like that.\n \n \nWhat does anyone's voting record, or the unemployment rate, have to do with the subject?\n\n \n And more importantly, when is Easy going to stop speaking for other people?", 
   {}, 
   418379, 
   null, 
   1291433340.0
  ], 
  [
   418430, 
   null, 
   "Easyrider", 
   "Jito - nobody in their right mind is buying what you're selling (Obama, gay sex, anti-Christian nonsense, left-wing propaganda, etc.), so go tell it to your pet carp.", 
   {}, 
   418387, 
   null, 
   1291479600.0
  ], 
  [
   418438, 
   null, 
   "jitobear", 
   "Jito - nobody in their right mind is buying what you're selling\n\n \n I am not selling anything. This would not be one of my gifts. I couldn't sell a boat to a drowning man. And in any case;\n \n \nObama, \n\n \n Can't sell people. Slavery has been illegal here for more than a century.\n \n \ngay sex\n\n \n Except for certain parts of Nevada, prostitution is illegal. I am in Minnesota. (Granted, one could still sell sex, but being straight I have no way of selling gay sex.)\n \n \nanti-Christian nonsense,\n\n \n Not entirely sure what this is. I certainly am no Christian but I am a strong advocate for ensuring your religious freedom is secure - and limited to you (as in your faith does not get to be anyone else's problem). I also think that your representation of your god is hardly flattering, but that is not really my concern - just letting you know you are a poor advocate for your deity. If any of this is anti-Christian, so be it, but I was not aware I was making a profit here.\n \n \nleft-wing propaganda, etc.), \n\n \n I do not sell propoganda. The GOP and the DFL do, but I am not involved with either of them. But more importantly, I do not BUY into propoganda. Conservatism is not facism, liberalism is not socialism, and I am not such xenophobe that a nation of diverse ideas, backgrounds, talents, experiences, cultures, faith, etc. terrifies me so that I need to take refuge in the ideas of anyone's propoganda. I shall leave such things for the shallow, cowardly and intellectually inept.\n \n \nso go tell it to your pet carp.\n\n \n I don't have a pet carp. (Think I could make a profit selling those?) An even better question, do you think you can carry on a conversation with someone who disgrees with you without resorting to 5th grade bully tactics?", 
   {}, 
   418430, 
   null, 
   1291483560.0
  ], 
  [
   420784, 
   null, 
   "Easyrider", 
   "\"...your faith does not get to be anyone else's problem...\"\n\n \n Wrong, jitobaby. It certainly is jazy's problem. He throws a hissy-snit almost every day over the faith issues I present. Same with Mr LA Wrong. And I think I even got your blood pressure going more than a few times. Not to mention the chaos we cause to the pro gay marriage crowd at election time. So yeah, my faith (and the faith of those like me) is a chink in the armor and a stone in the boot of all those who are trying to inject their politically correct nonsense into the American culture.\n \n Jesus is Lord!!!\n \n p.s. All you gays read the OP again.", 
   {}, 
   418438, 
   null, 
   1293988740.0
  ], 
  [
   420786, 
   null, 
   "Xcaliber", 
   " Not to mention the chaos we cause to the pro gay marriage crowd at election time. \n\n \n Yeah Just Shows the Hypocrisy of Your Religion, You didn't do anything alone. Christians Selling out Jesus , Bringing in the Mormons To help you deny the rights of Americans. You'll sell your Faith for a few Million MORMON dollars won't you. I thought you guys despised Mormons as much as you do Atheists?.. Not to mention You People Follow a Mormon as if he was Jebus himself...lmao..", 
   {}, 
   420784, 
   null, 
   1293989700.0
  ], 
  [
   420788, 
   null, 
   "jitobear", 
   "Wrong, jitobaby. It certainly is jazy's problem. He throws a hissy-snit almost every day over the faith issues I present. Same with Mr LA Wrong. And I think I even got your blood pressure going more than a few times. Not to mention the chaos we cause to the pro gay marriage crowd at election time. So yeah, my faith (and the faith of those like me) is a chink in the armor and a stone in the boot of all those who are trying to inject their politically correct nonsense into the American culture.\n \n Jesus is Lord!!!\n \n p.s. All you gays read the OP again.\n\n \n I am not responsible for the responses of anyone but me.\n \n I assure you that you have never raised my blood pressure. Adrian Peterson with his shirt off on the other hand......\n \n You know, I am not really sure why it is that you wish to enforce what is basically theocracy. You are free to be as godly as you like. \n \n I have read the Bible. According to your faith God stopped backing nations after Isreal and its up to each individual to come to Christ. Why bother with forcing non-believers to live by your personal moral code? Paul told you to leave them well enough alone and if your god is so all-knowing don't you think he will know the difference between honest faith and lip service? You are not earning brownie points in heaven (or even on earth) by being a pain in the neck.\n \n Be glad for PC tolerance. It ensures you get to practice your faith, too. If you want to see what a lack of PC tolerance brings you - check out Iran.", 
   {}, 
   420784, 
   null, 
   1293990180.0
  ], 
  [
   420793, 
   null, 
   "Easyrider", 
   "\n \n You know, I am not really sure why it is that you wish to enforce what is basically theocracy.\n\n \n No theocracy, just free speech to tweak your consciences.\n \n \nI have read the Bible. According to your faith God stopped backing nations after Isreal and its up to each individual to come to Christ. Why bother with forcing non-believers to live by your personal moral code?\n\n \n I'm speaking and voting, not forcing.\n \n Why does the pro gay crowd try to force their godless agenda down the throats of decent Americans?\n \n \n\n Paul told you to leave them well enough alone...\n\n \n Paul preached to the heathens. So did Jesus. That's good enough for me. \n \n \n\n You are not earning brownie points in heaven (or even on earth) by being a pain in the neck.\n\n \n Yeah, I am too. Sometimes you have to hit a donkey right between the eyes to get their attention and open their eyes.\n \n Jesus is Lord!", 
   {}, 
   420788, 
   null, 
   1293993720.0
  ], 
  [
   420809, 
   null, 
   "jazyjason", 
   "or me. \n \n \n \n Yeah, I am too. Sometimes you have to hit a donkey right between the eyes to get their attention and open their eyes.\n \n Jesus is Lord!\n\n \n That's animal abuse. I hope the Donkey turned around and kicked you as hard as he could.", 
   {}, 
   420793, 
   null, 
   1294005780.0
  ], 
  [
   420882, 
   null, 
   "jitobear", 
   "No theocracy, just free speech to tweak your consciences.\n\n \n Preach on narrow minded brother. But you advocate more than speaking freely and you know it. You advocate forcing them into a family structure that fits YOUR religion's moral code. You also advocate YOUR religion's ideas being taught to ALL school children. You also advocate employment discrimination based on YOUR religion's ideas about who is icky.\n \n \nI'm speaking and voting, not forcing.\n\n \n I have no problem with either of these. I do have a problem with leaders who allow your religious ideals to be put to a vote. If law serves no purpose other than appeasing religion, it is a blatant violation of the first ammendment.\n \n \nWhy does the pro gay crowd try to force their godless agenda down the throats of decent Americans?\n\n \n Show where ANYONE is doing this. Who is advocating that you be forced into marrying a man, watching porn, or doing anything against your religion? And remember, other people not having to follow the rules of YOUR religion is not an infringement of YOUR rights. Your religious freedom ends at the tip of your nose. You can be a devout as you like and I can be as godless as I like. Its equal. Its free. Its fair.\n \n \nPaul preached to the heathens. So did Jesus. That's good enough for me. \n\n \n Paul also told you to leave those who do not welcome your message be. But then you always have only cared about the Bible passages that you feel justify your behavior and prejudice.\n \n \nYeah, I am too. Sometimes you have to hit a donkey right between the eyes to get their attention and open their eyes.\n\n \n Every time you preach I am more and more convinced that your religion is the domain of whackos. I suspect you have never been successful in advocating your religion. Your god is terrorist and you use bully tactics. Only the most perved masochist would be interested in what thats all about, cux it AIN'T love.\n \n In any case its not the preaching I was talking about. I am talking about your efforts to force non-believers into following the rules of your religion. THAT will not earn you anyone's regard. Anywhere.\n \n \nJesus is Lord!\n\n \n Jesus was a man.", 
   {}, 
   420793, 
   null, 
   1294073940.0
  ], 
  [
   420883, 
   null, 
   "Easyrider", 
   "Preach on narrow minded brother. But you advocate more than speaking freely and you know it. You advocate forcing them into a family structure that fits YOUR religion's moral code.\n\n \n As opposed to their forcing our kids in school to be indoctrinated with their gay sex hedonism? Having it rammed down their throats? \n \n \n\n You also advocate employment discrimination based on YOUR religion's ideas about who is icky.\n\n \n Baloney. But I do want them out of any church or Christian employment where by their standards they do not allow practicing homosexuals. \n \n And I don't want openly gay men in the Boy Scouts or in any Christian organization.\n \n Listen, snicklefritz, your pro gay sex agenda is an abomination to God and decent Americans everywhere. You're on the wrong side of morality and there's going to be a price to pay for it on the other side. Keep your pro gay sexual persuasions and perversions to yourselves. The rest of us don't need to know which way reprobates perform their gay sex practices. Neither do our kids in school. Leave them alone.", 
   {}, 
   420882, 
   null, 
   1294075980.0
  ], 
  [
   420888, 
   null, 
   "Xcaliber", 
   "As opposed to their forcing our kids in school to be indoctrinated with their gay sex hedonism? Having it rammed down their throats?\n\n \n Show me a school ANYWHERE who teaches gay sex hedonism. \n \n \n\n Baloney. But I do want them out of any church or Christian employment where by their standards they do not allow practicing homosexuals. \n And I don't want openly gay men in the Boy Scouts or in any Christian organization.\n\n \n Yes we know, You are a bigot, homophobic, religious fanatic who needs a dose of reality. you don't have to remind us. \n \n \n\n Listen, snicklefritz, your pro gay sex agenda is an abomination to God and decent Americans everywhere. You're on the wrong side of morality and there's going to be a price to pay for it on the other side. Keep your pro gay sexual persuasions and perversions to yourselves. The rest of us don't need to know which way reprobates perform their gay sex practices. Neither do our kids in school. Leave them alone.\n\n \n Your religion is an Abomination to mankind. So why don't you keep that to yourself?. You have truly lost your frickin mind. I know how hard it must be for you to watch your GOD come crumbling down before your eyes. Your GOD has no power over reality.", 
   {}, 
   420883, 
   null, 
   1294080180.0
  ], 
  [
   420911, 
   null, 
   "jazyjason", 
   ". It certainly is jazy's problem. He throws a hissy-snit almost every day over the faith issues I present. \n\n \n Man you really are full of yourself aren't you? Trust me I lose no sleep at night because of these sky fairy visions you claim to have had that spur you on to continue rambling like the mad man you are...", 
   {}, 
   420784, 
   null, 
   1294090260.0
  ], 
  [
   421733, 
   null, 
   "jitobear", 
   "As opposed to their forcing our kids in school to be indoctrinated with their gay sex hedonism? Having it rammed down their throats? \n\n \n Being told gay people/families exist and that it is not OK to treat them badly is not being indoctrinated with anything. You want to talk about \"ramming down throats\"? When my son was little an older classmate of his was using the word \"gay\" as an insult. My son asked him to stop because his dad is gay. This older boy then shoved garbage down my son's throat and spent weeks threatening him before I found out about it. Whose kind of morality do you think taught him it was OK to do that? Someone like me? Or you?\n \n \nBaloney. But I do want them out of any church or Christian employment where by their standards they do not allow practicing homosexuals. And I don't want openly gay men in the Boy Scouts or in any Christian organization.\n\n \n I actually don't have a problem with any of this. Private organizations such as these should be able to discriminate at will (but then they should lose any public funding or privileges since the \"public\" consists of more than anti-gay, Christians).\n \n And I admit it makes me sad. Denying yourself access to cool people due to prejudice. My son would have missed out on a wonderful father had I bought into this kind of thinking.\n \n HOWEVER! Its not baloney! Why else are you belly aching about repealing DADT?\n \n \nListen, snicklefritz, \n\n \n Really, you never quite got past age 11 emotionally, did you?\n \n \nyour pro gay sex agenda \n\n \n I don't have a pro-gay sex agenda. I have a \"mind your own damned business when it comes to the sex lives of consenting adults\" agenda. What relationships people choose to build is not for you to dictate, nor should those relationships have any bearing whatsoever to legal rights and privileges in the public sphere. Nor should they have to keep it all a secret because you and YOUR religion think its icky. (Welcome to America - where your religion does not get to be MY problem.....)\n \n \nis an abomination to God and decent Americans everywhere. You're on the wrong side of morality and there's going to be a price to pay for it on the other side. Keep your pro gay sexual persuasions and perversions to yourselves.\n \n \n And you claim to not want a theocracy? Reconcile that claim with this statement.\n \n \nThe rest of us don't need to know which way reprobates perform their gay sex practices.\n \n \n I don't want to know the details of how ANYONE conducts their sex life (besides me and my sex partners). This is why I get sooooo annoyed when I see the news stories about celebs who have affairs. I could not care less about Tiger's mistress, or Clinton's BJs or how anyone BUT ME is getting off. Sigh - however we have free speach in America so I guess I just have to DEAL WITH IT and have the personal accountability to NOT CARE. \n \n Oh, and quit speaking for other people. Its rude.\n \n \nNeither do our kids in school. Leave them alone.\n\n \n I am willing to bet that between you and I, I am the only one with a kid in public school. I would appreciate it if you would stop referring to me in way that implies I am not American, a voter, a parent, etc. Our society consists of more than fundies. Really, you should get out more.\n \n The 'homosexuality' taught in my son's schools were -\"gays are here, have families and are part of society\". As for sex, they got the usual sex ed/how babies are made/safe sex lessons which did not bring up heterosexuality or homosexuality specifically. That is it. \n \n If someone wants to send their kid to a school that says gays are evil and must be eradicated from society - public school is probably not the best option.", 
   {}, 
   420883, 
   null, 
   1294606620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  U.S. Gay Men\u0092s Astonishing HIV / STD Rates", 
  "url": "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 14738, 
  "discussion_files": [
   [
    "29685.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-print.html"
   ], 
   [
    "29686.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-8-print.html"
   ], 
   [
    "29687.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-6-print.html"
   ], 
   [
    "29688.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-4-print.html"
   ], 
   [
    "29689.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-5-print.html"
   ], 
   [
    "29690.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-7-print.html"
   ], 
   [
    "29691.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-3-print.html"
   ], 
   [
    "29692.html", 
    "http://www.4forums.com/political/gay-rights-debates/14738-u-s-gay-men-s-astonishing-hiv-std-rates-2-print.html"
   ]
  ], 
  "identifier": 14738
 }
]