[
 [
  [
   417365, 
   null, 
   "proudmom", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.", 
   {
    "post_info": {
     "post_title": "What the Bible really says or doesn't say about being gay"
    }
   }, 
   null, 
   null, 
   1290186960.0
  ], 
  [
   417369, 
   null, 
   "Easyrider", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.\n\n \n I think you're ultimately going to defend gay sex regardless of what you see in the Bible, because of your son, but here's some of the scriptures anyway:\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n 1 Timothy 1:8-10 - &#8220;But we know that the law is good if one uses it lawfully, knowing this: that the law is not made for a righteous person, but for the lawless and insubordinate, for the ungodly and for sinners, for the unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for fornicators, for sodomites, for kidnappers, for liars, for perjurers, and if there is any other thing that is contrary to sound doctrine&#8230;&#8221;\n \n Jude 7 &#8211; &#8220;In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire.&#8221; \n \n There's no gay marriages in the Old Testament; No gay marriages in the New Testament; no gay sex approved anywhere in the Bible. Just the opposite - gay sex is condemned in both testaments. God is consistent on that.", 
   {}, 
   417365, 
   null, 
   1290188220.0
  ], 
  [
   417374, 
   null, 
   "proudmom", 
   "Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n\n \n Let me just address this for now. Would you seriously suggest that I put my son and others like him to death?", 
   {}, 
   417369, 
   null, 
   1290193320.0
  ], 
  [
   417375, 
   null, 
   "MrWriteLA", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.\nI think you'll find the articles on this site, by a religious conservative woman, to be helpful:Musings on Christianity, Homosexuality & the Bible\n \n As well as these:\n \n THE BIBLE AND HOMOSEXUALITY\n The Clobber Passages: Reexamined by Bruce Gerig\n Scriptures\n What the Bible Says - And Doesn't Say - About Homosexuality\n \n If these pique your interest, I'll be glad to point you to others.\n \n If I might suggest, you may want to read some of the threads in this forum (and those that seem like they might be relevant in the Religion Forum) from the beginning, to get a \"sense of the room,\" so to speak: the attitudes and posting styles of the regulars here. (EasyRider, e.g., as you may have deduced already, is the resident your-son-is-going-to-hell megaphone-on-a-street-corner fundie fanatic.)\n \n Anyway, you're to be applauded for reaching beyond your preconceptions and questioning what others tell you. Good luck and welcome!\n \n (By the way, I'm a previously married--with 19-year-old son--professional, single gay man who came out at 45. Any questions you want to ask me about my own circumstances, I'll be happy to answer. :) )", 
   {}, 
   417365, 
   null, 
   1290194940.0
  ], 
  [
   417377, 
   null, 
   "Easyrider", 
   "Let me just address this for now. Would you seriously suggest that I put my son and others like him to death?\n\n \n That's the Old Covenant punishment, not the New Testament. \n \n Have you ever taught him to repent of any kind of sins?", 
   {}, 
   417374, 
   null, 
   1290205440.0
  ], 
  [
   417378, 
   null, 
   "Easyrider", 
   "\n \n If I might suggest, you may want to read some of the threads in this forum (and those that seem like they might be relevant in the Religion Forum) from the beginning, to get a \"sense of the room,\" so to speak: the attitudes and posting styles of the regulars here. (EasyRider, e.g., as you may have deduced already, is the resident your-son-is-going-to-hell megaphone-on-a-street-corner fundie fanatic.)\n \n\n \n Mr LA Wrong is the resident \"anything goes, sin all you want and God will never hold anyone accountable heretic.\" Satan would be proud to call him his friend. People like him lead others down the path to perdition all day long.\n \n And the truth is what Jesus (not me) says: &#8220;But unless you repent, you too will all perish.&#8221; - Luke 13:3\n \n &#8220;I told you that you would die in your sins; if you do not believe that I am the one I claim to be, you will indeed die in your sins.\" - John 8:24\n \n &#8220;Jesus answered, \"I am the way and the truth and the life. No one comes to the Father except through me.&#8221; - John 14:6\n \n WHAT JESUS CHRIST SAYS ABOUT HELL! \"fire\" Matt 7:19, 13:40, 25:41 \"everlasting fire\" Matt 18:8, 25:41 \"eternal damnation\" Mark 3:29 \"hell fire\" Matt 5:22, 18:9, Mark 9:47 \"damnation\" Matt 23:14, Mark 12:40, Luke 20:47 \"damnation of hell\" Matt 23:33 \"resurrection of damnation\" John 5:29 \"furnace of fire\" Matt 13:42, 50 \"the fire that never shall be quenched\" Mark 9:43, 45 \"the fire is not quenched\" Mark 9:44, 46, 48 \"Where their worm does not die\" Mark 9:44, 46, 48 \"wailing and gnashing of teeth\" Matt 13:42, 50 \"weeping and gnashing of teeth\" Matt 8:12, 22:13, 25:30 \"torments\" Luke 16:23 \"tormented in this flame\" Luke 16:24 \"place of torment\" Luke 16:28 \"outer darkness\" Matt 8:12, 22:13 \"everlasting punishment\" Matt 25:46\n \n And to counter the left wing Bible revisionists (many of whom are gay and try to twist the scriptures to legitimize gay sex sin), there's this:\n \n Responding to Pro Gay Theology (Scriptural Arguments):\n \n Responding to Pro-Gay Theology\n \n So, do you believe the Word of God and Jesus Christ or a pro-gay pundit (Mr LA Write) who has his own gay dog in the hunt?\n \n And where do you want your son to spend eternity?", 
   {}, 
   417375, 
   null, 
   1290205980.0
  ], 
  [
   417379, 
   null, 
   "Easyrider", 
   "Let me just address this for now. Would you seriously suggest that I put my son and others like him to death?\n\n \n Already answered.\n \n But my question to you: Did you read the scriptures provided? Would not even a 5th grade reading comprehension class understand from those passages that gay sex is not ok with God?", 
   {}, 
   417374, 
   null, 
   1290206220.0
  ], 
  [
   417383, 
   null, 
   "proudmom", 
   "Already answered.\n \n But my question to you: Did you read the scriptures provided? Would not even a 5th grade reading comprehension class understand from those passages that gay sex is not ok with God?\n\n \n You talk to God with that mouth? You are no more an authority on the Bible than anyone else. There are more than 50 English language interpretations of the Bible and I prefer to look into things more deeply than just reading some cherry picked scriptures taken out of context. Yes, I have more than a 5th grade reading comprehension, are you a 5th grader by any chance?", 
   {}, 
   417379, 
   null, 
   1290207600.0
  ], 
  [
   417385, 
   null, 
   "proudmom", 
   "MrWriteLA, I have been reading the links you provided and getting to the true meaning of scripture is what I am at here and you have pointed me in the right direction. Thanks!", 
   {}, 
   417383, 
   null, 
   1290208320.0
  ], 
  [
   417386, 
   null, 
   "Bennedict", 
   "hi proudmom, welcome to the forums.\n \n i think the bible is pretty clear that homosexuality is wrong, in the new and old testament. however, by modern day society's standpoint, about 50% of what the bible says is wrong, morally, so to base your life, worldview, opinions, arguments etc. on the bible in the literal sense, would be contributing to mass hatred among other hideous things. what i, and the other freethinkers on this board try to do is show people that the bible is not a valid resource for opinions. in the same way homosexuality is wrong in the bible, many other teachings are ignored by religious people on the basis that society has moved on. for some reason, the biblical teachings on homosexuality still rage to this day. i hope soon that opinion will be thrown into the vault of things-in-the-bible-religious-people-dont-believe-in-anymore with the other opinions such as selling your daughter to slavery and stoning children to death if they are disobedient.\n \n these are just my personal opinions, that if i were to have a gay son or daughter, i would definitely not turn to the bible for answers. nor would i teach him to repent his sins based on what the bible says - assuredly this means turning him from gay to straight... which is laughable.\n \n EDIT also, keep in mind this: read the things Easyrider says. they dont actually refer to homosexuality, but strictly gay sex. with your experience, you would know as well as anyone that that's not what homosexuality is. so that being said, my first statement - the bible is clear that homosexuality is wrong - may not even be correct. its gay sex the bible doesnt like.", 
   {}, 
   417383, 
   null, 
   1290208620.0
  ], 
  [
   417389, 
   null, 
   "Easyrider", 
   "MrWriteLA, I have been reading the links you provided and getting to the true meaning of scripture is what I am at here and you have pointed me in the right direction. Thanks!\n\n \n Just like I predicted. And I'm pretty sure from your screen name and the way you wrote your OP that you had already made up your mind before you did your first post. You've tried to pull off your little charade here but I had you pegged from the get-go.\n \n Nice try.", 
   {}, 
   417385, 
   null, 
   1290213480.0
  ], 
  [
   417390, 
   null, 
   "Easyrider", 
   "\n \n these are just my personal opinions, that if i were to have a gay son or daughter, i would definitely not turn to the bible for answers. nor would i teach him to repent his sins based on what the bible says - assuredly this means turning him from gay to straight... which is laughable.\n \n\n \n Bennedict, you're spiritually challenged, you deny Christ, and you have no clue what you're talking about.", 
   {}, 
   417386, 
   null, 
   1290213780.0
  ], 
  [
   417394, 
   null, 
   "Easyrider", 
   " I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n\n \n I don't believe anyone ever said that to you. I think you made that up just to try to diss traditional Christianity. I've been in churches all my life and have never heard anyone say you shouldn't ever have any questions about the Bible. Why do you think they have weekly Bible Studies and ask for questions?", 
   {}, 
   417365, 
   null, 
   1290217140.0
  ], 
  [
   417395, 
   null, 
   "proudmom", 
   "<Flush<\n \n Go tell it to your pet squid, woman. \n \n The only people buying into your kind of folly and endorsing gay sex sin in churches are the politically correct ninnies.\n \n You probably voted for that flaming left wing radical Obama too, so what would you know about anything, especially the Bible?\n\n \n What is your obsession with gay sex? From your first post you mentioned gay sex. I haven't mentioned it but you really seem hung up on it. If I had a pet squid I am sure I would enjoy speaking to it much more than you because it wouldn't talk in such a crude manner as you. Plus the added IQ of the squid over you would be a plus. I know enough about the Bible to know that you are not a person God is proud of. Work on your own salvation, you have a lot of work on your hands. \n Who I vote for is none of your business by the way. Your kind is a dying breed and we can all thank God for that! Don't expect to have a big fuzzy welcoming at the pearly gates, I certainly don't want you to be disappointed. Well, actually I really don't care.. <Flush< Back at ya!", 
   {}, 
   417383, 
   null, 
   1290217560.0
  ], 
  [
   417396, 
   null, 
   "Easyrider", 
   "\n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. \n\n \n Here's another one of your quirky statements that is disingenuous. Here, you are unsure about what the Bible says about homosexuality, but you are only confused about what the \"fundamentalists\" are teaching? And you're not the least bit concerned about what the politically correct liberals are telling you? If you don't know the Bible that well, why aren't you questioning the politically correct liberals as well? \n \n And then later, you just lapped up what Mr LA Write fed you in a New York minute without once again asking any questions. That's real special.\n \n \"For the time will come when men will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers (Mr LA Write) to say what their itching ears want to hear.\" - 2 Timothy 4:3\n \n Just another example of why your little charade didn't fool me.", 
   {}, 
   417365, 
   null, 
   1290217680.0
  ], 
  [
   417397, 
   null, 
   "proudmom", 
   "I don't believe anyone ever said that to you. I think you made that up just to try to diss traditional Christianity. I've been in churches all my life and have never heard anyone say you shouldn't ever have any questions about the Bible. Why do you think they have weekly Bible Studies and ask for questions?\n\n \n At this point I really don't care what you believe. I do not believe with blinders on like you for example. I do not believe the Bible to be without error. I do question however I was told that I should not.", 
   {}, 
   417394, 
   null, 
   1290217860.0
  ], 
  [
   417399, 
   null, 
   "Easyrider", 
   "At this point I really don't care what you believe. I do not believe with blinders on like you for example. I do not believe the Bible to be without error. I do question however I was told that I should not.\n\n \n I don't believe that for a minute. And anyone who has studied the Bible for any length of time knows there are various minor transmission errors (copyist errors involving numbers, etc.), but nothing that changes any fundamental Bibilcal truths.", 
   {}, 
   417397, 
   null, 
   1290218460.0
  ], 
  [
   417400, 
   null, 
   "proudmom", 
   "Here's another one of your quirky statements that is disingenuous. Here, you are unsure about what the Bible says about homosexuality, but you are only confused about what the \"fundamentalists\" are teaching? But you're not the least bit concerned about what the politically correct liberals are telling you? \n \n Just another example of why your little charade didn't fool me.\n\n \n Yes it is the fundamentalists that are the loudest and I do question their preaching and motives. I see a lot of hate in the fundamentalist point of view and I do seek the truth. I do not assume the truth lie with the fundamentalist without question. I am interested in the ORIGINAL meaning of the Bible. The meaning without bias. I am interested as to how one viewpoint can be correct with more than 50 English translations. As far as the fundamentalist point of view, I am interested what their motives are and if they are using their faith to obscure an issue they dislike. I am really interested in how they can dismiss so many parts of the Bible however scream foul when it comes to gays.", 
   {}, 
   417396, 
   null, 
   1290218460.0
  ], 
  [
   417401, 
   null, 
   "proudmom", 
   "I don't believe that for a minute. And anyone who has studied the Bible for any length of time knows there are various minor transmission errors (copyist errors involving numbers, etc.), but nothing that changes any fundamental Bibilcal truths.\n\n \n The Bible does contain error. Human error. This is fact and anyone that has studied the Bible in its original language can see this. Claiming otherwise is to simply be blind to the truth. Believing the Bible is without error explains a lot with you.", 
   {}, 
   417399, 
   null, 
   1290218640.0
  ], 
  [
   417405, 
   null, 
   "Bennedict", 
   "the worst you could do is feed the troll.\n \n EZ loves attention.", 
   {}, 
   417395, 
   null, 
   1290219240.0
  ], 
  [
   417408, 
   null, 
   "Easyrider", 
   "the worst you could do is feed the troll.\n \n EZ loves attention.\n\n \n I'm just thankful I don't have to spend eternity in the Pit with you spiritually-blinded Philistines.", 
   {}, 
   417405, 
   null, 
   1290220740.0
  ], 
  [
   417409, 
   null, 
   "Easyrider", 
   "Yes it is the fundamentalists that are the loudest and I do question their preaching and motives. I see a lot of hate in the fundamentalist point of view and I do seek the truth.\n\n \n Then read the New Testament and become a Biblical Christian instead of a politically correct Christ-denier. BTW, love speaks the truth, and people often consider the truth hate speech, which is really unfortunate.\n \n \n\n I am really interested in how they ('fundamentalists') can dismiss so many parts of the Bible however scream foul when it comes to gays.\n\n \n Give me your best example (scripture included) of something I would casually dismiss?", 
   {}, 
   417400, 
   null, 
   1290221040.0
  ], 
  [
   417411, 
   null, 
   "Ranb", 
   "So should we support the notion of slavery just because the bible does? Anyone who lives by exactly what the bible says is nuts.\n \n Ranb", 
   {}, 
   417395, 
   null, 
   1290221520.0
  ], 
  [
   417414, 
   null, 
   "Easyrider", 
   "So should we support the notion of slavery just because the bible does? Anyone who lives by exactly what the bible says is nuts. \n\n \n What part of 'Love your neighbor as you love yourself' do you argue supports slavery? \n \n After 2,000 years you folks still do not understand even the most basic teachings of Christianity, which makes you the nutty ones.", 
   {}, 
   417411, 
   null, 
   1290222360.0
  ], 
  [
   417415, 
   null, 
   "Easyrider", 
   "Believing the Bible is without error explains a lot with you.\n\n \n What did I just write you?\n \n \nOriginally Posted by Easyrider  \n And anyone who has studied the Bible for any length of time knows there are various minor transmission errors (copyist errors involving numbers, etc.), but nothing that changes any fundamental Bibilcal truths.\n\n \n As an example, can you tell me which so-called \"error\" invalidates the resurrection of Jesus Christ? It seems more and more apparent to me that you have not been a serious student of the Bible. You've probably done a superficial reading at best.", 
   {}, 
   417401, 
   null, 
   1290222600.0
  ], 
  [
   417421, 
   null, 
   "Bennedict", 
   "What part of 'Love your neighbor as you love yourself' do you argue supports slavery? \n \n After 2,000 years you folks still do not understand even the most basic teachings of Christianity, which makes you the nutty ones.\n\n \n what part of \"Love does a neighbor no harm\" dont you understand?\n \n gay love without gay sex seems to be acceptable in the bible - and to you apparently, since all of your anti-gay arguments are all about gay sex.", 
   {}, 
   417414, 
   null, 
   1290225060.0
  ], 
  [
   417428, 
   null, 
   "Easyrider", 
   "\n \n gay love without gay sex seems to be acceptable in the bible - and to you apparently, since all of your anti-gay arguments are all about gay sex.\n\n \n Hey - if you want to start a celibacy movement within the gay community I'll back you up on it. But you won't do that, will you? Because you want the gay sex part too. So don't give me any of your politically correct nonsense and expect it to fly.", 
   {}, 
   417421, 
   null, 
   1290264840.0
  ], 
  [
   417437, 
   null, 
   "proudmom", 
   "Give me your best example (scripture included) of something I would casually dismiss?\n\n \n I'll give you several. Now you must take these literally as they are the \"infallible Word of God\"\n \n \"Women should be silent in the churches, for they are not permitted to speak, but should be submissive, as the law also says.\" (1 Corinthians 14:34)\n \n \"Judge for yourselves: Is it proper for a woman to pray to God with her head uncovered? Does not even nature itself teach you that if a man has long hair it is a disgrace to him, but that if a woman has long hair, it is her glory? For her hair is given to her as a covering.\" (1 Corinthians 11:13-15)\n \n \"If any man takes a wife, and goes in on her, and detests her, and charges her with shameful conduct, and brings a bad name on her, and says, 'I took this woman, and when I came to her I found she was not a virgin...\" (Deuteronomy 22:13,14)\n \n \"But if ... evidences of virginity are not found for the young woman, then they shall bring out the young woman to the door of her father's house, and the men of her city shall stone her to death with stones...\" (Deuteronomy 22:20,21)\n \n \"If your hand causes you to sin, cut it off. It is better for you to enter into life maimed, rather than having two hands, to go to hell, into the fire that shall never be quenched.\" (Mark 9:43)\n \n \"One of illegitimate birth shall not enter the congregation of the Lord.\" (Deuteronomy 23:2)\n \n \"Slaves, obey your human masters with fear and trembling, in the sincerity of your heart, as to Christ.\"\n \n (Ephesians 6:5)\n \n \"Slaves, obey your human masters in everything; don't work only while being watched, in order to please men, but work wholeheartedly, fearing the Lord.\" (Colassians 3:22)\n \n \n \"Slaves are to be submissive to their masters in everything, and to be well-pleasing, not talking back .\" (Titus 2:9)\n \n \n \n \"Slaves, submit yourselves to your masters with all respect, not only to the good and gentle but also to the cruel. \" (1 Peter 2:18)", 
   {}, 
   417409, 
   null, 
   1290270660.0
  ], 
  [
   417441, 
   null, 
   "Easyrider", 
   "I'll give you several.\n\n \n I don't have time for a laundry list. I just asked for your best one and so I'll address your first one.\n \n \n\n Now you must take these literally as they are the \"infallible Word of God\"\n\n \n See, that's another thing that's wrong with your theology - buying into the \"we have to take everything literally\" trap. Another liberal invention about what we \"have to do.\" Anyone who has really studied the Bible knows you have to take things in context. There's metaphors, allegories, hyperbole, and all sorts of linguistic devices. \n \n \n\"Women should be silent in the churches, for they are not permitted to speak, but should be submissive, as the law also says.\" (1 Corinthians 14:34)\n \n \"Judge for yourselves: Is it proper for a woman to pray to God with her head uncovered? Does not even nature itself teach you that if a man has long hair it is a disgrace to him, but that if a woman has long hair, it is her glory? For her hair is given to her as a covering.\" (1 Corinthians 11:13-15)\n\n \n What role should women play at church?\n Should women keep quiet during church services?\n \n What role should women play at church?\n \n By the way, why didn't we see this passage from you?\n \n Ephesians 5:25 Husbands, love your wives, just as Christ loved the church and gave himself up for her 26 to make her holy, cleansing her by the washing with water through the word, 27 and to present her to himself as a radiant church, without stain or wrinkle or any other blemish, but holy and blameless. 28 In this same way, husbands ought to love their wives as their own bodies.\n \n Did Jesus treat the women with love and respect? Of course he did. Now get down on your knees and pray for him to come into your life and save you.\n \n Concerning slavery, there's this:\n \n Does God Approve of Slavery According to the Bible?\n \n Does God Approve of Slavery According to the Bible?\n \n No problem.\n \n But gay sex still remains a sin. You're not going to weasel your way around it.", 
   {}, 
   417437, 
   null, 
   1290278100.0
  ], 
  [
   417442, 
   null, 
   "proudmom", 
   "I don't have time for a laundry list. I just asked for your best one and so I'll address your first one.\n \n \n \n See, that's another thing that's wrong with your theology - buying into the \"we have to take everything literally\" trap. Another liberal invention about what we \"have to do.\" Anyone who has really studied the Bible knows you have to take things in context. There's metaphors, allegories, hyperbole, and all sorts of linguistic devices. \n \n \n \n What role should women play at church?\n Should women keep quiet during church services?\n \n What role should women play at church?\n \n By the way, why didn't we see this passage from you?\n \n Ephesians 5:25 Husbands, love your wives, just as Christ loved the church and gave himself up for her 26 to make her holy, cleansing her by the washing with water through the word, 27 and to present her to himself as a radiant church, without stain or wrinkle or any other blemish, but holy and blameless. 28 In this same way, husbands ought to love their wives as their own bodies.\n \n Did Jesus treat the women with love and respect? Of course he did. Now get down on your knees and pray for him to come into your life and save you.\n \n Concerning slavery, there's this:\n \n Does God Approve of Slavery According to the Bible?\n \n Does God Approve of Slavery According to the Bible?\n \n No problem.\n \n But gay sex still remains a sin. You're not going to weasel your way around it.\n\n \n You call others Biblical revisionists then you yourself do the EXACT SAME THING.. And why do we not have to take these verses literally but we must take verses that some claim to comdemn homosexuality literally? What a way to weasal out of that", 
   {}, 
   417441, 
   null, 
   1290281640.0
  ], 
  [
   417444, 
   null, 
   "Bennedict", 
   "Hey - if you want to start a celibacy movement within the gay community I'll back you up on it. But you won't do that, will you? Because you want the gay sex part too. So don't give me any of your politically correct nonsense and expect it to fly.\n\n \n i would rather you support that than be against gay people all together.\n \n i wont support it with you because its none of my business what happens in other people's bedrooms, and they should have the freedom to make love if they want to.\n \n you see, i can see your case for being againt the 'doin it' part, because its in the bible - something i dont follow, but others do. also, sex is a choice. sexual orientation is not.", 
   {}, 
   417428, 
   null, 
   1290283140.0
  ], 
  [
   417451, 
   null, 
   "MrWriteLA", 
   "The \"sex act\" objection is a sham.\n \n Even if two guys did nothing but hold hands and kiss and NOTHING ELSE, they'd strenuously object. Right, EZ?\n \n (The Bible, btw, has numerous instances of male-male kissing--NONE of which it claims are sinful. In fact, it has more instances of same-sex kissing than non-same-sex kissing. What are we to conclude from THAT?)\n \n It's like the procreation BS. We \"can't have kids\" and marriage is for procreation...\n \n Well, I procreated. Does that mean I get a pass for doing my \"duty,\" and can marry the man I love now?\n \n Don't make me laugh.", 
   {}, 
   417444, 
   null, 
   1290296580.0
  ], 
  [
   417478, 
   null, 
   "jazyjason", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.\n\n \n Hi proudmom. being an openly gay christian and being in the closet for 9 years and a victim of the dadt policy I can tell you that having a supporting mother like yourself is a blessing for your son. My mother who is currently in the hospital finally accepted me as being gay and actually made a facebook post to all her friends and her family saying how proud she is of me regardless of my orientation.\n \n needless to say it was a very sobering and heart felt moment when I read what she said. As far as what the bible says about homosexuality I have a great link here from a site headed by Mel White who is an openly gay pastor.\n \n there are a ton of resources available including forums to discuss specific questions. Hope it helps.\n \n What the Bible Says - And Doesn't Say - About Homosexuality\n \n Also ignore Easyrider. He's the biggest closet case on this board.....", 
   {}, 
   417365, 
   null, 
   1290324480.0
  ], 
  [
   417479, 
   null, 
   "jazyjason", 
   "I'm just thankful I don't have to spend eternity in the Pit with you spiritually-blinded Philistines.\n\n \n I REALLY hope the rapture comes for you soon Easy....", 
   {}, 
   417408, 
   null, 
   1290324660.0
  ], 
  [
   417496, 
   null, 
   "proudmom", 
   "Hi proudmom. being an openly gay christian and being in the closet for 9 years and a victim of the dadt policy I can tell you that having a supporting mother like yourself is a blessing for your son. My mother who is currently in the hospital finally accepted me as being gay and actually made a facebook post to all her friends and her family saying how proud she is of me regardless of my orientation.\n \n needless to say it was a very sobering and heart felt moment when I read what she said. As far as what the bible says about homosexuality I have a great link here from a site headed by Mel White who is an openly gay pastor.\n \n there are a ton of resources available including forums to discuss specific questions. Hope it helps.\n \n What the Bible Says - And Doesn't Say - About Homosexuality\n\n \n \n Thank you so much, I will definitelty check out the link. I have been provided so much great information on here I truly appreciate it. Thank you for what you say. I love my son as your mother loves you dearly. I am all for supporting him and his happiness and I am so happy that your mother has come around. I bet that was very emotional for you. I think that is wonderful!\n \n \n \nAlso ignore Easyrider. He's the biggest closet case on this board.....\n\n \n Thank you for the advise. Everyone on here has been so wonderful with one glaring exception.. I won't mention names.. emoticon_rolleyes", 
   {}, 
   417478, 
   null, 
   1290352500.0
  ], 
  [
   417517, 
   null, 
   "Easyrider", 
   "Originally Posted by jazyjason \n Also ignore Easyrider. He's the biggest closet case on this board.....\n\n \n You're the self-confessed homosexual around here, not me. No wonder you defend and promote illicit gay sex sin.\n \n I'm straight and always have been. \n \n So stop your lying, turkey.\n \n \njazyjason: Hi proudmom. being an openly gay christian and being in the closet for 9 years and a victim of the dadt policy I can tell you that having a supporting mother like yourself is a blessing for your son.\n\n \n So, you're the admitted closet dweller. That's real special, jazy. \n \n &#8220;Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.&#8221; - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n How do you like those apples?\n \n p.s. You claiming to be a Christian is like Madonna claiming to be a virgin. You never promote Jesus Christ, just your gay sex debauchery. If anyone wants to question that just look at all the pro-gay threads jazy started - virtually all of which are gay sex related intstead of being about Christ.", 
   {}, 
   417496, 
   null, 
   1290360420.0
  ], 
  [
   417559, 
   null, 
   "proudmom", 
   "[B]&#8220;Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.&#8221; - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n How do you like those apples?\n\n \n Boy there are a great percentage of heterosexuals engaging in sodomy. Seems they're is BIG trouble! Run for the hills!", 
   {}, 
   417517, 
   null, 
   1290388560.0
  ], 
  [
   417562, 
   null, 
   "MrWriteLA", 
   "Boy there are a great percentage of heterosexuals engaging in sodomy.\nIndeed:\n \n Anal sex - Wikipedia, the free encyclopedia\n \nA 2005 survey of the U.S. Centers for Disease Control and Prevention found a rising incidence of anal relations in the American heterosexual population. The survey showed that 40% of men and 35% of women between 25 and 44 had engaged in heterosexual anal sex; in 1992 a similar survey found that only 26% of men 18 to 59 and 20% of women 18 to 59 had. By way of comparison, seven times as many women as gay men engage in anal intercourse, a figure reflecting the greater overall heterosexual population.\n Another survey in 2008 focused on a much younger demographic of teens and young adults aged 15-21. It found that 16% of 1350 surveyed had had anal sex in the previous 3 months, with condoms being used 29% of the time. However, given the subject matter, the survey hypothesized the prevalence was probably underestimated.\n \n Figures for prevalence can vary amongst different demographics, regions, and nationalities. A 2001 French survey of five hundred female respondents concluded that a total of 29% had practiced anal sex, and one third of these claimed to have enjoyed the experience. In contrast, in a 1999 South Korean survey of 586 women, 3.5% of respondents reported having had anal sex.\n \n Figures for the prevalence of sexual behavior can also fluctuate over time. Edward O. Laumann's 1992 survey, reported in The Social Organization of Sexuality: Sexual Practices in the United States, found that about 20% of heterosexuals have engaged in anal sex. Sex researcher Alfred Kinsey, working in the 1940s, had found that number to be closer to 40% at the time. More recently, a researcher from the University of British Columbia in 2005 put the number of heterosexuals who have practiced anal sex at between 30% and 50%. According to Columbia University's health website, Go Ask Alice!: \"Studies indicate that about 25 percent of heterosexual couples have had anal sex at least once, and 10 percent regularly have anal penetration.\"\n", 
   {
    "unicode_changes_made": true
   }, 
   417559, 
   null, 
   1290389520.0
  ], 
  [
   417565, 
   null, 
   "Matthew S", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n \n \n I hope you can be of help. Thank you.\n\n \n First welcome\n \n Second do not listen to what the fundies have to say about homosexuality. Homosexuality is a great gift from God. Your son is very fortunate. Here are a few links you might be interested.\n \n Here is what the Leader of the ELCA has to say\n YouTube - It Gets Better: Bishop Mark Hanson, ELCA\n \n \n \n Would Jesus Discriminate? - David loved Jonathan more than women\n \n YouTube - The Truth About Homosexuality & The Bible 1 of 3\n YouTube - The Truth About Homosexuality & The Bible 2 of 3\n YouTube - The Truth About Homosexuality & The Bible 3 of 3\n \n And here is an anthem for him\n YouTube - Gloria Gaynor - I am What I am", 
   {}, 
   417365, 
   null, 
   1290393600.0
  ], 
  [
   417567, 
   null, 
   "Matthew S", 
   "I think you're ultimately going to defend gay sex regardless of what you see in the Bible, because of your son, but here's some of the scriptures anyway:\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n 1 Timothy 1:8-10 - \"But we know that the law is good if one uses it lawfully, knowing this: that the law is not made for a righteous person, but for the lawless and insubordinate, for the ungodly and for sinners, for the unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for fornicators, for sodomites, for kidnappers, for liars, for perjurers, and if there is any other thing that is contrary to sound doctrine...\"\n \n Jude 7 - \"In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire.\" \n \n There's no gay marriages in the Old Testament; No gay marriages in the New Testament; no gay sex approved anywhere in the Bible. Just the opposite - gay sex is condemned in both testaments. God is consistent on that.\n\n \n AND AS FOR YOU\n \n YouTube - How To Beat Your Slave", 
   {
    "unicode_changes_made": true
   }, 
   417369, 
   null, 
   1290394140.0
  ], 
  [
   417587, 
   null, 
   "jazyjason", 
   "You're the self-confessed homosexual around here, not me. No wonder you defend and promote illicit gay sex sin.\n \n I'm straight and always have been. \n \n So stop your lying, turkey.\n\n \n Your the one rushing to defend your heterosexuality Easy not I. If your strait then fine. maybe not the ideal strait person since you've divorced and who could blame your ex but whatever. \n \n I've also been meaning to ask you. Being a Vietnam Vet do you have anger issues? Or some sort of war inflicted injury? Seems to me your bitterness toward other people stems from such and your filling it with religion just like my father...\n \n \n \n \n So, you're the admitted closet dweller. That's real special, jazy. \n\n \n I'm not a closet dweller. I was in the closet since 12 or 13 roughly when I knew. had I any sense back then I would have came out, stopped being afraid and things would have been easier perhaps... Then again I may have been a homeless teen. I'll never know.\n \n Nevertheless, You attempting to somehow insult me on me being in the closet in one time in my life due to the very hateful message you preach is not only ironic, but stupid on your part.\n \n [QUOTE=Easyrider;417517&#8220;Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.&#8221; - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n How do you like those apples?[/QUOTE]\n \n They don't influence the Constitution and Jefferson is dead. You could quote the decree against gays by Heinrich Himmler and it would make no difference, just show the root of your anger toward gays is stooped in whatever means you can possibly express it.\n \n \n p.s. You claiming to be a Christian is like Madonna claiming to be a virgin. You never promote Jesus Christ, just your gay sex debauchery. If anyone wants to question that just look at all the pro-gay threads jazy started - virtually all of which are gay sex related intstead of being about Christ.\n\n \n Since when do I promote gay sex? Do I sell Astroglide on the boards? No. I promote equality and rights to all people garnered by what is in our Nation's Constitution. As a veteran I would assume you would understand this most basic principle but being a bitter individual against gays I assume too much.\n \n And you misconstrue gay rights with gay sex a typical misnomer with the fundamentalist crowd. If it's something that deals with people whom are different in sexuality its already assumed it's due to pure sexual drive. Not love but lust not caring but carnal.\n \n That is your flawed mindset Easy. And everyone on this board can see it and just rolls their eyes and move on...", 
   {}, 
   417517, 
   null, 
   1290405960.0
  ], 
  [
   417588, 
   null, 
   "jazyjason", 
   "Thank you so much, I will definitelty check out the link. I have been provided so much great information on here I truly appreciate it. Thank you for what you say. I love my son as your mother loves you dearly. I am all for supporting him and his happiness and I am so happy that your mother has come around. I bet that was very emotional for you. I think that is wonderful!\n\n \n Yeah it was emotional for me even more so since now shes in the hospital dealing with some serious health issues. I think she's been hiding medical issues from me and my family for some time and I guess she felt it time to just let go I suppose.\n \n \n \n \n \n \n \nThank you for the advise. Everyone on here has been so wonderful with one glaring exception.. I won't mention names.. emoticon_rolleyes\n\n \n Well that's the exception. There's always one sadly...", 
   {}, 
   417496, 
   null, 
   1290406440.0
  ], 
  [
   417596, 
   null, 
   "proudmom", 
   "Yeah it was emotional for me even more so since now shes in the hospital dealing with some serious health issues. I think she's been hiding medical issues from me and my family for some time and I guess she felt it time to just let go I suppose.\n\n \n I am so sorry to hear about your mothers health issues. I myself am 67 and have been through 5 open heart surgeries. You have your mothers love and I am sure she knows the unending love you have for her. You may be surprised as to how strong a person can be and how they can pull through especially when they have someone as special as you to live for.", 
   {}, 
   417588, 
   null, 
   1290429300.0
  ], 
  [
   417597, 
   null, 
   "Easyrider", 
   "\n \n That is your flawed mindset Easy. And everyone on this board can see it and just rolls their eyes and move on...\n\n \n Sounds like the 450 prophets of Baal who all thought alike. But the Great God of Creation, who clearly laid down the law in the Torah and elsewhere against gay sex relations, showed them the futility of their folly. \n \n When you die, your politically correct circus side-show goes down the proverbial commode. God is not fooled or mocked by it, and he will hold the carnal-minded crowd accountable at their Judgment. \n \n You can count on it, Jazy.", 
   {}, 
   417587, 
   null, 
   1290433800.0
  ], 
  [
   417615, 
   null, 
   "Ranb", 
   "What part of 'Love your neighbor as you love yourself' do you argue supports slavery? \n \n After 2,000 years you folks still do not understand even the most basic teachings of Christianity, which makes you the nutty ones.\n\n \n Basic teachings of Christianity? I was raised by my parents to know right from wrong. Even if their values resembled judeo-christian values does not make them christian values. I have a certain set of values that I live by. Promoting slavery and misogyny as is done in the bible are not the values I live by. People like to pick and choose what parts of the bible to live by; then tell me to live by their version which they call the \"christian\" or \"right way\" to live . This disgusts me.\n \n Ranb", 
   {}, 
   417414, 
   null, 
   1290473340.0
  ], 
  [
   417623, 
   null, 
   "Easyrider", 
   "Basic teachings of Christianity? I was raised by my parents to know right from wrong. Even if their values resembled judeo-christian values does not make them christian values. I have a certain set of values that I live by. Promoting slavery and misogyny as is done in the bible are not the values I live by. People like to pick and choose what parts of the bible to live by; then tell me to live by their version which they call the \"christian\" or \"right way\" to live . This disgusts me.\n Ranb\n\n \n You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?", 
   {}, 
   417615, 
   null, 
   1290478620.0
  ], 
  [
   417631, 
   null, 
   "proudmom", 
   "You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n\n \n I can help with that. \n \n Exodus 21:1-4 \"If thou buy an Hebrew servant, six years he shall serve: and in the seventh he shall go out free for nothing. If he came in by himself, he shall go out by himself: if he were married, then his wife shall go out with him. If his master have given him a wife, and she have born him sons or daughters; the wife and her children shall be her master's, and he shall go out by himself.\"\n \n Deuteronomy 15:12-18 \"And if thy brother, an Hebrew man, or an Hebrew woman, be sold unto thee, and serve thee six years; then in the seventh year thou shalt let him go free from thee.And when thou sendest him out free from thee, thou shalt not let him go away empty: Thou shalt furnish him liberally out of thy flock, and out of thy floor, and out of thy winepress: of that wherewith the Lord thy God hath blessed thee thou shalt give unto him.\"\n \n Exodus 21:7 \"And if a man sell his daughter to be a maidservant, she shall not go out as the menservants do.\"\n \n Exodus 21:20-21 \"And if a man smite his servant, or his maid, with a rod, and he die under his hand; he shall be surely punished. Notwithstanding, if he continue a day or two, he shall not be punished: for he is his money.\"\n \n Exodus 21:26-27 \"And if a man smite the eye of his servant, or the eye of his maid, that it perish; he shall let him go free for his eye's sake. And if he smite out his manservant's tooth, or his maidservant's tooth; he shall let him go free for his tooth's sake.\"\n \n Leviticus 25:44-46 \"Both thy bondmen, and thy bondmaids, which thou shalt have, shall be of the heathen that are round about you; of them shall ye buy bondmen and bondmaids. Moreover of the children of the strangers that do sojourn among you, of them shall ye buy, and of their families that are with you, which they begat in your land: and they shall be your possession. And ye shall take them as an inheritance for your children after you, to inherit them for a possession; they shall be your bondmen for ever: but over your brethren the children of Israel, ye shall not rule one over another with rigour.\"\n \n Leviticus 25:48-53 \"After that he is sold he may be redeemed again; one of his brethren may redeem him: Either his uncle, or his uncle's son, may redeem him, or any that is nigh of kin unto him of his family may redeem him; or if he be able, he may redeem himself. And he shall reckon with him that bought him from the year that he was sold to him unto the year of jubilee: and the price of his sale shall be according unto the number of years, according to the time of an hired servant shall it be with him.\"\n \n Genesis 17:13 \"He that is born in thy house, and he that is bought with thy money, must needs be circumcised: and my covenant shall be in your flesh for an everlasting covenant.\"\n \n Genesis 17:27 \"And all the men of his house, born in the house, and bought with money of the stranger, were circumcised with him.\"\n \n Deuteronomy 21:10-14 \"When thou goest forth to war against thine enemies, and the Lord thy God hath delivered them into thine hands, and thou hast taken them captive, And seest among the captives a beautiful woman, and hast a desire unto her, that thou wouldest have her to thy wife; Then thou shalt bring her home to thine house; and she shall shave her head, and pare her nails; And she shall put the raiment of her captivity from off her, and shall remain in thine house, and bewail her father and her mother a full month: and after that thou shalt go in unto her, and be her husband, and she shall be thy wife. And it shall be, if thou have no delight in her, then thou shalt let her go whither she will; but thou shalt not sell her at all for money, thou shalt not make merchandise of her, because thou hast humbled her.\"\n \n Deuteronomy 20:14 \"But the women, and the little ones, and the cattle, and all that is in the city, even all the spoil thereof, shalt thou take unto thyself\"\n \n Leviticus 19:20-22 \"And whosoever lieth carnally with a woman, that is a bondmaid, betrothed to an husband, and not at all redeemed, nor freedom given her; she shall be scourged; they shall not be put to death, because she was not free. And he shall bring his trespass offering unto the Lord, unto the door of the tabernacle of the congregation, even a ram for a trespass offering. And the priest shall make an atonement for him with the ram of the trespass offering before the Lord for his sin which he hath done: and the sin which he hath done shall be forgiven him.\"\n \n Deuteronomy 23:15-16 \"Thou shalt not deliver unto his master the servant which is escaped from his master unto thee: He shall dwell with thee, even among you, in that place which he shall choose in one of thy gates, where it liketh him best: thou shalt not oppress him.\"\n \n Numbers 31:28-47 \"And levy a tribute unto the Lord of the men of war which went out to battle: one soul of five hundred, both of the persons, and of the beeves, and of the asses, and of the sheep: Take it of their half, and give it unto Eleazar the priest, for an heave offering of the Lord. And of the children of Israel's half, thou shalt take one portion of fifty, of the persons, of the beeves, of the asses, and of the flocks, of all manner of beasts, and give them unto the Levites, which keep the charge of the tabernacle of the Lord.\"\n \n Mark 14:66 \"And as Peter was beneath in the palace, there cometh one of the maids of the high priest.\"\n \n Exodus 21:8 \"If she please not her master, who hath betrothed her to himself, then shall he let her be redeemed: to sell her unto a strange nation he shall have no power, seeing he hath dealt deceitfully with her. And if he have betrothed her unto his son, he shall deal with her after the manner of daughters. If he take him another wife; her food, her raiment, and her duty of marriage, shall he not diminish. And if he do not these three unto her, then shall she go out free without money.\"\n \n Leviticus 25:39 \"And if thy brother that dwelleth by thee be waxen poor, and be sold unto thee; thou shalt not compel him to serve as a bondservant: But as an hired servant, and as a sojourner, he shall be with thee, and shall serve thee unto the year of jubilee: And then shall he depart from thee, both he and his children with him, and shall return unto his own family, and unto the possession of his fathers shall he return.\"\n \n \n Exodus 21:16 \"And he that stealeth a man, and selleth him, or if he be found in his hand, he shall surely be put to death.\"\n \n Deuteronomy 24:7 \"If a man be found stealing any of his brethren of the children of Israel, and maketh merchandise of him, or selleth him; then that thief shall die; and thou shalt put evil away from among you.\"\n \n II Kings 4:1 \"Now there cried a certain woman of the wives of the sons of the prophets unto Elisha, saying, Thy servant my husband is dead; and thou knowest that thy servant did fear the Lord: and the creditor is come to take unto him my two sons to be bondmen.\"\n \n Exodus 20:10 \"But the seventh day is the Sabbath of the Lord thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates.\"\n \n And on to the New Testament:\n \n 1 Corinthians 12:13 \"For by one Spirit are we all baptized into one body, whether we be Jews or Gentiles, whether we be bond or free; and have been all made to drink into one Spirit.\"\n \n Galatians 3:28 \"There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus.\"\n \n Colossians 3:11 \"Where there is neither Greek nor Jew, circumcision nor uncircumcision, Barbarian, Scythian, bond nor free: but Christ is all, and in all.\"\n \n \n How did you say it? Anyone with a 5th grade reading comprehension could clearly see that it DOES support slavery. Your turn to \"revise\".", 
   {}, 
   417623, 
   null, 
   1290483600.0
  ], 
  [
   417637, 
   null, 
   "jitobear", 
   "I'm just thankful I don't have to spend eternity in the Pit with you spiritually-blinded Philistines.\n\n \n And I am thankful I don't have to spend it with self-rightous blow-hards.\n \n \"Go heaven for the climate, hell for the company.\"\n ~Mark Twain", 
   {}, 
   417408, 
   null, 
   1290487440.0
  ], 
  [
   417644, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n\n \n \nI can help with that.\n\n \n No, you didn't even get close.\n \n I previously gave you a link on slavery and obviously you shined it on like you do the passages condemning the practice of gay sex.\n \n As for the New Testament, Jesus didn't come to overthrow Rome and end slavery from the outside. He came to change men's hearts so they wouldn't enslave their fellow man and do evil. Obviously that is lost on you.\n \n It just shows again that you will try any argument in seeking to defend illicit gay sex sin. \n \n Jitobear -\n \n Re. your last post to me: <Flush<", 
   {}, 
   417631, 
   null, 
   1290520260.0
  ], 
  [
   417645, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n\n \n \nI can help with that.\n \n \n This time, why don't you actually read the quote from Jesus that I provided and address it specifically:\n \n What part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n \n Just address the quote itself now, ok? Just the quote? \n \n Then tie it into the \"Two Greatest Laws.\" What are the two greatest laws? How did Jesus answer that?", 
   {}, 
   417631, 
   null, 
   1290521160.0
  ], 
  [
   417651, 
   null, 
   "proudmom", 
   "This time, why don't you actually read the quote from Jesus that I provided and address it specifically:\n \n What part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n \n Just address the quote itself now, ok? Just the quote? \n \n Then tie it into the \"Two Greatest Laws.\" What are the two greatest laws? How did Jesus answer that?\n\n \n How can I possibly address that specific quote when God contradicts that very statement in so many ways? \n \n It virtually renders the passage null.", 
   {}, 
   417645, 
   null, 
   1290534180.0
  ], 
  [
   417654, 
   null, 
   "MrWriteLA", 
   "Apparently, \"taking the Bible literally\" means you are allowed to take ONE passage at face value at any given moment... ignoring context and all other passages... to make a cheap debating point. After which you are free to switch to any OTHER passage, even (or especially) if it contradicts the previous one.\n \n I get it now.", 
   {}, 
   417651, 
   null, 
   1290537300.0
  ], 
  [
   417668, 
   null, 
   "Easyrider", 
   "How can I possibly address that specific quote when God contradicts that very statement in so many ways? \n \n It virtually renders the passage null.\n\n \n Not at all.\n \n From Matthew 22:\n \n The Greatest Commandment\n \n 34 Hearing that Jesus had silenced the Sadducees, the Pharisees got together. 35 One of them, an expert in the law, tested him with this question: 36 \"Teacher, which is the greatest commandment in the Law?\" \n \n 37 Jesus replied: \"'Love the Lord your God with all your heart and with all your soul and with all your mind.' 38 This is the first and greatest commandment. 39 And the second is like it: 'Love your neighbor as yourself.' 40 All the Law and the Prophets hang on these two commandments.\" \n \n Here's some other info that addresses your superficial understandings of slavery in the Bible.\n \n Does God Approve of Slavery According to the Bible?\n \n http://christianthinktank.com/qnoslave.html\n \n Recommend you read it this time.", 
   {
    "unicode_changes_made": true
   }, 
   417651, 
   null, 
   1290557280.0
  ], 
  [
   417669, 
   null, 
   "Easyrider", 
   "Apparently, \"taking the Bible literally\" means you are allowed to take ONE passage at face value at any given moment... ignoring context and all other passages... to make a cheap debating point. After which you are free to switch to any OTHER passage, even (or especially) if it contradicts the previous one.\n \n I get it now.\n\n \n No you don't. You're one of the ones who twists and distorts scripture in order to try to legitimize illicit gay sex sin. \n \n Well, God isn't fooled. Some of the heathens are, but God isn't. And there's going to be the devil to pay at the Judgment.", 
   {}, 
   417654, 
   null, 
   1290557400.0
  ], 
  [
   417674, 
   null, 
   "smiley", 
   "You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n\n The answer to this is easy (no pun intended).\n \n That part of the bible does not support slavery, but other parts do.\n \n Told you!", 
   {}, 
   417623, 
   null, 
   1290561900.0
  ], 
  [
   417677, 
   null, 
   "Ranb", 
   "You didn't answer the question. \n \n Once again, what part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n\n \n Don't know, sure as hell don't care. You answer the question if you need an answer. The quotes from the bible above sure do not condemn slavery. Why do you think that is?\n \n Ranb", 
   {}, 
   417623, 
   null, 
   1290565020.0
  ], 
  [
   417744, 
   null, 
   "pappillion001", 
   "This time, why don't you actually read the quote from Jesus that I provided and address it specifically:\n \n What part of 'Love your neighbor as you love yourself' do you argue supports slavery?\n \n Just address the quote itself now, ok? Just the quote? \n \n Then tie it into the \"Two Greatest Laws.\" What are the two greatest laws? How did Jesus answer that?\n\n \n Ok let's explore that since it is so prominent in your mind right now. Love your neighbor as you love yourself. This being from Jesus so it would be safe to say this overrides any potential conflict with any interpretation attributed to an Apostle, without hearing you whine about they are all in agreement please.\n \n So you are to love yourself first, you can not conclude Jesus expected a person who disliked themselves would be justified by scripture to dislike eveyone else. So loving yourself despite what you are, which is a sinner and you always will be, you manage to get through each day without throwing your miserable carcass in fronnt of a train. You manage to accept what you see as your failings even though they persist and some of which are the result of nothing intentional just who you are. God, we are told accepts those short comings, he may not like them but he gets over it, which is not to say he condones it, but it isn't enough in his eyes to have held back salvation for everybody who wants it. This includes you being a sinner. So if you can love yourself despite your sins and Jesus expects others to love you despite your sins and you claim to respect Jesus as your Lord why do you disregard his commandment to love your neighbor as your self because your neighbor happens to through no fault of his own be gay? I don't suppose you purposely go out and sin, but you do because it is who you are. Jesus never says anything about gay people, he never says, even when angered speaks of a particular group as being ineligible, well actually he says stay away from the Gentiles, but we will just pretend he didn't mean it. When Jesus says love your neighbor did he condition it on a certain type of behavior or belief? No because if he did you would still be worshiping one of a dozen different Gods sacrificing goats in the mountains and leaving corn nuts around the tree in your front yard.\n \n Now if you don't love yourself and think because a sinner is who you are and understanding Jesus in a way that makes you better than someone else then you have the correct attitude and can disregard all the above and I will see you in the pit save me some marshmallows. Otherwise do what your Lord told you to do the way he told you to do it and stop whining. I am sure Jesus somewhere spoke about judging others, something about it being God's responsibility and not in your job description. Remember Genesis man was made to be the gardener in Eden so don't get ahead of yourself, ther sport.", 
   {}, 
   417645, 
   null, 
   1290677640.0
  ], 
  [
   418246, 
   null, 
   "northwestmom", 
   "You talk to God with that mouth? You are no more an authority on the Bible than anyone else. There are more than 50 English language interpretations of the Bible and I prefer to look into things more deeply than just reading some cherry picked scriptures taken out of context. Yes, I have more than a 5th grade reading comprehension, are you a 5th grader by any chance?\n\n \n You were the one asking about what the scriptures say about homosexuality! Dont get so defensive because the obvious truth has been revealed. I have 2 sons, who I love very much, but I would not condone homosexuality, the Bibe speaks about it so clearly, it really couldnt be anymore clear. It is unatural and it is not what God created. Love your son, but continue to pray for him and with him because homosexuality is a demon.", 
   {}, 
   417383, 
   null, 
   1291323480.0
  ], 
  [
   418248, 
   null, 
   "northwestmom", 
   "hi proudmom, welcome to the forums.\n \n i think the bible is pretty clear that homosexuality is wrong, in the new and old testament. however, by modern day society's standpoint, about 50% of what the bible says is wrong, morally, so to base your life, worldview, opinions, arguments etc. on the bible in the literal sense, would be contributing to mass hatred among other hideous things. what i, and the other freethinkers on this board try to do is show people that the bible is not a valid resource for opinions. in the same way homosexuality is wrong in the bible, many other teachings are ignored by religious people on the basis that society has moved on. for some reason, the biblical teachings on homosexuality still rage to this day. i hope soon that opinion will be thrown into the vault of things-in-the-bible-religious-people-dont-believe-in-anymore with the other opinions such as selling your daughter to slavery and stoning children to death if they are disobedient.\n \n these are just my personal opinions, that if i were to have a gay son or daughter, i would definitely not turn to the bible for answers. nor would i teach him to repent his sins based on what the bible says - assuredly this means turning him from gay to straight... which is laughable.\n \n EDIT also, keep in mind this: read the things Easyrider says. they dont actually refer to homosexuality, but strictly gay sex. with your experience, you would know as well as anyone that that's not what homosexuality is. so that being said, my first statement - the bible is clear that homosexuality is wrong - may not even be correct. its gay sex the bible doesnt like.\n\n \n what?? lol. The Bible teaches against \"unatural relations\" the romantic desires between people of the same sex, God created male and female to become one flesh when they fall inlove and get married, that is why it is only male and female who can make children. You cant make a child with only sperm (two men having sex) or with only female eggs (2 women having sex) It takes both sperm and egg to make a child. That alone should tell you that homosexuality is unatural even if you dont belive the Bible. The world will change, the ways of the world and peoples ideas will change, but the word of God never changes. What will be next, will having sex with animals be legal next and then allowing a human and an animal equal relationship rights??", 
   {}, 
   417386, 
   null, 
   1291324260.0
  ], 
  [
   418251, 
   null, 
   "northwestmom", 
   "[QUOTE=Bennedict;417421]what part of \"Love does a neighbor no harm\" dont you understand?\n \n gay love without gay sex seems to be acceptable in the bible - and to you apparently, since all of your anti-gay arguments are all about gay sex.[/QUOT\n \n Homosexual is the unatural desires for a person of the same sex, weather they get into bed together or not, if one has a burning, lustful desire for someone of the same sex, that is homosexuality and having unatural feelings that God does NOT intend! Please dont try and twist scripture, because as much as you try, you will never succeed, God's word is very clear on the subject!!", 
   {}, 
   417421, 
   null, 
   1291325160.0
  ], 
  [
   418253, 
   null, 
   "northwestmom", 
   "You call others Biblical revisionists then you yourself do the EXACT SAME THING.. And why do we not have to take these verses literally but we must take verses that some claim to comdemn homosexuality literally? What a way to weasal out of that\n\n \n How can you not take what the Bible says about homosexuality literally?? It is all through the Bible, not just one isolated verse. Again, as I have stated so many times, if it was so natural to be gay, why cannot two men make a baby or two women make a baby, I will tell you why, because it goes against nature! It is not the way God made things to be. Can you put a lock into another lock to open a door?? NO! You need a key, two seperate, different things, that are made to fit together. Im so glad we have a wise God who knows best, and that God doesnt tell us to depend on clueless, confused people, but to depend on HIM!", 
   {}, 
   417442, 
   null, 
   1291325700.0
  ], 
  [
   418278, 
   null, 
   "Easyrider", 
   "\n \n Homosexual is the unatural desires for a person of the same sex, weather they get into bed together or not, if one has a burning, lustful desire for someone of the same sex, that is homosexuality and having unatural feelings that God does NOT intend! Please dont try and twist scripture, because as much as you try, you will never succeed, God's word is very clear on the subject!!\n\n \n Amen. Welcome to the fray!", 
   {}, 
   418251, 
   null, 
   1291334940.0
  ], 
  [
   418299, 
   null, 
   "jazyjason", 
   "\n \n \n Homosexual is the unatural desires for a person of the same sex, weather they get into bed together or not, if one has a burning, lustful desire for someone of the same sex, that is homosexuality and having unatural feelings that God does NOT intend! Please dont try and twist scripture, because as much as you try, you will never succeed, God's word is very clear on the subject!!\n\n \n Wrong. Homosexual desire is not unnatural. Secondly over 1500 species in the animal kingdom have had homosexual acts or relationships that have been well documented. So your whole \"procreation\" theory is bunk.\n \n Also how do you know what God intends? Or perhaps it is your interpretation of scripture at face value hence the fallacy of being a literalist that plagues your opinion.\n \n And please do not try and twist scripture to demonize and slander people you know nothing about except through Pat Robertson attack ads and Maggie Gallagher newsletters....", 
   {}, 
   418251, 
   null, 
   1291347720.0
  ], 
  [
   418300, 
   null, 
   "Bottom Feeder", 
   "How can you not take what the Bible says about homosexuality literally?? It is all through the Bible, not just one isolated verse. Again, as I have stated so many times, if it was so natural to be gay, why cannot two men make a baby or two women make a baby, I will tell you why, because it goes against nature! It is not the way God made things to be. Can you put a lock into another lock to open a door?? NO! You need a key, two seperate, different things, that are made to fit together. Im so glad we have a wise God who knows best, and that God doesnt tell us to depend on clueless, confused people, but to depend on HIM!\n\n \n The only thing I have to say is that there is no heterosexual person in the world that can understand what it means to be a homosexual and everytime I see a post like this I start to cringe. Sexuality is such a small part of who a person is, but some just can't get past the physical expressions of love/lust.\n \n The Bible is not the source that I go to to figure out what is natural in the world. Especially when a talking burning bush is a key player of the story...\n \n But you gotta love fiction. They had some imagination back then!", 
   {}, 
   418253, 
   null, 
   1291347780.0
  ], 
  [
   418323, 
   null, 
   "Matthew S", 
   "what?? lol. The Bible teaches against \"unatural relations\" the romantic desires between people of the same sex, God created male and female to become one flesh when they fall inlove and get married, that is why it is only male and female who can make children. You cant make a child with only sperm (two men having sex) or with only female eggs (2 women having sex) It takes both sperm and egg to make a child. That alone should tell you that homosexuality is unatural even if you dont belive the Bible. The world will change, the ways of the world and peoples ideas will change, but the word of God never changes. What will be next, will having sex with animals be legal next and then allowing a human and an animal equal relationship rights??\n\n \n So then I assume you are going to carry out your God's literal word as stated in Levicus 20:13. I assume you are personally calling for our executions and that you will start doing them yourself if government refuses to accept your Jewish fairy tale book as law?\n \n Your God calls you to execute gay people when are you going to start? After all how did you put it \" The world will change, the ways of the world and peoples ideas will change, but the word of God never changes\"", 
   {}, 
   418248, 
   null, 
   1291387200.0
  ], 
  [
   418610, 
   null, 
   "Dominique_Marie", 
   "I think you're ultimately going to defend gay sex regardless of what you see in the Bible, because of your son, but here's some of the scriptures anyway:\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n 1 Timothy 1:8-10 - \"But we know that the law is good if one uses it lawfully, knowing this: that the law is not made for a righteous person, but for the lawless and insubordinate, for the ungodly and for sinners, for the unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for fornicators, for sodomites, for kidnappers, for liars, for perjurers, and if there is any other thing that is contrary to sound doctrine...\"\n \n Jude 7 - \"In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire.\" \n \n There's no gay marriages in the Old Testament; No gay marriages in the New Testament; no gay sex approved anywhere in the Bible. Just the opposite - gay sex is condemned in both testaments. God is consistent on that.\n\n \n I am sorry to step into this, but to be honest, the bible is not to matter to the whole world, and, if the bible can be misinterpreted to match other religions, then why are we listening to it?\n \n ALSO, God forgives us for our sins. HE MADE US THIS WAY! AS HE MADE GAYS. WE SHOULD ACCEPT THOSE WHO GOD WELCOMES AS HIS KIDS, \"Jesus loves the little children, ALL of the children of the world\" Except gays? i think not.\n \n another thing, about the gay marriage issue.. RELIGION IS NOT TO BE INVOLVED WITH LAW MAKING. \"congress shall make no law respecting an establishment of religion or prohibiting the free exercises thereof.\" Thomas Jefferson thought of this as a \"wall of separation between church and state.\" \n \n also, the civil liberties it is denying, which All Americans should have, being equal and all, \"Freedoms to think and act without fear of unfair treatment. \"\n yet, we are being denied to express ourselves freely, which may not be completely stated as part of freedom of speech, but should be. this is because: freedom of speech INCLUDES freedom of music, art, and clothing... so pretty much freedom of expression. freedom of expression should include expressing who we love. and freedom to love should have freedoms to wed to any gender.", 
   {
    "unicode_changes_made": true
   }, 
   417369, 
   null, 
   1291700340.0
  ], 
  [
   418612, 
   null, 
   "Dominique_Marie", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.\n\n \n \n << Matthew 26 <<\n New American Standard Bible \n \n -------------------------------------------------------------------------49Immediately Judas went to Jesus and said, \"Hail, Rabbi!\" and kissed Him. 50And Jesus said to him, \"Friend, do what you have come for.\" Then they came and laid hands on Jesus and seized Him. \n 51And behold, one of those who were with Jesus reached and drew out his sword, and struck the slave of the high priest and cut off his ear. 52Then Jesus said to him, \"Put your sword back into its place; for all those who take up the sword shall perish by the sword. 53\"Or do you think that I cannot appeal to My Father, and He will at once put at My disposal more than twelve legions of angels? \n \n \n \n \n \n IT SPECIFICALLY STATES THAT AFTER JUDAS, WHOM YES, WAS A TRAITOR, HAD KISSED JESUS, JESUS HAD STILL CALLED HIM FRIEND. Jesus was not afraid for his father would accept it, his father had set it all up. Judas was all part of the incident, where god had spoke to him also.. obviously god shouldn't be against gays, if he is alright with Judas kissing Jesus.", 
   {
    "post_info": {
     "post_title": "Judas kissed jesus with no remorse"
    }, 
    "unicode_changes_made": true
   }, 
   417365, 
   null, 
   1291702560.0
  ], 
  [
   418613, 
   null, 
   "Dominique_Marie", 
   "hello proudmom. thank you for supporting gays.. i would like to say one last thing though,\n \n God made us who we are, we should accept who we are rather than change it.\n times have changed, and god's word will also, but first, we should accept who we are so others can, tell your son that just because other's will not accept certain things, out of ignorance, that doesnt mean we should have to stop living the wonderful life that god has given us. and personally, i may not talk to god, but i know he will welcome us, even if others consider it a sin to show love towards another of the same gender, god will welcome us as his children..\n \n another thing, i believe adam and eve got killed off for not listening about the forbidden fruit on the forbidden tree... so why all this talk of \"adam and eve not adam and steve\"?\n obviously adam and eve did not work out.\n \n and there is over population as it is, the world should be welcoming gays as our saviors, they are saving this world from HAVING to kill off humans. we are to be welcomed into the world. god loves everyone. it is a sin to hate\n 1 John 3:15 \n Anyone who hates another brother or sister is really a murderer at heart. And you know that murderers don't have eternal life within them.\n \n so god does NOT hate gays, he may not be all for them, but does not hate them for their sexual orientations.\n \n A true act of love is treating someone with respect and kindness even though he/she knows you do not approve of his lifestyle and/or choices. It is not loving to allow a person to remain stuck in sin.\n \n so why is it we are not following through on our true acts of love? love is love, no matter what genders, and love, wether physically or emotionally, should be able to be shown.\n love can be between family and friends, showing emotional love and support.\n or towards a lover, this does not change on gender of lovers, but should be able to be shown physically, with the connection outside of households.\n \n yes i understand that straight people may not want to see 2 people of the same gender having intercourse, but we can not stop what is behind closed doors, i do not believe they're doing this in public, so let them be..\n \n the homosexuals of the world have to endure not having a life long partner, and the heterosexuals get to show all of the love they want to their partner.. married or not.\n homosexuals dont even have the option to marry. so they should have the same rights, holding hands, kissing, hugging, making out.\n we have to endure the straight people doing these actions, like making out, everyday.\n yet straights can not even bare to be alright with a peck on the lips from two of the same gender.. unless it is to be some one who is alright with their opposite gender kissing for t.v. or movies.. but never the same?\n \n \n to be honest, i am a 15 year old. and i am bisexual, i prefer girls and am, myself a girl.. at school, i am not allowed to hug or hold hands with my girlfriend, but the opposite gender couples are making out and the school district doesn't say a thing to them.\n \n i am taking a stand for what i believe in, and i have a petition at school.\n even religious straight females and males have agreed and signed the petition that gays should have EVERY right as straights, including marriage.\n my bestfriend is straight and she supports it all.\n \n everyone is just worried about the possibility of being raped by someone of the same gender. but.. in all actuallity, its unfair to make such judgements just based on sexual orientation. \n \n thank you for your time.", 
   {
    "post_info": {
     "post_title": "ProudMom, i support your son, and i hope to get support in return."
    }, 
    "unicode_changes_made": true
   }, 
   417365, 
   null, 
   1291703820.0
  ], 
  [
   418623, 
   null, 
   "Bennedict", 
   "to be honest, i am a 15 year old. and i am bisexual, i prefer girls and am, myself a girl.. at school, i am not allowed to hug or hold hands with my girlfriend, but the opposite gender couples are making out and the school district doesn't say a thing to them.\n \n i am taking a stand for what i believe in, and i have a petition at school.\n even religious straight females and males have agreed and signed the petition that gays should have EVERY right as straights, including marriage.\n my bestfriend is straight and she supports it all.\n\n \n this makes me very happy. you youths can be quite smart if you try :p\n \n welcome to the forums - tread carefully.", 
   {}, 
   418613, 
   null, 
   1291707540.0
  ], 
  [
   418629, 
   null, 
   "MrWriteLA", 
   "Meaning: expect EasyRider and Zorba to trash you before the sun comes up... cuz that's the kind of \"Christians\" they are.\n \n But allow me to extend my welcome to you as well. :)", 
   {}, 
   418623, 
   null, 
   1291719600.0
  ], 
  [
   418651, 
   null, 
   "Dominique_Marie", 
   "this makes me very happy. you youths can be quite smart if you try :p\n \n welcome to the forums - tread carefully.\n\n \n \nMeaning: expect EasyRider and Zorba to trash you before the sun comes up... cuz that's the kind of \"Christians\" they are.\n \n But allow me to extend my welcome to you as well. :)\n\n \n thank you both for welcoming. and to be honest.. i have researched many MANY things. this came to my attention... the bible says that god loves all of his children, sinners, and non-sinners.\n he also said he had his son die on the cross for sinners, if we are who god made us, we should accept that.. and accept god's gifts.\n the world can not make decisions for individuals. the freedom we are to have, is supposed to support this. freedom of speach does not include libel and slander. which i have also seen plenty enough of. this world is supposed to accept individuality, but by denying rights like the right to love and the right to show who you love, hurts more than Lesbian, Gay, Bisexual and Transxual communities. (LGBT) it hurts those who support the LGBT communities also.\n my family raised me to accept and we shall be accepted in return, that isnt the case here... we are accepting straight people. but are not being accepted for who we are.\n \n i am sorry, but i honestly think that this world is just trying to start wars and get what certain people want.. the U.S. is to be equal, and equal it shall be.\n if only every one will accept differences and respect them as well.\n \n thank you two for supporting me, and my decisions. and the facts and statistics that can be proven.\n \n i just wish this world were full of peace rather than war. thats what the U.S. has said we are fighting for, but first, we should make peace a part of the U.S. instead of worrying about other countries. our world does need more peace. our society needs more respect. and our people need more acceptance.\n i am just proving this information.\n \n thank you for your time. (:", 
   {
    "post_info": {
     "post_title": "welcomes and more of my opinion."
    }
   }, 
   418629, 
   null, 
   1291766880.0
  ], 
  [
   418657, 
   null, 
   "Easyrider", 
   "Meaning: expect EasyRider and Zorba to trash you before the sun comes up... cuz that\\'s the kind of \"Christians\" they are.\n \n\n \n Look who\\'s doing the trashing - Mr Write LA!", 
   {}, 
   418629, 
   null, 
   1291773840.0
  ], 
  [
   418658, 
   null, 
   "Easyrider", 
   " I am sorry to step into this, but to be honest, the bible is not to matter to the whole world, and, if the bible can be misinterpreted to match other religions, then why are we listening to it?\n\n \n The Bible is clear - gay sex is a sin. \n \n \n ALSO, God forgives us for our sins.\n\n \n You have to repent of your sins and renounce them. You have to receive Christ as your Lord and Savior for the remission of your sins. You just can\\'t sin like the devil and expect God\\'s favor.\n \n \n \n \n HE MADE US THIS WAY! \n\n \n He told people not to engage in gay sex.\n \n \n RELIGION IS NOT TO BE INVOLVED WITH LAW MAKING. \"congress shall make no law respecting an establishment of religion or prohibiting the free exercises thereof.\" Thomas Jefferson thought of this as a \"wall of separation between church and state.\" \n\n \n You don\\'t get to make the rules. And Thomas Jefferson said sodomy was a punishable crime.", 
   {}, 
   418610, 
   null, 
   1291774200.0
  ], 
  [
   418665, 
   null, 
   "Accipiter", 
   "The Bible is clear - gay sex is a sin. \n \n \n \n You have to repent of your sins and renounce them. You have to receive Christ as your Lord and Savior for the remission of your sins. You just can\\'t sin like the devil and expect God\\'s favor.\n \n \n \n He told people not to engage in gay sex.\n \n \n \n You don\\'t get to make the rules. And Thomas Jefferson said sodomy was a punishable crime.\n\n \n Is there such a thing as a gayophile?\n \n Could ez be one?", 
   {}, 
   418658, 
   null, 
   1291778100.0
  ], 
  [
   418668, 
   null, 
   "Easyrider", 
   "So then I assume you are going to carry out your God\\'s literal word as stated in Levicus 20:13. \n\n \n Regarding punishment? \n \n That\\'s dumb, Matthew. You always ignore the New Testament, despite having been told over and over again.", 
   {}, 
   418323, 
   null, 
   1291778400.0
  ], 
  [
   418669, 
   null, 
   "Dominique_Marie", 
   "The Bible is clear - gay sex is a sin. \n \n \n \n You have to repent of your sins and renounce them. You have to receive Christ as your Lord and Savior for the remission of your sins. You just can't sin like the devil and expect God's favor.\n \n \n \n He told people not to engage in gay sex.\n \n \n \n You don't get to make the rules. And Thomas Jefferson said sodomy was a punishable crime.\n\n \n in the constitution it states that religion is not to be involved with law.\n i understand you have to ask god for his savings, but god made us this way. we can not change just because we want to. and thats assuming we want to.\n he may have told people not to engage in gay sex.. but did i say anything about sex?! i said what happens behind closed doors is none of our concern.\n thomas jefferson may have said such things, but i recall you trying to turn facts around on me.. so this is not about thomas jefferson making the rules, this is about god and his rules.\n another question.. does the bible flat out quote \"gay sex is a sin?\"\n and a comment: the bible was written by man, who thought he had heard an angel, god's messanger talking to him.\n from the lack of certain materials of past timings.. how are we to be sure this man did not make up the whole thing or was even just crazy?! once one man is crazy, they can make others to that same point if the vulnerability is that open.\n \n i'm sorry if you dont accept anyone of the LGBT community, but i am all for it, and i am a participant, to hear libel and slander against my friends and Me, is just awful. i will not continue to listen to someone who doesn't know what they are saying, you obviously dont because you are judging without any right. unless you have met every person of the LGBT community and have heard them out, been in their point of view, and know exactly what its like to go through all of this, then i refuse to listen to you any longer, unless you open your mind, and open your eyes. you are a blind man being led by words, if only you knew that you wouldn't be blind if you opened your eyes. but to open your eyes and get on the thought of that, you would have to open your mind.\n by opening your mind and eyes.. instead of listening to words of hate..\n you are opening your heart to acceptance of others. and respect of them too.\n \n i really do respect your opinion, but i can not stand to listen to thick-headedness.\n \n thank you for your time. (:", 
   {}, 
   418658, 
   null, 
   1291779180.0
  ], 
  [
   418671, 
   null, 
   "Bottom Feeder", 
   "in the constitution it states that religion is not to be involved with law.\n i understand you have to ask god for his savings, but god made us this way. we can not change just because we want to. and thats assuming we want to.\n he may have told people not to engage in gay sex.. but did i say anything about sex?! i said what happens behind closed doors is none of our concern.\n thomas jefferson may have said such things, but i recall you trying to turn facts around on me.. so this is not about thomas jefferson making the rules, this is about god and his rules.\n another question.. does the bible flat out quote \"gay sex is a sin?\"\n and a comment: the bible was written by man, who thought he had heard an angel, god's messanger talking to him.\n from the lack of certain materials of past timings.. how are we to be sure this man did not make up the whole thing or was even just crazy?! once one man is crazy, they can make others to that same point if the vulnerability is that open.\n \n i'm sorry if you dont accept anyone of the LGBT community, but i am all for it, and i am a participant, to hear libel and slander against my friends and Me, is just awful. i will not continue to listen to someone who doesn't know what they are saying, you obviously dont because you are judging without any right. unless you have met every person of the LGBT community and have heard them out, been in their point of view, and know exactly what its like to go through all of this, then i refuse to listen to you any longer, unless you open your mind, and open your eyes. you are a blind man being led by words, if only you knew that you wouldn't be blind if you opened your eyes. but to open your eyes and get on the thought of that, you would have to open your mind.\n by opening your mind and eyes.. instead of listening to words of hate..\n you are opening your heart to acceptance of others. and respect of them too.\n \n i really do respect your opinion, but i can not stand to listen to thick-headedness.\n \n thank you for your time. (:\n\n \n The real question is why is Easy spending so much time focused on the \"homosexual sin.\" Are not all sins equal to one another? No sin is greater than another? Why do you raise homosexuality above all the rest? Adultery is a sin. Anyone who divorces and remarries is committing a sin. How do you repent for that sin, Easy? Again, hypocrisy at its finest.", 
   {}, 
   418669, 
   null, 
   1291782600.0
  ], 
  [
   418673, 
   null, 
   "Bennedict", 
   "its not \"homosexual sin\", its \"gay sex sin\". gay is OK, just as long as you dont have sex.", 
   {}, 
   418671, 
   null, 
   1291784100.0
  ], 
  [
   418674, 
   null, 
   "MrWriteLA", 
   "As if.\n \n EZ would go into Rumpelstiltskin-level paroxysms if he ever saw two men or women kissing (the former, at least, sanctioned multiple times in the Bible), holding hands, or knew they were even THINKING about it. \n \n (Which is where homosexuality stems from, after all. The thinking comes first, then MAYBE comes the act. But the Bible is silent on the thinking--it only mentions acts. And only one of those--which, believe it or not, not every gay person even does, contrary to fundie stereotyping.)\n \n Right, EZ?\n \n Come on. Tell me men kissing--so NOT condemned by your Holy Book of Fairy Tales--is okay with you.\n \n Dare you.", 
   {}, 
   418673, 
   null, 
   1291784640.0
  ], 
  [
   418675, 
   null, 
   "Bottom Feeder", 
   "its not \"homosexual sin\", its \"gay sex sin\". gay is OK, just as long as you dont have sex.\n\n \n I said it that way because the first thing Easy and Zorba jump to when you say you're gay is \"gay sex is a sin!\". And they do this without bothering to get to know the person. Essentially, they don't care if you are sexually active or not. If you're gay, it's a sin. It's pre-judgement and hypocritical. They speak the words they believe so vehemently, but fail to live by those beliefs themselves. It's disgusting.", 
   {}, 
   418673, 
   null, 
   1291785060.0
  ], 
  [
   418683, 
   null, 
   "Steeeeve", 
   "in the constitution it states that religion is not to be involved with law.\nNo it doesn't. Please tell me you didn't learn that in class by some underpaid/educated high school teacher.\n \n \ni really do respect your opinion, but i can not stand to listen to thick-headedness.\nSo you don't respect it. You are free to just admit that emoticon_xclown", 
   {}, 
   418669, 
   null, 
   1291787820.0
  ], 
  [
   418696, 
   null, 
   "Matthew S", 
   "No it doesn't. Please tell me you didn't learn that in class by some underpaid/educated high school teacher.\n\n \n We need to change that. We need a wall so strong between the state and religion that religion is contained, quarantined, and isolated so that it can not hurt gay people, our families, our civil rights, and our lives anymore.\n It would not bother me in the least if all religion tomorrow disappeared from the earth. I believe the world would be a better place.\n \n \n \n\n So you don't respect it. You are free to just admit that emoticon_xclown\n\n \n Why should anyone respect the opinion of someone who does not view homosexuality as equal to heterosexuality in every aspect?", 
   {}, 
   418683, 
   null, 
   1291818660.0
  ], 
  [
   418700, 
   null, 
   "Steeeeve", 
   "We need to change that. We need a wall so strong between the state and religion that religion is contained, quarantined, and isolated so that it can not hurt gay people, our families, our civil rights, and our lives anymore.\n It would not bother me in the least if all religion tomorrow disappeared from the earth. I believe the world would be a better place.\nI'm not a fan of chaos and anarchy but whatever. Freedom of religion is one of, if not the most, important right we have.\n \n \nWhy should anyone respect the opinion of someone who does not view homosexuality as equal to heterosexuality in every aspect?\nI was merely pointing out that she did not respect Easy's opinion so no need to pretend otherwise.", 
   {}, 
   418696, 
   null, 
   1291823400.0
  ], 
  [
   418707, 
   null, 
   "jyoshu", 
   "The real question is why is Easy spending so much time focused on the \"homosexual sin.\" Are not all sins equal to one another? No sin is greater than another? Why do you raise homosexuality above all the rest? Adultery is a sin. Anyone who divorces and remarries is committing a sin. How do you repent for that sin, Easy? Again, hypocrisy at its finest.\n\n \n Maybe its because there aren't adultery-pride organizations, a push for adultery-monogamy alliances in schools, adultery pride parades, a lopsided amount of press for an adultery movement, a push for years trying to make adultery normal, etc. When adulterers get anywhere near being the attention-whores that gay pride groups are (as compared to the press that other minorities get) then I'm sure you'll get some objectors.", 
   {}, 
   417365, 
   null, 
   1291825560.0
  ], 
  [
   418713, 
   null, 
   "Accipiter", 
   "in the constitution it states that religion is not to be involved with law.\n i understand you have to ask god for his savings, but god made us this way. we can not change just because we want to. and thats assuming we want to.\n he may have told people not to engage in gay sex.. but did i say anything about sex?! i said what happens behind closed doors is none of our concern.\n thomas jefferson may have said such things, but i recall you trying to turn facts around on me.. so this is not about thomas jefferson making the rules, this is about god and his rules.\n another question.. does the bible flat out quote \"gay sex is a sin?\"\n and a comment: the bible was written by man, who thought he had heard an angel, god's messanger talking to him.\n from the lack of certain materials of past timings.. how are we to be sure this man did not make up the whole thing or was even just crazy?! once one man is crazy, they can make others to that same point if the vulnerability is that open.\n \n i'm sorry if you dont accept anyone of the LGBT community, but i am all for it, and i am a participant, to hear libel and slander against my friends and Me, is just awful. i will not continue to listen to someone who doesn't know what they are saying, you obviously dont because you are judging without any right. unless you have met every person of the LGBT community and have heard them out, been in their point of view, and know exactly what its like to go through all of this, then i refuse to listen to you any longer, unless you open your mind, and open your eyes. you are a blind man being led by words, if only you knew that you wouldn't be blind if you opened your eyes. but to open your eyes and get on the thought of that, you would have to open your mind.\n by opening your mind and eyes.. instead of listening to words of hate..\n you are opening your heart to acceptance of others. and respect of them too.\n \n i really do respect your opinion, but i can not stand to listen to thick-headedness.\n \n thank you for your time. (:\n\n \n I know ez sounds like a bigot but if you observe his behavior here you will begin to see that something else is going on.\n \n For example, he spends more time with the gay people here than anyone else.\n \n If you look at his post history about 90% of his posts are on homosexual issues.\n \n There has been some discussion about homophobia and the related repressed homosexuality aspects of his personality and the consensuses is that he is probably struggling with his own repressed homosexuality.\n \n He seams very idiotic if you read what he says in all of his posts but I ask you, is it really possible for a human being to be that incredibly stupid and still be able to work his computer?\n \n Even though he seams to be at first glance a shallow hate monger I assure you that he loves and cares for all the gay people of this forum very much.", 
   {}, 
   418669, 
   null, 
   1291834620.0
  ], 
  [
   418722, 
   null, 
   "MrWriteLA", 
   "Since the real sin of Sodom was inhospitality (vid., The Real Sodomites, By Scott Horton (Harper's Magazine), many other sites), I'd say that on the basis of the way EZ has \"welcomed\" Proudmom and Dominique_Marie, he qualifies as the biggest Sodomite on the forum.", 
   {}, 
   418713, 
   null, 
   1291849620.0
  ], 
  [
   418725, 
   null, 
   "Easyrider", 
   "in the constitution it states that religion is not to be involved with law.\n\n \n Really? Then shall we cancel murder as a crime? It's in the Bible, right? \n \n Did you know the founding fathers and others attended church services in government buildings? Even up until and shortly after the Civil War?", 
   {}, 
   418669, 
   null, 
   1291852320.0
  ], 
  [
   418726, 
   null, 
   "Easyrider", 
   "Since the real sin of Sodom was inhospitality....I'd say that on the basis of the way EZ has \"welcomed\" Proudmom and Dominique_Marie, he qualifies as the biggest Sodomite on the forum.\n\n \n That just shows how stunted your third grade theology is.\n \n \"In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire. \"\n \n Looks like you just took over your own title.", 
   {}, 
   418722, 
   null, 
   1291852560.0
  ], 
  [
   418728, 
   null, 
   "Easyrider", 
   "Why do you raise homosexuality above all the rest? Adultery is a sin. Anyone who divorces and remarries is committing a sin. How do you repent for that sin, Easy? Again, hypocrisy at its finest.\n\n \n <Flush<\n \n Show me where I ever said that homosexual sin is greater than any other sin? If you can't find the post, then eat it.\n \n Do you enjoy fabricating lies like you just did? Is that who you are and what you do? Oh, that's right, you are a liar according to 1 John 2:22.", 
   {}, 
   418671, 
   null, 
   1291852860.0
  ], 
  [
   418729, 
   null, 
   "Easyrider", 
   "\n \n i really do respect your opinion, but i can not stand to listen to thick-headedness.\n \n\n \n I suppose you can't help being spiritually and Biblically challenged. You fit right in with the gay pride idolators. But you don't need to wind up in the Pit forever, so there's still time to wise up and receive Christ before you perish. Then your eyes will be opened.\n \n Cheers...\n \n John 3:36", 
   {}, 
   418669, 
   null, 
   1291852980.0
  ], 
  [
   418735, 
   null, 
   "Bottom Feeder", 
   "Maybe its because there aren't adultery-pride organizations, a push for adultery-monogamy alliances in schools, adultery pride parades, a lopsided amount of press for an adultery movement, a push for years trying to make adultery normal, etc. When adulterers get anywhere near being the attention-whores that gay pride groups are (as compared to the press that other minorities get) then I'm sure you'll get some objectors.\n\n \n How else is the gay population supposed to acquire equal treatment? Do you expect us to remain in the closet and let the ignorant continue to pretend we don't exist? Where you see attention seeking gays, I see a struggle for equal rights and recognition under the law. I'm not saying all of the tactics they use are right or even tasteful but it remains something worth fighting for.", 
   {}, 
   418707, 
   null, 
   1291857840.0
  ], 
  [
   418736, 
   null, 
   "Bottom Feeder", 
   "<Flush<\n \n Show me where I ever said that homosexual sin is greater than any other sin? If you can't find the post, then eat it.\n \n Do you enjoy fabricating lies like you just did? Is that who you are and what you do? Oh, that's right, you are a liar according to 1 John 2:22.\n\n \n Seriously? You're going to quote nonsense (John 2:22) to me? Suggesting that I, or any person that doesn't believe in your god, is a liar? Please allow me to \"flush\" that nonsense. I suggested it because that is what you mostly discuss. You bitch and moan about gay sex and the perceived \"gay agenda\" more than you do anything else. Even more than your ridiculous attacks on Obama and abortion rights, which leads me to believe that you have stronger feelings against the \"homosexual sin\" than any other. Could it be incorrect of me to believe such a thing? Sure . But until proven otherwise, I will continue to stand by my statement.\n \n Actions speak louder than words and your actions say it quite clearly.", 
   {}, 
   418728, 
   null, 
   1291858620.0
  ], 
  [
   418738, 
   null, 
   "Bennedict", 
   "Really? Then shall we cancel murder as a crime? It's in the Bible, right? \n \n Did you know the founding fathers and others attended church services in government buildings? Even up until and shortly after the Civil War?\n\n \n murder is a crime against humanity, not just a sin talked about in the bible, and demonstrated as a positive method.\n \n gay sex is just people doing it. of which you have no moral right saying \"nope, you cant do that!\" just stay out of people's bedrooms, eazy. if you were intruding on me and my girlfriend's sex life in the way youre intruding on gay people's, id be right pssd. in fact, i am right pssd. Marie brings up a good point, your bigotry affects more than just the LGBT community, it affects anyone who doesnt fit the mold (or should i say mould) of the republican, sexist, american, bigotted household. its an attack on freedom, civil rights, human dignity, respect, and (cheesily) love.\n \n youre gross.", 
   {}, 
   418725, 
   null, 
   1291859700.0
  ], 
  [
   418741, 
   null, 
   "Matthew S", 
   "I'm not a fan of chaos and anarchy but whatever. Freedom of religion is one of, if not the most, important right we have.\n\n \n If they are going to use that freedom to deny others their freedom then they need to lose that freedom. If my civil rights and freedoms are to be determined by other people religious freedom then I want a say in whether they are allowed that freedom.", 
   {}, 
   418700, 
   null, 
   1291864440.0
  ], 
  [
   418742, 
   null, 
   "Bennedict", 
   "what?? lol. The Bible teaches against \"unatural relations\" the romantic desires between people of the same sex, God created male and female to become one flesh when they fall inlove and get married, that is why it is only male and female who can make children. You cant make a child with only sperm (two men having sex) or with only female eggs (2 women having sex) It takes both sperm and egg to make a child. That alone should tell you that homosexuality is unatural even if you dont belive the Bible. The world will change, the ways of the world and peoples ideas will change, but the word of God never changes. What will be next, will having sex with animals be legal next and then allowing a human and an animal equal relationship rights??\n\n \n sorry, i missed this.\n \n you wanna talk about nature? hi there, im a zoology student, i know quite a bit about the natural world. there are thousands of recorded instances of homosexuality amongst vertibrate animals, you should see bonobos go at it. dolphins penetrating each other's blowholes, kangaroos, spider monkeys...\n \n something interesting, though. homosexuality is quite natural, however homosexual individuals who have sex with members of the same gender only is strictly a human attribute. thats exactly why im convinced that homosexuality is not genetic, something in our personal development must be causing it.\n \n your argument is the same as EZ's, gay sex is wrong, but no word on homosexuality. since weve already explored that gay sex is actually quite natural, your argument gets the boot.", 
   {}, 
   418248, 
   null, 
   1291867920.0
  ], 
  [
   418743, 
   null, 
   "Xcaliber", 
   "Did you know the founding fathers and others attended church services in government buildings? Even up until and shortly after the Civil War?\n\n \n I grow sick hearing things like this.. Christian Zealots everywhere Spouting that this Country was founded on Religion as a Nation under God.. Well You Are Dead Wrong.. Get educated and drop religion, we'll all be better off.\n \n Here's some Proof for you if you care to read ..\n \n First of all...Most of our \"FOUNDING FATHERS \" Were not Christians, they were Deists..In case you don't know what that is read this....\n \n \nDeism (pronounced /&#712;di&#720;&#618;z&#601;m/, us dict: d&#275;&#8242;·&#301;zm)[1][2] in the philosophy of religion is the standpoint that reason and observation of the natural world, without the need for organized religion, can determine that a supreme being created the universe. Further the term often implies that this supreme being does not intervene in human affairs or suspend the natural laws of the universe. Deists typically reject supernatural events such as prophecy and miracles, tending to assert that God (or \"The Supreme Architect\") has a plan for the universe that is not to be altered by intervention in the affairs of human life. Deists believe in the existence of God, in a secular sense, without any reliance on revealed religion, religious authority or holy books.\n\n \n Now, here are some Famous Quotes from a list of some of the \"FOUNDING FATHERS\" whom you claim so vehemently founded this country on GOD.\n \n \n Quotes by John Adams\n \n \"As I understand the Christian religion, it was, and is, a revelation. But how has it happened that millions of fables, tales, legends, have been blended with both Jewish and Christian revelation that have made them the most bloody religion that ever existed?\"\n -letter to F.A. Van der Kamp, Dec. 27, 1816\n \n \n \"God is an essence that we know nothing of. Until this awful blasphemy is got rid of, there will never be any liberal science in the world.\"\n \n \n \"This would be the best of all possible worlds, if there were no religion in it.\"\n .\n \n \n Quotes by Thomas Jefferson\n \n \"I do not find in orthodox Christianity one redeeming feature.\"\n \n \n \"It has been fifty and sixty years since I read the Apocalypse, and then I considered it merely the ravings of a maniac.\"\n \n \n \"We discover in the gospels a groundwork of vulgar ignorance, of things impossible, of superstition, fanaticism and fabrication .\"\n \n \"Christianity neither is, nor ever was, a part of the Common Law.\"\n -letter to Dr. Thomas Cooper, 1814\n \n \n Quotes by Benjamin Franklin\n \n \"Lighthouses are more helpful than churches.\"\n \n \n \"The way to see by faith is to shut the eye of reason.\"\n -in Poor Richard's Almanac\n \n \n \n \n Quotes by Thomas Paine\n \n \"Of all the tyrannies that affect mankind, tyranny in religion is the worst.\"\n \n \n \"What is it the New Testament teaches us? To believe that the Almighty committed debauchery with a woman engaged to be married; and the belief of this debauchery is called faith.\"\n \n \n \"All national institutions of churches, whether Jewish, Christian or Turkish, appear to me no other than human inventions, set up to terrify and enslave mankind, and monopolize power and profit.\"\n \n \n Quotes by George Washington\n \n \"Religious controversies are always productive of more acrimony and irreconcilable hatreds than those which spring from any other cause. Of all the animosities which have existed among mankind, those which are caused by the difference of sentiments in religion appear to be the most inveterate and distressing, and ought most to be depreciated. I was in hopes that the enlightened and liberal policy, which has marked the present age, would at least have reconciled Christians of every denomination so far that we should never again see the religious disputes carried to such a pitch as to endanger the peace of society.\"\n - letter to Edward Newenham, 1792\n \n \n The father of this country was very private about his beliefs, but it is widely considered that he was a Deist like his colleagues. He was a Freemason.\n \n \n Quotes by James Madison \n \n \n \"Religious bondage shackles and debilitates the mind and unfits it for every noble enterprise.\"\n -letter to Wm. Bradford, April 1, 1774\n \n \"The purpose of separation of church and state is to keep forever from these shores the ceaseless strife that has soaked the soil of Europe in blood for centuries.\"\n -1803 letter objecting use of gov. land for churches \n \n \n \n And finally a little Excerpt from a treaty with Tripoli \n Article 11 From the Treaty with Tripoli Authored by American diplomat Joel Barlow in 1796, the following treaty was sent to the floor of the Senate, June 7, 1797, where it was read aloud in its entirety and unanimously approved. John Adams, having seen the treaty, signed it and proudly proclaimed it to the Nation.\n \n  Art. 11. As the Government of the United States of America is not, in any sense, founded on the Christian religion; as it has in itself no character of enmity against the laws, religion, or tranquility, of Mussulmen; and, as the said States never entered into any war, or act of hostility against any Mahometan nation, it is declared by the parties, that no pretext arising from religious opinions, shall ever produce an interruption of the harmony existing between the two countries.\n \n Now get over it.. America needs less religion.. Our Founding Fathers thought so and it turns out they were right.", 
   {}, 
   418725, 
   null, 
   1291870380.0
  ], 
  [
   418747, 
   null, 
   "MrWriteLA", 
   "I grow sick hearing things like this.. Christian Zealots everywhere Spouting that this Country was founded on Religion as a Nation under God.. Well You Are Dead Wrong.. Get educated and drop religion, we'll all be better off.\n \n Here's some Proof for you if you care to read ..\n \n First of all...Most of our \"FOUNDING FATHERS \" Were not Christians, they were Deists..In case you don't know what that is read this....\n \n \n \n Now, here are some Famous Quotes from a list of some of the \"FOUNDING FATHERS\" whom you claim so vehemently founded this country on GOD.\n \n \n Quotes by John Adams\n \n \"As I understand the Christian religion, it was, and is, a revelation. But how has it happened that millions of fables, tales, legends, have been blended with both Jewish and Christian revelation that have made them the most bloody religion that ever existed?\"\n -letter to F.A. Van der Kamp, Dec. 27, 1816\n \n \n \"God is an essence that we know nothing of. Until this awful blasphemy is got rid of, there will never be any liberal science in the world.\"\n \n \n \"This would be the best of all possible worlds, if there were no religion in it.\"\n .\n \n \n Quotes by Thomas Jefferson\n \n \"I do not find in orthodox Christianity one redeeming feature.\"\n \n \n \"It has been fifty and sixty years since I read the Apocalypse, and then I considered it merely the ravings of a maniac.\"\n \n \n \"We discover in the gospels a groundwork of vulgar ignorance, of things impossible, of superstition, fanaticism and fabrication .\"\n \n \"Christianity neither is, nor ever was, a part of the Common Law.\"\n -letter to Dr. Thomas Cooper, 1814\n \n \n Quotes by Benjamin Franklin\n \n \"Lighthouses are more helpful than churches.\"\n \n \n \"The way to see by faith is to shut the eye of reason.\"\n -in Poor Richard's Almanac\n \n \n \n \n Quotes by Thomas Paine\n \n \"Of all the tyrannies that affect mankind, tyranny in religion is the worst.\"\n \n \n \"What is it the New Testament teaches us? To believe that the Almighty committed debauchery with a woman engaged to be married; and the belief of this debauchery is called faith.\"\n \n \n \"All national institutions of churches, whether Jewish, Christian or Turkish, appear to me no other than human inventions, set up to terrify and enslave mankind, and monopolize power and profit.\"\n \n \n Quotes by George Washington\n \n \"Religious controversies are always productive of more acrimony and irreconcilable hatreds than those which spring from any other cause. Of all the animosities which have existed among mankind, those which are caused by the difference of sentiments in religion appear to be the most inveterate and distressing, and ought most to be depreciated. I was in hopes that the enlightened and liberal policy, which has marked the present age, would at least have reconciled Christians of every denomination so far that we should never again see the religious disputes carried to such a pitch as to endanger the peace of society.\"\n - letter to Edward Newenham, 1792\n \n \n The father of this country was very private about his beliefs, but it is widely considered that he was a Deist like his colleagues. He was a Freemason.\n \n \n Quotes by James Madison \n \n \n \"Religious bondage shackles and debilitates the mind and unfits it for every noble enterprise.\"\n -letter to Wm. Bradford, April 1, 1774\n \n \"The purpose of separation of church and state is to keep forever from these shores the ceaseless strife that has soaked the soil of Europe in blood for centuries.\"\n -1803 letter objecting use of gov. land for churches \n \n \n \n And finally a little Excerpt from a treaty with Tripoli \n Article 11 From the Treaty with Tripoli Authored by American diplomat Joel Barlow in 1796, the following treaty was sent to the floor of the Senate, June 7, 1797, where it was read aloud in its entirety and unanimously approved. John Adams, having seen the treaty, signed it and proudly proclaimed it to the Nation.\n \n  Art. 11. As the Government of the United States of America is not, in any sense, founded on the Christian religion; as it has in itself no character of enmity against the laws, religion, or tranquility, of Mussulmen; and, as the said States never entered into any war, or act of hostility against any Mahometan nation, it is declared by the parties, that no pretext arising from religious opinions, shall ever produce an interruption of the harmony existing between the two countries.\n \n Now get over it.. America needs less religion.. Our Founding Fathers thought so and it turns out they were right.\nemoticon_xgood\n \n Won't do you any good, though. \n \n They prefer to warp the odd founder reference to \"the Creator\" (usually taken wildly out of context if not outright fabricated by \"wall-breaker\" frauds like David Barton) into meaning that the country's founders (psst... the ones responsible for the Constitution we base our laws on, not the Declaration of Independence which was mostly signed--a few notables like Franklin aside--by nobodies who went on to do squat afterwards, dimbulbs... unless you think Button Gwinnet is regarded as one of our \"founders\") as supporting their late-1960's Anita Bryant-Jerry Falwell-Pat Robertson radical right-wing pick-and-choose anti-Christian \"Christianity.\"\n \n They'll ignore the history of the last 250 years as readily as they do the last 2050. \n \n When you've closed your mind, thrown the key away and the lock is rusted shut, don't expect truth or reason--which we know have a \"liberal bias\"-- to open it. \n \n No way, no how, not ever,", 
   {}, 
   418743, 
   null, 
   1291874220.0
  ], 
  [
   418762, 
   null, 
   "Accipiter", 
   "Really? Then shall we cancel murder as a crime? It's in the Bible, right?\n\n \n Slavery is in the bible, does that mean we should make it legal again?\n \n And one other thing, ez has a boyfriend and I can prove it.", 
   {}, 
   418725, 
   null, 
   1291900860.0
  ], 
  [
   418771, 
   null, 
   "Steeeeve", 
   "If they are going to use that freedom to deny others their freedom then they need to lose that freedom. If my civil rights and freedoms are to be determined by other people religious freedom then I want a say in whether they are allowed that freedom.\n\n \n Until you learn what a freedom and right is I'm not sure you are qualified to take them away from people.", 
   {}, 
   418741, 
   null, 
   1291915140.0
  ], 
  [
   418836, 
   null, 
   "Easyrider", 
   " I grow sick hearing things like this.. Christian Zealots everywhere Spouting that this Country was founded on Religion as a Nation under God.. Well You Are Dead Wrong. \n\n \n No, you are dead wrong.\n \n Whatever America has evolved into today is a separate issue from what America was in the days of the American Revolution. Where did America's great strength lie then? And what were the moral foundations of America at its inception? The evidence is overwhelming: the founding fathers tell us that our nation was conceived on the principles of the Biblical God and Christianity. Not on Hinduism, not on Humanism, nor Buddhism, nor the writings of Confucius or Islam, or even Deism, but founded on Biblical and Christian principles. \n \n Here are just some of the facts that are seldom taught in America's public school classrooms:\n \n The most frequently recognized source for political inspiration for the founding fathers was the Bible, which was referenced in some 34% of the founding father's quotations.\n \n The first reference to God as the foundation of an American colony was noted in the 'Mayflower Compact,' dated November 11, 1620:\n \n \"....Having undertaken for the Glory of God, and advancement of\n the Christian faith, and the honour of our king and country, a\n voyage to plant the first colony in the northern parts of Virginia;\n Do by these presents, solemnly and mutually in the presence of\n God and one another, covenant and combine ourselves together\n into a Civil Body....\" \n \n Many of the founding fathers recognized that the principles of civil law were inseparably linked to Biblical truths. James Wilson, one of the original Supreme Court Justices, and a signer of the Constitution, explained,\n \n \"Human law must rest its authority ultimately upon the authority of that law which is divine...Far from being rivals or enemies, religion and law are twin sisters, friends, and mutual assistants...\"\n \n On a number of occasions, the United States Supreme Court specifically recognized America as a Christian nation. In the case \"Church of the Holy Trinity vs. the United States\" (Feb. 29, 1892, US457-458), Justice Josiah Brewer, following a lengthy and exhaustive search of early American historical literature, commented, \"We find everywhere a clear recognition of the same truth....that we are a Christian nation....\"\n \n In another Supreme Court Case, \"Zorach vs. Clauson\" (1952, US306 307 313), Justice William O. Douglas categorically stated, \"We are a religious people and our institutions presuppose a Supreme Being.\" Further, in \"United States vs. Macintosh\" (1931, 283 US 605, 625), Justice George Sutherland affirmed, \"We are a Christian people....affording to one another the equal right of religious freedom, and acknowledge with reverence the duty of obedience to the will of God.\"\n \n At the Constitutional Convention on June 28, 1787, Benjamin Franklin noted: \"...The longer I live, the more convincing proofs I see of this truth, that God governs in the affairs of men. And if a sparrow cannot fall to the ground without His notice, is it probable that an empire can rise without his aid? We have been assured, Sir, in the Sacred Writings, that 'except the Lord build the House, they labor in vain that build it.\"\n \n There are many today who believe Franklin was a strict deist, but Franklin here is not only referencing the Bible, but is alluding in part to a teaching by Jesus Christ from Matthew 10:29.\n \n Concerning the outcome of the American Revolution, John Quincy Adams noted, \"The highest glory won from the American Revolution was this: it connected, in one indissoluble bond, the principles of civil government with the principles of Christianity.\" \n \n In a letter to Thomas Jefferson dated June 28, 1813, John Adams wrote: \"The general principles on which the (founding) fathers achieved independence were...the general principles of Christianity.\"\n \n Founding father Noah Webster proclaimed much the same message when he said, \"The religion which has introduced civil liberty is the religion of Christ and His Apostles...This is genuine Christianity and to this we owe our free constitutions of government.\" \n \n Time after time, the founding fathers declared similar beliefs. From the archives of Patrick Henry's personal notes (handwritten on the back of his copy of the \"Stamp Act Resolutions,\" made public after his death) we read:\n \n \"Whether this (new government) will prove a blessing or a curse \n will depend upon the use our people make of the blessings which\n a gracious God hath bestowed on us. If they are wise they will be\n great and happy. If they are of a contrary character, they will be\n miserable. Righteousness alone can exalt them as a nation.\" \n \n Thomas Jefferson was hardly speaking from a strict deist standpoint when he said: \n \n \"Can the liberties of a nation be thought secure when we have \n removed their only firm basis, a conviction in the minds of the\n people that these liberties are the gift of God? That they are\n not to be violated but with His wrath? Indeed I tremble for my\n country when I reflect that God is just; and that His justice\n cannot sleep forever.\" (Notes on the State of Virginia, 1781)\n \n \"I shall need, too, the favor of that Being in whose hands we\n are, who lead our forefathers, as Israel of old, from their\n native land and planted them in a country flowing with all\n the necessities and comforts of life.\" (Monday, March 4,\n 1805, in his 2nd Inaugural Address)\n \n Remember, a strict deist was one who believed God was like a watchmaker, who wound up the universe and thereafter did not involve himself in the affairs of men and nations. Jefferson obviously believed otherwise. \n \n Speaking of Godly principles, Jefferson stated:\n \n \"A more beautiful or precious morsel of ethics I have never\n seen; it is a document in proof that I am a real Christian,\n that is to say, a disciple of the doctrines of Jesus.\"\n (Jan. 9, 1816 - In a letter to Charles Thomson)\n \n George Washington, the \"Father of our Country,\" likewise recognized God as supremely important in the American dream. In his first inaugural address on April 30, 1789, Washington remarked:\n \n \"It would be improper to omit, in this first official act, my\n fervent supplications to that Almighty Being who rules over\n the universe.\"\n \n \n On Saturday, October 3, 1789, President Washington said this in proclaiming a day of national thanksgiving:\n \n \"It is the duty of all nations to acknowledge the Providence of\n Almighty God.\"\n \n Today, our public schools are in a moral crisis. Washington once noted, \"If you remove religious principles from the schools you are going to lose national morality.\" How prophetic he was!\n \n Benjamin Rush, a signer of the Declaration of Independence who was also known as the \"Father of Public Schools,\" once had this to offer: \"The only foundation for a republic is...religion. Without it there can be no virtue, and without virtue there can be no liberty.\"\n \n Don't miss the significance of that last statement: \"..without virtue there can be no liberty....\" The principle is clear - a lack of virtue engenders bondage. As one writer noted, \"Intemperate men can never be free because their passions give rise to their fetters (bindings).\" The more liberties a godless people achieve, the more enslaved they ultimately become in their worldly obsessions.\n \n Still another founding father, the Reverend John Witherspoon, mirrored Benjamin Rush when he declared, \"...Civil liberty cannot long be preserved without virtue....\"\n \n And finally, let's not forget James Madison, known as the \"Chief Architect of U.S. Constitution,\" who once had this to say:\n \n \"Cursed be all that learning that is contrary to the Cross of Christ.\"\n \n This is just a very short list of thousands of such examples that clearly speak of the Biblical and Christian foundations of our Founding Fathers and early America. (Righter Report)\n \n \nGet educated and drop religion, we'll all be better off.\n\n \n You're busted.", 
   {
    "unicode_changes_made": true
   }, 
   418743, 
   null, 
   1291990800.0
  ], 
  [
   418846, 
   null, 
   "gansao", 
   "Homosexuals have as much chance of Gods redemption as a life long fornicator with penchant for anal sex.", 
   {}, 
   418836, 
   null, 
   1292007660.0
  ], 
  [
   418860, 
   null, 
   "jazyjason", 
   "Homosexuals have as much chance of Gods redemption as a life long fornicator with penchant for anal sex.\n\n \n Says the person with a sexual innuendo as their avatar. Pot paging kettle....", 
   {}, 
   418846, 
   null, 
   1292018040.0
  ], 
  [
   418862, 
   null, 
   "gansao", 
   "Says the person with a sexual innuendo as their avatar. Pot paging kettle....\n\n \n I dont cry about it Jason.\n I'm not trying to recreate God in my own image and declaring he is beastly or doesnt exist when I cant", 
   {}, 
   418860, 
   null, 
   1292018220.0
  ], 
  [
   418869, 
   null, 
   "Accipiter", 
   "I dont cry about it Jason.\n I'm not trying to recreate God in my own image and declaring he is beastly or doesnt exist when I cant\n\n \n Did you know oral sex is sodomy?\n \n Maybe you should get yourself a dictionary dumb a$$.", 
   {}, 
   418862, 
   null, 
   1292025900.0
  ], 
  [
   418870, 
   null, 
   "gansao", 
   "Did you know oral sex is sodomy?\n \n Maybe you should get yourself a dictionary dumb a$$.\n\n \n You should have a word with your boyfriend.\n Where is anal sex NOT sodomy...?\n He may be missing an opportunity...bestiality is sodomy too, so you can pretend you are a sheep...\n \n How does your observation show that my post was wrong?", 
   {}, 
   418869, 
   null, 
   1292026200.0
  ], 
  [
   418871, 
   null, 
   "Accipiter", 
   "You should have a word with your boyfriend.\n Where is anal sex NOT sodomy...?\n He may be missing an opportunity...bestiality is sodomy too, so you can pretend you are a sheep...\n \n How does your observation show that my post was wrong?\n\n I was just pointing out the fact that you do not hold the moral high ground, unless of course you have never had a blow job.", 
   {}, 
   418870, 
   null, 
   1292030160.0
  ], 
  [
   418872, 
   null, 
   "gansao", 
   "I was just pointing out the fact that you do not hold the moral high ground, unless of course you have never had a blow job.\n\n \n Thats because you are a prat.\n I was pointing out that a single person who has sex ( including anal sex) has the same chance of redemption as a homosexual.\n I never claimed to have the high ground\n I repeat ..you are a prat", 
   {}, 
   418871, 
   null, 
   1292030520.0
  ], 
  [
   418881, 
   null, 
   "jazyjason", 
   "I dont cry about it Jason.\n I'm not trying to recreate God in my own image and declaring he is beastly or doesnt exist when I cant\n\n \n No your just moving the goal posts so you can live your life the way you see fit, yet discriminate against mine based upon your loose sense of 'morality'", 
   {}, 
   418862, 
   null, 
   1292068500.0
  ], 
  [
   418884, 
   null, 
   "gansao", 
   "No your just moving the goal posts so you can live your life the way you see fit, yet discriminate against mine based upon your loose sense of 'morality'\n\n \n What goal posts?\n I recognise that I have lived a life and have done things contrary to Gods laws.\n I neither seek or expect salvation if I do not repent.\n I dont try to make the Christian religion fit my lifestyle like you and other 'Christian' gays.\n I dont particularly discriminate against your lifestyle..no more or less than any other deviant sexual lifestyle but I object to you and other sexual deviants claiming to hold the moral highground", 
   {}, 
   418881, 
   null, 
   1292073180.0
  ], 
  [
   419042, 
   null, 
   "jazyjason", 
   "=gansao;418884\n I dont particularly discriminate against your lifestyle..no more or less than any other deviant sexual lifestyle but I object to you and other sexual deviants claiming to hold the moral highground\n\n \n My life is not a \"style\" first of all so you can quit with that stereotype. Second I am not a sexual deviant although in your mind anything other than strait missionary style may be.... Get over yourself and your so called \"morality\" complex. \n \n This coming from the man with two women sucking on a candy cane.. what a joke...", 
   {}, 
   418884, 
   null, 
   1292308740.0
  ], 
  [
   419046, 
   null, 
   "Iuris", 
   "You may want to take a look at the castration thread, Jazy. Maybe gansao's position isn't all that conservative after all...", 
   {}, 
   419042, 
   null, 
   1292321940.0
  ], 
  [
   419048, 
   null, 
   "gansao", 
   "My life is not a \"style\" first of all so you can quit with that stereotype. Second I am not a sexual deviant although in your mind anything other than strait missionary style may be.... Get over yourself and your so called \"morality\" complex. \n \n This coming from the man with two women sucking on a candy cane.. what a joke...\n\n \n Anything other than vaginal intercourse can be considered deviant ( and you dont have to stick to missionary position JJ).\n So just about 100% of people have experienced deviant sex...masterbation can and has been considered a deviant and sinful way to sexual relief.\n \n What I find amusing is your hypocrisy.\n Why is your relationships more ' moral' than an incestual one?\n How are you more moral than an unmarried hetero couple enjoying oral sex( and maybe a little anal too)?\n Why should you be able to marry when a man cannot marry his sister?\n \n There is no provision for Christian gay marriage in the Bible so any gay sex is fornication whether you pretend you are married or not , so you are on a loser from the start for Gods salvation JJ.\n \n So I suggest that gay ' Christians' stop whining and trying to rewrite the Bible.\n \n Like hetero fornicators, adulterers,sodomites,bigamists, wife swappers and mo fos( and sister fos) you are doomed according to the Bible...deal with it.\n And you are no better than any other sexual deviant but far more lucky than some who still cannot do what they want legally.", 
   {}, 
   419042, 
   null, 
   1292331480.0
  ], 
  [
   419061, 
   null, 
   "Bennedict", 
   "i think people are misunderstanding gansao. ive not seen him bring any negativity or condemnation to calling sexual acts other than vaginal, \"deviant\". in a way, hes correct depending on the perspective.", 
   {}, 
   419048, 
   null, 
   1292382420.0
  ], 
  [
   419069, 
   null, 
   "jazyjason", 
   "Anything other than vaginal intercourse can be considered deviant ( and you dont have to stick to missionary position JJ).\n So just about 100% of people have experienced deviant sex...masterbation can and has been considered a deviant and sinful way to sexual relief.\n \n What I find amusing is your hypocrisy.\n Why is your relationships more ' moral' than an incestual one?\n How are you more moral than an unmarried hetero couple enjoying oral sex( and maybe a little anal too)?\n Why should you be able to marry when a man cannot marry his sister?\n \n There is no provision for Christian gay marriage in the Bible so any gay sex is fornication whether you pretend you are married or not , so you are on a loser from the start for Gods salvation JJ.\n \n So I suggest that gay ' Christians' stop whining and trying to rewrite the Bible.\n \n Like hetero fornicators, adulterers,sodomites,bigamists, wife swappers and mo fos( and sister fos) you are doomed according to the Bible...deal with it.\n And you are no better than any other sexual deviant but far more lucky than some who still cannot do what they want legally.\n\n \n At least this Nation's Constitution isn't based upon your so called \"morals\" gans. At least I have rights recognized by the state and at the federal level no matter what you may perceive my relationship to be....", 
   {}, 
   419048, 
   null, 
   1292386740.0
  ], 
  [
   419127, 
   null, 
   "gansao", 
   "At least this Nation's Constitution isn't based upon your so called \"morals\" gans. At least I have rights recognized by the state and at the federal level no matter what you may perceive my relationship to be....\n\n \n \n You have the right to near enough live the life you want just as most hetero sexual deviants have( by far the most of us) but you are no more ' normal' or 'moral' than someone in an incestuous relationship so you should appreciate how lucky you are....you got the lucky break.\n Birth control has made incestuous relationships far less dangerous to society than it was before so why is it a taboo?\n It is no less natural than homosexuality.\n Its not about morals JJ..leave the morals to God.\n Im talking about a secular view.\n I would say that the ' deviant' sexual spectrum starts at masterbation and ends at ...snuff parties .\n Obviously some practices are dangerous to society with some outrightly breaking the law.\n Sodomy,homosexuality.troilism, group sex,bdsm and incest are all sexual deviation but not particularly bad for society per say unless one looks at these practices with a religious moral view...then they are sexual aberrations, contrary to Gods law.\n So if you call yourself a Christian, you cant really partake..sorry JJ.", 
   {}, 
   419069, 
   null, 
   1292416680.0
  ], 
  [
   419214, 
   null, 
   "jazyjason", 
   "You have the right to near enough live the life you want just as most hetero sexual deviants have( by far the most of us) but you are no more ' normal' or 'moral' than someone in an incestuous relationship so you should appreciate how lucky you are....you got the lucky break.\n Birth control has made incestuous relationships far less dangerous to society than it was before so why is it a taboo?\n It is no less natural than homosexuality.\n Its not about morals JJ..leave the morals to God.\n Im talking about a secular view.\n I would say that the ' deviant' sexual spectrum starts at masterbation and ends at ...snuff parties .\n Obviously some practices are dangerous to society with some outrightly breaking the law.\n Sodomy,homosexuality.troilism, group sex,bdsm and incest are all sexual deviation but not particularly bad for society per say unless one looks at these practices with a religious moral view...then they are sexual aberrations, contrary to Gods law.\n So if you call yourself a Christian, you cant really partake..sorry JJ.\n\n \n Oh darn. Looks like I'll be sitting at the kids table in heaven while you and Easy eat with God...... Wouldn't be the first time i've been placed as a second class citizen in some category...", 
   {}, 
   419127, 
   null, 
   1292479740.0
  ], 
  [
   419905, 
   null, 
   "Dominique_Marie", 
   "No it doesn't. Please tell me you didn't learn that in class by some underpaid/educated high school teacher.\n \n So you don't respect it. You are free to just admit that emoticon_xclown\n\n \n it does... it says: \"congress shall make no law respecting an establishment of religion or prohibiting the free exercises thereof\"\n meaning religion can not be favored or prohibited...\n athieism is a religion.. and that can't be favored or prohibited either..\n religion can not be involved with law making because it will interfere with the freedom of religion and the freedoms of others.", 
   {
    "post_info": {
     "post_title": "steeeeve..."
    }
   }, 
   418683, 
   null, 
   1293246300.0
  ], 
  [
   419907, 
   null, 
   "Dominique_Marie", 
   "I suppose you can't help being spiritually and Biblically challenged. You fit right in with the gay pride idolators. But you don't need to wind up in the Pit forever, so there's still time to wise up and receive Christ before you perish. Then your eyes will be opened.\n \n Cheers...\n \n John 3:36\n\n \n i refuse to join the side of god if he refuses to accept me for who i am..\n he made me who i am, and if he wanted to, he could change me immediately, but as it turns out, he doesnt want to change me, i am as good as i get.. and i refuse to walk out on the girl i love just because nay-sayers. \n we have not done a thing wrong by showing love.\n canada accepts gay marriage, i dont see why the u.s. doesnt. we are supposed to be equally free.. it seems we are more free in canada.\n \n and murder is frowned upon because it turns into slaughter, also, the world was underpopulated when laws first came into play.. murdering is also a sin because you are supposed to LOVE \"gods children\".. if you show hate, you are showing hatred towards \"god\"", 
   {}, 
   418729, 
   null, 
   1293247380.0
  ], 
  [
   419910, 
   null, 
   "Xcaliber", 
   "athieism is a religion.. \n\n \n No, Atheism is NOT a religion.", 
   {}, 
   419905, 
   null, 
   1293249180.0
  ], 
  [
   419911, 
   null, 
   "Bennedict", 
   "No, Atheism is NOT a religion.\n\n \n atheism is a religion in the same way not smoking is a habit.\n \n lol i love that quote. i cant remember where i heard it though.", 
   {}, 
   419910, 
   null, 
   1293249540.0
  ], 
  [
   419913, 
   null, 
   "Accipiter", 
   "athieism is a religion..\n\n \n Hey everybody it's an atheists day eve present from Dominique_Marie!", 
   {}, 
   419911, 
   null, 
   1293251160.0
  ], 
  [
   435987, 
   null, 
   "loveoneanother", 
   "Hello, \n \n I am new to this debate forum, actually I have never been on a debate forum before but this site was recommended to me to have good debate regarding homosexuality. \n I have a gay son that I am very proud of but have always had many questions regarding being gay and homosexuality. \n I guess you could say that I was raised with \"fire and brimstone\" but have come around on many issues since finding out my son was gay some 20+ years ago. \n I still have serious questions about what the Bible does say or doesn't say about homoseuxuality and the nature of it, wether it is truly a sin or not. \n I understand that their are different interpretations of the Biblical verses that seem to address the issue but am confused as to wether fundimentalist Christians are taking this out of context to justify their own views. I was told that if I belived the Bible as the true word of God then I should have no questions but I have many. \n I hope you can be of help. Thank you.\n\n \n I do know that the bible teaches us consistently and continously to \"love one another\" everything the bible say boils down to that.... It does not say love the straight people. My son is also gay and I love God with all my heart and I knew he was gay from a very early age.....I struggled with that a long time ago because of what the hate mongers say and use Gods name to say it....the bible is very clear on what was relavent at the time and there are specific reasons why certain things were taught at certain times...is incest ok??? I dont believe so and yet it is in the bible....I am not a bible scholar and I am sure I dont read it enough but I am equally sure that God loves all people and He died for all people and to teach otherwise is truly an abomination to God and makes a mockery of His death! Judge not lest you be judged!", 
   {}, 
   417365, 
   null, 
   1312159500.0
  ], 
  [
   436057, 
   null, 
   "Easyrider", 
   " I do know that the bible teaches us consistently and continously to \"love one another\" everything the bible say boils down to that.... It does not say love the straight people. My son is also gay and I love God with all my heart and I knew he was gay from a very early age.....I struggled with that a long time ago because of what the hate mongers say and use Gods name to say it....the bible is very clear on what was relavent at the time and there are specific reasons why certain things were taught at certain times...is incest ok??? I dont believe so and yet it is in the bible....I am not a bible scholar and I am sure I dont read it enough but I am equally sure that God loves all people and He died for all people and to teach otherwise is truly an abomination to God and makes a mockery of His death! \n\n \n Jesus said unless people repent of their sins, they will not enter the kingdom of heaven. Where is the repentance from the gay sex crowd?\n \n \n\n Judge not lest you be judged!\n\n \n \"Judge not, and you will not be judged.\" (Matthew 7:1)\n \n Jesus is not saying that we cannot make judgments about people, he is saying that we should not be hypocrites if we do. In Matthew 7:5 he says, \"You hypocrite, first take the plank out of your own eye, and then you can see clearly to remove the speck that is in your brothers eye.\"\n \n God acknowledges the legitimacy of civil authorities to judge:  \n \n Romans 13:1-4: \"Everyone must submit himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God. Consequently, he who rebels against the authority is rebelling against what God has instituted, and those who do so will bring judgment on themselves. (v. 4) For he (the reigning authority) is God's servant to do you good. But if you do wrong, be afraid, for he does not bear the sword for nothing. He is God's servant, an agent of God's wrath to bring punishment on the wrongdoer.\" (Also note Matthew 5:25; Acts 25:10-11)\n \n God has commanded the church to make correct judgments:\n \n John 7:24: \"Stop judging by mere appearances, and make a right judgment.\"\n \n Matthew 18:15-17: \"If your brother sins against you, go and show him his fault, just between the two of you. If he listens to you, you have won your brother over. But if he will not listen, take one or two others along, so that every matter may be established by the testimony of two or three witnesses (note Deuteronomy 19:15). If he refuses to listen to them, tell it to the church; and if he refuses to listen even to the church, treat him as you would a pagan or a tax collector .\"\n \n God commands us to warn the wicked to turn from their sins:\n \n \"When I say to the wicked, 'You will surely die,' and you do not warn him or speak out to warn the wicked from his wicked way that he may live, that wicked man shall die in his iniquity, but his blood I will require at your hand. \"Yet if you have warned the wicked and he does not turn from his wickedness or from his wicked way, he shall die in his iniquity; but you have delivered yourself. (Ezekiel 3:18-19)\n \n \"When I say to the wicked, 'O wicked man, you will surely die,' and you do not speak to warn the wicked from his way, that wicked man shall die in his iniquity, but his blood I will require from your hand. \"But if you on your part warn a wicked man to turn from his way and he does not turn from his way, he will die in his iniquity, but you have delivered your life. (Ezekiel 33:8-9)\n \n God commands us to judge according to one's 'fruits.'\n \n Matthew 7:17-20: \"Likewise, every good tree bears good fruit, but a bad tree bears bad fruit.....every tree that does not bear good fruit will be cut down and thrown into the fire. Thus, by their fruit you will recognize them.\"\n \n Saints of Christ will judge the world, and angels:\n \n I Corinthians 6:2: \"Do you not know that the saints will judge the world?\"\n \n I Corinthians 6:3: \"Do you not know that we will judge angels?\"\n \n Jesus condemned the teachers of the law and the Pharisees:\n \n Matthew 23:27-28: \"Woe to you, teachers of the law and Pharisees, you hypocrites! You are like whitewashed tombs, which look beautiful on the outside but on the inside are full of dead men's bones and everything unclean. In the same way, on the outside you appear to people as righteous but on the inside you are full of hypocrisy and wickedness.\"\n \n John the Baptist rebukes King Herod for adultery and other sins:\n \n Luke 3:19: \"But when John rebuked Herod the tetrarch because of Herodias, his brother's wife, and all the other things he had done, Herod added this to them all: He locked John up in prison.\" \n \n Stephen rebukes the Jewish leaders:\n \n Acts 7:51-53: \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him - you who have received the law that was put into effect through angels but have not obeyed it.\" \n \n Jesus rebukes the Christ-deniers:\n \n Jesus said to them, \"If God were your Father, you would love me, for I have come here from God. I have not come on my own; God sent me. Why is my language not clear to you? Because you are unable to hear what I say. You belong to your father, the devil, and you want to carry out your father's desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. Yet because I tell the truth, you do not believe me!\" - John 8:42-44\n \n Also note all the Old Testament prophets who condemned sin and corrupt moral leadership, and who were persecuted for their discernment and duty.", 
   {
    "unicode_changes_made": true
   }, 
   435987, 
   null, 
   1312252020.0
  ], 
  [
   436136, 
   null, 
   "poet", 
   "Jesus said unless people repent of their sins, they will not enter the kingdom of heaven. Where is the repentance from the gay sex crowd?\n \n \n \n \"Judge not, and you will not be judged.\" (Matthew 7:1)\n \n Jesus is not saying that we cannot make judgments about people, he is saying that we should not be hypocrites if we do. In Matthew 7:5 he says, \"You hypocrite, first take the plank out of your own eye, and then you can see clearly to remove the speck that is in your brothers eye.\"\n \n God acknowledges the legitimacy of civil authorities to judge:  \n \n Romans 13:1-4: \"Everyone must submit himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God. Consequently, he who rebels against the authority is rebelling against what God has instituted, and those who do so will bring judgment on themselves. (v. 4) For he (the reigning authority) is God's servant to do you good. But if you do wrong, be afraid, for he does not bear the sword for nothing. He is God's servant, an agent of God's wrath to bring punishment on the wrongdoer.\" (Also note Matthew 5:25; Acts 25:10-11)\n \n God has commanded the church to make correct judgments:\n \n John 7:24: \"Stop judging by mere appearances, and make a right judgment.\"\n \n Matthew 18:15-17: \"If your brother sins against you, go and show him his fault, just between the two of you. If he listens to you, you have won your brother over. But if he will not listen, take one or two others along, so that every matter may be established by the testimony of two or three witnesses (note Deuteronomy 19:15). If he refuses to listen to them, tell it to the church; and if he refuses to listen even to the church, treat him as you would a pagan or a tax collector .\"\n \n God commands us to warn the wicked to turn from their sins:\n \n \"When I say to the wicked, 'You will surely die,' and you do not warn him or speak out to warn the wicked from his wicked way that he may live, that wicked man shall die in his iniquity, but his blood I will require at your hand. \"Yet if you have warned the wicked and he does not turn from his wickedness or from his wicked way, he shall die in his iniquity; but you have delivered yourself. (Ezekiel 3:18-19)\n \n \"When I say to the wicked, 'O wicked man, you will surely die,' and you do not speak to warn the wicked from his way, that wicked man shall die in his iniquity, but his blood I will require from your hand. \"But if you on your part warn a wicked man to turn from his way and he does not turn from his way, he will die in his iniquity, but you have delivered your life. (Ezekiel 33:8-9)\n \n God commands us to judge according to one's 'fruits.'\n \n Matthew 7:17-20: \"Likewise, every good tree bears good fruit, but a bad tree bears bad fruit.....every tree that does not bear good fruit will be cut down and thrown into the fire. Thus, by their fruit you will recognize them.\"\n \n Saints of Christ will judge the world, and angels:\n \n I Corinthians 6:2: \"Do you not know that the saints will judge the world?\"\n \n I Corinthians 6:3: \"Do you not know that we will judge angels?\"\n \n Jesus condemned the teachers of the law and the Pharisees:\n \n Matthew 23:27-28: \"Woe to you, teachers of the law and Pharisees, you hypocrites! You are like whitewashed tombs, which look beautiful on the outside but on the inside are full of dead men's bones and everything unclean. In the same way, on the outside you appear to people as righteous but on the inside you are full of hypocrisy and wickedness.\"\n \n John the Baptist rebukes King Herod for adultery and other sins:\n \n Luke 3:19: \"But when John rebuked Herod the tetrarch because of Herodias, his brother's wife, and all the other things he had done, Herod added this to them all: He locked John up in prison.\" \n \n Stephen rebukes the Jewish leaders:\n \n Acts 7:51-53: \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him - you who have received the law that was put into effect through angels but have not obeyed it.\" \n \n Jesus rebukes the Christ-deniers:\n \n Jesus said to them, \"If God were your Father, you would love me, for I have come here from God. I have not come on my own; God sent me. Why is my language not clear to you? Because you are unable to hear what I say. You belong to your father, the devil, and you want to carry out your father's desires. He was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. Yet because I tell the truth, you do not believe me!\" - John 8:42-44\n \n Also note all the Old Testament prophets who condemned sin and corrupt moral leadership, and who were persecuted for their discernment and duty.\n\n \n BS Propaganda. Self-righteous a**hole. You sin more than anyone here.", 
   {
    "unicode_changes_made": true
   }, 
   436057, 
   null, 
   1312383540.0
  ], 
  [
   436190, 
   null, 
   "Freedom", 
   "Oh another EZ poet clash, YES! Fire and Ice. Predicted chance that either will take up rational discourse and support anything they say 0.055%, chance that both will insult and dismiss each other to the best of their ability 99.9915%\n \n I've said it once, and I'll say it again. The bible contradicts itself, that is why it controls the minds of millions, because you can always find something you like in it even if that means you believe in something completly different from other 'Christians'.\n \n I will make a few points about what is said about some of these so called contradictions.\n \n Those who believe the passages quoted by easyrider are not against homosexuality, are.... crazy. But wait, this is not a special insult; anyone who believes the bible is any special authority on morality is.... also crazy.\n \n On slaves. God wants you to suffer and die serving others, of course he wants slavery; apparently that is his grand design on earth.\n \n Although there are many contradictions the basic theme is pretty clear, while other elements are very contradictory.\n \n Consistent:\n A human being is a depraved animal without god, your purpose on this planet is to 'love everybody' and surrender all earthly values, wealth, power, friendships, your own life..\n \n Inconsistent:\n God + People's tolerance for sinners (forgiving)\n \n Everything else is really just common ancient beliefs on morality turned parable and command. If you insist on chaining yourself to ancient dogma you well deserve any guilt you feel about who you are attracted to.", 
   {}, 
   436136, 
   null, 
   1312434000.0
  ], 
  [
   436199, 
   null, 
   "pappillion001", 
   "<< Matthew 26 <<\n New American Standard Bible \n \n -------------------------------------------------------------------------49Immediately Judas went to Jesus and said, \"Hail, Rabbi!\" and kissed Him. 50And Jesus said to him, \"Friend, do what you have come for.\" Then they came and laid hands on Jesus and seized Him. \n 51And behold, one of those who were with Jesus reached and drew out his sword, and struck the slave of the high priest and cut off his ear. 52Then Jesus said to him, \"Put your sword back into its place; for all those who take up the sword shall perish by the sword. 53\"Or do you think that I cannot appeal to My Father, and He will at once put at My disposal more than twelve legions of angels? \n \n \n \n \n \n IT SPECIFICALLY STATES THAT AFTER JUDAS, WHOM YES, WAS A TRAITOR, HAD KISSED JESUS, JESUS HAD STILL CALLED HIM FRIEND. Jesus was not afraid for his father would accept it, his father had set it all up. Judas was all part of the incident, where god had spoke to him also.. obviously god shouldn't be against gays, if he is alright with Judas kissing Jesus.\n\n \n This is one of the most jaw dropping examples of how Christians can't reconcile concepts that go beyond base emotion.\n \n They all agree Jesus came here to die to take the punishment intended for us.\n They all agree his death was necessary for their salvation.\n They all agree he knew when and how he would die.\n Thay al agree he willingly accepted his death prohibiting anyone from attempting to stop it.\n \n Why do they hate Judas and Jews (Jews I know and really has nothing to do with demanding the death of Jesus) \n If it wasn't for Judas they would all be burning in Hell right now or would be as soon as they died.", 
   {
    "unicode_changes_made": true
   }, 
   418612, 
   null, 
   1312450440.0
  ], 
  [
   436225, 
   null, 
   "pappillion001", 
   "Jesus said unless people repent of their sins, they will not enter the kingdom of heaven. Where is the repentance from the gay sex crowd?\n\n \n Maybe the same place yours is when you commit the same sin repeatedly. How is that plank coming along? \n \n \n\"Judge not, and you will not be judged.\" (Matthew 7:1)\n \n Jesus is not saying that we cannot make judgments about people, he is saying that we should not be hypocrites if we do. In Matthew 7:5 he says, \"You hypocrite, first take the plank out of your own eye, and then you can see clearly to remove the speck that is in your brothers eye.\"\n\n \n Being that all have sinned and will continue to do so how then can you expect to judge anyone? That plank is always there.\n \n \n \nGod acknowledges the legitimacy of civil authorities to judge:  \n \n Romans 13:1-4: \"Everyone must submit himself to the governing authorities, for there is no authority except that which God has established. The authorities that exist have been established by God. Consequently, he who rebels against the authority is rebelling against what God has instituted, and those who do so will bring judgment on themselves. (v. 4) For he (the reigning authority) is God's servant to do you good. But if you do wrong, be afraid, for he does not bear the sword for nothing. He is God's servant, an agent of God's wrath to bring punishment on the wrongdoer.\" (Also note Matthew 5:25; Acts 25:10-11)\n\n \n \n Obama will welcome you. Do you need a VOTE OBAMA bumper sticker for your car? How about a shirt? A hat?\n \n \n \nGod has commanded the church to make correct judgments:\n \n John 7:24: \"Stop judging by mere appearances, and make a right judgment.\"\n \n Matthew 18:15-17: \"If your brother sins against you, go and show him his fault, just between the two of you. If he listens to you, you have won your brother over. But if he will not listen, take one or two others along, so that every matter may be established by the testimony of two or three witnesses (note Deuteronomy 19:15). If he refuses to listen to them, tell it to the church; and if he refuses to listen even to the church, treat him as you would a pagan or a tax collector .\"\n\n \n \n Actually Matthew says work it out amongst yourselves and involve the church as a last resort. It gives no authority to do anything other than act as a mediator. \n \n You may want to consider that Roman law was unpopular with Jews and who were encouraged not to participate in it.\n \n \nGod commands us to judge according to one's 'fruits.'\n \n Matthew 7:17-20: \"Likewise, every good tree bears good fruit, but a bad tree bears bad fruit.....every tree that does not bear good fruit will be cut down and thrown into the fire. Thus, by their fruit you will recognize them.\"\n\n \n Jesus says how to recognize a false prophet. Read the Bible it helps when you make statements like this.\n \n \n \nSaints of Christ will judge the world, and angels:\n \n I Corinthians 6:2: \"Do you not know that the saints will judge the world?\"\n \n I Corinthians 6:3: \"Do you not know that we will judge angels?\"\n\n \n \n Would that not imply that the decision has not yet been made? If I am Satan's judge why should I fear him? \n \n \n \nJesus condemned the teachers of the law and the Pharisees:\n \n Matthew 23:27-28: \"Woe to you, teachers of the law and Pharisees, you hypocrites! You are like whitewashed tombs, which look beautiful on the outside but on the inside are full of dead men's bones and everything unclean. In the same way, on the outside you appear to people as righteous but on the inside you are full of hypocrisy and wickedness.\"\n\n \n Now that is a prophetic verse. Jesus describing the leaders of his unfounded church\n \n \n \nJohn the Baptist rebukes King Herod for adultery and other sins:\n \n Luke 3:19: \"But when John rebuked Herod the tetrarch because of Herodias, his brother's wife, and all the other things he had done, Herod added this to them all: He locked John up in prison.\" \n\n \n \n I think the idea of him being a rebel preaching about the corrupting influence of Rome had more to do with it than anything else. The fact that his actions started a war, killed sons, poisoned people got divorced would suggest he had a lot more issues than adultry.\n \n \nStephen rebukes the Jewish leaders:\n \n Acts 7:51-53: \"You stiff-necked people, with uncircumcised hearts and ears! You are just like your fathers: You always resist the Holy Spirit! Was there ever a prophet your fathers did not persecute? They even killed those who predicted the coming of the Righteous One. And now you have betrayed and murdered him - you who have received the law that was put into effect through angels but have not obeyed it.\" \n\n \n \n Find me a death row inmate who hasn't had a few words for his judge\n \n \nJesus rebukes the Christ-deniers:\n \n Jesus said to them, \"If God were your Father,\n \n \n If God were my father I would be Jesus. Since I am not that means .......\n \n \n \nyou would love me, for I have come here from God. I have not come on my own; God sent me. Why is my language not clear to you? Because you are unable to hear what I say. You belong to your father, the devil, and you want to carry out your father's desires.\n \n \n He shouts with a quivering lip and stamping his feet as he walks away.\n \n So if you don't believe me it is because your a child of the Devil\n \n \n \nHe was a murderer from the beginning, not holding to the truth, for there is no truth in him. When he lies, he speaks his native language, for he is a liar and the father of lies. Yet because I tell the truth, you do not believe me!\" - John 8:42-44\n\n \n \n According to the Bible that is wrong. If you or the Gospel writers had read Job and had common sense this would be obvious. Ironic how he defends his words as being true by making false claims.\n \n \n \nAlso note all the Old Testament prophets who condemned sin and corrupt moral leadership, and who were persecuted for their discernment and duty.\n\n \n Which ones? What happened to them? What chapter verse?", 
   {
    "unicode_changes_made": true
   }, 
   436057, 
   null, 
   1312488420.0
  ], 
  [
   436243, 
   null, 
   "Penfold", 
   "Easy should take guidance on homosexuality from Jesus. He said \". . . . . .\" emoticon_rolleyes", 
   {}, 
   436225, 
   null, 
   1312501260.0
  ], 
  [
   436245, 
   null, 
   "MrWriteLA", 
   "Easy should take guidance on homosexuality from Jesus. He said \". . . . . .\" emoticon_rolleyes\nIt should be more than obvious by now that EZ doesn't take guidance from Jesus on anything. Not on judging others, not on loving thy neighbor, not on being a Pharisee, not on the beam in his eye, not on anything.", 
   {}, 
   436243, 
   null, 
   1312506300.0
  ], 
  [
   436276, 
   null, 
   "poet", 
   "It should be more than obvious by now that EZ doesn't take guidance from Jesus on anything. Not on judging others, not on loving thy neighbor, not on being a Pharisee, not on the beam in his eye, not on anything.\n\n \n Hush, truth!", 
   {}, 
   436245, 
   null, 
   1312560960.0
  ], 
  [
   436321, 
   null, 
   "Easyrider", 
   "It should be more than obvious by now that EZ doesn't take guidance from Jesus on anything. Not on judging others, not on loving thy neighbor, not on being a Pharisee, not on the beam in his eye, not on anything.\n\n \n <Flush<\n \n Let's see you spawns of Satan warm up to this one from Jesus:\n \n \"I told you that you would die in your sins; if you do not believe that I am the one I claim to be, you will indeed die in your sins.&#8221; - John 8:24\n \n Repent, heathens. Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.", 
   {}, 
   436245, 
   null, 
   1312658580.0
  ], 
  [
   436325, 
   null, 
   "Accipiter", 
   "<Flush<\n \n Let's see you spawns of Satan warm up to this one from Jesus:\n \n \"I told you that you would die in your sins; if you do not believe that I am the one I claim to be, you will indeed die in your sins.\" - John 8:24\n \n Repent, heathens. Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n\n Jesus was not the son of god, he was just some crazy guy that went around spouting schizophrenic nonsense, how dumb are you people anyway?\n \n So you say you have a book that proves it's all real?\n \n I have a book that says Spider Man is real, big deal.\n \n Take you bible and hang it with the Sears catalog in your outhouse where it belongs you filthy animal.", 
   {
    "unicode_changes_made": true
   }, 
   436321, 
   null, 
   1312661220.0
  ], 
  [
   436328, 
   null, 
   "Easyrider", 
   "Jesus was not the son of god.... \n\n \n The Word of God refutes you.\n \n You're still lost, piter. Submit it to prayer so you might be saved.", 
   {}, 
   436325, 
   null, 
   1312666740.0
  ], 
  [
   436329, 
   null, 
   "Accipiter", 
   "The Word of God refutes you.\n\n \n Word of god? More like the ravings of a fool!\n \n You're a vile and bitter old man and your next response here will prove that because the devil, not god, is riding on your back and whipping your naked butt with a riding crop like in some kind of Nazi porno movie.\n \n Grow a pair looser.", 
   {}, 
   436328, 
   null, 
   1312668540.0
  ], 
  [
   436333, 
   null, 
   "Easyrider", 
   "Word of god? More like the ravings of a fool!\n \n\n \n Let's not confuse the Word of God with your pseudo-intellectual, Sodom and Gomorrah bath-house theology. I think it's quite obvious you've never really studied the Bible. Otherwise you wouldn't be so completely lost every time you refer to it. \n \n John 8:24, preppie.", 
   {}, 
   436329, 
   null, 
   1312675920.0
  ], 
  [
   436335, 
   null, 
   "Matthew S", 
   "Here is what is says about a God approved same sex couple. God loved David \n \n Would Jesus Discriminate? - David loved Jonathan more than women\n \n \n \nThe author of 1 Samuel tells of a man named Saul, who became king over Israel and fathered a son named Jonathan. David, who was a shepherd from the smallest of the tribes of Israel, came to the attention of Saul and Jonathan when he volunteered to fight a giant who was troubling their nation. The text tells us David was not afraid because he believed God was on the side of the Israelites. In a show of courage, David fought the giant with only a sling shot and a handful of pebbles. Miraculously, he was victorious. Saul was intrigued by this courageous young man, and so he called David to come talk to him, which brings us to Exhibit A. The text says:\n \n \n \"When David had finished speaking to Saul, the soul of Jonathan was bound to the soul of David, and Jonathan loved him as his own soul. Saul took him that day and would not let him return to his father's house. Then Jonathan made a covenant with David, because he loved him as his own soul. Jonathan stripped himself of the robe that he was wearing, and gave it to David, and his armor, and even his sword and his bow and his belt.\" (1 Samuel 18:1-4)\n \n Now, imagine if this story had been about Jonathan and a woman. Suppose the author had written that \"Jonathan's soul was bound to Mirriam, and Jonathan loved her as his own soul.\" And suppose that upon meeting Mirriam for the first time, Jonathan immediately gave her all his most precious possessions. (The armor and weapons of a prince were important symbols of his power and status.) If 1 Samuel 18:1-4 were about Jonathan's first encounter with a woman, theologians everywhere would be writing about this as one of the greatest love stories of all time. The story of Jonathan and his love would be the source of dozens of Hollywood films. But because the object of Jonathan's affection is a man, our cultural prejudice kicks in and we insist (notwithstanding the biblical evidence) that this could not have been more than deep friendship.\n \n This \"culturally correct\" reading will not withstand scrutiny. It asks us to put an interpretation on the story that is completely at odds with our own experience of human behavior. When was the last time you saw a heterosexual man, swept away by brotherly love, offer another man his most precious possessions in their first encounter? Suppose the pastor of your church (assuming he is a man), upon meeting another man for the first time, stripped himself of his suit and gave it to the other. Suppose in that same encounter he also offered his most precious possessions - perhaps a family Bible, a wristwatch with an inscription from his parents, and his beloved four-wheel drive pickup truck. Wouldn't this strike you as more than just a little \"queer\"? Let's face it, the author of 1 Samuel is describing a classic love-at-first-sight encounter that happens to involve two men.\n \n", 
   {
    "unicode_changes_made": true
   }, 
   436333, 
   null, 
   1312677660.0
  ], 
  [
   436336, 
   null, 
   "gansao", 
   "Here is what is says about a God approved same sex couple. God loved David \n \n Would Jesus Discriminate? - David loved Jonathan more than women\n\n \n Last time I looked brotherly love didnt include sodomy.\n Your problem is that you cant see past having sex with another man when you contemplate affection.", 
   {}, 
   436335, 
   null, 
   1312677960.0
  ], 
  [
   436342, 
   null, 
   "Penfold", 
   "Last time I looked brotherly love didnt include sodomy.\n Your problem is that you cant see past having sex with another man when you contemplate affection.\n\n \n Yours on the other hand, is that you can't see what's in front of you. \"Brotherly love\"?\n \n \"I am distressed for you, my brother Jonathan; You have been very pleasant to me. Your love to me was more wonderful Than the love of women.\"", 
   {}, 
   436336, 
   null, 
   1312684740.0
  ], 
  [
   436343, 
   null, 
   "Freedom", 
   "Yours on the other hand, is that you can't see what's in front of you. \"Brotherly love\"?\n \n \"I am distressed for you, my brother Jonathan; You have been very pleasant to me. Your love to me was more wonderful Than the love of women.\"\n\n We all knew the bible endorsed incest :P", 
   {}, 
   436342, 
   null, 
   1312685340.0
  ], 
  [
   436346, 
   null, 
   "Easyrider", 
   "Yours on the other hand, is that you can't see what's in front of you. \"Brotherly love\"?\n \n \"I am distressed for you, my brother Jonathan; You have been very pleasant to me. Your love to me was more wonderful Than the love of women.\"\n\n \n David married women, not men. \n \n Besides, even if he did have gay sex nowhere does it say God approved of it. Wise up.", 
   {}, 
   436342, 
   null, 
   1312692660.0
  ], 
  [
   436347, 
   null, 
   "Matthew S", 
   "David married women, not men. \n \n Besides, even if he did have gay sex nowhere does it say God approved of it. Wise up.\n\n \n You interpret the bible your way and we will interpret it ours.", 
   {}, 
   436346, 
   null, 
   1312692960.0
  ], 
  [
   436348, 
   null, 
   "Matthew S", 
   "Last time I looked brotherly love didnt include sodomy.\n Your problem is that you cant see past having sex with another man when you contemplate affection.\n\n \n That is the point David and Jonathon were lovers and each others husband. So anyone who says they were just good friends is missing the relationship between gay men.", 
   {}, 
   436336, 
   null, 
   1312693320.0
  ], 
  [
   436351, 
   null, 
   "Matthew S", 
   "We all knew the bible endorsed incest :P\n\n \n Of corse it does, but the christianists don't want to admit it. If it was just Adam and eve then where did the grandchildren come form. Then there is the whole lot and his daughters, Noah and his family, not to mention Abraham and Sarah, Jacob and Leah and Rachel. The bible is one big old incest orgy fest.", 
   {}, 
   436343, 
   null, 
   1312693500.0
  ], 
  [
   436355, 
   null, 
   "Easyrider", 
   "Of corse it does, but the christianists don't want to admit it. If it was just Adam and eve then where did the grandchildren come form. Then there is the whole lot and his daughters, Noah and his family, not to mention Abraham and Sarah, Jacob and Leah and Rachel. The bible is one big old incest orgy fest.\n\n \n Still trying to justify sodomy, Matthew? It's not working. Gay sex is a sin in numerous Biblical passages.", 
   {}, 
   436351, 
   null, 
   1312694340.0
  ], 
  [
   436368, 
   null, 
   "Matthew S", 
   "Still trying to justify sodomy, Matthew? It's not working. Gay sex is a sin in numerous Biblical passages.\n\n \n Only 2 and 2 are not numerous. Besides why don't you answer the incest question? God loves it when his people commit incest. Lot took and screwed his daughters and got them pregnant. Adam was doing his daughters, as well as Cain his sisters they were going at it like rabbits. Then there is Judahs son who was killed because he refused to screw his bothers widow.", 
   {}, 
   436355, 
   null, 
   1312723560.0
  ], 
  [
   436369, 
   null, 
   "gansao", 
   "Yours on the other hand, is that you can't see what's in front of you. \"Brotherly love\"?\n \n \"I am distressed for you, my brother Jonathan; You have been very pleasant to me. Your love to me was more wonderful Than the love of women.\"\n\n \n That doesnt imply that they had sex.\n Only in your dirty little mind...which may be your problem", 
   {}, 
   436342, 
   null, 
   1312724640.0
  ], 
  [
   436370, 
   null, 
   "gansao", 
   "That is the point David and Jonathon were lovers and each others husband. So anyone who says they were just good friends is missing the relationship between gay men.\n\n \n Where does it state that David and Jonathon were lovers?\n You gays cannot believe that two men can be extremely close, even love each other without wanted to have deviant sex.", 
   {}, 
   436348, 
   null, 
   1312724760.0
  ], 
  [
   436374, 
   null, 
   "Easyrider", 
   "Only 2 and 2 are not numerous. Besides why don't you answer the incest question? God loves it when his people commit incest. Lot took and screwed his daughters and got them pregnant. Adam was doing his daughters, as well as Cain his sisters they were going at it like rabbits. Then there is Judahs son who was killed because he refused to screw his bothers widow.\n\n \n Is Incest Okay?\n \n No, incest is not okay. Incest is the sexual relations between family members either by birth or marriage. God has forbidden this in the Bible.\n \n Lev. 20:11-12, \"If there is a man who lies with his father's wife, he has uncovered his father's nakedness; both of them shall surely be put to death, their bloodguiltiness is upon them. 12 If there is a man who lies with his daughter-in-law, both of them shall surely be put to death; they have committed incest, their bloodguiltiness is upon them.\"\n \n Lev. 20:19-21, \"You shall also not uncover the nakedness of your mother's sister or of your father's sister, for such a one has made naked his blood relative; they shall bear their guilt. 20 If there is a man who lies with his uncle's wife he has uncovered his uncle's nakedness; they shall bear their sin. They shall die childless. 21 If there is a man who takes his brother's wife, it is abhorrent; he has uncovered his brother's nakedness. They shall be childless.\"\n \n But some may point out that Adam and Eve had children and since there were no other people around, their children would have had to commit incest in order to produce more children.  At the time of creation, the genetic line was pure. It wasn't until later, at the time of Moses, that incest was then forbidden as the genetic pool became less and less able to stand interbreeding.\n \n  \"No one is to approach any close relative to have sexual relations. I am the LORD,\" (Lev. 18:6).\n \n Is incest okay? | Christian Apologetics and Research Ministry\n \n And, gay sex is also forbidden.\n \n You're busted.", 
   {}, 
   436368, 
   null, 
   1312727820.0
  ], 
  [
   436386, 
   null, 
   "Accipiter", 
   "Is Incest Okay?\n \n No, incest is not okay. Incest is the sexual relations between family members either by birth or marriage. God has forbidden this in the Bible.\n \n Lev. 20:11-12, \"If there is a man who lies with his father's wife, he has uncovered his father's nakedness; both of them shall surely be put to death, their bloodguiltiness is upon them. 12 If there is a man who lies with his daughter-in-law, both of them shall surely be put to death; they have committed incest, their bloodguiltiness is upon them.\"\n \n Lev. 20:19-21, \"You shall also not uncover the nakedness of your mother's sister or of your father's sister, for such a one has made naked his blood relative; they shall bear their guilt. 20 If there is a man who lies with his uncle's wife he has uncovered his uncle's nakedness; they shall bear their sin. They shall die childless. 21 If there is a man who takes his brother's wife, it is abhorrent; he has uncovered his brother's nakedness. They shall be childless.\"\n \n But some may point out that Adam and Eve had children and since there were no other people around, their children would have had to commit incest in order to produce more children.  At the time of creation, the genetic line was pure. It wasn't until later, at the time of Moses, that incest was then forbidden as the genetic pool became less and less able to stand interbreeding.\n \n  \"No one is to approach any close relative to have sexual relations. I am the LORD,\" (Lev. 18:6).\n \n Is incest okay? | Christian Apologetics and Research Ministry\n \n And, gay sex is also forbidden.\n \n You're busted.\n\n The bible contradicts itself.\n \n On more reason why only fools live by it.\n \n Grow up and stop hiding behind god you cry baby.", 
   {}, 
   436374, 
   null, 
   1312731540.0
  ], 
  [
   436390, 
   null, 
   "Easyrider", 
   "The bible contradicts itself.\n \n On more reason why only fools live by it.\n \n Grow up and stop hiding behind god you cry baby.\n\n \n When I want the opinion of a spiritually-dead nincompoop I'll call you.", 
   {}, 
   436386, 
   null, 
   1312736340.0
  ], 
  [
   436391, 
   null, 
   "Accipiter", 
   "When I want the opinion of a spiritually-dead nincompoop I'll call you.\n\n \n The bible makes people stupid and you are living proof.", 
   {}, 
   436390, 
   null, 
   1312737120.0
  ], 
  [
   436396, 
   null, 
   "Freedom", 
   "Is Incest Okay?\n \n No, incest is not okay. Incest is the sexual relations between family members either by birth or marriage. God has forbidden this in the Bible.\n \n Lev. 20:11-12, \"If there is a man who lies with his father's wife, he has uncovered his father's nakedness; both of them shall surely be put to death, their bloodguiltiness is upon them. 12 If there is a man who lies with his daughter-in-law, both of them shall surely be put to death; they have committed incest, their bloodguiltiness is upon them.\"\n \n Lev. 20:19-21, \"You shall also not uncover the nakedness of your mother's sister or of your father's sister, for such a one has made naked his blood relative; they shall bear their guilt. 20 If there is a man who lies with his uncle's wife he has uncovered his uncle's nakedness; they shall bear their sin. They shall die childless. 21 If there is a man who takes his brother's wife, it is abhorrent; he has uncovered his brother's nakedness. They shall be childless.\"\n \n But some may point out that Adam and Eve had children and since there were no other people around, their children would have had to commit incest in order to produce more children.  At the time of creation, the genetic line was pure. It wasn't until later, at the time of Moses, that incest was then forbidden as the genetic pool became less and less able to stand interbreeding.\n \n  \"No one is to approach any close relative to have sexual relations. I am the LORD,\" (Lev. 18:6).\n \n Is incest okay? | Christian Apologetics and Research Ministry\n \n And, gay sex is also forbidden.\n \n You're busted.\n\n If the reason god outlawed incest is because it's problematic genetically, then god will have no problem if by genetic analysis we predict no emergent negative traits from a particular match?", 
   {}, 
   436391, 
   null, 
   1312743360.0
  ], 
  [
   436401, 
   null, 
   "Matthew S", 
   "Where does it state that David and Jonathon were lovers?\n You gays cannot believe that two men can be extremely close, even love each other without wanted to have deviant sex.\n\n \n Once again read the bolded\n \n \nThis \"culturally correct\" reading will not withstand scrutiny. It asks us to put an interpretation on the story that is completely at odds with our own experience of human behavior. When was the last time you saw a heterosexual man, swept away by brotherly love, offer another man his most precious possessions in their first encounter? Suppose the pastor of your church (assuming he is a man), upon meeting another man for the first time, stripped himself of his suit and gave it to the other. Suppose in that same encounter he also offered his most precious possessions - perhaps a family Bible, a wristwatch with an inscription from his parents, and his beloved four-wheel drive pickup truck. Wouldn't this strike you as more than just a little \"queer\"? Let's face it, the author of 1 Samuel is describing a classic love-at-first-sight encounter that happens to involve two men.\n\n \n But we go on there is more to the story\n \n \n \nBut there is more to the story than this one meeting. The text goes on to tell us David became a mighty warrior, and his popularity with the people of Israel threatened Saul's throne, so Saul planned to kill David. But Jonathan warned David, and he fled the palace before Saul could act. Eventually, Jonathan convinced his father to allow David back, but Saul soon planned again to kill David. This time he did not tell Jonathan (he'd learned his lesson the first time), but David was able to escape anyway.\n \n Then Jonathan and David met in secret. Jonathan begged David to come back to the palace, but David was afraid for his life. So they made a plan: Jonathan would go home and try to find out what his father was thinking. If his father had cooled down, he would let David know it was safe.\n \n One night, at the royal table, the subject of David came up, and Jonathan spoke on his behalf. Saul's reaction is Exhibit B. Saul said to Jonathan:\n \n \n \"You son of a perverse, rebellious woman! Do I not know that you have chosen [David] the son of Jesse to your own shame and to the shame of your mother's nakedness? For as long as the son of Jesse lives upon the earth, neither you nor your kingdom shall be established.\" (1 Samuel 20:30)\n \n Many gay men have experienced dinner conversations that sounded very similar to this one. They made the mistake of talking about their lover at the table, and their father became furious. More often than not, the blame goes first to the mother, who was \"too soft,\" or \"too harsh,\" or who \"perverted\" her son somehow. Then the father turns his anger toward the son: \"Can't you see how you're shaming the whole family? Do you even care what this will do to your career? You'll never amount to anything until you give up this foolishness!\"\n In the biblical text, the arguments are the same. And, even more significantly, Saul's reference to shaming Jonathan's mother's nakedness carries a sexual connotation. Uncovering the nakedness of a family member was a euphemism for incest in the holiness codes of the Old Testament, and Saul would not have used this phrase lightly. (See note 1.) The implication is that Jonathan is bringing sexual shame on his family.\n\n \n But wait there is more\n \n \nJonathan immediately ran from the table. And, that night, he went to tell David the sad news. The narrative of their final meeting is full of tragedy and pathos, and constitutes Exhibit C.\n \n \n \"David rose from beside the stone heap and prostrated himself with his face to the ground. He bowed three times and they kissed each other and wept with each other; David wept the more. Then Jonathan said to David, 'Go in peace, since both of us have sworn in the name of the Lord, saying, \"The Lord shall be between me and you, and between my descendants and your descendants, forever.\" ' He got up and left; and Jonathan went into the city.\" (1 Samuel 20:41-42)\n \n\n \n yet still more\n \n \nIn the first chapter of 2 Samuel, the author tells us that after Saul and Jonathan were killed in battle, David tore his clothes and fasted, a sign of deep mourning. He wept and wrote a song, which he ordered all the people of Judah to sing. In that song, he included these words, which are Exhibit D:\n \n \n \"Saul and Jonathan, beloved and lovely! \n In life and in death they were not divided; \n they were swifter than eagles, \n they were stronger than lions. \n How the mighty have fallen in the midst of battle! \n Jonathan lies slain upon your high places. \n I am distressed for you my brother Jonathan; \n Greatly beloved were you to me; \n your love to me was wonderful, passing the love of women.\" \n (2 Samuel 1:23, 26-27, emphasis added)\n \n Here it is in black and white. David states the love he shared with Jonathan was greater than what he had experienced with women. Have you ever heard a heterosexual man say he loved his male friend more than his wife? This goes well beyond deep friendship between two heterosexual men.\n In this story, we have a direct biblical answer to our question: Can two people of the same sex live in a loving, committed relationship with God's favor? The answer is \"yes,\" because Jonathan and David did, and the Bible celebrates their relationship. \n \n\n \n Wait still more\n \n\n The author feels no need to explain away the love between these two men, putting in a note saying \"this may look like a love story, but no hanky-panky happened.\" When King Saul assumes the relationship is much more than friendship, the author leaves Saul's comments in, and lets the reader assume the same. The author also would have been aware of this story's similarity to other ancient Near-eastern stories that contained homoerotic aspects. (See note 3.) He would have known his story would be interpreted by readers of his time with these other accounts in mind, yet he did not bother to differentiate Jonathan and David's relationship.\n \n Under inspiration of the Holy Spirit, the author of 1 and 2 Samuel wrote this beautiful love story and saw no conflict between it and the earlier Scriptures in Leviticus. How is this possible? Apparently the author of 1 and 2 Samuel understood the Leviticus passage the same way we do, seeing it as a condemnation of Canaanite temple sex which, therefore, had no application to a deep romantic relationship between two men who loved and served the God of Israel. (See Israel's Holiness Code for a complete discussion.) If someone had challenged the author of 1 and 2 Samuel, he might well have responded, \"This is not what Leviticus was meant to condemn. You've got to understand the context in which Leviticus was written. This is a very different situation.\"\n \n Why can't we use the same common sense today? Why are some Christians so determined to condemn what God has so clearly approved in Scripture?\n \n Note 4. The Bible tells us both David and Jonathan married. (1 Samuel 25:39-42; 2 Samuel 3:14; 4:4; 9:3-7; 11:27) This is not inconsistent with a romantic relationship between them. Even today, many homosexual people marry and bear children to conform to social pressures. As a prince, Jonathan would have had no choice but to marry, so as to bear a son to become his heir. David would have faced similar pressures. Other Bible stories indicate David was capable of feeling lust for women. (2 Samuel 11:2-26) He appears to have been what we today would call a bisexual - someone capable of forming a deep romantic relationship with persons of either sex. By contrast, based on what we find in Scripture, David seems to have been Jonathan's only sincere romantic interest. He appears to have been what we today would call a gay man.\n \n \n Remember, David is not some minor hero in the Bible. He is called \"a man after God's own heart.\" (1 Samuel 13:14) He is one of Israel's best-loved kings. He is one of the most prolific writers of Scripture (writing many of the Psalms). He is in the lineage of Jesus Christ. And he loved Jonathan. (See note 4.)\n \n", 
   {
    "unicode_changes_made": true
   }, 
   436370, 
   null, 
   1312745100.0
  ], 
  [
   436402, 
   null, 
   "gansao", 
   "Once again read the bolded\n \n \n \n But we go on there is more to the story\n \n \n \n \n But wait there is more\n \n \n \n yet still more\n \n \n \n Wait still more\n\n \n What a crock of XXXX.\n When have you seen ANYONE offer strip themselves og their clothing and give it to ANYONE else when they first meet.\n Did you do that to your boyfriend when you first met him?\n If this action meant that it was done because david wanted deviant sex then wouldnt this be the norm for heteros and randy gays?\n Of course later on Jesus said that we should give the shirt off of our backs to others in need....in exchange for sex of course lol\n How many wives have complained that their husband thinks more of their friends than them.....quite a few.\n Try again Matthew, when you find a reference of david jumping jonathans bones then come back.", 
   {}, 
   436401, 
   null, 
   1312745760.0
  ], 
  [
   436406, 
   null, 
   "Matthew S", 
   "How many wives have complained that their husband thinks more of their friends than them.....quite a few.\n .\n\n \n So you are saying that it is common for wives to complain that their husbands love their friends more then them?\n \n True the gay personals are full of married straight guys looking for gay sex.", 
   {}, 
   436402, 
   null, 
   1312750200.0
  ], 
  [
   436411, 
   null, 
   "gansao", 
   "So you are saying that it is common for wives to complain that their husbands love their friends more then them?\n \n True the gay personals are full of married straight guys looking for gay sex.\n\n \n You would never have been told by a wife that you prefer, football, mates, cars etc more than them.\n If these guys are looking for gay sex then they would not be straight would they?\n Women including wives were considered uneducated chattels in the times of David so would not be seen in the same way as wives are now.\n What you need to understand is that men can have very deep bonds between each other without wanting to have deviant sex...sorry to burst your fantasy bubble", 
   {}, 
   436406, 
   null, 
   1312751940.0
  ], 
  [
   436416, 
   null, 
   "Easyrider", 
   "\n \n True the gay personals are full of married straight guys looking for gay sex.\n\n \n I've had a lot of married friends and have never even heard of one looking for gay sex.\n \n Getting back to David, even if he did do gay sex, there's not one piece of evidence God ever approved of it. To the contrary, God forbids gay sex.\n \n You're busted.", 
   {}, 
   436406, 
   null, 
   1312759560.0
  ], 
  [
   436417, 
   null, 
   "gansao", 
   "I've had a lot of married friends and have never even heard of one looking for gay sex.\n \n Getting back to David, even if he did do gay sex, there's not one piece of evidence God ever approved of it. To the contrary, God forbids gay sex.\n \n You're busted.\n\n \n Good point.\n David was an adulterer too and god does not approve of adultery.\n As EZ says, you're busted lolemoticon_xgood", 
   {}, 
   436416, 
   null, 
   1312759740.0
  ], 
  [
   436421, 
   null, 
   "Matthew S", 
   "Good point.\n David was an adulterer too and god does not approve of adultery.\n As EZ says, you're busted lolemoticon_xgood\n\n \n Don't bitch at me take to the biblical scholars at the site I linked. This only shows that if EZ can interpret the bible as a book at that hates gay people we can interpret the bible to be supportive of gay people.\n \n Would Jesus Discriminate? - Biblical Evidence\n \n\n Biblical evidence\n \n Can two people of the same sex live in committed, loving relationship with the blessing of God?\n \n As we grapple with this question, we will look at two sets of Scriptures: those that affirm gay and lesbian people, and those that are traditionally used to condemn gay people.\n \n Affirmation in Scripture\n \n On this web site we discuss five passages of Scripture that affirm gay people and their relationships.\n \n These stories, which the writers of the Bible included under inspiration of the Holy Spirit, are amazingly gay-positive. Odds are, you have never heard about these passages and their meaning for sexual minorities. The truth of these texts threatens some of our society&#8217;s deepest prejudices, and their positive messages are usually ignored. It is our hope they will bring comfort and refreshment to many.\n \n Are there really only six?\n \n Given how often some Christians preach against homosexuality, you would think there must be hundreds of Scriptures on the subject. In fact, there are only six traditional (negative) passages, and none of them speaks to the situation of twenty-first century gay people who desire to live in loving relationships with the blessing of God. On this web site, we carefully walk through each of these passages and document what they do and don't say.\n \n Prejudice can influence how we read the Bible -- An example from the recent past. \n In The Adventures of Huckleberry Finn, young Huck&#8217;s father is thought to be dead, and a woman named Widow Douglas takes him in. Widow Douglas is portrayed as a kindly Christian who takes care of Huck out of goodness, with no thought of reimbursement. The Widow Douglas tries to &#8220;civilize&#8221; Huck, teaching him Bible stories and urging him to live a good life and pray often. She is a loving woman who studies her Bible and wants to always do the right thing. She is also a slave owner.\n \n Later in the story, Huck runs away and happens upon Jim, a slave belonging to Widow Douglas&#8217;s sister, Miss Watson. The sister had intended to sell Jim to a trader in New Orleans. So, fearing he would never see his wife and children again, Jim runs away. He plans to escape to freedom, make some money, and buy his wife and children out of slavery. Huck and Jim&#8217;s adventures as they travel together down the Mississippi make up the rest of the book.\n \n At every turn, Huck finds himself feeling guilty for &#8220;stealing&#8221; Miss Watson&#8217;s &#8220;property.&#8221; He believes he will go to hell for helping Jim escape, and it is clear his Christian education under Widow Douglas is part of the reason he believes this. For all her kindness and goodness, Widow Douglas reads the Bible the same way most of her friends do. She believes slavery is an institution approved by God. She probably believes all African Americans are descended from Ham and the curse recorded in Genesis 9:25-27 demonstrates why they deserve slavery. She sees nothing wrong with buying and selling people because her interpretation of the Bible tells her this is the proper role of those of European descent. In short, she allows her prejudices to mold the way she reads the Bible.\n This may seem like an extreme example. Only the most bigoted Christian would argue today that the Bible endorses slavery or that Genesis 9:25-27 is a curse against Africans. But Huck&#8217;s story illustrates how thoroughly we are creatures of our culture and how that culture can create prejudices that get in the way of what God wants to teach us.\n The information on this site will challenge some of the deepest prejudices of our culture, prejudices that even gay people have often internalized. We will look at Scriptures that dispute some of our most deeply held beliefs, and we must be willing to let God move. In the end, our response will decide if our prejudices mold the Bible, or if we are willing to let the Bible mold us.\n \n The good news at the end of The Adventures of Huckleberry Finn is that Miss Watson, who always felt guilty for almost selling Jim, freed him in her will. Perhaps she was able to read the Bible with a fresh perspective. Perhaps she listened to the tugging of God&#8217;s Spirit on her soul. Whatever the cause, she and Jim were both finally free.\n \n As you read the pages of this web site, try to set aside any prejudices you may have about the subject. Listen to the Spirit of God speaking through these Scriptures. And perhaps you, like Miss Watson and Jim, will be freed.\n \n \n \n Jesus affirmed a gay couple. Matthew 8:5-13\n \n The Greek word that the Roman centurion uses in this passage to describe the sick man &#8211; pais &#8211; is the same word used in ancient Greek to refer to a same-gender partner. Get more information.\n \n \n Ruth loved Naomi as Adam loved Eve. Genesis 2:24, Ruth 1:14\n \n The same Hebrew word that is used in Genesis 2:24 to describe how Adam felt about Eve (and how spouses are suppose to feel toward each other) is used in Ruth 1:14 to describe how Ruth felt about Naomi. Her feelings are celebrated, not condemned. And throughout Christian history, Ruth's vow to Naomi has been used to illustrate the nature of the marriage covenant. These words are often read at Christian wedding ceremonies and used in sermons to illustrate the ideal love that spouses should have for one another. The fact that these words were originally spoken by one woman to another tells us a lot about how God feels about same-gender relationships. Get more information.\n \n Jesus said some are born gay. Matthew 19:10-12\n \n Here Jesus refers to \"eunuchs who have been so from birth.\" This terminology (\"born eunuchs\") was used in the ancient world to refer to homosexual men. Jesus indicates that being a \"born eunuch\" is a gift from God. Get more information.\n \n \n The early church welcomed a gay man. Acts 8:26-40\n \n In the ancient world, eunuchs were widely associated with homosexuality. Here a self-avowed eunuch is welcomed in to the early church without any concerns about his sexual orientation. He was welcomed on the same basis as other people -- his faith in Jesus Christ. Get more information.\n \n \n David loved Jonathan more than women. II Samuel 1:26\n \n At Jonathan&#8217;s funeral, David declares that he loved Jonathan more than any woman. This is just one of several Bible passages that describe and celebrate an intense love between these two men that went well beyond friendship. Get more information.\n \n \n Idol Worship and Rejection of God. Romans 1:21-28\n \n In these verses, Paul condemns idol worshippers and God haters. According to Paul, these &#8220;God haters&#8221; experiment with gay sex only as a way of seeking new thrills or in cultic worship. Clearly, he is not speaking about innately gay and lesbian people, who love God and want to honor God while living with integrity as who they are. Get more information.\n \n \n Israel's Holiness Code. Leviticus 18 and 20\n \n The chapters that contain these verses are clearly identified as speaking against practices involved in cultic idol worship. The entire passages are generally accepted as not applying to modern Christian life. Get more information.\n \n \n Sodom and Gomorrah. Genesis 19 & Jude 7\n \n The Genesis 19 account of Sodom and Gomorrah is a story of attempted gang rape of two \"outsiders.\" It says nothing about loving gay relationships, and actually condemns the sort of violence sometimes done to gays and lesbians. Jude 7 talks about a first century Jewish legend that the women of Sodom had sex with male angels. Since it is about heterosexual sex between angels and humans, it clearly has nothing to do with gay relationships. Get more information.\n \n \n No Fems? No Fairies? I Corinthians 6:9-10 and I Timothy 1:10\n \n The words often translated \"effeminate\" and &#8220;homosexual&#8221; in these passages are obscure and difficult to translate. The first word identifies someone who is morally weak, and has nothing to do with nellie gay men. The second word probably means &#8220;people who use power to obtain sex,&#8221; though the word is so rare that a confident translation is impossible. Neither word refers specifically to gay men or lesbians. Get more information.\n", 
   {}, 
   436417, 
   null, 
   1312763100.0
  ], 
  [
   436423, 
   null, 
   "gansao", 
   "Don't bitch at me take to the biblical scholars at the site I linked. This only shows that if EZ can interpret the bible as a book at that hates gay people we can interpret the bible to be supportive of gay people.\n \n Would Jesus Discriminate? - Biblical Evidence\n\n \n Im not bitching at you .\n It doesnt take a biblical scholar to say that Jesus said nothing about homosexuals but it certainly states that homosexuality is sinful in the bible.\n If you want to intrepret the bible as supporting gay people then go ahead.\n Just dont get upset when I laughemoticon_xclown\n Your quote says a lot of 'clearly' when it is not clear and some' probably's when it it is probably not lol", 
   {}, 
   436421, 
   null, 
   1312763760.0
  ], 
  [
   436433, 
   null, 
   "Provocateaur", 
   "What a crock of XXXX.\n When have you seen ANYONE offer strip themselves og their clothing and give it to ANYONE else when they first meet.\n Did you do that to your boyfriend when you first met him?\n If this action meant that it was done because david wanted deviant sex then wouldnt this be the norm for heteros and randy gays?\n\n \n It may not be the norm for anyone who's sexually attracted to another, regardless of sexual orientation. However, it's even far less normal and explainable that someone would strip like that, without it being sexual, with it being just really good friends.\n \n \nOf course later on Jesus said that we should give the shirt off of our backs to others in need....in exchange for sex of course lol\n\n \n In this case, the person watching the strip show wasn't in dire need of the other's clothing. The clothing wasn't being offered as charity.\n \n \nHow many wives have complained that their husband thinks more of their friends than them.....quite a few.\n\n \n How many straight husbands say they love their male friend more than their wife or any woman they could conceive of?", 
   {}, 
   436402, 
   null, 
   1312774500.0
  ], 
  [
   436434, 
   null, 
   "Provocateaur", 
   "I've had a lot of married friends and have never even heard of one looking for gay sex.\n \n Getting back to David, even if he did do gay sex, there's not one piece of evidence God ever approved of it. To the contrary, God forbids gay sex.\n \n You're busted.\n\n \n Perhaps he will be blessed and saved and made to greatly prosper, not busted, like the other sinners of whom we read. Adam and Eve and their kids, Abraham marrying his sister Sarah, Lot having sex and being blessed with children by his own daughters. Then there were all the hetero male figures, having affairs, not being punished, and all continuing to prosper under God's supposedly watchful eye and wrathful nature.", 
   {}, 
   436416, 
   null, 
   1312774920.0
  ], 
  [
   436435, 
   null, 
   "Easyrider", 
   "Perhaps he will be blessed and saved and made to greatly prosper, not busted, like the other sinners of whom we read. Adam and Eve and their kids, Abraham marrying his sister Sarah, Lot having sex and being blessed with children by his own daughters. Then there were all the hetero male figures, having affairs, not being punished, and all continuing to prosper under God's supposedly watchful eye and wrathful nature.\n\n \n I suspect that they repented of their sins, which gay sex sinners won't do because of their ego's.\n \n \"But unless you repent, you too will all perish.\" - Jesus, Luke 13:3\n \n Where's the repentance from the gay sex sinners? \n \n You think Jesus wasn't serious? Then go to your collective Judgments and find out.", 
   {}, 
   436434, 
   null, 
   1312775220.0
  ], 
  [
   436436, 
   null, 
   "Easyrider", 
   "Don't bitch at me take to the biblical scholars at the site I linked. This only shows that if EZ can interpret the bible as a book at that hates gay people we can interpret the bible to be supportive of gay people.\n \n\n \n You're steeped in lies and folly, Matthew. God hates sin (gay sex sin, etc.), not gays per se. Same with me.\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n \n \"But unless you repent, you too will all perish.\" - Jesus, Luke 13:3", 
   {}, 
   436421, 
   null, 
   1312775460.0
  ], 
  [
   436437, 
   null, 
   "Provocateaur", 
   "I suspect that they repented of their sins,\n\n \n You wildly speculate, but it doesn't say they ever repented while continuing to be blessed and to prosper. I certainly hope you're not trying to make things up about God's direct, perfect, unquestionable, written word!\n \n \n\"But unless you repent, you too will all perish.\" - Jesus, Luke 13:3\n \n Where's the repentance from the gay sex sinners? \n \n You think Jesus wasn't serious? Then go to your collective Judgments and find out.\n\n \n But they didn't perish, they kept sinning, they didn't repent, and they prospered. So why should we stop sinning and repent? What is the point of helping sinners in this life, but supposedly hurting them after they are dead?", 
   {}, 
   436435, 
   null, 
   1312776000.0
  ], 
  [
   436440, 
   null, 
   "Provocateaur", 
   "God also said, were Adam and Eve to eat fruit from the tree of knowledge, they would, \"surely die.\" They didn't die as a result of that. From the beginning, we could never count on the Biblical God to tell us the truth.", 
   {}, 
   436437, 
   null, 
   1312777920.0
  ], 
  [
   436460, 
   null, 
   "gansao", 
   "God also said, were Adam and Eve to eat fruit from the tree of knowledge, they would, \"surely die.\" They didn't die as a result of that. From the beginning, we could never count on the Biblical God to tell us the truth.\n\n \n I thought that died because they disobeyed god and ate from the tree of knowledge.\n Still, you know bestemoticon_rolleyes", 
   {}, 
   436440, 
   null, 
   1312809360.0
  ], 
  [
   436480, 
   null, 
   "jyoshu", 
   "God also said, were Adam and Eve to eat fruit from the tree of knowledge, they would, \"surely die.\" They didn't die as a result of that. From the beginning, we could never count on the Biblical God to tell us the truth.\n\n \n They didn't? Where are they, then?", 
   {}, 
   436440, 
   null, 
   1312824240.0
  ], 
  [
   436499, 
   null, 
   "Easyrider", 
   "You wildly speculate, but it doesn't say they ever repented while continuing to be blessed and to prosper.\n\n \n Where does it say they didn't repent? And if they didn't then perhaps they're lost, like unrepentant gays will be come Judgment day.", 
   {}, 
   436437, 
   null, 
   1312843320.0
  ], 
  [
   436513, 
   null, 
   "pappillion001", 
   "They didn't? Where are they, then?\n\n \n I think the point is the trustworthyness of God. Along those lines I would like to add my comments concerning the verse inquestion\n \n 17 But of the tree of the knowledge of good and evil thou shalt not eat of it for in the day that thou eatest thereof thou shalt surely die\n \n This is from the KJV stating the day he eats from the ToKoGE he will die. He didn't. \n \n The serpent didn't lie to Eve. The serpent stated that they would not die and they didn't. The serpent said that they would know good and evil like God if they did. Which God confirms has happened when he takes them out of the Garden and away from the Tree of Life because he does not want them to live forever.\n \n And he said unto the woman Yea hath God said Ye shall not eat of every tree of the garden 2 And the woman said unto the serpent We may eat of the fruit of the trees of the garden 3 But of the fruit of the tree which is in the midst of the garden God hath said Ye shall not eat of it neither shall ye touch it lest ye die 4 And the serpent said unto the woman Ye shall not surely die 5 For God doth know that in the day ye eat thereof then your eyes shall be opened and ye shall be as gods knowing good and evil \n \n 22 And the LORD God said Behold the man is become as one of us to know good and evil and now lest he put forth his hand and take also of the tree of life and eat and live for ever 23 Therefore the LORD God sent him forth from the garden of Eden to till the ground from whence he was taken 24 So he drove out the man and he placed at the east of the garden of Eden Cherubims and a flaming sword which turned every way to keep the way of the tree of life\n \n I would also like to point out that God placed Adam and Eve in a state of evil and shame. When he made them they were naked and unashamed. Now they eat from The Tree of Knowledge of Good and Evil and what changes that they are now aware of what good is and what evil is. When God asks where they are Adam says they hid because they were naked, to which God responds asking who told them. Becoming angry that they now knew. As confirmation that God had placed them in sin what does he now do that he did not do before? He makes them clothing. Why now?\n \n God wanted two young naked people completely naive to run around and act as his gardener and play things that was our purpose read Genesis that is exactly what it says period.\n \n But that is not what we are led to believe, because we want it to be something bigger and significant and we want God to be pleased and we need for God to care about us and then need a reason why we hurt and feel afraid and alone so we make it our fault because then we have hope that one day Dad will come back and everything will be wonderful. \n \n God was a bad Dad we were not bad kids and that is the reason he isn't coming back and not because Billy is gay", 
   {}, 
   436480, 
   null, 
   1312876920.0
  ], 
  [
   436515, 
   null, 
   "Easyrider", 
   "\n The serpent didn't lie to Eve. The serpent stated that they would not die and they didn't. \n\n \n Sure they did. Like Jyoshu asked, if they didn't die where are they?", 
   {}, 
   436513, 
   null, 
   1312894980.0
  ], 
  [
   436522, 
   null, 
   "Accipiter", 
   "Where does it say they didn't repent? And if they didn't then perhaps they're lost, like unrepentant gays will be come Judgment day.\n\n \n I have a question, where does god send mor ons come judgment day?", 
   {}, 
   436499, 
   null, 
   1312900500.0
  ], 
  [
   436523, 
   null, 
   "gansao", 
   "I have a question, where does god send mor ons come judgment day?\n\n Dont worry, you wont be lonelyemoticon_xangel", 
   {}, 
   436522, 
   null, 
   1312900800.0
  ], 
  [
   436532, 
   null, 
   "pappillion001", 
   "Sure they did. Like Jyoshu asked, if they didn't die where are they?\n\n \n Did they die that day? No. Did God say they would? Yes. Would they have died if they had not eaten the fruit? Yes. Would they have lived if God had not taken them from the Tree of Life? Yes. Did they die as a result of eating the fruit? No. Did the serpent tell them they would not? Yes. Did the serpent say they would be like God to know Good and Evil? Yes. Did they? Yes. The serpent did not lie then did he?\n \n I hear the pound has puppies, you may want to look at getting a new dog.", 
   {}, 
   436515, 
   null, 
   1312926780.0
  ], 
  [
   436533, 
   null, 
   "Freedom", 
   "God didn't say anything, he's not sending anyone anywhere, he doesn't exist as far as we know.\n Freedom - 1:1\n \n And behold the one called easyrider doesn't care about any of thine points.\n \n Freedom - 1:2\n \n (The freedom poster) said \"Who is it who would argue about ancient, arbitrary, contradictory, fictional books to persuade the deluded?\" The very bored sayeth he.\n Freedom - 1:3", 
   {}, 
   436532, 
   null, 
   1312927500.0
  ], 
  [
   436547, 
   null, 
   "pappillion001", 
   "God didn't say anything, he's not sending anyone anywhere, he doesn't exist as far as we know.\n Freedom - 1:1\n \n And behold the one called easyrider doesn't care about any of thine points.\n \n Freedom - 1:2\n \n (The freedom poster) said \"Who is it who would argue about ancient, arbitrary, contradictory, fictional books to persuade the deluded?\" The very bored sayeth he.\n Freedom - 1:3\n\n \n The book of Fredom is wise", 
   {}, 
   436533, 
   null, 
   1312941360.0
  ], 
  [
   436550, 
   null, 
   "Matthew S", 
   "The book of Fredom is wise\n\n \n to a point then it skids off a cliff.", 
   {}, 
   436547, 
   null, 
   1312943760.0
  ], 
  [
   436553, 
   null, 
   "Freedom", 
   "to a point then it skids off a cliff.\n\n This book does not skid off a cliff.\n Freedom 1:4\n \n (sorry I couldn't help it)", 
   {}, 
   436550, 
   null, 
   1312945920.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  What the Bible really says or doesn't say about being gay", 
  "url": "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 14734, 
  "discussion_files": [
   [
    "18876.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-print.html"
   ], 
   [
    "18877.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-12-print.html"
   ], 
   [
    "18878.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-10-print.html"
   ], 
   [
    "18879.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-8-print.html"
   ], 
   [
    "18880.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-6-print.html"
   ], 
   [
    "18881.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-4-print.html"
   ], 
   [
    "18882.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-5-print.html"
   ], 
   [
    "18883.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-7-print.html"
   ], 
   [
    "18884.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-9-print.html"
   ], 
   [
    "18885.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-11-print.html"
   ], 
   [
    "18886.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-3-print.html"
   ], 
   [
    "18887.html", 
    "http://www.4forums.com/political/gay-rights-debates/14734-what-bible-really-says-doesnt-say-about-being-gay-2-print.html"
   ]
  ], 
  "identifier": 14734
 }
]