[
 [
  [
   417708, 
   null, 
   "Accipiter", 
   "Many religious people are fond of saying that America is a Christian nation and at the same time they will say that things in America are going down the toilet.\n \n They say that it's time for all Christians to stand up and take back America.\n \n My question to you is, if the Christians were in charge at one time and have lost control of the situation should they be considered competent to lead?\n \n Should responsibility for the American decline rest on the Christians who by there own admission say that things have taken a turn for the worst?", 
   {
    "post_info": {
     "post_title": "Who's in charge here?"
    }
   }, 
   null, 
   null, 
   1290620640.0
  ], 
  [
   417709, 
   null, 
   "Zorba", 
   "Many religious people are fond of saying that America is a Christian nation and at the same time they will say that things in America are going down the toilet.\n \n They say that it's time for all Christians to stand up and take back America.\n \n My question to you is, if the Christians were in charge at one time and have lost control of the situation should they be considered competent to lead?\n \n Should responsibility for the American decline rest on the Christians who by there own admission say that things have taken a turn for the worst?\n\n \n The absolutely insane premise of this threads question is irrefutable evidence of how progressives will rewrite history in order to exonerate themselves for the decline of our society. What's more telling is that your grasp on both reality and history is so wanting that you could ask these questions in the first place, as if the self destructive social changes in America were in any way promoted by Christians or Conservatives is ludicrous.\n \n The very idea that it was christians who promoted issues like abortion, sex education rather than abstinence or the social normalization of homosexuality at every level of social consciousness to name just a few pet projects of the progressive left over the past 30 years just proves how vacuous and shallow your grasp on reality is.\n \n What is so sad and then incredible is that your response to this post will undoubtably be that the examples I raise aren't the problems you're even concerned with, proving for all to see that you don't even recognize the slippery slope we are sliding down as a Nation.\n \n You dont see that a nations morality is as important as their laws and that we either rise together as a people or we fall together. That is why we conseratives have opposed you progressives forever, but you have picked inch by inch at the moral fiber of this country until we look more like Soddom than the country our founders designed and formed.", 
   {}, 
   417708, 
   null, 
   1290624840.0
  ], 
  [
   417714, 
   null, 
   "Accipiter", 
   "The absolutely insane premise of this threads question is irrefutable evidence of how progressives will rewrite history in order to exonerate themselves for the decline of our society. What's more telling is that your grasp on both reality and history is so wanting that you could ask these questions in the first place, as if the self destructive social changes in America were in any way promoted by Christians or Conservatives is ludicrous.\n \n The very idea that it was christians who promoted issues like abortion, sex education rather than abstinence or the social normalization of homosexuality at every level of social consciousness to name just a few pet projects of the progressive left over the past 30 years just proves how vacuous and shallow your grasp on reality is.\n \n What is so sad and then incredible is that your response to this post will undoubtably be that the examples I raise aren't the problems you're even concerned with, proving for all to see that you don't even recognize the slippery slope we are sliding down as a Nation.\n \n You dont see that a nations morality is as important as their laws and that we either rise together as a people or we fall together. That is why we conseratives have opposed you progressives forever, but you have picked inch by inch at the moral fiber of this country until we look more like Soddom than the country our founders designed and formed.\n\n \n I have not rewritten anything except what your own people say.\n \n You say it's a Cristian nation and you say it's going down the drain.\n \n So are you and your religious buddies lairs or not?\n \n If it's going down the drain and you people are or were in charge I see no reason to believe that you are anything but incompetent.", 
   {}, 
   417709, 
   null, 
   1290629220.0
  ], 
  [
   417724, 
   null, 
   "Zorba", 
   "I have not rewritten anything except what your own people say.\n \n You say it's a Cristian nation and you say it's going down the drain.\n \n So are you and your religious buddies lairs or not?\n \n If it's going down the drain and you people are or were in charge I see no reason to believe that you are anything but incompetent.\n\n Is this what you consider to be a rational argument? And who says this is a christian nation? This nation was founded upon biblical principles, yes, that's true; the bible was used as a source for the first common laws in this country, yes, that's also true; But what separated this country from the rest was that it declared Freedom OF Religion as well as Freedom FROM Religion if that is the individuals choice. The Government has never tried to impose any religion, must less christianity upon its citizens so we are not a christian nation in any way.\n \n We traditionalists clearly see that God has blessed this country because of our recognition of His divine grace upon us from the moment of our founding. With all of our mistakes and early social injustices, we were still a nation that drew the unwashed and persecuted masses from truly evil societies around the world. \n \n What we have become today as an immoral and narcissistic country of self serving hedonists is not the fault of the founders or the principles upon which this nation was founded, it is due to the persistent and endless assault on our traditional values by the progressive movement which has been active since the 1880s. \n \n You act like it's the fault of the builder of a 100 year old mansion that it is burned to the ground by the newest tenants while throwing an out of control 50 keg party with an open bar for 3 days. That is what the premise of this inane thread suggests, but nothing can be further from the truth.\n \n There is nothing wrong with this country that cannot be fixed if we return to the basics in our constitution and reverse the progressive influences that currently exist and are at war with what made us a great country originally. I mean, just look at TV today; I remember when a woman's cleavage was pushing the censors limits. Tight stretchy knits on a busty woman were frowned upon because children also watched those shows.\n \n But today we have flawless women with flawless bodies in bras and panties on commercials between shows that parade nude adults that show everything but their bits on network TV, and full frontal nudity on cable. That is the result of progressives, not christians. \n \n Do you realize you can purchase thongs for 8, 10 and 12 year old girls today? Does that offend you? I'll bet it doesn't. You are blind to the long term impact of the progressives value system being pushed on us/our children through magazines, video games, TV, Movies and in general our overall pop culture which we, the USA exports all over the world so we can infect the rest of the planet too.\n \n But you are either completely clueless to reality, in liberal denial, or just brain dead if you can't appreciate that it isn't christians who promote the degradation of our women and children through this infectious pop culture for the almighty buck, but it's the progressive bent to always lower our social sights to the lowest common denominator.\n \n Haven't you argued here in favor of sex education for kids? Don't you realize that for adults to teach 8th & 9th graders safe sex options rather than to wait until their married, they are in fact saying premarital sex and promiscuity is ok, so let me show you how to do it safely? The only problem is that once the raging hormones of 2 teens are peaking, the concept of taking the time to put on a condom goes out the window. And the irrefutable evidence for that FACT is our nations out of control teen pregnancy and STD rates. \n \n But you have the audacity to suggest that the moral condition of this nation which I believe is the main trigger for all of the other problems we have, falls at the feet of the Christians? Both you, your practical insights and the premise of this thread are bad jokes.", 
   {}, 
   417714, 
   null, 
   1290648120.0
  ], 
  [
   417728, 
   null, 
   "Penfold", 
   "America's prisons are stuffed with Christians, who are over-represented compared to the law-abiding population outside the walls, and far outnumber all other religions and atheists combined in the prison population.", 
   {}, 
   417724, 
   null, 
   1290655380.0
  ], 
  [
   417732, 
   null, 
   "snakespit", 
   "America's prisons are stuffed with Christians, who are over-represented compared to the law-abiding population outside the walls, and far outnumber all other religions and atheists combined in the prison population.\n\n \n There are no atheists in a foxhole, huh? But then again, I'm sure Easy and Archie wouldn't consider these to be \"true\" christians.", 
   {}, 
   417728, 
   null, 
   1290656580.0
  ], 
  [
   417733, 
   null, 
   "Zorba", 
   "America's prisons are stuffed with Christians, who far outnumber all other religions and atheists combined in the prison population.\n\n \n As usual you either lie outright or completely misrepresent the facts. It is true that in the booking process everyone is asked what their religious heritage/affiliation is, and since this countries population is around 60% catholic/protestant affiliation, they check off the christian block, just as you would if asked your families religious heritage. But those criminals are no more believers in Christ than you are. Simply put, they are cultural christians and nothing more.\n \n You are so dishonest you would have us believe the courts largest criminal demographic is the main line evangelical churches of America, and the born again believers our prisons most regular and serious criminal element. Like all progressives you choose what lie you want to believe and then you speak it as if it's the truth even though you know all too well that the percentage of Christ following, church going, born again believers who are in american prisons is so small as to be negligible.\n \n But since the statistic that the majority of prisoners claim a christian heritage suits your fallacious argument, you don't hesitate at all to tell the lie. Thanks for being so consistent and proving for all to see how utterly dishonest you are, not to mention off topic.", 
   {}, 
   417728, 
   null, 
   1290656820.0
  ], 
  [
   417735, 
   null, 
   "Matthew", 
   "There are no atheists in a foxhole, huh? But then again, I'm sure Easy and Archie wouldn't consider these to be \"true\" christians.\n\n \n Indeed. The \"no true Scotsman\" fallacy is ever popular.", 
   {}, 
   417732, 
   null, 
   1290659280.0
  ], 
  [
   417736, 
   null, 
   "Penfold", 
   "As usual you either lie outright or completely misrepresent the facts. It is true that in the booking process everyone is asked what their religious heritage/affiliation is, and since this countries population is around 60% catholic/protestant affiliation, they check off the christian block, just as you would if asked your families religious heritage. But those criminals are no more believers in Christ than you are. Simply put, they are cultural christians and nothing more.\n \n You are so dishonest you would have us believe the courts largest criminal demographic is the main line evangelical churches of America, and the born again believers our prisons most regular and serious criminal element. Like all progressives you choose what lie you want to believe and then you speak it as if it's the truth even though you know all too well that the percentage of Christ following, church going, born again believers who are in american prisons is so small as to be negligible.\n \n But since the statistic that the majority of prisoners claim a christian heritage suits your fallacious argument, you don't hesitate at all to tell the lie. Thanks for being so consistent and proving for all to see how utterly dishonest you are, not to mention off topic.\n\n \n \n You still can't handle the truth, Archie. The undeniable fact remains, Christians form a larger part of the prison demographic than they do in the general population.", 
   {}, 
   417733, 
   null, 
   1290659760.0
  ], 
  [
   417737, 
   null, 
   "snakespit", 
   "[INDENT]But what separated this country from the rest was that it declared Freedom OF Religion as well as Freedom FROM Religion if that is the individuals choice. The Government has never tried to impose any religion, must less christianity upon its citizens so we are not a christian nation in any way.\n\n I will remember that you said this. Remember, what you say can and will be used against you. \n \n \nWe traditionalists clearly see that God has blessed this country because of our recognition of His divine grace upon us from the moment of our founding. With all of our mistakes and early social injustices, we were still a nation that drew the unwashed and persecuted masses from truly evil societies around the world. \n\n Who are the \"truly evil societies\"? My ancestors came from the Netherlands, Scotland, and Ireland...are these the evil societies you speak of? Or Italy, or England, or Germany? \n \n \nWhat we have become today as an immoral and narcissistic country of self serving hedonists is not the fault of the founders or the principles upon which this nation was founded, it is due to the persistent and endless assault on our traditional values by the progressive movement which has been active since the 1880s. \n\n Speaking of narcissistic...aren't you the one that just said: \"God has blessed this country because of our recognition of His divine grace upon us from the moment of our founding\". I can hardly think of a more narcissistic statement than that. Wouldn't a god who loved all of his children bless everyone everywhere for all time? \n \n \nYou act like it's the fault of the builder of a 100 year old mansion that it is burned to the ground by the newest tenants while throwing an out of control 50 keg party with an open bar for 3 days. That is what the premise of this inane thread suggests, but nothing can be further from the truth.\n\n No, I think he was saying that it is the fault of the caretakers who have been looking after the place for the last 200+ years...this includes the \"christian right\". \n \n \nThere is nothing wrong with this country that cannot be fixed if we return to the basics in our constitution and reverse the progressive influences that currently exist and are at war with what made us a great country originally.\n \n So what exactly is wrong with this country...please give specifics.\n \n \nI mean, just look at TV today; I remember when a woman's cleavage was pushing the censors limits. Tight stretchy knits on a busty woman were frowned upon because children also watched those shows.\n\n And this harms you or our nation how? You are free to turn it off if you don't like the programming. \n \n \nBut today we have flawless women with flawless bodies in bras and panties on commercials between shows that parade nude adults that show everything but their bits on network TV, and full frontal nudity on cable. That is the result of progressives, not christians. \n\n Again...nobody is forcing you to watch. I don't see how a half naked woman on television is destroying our nation...perhaps the problem belongs to you. \n \n \nDo you realize you can purchase thongs for 8, 10 and 12 year old girls today?\n\n Do you realize that you can also not purchase them? Why are you so concerned about the underwear of 8, 10, or 12 year old girls anyway? Again...how does this do any damage to our country?\n \n \n You are blind to the long term impact of the progressives value system being pushed on us/our children through magazines, video games, TV, Movies and in general our overall pop culture which we, the USA exports all over the world so we can infect the rest of the planet too.\n\n I will speak for no one other than myself, but I am very particular about what I allow my children to watch, read, play, look at, or listen to. That is my responsibility as a parent. It almost seems to me that many parents today want a sanitized world for their children...not to benefit their children...simply so they are relieved of the responsibility of acting like parents. \n \n \nHaven't you argued here in favor of sex education for kids? Don't you realize that for adults to teach 8th & 9th graders safe sex options rather than to wait until their married, they are in fact saying premarital sex and promiscuity is ok, so let me show you how to do it safely? The only problem is that once the raging hormones of 2 teens are peaking, the concept of taking the time to put on a condom goes out the window. And the irrefutable evidence for that FACT is our nations out of control teen pregnancy and STD rates. \n\n That's absolutely right. Just ask abstinence spokesperson Bristol Palin who was raised by that \"bible-believing christian\" Sarah Palin. I'm sure Sarah instilled the values of abstinence in her home from early on up with all of her children...and it worked so well! er...nevermind.\n \n The problem is that once the raging hormones of 2 teens are peaking...the concept of abstinence goes out the window right before the concept of condoms does. The common factor is raging teen hormones. \n \n And I hate to include pesky facts, but:\n \n \nThe good news is that teen births have dropped by almost a third since the beginning of the 1990s. With pregnancy prevention programs and more understanding and teaching about safe sex, this number will hopefully drop even more. Here are a few other statistics that hopefully point to even better prevention rates in the years to come: \n \n &#8226;In 2002 the abortion rate among teenager mother was 50 percent lower than its high point in 1988. \n &#8226;Among black teenagers, the pregnancy rate dropped around 40 percent since 1990. \n &#8226;Among Hispanic teenagers the pregnancy rate dropped around 19 percent since 1990. \n &#8226;Among white teenagers, the pregnancy rate dropped around 34 percent since 1990.\n\n Teen Pregnancy Statistics - Pregnant Teen Help\n \n \nBut you have the audacity to suggest that the moral condition of this nation which I believe is the main trigger for all of the other problems we have, falls at the feet of the Christians?\n\n The problems this nation has belong to all of us, not just the progressives and not just the christians.", 
   {}, 
   417724, 
   null, 
   1290661080.0
  ], 
  [
   417741, 
   null, 
   "pappillion001", 
   "[QUOTE]\nThe absolutely insane premise of this threads question is irrefutable evidence of how progressives will rewrite history in order to exonerate themselves for the decline of our society.\n\n \n This is becoming a very popular tactic for republican and conservatives. Blaming opposition for whatever it is they are doing. \n \n Moral decline in society is a very difficult concept to put forth as declining as a result of progressive values, which are similar to conservative values on more issues than you may like to admit and are actually greater in a couple.\n \n \nWhat's more telling is that your grasp on both reality and history is so wanting that you could ask these questions in the first place, as if the self destructive social changes in America were in any way promoted by Christians or Conservatives is ludicrous.\n\n \n No more ludicrous than trying to place blame on liberals or progressives. \n \n \nThe very idea that it was christians who promoted issues like abortion, sex education rather than abstinence or the social normalization of homosexuality at every level of social consciousness to name just a few pet projects of the progressive left over the past 30 years just proves how vacuous and shallow your grasp on reality is.\n\n \n Now we understand who is unable to make rational objective observations and demonstrates a narrow understanding of society. Abortion does not contribute to the decline of society in any measurable way. I know what your response will be and you will need to do better than your first thought. Same with sex education, your grasp of human nature is appalling. Keep kids stupid about sex and they won't try it, there you go that has worked well over the years hasn't it. You know what has worked better than teaching about sex and abstinence? Teaching girls that they are not objects in a mans world placed here by God for the purpose of giving birth and submitting to their husbands. Why does social normalization for you require them to act contrary to their nature, why can't it be you change your mind, it's easier than them changing their biology. Promiscuity exits in either orientation, so does flamboyant and irresponsible.\n \n \nWhat is so sad and then incredible is that your response to this post will undoubtably be that the examples I raise aren't the problems you're even concerned with, proving for all to see that you don't even recognize the slippery slope we are sliding down as a Nation.\n\n \n Is this because you really feel these three represent the most damaging issues to our society or you feel most comfortable defending them if needed?\n By teaching abstinence, criminalizing abortion and sending gay people to re-education camps will we be a better people? Can you even attempt any of these without pushing religion past the line of separation? By all means I would love to hear just an idea or two how to effect these necessities successfully.\n \n \nYou dont see that a nations morality is as important as their laws and that we either rise together as a people or we fall together. That is why we conseratives have opposed you progressives forever, but you have picked inch by inch at the moral fiber of this country until we look more like Soddom than the country our founders designed and formed.\n\n \n Most liberals as most conservatives understand the role and benefit morals, ethics and values play in maintaining a healthy society. The problem is how much of which ones. Some will always be relevant, don't steal, don't kill, help those in need, our system of laws, not perfect, but better than most, but others not as relevant and technology creates the need to address some things never thought possible. So where is the happy medium? Your way was tried and didn't work, the other way isn't looking to achieve much better results. So how do 308 million people and growing come to an agreement? \n \n The problem really is traditionally conservatives do not like change, research shows over and over they like things the way they are or were, whatever that was or is. The world changes though and our founders designed this country fully understanding that. There is a reason the branch of government that writes the checks is before the people the most often, why both the people and the states are represented, why nothing about this country is set in stone and why government is not supposed to show a preference one group over another (still working on that one though). Just to cut you off before you get started, if it was the intent of the founders for government to have any association with religion they would have written it down and made it law, but even knowing they could do so with public support and could protect the future by making it possible to change that relationship they kept it out, intentionally.", 
   {}, 
   417709, 
   null, 
   1290667320.0
  ], 
  [
   417746, 
   null, 
   "Zorba", 
   "Indeed. The \"no true Scotsman\" fallacy is ever popular.\n\n \n Really? Are you actually suggesting that our prisons are full of church going, God honoring, Born again Believers in Christ Jesus? That there are more of them in american prisons than any other religious affiliation? Do you really believe such a thing or would you side with Penfold no matter what dishonest and off topic foolishness he came up with?", 
   {}, 
   417735, 
   null, 
   1290690480.0
  ], 
  [
   417751, 
   null, 
   "Easyrider", 
   "Just to cut you off before you get started, if it was the intent of the founders for government to have any association with religion they would have written it down and made it law, but even knowing they could do so with public support and could protect the future by making it possible to change that relationship they kept it out, intentionally.\n\n \n In your dreams, pappi.\n \n God has been an important part of American institutions since the get-go. \n \n The Danbury Baptist Letter, as Originally Drafted\n \n The Library of Congress is grateful to the Federal Bureau of Investigation Laboratory for recovering the lines obliterated from the Danbury Baptist letter by Thomas Jefferson. He originally wrote \"a wall of eternal separation between church and state,\" later deleting the word \"eternal.\" He also deleted the phrase \"the duties of my station, which are merely temporal.\" Jefferson must have been unhappy with the uncompromising tone of both of these phrases, especially in view of the implications of his decision, two days later, to begin attending church services in the House of Representatives.\n \n Reserved Seats at Capitol Services\n \n Here is a description, by an early Washington \"insider,\" Margaret Bayard Smith (1778-1844), a writer and social critic and wife of Samuel Harrison Smith, publisher of the National Intelligencer, of Jefferson's attendance at church services in the House of Representatives: \"Jefferson during his whole administration was a most regular attendant. The seat he chose the first day sabbath, and the adjoining one, which his private secretary occupied, were ever afterwards by the courtesy of the congregation, left for him.\"\n \n The Old House of Representatives\n \n Church services were held in what is now called Statuary Hall from 1807 to 1857. The first services in the Capitol, held when the government moved to Washington in the fall of 1800, were conducted in the \"hall\" of the House in the north wing of the building. In 1801 the House moved to temporary quarters in the south wing, called the \"Oven,\" which it vacated in 1804, returning to the north wing for three years. Services were conducted in the House until after the Civil War. The Speaker's podium was used as the preacher's pulpit. \n \n A Millennialist Sermon Preached in Congress\n \n This sermon on the millennium was preached by the Baltimore Swedenborgian minister, John Hargrove (1750-1839) in the House of Representatives. One of the earliest millennialist sermons preached before Congress was offered on July 4, 1801, by the Reverend David Austin (1759-1831), who at the time considered himself \"struck in prophesy under the style of the Joshua of the American Temple.\" Having proclaimed to his Congressional audience the imminence of the Second Coming of Christ, Austin took up a collection on the floor of the House to support services at \"Lady Washington's Chapel\" in a nearby hotel where he was teaching that \"the seed of the Millennial estate is found in the backbone of the American Revolution.\"\n \n First Catholic Sermon in the House\n \n On January 8, 1826, Bishop John England (1786-1842) of Charleston, South Carolina, became the first Catholic clergyman to preach in the House of Representatives. The overflow audience included President John Quincy Adams, whose July 4, 1821, speech England rebutted in his sermon. \n \n Woman Preacher in the House (and call for revival!)\n \n In 1827, Harriet Livermore (1788-1868), the daughter and granddaughter of Congressmen, became the second woman to preach in the House of Representatives. The first woman to preach before the House (and probably the first woman to speak officially in Congress under any circumstances) was the English evangelist, Dorothy Ripley (1767-1832), who conducted a service on January 12, 1806. Jefferson and Vice President Aaron Burr were among those in a \"crowded audience.\" Sizing up the congregation, Ripley concluded that \"very few\" had been born again and broke into an urgent, camp meeting style exhortation, insisting that \"Christ's Body was the Bread of Life and His Blood the drink of the righteous.\"\n \n Communion Service in the Treasury Building\n \n Manasseh Cutler here describes a four-hour communion service in the Treasury Building, conducted by a Presbyterian minister, the Reverend James Laurie: \"Attended worship at the Treasury. Mr. Laurie alone. Sacrament. Full assembly. Three tables; service very solemn; nearly four hours.\" \n \n Adams's Description of a Church Service in the Supreme Court\n \n John Quincy Adams here describes the Reverend James Laurie, pastor of a Presbyterian Church that had settled into the Treasury Building, preaching to an overflow audience in the Supreme Court Chamber, which in 1806 was located on the ground floor of the Capitol. \n \n \n The Old Supreme Court Chamber\n \n Description of church services in the Supreme Court chamber by Manasseh Cutler (1804) and John Quincy Adams (1806) indicate that services were held in the Court soon after the government moved to Washington in 1800.\n \n  Church Services in Congress after the Civil War\n \n Charles Boynton (1806-1883) was in 1867 chaplain of the House of Representatives and organizing pastor of the First Congregational Church in Washington, which was trying at that time to build its own sanctuary. In the meantime the church, as Boynton informed potential donors, was holding services \"at the Hall of Representatives\" where \"the audience is the largest in town. . . .nearly 2000 assembled every Sabbath\" for services, making the congregation in the House the \"largest Protestant Sabbath audience then in the United States.\" The First Congregational Church met in the House from 1865 to 1868. \n \n House of Representatives, After the Civil War\n \n The House moved to its current location on the south side of the Capitol in 1857. It contained the \"largest Protestant Sabbath audience\" in the United States when the First Congregational Church of Washington held services there from 1865 to 1868. \n \n Confirmed by: U.S. Library of Congress:\n \n Religion and the Federal Government: PART 2 (Religion and the Founding of the American Republic, Library of Congress Exhibition)\n \n You don't see even an iota of that in your liberal / progressive textbooks, do you, pappi? And you never see Mr LA Write mention it either. Why is that? \n \n And by the way, the first Thanksgiving wasn't Bradford and the Mayflower settlers giving thanks to the Indians like some whacked out liberals claim. They were giving thanks to God and sharing the meal(s) with the Indians.", 
   {}, 
   417741, 
   null, 
   1290710040.0
  ], 
  [
   417758, 
   null, 
   "pappillion001", 
   "In your dreams, pappi.\n \n God has been an important part of American institutions since the get-go. \n \n \n It is getting pretty bad for you. I think you may even start walking into things you are becoming so blind. \n \n You see only what you want to see, hear what you want to hear and read what isn't there.\n \n Why would anybody argue the founding fathers, not all, but some as well as many of the first few series of elected officials were picked from a deeply religious population of upper income people. That wasn't the point or the statement or even the question. So all this long list of examples of how prevalent religion was in the late 1700s and early 1800s is meaningless to the issue. It accomplishes nothing but your misunderstanding of the role religion was given in the government.That being a part of the personal lives of the participating members, but having no part established for it within the workings of government beyond that.\n \n \n \nThe Danbury Baptist Letter, as Originally Drafted\n \n The Library of Congress is grateful to the Federal Bureau of Investigation Laboratory for recovering the lines obliterated from the Danbury Baptist letter by Thomas Jefferson. He originally wrote \"a wall of eternal separation between church and state,\" later deleting the word \"eternal.\" He also deleted the phrase \"the duties of my station, which are merely temporal.\" Jefferson must have been unhappy with the uncompromising tone of both of these phrases, especially in view of the implications of his decision, two days later, to begin attending church services in the House of Representatives.\n \n\n \n Again you comprehend only what you want to. Jefferson was a religious man, but he believed strongly that the Bible had been corrupted by man and much of it had nothing to do with what Jesus taught. \n \n \n The Jefferson Bible\n It is thought that Jefferson prepared what is referred to as the \"Jefferson Bible\" in 1820. In this volume, Jefferson used excerpts from New Testaments in four languages to create parallel columns of text recounting the life of Jesus, preserving what he considered to be Christ's authentic actions and statements, eliminating the mysterious and miraculous. He began his account with Luke's second chapter, deleting the first in which the angel Gabriel announced to the Virgin Mary that she would give birth to the Messiah by the Holy Spirit. On the pages seen here, Jefferson deleted the part of the birth story in which the angel of the Lord appeared to the shepherds. The text ends with the crucifixion and burial and omits any resurrection appearance.\n \n This is not the work of the person you are trying to portray Jefferson to be, yet this is the man he was. Making it ever more clear why there was a profound distrust of religious people in positions of authority.\n \n \n Reserved Seats at Capitol Services\n \n Here is a description, by an early Washington \"insider,\" Margaret Bayard Smith (1778-1844), a writer and social critic and wife of Samuel Harrison Smith, publisher of the National Intelligencer, of Jefferson's attendance at church services in the House of Representatives: \"Jefferson during his whole administration was a most regular attendant. The seat he chose the first day sabbath, and the adjoining one, which his private secretary occupied, were ever afterwards by the courtesy of the congregation, left for him.\"\n \n The Old House of Representatives\n \n Church services were held in what is now called Statuary Hall from 1807 to 1857. The first services in the Capitol, held when the government moved to Washington in the fall of 1800, were conducted in the \"hall\" of the House in the north wing of the building. In 1801 the House moved to temporary quarters in the south wing, called the \"Oven,\" which it vacated in 1804, returning to the north wing for three years. Services were conducted in the House until after the Civil War. The Speaker's podium was used as the preacher's pulpit. \n \n A Millennialist Sermon Preached in Congress\n \n This sermon on the millennium was preached by the Baltimore Swedenborgian minister, John Hargrove (1750-1839) in the House of Representatives. One of the earliest millennialist sermons preached before Congress was offered on July 4, 1801, by the Reverend David Austin (1759-1831), who at the time considered himself \"struck in prophesy under the style of the Joshua of the American Temple.\" Having proclaimed to his Congressional audience the imminence of the Second Coming of Christ, Austin took up a collection on the floor of the House to support services at \"Lady Washington's Chapel\" in a nearby hotel where he was teaching that \"the seed of the Millennial estate is found in the backbone of the American Revolution.\"\n \n First Catholic Sermon in the House\n \n On January 8, 1826, Bishop John England (1786-1842) of Charleston, South Carolina, became the first Catholic clergyman to preach in the House of Representatives. The overflow audience included President John Quincy Adams, whose July 4, 1821, speech England rebutted in his sermon. \n \n Woman Preacher in the House (and call for revival!)\n \n In 1827, Harriet Livermore (1788-1868), the daughter and granddaughter of Congressmen, became the second woman to preach in the House of Representatives. The first woman to preach before the House (and probably the first woman to speak officially in Congress under any circumstances) was the English evangelist, Dorothy Ripley (1767-1832), who conducted a service on January 12, 1806. Jefferson and Vice President Aaron Burr were among those in a \"crowded audience.\" Sizing up the congregation, Ripley concluded that \"very few\" had been born again and broke into an urgent, camp meeting style exhortation, insisting that \"Christ's Body was the Bread of Life and His Blood the drink of the righteous.\"\n \n Communion Service in the Treasury Building\n \n Manasseh Cutler here describes a four-hour communion service in the Treasury Building, conducted by a Presbyterian minister, the Reverend James Laurie: \"Attended worship at the Treasury. Mr. Laurie alone. Sacrament. Full assembly. Three tables; service very solemn; nearly four hours.\" \n \n Adams's Description of a Church Service in the Supreme Court\n \n John Quincy Adams here describes the Reverend James Laurie, pastor of a Presbyterian Church that had settled into the Treasury Building, preaching to an overflow audience in the Supreme Court Chamber, which in 1806 was located on the ground floor of the Capitol. \n \n \n The Old Supreme Court Chamber\n \n Description of church services in the Supreme Court chamber by Manasseh Cutler (1804) and John Quincy Adams (1806) indicate that services were held in the Court soon after the government moved to Washington in 1800.\n \n \n Church Services in Congress after the Civil War\n \n Charles Boynton (1806-1883) was in 1867 chaplain of the House of Representatives and organizing pastor of the First Congregational Church in Washington, which was trying at that time to build its own sanctuary. In the meantime the church, as Boynton informed potential donors, was holding services \"at the Hall of Representatives\" where \"the audience is the largest in town. . . .nearly 2000 assembled every Sabbath\" for services, making the congregation in the House the \"largest Protestant Sabbath audience then in the United States.\" The First Congregational Church met in the House from 1865 to 1868. \n\n \n I just want to point out the reference to the Sabbath. Is that the one God on a number of occasions says when and why and how it is to be observed or is it the one Christians developed to be seen as distinct from Judaism and being observed contrary to God's intentions? \n \n \n \nHouse of Representatives, After the Civil War\n \n The House moved to its current location on the south side of the Capitol in 1857. It contained the \"largest Protestant Sabbath audience\" in the United States when the First Congregational Church of Washington held services there from 1865 to 1868. \n \n Confirmed by: U.S. Library of Congress:\n \n Religion and the Federal Government: PART 2 (Religion and the Founding of the American Republic, Library of Congress Exhibition)\n \n \n You don't see even an iota of that in your liberal / progressive textbooks, do you, pappi? And you never see Mr LA Write mention it either. Why is that? \n \n\n \n There is nothing to see. Why would any textbook on US government or history include what officials did recreationally?\n \n It isn't mentioned often because it isn't relevant to anything unless you want to learn how to be a gossip columnist. Is that what your thinking about doing, starting a gossip column in MAD magazine\n \n \nAnd by the way, the first Thanksgiving wasn't Bradford and the Mayflower settlers giving thanks to the Indians like some whacked out liberals claim. They were giving thanks to God and sharing the meal(s) with the Indians.\n\n \n Of course because God is the one who fed them and taught them what they could and couldn't eat and hunt and farm. You sound like Rush. I actually heard him saying he wondered why Indians don't pay reparations to white people for inventing tobacco and was serious.", 
   {}, 
   417751, 
   null, 
   1290722640.0
  ], 
  [
   417759, 
   null, 
   "Accipiter", 
   "I mean, just look at TV today; I remember when a woman's cleavage was pushing the censors limits. Tight stretchy knits on a busty woman were frowned upon because children also watched those shows.\n \n But today we have flawless women with flawless bodies in bras and panties on commercials between shows that parade nude adults that show everything but their bits on network TV, and full frontal nudity on cable. That is the result of progressives, not christians. \n \n Do you realize you can purchase thongs for 8, 10 and 12 year old girls today? Does that offend you? I'll bet it doesn't. You are blind to the long term impact of the progressives value system being pushed on us/our children through magazines, video games, TV, Movies and in general our overall pop culture which we, the USA exports all over the world so we can infect the rest of the planet too.[/INDENT]\n\n \n Stuff like that is on TV because that is what the people want.\n \n Who are the people?\n \n 78.4% of them are Christian.", 
   {}, 
   417724, 
   null, 
   1290724560.0
  ], 
  [
   417760, 
   null, 
   "MrWriteLA", 
   "... [A] short time elapsed after the death of the great reformer of the Jewish religion [Jesus], before his principles were departed from by those who professed to be his special servants, and perverted into an engine for enslaving mankind, and aggrandising their oppressors in Church and State; that the purest system of morals ever before preached to man, has been adulterated and sophisticated by artificial constructions, into a mere contrivance to filch wealth and power to themselves; that rational men not being able to swallow their impious heresies, in order to force them down their throats, they raise the hue and cry of infidelity, while themselves are the greatest obstacles to the advancement of the real doctrines of Jesus, and do in fact constitute the real Anti-Christ.- Thomas Jefferson, to Samuel Kercheval, 1810\n \nMillions of innocent men, women and children, since the introduction of Christianity, have been burnt, tortured, fined and imprisoned; yet we have not advanced one inch towards uniformity.\n -Thomas Jefferson, Notes on Virginia, 1782\nPaul was the great Coryphaeus, and first corrupter of the doctrines of Jesus.\n - Thomas Jefferson, letter to W. Short\nBut it does me no injury for my neighbor to say there are twenty gods or no God. It neither picks my pocket nor breaks my leg.\n -Thomas Jefferson, Notes on Virginia, 1782\nQuestion with boldness even the existence of a god; because if there be one he must approve of the homage of reason more than that of blindfolded fear.\n -Thomas Jefferson, letter to Peter Carr, August 10, 1787\nWhere the preamble declares, that coercion is a departure from the plan of the holy author of our religion, an amendment was proposed by inserting \"Jesus Christ,\" so that it would read \"A departure from the plan of Jesus Christ, the holy author of our religion;\" the insertion was rejected by the great majority, in proof that they meant to comprehend, within the mantle of its protection, the Jew and the Gentile, the Christian and Mohammedan, the Hindoo and Infidel of every denomination.\n -Thomas Jefferson, Autobiography, in reference to the Virginia Act for Religious Freedom\nI concur with you strictly in your opinion of the comparative merits of atheism and demonism, and really see nothing but the latter in the being worshipped by many who think themselves Christians.\n -Thomas Jefferson, letter to Richard Price, Jan. 8, 1789 (Richard Price had written to TJ on Oct. 26. about the harm done by religion and wrote \"Would not Society be better without Such religions? Is Atheism less pernicious than Demonism?\")\nThe whole history of these books [the Gospels] is so defective and doubtful that it seems vain to attempt minute enquiry into it: and such tricks have been played with their text, and with the texts of other books relating to them, that we have a right, from that cause, to entertain much doubt what parts of them are genuine. In the New Testament there is internal evidence that parts of it have proceeded from an extraordinary man; and that other parts are of the fabric of very inferior minds. It is as easy to separate those parts, as to pick out diamonds from dunghills.\n -Thomas Jefferson, letter to John Adams, January 24, 1814\nChristianity neither is, nor ever was a part of the common law.\n -Thomas Jefferson, letter to Dr. Thomas Cooper, February 10, 1814\nTo talk of immaterial existences is to talk of nothings. To say that the human soul, angels, god, are immaterial, is to say they are nothings, or that there is no god, no angels, no soul. I cannot reason otherwise: but I believe I am supported in my creed of materialism by Locke, Tracy, and Stewart. At what age of the Christian church this heresy of immaterialism, this masked atheism, crept in, I do not know. But heresy it certainly is.\n -Thomas Jefferson, letter to John Adams, Aug. 15, 1820\nYeah, that Jefferson, he sure was an EZ / Archie wannabe, wasn't he? emoticon_rolleyes\n \n This persistence of right-wing fundies in trying to make the Founding Fathers (Jefferson, Adams, Madison, Paine, Washington, Franklin) into One of Them is as asinine as it is provably revisionist. (Oh, they'll pull out names like Henry Clay and others who WANTED it to be so... but those guys were on the losing side. Hence the first amendment, and Article VI, paragraph 3 of the Constitution: ... \"no religious test shall ever be required as a qualification to any office or public trust under the United States.\")\n \n This is NOT a Christian nation, was never intended to be, and was regarded by its overwhelmingly Deist crafters as a great success largely because of its refusal to be one.\n \n (By the way, if you Holy Rollers want more evidence of this, I got a trunkload of more quotes from Jefferson, et al, and I'll be happy to trot them out. And if your Plan B is to start trotting out the unfounded \"founder's quotes\" that anti-separationist David Barton was ultimately forced to admit were spurious, knock yourselves out.)", 
   {}, 
   417759, 
   null, 
   1290728280.0
  ], 
  [
   417768, 
   null, 
   "Bennedict", 
   "Really? Are you actually suggesting that our prisons are full of church going, God honoring, Born again Believers in Christ Jesus? That there are more of them in american prisons than any other religious affiliation? Do you really believe such a thing or would you side with Penfold no matter what dishonest and off topic foolishness he came up with?\n\n \n PLEASE PLEASE PLEASE??? MAY I???\n \n http://www.holysmoke.org/icr-pri.htm\n \nThe Federal Bureau of Prisons does have statistics on religious affiliations of inmates. The following are total number of inmates per religion category: \n Response Number % ---------------------------- -------- \n Catholic 29267 39.164% \n Protestant 26162 35.008% \n Muslim 5435 7.273% \n American Indian 2408 3.222% \n Nation 1734 2.320% \n Rasta 1485 1.987% \n Jewish 1325 1.773% \n Church of Christ 1303 1.744% \n Pentecostal 1093 1.463% \n Moorish 1066 1.426% \n Buddhist 882 1.180% \n Jehovah Witness 665 0.890% \n Adventist 621 0.831% \n Orthodox 375 0.502% \n Mormon 298 0.399% \n Scientology 190 0.254% \n Atheist 156 0.209% \n Hindu 119 0.159% \n Santeria 117 0.157% \n Sikh 14 0.019% \n Bahai 9 0.012% \n Krishna 7 0.009%\n ---------------------------- -------- Total Known Responses 74731 100.001% (rounding to 3 digits does this)\n \n Unknown/No Answer 18381 ---------------------------- Total Convicted 93112 80.259% (74731) prisoners' religion is known.\n \n Held in Custody 3856 (not surveyed due to temporary custody) ---------------------------- Total In Prisons 96968 I hope that this information is helpful to you. \n \n Sincerely, \n Denise Golumbaski \n Research Analyst Federal Bureau of Prisons \n\n \n sex. poop.", 
   {}, 
   417746, 
   null, 
   1290744000.0
  ], 
  [
   417770, 
   null, 
   "Zorba", 
   "PLEASE PLEASE PLEASE??? MAY I???\n \n The results of the Christians vs atheists in prison investigation.\n \n \n sex. poop.\n\n \n My Lord Man, is it beyond to understand the point I'm attempting to make? Are you seriously implying that the inmates who answered that survey upon being checked in to prison were bible believing, church going, Christ worshiping believers who committed crimes worthy of going to Federal Prison? \n \n Or were they more obviously people who were cultural christians from those denominations, you know, people who went to those named denominations with their families when they were kids, but were in no way church going people as they committed the crimes that sent them to Prison? Can't you see that or are you more comfortable in your willful ignorance like Penfold so you will take dry statistics and assume from them that our prisons are full of church going christians?\n \n Is that the impression of blatant dishonesty you really want to promote here?", 
   {}, 
   417768, 
   null, 
   1290745740.0
  ], 
  [
   417771, 
   null, 
   "Bennedict", 
   "My Lord Man, is it beyond to understand the point I'm attempting to make? Are you seriously implying that the inmates who answered that survey upon being checked in to prison were bible believing, church going, Christ worshiping believers who committed crimes worthy of going to Federal Prison? \n \n Or were they more obviously people who were cultural christians from those denominations, you know, people who went to those named denominations with their families when they were kids, but were in no way church going people as they committed the crimes that sent them to Prison? Can't you see that or are you more comfortable in your willful ignorance like Penfold so you will take dry statistics and assume from them that our prisons are full of church going christians?\n \n Is that the impression of blatant dishonesty you really want to promote here?\n\n \n Man gets life sentence for killing abortion doctor - World - GMANews.TV - Official Website of GMA News and Public Affairs - Latest Philippine News\n \n just one example of upwards of 50 000. hey, he sounds a bit like you or EZ.", 
   {}, 
   417770, 
   null, 
   1290746280.0
  ], 
  [
   417773, 
   null, 
   "Penfold", 
   "My Lord Man, is it beyond to understand the point I'm attempting to make? Are you seriously implying that the inmates who answered that survey upon being checked in to prison were bible believing, church going, Christ worshiping believers who committed crimes worthy of going to Federal Prison? \n \n Or were they more obviously people who were cultural christians from those denominations, you know, people who went to those named denominations with their families when they were kids, but were in no way church going people as they committed the crimes that sent them to Prison? Can't you see that or are you more comfortable in your willful ignorance like Penfold so you will take dry statistics and assume from them that our prisons are full of church going christians?\n \n Is that the impression of blatant dishonesty you really want to promote here?\n\n \n No true Scotsman/christbotherer.", 
   {}, 
   417770, 
   null, 
   1290747000.0
  ], 
  [
   417774, 
   null, 
   "Zorba", 
   "Why do I continue to waste my precious time attempting to reason with dishonest propagandists? emoticon_xdonno", 
   {}, 
   417773, 
   null, 
   1290748680.0
  ], 
  [
   417775, 
   null, 
   "Penfold", 
   "Why do I continue to waste my precious time attempting to reason with dishonest propagandists? emoticon_xdonno\n\n \n You have obviously succumbed, but we can help deprogram you Archangel, you loveable mongo.", 
   {}, 
   417774, 
   null, 
   1290750300.0
  ], 
  [
   417776, 
   null, 
   "Bennedict", 
   "Why do I continue to waste my precious time attempting to reason with dishonest propagandists? emoticon_xdonno\n\n \n do you have a response to either my or Penfold's posts?", 
   {}, 
   417774, 
   null, 
   1290753840.0
  ], 
  [
   417778, 
   null, 
   "pappillion001", 
   "Why do I continue to waste my precious time attempting to reason with dishonest propagandists? emoticon_xdonno\n\n \n I agree it is difficult to say someone who just killed another person is a adhering to the faith. You do have to admit though there does exist a small number of people who commit crimes that they justify through religion. Agreed they are a minute number compared to overall crime, but they do exist.\n \n In line with the direction this thread is going is this rather interesting article \n \n Journal of Religion and Society\n \n Which did some pretty extensive research, pulling statistics from respected and credible sources that used groups that numbered in the thousands and more. The researchers wanted to know if the claims that religion is better for or necessary for a healthy society. The conclusion seems to be no and that the more religious a country is the higher the violence, teen pregnancy and STD rates are. \n \n Now I know that you and EZ will never accept this. It does not matter who did it, why they did it or anything else, you \"know\" it can't be right so therefore will not accept for no other reason than it doesn't agree with your Christian ideas. I am not going to look but I am sure you can find research that is contrary to this, but it should make people take a closer look at what is really going on in this country and focus on some real practical effective solutions and more religion like it or not just isn't it.\n \n Article exerpts\n \n ....Among the developed democracies absolute belief in God, attendance of religious services and Bible literalism vary over a dozenfold, atheists and agnostics five fold, prayer rates fourfold, and acceptance of evolution almost twofold. Japan, Scandinavia, and France are the most secular nations in the west, the United States is the only prosperous first world nation to retain rates of religiosity otherwise limited to the second and third worlds (Bishop; PEW). Prosperous democracies where religiosity is low (which excludes the U.S.) are referred to below as secular developed democracies.....\n \n ....Despite a significant decline from a recent peak in the 1980s (Rosenfeld), the U.S. is the only prosperous democracy that retains high homicide rates, making it a strong outlier in this regard (Beeghley; Doyle, 2000). Similarly, theistic Portugal also has rates of homicides well above the secular developed democracy norm. Mass student murders in schools are rare, and have subsided somewhat since the 1990s, but the U.S. has experienced many more (National School Safety Center) than all the secular developed democracies combined.....\n \n Life spans tend to decrease as rates of religiosity rise (Figure 5), especially as a function of absolute belief. Denmark is the only exception. Unlike questionable small-scale epidemiological studies by Harris et al. and Koenig and Larson, higher rates of religious affiliation, attendance, and prayer do not result in lower juvenile-adult mortality rates on a cross-national basis.<6<\n \n [16] Although the late twentieth century STD epidemic has been curtailed in all prosperous democracies (Aral and Holmes; Panchaud et al.), rates of adolescent gonorrhea infection remain six to three hundred times higher in the U.S. than in less theistic, pro-evolution secular developed democracies (Figure 6). At all ages levels are higher in the U.S., albeit by less dramatic amounts. The U.S. also suffers from uniquely high adolescent and adult syphilis infection rates, which are starting to rise again as the microbe's resistance increases (Figure 7). The two main curable STDs have been nearly eliminated in strongly secular Scandinavia. Increasing adolescent abortion rates show positive correlation with increasing belief and worship of a creator, and negative correlation with increasing non-theism and acceptance of evolution; again rates are uniquely high in the U.S.\n \n \n So God fearing true Christians may not be populating our prison systems, but it seems they are doing their fair share to make the US a worse place to live for everybody. \n \n This will be a hard pill that may not even make sense to you, but if you are able to see objectively the responses to religion you would see why and how these conclusions make sense.", 
   {
    "unicode_changes_made": true
   }, 
   417774, 
   null, 
   1290770340.0
  ], 
  [
   417781, 
   null, 
   "Accipiter", 
   "My Lord Man, is it beyond to understand the point I'm attempting to make? Are you seriously implying that the inmates who answered that survey upon being checked in to prison were bible believing, church going, Christ worshiping believers who committed crimes worthy of going to Federal Prison? \n \n Or were they more obviously people who were cultural christians from those denominations, you know, people who went to those named denominations with their families when they were kids, but were in no way church going people as they committed the crimes that sent them to Prison? Can't you see that or are you more comfortable in your willful ignorance like Penfold so you will take dry statistics and assume from them that our prisons are full of church going christians?\n \n Is that the impression of blatant dishonesty you really want to promote here?\n\n I don't see anything that indicates that any one here is lying to you, could you point them out to me?\n \n On your idea that going to church makes people less prone to commit crime, I see no reason to believe that the percentage of church going Christian people in prison is any less then for the rest of the Christian population, unless you have some evidence to support your position.", 
   {}, 
   417770, 
   null, 
   1290784380.0
  ], 
  [
   417784, 
   null, 
   "Easyrider", 
   "Why do I continue to waste my precious time attempting to reason with dishonest propagandists? \n\n \n It's the 450 prophets of Baal, Zorba. They're time is coming.", 
   {}, 
   417774, 
   null, 
   1290789540.0
  ], 
  [
   417788, 
   null, 
   "Zorba", 
   "You have obviously succumbed, but we can help deprogram you Archangel, you lovable mongo.\n\n \n I taught Penfold the lemming, a new word and now he will overuse it as all children do with a new toy. emoticon_xbye", 
   {}, 
   417775, 
   null, 
   1290802080.0
  ], 
  [
   417793, 
   null, 
   "snakespit", 
   "It's the 450 prophets of Baal, Zorba. They're time is coming.\n\n \n OOOOOOOOO!!! Prophet of Baal? Do I get a membership card and a sticker for my car? How about a nifty sweatshirt or a lapel pin? Please have mine engraved with my number: #317. You should expect 449 more orders soon.", 
   {}, 
   417784, 
   null, 
   1290812400.0
  ], 
  [
   417798, 
   null, 
   "Accipiter", 
   "It's the 450 prophets of Baal, Zorba. They're time is coming.\n\n \n Zorba, I want to warn you to be wary of ez's romantic advances towards you.\n \n He obviously has hot sweaty man love on his mind.", 
   {}, 
   417784, 
   null, 
   1290819060.0
  ], 
  [
   417827, 
   null, 
   "Easyrider", 
   "Yeah, that Jefferson, he sure was an EZ / Archie wannabe, wasn't he? emoticon_rolleyes\n\n \n I know you roll your eyes a lot, preppie, but never for the right reasons.\n \n \"Can the liberties of a nation be thought secure when we have \n removed their only firm basis, a conviction in the minds of the\n people that these liberties are the gift of God? That they are\n not to be violated but with His wrath? Indeed I tremble for my\n country when I reflect that God is just; and that His justice\n cannot sleep forever.\" (Notes on the State of Virginia, 1781)\n \n \"I shall need, too, the favor of that Being in whose hands we\n are, who lead our forefathers, as Israel of old, from their\n native land and planted them in a country flowing with all\n the necessities and comforts of life.\" (Monday, March 4,\n 1805, in his 2nd Inaugural Address)\n \n Remember, a strict deist was one who believed God was like a watchmaker, who wound up the universe and thereafter did not involve himself in the affairs of men and nations. Jefferson obviously believed otherwise. \n \n Speaking of Godly principles, Jefferson stated:\n \n \"A more beautiful or precious morsel of ethics I have never\n seen; it is a document in proof that I am a real Christian,\n that is to say, a disciple of the doctrines of Jesus.\"\n (Jan. 9, 1816 - In a letter to Charles Thomson)\n \n And this is the very same Jefferson who attended Christian religious services in government buildings!\n \n Eat your heart out, or what's left of it.\n \n \n\n This is NOT a Christian nation, was never intended to be, and was regarded by its overwhelmingly Deist crafters as a great success largely because of its refusal to be one.\n\n \n <Flush<\n \n Jefferson wasn't a deist. Neither was Franklin, Madison, or Washington. You don't even know what a deist in those days believed in, do you?\n \n Name me just 5 deists from the Founding Fathers who signed the Declaration of Independence?\n \n Many of the founding fathers recognized that the principles of civil law were inseparably linked to Biblical truths. James Wilson, one of the original Supreme Court Justices, and a signer of the Constitution, explained,\n \n \"Human law must rest its authority ultimately upon the authority of that law which is divine...Far from being rivals or enemies, religion and law are twin sisters, friends, and mutual assistants...\"\n \n On a number of occasions, the United States Supreme Court specifically recognized America as a Christian nation. In the case \"Church of the Holy Trinity vs. the United States\" (Feb. 29, 1892, US457-458), Justice Josiah Brewer, following a lengthy and exhaustive search of early American historical literature, commented, \"We find everywhere a clear recognition of the same truth....that we are a Christian nation....\"\n \n In another Supreme Court Case, \"Zorach vs. Clauson\" (1952, US306 307 313), Justice William O. Douglas categorically stated, \"We are a religious people and our institutions presuppose a Supreme Being.\" Further, in \"United States vs. Macintosh\" (1931, 283 US 605, 625), Justice George Sutherland affirmed, \"We are a Christian people....affording to one another the equal right of religious freedom, and acknowledge with reverence the duty of obedience to the will of God.\"\n \n At the Constitutional Convention on June 28, 1787, Benjamin Franklin noted: &#8220;...The longer I live, the more convincing proofs I see of this truth, that God governs in the affairs of men. And if a sparrow cannot fall to the ground without His notice, is it probable that an empire can rise without his aid? We have been assured, Sir, in the Sacred Writings, that &#8216;except the Lord build the House, they labor in vain that build it.&#8221;\n \n You're busted, Mr LA Revisionist.", 
   {}, 
   417760, 
   null, 
   1290878880.0
  ], 
  [
   417867, 
   null, 
   "Penfold", 
   "I taught Penfold the lemming, a new word and now he will overuse it as all children do with a new toy. emoticon_xbye\n\n \n There's only you and me and you who ever used it on this site, Archiemongo!", 
   {}, 
   417788, 
   null, 
   1290895080.0
  ], 
  [
   417875, 
   null, 
   "pappillion001", 
   "I know you roll your eyes a lot, preppie, but never for the right reasons.\n \n \"Can the liberties of a nation be thought secure when we have \n removed their only firm basis, a conviction in the minds of the\n people that these liberties are the gift of God? That they are\n not to be violated but with His wrath? Indeed I tremble for my\n country when I reflect that God is just; and that His justice\n cannot sleep forever.\" (Notes on the State of Virginia, 1781)\n \n \"I shall need, too, the favor of that Being in whose hands we\n are, who lead our forefathers, as Israel of old, from their\n native land and planted them in a country flowing with all\n the necessities and comforts of life.\" (Monday, March 4,\n 1805, in his 2nd Inaugural Address)\n \n Remember, a strict deist was one who believed God was like a watchmaker, who wound up the universe and thereafter did not involve himself in the affairs of men and nations. Jefferson obviously believed otherwise. \n \n Speaking of Godly principles, Jefferson stated:\n \n \"A more beautiful or precious morsel of ethics I have never\n seen; it is a document in proof that I am a real Christian,\n that is to say, a disciple of the doctrines of Jesus.\"\n (Jan. 9, 1816 - In a letter to Charles Thomson)\n \n And this is the very same Jefferson who attended Christian religious services in government buildings!\n \n Eat your heart out, or what's left of it.\n \n \n \n <Flush<\n \n Jefferson wasn't a deist. Neither was Franklin, Madison, or Washington. You don't even know what a deist in those days believed in, do you?\n \n Name me just 5 deists from the Founding Fathers who signed the Declaration of Independence?\n \n Many of the founding fathers recognized that the principles of civil law were inseparably linked to Biblical truths. James Wilson, one of the original Supreme Court Justices, and a signer of the Constitution, explained,\n \n \"Human law must rest its authority ultimately upon the authority of that law which is divine...Far from being rivals or enemies, religion and law are twin sisters, friends, and mutual assistants...\"\n\n \n \nOn a number of occasions, the United States Supreme Court specifically recognized America as a Christian nation. In the case \"Church of the Holy Trinity vs. the United States\" (Feb. 29, 1892, US457-458), Justice Josiah Brewer, following a lengthy and exhaustive search of early American historical literature, commented, \"We find everywhere a clear recognition of the same truth....that we are a Christian nation....\"\n \n\n \n \n This case is cited most often for its determination of how legislative intent can be determined. Justice Antonin Scalia has denounced the Holy Trinity decision as the \"prototypical case\" in which a judge follows the intent of the legislature rather than the text of the statute, and thus as being in opposition to his judicial philosophy of textualism. The textualist position holds that courts should follow the text of a law rather than attempt to read exceptions into the law in accordance with the legislative intent. Scalia has thus criticized the principle of the Holy Trinity case as \"nothing but an invitation to judicial lawmaking.\"[5]\n \n The case is also famous for Justice Brewer's statements that America is a \"Christian nation.\" While this case was not specifically about religion, the court considered America's Christian identity to be a strong support for its conclusion. Almost half of the text of the opinion is spent demonstrating America's Christian identity, in order to show that congress could not have intended to prohibit foreign ministers. Rejecting this \"Christian nation\" argument in Public Citizen v. Department of Justice, 491 U.S. 440 (1989),[2] Justice Kennedy, joined by Chief Justice Rehnquist and Justice O'Connor, wrote:\n \n \"The central support for the Court's ultimate conclusion that Congress did not intend the law to cover Christian ministers is its lengthy review of the 'unofficial declarations to the mass of organic utterances that this is a Christian nation,' and which were taken to prove that it could not 'be believed that a Congress of the United States intended to make it a misdemeanor for a church of this country to contract for the services of a Christian minister residing in another nation.' I should think the potential of this doctrine to allow judges to substitute their personal predilections for the will of the Congress is so self-evident from the case which spawned it as to require no further discussion of its susceptibility to abuse.\"' Id., at 471.\n \n This is the case that you cry about all the time. Legislating from the bench. Here the judge said I know the law is specific and that the lower court was absolutely correct in upholding the law but I think lawmakers just forgot and had anybody reminded them would have included a provision to allow a special exemption for religion. I know they did for other professions but it just isn't possible that they would not give special consideration to God who all men must worship.\n \n \nIn another Supreme Court Case, \"Zorach vs. Clauson\" (1952, US306 307 313), Justice William O. Douglas categorically stated, \"We are a religious people and our institutions presuppose a Supreme Being.\" Further, in \"United States vs. Macintosh\" (1931, 283 US 605, 625), Justice George Sutherland affirmed, \"We are a Christian people....affording to one another the equal right of religious freedom, and acknowledge with reverence the duty of obedience to the will of God.\"\n\n \n God, would it hurt you to tell the truth for once. Talk about taking something out of context. You didn't get led off the cliff this time, brother you were given a swift kick and the finger on your way down. Here is what the Judge said \n \n We are a religious people whose institutions presuppose a Supreme Being. We guarantee the freedom to worship as one chooses. We make room for as wide a variety of beliefs and creeds as the spiritual needs of man deem necessary. We sponsor an attitude on the part of government that shows no partiality to any one group and that lets each flourish according to the zeal of its adherents and the appeal of its dogma. When the state encourages religious instruction or cooperates with religious authorities by adjusting the schedule of public events to sectarian needs, it follows the best of our traditions. For it then respects the religious nature of our people and accommodates the public service to their spiritual needs. To hold that it may not would be to find in the Constitution a requirement that the government show a callous indifference to religious groups. That would be preferring those who believe in no religion over those who do believe. Government may not finance religious groups nor undertake religious instruction nor blend secular and sectarian education nor use secular institutions to force one or some religion on any person. But we find no constitutional requirement which makes it necessary for government to be hostile to religion and to throw its weight against efforts to widen the effective scope of religious influence. The government must be neutral when it comes to competition between sects. It may not thrust any sect on any person. It may not make a religious observance compulsory. It may not coerce anyone to attend church, to observe a religious holiday, or to take religious instruction. But it can close its doors or suspend its operations as to those who want to repair to their religious sanctuary for worship or instruction. No more than that is undertaken here. \n \n Sounds like there is a real push for religion there huh?\n \n \nAt the Constitutional Convention on June 28, 1787, Benjamin Franklin noted: \"...The longer I live, the more convincing proofs I see of this truth, that God governs in the affairs of men. And if a sparrow cannot fall to the ground without His notice, is it probable that an empire can rise without his aid? We have been assured, Sir, in the Sacred Writings, that 'except the Lord build the House, they labor in vain that build it.\"\n \n You're busted, Mr LA Revisionist.\n\n \n Nobody is saying that there were not religious people among the founders, they all saw the inside of a church at some point in their lives. What you fail to grasp and even weaken your own argument with is very simply put\n \n If they were so religious why is there no provision for religion to participate in government?", 
   {
    "unicode_changes_made": true
   }, 
   417827, 
   null, 
   1290898140.0
  ], 
  [
   417880, 
   null, 
   "Easyrider", 
   "What you fail to grasp and even weaken your own argument with is very simply put\n \n If they were so religious why is there no provision for religion to participate in government?\n\n \n \"In God We Trust\" is our national motto. (36 United States Code,Section 86)\n \n \"In God We Trust\" has been on our coins since 1863. (even before it was our national motto) (31 United States Code, Section 5112 [D] [1]\n \n Our Pledge of Allegiance cites \"one nation under God.\"\n \n Both state legislatures and United States Congress employ paid chaplains to pray at the opening of all sessions.\n \n All military branches of the United States government have paid chaplains.\n \n The inscription on the Liberty Bell cites Leviticus 25:10\n \n A portrait of Moses with the Ten Commandments hangs above the Speaker's chair in the United States Congress.\n \n The Library of Congress (another government institution) has statues of the apostle Paul and Moses, and it has large inscriptions of Micah 6:8 and Psalm 19:1prominently displayed. (Try pulling that off at the next high school football game)\n \n The Lincoln Memorial has chiseled on it, \"Judgments of the Lord are righteous.\" (Government Property)\n \n The Tomb of the Unknown Soldier is dedicated to a soldier \"Known but to God.\"\n \n There is a prayer room in Congress. (Go tell your local school board you want the same thing that \"our\" Government has....a prayer room. Better yet ask the ACLU if they will either allow prayer rooms in our schools or fight to have the one our Government has to be removed ...just for grins of course.\n \n This has got to be the best one yet...-The very branch of our US Government which ruled against prayers at a high school football game opens the Supreme Court Session with the words, \"God save the United States and this honorable court.\" They do this publicly, not privately.\n \n The United States Constitution refers to Jesus, stating the Constitution was signed in 1787 \"in the year of our Lord.\" (Could the US Government explain which Lord they are referring to on this sacred document if not Jesus?)\n \n The United States Government has mandated \"National Day of Prayer.\" (36 United States Code, Section 169 [H]. (Think about that....The very government who has ruled against public prayer at schools because of the misguided \"Separation of Church and State\" doctrine has mandated a \"National Day of Prayer.\" by US Government Law!! )\n \n Christmas is a United States Government Holiday.\n \n http://jmm.aaa.net.au/articles/381.htm\n \n And atheists account for no more than 5% of the population. So get back in your closets.", 
   {
    "unicode_changes_made": true
   }, 
   417875, 
   null, 
   1290906900.0
  ], 
  [
   417882, 
   null, 
   "Penfold", 
   "\"In God We Trust\" is our national motto. (36 United States Code,Section 86)\n \n \"In God We Trust\" has been on our coins since 1863. (even before it was our national motto) (31 United States Code, Section 5112 [D] [1]\n \n Our Pledge of Allegiance cites \"one nation under God.\"\n \n Both state legislatures and United States Congress employ paid chaplains to pray at the opening of all sessions.\n \n All military branches of the United States government have paid chaplains.\n \n The inscription on the Liberty Bell cites Leviticus 25:10\n \n A portrait of Moses with the Ten Commandments hangs above the Speaker's chair in the United States Congress.\n \n The Library of Congress (another government institution) has statues of the apostle Paul and Moses, and it has large inscriptions of Micah 6:8 and Psalm 19:1prominently displayed. (Try pulling that off at the next high school football game)\n \n The Lincoln Memorial has chiseled on it, \"Judgments of the Lord are righteous.\" (Government Property)\n \n The Tomb of the Unknown Soldier is dedicated to a soldier \"Known but to God.\"\n \n There is a prayer room in Congress. (Go tell your local school board you want the same thing that \"our\" Government has....a prayer room. Better yet ask the ACLU if they will either allow prayer rooms in our schools or fight to have the one our Government has to be removed ...just for grins of course.\n \n This has got to be the best one yet...-The very branch of our US Government which ruled against prayers at a high school football game opens the Supreme Court Session with the words, \"God save the United States and this honorable court.\" They do this publicly, not privately.\n \n The United States Constitution refers to Jesus, stating the Constitution was signed in 1787 \"in the year of our Lord.\" (Could the US Government explain which Lord they are referring to on this sacred document if not Jesus?)\n \n The United States Government has mandated \"National Day of Prayer.\" (36 United States Code, Section 169 [H]. (Think about that....The very government who has ruled against public prayer at schools because of the misguided \"Separation of Church and State\" doctrine has mandated a \"National Day of Prayer.\" by US Government Law!! )\n \n Christmas is a United States Government Holiday.\n \n http://jmm.aaa.net.au/articles/381.htm\n \n And atheists account for no more than 5% of the population. So get back in your closets.\n\n \n Most of those cut and paste references do not date to the founding fathers, so are irrelevant, and atheists are under-represented in the prison population, so they are demonstrably a more moral group than the supernaturalist majority.", 
   {
    "unicode_changes_made": true
   }, 
   417880, 
   null, 
   1290908220.0
  ], 
  [
   417885, 
   null, 
   "Easyrider", 
   "Most of those cut and paste references do not date to the founding fathers, so are irrelevant, and atheists are under-represented in the prison population, so they are demonstrably a more moral group than the supernaturalist majority.\n\n \n You want to know about atheism and the Founding Fathers?\n \n Dr. M. E. Bradford of the University of Dallas conducted a study of the Founding Founders to look at this very important question (whether the Founding Fathers were deists or Christians or atheists). He discovered the Founders were members of denominations as follows: twenty-eight Episcopalians, eight Presbyterians, seven Congregationalists, two Lutherans, two Dutch Reformed, two Methodists, two Roman Catholics, and three deists. (and no atheists)\n \n Reference: M. E. Bradford, A Worthy Company: Brief Lives of the Framers of the United States Constitution (Marlborough, NH: Plymouth Rock Foundation, 1982), iv&#8211;v.\n \n Cry your eyes out, sport. You guys never amounted to a hill of beans in the first place. And you're totally irrelevant now, as far as I'm concerned.\n \n You have no hope for anything lasting, except to be Satan's whipping boys for all eternity.", 
   {}, 
   417882, 
   null, 
   1290909060.0
  ], 
  [
   417893, 
   null, 
   "pappillion001", 
   "\"In God We Trust\" is our national motto. (36 United States Code,Section 86)\n \n \"In God We Trust\" has been on our coins since 1863. (even before it was our national motto) (31 United States Code, Section 5112 [D] [1]\n \n Our Pledge of Allegiance cites \"one nation under God.\"\n \n Both state legislatures and United States Congress employ paid chaplains to pray at the opening of all sessions.\n \n All military branches of the United States government have paid chaplains.\n \n The inscription on the Liberty Bell cites Leviticus 25:10\n \n A portrait of Moses with the Ten Commandments hangs above the Speaker's chair in the United States Congress.\n \n The Library of Congress (another government institution) has statues of the apostle Paul and Moses, and it has large inscriptions of Micah 6:8 and Psalm 19:1prominently displayed. (Try pulling that off at the next high school football game)\n \n The Lincoln Memorial has chiseled on it, \"Judgments of the Lord are righteous.\" (Government Property)\n \n The Tomb of the Unknown Soldier is dedicated to a soldier \"Known but to God.\"\n \n There is a prayer room in Congress. (Go tell your local school board you want the same thing that \"our\" Government has....a prayer room. Better yet ask the ACLU if they will either allow prayer rooms in our schools or fight to have the one our Government has to be removed ...just for grins of course.\n \n This has got to be the best one yet...-The very branch of our US Government which ruled against prayers at a high school football game opens the Supreme Court Session with the words, \"God save the United States and this honorable court.\" They do this publicly, not privately.\n \n The United States Constitution refers to Jesus, stating the Constitution was signed in 1787 \"in the year of our Lord.\" (Could the US Government explain which Lord they are referring to on this sacred document if not Jesus?)\n \n The United States Government has mandated \"National Day of Prayer.\" (36 United States Code, Section 169 [H]. (Think about that....The very government who has ruled against public prayer at schools because of the misguided \"Separation of Church and State\" doctrine has mandated a \"National Day of Prayer.\" by US Government Law!! )\n \n Christmas is a United States Government Holiday.\n \n http://jmm.aaa.net.au/articles/381.htm\n \n And atheists account for no more than 5% of the population. So get back in your closets.\n\n \n Would it not be easier to just say, \"Yes Pappillion you are right, the founders and subsequent government representatives did have religion in their personal lives, some more than others and most of the population during that time were religious. Yes you are correct in stating that then it was a cultural taboo to not believe in God and many of the advances in science that showed a great many errors in the bible had yet to be discovered. Yes Pappillion you are also correct that I have so far only shown that people were religious and have no answer to your question why if the people felt so strongly about religion they made no provision for it to have a say in the process of government. \n \n Do you see that everything you have said supports only that people were religious, which wasn't the question and I agree with. \n \n The Supreme court quotes are either a hypocritical anomoly that has been denounced or purposly misrepresented, maybe not by you but the site you pulled it from knew they were in effect lying to make their point.\n \n If the fact that lying is required to validate a point is not sufficient evidence that the point isn't valid I don't know what to tell you. I would like to think that isn't Christianity, but it happens so often. How do you say you know what I said earlier that made you believe, well that was a lie, but Jesus really did say this this and this.\n \n And then you wonder why people question the bible and are so critical.\n \n Your quote is why. Done by thousands of people over thousand of years before you were even born and there seems to be no inclination to discontinue the practice.", 
   {
    "unicode_changes_made": true
   }, 
   417880, 
   null, 
   1290931800.0
  ], 
  [
   417895, 
   null, 
   "Easyrider", 
   "Yes you are correct in stating that then it was a cultural taboo to not believe in God and many of the advances in science that showed a great many errors in the bible had yet to be discovered.\n\n \n Hogwash. \n \n \n\n The Supreme court quotes are either a hypocritical anomoly that has been denounced or purposly misrepresented, maybe not by you but the site you pulled it from knew they were in effect lying to make their point.\n\n \n More hogwash.\n \n When are you people going to identify for us just five (5) deist Founding Fathers who signed the Declaration of Independence? Mr LA Exaggeration has so far been totally unable to back up his spittle about the \"overwhelmingly (numbers of) Deist crafters.\" You want historical revisionism? That's a truckload. So maybe you can help him back up his fairy tale. And before you revise history again, understand in those days that a true deist was one who believed God created the universe and then sat back and (1) did not involve himself in the affairs of men and nations and, (2) did not give (divine) revelation to man. So let's see your list from the Founding Fathers (\"crafters\" in LA Write speak) who signed the Declaration of Independence? Who are those bad boys?", 
   {}, 
   417893, 
   null, 
   1290942480.0
  ], 
  [
   417944, 
   null, 
   "pappillion001", 
   "Hogwash. \n \n \n \n More hogwash.\n \n When are you people going to identify for us just five (5) deist Founding Fathers who signed the Declaration of Independence? Mr LA Exaggeration has so far been totally unable to back up his spittle about the \"overwhelmingly (numbers of) Deist crafters.\" You want historical revisionism? That's a truckload. So maybe you can help him back up his fairy tale. And before you revise history again, understand in those days that a true deist was one who believed God created the universe and then sat back and (1) did not involve himself in the affairs of men and nations and, (2) did not give (divine) revelation to man. So let's see your list from the Founding Fathers (\"crafters\" in LA Write speak) who signed the Declaration of Independence? Who are those bad boys?\n\n \n \n \n What you said\n \n Quote:\n On a number of occasions, the United States Supreme Court specifically recognized America as a Christian nation....\n \n In another Supreme Court Case, \"Zorach vs. Clauson\" (1952, US306 307 313), Justice William O. Douglas categorically stated, \"We are a religious people and our institutions presuppose a Supreme Being.\" \n \n What I said\n \n God, would it hurt you to tell the truth for once. Talk about taking something out of context. You didn't get led off the cliff this time, brother you were given a swift kick and the finger on your way down. Here is what the Judge said\n \n What the Judge said\n \n We are a religious people whose institutions presuppose a Supreme Being.\n \n What the Judges next sentences were that you left out.\n \n We guarantee the freedom to worship as one chooses. We make room for as wide a variety of beliefs and creeds as the spiritual needs of man deem necessary. We sponsor an attitude on the part of government that shows no partiality to any one group and that lets each flourish according to the zeal of its adherents and the appeal of its dogma. When the state encourages religious instruction or cooperates with religious authorities by adjusting the schedule of public events to sectarian needs, it follows the best of our traditions. For it then respects the religious nature of our people and accommodates the public service to their spiritual needs. To hold that it may not would be to find in the Constitution a requirement that the government show a callous indifference to religious groups. That would be preferring those who believe in no religion over those who do believe. Government may not finance religious groups nor undertake religious instruction nor blend secular and sectarian education nor use secular institutions to force one or some religion on any person. But we find no constitutional requirement which makes it necessary for government to be hostile to religion and to throw its weight against efforts to widen the effective scope of religious influence. The government must be neutral when it comes to competition between sects. It may not thrust any sect on any person. It may not make a religious observance compulsory. It may not coerce anyone to attend church, to observe a religious holiday, or to take religious instruction. But it can close its doors or suspend its operations as to those who want to repair to their religious sanctuary for worship or instruction. No more than that is undertaken here.\n \n The Judge is upholding religious freedom for all religions, including the lack thereof. He recognizes that people are religious and government has the obligation to protect the individual's right to practice that religion while not promoting one over the other. which you have proven is the case with all your examples. Showing your bias and failure to grasp with any objectivity the obvious preferential treatment Christianity has enjoyed.\n \n Your question is irrelevant. That religion was a part of society and that much of the population practiced to some degree is not an issue, it is true they did. So there is your answer. \n \n Now answer my question, If as you say religion was so vitally important to them why is there no provision for it to participate in government. It does not have any representation in any branch that dictates policy, it has no separate voting privilege and is specifically prohibited from doing so. The founders were concerned with rights, freedom and law and those made it into our government why not religion?\n \n And making statues and carving statements in them is not participation in government it's decoration. Your religion has a tendency to act like a male dog pixxing on everything so everybody knows you have laid claim to it.", 
   {}, 
   417895, 
   null, 
   1290978780.0
  ], 
  [
   417956, 
   null, 
   "Easyrider", 
   "\n \n Now answer my question, If as you say religion was so vitally important to them why is there no provision for it to participate in government.\n\n \n That's another gaffe on your part. Christians don't need to be written into the Constitution and government because the majority of Americans are Christians and RUN the government.\n \n Where's your atheists?", 
   {}, 
   417944, 
   null, 
   1290981000.0
  ], 
  [
   417998, 
   null, 
   "pappillion001", 
   "That's another gaffe on your part. Christians don't need to be written into the Constitution and government because the majority of Americans are Christians and RUN the government.\n \n Where's your atheists?\n\n \n Pick 10 republicans that claim to be Christians probably 5 are either gay, commiting adultry or stealing.\n \n The other 5 can be as Christian as Jesus, sorry he was Jewish, but you get my point. The other 5 don't get to push their Christian agenda onto the rest of the country, so I will consider this another arguement that got away from you. \n \n It's not that God doesn't exist it's your perception of him that gets you in trouble. Truth is truth and it is really hard to pick it apart, but when it isn't the truth that falls apart just by looking at it.", 
   {}, 
   417956, 
   null, 
   1291018260.0
  ], 
  [
   418022, 
   null, 
   "Easyrider", 
   "\n \n The other 5 can be as Christian as Jesus, sorry he was Jewish....\n\n \n Why didn't the Jews like him then?\n \n p.s. New day - are you still determined to wind up in the Pit?", 
   {}, 
   417998, 
   null, 
   1291074840.0
  ], 
  [
   418041, 
   null, 
   "gansao", 
   "Yeah, that Jefferson, he sure was an EZ / Archie wannabe, wasn't he? emoticon_rolleyes\n \n This persistence of right-wing fundies in trying to make the Founding Fathers (Jefferson, Adams, Madison, Paine, Washington, Franklin) into One of Them is as asinine as it is provably revisionist. (Oh, they'll pull out names like Henry Clay and others who WANTED it to be so... but those guys were on the losing side. Hence the first amendment, and Article VI, paragraph 3 of the Constitution: ... \"no religious test shall ever be required as a qualification to any office or public trust under the United States.\")\n \n This is NOT a Christian nation, was never intended to be, and was regarded by its overwhelmingly Deist crafters as a great success largely because of its refusal to be one.\n \n (By the way, if you Holy Rollers want more evidence of this, I got a trunkload of more quotes from Jefferson, et al, and I'll be happy to trot them out. And if your Plan B is to start trotting out the unfounded \"founder's quotes\" that anti-separationist David Barton was ultimately forced to admit were spurious, knock yourselves out.)\n\n \n Mr Jefferson seems a wise man.\n What was his views on slavery, homosexuality and capital punishment?", 
   {}, 
   417760, 
   null, 
   1291084140.0
  ], 
  [
   418046, 
   null, 
   "Easyrider", 
   "Mr Jefferson seems a wise man.\n What was his views on slavery, homosexuality and capital punishment?\n\n \n Here's Jefferson on sodomy:\n \n \"Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.\" - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n Here's more on his views on Proportioning Crimes and Punishment:\n \n Amendment VIII: Thomas Jefferson, A Bill for Proportioning Crimes and Punishments", 
   {
    "unicode_changes_made": true
   }, 
   418041, 
   null, 
   1291086120.0
  ], 
  [
   418049, 
   null, 
   "gansao", 
   "Here's Jefferson on sodomy:\n \n \"Whosoever shall be guilty of Rape, Polygamy, or Sodomy with man or woman shall be punished, if a man, by castration, if a woman, by cutting thro' the cartilage of her nose a hole of one half inch diameter at the least.\" - Thomas Jefferson - A Bill for Proportioning Crimes and Punishments\n \n Here's more on his views on Proportioning Crimes and Punishment:\n \n Amendment VIII: Thomas Jefferson, A Bill for Proportioning Crimes and Punishments\n\n \n He makes the present day right wingers seem like bleeding heart liberals to me.\n \n In fact he might accuse YOU of being a bleeding heart liberal Easy...seeing as you have never advocated the castration of homosexuals lol!", 
   {
    "unicode_changes_made": true
   }, 
   418046, 
   null, 
   1291087020.0
  ], 
  [
   418070, 
   null, 
   "Matthew", 
   "[Citing Jefferson:]...rational men not being able to swallow their impious heresies, in order to force them down their throats, they raise the hue and cry of infidelity, while themselves are the greatest obstacles to the advancement of the real doctrines of Jesus, and do in fact constitute the real Anti-Christ.\n\n \n I've been saying that for years! According to the doctrine of the Anti-Christ, he'll be somebody who claims to be doing the will of God, not an atheist\n \n Christian fundamentalists fit their own definition of the Anti-Christ far better than any Dawkins. It's really quite hilarious.\n \n Thanks for that goldmine of Jefferson quotes! I always knew he was a religious iconoclast, but there's some great material there that I'll definitely be reading soon.", 
   {}, 
   417760, 
   null, 
   1291130760.0
  ], 
  [
   418072, 
   null, 
   "Matthew", 
   "...What the Judges next sentences were that [Easyrider] left out...\n\n \n Nice work. It's that sort of dishonesty that shows exactly how little conservative Christians' demands for morality and values really mean.\n \n It's akin to the way creationists ever quote Darwin \"acknowledging\" that the idea that something as complex as an eye could evolve by natural selection is absurd. They never point out what he says next.\n \n This is the sort of moral gap that leads many creationists and religious conservatives to bail on religion altogether when they realize how flagrantly they've been lied to.", 
   {}, 
   417944, 
   null, 
   1291131600.0
  ], 
  [
   418073, 
   null, 
   "jyoshu", 
   "Mr Jefferson seems a wise man.\n What was his views on slavery, homosexuality and capital punishment?\n\n \n Why burden them with actual FACTS at this point? ;-)", 
   {}, 
   418041, 
   null, 
   1291135020.0
  ], 
  [
   418078, 
   null, 
   "gansao", 
   "I've been saying that for years! According to the doctrine of the Anti-Christ, he'll be somebody who claims to be doing the will of God, not an atheist\n \n Christian fundamentalists fit their own definition of the Anti-Christ far better than any Dawkins. It's really quite hilarious.\n \n Thanks for that goldmine of Jefferson quotes! I always knew he was a religious iconoclast, but there's some great material there that I'll definitely be reading soon.\n\n \n The fact that Mr Jefferson would have had gay men castrated seems to have slipped by you", 
   {}, 
   418070, 
   null, 
   1291138860.0
  ], 
  [
   418106, 
   null, 
   "pappillion001", 
   "Why didn't the Jews like him then?\n \n p.s. New day - are you still determined to wind up in the Pit?\n\n \n Well because they feared he would bring down the wrath of God on them.\n \n Based on results I would have say that was the case or maybe the wrath of Paul is more accurate. Either way he did not fulfill the requirements of Messiah.", 
   {}, 
   418022, 
   null, 
   1291156860.0
  ], 
  [
   418110, 
   null, 
   "snakespit", 
   "The fact that Mr Jefferson would have had gay men castrated seems to have slipped by you\n\n \n No, not \"gay men\" specifically, but any male engaging in \"sodomy\".", 
   {}, 
   418078, 
   null, 
   1291158060.0
  ], 
  [
   418111, 
   null, 
   "gansao", 
   "No, not \"gay men\" specifically, but any male engaging in \"sodomy\".\n\n \n I didnt say ' gay men' specifically if you read the post.\n So where is my post incorrect?", 
   {}, 
   418110, 
   null, 
   1291158420.0
  ], 
  [
   418114, 
   null, 
   "snakespit", 
   "I didnt say ' gay men' specifically if you read the post.\n So where is my post incorrect?\n\n \n I didn't say 'post incorrect' if you read the post. It was a clarification that the proposed bill targeted any man engaged in sodomy, not merely the gay ones. An important distinction worth mentioning.", 
   {}, 
   418111, 
   null, 
   1291159740.0
  ], 
  [
   418116, 
   null, 
   "snakespit", 
   "\"On the subject of the Criminal Law, all were agreed that the punishment of death should be abolished, except for treason and murder; and that, for other felonies should be substituted hard labor in the public works, and in some cases, the Lex talionis. How this last revolting principle came to obtain our approbation, I do not remember...It was the English law in the time of the Anglo-Saxons, copied probably from the Hebrew law of 'an eye for an eye, a tooth for a tooth,' and it was the law of several ancient people. But the modern mind had left it far in the rear of it's advances.\"[4] -Thomas Jefferson", 
   {}, 
   418114, 
   null, 
   1291160640.0
  ], 
  [
   418117, 
   null, 
   "gansao", 
   "I didn't say 'post incorrect' if you read the post. It was a clarification that the proposed bill targeted any man engaged in sodomy, not merely the gay ones. An important distinction worth mentioning.\n\n \n I assumed that people knew that women can be sodomised too but if you think the people on this site are unaware then it was worth mentioning\n \n The person who posted up quotes from Jefferson was a gay man that Mr Jefferson said should have his balls cut off...another point worth mentioning In fact it was the one I was stressing....which obviously passed you by....", 
   {}, 
   418114, 
   null, 
   1291160880.0
  ], 
  [
   418170, 
   null, 
   "snakespit", 
   "\"I have strictly observed the scale of punishments settled by the Committee, without being entirely satisfied with it. The lex talionis, altho' a restitution of the Common law,...will be revolting to the humanised feelings of modern times. An eye for an eye, and a hand for a hand will exhibit spectacles in execution whose moral effect would be questionable...This needs reconsideration.\" -Thomas Jefferson\n \n \n \n Apparently it was not Jefferson's wish that anyone be castrated. Jefferson was head of the committee that wrote the bill, not the sole author. He clearly states in a letter to fellow committee member George Wythe that he feels that the scale of punishments needs reconsideration. Jefferson clearly did not agree with the eye for an eye mentality of some of his cohorts.", 
   {}, 
   418117, 
   null, 
   1291212120.0
  ], 
  [
   418171, 
   null, 
   "gansao", 
   "Apparently it was not Jefferson's wish that anyone be castrated. Jefferson was head of the committee that wrote the bill, not the sole author. He clearly states in a letter to fellow committee member George Wythe that he feels that the scale of punishments needs reconsideration. Jefferson clearly did not agree with the eye for an eye mentality of some of his cohorts.\n\n \n Weasel words. He was head of the committee so was responsible for it.\n He obviously thought that the castration of sodomites was not an important enough issue to resist let alone far enough from his own idea of the correct penalty to resign.\n He clearly thought there should a harsh penalty for sodomy .", 
   {}, 
   418170, 
   null, 
   1291213200.0
  ], 
  [
   418172, 
   null, 
   "Matthew", 
   "The fact that Mr Jefferson would have had gay men castrated seems to have slipped by you\n\n \n Nobody's perfect. I'm guessing that Jefferson could be convinced to reconsider. He was, after all, a man of reason -- fallible, but rational.\n \n And in any event, he's clearly a religious iconoclast whose opposition to Biblical literalism -- especially to supernaturalism -- is legendary.", 
   {}, 
   418078, 
   null, 
   1291213560.0
  ], 
  [
   418174, 
   null, 
   "gansao", 
   "Nobody's perfect. I'm guessing that Jefferson could be convinced to reconsider. .\n\n \n And thats what it is ..a guess.\n The evidence suggests that he thought that a brutal castration would have a questionable moral effect not that sodomy was excusable.\n Chemical castration was unavailable then.", 
   {}, 
   418172, 
   null, 
   1291214340.0
  ], 
  [
   418190, 
   null, 
   "snakespit", 
   "Weasel words. He was head of the committee so was responsible for it.\n He obviously thought that the castration of sodomites was not an important enough issue to resist let alone far enough from his own idea of the correct penalty to resign.\n\n Jeffersons words to a fellow comittee member stating \"this needs reconsideration\" isn't resistance? Or do you feel he should have stomped his feet on the floor and held his breath until they changed their minds?\n \n Thankfully, Jefferson and the majority of our founding fathers were not childish enough to have the \"I'm taking my toys and going home\" attitude. \n \n Mature debate amongst adults often leads to reasoned solutions. A rather important ideal to keep in mind if you are building a nation, don't you think?", 
   {}, 
   418171, 
   null, 
   1291243260.0
  ], 
  [
   418192, 
   null, 
   "gansao", 
   "Jeffersons words to a fellow comittee member stating \"this needs reconsideration\" isn't resistance? Or do you feel he should have stomped his feet on the floor and held his breath until they changed their minds?\n \n Thankfully, Jefferson and the majority of our founding fathers were not childish enough to have the \"I'm taking my toys and going home\" attitude. \n \n Mature debate amongst adults often leads to reasoned solutions. A rather important ideal to keep in mind if you are building a nation, don't you think?\n\n \n Jefferson had reservations about sodomites having their balls chopped off.\n So if he insisted that this brutal practise had to be stopped or he would resign he would be guilty of ' taking his toys and going home'?\n What planet are you from?\n \n He did not think castration of sodomites was a serious issue, just one that he had reservations about... enough to mention in a letter.", 
   {}, 
   418190, 
   null, 
   1291244400.0
  ], 
  [
   418231, 
   null, 
   "Matthew", 
   "And thats what it is ..a guess.\n The evidence suggests that he thought that a brutal castration would have a questionable moral effect not that sodomy was excusable.\n Chemical castration was unavailable then.\n\n \n So what? My original point about Jefferson was, and still is, that Jefferson thought traditional religion was repugnant. This remains true, whatever his own repugnant view of homosexuality.\n \n Appealing to Jefferson in support of the conservative Christian theocracy hoped for by Zorba and Easyrider (and their \"ilk\") has no basis whatsoever in the facts.", 
   {}, 
   418174, 
   null, 
   1291298700.0
  ], 
  [
   418232, 
   null, 
   "Matthew", 
   "Why burden them with actual FACTS at this point? ;-)\n\n \n Irrelevant facts prove nothing. What Jefferson thought about homosexuality or capital punishment has no bearing at all on what he thought about religion. And in its traditional institutional forms, he clearly thought religion left a lot to be desired. And that's a FACT. (Sorry to burden you.)", 
   {}, 
   418073, 
   null, 
   1291302300.0
  ], 
  [
   418257, 
   null, 
   "gansao", 
   "So what? My original point about Jefferson was, and still is, that Jefferson thought traditional religion was repugnant. This remains true, whatever his own repugnant view of homosexuality.\n \n Appealing to Jefferson in support of the conservative Christian theocracy hoped for by Zorba and Easyrider (and their \"ilk\") has no basis whatsoever in the facts.\n\n \n So you can hate gays as long as you dont agree with Christian dogma?", 
   {}, 
   418231, 
   null, 
   1291328460.0
  ], 
  [
   418296, 
   null, 
   "snakespit", 
   "Jefferson had reservations about sodomites having their balls chopped off.\n\n A far cry from:\n \n \nThe fact that Mr Jefferson would have had gay men castrated seems to have slipped by you\n\n It appears that the use of the word \"fact\" might have been a bit misguided. \n \n \nSo if he insisted that this brutal practise had to be stopped or he would resign he would be guilty of ' taking his toys and going home'?\n What planet are you from?\n\n That's not what you said. You said:\n \n \nHe obviously thought that the castration of sodomites was not an important enough issue to resist let alone far enough from his own idea of the correct penalty to resign.\n\n First off, I showed you that he did resist it. He called the principle of lex talionis \"revolting\", and indicates that \"the modern mind had left it far in the rear of it's advances\". He wrote to a fellow committee member, expressed his concerns about it, and stated \"This needs reconsideration\". \n \n Second, what would force him to resign in the first place? Is it a rule that you must resign if you don't agree with something? Some people might be inclined to tuck tail and run when things don't go their way. Thankfully, there have been people like Jefferson who are able to act as a voice of reason and are willing to fight for things that they believe are right. \n \n The enemy never wins until you stop fighting. \n \n \nHe did not think castration of sodomites was a serious issue, just one that he had reservations about... enough to mention in a letter.\n\n Apparently he found it serious enough to call the principle behind it \"revolting\" and \"ancient\", and enough that he stated that it \"needs reconsideration\". \n \n Stop moving the goalposts.", 
   {}, 
   418192, 
   null, 
   1291347120.0
  ], 
  [
   418325, 
   null, 
   "Matthew", 
   "So you can hate gays as long as you dont agree with Christian dogma?\n\n \n Not what I said, at any point. Quit being dishonest.", 
   {}, 
   418257, 
   null, 
   1291387680.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Who's in charge here?", 
  "url": "http://www.4forums.com/political/religion-debates/14746-whos-charge-here.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14746, 
  "discussion_files": [
   [
    "16933.html", 
    "http://www.4forums.com/political/religion-debates/14746-whos-charge-here-print.html"
   ], 
   [
    "16934.html", 
    "http://www.4forums.com/political/religion-debates/14746-whos-charge-here-5-print.html"
   ], 
   [
    "16935.html", 
    "http://www.4forums.com/political/religion-debates/14746-whos-charge-here-4-print.html"
   ], 
   [
    "16936.html", 
    "http://www.4forums.com/political/religion-debates/14746-whos-charge-here-3-print.html"
   ], 
   [
    "16937.html", 
    "http://www.4forums.com/political/religion-debates/14746-whos-charge-here-2-print.html"
   ]
  ], 
  "identifier": 14746
 }
]