[
 [
  [
   417650, 
   null, 
   "Tither", 
   " In U.S., Continuing Record-Low Support for Stricter Gun Control \n For the second year in a row, a record-low 44% of Americans say laws governing the sale of firearms should be made more strict, while 42% say gun laws should be kept as they are now. Twelve percent say gun laws should be made less strict.\n \n Americans' support for stricter gun control laws has gradually declined over the last two decades, from 78% when this question was first asked in 1990 to 49% in 2008, and 44% in 2009 and again this year. As support for stricter gun laws has decreased, support for keeping gun laws as they are now has increased, from 17% in 1990 to 42% now. The percentage of Americans favoring less strict gun control laws has remained relatively stable over the last 20 years, and is now at 12%.\n \n Americans are also less likely to say there should be a law banning the possession of handguns except by the police and other authorized persons. The current 29% who favor such a law is within one percentage point of the low of 28% recorded last year, down from 60% when Gallup first asked this question in 1959 -- the only time when a majority favored such a ban. Support has been below 40% every year since 1993.\n\n \n So 54% of Americans think the gun laws are just fine or need to be less strict. And THAT without knowing about the two most exhaustive studies ever done on gun control. If they knew about this below, I am sure that the numbers would be even more solidly in our favor.\n \n In 2000 to 2002 The CDC conducted a systematic review of scientific evidence regarding the effectiveness of firearms laws in preventing violence, including violent crimes, suicide, and unintentional injury. The systematic review development team identified 51 studies that evaluated the effects of selected firearms laws on violence and met the inclusion criteria for this review. No study was excluded because of limitations in design or execution.\n \n  What did they find?  \n \"the task Force found insufficient evidence to determine the effectiveness of any of the firearms laws or combinations of laws reviewed on violent outcomes.\" \n\n The CDC did suggest more studies. Then a few years later the CDC got a second bite at the apple with The National Academy of Sciences studies. Surprise, the CDC, along with the Anti-gun Joyce foundation funded, the study.\n \n Data on Firearms and Violence Too Weak to Settle Policy Debates; Comprehensive Research Effort Needed\n \n Here is an article about the study Link  who issued a 328-page report based on 253 journal articles, 99 books, 43 government publications, a survey of 80 different gun-control laws and some of its own independent study. \nIn short, the panel could find no link between restrictions on gun ownership and lower rates of crime, firearms violence or even accidents with guns. \n\n In the light of Heller and McDonald, can the Anti-gunners justify most gun laws? Should they not have to justify their existence by proving their value? I say, show us that they work as intended. If they don't, either modify them with provable studies, or maybe even get rid of them.\n \n 51 of the best gun control studies, 253 journal articles, 99 books, 43 government publications, a survey of 80 different gun-control laws and some of its own independent study have already been done. \n \n Gun Control is NOT Crime Control! And neither the Anti-gun CDC nor the predominantly anti-gun National Academy of Sciences can prove that is it. \n \n Doesn't our Constitution deserve proof before one starts stripping away one's Constitutional Rights?", 
   {
    "post_info": {
     "post_title": "New Gallop figures"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1290534060.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New Gallop figures", 
  "url": "http://www.4forums.com/political/gun-control-debates/14741-new-gallop-figures.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14741, 
  "discussion_files": [
   [
    "4377.html", 
    "http://www.4forums.com/political/gun-control-debates/14741-new-gallop-figures-print.html"
   ]
  ], 
  "identifier": 14741
 }
]