[
 [
  [
   418589, 
   null, 
   "Tither", 
   "The title of this thread is A new type of firearm. But It could be, Ask the experts, if you don't know the answer. After all, if you are a law abiding business man, with a family to support, with many employees in the same position. And you just want to know if it is legal to make this 2nd Amendment, Constitutionally recognized and an Inalienable Right, product, because you, later, do not want to be jammed up by the federal bureau that you are asking the question of? Sounds like a reasonable course of legitimate action. No? \n \n Who else are you going to ask? Maybe the Supreme Court, but that answer will take you at least 1 million dollars, a bankruptcy, and Federal Jail term before you are allowed to ask! \n \n David Hardy says: \n An interesting debate over at CleanUpATF.org. It's complicated, but I believe it concerns what to do you have when you have a shotgun with length below the NFA limits, but originally made with a pistol grip instead of a shoulder stock. Is it an ordinary handgun, since it is not designed to be fired from the shoulder? Is it an NFA arm, more regulated, since it is a shotgun with short barrel? Or is it a destructive device, most regulated of all, since it is over .50 caliber and not within any exemption?\n \n Add to that ATF's ability to change its rulings at any time... is the current ruling, that it is an ordinary handgun, an attempt to sucker in the proposed manufacturer (against whom ATF has a serious grudge match) and then, after he has invested in making the firearms, reconsider, seize and forfeit the firearms, and put his production line out of business?\n \n \n \n \n  cleanupatf.org says: \n In my judgment, ATF's October 27, 2010, letter, is a cynical, primitive attempt to bait Mr. Savage into spending a lot of money to manufacture, sell and distribute a product ATF has just authorized as a perfectly legal Title I firearm that is not subject to the NFA, knowing full well that (1) the firearm is, in fact, legally a Destructive Device and could be nothing other than a Destructive Device, and (2) should Mr. Savage actually manufacture, sell and distribute the \"submitted firearm,\" ATF would have only to sit back for a year or so, lick its chops, and then send Mr. Savage a \"reconsideration\" letter notifying him that, in fact, well, ATF \"reconsidered\" the October 27, 2010, letter, and has decided that the \"submitted firearm\" is the Destructive Device that it always was. Doing that would render virtually all of the firearms Mr. Savage manufactured to be contraband, and require that all those sold or distributed be tracked down and seized and forfeited, or destroyed, an action that would certainly affect Mr. Savage's business and reputation (it could bankrupt him, and people would be reluctant to buy anything else from him).\n \n The ATF staff whom I believe conspired to deliberately authorize sending Mr. Savage a legally incorrect letter would probably be in the clear, because (1) the recent decision involving the \"Defendant Firearm\" authorizes ATF to be able to change its mind about a firearm classification at any time, and (2) in any case, it is a long established practice for Federal Law Enforcement entities to mislead, deceive and flat out lie to people in efforts to encourage them to break the law and/or entrap them, under the theory that if such people did so, ATF was only providing an opportunity for them to commit crimes they would commit anyway. Never mind that any activity in this instance would have originated from a manufacturer asking ATF a straight-up question accompanied by a \"submitted firearm\" for ATF's technical evalation and classification.\n \n This is worth thinking about. I don't believe the FTB Chief is a stupid person who doesn't understand the various definitions of an NFA \"firearm.\" The FTB Chief is probably a hard-working civil servant with a spouse, perhaps a child or children in college, bills to pay, a mortgage and perhaps an aging parent to worry about, who isn't independently wealthy, needs his job and a steady paycheck and the retirement benefits he has earned, and got his neck stood on by ATF Chief Counsel and his retinue. \"You will sign this letter,\" the FTB Chief was probably told, \"because it's your job to sign these letters. If you don't, there's a dozen guys lined up to take your job, who will sign the letter in a New York City minute.\" Unfortunately, ATF Chief Counsel and his retinue DIDN'T tell the FTB Chief: \"If you sign this letter, you are affirming and providing valid and reliable evidence of your professional and technical incompetence, and thus make yourself expendable, which is what we want because we don't want to accept the responsibility for telling you to write and sign a legally incorrect letter that represents the official position of ATF.\"\n \n How much of this horrible behavior goes on at ATF? Is it so institutionalized that it has become automatic? Is this how ATF has decided to implement NFA enforcement policy? I'm sure this isn't the only example of ATF Chief Counsel, and ATF top management, tossing one of its own under the bus because it is inconvenient to tell the truth. It is no wonder that some of the postings on CleanUpATF have a primal scream quality about them.\n\n So who is correct? The men and women over at cleanupatf.org, or is it the ATF management? Is this a fair, if the cleanupatf.org people are correct that this is what the AFT heads are doing? I would be interested in your sage thoughts on this one.", 
   {
    "post_info": {
     "post_title": "A new type of firearm"
    }
   }, 
   null, 
   null, 
   1291657080.0
  ], 
  [
   418590, 
   null, 
   "NATO 556", 
   "The people at cleanupatf.org are correct. We all remember the time the ATF ruled that an ordinary shoelace was legally a machine gun and subject to all NFA rules and restrictions.\n \n http://jpfo.org/images02/shoestring.jpg", 
   {}, 
   418589, 
   null, 
   1291666620.0
  ], 
  [
   418648, 
   null, 
   "Superlite27", 
   "I don't see how the ATF works. Maybe someone could explain it to me.\n \n How does a federal bureau regulate an item? There is no Bureau of Anchors, Trailer-hitches, and Footballs is there?\n \n They (supposedly) get their authority from the Intersate Commerce Act in order to \"regulate commerce\". Since firearms are able to be bought and sold across state lines...TA-DA! Interstate commerce!\n \n But aren't anchors, trailer-hitches, and footballs also able to be transferred, sold, and taxed across state lines? Where's the bureau in charge of these items? Buying and selling these items also falls into \"interstate commerce\", correct? We need a Bureau of some sort to police \"interstate commerce\" when it comes to firearms. Why is it just firearms? Where's the distiction? What law do they use to justify it when it comes to firearms, but not furniture, or truck tires, or any other inanimate object?\n \n How is policing one inanimate object (a firearm) legal, while NOT policing any other inanimate object acceptable?\n \n Where does the authority come from?\n \n What other entity can pass a Federal law without oversight?\n \n If the ATF classifies a particular firearm as an NFA item, it becomes a Federal Felony to be in possession of it.\n \n Therefore, an item may be perfectly fine today, and all people posessing such item are fine......\n \n ...but, with a stroke of a pen, some bureaucrat in the ATF can, at a whim, create felons by decreeing, without oversight, that such and such a model of firearm becomes an NFA item, therefore, felonious to posess.\n \n WHERE DO THEY GET THE POWER? WHAT OTHER INANIMATE ITEM IS THUSLY REGULATED BY THE PEN OF A SINGLE BUREAUCRAT?\n \n A shotgun with a barrel less than 18\" is declared a \"destructive device\". \n \n But, hold on! Doesn't a Taurus Judge fire a shotgun shell?\n \n Oh, it's not a shotgun. It's a pistol.\n \n Then why isn't a shotgun with the stock cut off and the barrel shortened considered a pistol?\n \n Nope. It's a destructive device. Even though it has the same form and function as a \"pistol\" that fires a shotgun shell....It's a destructive device.\n \n Why? Because we say so. No oversight. No reason. Nothing else needed. \n \n We're the ATF. We make our own laws. Government \"by the people\"? \n \n HA! Yeah, right.", 
   {}, 
   418590, 
   null, 
   1291751520.0
  ], 
  [
   422340, 
   null, 
   "Doc Jones", 
   "Instead of more gun control, how about bullet control? How about if your local police department was the only place you could buy bullets?\n\n \n PEOPLE v. ZERILLO. (No. 183.)\n \n \nPeople v Zerillo\n [Cite as People v. Zerillo, 219 Mich. 635, 189 N.W. 927 (1922).]\n \n It will be noticed that our Constitution is inclusive of the right of \n every person to bear arms for the defense of himself and the state, and not \n merely citizens, as in the state of Pennsylvania.\n \n The part of the act making it a crime for an unnaturalized foreign-born \n resident to possess a revolver, unless so permitted by the sheriff, \n contravenes the guaranty of such right in the Constitution of the state, and \n is void. The statute must be construed in accord with the provisions of our \n Constitution, and it may stand as an act prohibiting the use of firearms by \n unnaturalized foreign-born residents in hunting or capturing or killing any \n wild bird or animals, either game or otherwise, of any description, \n excepting in defense of person or property, but so far as it makes it a \n crime for unnaturalized residents to possess a revolver for the legitimate \n defense of their persons and property it is void.\n \n Under the complaint and warrant and the evidence the defendant should \n have been adjudged not guilty. The conviction is set aside, and defendant is \n discharged\n\n \n Yet another defective changes names...", 
   {}, 
   418589, 
   null, 
   1295020260.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  A new type of firearm", 
  "url": "http://www.4forums.com/political/gun-control-debates/14768-new-type-firearm.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14768, 
  "discussion_files": [
   [
    "16609.html", 
    "http://www.4forums.com/political/gun-control-debates/14768-new-type-firearm-print.html"
   ]
  ], 
  "identifier": 14768
 }
]