[
 [
  [
   418873, 
   null, 
   "trey", 
   "The center of the political debate has often been, especially today, should government get involved in the economy or not? One part of the stimulus package was to bail out GM & Chrysler. Based on recent data it seems this bail out was worth it (at least in the short run) with both companies having the potantial to become even greater employers of people (bringing down that unemployment rate). However, John Boehner still got up and said it would have been better to let them have gone Chapter 11. In addition, all through the Republican party said whatever was being done, they could achieve on 1/2 the cost (I don't know what facts that % was based on). Is it worth saving Homer's job and his domestic ride, or should he retrain and consider a Prius or public transport? Could intervention be damaging, even when it seems to have worked, and how much is enough?\n \n http://www.cogulus.com/archive/charger/simpsons/bandit/tilt001.jpg\n \n Homer's ride", 
   {
    "post_info": {
     "post_title": "Economic intervention, when &amp; how much?"
    }
   }, 
   null, 
   null, 
   1292033640.0
  ], 
  [
   419097, 
   null, 
   "Justice", 
   "The center of the political debate has often been, especially today, should government get involved in the economy or not? One part of the stimulus package was to bail out GM & Chrysler. Based on recent data it seems this bail out was worth it (at least in the short run) with both companies having the potantial to become even greater employers of people (bringing down that unemployment rate). However, John Boehner still got up and said it would have been better to let them have gone Chapter 11. In addition, all through the Republican party said whatever was being done, they could achieve on 1/2 the cost (I don't know what facts that % was based on). Is it worth saving Homer's job and his domestic ride, or should he retrain and consider a Prius or public transport? Could intervention be damaging, even when it seems to have worked, and how much is enough?\n \n\n \n Government should never intercede into the economic situation. If a company collapses it is because it is no longer profitable. When a company is no longer profitable it is because it has failed. No matter how many times you bail it out it will go under again. \n \n On another level, the government should not be able to use the people's resources for the benefit of a single group of people.", 
   {}, 
   418873, 
   null, 
   1292395680.0
  ], 
  [
   419103, 
   null, 
   "Xcaliber", 
   "Yes the Government Bailed out the Auto industry, however they have since paid back the \"Loan\". The Bail out money was only to keep them from going bankrupt. If the Government works out a deal with a cooperation and re-gains any money lent to said cooperation then I would have no problem with it. I do however have a problem when the Government just Gives Tax payers money away to save a cooperation( Such as Bush did when he bailed out the Airlines.) \n \n John Boehner unfortunately doesn't have a clue as to what he is saying. He's merely sticking to the Bush policies that he helped pass that got us into this economic mess in the first place. For him to go back now would be admitting that the Bush Years were a big Failure of which he was a part of.", 
   {}, 
   419097, 
   null, 
   1292397540.0
  ], 
  [
   419106, 
   null, 
   "Symbiote", 
   "GM \"paid back\" its loan with additional bailout money it received at a later date. \n \n I'll assume at this point that you are simply ignorant of this key fact, and not, like Obama and the CEO of GM, intentionally propagating a deception.", 
   {}, 
   419103, 
   null, 
   1292398080.0
  ], 
  [
   419108, 
   null, 
   "Xcaliber", 
   "GM \"paid back\" its loan with additional bailout money it received at a later date. \n \n I'll assume at this point that you are simply ignorant of this key fact, and not, like Obama and the CEO of GM, intentionally propagating a deception.\n\n \n Sorry, yeah I hadn't kept up with any news since I heard that GM had paid back the loans.. XXXXXXXXXXX at it again.... \n \n General Motors Now Admits It Didn&#8217;t Repay Bailout Money|OpenMarket.org\n \n Some of the Bail out money has been recovered though, The Banks have started paying back some, but they have a long way to go. My point in the previous post was that there were \"Pay Back\" stipulations included in this bailout unlike the Air Line bailouts where Bush just handed them the money with no questions asked.", 
   {}, 
   419106, 
   null, 
   1292398680.0
  ], 
  [
   425549, 
   null, 
   "trey", 
   "John Boehner unfortunately doesn't have a clue as to what he is saying. He's merely sticking to the Bush policies that he helped pass that got us into this economic mess in the first place. For him to go back now would be admitting that the Bush Years were a big Failure of which he was a part of.\n\n \n People like Boehner are probably smart and reasonable, but the way they stick to the rhetoric, you want to take them to one side and ask do you really believe what you are saying? \n \n Back in 1978 Chrysler got bailed out and what followed was 10-15 good years. Ok, they needed to get bailed out again, which accords with what has been said that if you help once, often you will have to help again. But the benefits outweigh the costs and I would think a stronger Chrysler is helping the unemployment figures a little today. So never say never to intervention just because we are capitalists.\n \n That said, I think too much was put in cash for clunkers, and that scheme was knee jerk and didn't bring as much benefit as it cost. However, overall I think without the stimulus the improvement in the unemployment rate seen recently would have happened later. The economic cycle is coming good for Obama, just like it did for Reagan. In early 1983 things were glacial, but by the '84 election the economy was booming.", 
   {}, 
   419108, 
   null, 
   1299722100.0
  ], 
  [
   425552, 
   null, 
   "daewoo", 
   "People like Boehner are probably smart and reasonable, but the way they stick to the rhetoric, you want to take them to one side and ask do you really believe what you are saying? \n \n Back in 1978 Chrysler got bailed out and what followed was 10-15 good years. Ok, they needed to get bailed out again, which accords with what has been said that if you help once, often you will have to help again. But the benefits outweigh the costs and I would think a stronger Chrysler is helping the unemployment figures a little today. So never say never to intervention just because we are capitalists.\n \n That said, I think too much was put in cash for clunkers, and that scheme was knee jerk and didn't bring as much benefit as it cost. However, overall I think without the stimulus the improvement in the unemployment rate seen recently would have happened later. The economic cycle is coming good for Obama, just like it did for Reagan. In early 1983 things were glacial, but by the '84 election the economy was booming.\n\n \n There has been no improvement in unemployment. The unemployment rate has dropped due to increasing numbers of discouraged workers and people dropping out of the work force because they can not find jobs. \n \n It is even worse than that. We need to generate about 150,000 jobs per month just to keep up with population growth. We have not been generating those jobs, so those people are not becoming newly employed, so they are never counted as part of the workforce. There is no accounting for them AT ALL, even though they are available to work, want to work, and just cant FIND work. Even worse, most of these are recent college graduates, so they are RAPIDLY losing any skills they may have picked up in college. \n \n If you include all the unemployed (discouraged workers, etc...) and figure an additional 150,000 per month due to birth/death model (this is what most economists use, even though they know it is probably a little on the low side), real unemployment is running close to 18% right now. \n \n I dont think there is any question that the stimulus has provided the illusion of economic improvement. Throw enough money at the economy and numbers go up. The real test of how well it worked is what happens when you STOP throwing money at the economy. If you look at the monetary growth since the economic crisis, the US would have to have grown at an annual rate of 32% to justify that much monetary creation. \n \n Today we found out that PIMCO, the largest bond fund in the world, has completely dumped not only treasuries, but US agency debt as well from their flagship fund. They literally came out and said \"US government debt is too risky to hold\". This is not some little nothing mutual fund...this is PIMCO, with over 1.1 trillion in assets. \n \n They dumped them because QE2 is scheduled to end in June, and the fed has been the buyer of 70% of US treasuries sold since the financial crisis began. When they stop buying, there is pretty much nobody out there with the confidence in the US economy to step up and replace them. The chinese, and even the Arabs are desperately trying to get rid of US government paper. \n \n This is the problem with this kind of intervention. If you can intervene in cash and get the economy over a rough patch, then you should. This was not a rough spot. We needed a fundamental realingment in the US economy. Instead of doing it, we treated it as a really BIG rough spot and threw a fortune at it, but it is all debt. It is like borrowing a million dollars to buy a ford taurus.", 
   {}, 
   425549, 
   null, 
   1299725040.0
  ], 
  [
   425568, 
   null, 
   "Freedom", 
   "This is the problem with this kind of intervention. If you can intervene in cash and get the economy over a rough patch, then you should. This was not a rough spot. We needed a fundamental realingment in the US economy. Instead of doing it, we treated it as a really BIG rough spot and threw a fortune at it, but it is all debt. It is like borrowing a million dollars to buy a ford taurus.\n\n Haven't you the benefit of hindsight here? How would you differentiate between a rough spot and a deeper problem if you were a politician? Further how would one go about with such a fundamental realignment and finally but most importantly, what is that realignment?", 
   {}, 
   425552, 
   null, 
   1299764100.0
  ], 
  [
   425607, 
   null, 
   "Steeeeve", 
   "\n Today we found out that PIMCO, the largest bond fund in the world, has completely dumped not only treasuries, but US agency debt as well from their flagship fund. They literally came out and said \"US government debt is too risky to hold\". This is not some little nothing mutual fund...this is PIMCO, with over 1.1 trillion in assets. \nWell, they said they were not priced right which I think is scarier. Basically this means they are riskier than what the yield is on the bond. In other words, PIMCO thinks interest rates should be much higher.", 
   {}, 
   425552, 
   null, 
   1299810360.0
  ], 
  [
   425613, 
   null, 
   "daewoo", 
   "Well, they said they were not priced right which I think is scarier. Basically this means they are riskier than what the yield is on the bond. In other words, PIMCO thinks interest rates should be much higher.\n\n \n Not just that, the move indicates that PIMCO thinks they ARE going to go up. They are essentially betting that the fed is going to lose control.", 
   {}, 
   425607, 
   null, 
   1299812220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Economic intervention, when & how much?", 
  "url": "http://www.4forums.com/political/economics-debates/14779-economic-intervention-when-how-much.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 14779, 
  "discussion_files": [
   [
    "30197.html", 
    "http://www.4forums.com/political/economics-debates/14779-economic-intervention-when-how-much-print.html"
   ]
  ], 
  "identifier": 14779
 }
]