[
 [
  [
   418930, 
   null, 
   "Xcaliber", 
   "I'm probably beating a dead horse here but hey, I'm bored... \n \n My question is..\n \n Why is it that Christians here in America insist that this Country was Founded as a Christian Nation upon God. \n \n History has supplied evidence to the Contrary yet Christians, especially the Religious Right insist that we were founded on Religion. The Constitution doesn't make Mention of God, Jesus, or any hint of Religion. I realize that many early Americans were religious, but the Founders recognized ALL religion and not just Christianity. \n \n John Adams was quoted as saying..\n \"This would be the best of all possible worlds, if there were no religion in it.\"\n \n He also wrote in the Treaty of Tripoli Specifically stating that this Country was not Founded as a Christian Nation. Is it simply too much to bear for a christian to think that this nation is not God's nation?... \n Article 11 from the treaty.\n \n \nArt. 11. As the Government of the United States of America is not, in any sense, founded on the Christian religion; as it has in itself no character of enmity against the laws, religion, or tranquillity, of Mussulmen; and, as the said States never entered into any war, or act of hostility against any Mahometan nation, it is declared by the parties, that no pretext arising from religious opinions, shall ever produce an interruption of the harmony existing between the two countries.\n\n \n http://www.stephenjaygould.org/ctrl/treaty_tripoli.html\n That doesn't sound like he is inviting \"God\" to Found a Nation.\n \n In fact this \" Nation\" was stolen. The Early Americans were slave traders, committed Genocide against the Native Americans, and pretty much took what they wanted . How does this add up to a Nation Founded on God?...\n \n Here's a few links to the History.. So let's hear what you have to say to try to re-write history.. \n \n The U.S. NOT founded upon Christianity\n Our Founding Fathers Were NOT Christians", 
   {
    "post_info": {
     "post_title": "The Foundation of America."
    }
   }, 
   null, 
   null, 
   1292177940.0
  ], 
  [
   418944, 
   null, 
   "Bennedict", 
   "i think christians are just worried their religion is going to go under, what with the rise of atheism and everything. so they made it up. i also think (just my opinion) that christians have been indoctrinated into getting as many people as possible to join their religion, and the whole \"America was founded on christianity\" is a ploy to get both non-christians and new immigrants to join their church. it clearly isnt true, as you say. some of the founding fathers were christians, some werent. if anything, they were all collectively secularists.\n \n not that i would know or anything, ive only been to America like twice.", 
   {}, 
   418930, 
   null, 
   1292194320.0
  ], 
  [
   418945, 
   null, 
   "Easyrider", 
   "i think christians are just worried their religion is going to go under, what with the rise of atheism and everything. so they made it up. i also think (just my opinion) that christians have been indoctrinated into getting as many people as possible to join their religion, and the whole \"America was founded on christianity\" is a ploy to get both non-christians and new immigrants to join their church. it clearly isnt true, as you say. some of the founding fathers were christians, some werent. if anything, they were all collectively secularists.\n \n\n \n You radicals do love your half-baked (or completely baked) theories.", 
   {}, 
   418944, 
   null, 
   1292194740.0
  ], 
  [
   418946, 
   null, 
   "Easyrider", 
   " John Adams was quoted as saying..\n \"This would be the best of all possible worlds, if there were no religion in it.\"\n\n \n Here's part of what John Adams said:\n \n The general principles on which the fathers achieved independence were the general principles of Christianity. I will avow that I then believed, and now believe, that those general principles of Christianity are as eternal and immutable as the existence and attributes of God.1 \n \n The Holy Ghost carries on the whole Christian system in this earth. Not a baptism, not a marriage, not a sacrament can be administered but by the Holy Ghost. . . . There is no authority, civil or religious &#8211; there can be no legitimate government but what is administered by this Holy Ghost. There can be no salvation without it. All without it is rebellion and perdition, or in more orthodox words damnation.2 \n \n Without religion, this world would be something not fit to be mentioned in polite company: I mean hell.3 \n \n The Christian religion is, above all the religions that ever prevailed or existed in ancient or modern times, the religion of wisdom, virtue, equity and humanity.4 \n \n Suppose a nation in some distant region should take the Bible for their only law book and every member should regulate his conduct by the precepts there exhibited. . . . What a Eutopia &#8211; what a Paradise would this region be!5 \n \n I have examined all religions, and the result is that the Bible is the best book in the world.6 \n \n http://www.wallbuilders.com/LIBissuesArticles.asp?id=8755\n \n \n\n He also wrote in the Treaty of Tripoli Specifically stating that this Country was not Founded as a Christian Nation. \n\n \n Still another foible where you go down in flames:\n \n Article 11 (which is disputed, by the way) merely says that the government of America is not founded on the Christian religion, as in a theocracy. This does not mean that the majority of Americans were not of the Christian faith, and it certainly doesn't address the numerous Judeo-Christian principles upon which our country was founded. In those respects, it falls short in describing America.\n \n You're busted.", 
   {}, 
   418930, 
   null, 
   1292195520.0
  ], 
  [
   418949, 
   null, 
   "Xcaliber", 
   "As expected you completely deny HISTORY.. you christians have been trying to re-write American History for 200 years but it hasn't worked on all of us. It's a known fact that most of the Founding Fathers were Deists, Not Christians. In the time during the Revolution perhaps 10 % of the Population were Christians, that is not a Majority by any means. So Once again you post feeble attempts to substantiate your claim that America Was Founded on Christianity.\n \n Also the Words God, Jesus, and Holy Spirit do NOT appear anywhere in our constitution. The Word religion is only used a couple of times in the context of NOT establishing any Law to recognize a Religion. You may WISH it were true but the facts are facts.. this Country was NOT founded on religion and in fact our Founders made attempts to keep religion out of our Government, attempts that you Conservatives have been trying for years to get around.", 
   {}, 
   418946, 
   null, 
   1292203500.0
  ], 
  [
   418954, 
   null, 
   "Penfold", 
   "Before that, the \"Pilgrim Fathers\" were a minority on the Mayflower, outnumbered by economic migrants.", 
   {}, 
   418949, 
   null, 
   1292206200.0
  ], 
  [
   418955, 
   null, 
   "Bennedict", 
   "You radicals do love your half-baked (or completely baked) theories.\n\n \n do you have a response to my post?", 
   {}, 
   418945, 
   null, 
   1292206380.0
  ], 
  [
   418956, 
   null, 
   "gansao", 
   "Before that, the \"Pilgrim Fathers\" were a minority on the Mayflower, outnumbered by economic migrants.\n\n \n That is very interesting. Is there any evidence to support that ?", 
   {}, 
   418954, 
   null, 
   1292207460.0
  ], 
  [
   418957, 
   null, 
   "Xcaliber", 
   "The Early Settlers came to this land to escape religious persecution in Europe, The same persecution that Christians imposed on Muslims, Mormons, and any other religion that they felt unworthy. The Nation was formed and founded on the Premise of the Freedom to Practice whatever religion a person chose to believe, But it was specifically NOT founded as a Christian Nation. The Founders were for the most part Deists, and believed in God, they just didn't believe that God interceded in Human affairs. The fact that they never mentioned God or any supernatural Deity in the Constitution is enough to support the fact that America is was never intended to be a safe haven for only Christians.", 
   {}, 
   418956, 
   null, 
   1292208240.0
  ], 
  [
   418962, 
   null, 
   "NATO 556", 
   "You claim there's proof that the Founding Fathers were deists, as in people who believe that God abandoned them. You claim that there's proof, but I see no such proof being presented here to support this claim. That's like trying to mug somebody but forgetting to bring your weapon.\n \n God is mentioned far too many times to suggest that our Founding Fathers believed that we were abandoned and left to our own devices like a thrown away litter of kittens. God is mentioned on our money and has been for a long time. The Pledge of Allegiance specifically mentions God.\n \n You talk about slave trading and the Indian wars like they're proof that America isn't a Christian nation. Exactly what religion is above and beyond such actions? What religion can't be traced back to examples of horrible atrocities at some point in their history? After all what about the Crusades in the name of Jerusalem?", 
   {}, 
   418957, 
   null, 
   1292214960.0
  ], 
  [
   418964, 
   null, 
   "Stonewall", 
   "You claim there's proof that the Founding Fathers were deists, as in people who believe that God abandoned them. You claim that there's proof, but I see no such proof being presented here to support this claim. That's like trying to mug somebody but forgetting to bring your weapon.\n \n God is mentioned far too many times to suggest that our Founding Fathers believed that we were abandoned and left to our own devices like a thrown away litter of kittens. God is mentioned on our money and has been for a long time. The Pledge of Allegiance specifically mentions God.\n \n You talk about slave trading and the Indian wars like they're proof that America isn't a Christian nation. Exactly what religion is above and beyond such actions? What religion can't be traced back to examples of horrible atrocities at some point in their history? After all what about the Crusades in the name of Jerusalem?\n\n \n There were certainly Christian founding fathers (George Washington always attended church, for example), but there were also plenty of Unitarians and deists. Look at Thomas Jefferson, John Adams, Ben Franklin, and Thomas Paine. A simple look at wikipedia can point you to all the proof you need. These people that I mentioned were some of the most influential of the founding fathers, and all of them rejected a personal god. \n \n Also:\n \n The original Pledge of Allegiance (written in 1892) did not have the words 'under God.' That was added in 1954. \n \n 'In God we Trust' didn't appear on money until the 1860s, and wasn't on all of the coins (the nickel didn't have it) until 1938. \n \n Neither have any relevance to the founding fathers. \n \n I'm sorry I can't post links, but I don't have enough posts.", 
   {}, 
   418962, 
   null, 
   1292217900.0
  ], 
  [
   418965, 
   null, 
   "Xcaliber", 
   "You claim there's proof that the Founding Fathers were deists, as in people who believe that God abandoned them. You claim that there's proof, but I see no such proof being presented here to support this claim. That's like trying to mug somebody but forgetting to bring your weapon.\n\n \n Yeah I haven't posted any \"Proof\" mostly because the Religious right won't believe truth anyway.. but here you go . Most of this comes from the Encyclopedia, it's a matter of American History ..\n \n One of the most common statements from the \"Religious Right\" is that they want this country to \"return to the Christian principles on which it was founded\". However, a little research into American history will show that this statement is a lie. The men responsible for building the foundation of the United States had little use for Christianity, and many were strongly opposed to it. They were men of The Enlightenment, not men of Christianity. They were Deists who did not believe the bible was true.\n Read the rest here...\n \n Our Founding Fathers Were NOT Christians\n \n \n\n God is mentioned far too many times to suggest that our Founding Fathers believed that we were abandoned and left to our own devices like a thrown away litter of kittens. God is mentioned on our money and has been for a long time. The Pledge of Allegiance specifically mentions God.\n\n \n Uh no.. God is not mentioned one single time in the Constitution. The Declaration of Independence did not establish any Law or Government Policy for the Nation, it was merely a Declaration sent to The King of England to let him know we were declaring Independence. It has nothing to do with establishing the Basis for which this country was founded. \n \n And \" In God We Trust \" was added During the Civil War After The Religious Right had established themselves within our Government. This has nothing to do with the actual intentions of our Founding Fathers\" \n The Motto wasn't adopted by Law until 1956.. So once again nothing to do with Founders. The Founding Fathers Intentions were to Keep Religion Out of Government. \n \n https://ustreas.gov/education/fact-sheets/currency/in-god-we-trust.shtml\n \n \n \n\n You talk about slave trading and the Indian wars like they're proof that America isn't a Christian nation. Exactly what religion is above and beyond such actions? What religion can't be traced back to examples of horrible atrocities at some point in their history? After all what about the Crusades in the name of Jerusalem?\n\n \n Exactly the reason that ALL ORGANIZED religion is an abomination to human societies. Christians are perhaps the Worst In my Opinion, being that they tend to pick and choose what parts of their religion to follow . \n \n I hate to burst anyone's bubble but George Washington was NOT a christian, He Like Most of our Founders Conformed to Deist beliefs and were known as Free Masons.\n \n \n Historian Barry Schwartz writes: \"George Washington's practice of Christianity was limited and superficial because he was not himself a Christian... He repeatedly declined the church's sacraments. Never did he take communion, and when his wife, Martha, did, he waited for her outside the sanctuary... Even on his deathbed, Washington asked for no ritual, uttered no prayer to Christ, and expressed no wish to be attended by His representative.\" [New York Press, 1987, pp. 174-175]\n\n \n Our Founding Fathers Were NOT Christians\n \n Believe what you like but History is History and cannot be changed. I don't expect you or any religious person to believe anything, you probably won't even bother to read the information anyway because per usual Christians won't believe anything that shows their religion for the abomination that it is even if it's the truth.", 
   {}, 
   418962, 
   null, 
   1292220360.0
  ], 
  [
   418967, 
   null, 
   "Stonewall", 
   "Washington's religion has long been debated, but it is known (according to his journals) that he attended Christian church services (around 15 times a year). It seems from further reading that there are conflicting accounts on things like communion, but he was pretty quiet about his religion in general. \n \n I'm sure it would mean a lot to a Christian to be able to claim him as one of their own, but in my opinion any definite statements about him being a devout Christian (or even a Deist) are really hard to prove. Either way, it doesn't change the fact that this country wasn't founded on the principles of Christianity or any other religion. It was founded with the intentions of being secular, which was made very clear by Thomas Jefferson and others.", 
   {}, 
   418965, 
   null, 
   1292223720.0
  ], 
  [
   418968, 
   null, 
   "Stonewall", 
   "Believe what you like but History is History and cannot be changed.\n\n \n Tell that to the Texas School Board...", 
   {}, 
   418965, 
   null, 
   1292223780.0
  ], 
  [
   418970, 
   null, 
   "MrWriteLA", 
   "\"The United States of America have exhibited, perhaps, the first example of governments erected on the simple principles of nature; and if men are now sufficiently enlightened to disabuse themselves of artifice, imposture, hypocrisy, and superstition, they will consider this event as an era in their history. Although the detail of the formation of the American governments is at present little known or regarded either in Europe or in America, it may hereafter become an object of curiosity. It will never be pretended that any persons employed in that service had interviews with the gods, or were in any degree under the influence of Heaven, more than those at work upon ships or houses, or laboring in merchandise or agriculture; it will forever be acknowledged that these governments were contrived merely by the use of reason and the senses.\n \n \". . . Thirteen governments [of the original states] thus founded on the natural authority of the people alone, without a pretence of miracle or mystery, and which are destined to spread over the northern part of that whole quarter of the globe, are a great point gained in favor of the rights of mankind.\" \n -- John Adams, A Defence of the Constitutions of Government of the United States of America (1787-1788)", 
   {}, 
   418968, 
   null, 
   1292227740.0
  ], 
  [
   418971, 
   null, 
   "MrWriteLA", 
   "\". . . Some books against Deism fell into my hands. . . It happened that they wrought an effect on me quite contrary to what was intended by them; for the arguments of the Deists, which were quoted to be refuted, appeared to me much stronger than the refutations; in short, I soon became a thorough Deist.\" \n --Benjamin Franklin, Autobiography\n \"It is much to be lamented that a man of Franklin's general good character and great influence should have been an unbeliever in Christianity, and also have done as much as he did to make others unbelievers\"\n -- Dr. Priestley (an intimate friend of Franklin's), Autobiography", 
   {}, 
   418970, 
   null, 
   1292228220.0
  ], 
  [
   418980, 
   null, 
   "Penfold", 
   "Not work safe.\n \n Mr Proops provides an excellent summary...\n \n YouTube - America is England's fault.", 
   {}, 
   418971, 
   null, 
   1292255640.0
  ], 
  [
   418981, 
   null, 
   "Xcaliber", 
   "Tell that to the Texas School Board...\n\n \n Yeah I didn't forget about them either, they've been feeding lies to the schools for years.", 
   {}, 
   418968, 
   null, 
   1292255640.0
  ], 
  [
   418983, 
   null, 
   "Xcaliber", 
   "Not work safe.\n \n Mr Proops provides an excellent summary...\n \n YouTube - America is England's fault.\n\n \n lmao.. that was hilarious, .. thanks for posting that , it made my day ...emoticon_xagree", 
   {}, 
   418980, 
   null, 
   1292256000.0
  ], 
  [
   418990, 
   null, 
   "MrWriteLA", 
   "An excellent, well-reasoned 3-part series:\n \n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (1 of 3)\n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (2 of 3)\n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (3 of 3)", 
   {}, 
   418983, 
   null, 
   1292262540.0
  ], 
  [
   418998, 
   null, 
   "Xcaliber", 
   "An excellent, well-reasoned 3-part series:\n \n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (1 of 3)\n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (2 of 3)\n YouTube - Discovering Religion: Ep 19 - If America Became a Christian Nation (3 of 3)\n\n \n Brilliant.. Great post. I particularly Loved this quote from part 3..\n \n \" Extremism is pure , uncut Religion that has not been diluted with the progressive views of secular logic and reason\"...\n \n Here's a few more episodes from the series, episode 17 speaks specifically to this topic..\n \n YouTube - Discovering Religion: Ep 17 - One Nation ABOVE God\n YouTube - Discovering Religion: Ep 18 - God's Law vs. Christ's Grace\n \n Thanks for your post, Great find.", 
   {}, 
   418990, 
   null, 
   1292267820.0
  ], 
  [
   419018, 
   null, 
   "Easyrider", 
   "\". . . Some books against Deism fell into my hands. . . It happened that they wrought an effect on me quite contrary to what was intended by them; for the arguments of the Deists, which were quoted to be refuted, appeared to me much stronger than the refutations; in short, I soon became a thorough Deist.\" \n --Benjamin Franklin, Autobiography\n\n \n A true deist at that time was one who believed God created the universe and then sat back and (1) did not involve himself in the affairs of men and nations and, (2) did not give (divine) revelation to man. Franklin did not fit this mold. For instance, Franklin said the following during the Constitutional Convention: \n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth &#8212;That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, &#8212;and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n \n It&#8217;s pretty obvious that Franklin believed in a God who did involve himself in the affairs of men and nations, and Franklin also alludes to the New Testament as &#8220;Sacred Writings&#8221; which also reveal God&#8217;s revelation to man. \n \n You're busted.\n \n p.s. And he wasn't a homosexual either. emoticon_xbouncer", 
   {}, 
   418971, 
   null, 
   1292289240.0
  ], 
  [
   419021, 
   null, 
   "Xcaliber", 
   "A true deist at that time was one who believed God created the universe and then sat back and (1) did not involve himself in the affairs of men and nations and, (2) did not give (divine) revelation to man. Franklin did not fit this mold. For instance, Franklin said the following during the Constitutional Convention: \n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth -That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, -and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n \n It's pretty obvious that Franklin believed in a God who did involve himself in the affairs of men and nations, and Franklin also alludes to the New Testament as \"Sacred Writings\" which also reveal God's revelation to man. \n \n You're busted.\n \n p.s. And he wasn't a homosexual either. emoticon_xbouncer\n\n \n Nice try but once again you fail.. Franklin despised Christianity just like the other Deist Founders ...\n \n Six Historic Americans: Benjamin Franklin\n \n\"My parents had given me betimes religions impressions, and I received from my infancy a pious education in the principles of Calvinism. But scarcely was I arrived at fifteen years of age, when, after having doubted in turn of different tenets, according as I found them combated in the different books that I read, I began to doubt of Revelation itself\" (Autobiography, p. 66).\n\n \n And once again it is YOU who bring Homosexuality into a topic, why the obsession ?.. are you hiding something and bringing up the subject at every chance as a way to come out of the closet yourself?....", 
   {
    "unicode_changes_made": true
   }, 
   419018, 
   null, 
   1292291580.0
  ], 
  [
   419041, 
   null, 
   "MrWriteLA", 
   "Trying to prove that the Founding Fathers meant to establish America as some sort of fundamentalist Christian theocracy because they said they believed in God (usually referred to as \"the God of Nature\") and often mentioned the benevolence of the historical personage named Jesus, who they nevertheless stated was NOT the Son of God, NOT born of a virgin, and NOT risen from the dead (all of which are considered central to being a \"true\" Christian) and who trashed organized religion far more often than they praised it--as can be seen from their own words--is historical revisionism at its most desperate.", 
   {}, 
   419021, 
   null, 
   1292308620.0
  ], 
  [
   419062, 
   null, 
   "pappillion001", 
   "A true deist at that time was one who believed God created the universe and then sat back and (1) did not involve himself in the affairs of men and nations and, (2) did not give (divine) revelation to man. Franklin did not fit this mold. For instance, Franklin said the following during the Constitutional Convention: \n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth -That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, -and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n \n It's pretty obvious that Franklin believed in a God who did involve himself in the affairs of men and nations, and Franklin also alludes to the New Testament as \"Sacred Writings\" which also reveal God's revelation to man. \n \n You're busted.\n \n p.s. And he wasn't a homosexual either. emoticon_xbouncer\n\n \n Let's see the people have respresentation and a say in government. The states have representation and a say in government. Law is represented and has a say in government. Religion is in charge of sex and music.\n \n \n That means when we want its fuxxing opinion we will whistle. \n \n Other than that I only see the founding fathers despite having every oportunity in the world to include religion in the PROCESS of governing did the exact opposite. The specifically told it that there was no place for it to activly participate in running the country. None, zip, zero, not so much as a single voice in anything other than ceremony, in other words fluff.", 
   {
    "unicode_changes_made": true
   }, 
   419018, 
   null, 
   1292383560.0
  ], 
  [
   419130, 
   null, 
   "Matthew", 
   "Trying to prove that the Founding Fathers meant to establish America as some sort of fundamentalist Christian theocracy because they said they believed in God (usually referred to as \"the God of Nature\") and often mentioned the benevolence of the historical personage named Jesus, who they nevertheless stated was NOT the Son of God, NOT born of a virgin, and NOT risen from the dead (all of which are considered central to being a \"true\" Christian) and who trashed organized religion far more often than they praised it--as can be seen from their own words--is historical revisionism at its most desperate.\n\n \n Well, that's really the issue, isn't it? Saying that one believes in a deity or admires the moral teachings of Jesus is not the same as being a Christian. Such belief and admiration is quite compatible with rejecting organized Christianity in particular and organized religion in general, at both the personal and political levels. And many of the Founding Fathers, including the more famous among them like Franklin and Jefferson and Washington, clearly rejected organized religion in this way. It is either wilful ignorance or flagrant dishonesty to claim otherwise.", 
   {}, 
   419041, 
   null, 
   1292420340.0
  ], 
  [
   419132, 
   null, 
   "Easyrider", 
   "Trying to prove that the Founding Fathers meant to establish America as some sort of fundamentalist Christian theocracy because they said they believed in God (usually referred to as \"the God of Nature\") and often mentioned the benevolence of the historical personage named Jesus, who they nevertheless stated was NOT the Son of God, NOT born of a virgin, and NOT risen from the dead (all of which are considered central to being a \"true\" Christian) and who trashed organized religion far more often than they praised it--as can be seen from their own words--is historical revisionism at its most desperate.\n\n \n That's a load of rubbish. No one is saying they meant to establish a theocracy. But they didn't want to evict God and Christ from the government and public squares either. So your self-serving Strawman argument goes down the commode.\n \n And they certainly didn't want the depraved element of society glorified to spin their web of unholy decadence throughout government and society. As the Word of God says in Romans 1:\n \n 26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error. \n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. 29 They have become filled with every kind of wickedness, evil, greed and depravity. They are full of envy, murder, strife, deceit and malice. They are gossips, 30 slanderers, God-haters, insolent, arrogant and boastful; they invent ways of doing evil; they disobey their parents; 31 they have no understanding, no fidelity, no love, no mercy. 32 Although they know God's righteous decree that those who do such things deserve death, they not only continue to do these very things but also approve of those who practice them. \n \n So it's no wonder you try to revise history and seek to trash the Bible. It's the only way you can advance your unholy and illicit gay sex agenda. Well, it's not working, preppie. The Word of God trumps your elitist tripe.", 
   {
    "unicode_changes_made": true
   }, 
   419041, 
   null, 
   1292423280.0
  ], 
  [
   419133, 
   null, 
   "Easyrider", 
   "\n \n Other than that I only see the founding fathers despite having every oportunity in the world to include religion in the PROCESS of governing did the exact opposite. The specifically told it that there was no place for it to activly participate in running the country. None, zip, zero, not so much as a single voice in anything other than ceremony, in other words fluff.\n\n \n <Flush<\n \n You still don't get it. The vast majority of those founding fathers who governed were Christians and men of God - men who attended Christian services in government buildings. \n \n Christians and men of God ran the country, Jack, much to the chagrin of your spiritually stunted atheists and deists.", 
   {}, 
   419062, 
   null, 
   1292423820.0
  ], 
  [
   419217, 
   null, 
   "jazyjason", 
   "<Flush<\n \n You still don't get it. The vast majority of those founding fathers who governed were Christians and men of God - men who attended Christian services in government buildings. \n \n Christians and men of God ran the country, Jack, much to the chagrin of your spiritually stunted atheists and deists.\n\n \n You know I bet the pilgrims would have run away from your crazy XXX....", 
   {}, 
   419133, 
   null, 
   1292480280.0
  ], 
  [
   419220, 
   null, 
   "Xcaliber", 
   "That's a load of rubbish. No one is saying they meant to establish a theocracy. But they didn't want to evict God and Christ from the government and public squares either. So your self-serving Strawman argument goes down the commode.\n\n \n They INTENTIONALLY do not make mention of GOD, JESUS, THE HOLY SPIRIT, Or any other supernatural imaginary being in the Constitution because the FOUNDING FATHERS recognized the danger of organized religion. The point is THIS country was NOT founded as a Christian Nation.\n \n \n\n So it's no wonder you try to revise history and seek to trash the Bible. It's the only way you can advance your unholy and illicit gay sex agenda. Well, it's not working, preppie. The Word of God trumps your elitist tripe.\n\n \n You Bible Thumping Radicals are the ones trying to Revise History . The Texas School Board, you know the ones who Publish most of the countries school books, dropped Thomas Jefferson from their History books because they didn't want Kids to know the truth about him. Who's next, George Washington?... maybe they will remove John Adams as well?.. Or we can hope for the best and they will Remove Jesus and God , now that would make my day.", 
   {}, 
   419132, 
   null, 
   1292482920.0
  ], 
  [
   419241, 
   null, 
   "pappillion001", 
   "<Flush<\n \n You still don't get it. The vast majority of those founding fathers who governed were Christians and men of God - men who attended Christian services in government buildings. \n \n Christians and men of God ran the country, Jack, much to the chagrin of your spiritually stunted atheists and deists.\n\n \n No your not getting it. The founders built the concept of this country on personal liberty. The right to do and believe (within reason) what the individual chooses. They intentionally kept certain potential threats to that liberty powerless and granted favorable protections to others. Religion and the Press as examples. \n \n That all these men grew up and lived in a Christian world did not in the least prevent them from realizing the potential threat religion poses to individual liberty and how volatile it could be to the stability of a new country. \n \n To try and deny people the right to practice their religion as they saw fit is a contradiction then and now to the founding principals of this country, but religion is not to hold any special significance by right or tradition. Because the founders and many politicians chose to bring their beliefs into work and that was accepted at the time in no way changes that religion holds the prominence it does within government at the whim of the people. There should be no argument for all signs of it to be removed if the people so wish it just as if they want it to stay it will. But again it has no right to exist within government and enjoys no protection to be included in any aspect of government. \n \n The views of the population of the late 1700's is very different from today. The views of today are the ones we have to live with and should be given a little bit more consideration than those of the founders.", 
   {}, 
   419133, 
   null, 
   1292521260.0
  ], 
  [
   419253, 
   null, 
   "Easyrider", 
   "\n \n That all these men grew up and lived in a Christian world did not in the least prevent them from realizing the potential threat religion poses to individual liberty and how volatile it could be to the stability of a new country. \n\n \n Listen, pappi, there is a God and he's ruling the world, and America as well. Just because you and yours are too spiritually challenged to recognize it does not make it go away.\n \n Even Benjamin Franklin agreed:\n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth &#8212;That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, &#8212;and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n \n Open your eyes, pappi. Without God at the helm America is finished.\n \n Even Thomas Jefferson understood that:\n \n \"Can the liberties of a nation be thought secure when we have \n removed their only firm basis, a conviction in the minds of the\n people that these liberties are the gift of God? That they are\n not to be violated but with His wrath? Indeed I tremble for my\n country when I reflect that God is just; and that His justice\n cannot sleep forever.\" (Notes on the State of Virginia, 1781)\n \n Now, why should Jefferson tremble for his country if God does not involve himself in the affairs of men and nations?\n \n Wise up.", 
   {}, 
   419241, 
   null, 
   1292549580.0
  ], 
  [
   419259, 
   null, 
   "Xcaliber", 
   "\n \n Even Benjamin Franklin agreed:\n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth -That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, -and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n Wise up.\n\n \n You have quoted this before, what , is this the only thing you can come up with? \n \n Care to try something new?.. Oh wait you can't because you know the truth you just won't admit it.", 
   {
    "unicode_changes_made": true
   }, 
   419253, 
   null, 
   1292552220.0
  ], 
  [
   419262, 
   null, 
   "Bottom Feeder", 
   "\n Open your eyes, pappi. Without God at the helm America is finished.\n \n \n\n \n Actually, you should have said United States. We are not America. In the sense that we are part of America, yes. America itself, no. We are to America as Canada and Mexico are to America. A country within a continent which is called North America. This is why we are the United States of America. Thank you and have a good day.", 
   {}, 
   419253, 
   null, 
   1292555460.0
  ], 
  [
   419273, 
   null, 
   "jyoshu", 
   "Actually, you should have said United States. We are not America. In the sense that we are part of America, yes. America itself, no. We are to America as Canada and Mexico are to America. A country within a continent which is called North America. This is why we are the United States of America. Thank you and have a good day.\n\n \n Seriously now, I think you are being a but over-sensitive there. People often say \"America\" BECAUSE it's a short way of saying \"United States of America\". It's like saying \"Britain\" rather than \"Great Britain.\" It is really necessary to say \"Great\" every time one says \"Britain\"? No. Everyone knows what it refers to.", 
   {}, 
   419262, 
   null, 
   1292562960.0
  ], 
  [
   419278, 
   null, 
   "Bottom Feeder", 
   "Seriously now, I think you are being a but over-sensitive there. People often say \"America\" BECAUSE it's a short way of saying \"United States of America\". It's like saying \"Britain\" rather than \"Great Britain.\" It is really necessary to say \"Great\" every time one says \"Britain\"? No. Everyone knows what it refers to.\n\n \n I know why they do it, thank you. The point is that it is incorrect.", 
   {}, 
   419273, 
   null, 
   1292568600.0
  ], 
  [
   419283, 
   null, 
   "pappillion001", 
   "Listen, pappi, there is a God and he's ruling the world, and America as well. Just because you and yours are too spiritually challenged to recognize it does not make it go away.\n\n \n If he was ruling the world we would all be Christian, but we aren't. Which means either he is not ruling the world or isn't an effective ruler. Which would you prefer or which do you think more probable. Simply saying yes he does is wishful thinking there is no reason to think there is any truth to it based on Christian positions on God's desires.\n \n It's not that I am spiritually challenged, coming to the conclusions I have wasn't challenging at all. Do you think perhaps God, in his plan for man, made provisions to grow intellectually? That perhaps part of his grand plan includes greater understanding than possessed by the writers of the Bible. You are so quick to say Christianity is the natural progression and evolution of Judaism, but can't imagine that it doesn't stop there. \n \n If it did then why is a second appearance necessary? Does that not imply that the time was not yet, that there was more that was needed?\n \n \n \nEven Benjamin Franklin agreed:\n \n \"I've lived, Sir, a long time, and the longer I live, the more convincing Proofs I see of this Truth -That God governs in the Affairs of Men. And if a sparrow cannot fall to the ground without his Notice, is it probable that an Empire can rise without his Aid? We have been assured, Sir, in the Sacred Writings, that except the Lord build the House they labor in vain who build it. I firmly believe this, -and I also believe that without his concurring Aid, we shall succeed in this political Building no better than the Builders of Babel: We shall be divided by our little partial local interests; our Projects will be confounded, and we ourselves shall become a Reproach and Bye word down to future Ages.\" - Speech to the Constitutional Convention (June 28, 1787)\n\n \n \n When will you understand the arguement? In 1787 the Western world was indeed a very Christian world. Very few people were not some type of Christian. Many were also semi literate at best, subject to superstition and wild tales, snake oil salesmen were being born and prepared to make a name for themselves. To keep things in perspective here are some significant discoveries and when they occurred\n \n * 1751 - Benjamin Franklin: Lightning is electrical\n * 1778 - Antoine Lavoisier (and Joseph Priestley): discovery of oxygen leading to end of Phlogiston theory\n * 1781 - William Herschel announces discovery of Uranus, expanding the known boundaries of the solar system for the first time in modern history\n * 1785 - William Withering: publishes the first definitive account of the use of foxglove (digitalis) for treating dropsy\n * 1787 - Jacques Charles: Charles' law of ideal gas\n * 1789 - Antoine Lavoisier: law of conservation of mass, basis for chemistry, and the beginning of modern chemistry\n * 1796 - Georges Cuvier: Establishes extinction as a fact\n * 1799 - William Smith: Publishes geologic map of England, first geologic map ever, first application of stratigraphy\n \n [edit] 19th century\n \n * 1802 - Jean-Baptiste Lamarck: teleological evolution\n * 1805 - John Dalton: Atomic Theory in (Chemistry)\n * 1824 - Carnot: described the Carnot cycle, the idealized heat engine\n * 1827 - Georg Ohm: Ohm's law (Electricity)\n * 1827 - Amedeo Avogadro: Avogadro's law (Gas laws)\n * 1828 - Friedrich Wöhler synthesized urea, destroying vitalism\n * 1833 - Anselme Payen isolates first enzyme, diastase\n * 1838 - Matthias Schleiden: all plants are made of cells\n * 1843 - James Prescott Joule: Law of Conservation of energy (First law of thermodynamics), also 1847 - Helmholtz, Conservation of energy\n * 1846 - William Morton: discovery of anesthesia\n * 1848 - Lord Kelvin: absolute zero of temperature\n * 1858 - Rudolf Virchow: cells can only arise from pre-existing cells\n * 1859 - Charles Darwin and Alfred Wallace: Theory of evolution by natural selection\n * 1865 - Gregor Mendel: Mendel's laws of inheritance, basis for genetics\n * 1869 - Dmitri Mendeleev: Periodic table\n * 1873 - James Clerk Maxwell: Theory of electromagnetism\n * 1875 - William Crookes invented the Crookes tube and studied cathode rays\n * 1876 - Josiah Willard Gibbs founded chemical thermodynamics, the phase rule\n * 1877 - Ludwig Boltzmann: Statistical definition of entropy\n * 1887 - Albert Michelson and Edward Morley: lack of evidence for the aether\n * 1895 - Wilhelm Conrad Röntgen discovers x-rays\n * 1896 - Henri Becquerel discovers radioactivity\n * 1897 - J.J. Thomson discovers the electron in cathode rays\n * 1900 - Max Planck: Planck's law of black body radiation, basis for quantum theory\n \n [edit] 20th century\n \n * 1905 - Albert Einstein: theory of special relativity, explanation of Brownian motion, and photoelectric effect\n * 1906 - Walther Nernst: Third law of thermodynamics\n * 1909 - Fritz Haber: Haber Process\n * 1912 - Alfred Wegener: Continental drift\n * 1912 - Max von Laue : x-ray diffraction\n * 1913 - Henry Moseley: defined atomic number\n * 1913 - Niels Bohr: Model of the atom\n * 1915 - Albert Einstein: theory of general relativity - also David Hilbert\n * 1915 - Karl Schwarzschild: discovery of the Schwarzschild radius leading to the identification of black holes\n * 1918 - Emmy Noether: Noether's theorem - conditions under which the conservation laws are valid\n * 1924 - Wolfgang Pauli: quantum Pauli exclusion principle\n * 1925 - Erwin Schrödinger: Schrödinger equation (Quantum mechanics)\n * 1927 - Werner Heisenberg: Uncertainty principle (Quantum mechanics)\n * 1927 - Georges Lemaître: Theory of the Big Bang\n * 1928 - Paul Dirac: Dirac equation (Quantum mechanics)\n * 1929 - Edwin Hubble: Hubble's law of the expanding universe\n * 1929 - Lars Onsager's reciprocal relations, a potential fourth law of thermodynamics\n * 1934 - Clive McCay: Calorie Restriction extends the maximum lifespan of another species Calorie_restriction#Research_history\n * 1943 - Oswald Avery proves that DNA is the genetic material of the chromosome\n * 1947 - William Shockley, John Bardeen and Walter Brattain invent the first transistor\n * 1948 - Claude Elwood Shannon: 'A mathematical theory of communication' a seminal paper in Information theory.\n * 1948 - Richard Feynman, Julian Schwinger, Sin-Itiro Tomonaga and Freeman Dyson: Quantum electrodynamics\n * 1951 - George Otto Gey propagates first cancer cell line, HeLa\n * 1953 - Crick and Watson: helical structure of DNA, basis for molecular biology\n * 1964 - Murray Gell-Mann and George Zweig: postulate quarks leading to the standard model\n * 1964 - Arno Penzias and Robert Woodrow Wilson: detection of CMBR providing experimental evidence for the Big Bang\n * 1965 - Leonard Hayflick: normal cells divide only a certain number of times: the Hayflick limit\n * 1967 - Jocelyn Bell Burnell and Antony Hewish discover first pulsar\n * 1984 - Kary Mullis invents the polymerase chain reaction, a key discovery in molecular biology\n * 1995 - Michel Mayor and Didier Queloz definitively observe the first extrasolar planet around a main sequence star\n * 1997 - Roslin Institute: Dolly the sheep was cloned.\n * 1997 - CDF and DØ experiments at Fermilab: Top quark.\n * 1998 - Gerson Goldhaber and Saul Perlmutter observed that the expansion of the universe is accelerating.\n \n \n \nOpen your eyes, pappi. Without God at the helm America is finished.\n\n \n God is sitting this one out. The sooner we understand we will fly or fall on our own the better chance we have to fly.\n \n \nEven Thomas Jefferson understood that:\n \n \"Can the liberties of a nation be thought secure when we have \n removed their only firm basis, a conviction in the minds of the\n people that these liberties are the gift of God? That they are\n not to be violated but with His wrath? Indeed I tremble for my\n country when I reflect that God is just; and that His justice\n cannot sleep forever.\" (Notes on the State of Virginia, 1781)\n \n Now, why should Jefferson tremble for his country if God does not involve himself in the affairs of men and nations?\n\n \n Again you fail to address the point. I can't express with any more clarity my understanding that people of the period were very religious, your continued insistence to point this out is asinine. Do you doubt they were and so repeat the same meaningless quotes to bolster your own insecurities?\n \n The question you continue to ignore is very simple. As devoutly religious and God fearing as you make them why is religion specifically prohibited from having a voice within the process of government. It is relegated to the personal discretion of the individual and not granted anything more than to exist as a right to enjoyed conditioned that it may not infringe on the liberties of others. It is granted no specific representation, it is guaranteed no specific protection greater than provided for other freedoms, in fact less than some.\n \n \n \nWise up.\n\n \n As people age and become ever more aware of their own mortality they look to find some type of peace with death. The inevitable conclusion to the most basic and strongest instinct man possess the need to survive. From his first gasp of air until his last he is programmed to strive for one more and religion serves to provide some sense to this irony.\n \n I leave you with this insight from your hero of religion. Many who have professed less have earned damnation in your eyes. Will you continue to hold him up as the paragon of Christian principals after you learn his last thoughts?\n Do not doubt he was a very religious man, but his view of religion is very far away from yours.\n \n \n \"Proposed New Version of the Bible\" 1779?, 935: modernize the Bible's language. Franklin puts up a tolerable sample, though agrees (as do I) that someone better than he is required.\n \n \n Letter to Ezra Stiles 1790, p. 1178: Franklin coming clean on his religious beliefs. One God, who governs the world \"by his Providence.\" Etc. etc., see my paper. Immortality of the soul. Doubts his own theologizing, but also doubts the divinity of Jesus, though he grants the goodness of the moral teaching. But believing in Jesus' divinity is good at least as it makes \"his Doctrines more respected and better observed.\" God gives good things to the believers and unbelievers alike. Wholehearted religious toleration.", 
   {
    "unicode_changes_made": true
   }, 
   419253, 
   null, 
   1292576880.0
  ], 
  [
   419290, 
   null, 
   "Easyrider", 
   "Tell it to your pet squid.\n \n The fact is the Lord is ruling from Heaven. God has been holding nations to account since the get-go. Even America, which is heavily in debt and paying the price for her liberal follies. Were it not for God's grace in giving America time to repent you would be in Hell this very moment. What's more, God will hold everyone accountable for their sins at the Judgment. Those without Christ will drop down into the Pit. That would be you, pappi, and the rest of the spiritually uncircumcised heathens who think like you. \n \n For those in Christ, they will be in heaven where there will be no more tears and no more sorrows. Just joy and peace and love and eternal life.\n \n Then your pathetic claim that God is doing a lousy job will be shown up for the worthless piece of garbage it is.\n \n And you won't have to like it.", 
   {}, 
   419283, 
   null, 
   1292586420.0
  ], 
  [
   419295, 
   null, 
   "Xcaliber", 
   "\n Then your pathetic claim that God is doing a lousy job will be shown up for the worthless piece of garbage it is.\n\n \n Poverty, Homelessness, rape, murder, Genocide,Slavery, War, Hunger, just to name a few and all can be laid directly at the feet of your all knowing , all powerful, loving and just \" GOD\"... As far as job performance I would Give George W. a better rating and we all know how bad he did . Granted Bush only had one Nation to screw up But your \" GOD\" is all Powerful so he should be able to handle a bigger work load right...lol", 
   {}, 
   419290, 
   null, 
   1292596740.0
  ], 
  [
   419329, 
   null, 
   "Stonewall", 
   "For those in Christ, they will be in heaven where there will be no more tears and no more sorrows. Just joy and peace and love and eternal life.\n\n \n So will they have free will?", 
   {}, 
   419290, 
   null, 
   1292625960.0
  ], 
  [
   419339, 
   null, 
   "pappillion001", 
   "Tell it to your pet squid.\n \n The fact is the Lord is ruling from Heaven. God has been holding nations to account since the get-go. Even America, which is heavily in debt and paying the price for her liberal follies. Were it not for God's grace in giving America time to repent you would be in Hell this very moment. What's more, God will hold everyone accountable for their sins at the Judgment. Those without Christ will drop down into the Pit. That would be you, pappi, and the rest of the spiritually uncircumcised heathens who think like you. \n \n For those in Christ, they will be in heaven where there will be no more tears and no more sorrows. Just joy and peace and love and eternal life.\n \n Then your pathetic claim that God is doing a lousy job will be shown up for the worthless piece of garbage it is.\n \n And you won't have to like it.\n\n \n Eternal life as what? What will you spend your time doing? If Jesus was nice he would have finished what he started. How many people who otherwise would not have gone to the pit now will? How many people who will go to heaven have to wait? All those years of suffering could have been avoided.\n \n What in your opinion do you think he is waiting for?", 
   {}, 
   419290, 
   null, 
   1292635200.0
  ], 
  [
   419384, 
   null, 
   "Easyrider", 
   "Eternal life as what? What will you spend your time doing? If Jesus was nice he would have finished what he started.\n\n \n He'll finish it right on schedule. Why do you think he's giving people time to repent? Lots of people turn to God and his salvation in times of adversity.\n \n \nAll those years of suffering could have been avoided.\n \n What in your opinion do you think he is waiting for?\n\n \n Have you never read of \"The Times of the Gentiles\"?\n \n Times Of The Gentiles And Fullness Of The Gentiles | GraceThruFaith\n \n There's other links to 'Times of the Gentiles' also.", 
   {}, 
   419339, 
   null, 
   1292700480.0
  ], 
  [
   419387, 
   null, 
   "Bennedict", 
   "i think heaven would be boring. no science, no pre-marital sex, no macking on chicks, no heavy metal music, just a bunch of poncy, stuck up, closed-legged arses that i wouldnt want to hang around with anyways. heaven just compiles all of the people i hate already into one big area.\n \n at least in hell, i can check out all the new Queen and John Lennon songs. Kurt Cobain will be there too, but no one pays attention to him. and i get to have interesting conversations with the likes of Stephen Jay Gould and Carl Sagan.", 
   {}, 
   419384, 
   null, 
   1292702580.0
  ], 
  [
   419391, 
   null, 
   "Xcaliber", 
   " Lots of people turn to God and his salvation in times of adversity.\n\n \n yeah and those same people could pray to a Milk Carton and get the exact same results. Your point is?...", 
   {}, 
   419384, 
   null, 
   1292710440.0
  ], 
  [
   419483, 
   null, 
   "pappillion001", 
   "He'll finish it right on schedule. Why do you think he's giving people time to repent? Lots of people turn to God and his salvation in times of adversity.\n\n \n Hold on there cowboy, I thought you said God wants to reconcile and save everybody from damnation. Since he can do anything that means the only thing preventing him from doing so for the last 2000 years is the lack of any desire to do so. \n \n If he was on the job nobody would have adversity. If he was on the job nobody would need to repent. If he was on the job nobody would need him for anything ummm I wonder...... nahhh couldn't be.\n \n Where does the soul come from EZ? That concept barrowed from the Egyptians, the thing that we are that God made but since has only made one other. Man has made a whole lot more, he makes them in his image, male and female and he does have knowledge of good and evil. Seems maybe Satan didn't lie after all. \n \n \n \nHave you never read of \"The Times of the Gentiles\"?\n \n Times Of The Gentiles And Fullness Of The Gentiles | GraceThruFaith\n \n There's other links to 'Times of the Gentiles' also.\n\n \n Why is it you believe we are supposed to go to Heaven? I mean it wasn't God's intention to begin with. Man was made from the Earth which cannot enter Heaven. He was made on the Earth with the intention of staying here and doing the gardening, keeping the place tip top and since we were supposed to live forever (just as death entered the world through one man) it seems highly unlikely that there was ever going to be a time that man was supposed to go to Heaven. So why the change of heart?", 
   {}, 
   419384, 
   null, 
   1292844960.0
  ], 
  [
   419549, 
   null, 
   "MrWriteLA", 
   "Texas Textbook MASSACRE: 'Ultraconservatives' Approve Radical Changes To State Education Curriculum\nBoard member Cynthia Dunbar wants to change a standard having students study the impact of Enlightenment ideas on political revolutions from 1750 to the present. She wants to drop the reference to Enlightenment ideas (replacing with \"the writings of\") and to Thomas Jefferson. She adds Thomas Aquinas and others.\nI'm confused. I thought Jefferson--certainly one of the top three Founders--was \"no Deist\" and intended this to be a Christian nation... at least according to EZ. Why would an ultra-conservative school board want to remove him from their textbooks?", 
   {
    "unicode_changes_made": true
   }, 
   418930, 
   null, 
   1292955660.0
  ], 
  [
   419562, 
   null, 
   "Xcaliber", 
   "Texas Textbook MASSACRE: 'Ultraconservatives' Approve Radical Changes To State Education CurriculumI'm confused. I thought Jefferson--certainly one of the top three Founders--was \"no Deist\" and intended this to be a Christian nation... at least according to EZ. Why would an ultra-conservative school board want to remove him from their textbooks?\n\n \n I think they are doing it thinking that eventually the U.S. will be a generation of people who have never been taught the truth. They've been re-writing history in an attempt to replace History with God and removing Jefferson is just the first step. Once they realize that Washington, Adams, and many of the other founders were Deists/Free Masons they will be removed as well.", 
   {}, 
   419549, 
   null, 
   1292963640.0
  ], 
  [
   419578, 
   null, 
   "MrWriteLA", 
   "Well, first they'll have to admit--as they've done with Jefferson--that they WERE Deists... or at the very least, highly ambivalent about Christianity... and not the pro-theocracy Christian fundamentalists David Barton, EZ, and their ilk keep insisting they were. \n \n Kinda hard to insist the Founders were pro-Christian and anti-Christian at the same time. \n \n But at least this (frightening, IMO) Texas School Board vote pretty much settles the Jefferson issue once and for all. I doubt very much that these \"ultra-conservatives\" believe he intended the US to be a Christian nation.\n \n (But maybe they're not \"true\" Christians. ;))", 
   {}, 
   419562, 
   null, 
   1292971080.0
  ], 
  [
   419605, 
   null, 
   "Stonewall", 
   "What they've done in Texas is sickening. Non-historians with a political axe to grind shouldn't be in charge of History textbooks.", 
   {}, 
   419578, 
   null, 
   1292992920.0
  ], 
  [
   419622, 
   null, 
   "pappillion001", 
   "Well, first they'll have to admit--as they've done with Jefferson--that they WERE Deists... or at the very least, highly ambivalent about Christianity... and not the pro-theocracy Christian fundamentalists David Barton, EZ, and their ilk keep insisting they were. \n \n Kinda hard to insist the Founders were pro-Christian and anti-Christian at the same time. \n \n But at least this (frightening, IMO) Texas School Board vote pretty much settles the Jefferson issue once and for all. I doubt very much that these \"ultra-conservatives\" believe he intended the US to be a Christian nation.\n \n (But maybe they're not \"true\" Christians. ;))\n\n \n Are you kidding? Have you ever read the official definition of the Trinity? It's like 4 meaty paragraphs explaining the uniqueness of God, Jesus and the Holy Spirit immediately followed by how yet they are the same. I think the intent was a type of subliminal hypnosis that brainwashed the reader. \n \n Look at the foot hold young earthers and intelligent design have. In a 100 years they will be reading how that in response to the three wise and holy prophets Limbaugh, Hannity and Beck's 40 day prayer rally Jesus crossed the Delaware to bring divine justice to Iraq and Afghanistan where they were training liberal terrorists backed by the Islamic jihadist organization DNC", 
   {}, 
   419578, 
   null, 
   1293006600.0
  ], 
  [
   419631, 
   null, 
   "Xcaliber", 
   "Look at the foot hold young earthers and intelligent design have. In a 100 years they will be reading how that in response to the three wise and holy prophets Limbaugh, Hannity and Beck's 40 day prayer rally Jesus crossed the Delaware to bring divine justice to Iraq and Afghanistan where they were training liberal terrorists backed by the Islamic jihadist organization DNC\n\n \n Let's not forget the Virgin Palin, I'm sure by then they'll find a way for her to give birth to the \"New\" Savior of Man.... LMAO.", 
   {}, 
   419622, 
   null, 
   1293026520.0
  ], 
  [
   419642, 
   null, 
   "MrWriteLA", 
   "The unpleasant irony of these new school board \"standards\" is that this Orwellian rewriting of history is what the Communists were famous for. Now here it's being done by people who I'm sure would swear on a stack of Bibles are rabid anti-Communists. \n \n The influence of Texas on textbook publishing nationwide makes this potentially beyond terrifying. But by trying to remove Thomas Jefferson from textbooks, this time I think the revisionists have gone too far. There are some events that were just too central to this country's founding and some men who were too essential to those events, and whose names are too ingrained in the national consciousness, for a handful of conservative extremists to be able to successfully transform into \"non-persons\" (the Communist term). \n \n Who do they say wrote the Declaration of Independence? John Calvin?\n \n To quote the last line of Bridge on the River Kwai: \"Madness. Madness!\"", 
   {}, 
   419631, 
   null, 
   1293036420.0
  ], 
  [
   419676, 
   null, 
   "jyoshu", 
   "What they've done in Texas is sickening. Non-historians with a political axe to grind shouldn't be in charge of History textbooks.\n\n \n As we know, Jefferson was the only founding father, right? emoticon_rolleyes Puhlease. They aren't trying to remove Jefferson from history. What a load of ridiculous paranoia this thread is. From what I've read from more mainstream sources (certainly not from Huffington Post of course), the issue is that some want to stop acting like Jefferson was the only father that mattered and therefore de-emphasize him back to where he should be. We are supposed to be a constitutional republic, not a 'Jeffersonian' republic. Let's call this as it is--the reason anti-theists like Jefferson so much is because he was the most influential non-religious founding father among all of them. If he has been religious, you can bet they'd ignore him as much as Adams.\n \n The issue is not that America needs to be a \"Christian nation\" in the sense of pushing doctrine. It's rather that it was never meant to be a religion-sanitized secular-only nation pretending that religion isn't an everyday part of life for most people. 'Christian nation' mostly just means that we don't have to act like religion is some boogyman. Jefferson was quite tolerant of religion, and because of that he was NOTHING like many of these folks nowadays who pretend to be Jeffersonian.\n \n For a long time, textbooks have slowly been moving more and more in the direction of trying to pretend religion wasn't a big part of the cultural basis of this country. Pretending religion wasn't a profound factor that helped shape this country (take the views of John Locke for instance) is downright dishonest. I'd rather have a textbook that isn't religio-phobic any day over ones that are. Our school kids will survive just fine a curriculum that isn't Jefferson-centric and actually shows the role Christianity--yes, Christianity in terms of its ideals--played in the shaping of this country. emoticon_rolleyes Better to have the facts and let the chips fall where they may than some revisionist secularist-fantasy of a history.", 
   {}, 
   419605, 
   null, 
   1293056280.0
  ], 
  [
   419679, 
   null, 
   "Xcaliber", 
   "As we know, Jefferson was the only founding father, right? emoticon_rolleyes Puhlease. They aren't trying to remove Jefferson from history. What a load of ridiculous paranoia this thread is. From what I've read from more mainstream sources (certainly not from Huffington Post of course), the issue is that some want to stop acting like Jefferson was the only father that mattered and therefore de-emphasize him back to where he should be.\n\n \n This is not Paranoia or some kind of conspiracy, this is actually happening. Not sure what sources you are reading but Here's three separate articles on the issue. Aol news and the New York times are definitely mainstream.They want to drop Jefferson and the Enlightenment from school books, and this is being done by Conservative Christians whom out number the Liberals on the Board that Voted for this....\n \n Texas Removes Thomas Jefferson From Teaching Standard\n \n http://www.nytimes.com/2010/03/13/education/13texas.html\n \n Texas BOE Removes Jefferson From History Standard : Dispatches from the Culture Wars", 
   {}, 
   419676, 
   null, 
   1293057660.0
  ], 
  [
   419680, 
   null, 
   "Steeeeve", 
   "I think they are doing it thinking that eventually the U.S. will be a generation of people who have never been taught the truth. They've been re-writing history in an attempt to replace History with God and removing Jefferson is just the first step. Once they realize that Washington, Adams, and many of the other founders were Deists/Free Masons they will be removed as well.\n\n \n and visa versa. Everyone thinks this debate is just one sided against them but truth is we are replacing facts with fiction one way or the other depending who makes up the majority of that locality. Sorry but \"evolution\" is a scientific theory and \"endowed by our CREATOR\" is in the DoI.", 
   {}, 
   419562, 
   null, 
   1293057840.0
  ], 
  [
   419681, 
   null, 
   "jyoshu", 
   "Also, textbook writing has been shady business for ages. Special interest groups from all political angles have tried to control it where they can. For instance, there's a movement afoot in CA right now to force textbook makers to write about the LGBT movement. Funny thing is they even come right out and admit they're doing it for ulterior motives (to help 'negative stereotypes' and supposedly 'reduce anti-gay bullying', apparently.) People seem to have an assumption that history books will always be objective sources. They rarely, if ever, are and all kinds of political movements continue to try and control them. So the outrage over the Christian-right trying to do that is pretty hypocritical.", 
   {}, 
   419676, 
   null, 
   1293057960.0
  ], 
  [
   419682, 
   null, 
   "Xcaliber", 
   "It's particularly dangerous when they use religion as their Motive to re-write History IMO. Doesn't matter who or where it's coming from, The Government should step in and do something about it, If they can. I'm not sure if they can in this case Considering the States Rights issues.", 
   {}, 
   419681, 
   null, 
   1293058260.0
  ], 
  [
   419684, 
   null, 
   "jyoshu", 
   "It's particularly dangerous when they use religion as their Motive to re-write History IMO. \n\n \n No more dangerous than using any other ideology to gain too much control.", 
   {}, 
   419682, 
   null, 
   1293059280.0
  ], 
  [
   419686, 
   null, 
   "JWilliam", 
   "The issue is not that America needs to be a \"Christian nation\" in the sense of pushing doctrine. It's rather that it was never meant to be a religion-sanitized secular-only nation pretending that religion isn't an everyday part of life for most people.'Christian nation' mostly just means that we don't have to act like religion is some boogyman.[ Jefferson was quite tolerant of religion, and because of that he was NOTHING like many of these folks nowadays who pretend to be Jeffersonian.\n\n \n The issue is that the majority of 'Christian Nation' advocates use it as a means to support the government enacting legislation that is based on Christian values. The existence of religion in America and its prevalance in shaping our society is not in question. Religion's place in public policy is.\n \n \nFor a long time, textbooks have slowly been moving more and more in the direction of trying to pretend religion wasn't a big part of the cultural basis of this country. Pretending religion wasn't a profound factor that helped shape this country (take the views of John Locke for instance) is downright dishonest. I'd rather have a textbook that isn't religio-phobic any day over ones that are. Our school kids will survive just fine a curriculum that isn't Jefferson-centric and actually shows the role Christianity--yes, Christianity in terms of its ideals--played in the shaping of this country. emoticon_rolleyes Better to have the facts and let the chips fall where they may than some revisionist secularist-fantasy of a history.\n\n \n I agree. Textbooks should not disclude the benefits society has gained via religion. I recently watched an episode of The Big Debate in which Richard Dawkins essentially said that even though he doesn't believe, he is not against the bible being taught in schools as literature, being that understanding the bible is necessary to understanding the majority of English literature.", 
   {}, 
   419676, 
   null, 
   1293061560.0
  ], 
  [
   419689, 
   null, 
   "Stonewall", 
   "As we know, Jefferson was the only founding father, right? emoticon_rolleyes Puhlease. They aren't trying to remove Jefferson from history. What a load of ridiculous paranoia this thread is. From what I've read from more mainstream sources (certainly not from Huffington Post of course), the issue is that some want to stop acting like Jefferson was the only father that mattered and therefore de-emphasize him back to where he should be. We are supposed to be a constitutional republic, not a 'Jeffersonian' republic. Let's call this as it is--the reason anti-theists like Jefferson so much is because he was the most influential non-religious founding father among all of them. If he has been religious, you can bet they'd ignore him as much as Adams.\n \n The issue is not that America needs to be a \"Christian nation\" in the sense of pushing doctrine. It's rather that it was never meant to be a religion-sanitized secular-only nation pretending that religion isn't an everyday part of life for most people. 'Christian nation' mostly just means that we don't have to act like religion is some boogyman. Jefferson was quite tolerant of religion, and because of that he was NOTHING like many of these folks nowadays who pretend to be Jeffersonian.\n \n For a long time, textbooks have slowly been moving more and more in the direction of trying to pretend religion wasn't a big part of the cultural basis of this country. Pretending religion wasn't a profound factor that helped shape this country (take the views of John Locke for instance) is downright dishonest. I'd rather have a textbook that isn't religio-phobic any day over ones that are. Our school kids will survive just fine a curriculum that isn't Jefferson-centric and actually shows the role Christianity--yes, Christianity in terms of its ideals--played in the shaping of this country. emoticon_rolleyes Better to have the facts and let the chips fall where they may than some revisionist secularist-fantasy of a history.\n\n \n The founding of this country was not based on Christianity, the 10 Commandments, or any other religious beliefs. While many citizens may have held religious beliefs closely, it wasn't the basis in forming our government. \n \n I understand that the textbooks will still mention Thomas Jefferson, but they do try to downplay his part. He was easily one of the most influential and 'important' founding fathers, and students should learn about him. The main problem is that the school board removed his role in the enlightenment, and instead of teaching students about his writings and political philosophies, they replaced him with Saint Thomas Aquinas, John Calvin, and Sir William Blackstone (not really a religious figure, but these are the 3 new names displacing Jefferson). \n \n Jefferson isn't the only problem. They downplay the concept separation of church and state (basically questioning whether it was really the founders' intention to separate the two.) They also refused having students learn about the founders' reasons for establishing religious freedom. \n \n They replaced the term 'capitalism' with 'free enterprise' (because capitalism is apparently a liberal term) and removed any references to our government using the word 'democratic' have been replaced with 'constitutional republic.' Also any 'democratic' governments have been changed to 'representative.' \n \n I didn't even mention them removing Cesar Chavez, which has led led to the criticism that Texas is trying to ignore minority involvement in their culture. \n \n It's basically just a dumbing down of the students to remove the things that this Christian-Conservative school board wasn't comfortable with. Seriously... kids can't handle 'democratic' or 'capitalism?' It's revisionist history at its finest to suggest the founding fathers were Christian and that the country was founded on biblical morals.", 
   {}, 
   419676, 
   null, 
   1293062160.0
  ], 
  [
   419691, 
   null, 
   "Easyrider", 
   "I thought Jefferson--certainly one of the top three Founders--was \"no Deist\" and intended this to be a Christian nation... at least according to EZ. Why would an ultra-conservative school board want to remove him from their textbooks?\n\n \n If they do it's probably because he was a Unitarian, as opposed to believing in the Trinity. \n \n If you're still stumped submit it to prayer.", 
   {}, 
   419549, 
   null, 
   1293062340.0
  ], 
  [
   419692, 
   null, 
   "Steeeeve", 
   "It's particularly dangerous when they use religion as their Motive to re-write History IMO. Doesn't matter who or where it's coming from, The Government should step in and do something about it, If they can. I'm not sure if they can in this case Considering the States Rights issues.\n\n Jyoshu is right, it really doesn't matter who is doing the manipulation..it harms everyone. So if religious folks are manipulating the truth then they do a disservice to both knowledge and the religion. The biggest threat to religion has always been those that claim to be religious. The same holds true for other causes.\n \n And yes, the federal government can't do anything about it nor should they be able to.", 
   {}, 
   419682, 
   null, 
   1293062400.0
  ], 
  [
   419693, 
   null, 
   "Xcaliber", 
   "If you're still stumped submit it to prayer.\n\n \n I did that once, I prayed to a Milk Jug and Nothing happened. Then I prayed to God and Nothing happened. I figured I would take my chances with not praying since it don't work...emoticon_xhoho", 
   {}, 
   419691, 
   null, 
   1293062580.0
  ], 
  [
   419694, 
   null, 
   "Easyrider", 
   "Cop arrests preacher for saying homosexuality a sin\n \n Telling a street preacher that it is against the law to affirm the Bible's teaching on homosexuality is costing a team of British police officers some $11,000 &#8211; plus legal fees. \n \n He was preaching from the Bible in Workington town center and his sermon contained no mention of homosexuality. But when he finished, Sam Adams, who identified himself as an \"LBGT Liaison Officer,\" approached him, the institute reported. \n \n \"Even though Mr. Mcalpine had never mentioned homosexuality, [Officer] Adams warned him that he could be arrested if he made homophobic remarks. Mr. Mcalpine replied that he was not homophobic, but he sometimes preaches that homosexual conduct is a sin because that is what the Bible says,\" the report said. \n \n On Dec. 8, a court in Birmingham County concluded police in West Midlands broke the law when they arrested, handcuffed and detained street preacher Anthony Rollins. \n \n The court awarded Rollins 4,250 British pounds and ordered police to pay his legal costs. In the case of Mcalpine, police were told to pay him 7,000 pounds, or about $11,000, plus his legal fees. \n \n The U.K.'s Public Order Act includes language that is similar to Barack Obama's \"hate crimes\" law in the U.S. that he signed more than a year ago in that they ban some statements regarding homosexuality. \n \n Cop arrests preacher for saying homosexuality a sin\n \n A facist, spiritually-challenged LBGT Liaison Officer!\n \n Seig Heil. And coming to San Francisco and the U.S. soon, no doubt.\n \n Watch out for these turkeys and report them to the Alliance Defense Fund or the American Center for Law and Justice.", 
   {}, 
   419692, 
   null, 
   1293062760.0
  ], 
  [
   419697, 
   null, 
   "Xcaliber", 
   "Too bad this happened in Britain and not here. I think they should make it a Crime to Preach The Gospel in Public , or anywhere outside a church. That might stem the flow of Delusion in the U.S. \n \n I commend those Officers, whether they did it Illegally or not.", 
   {}, 
   419694, 
   null, 
   1293063780.0
  ], 
  [
   419700, 
   null, 
   "JWilliam", 
   "Too bad this happened in Britain and not here. I think they should make it a Crime to Preach The Gospel in Public , or anywhere outside a church. That might stem the flow of Delusion in the U.S. \n \n I commend those Officers, whether they did it Illegally or not.\n\n \n If you truly believe in the 1st amendment you can't possibly be serious.", 
   {}, 
   419697, 
   null, 
   1293064680.0
  ], 
  [
   419704, 
   null, 
   "Xcaliber", 
   "If you truly believe in the 1st amendment you can't possibly be serious.\n\n \n I do believe in the First amendment, But yes I am serious.\n The First Amendment Awards Citizens the Right to Practice the religion of which they Choose, It does not However give them the right to Force their religion on others. Sure they also have the Freedom of Speech, But in the case of Religious Zealots standing on a street corner spouting nonsense and lies I would gladly support an Amendment to remove their right to do so.", 
   {}, 
   419700, 
   null, 
   1293066240.0
  ], 
  [
   419707, 
   null, 
   "JWilliam", 
   "I do believe in the First amendment, But yes I am serious.\n The First Amendment Awards Citizens the Right to Practice the religion of which they Choose, It does not However give them the right to Force their religion on others. Sure they also have the Freedom of Speech, But in the case of Religious Zealots standing on a street corner spouting nonsense and lies I would gladly support an Amendment to remove their right to do so.\n\n \n I would love to see you explain how this legislation would be able to survive constitutional scrutiny.", 
   {}, 
   419704, 
   null, 
   1293068160.0
  ], 
  [
   419709, 
   null, 
   "Xcaliber", 
   "I would love to see you explain how this legislation would be able to survive constitutional scrutiny.\n\n \n Lol, I never said it would, It is just a wish of mine, I fully realize the Futility of it, but hey, one can dream right?...", 
   {}, 
   419707, 
   null, 
   1293068880.0
  ], 
  [
   419726, 
   null, 
   "Stonewall", 
   "What does a gay, British cop arresting a preacher in modern times have to do with the foundation of the United States?", 
   {}, 
   419709, 
   null, 
   1293077760.0
  ], 
  [
   419727, 
   null, 
   "jyoshu", 
   "The issue is that the majority of 'Christian Nation' advocates use it as a means to support the government enacting legislation that is based on Christian values. The existence of religion in America and its prevalance in shaping our society is not in question. Religion's place in public policy is.\n\n \n If that's true (and in my experience it's not nearly as prevalent as critics assert), it's a separate issue that what gets written in textbooks regarding history.\n \n \nThe founding of this country was not based on Christianity, the 10 Commandments, or any other religious beliefs. While many citizens may have held religious beliefs closely, it wasn't the basis in forming our government. \n\n \n Of course not. I didn't say it was based on any of those. It was, however, based on values that came out of Christianity. The reason people like John Locke held the views that they did was because of their religion. They made that clear in their writings. \n \n \nI understand that the textbooks will still mention Thomas Jefferson, but they do try to downplay his part. \n\n \n As they should, because he is over-played IMO. That was the point I was making. The reason secularists like him so much (he's trumpeted by secularists a lot more than the other founding fathers) is because he himself wasn't religious. Jefferson was not the be-all and end-all of the founding of the U.S.\n \n \nThe main problem is that the school board removed his role in the enlightenment, and instead of teaching students about his writings and political philosophies, they replaced him with Saint Thomas Aquinas, John Calvin, and Sir William Blackstone (not really a religious figure, but these are the 3 new names displacing Jefferson).\n \n \n I think the school board has a point. The enlightenment wouldn't have happened if not for the likes of John Calvin, for instance. (Historians generally attribute the protestant reformation one of the key catalysts of the enlightenment.) Remember, the enlightenment pre-dated Jefferson. He was a product of the enlightenment, not a cause. \n \n \nJefferson isn't the only problem. They downplay the concept separation of church and state (basically questioning whether it was really the founders' intention to separate the two.)\n\n \n Clearly the founders didn't mean the two to be so sanitized from each other as is the current trend. The most basic reading of the 1st amendment makes that clear. \n \n \nThey replaced the term 'capitalism' with 'free enterprise' (because capitalism is apparently a liberal term) and removed any references to our government using the word 'democratic' have been replaced with 'constitutional republic.' Also any 'democratic' governments have been changed to 'representative.'\n\n \n Yes, that is because 'capitalism' has indeed become a negative word due to it's use by liberals who don't like that system. The word doesn't denote freedom enough. I agree with the school board that 'free market' or 'free enterprise' is a better term.", 
   {}, 
   419689, 
   null, 
   1293078000.0
  ], 
  [
   419731, 
   null, 
   "Xcaliber", 
   "I agree. Textbooks should not disclude the benefits society has gained via religion. I recently watched an episode of The Big Debate in which Richard Dawkins essentially said that even though he doesn't believe, he is not against the bible being taught in schools as literature, being that understanding the bible is necessary to understanding the majority of English literature.\n\n \n Society has not \" Gained\" any benefits via religion. The reason Religion is not taught in schools is because it disregards reality and doesn't promote free thinking. When Children are Taught Evolution in Science class and then taught in another class that mankind was made by the Invisible man they become confused. Organized religion , Specifically Christianity, Was not part of the Founding principles of this country. The Founders learned from their past the dangers of a Religious Controlled Government and intentionally left God and Jesus out of the Founding Principles of the U.S. They fully realized that a part of the population was Christian, but Christianity , as the religious right would have you believe, is not, and was not the founding religion . \n Thomas Jefferson knew this. This is the reason, if you read the real History, That he specifically did not include the Words, God, Jesus, Holy Spirit, or any other religious term in our Constitution. The Zealots In Texas are removing him from the History books so that they can Raise a new Generation of Uneducated, God Fearing sheep, like the ones who passed the changes in the first place.", 
   {}, 
   419686, 
   null, 
   1293079140.0
  ], 
  [
   419751, 
   null, 
   "jazyjason", 
   "\n \n A facist, spiritually-challenged LBGT Liaison Officer!\n Oh no he was conforming to British law! gasp oh the horror. The poor preacher can't rant on a street corner like you do on this forum...\n \n \nSeig Heil. And coming to San Francisco and the U.S. soon, no doubt.\n\n \n First off watch your mouth Easy. \"Seig Heil.\" Thousands of gays died under those words and even though it doesn't matter to you in the slightest that is very offensive.\n \n And implying that Nazism is part of San Fransisco culture couldn't be further from the truth. You certainly know how to bridge gaps to think that denying someone to mouth off hate speech is akin to the murdering of thousands because of their orientation or their religion. Your nuts cart Blanche.\n \n \nWatch out for these turkeys and report them to the Alliance Defense Fund or the American Center for Law and Justice.\n\n \n Oh yes report them to Jay everyone. Mr. Seculo will do nothing more than go on his daily radio show and gripe about homosexuals \"oppressing\" the ability to compare gays to child rapists and pedophiles.... Oh the shame....", 
   {}, 
   419694, 
   null, 
   1293094380.0
  ], 
  [
   419766, 
   null, 
   "JWilliam", 
   "Society has not \" Gained\" any benefits via religion. The reason Religion is not taught in schools is because it disregards reality and doesn't promote free thinking. When Children are Taught Evolution in Science class and then taught in another class that mankind was made by the Invisible man they become confused. Organized religion , Specifically Christianity, Was not part of the Founding principles of this country. The Founders learned from their past the dangers of a Religious Controlled Government and intentionally left God and Jesus out of the Founding Principles of the U.S. They fully realized that a part of the population was Christian, but Christianity , as the religious right would have you believe, is not, and was not the founding religion . \n Thomas Jefferson knew this. This is the reason, if you read the real History, That he specifically did not include the Words, God, Jesus, Holy Spirit, or any other religious term in our Constitution. The Zealots In Texas are removing him from the History books so that they can Raise a new Generation of Uneducated, God Fearing sheep, like the ones who passed the changes in the first place.\n\n \n You misunderstand. I'm not advocating teaching religion as truth in school. Far from, in fact. In the event I haven't been clear, I am an athiest. However, religion has made a huge impact in our world and to disclude discourse on its role in our history and in shaping our society would be both negligent and dishonest.", 
   {}, 
   419731, 
   null, 
   1293129840.0
  ], 
  [
   419768, 
   null, 
   "Xcaliber", 
   "You misunderstand. I'm not advocating teaching religion as truth in school. Far from, in fact. In the event I haven't been clear, I am an athiest. However, religion has made a huge impact in our world and to disclude discourse on its role in our history and in shaping our society would be both negligent and dishonest.\n\n \n Yes Religion has made a Huge impact, And I believe more negative than positive. I don't think teaching religion in schools is teaching Children the truth about the History of this Nation. Religion should be taught if at all in the Homes of religious people. If anything I would agree to religion being taught ONLY if they would teach all aspects, the good and the bad, so that Children could make the choice for themselves. Religion has done far more damage to the way people think than the Religious Right is willing to teach though, so it should stay out of school.", 
   {}, 
   419766, 
   null, 
   1293131280.0
  ], 
  [
   419770, 
   null, 
   "JWilliam", 
   "Yes Religion has made a Huge impact, And I believe more negative than positive. I don't think teaching religion in schools is teaching Children the truth about the History of this Nation. Religion should be taught if at all in the Homes of religious people. If anything I would agree to religion being taught ONLY if they would teach all aspects, the good and the bad, so that Children could make the choice for themselves. Religion has done far more damage to the way people think than the Religious Right is willing to teach though, so it should stay out of school.\n\n \n Then we agree.", 
   {}, 
   419768, 
   null, 
   1293131880.0
  ], 
  [
   419771, 
   null, 
   "Xcaliber", 
   "Then we agree.\n\n \n Yep, it would seem so. Now how do we convince the rest of the world..lol.emoticon_xagree", 
   {}, 
   419770, 
   null, 
   1293132360.0
  ], 
  [
   419772, 
   null, 
   "Bennedict", 
   "Yes Religion has made a Huge impact, And I believe more negative than positive. I don't think teaching religion in schools is teaching Children the truth about the History of this Nation. Religion should be taught if at all in the Homes of religious people. If anything I would agree to religion being taught ONLY if they would teach all aspects, the good and the bad, so that Children could make the choice for themselves. Religion has done far more damage to the way people think than the Religious Right is willing to teach though, so it should stay out of school.\n\n \n i think kids should be taught about the religious impact on America. it is a part of American history, so kids should learn about it. kids should also learn about the very bad things that have happened due to religion, Hitler for example - kids are being taught about what Hitler did, not his motifs. of course, we are talking about public schools. faith schools have an entire course which is \"unmoderated\" (not sure what you would call the moderation of school teachings) and extremely biased. the teachers can put anything they want into that cirriculum. like you say, kids that go to faith schools are not being taught the negatives of religion, but about the bible, praying, and strictly the good things that come of religion, pretending the bad didnt happen. it's full on indoctrination and the religious course in schools should not exist. if all schools were public schools, not teaching kids about religion in history class is unfair. kids deserve that kind of education about their country, and teaching them about, say Martin Luther King Jr while neglecting to teach about his religious motifs is dishonest.", 
   {}, 
   419768, 
   null, 
   1293132420.0
  ], 
  [
   419776, 
   null, 
   "Xcaliber", 
   "i think kids should be taught about the religious impact on America. it is a part of American history, so kids should learn about it. kids should also learn about the very bad things that have happened due to religion, Hitler for example - kids are being taught about what Hitler did, not his motifs. of course, we are talking about public schools. faith schools have an entire course which is \"unmoderated\" (not sure what you would call the moderation of school teachings) and extremely biased. the teachers can put anything they want into that cirriculum. like you say, kids that go to faith schools are not being taught the negatives of religion, but about the bible, praying, and strictly the good things that come of religion, pretending the bad didnt happen. it's full on indoctrination and the religious course in schools should not exist. if all schools were public schools, not teaching kids about religion in history class is unfair. kids deserve that kind of education about their country, and teaching them about, say Martin Luther King Jr while neglecting to teach about his religious motifs is dishonest.\n\n \n Like I said, I agree that Religion Should be taught as part of our nations History, But they won't teach both sides of the story so all of it should be left out. The Problem here , to put it another way, is that there should be a Very Clear Definition of \" Religion\". You could tell the Right wing Fundies that we are going to teach religion in school and they would applaud it. Turn around and inform them we are teaching ALL religion and they would throw a fit. They only want Christianity taught, for most of them they don't recognize Islam, Judaism, Mormonism, Buddhism, or any other established religion and they wouldn't stand for those being taught to their Kids. Organized Religion of any kind in my own opinion is an abomination to humankind. We don't need religion to tech our Children Morals. We don't need religion to teach our children right from wrong. So IMO until they can find a way to teach religion in schools that is Fair to all religions, and a way that keeps religion in it's rightful place and doesn't make it the base for how societies should be built , then I think not teaching it is fair.", 
   {}, 
   419772, 
   null, 
   1293133080.0
  ], 
  [
   419780, 
   null, 
   "Bennedict", 
   "Like I said, I agree that Religion Should be taught as part of our nations History, But they won't teach both sides of the story so all of it should be left out. The Problem here , to put it another way, is that there should be a Very Clear Definition of \" Religion\". You could tell the Right wing Fundies that we are going to teach religion in school and they would applaud it. Turn around and inform them we are teaching ALL religion and they would throw a fit. They only want Christianity taught, for most of them they don't recognize Islam, Judaism, Mormonism, Buddhism, or any other established religion and they wouldn't stand for those being taught to their Kids. Organized Religion of any kind in my own opinion is an abomination to humankind. We don't need religion to tech our Children Morals. We don't need religion to teach our children right from wrong. So IMO until they can find a way to teach religion in schools that is Fair to all religions, and a way that keeps religion in it's rightful place and doesn't make it the base for how societies should be built , then I think not teaching it is fair.\n\n \n well, if the negatives of religion were in the cirriculum and the course was moderated by the school board, they would have to teach that aspect, otherwise their jobs would be compromised. to be fair, Islam, Judaism and other religions have had very minimal impact on the history of America, so very little time would be spent on them. if we're talking about faith schools again, yes equal time should be spent on equal religions, but again, faith school's religious cirriculum is unmoderated. they can be biased towards Christianity and they will be.\n \n you seem to be switching back and forth between history class and religious studies class. not teaching kids about the religious impact of America is unfair - not teaching kids about religion in a biased, one sided manner is fair. would we agree?", 
   {}, 
   419776, 
   null, 
   1293136080.0
  ], 
  [
   419782, 
   null, 
   "Xcaliber", 
   "\n you seem to be switching back and forth between history class and religious studies class. not teaching kids about the religious impact of America is unfair - not teaching kids about religion in a biased, one sided manner is fair. would we agree?\n\n \n I guess what I meant is that it would be Good if they would teach the religious aspects but only as part of the History. I do not believe there is a place in public schools for religious classes of any kind. Yes I agree, Religion is part of the Fabric of this country, no matter how much one might despise it, and it should be taught, but as history and in a Historical context.", 
   {}, 
   419780, 
   null, 
   1293137640.0
  ], 
  [
   419807, 
   null, 
   "pappillion001", 
   "Cop arrests preacher for saying homosexuality a sin\n \n Telling a street preacher that it is against the law to affirm the Bible's teaching on homosexuality is costing a team of British police officers some $11,000 - plus legal fees. \n \n He was preaching from the Bible in Workington town center and his sermon contained no mention of homosexuality. But when he finished, Sam Adams, who identified himself as an \"LBGT Liaison Officer,\" approached him, the institute reported. \n \n \"Even though Mr. Mcalpine had never mentioned homosexuality, [Officer] Adams warned him that he could be arrested if he made homophobic remarks. Mr. Mcalpine replied that he was not homophobic, but he sometimes preaches that homosexual conduct is a sin because that is what the Bible says,\" the report said. \n \n On Dec. 8, a court in Birmingham County concluded police in West Midlands broke the law when they arrested, handcuffed and detained street preacher Anthony Rollins. \n \n The court awarded Rollins 4,250 British pounds and ordered police to pay his legal costs. In the case of Mcalpine, police were told to pay him 7,000 pounds, or about $11,000, plus his legal fees. \n \n The U.K.'s Public Order Act includes language that is similar to Barack Obama's \"hate crimes\" law in the U.S. that he signed more than a year ago in that they ban some statements regarding homosexuality. \n \n Cop arrests preacher for saying homosexuality a sin\n \n A facist, spiritually-challenged LBGT Liaison Officer!\n \n Seig Heil. And coming to San Francisco and the U.S. soon, no doubt.\n \n Watch out for these turkeys and report them to the Alliance Defense Fund or the American Center for Law and Justice.\n\n \n I am so glad to know you feel this way. You of course would have no problem with say a muslim handing out leaflets stating that Christians have strayed from the path God set for them or homosexuals standing on ladders at the mall telling people about the myths concerning sexual orientation, right?\n \n But you do don't you? My guess will be because God said they are commiting a sin and something creative about Islam even though in truth there is no difference from a legal perspective.\n \n Also when someone is accused of a crime, what happens? Do the police not come and investigate and in finding probale cause make an arrest where the person is detained until bail is determined? Sounds remarkably like the process you have come to associate with a police state.", 
   {
    "unicode_changes_made": true
   }, 
   419694, 
   null, 
   1293148200.0
  ], 
  [
   419814, 
   null, 
   "Easyrider", 
   "I am so glad to know you feel this way. You of course would have no problem with say a muslim handing out leaflets stating that Christians have strayed from the path God set for them or homosexuals standing on ladders at the mall telling people about the myths concerning sexual orientation, right?\n\n \n I have a problem with meathead atheists who don't know the time of day, but think they do.\n \n \n\n \n Also when someone is accused of a crime, what happens? Do the police not come and investigate and in finding probale cause make an arrest where the person is detained until bail is determined? Sounds remarkably like the process you have come to associate with a police state.\n\n \n Hey - your spiritually constipated brethren over in the UK injected their political correctness where it shouldn't have been. I hope you people learn a lesson from that before you wind up $11K lighter in the wallet, and then wind up in Hell for being ignorant of the big picture.", 
   {}, 
   419807, 
   null, 
   1293151620.0
  ], 
  [
   419838, 
   null, 
   "pappillion001", 
   "I have a problem with meathead atheists who don't know the time of day, but think they do.\n\n \n Translation: Yes Pappillion you are right I didn't look at like that. \n \n \nHey - your spiritually constipated brethren over in the UK injected their political correctness where it shouldn't have been. I hope you people learn a lesson from that before you wind up $11K lighter in the wallet, and then wind up in Hell for being ignorant of the big picture.\n\n \n And how pleasant is it to be the opposite of constipated. Interesting comparison you make. Is their a connection I don't see between religion and bowel movements or the lack thereof? Is there a holy ex lax one takes to relieve this condition? Be careful here before you say Jesus think about where this going.", 
   {}, 
   419814, 
   null, 
   1293164940.0
  ], 
  [
   419841, 
   null, 
   "MrWriteLA", 
   "Do you pray to Jesus with that mouth, EZ?", 
   {}, 
   419838, 
   null, 
   1293167700.0
  ], 
  [
   419878, 
   null, 
   "Easyrider", 
   "Do you pray to Jesus with that mouth, EZ?\n\n \n What would you know about propriety to question others? \n \n Now, about you and yours:\n \n \"This is the way of an adulteress (or homosexual sinner): She eats and wipes her mouth and says, 'I've done nothing wrong.' - Proverbs 30:20\n \n To personalize it better for you:\n \n \"This is the way of a homosexual sinner: He eats and wipes his mouth and says, 'I've done nothing wrong.' - Proverbs 30:20\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.", 
   {}, 
   419841, 
   null, 
   1293226200.0
  ], 
  [
   419952, 
   null, 
   "jazyjason", 
   "\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n\n \n Clearly you don't even read your own Bible because the wrath of Sodom was for hospitality not homosexuality. But go on and keep cracking that old nut Easy...\n \n And what coming wrath? Sodom happened thousands of years ago? Oh you mean 2012 or when the UFO's take you away? Good luck with that Easy...", 
   {}, 
   419878, 
   null, 
   1293317760.0
  ], 
  [
   419991, 
   null, 
   "trebor", 
   "What would you know about propriety to question others? \n \n Now, about you and yours:\n \n \"This is the way of an adulteress (or homosexual sinner): She eats and wipes her mouth and says, 'I've done nothing wrong.' - Proverbs 30:20\n \n To personalize it better for you:\n \n \"This is the way of a homosexual sinner: He eats and wipes his mouth and says, 'I've done nothing wrong.' - Proverbs 30:20\n \n Come out of Sodom. Come out of Gomorrah. Flee from the coming wrath.\n\n \n \n My gosh, ER writes a proverb that refers to himself.. and then uses it to attack someone else.\n \n How ironic is that.", 
   {}, 
   419878, 
   null, 
   1293328020.0
  ], 
  [
   420031, 
   null, 
   "MrWriteLA", 
   "Wonder how God likes EZ presuming to put words in His mouth.", 
   {}, 
   419991, 
   null, 
   1293352380.0
  ], 
  [
   420064, 
   null, 
   "Easyrider", 
   "Wonder how God likes EZ presuming to put words in His mouth.\n\n \n Here's some, straight from God:\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n \n Romans 1:26-27 - \"Because of this, God gave them over to shameful lusts. Even their women exchanged natural relations for unnatural ones. In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed indecent acts with other men, and received in themselves the due penalty for their perversion.\"\n \n 1 Corinthians 6:9-10 - \"Do you not know that the wicked will not inherit the kingdom of God? Do not be deceived: Neither the sexually immoral nor idolaters nor adulterers nor male prostitutes nor homosexual offenders nor thieves nor the greedy nor drunkards nor slanderers nor swindlers will inherit the kingdom of God.\"\n \n 1 Timothy 1:8-10 - &#8220;But we know that the law is good if one uses it lawfully, knowing this: that the law is not made for a righteous person, but for the lawless and insubordinate, for the ungodly and for sinners, for the unholy and profane, for murderers of fathers and murderers of mothers, for manslayers, for fornicators, for sodomites, for kidnappers, for liars, for perjurers, and if there is any other thing that is contrary to sound doctrine&#8230;&#8221;\n \n Jude 7 &#8211; &#8220;In a similar way, Sodom and Gomorrah and the surrounding towns gave themselves up to sexual immorality and perversion. They serve as an example of those who suffer the punishment of eternal fire.&#8221; \n \n Repent, O heathen!", 
   {}, 
   420031, 
   null, 
   1293383280.0
  ], 
  [
   420066, 
   null, 
   "Xcaliber", 
   "Here's some, straight from God:\n \n Leviticus 18:22 - \"Do not lie with a man as one lies with a woman; that is detestable.\" \n \n Leviticus 20:13 - \"If a man lies with a man as one lies with a woman, both of them have done what is detestable. They must be put to death; their blood will be on their own heads.\"\n\n \n yeah and here's a few for you...\n \n Proof that fundamentalists selectively quote the Bible\n \n Grow up", 
   {}, 
   420064, 
   null, 
   1293383880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Foundation of America.", 
  "url": "http://www.4forums.com/political/religion-debates/14781-foundation-america.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14781, 
  "discussion_files": [
   [
    "9801.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-print.html"
   ], 
   [
    "9802.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-7-print.html"
   ], 
   [
    "9803.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-5-print.html"
   ], 
   [
    "9804.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-4-print.html"
   ], 
   [
    "9805.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-6-print.html"
   ], 
   [
    "9806.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-3-print.html"
   ], 
   [
    "9807.html", 
    "http://www.4forums.com/political/religion-debates/14781-foundation-america-2-print.html"
   ]
  ], 
  "identifier": 14781
 }
]