[
 [
  [
   419301, 
   null, 
   "Tither", 
   "  Gleason bills will encourage gun safety education for students \n LANSING-The Michigan Legislature recently voted to pass several bills sponsored by Senator John J. Gleason, including his legislation to increase programs for gun safety in public schools. Under Senate Bill 1402, the Michigan Department of Education (MDE) is required to develop or adopt a model gun safety program based on the \"Eddie Eagle\" curriculum developed by the National Rifle Association to promote gun accident prevention. Beginning in the 2011 - 2012 school year public schools across the state will be encouraged to adopt the model program developed by the MDE.\n \n \"Eddie the Eagle is a friendly character with a serious lesson who can teach our children how to stay safe when they encounter a firearm,\" said Senator Gleason. \"This program can save lives by promoting caution, safety and responsibility. The incidents of kids accidentally discharging or firing a gun are an avoidable tragedy, and this program can help prevent those.\"\n \n The Eddie Eagle GunSafe Program began in 1988 to educate children pre-Kindergarten through Third Grades. Its four step message for children who find a gun is simple, \"STOP. Don't touch. Leave the Area. Tell an Adult.\" The program has reached more than 21 million children and was developed with the cooperative efforts of such qualified professionals as clinical psychologists, teachers, and law enforcement personnel.\n\n Now What could be wrong with that?", 
   {
    "post_info": {
     "post_title": "Gun safety education for students?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1292608980.0
  ], 
  [
   419302, 
   null, 
   "Tither", 
   "Kind of on the educating non gun owners track.\n   Time for gun owners and non-gun owners to unite. \n The fact is that our sovereignty is best protected by an aggregate of values, as it is the coherence and cohesion of all our values system as one that works best on one important ground: with an aggregate of values intact as one people, it would be politically silly even to suggest what has been suggested over the decades. It would never be tolerated. \n \n Why not? Because up until now, gun regulation has not affected marriage and family activists, and RFID Chips have not been of interest to gun owners. It is the embodiment of the concept of \"When they came for the Catholics, I did not speak out, because I was not Catholic.\"\n \n This is why second amendment values need to be brought to non-gun owners for the realization that non-gun owners share the same values of independence and simply were never noticed as allies before. \n \n They're noticing now. With a new Congress next month, they'd better hurry. The kind of person who works without a net and prefers it is the kind of person who is very clear on why he or she must own a gun. It's delightfully more complex that this, and most satisfying when non-gun owners get it that it isn't about guns, but about several things non-gun owners want every bit as much as gun owners do. \n \n This is why I did not write a gun book, I wrote a liberty book. Educating the rest of the adult electorate on second amendment freedoms as a safeguard won't be talking about guns, but about safer streets and smaller government, actually. It won't happen, really, until privacy, education, business and second amendment all hook up. \n \n As the nation is divided, or more precisely, preoccupied with single issues, the result is that groups are issue-driven and goal-driven rather that unity-driven as the one and only real safeguard of the nation: namely, our insistence that our sovereignty be respected in all things. Driving constituents to go for one issue only will only divide the public and stall our self-rule. The best way to unwind this is to clarify that what actually safeguards our liberty and sovereignty best will be an aggregate of values we adhere to, not a series of loose causes, some of which may be respected. \n", 
   {}, 
   419301, 
   null, 
   1292609400.0
  ], 
  [
   419311, 
   null, 
   "Galileo", 
   "\"In 2000, a horrifying shooting took place at the Buell Elementary School in Mt. Morris Township, Michigan-a six-year old boy shot a six-year-old girl to death at school using a gun he had found lying on the floor of his house....\n \n \"Several studies suggest that the 'Eddie Eagle' program is ineffective. According to the Violence Policy Center and other critics,6 several studies suggest that after receiving Eddie Eagle lessons, young children can usually recite the program's 'Stop! Don't touch. Tell an adult. Leave the area' chant, but they aren't able to do these things in real-life situations. Parents and lawmakers should not assume that this type of training will keep young children safe around negligently-stored firearms.\n \n \"Stricter gun laws for adults might prevent more deaths and injuries. Critics object to placing the onus for gun safety and responsibility on young children, rather than on adult gun owners....\"\n http://www.legislature.mi.gov/documents/2009-2010/billanalysis/House/pdf/2009-HLA-1402-3.pdf\n \n So an adult gun owner fails to safely store a gun which results in a tragedy. Why not encourage adult gun owners to be more responsible rather than make some program for children that has been found to be ineffective by public health researchers mandatory in schools? With freedom comes responsibility and this program sounds like an excuse to evade such responsibility.", 
   {
    "unicode_changes_made": true
   }, 
   419302, 
   null, 
   1292616060.0
  ], 
  [
   419319, 
   null, 
   "NATO 556", 
   "\"Several studies suggest that the 'Eddie Eagle' program is ineffective. According to the Violence Policy Center and other critics,6 several studies suggest that after receiving Eddie Eagle lessons, young children can usually recite the program's 'Stop! Don't touch. Tell an adult. Leave the area' chant, but they aren't able to do these things in real-life situations. Parents and lawmakers should not assume that this type of training will keep young children safe around negligently-stored firearms.\n\n \n Meanwhile various anti-gun groups haven't offered any alternatives to the Eddie Eagle program. They seem to prefer the notion that children be left in the dark about firearms, this encouraging accidents to happen.\n \n \n\"Stricter gun laws for adults might prevent more deaths and injuries. Critics object to placing the onus for gun safety and responsibility on young children, rather than on adult gun owners....\"\n http://www.legislature.mi.gov/documents/2009-2010/billanalysis/House/pdf/2009-HLA-1402-3.pdf\n\n \n Might. Not will but \"might\". As in \"There might be weapons of mass destruction in Iraq.\" We can't gamble on the basis of \"might\" spread by fearmongers. Nor can we foolishly believe that regulation of adults will keep children safe.\n \n We advise children to not cross the street without looking both ways, don't cross on a red light, don't talk to strangers, don't eat strange candy, don't play with knives, don't go to that one house on the corner, etc. because we know these are important lessons. So why shouldn't we also teach them not to play with guns?\n \n \nSo an adult gun owner fails to safely store a gun which results in a tragedy. Why not encourage adult gun owners to be more responsible\n\n \n Only a complete fool would make such a statement. You obviously have zero clue about the many hundreds of laws that cover the welfare of children, how many ways adults can be charged with endangering the welfare and safety of a child. You can't in all honesty suggest that there aren't enough child safety laws already on the books to cover incidents like this.\n \n \nrather than make some program for children that has been found to be ineffective by public health researchers mandatory in schools?\n\n \n Simply because agenda-based studies have made the claim that Eddie Eagle is ineffective, that doesn't mean it's true. The only research data available as that which has been paid for by the Joyce Foundation, meaning it's tainted in terms of bias nature. It's inadmissible.\n \n Meanwhile I haven't seen you, the Violence Policy Center, or anyone else offer any alternatives that would possibly do a better job of teaching children how to be safe. What are your solutions to effectively teaching children to keep them safe when the adults aren't around?\n \n \nWith freedom comes responsibility and this program sounds like an excuse to evade such responsibility.\n\n \n Either prove conclusively that we're dangerously irresponsible and will actively look for ways to avoid taking care of our children, or shut up and drop this line of debate.\n \n Freedom may come with responsibility. But that doesn't mean your idea of \"responsibility\" is acceptable. It's irresponsible to assume that regulation of the adults will keep the children safe, when accidents can happen in places where there are no adults. Take for example any inner-city incident where a child finds a discarded gun on the playground. Are you going to force the gang members and murderers to prevent child access to their illegally possessed weapons?", 
   {}, 
   419311, 
   null, 
   1292619300.0
  ], 
  [
   419322, 
   null, 
   "Tither", 
   " 'Stop! Don't touch. Tell an adult. Leave the area' chant, but they aren't able to do these things in real-life situations. \n\n NO YOUR WRONG Galileo.\n \n That chant is Magic! For instance, if they taught it in the Penitentiary, we know that all gun crime would magically disappear! emoticon_smile \n \n It is only meant to be a starting place. Continuing education is required. Can someone tell me why I had to say that? Geesh!\n \n So I am kind of guessing that the cooperation between liberal rights and gun rights is still kind of on hold then? emoticon_xangel", 
   {}, 
   419311, 
   null, 
   1292621100.0
  ], 
  [
   419324, 
   null, 
   "zsu2357", 
   "Originally Posted by Galileo \n \n\"Several studies suggest that the 'Eddie Eagle' program is ineffective. According to the Violence Policy Center and other critics,6 several studies suggest that after receiving Eddie Eagle lessons, young children can usually recite the program's 'Stop! Don't touch. Tell an adult. Leave the area' chant, but they aren't able to do these things in real-life situations. Parents and lawmakers should not assume that this type of training will keep young children safe around negligently-stored firearms.\n\n So then perhaps we should also do away with any drug and alcohol programs as\n will?that are aimed at children.\n Is that also what your saying?Because there are a awful lot of kids out there that are getting into it at a very young age.", 
   {}, 
   419311, 
   null, 
   1292622600.0
  ], 
  [
   419335, 
   null, 
   "Brady", 
   "Gun nuts are clueless when it comes to kids. Just because a kid follows the instructions of an adult in class doesnt mean the kid will follow those instructions outside class when theres no adult around. When I was a kid I did dangerous things like play with fire even though adults told me not to.", 
   {}, 
   419324, 
   null, 
   1292632800.0
  ], 
  [
   419341, 
   null, 
   "NATO 556", 
   "Gun nuts are clueless when it comes to kids. Just because a kid follows the instructions of an adult in class doesnt mean the kid will follow those instructions outside class when theres no adult around. When I was a kid I did dangerous things like play with fire even though adults told me not to.\n\n \n Yes we know. You've already freely admitted to two of the three criteria to qualify as a serial killer; which helps explain why you hate gun owners so much.\n \n Meanwhile neither you nor anyone else on the anti-gun side have proposed a single idea that would provide better results than Eddie Eagle. We want solutions that work, and will continue to work even when adults aren't present to enforce them. And the best way to do that is to teach the kids early and often until it's second nature.", 
   {}, 
   419335, 
   null, 
   1292635740.0
  ], 
  [
   419361, 
   null, 
   "zsu2357", 
   "=Brady;419335]Gun nuts are clueless when it comes to kids. Just because a kid follows the instructions of an adult in class doesnt mean the kid will follow those instructions outside class when theres no adult around.\n\n Hmmm let me see..I got 4 kids,19,22,26and 27,I've almost always had guns around,in fact a couple of them were very good shots with my E-M1 .22 CAL. at the ripe old age of 5 and 6 yrs. old. \n Point is they (all 4) never accidentally shot anyone, or any friends of theirs that were over never shot anyone.Maybe gun nuts aren't as clueless as you would like to think.Incidentally I didn't keep them under lock and key.(the guns). \n \nWhen I was a kid I did dangerous things like play with fire even though adults told me not to.\n\n When I was a kid I did as I was told.;)", 
   {}, 
   419335, 
   null, 
   1292658840.0
  ], 
  [
   419374, 
   null, 
   "Penfold", 
   "Just say no.... look how well that works...", 
   {}, 
   419335, 
   null, 
   1292689320.0
  ], 
  [
   419375, 
   null, 
   "NATO 556", 
   "Just say no.... look how well that works...\n\n \n Where's the peer pressure pushing guns on ever younger and younger children? Where are their friends that're trying to convince them there's nothing wrong with shooting up a pistol in the school bathroom or behind the convenience store.\n \n Nowhere.\n \n Don't compare drugs and guns. The two aren't interchangeable.", 
   {}, 
   419374, 
   null, 
   1292690340.0
  ], 
  [
   419377, 
   null, 
   "Tither", 
   "Eddie the Eagle was designed for children. It is a stop gap measure until the parent can instruct further. Something could and should be developed for teens. Psychologist tell us that you basically have your children's Attention until about 11 or 12, then peer pressure takes over as a major influence. \n \n If part of the peer pressure was gun safety, then part of the battle would be over. That is the way it was when I was growing up, and someone wanted to take out and look at someone's gun. Mine or another friends! (Yes we had guns as teens. We earned the right when we acted responsibility enough before our shooting and hunting parents.) Then we taught safe gun handling to other teens because it was drilled into us since birth. It was just common sense. Like not sticking a screw driver into an electric socket. Will some still offend. You bet. It is life, not magic. Just do your best to lessen the tragedy to the best of your ability. That is the common sense part, but apparently common sense is not that common. \n \n Heller and McDonald said this was a Fundamental Individual Right of Americans. Now the question is, since we know that guns ARE going to be around, what can we do to minimize some possible damage. Is Eddie the Eagle so offensive, because the NRA might get some props, that you want to teach nothing instead? Now who is the XXXXXX?", 
   {}, 
   419375, 
   null, 
   1292694840.0
  ], 
  [
   419381, 
   null, 
   "sinjin", 
   "&#8220;The Eddie Eagle GunSafe® Program has been a tremendous success,&#8221; said Kayne Robinson, Executive Director of NRA General Operations. \n &#8220;Twenty-three million young people have received Eddie&#8217;s lifesaving message, and the future of the program is bright.&#8221;\n \n \n That many? Really?", 
   {}, 
   419377, 
   null, 
   1292697120.0
  ], 
  [
   419390, 
   null, 
   "Ranb", 
   "\"Several studies suggest that the 'Eddie Eagle' program is ineffective. \n\n \n You seem to be biased against gun education that does not teach children that guns are bad. What studies are you referring to? Are there any studies that suggest that the Eddie Eagle program is effective? This link says there are. Eddie Eagle Fact Sheet - Frequently Asked Questions\n \n I do not know if the link is correct, but I am not the one supporting claims that the program is ineffective. What else do you have?\n \n Ranb", 
   {}, 
   419311, 
   null, 
   1292710380.0
  ], 
  [
   419441, 
   null, 
   "Galileo", 
   "You seem to be biased against gun education that does not teach children that guns are bad. What studies are you referring to? Are there any studies that suggest that the Eddie Eagle program is effective? This link says there are. Eddie Eagle Fact Sheet - Frequently Asked Questions\n \n I do not know if the link is correct, but I am not the one supporting claims that the program is ineffective. What else do you have?\n \n Ranb\n\n \"A study of eight- to twelve-year-old boys reported similar findings. Separated into small groups and placed in a room for fifteen minutes with a handgun hidden in a drawer, more than two-thirds discovered the handgun, more than half of the groups handled it, and in more than one-third of the groups someone pulled the trigger. More than 90 percent of the boys who handled the gun or pulled the trigger reported that they had previously received some sort of safety instruction.... \n \n \"Frighteningly, many gun-owning parents do not have a good understanding of child development and have unrealistic views concerning their child's safety around guns.....\"\n Private Guns, Public Health - Google Books", 
   {}, 
   419390, 
   null, 
   1292803320.0
  ], 
  [
   419477, 
   null, 
   "Ranb", 
   "Thanks. See how easy that was?", 
   {}, 
   419441, 
   null, 
   1292824740.0
  ], 
  [
   419478, 
   null, 
   "COBHC", 
   "Liberals also promote their own gun safety courses. The difference is that their gun safety programs are a responsible social activity, while virtually identical programs from the right is indoctrinating propaganda. :)", 
   {}, 
   419301, 
   null, 
   1292828400.0
  ], 
  [
   419479, 
   null, 
   "COBHC", 
   "\"A study of eight- to twelve-year-old boys reported similar findings. Separated into small groups and placed in a room for fifteen minutes with a handgun hidden in a drawer, more than two-thirds discovered the handgun, more than half of the groups handled it, and in more than one-third of the groups someone pulled the trigger. More than 90 percent of the boys who handled the gun or pulled the trigger reported that they had previously received some sort of safety instruction.... \n \n \"Frighteningly, many gun-owning parents do not have a good understanding of child development and have unrealistic views concerning their child's safety around guns.....\"\n Private Guns, Public Health - Google Books\n\n \n Firstly, anything by David Hemenway is invalid as evidence. He's just as anti-gun as you are. I imagine you would react the same if I posted a book by Wayne LaPierre or somebody.\n \n Second, even if programs are inadequate, it's better to bring a knife to a gun fight than to come unarmed. Training that doesn't always work is better than no training at all. I assume that nobody on this thread has claimed to be against parental responsibility.", 
   {}, 
   419441, 
   null, 
   1292828700.0
  ], 
  [
   419491, 
   null, 
   "Bryan", 
   "A little history lesson is in order here.\n \n Here is \"Eddie Eagle\" again Eddie Eagle Safety Program:\n \n The Eagle GunSafe® Program teaches children in pre-K through third grade four important steps to take if they find a gun. These steps are presented by the program's mascot, Eddie Eagle®, in an easy-to-remember format consisting of the following simple rules:\n \n If you see a gun: STOP! Don't Touch. Leave the Area. Tell an Adult. [bold emphasis in original]\n \n In 1997 Josh Sugaman of the Violence Policy Center published his now famous article calling Eddie Eagle \"Joe Camel with feathers.\" See the press release for it here with the following clip I took from it: \n \n Public health researchers have found that \"gun safety\" programs like Eddie Eagle are ineffective in preventing unintentional death and injury from firearms. The American Academy of Pediatrics recommends that \"[b]ecause even the most well-behaved children are curious by nature and will eagerly explore their environment, the safest thing is to not keep a gun at home.\" VPC - November 97 Press Release\n \n Notably the Brady Campaign-one of Eddie Eagle's strongest critics-praised the Sugarman article when it was published. I have lost the original link, but I have another link here from 1999 when they referenced it (at FN44) \n http://www.bradycenter.org/xshare/bcen/lap/articles/city-lawsuits-review.pdf \n \n So in the 90's the BC believed the message \"If you see a gun: STOP! Don't Touch. Leave the Area. Tell an Adult\" is ineffective. \n \n And this is apparently the view once again this year with the BC, for this ineffective claim was made yet again-along with another reference to the Sugarman article-as recently as May 11 of this year by Brady Campaign President Paul Helmke (from his blog post titled \"NRA's \"Eddie Eagle\" doesn't fly or protect\"):\n \n But it would be wise to stop this misguided excuse for gun safety education in its tracks. The NRA dresses up its gun safety course in the guise of a colorful cartoon character named Eddie Eagle. Yet there is absolutely no evidence directly linking the use of the Eddie Eagle program to a decline in children's deaths by guns. In fact, a study published in 2004 by the American Academy of Pediatrics found that children could memorize Eddie's simple advice about avoiding guns, but that advice went unheeded when children were put in real-life scenarios and asked to role-play a response. Indeed, not a single child out of 11 in the Eddie Eagle program study \"used the skills in a real-life situation.\" The authors noted, \"Studies have found that when children find guns, they often play with them,\" and concluded: \"Existing programs are insufficient for teaching gun-safety skills to children.\" \n Another study published in the late 1990s by the Violence Policy Center (VPC) noted that Eddie Eagle was like \"Joe Camel with feathers,\" pointing out that: \"The primary goal of the National Rifle Association's Eddie Eagle program is not to safeguard children, but to protect the interests of the NRA and the firearms industry by making guns more acceptable to children and youth.... The hoped-for result is new customers for the industry and new members for the NRA.\"\n \n See the full article here: Eddie Eagle-- Brady Campaign Blog\n \n Notice I said \"apparently the view once again this year\"-so what happened in between at the BC? Well back in August of '09 my friend Galileo started a thread comparing Eddie Eagle to North Korean government indoctrination programs. And so I started looking at what people were saying about Eddie Eagle, and at that time I accidentally discovered a child gun safety program that the BC had started up and that it was promoting on its web site. The BC called the program \"STOP 2.\"\n \n Here is a sample of what I clipped from the program's start up web page at the BC website:\n \n \"Check out the launch of the new children and teens interactive gun prevention game! The STOP 2 program provides this virtual game that teaches and reinforces simple steps and skills to implement if children and/or teens find themselves in a situation involving a gun.\n \n The user learns to make safe, smart, healthy, life-saving decisions through five potential scenarios involving guns. The player is rewarded for making the right decisions by earning arcade tokens to play later in up to five mini-games at the arcade. The game changes each time it is played depending on the dialogue choices made by the player.\n \n Be sure to read the parent and teacher prologue to assist you in using the game as educational tool for single or group players.\"\n \n So I clicked further and read the \"parent and teacher prologue,\" where I found this:\n \n \"Teaching Moments\n Parents and teachers can use this interactive game as an opportunity to instruct and role play with children and teens, by first helping students realize that they can indeed make a choice in any situation, thus empowering them to make the safe choices to never touch a gun, to leave the area/situation immediately and tell an adult and/or authority about the presence of a gun. Teachers and parents can involve an individual or small groups to play the game, pausing to discuss the consequences of available choices and relating them to wise, safe, and healthy decisions and outcomes.\" (my bold emphasis)\n \n Then I clicked to launch the web based game, and found this on the game launch window itself:\n \n \"A Day in the Neighborhood\" is a virtual adventure game. The game will take you through real life situations involving firearms where you must make tough, and possibly life altering choices. Like real life, this game is full of choices. You will learn that the best decisions to make when a gun is in your environment is first, not to touch it; secondly, get out of the area where the gun is; and thirdly, tell an adult/authority about the gun. These skills will help you to make smart, wise, and safe choices both in the game and in real life.\" (again my bold emphasis)\n \n Now compare this with Eddie Eagle's message: \"If you see a gun: STOP! Don't Touch. Leave the Area. Tell an Adult.\"\n \n That's right, the BC's STOP 2 message is so close to Eddie Eagle's that it is a copyright infringement. \n \n But here is the rub. STOP 2 has since vanished almost without a trace. Here is where I originally posted the above information once I had found it. \n http://www.4forums.com/political/gun-control-debates/12966-chilling-resemblance-between-north-korean-indoctrination-eddie-eagle-program.html\n \n Don't bother clicking the BC link anymore. I just did and I found this instead at the BC website: \n \n \"SORRY! PAGE NOT FOUND!\n As you can see we have moved things around. We hope the new structure will make things easier to find on the site. All of the pages on the site are listed below. \n Sorry, the page you requested is not in our database. You may have followed a bad external link, or mis-typed a URL. \n For now, you may want to load our homepage (Brady Center to Prevent Gun Violence) or type your request in the search box above\"\n \n So I backed out and Googled \"Brady Campaign STOP 2\" and found an external link back to the BC website advertising STOP 2, but when I clicked the link I again found a dead end at the BC website. I then searched \"STOP 2\" on the BC website and I can find nothing. So now STOP 2-with its identical copy of Eddie Eagle's message-has vanished as completely as if Winston Smith had stepped from the pages of Orwell's \"1984\" to show Paule Helmke how to use the \"memory hole\" at the BC website to destroy information he wanted to get rid of.\n \n Now here is my point since Eddie Eagle is being brought up again....\n \n I don't know why the BC first said the Eddie Eagle message was ineffective, then spent time and money creating a web game program using the exact same message, then deleted the program and all references to it, and then went back to saying the message is ineffective again. But I do know that imitation is the sincerest form of flattery, and if the BC was honest about its ineffective claims then it would have never have created a program that used the exact same message....\n \n How can the same message be \"ineffective\" on the one hand, and yet on the other hand help kids \"make smart, wise, and safe choices...in real life\"?\n \n Anybody want to take a crack at explaining why the BC would ever have adopted the same message Eddie Eagle has offered for years?", 
   {
    "post_info": {
     "post_title": "Imitation is the sincerest form of flattery\u0085."
    }, 
    "unicode_changes_made": true
   }, 
   419479, 
   null, 
   1292871600.0
  ], 
  [
   419499, 
   null, 
   "zsu2357", 
   "Originally Posted by Bryan \n Now here is my point since Eddie Eagle is being brought up again....\n \n I don't know why the BC first said the Eddie Eagle message was ineffective, then spent time and money creating a web game program using the exact same message, then deleted the program and all references to it, and then went back to saying the message is ineffective again. But I do know that imitation is the sincerest form of flattery, and if the BC was honest about its ineffective claims then it would have never have created a program that used the exact same message....\n \n How can the same message be \"ineffective\" on the one hand, and yet on the other hand help kids \"make smart, wise, and safe choices...in real life\"?\n \n Anybody want to take a crack at explaining why the BC would ever have adopted the same message Eddie Eagle has offered for years?\n\n Election year?\n Someone threatened to cut funding?\n I'm just guessing.", 
   {
    "unicode_changes_made": true
   }, 
   419491, 
   null, 
   1292878620.0
  ], 
  [
   419543, 
   null, 
   "Tither", 
   "What this is really about is that the Antis and the Anti-gun orgs. are so ticked off that the NRA might get some positive publicity that it truly galls them! \n \n They can't live with this thought. They are ==< emoticon_mademoticon_mademoticon_mademoticon_mademoticon_mademoticon_mad\n \n They spent so much time from the 80's till now, demonizing the NRA, only to have it all leak away with the good publicity of the NRA's Eddie the Eagle program! emoticon_xangel\n \n They are ticked off! That's all! \n \n NRA = emoticon_xangel\n \n Want to Tick off an Anti some more? Say John Lott! emoticon_smile", 
   {}, 
   419499, 
   null, 
   1292942700.0
  ], 
  [
   419569, 
   null, 
   "sinjin", 
   "Drink responsibly but by all means drink.\n \n What does the NRA have for 4th graders?", 
   {}, 
   419543, 
   null, 
   1292967180.0
  ], 
  [
   419573, 
   null, 
   "NATO 556", 
   "What does the NRA have for 4th graders?\n\n \n A whole lot more than the Brady Campaign, Violence Policy Center, and numerous other anti-gun .orgs. I haven't seen a single safety message being promoted by them other than the classic \"Don't keep a gun in the house\" line that can no longer be used.\n \n They sit back and insult the Eddie Eagle program, calling it \"Joe Camel with feathers\", calling it indoctrination, calling it brainwashing, calling it advertisement to compel children to own a gun, etc. But I've never seen a single program offered, sponsored or supported by them that would suggest they have any concern for the wellbeing of children. They have nothing, they have no room to complain.", 
   {}, 
   419569, 
   null, 
   1292967960.0
  ], 
  [
   419574, 
   null, 
   "zsu2357", 
   "Drink responsibly but by all means drink.\n \n What does the NRA have for 4th graders?\n\n My child is older than the recommended age for Eddie Eagle, but I am still interested in teaching him gun safety. Does the NRA offer any programs for older children?\n If your child is only slightly older, the Eddie Eagle Program can still be worthwhile. Call 1-800-231-0752 to request a sample packet for you and your child. If your child is well above third grade, we suggest that you contact the NRA's Youth Programs Department (703-267-1505) for safety information that is more suitable for your child's age.\n The Eddie Eagle GunSafe® Program\n National Rifle Association\n 11250 Waples Mill Road \n Fairfax, VA 22030 \n (800) 231-0752\n eddie@nrahq.org\n \n \n Not sure what slightly older is,but...", 
   {}, 
   419569, 
   null, 
   1292968620.0
  ], 
  [
   419583, 
   null, 
   "Galileo", 
   "Drink responsibly but by all means drink.\n \n What does the NRA have for 4th graders?\n\n My child is older than the recommended age for Eddie Eagle, but I am still interested in teaching him gun safety. Does the NRA offer any programs for older children?\n If your child is only slightly older, the Eddie Eagle Program can still be worthwhile. Call 1-800-231-0752 to request a sample packet for you and your child. If your child is well above third grade, we suggest that you contact the NRA's Youth Programs Department (703-267-1505) for safety information that is more suitable for your child's age.\n The Eddie Eagle GunSafe® Program\n National Rifle Association\n 11250 Waples Mill Road \n Fairfax, VA 22030 \n (800) 231-0752\n eddie@nrahq.org\n \n \n Not sure what slightly older is,but...\n\n LOL, I think he was being sarcastic.", 
   {}, 
   419574, 
   null, 
   1292973660.0
  ], 
  [
   419586, 
   null, 
   "sinjin", 
   "A whole lot more than the Brady Campaign, Violence Policy Center, and numerous other anti-gun .orgs. I haven't seen a single safety message being promoted by them other than the classic \"Don't keep a gun in the house\" line that can no longer be used.\n \n They sit back and insult the Eddie Eagle program, calling it \"Joe Camel with feathers\", calling it indoctrination, calling it brainwashing, calling it advertisement to compel children to own a gun, etc. But I've never seen a single program offered, sponsored or supported by them that would suggest they have any concern for the wellbeing of children. They have nothing, they have no room to complain.\n\n \n I don't keep a gun in the house. Guess you're wrong about that line.\n \n \"Eddie the Eagle\" applies to kids up to 8 or 9 years old.\n \n The NRA also supports \"shooting sports\" opportunities for kids starting at about age 8. Coincidence?\n \n The NRA defends the right of Americans to leave loaded weapons laying around the house. But they're heroes for wanting to teach kids what to do when they encounter those same unsecured weapons left by irresponsible adults exercising the same right the NRA defends?\n \n I believe that's called \"damage control\".\n \n \"Eddie\" is never shown with a gun nor does he make appearances where guns are.\n Find out more here:\n http://www.nrahq.org/youth/\n Nevermind the kid with the gun at the top of the page.\n \n The NRA has every right to promote gun ownership and shooting sports.\n Why try to conceal your intentions with a guy in a chicken suit?\n \n I have every right to keep my kids away from their \"Gun Safety\" training.\n \n Btw how many Virginia school boards have chosen not to invite \"Eddie\" to their schools since \n VA passed a law giving the NRA a monopoly on teaching gun safety in VA elementary schools?", 
   {}, 
   419573, 
   null, 
   1292975040.0
  ], 
  [
   419596, 
   null, 
   "Tither", 
   "The NRA also supports \"shooting sports\" opportunities for kids starting at about age 8. Coincidence?\n\n Yeah. You caught them. Stop! Don't Touch! Leave the Area! Tell an Adult! \n \n That is the preferred indoctrination method for the shooting sports. \n \n So when they see the gun in a shooting sport setting, they are to STOP! Don't Touch! Leave the Area! And tell an Adult! \n \n That is how I learned to shoot! emoticon_xbouncer", 
   {}, 
   419586, 
   null, 
   1292982420.0
  ], 
  [
   419599, 
   null, 
   "NATO 556", 
   "I don't keep a gun in the house. Guess you're wrong about that line.\n\n \n Various groups can no longer offer \"don't keep a gun in the house\" as a valid argument anymore. Heller and McDonald shot that position down. You can't just tell somebody \"if you care about your children then don't exercise your constitutional rights.\"\n \n \n\"Eddie the Eagle\" applies to kids up to 8 or 9 years old.\n\n \n So what?\n \n \nThe NRA also supports \"shooting sports\" opportunities for kids starting at about age 8. Coincidence?\n\n \n Again, so what? Are you trying to make a specific point or are you simply attempting to allude to some conspiracy theory?\n \n \nThe NRA defends the right of Americans to leave loaded weapons laying around the house.\n\n \n See Heller, again.\n \n \nBut they're heroes for wanting to teach kids what to do when they encounter those same unsecured weapons left by irresponsible adults exercising the same right the NRA defends?\n\n \n I really don't see what grounds you have for calling people irresponsible in this case. The Supreme Court stated in Heller that the government has no authority nor compelling interest in regulating how we store our legally owned firearms, whether they be loaded and unlocked or otherwise.\n \n You say you don't have a gun in the house. But I'm sure you've got kitchen knives, pills, drugs, a stapler, heavy appliances with long cords, water containing devices, exposed electrical outlets, sharp pencils, toxic cleaning chemicals, toothbrushes, fluoride toothpaste, toothpicks, matches, a gas stove, etc. around the house, correct? Anybody can easily accuse you of being irresponsible if you keep these things in your house with children around, and haven't taken the proper steps to educate said children on the dangers such objects hold.\n \n \nI believe that's called \"damage control\".\n\n \n I believe that's more accurately known as education. Instead of coddling children and requiring the parents to guarantee safety at every single turn, educate the children who will be present at all times so they know first hand what to do and what not to do. Anything less is unacceptable.\n \n \n\"Eddie\" is never shown with a gun nor does he make appearances where guns are.\n\n \n Could that be because Eddie Eagle goes to various schools, which by law are \"gun free zones\"? What're you advocating, that EE break the law to spread a message?\n \n \nThe NRA has every right to promote gun ownership and shooting sports. Why try to conceal your intentions with a guy in a chicken suit?\n\n \n Because Eddie Eagle is about neither.\n \n \nI have every right to keep my kids away from their \"Gun Safety\" training.\n\n \n So you're going to keep them ignorant?\n \n \nBtw how many Virginia school boards have chosen not to invite \"Eddie\" to their schools since VA passed a law giving the NRA a monopoly on teaching gun safety in VA elementary schools?\n\n \n I don't know, you tell us.", 
   {}, 
   419586, 
   null, 
   1292984640.0
  ], 
  [
   419611, 
   null, 
   "zsu2357", 
   "LOL, I think he was being sarcastic.\n\n Originally Posted by sinjin View Post#22\n \nDrink responsibly but by all means drink.\n\n I think this is what you refer to,and if it is,how can there be any sarcasm implied?Drink,shoot, have guns(many guns),but do so responsible,as I'm sure all\n of us are.;)", 
   {}, 
   419583, 
   null, 
   1293000480.0
  ], 
  [
   419616, 
   null, 
   "Galileo", 
   "Originally Posted by sinjin View Post#22\n \n I think this is what you refer to,and if it is,how can there be any sarcasm implied?Drink,shoot, have guns(many guns),but do so responsible,as I'm sure all\n of us are.;)\n\n Not good advice for children.", 
   {}, 
   419611, 
   null, 
   1293001920.0
  ], 
  [
   419625, 
   null, 
   "COBHC", 
   "Not good advice for children.\n\n \n I turned out fine. :)", 
   {}, 
   419616, 
   null, 
   1293013440.0
  ], 
  [
   419638, 
   null, 
   "Tither", 
   "Since Sinjin has sniffed out the fact that the NRA's evil intent, I thought I would spell out their plans for America. Oh the NRA DOES have plans! Plans for our country, our soldiers, law enforcement, women, and even our children! emoticon_ic\n \n   \n Dismayed by the lack of marksmanship shown by their troops, Union veterans Col. William C. Church and Gen. George Wingate formed the National Rifle Association in 1871. The primary goal of the association would be to \"promote and encourage rifle shooting on a scientific basis,\"...\n \n Meanwhile, the NRA continued its commitment to training, education and marksmanship. During World War II, the association offered its ranges to the government, developed training materials, encouraged members to serve as plant and home guard members and developed training materials for industrial security. NRA members even reloaded ammunition for those guarding war plants. Incidentally, the NRA's call to help arm Britain in 1940 resulted in the collection of more than 7,000 firearms for Britain's defense against potential invasion by Germany (Britain had virtually disarmed itself with a series of gun control laws enacted between World War I and World War II).\n \n The NRA's interest in promoting the shooting sports among America's youth began in 1903 when NRA Secretary Albert S. Jones urged the establishment of rifle clubs at all major colleges, universities and military academies. .... Today, youth programs are still a cornerstone of the NRA, with more than one million youth participating in NRA shooting sports events and affiliated programs with groups such as 4-H, the Boy Scouts of America, the American Legion, U.S. Jaycees and others.\n \n After the war, the NRA concentrated its efforts on another much-needed arena for education and training: the hunting community. In 1949, the NRA, in conjunction with the state of New York, established the first hunter education program. Hunter Education courses are now taught by state fish and game departments across the country and Canada and have helped make hunting one of the safest sports in existence...\n \n Law enforcement training was next on the priority list for program development. Although a special police school had been reinstated at Camp Perry in 1956, NRA became the only national trainer of law enforcement officers with the introduction of its NRA Police Firearms Instructor certification program in 1960. Today, there are more than 10,000 NRA-certified police and security firearms instructors. Additionally, top law enforcement shooters compete each year in eight different pistol and shotgun matches at the National Police Shooting Championships held in Jackson, Mississippi.\n \n In civilian training, the NRA continues to be the leader in firearms education. Over 55,000 Certified Instructors now train about 750,000 gun owners a year. Courses are available in basic rifle, pistol, shotgun, muzzleloading firearms, personal protection, and even ammunition reloading. Additionally, nearly 2,800 Certified Coaches are specially trained to work with young competitive shooters. Since the establishment of the lifesaving Eddie Eagle® Gun Safety Program in 1988, more than 21 million pre-kindergarten to sixth grade children have learned that if they see a firearm in an unsupervised situation, they should \"STOP. DON'T TOUCH. LEAVE THE AREA. TELL AN ADULT.\" Over the past seven years, Refuse To Be A Victim® seminars have helped more than 15,000 men and women develop their own personal safety plan using common sense strategies.\n \n Establishing the NRA Foundation, a 501 (c) (3) tax-exempt organization, provided a means to raise millions of dollars to fund gun safety and educational projects of benefit to the general public. Contributions to the Foundation are tax-deductible and benefit a variety of American constituencies, including youths, women, hunters, competitive shooters, gun collectors, law enforcement agents and persons with physical disabilities.\n \n As former Clinton spokesman George Stephanopoulos said, \"Let me make one small vote for the NRA. They're good citizens. They call their Congressmen. They write. They vote. They contribute.\n\n   2000 Annual Meeting Transcripts  \nWithin the past five years the NRA Members have donated 20 MILLION dollars to teach gun safety to 13 million children through the Eddie the Eagle gun Safety program. \n \n Oh the Horror!", 
   {
    "unicode_changes_made": true
   }, 
   419625, 
   null, 
   1293032700.0
  ], 
  [
   419640, 
   null, 
   "Tither", 
   "  PARENTS' GUIDE TO GUN SAFETY \n The Parents' Responsibility\n \n In a home where guns are kept, the degree of safety a child has rests squarely on the child's parents.\n \n Parents who accept the responsibility to learn, practice and teach gun safety rules will ensure their child's safety to a much greater extent than those who do not. Parental responsibility does not end, however, when the child leaves the home.\n \n According to federal statistics, there are guns in approximately half of all U.S. households. Even if no one in your family owns a gun, chances are that someone you know does. Your child could come in contact with a gun at a neighbor's house, when playing with friends, or under other circumstances outside your home.\n \n It is critical for your child to know what to do if he or she encounters a firearm anywhere, and it is the parents' responsibility to provide that training.\n  Topics\n \n Talking With Your Child About Gun Safety\n Toy Guns vs. Real Guns\n What Should You Teach Your Child About Gun Safety?\n \n If you have decided that your child is not ready to be trained in a gun's handling and use, teach him or her to follow the instructions of NRA's Eddie Eagle GunSafe&#65533; Program. If you find a gun:\n \n STOP!\n \n Don't Touch.\n \n Leave the Area.\n \n Tell an Adult.\n \n Where to Get Training\n \n Gun Owners' Responsibilities\n \n Basic Gun Safety Rules\n \n Although the NRA has complete gun safety rules available for specific types of firearm use (hunting and competition, for example), the following three rules are fundamental in any situation. Whether or not you own a gun, it is important to know these rules so that you may insist that others follow them.\n \n * Always keep the gun pointed in a safe direction. Whether you are shooting or simply handling a gun, never point it at yourself or others.\n \n Common sense will tell you which direction is the safest. Outdoors, it is generally safe to point the gun toward the ground, or, if you are at a shooting range, toward the target. Indoors, be mindful of the fact that a bullet can penetrate ceilings, floors, walls, windows, and doors.\n \n * Always keep your finger off the trigger until ready to shoot. When holding a gun, rest your trigger finger outside the trigger guard alongside the gun. Until you are actually ready to fire, do not touch the trigger.\n \n * Always keep the gun unloaded until ready to use. If you do not know how to check to see if a gun is unloaded, leave it alone. Carefully secure it, being certain to point it safely and to keep your finger off the trigger, and seek competent assistance. \n\n [sarcasm on] Oh how can we live with such evil! [/sarcasm]\n \n   Firearm-Related Fatalities at Record Lows; -- Accidents Among Youths Down Significantly \n NEWTOWN, Conn.-A new report from the National Safety Council shows that accidental firearm-related fatalities remain at record lows, and accidents involving youths continue to decline significantly. \n \n The downward trends are occurring even as firearm ownership rises in the U.S.\n \n Statistics in the council's 2007 \"Injury Facts\" report show a 40 percent decrease in accidental firearm-related fatalities over a 10-year period ending in 2005.\n\n Someone must be doing something right!", 
   {
    "unicode_changes_made": true
   }, 
   419638, 
   null, 
   1293033600.0
  ], 
  [
   419647, 
   null, 
   "sinjin", 
   "Various groups can no longer offer \"don't keep a gun in the house\" as a valid argument anymore. Heller and McDonald shot that position down. You can't just tell somebody \"if you care about your children then don't exercise your constitutional rights.\"\nIt's not an argument, it's a choice. \n Anyone can give another any advice they like. \n I don't get your point.\n \n \nAgain, so what? Are you trying to make a specific point or are you simply attempting to allude to some conspiracy theory?\nNot unless you consider public relations a \"conspiracy theory\". \n Visits by \"Eddie\" are often arranged and paid for by the local \"Friends of the NRA\". \n Local people involved in shooting sports. \n \n \nI really don't see what grounds you have for calling people irresponsible in this case. The Supreme Court stated in Heller that the government has no authority nor compelling interest in regulating how we store our legally owned firearms, whether they be loaded and unlocked or otherwise.\nNot quite. CAP laws are still in effect in many states. \n \n \nYou say you don't have a gun in the house.\nNot yet anyway. My wife's recently shown some interest in a small caliber automatic. \n When I offered to shop she said better not. \n \n \nBut I'm sure you've got kitchen knives, pills, drugs, a stapler, heavy appliances with long cords, water containing devices, exposed electrical outlets, sharp pencils, toxic cleaning chemicals, toothbrushes, fluoride toothpaste, toothpicks, matches, a gas stove, etc. around the house, correct? Anybody can easily accuse you of being irresponsible if you keep these things in your house with children around, and haven't taken the proper steps to educate said children on the dangers such objects hold.\nBut I have. If you have kids and keep guns I would advise you to consider doing the same with firearms. I just don't want you telling me I have to for my kids when I don't keep guns. Why? Because people who do can't be trusted to keep them away from children? My kids might stumble on one while visiting friends? We don't have those sorts of friends and my kids are never unsupervised when in the company of people we don't know well. \n \n \nI believe that's more accurately known as education. Instead of coddling children and requiring the parents to guarantee safety at every single turn, educate the children who will be present at all times so they know first hand what to do and what not to do. Anything less is unacceptable.\nHow about making sure they're never anywhere such a thing could happen until they're old enough to know better?\n \n \nCould that be because Eddie Eagle goes to various schools, which by law are \"gun free zones\"? What're you advocating, that EE break the law to spread a message?\nI have never offered support for gun free zones. \n \n \nBecause Eddie Eagle is about neither.\nEddie is an ambassador for the NRA. No two ways about it. \n He serves to \"normalize\" the presence of firearms in the lives of the children he visits.\n Some think that a good thing or simply facing reality.\n I do not. Not at such a tender age. \n \n \nSo you're going to keep them ignorant?\nThey don't need a giant chicken to know guns can kill. \n Removing the fascination with guns from Americans young or old is nearly impossible. \n That's why Eddie's message is forgotten when kids actually find a gun as has been demonstrated. \n \n \nI don't know, you tell us.\nI'll look into it.", 
   {}, 
   419599, 
   null, 
   1293042720.0
  ], 
  [
   419649, 
   null, 
   "sinjin", 
   "Since Sinjin has sniffed out the fact that the NRA&#8217;s evil intent, I thought I would spell out their plans for America. Oh the NRA DOES have plans! Plans for our country, our soldiers, law enforcement, women, and even our children! emoticon_ic\n \n   \n   2000 Annual Meeting Transcripts  \n Oh the Horror!\nI don't think I've ever called the NRA evil. I do think that their focus on fighting any gun regulation \n because it might adversely effect the bottom line of the firearm industry makes them sell outs. \n The NRA wasn't originally about that according to your little history lesson.", 
   {}, 
   419638, 
   null, 
   1293043080.0
  ], 
  [
   419651, 
   null, 
   "Tither", 
   "I don't think I've ever called the NRA evil. I do think that their focus on fighting any gun regulation \n because it might adversely effect the bottom line of the firearm industry makes them sell outs. \n The NRA wasn't originally about that according to your little history lesson.\n\n Your correction was duly noted. I am sure you know I was being sarcastic. But just the same, Sorry.\n \n Hey Galileo, would you like to make that same statement? emoticon_smile", 
   {}, 
   419649, 
   null, 
   1293044040.0
  ], 
  [
   419654, 
   null, 
   "Tither", 
   "[sarcasm on] More indoctrination of little children of college age. That being, the same age we send people into the Army. [/sarcasm] \n \n   NSSF Grants Fuel Growth in Collegiate Target Shooting \n NEWTOWN, Conn. -- On college campuses across the country, men and women are taking up target shooting in increasing numbers. From Harvard to Jacksonville University to the University of Colorado, the shooting sports are \"in\" as students discover how they can enjoy these safe, fun activities with their friends.\n \n To encourage this growth trend, the National Shooting Sports Foundation, trade association for the firearms and shooting sports industry, last year began providing grants through its Collegiate Shooting Sports Initiative to support the development of varsity teams for those students interested in competition and create clubs for students interested in the recreational and social benefits of target shooting.\n \n \"After just one round of grants, NSSF has seen participation in target shooting grow significantly at colleges,\" said Zach Snow, NSSF's senior shooting sports coordinator. \"We're just getting started, so the sky's the limit. All it takes to form a team or club is for a dedicated coach, faculty member or student to step up and lead the way. Once that happens, participants follow.\" \n", 
   {}, 
   419651, 
   null, 
   1293044760.0
  ], 
  [
   419663, 
   null, 
   "NATO 556", 
   "It's not an argument, it's a choice. Anyone can give another any advice they like. I don't get your point.\n\n \n the point is that their offered solution boils down to \"Don't exercise your constitutional rights\" at the most extreme end of the spectrum, or \"Don't practice your rights in your own home or around your children\" as the most mild.\n \n \nNot unless you consider public relations a \"conspiracy theory\". Visits by \"Eddie\" are often arranged and paid for by the local \"Friends of the NRA\". Local people involved in shooting sports.\n\n \n So what? Sports avenues can have just as much a genuine interest in safety as any other group. I'm not seeing any anti-gun organizations putting forth money to pay for safety programs to visit schools and teach children how to be careful.\n \n \nNot quite. CAP laws are still in effect in many states.\n\n \n Such laws failed on the federal level. It won't be long before the trickle down theory brings the case to all 50 states in this post-McDonald world.\n \n \nBut I have. If you have kids and keep guns I would advise you to consider doing the same with firearms. I just don't want you telling me I have to for my kids when I don't keep guns.\n\n \n And we don't want to be told by anti-gun advocates that only their definition of \"reasonable\" and \"responsibility\" is the correct way to do things. They're out of touch with the real world and care more about precedent and politics than anything else.\n \n \nWhy? Because people who do can't be trusted to keep them away from children? My kids might stumble on one while visiting friends? We don't have those sorts of friends and my kids are never unsupervised when in the company of people we don't know well.\n\n \n What about the issue of crime guns being found on playgrounds? Do you avoid playgrounds in California?\n \n What about the fact that California is a state that produces a high demand for out of state guns to be trafficked in where they can't be found or traced? You admitted this one yourself. \n \n \nHow about making sure they're never anywhere such a thing could happen until they're old enough to know better?\n\n \n At what age do we set the standard \"old enough to know better\"? \n \n \nEddie is an ambassador for the NRA. No two ways about it. He serves to \"normalize\" the presence of firearms in the lives of the children he visits. Some think that a good thing or simply facing reality.\n\n \n It IS a good thing and it IS facing reality. Firearms are going nowhere anytime soon, and those who are against them don't seem all that focused on targeting the violent offenders that would use them for no good reason. You can't just bury your head in the sand and pretend everything is going to be alright. If you do that then they're gonna learn from the movies, and we all know how bad that practice is.\n \n \nRemoving the fascination with guns from Americans young or old is nearly impossible.\n\n \n Guns are tools, nothing more.\n \n \nThat's why Eddie's message is forgotten when kids actually find a gun as has been demonstrated.\n\n \n It hasn't been demonstrated properly. Not to the point that it's clear the message is truly forgotten and disregarded in regular circumstances, rather than in carefully orchestrated situations where the participants were coached.\n \n Seriously, we've seen news stations rig outcomes to get the desired results.", 
   {}, 
   419647, 
   null, 
   1293050460.0
  ], 
  [
   419666, 
   null, 
   "sinjin", 
   "the point is that their offered solution boils down to \"Don't exercise your constitutional rights\" at the most extreme end of the spectrum, or \"Don't practice your rights in your own home or around your children\" as the most mild.\nNo one is compelled to exercise their rights.\n \n \nSo what? Sports avenues can have just as much a genuine interest in safety as any other group. I'm not seeing any anti-gun organizations putting forth money to pay for safety programs to visit schools and teach children how to be careful.\nMaybe they've concluded such programs are ineffective and that parents know best how to protect their children. \n \n \nSuch laws failed on the federal level. It won't be long before the trickle down theory brings the case to all 50 states in this post-McDonald world.\nWe'll see.\n \n \nAnd we don't want to be told by anti-gun advocates that only their definition of \"reasonable\" and \"responsibility\" is the correct way to do things. They're out of touch with the real world and care more about precedent and politics than anything else.\nI don't know what \"real world\" you're talking about. The one where kids are accidentally shot because they weren't trained in firearms in pre-school?\n \n \nWhat about the issue of crime guns being found on playgrounds? Do you avoid playgrounds in California?\nYou've mentioned this before. Why are guns being disposed of on playgrounds? Do you have a specific incident or pattern of incidents in mind? Link? I am always with my kids when we're at the park. Never seen a handgun buried in the sandbox.\n \n \nWhat about the fact that California is a state that produces a high demand for out of state guns to be trafficked in where they can't be found or traced? You admitted this one yourself.\nAnd? There's lots of guns in CA. Always has been. I still don't want my kids to meet Eddie. \n \n \nAt what age do we set the standard \"old enough to know better\"?\nWe(society) don't. That's a parent's role. \n \n \nIt IS a good thing and it IS facing reality.\nYour reality maybe? \n \n \nFirearms are going nowhere anytime soon, and those who are against them don't seem all that focused on targeting the violent offenders that would use them for no good reason.\nAssumes facts not in evidence. Your typical diversionary tactic. \n \n \nYou can't just bury your head in the sand and pretend everything is going to be alright.\nIf you can't beat them, join them? No thanks. \n \n \nIf you do that then they're gonna learn from the movies, and we all know how bad that practice is.\nLike movies where the hero with a gun always prevails over the bad guys with guns? Heavens no.\n \n \nGuns are tools, nothing more.\nTools made specifically for killing. How much \"more\" do they need to be? \n \n \nIt hasn't been demonstrated properly. Not to the point that it's clear the message is truly forgotten and disregarded in regular circumstances, rather than in carefully orchestrated situations where the participants were coached.\n \n Seriously, we've seen news stations rig outcomes to get the desired results. \nAs if you regularly saying, \"Not good enough\" means anything.\n \n \"RESULTS: Both programs were effective for teaching children to reproduce verbally the gun-safety message. The behavioral skills training program but not the Eddie Eagle GunSafe Program was effective for teaching children to perform gun-safety skills during a supervised role play, but the skills were not used when the children were assessed via real-life (in situ) assessments.\n \n CONCLUSIONS: Existing programs are insufficient for teaching gun-safety skills to children. Programs that use active learning strategies (modeling, rehearsal, and feedback) are more effective for teaching gun-safety skills as assessed by supervised role plays but still failed to teach the children to use the skills outside the context of the training session. More research is needed to determine the most effective way to promote the use of the skills outside the training session.\"\n http://www.ncbi.nlm.nih.gov/pubmed/14702451\n \n \"Within one week, of the 11 children trained with Eddie Eagle, 5 could describe the safety skills, only 1 engaged in the safety skills in a role play, and none used the skills in a real-life situation.\"\n http://www.firearmsresearch.org/content.cfm/article_summary?article_id=3400", 
   {}, 
   419663, 
   null, 
   1293052620.0
  ], 
  [
   419785, 
   null, 
   "Doc Jones", 
   "This should be compelled before any bill is considered and will end the gun grabbers thirst for power and authority from that which was never granted to congress:\n \n \nYou did it!\n \n Gun Owners of America asked you to get behind our effort to push Congress to read the Constitution on the floor of the House and Senate.\n \n House Speaker Designate John Boehner announced that the clerk of the House of Representatives will read the Constitution aloud at the start of the new Congress.\n \"This is a great victory for all Americans who care about limited government, individual liberty and the Constitution,\" said John Velleco, GOA's Director of Federal Affairs. \"Maybe Congress is finally getting the message that the oath they take to support and defend our most important founding document is still relevant in the 21st century. Reading it is a good first step, but now we must get Congress to abide by the real contract with America.\" \n At about 4,400 words, it is one of the shortest written Constitutions in the world and will only take about an hour to read. In contrast, the ObamaCare bill weighs in at around 180,000 words and was never read at all by those voting for its passage. \n \n The overwhelming reponse to GOA's petition, found at www.readtheusconstitution.org, shows that Americans want Congress to follow the Constitution.\n \n \"We will enjoy watching Nancy Pelosi's face when the clerk reads the Constitution, since it may be the first time she's ever heard it read. And hopefully the clerk will read it nice and slowly to let the words sink in,\" said Velleco.\n There is no word yet from Senate Majority Leader Harry Reid if the Senate will follow the House's lead, so GOA is still urging people to visit the website and sign the petition.\n \n The current oath that all members of Congress take reads: \n \n \"I do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the office on which I am about to enter: So help me God.\"Please help keep the pressure on Congress to read -- and abide by -- the Constitution. If you've already signed the petition, thank you, and please urge all of your pro-gun family and friends to visit www.readtheusconstitution.org.\n \n \n --------------------------------------------------------------------------------\n \n \n Still Time to Give a GOA Gift Membership\n \n Our heartfelt thanks go to all of you who have given your family and friends a gift membership in GOA this holiday season. With just a couple of days left until Christmas, you can finish up your shopping online at: Give the gift of a GOA Membership - Gun Owners Of America\n \n You will not only be finishing up your Christmas shopping list... you'll be increasing the voice of the most active grassroots gun lobby that is constantly on the front lines defending your rights.\n \n You have already added your voice to our grassroots network... and we thank you. But now we need you to help increase our voice, so that when Congress reconvenes in January -- and we gin up grassroots activists -- they're going to feel the heat like never before.\n \n Please click here to sign up your friends and family today!\n \n \n", 
   {
    "post_info": {
     "post_title": "Compel congress to obey the Constitution:"
    }
   }, 
   419666, 
   null, 
   1293138960.0
  ], 
  [
   419787, 
   null, 
   "Doc Jones", 
   "It's not an argument, it's a choice. \n Anyone can give another any advice they like. \n I don't get your point.\n \n Not unless you consider public relations a \"conspiracy theory\". \n Visits by \"Eddie\" are often arranged and paid for by the local \"Friends of the NRA\". \n Local people involved in shooting sports. \n \n Not quite. CAP laws are still in effect in many states. \n \n Not yet anyway. My wife's recently shown some interest in a small caliber automatic. \n When I offered to shop she said better not. \n \n But I have. If you have kids and keep guns I would advise you to consider doing the same with firearms. I just don't want you telling me I have to for my kids when I don't keep guns. Why? Because people who do can't be trusted to keep them away from children? My kids might stumble on one while visiting friends? We don't have those sorts of friends and my kids are never unsupervised when in the company of people we don't know well. \n \n How about making sure they're never anywhere such a thing could happen until they're old enough to know better?\n \n I have never offered support for gun free zones. \n \n Eddie is an ambassador for the NRA. No two ways about it. \n He serves to \"normalize\" the presence of firearms in the lives of the children he visits.\n Some think that a good thing or simply facing reality.\n I do not. Not at such a tender age. \n \n They don't need a giant chicken to know guns can kill. \n Removing the fascination with guns from Americans young or old is nearly impossible. \n That's why Eddie's message is forgotten when kids actually find a gun as has been demonstrated. \n \n I'll look into it.\n\n \n Of course not, all you are interested in are your prejudices and teaching children prejudices against a Fundamental Constitutional Right.\n As an adult, if you haven't got the presence of mind and knowledge to keep your gun on you and yet can make up scenarios to instill fear in a grown person such as your wife who is surely trying to please you, what does that make you? If she and her children are murdered in your own home, will you be making a video on the evils of guns when you denied her the right to take the social and moral decision to exercise her Constitutional rights?\n The time will come someday when you will eat your words if you survive yourself.\n You could be teaching them something important, like reading the Constitution to them.", 
   {}, 
   419647, 
   null, 
   1293139560.0
  ], 
  [
   419813, 
   null, 
   "zsu2357", 
   "Originally Posted by sinjin:\n \nNot yet anyway. My wife's recently shown some interest in a small caliber automatic.\n When I offered to shop she said better not. \n\n O.K. as I gather you have no guns or gun in your house yet,and you do \n have kids if I understand correctly.\n Now you say that your wife shows some interest in a small caliber automatic.\n If she gets one(changes mind)and mentions the E.E. program, then what?:(", 
   {}, 
   419647, 
   null, 
   1293151260.0
  ], 
  [
   419824, 
   null, 
   "sinjin", 
   "Originally Posted by sinjin:\n \n O.K. as I gather you have no guns or gun in your house yet,and you do \n have kids if I understand correctly.\n Now you say that your wife shows some interest in a small caliber automatic.\n If she gets one(changes mind)and mentions the E.E. program, then what?:(\nIf we kept a gun in the house, the kids would not know about it nor would they be able to access it. \n If my wife felt the need to warn them about it, I\\'d say Eddie had nothing to offer beyond our own warnings.\n \n Personally I\\'d favor a .45 for protection right after a 12g.\n \n My wife has more shooting experience than I and dislikes large caliber handguns because of the weight and kick.\n She was just saying...\n \n I\\'ve already covered why we\\'ve opted to forego the home gun.", 
   {}, 
   419813, 
   null, 
   1293157860.0
  ], 
  [
   419830, 
   null, 
   "Brady", 
   "Various groups can no longer offer \"don\\'t keep a gun in the house\" as a valid argument anymore. Heller and McDonald shot that position down. You can\\'t just tell somebody \"if you care about your children then don\\'t exercise your constitutional rights.\"\n \n\n Its not your right to put children in danger with your guns.", 
   {}, 
   419599, 
   null, 
   1293162960.0
  ], 
  [
   419837, 
   null, 
   "Brady", 
   "\n I really don\\'t see what grounds you have for calling people irresponsible in this case. The Supreme Court stated in Heller that the government has no authority nor compelling interest in regulating how we store our legally owned firearms, whether they be loaded and unlocked or otherwise.\n \n\n Supreme Court Justice Ruth Bader Ginsburg said Friday that as a justice she considers foreign laws - not just U.S. laws and its Constitution - in forming her legal opinions.\n Justice Ginsburg: Supreme Court Considers Foreign Laws, Not Just Constitution\n \n So what the second amendment says is not the only important thing. What do laws in other countries say about this matter?", 
   {
    "unicode_changes_made": true
   }, 
   419599, 
   null, 
   1293164280.0
  ], 
  [
   419839, 
   null, 
   "NATO 556", 
   "Its not your right to put children in danger with your guns.\n\n \n Children are at more danger of drowning in swimming pools and bath tubs than they are of accidentally getting shot, either through discovery of a loaded firearm, or being the victim of gang warfare. Look up the statistics of child deaths, you'll see that getting shot is quite low on the list.\n \n Despite your best attempts at emotional rhetoric, you've never been able to provide clear scientific evidence that owning a gun puts anyone in danger, children or otherwise. The only one who's genuinely in danger when it comes to gun ownership is whatever criminal seeks to make you a victim.", 
   {}, 
   419830, 
   null, 
   1293167160.0
  ], 
  [
   419840, 
   null, 
   "NATO 556", 
   "Supreme Court Justice Ruth Bader Ginsburg said Friday that as a justice she considers foreign laws - not just U.S. laws and its Constitution - in forming her legal opinions.\n Justice Ginsburg: Supreme Court Considers Foreign Laws, Not Just Constitution\n \n So what the second amendment says is not the only important thing. What do laws in other countries say about this matter?\n\n \n Well first and foremost, Ginsburg was a dissenting judge in the Heller case, so her opinion carries absolutely no legal weight. It doesn't matter what she says, she wasn't a part of the majority so her opinions are moot. So her citing of international law is irrelevant.\n \n Secondly, Ginsburg seems to be out of touch with the rules established by the Supreme Court previous. In the landmark case, Reid v Covert, the Supreme Court ruled, by a 7 to 2 majority, that the US Constitution supersedes ALL foreign treaties that the US might ratify. So it really doesn't matter what we might sign onto, if the treaty interferes with US law then it becomes moot and we're not bound to it either one way or the other. So Ginsburg is in the wrong on two counts.\n \n Thirdly, other countries have low to nonexistent standards of operation when it comes to human and civil rights. Many other nations are ruled by dictators and warlords who have no problem with murdering their own people solely for political or religious dissident. So you might not want to point to international standards when it comes to waging your war against the US Constitution, because you'll just end up looking foolish.\n \n We play by home rule standards in this matter. What other countries have to say has no bearing on us. They don't like how we operate then that's just too bad for them, because nobody asked them.", 
   {
    "unicode_changes_made": true
   }, 
   419837, 
   null, 
   1293167640.0
  ], 
  [
   419845, 
   null, 
   "Bryan", 
   "Children are at more danger of drowning in swimming pools and bath tubs than they are of accidentally getting shot, either through discovery of a loaded firearm, or being the victim of gang warfare. Look up the statistics of child deaths, you'll see that getting shot is quite low on the list.\n \n Despite your best attempts at emotional rhetoric, you've never been able to provide clear scientific evidence that owning a gun puts anyone in danger, children or otherwise. The only one who's genuinely in danger when it comes to gun ownership is whatever criminal seeks to make you a victim.\n\n \n Wait NATO, that's not all Brady said. Here is his full reply to you....\n \n \n\n Its not your right to put children in danger with your guns. People like you probably shouldnt be allowed around children. Maybe Marx really was right when he said all children should be raised by the govt. \n\n \n He edited it down to just the first sentence here....\n \n \n \"Last edited by Brady; Today at 09:54 PM.\" \n \n\n \n Yeah Brady, I caught it and copied it BEFORE you decided it was not a good idea to say gun owners shouldn't be allowed to have children. You were a little too slow on the edit....\n \n But listen, if you are deciding to go back through your posts and delete things because you now realize \"that was a darned foolish thing to say\" then I can offer you several more suggestions for other edits....\n \n If you are ready to set aside your preference for the government taking away all my firearms and both of my children then say so and we will discuss things rationally. But I fail to see how we can have an honest debate until you decide you can be honest with yourself. \n \n \n\n Supreme Court Justice Ruth Bader Ginsburg said Friday that as a justice she considers foreign laws - not just U.S. laws and its Constitution - in forming her legal opinions.\n Justice Ginsburg: Supreme Court Considers Foreign Laws, Not Just Constitution\n \n So what the second amendment says is not the only important thing. What do laws in other countries say about this matter? \n\n \n If you want to have a discussion over the wisdom of using the customs and laws of other nations in interpreting our Bill of Rights, then let's have it. If you are serious in wanting an answer to your question then let's talk about it. Of course, it would require you to stick around and not run away this time....\n \n I'm ready to take up your topic, Brady. Are you?", 
   {
    "post_info": {
     "post_title": "Brady taking back things he wished he had not said"
    }, 
    "unicode_changes_made": true
   }, 
   419839, 
   null, 
   1293168600.0
  ], 
  [
   419846, 
   null, 
   "Brady", 
   "Well first and foremost, Ginsburg was a dissenting judge in the Heller case, so her opinion carries absolutely no legal weight. It doesn't matter what she says, she wasn't a part of the majority so her opinions are moot. So her citing of international law is irrelevant.\n \n Secondly, Ginsburg seems to be out of touch with the rules established by the Supreme Court previous. In the landmark case, Reid v Covert, the Supreme Court ruled, by a 7 to 2 majority, that the US Constitution supersedes ALL foreign treaties that the US might ratify. So it really doesn't matter what we might sign onto, if the treaty interferes with US law then it becomes moot and we're not bound to it either one way or the other. So Ginsburg is in the wrong on two counts.\n \n Thirdly, other countries have low to nonexistent standards of operation when it comes to human and civil rights. Many other nations are ruled by dictators and warlords who have no problem with murdering their own people solely for political or religious dissident. So you might not want to point to international standards when it comes to waging your war against the US Constitution, because you'll just end up looking foolish.\n \n We play by home rule standards in this matter. What other countries have to say has no bearing on us. They don't like how we operate then that's just too bad for them, because nobody asked them.\n\n Ginsburg isnt the only one. Your outnumbered and dont keep up on how the courts interpret laws. This isnt 200 years ago and international laws and relations are more important now. \n \n Solicitor General Elena Kagan's nomination to the Supreme Court should founder unless she adequately explains why she quite literally put \"International/ Comparative Law\" ahead of the U.S. Constitution. \n EDITORIAL: Kagan&#39;s Foreign law trumps con-law - Washington Times", 
   {}, 
   419840, 
   null, 
   1293168660.0
  ], 
  [
   419848, 
   null, 
   "NATO 556", 
   "Ginsburg isnt the only one. Your outnumbered and dont keep up on how the courts interpret laws. This isnt 200 years ago and international laws and relations are more important now.\n\n \n Perhaps you'd care to supply a list of which Supreme Court justices have allowed international law to guide their decisions, rather than the Constitution. Along with a list of court rulings that support international law standards rather than home rule standards.\n \n You keep on talking about a lot of stuff, but when it's all boiled down you're really saying nothing but nonsense.\n \n We haven't allowed international law standards to violate our constitutional rights when it comes to privacy, religion, redress of the government, search warrants, public assembly or other standards. The standards by which countries like Britain, Germany, France and Australia, aren't shared by America. We march to our own beat until you can conclusively prove otherwise. So get to cracking.", 
   {}, 
   419846, 
   null, 
   1293169680.0
  ], 
  [
   419851, 
   null, 
   "Bryan", 
   "Actually, Ginsberg is not the only SCOTUS justice who wishes to sample international law in their rulings. It is a tactic that is used when the laws and customs of the United States are not favored by the particular justice, and the justice decides to look elsewhere for support....\n \n Here is the problem with relying on the laws of other nations, Brady. It is a dictatorial and un-democratic method of deciding our fate. Oh now you will say hold on Bryan-England , for example, is a democratic nation. Why not consider English Law? Here's why....\n \n The legislators of this nation are not elected by me or anyone else in the United States. They owe no allegiance to my wishes. I cannot express my feelings for their actions by voting for or against them. They are under a duty to consider what it best for the people of their nation in its unique circumstances. They have no duty to consider how their laws will impact me or my nation. They have no duty to respect the limits on legislative power set forth in my Constitution when they pass their laws. \n \n In fact, Brady, the members of the English Parliament of 2010 are as totally beyond my control and influence as the English Parliament of 1776 was of Thomas Jefferson's. And yet you believe we should cede control of how our Constitution is to be interpreted to their whims? As Jefferson said in the Continental Congress' Declaration of the Causes and Necessity of Taking Up Arms:\n \n \"What is to defend us against so enormous, so unlimited a power? Not a single man of those who assume it, is chosen by us; or is subject to our control or influence....\"\n \n Oh you may say but it is only a SCOTUS justice applying the international law. Do you really believe that the filter of a SCOTUS justice will offer us any protection-a man or woman awarded their position for life and who does not owe their position to my agreement or disagreement with their votes? Someone like Sotomayor, for example, who promises one thing during the climb to the bench only to say she lied and did not really believe what she said once she got there?\n \n Brady, I have a hard enough time getting the legislators I am able to vote for to respect my rights. Forgive me if I decline to accept your invitation to surrender control over my Constitutional rights to the legislators of other nations.", 
   {
    "post_info": {
     "post_title": "The problem with using international law to interpret the U.S. Constitution"
    }, 
    "unicode_changes_made": true
   }, 
   419848, 
   null, 
   1293174600.0
  ], 
  [
   419854, 
   null, 
   "Tither", 
   "Exactly. The U.S. Constitution is the Supreme Law of this Land! It is OUR binding Contract! \n \n Can Canada enforce our Bill of Rights on their citizens, just because they want to? How about if England or Australia has to use our Gun Laws instead of theirs? That OK with you guys? \n \n On what level is that even remotely correct? \n \n Otherwise, where does it stop? The previous laws of Nazi Germany? The old laws of Communist USSR! How about the rule of Genghis Kan, and or, any other dictates of despots? \n \n I am really getting tired of Slime Balls using ANY trumped up excuse they can find to deny parts of our Binding Contract, just because they don't like it. How about we follow their examples. If we don't like a law, can we find laws that we like, from a different country, and tell the cops and the courts that we were just obeying those? What do you think they would tell us? Oh, geesh. I am sorry. We didn't know. Or would they correctly slap us in jail? \n \n No one asked Ginsburg, Sotomayor or Kagan, if it was OK by their standard, if we could put amendments one through ten into our Bill of Rights! In fact, it is not up to them in any way! They are to be servants to OUR Constitution! Nothing else is acceptable! How about the laws of Saddam Husein? You want to pony up to those? \n \n They, like us, are expected to obey the laws of OUR land, and obey the U.S. Constitution. It is the Supreme Law of the Land! I expect, no expect in not strong enough, I DEMAND that everyone Obey the Flippen Laws! Otherwise we have anarchy! \n \n There are laws I don't like. But I obey them because it is my duty as a citizen, and I owe it to you, my fellow citizens, to do so, out of much respect for you! I DEMAND that people who work for us do the same! \n \n Where is that even remotely wrong?\n \n If you want to obey the laws of some other country, move there! No?", 
   {}, 
   419851, 
   null, 
   1293193920.0
  ], 
  [
   419912, 
   null, 
   "zsu2357", 
   "Its not your right to put children in danger with your guns.\n\n But were not,however from the sound of it sinj. would just by keeping it a secret until maybe it was found(locked up or not s**t happens).That is why it might be best to educate them before hand,be it E.E. or done personally or both.emoticon_idea", 
   {}, 
   419830, 
   null, 
   1293249960.0
  ], 
  [
   419914, 
   null, 
   "zsu2357", 
   "=Brady;419837]Supreme Court Justice Ruth Bader Ginsburg said Friday that as a justice she considers foreign laws - not just U.S. laws and its Constitution - in forming her legal opinions.\n\n Perhaps she should concentrate more on ths U.S. Constitution. \n Justice Ginsburg: Supreme Court Considers Foreign Laws, Not Just Constitution\n \nSo what the second amendment says is not the only important thing. What do laws in other countries say about this matter?\n\n Such as the U.K.?Their lawmakers no doubt think were crazy,but how about their people at large?", 
   {
    "unicode_changes_made": true
   }, 
   419837, 
   null, 
   1293251400.0
  ], 
  [
   420127, 
   null, 
   "sinjin", 
   "But were not,however from the sound of it sinj. would just by keeping it a secret until maybe it was found(locked up or not s**t happens). That is why it might be best to educate them before hand,be it E.E. or done personally or both.emoticon_idea \nYou're entitled to disagree with me. I get to decide when it comes to my kids. Do you disagree with that too?", 
   {}, 
   419912, 
   null, 
   1293475620.0
  ], 
  [
   420131, 
   null, 
   "NATO 556", 
   "You're entitled to disagree with me. I get to decide when it comes to my kids. Do you disagree with that too?\n\n \n Well judging by the way states handle matters related to children and what they consider abuse, then yes I'd disagree and say you don't get to decide. Parental rights are getting a lot easier to sever than they used to be.", 
   {}, 
   420127, 
   null, 
   1293480840.0
  ], 
  [
   420133, 
   null, 
   "sinjin", 
   "Well judging by the way states handle matters related to children and what they consider abuse, then yes I'd disagree and say you don't get to decide. Parental rights are getting a lot easier to sever than they used to be.\nGood luck showing how failure to teach kids about guns amounts to abuse.", 
   {}, 
   420131, 
   null, 
   1293481800.0
  ], 
  [
   420136, 
   null, 
   "jim's trucking", 
   "Good luck showing how failure to teach kids about guns amounts to abuse.\n\n \n Peoples that do not bear weapons are destined to be overcome by peoples that do. That is the way of human existence...has been ever since we discovered how to kill and maim with rocks and sticks.", 
   {}, 
   420133, 
   null, 
   1293483900.0
  ], 
  [
   420180, 
   null, 
   "sinjin", 
   "Peoples that do not bear weapons are destined to be overcome by peoples that do. That is the way of human existence...has been ever since we discovered how to kill and maim with rocks and sticks.\nA lesson that can wait as far as my kids are concerned. They're 7 and 4.\n \n Nice to \"see\" you JT. \n Happy Holidays.", 
   {}, 
   420136, 
   null, 
   1293491100.0
  ], 
  [
   420215, 
   null, 
   "Tither", 
   "You're entitled to disagree with me. I get to decide when it comes to my kids. Do you disagree with that too?\n\n My feeling is that, this is your prerogative. \n \n However, what would you do if Eddie the Eagle were mandated by your schools? Kind of like Sex Ed.", 
   {}, 
   420127, 
   null, 
   1293498420.0
  ], 
  [
   420216, 
   null, 
   "Tither", 
   "From our founding era.\n \n   Journals of the Continental Congress - Petition to the King; July 8, 1775 \n Yet conclude not from this that we propose to surrender our Property into the Hands of your Ministry, or vest your Parliament with a Power which may terminate in our Destruction. The great Bulwarks of our Constitution we have desired to maintain by every temperate, by every peaceable Means; but your Ministers (equal Foes to British and American freedom) have added to their former Oppressions an Attempt to reduce us by the Sword to a base and abject submission. On the Sword, therefore, we are compelled to rely for Protection. Should Victory declare in your Favour, yet Men trained to Arms from their Infancy, and animated by the Love of Liberty, will afford neither a cheap or easy Conquest. Of this at least we are assured, that our Struggle will be glorious, our Success certain; since even in Death we shall find that Freedom which in Life you forbid us to enjoy.\n", 
   {}, 
   420215, 
   null, 
   1293499140.0
  ], 
  [
   420219, 
   null, 
   "daewoo", 
   "A lesson that can wait as far as my kids are concerned. They're 7 and 4.\n \n Nice to \"see\" you JT. \n Happy Holidays.\n\n \n Mine fall in about that age range as well and while I certainly support the right to make the decision, I hope you dont have guns in your house if that is the decision you have made for them. \n \n If they are old enough to accidentally shoot themselves, they are old enough for you to have taught them not to. Part of that is making them familiar enough with the weapon that it holds no mysteries for them.", 
   {}, 
   420180, 
   null, 
   1293501420.0
  ], 
  [
   420311, 
   null, 
   "sinjin", 
   "Mine fall in about that age range as well and while I certainly support the right to make the decision, I hope you dont have guns in your house if that is the decision you have made for them.\nI do not have any presently. Even if I did I would not consider familiarizing the kids with their operation as the best way to prevent accidents. I don't leave vodka in the water pitcher either. \n \n \nIf they are old enough to accidentally shoot themselves, they are old enough for you to have taught them not to. Part of that is making them familiar enough with the weapon that it holds no mysteries for them.\nIf firearms hung on the walls of my home I'd probably agree. When and if one of my children takes an interest in hunting or target shooting I'd be happy to oblige. Home security duties requiring firearm training will not be on their chore lists.", 
   {}, 
   420219, 
   null, 
   1293564000.0
  ], 
  [
   420315, 
   null, 
   "daewoo", 
   "I do not have any presently. Even if I did I would not consider familiarizing the kids with their operation as the best way to prevent accidents. I don't leave vodka in the water pitcher either. \n \n If firearms hung on the walls of my home I'd probably agree. When and if one of my children takes an interest in hunting or target shooting I'd be happy to oblige. Home security duties requiring firearm training will not be on their chore lists.\n\n \n IF it is going to be in the house, they need to be taught what it is, where it is, why they should not touch it, and what NOT to do if they come across it (or another). \n \n There is a big difference in the number of accidental shootings between urban and rural households when it comes to kids. City kids accidentally get blown away by themselves or a friend with startling regularity. It is virtually unheard of in rural household, despite a much higher rate of gun ownership. \n \n I can tell you from having lived both places, it is a question of familiarity. When I was a kid, Dad had a shotgun. He had never shot it, it was my grandfathers and it lived in the back of a closet. I had that thing out and was playing with it every time mom and dad were gone. They did not even know that I knew where it was. I shudder to think what stupid things might have happened if there was ammo around for it anywhere. \n \n Kids in rural homes grow up around guns. My kids don't find mine particularly interesting. They know what they are, know where they are, and don't really care. They also know what NOT to do with them and why. If they want to see or handle one, they know that is fine, they just need to let me know and I will get it out for them.\n \n Securing an item against somebody who lives in your house and has all the time in the world to find/access it is not realistic. If they are old enough to accidentally shoot themselves, they are old enough they should have been taught NOT TO. When kids get shot playing with weapons, it is the parents fault because the kid should have been taught better.", 
   {}, 
   420311, 
   null, 
   1293567840.0
  ], 
  [
   420351, 
   null, 
   "zsu2357", 
   "You're entitled to disagree with me. I get to decide when it comes to my kids. Do you disagree with that too?\n\n Your right of course,didn't mean to stick my nose in your business.\n In the advent, hope things turn out.:)", 
   {}, 
   420127, 
   null, 
   1293580140.0
  ], 
  [
   420353, 
   null, 
   "NATO 556", 
   "Just make sure you don't invest too much trust in a mechanical device when expecting it to act as a safeguard against tampering. Over reliance on a machine can be a serious safety issue.", 
   {}, 
   420216, 
   null, 
   1293580860.0
  ], 
  [
   420356, 
   null, 
   "zsu2357", 
   "=sinjin;420311]I do not have any presently. Even if I did I would not consider familiarizing the kids with their operation as the best way to prevent accidents. I don't leave vodka in the water pitcher either. \n\n Even if you did, your call your right...But consider this,when your kids were just learning to walk and grab things, did you and your wife keep pan handles turned inward where they couldn't be grabbed?or any host of things that would injure them or worse.\n You must have familiarized them to a point,accidents do happen and I guess \n it is my right to say something.\n After all my kids have been around guns most of their lives,and grew up to tell about,and in the advent you do get one TEACH them,don't hide it from them.:)\n \nIf firearms hung on the walls of my home I'd probably agree. When and if one of my children takes an interest in hunting or target shooting I'd be happy to oblige. Home security duties requiring firearm training will not be on their chore lists.\n\n Home security 7&4 I hope not.However firearm training shouldn't be looked at\n as a chore.:)", 
   {}, 
   420311, 
   null, 
   1293582420.0
  ], 
  [
   420477, 
   null, 
   "jim's trucking", 
   "A lesson that can wait as far as my kids are concerned. They're 7 and 4.\n \n Nice to \"see\" you JT. \n Happy Holidays.\n\n He who hesitates is lost. Early bird gets the worm. Might makes right. Never take a knife to a gunfight. Those that enforce their own rules generally have weapons to force compliance on those that they have disarmed.\n \n To voluntarily disarm yourself and your family is to expose them to the dangers of those that carry arms.\n \n I think that infants should be taught swim before the understand the meaning of the word. Likewise, familiarity with weapons is crucial to long term survival in this world.\n \n Happy New Year to you and your lovely family!", 
   {}, 
   420180, 
   null, 
   1293666960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gun safety education for students?", 
  "url": "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14795, 
  "discussion_files": [
   [
    "14737.html", 
    "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students-print.html"
   ], 
   [
    "14738.html", 
    "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students-5-print.html"
   ], 
   [
    "14739.html", 
    "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students-4-print.html"
   ], 
   [
    "14740.html", 
    "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students-3-print.html"
   ], 
   [
    "14741.html", 
    "http://www.4forums.com/political/gun-control-debates/14795-gun-safety-education-students-2-print.html"
   ]
  ], 
  "identifier": 14795
 }
]