[
 [
  [
   28932, 
   null, 
   "Compladix", 
   "Although world doesn't recognise a country like Turkish Republic of Northern Cyprus except Turkey, but as a \"pseudostate\" with lands under occupation.. It is not true and I am very pleased to live under Turkish flag on my homelands here in Northern Cyprus. And NO ONE is AUTHORIZED to decide on \"Annan Plan\" is suitable or not.. If Europe is democratic, then she has to respect the socialism! I am a Turkish Cypriot and I object to live under a \"united Cyprus\",a Greek-governed state in disguise! \n I am yelling for my rights! And I will never let my lands become Greek... \n \n What you might get curious why we refuse to join EU along with Southern Cyprus is what is below: \n \n OBSERVATIONS BY FOREIGNERS \n \n \n The Mathiati Massacre \n \n The brutality in Mathiati village of Nicosia where 208 Turks lived was expressed as below by Gibbons: \n \n \"(...) three Turks were seriously injured at the first minutes. When Turks burst out of their white, small houses into the streets, the screaming and cursing crowd began to push and kick them along the way. The terrified Turks who fell down on the floor as a result of riffle butt strikes were dragged across the streets while the crowd stormed into houses, pulled burning logs out of the furnaces and set curtains and beds on fire. The old wooden roof beams were surrounded by smoke and then flames. Barefoot women mostly in nightgowns were also pushed here and there on the burning streets, either holding tight their terrified little babies or with their toddlers catching the ends of their nightgowns or trousers and following them together with others dragging their injured away. \n \n Greek youngsters host at the houses hysterically and yelled madly with hoarse voices. Before the flames completely covered the houses, they materialized into the houses, broken things and grabbing valuable goods. The wild sounds coming from the back of the houses attracted he attention of the assailants to the animals of Turks. They stomped into the barns and raked cows, sheep and goats with machine guns. They threw the chickens into the air and shot them while they desperately cackled and struggled. Their bodies broke into pieces and feathers covered everywhere. \n \n The crowd screamed and yelled in a bloodthirsty manner. Turks were dragged through the frozen streets out of the village. They were left in pain around Kochatis, another Turkish village. The Kochatis villagers hurried out of their houses to help their neighbors while the crowd headed back to Mathiati to continue the plunder and all the madness\". (H. Scott Gibbons, Peace Without Honor, Ankara, 1969, p. 31). \n \n Ayvas&#305;l Massacre \n \n Gibbons observations on the Ayvas&#305;l (Ayios Vasilios) village massacre quotes as follows: \n \n \"Weapon sounds were heard. They broke locked doors with rifle butts and dragged people onto the streets. A 70 year-old Turk awoke to the sound of its broken front door. He teetered out of his bedroom before he was asked if he had any children by many youngsters with arms. Dumbfounded, he pronounced \"Yes\". \"Send them out\" they ordered. Tow sons of his, 19 and 17, and her only daughter, 10 got dressed hurriedly and followed the armed men out. \n \n They were lined up near the farm fence and shot dead with machine guns by those armed men. In another house, they found a 13 year-old boy, tied his hands at his back, knelt him down. They plundered the house, kicked and raped the boy and shot him at the head. \n \n That night, 12 Turks were slaughtered in Ayios Vasilios. Others were gathered and pushed out of the village to take refuge in Turks in Skylloura. Barefooted, with their pajamas and nightgowns on, they teetered to proceed in the cold. The Greek cypriots fired at them in the dark. \n \n The armed men headed for the Turkish houses. They plundered and destroyed the houses and when they got exhausted, they set the houses on fire. Nine more Turks that lived in the surrounding farmhouses were killed in the same region\". (H. Scott Gibbons, Peace Without Honor, p. 73). \n \n The Kumsal Massacre \n \n Gibbons wrote as follows about the Kumsal massacre: \n \n \"Armed men broke the doors and stormed into Turkish houses, kicking, beating, punching and cursing at them. The retreat from Kumsal began. Once more, dazed and appalled families that resembled those facing debacle in Europe by Nazi attacks were on cold streets rifles burst and machine guns raffled. \n \n They were slipping and falling down. They began to run away, seeking support from one another. The screams of a woman echoed on the street, who squealed \"Is not there anyone to help, Gor God's sake?\" \n \n 159 inhabitants of Kumsal Turks could not make it to run away that night. Four people in the bathroom were killed apart from the landlady and four other people. 150 people were taken hostage. No one ever saw some of the hostages again. (H. Scott Gibbons, Peace Without Honor, p. 74). \n \n Observations by an Italian Journalist \n \n In January 1964, an Italian journalist in Cyprus made the following observations: \n \n \"Right now, we are witnessing the migration of Turks from their villages. The Greek cypriot Terror is ruthless; thousands of people are leaving their houses, lands and flocks. The Hellenistic claims and Plateau can not conceal these savage and barbarous behaviors. Curfew starts in Turkish villages everyday at 16:00 p.m. As soon as darkness falls, threats, weapon sounds and attempts of arson begin. Any resistance seems impossible after the Christmas slaughter which spared neither women nor kids (Giorgio Bocca, &#304;l Giorno, 14 January 1964). \n \n Observations by an American Journalist \n \n Time Journalist Robert Ball wrote the following about the incidents in Ayios Sozomenos village of Nicosia: \n \n \"The most severe clash took place at the western side of the village on which Greek cypriots had attacked by taking advantage of the dense round olive trees. The window of an adobe house which sheltered 9 Turks was blown up with a bazooka shell and its second floor was riddled because of bullet holes. \n \n A Turkish shepherd who desperately raced to the river bed to escape was shot a few steps away from the door. Another tried to attack the Greeks pointlessly with a pitchfork in his hand and was killed immediately\". (Robert Ball, Time, 14 February 1964). \n \n Observations by an British Journalist \n \n \"After Cyprus was occupied, hundreds of Cypriot Turks were taken hostage by National Guardsmen, Turkish women were raped, kids were killed on the streets and Turkish quarters in Limasol were totally burned down\". (David Leigh, The Times, London, 23 July 1974). \n \n Observations by a German Tourist \n \n \"Human mind can not comprehend the barbarism of Greeks... Greek National Guardsmen represented extraordinary examples of brutality. They broke into Turkish houses; they ruthlessly shot women and children; cut the throats of many Turks and gathered and raped Turkish women... (Germany's Voice, 30 July 1974). \n \n \n \n Quotes from Crushed Flowers \n \n \"Greek cypriots behaved barbarously in the 20th Century and exercised massacres. They not only slaughtered Turks in a bloodthirsty manner but also buried them half alive. Many corpses in this mass grave unfolds the Greek brutality to the people of the world. The corpses disentombed out of the mass graves were evident of how vile Greeks were and the feudal laws that had been applied by them for years...\" (James Rayner, Crushed Flowers, Nicosia, 1982, p. 25). \n \n \n \n 1912 - FIRST MASSACRE \n \n \n The Ottoman Empire was attacked by Balkan countries without having managed to cure the wounds of war against Italy and was not in a situation to deal with Cyprus. Considering this an opportunity, the Greek cypriots hoped that the progress of the Balkan armies would allow them to achieve ENOSIS and resorted to new provocations on 12 May. They happily celebrated the Ottoman retreat and offended Turks on one hand and aggravated their ENOSIS acts on the other. \n \n In late May, they attacked Turks in Hamit Dairies (today's Hamitköy) shouting the slogans \"ENOSIS and Viva Greece\". Bodamyal&#305;zade Mehmet &#350;evket Bey, telling about the attacks by the Greek cypriots in Vatan Newspaper dated 27 May 1912, wrote that \"the attacks were incited by Greek provocateurs in Cyprus\". \n \n Sir George Hill and Söz newspaper wrote that the events started because Greek cypriots mocked Turks due to the defeat at Tripoli war. \n \n The Vatan newspaper dated 3 June 1912 and Numbered 35 stated that Greek cypriots, incited by Greek provocateurs, attacked with stones, bottles and every sort of weapons in Leymosun Fair and that a crowd of 5-6 thousand people plundered Turkish quarters and destroyed houses, shops and religious places, yelling \"Viva Greece, Viva Annexation\". The paper further said that Turkish inhabitants in various places were beaten, harassed and cursed. \n \n The 1912 events during which 4 people were killed and over 100 wounded were the first bloody attacks on Turks by Greek cypriots. The events represent peculiar significance in the history of Cyprus as they were the first mass clashes resulting in casualties. \n \n In the aftermath of the attacks, a widespread \"Greeks for Greeks\" campaign was started, as a result of which Turkish shops and goods were boycotted and unbearable pressures were coerced on the Turkish public in order to collapse them in economic terms. \n \n At that time, the ENOSIS committees led by the Cypriot-Greek Church held \"annexation\" visits to many European countries including especially Britain while hundreds of ENOSIS telegrams were sent to Britain from Cyprus.", 
   {
    "post_info": {
     "post_title": "There is a Turkish population in Cyprus and I do not want a Greek mandate in my lands"
    }
   }, 
   null, 
   null, 
   1072215660.0
  ], 
  [
   28968, 
   null, 
   "Broker", 
   "It's too bad that the population is 85% Greek. How is it fair to have 15% of the population have a massive stake in the government? Your're lucky to have such large pieces of the government assured to you... 24 seats out of 90 in the House and the Vice presidency, all reserved for the Turkish Cypriots.\n \n That ethnic violence was 40 years ago. The majority of people want a unified state and the majority of people would just like to live together in peace. \n \n There is ethnic violence in every country... so don't bother pointing to your violence reports (none of which were in the last 15 years).", 
   {}, 
   28932, 
   null, 
   1072239660.0
  ], 
  [
   29033, 
   null, 
   "Parcum", 
   "Cyprus historically and traditionally is Greek. It was only because of the Ottomans that any Turks lived on the Island. Today, the overwealming majority of the population is Greek. Long live a united, Greek, Cyprus!", 
   {}, 
   28968, 
   null, 
   1072310940.0
  ], 
  [
   29827, 
   null, 
   "plotter", 
   "Are you denktash in disguise?\n \n Shame you have no idea about the real history of Cyprus, because if you did, you would keep your mouth shut and beg the greeks to allow you to stay in a greek Cyprus and not send you back to your proper home turkey.\n \n Turkish cypriots are either turks which settled there during the ottoman time, or were greeks who changed there religion, (usually by force). \n \n So face it, the chances are your family are either turks from turkey or greeks who were forced to become turks, so either way theres no such thing as a real turkish cypriot.", 
   {
    "post_info": {
     "post_title": "Oh dear"
    }
   }, 
   29033, 
   null, 
   1073065500.0
  ], 
  [
   29831, 
   null, 
   "Parcum", 
   "or were greeks who changed there religion, (usually by force). \n\n \n ALWAYS by force. What, do you think they came up ot the Greeks and say \"Yo, you wanna convert to Islam?\", the Greeks would say \"No, go away\", and Ottoman Turks would respond with 'Oh okay, just wondering *smile*'\n \n The Ottoman Turks converted the Greeks by rampaging villages, taking the male children from the families, killing or enslaving the rest, and brainwashing the children into believing Islam and forcing them into battle. They were known as Janniserries.", 
   {}, 
   29827, 
   null, 
   1073072340.0
  ], 
  [
   29881, 
   null, 
   "plotter", 
   "Thank you Parcum,\n \n I think you know where im coming from?\n \n Of course i meant by force, but i thought i put it in a nice way.", 
   {
    "post_info": {
     "post_title": "Point understood"
    }
   }, 
   29831, 
   null, 
   1073102580.0
  ], 
  [
   29977, 
   null, 
   "montalban", 
   "Although world doesn't recognise a country like Turkish Republic of Northern Cyprus except Turkey, but as a \"pseudostate\" with lands under occupation.. It is not true and I am very pleased to live under Turkish flag on my homelands here in Northern Cyprus. And NO ONE is AUTHORIZED to decide on \"Annan Plan\" is suitable or not.. If Europe is democratic, then she has to respect the socialism! I am a Turkish Cypriot and I object to live under a \"united Cyprus\",a Greek-governed state in disguise! \n I am yelling for my rights! And I will never let my lands become Greek... \n \n At that time, the ENOSIS committees led by the Cypriot-Greek Church held \"annexation\" visits to many European countries including especially Britain while hundreds of ENOSIS telegrams were sent to Britain from Cyprus.\n\n \n Your Cypriot lands were Greek.\n \n You contradict yourself. You say you are happy about living under the flag of Turkey, but you're pro-Republic of Northern Cyprus - which according to Turkey is another nation. You either need to become full-blown Turkish, or completley pro-this puppet state. Which is it?\n \n And your laughable cries of injustice re: massacres. Recall what you guys did to the Armenians in 1919. You ganged up with the Kurds against the Armenians, promising the Kurds their own state. Once you'd wiped out millions of Christian Amernians, you turned on co-religious Kurds and massacred them too. Even the Arabs, other co-Muslims were happy to throw off the Turkish yoke.\n \n Not to mention the Turks pioneered ethnic-cleansing centuries earlier by declaring whole peoples 'Turkish' and then prohibiting their culture.\n \n The Turks cruelness reached a peak with the Janassaries, a body of elite troops made up wholly of Christian hostages. Turks would seize a number of boys from Christian villages, steal them off to military camp, brain-wash them into loyalty to the Sultan, and then release them back onto Christian enemies as the best troops in the Turkish arsenal.\n \n When Britain gave Cyprus its independence it was not willing to partition the island; something that the Brits loved to do (India-Pakistan, Jordan-Israel, Ireland-Northern Ireland etc). The flag itself represents the ideal of peace... a map of the island surmounting two branches of peace.", 
   {}, 
   28932, 
   null, 
   1073193360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  There is a Turkish population in Cyprus and I do not want a Greek mandate in my lands", 
  "url": "http://www.4forums.com/political/current-events-debates/1479-there-turkish-population-cyprus-i-do-not-want-greek-mandate-my-lands.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 1479, 
  "discussion_files": [
   [
    "10904.html", 
    "http://www.4forums.com/political/current-events-debates/1479-there-turkish-population-cyprus-i-do-not-want-greek-mandate-my-lands-print.html"
   ]
  ], 
  "identifier": 1479
 }
]