[
 [
  [
   28972, 
   null, 
   "3sgte", 
   "I'm a 26 year old southeastern male, and lately I've begun thinking about getting my concealed carry permit. I am not an avid shooter, I grew up around my father's .22 rifle and a 12ga, occasionally shot the rifle, and have fired a handgun 8-10 times. I have researched why others carry concealed and have come to a few conclusions. First, the police cannot be counted on to be there for my protection at all times. I feel like I am capable of protecting my self and my loved ones. Secondly, even though the police may be willing to put their lives at risk for mine, (maybe not, *cough, cough, columbine, *cough*) I am beginning to wonder what kind of person I would be to expect someone to do it for me, if I am not willing to do it for myself. Lastly, out of a sense of civic duty, what if my carrying could eventually help someone else? I am in no hurry to put myself or others in danger, but if someone else was in danger, and I could help by intervening with a handgun, wouldn't society be a better place? I am not a violent or macho person, my last physical fight was in 6th grade. I'm not a beaten down victim, the two times I felt like strangers wished me harm, I got out untouched, and I don't feel like I'm in constant danger.\n The costs of this process includes training classes, the cost of the permit, a handgun, and a concealment holster. Does anyone have any thoughts on carrying? Pro's , Con's, know anything I don't but should? Just curious to see what others think. Thanks for your input.", 
   {
    "post_info": {
     "post_title": "...so I'm thinking about concealed carry..."
    }
   }, 
   null, 
   null, 
   1072240620.0
  ], 
  [
   28990, 
   null, 
   "kelvin90701", 
   " Thanks for your input.\n\n \n Start with the largest most powerful calibur you can get and physically handle. Then consider:\n \n Practice = lots of ammo. \n Lots of ammo = cost increase with larger calibur.\n Practice = responsible gun owner.\n Training = responsible gun owner.\n Large calibur = ability to stop the attack quickly.\n Small calibur = less likely to exit your target and hit someone behind it.\n Well placed shots from a small calibur are superior to a large calibur that missed.\n \n As a bare minium take a training course that teaches you to handle low light conditions and drawing from a concealed holster. When you need it most are under conditions most favored by criminals, e.g. from behind, up close, in the dark, with suprise, or any combinations of them.\n \n A good instructor will also inform you of all the legal implications of having to defend yourself, the implications of comming to the aid of other people, the legal implications of defense on public and private property, etc.\n \n Personally I have made the decision that I WILL NOT help anyone in mortal danger whom I do not know. The legal implications if you are wrong are very drastic. You can never know the complete conditions of strangers and how they got to be in mortal danger, for all you know the person who just pulled out a gun may be an undercover cop. Thus I will only come to the aid for friends and family whom I know and thier business. My personal decision.\n \n The guys at the gun store are interested with selling you a pistol with the highest profit margin. Not the best tool for you. Only way to find out is with trigger time and carry time on the pistol. So you may have to horse trade a few times until you find the right one.\n \n My personal opinion? A very small .38 revolver with more than one holster. Sometimes you need to carry it on your ankle, sometimes in your pocket, or sometimes on your hip. Plus a ton of ammo for practice. The ammo you spend on practice can soon cost more than the pistol.\n \n Los of inexpensive, reliable, and well built .38's. Not a lot of fun to shoot, but hey, this is a tool with a very specific purpose. Of course of you can deal with more, by all means upgrade to more. Your not going to place a sniper shot between the eyes of a felon. Most likely you will need it at night, very quickly, and at a little longer than \"knife fighting distances\".\n \n I use a .45 auto. I shoot a full size .45 for fun. Train with the full size .45, but I carry a compact .45. The compact has exactly the same shape in my hand as the large .45, thus when I have to go the the small .45 quickly, it will retain the same operation and configuration in my hand as the large .45. The large .45 has more fun factor, not a lot of fun to carry a big piece of steel on your hip all day.\n \n Plus I reload the .45 empties. The cost of a large calibur with reloading becomes as much as a smaller calibur when the ammo is store bought. The time spent reloading keeps me out of bars on week nights and my girlfriend more comforted.\n \n By the end of the day, after carrying even the compact .45. I wish I had a small .38. The most effecient solution I have seen was a friend who both had a .357 magnum and .22 of the same pistol. He practiced with the .22 pistol all he wanted and very cheaply. Shot the .357 magnum just enough to practice with the recoil. The .22 and .357 had exactly the same size, shape, and trigger pull.\n \n My $.02", 
   {}, 
   28972, 
   null, 
   1072250340.0
  ], 
  [
   29011, 
   null, 
   "3sgte", 
   "Thanks, but choosing a gun will be one of the last steps. I would certainly practice and train if I were to go through with it, and I'm pretty well versed in the pro's and con's of various guns. I usually dress in loose clothes with shirt untucked so I could in theory conceal a large gun. But a fullsize 1911 is a bit much for me now. One thing that I wonder about is this, the way I dress, many people say I look like slacker, stoner, choose your GEN-X stereotype, I have oversize ear piercings etc. Even though I am college educated and have a respectable job, albeit one where I'm not requred to dress up, I wonder how others would react if they caught a glimpse of my holster, or the outline of the gun could be seen through my shirt. How many people out there would panic if they saw me? Would anybody out there feel better if they knew that people around them were carrying? Worse?", 
   {}, 
   28990, 
   null, 
   1072279080.0
  ], 
  [
   29014, 
   null, 
   "kelvin90701", 
   "Thanks, but choosing a gun will be one of the last steps. I would certainly practice and train if I were to go through with it, and I'm pretty well versed in the pro's and con's of various guns. I usually dress in loose clothes with shirt untucked so I could in theory conceal a large gun. But a fullsize 1911 is a bit much for me now. One thing that I wonder about is this, the way I dress, many people say I look like slacker, stoner, choose your GEN-X stereotype, I have oversize ear piercings etc. Even though I am college educated and have a respectable job, albeit one where I'm not requred to dress up, I wonder how others would react if they caught a glimpse of my holster, or the outline of the gun could be seen through my shirt. How many people out there would panic if they saw me? Would anybody out there feel better if they knew that people around them were carrying? Worse?\n\n \n Will it be 100% legal for you to carry a gun?\n \n If the answer is yes. Then so what? So what if people react with panic? If you are 100% legal, then it is your right to carry a gun. Your rights are just as important as thiers.\n \n I was once reported by a woman at a gas station for carrying a gun. I was not carrying concealed. I was very professionally dressed and driving a very yuppie car. When the cops came by, I was not the one the cops were XXXXXX at.\n \n BTW before the cops arrived I had removed the pistol from my hip and placed it in the glove box.", 
   {}, 
   29011, 
   null, 
   1072283340.0
  ], 
  [
   29058, 
   null, 
   "Toxey", 
   "I live in a state where if you have a concealed carry permit,that is what you must keep your weapon,CONCEALED.\n Failure to do so,and reported,you have a good chance of lossing said permit.", 
   {}, 
   29014, 
   null, 
   1072334040.0
  ], 
  [
   29217, 
   null, 
   "3sgte", 
   "I live in a concealed permit shall issue state, and open carry is legal also. I don't think that exposing the weapon will be a problem because of the way I dress, and I would likely carry in a IWB holster. Nevertheless, I am trying to go over the what-ifs in my mind.", 
   {}, 
   29058, 
   null, 
   1072488600.0
  ], 
  [
   29219, 
   null, 
   "kelvin90701", 
   "I live in a concealed permit shall issue state, and open carry is legal also. I don't think that exposing the weapon will be a problem because of the way I dress, and I would likely carry in a IWB holster. Nevertheless, I am trying to go over the what-ifs in my mind.\n\n \n IWB? How about having to use a public restroom? Using a public restroom while packing heat on the hip is a good \"what-if\" to practice. How about having to draw from concealment while in the restroom? Boy that is one never addressed by a CCW instructor. There was actually a stick up with a knife in the restroom in the middle of the day, at a public park I visit. Unarmed victim fought back against criminal with a knife. Got very lucky, he got cut very badly, but still had his life.\n \n Solution to that one?\n \n Packing heat? your going to have to use the stall. If someone is waiting just outside the door. I'm not leaving. If the let me know they have a knife, I'm not leaving. If they have a gun? Then I'm going to ask them to prove it by holding it above the door. At that point I shoot them through the door.", 
   {}, 
   29217, 
   null, 
   1072492320.0
  ], 
  [
   120009, 
   null, 
   "inmyopinion", 
   "If you choose to take the course, choose to get your certificate, choose to buy a gun in the mandated time, choose to practice regularly, choose to know all the state laws (like reciprocation - where you can go with the gun or not)...then you still have to walk out the door knowing one thing: if you chose to carry concealed, you MUST be ready to USE that gun for your protection  (BTW: in my family of 10 people, 5 have pistol permits and 2 of those are for Concealed Carry)", 
   {}, 
   29219, 
   null, 
   1115738400.0
  ], 
  [
   122266, 
   null, 
   "Bishop", 
   "I live in PA. However, I worked in NJ as an Armored Car driver, and I carried a weapon for 5 years..everyday (except days off) I was only allowed to carry \"while on duty\" as my permit said in VERY big letters. Even getting THAT in NJ is a miracle..they are so damn strict about guns its rediculous... when I cross the bridge I often anounce to the car \"Welcome to Germany\". That being said, when I was able to get my permit in PA I did so... I carry a full size Beretta... but the law in this state states You MUST have it concealed.. or you could be arrested... Comming from the communist state of NJ..that is ok with me. I would prefer to have it concealed anyway... As I used to say when I was an Armored Car driver... \"When people see that you have a gun, they know how hard to try if they want to kill you... and they get a bigger one...or something better.\" I dont want people to know what I am prepared to do...I dont want people to escalate their level of violance by seeing a weapon on my hip... My concealing it prevents upgraded mailce... I think that is a key role in being a resposable gun carrier.", 
   {}, 
   120009, 
   null, 
   1116014040.0
  ], 
  [
   123021, 
   null, 
   "Adept", 
   "A few things to consider:\n \n - Power. While it feels good on some levels to leave an exit wound the size of dinner plate, do you really want those rounds punching through walls if you need to use said weapon at home? In fact, if you want a weapon for home defence, get yourself a shotgun. At close range it'll knock a man of his feet and leave one heck of a hole, but it's unlikely to penetrate through a wall, let alone two.\n \n - Weight and convenience. When you carry a weapon, you need to be able to get at it quickly when the **** hits the fan. Trying to pull a Deagle .50 out from under your shirt is more likely to get you shot than the anything else.\n \n - Proper training. Not just on how to shoot and how to carry, but 'live' scenario training, situational awareness training, other self defense options, and very importantly, verbal judo. If you can talk your way out, or talk a situation down, then do it. There are courses on verbal de-escalation. Take them.\n \n Good luck with it. I wish we could get concealed carry permits in Australia.", 
   {}, 
   122266, 
   null, 
   1116159600.0
  ], 
  [
   123987, 
   null, 
   "Bishop", 
   "A few things to consider:\n \n - Power. While it feels good on some levels to leave an exit wound the size of dinner plate, do you really want those rounds punching through walls if you need to use said weapon at home? In fact, if you want a weapon for home defence, get yourself a shotgun. At close range it'll knock a man of his feet and leave one heck of a hole, but it's unlikely to penetrate through a wall, let alone two.\n \n - Weight and convenience. When you carry a weapon, you need to be able to get at it quickly when the **** hits the fan. Trying to pull a Deagle .50 out from under your shirt is more likely to get you shot than the anything else.\n \n - Proper training. Not just on how to shoot and how to carry, but 'live' scenario training, situational awareness training, other self defense options, and very importantly, verbal judo. If you can talk your way out, or talk a situation down, then do it. There are courses on verbal de-escalation. Take them.\n \n Good luck with it. I wish we could get concealed carry permits in Australia.\n\n \n \n Although well written...\n \n I can pull out a desert eagle quicker then I can grab a shot gun. In a urban situation (inside a home) turning sharp corners while keeping your weapon in the \"ready\" position is very awkward with a long weapon like a shotgun. Thats why SWAT uses the H&K MP5 which is very stubby just for that reason.\n \n As far as the rounds going through walls... You are trained to watch your backround... You should know weather you can shoot before you shoot... not find out after. To help with that there are plenty of hollow point rounds that are made to mushroom out when hitting an object just so they dont go through walls...or humans. If I am not mistaken they are called the \"Home Defensemans Series\". \n \n All things which are not available in Australia I am sure... It truely sucks how handguns are handled there.", 
   {}, 
   123021, 
   null, 
   1116344820.0
  ], 
  [
   123996, 
   null, 
   "georged", 
   "I can pull out a desert eagle quicker then I can grab a shot gun. In a urban situation (inside a home) turning sharp corners while keeping your weapon in the \"ready\" position is very awkward with a long weapon like a shotgun. Thats why SWAT uses the H&K MP5 which is very stubby just for that reason.\n\n \n I'll take my semi-auto shotgun with 18\" barrel right under the bed over a sidearm in a drawer. Seven rounds of 00 buck amounts to 63 pieces of .33 caliber lead in the air, 33 more than the standard 30-round 9mm MP5 clip. For corners, when tucked under the arm it has the same extended radius as the HK. And costs a civilian about $14k less. \n \n What I dislike about sidearms for home defense is the positioning required for accurate shot placement. Maybe Wild Bill Hickock could shoot accurately from the hip and TV/movie shooters can all shoot accurately from any position including underwater, but I've fired thousands of rounds from pistols of all calibers and without a two-handed grip getting the weapon up to eye line of sight level pistol shots are going to be lucky hitting anything farther than a few feet away, especially in semi-darkness. And that means concentration is occupied with aiming, not the subject's movements.", 
   {}, 
   123987, 
   null, 
   1116346320.0
  ], 
  [
   124159, 
   null, 
   "Bishop", 
   "I'll take my semi-auto shotgun with 18\" barrel right under the bed over a sidearm in a drawer. Seven rounds of 00 buck amounts to 63 pieces of .33 caliber lead in the air, 33 more than the standard 30-round 9mm MP5 clip. For corners, when tucked under the arm it has the same extended radius as the HK. And costs a civilian about $14k less. \n \n What I dislike about sidearms for home defense is the positioning required for accurate shot placement. Maybe Wild Bill Hickock could shoot accurately from the hip and TV/movie shooters can all shoot accurately from any position including underwater, but I've fired thousands of rounds from pistols of all calibers and without a two-handed grip getting the weapon up to eye line of sight level pistol shots are going to be lucky hitting anything farther than a few feet away, especially in semi-darkness. And that means concentration is occupied with aiming, not the subject's movements.\n\n \n \n \n So its not the quality of your shot that you prefer.... its the quantity. The more the better... some of them are sure to hit! ... right? \n \n That is random and uncontrolled... especially buck shot. Not to mention under your bed? Ill give you three words that really helped me in weapons training:\n \n Consolidation of Motion...\n \n Its why the cops win... most of the time.", 
   {}, 
   123996, 
   null, 
   1116366120.0
  ], 
  [
   124269, 
   null, 
   "georged", 
   "So its not the quality of your shot that you prefer.... its the quantity. The more the better... some of them are sure to hit! ... right? \n \n\n \n The cyclic rate of fire is fast enough to cover an entire room including furniture if that's what's required, something a handgun can't accurately accomplish in semi-darkness. Quality shots are fine if conditions allow same. Attempting a quality pistol shot(s) or turning on a laser in a dark or semi-dark house is, to me, a compromise when compared to firepower. If the problem is outside, that's full-auto work.", 
   {}, 
   124159, 
   null, 
   1116375600.0
  ], 
  [
   124286, 
   null, 
   "pickleweaseler", 
   "Although well written...\n \n I can pull out a desert eagle quicker then I can grab a shot gun.\n\n \n Except Desert Eagles are very notorious for being unreliable, especially in a hectic situation.", 
   {}, 
   123987, 
   null, 
   1116378060.0
  ], 
  [
   124318, 
   null, 
   "Bishop", 
   "Except Desert Eagles are very notorious for being unreliable, especially in a hectic situation.\n\n \n And I wouldnt pick a Desert Eagle for just that reason.. but I stand by pistols in urban situations.", 
   {}, 
   124286, 
   null, 
   1116383700.0
  ], 
  [
   125926, 
   null, 
   "Adept", 
   "I can pull out a desert eagle quicker then I can grab a shot gun.\n\n \n Thats a very situational thing. It depends on where you keep the firearms and where you are when you notice the threat. I'm thinking in terms of a late night home intrusion, where a short-barreled shotgun might be kept either beside or under the bed, making it just as easily accessible as a handgun under the pillow.\n \n \nIn a urban situation (inside a home) turning sharp corners while keeping your weapon in the \"ready\" position is very awkward with a long weapon like a shotgun. Thats why SWAT uses the H&K MP5 which is very stubby just for that reason.\n\n \n Fair point.\n \n \nAs far as the rounds going through walls... You are trained to watch your backround... You should know weather you can shoot before you shoot... not find out after. To help with that there are plenty of hollow point rounds that are made to mushroom out when hitting an object just so they dont go through walls...or humans. If I am not mistaken they are called the \"Home Defensemans Series\".\n\n \n Yeah, but I'd rather not limit myself like that. If the perp is coming towards me, and my daughter is in the room behind him, I'd rather not take that risk. A shotgun limits the collateral damage significantly.\n \n Some of the reasons I'd prefer a shotgun to a handgun in a home defense situation:\n \n - It's scatter damage. You don't have to be as accurate when dealing out damage over the area of a dinner plate, so when under stress and thinking on the fly it will be a more firgiving weapon.\n \n - Ease of use. For someone who may not be as well trained, or responsible enough to seek out training, a shotgun is pretty easy to use. Point it at the bad guy, pull the trigger. When under stress, it is again a more forgiving weapon.\n \n \nAll things which are not available in Australia I am sure... It truely sucks how handguns are handled there.\n\n \n Guns in general I'm afraid. The government seems to fear it's own population, assumig we are all criminals in the making, held back from a crime spree only by the lack of firearms.", 
   {}, 
   123987, 
   null, 
   1116664980.0
  ], 
  [
   125948, 
   null, 
   "greg 79 f150", 
   "All in all if one considers the implications and complications of CCW just for personal protection, I would become a martial arts student. As stated earlier, to go CCW with the thought of being hero, is unrealistic. That is a awesome , one hundreth of a second descison , to have to make to pull a gun out to save someone else, because one never knows the situation they just came upon. When a gun comes out the WHOLE situation just changed, being able to handle the end rsults of that action , is where the real judgment needs to be made. Ask yourself one thing, do I have the financial means, or the willingness to lose my freedom, if it all goes wrong ? jmo", 
   {}, 
   125926, 
   null, 
   1116679920.0
  ], 
  [
   126014, 
   null, 
   "pickleweaseler", 
   "[QUOTE=Adept\n \n - It's scatter damage. You don't have to be as accurate when dealing out damage over the area of a dinner plate, so when under stress and thinking on the fly it will be a more firgiving weapon.[/QUOTE]\n \n You should check out the http://www.theboxotruth.com/3/ webpage. It seems that shotguns don't spread  that much.\n \n Also, it seems that stray buckshot would penetrate at least one wall, maybe a couple.", 
   {}, 
   125926, 
   null, 
   1116696300.0
  ], 
  [
   126359, 
   null, 
   "Adept", 
   "You should check out the http://www.theboxotruth.com/3/ webpage. It seems that shotguns don't spread  that much.\n \n Also, it seems that stray buckshot would penetrate at least one wall, maybe a couple.\n\n \n :D\n \n I don't need to. I've been shooting since I was knee high to a grass-hopper, and I know how different shotguns spread. A shortbarreled shotgun with no choke firing 6's will scatter over the area of a large dinner plate by the time it has covered maybe five metres. I would never use buckshot in a home defense situation. I'd use 6's, maybe even 8's.", 
   {}, 
   126014, 
   null, 
   1116730320.0
  ], 
  [
   127996, 
   null, 
   "inmyopinion", 
   "We live near 2 prisons. The first thing out when there is a break is the \n 20 gauge pump shotgun I shoot with - shells in my pocket. Had some jerk who was fleeing toward the city from the prison come through the next property in the prison uniform (after the next property are RR tracks to the city, easy to follow) and I loaded and racked the gun. One sound prisoners know: racking a pump shotgun. No need to shoot, he was gone! Then, w/ gun still in hand,I called the cops to tell them where he was. They had him 15 min later. Even sounds can create the effect of \" this person can and will protest themselves\".\n \n My hubby like a .38 Police revolver or a .380 Colt auto; and my son a 9mm Glock for CCW", 
   {
    "post_info": {
     "post_title": "add"
    }
   }, 
   126359, 
   null, 
   1116964980.0
  ], 
  [
   128003, 
   null, 
   "georged", 
   "We live near 2 prisons. The first thing out when there is a break is the \n 20 gauge pump shotgun I shoot with - shells in my pocket. Had some jerk who was fleeing toward the city from the prison come through the next property in the prison uniform (after the next property are RR tracks to the city, easy to follow) and I loaded and racked the gun. One sound prisoners know: racking a pump shotgun. No need to shoot, he was gone! Then, w/ gun still in hand,I called the cops to tell them where he was. They had him 15 min later. Even sounds can create the effect of \" this person can and will protest themselves\".\n \n My hubby like a .38 Police revolver or a .380 Colt auto; and my son a 9mm Glock for CCW\n\n \n That's a distinct sound anyone who has been around guns or seen movies acknowledges, be it a slide or auto-loader chambering a round. A great tune that means nothing but serious intent. \n \n I formerly used Walther PPs for carry, but changed that for the Sig P232, a very nice carry piece.", 
   {}, 
   127996, 
   null, 
   1116966300.0
  ], 
  [
   171858, 
   null, 
   "Freedom Fighter", 
   "Just go to the site www.justfacts.com/gun_control.htm\n IT is filled with facts showing how Concealed Carry saves lives and decreases crime. But all in all it is your choice and if you will feel safer why not get one, after all we are free to make our own choice, make yours on your own feelings not what people say.", 
   {
    "post_info": {
     "post_title": "Why you should get your permit."
    }
   }, 
   128003, 
   null, 
   1129605000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  ...so I'm thinking about concealed carry...", 
  "url": "http://www.4forums.com/political/gun-control-debates/1481-so-im-thinking-about-concealed-carry.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 1481, 
  "discussion_files": [
   [
    "27030.html", 
    "http://www.4forums.com/political/gun-control-debates/1481-so-im-thinking-about-concealed-carry-print.html"
   ], 
   [
    "27031.html", 
    "http://www.4forums.com/political/gun-control-debates/1481-so-im-thinking-about-concealed-carry-2-print.html"
   ]
  ], 
  "identifier": 1481
 }
]