[
 [
  [
   419976, 
   null, 
   "jazyjason", 
   "So I'm contemplating and wrestling with a few things in my mind. Kind of like that little voice in the back of your head that you don't wanna listen to. Now I'm sure many here have been raised by a religious family and such so they know where I'm coming from.\n \n Now this is kind of parallel to the history of me coming out, wrestling with my sexuality but it also seems to border more on maturity and rationale than anything else. \n \n seeing for a very long time the hypocrisy of alot of religious people, the slander, the hated and just the history of we as humans in general feuding and warring over religion for centuries I ask myself why?\n \n Sure I say I'm a Christian, I even in the most difficult of circumstances I pray or attempt to and it just seems empty! The whole religious experience seems empty! Just like going through the motions when hiding my orientation, saying of yeah I believe in God or Jesus or whatever..\n \n but the more I look at the typical religious person, the more I see just how crazed and out of whack alot of these people are I just feel as if there was a god he'd be ashamed of people like that...\n \n I also wonder what about atheism? Or even being an agnostic? The notion of someone dying for my faults is a simple yet bold concept, but coupled with all the fallacy, the pomp and convoluted XXXXXXXX that now tarnishes religion I just find myself not being able to go through it anymore!\n \n I mean... my friend is a bordering agnostic/ atheist and we've been friends for years. he's seen my struggle and knows every fight, detail, and issue I've gone through. We've had many discussions just on the concept of religion in general and even seen and read some very convincing articles by atheists.\n \n it seems to me that there is a war between utter blindness, the leading of the masses by fear and control like it's been throughout the centuries and the enlightenment. The opening and budding of man through rationale and reason.\n \n Through methodical concept and thinking. Not on the emotion of a person doing cheap parlor tricks or frothing at the mouth playing his role....\n \n I invite RATIONALE discussion on this issue. if you insult or try to deviate from the topic like a few users here are known to. I am going to report you.\n \n This is one topic I don't want derailed... So if you don't have something positive or enlightening to bring to the table stay out of it..", 
   {
    "post_info": {
     "post_title": "Is it just me or is my perception changing?"
    }
   }, 
   null, 
   null, 
   1293325080.0
  ], 
  [
   419986, 
   null, 
   "Steeeeve", 
   "Merry Christmas!!!\n \n come on...you had to see that coming", 
   {}, 
   419976, 
   null, 
   1293326700.0
  ], 
  [
   419992, 
   null, 
   "Xcaliber", 
   "I assume that most everyone today is born into a household where some religion is predominant. I personally was born and raised a Baptist, then moved to a Pentecostal Church for a few years before I gave up completely on religion. \n \n Becoming an Atheist, I don't think, Is something that one chooses to do. You either believe or you don't . I didn't suddenly one day say,\" hey, I think I will give Atheism a try\".. I guess it just is the end result of a long road to discovery.\n \n After 30 some odd years of Living within the Christian Faith , Watching the Bigotry, the hate, the prejudice, hearing the insults, Losing loved ones, And finally becoming disabled through no fault of my own I just finally started to question if God really was up there watching over me. I started off more or less Agnostic, wanting to believe but not sure why. Slowly I began to see things differently, perhaps because after a few years of answering my own questions instead of allowing the \" Religion \" to answer them for me, I began to lose my belief all together. \n \n Now, well I'm sure you have seen from my posts here where I stand with religion,lol..\n But, Honestly I don't have a problem with the religion. My view now is that of an Atheist when it comes to my personal belief, My world view has changed from being a hateful, bitter, bigot to \" to each his own\".. \n In other words I don't care what other people believe. If they choose to be a Christian then that is their choice. Wanna be a Muslim, hey more power to you. You're Gay?.. nice to meet you. I simply don't care one way or another, because now I look at myself as part of the HUMAN race, just a guy trying to get as much out of this life as I possibly can. I don't live my life worried about my afterlife. \n \n My advice as someone who has been where you are is this...\n \n Talk to Preachers. Talk to Priests. Talk to Atheists, agnostics, Mormons, Muslims, anyone who might have a different perspective. And then take what information you gain and make a decision that will give you the Peace of mind that you seek. See, People like EZ and Zorba don't get under my skin anymore. There are some good religious people out there that live good lives and don't judge others based on their own beliefs. But there are also good non religious people out there that only want to live and let live.", 
   {}, 
   419976, 
   null, 
   1293328440.0
  ], 
  [
   420020, 
   null, 
   "Bennedict", 
   "this isnt the first time ive heard someone compare their struggles with atheism to the struggles they faced with their sexuality. personally, i had no problems whatsoever calling myself an atheist. i did so when i was very young, and that confused my parents far more than it confused me. but, i have heard that some people have a pretty hard time with it. they grow up being forced to go to church and believe in this doctrine, and when they start to doubt it, things get rough. this is also not the first time ive heard of people going through a religious \"dropping\" later in life - most of the time, people become atheists in their teen years, but sometimes earlier (like myself) and sometimes later. it is something you need to think about long and hard, do research on, talk to people, gather up as much experience as you can, but i think it's mainly a personal thing you have to think about. spend some time by yourself reflecting on everything youve experienced and im sure that will make things a whole lot easier.\n \n also something to note is that if you do choose to drop your religious belief, do not be afraid to call yourself an atheist. the term \"atheism\" gets a lot of bad rep, even from dictionaries which ive seen been defined as \"immoral\", and a lot of people, especially in America tend to think that atheists are some kind of crazed cult with no moral beliefs that go around fire-bombing churches (thats black metal bands in Finland, btw). this could not be further from the truth. a lack of belief in a religious doctrine will not encourage you to do Hitleresque things or join a cult. atheism is a good thing - a very good thing. atheists will treat you with the same respect as you treat them. atheists will not refuse to be friends with someone based on sexuality, gender, race, political affiliation, social status, or even religious belief. the most bad XXX, hardest hitting atheist in the world, Christopher Hitchens has religious friends. an atheist is a strong title (or lack of title, more appropriately). if someone bites an atheist, they better be prepared to get bitten back, and an atheist bites hard, like Sir Hitchens. an atheist has logic, science, rationality, reason amongst their tool kit, a theist has scripture. an atheist has an open mind and open eyes about everything in this universe, a theist has scripture to tell them about it.\n \n also, a word of advice, just from my opinion vault - dont bother calling yourself an agnostic. everybody is an agnostic when it comes to philosophy, thats where most self-proclaimed agnostics get the title. however, when it comes to religion, it is strictly belief or non-belief. you wont be able to say \"i dont know if i believe in this religious doctrine or not...\" ask an agnostic why they are an agnostic when it comes to religion, and they will always go on about philosophy.\n \n anyways, jazy. keep us updated on how your spiritual quest is going, i would love to hear about it.", 
   {}, 
   419992, 
   null, 
   1293340320.0
  ], 
  [
   420021, 
   null, 
   "Xcaliber", 
   "Wise words Bennedict.. Some that hit home with me as well.\n \n Unlike Bennedict I turned to Atheism late, and I did at first hide that fact from Family and friends. In fact it was places like this board that kind of forced me to come out , being as it was really hard to sit by and read posts from Christians and other religious Zealots with all the Bigotry and hate. I finally decided to tell my Family and to my surprise most of them didn't take it as hard as I had imagined. \n \n One other thing.. When I was going to church and living as a Christian I considered myself a good person. I helped with various charities, donated money and time to more than just my own church, Even served as youth director at my church for a year. I would always help someone in need if I was able, I had never even seen the inside of a Jailhouse or had so much as a speeding ticket. I've been an Atheist for about 10 years now and I still do most of those same things. Becoming an Atheist did not change who I was, it only changed how I looked at the world around me and how I treated others. Like Bennedict said, there are many Atheists out there who are really just good people. Since I have been an Atheist the only people who have ever insulted me have been Religious Zealots, attacking me simply for my non-belief. I know you will make the decision that you will be comfortable with, just know there is no shame in not believing, it won't change who you are as a Person.", 
   {}, 
   420020, 
   null, 
   1293341400.0
  ], 
  [
   420022, 
   null, 
   "Bennedict", 
   "EXACTLY, Xcal!\n \n there are tons of good people who are religious and do good things because of that, but lots of them do good things just because they fear God's punishment, or because they want a spot reserved in heaven... not very good reasons to be good to people, in my opinion. atheists have no such excuse. be good to people because being good is good. thats not to put down the good religious people in any way, if you are good to people, then good!\n \n you know when you say a word too many times and it starts to just not seem right? ...good.\n \n but, as the quote says, from... someone... \"only religion can make good people do bad things\". religious people who are bigots and who are mean to people are mean because of religion. i was almost kicked out of my girlfriend's grandparent's house for being an atheist... miles and miles away from my house. again, atheists have no such excuse. if an atheist is mean it's because he is a mean person.\n \n all in all, i think being an atheist is a very brave and noble thing to be. you cannot hide behind scripture if you are mean, and you cannot use scripture as an excuse to be nice to people. breaking away from the shackles of religion frees yourself up to express exactly who you are, with no pretending to be this or that, and no fallicious justifications if you do something bad.", 
   {}, 
   420021, 
   null, 
   1293344400.0
  ], 
  [
   420025, 
   null, 
   "jazyjason", 
   "Thanks to both of you for the awesome posts. See this is the thing though I've struggled with the notion of Atheism because well even when I was young it was going through the motion with faith. Even sitting in the seats at my first church I was Baptized in it just never held with me.\n \n My family has to be another reason. Always put on the face of devout believers. But my father and mother always fought, my dad being manipulative and controlling in many ways to my mom that hold true to this day... I just didn't see any validity in faith especially when trying to grasp the reasons to believe from family example.\n \n I guess hypocrite isn't the proper term because desire was there mostly I think from them but in action it was hypocritical. There would be times when they'd fight even just getting out of church! Just compounded into me feeling disgusted especially now when my father would dare tell me how to live my life and blame me for my mom's health issues cause he said my homosexuality was killing her emotionally.\n \n \n It's alot to take in but even at an early age I didn't really believe. I wanted to I conformed and still it just didn't stick. However when I struggled deepest with my sexuality, when I loathed myself that's when I found religion and did anything I could to be around it.\n \n I knew I was gay since thirteen but steady denial mixed with peoples attitudes especially my families forced me to try to change. And let me tell you it was the most destructive thing I did to myself. People in high school wouldn't even me able to tell it's me now compared to back then.\n \n I was bitter, angry, and always always judgmental of others! I always pressed them why they didn't believe in God or why they agreed with abortion, or why they weren't dedicating their lives to Christ. it was not in their best interest but mine. It was an obsession. I kept it up to try and convince myself I was doing the right thing, doing good.\n \n And in doing good God would reward me with being heterosexual. He would purge any desire I had for the same sex and make me \"normal.\" Needless to say I suffered and close friends suffered as a result.\n \n I even put up the ten commandments at my school trying to legislate morality in my own school and used the Gay Straight Alliance club as a means for my basis in doing so. Saying they could post their \"deviance\" on public grounds why can't I put up my beliefs as well?\n \n Looking back on all that now.... I shudder to think of how I used to be as a person. The struggle between that whole issue with the school even landed me in the local paper....\n \n When one of my friends came out to me I hated him. I wouldn't go near him and I always talked bad about him around other people saying how gross he was or that I can't believe he does those \"things.\" when in reality I envied him.\n \n I envied him so much because I didn't have what he did. Freedom. Freedom to be who deep down I feared and loathed. A part of me I refused to accept or even acknowledge but knew was there all along... And this was all brought upon by my religious upbringing.\n \n To be honest the pain is still relevant knowing I suffered so much and caused others pain. Luckily now my high school friend whom I envied were best friends now and he even told me he knew I was gay before he knew he himself was....\n \n To just show you the desperation I faced I even got involved where I asked just about every single girl I could to one of the dances or on a date desperate to convince myself I was strait... \n \n Sad yes. Foolish of course. But that was how bad my mind had been brainwashed into thinking I needed to change. My very life and soul depended on it...\n \n \n it took me literally almost losing my life over the part of me I hated most to finally embrace and love the real me. And I'm still fighting and struggling with that every single day. You can't just up and love every part of yourself in a day especially with 9 years of depressions and hurt like I went through in your heart...\n \n So now when I think of religion or belief. I just can't believe the God I was told can love me for who I am. Certainly His followers don't that much is clear so why would the deity either? I feel like I was praying for the wrong reasons praying to be something I'm not....\n \n Sadly when I think of religion all I can remember is the hurt and pain it caused me... And it's a struggle to even think of something in the realm of spirituality being positive especially when it's compounded by people like Easy and others trying to crucify how we as gay people are....\n \n All I see is hurt and pain as a result from my experiences... And it's come to a point to where just like I cannot lie about my sexuality I cannot lie to myself about how I really feel about religion at this point in my life.", 
   {}, 
   420022, 
   null, 
   1293348480.0
  ], 
  [
   420032, 
   null, 
   "Bennedict", 
   "wow. powerful stuff, Jason. thanks for sharing your story. that will all be on my mind for some time.\n \n i dont think anyone at any point in their lives will figure themselves out - a strange thing to say, i know. im a firm believer that the people who know you best know you far better than you know yourself. like your friend knowing you were gay before he knew himself - and before you knew, too. i often wonder if i'll find something about myself on my death bed that i didnt know before. and maybe my friends would have known all along. that's why i think it's important to be really good friends with at least one person, because if you were to leave behind one thing, books and music are measly artifacts compared to relationships you had formed. for me, i really hope that one friend is my girlfriend - i hope we continue to learn as much about each other as we can.\n \n anyways (out of trance) so is that it, then? it seems you gave this all a good thought, and the answer was right under your nose the whole time. what did you find out, Jason?", 
   {}, 
   420025, 
   null, 
   1293352920.0
  ], 
  [
   420033, 
   null, 
   "Xcaliber", 
   "Well jazy you know by now that I don't believe that God exists, But just say for the sake of this Conversation that he did.\n \n God made you who you are, so why would he turn around and punish you for his own creation?. Part of being an Atheist, for me at least, Started by learning to think outside the realm of Religion and God. Every Human born on this planet is born an Atheist. Religion and God is not imprinted on their young brain until it is pounded into their head by the Society in which they live. For instance, a Child born in a Muslim Household grows up to practice Muslim beliefs. A Buddhist Family will raise little Buddhists. Christianity is merely one of over a hundred religions , all of which have one thing in common, A GOD or GODS that is the basis of their respective religion. Some of them spawn other religions that follow the basic tenants but make changes to fit a certain belief of a certain individual . \n Take the Mormons for instance. For over 2000 years of the Christian religion that religion didn't exist on the planet. It wasn't until Joseph Smith decided to create the religion that it came to be. He came up with a miraculous story , included Jesus and The Christian God in his story so it would be a bit more believable to a predominately Christian society, and he wrote a book and called it the second testament of Jesus Christ himself. Now any Christian will tell you that this whole story is a made up Fairy tale and that only THEIR story is real. yet Mormonism is the fourth largest religious denomination in the United States. The same goes for Scientology.. And every other religion.\n \n We as Humans are born with one chance at life. There are those who are what I consider brainwashed into living a life chasing immortality, and there are those that live the life they have to the fullest potential possible. Your number one goal in Life in my opinion should be Yourself, and making yourself happy . If anyone else gains happiness by something you do consider it a bonus. People will insult and ridicule you for any number of things if they have been raised to believe the opposite, but you just have to accept that those people even though they may put on a happy face and act as though they are content, well those people are really just miserable, envious people that don't get it. They envy you because you are Truly a Free Human being, free to live as you choose . \n \n The first step is always the hardest, I know , it's not easy to give up years of brainwashing overnight. You may choose to continue to believe, which is fine. You know, here where I live, and I live right in the Middle of what they call the Bible belt, but we have a Gay Church . I have several friends that attend that church, and they live good, Christian lives as much as anyone else. Most everyone in that church suffers the bigotry and hatred from the community, but they don't care because they are doing what makes them happy.", 
   {}, 
   420025, 
   null, 
   1293352920.0
  ], 
  [
   420036, 
   null, 
   "Stonewall", 
   "I can't even imagine having to deal with the things that gay people have to deal with. Jazy, your story is sad and probably not too uncommon. Honestly, with the way Christians (and basically all major religions) treat gays, I don't see how you could hang on to any faith at all.\n \n My path to atheism was thankfully a lot easier than any of that. \n \n I was raised by a fundamentalist family (Church of Christ). My parents, grandparents, aunts, uncles, literally all my family that I know are church-going Church of Christ-ers. I went to church for basically every service until I left for college, and although I always had a lot of questions and didn't believe in a lot of things (like a young earth or global flood), I still basically believed in the whole heaven/hell/Jesus thing, before becoming an agnostic/deist for a very short period, and then going full blown atheist shortly thereafter. \n \n It wasn't a choice for me. I had always just kinda went with the flow, taking the bible's word for everything, but almost immediately after I started looking for answers to the questions I had, I realized that religion didn't have them, and it was a pretty sudden revelation. I didn't find it difficult or depressing (I was happy to know the truth and happy that I didn't waste my life worrying about heaven and hell). Part of the easiness was probably due to me never actually becoming a Christian or taking communion or anything. \n \n But dealing with family still seemed difficult, so I never told them. I've let them know my position on a lot of things, and made my doubts known, but I'm pretty sure they don't really want to know for sure, and that's okay by me. My friends know, but I don't see the point in putting my parents through the stress that would come from it. My brother is also an atheist, but that somehow makes it harder for me to tell them, since I am their only other child. If there is ever a situation where they try to get me to join a church or something, I will tell them, but until then there's really no point for me to.\n \n My family and the members of their church are all really good people. I have no problem with them, and really no desire to argue with them or tear down their faith. It's only when people push their beliefs around that I get annoyed.", 
   {}, 
   420022, 
   null, 
   1293354780.0
  ], 
  [
   420080, 
   null, 
   "Ripskar", 
   "A lot of this is somewhat alien to me.\n I was sent to a Catholic primary school and came to the conclusion that they weren't telling the truth rather early on. First Communion where the priest mumbles and gives you a wafer (no wine for the kids). Afterwards one of the girls started talking about feeling a presence beside her during the event.\n Next time we did it I stayed very still and quiet and sensed absolutely nothing.\n After that I tended to notice all the little inconsistencies.\n I didn't have a word for it back then but by the time I left I was a definite non-believer.\n I didn't talk about it to other people, there wasn't any point that I could see, and it never came up.\n It wasn't till I went to Uni that I came across any Protestants actively trying to recruit. I first came across a living creationist on an Internet forum called Portent, prior to that the only hint had been the Victorian references when we were taught about Darwin.\n I've satisfied myself that there isn't a factual basis to monotheism.\n The polytheistic stuff on the other hand holds some interesting information albeit rather cryptically recorded. eg. Aspirin, Troy, etc.\n After Uni the Protestants disappeared again until I started working in Mental Health, certain clients seem to have a problem with me not believing, these tend to be the same individuals who drove out workers because they were transexuals, and have been up in front of the management numerous times for matters relating to disrespectful conduct.", 
   {}, 
   420036, 
   null, 
   1293398340.0
  ], 
  [
   420212, 
   null, 
   "Accipiter", 
   "Rather then call myself an atheist I call myself a skeptic.\n \n I don't want to completely rule out anything and I think skeptic says just that.\n \n I love learning about science and always felt that learning about nature and the universe was more of a religious experience then religion could ever be.\n \n For me reality is much more profound, by comparison religion seams a little flat.\n \n I see what religion does to the thinking of many people and I feel that their world could be much richer if they could allow them selves to agree with science enough to actually learn something about the natural world.\n \n I see the problems that religion is creating today and I can't see it doing anything but getting worse in the future.\n \n Religion is very much egocentric, it's placed man at the center of the universe from the very beginning.\n \n It tells people that they are above all things and that the universe was made especially for them.\n \n It tells people that there is an us and a them and fuels the fire of prejudice and dehumanization.\n \n That kind of thinking will only lead us to self destruction.\n \n This link is a place I frequent, usually to listen to the pod casts, I hope you find it helpful.\n \n Home | Center for Inquiry", 
   {}, 
   419976, 
   null, 
   1293496080.0
  ], 
  [
   420298, 
   null, 
   "Matthew", 
   "As someone who finally became an atheist a few months ago, I know what you're going through.\n \n I was raised in a religious home -- my dad's a minister, in fact. But it was always a very open-minded home, too. My dad has always been both theologically and politically liberal, and when he got fed up with church politics about twenty years ago, he decided to exchange the pulpit for a job in service to the homeless (shelter, rehab, spiritual guidance, etc). Meanwhile, my mom has always been the sort of preacher's wife whose unorthodox ideas and -ahem- opinionated manner gets her in trouble -- the sort of chick Jesus might have liked, but most church leaders can't stand.\n \n So when I started asking questions -- about why some people are Jewish or Muslim or Hindu or Buddhist (atheism wasn't on the map at first), about why God would punish good people just for not being Christian, about how the Bible could be right if science was, etc -- I was encouraged to explore the possible answers. It made it very easy for me to stay Christian, theologically speaking. There are plenty of liberal options for interpreting the Bible, Christian doctrine, and religion more generally.\n \n Ultimately, though, there's a problem that I've always struggled with, and that's what's known in theological and philosophical circles as \"The Problem of Evil.\" \"Evil\" is somewhat a misnomer, given modern sensibilities, because we've reduced the term to its moral dimension: sin (in religious terms). But it has always had a natural dimension, too: suffering. In a nutshell, the issue is: How can an all-powerful, perfectly just and benevolent god allow so much innocent suffering? If he is omnipotent, he can stop it. If he's good, he presumably wants there to be less. But there is so much of it -- why? Moral evil -- sin -- is easy enough, that just gets ascribed to human beings. But natural evil -- suffering -- well, that's the tough one. And after years of consideration, I just don't think there's any reasonable solution to the problem, in theological terms. One can take the leap of faith, and say there's a reason for it all, even if we can't know or understand it. But that seems to me no reason at all.\n \n (I should quickly add that this is not to ignore all the goodness and pleasure in the world. It's just that they're not the problem. The undeserved suffering is.)\n \n I've often struggled with other notions, too. Why would God punish all of Adam's descendants for Adam's own failing? Why would he punish anybody's finite crimes on earth with an eternity of torment? Such a deity is not one I could worship. Now in fairness to liberal theists like those in my family, it's not a deity they could worship, either. But they're willing to take the leap of faith, and postulate reasons that (in my view) can't qualify as reasons. So we've parted ways on this.\n \n And amicably, to tell the truth. When I told my father that I no longer believed, what ensued was an outpouring of support -- and then a discussion of the nature of faith, and how it isn't knowledge, and... well, I'll spare you all the details, but it was really excellent. Rarely have I felt so loved. I consider myself quite lucky.\n \n Anyway, I hope that you too will find support from family, from friends, from somewhere. It's not an easy thing to do, but in the long run, you'll be happier. Like you said, it's not unlike coming out.\n \n (And needless to say, I concur with much of what Bennedict and Xcaliber and others have been saying.)", 
   {}, 
   420212, 
   null, 
   1293558540.0
  ], 
  [
   420323, 
   null, 
   "Bennedict", 
   "i love these stories of discovering atheism. for so long ive wanted to hear stories like these, but sadly to say, most of my friends refer to themselves as agnostics (sob). i think with a lot of us, dropping religion has helped us discover a sort of unforseen spiritualism that you just cant get from religion. which is very interesting, seeing as atheism is a lack of faith, and most people think that spirituality is directly linked to faith. i dont think that's true, i feel very humbled and emotional at the thought that i am related to all living things on this planet. i am not special in the world, i am a part of it. i live amongst the plants and animals, i do not have dominion over them. contrast this with the ideas in religious doctrine and they are almost laughable. for people to say that we have dominion over everything on this planet and that God loves his followers far more than he loves his other creations, like animals... thats not spiritual at all! thats just biggoted egotistical arseness. connecting with the world is spiritual, considering it a burden until you reach heaven is not.", 
   {}, 
   420298, 
   null, 
   1293569760.0
  ], 
  [
   420361, 
   null, 
   "Easyrider", 
   "The fool says in his heart, \"There is no God.\"", 
   {}, 
   420323, 
   null, 
   1293582780.0
  ], 
  [
   420363, 
   null, 
   "Xcaliber", 
   "The fool says in his heart, \"There is no God.\"\n\n \n lmao.. typical response from a desperate Christian ... Here EZ... read this, it might help you develop a new strategy... Muahahahahaha...\n \n Myth: Atheists are Fools who Say in their Heart 'There is no God' - Are Atheists Foolish? Are Atheists Corrupt? Do Atheists Do No Good?", 
   {}, 
   420361, 
   null, 
   1293583620.0
  ], 
  [
   420364, 
   null, 
   "Stevil", 
   "The fool says in his heart, \"There is no God.\"\n\n \n If I were to believe in god, I'd also have to believe in Santa, the Tooth Fairy, the Easter Bunny, leprechauns, pegasii, unicorns, demons, thousands of other mythical creatures and not to mention all the other gods worshipped throughout the world current and in the past. There is nothing that separates your god from any of the other imaginative creations of men.", 
   {}, 
   420361, 
   null, 
   1293583800.0
  ], 
  [
   420369, 
   null, 
   "Matthew", 
   "The fool says in his heart, \"There is no God.\"\n\n \n And the damn fool says there is, then behaves like a hatefully selfish little Satan.\n \n The entire line, of course, comes from St. Anselm's Proslogion, wherein he introduces the infamous \"Ontological Argument\" for the existence of God. A subtler and more interesting argument you will never find. But it ultimately fails, for precisely the reasons clarified by Kant in the 18th century.", 
   {}, 
   420361, 
   null, 
   1293585480.0
  ], 
  [
   420379, 
   null, 
   "Bennedict", 
   "5 dollars says EZ will not reply to any of you.", 
   {}, 
   420369, 
   null, 
   1293587400.0
  ], 
  [
   420380, 
   null, 
   "Xcaliber", 
   "5 dollars says EZ will not reply to any of you.\n\n \n lol. thanks but I'll hold on to the 5 spot, I do believe you are right. He'll come back in a day or two and post some drivel in another topic as if this one never happened. I'm beginning to think EX and Zorba are the same person, and I think that Person is Rev. Phelps.", 
   {}, 
   420379, 
   null, 
   1293588000.0
  ], 
  [
   420381, 
   null, 
   "Bennedict", 
   "lol. thanks but I'll hold on to the 5 spot, I do believe you are right. He'll come back in a day or two and post some drivel in another topic as if this one never happened. I'm beginning to think EX and Zorba are the same person, and I think that Person is Rev. Phelps.\n\n \n really? because i always thought EZ was Ray Comfort.", 
   {}, 
   420380, 
   null, 
   1293588540.0
  ], 
  [
   420391, 
   null, 
   "Zorba", 
   "This verse is so simple and basic in its truth, I couldn't help but repeat it in the hope that maybe, just maybe one of you will get it.\n \n \nThe fool says in his heart, \"There is no God.\"\n\n \n And there is also this warning to you who boast in your prideful unbelief of the Living God who made you in His image, for fellowship.\n Mat 12:34 \"You brood of vipers, how can you, being evil, speak [fn] what is good? For the mouth speaks out of that which fills the heart.\n Mat 12:35 \"The good man brings out of his good treasure [fn] what is good; and the evil man brings out of his evil treasure [fn] what is evil.\n Mat 12:36 \"But I tell you that every [fn] careless word that people [fn] speak, they shall give an accounting for it in the day of judgment.\n Mat 12:37 \"For [fn] by your words you will be justified, and [fn] by your words you will be condemned.\"", 
   {}, 
   420361, 
   null, 
   1293592860.0
  ], 
  [
   420393, 
   null, 
   "Xcaliber", 
   "This verse is so simple and basic in its truth, I couldn't help but repeat it in the hope that maybe, just maybe one of you will get it.\n \n \n \n And there is also this warning to you who boast in your prideful unbelief of the Living God who made you in His image, for fellowship.\n Mat 12:34 \"You brood of vipers, how can you, being evil, speak [fn] what is good? For the mouth speaks out of that which fills the heart.\n Mat 12:35 \"The good man brings out of his good treasure [fn] what is good; and the evil man brings out of his evil treasure [fn] what is evil.\n Mat 12:36 \"But I tell you that every [fn] careless word that people [fn] speak, they shall give an accounting for it in the day of judgment.\n Mat 12:37 \"For [fn] by your words you will be justified, and [fn] by your words you will be condemned.\"\n\n \n \n And just like the first time I give you this...\n Myth: Atheists are Fools who Say in their Heart 'There is no God' - Are Atheists Foolish? Are Atheists Corrupt? Do Atheists Do No Good?\n \n If you're going to post scripture to try and convince someone at least post the entire verse. This particular Verse is a Christian Favorite, but as usual they only pick the part that makes sense to them.", 
   {}, 
   420391, 
   null, 
   1293593520.0
  ], 
  [
   420402, 
   null, 
   "Zorba", 
   "And just like the first time I give you this...\n Myth: Atheists are Fools who Say in their Heart 'There is no God' - Are Atheists Foolish? Are Atheists Corrupt? Do Atheists Do No Good?\n \n If you're going to post scripture to try and convince someone at least post the entire verse. This particular Verse is a Christian Favorite, but as usual they only pick the part that makes sense to them.\n\n \n Here's the complete passage for you then;\n Psalm 14.1-3 - The fool has said in his heart, \"There is no God.\" They are corrupt, they have done abominable works, there is none who does good. The LORD looks down from heaven upon the children of men, to see if there are any who understand, who seek God. They have all turned aside, they have together become corrupt; there is none who does good, no, not one.\n Feel better? This defines the hearts of men to a T, including believers who even though we have received forgiveness through Gods grace and mercy, still suffer from the sinful natures affects within this corrupted flesh. The difference between us and you is we are attempting to be more like Christ our Savior in this lifetime.", 
   {
    "unicode_changes_made": true
   }, 
   420393, 
   null, 
   1293595140.0
  ], 
  [
   420405, 
   null, 
   "Xcaliber", 
   "Here's the complete passage for you then;\n Psalm 14.1-3 - The fool has said in his heart, \"There is no God.\" They are corrupt, they have done abominable works, there is none who does good. The LORD looks down from heaven upon the children of men, to see if there are any who understand, who seek God. They have all turned aside, they have together become corrupt; there is none who does good, no, not one.\n Feel better? This defines the hearts of men to a T, including believers who even though we have received forgiveness through Gods grace and mercy, still suffer from the sinful natures affects within this corrupted flesh. The difference between us and you is we are attempting to be more like Christ our Savior in this lifetime.\n\n \n Well at least you posted the whole thing. But I am willing to bet you didn't even bother reading my link. You know the one that tears this particular scripture down and explains the meaning . How Christians like to use the first part to make themselves feel better for calling every non-Christian person on the planet a Fool. \n \n See, your religion is not the only religion on this planet. I know you would like to believe it so, but truth hurts sometimes. Religion was around for Centuries before YOUR god was even created. The Entire Christian religion is Borrowed from previous religions and added to as time advanced. This is the part that Christians simply refuse to see. You're taught that Your GOD is the only GOD, and everyone else, all 4 billion of them are wrong. that is what I call Arrogance, and the sad thing is that ALL religions are the same .", 
   {
    "unicode_changes_made": true
   }, 
   420402, 
   null, 
   1293596340.0
  ], 
  [
   420416, 
   null, 
   "Zorba", 
   "Well at least you posted the whole thing. But I am willing to bet you didn't even bother reading my link. You know the one that tears this particular scripture down and explains the meaning . How Christians like to use the first part to make themselves feel better for calling every non-Christian person on the planet a Fool. \n \n See, your religion is not the only religion on this planet. I know you would like to believe it so, but truth hurts sometimes. Religion was around for Centuries before YOUR god was even created. The Entire Christian religion is Borrowed from previous religions and added to as time advanced. This is the part that Christians simply refuse to see. You're taught that Your GOD is the only GOD, and everyone else, all 4 billion of them are wrong. that is what I call Arrogance, and the sad thing is that ALL religions are the same .\n\n \n Can we be serious for a second here? Would you accept a Creationist web sites explanation for how we got here? Then why would you think I would accept an atheist websites explanation of any bible passages at all? The very idea is ludicrous because they have absolutely no spiritual insights at all to speak of. \n \n Try finding a theologically acceptable source to defend your warped and corrupted interpretations of the bible and then I will respect it. But as long as you use lies to refute the truth of Gods word we'll get nowhere at all.", 
   {}, 
   420405, 
   null, 
   1293601200.0
  ], 
  [
   420417, 
   null, 
   "Penfold", 
   "Can we be serious for a second here? Would you accept a Creationist web sites explanation for how we got here? Then why would you think I would accept an atheist websites explanation of any bible passages at all? The very idea is ludicrous because they have absolutely no spiritual insights at all to speak of. \n \n Try finding a theologically acceptable source to defend your warped and corrupted interpretations of the bible and then I will respect it. But as long as you use lies to refute the truth of Gods word we'll get nowhere at all.\n\n \n There are none so blind.... Few theological sources are likely to express the view that gods are a crock.\n By precisely your own logic, quoting random woo woo supernatural guff at rational human beings isn't going to influence our world view. All these years, Archie, and you still don't get it.", 
   {}, 
   420416, 
   null, 
   1293604860.0
  ], 
  [
   420418, 
   null, 
   "Xcaliber", 
   "Can we be serious for a second here? Would you accept a Creationist web sites explanation for how we got here? Then why would you think I would accept an atheist websites explanation of any bible passages at all? The very idea is ludicrous because they have absolutely no spiritual insights at all to speak of. \n \n Try finding a theologically acceptable source to defend your warped and corrupted interpretations of the bible and then I will respect it. But as long as you use lies to refute the truth of Gods word we'll get nowhere at all.\n\n \n Tell me what Lies did I use?.. I used the Bible itself and still you don't see it. There is no Theological source , that's why we have to go outside the Lies and corruption of the Bible to find the truth. You're speaking as if the Bible is truly the Words of God, which any sane person knows is not true. When you accept that your religion, your God, and your Bible are all mans creation then maybe, just maybe you will see the light.", 
   {}, 
   420416, 
   null, 
   1293604980.0
  ], 
  [
   420425, 
   null, 
   "Easyrider", 
   "There are none so blind.... Few theological sources are likely to express the view that gods are a crock.\n By precisely your own logic, quoting random woo woo supernatural guff at rational human beings isn't going to influence our world view. All these years, Archie, and you still don't get it. \n\n \n You're in over your head on Bible Theology, Penfold. And you're one day closer to the Pit (unless you repent and receive Christ). And that goes for the other godless Christ-deniers who post around here.", 
   {}, 
   420417, 
   null, 
   1293631800.0
  ], 
  [
   420434, 
   null, 
   "Matthew", 
   "It occurs to me that what is truly and completely depraved is not human nature itself, but the opinion that human nature is inherently depraved -- that we are one and all \"corrupt\" and in need of salvation from the moment we're born. How utterly nihilistic and self-loathing.", 
   {}, 
   420405, 
   null, 
   1293635700.0
  ], 
  [
   420456, 
   null, 
   "jazyjason", 
   "It occurs to me that what is truly and completely depraved is not human nature itself, but the opinion that human nature is inherently depraved -- that we are one and all \"corrupt\" and in need of salvation from the moment we're born. How utterly nihilistic and self-loathing.\n\n \n \n This is the essence of the danger of religion Matthew. We have had it burned into our minds since birth that we are evil. That we \"need\" saving. That men go all their lives dancing to the puppet strings of those who smile in sick satisfaction gazing down upon these poor ignorant people.\n \n These people go their whole lives working for a concept of an afterlife that which as not been proven nor exists. Their scolded and coddled into believing in hellfire which without oxygen and a fuel source would not exist cannot exist in reality...\n \n I can tell you that it is quite painful and sad that I wasted nearly 18 years of my life believing I was bad, that I was a wretch, that I loathed my humanity instead of embracing it.\n \n It's going to be a shock to someone when they finally wake up and realize all they were taught by these madmen, these delusional sick puppet masters was all a lie...", 
   {}, 
   420434, 
   null, 
   1293661980.0
  ], 
  [
   420457, 
   null, 
   "jazyjason", 
   "You're in over your head on Bible Theology, Penfold. And you're one day closer to the Pit (unless you repent and receive Christ). And that goes for the other godless Christ-deniers who post around here.\n\n \n \n So then anyone else who prays to other milk jugs or doesn't believe in my milk jug are going to hell. Gotcha Easy.", 
   {}, 
   420425, 
   null, 
   1293662040.0
  ], 
  [
   420468, 
   null, 
   "Bennedict", 
   "So then anyone else who prays to other milk jugs or doesn't believe in my milk jug are going to hell. Gotcha Easy.\n\n \n you learn quickly, young padawan.", 
   {}, 
   420457, 
   null, 
   1293664320.0
  ], 
  [
   420469, 
   null, 
   "jazyjason", 
   "you learn quickly, young padawan.\n\n \n Do I get my lightsaber now? emoticon_xbouncer", 
   {}, 
   420468, 
   null, 
   1293664440.0
  ], 
  [
   420472, 
   null, 
   "Xcaliber", 
   "Do I get my lightsaber now? emoticon_xbouncer\n\n \n Maybe the Golden Milk Jug award. I got mine when I started thinking with reason. Whenever you get the urge to pray for something you pray to the Golden Milk Jug, it answers prayer at the same rate and consistency of God without all the baggage of religion.", 
   {}, 
   420469, 
   null, 
   1293665460.0
  ], 
  [
   420488, 
   null, 
   "Bennedict", 
   "Maybe the Golden Milk Jug award. I got mine when I started thinking with reason. Whenever you get the urge to pray for something you pray to the Golden Milk Jug, it answers prayer at the same rate and consistency of God without all the baggage of religion.\n\n \n ah, yes. the Golden Milk Jug sculpture replica. use it wisely, dont pray to it too often otherwise the probability of successful outcomes will be botched.", 
   {}, 
   420472, 
   null, 
   1293669960.0
  ], 
  [
   420501, 
   null, 
   "jazyjason", 
   "Maybe the Golden Milk Jug award. I got mine when I started thinking with reason. Whenever you get the urge to pray for something you pray to the Golden Milk Jug, it answers prayer at the same rate and consistency of God without all the baggage of religion.\n\n \n B..but lightsabers are so much cooler...", 
   {}, 
   420472, 
   null, 
   1293675780.0
  ], 
  [
   420504, 
   null, 
   "Xcaliber", 
   "B..but lightsabers are so much cooler...\n\n \n Yeah I will agree with that.. This is just a Gold Milk Jug, it has no \" Force\" or supernatural abilities.", 
   {}, 
   420501, 
   null, 
   1293676260.0
  ], 
  [
   420505, 
   null, 
   "Easyrider", 
   "So then anyone else who prays to other milk jugs or doesn't believe in my milk jug are going to hell. Gotcha Easy.\n\n \n No jugs, jazy.\n \n It's either Christ or the Highway to perdition. If you have that down then pass it on to your fellow heathens.", 
   {}, 
   420457, 
   null, 
   1293677580.0
  ], 
  [
   420506, 
   null, 
   "Xcaliber", 
   "No jugs, jazy.\n \n It's either Christ or the Highway to perdition. If you have that down then pass it on to your fellow heathens.\n\n \n \n lol.. Is this your new strategy EZ?.. Sign in as invisible so no one knows you're here, sneak in and make a quick, two line insult post, and then run before anyone knows you were here?... Good luck with that...lol..", 
   {}, 
   420505, 
   null, 
   1293677940.0
  ], 
  [
   420514, 
   null, 
   "jazyjason", 
   "No jugs, jazy.\n \n It's either Christ or the Highway to perdition. If you have that down then pass it on to your fellow heathens.\n\n \n Your now on Ignore Easy. You and Zorba both. Enjoy your delusional perception of reality. Oh and Gay sex rocks. C ya.", 
   {}, 
   420505, 
   null, 
   1293692400.0
  ], 
  [
   420520, 
   null, 
   "Zorba", 
   "Your now on Ignore Easy. You and Zorba both. Enjoy your delusional perception of reality. Oh and Gay sex rocks. C ya.\n\n \n Run away little boy, a grown ups debate forum is no place for children anyway. One day you will learn that you ignored the only people who actually told you the truth, no matter how painful it was at the time. That those who gave you wise council were the very people you hated the most. You will hate yourself most of all as you face your eternal condemnation that you will realize you chose freely and knowingly. emoticon_xbye emoticon_rolleyes", 
   {}, 
   420514, 
   null, 
   1293702120.0
  ], 
  [
   420555, 
   null, 
   "Bennedict", 
   "Your now on Ignore Easy. You and Zorba both. Enjoy your delusional perception of reality. Oh and Gay sex rocks. C ya.\n\n \n no jugs required.\n \n oh man..... lol!", 
   {}, 
   420514, 
   null, 
   1293744660.0
  ], 
  [
   420562, 
   null, 
   "jazyjason", 
   "no jugs required.\n \n oh man..... lol!\n\n \n See I love it when they equate debating to nothing more than a urinating match. Trying to call me \"little man\" or something to that effect. It's just very amusing seeing how much both of them cannot stand the fact that they won't invoke an emotional response from me, let alone go down to their level of insulting either.\n \n Instead once again of trying to debate upon points and relevance it's nothing more than a shouting match. It really does get old.\n \n Oh and yeah... No jugs required x.x", 
   {}, 
   420555, 
   null, 
   1293750720.0
  ], 
  [
   420565, 
   null, 
   "Easyrider", 
   "Your now on Ignore Easy. You and Zorba both. Enjoy your delusional perception of reality. Oh and Gay sex rocks. C ya.\n\n \n The humorus thing about the radical homosexual community is that not only do you people want to be accepted as 'normal' Americans, but you actually want yourselves and your depraved life style to be revered and glorified. \n \n You've got three chances of that happening: A slim chance, a fat chance, and no chance.\n \n Gay sex is an abomination. Get help.", 
   {}, 
   420514, 
   null, 
   1293758040.0
  ], 
  [
   420611, 
   null, 
   "jazyjason", 
   "The humorus thing about the radical homosexual community is that not only do you people want to be accepted as 'normal' Americans, but you actually want yourselves and your depraved life style to be revered and glorified. \n \n\n \n Is it normal to rape women and kill children in the name of god Easyrider? Is it normal to burn towns, sack peoples homes, and kill the animals as well in the name of your god?\n \n If this is your definition of normal I am so very thankful I am not a part of it. Lets see you attempt to wiggle around more of your own books evidence by insulting me and changing the subject. \n \n This has to be about the 4th reply where I point out to you the damnable actions commanded by your infallible bible. I doubt you will attempt to even look me in the face when you again try to insult me and weasel around the hard questions I ask and the points I make.", 
   {}, 
   420565, 
   null, 
   1293833880.0
  ], 
  [
   420651, 
   null, 
   "Easyrider", 
   "Is it normal to rape women and kill children in the name of god Easyrider? Is it normal to burn towns, sack peoples homes, and kill the animals as well in the name of your god?\n\n \n Were those people and places under God's Judgment, jazy? Like in Sodom and Gomorrah? \n \n Why don't you read the following and get your twisted theology under control?\n \n The sins of the Amorites\n \n \"In Genesis 15:13, 16 God says to Abraham, &#8220;Your descendants will be strangers in a land that is not theirs, where they will be enslaved and oppressed four hundred years&#8230;. Then in the fourth generation they shall return here, for the iniquity of the Amorites is not yet complete.&#8221; \n \n The return of Israel to the Promised Land from Egypt would correspond with the &#8220;completion&#8221; of the iniquity of the Amorites. This is the meaning of the slaughter of the peoples of Canaan. God timed the arrival of his judgment with the fullness of the sin to be judged. Not before. God did not jump the gun. He was, in fact, longsuffering and endured the idolatry and sins of the nations for centuries, giving them &#8220;rains from heaven and fruitful seasons, satisfying [their] hearts with food and gladness&#8221; (Acts 14:17). As Derek Kidner says, &#8220;Until it was right to invade, God&#8217;s people must wait, if it cost them centuries of hardship.  Genesis 15:16 is one of the pivotal sayings of the Old Testament&#8221; (Genesis, p. 125). \n \n   But there comes a time when the sins of a people are &#8220;complete.&#8221; That is the time for decisive judgment. The appointed instrument of God&#8217;s judgment was the army of Israel.\"\n \n What Does the Slaughter of the Amorites Mean? - Desiring God\n \n What were the sins of the Amorites, and how were they so bad? Read Leviticus 18, which outlines these sins: sacrificing their children (Leviticus 18:21), sexual relations with their mothers (Leviticus 18:6&#8211;8), sex with animals (Leviticus 18:23), etc. \n \n http://www.answersingenesis.org/articles/2010/10/08/feedback-is-god-selfish-and-vindictive\n \n \n\n This has to be about the 4th reply where I point out to you the damnable actions commanded by your infallible bible. I doubt you will attempt to even look me in the face when you again try to insult me and weasel around the hard questions I ask and the points I make.\n\n \n Dry up with your nonsense. You've been educated on these issues in the past and the information goes right through your skull and out the other side.\n \n And I'll tell you something else - Hell is real and the Bible says you're going unless you repent of your stiff-necked sins and anti-Biblical folly and receive Christ as your Lord and Savior for the remission of your sins. \n \n Finally, as an atheist you have no objective basis for saying what's \"right and wrong\" since from an evolutioniary basis there are no moral guidelines. That's one of the Achille's Heels atheism has that you're going to have to live with.\n \n So wise up.", 
   {}, 
   420611, 
   null, 
   1293889380.0
  ], 
  [
   420653, 
   null, 
   "jazyjason", 
   "Were those people and places under God's Judgment, jazy? Like in Sodom and Gomorrah? Why don't you read the following and get your twisted theology under control?\n\n \n Read what? Delusion? Fantasy? Utter nonsense? You claim it was god. You claim it was some being that justifies what normal rational people see as atrocity!\n \n And yet you try to somehow justify it as righteousness. That is sick in itself!\n \n \nThe sins of the Amorites\n\n \n \n \n What Does the Slaughter of the Amorites Mean? - Desiring God[/QUOTE]\n \n You gave me this : god planned it so it was OK. That's it. Another stupid excuse... Doesn't hold water and I can tell your infuriated by it.\n \n \n \n \nDry up with your nonsense. You've been educated on these issues in the past and the information goes right through your skull and out the other side.\n\n \n Educated? How about Indoctrinated Easy? That's more along the line you people do to brainwash the gullible.\n \n \nAnd I'll tell you something else - Hell is real and the Bible says you're going unless you repent of your stiff-necked sins and anti-Biblical folly and receive Christ as your Lord and Savior for the remission of your sins. So wise up.\n\n \n The bible says the bible says.... The Bible also says in black and white contradictions, and atrocities committed in the name of the bible's god. You threaten me when you yourself cannot even prove let alone defend the actual immoral actions of the bibles people in justification of their god...", 
   {}, 
   420651, 
   null, 
   1293890220.0
  ], 
  [
   420675, 
   null, 
   "Easyrider", 
   "\n \n You gave me this : god planned it so it was OK. That's it. Another stupid excuse... Doesn't hold water and I can tell your infuriated by it.\n\n \n God responded to the sins of the Amorites. He didn't plan for them to kill their own children, etc. So get it straight.\n \n \n\n The bible says the bible says.... The Bible also says in black and white contradictions, and atrocities committed in the name of the bible's god. \n\n \n And blah, blah, blah. \n \n Once again, you can't tell the difference between murder and justice. That's a common problem with you radicals. You don't know good from evil.\n \n p.s. I thought I was on Ignore? Make up your mind.", 
   {}, 
   420653, 
   null, 
   1293910500.0
  ], 
  [
   420681, 
   null, 
   "Zorba", 
   "\n \n p.s. I thought I was on Ignore? Make up your mind.\n\n \n Don't forget he's a lying reprobate so he can't help it. lol...", 
   {}, 
   420675, 
   null, 
   1293914280.0
  ], 
  [
   420687, 
   null, 
   "jazyjason", 
   "God responded to the sins of the Amorites. He didn't plan for them to kill their own children, etc. So get it straight.\n\n \n Oh yeah.... knowing the mind of god again right Easy?\n \n \n \n \nAnd blah, blah, blah. \n\n \n yes blah blah blah. Stick your head in the sand and scream to drown out the facts engulfing you Easy.\n \n \nOnce again, you can't tell the difference between murder and justice. That's a common problem with you radicals. You don't know good from evil.\n\n \n Murder and Justice? So if your god said fly planes into buildings it would then be Justice? If your god told you to attack a foreign military with bombs, with suicide attacks and kill all the non believers is that vindicated justice???\n \n Your a thin step from becoming this Easy. A very thin line is what you tread and clearly it alarms me and others here to see how steadily your mind is slipping from reality.\n \n \np.s. I thought I was on Ignore? Make up your mind.\n\n \n You are on ignore genius. The wonderful thing about technology is I can still view and respond to your post if I so choose.\n \n I'm still awaiting a response from you about the evidence I gave you in that article.", 
   {}, 
   420675, 
   null, 
   1293918840.0
  ], 
  [
   420689, 
   null, 
   "jazyjason", 
   "Don't forget he's a lying reprobate so he can't help it. lol...\n\n \n Anything to soothe your conflicting mind Archie. You both must have the best of company. And is it not ironic you both post early in the morning within 10 minutes of one another daily? \n \n It is quite interesting to follow your posting patterns.\n \n And yes your on ignore. And you of all people should know about the view post function... But I guess I am a liar right?", 
   {}, 
   420681, 
   null, 
   1293918900.0
  ], 
  [
   420692, 
   null, 
   "Xcaliber", 
   "Anything to soothe your conflicting mind Archie. You both must have the best of company. And is it not ironic you both post early in the morning within 10 minutes of one another daily? \n \n It is quite interesting to follow your posting patterns.\n \n And yes your on ignore. And you of all people should know about the view post function... But I guess I am a liar right?\n\n \n Maybe we can Get Ez and Zorba to put themselves on Ignore?...", 
   {}, 
   420689, 
   null, 
   1293919140.0
  ], 
  [
   420693, 
   null, 
   "jazyjason", 
   "Maybe we can Get Ez and Zorba to put themselves on Ignore?...\n\n \n I dunno. I think they enjoy piggybacking off each others posts way too much, Misery must love company.", 
   {}, 
   420692, 
   null, 
   1293919260.0
  ], 
  [
   420697, 
   null, 
   "Xcaliber", 
   "I dunno. I think they enjoy piggybacking off each others posts way too much, Misery must love company.\n\n \n lol.. I just imagined Ez and Zorba headbanging to Metallica and singing that to each other..lmao", 
   {}, 
   420693, 
   null, 
   1293920340.0
  ], 
  [
   420702, 
   null, 
   "jazyjason", 
   "lol.. I just imagined Ez and Zorba headbanging to Metallica and singing that to each other..lmao\n\n \n Aww.... don't insult Metallica.... lol.", 
   {}, 
   420697, 
   null, 
   1293922440.0
  ], 
  [
   420709, 
   null, 
   "Easyrider", 
   "Maybe we can Get Ez and Zorba to put themselves on Ignore?...\n\n \n Maybe you two can go climb a couple of parking meters.", 
   {}, 
   420692, 
   null, 
   1293925800.0
  ], 
  [
   420710, 
   null, 
   "Easyrider", 
   "So if your god said fly planes into buildings it would then be Justice? If your god told you to attack a foreign military with bombs, with suicide attacks and kill all the non believers is that vindicated justice???\n\n \n <flush< \n \n Go read Genesis 15:16.\n \n However, I think if he did a major earthquake on the homosexual bath houses of San Francisco it would be justified.\n \n Romans 1:26-27", 
   {}, 
   420687, 
   null, 
   1293925980.0
  ], 
  [
   420717, 
   null, 
   "jazyjason", 
   "Maybe you two can go climb a couple of parking meters.\n\n \n Sorry I don't take objects that big Easy. Nice try on the blatant sexual insult though. Really showing your Christianity there pal.", 
   {}, 
   420709, 
   null, 
   1293929820.0
  ], 
  [
   420718, 
   null, 
   "jazyjason", 
   "<flush< \n \n Go read Genesis 15:16.\n \n However, I think if he did a major earthquake on the homosexual bath houses of San Francisco it would be justified.\n \n Romans 1:26-27\n\n \n You give me scriptures and avoid the meat of the question again.... \n \n When will you actually stop hiding behind throwing scriptures out and ignoring the ones I point out to you? Your all pick and choose Easy. \n \n Oh and fyi there are no more Bath Houses in San Fransisco anymore. And it wouldn't be gods doing on an earthquake anyways. Science Easy. It's a beautiful thing...\n \n You should try it some time.", 
   {}, 
   420710, 
   null, 
   1293929940.0
  ], 
  [
   420724, 
   null, 
   "Xcaliber", 
   "Maybe you two can go climb a couple of parking meters.\n\n \n Typical Reply from a Desperate Religious Zealot who has nothing to offer in support of his Delusion. Really shows how knowledgeable you are.", 
   {}, 
   420709, 
   null, 
   1293930780.0
  ], 
  [
   420741, 
   null, 
   "Easyrider", 
   "Typical Reply from a Desperate Religious Zealot who has nothing to offer in support of his Delusion. Really shows how knowledgeable you are.\n\n \n <Flush<\n \n Better lay off the Kool Aid, Snicklefritz. You're embarrassing yourself.", 
   {}, 
   420724, 
   null, 
   1293940740.0
  ], 
  [
   420745, 
   null, 
   "jazyjason", 
   "<Flush<\n \n Better lay off the Kool Aid, Snicklefritz. You're embarrassing yourself.\n\n \n Why Easy? Why must you always dumb down and bring discussions to the most basic of human insults? First with that sexual insult with the parking meter and now this...\n \n I wonder, is this the typical action of a righteous christian? Oh how far you have fallen Easy... Stumbled and fallen and utterly blind. Blind and screaming trying to feel your way through life inch by inch....\n \n This is your blind faith and I can clearly see it for what it really is...", 
   {}, 
   420741, 
   null, 
   1293943560.0
  ], 
  [
   420746, 
   null, 
   "MrWriteLA", 
   "We all see what it is. (All except for his equally deluded roommates.)", 
   {}, 
   420745, 
   null, 
   1293943740.0
  ], 
  [
   420747, 
   null, 
   "Xcaliber", 
   "<Flush<\n \n Better lay off the Kool Aid, Snicklefritz. You're embarrassing yourself.\n\n \n \n I like the Grape Flavored best, But I won't be drinking any KoolAid with you or one of your religious Cult Fanatics... \n \n And why would I be embarrassed about telling the truth?....", 
   {}, 
   420741, 
   null, 
   1293944580.0
  ], 
  [
   422350, 
   null, 
   "Matthew", 
   "I think if he [God] did a major earthquake on the homosexual bath houses of San Francisco it would be justified.\n\n \n Earthquakes are rather blunt instruments. If a major earthquake were to strike San Francisco, it would probably kill some homosexuals. But also some Christians and some conservatives (believe it or not, both can be found there). And almost certainly some kids. Would that be justified, as collateral damage while taking out the gays?\n \n And isn't it a bit presumptuous anyway, for you to say what sorts of divine punishment would be justified for which people? As usual, it seems to me that you, and not the atheists, are the great blashpemers: you are putting yourelf in the position of God. Maybe even above that position, insofar as you make pronouncements about what is justified for him. Your hubris is astounding.", 
   {}, 
   420710, 
   null, 
   1295028120.0
  ], 
  [
   423257, 
   null, 
   "kowalskil", 
   "So I'm contemplating and wrestling with a few things in my mind. Kind of like that little voice in the back of your head that you don't wanna listen to. Now I'm sure many here have been raised by a religious family and such so they know where I'm coming from.\n \n Now this is kind of parallel to the history of me coming out, wrestling with my sexuality but it also seems to border more on maturity and rationale than anything else. \n \n seeing for a very long time the hypocrisy of alot of religious people, the slander, the hated and just the history of we as humans in general feuding and warring over religion for centuries I ask myself why?\n \n Sure I say I'm a Christian, I even in the most difficult of circumstances I pray or attempt to and it just seems empty! The whole religious experience seems empty! Just like going through the motions when hiding my orientation, saying of yeah I believe in God or Jesus or whatever..\n \n but the more I look at the typical religious person, the more I see just how crazed and out of whack alot of these people are I just feel as if there was a god he'd be ashamed of people like that...\n \n I also wonder what about atheism? Or even being an agnostic? The notion of someone dying for my faults is a simple yet bold concept, but coupled with all the fallacy, the pomp and convoluted XXXXXXXX that now tarnishes religion I just find myself not being able to go through it anymore!\n \n I mean... my friend is a bordering agnostic/ atheist and we've been friends for years. he's seen my struggle and knows every fight, detail, and issue I've gone through. We've had many discussions just on the concept of religion in general and even seen and read some very convincing articles by atheists.\n \n it seems to me that there is a war between utter blindness, the leading of the masses by fear and control like it's been throughout the centuries and the enlightenment. The opening and budding of man through rationale and reason.\n \n Through methodical concept and thinking. Not on the emotion of a person doing cheap parlor tricks or frothing at the mouth playing his role....\n \n I invite RATIONALE discussion on this issue. if you insult or try to deviate from the topic like a few users here are known to. I am going to report you.\n \n This is one topic I don't want derailed... So if you don't have something positive or enlightening to bring to the table stay out of it..\n\n \n Thank you for sharing, Jazyjason. To promote the discussion you want I am going to post a new topic--\"About unnecessary confrontations.\"", 
   {}, 
   419976, 
   null, 
   1296014640.0
  ], 
  [
   423265, 
   null, 
   "MrWriteLA", 
   "Thank you for sharing, Jazyjason. To promote the discussion you want I am going to post a new topic--\"About unnecessary confrontations.\"\nSounds like an appropriate thread for what you just posted.", 
   {}, 
   423257, 
   null, 
   1296017940.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is it just me or is my perception changing?", 
  "url": "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 14824, 
  "discussion_files": [
   [
    "2963.html", 
    "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing-print.html"
   ], 
   [
    "2964.html", 
    "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing-5-print.html"
   ], 
   [
    "2965.html", 
    "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing-4-print.html"
   ], 
   [
    "2966.html", 
    "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing-3-print.html"
   ], 
   [
    "2967.html", 
    "http://www.4forums.com/political/religion-debates/14824-just-me-my-perception-changing-2-print.html"
   ]
  ], 
  "identifier": 14824
 }
]