[
 [
  [
   420422, 
   null, 
   "Supposn", 
   "Due only to financial considerations we weigh our options and invest resources and efforts to maximize probable profits and minimized risks and losses. (Behavioral economists deal with other than pure profit motivations). Considering only finances, small gains and insignificant risks are preferable to no gains at all.\n \n A tax's insufficient revenue rate may likely fail to justify the tax's overhead expense. If the tax rate is increased, the tax's rate of yield, (e.g. tax's revenue / tax's rate) is improved due to \"economies of scale\" but increasing tax rates often increase other factors' detrimental effects upon a tax's rate of yield.\n \n A common characteristic of high tax rates are the rates' inducing increased dedication of resources and efforts for legal avoidance and/or criminal evasion of those taxes. Tax payers often transfer their participation to activities subject to lesser taxes.\n \n A tax increased to an extremely high rate will decrease that individual tax's rate of yield but the tax's revenue, and/or the government's aggregate total tax revenues usually continue to (somewhat) increase more than otherwise. [I do not generally advocate or approve of such tax policy but this is my logical observations and conclusions of the policy's likely effect].\n \n Only enacting or increasing a tax to a severely excessive rate would (due to the high rate) not induce government's total tax revenues to somewhat increase more than otherwise; Only significantly decreasing a tax rate from a prior severely excessive rate would increase the revenue due from that tax. Supply-sider economists would have us believe that such modification of tax rates within other than such exceptional circumstances would themselves produce similar financial results. Their contentions are nonsensical.\n \n Respectfully, Supposn", 
   {
    "post_info": {
     "post_title": "Supply side economics"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1293621480.0
  ], 
  [
   420480, 
   null, 
   "Symbiote", 
   "Attempts to forecast the specific point where return is maximised is the role of the 'entrepeneur' or 'speculator', although I use the term loosely, since in this case the entrepeneurialism is in theft and the speculation is about maximising the return on that theft.\n \n Economics is a qualitative science. And there is no general qualitative law, derived from principle, that \"The greater the tax rate, the greater the revenue\" or \"The lower the tax rate, the lower the revenue\".\n \n The only logically true thing we can say is \"There is at least one point where return is maximised, and return at all other points is lower\". (You term this point \"excessive\", which seems to me a pretty relative term).\n \n It isn't the specifics of the supply side notion that are necessarily wrong, it is simply wrong to make a determination as economists one way or the other, they might as well be telling us what the correct price of a Big Mac is.", 
   {}, 
   420422, 
   null, 
   1293668160.0
  ], 
  [
   420870, 
   null, 
   "Supposn", 
   "Attempts to forecast the specific point where return is maximised is the role of the 'entrepeneur' or 'speculator', although I use the term loosely, since in this case the entrepeneurialism is in theft and the speculation is about maximising the return on that theft.\n \n Economics is a qualitative science. And there is no general qualitative law, derived from principle, that \"The greater the tax rate, the greater the revenue\" or \"The lower the tax rate, the lower the revenue\".\n \n The only logically true thing we can say is \"There is at least one point where return is maximised, and return at all other points is lower\". (You term this point \"excessive\", which seems to me a pretty relative term).\n \n It isn't the specifics of the supply side notion that are necessarily wrong, it is simply wrong to make a determination as economists one way or the other, they might as well be telling us what the correct price of a Big Mac is.\n\n \n Symbiote, the first paragraph of your message reads as an anarchist&#8217;s creed.\n I have little patience with using the term &#8220;social science&#8221; rather than &#8220;social studies&#8221;. Economics is not a science.\n \n [Even mathematics is a family of related philosophies. Mathematics is the most exacting among all philosophies. When mathematicians cannot resolve an exception to a rule, it is a quandary. Resolved or unresolved exceptions to rules are intolerable; an acceptable rule has no exceptions. The precision, (exactness with complete absence of exception and ambiguity) demanded by mathematical philosophies are similar to those of the physical sciences].\n \n You are correctly accept the concept there&#8217;s at least one point along a graphed line of an individual tax&#8217;s tax rates that achieves that tax&#8217;s maximum rate of revenue yield. That tax&#8217;s rate of yield = [government&#8217;s net revenue (directly and indirectly) due to the tax / the tax&#8217;s rate].\n \n What I believe is the more important point of my message is that supply-side economists pretend that a concept applicable only to extremely severe tax rates is also applicable to less severe circumstances. Generally, even when applied to less than severe but high tax rates, tax cuts do not pay for themselves. \n \n What did you mean when you wrote the last paragraph of your message? Can you reword it? \n \n Respectfully, Supposn", 
   {}, 
   420480, 
   null, 
   1294045800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Supply side economics", 
  "url": "http://www.4forums.com/political/economics-debates/14831-supply-side-economics.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 14831, 
  "discussion_files": [
   [
    "2266.html", 
    "http://www.4forums.com/political/economics-debates/14831-supply-side-economics-print.html"
   ]
  ], 
  "identifier": 14831
 }
]