[
 [
  [
   420568, 
   null, 
   "Nozza123", 
   "As the couple exited the theater just before 10 p.m., Kayln Freire was surrounded by about 15 girls who appeared like they were going to attack her, Federico Freire said.\n \n A witness told Freire that he had a firearm in his vehicle and offered to escort the couple to safety.\n \n Federico Freire said he told his wife to go with the witness to get her out of harm's way.\n \n Seven males then surrounded Federico Freire and began to kick and punch him, according to the sheriff's office report; he was struck across the left side of his face.\n \n \"I got back up to defend myself and they started running everywhere,\" he said.\n \n A crowd of about 100 people began to form.\n \n When Freire looked to his wife, he said he saw a young male with his shirt off punch her in the face, knocking her out.\n \n Freire said he went after the youth and the witness brandished his gun, telling the crowd to step back.\n \n Deputies arrived shortly thereafter.\n \n White Couple Attacked By Dozens of Black &#8220;Youths&#8221; in Bradenton, Florida, Media Silent : Conservative Nation\n \n I am going to love watch Brady and Co defend their \"guns dont work as a self defense tool\" stance", 
   {
    "post_info": {
     "post_title": "Another Example of how Defensive Gun use is a myth...."
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1293760380.0
  ], 
  [
   420958, 
   null, 
   "Brady", 
   "Thats cherry-picking!", 
   {}, 
   420568, 
   null, 
   1294113420.0
  ], 
  [
   420961, 
   null, 
   "Pietro", 
   "Thats cherry-picking!\n\n \n A one sentence reply is the best you can do to address this issue of a gang violence survivor protecting himself and coming out alive and ahead of the situation? You're really starting to slip in terms of quality Brady, if that's at all possible.\n \n You claim that Nozza's post is an example of cherry picking. Yet you offer no examples of just how this qualifies as cherry picking. You just blurt it out and expect us to take your word for it. You failed to elaborate on just how reporting an incident of gang violence amounts to this. Cherry picking is the practice of taking a selected example that fits one's personal position the best, and putting it forward in a manner to try and suggest that it's the norm and the status quo of everyday events.\n \n With this fact in mind, one could easily suggest that a lot of what you post and point to amounts to cherry picking practices.", 
   {}, 
   420958, 
   null, 
   1294114680.0
  ], 
  [
   420962, 
   null, 
   "zsu2357", 
   "A one sentence reply is the best you can do to address this issue of a gang violence survivor protecting himself and coming out alive and ahead of the situation? You're really starting to slip in terms of quality Brady, if that's at all possible.\n \n You claim that Nozza's post is an example of cherry picking. Yet you offer no examples of just how this qualifies as cherry picking. You just blurt it out and expect us to take your word for it. You failed to elaborate on just how reporting an incident of gang violence amounts to this. Cherry picking is the practice of taking a selected example that fits one's personal position the best, and putting it forward in a manner to try and suggest that it's the norm and the status quo of everyday events.\n \n With this fact in mind, one could easily suggest that a lot of what you post and point to amounts to cherry picking practices.\n\n I took the liberty of highlighting the problem.But the reason he doe's this is\n really quit simple...He has no self-dialogue or in other words he just \"blurt\"s out the first thing that pops into his head.emoticon_smile", 
   {}, 
   420961, 
   null, 
   1294116480.0
  ], 
  [
   421122, 
   null, 
   "Doc Jones", 
   "Thats cherry-picking!\n\n \n Then there is a good crop of cherries to pick. Last I recall, there were over 600 citizens that successfully defended themselves last year including deaths of a perp.\n \n Surely you can show where ABSENCE of self-defense saved a non criminal life?\n \n What's that? Silence? Music to my ears emoticon_xagree", 
   {}, 
   420958, 
   null, 
   1294241400.0
  ], 
  [
   421147, 
   null, 
   "COBHC", 
   "Thats cherry-picking!\n\n \n Like you and Galileo have never done that. emoticon_rolleyes", 
   {}, 
   420958, 
   null, 
   1294270260.0
  ], 
  [
   421217, 
   null, 
   "Superlite27", 
   "Thats cherry-picking!\n\n \n Pretty easy when you have an entire orchard to choose from.\n \n All you have to do is Google \"self defense shooting\", and look at the 1,590,000 results returned in .20 seconds.\n \n Unless you're waiting to eat the results of the \"lives saved by gun control\" search?\n \n Hope you have a snack in your pocket, 'cause you're gonna starve.\n \n That search doesn't bear ANY fruit, much less any cherries to pick in the first place.\n \n Care to explain why?\n \n Didn't think so. That would require honest factual interpretation instead of emotional pandering.", 
   {}, 
   420958, 
   null, 
   1294336200.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Another Example of how Defensive Gun use is a myth....", 
  "url": "http://www.4forums.com/political/gun-control-debates/14835-another-example-how-defensive-gun-use-myth.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14835, 
  "discussion_files": [
   [
    "10568.html", 
    "http://www.4forums.com/political/gun-control-debates/14835-another-example-how-defensive-gun-use-myth-print.html"
   ]
  ], 
  "identifier": 14835
 }
]