[
 [
  [
   420942, 
   null, 
   "jazyjason", 
   "Well looks like gods good work is being done.... \n \n Joe. My. God.: CALIFORNIA: Pastor Who Backed Prop 8 Held On Multiple Child Molestation Charges", 
   {
    "post_info": {
     "post_title": "Prop 8 Pastor Arrested for Child Molestation."
    }
   }, 
   null, 
   null, 
   1294105320.0
  ], 
  [
   420953, 
   null, 
   "Matthew S", 
   "Well looks like gods good work is being done.... \n \n Joe. My. God.: CALIFORNIA: Pastor Who Backed Prop 8 Held On Multiple Child Molestation Charges\n\n \n I love how Joe has his \"This week in holy crimes\" section once a week. They even have that woman preacher caught on tape pilfering perishers homes.", 
   {}, 
   420942, 
   null, 
   1294110720.0
  ], 
  [
   420969, 
   null, 
   "jyoshu", 
   "Gee one pastor out of probably millions is caught in a crime unrelated to the issue of the forum. \n How is this news?", 
   {}, 
   420953, 
   null, 
   1294118100.0
  ], 
  [
   420973, 
   null, 
   "Xcaliber", 
   "Gee one pastor out of probably millions is caught in a crime unrelated to the issue of the forum. \n How is this news?\n\n \n No this is just one of many preachers who have been caught practicing their religion like good Christians all over the country. He happens to be the latest but by no means is he just one...", 
   {}, 
   420969, 
   null, 
   1294120020.0
  ], 
  [
   420974, 
   null, 
   "Matthew S", 
   "Gee one pastor out of probably millions is caught in a crime unrelated to the issue of the forum. \n How is this news?\n\n \n Hardly one \n \n Joe. My. God.\n \n \nOver the last seven days...\n \n Texas: Pastor Earl Post arrested for stalking a teenage girl.\n New York: Rabbi Victor Koltun pleads not guilty to ordering the murders of two men. Koltun was previously sentenced to five years for mail fraud.\n Connecticut: Pastor David Pomales and his children arrested in church brawl.\n Bangladesh: Imam Afsar Ali arrested in connection with the death of a woman who was publicly caned for adultery.\n Kansas: Pastor Mark Holick arrested for attempting to force gospel tracts upon Muslims exiting a mosque.\n Italy: Court upholds the seizure of $30M in Vatican assets used to launder money for the mafia. The Vatican claims it's all a \"misunderstanding.\"\n Texas: Pastor Sandra McGriff arrested for burglary after cops apprehended her stealing two fur coats from the home of a church member. Police also found three purses and a laptop in McGriff's Jaguar.\n California: Father Joseph McCabe denied bail pending extradition to Ireland on numerous counts of child molestation.\n Texas: Pastor Ivory McDaniels charged with multiple counts of sexual assaults on female minors.\n Ireland: Report shows Dublin Archdiocese transferred Father Tony Walsh to cover up numerous sexual assaults on boys and girls. The church never reported Walsh to the police.\n Iowa: Pastor Timothy Parker sentenced to 20 years in prison for sexual assault on a child.\n Bolivia: Father Jose Ochua sentenced to 22 years in prison for sexually abusing at least 19 children in an orphanage.\n \n \n\n \n \n\n New York: Monsignor Charles Kavanagh has been defrocked after being found guilty of child molestation by a three-priest Catholic tribunal. He is the highest-ranked New York priest so judged and has not faced criminal charges.\n Oklahoma: Pastor Baron Hopgood arrested for embezzlement.\n Ireland: Father Oliver O'Grady charged with possessing thousands of child porn images.\n Ohio: Pastor Mark Griggs charged with more than 100 felony counts of possessing and distributing child porn.\n Britain: Monsignor Michael Smith arrested for child molestation.\n Colorado: Pastor Loren Ankarlo pleads guilty to multi-million dollar securities fraud.\n Ontario: Father Donald Grecco found guilty on 24 counts of molesting altar boys.\n Missouri: Father Gerald Howard indicted on three counts of forcible sodomy of a child. Howard was previously convicted of similar crimes in New Jersey under a different name.\n Ohio: Pastor Robert Jones fails to appear at his trial for brandishing a gun at a drive-thru bank teller.\n Ireland: Father Tony Walsh likely to have molested hundreds, according to a new report.\n Britain: Vicar Dominic Stone convicted of possessing child porn.\n Nevada: Pastor Joshua De Los Santos arrested for assaulting a member of a \"competing\" church for not being holy enough.\n Tennessee: Pastor David Hoschar indicted for possessing child porn.\n \n \n\n \nIndiana: Father Byron Canada sentenced to 11 years in prison in $2.7M real estate scam.\n Arkansas: Pastor Robert Burnham resigns after bust in prostitution sting.\n Indiana: Pastor Vaughn Reeves sentenced to 54 years in prison for embezzling over $13M from church construction investors.\n New York: Rabbi Victor Koltun charged two counts of murder in the killings of a police officer and the officer's nephew.\n Wisconsin: Father Thomas Marr pleads guilty to embezzling over $600K from parishioners.\n Indiana: Pastor Jerry Hillenburg sued for sexual harassment by church preschool teacher.\n Illinois: Father Donald McQuire loses appeal over conviction for molesting four boys.\n Netherlands: New report reveals almost 2000 accusations of sexual molestation covered up by Dutch Catholic Church.\n Illinois: Pastor James French charged with sexual abuse of underage girl.\n Missouri: Pastor Glenn Baldridge sentenced to five years probation for $100K check forgery scheme.\n New York: Sister Marie Thornton arrested for embezzling $850K from Iona College, where she was CFO. Thornton reportedly blew the money in Atlantic City.\n California: Will Lynch pleads not guilty to beating the Jesuit priest he claims molested him and and his brother when they were seven and five years old. Lynch wants a public trial since the priest cannot be charged under the statute of limitations.\n Illinois: Archdiocese of Chicago sued for covering up the sexual abuse of a high school freshman. In 2007 Father Daniel McCormack pleaded guilty to molesting multiple boys and is serving five years in prison.\n \n \n\n \n Mind you that this is only 3 weeks worth.", 
   {}, 
   420969, 
   null, 
   1294120260.0
  ], 
  [
   420975, 
   null, 
   "jyoshu", 
   "No this is just one of many preachers who have been caught practicing their religion like good Christians all over the country. He happens to be the latest but by no means is he just one...\n\n \n LOL, You guys are no better than EZ when you try to play the child-molestation card against people. He does the same thing toward gays, and you do it against religious people. Same asinine generalization. You're all a bunch of wingnut fundies, every one of you. (Just two different sides of the aisle)", 
   {}, 
   420973, 
   null, 
   1294120380.0
  ], 
  [
   420978, 
   null, 
   "Xcaliber", 
   "LOL, You guys are no better than EZ when you try to play the child-molestation card against people. He does the same thing toward gays, and you do it against religious people. Same asinine generalization. You're all a bunch of wingnut fundies, every one of you. (Just two different sides of the aisle)\n\n \n I prefer the term Militant Atheist. My goal is to reveal to as many people as possible the Atrocity called religion. So it's just funny to me when some Preacher , Priest, or anyone claiming to be a \"Person of God\", gets caught in the act of doing what they preach against and proving how Hypocritical religious people are.", 
   {}, 
   420975, 
   null, 
   1294122960.0
  ], 
  [
   420985, 
   null, 
   "jyoshu", 
   "I prefer the term Militant Atheist. My goal is to reveal to as many people as possible the Atrocity called religion. So it's just funny to me when some Preacher , Priest, or anyone claiming to be a \"Person of God\", gets caught in the act of doing what they preach against and proving how Hypocritical religious people are.\n\n \n Yeah, and again, that's the sort of thing religious fundies do toward groups they don't like either. So you're on the level of EZ.", 
   {}, 
   420978, 
   null, 
   1294123980.0
  ], 
  [
   420988, 
   null, 
   "Xcaliber", 
   "Yeah, and again, that's the sort of thing religious fundies do toward groups they don't like either. So you're on the level of EZ.\n\n \n I'm not the one claiming to be On some Moral High Ground.. I suppose I can assume from your response that you are in fact blowing hot air and don't have a clue...", 
   {}, 
   420985, 
   null, 
   1294125540.0
  ], 
  [
   420993, 
   null, 
   "jazyjason", 
   "Yeah, and again, that's the sort of thing religious fundies do toward groups they don't like either. So you're on the level of EZ.\n\n \n Your missing the crux of the argument here Jyoshu. The point is this man vehemently defended prop 8 and claimed gays were a threat. Not just one gay, or a handful, all gays are a threat to \"family\" values.\n \n The cruel irony is that this man was the real threat all along.", 
   {}, 
   420985, 
   null, 
   1294132980.0
  ], 
  [
   421004, 
   null, 
   "jyoshu", 
   "Your missing the crux of the argument here Jyoshu. The point is this man vehemently defended prop 8 and claimed gays were a threat. Not just one gay, or a handful, all gays are a threat to \"family\" values.\n The cruel irony is that this man was the real threat all along.\n\n \n That may be but it has nothing to do with prop 8 or the broader issue of marriage. That he was a threat in one way doesn't speak in any way to the issue of threat in the other way.", 
   {}, 
   420993, 
   null, 
   1294157820.0
  ], 
  [
   421007, 
   null, 
   "jazyjason", 
   "That may be but it has nothing to do with prop 8 or the broader issue of marriage. \n \n \n It certainly does! This man shaped peoples opinion on an issue that ultimately effects the rights of others. And you can say it has nothing to do with the broader issue?\n \n What better a place to pin people on an issue when they go to the voting booth then in their most impressionable and vulnerable area? Belief.\n \n \n \n That he was a threat in one way doesn't speak in any way to the issue of threat in the other way.\n\n \n Your brushing off the meat of the issue Jyoshu. He influenced minds, formed peoples opinions and was in a position of authority to govern outcome within certain spheres of influence.\n \n That I feel is the most damaging element. He could have harmed other children, and he certainly harmed others by indoctrinating others in sheer utter hypocrisy.", 
   {}, 
   421004, 
   null, 
   1294159020.0
  ], 
  [
   421008, 
   null, 
   "jyoshu", 
   "It certainly does! This man shaped peoples opinion on an issue that ultimately effects the rights of others. And you can say it has nothing to do with the broader issue?\n\n \n Meh. A lot of things and people helped shape opinions. \n If an anti-prop 8 activist is caught doing something illegal, does that speak to their prop 8 position? same thing, you know. \n \n \nYour brushing off the meat of the issue Jyoshu.\n\n \n No, the meat is that Prop 8 is decided on it's merits, not whether some activist (on EITHER side of the aisle) does something illegal.", 
   {}, 
   421007, 
   null, 
   1294159260.0
  ], 
  [
   421013, 
   null, 
   "jazyjason", 
   "Meh. A lot of things and people helped shape opinions. \n\n \n Oh please... Your response here just proves to me you shrug off the core of the issue here...\n \n \n \nIf an anti-prop 8 activist is caught doing something illegal, does that speak to their prop 8 position? same thing, you know. \n\n \n yes it does! Please Jyoshu stop playing this one sided game! It's tiring! You cannot have your cake and eat it too! I am well aware the spin you are putting on this issue and frankly it's rather ridiculous...\n \n \n \n \nNo, the meat is that Prop 8 is decided on it's merits, not whether some activist (on EITHER side of the aisle) does something illegal.\n\n \n Again avoiding the underlying issue of why that is important. To the Fundamentalist the merits have no context. To the Fundamentalist, the message they receive from their place of worship already decides for them their feelings on the matter...\n \n You forget. Fundamentalists are not objective thinkers Jyoshu...", 
   {}, 
   421008, 
   null, 
   1294160760.0
  ], 
  [
   421128, 
   null, 
   "Accipiter", 
   "Gee one pastor out of probably millions is caught in a crime unrelated to the issue of the forum. \n How is this news?\n\n \n This guy is just another religious conservative in a long line of religious conservative who don't live up to the moral standards that they preach.\n \n Seams like not a week goes by without some moralizing right winger getting busted for doing the opposite of what his stated value's are.", 
   {}, 
   420969, 
   null, 
   1294247760.0
  ], 
  [
   421580, 
   null, 
   "Ema666", 
   "It really comes fown to basic psychology; why people do what they do. Take a look at the catholic church, by no means is it a free and loving religious system, it's a rigurous religious hiarchy. these priests are subject to aged morals compleatly detached to modern phylosophy. they're taught on beliefs two thousand years old with almost no amendments in beetween. It has , by now, been made clear that pedophelia is a by example a dont ask dont tell for the catholic church: as long as it is not made public they still look good. \n \n oh by the way excuse my grammar and spelling. im from Colombia so english is not my first language, therefor i am bound to make much more mistakes than someone native to the language :)", 
   {
    "post_info": {
     "post_title": "prop 8"
    }
   }, 
   421128, 
   null, 
   1294523160.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Prop 8 Pastor Arrested for Child Molestation.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/14846-prop-8-pastor-arrested-child-molestation.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 14846, 
  "discussion_files": [
   [
    "15599.html", 
    "http://www.4forums.com/political/gay-rights-debates/14846-prop-8-pastor-arrested-child-molestation-print.html"
   ], 
   [
    "15600.html", 
    "http://www.4forums.com/political/gay-rights-debates/14846-prop-8-pastor-arrested-child-molestation-2-print.html"
   ]
  ], 
  "identifier": 14846
 }
]