[
 [
  [
   421487, 
   null, 
   "NATO 556", 
   "Register antique guns, or else? - Crime & Courts - IOL | Breaking News | South Africa News | World News | Sport | Business | Entertainment | IOL.co.za\n \n \nPolice are confident that goodwill on the part of antique gun owners will have them register their firearms, but they have no idea how many thousands of such guns or their modified or lethal replicas are in the country.\n \n This was the admission by national police commissioner Bheki Cele and some of his senior staff in Pretoria on Thursday.\n \n Cele made the announcement at a news conference on an amendment to the Firearms Control Act which comes into effect on Monday.\n \n The amendment will force muzzle-loading firearm owners, who include hunters and collectors, to register their weapons within the next year.\n \n Failure to do so could see such gun owners being sentenced to up to 15 years in jail for illegal possession of a firearm.\n \n Come Monday, muzzle-loading firearm owners - as opposed to the past - will also have to apply for a competency certificate to keep their weapons. The certificate will be valid for 10 years.\n \n Speaking about the amendment, Cele, said the process was part of the turnaround strategy within the SAPS Firearms Control Registry (CFR), announced by police minister Nathi Mthethwa in November.\n \n Mthethwa said the police had been given nine months to turn around the shambolic state of the firearm registry which was in dire straits, allegedly because of corruption, criminality, laziness and incompetence.\n \n Cele, who said on Thursday great strides had been made in addressing the situation at the firearm registry, said the new amendment would close loopholes. These had allowed people to buy, own and collect muzzle-loading guns without licences.\n \n Under previous legislation such gun owners did not have to register their muzzle-loading firearms, \"but now with the new act these owners have to obtain a competency certificate\", he said.\n \n \"While many of these guns are antiques, or replicas of antiques, they are still lethal and their owners need to obtain a competency certificate to prove that they are competent to be in possession of such weapons.\"\n \n Asked if he was confident - given that the SAPS had no idea how many such weapons were in South Africa - that such gun owners would apply for a competency certificate, Cele said they were banking on the goodwill in South Africa's communities.\n \n \"While we do not know how many such guns are in the country we know that communities are tired of crime.\n \n \"Their tiredness is evident from the way, through their help, we have been able to win the war on crime this festive season,\" he said.\n \n Major-General Philip Jacobs, head of legal support SAPS crime operations, said the amendment was prompted because previous legislation stated that muzzle-loading firearms were not regarded as firearms.\n \n \"There was no need to obtain licences for these guns or their replicas which were imported into South Africa by the thousands.\n \n \"These guns and their replicas are just as lethal as other guns especially because the vast improvements made on them make them far superior to the originals.\n \n \"The main concern now is that there is no idea on how many such guns exist in the country especially as there was no control of their import or manufacte,\" he said.\n \n Jacobs said a gun owner could apply for a competency certificate at any police station within the next year and would have to undergo a criminal background check.\n \n Owners who currently had such licences would have to renew them within 90 days of the licence's expiry date, he said. - Pretoria News\n\n \n So it seems that in Africa there's no gun control law too extreme to consider passing. Muzzle loaders, as in the old black powder firearms used in the 1700s, are coming under fire. Because apparently Africa feels criminals will have no problem with using these old single shot, slow to load weapons in their various crimes.", 
   {
    "post_info": {
     "post_title": "Register antique guns, or else"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1294430700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Register antique guns, or else", 
  "url": "http://www.4forums.com/political/gun-control-debates/14865-register-antique-guns-else.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14865, 
  "discussion_files": [
   [
    "15116.html", 
    "http://www.4forums.com/political/gun-control-debates/14865-register-antique-guns-else-print.html"
   ]
  ], 
  "identifier": 14865
 }
]