[
 [
  [
   422136, 
   null, 
   "simone", 
   "Dorothy Morris, 76, was one of six people killed by a gunman in a shooting rampage in Tucson, Ariz. on Jan. 8, 2011 that also left 14 wounded, including the intended target-Representative Gabrielle Giffords, Democrat of Arizona. Ms. Giffords, who was shot in the head, was meeting with constituents outside a supermarket when Jared L. Loughner, a 22-year-old college dropout, allegedly opened fire.\n \n Mrs. Morris was a staunch Republican. But according to her neighbor, she was curious to hear what Ms. Giffords had to say, so she and her husband, George, attended the meet-and-greet on that Saturday morning in January.\n\n Dorothy Morris - The New York Times\n \n Another casualty of flapping tongues and the right wing media din against our government and our elected representatives.", 
   {
    "post_info": {
     "post_title": "Second Amendment Remedies: Dorothy Morris"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1294866540.0
  ], 
  [
   422137, 
   null, 
   "jyoshu", 
   "Folks, an FYI .. Simone has been reported for creating excessive multiple threads over and over of the same topic.", 
   {}, 
   422136, 
   null, 
   1294867680.0
  ], 
  [
   422146, 
   null, 
   "NATO 556", 
   "So, Simone, I see you're fully intent of whoring out a new thread for each murder victim for your own self serving goals. What're you going to do when you're up to six topics all giving the same information? Are you going to do 14 other topics, one for each victim that was shot but didn't die? Maybe a new topic anytime some left wing nut talks about this subject or brings it up for discussion?\n \n Your posting style is whorish and a mockery to the victims of an unavoidable incident. And in violation of numerous board rules.\n \n 4Forums.com Political Debates and Polls - FAQ: 4Forums.com FAQ\n \n # 5. Do not be disruptive. You will be banned if we receive complaints from other posters.\n # a) You are required to be willing to engage in honest debate, which requires reading links and responding to legitimate questions. If not you will be banned.\n # 7. Bigoted, racist, prejudiced or broad-brushed statements are not allowed.\n # 9. Every post should add relevant information to the thread.\n # 10. You will be banned for repeatedly posting the same information.\n # 11. You will be banned for spam.\n # 12. Do not make a nuisance of yourself, you will be banned if you require too much of the moderators time.\n \n With so many rule violations to your name I'm going to see to it that you get banned, so the forums aren't tainted with your filth anymore. You're not interested in honest debate or discussion, you just care about trolling and mocking the dead.", 
   {}, 
   422136, 
   null, 
   1294876320.0
  ], 
  [
   422164, 
   null, 
   "J Miro", 
   "See how much the Palinists hate the free dissemination of information when it threatens their possession of their substitute mail hoods.\n \n Bang, bang, bang, go their mouths. Johnny got his gun.", 
   {}, 
   422146, 
   null, 
   1294882320.0
  ], 
  [
   422166, 
   null, 
   "Doc Jones", 
   "See how much the Palinists hate the free dissemination of information when it threatens their possession of their substitute mail hoods.\n \n Bang, bang, bang, go their mouths. Johnny got his gun.\n\n \n \n You post like a little 10 year old. Is all this stuff new to you? emoticon_xgood", 
   {}, 
   422164, 
   null, 
   1294882860.0
  ], 
  [
   422177, 
   null, 
   "NATO 556", 
   "See how much the Palinists hate the free dissemination of information when it threatens their possession of their substitute mail hoods.\n \n Bang, bang, bang, go their mouths. Johnny got his gun.\n\n \n I've got a list forming that shows numerous examples of hate speech by liberals that, amongst other things, call for the explicit murder of the then-current president.\n \n Care to try and claim that such calls for the death of a conservative president don't amount to hate speech, but rather are just examples of free speech and free expression of thought? I'd love to see you try and argue that one away.", 
   {}, 
   422164, 
   null, 
   1294886340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Second Amendment Remedies: Dorothy Morris", 
  "url": "http://www.4forums.com/political/gun-control-debates/14898-second-amendment-remedies-dorothy-morris.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14898, 
  "discussion_files": [
   [
    "24611.html", 
    "http://www.4forums.com/political/gun-control-debates/14898-second-amendment-remedies-dorothy-morris-print.html"
   ]
  ], 
  "identifier": 14898
 }
]