[
 [
  [
   29215, 
   null, 
   "montalban", 
   "Now after Jesus was born in Bethlehem of Judea in the days of Herod the king, behold, magi from the east arrived in Jerusalem, saying, \"Where is He who has been born King of the Jews? For we saw His star in the east, and have come to worship Him\" (Matt. 2:1-2, NASB). http://www.probe.org/docs/starbeth.html\n \n The Star of Bethlehem was often used as an argument against the validity of the Gospels. Try as they might, no scientist could account for the 'star'. Was it an actual 'star' or a commet, or a meteor? None of these have come up as being real possibilities.\n \n However...\n \"Superposed on the photograph of the coin is what I found: Jupiter underwent two occultations (\"eclipses\") by the Moon in Aries in 6 BC. Jupiter was the regal \"star\" that conferred kingships - a power that was amplified when Jupiter was in close conjunctions with the Moon. The second occultation on April 17 coincided precisely when Jupiter was \"in the east,\" a condition mentioned twice in the biblical account about the Star of Bethlehem. In August of that year Jupiter became stationary and then \"went before\" through Aries where it became stationary again on December 19, 6 BC. This is when the regal planet \"stood over.\" - a secondary royal portent also described in the Bible. In particular, there is confirmation from a Roman astrologer that the conditions of April 17, 6 BC were believed to herald the birth of a divine, immortal, and omnipotent person born under the sign of the Jews, which we now know was Aries the Ram. Furthermore, the coins of Antioch and ancient astrological documents show that there was indeed a Star of Bethlehem as reported in the biblical account of Matthew.\"\n http://www.eclipse.net/~molnar/\n \n \n \n The first site cited\n http://www.probe.org/docs/starbeth.html\n gives a few good theories.", 
   {
    "post_info": {
     "post_title": "Star of Bethlehem"
    }
   }, 
   null, 
   null, 
   1072485840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Star of Bethlehem", 
  "url": "http://www.4forums.com/political/religion-debates/1492-star-bethlehem.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 1492, 
  "discussion_files": [
   [
    "7975.html", 
    "http://www.4forums.com/political/religion-debates/1492-star-bethlehem-print.html"
   ]
  ], 
  "identifier": 1492
 }
]