[
 [
  [
   422856, 
   null, 
   "Galileo", 
   "\"IF there is ever a class in how to remain calm while trapped beneath $250,000 in loans, Michael Wallerstein ought to teach it...\n \n \"Job openings for lawyers have plunged, but law schools are not dialing back enrollment. About 43,000 J.D.'s were handed out in 2009, 11 percent more than a decade earlier, and the number of law schools keeps rising - nine new ones in the last 10 years, and five more seeking approval to open in the future....\n \n \"...Mr. Wallerstein has no money in the bank, no assets and - aside from the occasional job as a legal temp - no wages to garnish....\n \n \"Today, countless J.D.'s are paying their bills with jobs that have nothing do with the law, and they are losing ground on their debt every day. Stories are legion of young lawyers enlisting in the Army or folding pants at Lululemon. Or baby-sitting, like Carly Rosenberg, of the Brooklyn Law School class of 2009....\n \n \" 'It's a prestige thing,' he says. 'I'm an attorney. All of my friends see me as a person they look up to. They understand I'm in a lot of debt, but I've done something they feel they could never do and the respect and admiration is important.' \"\n http://www.nytimes.com/2011/01/09/business/09law.html?pagewanted=1&adxnnlx=1295553641-eBUM2FGBS3aGIGkIjWHbMA\n \n So borrow a quarter of a million dollars to get a degree that may not do much to improve your job prospects, but do it for the prestige? I'm not so sure that Wallerstein should be looked up to. Another thing to consider is that you can never be relieved of student loan debt through bankruptcy.", 
   {
    "post_info": {
     "post_title": "Realities of Going to Law School"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1295562060.0
  ], 
  [
   422860, 
   null, 
   "Steeeeve", 
   "Not surprising. The problem is not so much with law students as it is with financial aid in general (see my thread on that topic). \n \n If you want to solve the problem make student loans harder to get. Have the interest rate of the loan reflect risk and allow bankruptcy (you can't do one of these without the other). If no jobs exist for being a lawyer than no one is loaning out money to law students because they'll just default. College scale back law students.", 
   {}, 
   422856, 
   null, 
   1295564160.0
  ], 
  [
   422905, 
   null, 
   "Iuris", 
   "The work of a lawyer is intellectual and usually well paid. That's why the job is very desired. Just like a movie star's.\n \n However, it's just like with movie stars. Many young people want the flashy great jobs, but fail to notice that there are only a few big names, that most actors are B and lower listed, and that all too many people are still turning over burgers while still waiting for \"their talent to be noticed\".\n \n It's hard to predict where good work will be to be found when you finish your chosen studies. In the case of many of the best jobs only a limited amount of work is available, and when too many people are available to do it, some miss out.\n \n Given that the same occurs in my little Slovenia, where university education is free of charge, I doubt it's a matter of student loans, really.\n \n Hell, I often regret going for law instead of some natural science subject. But at the time I had to choose, those could only expect low level teaching jobs, while employers offered scholarships for lawyers.\n \n \n Also, in the specific case of lawyers, please not that most law systems establish a \"guild\" system, which means that even once a student finishes his university, he still has to gain work experience and additional qualifications before he's really \"employable\". It's hard to start - and in an economic crisis, not employing inters is a popular measure taken...", 
   {}, 
   422860, 
   null, 
   1295605080.0
  ], 
  [
   423189, 
   null, 
   "signelect", 
   "I guess I missed the point about lawyers being like movie stars I had another word in mind. Lawyers/politicians have created a work program where we have to hire a lawyer to do what is right. Get out in the world as ask Joe Citizen what he thinks of lawyers and you will get an ear full.http://www.4forums.com/political/images/smilies/smile.gif", 
   {}, 
   422905, 
   null, 
   1295980620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Realities of Going to Law School", 
  "url": "http://www.4forums.com/political/education-debates/14938-realities-going-law-school.html", 
  "breadcrumbs": [
   "Education"
  ], 
  "id_number": 14938, 
  "discussion_files": [
   [
    "760.html", 
    "http://www.4forums.com/political/education-debates/14938-realities-going-law-school-print.html"
   ]
  ], 
  "identifier": 14938
 }
]