[
 [
  [
   422925, 
   null, 
   "NATO 556", 
   "Man faces jail after protecting home from masked attackers | Features | National Post\n \n \nIan Thomson moved to a rural homestead in Southwestern Ontario to lead a quiet life investing in a little fixer-upper. Then his neighbour's chickens began showing up on his property. He warned his neighbour, then killed one of the birds.\n \n The incident began six years of trouble for Mr. Thomson that culminated early one Sunday morning last August when the 53-year-old former mobile-crane operator woke up to the sound of three masked men firebombing his Port Colborne, Ont., home.\n \n \"I was horrified,\" he said. \"I couldn't believe it. I didn't know what was happening. I had no idea what was going on.\"\n \n So Mr. Thomson, a former firearms instructor, grabbed one of his Smith & Wesson revolvers from his safe, loaded it and headed outside dressed in only his underwear.\n \n \"He exited his house and fired his revolver two, maybe three times, we're not sure. Then these firebombing culprits, they ran off,\" said his lawyer, Edward Burlew.\n \n His surveillance cameras caught the attackers lobbing at least six Molotov cocktails at his house and bombing his doghouse, singeing one of his Siberian Huskies. But when Mr. Thomson handed the video footage to Niagara Regional Police, he found himself charged with careless use of a firearm.\n \n The local Crown attorney's office later laid a charge of pointing a firearm, along with two counts of careless storage of a firearm. The Crown has recommended Mr. Thomson go to jail, his lawyer said.\n \n His collection of seven guns, five pistols and two rifles was seized, along with his firearms licence. Mr. Thomson said he lives in fear that his attackers will return and has taken to arming himself with a fire extinguisher.\n \n \"I don't have enemies,\" said the soft-spoken man, who now studies environmental geosciences full-time at Brock University after being injured in a workplace accident. \"I don't know that many people. I'm a quiet man. I just want to go back to my life and be able to live out my days in relative peace.\"\n \n Mr. Thomson's is the latest in a series of high-profile cases in which people have been charged after defending their homes and businesses against criminals. Central Alberta farmer Brian Knight became a local hero after shooting a thief who was trying to steal his ATV. He pleaded guilty to criminal negligence earlier this month. In October, Toronto shopkeeper David Chen was acquitted of forcible confinement charges after he tied up a repeat shoplifter and demanded he stop raiding his grocery store.\n \n Their cases are renewing calls for Canada to introduce a version of the \"Castle Doctrine\" found in many U.S. states, which allows citizens to defend their property with force.\n \n \"I hear some people, some being police officers, some being Crown attorneys, some being ordinary people, say we don't want vigilantism, to which I can only give an emphatic pardon me?\" Mr. Burlew said. \"When you're under attack, it's not a vigilante act. Vigilantism talks about vengeance and retribution. This is about saving your life and saving your property.\n \n \"I'm sure that will be recognized at trial, but why would a citizen, where it's so obvious that what he was doing was protecting himself during a continued attack, be put to the expense of a trial? It's demeaning.\"\n \n Canada allows people to claim self-defence for using force, including guns, to protect their life as long as the force is reasonable and they believe they have no other options.\n \n \"If the public are wondering can you run out of your house and [fire a handgun at an intruder], the bottom line is, according to the laws of Canada, no, you can't,\" said Constable Nilan Dave of the Niagara Regional Police Service, which charged Mr. Thomson. \"That's why the courts are there, to give a person an opportunity to explain their actions.\"\n \n Mr. Burlew, a Toronto-area lawyer whose practice mainly consists of firearms-related charges, said he is trying to hire a psychiatrist to prove that Mr. Thomson feared for his life when he grabbed his revolver. A target shooter and hunting-safety instructor, Mr. Thomson had the skill to shoot his attackers if he'd wanted to, Mr. Burlew said, but missed on purpose.\n \n Police said no one was injured in the shooting and the attackers got into a car and sped off. They charged Randy Weaver, 48, of Port Colborne, and Justin Lee, 19, of Welland, with arson in December, alleging the men and a third suspect \"intentionally set the home on fire while the homeowner was inside.\"\n \n Mr. Thomson's neighbour, who had received a suspended sentence for uttering threats against Mr. Thomson in 2007, has not been charged in connection with the attack on his house.\n \n Mr. Thomson said he has added extra security to his home after the firebombing and hardly sleeps anymore. The charges, he said, have destroyed him.\n \n \"This is just an absolute nightmare, this whole thing,\" he said. \"People need to know that this is what can happen to you and which side of the victim line do you want to stand on? Lying down dead or in court? That's the way it seems it has to go.\"\n\n \n I dare anyone on the usual suspects list to try and defend the actions of the authorities on this matter. They arrested and charged this man for shooting at the people who were setting his house on fire! An act that has the potential to kill absolutely everyone in the building and results in millions of dollars of damage. They were setting his house on fire with molotov cocktails and he's the one that gets treated like a criminal.\n \n Somebody try and say that this is right and the way we should be doing things in America. Give it your best shot.", 
   {
    "post_info": {
     "post_title": "Man faces jail after protecting home from masked attackers"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1295641560.0
  ], 
  [
   422943, 
   null, 
   "daewoo", 
   "Man faces jail after protecting home from masked attackers | Features | National Post\n \n \n \n I dare anyone on the usual suspects list to try and defend the actions of the authorities on this matter. They arrested and charged this man for shooting at the people who were setting his house on fire! An act that has the potential to kill absolutely everyone in the building and results in millions of dollars of damage. They were setting his house on fire with molotov cocktails and he's the one that gets treated like a criminal.\n \n Somebody try and say that this is right and the way we should be doing things in America. Give it your best shot.\n\n \n Uh...that IS how we do things in America. You exit your house and shoot at somebody who is not an immediate threat and you are SCREWED. If this had happened in the US, the prosecutor would have argued that since he had already EXITED the house, his life was not endangered by the fact that they were tossing fire bombs at it. I can just about promise you. \n \n Now, if you are INSIDE the house and shoot one of the guys as he is getting ready to throw a firebomb, you are probably in the clear, but you go outside the house and shoot at somebody and you are going to spend some time at club fed. Like it or not, reasonable or not, we are not allowed to shoot people to protect property in this country, either, and any prosecutor in that situation is going to argue that he shot at the guy to protect his property, not himself or another person.\n \n You really need to THINK before you start blowing people away. The law is not fair and it is not just or blowing somebody away who is actively firebombing your house would be TOTALLY legal, no matter where you were standing at the time.", 
   {}, 
   422925, 
   null, 
   1295673120.0
  ], 
  [
   422946, 
   null, 
   "Pietro", 
   "Technically Daewoo I think you're a bit mistaken. I looked up deadly force in regards to defense and arson and (surprisingly) deadly force is a legal option for stopping an arson attempt.\n \n Self-Defense Law in New York State\n \n \nSec. 35.20 Justification; use of physical force in defense of premises and in defense of a person in the course of burglary.\n 1. Any person may use physical force upon another person when he reasonably believes such to be necessary to prevent or terminate what he reasonably believes to be the commission or attempted commission by such other person of a crime involving damage to premises. He may use any degree of physical force, other than deadly physical force, which he reasonably believes to be necessary for such purpose, and he may use deadly physical force if he reasonably believes such to be necessary to prevent or terminate the commission or attempted commission of arson.\n 2. A person in possession or control of any premises, or a person licensed or privileged to be thereon or therein, may use physical force upon another person when he reasonably believes such to be necessary to prevent or terminate what he reasonably believes to be the commission or attempted commission by such other person of a criminal trespass upon such premises. He may use any degree of physical force, other than deadly physical force, which he reasonably believes to be necessary for such purpose, and he may use deadly physical force in order to prevent or terminate the commission or attempted commission of arson, as prescribed in subdivision one, or in the course of a burglary or attempted burglary, as prescribed in subdivision three.\n\n \n The way I'm reading it, defense of property (being the house in this hypothetical situation) is an acceptable claim when using deadly force against another. So at least in theory if this had happened in a state like New York, the only way this case could go before a full court would be if there was blatant and intentional prosecutorial and judicial misconduct taking place, with an overeager prosecuting attorney looking to demonize certain individuals, and an activist judge who feels the law doesn't apply if he doesn't like it.", 
   {}, 
   422943, 
   null, 
   1295675100.0
  ], 
  [
   423034, 
   null, 
   "Superlite27", 
   "Uh...that IS how we do things in America. You exit your house and shoot at somebody who is not an immediate threat and you are SCREWED. If this had happened in the US, the prosecutor would have argued that since he had already EXITED the house, his life was not endangered by the fact that they were tossing fire bombs at it. I can just about promise you. \n \n Now, if you are INSIDE the house and shoot one of the guys as he is getting ready to throw a firebomb, you are probably in the clear, but you go outside the house and shoot at somebody and you are going to spend some time at club fed. Like it or not, reasonable or not, we are not allowed to shoot people to protect property in this country, either, and any prosecutor in that situation is going to argue that he shot at the guy to protect his property, not himself or another person.\n \n You really need to THINK before you start blowing people away. The law is not fair and it is not just or blowing somebody away who is actively firebombing your house would be TOTALLY legal, no matter where you were standing at the time.\n\n \n \nYou really need to THINK before you start blowing people away.\n\n \n You really need to think before making stuff up.\n \n \nUh...that IS how we do things in America\n\n \n Really? You're not just saying this because it \"feels\" right, are you?\n \n Because I could swear that it is determined by state. Hence: Castle Doctrine. Some states have it, some don't. Some states have different versions of it. Some states call it a \"stand your ground\" law, some call it a \"make-my-day\" law. It varies. \n \n All Castle Doctrine laws are a variant on the same theme. They all differ between states. The particular state I'm from, Castle law only covers you on private property. (In case you can't grasp the difference between this and the story above: Here (which is inside the U.S.) my front yard would be considered my private property, hence: firebombers beware. In my state, \"private property\" also includes a person's vehicle regardless of that vehicle's location. I could be at a stoplight, and if someone tried to forcibly enter.....here comes a bullet, buddy. I am considered to be occupying private property. (I am. I am inside my privately owned vehicle.)\n \n Other states have other requirements as to how their Castle Doctrine applies. I believe Florida (I am not sure, just speaking from memory) considers anywhere you are legally allowed to be as Castle defensable. Therefore, you are covered under Castle Doctrine walking down a sidewalk.\n \n Texas has a forcible felony Castle law. If you see someone committing a forcible felony.......you're good to go. (Remember Joe Horn?) While others have weak little things that aren't worthy of the term \"Castle Law\". I can't tell you which ones, but I know there are some states that only allow you to defend your life after requirements are met. Such as: Duty to retreat. This holds that an inhabitant of his own home, is required to retreat to the furthest point away from the assailant before Castle law can be lawfully applied.\n \n ???? What? Really? This means that if you are in your undies eating a piece of pie in your own livingroom where you have a reasonable expectation of privacy, and a reasonable expectation of safety, since you ARE IN YOUR OWN LIVINGROOM.....\n \n ...you are still required by the state (You punk-XXX little minions! Do as you're told!) to give anyone committing a felony by forcibly breaking into your house all the room they need to do so! You are required by the state to retreat to the furthest point in your house. (or the house you think is yours.) It really belongs to the government since they're the ones making the rules for you while you're in your undies eating pie in what you think is your livingroom. It's actually anyone's who decides to break in and take it. The government has provided for their protection. They can rest assured that if you shoot them, the goverment will put you in jail for not following your duty to retreat. Gee! Thanks Uncle Sam! Way to provide for the CRIMINAL'S SAFETY! Why don't you put more requirements on folks going about their own business IN THEIR OWN LIVINGROOMS!\n \n ...and then there are the states that have no Castle Doctrine. If you shoot anyone, for any reason, you will be arrested, you will be tried, and you will be required to prove your innocence.......(Wait a minute? I thought we were innocent until proven guilty? What happened to that? Doesn't matter. You will be tried for murder, and it is up to you to prove you acted in self-defense. The burden is on YOU.)\n \n You see, 90% of the ignorant fools out there misconstrue Castle Doctrine. They seem to think it is some wierd law that makes murdering people legal. These are the folks who have absolutely no understanding of Castle Doctrine and think degrading it is some form of way to bash gun owners. All this does is shine a spotlight on their ignorance.\n \n All Castle Doctrine does is shift the burden of proof onto the STATE. (Where it rightfully should be!) If you point out to the officers and the prosecuting attorney that the person you shot was committing a felony, was doing so in a place that you have a reasonable expectation of safety (such as your own damned livingroom), and you were simply defending yourself, the burden is on the prosecutor to prove it was NOT self defense. If they look at everything involved, it simply allows you your freedom to NOT be arrested. If they determine that winning a case proving you did NOT act in self defense couldn't be won, you don't have to sit in a cell for ages followed by a lengthy trial......in order to determine that you shouldn't have had to sit in a cell for ages and go through a lengthy trial.\n \n But, as I said before, this is determined by the state you happen to live in. \n \n \nUh...that IS how we do things in America\n\n \n Nope.\n \n Uh...that IS how we do things in some parts of America.", 
   {}, 
   422943, 
   null, 
   1295804820.0
  ], 
  [
   423054, 
   null, 
   "Galileo", 
   "Sec. 9.42. DEADLY FORCE TO PROTECT PROPERTY. A person is justified in using deadly force against another to protect land or tangible, movable property:\n \n (1) if he would be justified in using force against the other under Section 9.41; and\n \n (2) when and to the degree he reasonably believes the deadly force is immediately necessary:\n \n (A) to prevent the other's imminent commission of arson, burglary, robbery, aggravated robbery, theft during the nighttime, or criminal mischief during the nighttime; or\n \n (B) to prevent the other who is fleeing immediately after committing burglary, robbery, aggravated robbery, or theft during the nighttime from escaping with the property; and\n \n (3) he reasonably believes that:\n \n (A) the land or property cannot be protected or recovered by any other means; or\n \n (B) the use of force other than deadly force to protect or recover the land or property would expose the actor or another to a substantial risk of death or serious bodily injury.\n\n PENAL CODEXXCHAPTER 9. JUSTIFICATION EXCLUDING CRIMINAL RESPONSIBILITY\n \n However:\n \"While some castle doctrine-type statutes may emphasize property rights, those that truly operate within the framework of the castle doctrine as a common law principle are explicit in permitting defense of self as opposed to property.\"\n http://www.harvardjol.com/wp-content/uploads/2010/07/523-554.pdf\n \n Under English common law, the Castle Doctrine was intended to be a narrow exception to the general duty to retreat. The \"castle laws\" supported by the NRA tend to protect much broader exceptions than would have traditionally considered to be acceptable.", 
   {}, 
   423034, 
   null, 
   1295823000.0
  ], 
  [
   423057, 
   null, 
   "daewoo", 
   "Technically Daewoo I think you're a bit mistaken. I looked up deadly force in regards to defense and arson and (surprisingly) deadly force is a legal option for stopping an arson attempt.\n \n Self-Defense Law in New York State\n \n \n \n The way I'm reading it, defense of property (being the house in this hypothetical situation) is an acceptable claim when using deadly force against another. So at least in theory if this had happened in a state like New York, the only way this case could go before a full court would be if there was blatant and intentional prosecutorial and judicial misconduct taking place, with an overeager prosecuting attorney looking to demonize certain individuals, and an activist judge who feels the law doesn't apply if he doesn't like it.\n\n \n I think I need to clarify. The article was talking about the castle doctrine, and how lack of a castle doctrine led to the guy being prosecuted. That is the same thing that happens in the US. \n \n AFIK in all castle doctrine states using force to protect your \"castle\" is acceptable. \n \n We had a really bizarre case here in KS last year where a guy who pulled a gun on a burglar who had assaulted his girlfriend was found guilty of aggravated assault. The jury was not given a self defense instruction (instruction that they should find the guy not guilty if they thought he was acting in self defense). Apparently the judge found that our castle doctrine allowed the USE of deadly force, but not the THREAT of use of deadly force. This of course leads to a completely illogical situation where you are allowed to blow the guy away, but not to point a gun at him.", 
   {}, 
   422946, 
   null, 
   1295824320.0
  ], 
  [
   423069, 
   null, 
   "Doc Jones", 
   "You really need to think before making stuff up.\n \n \n \n Really? You're not just saying this because it \"feels\" right, are you?\n \n Because I could swear that it is determined by state. Hence: Castle Doctrine. Some states have it, some don't. Some states have different versions of it. Some states call it a \"stand your ground\" law, some call it a \"make-my-day\" law. It varies. \n \n All Castle Doctrine laws are a variant on the same theme. They all differ between states. The particular state I'm from, Castle law only covers you on private property. (In case you can't grasp the difference between this and the story above: Here (which is inside the U.S.) my front yard would be considered my private property, hence: firebombers beware. In my state, \"private property\" also includes a person's vehicle regardless of that vehicle's location. I could be at a stoplight, and if someone tried to forcibly enter.....here comes a bullet, buddy. I am considered to be occupying private property. (I am. I am inside my privately owned vehicle.)\n \n Other states have other requirements as to how their Castle Doctrine applies. I believe Florida (I am not sure, just speaking from memory) considers anywhere you are legally allowed to be as Castle defensable. Therefore, you are covered under Castle Doctrine walking down a sidewalk.\n \n Texas has a forcible felony Castle law. If you see someone committing a forcible felony.......you're good to go. (Remember Joe Horn?) While others have weak little things that aren't worthy of the term \"Castle Law\". I can't tell you which ones, but I know there are some states that only allow you to defend your life after requirements are met. Such as: Duty to retreat. This holds that an inhabitant of his own home, is required to retreat to the furthest point away from the assailant before Castle law can be lawfully applied.\n \n ???? What? Really? This means that if you are in your undies eating a piece of pie in your own livingroom where you have a reasonable expectation of privacy, and a reasonable expectation of safety, since you ARE IN YOUR OWN LIVINGROOM.....\n \n ...you are still required by the state (You punk-XXX little minions! Do as you're told!) to give anyone committing a felony by forcibly breaking into your house all the room they need to do so! You are required by the state to retreat to the furthest point in your house. (or the house you think is yours.) It really belongs to the government since they're the ones making the rules for you while you're in your undies eating pie in what you think is your livingroom. It's actually anyone's who decides to break in and take it. The government has provided for their protection. They can rest assured that if you shoot them, the goverment will put you in jail for not following your duty to retreat. Gee! Thanks Uncle Sam! Way to provide for the CRIMINAL'S SAFETY! Why don't you put more requirements on folks going about their own business IN THEIR OWN LIVINGROOMS!\n \n ...and then there are the states that have no Castle Doctrine. If you shoot anyone, for any reason, you will be arrested, you will be tried, and you will be required to prove your innocence.......(Wait a minute? I thought we were innocent until proven guilty? What happened to that? Doesn't matter. You will be tried for murder, and it is up to you to prove you acted in self-defense. The burden is on YOU.)\n \n You see, 90% of the ignorant fools out there misconstrue Castle Doctrine. They seem to think it is some wierd law that makes murdering people legal. These are the folks who have absolutely no understanding of Castle Doctrine and think degrading it is some form of way to bash gun owners. All this does is shine a spotlight on their ignorance.\n \n All Castle Doctrine does is shift the burden of proof onto the STATE. (Where it rightfully should be!) If you point out to the officers and the prosecuting attorney that the person you shot was committing a felony, was doing so in a place that you have a reasonable expectation of safety (such as your own damned livingroom), and you were simply defending yourself, the burden is on the prosecutor to prove it was NOT self defense. If they look at everything involved, it simply allows you your freedom to NOT be arrested. If they determine that winning a case proving you did NOT act in self defense couldn't be won, you don't have to sit in a cell for ages followed by a lengthy trial......in order to determine that you shouldn't have had to sit in a cell for ages and go through a lengthy trial.\n \n But, as I said before, this is determined by the state you happen to live in. \n \n \n \n Nope.\n \n Uh...that IS how we do things in some parts of America.\n\n \n Watch him start quoting himself, erasing his words and putting your words in for his \"quote\" then using your words as his. He did this on the Obamacare board when talking about the military situation...go take a look.", 
   {}, 
   423034, 
   null, 
   1295835120.0
  ], 
  [
   423090, 
   null, 
   "Superlite27", 
   "I don't know about all this quoting and re-quoting using my words instead of his. I'll choose to give him the benefit of the doubt until it happens to me. Thanks for the heads up, Doc. I'll keep an eye out, but I'm not going to take a detour in order to sift through the weeds in a pointless attempt to find minutia that weakens or reinforces my debator's credibility. I'm not here to win arguments by finding and keeping score of the \"demerits\" of my opponent's style or tactics. My preferred method is point/counterpoint then explaining with (hopefully) flawless, simple to understand logic my points while simultaneously pointing out the complete unsupportablity of my opponent's argument.\n \n As far as keeping track of the demerits, all I can do here is point out Daewoo's statement:\n \n \nI think I need to clarify. The article was talking about the castle doctrine, and how lack of a castle doctrine led to the guy being prosecuted. That is the same thing that happens in the US. \n \n AFIK in all castle doctrine states using force to protect your \"castle\" is acceptable.\n\n \n Well....yes. The article was talking about castle doctrine. True. But Deawoo's response to this stated:\n \n \nUh...that IS how we do things in America. You exit your house and shoot at somebody who is not an immediate threat and you are SCREWED. If this had happened in the US, the prosecutor would have argued that since he had already EXITED the house, his life was not endangered by the fact that they were tossing fire bombs at it. I can just about promise you. \n \n Now, if you are INSIDE the house and shoot one of the guys as he is getting ready to throw a firebomb, you are probably in the clear, but you go outside the house and shoot at somebody and you are going to spend some time at club fed. Like it or not, reasonable or not, we are not allowed to shoot people to protect property in this country, either, and any prosecutor in that situation is going to argue that he shot at the guy to protect his property, not himself or another person.\n \n You really need to THINK before you start blowing people away. The law is not fair and it is not just or blowing somebody away who is actively firebombing your house would be TOTALLY legal, no matter where you were standing at the time.\n\n \n At no point in his response to the article did Daewoo address castle doctrine, or the lack thereof. Read it again. It clearly, and unmistakably argues the very point in the first sentence:\n \n \nUh...that IS how we do things in America.\n\n \n I simply pointed out that this.....is....wrong. It varies by state. This IS NOT how we do things in America. Only in a few places.\n \n But then, Daewoo tries to \"clarify\". \n \n \nI think I need to clarify. The article was talking about the castle doctrine, and how lack of a castle doctrine led to the guy being prosecuted. That is the same thing that happens in the US.\n\n \n Yes. That is true. The article did talk about lack of castle doctrine. But, for all that clarifying, things are getting muddier. Daewoo is trying to ride the coattails of this fact he states and blend it into being a blanket truth about his entire post. \n \n As if he were arguing that his reply addressed the lack of castle doctrine in the U.S.\n \n \n ...but if you actually read his response.....\n \n ....at no point.....NOWHERE... does he mention lack of castle law in only a few states. He blankets the entire U.S.\n \n \nUh...that IS how we do things in America. You exit your house and shoot at somebody who is not an immediate threat and you are SCREWED.\n\n \n Nope. Sorry. He can \"clarify\" all he wants. I can't see how he can \"clarify\" the above statement because it is already crystal. It can't get any clearer.\n \n Although, it is couched inside a verifiable truth. Daewoo is correct in this statement that shooting at somebody who is not an immediate threat\n will result in being SCREWED.\n \n Yes. This is true. Shooting at someone who is NOT a threat will, indeed, result in you being screwed.\n \n I would simply argue that SOMEONE SETTING YOUR HOUSE ON FIRE would, most definately, qualify as an immediate, felonious, and real threat to you and your family's safety and life here in the U.S. You would most certainly be justified in shooting them. Even outside your house. EVEN in states without Castle Law.\n \n The only thing is, you would be arrested and tried in those states. You would be highly likely to be acquitted for self-defense, but that burden would be on YOU in those places without Castle Law.\n \n So, yes. I can agree with Daewoo in his clarification that it would be the same here in the U.S. Just not the ENTIRE U.S. as he claimed in his first response.", 
   {}, 
   423057, 
   null, 
   1295890620.0
  ], 
  [
   423114, 
   null, 
   "daewoo", 
   "\n I would simply argue that SOMEONE SETTING YOUR HOUSE ON FIRE would, most definately, qualify as an immediate, felonious, and real threat to you and your family's safety and life here in the U.S. You would most certainly be justified in shooting them. Even outside your house. EVEN in states without Castle Law.\n \n The only thing is, you would be arrested and tried in those states. You would be highly likely to be acquitted for self-defense, but that burden would be on YOU in those places without Castle Law.\n \n So, yes. I can agree with Daewoo in his clarification that it would be the same here in the U.S. Just not the ENTIRE U.S. as he claimed in his first response.\n\n \n \n I am going to disagree here. Originally I thought that all states that follow castle doctrine would allow for the use of deadly force in protecting your home, not just yourself. I found as I looked into this that I was wrong. Fro example, North Carolina:\n \n North Carolina Gun Law: Use Of Deadly Physical Force Against An Intruder - News Story - WSOC Charlotte\n \n \nb. Use of force to protect property\n The law does not permit the use of deadly force solely to protect property, or to prevent theft, or to regain stolen property. An owner CANNOT shoot at a thief - before, during, or after a theft. The same rule prohibits deadly force to prevent injury or vandalism to property. A different rule applies if life is imminently threatened at the same time property is taken. Deadly force used to prevent an armed robbery is force used to protect life, not to protect property. \n\n \n Pennsylvania:\n \n Self Defense Law\n \n \nIn Pennsylvania, and a majority of jurisdictions, a victim has the right to use non-deadly force in defense of his dwelling when, and to the extent that he reasonably believes that such conduct is necessary to prevent or terminate another's unlawful entry or attack upon his dwelling. Deadly force is authorized when violent entry is made or attempted and the victim reasonably believes that it is necessary to prevent an attack on his person. It is also authorized when the victim reasonably believes that such force is necessary to prevent entry into the dwelling by one who intends to commit a felony therein. The rationale for allowing self-defense in these scenarios is based upon the right of inhabitants to be secure in their homes, rather than the right to defend property, as can be demonstrated by the law regarding defense of uninhabited property.\n \n Non-deadly force may be used merely to defend one's property from imminent, unlawful interference. Force may not be used if some other, reasonable means would have the same effect.. The only exception to the immediacy requirement is that force may be used to regain wrongfully taken property after the taking (i.e. no longer a prevention of immediate interference) if the victim uses such force in 'immediate pursuit'. The legal rationale for this exception is, of course, that the interference continues as long as the aggressor retains control of the property.\n \n Deadly force may never be used in defense of uninhabited property. The popular misconception with respect to this law emanates from confusion over situations where the right to defend property and the right to defend persons therein overlap. Pennsylvania allows the use of reasonable, non-lethal force in the protection of property and notes that such a defense of property will not be regarded as 'provoking' an attack on the defender's person. Pennsylvania allows the use of force necessary to eject a trespasser, short of inflicting serious bodily injury. If the defendant reasonably believes that the trespasser intended to commit a felony, then serious bodily injury is justified. When two people claim ownership over a piece of personal property, Pennsylvania law provides that force may not be used to prevent one from taking it. \n\n \n Kansas:\n \n \nKansas ? 21-3211: Use of force in defense of a person; no duty to retreat.\n (a) A person is justified in the use of force against another when and to the extent it appears to such person and such person reasonably believes that such force is necessary to defend such person or a third person against such other's imminent use of unlawful force.\n (b) A person is justified in the use of deadly force under circumstances described in subsection (a) if such person reasonably believes deadly force is necessary to prevent imminent death or great bodily harm to such person or a third person.\n (c) Nothing in this section shall require a person to retreat if such person is using force to protect such person or a third person.\n \n Kansas ? 21-3212: Use of force in defense of dwelling; no duty to retreat.\n (a) A person is justified in the use of force against another when and to the extent that it appears to such person and such person reasonably believes that such force is necessary to prevent or terminate such other's unlawful entry into or attack upon such person's dwelling or occupied vehicle.\n (b) A person is justified in the use of deadly force to prevent or terminate unlawful entry into or attack upon any dwelling or occupied vehicle if such person reasonably believes deadly force is necessary to prevent imminent death or great bodily harm to such person or another.\n (c) Nothing in this section shall require a person to retreat if such person is using force to protect such person's dwelling or occupied vehicle.\n\n \n So...it looks like I was wrong. Whether the state in question has a castle doctrine or not, you may not be legal in shooting somebody who is lobbing firebombs at your house unless you are inside it at the time. \n \n IMO, the best advice I ever got on this came from a friend of mine...a retired judge. He told me \"If you are going to shoot somebody, remember that most prosecutors are XXXXing liberals and they are probably going to try to string you up for it.\"", 
   {
    "unicode_changes_made": true
   }, 
   423090, 
   null, 
   1295913540.0
  ], 
  [
   423115, 
   null, 
   "Pietro", 
   "One thing must be remembered in this matter. There's a difference between property in terms of a flat screen TV, and property in terms of one's own home. Unlike with the TV the home is recognized as a person's castle.\n \n I've said before I'm not a lawyer, I'm not trained in matters of law nor am I an expert on the way the laws are interpreted.\n \n But I do believe that prohibitions against deadly force with regards to property don't apply when it comes to the home itself being attacked in a manner that would destroy it and potentially kill everyone in the building.", 
   {}, 
   423114, 
   null, 
   1295915100.0
  ], 
  [
   423116, 
   null, 
   "Xcaliber", 
   "We don't have Castle Laws here in my state either but they just passed a Law extending the Use of Deadly force into your Yard ( if you are under personal Threat). Under the Law we still can't use deadly force to protect only property. I used this case as an example and asked my Sheriff what would happen if someone was lobbing bombs at my house, he told me \" Shoot the bastard\"..lol..\n \n It's your word against a dead man so it's all in how the prosecutor perceives your intentions. Even if you're outside the house you could have been afraid one of those gas bombs was going to hit you, which would cause harm to you personally , so the use of deadly force would most likely be legal.", 
   {}, 
   423114, 
   null, 
   1295915220.0
  ], 
  [
   423117, 
   null, 
   "Xcaliber", 
   "But I do believe that prohibitions against deadly force with regards to property don't apply when it comes to the home itself being attacked in a manner that would destroy it and potentially kill everyone in the building.\n\n \n According to the Laws here, even the Home, car, or other property is not considered enough to use deadly force. If you are able to Retreat from danger you can't legally shoot someone to protect your property. They just tried to pass here in my state what they called \" the No Retreat Law\" which would have made deadly force legal even if a retreat was possible, but the bill didn't pass.", 
   {}, 
   423115, 
   null, 
   1295915460.0
  ], 
  [
   423124, 
   null, 
   "zsu2357", 
   "=Pietro;423115]One thing must be remembered in this matter. There's a difference between property in terms of a flat screen TV, and property in terms of one's own home. Unlike with the TV the home is recognized as a person's castle.\n\n I don't know where you keep your t.v.,me though I keep it in my house he might be their to take it or harm my family by then its a moot point.Simply put\n that t.v. is inside my castle.\n \n \nI've said before I'm not a lawyer, I'm not trained in matters of law nor am I an expert on the way the laws are interpreted.\n\n \n Look at this way, you don't need to be an expert on law to know when someone has broken into your home.Its you or your family or them.\n Castle doctrine or not.\n \nBut I do believe that prohibitions against deadly force with regards to property don't apply when it comes to the home itself being attacked in a manner that would destroy it and potentially kill everyone in the building.\n\n What if they make it clear all they want is your t.v. rape your wife and maybe daughter and they will leave peacefully and were coming in now make\n up your mind.Now mind,they promise not to destroy your home or kill anyone.", 
   {}, 
   423115, 
   null, 
   1295919480.0
  ], 
  [
   423126, 
   null, 
   "daewoo", 
   "One thing must be remembered in this matter. There's a difference between property in terms of a flat screen TV, and property in terms of one's own home. Unlike with the TV the home is recognized as a person's castle.\n \n I've said before I'm not a lawyer, I'm not trained in matters of law nor am I an expert on the way the laws are interpreted.\n \n But I do believe that prohibitions against deadly force with regards to property don't apply when it comes to the home itself being attacked in a manner that would destroy it and potentially kill everyone in the building.\n\n \n We need to stand by and hope that Bryan comments on this. He is a prosecutor and can probably cite some good case law for us on this. \n \n IMO the real problem comes in how the laws are interpreted. I dont thing anybody on kansas, including the folks who drafted our castle law, had ever considered that it could be read to prohibit threatening somebody with a weapon while allowing you to shoot them with it. Even politicians can not come up with that level of stupidity. That level takes contributions of distilled stupidity from lawyers and judges as well.", 
   {}, 
   423115, 
   null, 
   1295919660.0
  ], 
  [
   423280, 
   null, 
   "Bryan", 
   "The \"castle doctrine\" is an old English common law rule. Each state has chosen to modify it as it sees fit. Some states modify or create the rule by statutes, others do so by case law interpreting and/or modifying the common law. I can't speak for other states, much less other nations, but I can explain how the law of self-defense and the \"castle doctrine\" applies in my state. Virginia has enacted no statutes on point. It instead relies on judicial interpretation of the common law. \n \n I have previously posted the law of self-defense in Virginia here:\n \n http://www.4forums.com/political/gun-control-debates/4779-natural-right-self-defense-use-deadly-force-virginia.html\n \n An extension of this law is the defense of habitation or what we call the \"castle doctrine.\" Virginia is not a \"duty to retreat\" state-that is, wherever you are if you are exercising self-defense you have no duty to retreat unless you started or provoked the confrontation. But even in states that require a duty to retreat the castle doctrine has long been seen as an exception to this duty-one need not retreat when in his own residence. Another exception applied in the castle doctrine is the use of deadly force to defend property-which is otherwise not allowed. Here is an old explanation of the castle doctrine as applied in Virginia: \n \n As said in 1 Bish. New Cr. Law (8th Ed.), sections 857, 858: \"* * the general rule is that while a man may use all reasonable and necessary force to defend his real and personal estate, of which he is in the actual possession, against another who comes to dispossess him without right, he cannot innocently carry this defense to the extent of killing the aggressor. [Page 687] If no other way is open to him, he must yield, and get himself righted by resort to the law. A seeming exception to this rule is the -\"Defense of the Castle. - In the early times our forefathers were compelled to protect themselves in their habitations by converting them into holds of defense: and so the dwelling house was called the castle. To this condition of things the law has conformed, resulting in the familiar doctrine that while a man keeps the doors of his house closed, no other may break and enter it, except in particular circumstances to make an arrest or the like - cases not within the line of our present exposition. From this doctrine is derived another: namely, that the persons within the house may exercise all needful force to keep aggressors out, even to the taking of life. As observed by Campbell, J., in Michigan, 'a man is not obliged to retreat if assaulted in his dwelling, but may use such means as are absolutely necessary to repel the assailant from his house or prevent his forcible entry, even to the taking of life' * * .\"\n \n But the same learned work continues, in section 858, as follows:\n \n \"1. Waiving Castle. - One may waive the protection of his castle by permitting another to enter; * *.\"\n \n \"2. Putting out of the Castle. - If a man enters another's dwelling house peaceable on an implied license, he cannot be ejected except on request to leave, followed by no more than the necessary and proper force, even though misbehaving himself therein.\n \n * * Hence a needless battery, resulting in death, employed in ejecting an intruder from the dwellinghouse, will constitute felonious homicide.\"Fortune v. Commonwealth, 133 Va. 669, 686-687, 112 S.E. 861, ___ (1922) (this last part refers to ejecting someone previously allowed to enter)\n \n Another, even stronger statement of the \"castle doctrine\" in Virginia is found here (in a generalized statement about self-defense, defense of others, and defense of property):\n \n \"Homicide in defense of person or property, under certain circumstances of necessity; which is justifiable by the permission of the law. This takes place when a man, in defense of his person, habitation or property, kills another, who manifestly intends and endeavors, by violence or surprise, to commit a forcible or atrocious felony upon either. In the cases to which this ground of justification applies, no felony has been committed, but only attempted; and the homicide is justifiable in order to prevent it.\n \n \"All felonies may not be so prevented. A distinction is made between such felonies as are attended with force, or any extraordinary degree of atrocity, which in their nature betoken such urgent necessity as will not allow of any delay, and others of a different kind and unaccompanied by violence on the part of the felon. Those only which come within the former description may be prevented by homicide; as murder, rape, robbery, arson, [Page 981] burglary and the like. In the attempt to commit either of these, the party whose person or property is attacked is not obliged to retreat, but may pursue his adversary until he has secured himself from all danger, and if he kill him in so doing, it is called justifiable self-defense. And the same justification extends to homicide committed in the mutual and reciprocal defense of such as stand in the relations of husband and wife, parent and child, master and servant; for the act of the assistant shall have the same construction in such cases as the act of the party assisted should have had, if it had been done by himself, in consequence of the relation between them.\n \n \"This right of self-defense is founded on the law of nature, which confers on every individual the right to defend and maintain the possession of that which belongs to him, by those means which are necessary to attain this object.\"\n \n * * * * * * *\n \n \"In these several kinds of justifiable homicide, it may be observed, that the slayer is in no kind of fault whatsoever, not even in the minutest degree; and is therefore to be totally acquitted and discharged, with commendation rather than blame. Dodson v. Commonwealth, 159 Va. 976, 980-981, 167 S.E. 260, ___ (1933) (You can still see the necessity language at use here-not all crimes permit the use of deadly force in response)\n \n You can still see the necessity language at use here-not all crimes permit the use of deadly force in response. Another statement of this principle is found here necessity:\n \n The better rule and the modern tendency, however, are indicated in Fortune v. Commonwealth, 133 Va. 669, 112 S.E. 861, which expressly disapproves the Parrish Case, and in Montgomery v. Commonwealth, 98 Va. 842, 36 S.E. 371, which was a case of trespass upon land, where the trespasser was assaulted with a deadly weapon, where this is said: \"The instruction as given contains the general rule, which is sound as an abstract proposition, that every man has the right to defend his [Page 642] person or property, but it ignores the well settled and important modification of the rule that in defense of person or property one cannot, except in extreme cases, endanger human life or do great bodily harm. The law is clearly stated by a learned judge in State v. Morgan, 3 Ired. 186, 38 Am. Dec. 714, as follows: 'When it is said that a man may rightfully use as much force as is necessary for the protection of his person and property, it should be recollected that this rule is subject to this most important modification, that he shall not, except in extreme cases, endanger human life or do great bodily harm. It is not every right of person, and still less of property, that can lawfully be asserted, or every wrong that may rightfully be rendered by extreme remedies. There is a recklessness - a wanton - disregard of humanity and social duty in taking, or endeavoring to take, the life of a fellow-being, in order to save one's self from a comparatively slight wrong, which is essentially wicked, and the law abhors. You may not kill, because you cannot otherwise effect your object, although the object sought to be effected is right. You can only kill to save life or limb, or prevent a great crime, or to accomplish a necessary public duty.' See also, 1 Bishop on New C. L., secs. 839, 841, 850.\" Pierce v. Commonwealth, 135 Va. 635, 641-642, 115 S.E. 686, ___ (1923)\n \n And here is where the rubber meets the road. Every use of deadly force in defense of habitation must be necessary under the circumstances. If all you are doing is protecting your property from some slight harm or any amount of property only from theft, then you have no right in Virginia to use deadly force to stop the act. For example, deadly force is not allowed to eject a mere trespasser on the property. \n \n But arson has always been considered a circumstance that can justify the use of deadly force. In such cases you are protecting against a violent felony offense which endangers your life and anyone else in the home, and you are then allowed to use deadly force to defend your home. It presents a mixed question of defense of property and self. Still, you must remember in Virginia that the law of self-defense remains the law of necessity, and when the danger of death or great bodily harm ends you right to use deadly force ends. The right of self-defense or defense of habitation is not a right of retaliation.\n \n A more modern statement of castle doctrine rule in Virginia is found here (note that the modern statement of the defense recognizes two emergencies that justify the use of deadly force-arson and burglary):\n \n The use of deadly force to prevent threatened harm to property is never justified except in defense of habitation....The use of deadly force, in defense of \"property\" can also be justifiable, but the classic formulation lists only arson or burglary as crimes against property which can justify the use of deadly force. . . . Even then the use of deadly force must have been necessary.\n Defense of habitation and justifiable self-defense overlap in the \"castle doctrine\" which states that one may, without retreating, use force, to include deadly force if necessary, to keep aggressors out of his own house. This part of the castle doctrine is one aspect of defense of habitation. . . . [T]he justification exists in the curtilage as well as the castle. Roger D. Groot, Criminal Offenses and Defenses in Virginia 114 (3rd ed. 1994). Alexander v. Commonwealth, 28 Va. App. 771, 780, 508 S.E.2d 912, ___ (1999)\n \n Note the modern definition refers also to the \"curtilage\" which is defined as follows:\n \n the \"space necessary and convenient, habitually used for family purposes and the carrying on of domestic employment; the yard, garden or field which is near to and used in connection with the dwelling\"). \"[W]hether a particular place is within the curtilage of the home is determined on a case-by-case basis.\"Robinson v. Commonwealth, 45 Va. App. 592, 605, 612 S.E.2d 751, ___ (2005) \n \n I would say that this does not justify using deadly force to eject a trespasser in your front yard, but it does allow the use of deadly force to keep anyone out who is attempting to forcibly enter your home. In such circumstances you are not required to first open negotiations with the burglar to determine whether his intention is to harm you or a member of your family or merely to steal your TV. You are allowed to use deadly force to keep him out, period. You are also allowed to use deadly force if you are outside in your yard and you are threatened with deadly force, or whether inside or not you are allowed to use deadly force if someone is attempting to set fire to your occupied residence. The common thread is these situations present the person with the need to act not only to defend his home but also to defend the lives of those within. \n \n I would also say that the castle doctrine does not shift the burden of proof back to the government. The burden never leaves the government. The government charges a particular crime, and that crime is made up of factual elements that must be proven beyond a reasonable doubt. Second degree murder, for example, requires the government to prove: 1. an intentional, willful, and deliberate killing, 2. done with malice (malice being defined as the intentional doing of a wrongful act to another without legal excuse or justification at a time when the mind of the actor is under the control of reason).\n \n The government always bears the burden of proof of these facts-and that burden of proof is beyond a reasonable doubt. The castle doctrine (like self-defense in general) is an affirmative defense offered by the defendant to justify his actions. In such cases the defendant agrees that the government has proven the element of an intentional killing, but he argues a legal justification (defending his home and the occupants) permits this action-thus negating the element of malice. If believed, or if a reasonable doubt exists about whether the act was justified or done with malice, then a not guilty finding is required. In all of these cases if a crime is charged and the defense is argued then it is up to the judge or jury to decide whether the deceased's conduct justified the use of deadly force against him, and if so, then the judge or jury must determine whether the amount of force used was reasonable under the circumstances. For example, shooting out of a window at an arsonist who has already thrown one firebomb and is in the process of lighting another is a very different circumstance from chasing the man off and then shooting him in the back as he runs away. \n \n In my experience, a key component in these cases is whether the physical evidence backs up the defense claim. You may have heard the old advice that says if you shoot them outside then drag them back to the house and drape them coming in the window. Don't follow it. Because even if you did manage to not shoot him in the back I can promise you that when the medical examiner finds post mortem scratches on his face and dirt up his nose then we will know you dragged him face down across the sidewalk and through the flower garden on the way back to the window. If the physical evidence does not support your version then you got problems-it shows you immediately believed you did something wrong and that you tried to conceal it. That is the surest way to get yourself charged with a crime. \n \n But to look briefly at the case that stared this thread: I have not researched it, but from what I see listed here there is no way I would charge this homeowner with a crime. It is easy to sit here and talk in the abstract about whether or not he should have come outside-it is entirely another thing to consider this under duress, at night, and while under sudden violent attack. This is why the law of defense considers the facts and circumstances as known at the time by the person, taking into consideration the stress of the moment. There is also an undercurrent (at least in America) of a sense of blaming those who provoked the situation-a \"if you're going to be stupid then you've got to be tough\" mentality-if you are stupid (or malicious) enough to go firebomb a house then you better be tough enough to take being shot at in response. In this case you would have extraordinarily unsympathetic victims (of the shooting), and in my belief any jury drawn from my community would certainly find the homeowner not guilty. And if it took the jury more than five minutes to do so then it would only be because the foreman had trouble finding a pen to use to sign the not guilty line on the verdict form.", 
   {
    "post_info": {
     "post_title": "castle doctrine"
    }, 
    "unicode_changes_made": true
   }, 
   423126, 
   null, 
   1296061620.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Man faces jail after protecting home from masked attackers", 
  "url": "http://www.4forums.com/political/gun-control-debates/14945-man-faces-jail-after-protecting-home-masked-attackers.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14945, 
  "discussion_files": [
   [
    "7791.html", 
    "http://www.4forums.com/political/gun-control-debates/14945-man-faces-jail-after-protecting-home-masked-attackers-print.html"
   ]
  ], 
  "identifier": 14945
 }
]