[
 [
  [
   423361, 
   null, 
   "Xcaliber", 
   "For all those Tea Bag Party supporters who Are hoping your New Congress will keep their Promise of No Compromise, here's a little reality for Them to consider. Looks like the Tea Party and the new GOP Majority is going to be short lived... \n \n \nDebt Ceiling: Geithner Won't Let Us Default\n \n Donald Marron\n Published: January 20, 2011\n Availability:\n Printer-Friendly Version\n \n Share: Share on Facebook Share on Twitter Share on LinkedIn Share on Yahoo Buzz Share on Digg Share on Reddit\n Abstract\n \n Treasury Secretary Geithner recently warned that the U.S. may default if Congress doesn't increase the federal debt limit. In this guest commentary at CNN Money, Donald Marron explains how Geithner will make sure that the U.S. does not default on the public debt, even if Congress is slow to increase borrowing authority.\n \n CNNMoney.com, January 19, 2011\n Debt ceiling: Geithner won't let us default\n \n America reached two dubious milestones in recent weeks.\n \n Our national debt, including Social Security obligations, has run up to nearly $14 trillion. That's a lot of money, even in Washington.\n \n And our Treasury Secretary started using the d-word. Writing to congressional leaders, Timothy Geithner warned that failing to increase America's debt ceiling, currently $14.3 trillion, \"would precipitate a default by the United States.\"\n \n \"Default\" is not a word that Treasury secretaries use lightly. For more than two centuries, the United States has paid its debts on time. That's why U.S. Treasuries have historically been considered the safest investment in the world.\n \n When Geithner was sworn into office, he took responsibility for defending the full faith and credit of the United States.\n \n So why is he openly discussing the possibility of default? Because of the peculiar political theater of the debt limit.\n \n Alone among developed nations, our country separates the legislative decisions that govern spending and taxes from those that govern debt.\n \n As a result, America must periodically watch its elected leaders try to avoid voting for higher debt, even though most of them happily voted for higher spending, lower taxes or both.\n \n During these spells of political brinkmanship, the Treasury secretary's job is to prod Congress into action.\n \n Given today's political divisiveness, Geithner understandably decided -- as did his predecessors in similar circumstances -- that the best way to defend America's credit worthiness is, paradoxically, to warn of potential default if Congress fails to act.\n \n Geithner is correct that the debt limit must increase. With monthly deficits running more than $100 billion, it's simply unthinkable that Congress could cut spending or increase revenue enough to avoid borrowing more. America's daunting fiscal challenges require bold action, but it must be thoughtful and deliberate, not arbitrary and sudden.\n \n Still, I am troubled by any suggestion that the United States might willingly default on its public debt. Doing so would have absolutely no upside. That's why I'm confident that Geithner won't let it happen.\n \n If Congress somehow fails to increase the ceiling in time, Geithner would do everything in his power to avoid going down in history as the first Treasury secretary to miss a debt payment.\n \n To do so, he would use the same tactics as any stressed debtor.\n \n Squirrel it away: First, Geithner would hold on to his cash and what little credit he has left. Among other things, he would eliminate unneeded borrowing associated with certain obscure programs such as the Exchange Stabilization Fund and a state and local debt program.\n \n Turn to family for help: He would call in money from his relatives, in this case the Federal Reserve. During the financial crisis, Treasury created a special program to borrow money on the Fed's behalf; that borrowing now totals $200 billion. Treasury temporarily wound this program down the last time we got close to the debt ceiling. Expect the same this time.\n \n Promise to pay later: He would issue IOUs (which don't officially count as debt) to friendly creditors who have no choice but to accept them. Geithner's predecessors did this with two retirement funds for government employees, both of which were later made whole. In his recent letter to Congress, Geithner said he'd do the same.\n \n Sell stuff: Lastly, Geithner would look for assets that are easy to sell. Thanks to the financial crisis, Treasury now owns a sizeable investment portfolio, including stakes in auto companies, banks and other financial institutions. Don't be surprised if Treasury cashes in some of these positions to raise cash in coming months.\n \n Those tactics would give Congress time to work through its differences and raise the debt limit.\n \n If lawmakers fail to act on time, however, Geithner would face starker choices: Our monthly bills average about $300 billion, while revenues are about $180 billion. If we hit the debt limit, the federal government would be able to pay only 60 cents of every dollar it should be paying.\n \n But even that does not mean that we will default on the public debt. Geithner would then choose which creditors to pay promptly and which to defer.\n \n As the heir to Alexander Hamilton, Geithner would undoubtedly keep making payments on the public debt, rolling over the outstanding principal and paying interest. Interest payments are relatively small, averaging about $20 billion per month, and paying them on time is essential to America's enviable position in world capital markets. To miss even one is and should be unthinkable.\n \n Other creditors would have to wait in line. Treasury would defer payments to some groups of creditors, perhaps including Social Security beneficiaries, Medicare providers, military personnel, weapons vendors or taxpayers expecting refunds.\n \n Missing such payments would be another dubious milestone in America's fiscal journey -- so dubious, in fact, that the resulting constituent outrage would likely force Congress to increase the debt ceiling immediately.\n \n Here's to hoping that Congress doesn't let things go that far and get that bad.\n \n Commentary: Donald Marron is the director of the Urban-Brookings Tax Policy Center and a former acting director of the Congressional Budget Office.\n\n \n Source.. \n Debt Ceiling: Geithner Won't Let Us Default", 
   {
    "post_info": {
     "post_title": "The Debt Ceiling."
    }
   }, 
   null, 
   null, 
   1296194280.0
  ], 
  [
   423365, 
   null, 
   "Symbiote", 
   "The way I read the article, it's \"if the debt limit isn't raised, Geithner will be forced to make some truly ugly choices\".\n \n For once it would mean facing reality instead of deferring the tough decisions to a later date. (Monetize the debt and risk hyperinflation? Cut spending dramatically?)\n \n You apparently read it a different way, \"Tea party sucks go democrats\", perhaps you could explain how you came to that conclusion.", 
   {}, 
   423361, 
   null, 
   1296195600.0
  ], 
  [
   423368, 
   null, 
   "Xcaliber", 
   "The way I read the article, it's \"if the debt limit isn't raised, Geithner will be forced to make some truly ugly choices\".\n For once it would mean facing reality instead of deferring the tough decisions to a later date. (Monetize the debt and risk hyperinflation? Cut spending dramatically?)You apparently read it a different way, \"Tea party sucks go democrats\", perhaps you could explain how you came to that conclusion\n\n \n First of all I didn't say \" Tea Party Sucks, Go Democrats..\".. I pointed out the Tea Party because it was Tea Party people who ranted and Raved that their New Majority was going to Do all these Wonderful things, like repeal Health Care, which turned out to be a bust. They also made the Promise of \" No Compromise\".. I heard this for two months leading up to last years elections. I Read the Article just as it is, and it spells DOOM for the Tea Party. I'll tell you why....\n \n When they are faced with raising the debt ceiling they are going to have two choices.. Yes... or no...\n \n If they say Yes then they are breaking one of their campaign Promises, you know the one not to compromise with the evil Democrats. That pretty much means most of them will be one term congressmen, and some old dogs are going to get a early retirement.\n \n If they say no then Geithner will have to do what he must to keep from defaulting on the Debt. He has the power to Nationalize any Government supported industry in order to save the Union,.. How much money do you think he can come up with if he does so with the insurance companies?.. Worst case he will defer payments to Social Security, Medicare, VA benefits, and any other program he feels can be placed at the back of the line. Trust me, when the Elderly( whom voted the Tea Party and GOP into Power last November) suddenly are faced with not getting their checks and Medical care, what do you think they will do?\n \n All this will be placed squarely at the feet of the House Majority, and they will be voted out as soon as possible. \n \n So really either way it goes from here the Tea Party and the Old Rhino GOP who are left will be gone, the Liberals will once again be in charge and we can go back to Spending ourselves into history. \n \n I'm a Liberal yes, on most issues. But I do not support either side 100%. I just want politicians who will do something instead of continuing this Partisan Political battle that's dragged this country backwards for too many years. \n \n I'm not taking a shot at the Tea Party, I got over that after the election. What I am doing is pointing out a reality that they will face soon, so it's up to them what they do.", 
   {}, 
   423365, 
   null, 
   1296197100.0
  ], 
  [
   423369, 
   null, 
   "Symbiote", 
   "You're talking about the possibility of hyperinflation, national default, nationalisation of major industries and cutting off welfare, and your concern is about the implications of this for the political success of the tea party? \n \n Seems a little tangential to me. When you are living in third world conditions, will you take solace in your lord and savior obama retaining ultimate power?", 
   {}, 
   423368, 
   null, 
   1296200160.0
  ], 
  [
   423377, 
   null, 
   "Xcaliber", 
   "You're talking about the possibility of hyperinflation, national default, nationalisation of major industries and cutting off welfare, and your concern is about the implications of this for the political success of the tea party? \n \n Seems a little tangential to me. When you are living in third world conditions, will you take solace in your lord and savior obama retaining ultimate power?\n\n \n LOL... well I don't have a \" Lord and Savior\", I'm just as disgusted with Obama as I am the rest of our Government Leaders. I guess you didn't pick up on the Sarcasm In my previous post. They're all wasting Valuable time fighting amongst themselves for Power, but they don't seem to realize that their decisions now may just shift all that \"Power\" to Geithner. Remember who it was who Appointed the Him? \n \n No, this situation is not going to be good for anyone.", 
   {}, 
   423369, 
   null, 
   1296228180.0
  ], 
  [
   423380, 
   null, 
   "Steeeeve", 
   "The way I read the article, it's \"if the debt limit isn't raised, Geithner will be forced to make some truly ugly choices\".\n \n For once it would mean facing reality instead of deferring the tough decisions to a later date. (Monetize the debt and risk hyperinflation? Cut spending dramatically?)\n \n You apparently read it a different way, \"Tea party sucks go democrats\", perhaps you could explain how you came to that conclusion.\n\n \n Take it easy. I think Xcaliber is just saying we are screwed either way.", 
   {}, 
   423365, 
   null, 
   1296232140.0
  ], 
  [
   423398, 
   null, 
   "daewoo", 
   "IMO this is a litmus test for the Tea Party. They have the muscle to shut down the government if they all refuse to vote for the debt ceiling increase, which means they have the muscle to force pretty much any cuts through that they want. For all intents and purposes they can dictate terms on a \"take it or leave it\" basis. \n \n Does anybody really think they will do it? \n \n IMO the most likely scenario is a quick up or down vote...at night if possible...then a bunch of excuses as to why it had to be done and why they could not force spending cuts through with it.", 
   {}, 
   423380, 
   null, 
   1296252660.0
  ], 
  [
   423402, 
   null, 
   "Xcaliber", 
   "IMO this is a litmus test for the Tea Party. They have the muscle to shut down the government if they all refuse to vote for the debt ceiling increase, which means they have the muscle to force pretty much any cuts through that they want. For all intents and purposes they can dictate terms on a \"take it or leave it\" basis. \n \n Does anybody really think they will do it? \n \n IMO the most likely scenario is a quick up or down vote...at night if possible...then a bunch of excuses as to why it had to be done and why they could not force spending cuts through with it.\n\n \n yeah I don't think they can or will use this to try and force anything. If they were to try that and the Liberals didn't budge it would still be blamed on the Right. They don't want to get to that point though because if they say no then the Power will shift to Geithner and with him being an Obama man that could be even more of a disaster. I think they are just going to have to take their lumps and raise the debt ceiling. Either way they go now it's not going to sit well with the voters. Considering the health care repeal will never see daylight they are now batting 0 for 2. \n \n I'm wondering how much Obama is asking them to raise the ceiling to?.. I haven't been able to find a reliable source on the actual Numbers. I think right now if I'm not Mistaken the Ceiling is like 14.3 trillion... and supposedly we are about to exceed that. I'm going to start a Journal my Kids can pass down to their Kids and so on, so that my great Great, GREAT, grandchildren will know why they are paying out their ears for our past mistakes.", 
   {}, 
   423398, 
   null, 
   1296253980.0
  ], 
  [
   423684, 
   null, 
   "Steeeeve", 
   "After much thought, I think I agree with David Walker (as usual) on the subject. Raise the debt ceiling is properly necessary but we should do it along with a guaranteed way to balance a budget within 2-4 years. The reason I say this is because this budget year is already half over. You might as well finish it out and just work on an ACTUAL plan for FY12. Granted we can't even get a budget for this current year. Anyway, like most government agencies that money is most likely committed already for the foreseeable 5-6 months. Frankly I don't want us to act like the state of Illinois when we could just as easily raise the debt ceiling temporarily on the condition that the budget deficit is cut by 50-60% for FY12 and balanced by FY14. \n \n Let's look at that poll a little closer: \n Public strongly opposes debt ceiling increase: Reuters/Ipsos | Reuters\n \n Only 23% think we should cut back Medicare and 20% Social Security. Barely a majority think we should cut back the military at 51%. The only one people seem to think is good is cutting back on foreign aid which is only like $50-60 billion a year I believe. I'm not so sure cutting a portion of only 2% of our budget is going to help much and prevent the debt ceiling from being raised. \n \n It is mathematically impossible to NOT raise the debt ceiling (or balance the budget) without cuts to Medicare/Medicaid (HHS),Social Security, AND Defense. We could cut defense by 100% and cut everything else besides HHS and SS by 50% and run a deficit causing us to increase the debt ceiling. Let that sink in for a second. \n \n There is only one way to go here. Cut Defense by 2/3rds, End Medicare Part D and cut benefits to rich old folks, cut SS benefits to rich old folks, reform SS and Medicare for the long run. Follow that with a REAL reform of Health care and 3 years of 15,10,5% cuts (in that order) for every other department. Raise the maximums for taxing SS and Medicare benefits and increase income taxes on the top 10% of income tax earners. Do that and you'll balance a budget.", 
   {}, 
   423402, 
   null, 
   1296753480.0
  ], 
  [
   423688, 
   null, 
   "daewoo", 
   "After much thought, I think I agree with David Walker (as usual) on the subject. Raise the debt ceiling is properly necessary but we should do it along with a guaranteed way to balance a budget within 2-4 years. The reason I say this is because this budget year is already half over. You might as well finish it out and just work on an ACTUAL plan for FY12. Granted we can't even get a budget for this current year. Anyway, like most government agencies that money is most likely committed already for the foreseeable 5-6 months. Frankly I don't want us to act like the state of Illinois when we could just as easily raise the debt ceiling temporarily on the condition that the budget deficit is cut by 50-60% for FY12 and balanced by FY14. \n \n Let's look at that poll a little closer: \n Public strongly opposes debt ceiling increase: Reuters/Ipsos | Reuters\n \n Only 23% think we should cut back Medicare and 20% Social Security. Barely a majority think we should cut back the military at 51%. The only one people seem to think is good is cutting back on foreign aid which is only like $50-60 billion a year I believe. I'm not so sure cutting a portion of only 2% of our budget is going to help much and prevent the debt ceiling from being raised. \n \n It is mathematically impossible to NOT raise the debt ceiling (or balance the budget) without cuts to Medicare/Medicaid (HHS),Social Security, AND Defense. We could cut defense by 100% and cut everything else besides HHS and SS by 50% and run a deficit causing us to increase the debt ceiling. Let that sink in for a second. \n \n There is only one way to go here. Cut Defense by 2/3rds, End Medicare Part D and cut benefits to rich old folks, cut SS benefits to rich old folks, reform SS and Medicare for the long run. Follow that with a REAL reform of Health care and 3 years of 15,10,5% cuts (in that order) for every other department. Raise the maximums for taxing SS and Medicare benefits and increase income taxes on the top 10% of income tax earners. Do that and you'll balance a budget.\n\n \n I have also been thinking about this, and I am not sure I agree.. I WOULD certainly agree if I had any faith at all that they would actully make the cuts later and balance the budget. I just dont see it happening without a crisis. If they refuse to raise the ceiling, then our politicians HAVE TO act. They can not do what they did last time around where they debated it and then came to the conclusion that they would pass it, but fix the problem later, and then embarked on the biggest federal spending spree in history. \n \n Pat Toomey just introduced a bill that requires the treasury to prioritize spending so interest on the national debt is paid first. That takes Armageddon off the table. \n \n I understand what you are saying here, and if I thought there was any way that they would actually take the steps needed to address the problem without having their backs firmly against the wall, I would agree. I just dont see it happening. There is simply no way that congress is going to take the needed steps without being forced to.\n \n That said, you and I both know it will end up being increased. Congress does not care what the american people want. They are not going to make the hard cuts. They are going to pass a ridiculous bill that cuts federal expenditures by 2%, after raising them 20%, and call it good. They will continue down that road until the nation fails, then they will point fingers at each other.", 
   {}, 
   423684, 
   null, 
   1296756240.0
  ], 
  [
   423696, 
   null, 
   "Steeeeve", 
   "I have also been thinking about this, and I am not sure I agree.. I WOULD certainly agree if I had any faith at all that they would actully make the cuts later and balance the budget. I just dont see it happening without a crisis. If they refuse to raise the ceiling, then our politicians HAVE TO act. They can not do what they did last time around where they debated it and then came to the conclusion that they would pass it, but fix the problem later, and then embarked on the biggest federal spending spree in history. \nThis is basically the same idea though. If congress is not serious enough to balance the budget after they promised to than they are not going to be serious enough to not raise the debt ceiling. In other words, it really doesn't matter HOW they get serious about the issue, the end result if they DO get serious looks the same. \n \n \nI understand what you are saying here, and if I thought there was any way that they would actually take the steps needed to address the problem without having their backs firmly against the wall, I would agree. I just dont see it happening. There is simply no way that congress is going to take the needed steps without being forced to.\nBut my point is they force themselves either way. I mean lets be honest here, they are going to raise the debt ceiling AND increase spending or maybe level it off at unsustainable levels. All we are arguing is if going from A to B to C is better than going from A straight to C. Both end up in the same position. \n \n I mean, if you aren't confident in thinking they will follow their own control with spending than what makes you confident they will follow a control they imposed upon themselves. \n \n \nThat said, you and I both know it will end up being increased. Congress does not care what the american people want. They are not going to make the hard cuts. They are going to pass a ridiculous bill that cuts federal expenditures by 2%, after raising them 20%, and call it good. They will continue down that road until the nation fails, then they will point fingers at each other.\nThat's why I'm proud to be an American. \n \n On a side note, I'd really like to see someone get up on national TV one day with a huge calculator and show how it is mathematically impossible to not modify spending to Medicare, Social Security, and Defense. Give a 30 min lesson on addition and subtraction. After that show how without tax increases you can't do anything.\n \n Finally, it appears Paul Ryan is a tool. After winning an award for fiscal responsibility and becoming Chairman Mr. Ryan has apparently decided fiscal responsibility is for chumps if you want to make friends in Congress. Way to sell out a-hole. He flat out REFUSED Obama's commission recommendations, voted for the tax cut extension, and thinks that a $32 Billion cut is something to be proud of. That's not even 1% of the budget. Congress shouldn't even mention spending cuts in the news until they reached $1 trillion in cuts for proposal. Until then, don't insult our intelligence.", 
   {}, 
   423688, 
   null, 
   1296759540.0
  ], 
  [
   423699, 
   null, 
   "signelect", 
   "We are already in default, we have just given it a fancy name. Our congress has been taking care of themselves for years but now we can see the end of the road and something has to give. Maybe everyone can't drive a new car and live in the mini-mansion. I didn't save like I should and now have to figure out how to live on what I have and not rely on using your money for my existence. SS is not a gift, it is my money I loaned the country, without interest, and now I want it back.", 
   {}, 
   423688, 
   null, 
   1296760800.0
  ], 
  [
   423747, 
   null, 
   "daewoo", 
   "This is basically the same idea though. If congress is not serious enough to balance the budget after they promised to than they are not going to be serious enough to not raise the debt ceiling. In other words, it really doesn't matter HOW they get serious about the issue, the end result if they DO get serious looks the same. \n \n But my point is they force themselves either way. I mean lets be honest here, they are going to raise the debt ceiling AND increase spending or maybe level it off at unsustainable levels. All we are arguing is if going from A to B to C is better than going from A straight to C. Both end up in the same position. \n \n I mean, if you aren't confident in thinking they will follow their own control with spending than what makes you confident they will follow a control they imposed upon themselves. \n\n \n Because I think that a lot of the tea baggers are idealistic, stupid, and frankly batchit insane. Look at their stance on freddy and fannie. I agree 100% that we should get them off the government teat, but with 90% of current mortgages being directly backed by the US government, and 80% of them through fannie and freddy, doing as the tea party suggests and just dropping them would absolutely destroy the US economy. I agree that some stuff calls for immediate action, but sometimes you have to wean slowly, not just jerk the teat away all at once. \n \n If we go ahead with the standard \"pass it now and later we will revisit.....\" it will never happen and the tea baggers will end up marginalized. A lot of them wont get re-elected because they literally ran on \"no more deficits\". I think they will be held accountable at the next election. \n \n And while I hate to admit it, to some degree I just want the BS to end. If that means that we say \"screw it\" and end up in the streets with a rifle then so be it. There is not enough of what made America great left to be worth trying to save. Sometimes you just have to burn it down and start over. \n \n \n\n Finally, it appears Paul Ryan is a tool. After winning an award for fiscal responsibility and becoming Chairman Mr. Ryan has apparently decided fiscal responsibility is for chumps if you want to make friends in Congress. Way to sell out a-hole. He flat out REFUSED Obama's commission recommendations, voted for the tax cut extension, and thinks that a $32 Billion cut is something to be proud of. That's not even 1% of the budget. Congress shouldn't even mention spending cuts in the news until they reached $1 trillion in cuts for proposal. Until then, don't insult our intelligence.\n\n \n It is starting to look that way. I liked his budget cut proposal as a good starting point. Unfortunately he has the \"tax cuts under all circumstances\" disease. Everything he has done since he put out his budget reduction plan has pretty much proven his whole plan was nothing but a PR stunt. He does not even seem to support his own plan.", 
   {}, 
   423696, 
   null, 
   1296840360.0
  ], 
  [
   423762, 
   null, 
   "signelect", 
   "We elected them and we have to live with them. Both sides are out to get us, that is why a lot of the new laws apply to us but not to them. I think we need to see the birth certificates of congress, some times I wonder where they come from.", 
   {}, 
   423747, 
   null, 
   1296849420.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  The Debt Ceiling.", 
  "url": "http://www.4forums.com/political/economics-debates/14970-debt-ceiling.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 14970, 
  "discussion_files": [
   [
    "10114.html", 
    "http://www.4forums.com/political/economics-debates/14970-debt-ceiling-print.html"
   ]
  ], 
  "identifier": 14970
 }
]