[
 [
  [
   423812, 
   null, 
   "MrWriteLA", 
   "http://www.youtube.com/v/DNH2JzKpMAA\n \n Prediction: as with the last link I posted, the far-right religionists here will squawk loudly about everything but the FACTS presented in the video.\n \n Which they wouldn't be able to do anyway, because you may be sure they will not have watched it--if for no other reason than that they'll immediately realize it's presented by a LIBERAL (gasp! make sign of cross) LESBIAN! (gasp! make sign of cross) and thus (pour poison into well) \"cannot possibly be unbiased.\"\n \n \"Reality has a well-known liberal bias.\"", 
   {
    "post_info": {
     "post_title": "Watch: The Murder of David Kato"
    }
   }, 
   null, 
   null, 
   1296931860.0
  ], 
  [
   423822, 
   null, 
   "Accipiter", 
   "So religious ideals translate in to real world evil, who could have seen that coming?\n \n I wouldn't be surprised if no religious people post in here, they tend to shy away from fights they know they can't win.", 
   {}, 
   423812, 
   null, 
   1296955920.0
  ], 
  [
   423832, 
   null, 
   "Easyrider", 
   "http://www.youtube.com/v/DNH2JzKpMAA\n \n Prediction: as with the last link I posted, the far-right religionists here will squawk loudly about everything but the FACTS presented in the video.\n \n Which they wouldn't be able to do anyway, because you may be sure they will not have watched it--if for no other reason than that they'll immediately realize it's presented by a LIBERAL (gasp! make sign of cross) LESBIAN! (gasp! make sign of cross) and thus (pour poison into well) \"cannot possibly be unbiased.\"\n \n \"Reality has a well-known liberal bias.\"\n\n \n \n Unless gay sex sinners repent and receive Christ as their Lord and Savior for the remission of their sins, they go to hell when they're murdered / when they die.", 
   {}, 
   423812, 
   null, 
   1297131780.0
  ], 
  [
   423834, 
   null, 
   "Matthew S", 
   "Unless gay sex sinners repent and receive Christ as their Lord and Savior for the remission of their sins, they go to hell when they're murdered / when they die.\n\n \n I accept Christ and wish to receive his large kingdom and his great remission. MUMMMMMMMMMMM YUMMMMM Hallelujah", 
   {}, 
   423832, 
   null, 
   1297132980.0
  ], 
  [
   423838, 
   null, 
   "Accipiter", 
   "Unless gay sex sinners repent and receive Christ as their Lord and Savior for the remission of their sins, they go to hell when they're murdered / when they die.\n\n \n All ez's posts are self serving.\n \n They are designed to get HIM into heaven according to the rule book he thinks he has.", 
   {}, 
   423832, 
   null, 
   1297181280.0
  ], 
  [
   423846, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n Unless gay sex sinners repent and receive Christ as their Lord and Savior for the remission of their sins, they go to hell when they're murdered / when they die.\n\n \n \nI accept Christ and wish to receive his large kingdom and his great remission. MUMMMMMMMMMMM YUMMMMM Hallelujah\n\n \n Where's your repentance for your gay sex hedonism?", 
   {}, 
   423834, 
   null, 
   1297213140.0
  ], 
  [
   427275, 
   null, 
   "poet", 
   "Where's your repentance for your gay sex hedonism?\n\n \n What are you talking about? \n I'm in the 10th year of a committed, monogamous relationship, that despite impossible odds of ever coming to fruition, came to bear, because God made a way for it to happen, IMHO. Do you think my sins are more egregious than your own? Pride is one of the 7 deadly sins, don't you know?", 
   {}, 
   423846, 
   null, 
   1302640980.0
  ], 
  [
   427303, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider \n Where's your repentance for your gay sex hedonism?\n\n \n \nWhat are you talking about? \n I'm in the 10th year of a committed, monogamous relationship, that despite impossible odds of ever coming to fruition, came to bear, because God made a way for it to happen, IMHO.\n\n \n I seriously doubt that God would ordain or approve that which he has already condemned (gay sex relationships).\n \n \n Do you think my sins are more egregious than your own? \n\n \n Nope. Jesus can forgive all sinners who seek his salvation.\n \n \nPride is one of the 7 deadly sins, don't you know?\n\n \n Indeed it is. But from what I've seen the gays around here are too prideful to (1) acknowledge your gay sex sins, and (2) repent of them, and (3) ask Christ to forgive you.\n \n &#8220;But unless you repent, you too will all perish.&#8221; - Luke 13:3\n \n So where's your repentance?", 
   {}, 
   427275, 
   null, 
   1302691800.0
  ], 
  [
   427322, 
   null, 
   "poet", 
   "I seriously doubt that God would ordain or approve that which he has already condemned (gay sex relationships).\n Well, it really doesn't matter, at least to me, what you think. I happen to believe differently. I don't buy the Leviticus, or Romans arguments. Christ didn't speak to the matter...must not have been that pressing. \n \n Nope. Jesus can forgive all sinners who seek his salvation.\n \n Are you saying that I haven't or don't believe that? How could you know that? You don't know me. \n \n \n Indeed it is. But from what I've seen the gays around here are too prideful to (1) acknowledge your gay sex sins, and (2) repent of them, and (3) ask Christ to forgive you.\n \n \"But unless you repent, you too will all perish.\" - Luke 13:3\n \n So where's your repentance?\n\n \n Oh, holier than thou...where is your repentance. How dare you sit in judgment of me, when Christ specifically told folks not to judge lest they be judged. You sinned by arrogantly taking on Christ's position as Judge Supreme.\n I give a rat's booty what you've seen. I ask for forgiveness every night, as you must, as well. I'm in a committed monogamous relationship for the past 10 years, and believe with my whole heart that God ordained it. \n And I'm certain, you need to be practicing what you preach, and ask Christ to forgive you, for acting exactly like a Pharisee. Move around.", 
   {
    "unicode_changes_made": true
   }, 
   427303, 
   null, 
   1302722400.0
  ], 
  [
   427332, 
   null, 
   "Easyrider", 
   "Oh, holier than thou...where is your repentance.\n\n \n Ask God, he knows it well. Where's yours, O' self-righteous one?\n \n \nHow dare you sit in judgment of me, when Christ specifically told folks not to judge lest they be judged. You sinned by arrogantly taking on Christ's position as Judge Supreme.\n\n \n Your \"no judgment calls on ungodly behavior\" was roundly busted in the other thread (see link below). Evidently you glossed over it. \n \n http://www.4forums.com/political/gay-rights-debates/15259-gay-rights-campaigners-want-put-public-health-risk-denying-high-rates-hiv-2.html#post427319\n \n \n I give a rat's booty what you've seen. I ask for forgiveness every night, as you must, as well. I'm in a committed monogamous relationship for the past 10 years, and believe with my whole heart that God ordained it. \n\n \n Asking forgiveness for your sins is a good idea. Trying to justify gay sex sin isn't. That's like trying to justify a 10 year adulterous relationship because you \"love\" the other person and want to think God ordained that one too. \n \n Your self-serving arguments remind me of 2 Timothy 4:3: \"For the time will come when men will not out up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\"\n \n \nAnd I'm certain, you need to be practicing what you preach, and ask Christ to forgive you, for acting exactly like a Pharisee. Move around.\n\n \n Aren't you the one who said to stop judging? Hypocrite. \n \n You're the one acting like a Pharisee in teaching the traditions of men, vs. the teachings of God. Isaiah was right about people like you.", 
   {}, 
   427322, 
   null, 
   1302735540.0
  ], 
  [
   427335, 
   null, 
   "poet", 
   "Ask God, he knows it well. Where's yours, O' self-righteous one?\n \n \n \n Your \"no judgment calls on ungodly behavior\" was roundly busted in the other thread (see link below). Evidently you glossed over it. \n \n http://www.4forums.com/political/gay-rights-debates/15259-gay-rights-campaigners-want-put-public-health-risk-denying-high-rates-hiv-2.html#post427319\n \n \n \n Asking forgiveness for your sins is a good idea. Trying to justify gay sex sin isn't. That's like trying to justify a 10 year adulterous relationship because you \"love\" the other person and want to think God ordained that one too. \n \n Your self-serving arguments remind me of 2 Timothy 4:3: \"For the time will come when men will not out up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear.\"\n \n \n \n Aren't you the one who said to stop judging? Hypocrite. \n \n You're the one acting like a Pharisee in teaching the traditions of men, vs. the teachings of God. Isaiah was right about people like you.\n\n \n This is my last retort to you, and then you'll be on permanent ignore.\n I'm used to fake Christians like you, thinking that your quoting Bible scripture is your ticket through the pearly gates, for being some kind of \"Bible Thumper\" and Christian warrior, here on Earth.\n Pointing fingers at me, when you only know of my human frailties because I confessed them to this board and the world, because honesty and truthfulness matter in this world. Heaven forbid that you should do the same. And what horrors, perversions, inadequacies, shortcomings and human frailties would we be bombarded with if you were so circumspect and forthcoming?????\n Hypocrites like you, love to point fingers at gays and lesbians as the bane of this world, while excusing your myriad sins as forgivable or innocuous. \n It is written the first shall be last , and the last, first. What do you think that means? I think it means that all of you judgmental fake Christians thiinking you have this baby down, are in for a rude awakening. \n \n May I remind you, that the topic of homosexuality was so low on the totem pole, Christ didn't even address it...but in your arrogance and self-righteousness, you twist Scripture and his words to mean that it was. I don't believe it. I don't accept it. And since my relationship with the God of my understanding is a personal one, you and no other man, are in it. God knows my heart, and my intentions. He knows yours, and everyone else's. \n Keep your admonitions and your suggestions to yourself...I'm not interested in any charlatans, or those who are guilty of Bible Abuse. \n The Bible may have been divinely inspired, but pen to paper was the act of men, not God, and men are fallible, and quite often, \"get it wrong\". Begone, rubbish.", 
   {}, 
   427332, 
   null, 
   1302736920.0
  ], 
  [
   427373, 
   null, 
   "Easyrider", 
   "This is my last retort to you, and then you'll be on permanent ignore.\n\n \n That's fine. Stick your fingers in your ears so your conscience won't be offended when you hear the truth.\n \n \nI'm used to fake Christians like you, thinking that your quoting Bible scripture is your ticket through the pearly gates, for being some kind of \"Bible Thumper\" and Christian warrior, here on Earth.\n\n \n <Flush<\n \n Go sell your half-baked Sodom and Gommorah bath house theology on down the road, preppie.\n \n \n\n Hypocrites like you, love to point fingers at gays and lesbians as the bane of this world, while excusing your myriad sins as forgivable or innocuous. \n\n \n Nope. I recommend they come to Christ and repent of their illicit, gay sex sin and turn their lives around. But if you people prefer to remain stiff-necked and rebel against the Word of God, then go your way and see what happens when you hit the other side of the veil.\n \n \n\n \n It is written the first shall be last , and the last, first. What do you think that means? I think it means that all of you judgmental fake Christians thiinking you have this baby down, are in for a rude awakening.\n\n \n The Word of God is on my side. It condemns gay sex sin and you don't like it, so you go after the messenger. Well too bad, sport. \n \n \nMay I remind you, that the topic of homosexuality was so low on the totem pole, Christ didn't even address it...but in your arrogance and self-righteousness, you twist Scripture and his words to mean that it was. \n\n \n Horse manure. Jesus is God in Scripture and it was He who gave the Law to Moses, including the admonitions against gay sex. And it's God / Jesus who inspires all Scripture, including those admonistions against gay sex in the New Testament. So get your theology straight and quit your politically correct revisionism.\n \n \n\n Keep your admonitions and your suggestions to yourself...\n\n \n Go play in the traffic.", 
   {}, 
   427335, 
   null, 
   1302787800.0
  ], 
  [
   427401, 
   null, 
   "Accipiter", 
   "poet, you should know, ez is not a real person and pretty much a waste of time to talk to.\n \n All he is really good for is to mock.", 
   {}, 
   427373, 
   null, 
   1302840420.0
  ], 
  [
   427403, 
   null, 
   "foundit66", 
   "poet, you should know, ez is not a real person and pretty much a waste of time to talk to.\n All he is really good for is to mock.\n\n emoticon_rolleyes\n I don't know...\n \n EZ has rather effectively derailed this thread, removing any discussion of the actual topic that MrWriteLA started.\n \n In the end, EZ comes off as usual, but effectively removes recognition of the original point of the culpability of some christians who do not behave as blatantly as EZ does...\n Some christians who put on a pretense of acceptability (which EZ conveniently devolves himself from) while at the same time doing deplorable things (like those discussed in the original video).", 
   {}, 
   427401, 
   null, 
   1302844200.0
  ], 
  [
   427404, 
   null, 
   "poet", 
   "poet, you should know, ez is not a real person and pretty much a waste of time to talk to.\n \n All he is really good for is to mock.\n\n \n Thanks for the heads up.", 
   {}, 
   427401, 
   null, 
   1302845160.0
  ], 
  [
   427474, 
   null, 
   "Stevil", 
   "What happened to Mr. Kato was a travesty directly connected to the anti-gay christian propaganda that is being spewed forth by their government and some nutjobs in the U.S. that instigated it. \n \n I feel for his friends and family as no one deserves to be treated like he was. A funeral is a time to mourn and show respect to the dead and the family. I'm not a religious man, but I hope he would be proud of what he managed to do with his short time on this planet. I'm sure his friends and family were proud of him.", 
   {}, 
   427404, 
   null, 
   1302905700.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Watch: The Murder of David Kato", 
  "url": "http://www.4forums.com/political/gay-rights-debates/14995-watch-murder-david-kato.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 14995, 
  "discussion_files": [
   [
    "2909.html", 
    "http://www.4forums.com/political/gay-rights-debates/14995-watch-murder-david-kato-print.html"
   ], 
   [
    "2910.html", 
    "http://www.4forums.com/political/gay-rights-debates/14995-watch-murder-david-kato-2-print.html"
   ]
  ], 
  "identifier": 14995
 }
]