[
 [
  [
   423798, 
   null, 
   "NATO 556", 
   "Former Marine from Raleigh faces more gun charges - Wake County - NewsObserver.com\n \n \nRALEIGH -- A former Marine and Raleigh resident accused last summer of using North Carolina as a base for buying dozens of firearms and then smuggling them to England faces more federal weapons charges.\n \n Steven Greenoe, 37, was charged this week with conspiring to export firearms illegally, dealing in and exporting firearms without a license, failing to notify airlines of the shipments, and falsifying forms for the Bureau of Alcohol, Tobacco, Firearms and Explosives.\n \n The 50-count indictment was handed up by a federal grand jury Tuesday, almost a week after British law enforcement officers linked a handgun that Greenoe was suspected of purchasing to a drive-by shooting in Manchester, England.\n \n Since late January, British and U.S. authorities have investigated Greenoe, a New Orleans native who also has British citizenship.\n \n Investigators contend that Glock and Ruger 9 mm guns he purchased or persuaded others to purchase in North Carolina were going to criminal gangs in northwest England.\n \n \"The magnitude of this case touches not only U.S. citizens but our great British allies,\" George E.B. Holding, the U.S. attorney for the Eastern District of North Carolina, said in a statement. \"Our federal firearms laws were put into place to protect our citizens; however, our obligation as good neighbors is just as important to ensure that others are not harmed by individuals who break our firearms laws.\"\n \n In May, according to federal court documents, Transportation Security Administration officials questioned Greenoe at Raleigh-Durham International Airport after scanners showed scattered gun parts in his luggage.\n \n Greenoe got on the plane, prosecutors said in federal documents tied to the indictments, by telling airport officials that he was a gun dealer and the parts in his bags were non-working \"engineering samples.\"\n \n Greenoe did not obtain a license or written permission from the federal State Department to export firearms, as federal law requires, nor did he provide the proper written notice to the airlines that he was transporting weapons, according to the indictments.\n \n Greenoe is accused of smuggling more than 60 guns into England, where gun ownership is tightly regulated, in July 2010.\n \n From February to late July last year, federal authorities contend, Greenoe used a concealed weapons permit to purchase multiple handguns at a time from shops in Raleigh, Wendell, Asheboro, Angier and Concord.\n\n \n Very interesting. A member of the military has been caught smuggling weapons over to England. I guess this is yet another example of why gun ownership shouldn't be limited exclusively to the military and police like some would claim.", 
   {
    "post_info": {
     "post_title": "Marine faces weapon smuggling charges"
    }
   }, 
   null, 
   null, 
   1296883140.0
  ], 
  [
   423823, 
   null, 
   "daewoo", 
   "Former Marine from Raleigh faces more gun charges - Wake County - NewsObserver.com\n \n \n \n Very interesting. A member of the military has been caught smuggling weapons over to England. I guess this is yet another example of why gun ownership shouldn't be limited exclusively to the military and police like some would claim.\n\n \n ROTFLMAO. Billions of dollars a year to the TSA and he got on a plane with multiple handguns in his carry on by telling them that they were engineering samples. \n \n That is billions well spent!", 
   {}, 
   423798, 
   null, 
   1296965220.0
  ], 
  [
   423826, 
   null, 
   "zsu2357", 
   "ROTFLMAO. Billions of dollars a year to the TSA and he got on a plane with multiple handguns in his carry on by telling them that they were engineering samples. \n \n That is billions well spent!\n\n I must be missing something here but isn't TSA's job to avoid that from happening?Wonder if it would have been explosive device's in a non-working \"engineering samples\" if he would have gotten on? I think they are more interested in patting down people and doing their little booby scans. Oops meant body scans.emoticon_smile", 
   {}, 
   423823, 
   null, 
   1297035180.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Marine faces weapon smuggling charges", 
  "url": "http://www.4forums.com/political/gun-control-debates/14992-marine-faces-weapon-smuggling-charges.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 14992, 
  "discussion_files": [
   [
    "9347.html", 
    "http://www.4forums.com/political/gun-control-debates/14992-marine-faces-weapon-smuggling-charges-print.html"
   ]
  ], 
  "identifier": 14992
 }
]