[
 [
  [
   423925, 
   null, 
   "Brady", 
   "Although gun lovers claim the recent surge in sales across the country is due to a growing fear that the Obama Administration is secretly planning an all-out assault on Americans' Constitutionally-guaranteed right to bear arms, workers in the sex industry state there is another reason for the increase: Sexual dysfunction.\n \n Employees of the Busty Bunny Brothel, which has two locations outside of Las Vegas and one near downtown Reno, have been compiling data for a while now, and have finally come out with the results of their anecdotal study ... and their findings are startling.\n \n The madam at \"The Bunny\" as original establishment is called, said the women - who call themselves \"sexologists\" - have been noticing a fairly recent phenomenon: The men who come into the facilities toting guns have a much higher rate of erectile dysfunction than men who are not armed. Tania \"Tits\" Thompson, the owner of the string of brothels that is used by over 3,000 men per week, said that she has been reluctant to go public with the findings out of fear of a loss of business. \n New Study Links Guns, Sexual Dysfunction | Cleveland Leader\n \n I knew it!", 
   {
    "post_info": {
     "post_title": "New Study Links Guns, Sexual Dysfunction"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1297470840.0
  ], 
  [
   423927, 
   null, 
   "Doc Jones", 
   "Although gun lovers claim the recent surge in sales across the country is due to a growing fear that the Obama Administration is secretly planning an all-out assault on Americans' Constitutionally-guaranteed right to bear arms, workers in the sex industry state there is another reason for the increase: Sexual dysfunction.\n \n Employees of the Busty Bunny Brothel, which has two locations outside of Las Vegas and one near downtown Reno, have been compiling data for a while now, and have finally come out with the results of their anecdotal study ... and their findings are startling.\n \n The madam at \"The Bunny\" as original establishment is called, said the women - who call themselves \"sexologists\" - have been noticing a fairly recent phenomenon: The men who come into the facilities toting guns have a much higher rate of erectile dysfunction than men who are not armed. Tania \"Tits\" Thompson, the owner of the string of brothels that is used by over 3,000 men per week, said that she has been reluctant to go public with the findings out of fear of a loss of business. \n New Study Links Guns, Sexual Dysfunction | Cleveland Leader\n \n I knew it!\n\n \n So all the LEOS' and service members and gangsters have problems is what you are saying? Did that rub off on you trying to diddle little kids?", 
   {
    "unicode_changes_made": true
   }, 
   423925, 
   null, 
   1297471200.0
  ], 
  [
   423929, 
   null, 
   "Superlite27", 
   "No, Doc.\n \n He just came across this when he was researching erectile disfunction.\n \n Evidently, it cured him.", 
   {}, 
   423927, 
   null, 
   1297471620.0
  ], 
  [
   423930, 
   null, 
   "Brady", 
   "So all the LEOS' and service members and gangsters have problems is what you are saying? Did that rub off on you trying to diddle little kids?\n\n Police need guns to fight crime but why do people like you have guns? What are trying to compensate for?\n \n \"Men possess handguns in order to compensate for sexual dysfunction.\" - Dr. Joyce Brothers, Psychiatrist", 
   {
    "unicode_changes_made": true
   }, 
   423927, 
   null, 
   1297471920.0
  ], 
  [
   423931, 
   null, 
   "Doc Jones", 
   "Police need guns to fight crime but why do people like you have guns? What are trying to compensate for[sic]?\n\n \n PIDGIN Enlish but I don't know what you are trying to compensate for. You been all over the board about perverted sex but at least this time you had more qualified sources of whores than your usual 'experts'. emoticon_xclown\n \n \n\"Men possess handguns in order to compensate for sexual dysfunction.\" - Dr. Joyce Brothers, Psychiatrist\n\n \n Link? Exactly how would that be in line with your original claim? You changing horses in mid stream....again? emoticon_xclown", 
   {
    "unicode_changes_made": true
   }, 
   423930, 
   null, 
   1297472280.0
  ], 
  [
   423932, 
   null, 
   "Nozza123", 
   "Although gun lovers claim the recent surge in sales across the country is due to a growing fear that the Obama Administration is secretly planning an all-out assault on Americans' Constitutionally-guaranteed right to bear arms, workers in the sex industry state there is another reason for the increase: Sexual dysfunction.\n \n Employees of the Busty Bunny Brothel, which has two locations outside of Las Vegas and one near downtown Reno, have been compiling data for a while now, and have finally come out with the results of their anecdotal study ... and their findings are startling.\n \n The madam at \"The Bunny\" as original establishment is called, said the women - who call themselves \"sexologists\" - have been noticing a fairly recent phenomenon: The men who come into the facilities toting guns have a much higher rate of erectile dysfunction than men who are not armed. Tania \"Tits\" Thompson, the owner of the string of brothels that is used by over 3,000 men per week, said that she has been reluctant to go public with the findings out of fear of a loss of business. \n New Study Links Guns, Sexual Dysfunction | Cleveland Leader\n \n I knew it!\n\n \n \n \n HAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAHAHHAHAHAAHHAH\n \n Man i thought you anti gunners could not sink much lower than to keep referencing the brady campaign and Kellerman studies but then you linked to a book on amazon on Pedifiles and that was a new low.\n \n UNTIL you came on here and actually linked a \"story\" where whores are your \"experts\" Man that is just too good!! \n \n You have got me in stitches Brady!!!!!! emoticon_xgood", 
   {
    "unicode_changes_made": true
   }, 
   423925, 
   null, 
   1297473780.0
  ], 
  [
   423934, 
   null, 
   "Pietro", 
   "Although gun lovers claim the recent surge in sales across the country is due to a growing fear that the Obama Administration is secretly planning an all-out assault on Americans&#8217; Constitutionally-guaranteed right to bear arms, workers in the sex industry state there is another reason for the increase: Sexual dysfunction.\n \n Employees of the Busty Bunny Brothel, which has two locations outside of Las Vegas and one near downtown Reno, have been compiling data for a while now, and have finally come out with the results of their anecdotal study &#8230; and their findings are startling.\n \n The madam at &#8220;The Bunny&#8221; as original establishment is called, said the women &#8212; who call themselves &#8220;sexologists&#8221; &#8212; have been noticing a fairly recent phenomenon: The men who come into the facilities toting guns have a much higher rate of erectile dysfunction than men who are not armed. Tania &#8220;Tits&#8221; Thompson, the owner of the string of brothels that is used by over 3,000 men per week, said that she has been reluctant to go public with the findings out of fear of a loss of business. \n New Study Links Guns, Sexual Dysfunction | Cleveland Leader\n \n I knew it!\n\n \n The last time I checked prostitution was a criminal offense. So in essence this study is being put forth by criminals. I think that fact alone unravels what you might have to offer Brady. Whatever they have to offer amounts to nothing more than a study put forward by people like muggers or rapists or arsonists.\n \n For what reason do you choose to cite criminals?\n \n The Founding Fathers of America had guns. They had many children to help populate the country. The genealogy is there to prove it. How could they have families and children if they were impotent and unable to get it up?", 
   {}, 
   423925, 
   null, 
   1297474980.0
  ], 
  [
   423935, 
   null, 
   "Pietro", 
   "Police need guns to fight crime but why do people like you have guns? What are trying to compensate for?\n\n \n I remember putting forth a question a while back but got absolutely no answer. So I'll put it forth again and see if somebody is brave enough to answer it this time.\n \n Why exactly do the police need to be armed and armored for the purpose of coming to our rescue, but those of us who often need to be rescued are somehow without a need to be armed?\n \n What makes the police so special? Why should they be allowed to be armed so they can be dispatched by a 911 operator to come and respond to a home invasion call, but the person who's home has been broken into is somehow without need to be armed for any reason? Is being a victim somehow a higher duty than exercising personal responsibility?\n \n We have a right to defend ourselves. That right isn't limited to antiquated technology that originated in a bygone era. The Supreme Court rejected the argument that the Second Amendment applies only to muskets and 18th century technology. Their findings applies constitutional protection to all modern made firearms in common use and that includes the guns that you choose to hate and demonize. You have no legal standing to object to this matter.", 
   {}, 
   423930, 
   null, 
   1297475220.0
  ], 
  [
   423936, 
   null, 
   "Superlite27", 
   "Pietro,\n \n I don't think you've observed the reality of Brady's and other anti's situation, yet.\n \n You ask for a rational explanation. I've been asking rational questions for ages. Everyone can see the failure of Brady and others of his ilk to answer these questions. It's obvious to everyone...except them.\n \n They cannot answer. \n \n YOU ARE ASKING FOR A RATIONAL EXPLANATION FROM PEOPLE WHO LIVE THEIR LIVES IN A REALITY DEVOTED ENTIRELY TO UNEXAMINED SOUND BITES.\n \n They will throw an irrellevant sound bite at you in answer. In their world, they are providing an explanation and counter argument.\n \n Look at Brady's own words:\nPolice need guns to fight crime\n\n \n HE CAN'T EVEN EXPLAIN THE RATIONALE BEHIND HIS OWN STATEMENTS! \n \n For all his bluster, he can't even explain WHY the police need guns to fight crime! The process the police use these guns to fight crime, the reason for them to use guns, and why a metal disk (badge) makes it O.K. for them to protect their lives, but the lack of a metal disk makes it bad won't even be analyzed. He can't even explain what his own words mean:\n \n (How do these cops use their guns to fight crime, Brady? You said it.Expalin it.)\n \n It's all just a sound bite for them. No thought required. The discrepancies in their thought processes will not be explained.\n \n Just another hurled sound bite will be forthcoming. No attempt to think about why his own statement \"Cops need guns to fight crime\" is the exact argument we've been throwing at him all along. He can't even explain his own thought processes because there is none involved.\n \n Just regurgitated sounds an anti is supposed to make.\n \n Expecting a detailed explanation of rational questions is delusional, Pietro. Why keep asking, other than to lend light to the sun, about how their arguments have no basis in rationality? They do that well enough on their own by ignoring these simple questions.", 
   {}, 
   423930, 
   null, 
   1297481580.0
  ], 
  [
   423937, 
   null, 
   "Xcaliber", 
   "Police carry weapons for the same reason normal citizens carry weapons, Protection against Criminals . \n \n This is the most ridiculous claim yet, So owning a Gun will make men impotent...ROFLMAO...\n \n I own a few Guns.. I Carry one on me at all time, well except where the Gun Grabbers have deemed it Illegal... and so far ALL of my guns are still working properly.. including the one I was born with....", 
   {}, 
   423936, 
   null, 
   1297482600.0
  ], 
  [
   423945, 
   null, 
   "Tither", 
   "One nice thing about Brady. He/She whichever, posts from The Anti-gun websites and comes out with the most ridiculous studies and comments that no one searching for the truth would ever take him/her seriously. \n \n He/she is just the entertainment.\n \n Here, let me tick Brady off. Our Founders believed in the Right to Keep and Bear Arms! It is an Inalienable, Fundamental, Constitutionally recognized as protected Right of We the People. Which leads me to a questions. How many of our other Bill of Rights do you HATE? \n \n And let me further tick Brady off. John Lott!", 
   {}, 
   423937, 
   null, 
   1297531500.0
  ], 
  [
   423951, 
   null, 
   "zsu2357", 
   "The last ditch ramblings of a desperate anti-gunner that can't come up with\n anything better.Now I heard he/she? well if its a he,he's probably really into his source(or trying).If he's a she I invite her over to prove how wrong she is.\n \n hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahaaaaaahhhhhhhhhaaaaaaaaaa\n \n Nozz. I agree.I guess you said it best.", 
   {}, 
   423945, 
   null, 
   1297549320.0
  ], 
  [
   423960, 
   null, 
   "Doc Jones", 
   "Looks like brady ran out of hot air and crashed his balloon :) emoticon_hb", 
   {}, 
   423951, 
   null, 
   1297564380.0
  ], 
  [
   423975, 
   null, 
   "sinjin", 
   "The last time I checked prostitution was a criminal offense. So in essence this study is being put forth by criminals.\nMaybe time to check again. Prostitution is legal in some Nevada counties.", 
   {}, 
   423934, 
   null, 
   1297616880.0
  ], 
  [
   423979, 
   null, 
   "Doc Jones", 
   "Maybe time to check again. Prostitution is legal in some Nevada counties.\n\n \n Yep, read about the government managed one and they can't even run a whore house selling alcohol and make a profit.\n \n These are the same guys walking guns across the border and lying and you want them to control rights.\n \n I guess that makes you prostitutes close business buddies? emoticon_xgood", 
   {}, 
   423975, 
   null, 
   1297619340.0
  ], 
  [
   423980, 
   null, 
   "Doc Jones", 
   "Looks like sliiiick shot his wad. emoticon_xclown", 
   {}, 
   423979, 
   null, 
   1297619460.0
  ], 
  [
   424089, 
   null, 
   "NATO 556", 
   "I feel the need to ask a very simple question here.\n \n Brady and Dr. Joyce Brothers claims that gun ownership is a symptom of sexual dysfunction. Brady's cited source for this thread, being prostitutes, says that more men visiting brothels while armed are having trouble getting it up.\n \n So we come to the question: why would anyone who's suffering from sexual dysfunction and incapable of doing it right, ever visit a brothel in the first place? If you can't get it up then you're not going to visit a whore house and basically just throw your money away for something you can't take part in.", 
   {}, 
   423980, 
   null, 
   1297744680.0
  ], 
  [
   424096, 
   null, 
   "zsu2357", 
   "I feel the need to ask a very simple question here.\n \n Brady and Dr. Joyce Brothers claims that gun ownership is a symptom of sexual dysfunction. Brady's cited source for this thread, being prostitutes, says that more men visiting brothels while armed are having trouble getting it up.\n \n So we come to the question: why would anyone who's suffering from sexual dysfunction and incapable of doing it right, ever visit a brothel in the first place? If you can't get it up then you're not going to visit a whore house and basically just throw your money away for something you can't take part in.\n\n It could be that Mr.Brady is a closet Rambo and he's acting out his pent up frustrations(and I bet he's really frustrated)and alas has not learned yet that he's throwing away his money.emoticon_smile", 
   {}, 
   424089, 
   null, 
   1297750080.0
  ], 
  [
   424101, 
   null, 
   "sinjin", 
   "So we come to the question: why would anyone who's suffering from sexual dysfunction and incapable of doing it right, ever visit a brothel in the first place? If you can't get it up then you're not going to visit a whore house and basically just throw your money away for something you can't take part in.\nHope springs eternal? Or not. \n ED doesn't always happen, every time in every situation is the real answer.\n \n \"Incapable of doing it right\"? Seriously? \n You're well out of your element I wager.", 
   {}, 
   424089, 
   null, 
   1297758780.0
  ], 
  [
   424113, 
   null, 
   "Doc Jones", 
   "I feel the need to ask a very simple question here.\n \n Brady and Dr. Joyce Brothers claims that gun ownership is a symptom of sexual dysfunction. Brady's cited source for this thread, being prostitutes, says that more men visiting brothels while armed are having trouble getting it up.\n\n \n Strange, Dr. Joyce B's husband had guns and packed a pistol. I don't know if she was a prostitute or not?\n Now ol' brady got a long barrel gun (the boy) so is this an admission that he is having inferiorority and ED as sliiiiick claims and brady complains about? That certainly hasn't been my experience :) emoticon_xbouncer Perhaps drugs have burned them out early, way early. \n \n \nSo we come to the question: why would anyone who's suffering from sexual dysfunction and incapable of doing it right, ever visit a brothel in the first place? If you can't get it up then you're not going to visit a whore house and basically just throw your money away for something you can't take part in.\n\n \n Sliiiiiick took that into hand and he and brady stand inseparably linked on the pop sex issues. :) emoticon_xagree", 
   {}, 
   424089, 
   null, 
   1297781580.0
  ], 
  [
   424118, 
   null, 
   "zsu2357", 
   "Doc Jones \n Sliiiiiick took that into hand and he and brady stand inseparably linked on the pop sex issues.\n\n Who took who's sliiiiick whatemoticon_rolleyes[/SIZE] in hand?", 
   {}, 
   424113, 
   null, 
   1297802760.0
  ], 
  [
   424121, 
   null, 
   "sinjin", 
   "...Dr. Joyce Brothers claims that gun ownership is a symptom of sexual dysfunction.\nThe places I see this supposed quote by Dr. Brothers are invariably pro-gun. Do you know where the quote originates?\n \n Could it be this response to a letter:\n \n Thursday, February 26, 2004\n \n Owning guns helps erase feelings of inferiority\n \n By DR. JOYCE BROTHERS\n SYNDICATED COLUMNIST\n \n DEAR DR. BROTHERS: My husband and I live in a gated community that could hardly be safer. This choice of a place to live was mine, incidentally, not his. We both work at jobs in a nearby city, and we're not threatened in any unusual way. Our offices are pleasant and in good areas. What I'm trying to figure out is why my husband needs so many guns. He's an old Army guy, but none of his friends seems to have this particular fascination with guns, so I don't think that explains it. I bring this up now because he told me recently that he found two more he's going to buy from yet another gun dealer. They're not cheap, and we could use that money to clean up some of our bills. -- E.C.\n \n DEAR E.C.: Gun ownership is extremely important to some people, and often they're not aware of why. To most, the gun means added power, something that erases all feelings of inferiority, weakness, vulnerability and impotence. It's not irrelevant that guns, in themselves, are so frequently linked to sexuality and the male sex organ. Think of the many slang terms common to both sex and guns, and the relationship becomes obvious. Guns have been accurately called \"the great equalizer.\"\n Owning guns helps erase feelings of inferiority\n \n \n sinjin - If so, she's not quite saying what is claimed that she is saying. \n Could this be a manufactured quote? Say it's not so.", 
   {}, 
   424089, 
   null, 
   1297803780.0
  ], 
  [
   424122, 
   null, 
   "sinjin", 
   "Who took who's sliiiiick whatemoticon_rolleyes[/SIZE] in hand?\nI long ago gave up on Doc's incoherent ramblings.", 
   {}, 
   424118, 
   null, 
   1297803960.0
  ], 
  [
   424126, 
   null, 
   "NATO 556", 
   "The places I see this supposed quote by Dr. Brothers are invariably pro-gun. Do you know where the quote originates?\n \n Could it be this response to a letter:\n \n Thursday, February 26, 2004\n \n Owning guns helps erase feelings of inferiority\n \n By DR. JOYCE BROTHERS\n SYNDICATED COLUMNIST\n \n DEAR DR. BROTHERS: My husband and I live in a gated community that could hardly be safer. This choice of a place to live was mine, incidentally, not his. We both work at jobs in a nearby city, and we're not threatened in any unusual way. Our offices are pleasant and in good areas. What I'm trying to figure out is why my husband needs so many guns. He's an old Army guy, but none of his friends seems to have this particular fascination with guns, so I don't think that explains it. I bring this up now because he told me recently that he found two more he's going to buy from yet another gun dealer. They're not cheap, and we could use that money to clean up some of our bills. -- E.C.\n \n DEAR E.C.: Gun ownership is extremely important to some people, and often they're not aware of why. To most, the gun means added power, something that erases all feelings of inferiority, weakness, vulnerability and impotence. It's not irrelevant that guns, in themselves, are so frequently linked to sexuality and the male sex organ. Think of the many slang terms common to both sex and guns, and the relationship becomes obvious. Guns have been accurately called \"the great equalizer.\"\n Owning guns helps erase feelings of inferiority\n \n \n sinjin - If so, she's not quite saying what is claimed that she is saying. \n Could this be a manufactured quote? Say it's not so.\n\n \n Well if it really is a manufactured quote created by the pro-gun community, designed to spread propaganda against supporters of gun control, then Brady has some explaining to do for why he chooses to cite it so readily", 
   {}, 
   424121, 
   null, 
   1297808700.0
  ], 
  [
   424141, 
   null, 
   "zsu2357", 
   "DEAR E.C.: Gun ownership is extremely important to some people, and often they're not aware of why. To most, the gun means added power, something that erases all feelings of inferiority, weakness, vulnerability and impotence. It's not irrelevant that guns, in themselves, are so frequently linked to sexuality and the male sex organ. Think of the many slang terms common to both sex and guns, and the relationship becomes obvious. Guns have been accurately called \"the great equalizer.\"\n\n \n does that mean baseball bats have some kind of sexual connection here.After all there is the saying\"I hit a home run last night\"\"big as a baseball bat\"to name a few.", 
   {}, 
   424126, 
   null, 
   1297820640.0
  ], 
  [
   424164, 
   null, 
   "Galileo", 
   "\"Come here, rude boy, boy; can you get it up?\n \"Come here rude boy, boy; is you big enough?\n \"Take it, take it baby, baby\n \"Take it, take it; love me, love me....\"\n YouTube - Rihanna - Rude Boy\n \n So would a lot of people here have to answer \"no\" to those questions?", 
   {}, 
   424141, 
   null, 
   1297892460.0
  ], 
  [
   424174, 
   null, 
   "Nozza123", 
   "\"Come here, rude boy, boy; can you get it up?\n \"Come here rude boy, boy; is you big enough?\n \"Take it, take it baby, baby\n \"Take it, take it; love me, love me....\"\n YouTube - Rihanna - Rude Boy\n \n So would a lot of people here have to answer \"no\" to those questions?\n\n \n Hmmm as much as i like some of rihannas music especially love the way you lie with Eminem I feel the need to question why you are attempting to reference a song when discussing gun control? \n \n Have you really got no comeback left except attemting to insult the \"size\" of every person who owns a gun. \n \n One question from me to you. If as you say people who own or use firearms has problems with \"size and the ability to use it down there\" how do you explain soldiers who run into a hail of bullets to save a mate? How do you explain Lt Michael Murphy who was awarded the Medal of Honor for his actions, are you saying he had a \"size\" issue?", 
   {}, 
   424164, 
   null, 
   1297900620.0
  ], 
  [
   424176, 
   null, 
   "Pietro", 
   "Galileo surely you have something more concrete to offer than obscure sexual references and innuendos, right? You're not basing your entire argument on the opinions of entertainers and thieves to establish a point of debate are you?\n \n Despite all of the claims that have been made I've seen no sufficient evidence to suggest that people choose to own guns because of impotence and sexual dysfunction. I've seen evidence that they choose to own a gun for all manner of reasons such as: increased crime rates, fewer police officers, slower police response times, danger while traveling, attack by wild animals, sport, hunting, collecting, and because it's an individual constitutional right and needs to justification for it to be exercised in the first place.\n \n Of course this could raise an interesting question. If people choose to own guns because they suffer sexual dysfunction, are gun control advocates homophobic and afraid of sex? If guns represent compensation then surely those who seek to deprive people of guns have an overwhelming fear of the concept of sexual vitality.\n \n But sexual dysfunction doesn't seem to be on the list of reasons for why people choose to become a gun owner. And this fact is only hammered home when you consider how many micro guns are owned. If people really were compensating for their own sexual inadequacy by owning a gun then one of these North American Arms mini-revolvers chambered for the .22 Short surely wouldn't be the way to go about doing it. Nobody would own anything less than the biggest guns they could get. There would be a lot more Barrett rifles and .500 Magnum revolvers in circulation than there are right now if it's all about sexual compensation.\n \n And now we come to the question round and the supporters of Dr. Joyce Brothers get to start justifying their position that they're trying to establish.\n \n Even if people with sexual dysfunction do choose to own guns, what exactly does that have to do with anything? Gun ownership is a constitutional right, any adult who isn't clinically insane or a felon is free to exercise this right anytime they want without need to justify their decision to anyone other than themselves and their saving accounts.\n \n Of course then we come to Brady's newest position of foolishness. According to Brady any regular person who chooses to own a gun is simply compensation for sexual dysfunction, but when the person in question is a soldier or a police officer (even one who is retired and no longer able to contribute to society like they originally could) then they suffer absolutely no sexual dysfunction and their status of being armed is because they need to be armed to address whatever threat might arise. Threats that specifically target the police exclusively and leave everyone else alone.\n \n Of course that brings about another interesting question. If only the police need guns because only the police ever face the risk of danger from day to day, why are there between 10,000 and 15,000 homicides committed each year with a gun, but only a minute number of those thousands are police officers? Were all of the non-police murder victims simply caught in the crossfire and nothing more than casualties of an attempt to murder a police officer?", 
   {}, 
   424164, 
   null, 
   1297900860.0
  ], 
  [
   424183, 
   null, 
   "sinjin", 
   "Of course this could raise an interesting question. If people choose to own guns because they suffer sexual dysfunction, are gun control advocates homophobic and afraid of sex? If guns represent compensation then surely those who seek to deprive people of guns have an overwhelming fear of the concept of sexual vitality.\nEither that or they are hung and hard on demand which would be the actual converse you wish to overlook.", 
   {}, 
   424176, 
   null, 
   1297903680.0
  ], 
  [
   424229, 
   null, 
   "Doc Jones", 
   "Either that or they are hung and hard on demand which would be the actual converse you wish to overlook.\n\n \n \n I wouldn't know anything about that. Is that what your husband told you sliiiiiick?\n \n Care to address the number of homosexuals incarcerated for felony and criminal gun use and the rate of rape in prison? That alone should tell you fiction is stranger than the truth.\n \n Famous outlaw couples have admitted that sex after violent confrontations were very satisfactory. Where do you reckon THRILL KILLING originated?\n \n A personal question if I may; would you trust brady around your kids if you were not present? Failure to give an honest answer would betray your applauding of brady's stance on an unscientific \"study\" without parameters nor qualified data as fiction at best and a lie at the worst. At either rate it is pure propaganda and a fairy tale which is the reason you, brady and star gazer quote unassociated 'poetry' in a feeble attempt to quantify your misleading and inept ability to make factual statements. All of you are frauds and cheap hucksters that couldn't make the carnival side shows.\n \n emoticon_xbye emoticon_xclown", 
   {}, 
   424183, 
   null, 
   1297946280.0
  ], 
  [
   424231, 
   null, 
   "Winston Smith", 
   "keep stroking your .... gun emoticon_rolleyes", 
   {}, 
   424229, 
   null, 
   1297948440.0
  ], 
  [
   424234, 
   null, 
   "Doc Jones", 
   "keep stroking your .... gun emoticon_rolleyes\n\n \n \n Well, well, look what the fires and cyclones flushed out of the basements :)\n \n How is the world did you get out mestizo? Good thing you didn't have a drop of European blood in you huh? Amazing what some good floods will flush up and float off. I hear you are in for some more baudacious floods. Keep an eye out for those vicious non-flying birds or they will eat you like buzzards a bite at a time...and the snakes, Lordie have mercy. If I were you, which I am sure glad I am not, I would have several guns on myself for personal protection. When the sink holes go to opening up and swallowing the new rivers and lakes , maybe Australia will actually get some underground aquifers?\n \n You can float can't you? emoticon_xbye", 
   {}, 
   424231, 
   null, 
   1297958340.0
  ], 
  [
   424247, 
   null, 
   "zsu2357", 
   "Personally I'd opt for the DoDo,geographical location may be a little off,but none the less its the thought that counts.emoticon_xhoho.Up in my neck of the woods we say what the cats drug up.emoticon_xbouncer", 
   {
    "post_info": {
     "post_title": "cassowary,dodo's and cats"
    }
   }, 
   424234, 
   null, 
   1297972440.0
  ], 
  [
   424353, 
   null, 
   "Brady", 
   "Well if it really is a manufactured quote created by the pro-gun community, designed to spread propaganda against supporters of gun control, then Brady has some explaining to do for why he chooses to cite it so readily\n\n Thats just like blaming a rape victim for rape. Dont blame the people that get tricked by the lies of progunners. Blame the people who tell the lies. Dont blame rape victims. Blame rapists.", 
   {}, 
   424126, 
   null, 
   1298149200.0
  ], 
  [
   424354, 
   null, 
   "Doc Jones", 
   "Thats just like blaming a rape victim for rape. Dont blame the people that get tricked by the lies of progunners. Blame the people who tell the lies. Dont blame rape victims. Blame rapists.\n\n \n You about finished goober :) You been around the barn now for the 11 teenth time...\n \n You aren't fooling no one any more except maybe yourself. Ever hear of the ship without a rudder? You even got a new legal honcho now; did the rest have enough sense to quit when they realized they were at the bottom of the outhouse and were not going to get paid? emoticon_xgood", 
   {}, 
   424353, 
   null, 
   1298151060.0
  ], 
  [
   424358, 
   null, 
   "Pietro", 
   "To kick things off Brady I really find it distasteful that you're basically comparing yourself to a rape victim on the basis that you were fooled into citing something that would be considered propaganda. If you're going to establish the position of someone else and purport it as your own then it would be in your best interest to do your own fact checking so you don't wind up looking foolish.\n \n \nThats just like blaming a rape victim for rape. Dont blame the people that get tricked by the lies of progunners. Blame the people who tell the lies. Dont blame rape victims. Blame rapists.\n\n \n Well now this is a very interesting message you're putting out Brady. So interesting in fact that I believe it can be cited later on down the road to rebuke some of your future claims. You're stating that rather than blaming those that are fooled by the lies, we should instead go after those who lie in the first place and purport the myth.\n \n Does this mean that you agree we should blame and attack the Brady Campaign and the Violence Policy Center and other political activists when they resort to trickery and deceit to try and further their gun control agendas? Afterall we have Josh Sugarmann going on record as saying the confusion of the public regarding the nature of guns is a great benefit as their lack of knowledge will help push policies. He's basically telling his followers to exploit a lack of understanding in order to get what they want and trick the people into believing whatever they want them to believe.\n \n When these groups decide to purport the myths of \"plastic guns that are undetectable by airport security\" or missile launchers being bought in America by the drug cartels of Mexico, does that mean that we can accuse them of hostile actions akin to rapists?", 
   {}, 
   424353, 
   null, 
   1298153280.0
  ], 
  [
   424462, 
   null, 
   "Winston Smith", 
   "Thats just like blaming a rape victim for rape. Dont blame the people that get tricked by the lies of progunners. Blame the people who tell the lies. Dont blame rape victims. Blame rapists.\n\n \n is Doc Jones a victim or a rapist, metaphorically speaking ?\n \n I think your analogy is defective, people who according to you get tricked by the lies of gun crazies want to be tricked they want an excuse to own guns and the gun crazies accomodate them. So maybe it is not rape but they willingly open their .... minds to the crazies (rapists)\n \n probably Doc and NATO were raped (metaphorically speaking) at an early age and them infected by the disease became rapists themselves (metaphorically speaking). \n \n Doc has really lost it, and the scary thought is : this crazy has an arsenal at home emoticon_rolleyes", 
   {}, 
   424353, 
   null, 
   1298297460.0
  ], 
  [
   424463, 
   null, 
   "Winston Smith", 
   "Well, well, look what the fires and cyclones flushed out of the basements :)\n \n How is the world did you get out mestizo? Good thing you didn't have a drop of European blood in you huh? Amazing what some good floods will flush up and float off. I hear you are in for some more baudacious floods. Keep an eye out for those vicious non-flying birds or they will eat you like buzzards a bite at a time...and the snakes, Lordie have mercy. If I were you, which I am sure glad I am not, I would have several guns on myself for personal protection. When the sink holes go to opening up and swallowing the new rivers and lakes , maybe Australia will actually get some underground aquifers?\n \n You can float can't you? emoticon_xbye\n\n \n Keep stroking your .... gun emoticon_xclown", 
   {}, 
   424234, 
   null, 
   1298297760.0
  ], 
  [
   424471, 
   null, 
   "Doc Jones", 
   "is Doc Jones a victim or a rapist, metaphorically speaking ?\n \n I think your analogy is defective, people who according to you get tricked by the lies of gun crazies want to be tricked they want an excuse to own guns and the gun crazies accomodate them. So maybe it is not rape but they willingly open their .... minds to the crazies (rapists)\n \n probably Doc and NATO were raped (metaphorically speaking) at an early age and them infected by the disease became rapists themselves (metaphorically speaking). \n \n Doc has really lost it, and the scary thought is : this crazy has an arsenal at home emoticon_rolleyes\n\n \n Since your entire purpose of this attack was an AD HOM directed at me, I will reply to the only excuse for a point you tried to frame.\n \n \nI think your analogy is defective, people who according to you get tricked by the lies of gun crazies want to be tricked they want an excuse to own guns and the gun crazies accomodate them. So maybe it is not rape but they willingly open their .... minds to the crazies (rapists)\n \n \n\n \n We, gun owners exercising our Constitutional Rights from the penning of the Declaration of Independence and before that the Compact between the States and since ruled on at least 25 times by the U.S. Supreme Court including the 3rd recent one in 1994 in Staples v. U.S. certifying the long standing tradition and individual right to keep and bear arms and the common law right of CITIZEN ARREST pretty well shows who the LIARS are and why they keep right on losing. That is not even metioning {I]Heller nor McDonald[/I]. When your sheep mind joins the real world it will be too late. You antipodeans gave up any claim to rights you may have had and got raped out of them by incidents like the Bryant episode which you evidently know nothing about. \n \n The only other thing that is evident, even money says your mother continually says, \"baaaaaaa\". :)", 
   {}, 
   424462, 
   null, 
   1298300280.0
  ], 
  [
   424475, 
   null, 
   "Winston Smith", 
   "If you separate a gun crazy from his gun(s) for good, what will happen:\n \n a) he will curl in a fetal position in a corner of his room and s*** himself ?\n \n b) he will cry out \"Mum !!!!!! \"\n \n c) he will enter a catatonic state\n \n d) he will (given time) become a normal person\n \n I think that in Doc's case a) is the answer emoticon_smile", 
   {
    "post_info": {
     "post_title": "Questions"
    }
   }, 
   424471, 
   null, 
   1298301300.0
  ], 
  [
   424476, 
   null, 
   "Doc Jones", 
   "Hey porque, what caused your sexual dysfunction?\n \n a) guns\n \n b) fat/personal rejection\n \n c) selfish and whiney outlook from your personal point of view\n \n d) Ignorance and deprivation\n \n e) inbreeding \n \n Hint: from your own stance and admission it sure wasn't firearms.\n \n Crocodile kills boy in Outback community - World News\n Be a hero Raulito :)", 
   {}, 
   424475, 
   null, 
   1298301780.0
  ], 
  [
   424477, 
   null, 
   "Doc Jones", 
   "Since your entire purpose of this attack was an AD HOM directed at me, I will reply to the only excuse for a point you tried to frame.\n \n \n \n We, gun owners exercising our Constitutional Rights from the penning of the Declaration of Independence and before that the Compact between the States and since ruled on at least 25 times by the U.S. Supreme Court including the 3rd recent one in 1994 in Staples v. U.S. certifying the long standing tradition and individual right to keep and bear arms and the common law right of CITIZEN ARREST pretty well shows who the LIARS are and why they keep right on losing. That is not even metioning {I]Heller nor McDonald[/I]. When your sheep mind joins the real world it will be too late. You antipodeans gave up any claim to rights you may have had and got raped out of them by incidents like the Bryant episode which you evidently know nothing about. \n \n The only other thing that is evident, even money says your mother continually says, \"baaaaaaa\". :)\n\n \n ****Correction: that should be U.S v. Staples. Pardon for the reverse parties.", 
   {}, 
   424471, 
   null, 
   1298302200.0
  ], 
  [
   424488, 
   null, 
   "Pietro", 
   "Well Winston Smith it seems as though you're just another in a long line of people who have no debating skills and lacks the simple ability to engage in honest discussion. Here we've shown our intelligence and exercised our ability to engage in honest and civil debate, showing the fallacy of the belief that gun ownership is a symptom of sexual dysfunction, disproving Galileo and his citing of prostitutes as source material. We've systematically proven the fallacy of this argument, and what do you have to offer in response? Crude sexual references designed to infuriate others.\n \n Some want to believe that the only reason anybody would own a gun is to compensate for their shortcomings in bed. However based on your recent posts I believe that it's you who's compensating, resorting to crude sexual references and trolling tactics in an attempt to hide the fact that you couldn't engage in an honest debate if your life depended on it. Small minds such as yours go for the quick and easy, a position that can easily be decimated in a matter of minutes by someone with the ability to think.\n \n The fact of the matter is that we're superior to you simply because we're capable of putting far more thought and effort into our works then you would ever consider doing for your own. So instead you try and degrade the discussion into trolling and flaming and rhetoric in hopes of the point being forgotten because you can't address it. You try and insult us in hopes we'll insult you back and get far off topic from what the thread started out as. It's a fairly standard liberal tactic designed to shut down honest debate. The tactic got a lot of use during the health care reform debates, with liberal supporters simply chanting \"health care now!\" and using it as the entirety of their argumentative position. No reasoning for why the bill should we allowed to be signed into law, no covering important points and criticism, just quick soundbyte statements that're devoid of substance and reasonability.\n \n And then we come to your constantly repeated term of \"gun crazies\" that you seem to readily apply to anyone who doesn't believe in further gun control.\n \n Despite what you and others may want to believe to the contrary gun ownership is recognized as a constitutional right and protected just like any other right in the constitution. There's nothing you can do to change that fact. So when you slam gun owners you're basically attacking people who believe in and support the constitution itself and all it stands for and protects.\n \n Let's look at your tactic and slandering people as \"gun crazies\" for a minute. Since you're attacking those who support the constitution then perhaps you'd care to extend the scope of your attack to people who might qualify as \"book crazies\" or \"privacy nuts\" or \"trial by jury fanatics\" just to name a few other constitutional points?\n \n I don't know what part of the world you may hark from, but the constitution still exists in America. All of its protections and recognized rights are equal to each other, all subject to the same respect and protection against infringement. Nobody has the authority to play pick and choose. Nobody is allowed to recognize only certain rights that they agree with and pretending that all others don't exist. It's an all or nothing package deal with no inbetween.", 
   {}, 
   423925, 
   null, 
   1298320800.0
  ], 
  [
   424490, 
   null, 
   "gansao", 
   "Winston is a Chilean who ran away from Chile and now lives in Australia.\n Who can blame him for having a chip on his shoulder...its heartbreakingemoticon_confused", 
   {}, 
   424488, 
   null, 
   1298322000.0
  ], 
  [
   424491, 
   null, 
   "Galileo", 
   "Well Winston Smith it seems as though you're just another in a long line of people who have no debating skills and lacks the simple ability to engage in honest discussion. Here we've shown our intelligence and exercised our ability to engage in honest and civil debate, showing the fallacy of the belief that gun ownership is a symptom of sexual dysfunction, disproving Galileo and his citing of prostitutes as source material. We've systematically proven the fallacy of this argument, and what do you have to offer in response? Crude sexual references designed to infuriate others.\n \n Some want to believe that the only reason anybody would own a gun is to compensate for their shortcomings in bed. However based on your recent posts I believe that it's you who's compensating, resorting to crude sexual references and trolling tactics in an attempt to hide the fact that you couldn't engage in an honest debate if your life depended on it. Small minds such as yours go for the quick and easy, a position that can easily be decimated in a matter of minutes by someone with the ability to think.\n \n The fact of the matter is that we're superior to you simply because we're capable of putting far more thought and effort into our works then you would ever consider doing for your own. So instead you try and degrade the discussion into trolling and flaming and rhetoric in hopes of the point being forgotten because you can't address it. You try and insult us in hopes we'll insult you back and get far off topic from what the thread started out as. It's a fairly standard liberal tactic designed to shut down honest debate. The tactic got a lot of use during the health care reform debates, with liberal supporters simply chanting \"health care now!\" and using it as the entirety of their argumentative position. No reasoning for why the bill should we allowed to be signed into law, no covering important points and criticism, just quick soundbyte statements that're devoid of substance and reasonability.\n \n And then we come to your constantly repeated term of \"gun crazies\" that you seem to readily apply to anyone who doesn't believe in further gun control.\n \n Despite what you and others may want to believe to the contrary gun ownership is recognized as a constitutional right and protected just like any other right in the constitution. There's nothing you can do to change that fact. So when you slam gun owners you're basically attacking people who believe in and support the constitution itself and all it stands for and protects.\n \n Let's look at your tactic and slandering people as \"gun crazies\" for a minute. Since you're attacking those who support the constitution then perhaps you'd care to extend the scope of your attack to people who might qualify as \"book crazies\" or \"privacy nuts\" or \"trial by jury fanatics\" just to name a few other constitutional points?\n \n I don't know what part of the world you may hark from, but the constitution still exists in America. All of its protections and recognized rights are equal to each other, all subject to the same respect and protection against infringement. Nobody has the authority to play pick and choose. Nobody is allowed to recognize only certain rights that they agree with and pretending that all others don't exist. It's an all or nothing package deal with no inbetween.\n\n I have not cited \"prostitutes as source material.\" Just another one of your straw man arguments. You lecture someone else about engaging \"in an honest debate\" but I don't see much reason to believe that you practice what you preach. Shut up.", 
   {}, 
   424488, 
   null, 
   1298323320.0
  ], 
  [
   424493, 
   null, 
   "Pietro", 
   "I have not cited \"prostitutes as source material.\" Just another one of your straw man arguments. You lecture someone else about engaging \"in an honest debate\" but I don't see much reason to believe that you practice what you preach. Shut up.\n\n \n That's correct. I was in a hurry and applied your name when I should have listed Brady as the offender who chooses to cite the opinions of prostitutes and criminals to try and prove that gun ownership is something only those who are sexually impotent would practice. Perhaps an apology is in order for that one.", 
   {}, 
   424491, 
   null, 
   1298324880.0
  ], 
  [
   424494, 
   null, 
   "zsu2357", 
   "Come on Pietro go easy on the ninny(Brady)because everyone knows he's never had an original thought,in fact I don't even think he's had a thought period.\n He's really kinda funny actually,he just throws the bait to see who will take it,I \n sorta like him because when I need a few laughs I JUST READ SOME OF HIS STUFF.emoticon_xclown\n P.S. sometimes I like baiting him.", 
   {}, 
   424491, 
   null, 
   1298325420.0
  ], 
  [
   424514, 
   null, 
   "Winston Smith", 
   "is the above an example of 'honest debate' ? emoticon_rolleyes\n \n Brady is right in looking for the cause behind the madness: obsession with owning guns. It is a disease for sure and of the dangerous kind.", 
   {}, 
   424494, 
   null, 
   1298333580.0
  ], 
  [
   424521, 
   null, 
   "Pietro", 
   "Brady is right in looking for the cause behind the madness: obsession with owning guns. It is a disease for sure and of the dangerous kind.\n\n \n Obsession with owning guns is a cause of madness? Exactly how do you arrive at that conclusion? How do you classify it as a disease? Do you extend that derogatory standard to other items within the constitution that people have a desire to take part in?\n \n Perhaps you'd care to slander those that read books? Maybe mock those who insist on having an attorney present during questioning? Offer up a few derogatory remarks regarding those who value privacy against government intrusion? Maybe you have a few words to offer up to those who believe the police should obtain a warrant because carrying out searches and seizures?\n \n It's been said you live in Australia and are subject to their laws. Perhaps you would care to explain the madness of your government for declaring that imitation firearms must be licensed and locked up exactly like their real world functioning counterparts? I'd love to hear somebody actually come out in favor of such a foolish standard.\n \n Australia possesses no true constitution designed to protect the people and restrict the power of government. If your government chooses to do something you have very little legal recourse at your disposal. Perhaps that's why you choose to slander those of us who are fortunate enough to live in America and enjoy true measures of freedom. You're unable to know what it's like to know the government is restricted in its authority over the people and you can't stand that.\n \n Gun ownership is not a symptom of madness. However rampant distrust of your fellow citizens certainly does qualify. If you honestly believe your own neighbors can't be trusted unless they've been forcibly disarmed by government mandate then that doesn't sound like a very healthy way of life.", 
   {}, 
   424514, 
   null, 
   1298338500.0
  ], 
  [
   424523, 
   null, 
   "zsu2357", 
   "=Winston Smith;424514]is the above an example of 'honest debate' ? emoticon_rolleyes\n\n What did he do that was dishonest?make a mistake and apologize?\n \nBrady is right in looking for the cause behind the madness: obsession with owning guns. It is a disease for sure and of the dangerous kind.\n\n So Her Dr. Smith have you diagnosed the madness?and no Sexual Dysfunction \n don't cut it.\n And if we seem obsessed, it is only with our constitutional rights to own guns.To me I would say you and your kind are the dangers here,just because you one's\n across the big water(home grown anti's not included) and under gave up your rights without any qualms about it.\n Don't be expecting us to.Or could it be a disease on your part because you are afraid of government censure so you say what would be expected of you.after all the average German citizen during the Hitler years had the same problem.\n Bait,bait,bait.", 
   {}, 
   424514, 
   null, 
   1298339100.0
  ], 
  [
   424789, 
   null, 
   "Doc Jones", 
   "Hey brady and star gazer:\n \n Has that \"study\" ever been peer reviewed and if so by whom exactly?\n \n I got a feeling this is lie based just like your compatriots Bellesiles, Kellerman and company. You never did link it :) It is a fine admission of your morals and associations though emoticon_xgood", 
   {}, 
   424523, 
   null, 
   1298643360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  New Study Links Guns, Sexual Dysfunction", 
  "url": "http://www.4forums.com/political/gun-control-debates/15014-new-study-links-guns-sexual-dysfunction.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15014, 
  "discussion_files": [
   [
    "2663.html", 
    "http://www.4forums.com/political/gun-control-debates/15014-new-study-links-guns-sexual-dysfunction-print.html"
   ], 
   [
    "2664.html", 
    "http://www.4forums.com/political/gun-control-debates/15014-new-study-links-guns-sexual-dysfunction-4-print.html"
   ], 
   [
    "2665.html", 
    "http://www.4forums.com/political/gun-control-debates/15014-new-study-links-guns-sexual-dysfunction-3-print.html"
   ], 
   [
    "2666.html", 
    "http://www.4forums.com/political/gun-control-debates/15014-new-study-links-guns-sexual-dysfunction-2-print.html"
   ]
  ], 
  "identifier": 15014
 }
]