[
 [
  [
   423985, 
   null, 
   "Matthew S", 
   "The Indiana Republican house members have violated the Indiana state constitution.\n Indiana Code ./const/art1.html-./const/art1.html-./const/art1.html\n Article 1 section 23 says\n \n&#8220;Section 23. The General Assembly shall not grant to any citizen, or class of citizens, privileges or immunities, which, upon the same terms, shall not equally belong to all citizens.\"\n\n \n By granting special privileges to heterosexuals they have violated the constitution.", 
   {
    "post_info": {
     "post_title": "Indiana Republicans violate the state constitution"
    }
   }, 
   null, 
   null, 
   1297630560.0
  ], 
  [
   423986, 
   null, 
   "gansao", 
   "Yawn...........", 
   {}, 
   423985, 
   null, 
   1297632840.0
  ], 
  [
   423989, 
   null, 
   "Sigma", 
   "By granting special privileges to heterosexuals they have violated the constitution.\n\n \n Would the constitution be violated if they granted veterens special privileges?", 
   {}, 
   423985, 
   null, 
   1297639860.0
  ], 
  [
   424002, 
   null, 
   "Matthew S", 
   "Would the constitution be violated if they granted veterens special privileges?\n\n \n Yes if DADT where not in effect.", 
   {}, 
   423989, 
   null, 
   1297647420.0
  ], 
  [
   424004, 
   null, 
   "Sigma", 
   "Yes if DADT where not in effect.\n\n \n Then apparently we need to start suing the gov't for providing benefits to all these veterans in violation of State constitutions. Because obviously you can't provide benefits to any group without providing those same benefits to everyone. Is that the essence of your argument?", 
   {}, 
   424002, 
   null, 
   1297648380.0
  ], 
  [
   424009, 
   null, 
   "Matthew S", 
   "Then apparently we need to start suing the gov't for providing benefits to all these veterans in violation of State constitutions. Because obviously you can't provide benefits to any group without providing those same benefits to everyone. Is that the essence of your argument?\n\n \n The essence is that you the legislature can not create a privileged class, that of heterosexuals, and this is what they are doing in violation of article 1 section 23 of the Indiana state constitution. Now if they were to do away with marriage all together they would not be in violation of the constitution.", 
   {}, 
   424004, 
   null, 
   1297652940.0
  ], 
  [
   424012, 
   null, 
   "Sigma", 
   "The essence is that you the legislature can not create a privileged class, that of heterosexuals, and this is what they are doing in violation of article 1 section 23 of the Indiana state constitution. Now if they were to do away with marriage all together they would not be in violation of the constitution.\n\n \n The underlying assumptions are that only heterosexuals have access to marriage, and that if either State or Federal governments provide benefits to anyone for any reason then they must provide those benefits to everyone.\n \n Both of those assumptions are patently false. As you can see with my example with the veteran benefits, benefits given to a certain group does not automatically mean they're given to everyone in America.", 
   {}, 
   424009, 
   null, 
   1297654020.0
  ], 
  [
   424034, 
   null, 
   "Matthew S", 
   "The underlying assumptions are that only heterosexuals have access to marriage, and that if either State or Federal governments provide benefits to anyone for any reason then they must provide those benefits to everyone.\n \n Both of those assumptions are patently false. As you can see with my example with the veteran benefits, benefits given to a certain group does not automatically mean they're given to everyone in America.\n\n \n The difference is that now everyone can serve in the military. A gay person can not marry another gay person.\n \n The Indiana legislature is prohibited constitutionally, from creating laws that exclude gays from marriage by saying that only heterosexuals may marry.", 
   {}, 
   424012, 
   null, 
   1297681380.0
  ], 
  [
   424119, 
   null, 
   "Sigma", 
   "The difference is that now everyone can serve in the military. A gay person can not marry another gay person.\n\n \n Not everyone can serve in the military. To serve, you have to qualify and not everyone does. There's an age range they they will accept, for instance. The fact that some people are barred from military service does not mean that veteran benefits must be given to everyone.\n \n \nThe Indiana legislature is prohibited constitutionally, from creating laws that exclude gays from marriage by saying that only heterosexuals may marry.\n\n \n As far as I can tell, at no point is your sexual orientation an issue when you try to get married. Both homosexual people and heterosexual people must follow the same rules when choosing a partner, however. If this is the case then they are treated equally.", 
   {}, 
   424034, 
   null, 
   1297802940.0
  ], 
  [
   424230, 
   null, 
   "Matthew S", 
   "Not everyone can serve in the military. To serve, you have to qualify and not everyone does. There's an age range they they will accept, for instance. The fact that some people are barred from military service does not mean that veteran benefits must be given to everyone.\n \n\n Everyone when they turn 18 is allowed to sign up so you have no ground there.\n \n\n As far as I can tell, at no point is your sexual orientation an issue when you try to get married. Both homosexual people and heterosexual people must follow the same rules when choosing a partner, however. If this is the case then they are treated equally.\n\n \n It is an issue heterosexuals can marry one another gay people can not marry one another. Seems very clear cut to me.\n \n Of course you are very happy to have them violate the constitution if it means they subjugate gay people.", 
   {}, 
   424119, 
   null, 
   1297947720.0
  ], 
  [
   424240, 
   null, 
   "Sigma", 
   "Everyone when they turn 18 is allowed to sign up so you have no ground there.\n\n \n Provided they meet the height/weight and medical standards, pass the criminal history and credit history check, aren't too old or too young, have no drug or alcohol problems, aren't a single parent and, of course, are a citizen.\n \n In comparison, anyone can get married once they hit 18. Some earlier. Their partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species. Notice it doesn't matter if you're homosexual or heterosexual.\n \n Both of these things have restrictions and some people do not qualify either for marriage benefits or veteran benefits because they do not meet the qualifications. Neither of these facts are discrimatory and neither of these facts are unconstitutional.\n \n \nIt is an issue heterosexuals can marry one another gay people can not marry one another. Seems very clear cut to me.\n \n Of course you are very happy to have them violate the constitution if it means they subjugate gay people.\n\n \n Homosexuals can of course marry each other if they're of differing genders. I realize that isn't the solution you want, but what you have is not unconsitutional. That doesn't meant you can't seek to change marriage laws to get what you want, it just means you can't say \"oh it's unconstitutional so you have to.\"", 
   {}, 
   424230, 
   null, 
   1297960980.0
  ], 
  [
   424262, 
   null, 
   "Matthew S", 
   "Provided they meet the height/weight and medical standards, pass the criminal history and credit history check, aren't too old or too young, have no drug or alcohol problems, aren't a single parent and, of course, are a citizen.\n \n In comparison, anyone can get married once they hit 18. Some earlier. Their partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species. Notice it doesn't matter if you're homosexual or heterosexual.\n \n Both of these things have restrictions and some people do not qualify either for marriage benefits or veteran benefits because they do not meet the qualifications. Neither of these facts are discrimatory and neither of these facts are unconstitutional.\n \n \n \n Homosexuals can of course marry each other if they're of differing genders. I realize that isn't the solution you want, but what you have is not unconsitutional. That doesn't meant you can't seek to change marriage laws to get what you want, it just means you can't say \"oh it's unconstitutional so you have to.\"\n\n \n A gay man can not marry another gay man. The Indiana republinazis violated the constitution by passing a law that favors one class of people over another..", 
   {}, 
   424240, 
   null, 
   1297988880.0
  ], 
  [
   424263, 
   null, 
   "Sigma", 
   "A gay man can not marry another gay man.\n\n \n True. A straight man cannot marry another straight man, as well. Or a gay man for that matter. That's equal treatment of the law. Straight men cannot do something you cannot do.\n \n \nThe Indiana republinazis violated the constitution by passing a law that favors one class of people over another.\n\n \n For this to be true, heterosexual men must have legal protection that homosexual men do not. Love or attraction is not a protected right. Of course that doesn't mean you can't or shouldn't try to change the law to get what you want, but it does mean there is nothing unconstitutional going on.", 
   {}, 
   424262, 
   null, 
   1297991700.0
  ], 
  [
   424289, 
   null, 
   "Matthew S", 
   "True. A straight man cannot marry another straight man, as well. Or a gay man for that matter. That's equal treatment of the law. Straight men cannot do something you cannot do.\n \n \n \n For this to be true, heterosexual men must have legal protection that homosexual men do not. Love or attraction is not a protected right. Of course that doesn't mean you can't or shouldn't try to change the law to get what you want, but it does mean there is nothing unconstitutional going on.\n\n \n So then you are saying that the 14th amendment, and the 1st amendment mean nothing?", 
   {}, 
   424263, 
   null, 
   1298038440.0
  ], 
  [
   424290, 
   null, 
   "Sigma", 
   "So then you are saying that the 14th amendment, and the 1st amendment mean nothing?\n\n \n I'm saying that neither have anything to do with this issue.", 
   {}, 
   424289, 
   null, 
   1298052120.0
  ], 
  [
   424295, 
   null, 
   "Xcaliber", 
   "For this to be true, heterosexual men must have legal protection that homosexual men do not. Love or attraction is not a protected right. Of course that doesn't mean you can't or shouldn't try to change the law to get what you want, but it does mean there is nothing unconstitutional going on.\n\n \n Heterosexual men do have protection for something that Gay men do not, they have the Right to CHOOSE whom they marry. A heterosexual would not Marry a Person of their own gender to begin with so what you say is completely ignorant. Homosexuals are being denied basic freedoms that others are not being denied. Technically the Gay Marriage movement is not about just being able to marry whom you love.. it's about the benefits of marriage that straight couples are awarded that gay couples are not. If your Wife was in the Hospital and they only allowed immediate family to see her YOU would be able to go in and see her. If a Gay man is in the Hospital His partner does not have that same right. If your wife dies in most cases you would inherit her money, or her belongings , you would have the right to bury her where you want.. Gay couples do not have those rights. If two men live together for 15 years as Gay partners they do not have the same right You do being married to a woman for the same period of time.\n \n It's unconstitutional to deny anyone of rights awarded to others.", 
   {}, 
   424263, 
   null, 
   1298059800.0
  ], 
  [
   424301, 
   null, 
   "Sigma", 
   "Heterosexual men do have protection for something that Gay men do not, they have the Right to CHOOSE whom they marry.\n\n \n Within certain restrictions, both homosexual and heterosexual men can choose whom they marry. Neither has more options than the other. I don't think you can support the claim that homosexual men cannot choose whom to marry.\n \n \nA heterosexual would not Marry a Person of their own gender\n\n \n It doesn't matter if a heterosexual would want to or not: no one can marry a person of the same gender. \n \n \n it's about the benefits of marriage that straight couples are awarded that gay couples are not.\n [...]\n It's unconstitutional to deny anyone of rights awarded to others.\n\n \n There are benefits awarded to veterans that are not available to anyone else. This is not unconstitutional. It is not unconstitutional to provide legal benefits to a group of people that qualifies for those benefits.\n \n If a homosexual man wishes to have legal benefits associated with marriage, he must qualify for them. That means he must follow the rules when selecting a marriage partner. If the rules for qualification were different for a homosexual man than they were for a heterosexual man, then that could be unconstitutional. That is not currently the case, because the rules are the same regardless of your sexuality.", 
   {}, 
   424295, 
   null, 
   1298067060.0
  ], 
  [
   424303, 
   null, 
   "Xcaliber", 
   "Within certain restrictions, both homosexual and heterosexual men can choose whom they marry. Neither has more options than the other. I don't think you can support the claim that homosexual men cannot choose whom to marry.\n\n \n There is no restriction for a straight male. He Has the Choice to Marry any Woman he Chooses as long as She also Chooses to marry him. A Gay man who has been with the same Partner for 10 years DOES NOT have the choice to marry his partner. Marriage Laws are not the same for everyone\n \n \n\n It doesn't matter if a heterosexual would want to or not: no one can marry a person of the same gender. \n\n \n That depends on what state they live in. Currently 7 states do allow Gay marriage and Hawaii just passed a law allowing Civil Unions, which is one step away from legal Marriage. If a straight man wanted to marry a woman he can under the current Law. If that same man decide one day he wanted to marry a Man he couldn't under the Law, he would be denied his CHOICE.. in the same way that Gays are being denied their's now.\n \n \n\n There are benefits awarded to veterans that are not available to anyone else. This is not unconstitutional. It is not unconstitutional to provide legal benefits to a group of people that qualifies for those benefits.\n\n \n That has to be the most ignorant argument I have ever heard. Veterans earn their Benefits by serving their country, but not all Veterans qualify for the same benefits. Veterans Benefits aren't the same as Marriage . \n \n \n\n If a homosexual man wishes to have legal benefits associated with marriage, he must qualify for them. That means he must follow the rules when selecting a marriage partner. If the rules for qualification were different for a homosexual man than they were for a heterosexual man, then that could be unconstitutional. That is not currently the case, because the rules are the same regardless of your sexuality.\n\n \n No the Rules need to be fair to everyone and not just one group . Marriage Laws have been changed many times over the years and can be changed to award Gays the same basic rights to marry as are given to straight people. The Rules ARE different, you are trying to make someone believe that they aren't. Some states allow Gay marriage. Other countries allow gay marriage. Here in the U.S. it's the Religious fanatics who are standing in the way of Gay people and their rights. But Have no fear, people are changing, and it won't be long before this will all be like the fight for civil rights. Just another stain on American History.", 
   {}, 
   424301, 
   null, 
   1298068500.0
  ], 
  [
   424305, 
   null, 
   "Stonewall", 
   "Within certain restrictions, both homosexual and heterosexual men can choose whom they marry. Neither has more options than the other. I don't think you can support the claim that homosexual men cannot choose whom to marry.\n \n \n \n It doesn't matter if a heterosexual would want to or not: no one can marry a person of the same gender. \n \n \n \n There are benefits awarded to veterans that are not available to anyone else. This is not unconstitutional. It is not unconstitutional to provide legal benefits to a group of people that qualifies for those benefits.\n \n If a homosexual man wishes to have legal benefits associated with marriage, he must qualify for them. That means he must follow the rules when selecting a marriage partner. If the rules for qualification were different for a homosexual man than they were for a heterosexual man, then that could be unconstitutional. That is not currently the case, because the rules are the same regardless of your sexuality.\n\n \n The whole point is that gay people want to be able to get the same benefits by marrying the person they love (or are at least attracted to), the same way as straight couples do. \n \n I understand your analogy, but veterans get those benefits because of their line of work. That's kind of like complaining about a construction site manager getting a company truck but you not getting one because you work at McDonald's. It isn't really a fair analogy. \n \n I don't know for certain if it is unconstitutional or not, but it sure isn't fair to the homosexuals, and comes off as very biased against gay people.", 
   {}, 
   424301, 
   null, 
   1298069340.0
  ], 
  [
   424309, 
   null, 
   "Sigma", 
   "There is no restriction for a straight male. He Has the Choice to Marry any Woman he Chooses as long as She also Chooses to marry him. A Gay man who has been with the same Partner for 10 years DOES NOT have the choice to marry his partner. Marriage Laws are not the same for everyone\n\n \n Of course there are restrictions, and these restrictions apply to everyone. A person's partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species. \n \n \nThat depends on what state they live in. Currently 7 states do allow Gay marriage and Hawaii just passed a law allowing Civil Unions, which is one step away from legal Marriage. If a straight man wanted to marry a woman he can under the current Law. If that same man decide one day he wanted to marry a Man he couldn't under the Law, he would be denied his CHOICE.. in the same way that Gays are being denied their's now.\n\n \n Yes, I was speaking generally. There are of course some places where homosexual marriage is allowed. Yes, some choices are not allowed... those are the rules. As long as both a heterosexual man and a homosexual man have the same choices open to them, though, both have the same rights protected.\n \n \nThat has to be the most ignorant argument I have ever heard. Veterans earn their Benefits by serving their country, but not all Veterans qualify for the same benefits. Veterans Benefits aren't the same as Marriage\n\n \n Veteran benefits are similar to marriage benefits in that they are benefits given to certain people and not other people. It is not unconstitutional to give benefits to certain people and not other people. Therefore it is not unconstitutional to give marriage benefits to some people and not others.\n \n \nNo the Rules need to be fair to everyone and not just one group\n\n \n The rules just need to equally apply to homosexuals and heterosexuals. That is equal protection of rights. \n \n \nMarriage Laws have been changed many times over the years and can be changed to award Gays the same basic rights to marry as are given to straight people. The Rules ARE different, you are trying to make someone believe that they aren't. Some states allow Gay marriage. Other countries allow gay marriage. Here in the U.S. it's the Religious fanatics who are standing in the way of Gay people and their rights. But Have no fear, people are changing, and it won't be long before this will all be like the fight for civil rights. Just another stain on American History.\n\n \n Of course you can change marriage to include homosexual people. I have not denied this. I am making the case that it is not unconstitutional the way it is. You can still change laws even if they are constitutionally sound. You can fight for whatever you please, you just have to get a majority of people to agree with you in order to change the law because you are not denied any rights.", 
   {}, 
   424303, 
   null, 
   1298072340.0
  ], 
  [
   424310, 
   null, 
   "Sigma", 
   "The whole point is that gay people want to be able to get the same benefits by marrying the person they love (or are at least attracted to), the same way as straight couples do.\n\n \n Of course. You missed the thrust of my argument though. Loving whom you are married to or marrying whom you love is not a protected right. Therefore it is not the obligation of the government to make this happen. If a homosexual man and a heterosexual man have the same options in partners open to them, then the government's responsibility ends. \n \n Only by changing the laws can people marry the same gender. Current laws are not unconstitutional, therefore current laws prohibit marrying the same gender.\n \n \nI understand your analogy, but veterans get those benefits because of their line of work. That's kind of like complaining about a construction site manager getting a company truck but you not getting one because you work at McDonald's. It isn't really a fair analogy.\n\n \n That's the point of the analogy. It would be dumb to believe that everyone deserves the benefits of being a manager. No, further... that everyone has a right to a company truck because someone, somewhere, gets one. It is dumb to think that because one doesn't get marriage benefits that there must be something unfair happening. Of course you have to qualify to get veteran benefits (namely, be in the military), and of course you have to qualify to get marriage benefits (namely, choose a spouse that fits the requirement).\n \n \nI don't know for certain if it is unconstitutional or not, but it sure isn't fair to the homosexuals, and comes off as very biased against gay people.\n\n \n So we should declare it unconstitutional because we don't want to hurt anyone's feelings? No... the argument that everyone, gay or straight, married or single, have a right to marriage benefits should be dismissed on the face of it. It's a ridiculous claim to make.", 
   {}, 
   424305, 
   null, 
   1298072940.0
  ], 
  [
   424313, 
   null, 
   "Xcaliber", 
   " Of course you can change marriage to include homosexual people. I have not denied this. I am making the case that it is not unconstitutional the way it is. You can still change laws even if they are constitutionally sound. You can fight for whatever you please, you just have to get a majority of people to agree with you in order to change the law because you are not denied any rights.\n\n \n But this is where you are wrong. It is unconstitutional to deny a specific group of a right that is awarded to another group. In the same way that it is unconstitutional for them to tell you you cannot practice the Muslim faith it is unconstitutional for them to deny Gay people the same rights awarded to straight people. You are denying their right to Legally Binding Marriage with the Person whom they choose to marry. Your argument that the same rules apply holds no water because it's simply not true. The U.S. Constitution had nothing pertaining to Marriage Laws until they passed the Defense of Marriage Act in 1996. California Supreme court over turned a Law in California barring same sex Marriage, then turned around and voted for a new amendment to their constitution . Marriage Laws are for the most part left up to the states to decide, the Federal Government since they passed DOMA no longer recognize Same sex Marriages, so yes, they are denying Gay's of the rights that straights are awarded. That is unconstitutional, and like I said before one day it will reach the supreme court and once they make their decision all this will be laid to rest.", 
   {}, 
   424309, 
   null, 
   1298080020.0
  ], 
  [
   424316, 
   null, 
   "Matthew S", 
   "Of course. You missed the thrust of my argument though. Loving whom you are married to or marrying whom you love is not a protected right. Therefore it is not the obligation of the government to make this happen. If a homosexual man and a heterosexual man have the same options in partners open to them, then the government's responsibility ends. \n \n Only by changing the laws can people marry the same gender. Current laws are not unconstitutional, therefore current laws prohibit marrying the same gender.\n \n \n \n That's the point of the analogy. It would be dumb to believe that everyone deserves the benefits of being a manager. No, further... that everyone has a right to a company truck because someone, somewhere, gets one. It is dumb to think that because one doesn't get marriage benefits that there must be something unfair happening. Of course you have to qualify to get veteran benefits (namely, be in the military), and of course you have to qualify to get marriage benefits (namely, choose a spouse that fits the requirement).\n \n \n \n So we should declare it unconstitutional because we don't want to hurt anyone's feelings? No... the argument that everyone, gay or straight, married or single, have a right to marriage benefits should be dismissed on the face of it. It's a ridiculous claim to make.\n\n \n So then if I understand your point, the Indiana legislature could pass a law that says \"Marriage is only between people of the same eye color\" With the effect being that a brown eyed person and a blue eyed person could not marry each other. After all if I understand your arguement correctly both brown eyed and blue eyed people are not being denied marriage they just have to marry some one of the same eye color. \n \n What about religion? If you are correct then it would be constitutional for the Indiana legislature to pass a law that says marriage is only between people of the same religion or that your have to be a member of a religion to get married (no atheists). After all people of different faiths would not be denied marriage they just have to choose someone of the same faith.", 
   {}, 
   424310, 
   null, 
   1298085360.0
  ], 
  [
   424317, 
   null, 
   "Matthew S", 
   "I'm saying that neither have anything to do with this issue.\n\n \n Oh yes they do I am being denied my rights under the 14th amendment by the state of Michigan currently with the state of Michigan refusing to acknowledge my Iowa marriage licence, while acknowledging other Iowa marriage licenses.", 
   {}, 
   424290, 
   null, 
   1298085780.0
  ], 
  [
   424319, 
   null, 
   "Sigma", 
   "But this is where you are wrong. It is unconstitutional to deny a specific group of a right that is awarded to another group.\n\n \n That is true, if we were talking about something you have a right that isn't being protected. But we're not, because there is no right to marry someone of the same gender. There is no right to marry someone you love, and there is no right to love whom you marry. \n \n Instead, we're talking about marriage benefits, which is not something we have a right to. Otherwise, single people could sue because they are being denied them (single people have the same option homosexual people do; marry someone then!).\n \n \nYour argument that the same rules apply holds no water because it's simply not true.\n\n \n Truly? What rule, then, applies to homosexuals that does not also apply to heterosexuals?", 
   {}, 
   424313, 
   null, 
   1298088660.0
  ], 
  [
   424320, 
   null, 
   "Sigma", 
   "So then if I understand your point, the Indiana legislature could pass a law that says \"Marriage is only between people of the same eye color\" With the effect being that a brown eyed person and a blue eyed person could not marry each other. After all if I understand your arguement correctly both brown eyed and blue eyed people are not being denied marriage they just have to marry some one of the same eye color.\n\n \n Well, then, a blue-eyed man could marry someone that a brown-eyed man could not. Therefore, our brown-eyed man would not have the same choices that the blue-eyed man would have and that would be unequal. In our case, a homosexual man and a heterosexual man have the same choice of partner. There are no limits on one that are not on the other.\n \n To be plain: homosexuals only complaint is that they don't want to marry someone of the opposite gender, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n \nOh yes they do I am being denied my rights under the 14th amendment by the state of Michigan currently with the state of Michigan refusing to acknowledge my Iowa marriage licence, while acknowledging other Iowa marriage licenses. \n\n \n As you've been told before, States do have the power to do this. They can deny the validity of licenses issued in other States. State issued nursing licenses, for example, don't have to be honored by other States.", 
   {}, 
   424316, 
   null, 
   1298089020.0
  ], 
  [
   424327, 
   null, 
   "Matthew S", 
   "Well, then, a blue-eyed man could marry someone that a brown-eyed man could not. Therefore, our brown-eyed man would not have the same choices that the blue-eyed man would have and that would be unequal. In our case, a homosexual man and a heterosexual man have the same choice of partner. There are no limits on one that are not on the other.\n \n To be plain: homosexuals only complaint is that they don't want to marry someone of the opposite gender, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n \n \n As you've been told before, States do have the power to do this. They can deny the validity of licenses issued in other States. State issued nursing licenses, for example, don't have to be honored by other States.\n\n \n Cool then I favor check points on all Michigan border roads that make out of staters stop, pay a fee and force them to acquire, a new birth certificate, drivers license, and any and all out of state legal documents.", 
   {}, 
   424320, 
   null, 
   1298098560.0
  ], 
  [
   424328, 
   null, 
   "Matthew S", 
   "Well, then, a blue-eyed man could marry someone that a brown-eyed man could not. Therefore, our brown-eyed man would not have the same choices that the blue-eyed man would have and that would be unequal. In our case, a homosexual man and a heterosexual man have the same choice of partner. There are no limits on one that are not on the other.\n \n To be plain: homosexuals only complaint is that they don't want to marry someone of the opposite gender, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n \n \n .\n\n \n To be plain: blue eyed peoples only complaint is that they don't want to marry someone of the same eye color, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n To be plain: Black peoples only complaint is that they don't want to marry someone of the same race, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n To be plain: jewish peoples only complaint is that they don't want to marry someone of the same religion, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n To be plain: left handed peoples only complaint is that they don't want to marry someone of the same handedness, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n To be plain: Athiests only complaint is that they don't want to marry someone of the a religious persation, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n \n Where does it end..............................................", 
   {}, 
   424320, 
   null, 
   1298099160.0
  ], 
  [
   424329, 
   null, 
   "Sigma", 
   "Cool then I favor check points on all Michigan border roads that make out of staters stop, pay a fee and force them to acquire, a new birth certificate, drivers license, and any and all out of state legal documents.\n\n \n If I remember right, the south during the Civil War did something like that since they were all about emphasizing State's Rights. Made things very inefficient. However, interstate hwys are under Federal jurisdiction so I don't believe your plan can be put into motion. You're free to try, though.\n \n \nTo be plain: blue eyed peoples only complaint is that they don't want to marry someone of the same eye color, not that they don't have the opportunity to. But it doesn't really matter whether you want to, it matters that you have the opportunity to since the government's obligation is to make sure you have equal opportunities, not necessarily that your wants are satisfied.\n\n \n You didn't understand your own example. It doesn't matter if blue-eyed people are or are not complaining. The government has the responsibility to allow both blue-eyed men and brown-eyed men the same options whether they want those options or not. Under your example, blue-eyed men and brown-eyed men do not have the same options. Homosexual men and heterosexual men do have the same options.", 
   {}, 
   424327, 
   null, 
   1298099400.0
  ], 
  [
   424332, 
   null, 
   "Stonewall", 
   "Well, then, a blue-eyed man could marry someone that a brown-eyed man could not. Therefore, our brown-eyed man would not have the same choices that the blue-eyed man would have and that would be unequal. In our case, a homosexual man and a heterosexual man have the same choice of partner. There are no limits on one that are not on the other.\n\n \n \nThe government has the responsibility to allow both blue-eyed men and brown-eyed men the same options whether they want those options or not. \n\n \n But men and women don't. \n \n A man can marry someone that a woman can't. Therefore a woman doesn't have the same choices that a man does (and vice versa). Why should a man be able to marry a woman, but a woman be denied that same opportunity?\n \n The government has the responsibility to allow both men and women the same options whether they want those options or not.", 
   {}, 
   424320, 
   null, 
   1298109960.0
  ], 
  [
   424334, 
   null, 
   "Sigma", 
   "But men and women don't. \n\n \n Yes, that's true. That makes it a gender rights issue and not a gay rights issue. To make that point, however, you have to accept that homosexuals and heterosexuals have equal rights.\n \n Matthew S insists that this issue is a difference of rights between heterosexuals and homosexuals when it really is not.", 
   {}, 
   424332, 
   null, 
   1298117340.0
  ], 
  [
   424335, 
   null, 
   "Matthew S", 
   "If I remember right, the south during the Civil War did something like that since they were all about emphasizing State's Rights. Made things very inefficient. However, interstate hwys are under Federal jurisdiction so I don't believe your plan can be put into motion. You're free to try, though.\n\n \n The state of Michigan and many other states do something similar currently, they are called truck weigh stations. So it is only a small step to make all out of state drivers get off the roads at check points to get their legal papers in order.\n \n \n\n You didn't understand your own example. It doesn't matter if blue-eyed people are or are not complaining. The government has the responsibility to allow both blue-eyed men and brown-eyed men the same options whether they want those options or not. Under your example, blue-eyed men and brown-eyed men do not have the same options. Homosexual men and heterosexual men do have the same options.\n\n \n Oh I understand it quite well. You are the one who does not understand equality, or justice. It is unjust to allow heterosexuals to marry the person they love, yet gay people do get the same option.", 
   {}, 
   424329, 
   null, 
   1298130480.0
  ], 
  [
   424336, 
   null, 
   "Sigma", 
   "The state of Michigan and many other states do something similar currently, they are called truck weigh stations. So it is only a small step to make all out of state drivers get off the roads at check points to get their legal papers in order.\n\n \n Well, it wouldn't be the same thing since commercial licenses are Federally regulated and commercial vehicles on interstate hwys have to conform to Federal standards even if weigh stations are used for State purposes as well. Stopping non-commercial vehicles is a different animal. Perhaps technically possible, but I wouldn't bet on it. In order to enact a plan of that magnitude the State must enact laws allowing the stopping of any and all drivers on the suspicion they are out-of-state drivers. That kind of draconian law would quickly be challenged, I wager.\n \n It is also practically unfeasible. If stopped the minute they entire the State, there is no practical way to \"get their legal papers in order\" with the individual State government unless that service was offered where they are stopped. Administering a driving test to everyone who enters a State would require resources in manpower that would be staggering. Also given that the age requirements for a license may vary from State to State it means it is vastly simpler to simply honor other State's licenses when the person in question is a visitor to the State.\n \n \nOh I understand it quite well. You are the one who does not understand equality, or justice. It is unjust to allow heterosexuals to marry the person they love, yet gay people do get the same option.\n\n \n Marrying whom you love is not a right, so what exactly is unequal?", 
   {}, 
   424335, 
   null, 
   1298132160.0
  ], 
  [
   424337, 
   null, 
   "Matthew S", 
   "Well, it wouldn't be the same thing since commercial licenses are Federally regulated and commercial vehicles on interstate hwys have to conform to Federal standards even if weigh stations are used for State purposes as well. Stopping non-commercial vehicles is a different animal. Perhaps technically possible, but I wouldn't bet on it. In order to enact a plan of that magnitude the State must enact laws allowing the stopping of any and all drivers on the suspicion they are out-of-state drivers. That kind of draconian law would quickly be challenged, I wager.\n \n\n \n What and allow activist judges to challenge the will of the people of the state of Michigan?\n \n \n\n It is also practically unfeasible. If stopped the minute they entire the State, there is no practical way to \"get their legal papers in order\" with the individual State government unless that service was offered where they are stopped. Administering a driving test to everyone who enters a State would require resources in manpower that would be staggering. Also given that the age requirements for a license may vary from State to State it means it is vastly simpler to simply honor other State's licenses when the person in question is a visiter to the State.\n\n \n It can be done, all people with a out of state license plate needs to pull over to the station, and get a new plate, and drivers license. Their birth certificates, their marriages, wills, adoptions, powers of attorney ect will no be in effect. The fees for such changes would fund the offices, the fines of those who refuse to stop would be a welcome source of revenue for the state of Michigan.\n \n \n\n Marrying whom you love is not a right, so what exactly is unequal?\n\n \n That a heterosexual gets to marry the person they love and gay people do not.", 
   {}, 
   424336, 
   null, 
   1298133000.0
  ], 
  [
   424341, 
   null, 
   "Sigma", 
   "What and allow activist judges to challenge the will of the people of the state of Michigan?\n\n \n While police matters are generally a State matter, that does not mean there are no other concerns. The Due Process Clause, for example, has a procedural component: the State must use clear and fair procedures in the pursuit of law enforcement. However, the Due Process Clause also has a substantive portion, meaning legislation must fill a valid State interest. With no reasonable length of time to fulfill the requirement of the State, the legislation you propose would violate both of these components.\n \n Further, your proposal can reasonably be construed to interfere with interstate commerce, which allows the Federal gov't to remove those barriers to entry.\n \n \nIt can be done, all people with a out of state license plate needs to pull over to the station, and get a new plate, and drivers license. Their birth certificates, their marriages, wills, adoptions, powers of attorney ect will no be in effect. The fees for such changes would fund the offices, the fines of those who refuse to stop would be a welcome source of revenue for the state of Michigan.\n\n \n Driver's licenses and plates require a residency within the State, so that likely could not be practically workable. Good luck with your plan, but I doubt you'll get anywhere with it.\n \n \nThat a heterosexual gets to marry the person they love and gay people do not.\n\n \n Marrying whom you love is not a right that heterosexual people have. Homosexual people also do not have the right to marry whom they love. Where is the inequality?", 
   {}, 
   424337, 
   null, 
   1298138100.0
  ], 
  [
   424343, 
   null, 
   "Matthew S", 
   "While police matters are generally a State matter, that does not mean there are no other concerns. The Due Process Clause, for example, has a procedural component: the State must use clear and fair procedures in the pursuit of law enforcement. However, the Due Process Clause also has a substantive portion, meaning legislation must fill a valid State interest. With no reasonable length of time to fulfill the requirement of the State, the legislation you propose would violate both of these components.\n \n Further, your proposal can reasonably be construed to interfere with interstate commerce, which allows the Federal gov't to remove those barriers to entry.\n \n \n \n Driver's licenses and plates require a residency within the State, so that likely could not be practically workable. Good luck with your plan, but I doubt you'll get anywhere with it.\n \n \n \n Marrying whom you love is not a right that heterosexual people have. Homosexual people also do not have the right to marry whom they love. Where is the inequality?\n\n \n Heterosexuals can marry the person they love gay people can not. This is unequal because heterosexual can marry the person they love and gay people can not. Further more by limiting marriage to heterosexuals they are creating a protected class and excluding another class, which is a violation of the Indiana constitution.", 
   {}, 
   424341, 
   null, 
   1298139960.0
  ], 
  [
   424344, 
   null, 
   "Sigma", 
   "Heterosexuals can marry the person they love gay people can not. This is unequal because heterosexual can marry the person they love and gay people can not.\n\n \n Since there is no right to marry the person you love, it is not the government's responsibility to make sure you can marry whom you love.\n \n \nFurther more by limiting marriage to heterosexuals they are creating a protected class and excluding another class, which is a violation of the Indiana constitution.\n\n \n Nobody is excluded from marriage, provided you choose a partner that qualifies. There is nothing unconstitutional about having requirements to gain a benefit, provided those requirements apply equally between homosexuals and heterosexuals.", 
   {}, 
   424343, 
   null, 
   1298140500.0
  ], 
  [
   424345, 
   null, 
   "Matthew S", 
   "Since there is no right to marry the person you love, it is not the government's responsibility to make sure you can marry whom you love.\n \n \n \n Nobody is excluded from marriage, provided you choose a partner that qualifies. There is nothing unconstitutional about having requirements to gain a benefit, provided those requirements apply equally between homosexuals and heterosexuals.\n\n \n You miss the point the requirements can not apply equally to gay people by the very nature of gay people. I bring this back to blue eyed vs brown eyed marriage. Marriage would be available to both blue eyed and brown eyed people as long as a bye eyed person married a blue eyed person. Same here marriage is only available to a gay man if he married a hetero woman. A gay man can not marry a gay man.", 
   {}, 
   424344, 
   null, 
   1298143440.0
  ], 
  [
   424346, 
   null, 
   "Xcaliber", 
   "Since there is no right to marry the person you love, it is not the government's responsibility to make sure you can marry whom you love.\n\n \n It is also not the government's responsibility to tell you you can't marry the person whom you choose, yet the government got involved when they defined marriage. They are awarding straight people the right to marry the person whom they choose to marry, but gay people are not awarded that same right.. it's unconstitutional.\n \n \n\n Nobody is excluded from marriage, provided you choose a partner that qualifies. There is nothing unconstitutional about having requirements to gain a benefit, provided those requirements apply equally between homosexuals and heterosexuals.\n\n \n \n Yes, Gays are excluded from marriage, you know a gay person will not choose to marry a person of the opposite sex. You are saying that they must change who they are in order to qualify for the same benefit that a straight person is already qualified for. that is a difference in how gays are being treated vs. straights and is unconstitutional.", 
   {}, 
   424344, 
   null, 
   1298143440.0
  ], 
  [
   424347, 
   null, 
   "Sigma", 
   "You miss the point the requirements can not apply equally to gay people by the very nature of gay people. I bring this back to blue eyed vs brown eyed marriage. Marriage would be available to both blue eyed and brown eyed people as long as a bye eyed person married a blue eyed person. Same here marriage is only available to a gay man if he married a hetero woman. A gay man can not marry a gay man.\n\n \n I do not deny that marriage is only available to a homosexual man if he marries a woman (whether she is heterosexual or homosexual is irrelevent). The same is true of a heterosexual man. Whether the man is blue-eyed or brown-eyed, they both can marry the same targets (not at the same time, obviously, since that would be illegal).", 
   {}, 
   424345, 
   null, 
   1298144520.0
  ], 
  [
   424348, 
   null, 
   "Xcaliber", 
   "Nobody is excluded from marriage, provided you choose a partner that qualifies. There is nothing unconstitutional about having requirements to gain a benefit, provided those requirements apply equally between homosexuals and heterosexuals.\n\n \n An interpretation of the U.S. Constitution on same-sex marriage\n \n An interesting article, pretty much blows holes in your argument.\n \n \n\n The legality of same-sex marriage has come under scrutiny. It is good to examine seemingly new philosophies and perspectives; how else can we determine the rightness of something? But what hasn't been considered is the legality of denying same-sex marriage.\n \n Article Four of the Federal Constitution states:\n \n \"Full Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State. And the Congress may by general Laws prescribe the Manner in which such Acts, Records and Proceedings shall be proved, and the Effect thereof.\n \n Clause 1: The Citizens of each State shall be entitled to all Privileges and Immunities of Citizens in the several States.\"\n \n In other words, no State has the right to ignore civil agreements reached in other States. So if a same-sex couple in Massachusetts gets married after 2004-May 16th, no State has the right to ignore that marriage. In fact, all States are required to recognize that marriage, because it is a Civil matter. What this essentially means is that State Defense of Marriage Acts (DOMAs) are unconstitutional, plain and simple.\n \n What about the Federal DOMA? Sorry, that, too, will be struck down soon, as it also is unconstitutional by virtue of the Tenth Amendment, which states:\n \n \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the states, are reserved to the states respectively, or to the people.\"\n \n Because the Constitution does not explicitly give the Federal Government jurisdiction over marriage, the right to regulate marriage is, by default, given solely to the States to decide. Therefore, Congress had neither right nor power to pass DOMA in the first place.\n \n The solution, some may argue, is to amend the Federal Constitution, which is what George W. Bush endorses. There is one problem with that: Article Six reads:\n \n \"This Constitution, and the laws of the United States which shall be made in pursuance thereof; and all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land; and the judges in every state shall be bound thereby, anything in the Constitution or laws of any State to the contrary notwithstanding.\"\n \n Boiled down, this means that the Constitution is barred from contradicting itself. Thus, a Federal Marriage Amendment that would deprive a singled-out populace of any rights runs in clear contradiction to Article Four and Amendment Nine of the Constitution. Amendment Nine states:\n \n \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\"\n \n The Constitution says in Amendment Fourteen:\n \n \"Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n \n What this basically means is that the States do not have a right to pick and choose the people to whom it will grant rights and privileges. If one group of people is allowed to marry, all groups are allowed to marry. If same-sex couples are barred from marriage, it is an abridgment of the privileges they are entitled to as citizens of the United States; it would be a deprivation of liberty and prosperity, and would strip same-sex couples of equal protection of the laws. Plainly, it is discriminatory, and the Fourteenth Article clearly states that selective granting of privileges is not allowed in the United States.\n \n Some may say, \"Gays have the right to marry just as everyone else-a right to marry someone of the opposite gender.\" Similar arguments were made in the days of miscegenation in the 1950's and 1960's: \"Blacks have the right to marry just as whites do-the right to marry someone of their own race.\" Such a stance is clearly a form of hypocrisy and oppression, and has no place in the America our forebears envisioned, and contradicts the very basis of the repeal of the miscegenation laws. Albeit slowly, Americans have striven over the years since Brown vs. the Board of Education to uphold that ruling socially; separate but equal is not equal. In our societal efforts to make this ruling a social and legal reality, we have made tremendous strides to end all forms of discrimination, finally recognizing our fellow man and woman's rights as unalienable regardless of creed, religion, race, gender, and even sexual orientation.\n \n Regardless how one attempts to argue in favor of banning same-sex marriage, our Constitution is clear that doing so is illegal, even to the point of disallowing our own Congress to revise the Constitution so that it might contradict itself.\n", 
   {
    "unicode_changes_made": true
   }, 
   424344, 
   null, 
   1298144760.0
  ], 
  [
   424349, 
   null, 
   "Sigma", 
   "It is also not the government's responsibility to tell you you can't marry the person whom you choose, yet the government got involved when they defined marriage. They are awarding straight people the right to marry the person whom they choose to marry, but gay people are not awarded that same right.. it's unconstitutional.\n\n \n It is the government's responsibility to tell us whom we cannot marry. We have allowed them that power for quite some time. A person's partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species.\n \n No one is allowed to marry whomever they choose. There are restrictions.\n \n \nYes, Gays are excluded from marriage, you know a gay person will not choose to marry a person of the opposite sex. You are saying that they must change who they are in order to qualify for the same benefit that a straight person is already qualified for. that is a difference in how gays are being treated vs. straights and is unconstitutional.\n\n \n No, heterosexuals are not \"already qualified for\" marriage benefits. A heterosexual must do the very same thing that a homosexual must do to get those benefits. Homosexuals are unwilling to do that, not unable. That is not the government's responsibility.\n \n No one is asking homosexuals to \"change who they are\". Homosexuals simply have to follow the rules. If homosexuals do not like the rules, they can change the rules. The rules are not illegal.", 
   {}, 
   424346, 
   null, 
   1298145000.0
  ], 
  [
   424350, 
   null, 
   "Sigma", 
   "An interpretation of the U.S. Constitution on same-sex marriage\n \n An interesting article, pretty much blows holes in your argument.\n\n \n The article was not thought through very clearly. Take your bolded section comparing homosexual marriage to marrage between races.\n \n You have a black man and a homosexual man. The homosexual man can marry any woman over the age of consent, isn't closely related or already married. The black man can marry any woman over the age of consent, isn't closely related or already married and is black. The restrictions are unequal because the restrictions are substantively different.\n \n In our case, there is no difference in requirements between homosexual men and heterosexual men. Obviously my argument still stands.", 
   {}, 
   424348, 
   null, 
   1298145240.0
  ], 
  [
   424351, 
   null, 
   "Xcaliber", 
   "\n In our case, there is no difference in requirements between homosexual men and heterosexual men. Obviously my argument still stands.\n\n \n I see you didn't bother to read the entire article where it fully explains why it is unconstitutional to deny Gay people of the right to marry. \n \n and no, your argument is one of hypocrisy and ignorance. Your argument don't hold water.", 
   {}, 
   424350, 
   null, 
   1298146860.0
  ], 
  [
   424352, 
   null, 
   "Matthew S", 
   "It is the government's responsibility to tell us whom we cannot marry. We have allowed them that power for quite some time. A person's partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species.\n \n No one is allowed to marry whomever they choose. There are restrictions.\n \n \n \n No, heterosexuals are not \"already qualified for\" marriage benefits. A heterosexual must do the very same thing that a homosexual must do to get those benefits. Homosexuals are unwilling to do that, not unable. That is not the government's responsibility.\n \n No one is asking homosexuals to \"change who they are\". Homosexuals simply have to follow the rules. If homosexuals do not like the rules, they can change the rules. The rules are not illegal.\n\n \n No, blue eye and brown eyed people are not \"already qualified for\" marriage benefits. A brown eyed person must do the very same thing that a blue eyed person must do to get those benefits. Blue eyed people are unwilling to do that, not unable. That is not the government's responsibility.\n \n No one is asking blue eyed people to \"change who they are\". blue eyed people simply have to follow the rules. If blue eyed people do not like the rules, they can change the rules. The rules are not illegal", 
   {}, 
   424349, 
   null, 
   1298147580.0
  ], 
  [
   424356, 
   null, 
   "Sigma", 
   "I see you didn't bother to read the entire article where it fully explains why it is unconstitutional to deny Gay people of the right to marry. \n\n \n The rest of the article appears to regale us with tales of how Congress cannot ban homosexual marriage. Since this thread here is about State laws, the rest of the article does not appear relevant. Please point out the portion I missed if I am incorrect.\n \n \nand no, your argument is one of hypocrisy and ignorance. Your argument don't hold water\n\n \n Maybe it holds vinegar then? ;)", 
   {}, 
   424351, 
   null, 
   1298152620.0
  ], 
  [
   424357, 
   null, 
   "Sigma", 
   "No, blue eye and brown eyed people are not \"already qualified for\" marriage benefits. A brown eyed person must do the very same thing that a blue eyed person must do to get those benefits. Blue eyed people are unwilling to do that, not unable. That is not the government's responsibility.\n\n \n If blue-eyed people are unwilling to marry, that's not the government's responsibility. That is correct in this analogy. The government cannot force them to. So where is the inequality?", 
   {}, 
   424352, 
   null, 
   1298152800.0
  ], 
  [
   424360, 
   null, 
   "Matthew S", 
   "If blue-eyed people are unwilling to marry, that's not the government's responsibility. That is correct in this analogy. The government cannot force them to. So where is the inequality?\n\n \n So then you agree with the Indiana republinazis that the state of Indiana has the right exclude the class of blue eyed people from marriage.", 
   {}, 
   424357, 
   null, 
   1298155620.0
  ], 
  [
   424362, 
   null, 
   "Sigma", 
   "So then you agree with the Indiana republinazis that the state of Indiana has the right exclude the class of blue eyed people from marriage.\n\n \n No, I agree that if blue-eyed people don't want to get married then it is not the government's problem. There is no inequality.", 
   {}, 
   424360, 
   null, 
   1298158740.0
  ], 
  [
   424364, 
   null, 
   "gansao", 
   "So then you agree with the Indiana republinazis that the state of Indiana has the right exclude the class of blue eyed people from marriage.\n\n \n Or men with their brother,father,sister or mother.....", 
   {}, 
   424360, 
   null, 
   1298159040.0
  ], 
  [
   424366, 
   null, 
   "jyoshu", 
   "Or men with their brother,father,sister or mother.....\n\n \n Or a 'family' of three parents supposedly in love as a group, or four ....\n But hey, we're supposed to just consider it all as 'being human.' emoticon_rolleyes", 
   {}, 
   424364, 
   null, 
   1298159460.0
  ], 
  [
   424367, 
   null, 
   "gansao", 
   "Or a 'family' of three parents supposedly in love as a group, or four ....\n But hey, we're supposed to just consider it all as 'being human.' emoticon_rolleyes\n\n \n Exactly.Homosexuals want to have marriage redefined to include homosexuals..then pull up the ladderemoticon_xdonno", 
   {}, 
   424366, 
   null, 
   1298159700.0
  ], 
  [
   424372, 
   null, 
   "Matthew S", 
   "Or a 'family' of three parents supposedly in love as a group, or four ....\n But hey, we're supposed to just consider it all as 'being human.' emoticon_rolleyes\n\n \n And Jacob had 2 wives Leah and Rachel, both sisters and the daughters of his mothers brother Laban. He had children by two of their servants (the sisters idea) All of which he owned.\n \n So here we have a traditional biblical marriage of first cousins and 2 concubines. And the christianists call gay marriage twisted. So roll your eyes all you want but the hetero only one man one woman marriage is only a modern concoction that was redefined from its woman as property historical tradition.", 
   {}, 
   424366, 
   null, 
   1298173680.0
  ], 
  [
   424373, 
   null, 
   "Xcaliber", 
   "The rest of the article appears to regale us with tales of how Congress cannot ban homosexual marriage. Since this thread here is about State laws, the rest of the article does not appear relevant. Please point out the portion I missed if I am incorrect.\n\n \n Ok let me explain a bit further, since you didn't bother really reading the full article.\n \n Article Four of the Federal Constitution states:\n \n \"Full Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State. And the Congress may by general Laws prescribe the Manner in which such Acts, Records and Proceedings shall be proved, and the Effect thereof.\n \n Clause 1: The Citizens of each State shall be entitled to all Privileges and Immunities of Citizens in the several States.\"\n \n This means that no State has the right to ignore Civil Agreements reached in other states. , Marriage is a Civil matter And according to the constutuion of the United States ALL states are required to recognize Civil unions from other states, including Gay Unions.\n \n The tenth amentment states...\n \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the states, are reserved to the states respectively, or to the people.\"\n \n Because the Contituition does not give the Federal Government Jurisdiction over Civil Matters it is up to each state to regulate Marriage , meaning Congress had neither the right or the Power to pass DOMA to begin with. It's unconstitutional. \n \n Article Six states..\n \n \"This Constitution, and the laws of the United States which shall be made in pursuance thereof; and all treaties made, or which shall be made, under the authority of the United States, shall be the supreme law of the land; and the judges in every state shall be bound thereby, anything in the Constitution or laws of any State to the contrary notwithstanding.\"\n \n Boiled down, this means that the Constitution is barred from contradicting itself. Thus, a Federal Marriage Amendment that would deprive a singled-out populace of any rights runs in clear contradiction to Article Four and Amendment Nine of the Constitution.\n \n \n Amendment Nine states:\n \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\n \n Amendment Fourteen:\n \n \"Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\"\n \n \n States do not have a right to pick and choose the people to whom it will grant rights and privileges.\n \n If same-sex couples are barred from marriage, it is an abridgement of the privileges they are entitled to as citizens of the United States; it would be a deprivation of liberty and prosperity, and would strip same-sex couples of equal protection of the laws. Plainly, it is discriminatory, and the Fourteenth Article clearly states that selective granting of privileges is not allowed in the United States.\n \n Basically all this means is that The Federal Government does not have the Legal Authority to Define Marriage. DOMA is uncontitutional and will eventually be overturned once the Supreme Court hears the case.\n \n States do not have the Right to Ignore Same sex Marriages from other states, nor do they have the right to supercede the Constitution in order to Define Marriage that will deny One particular group of the same Privilages awarded to others. It's unconstitutional.\n \n So either way you look at this it is unconstitutional , not to mention just plain ignorant, to deny Gay people their rights to the same Life, Liberty, and happiness that other American Citizens are Awarded.", 
   {}, 
   424356, 
   null, 
   1298175420.0
  ], 
  [
   424374, 
   null, 
   "Sigma", 
   "Ok let me explain a bit further, since you didn't bother really reading the full article.\n\n \n I did read the article. You reposted the section on doma and Federal powers (without citation, even... I think that qualifies as plagerism), but this thread is about State power.\n \n If you're going to explain your point, please do more than just repost.", 
   {}, 
   424373, 
   null, 
   1298176020.0
  ], 
  [
   424375, 
   null, 
   "Stonewall", 
   "Since there is no right to marry the person you love, it is not the government's responsibility to make sure you can marry whom you love.\n\n \n But there IS an unwritten right for straight people to be able to marry who they love. \n \n Sure, you don't have to be in love to get married, but every straight person is guaranteed the right to be able to marry the person they love (as long as the partner is willing). Gay people don't have that right.", 
   {}, 
   424344, 
   null, 
   1298176140.0
  ], 
  [
   424377, 
   null, 
   "Sigma", 
   "But there IS an unwritten right for straight people to be able to marry who they love. \n\n \n Yes, traditionally and culturally speaking, marrying whom you love and creating a family between you is part of the point of marriage. It isn't a right, however... nor is it a requirement that you love whom you marry. It's certainly in no way enforcable nor should it be. In the same sense, traditionally and culturally speaking, marriage is a formalization of a mating pair for the purposes of having children. In this sense homosexuals are not a part of marriage \n \n To include homosexual people in the custom of marriage, the traditional and cultural meaning has to be stripped away and done with to reveal the minimum legal meaning. That meaning is a contract between two people that follow certain legal requirements to be valid. Those legal requirements apply equally to homosexual and heterosexual people.\n \n \nSure, you don't have to be in love to get married, but every straight person is guaranteed the right to be able to marry the person they love (as long as the partner is willing). Gay people don't have that right.\n\n \n You're still trying to frame it in the language of rights when it simply is not the case. Too many times have I seen the phrase \"love-less marriage\" to possibly be convinced these people are being denied something they have the legal right to.", 
   {}, 
   424375, 
   null, 
   1298177040.0
  ], 
  [
   424378, 
   null, 
   "Xcaliber", 
   "I did read the article. You reposted the section on doma and Federal powers (without citation, even... I think that qualifies as plagerism), but this thread is about State power.\n \n If you're going to explain your point, please do more than just repost.\n\n \n The Article also addresses the issue of State Power. The States do not have the authority to override the Constitution. The Law that is now written into the Constitution (DOMA) is unconstitutional. That Law is the very one most states fall back on when defining Marriage so they are in violation of the Constitution. Furthermore a State that does not allow Gay marriage or Civil Unions Under the U.S. Constitution MUST recognize Civil Unions or Marriages from other States. They are in Violation of Federal Law and a State does not have that Power. \n \n It doesn't matter that you call it a \"State\" issue. If it violates the Constitution then it becomes a Federal Issue. \n \n and Plagiarism would mean I simply copy and pasted without Citation.. Since I didn't copy and paste, I re-wrote most of that and paraphrased a bit, and considering I cited the source in the previous post I think I'm safe to say it's not a problem.", 
   {}, 
   424374, 
   null, 
   1298177160.0
  ], 
  [
   424380, 
   null, 
   "Stonewall", 
   "It is the government's responsibility to tell us whom we cannot marry. We have allowed them that power for quite some time. A person's partner must not be under the age of consent, of close relation, already married, of the same gender, or of a different species.\n \n No one is allowed to marry whomever they choose. There are restrictions\n\n \n But one (really 2) of those restrictions stands out as having no reason behind it (other than discrimination). \n \n Can't marry a person under the age of consent because they aren't legally mature enough to make the decision themselves.\n \n Can't marry a close relative because it could seriously be harmful to any offspring. Plus marriage is there to create kinship between two people who are not kin. They are already family without the marriage.\n \n \n Can't marry an animal because the animal can't give consent (and aren't subject to government benefits). \n \n Polygamy is illegal because it could be complicated for the government and could possibly lead to some way people could abuse/exploit the system. In my opinion, the government should get out of the marriage business. (Let gays do what they want and let polygamists do what they want. Consenting adults can already live together, love each other, etc.). \n \n Gays can't marry each other because **** 'em, that's why. Two dudes together is just gross, man. (That's what I assume the government's official reasoning is anyway).", 
   {}, 
   424349, 
   null, 
   1298177520.0
  ], 
  [
   424381, 
   null, 
   "Sigma", 
   "The Article also addresses the issue of State Power. The States do not have the authority to override the Constitution. The Law that is now written into the Constitution (DOMA) is unconstitutional. That Law is the very one most states fall back on when defining Marriage so they are in violation of the Constitution. Furthermore a State that does not allow Gay marriage or Civil Unions Under the U.S. Constitution MUST recognize Civil Unions or Marriages from other States. They are in Violation of Federal Law and a State does not have that Power.\n\n \n What doma says is somewhat immaterial to this point. The section that was pointed out, the full faith and credit as well as the privileges and immunities clause, do not apply as the article would suppose they do. Taken to the logical conclusion, there would be no State law since no State could have different Acts, Records and Judicial proceedings. This is obviously not the case nor was it the intention when the document was written (obvious to even a cursory examination of the founder's expressed intention).\n \n The conclusions drawn by the article are flawed. States are not required to enforce the laws of other States.", 
   {}, 
   424378, 
   null, 
   1298178060.0
  ], 
  [
   424384, 
   null, 
   "Sigma", 
   "Can't marry a person under the age of consent because they aren't legally mature enough to make the decision themselves.\n\n \n I don't buy this. There are variations in age of consent not only among States but among countries as well. Are those people more mature? Age of consent is a legal construct.\n \n \nCan't marry a close relative because it could seriously be harmful to any offspring. Plus marriage is there to create kinship between two people who are not kin. They are already family without the marriage.\n\n \n We don't genetically screen potential marriage partners and any risk they want to take should be theirs to take. \n \n \nCan't marry an animal because the animal can't give consent (and aren't subject to government benefits).\n\n \n We can kill it and eat it, but other than that is just wrong amirite? \n \n \nPolygamy is illegal because it could be complicated for the government and could possibly lead to some way people could abuse/exploit the system. In my opinion, the government should get out of the marriage business. (Let gays do what they want and let polygamists do what they want. Consenting adults can already live together, love each other, etc.).\n\n \n This is thin justification indeed. 'They might exploit the system'? \n \n \nGays can't marry each other because **** 'em, that's why. Two dudes together is just gross, man. (That's what I assume the government's official reasoning is anyway).\n\n \n It doesn't matter what the reasoning is, to my mind. The restrictions are in place because we want them there (otherwise we would remove them). If you want to change the law you go through established channels.", 
   {}, 
   424380, 
   null, 
   1298178780.0
  ], 
  [
   424386, 
   null, 
   "Xcaliber", 
   "The conclusions drawn by the article are flawed. States are not required to enforce the laws of other States.\n\n \n Marriage is not a LAW.. State's do not Enforce The LAWS of other states. Marriage is a CIVIL matter, and under the Constitution as previously stated States MUST RECOGNIZE civil unions from other states. It is Unconstitutional for any state ignore Civil Unions that take place in other states, and this includes Gay unions.", 
   {}, 
   424381, 
   null, 
   1298181060.0
  ], 
  [
   424387, 
   null, 
   "jyoshu", 
   "Marriage is not a LAW.. State's do not Enforce The LAWS of other states. Marriage is a CIVIL matter, and under the Constitution as previously stated States MUST RECOGNIZE civil unions from other states. It is Unconstitutional for any state ignore Civil Unions that take place in other states, and this includes Gay unions.\n\n \n That's only if the given issue is determined to be a federally constitutional guarantee. Certainly the jury is still out and probably will remain so until the issue of gay marriage is taken up by the Supreme Court. As of things right now, civil unions or marriage rights for gays are only guaranteed under state-level constitutions and therefore do not extend beyond state borders.", 
   {}, 
   424386, 
   null, 
   1298181240.0
  ], 
  [
   424388, 
   null, 
   "Sigma", 
   "Marriage is not a LAW.. State's do not Enforce The LAWS of other states. Marriage is a CIVIL matter, and under the Constitution as previously stated States MUST RECOGNIZE civil unions from other states. It is Unconstitutional for any state ignore Civil Unions that take place in other states, and this includes Gay unions.\n\n \n Certainly not through the privilieges and immunities clause. SCOTUS has not interpreted that clause to mean that States must protect any rights beyond general rights they provide to their own citizens. \n \n That means that if a State offers homosexual marriage then it must be open to out of State visitors. It doesn't mean that a State must honor out of State marriages if it conflicts with their own laws.", 
   {}, 
   424386, 
   null, 
   1298181720.0
  ], 
  [
   424398, 
   null, 
   "Stonewall", 
   "I don't buy this. There are variations in age of consent not only among States but among countries as well. Are those people more mature? Age of consent is a legal construct.\n\n \n Doesn't matter. I think everyone can agree that up until a certain point, a person isn't mature enough to make decisions for themselves. A 3 year old can't choose his whole diet for example, and a kindergartener can't choose to drop out. But unless the government wants spend billions of dollars to test every person individually to see if they are mature enough to consent to sex and marriage or whatever other decision they need to make, then they have to settle on a cutoff limit. Same as driving a car, smoking, drinking, joining the military, etc. It's obviously not perfect; some people mature faster than others, but a restriction is definitely necessary to keep adults from taking advantage of children. \n \n \nWe don't genetically screen potential marriage partners and any risk they want to take should be theirs to take. \n\n \n Eh, I don't like the thought of allowing two relatives to knowingly shoot out a bunch of babies with birth defects when with different partners they could have healthy kids. Maybe if they were infertile or old or something they could get a marriage license. Doesn't matter anyway, the point is that there is a decent reason against incestuous marriage. \n \n \nWe can kill it and eat it, but other than that is just wrong amirite? \n\n \n Yep. You can kill it and eat it, but you can't torture it or otherwise be inhumane. I mean, I guess if you didn't rape the animal it wouldn't be any different than just having a pet, but the fact remains that the animal would have no way of consenting to marriage, and that is required... Otherwise I would've gotten married to Jessica Alba years ago.\n \n \n \nThis is thin justification indeed. 'They might exploit the system'? \n\n \n Yeah, I really got nothing. Polygamy shouldn't be illegal. It'd be a nightmare to have multiple wives, though. I guess another (weak) reason could be that one partner might not be aware of other partners.\n \n \nIt doesn't matter what the reasoning is, to my mind. The restrictions are in place because we want them there (otherwise we would remove them). If you want to change the law you go through established channels.\n\n \n Not if those laws are discriminating against a group of people. And I've changed my mind from earlier, as I do now think this issue is unconstitutional (if not for gays, then for men and women not having the same choices in marriage). If it is found to be unconstitutional by a judge, then it gets changed immediately regardless of how the people might feel. The Bill of Rights is there to protect the minority and isn't up for a vote. \n \n Also, all that matters is that we want the restrictions? You don't care about the reasoning? You could've said the same thing about literally any bad law ever... You seem to concede that there aren't really any good reasons that gays can't get married, but yet you keep making excuses for it despite it obviously causing a lot of couples across the country unnecessary grief?", 
   {}, 
   424384, 
   null, 
   1298199660.0
  ], 
  [
   424400, 
   null, 
   "Matthew S", 
   "What doma says is somewhat immaterial to this point. The section that was pointed out, the full faith and credit as well as the privileges and immunities clause, do not apply as the article would suppose they do. Taken to the logical conclusion, there would be no State law since no State could have different Acts, Records and Judicial proceedings. This is obviously not the case nor was it the intention when the document was written (obvious to even a cursory examination of the founder's expressed intention).\n \n The conclusions drawn by the article are flawed. States are not required to enforce the laws of other States.\n\n \n So then are gay people citizens of the Unides States first then the state they live in second? It seems like you believe thatonly heterosexuals get to be US citizens first state second, while ggay people are citizens of a state first then citizens of the United States second.", 
   {}, 
   424381, 
   null, 
   1298211660.0
  ], 
  [
   424402, 
   null, 
   "gansao", 
   "And Jacob had 2 wives Leah and Rachel, both sisters and the daughters of his mothers brother Laban. He had children by two of their servants (the sisters idea) All of which he owned.\n \n So here we have a traditional biblical marriage of first cousins and 2 concubines. And the christianists call gay marriage twisted. So roll your eyes all you want but the hetero only one man one woman marriage is only a modern concoction that was redefined from its woman as property historical tradition.\n\n \n But it was always between men and women.. gay 'marriage' changes the concept of marriage itself.\n Incidently when and where in history have homosexuals been allowed to 'marry' with the union accepted as equal to heterosexual marriage?", 
   {}, 
   424372, 
   null, 
   1298219700.0
  ], 
  [
   424404, 
   null, 
   "Sigma", 
   "Doesn't matter. I think everyone can agree that up until a certain point, a person isn't mature enough to make decisions for themselves. A 3 year old can't choose his whole diet for example, and a kindergartener can't choose to drop out. But unless the government wants spend billions of dollars to test every person individually to see if they are mature enough to consent to sex and marriage or whatever other decision they need to make, then they have to settle on a cutoff limit. Same as driving a car, smoking, drinking, joining the military, etc. It's obviously not perfect; some people mature faster than others, but a restriction is definitely necessary to keep adults from taking advantage of children.\n\n \n I certainly have no solution to offer, but my point is that the restriction is arbitrary and not based in either biology or in any real knowledge of the maturity of the people it ostensibly is meant to protect. Your statement that it \"doesn't matter\" is quite correct, though, because the people of the various States have the power to enact the restriction regardless of their knowledge or motive.\n \n \nEh, I don't like the thought of allowing two relatives to knowingly shoot out a bunch of babies with birth defects when with different partners they could have healthy kids. Maybe if they were infertile or old or something they could get a marriage license. Doesn't matter anyway, the point is that there is a decent reason against incestuous marriage.\n\n \n A very similar reason against homosexual marriage, when you get right down to it. Incestous relationships are evolutionarily selected against not only because of an increased risk of so-called \"deadly\" gene combinations (which are not all that common) but also because there is no increase in perpetuation of the genes of the people in question when paired with a close copy of itself. Homosexual relationships would obviously be selected against since there is zero perpetuation of the genes of the people in question. This would lead to both type of relationships inspiring similar reaction which would lead to avoidance of participating in those relationships: namely, disgust.\n \n \nYep. You can kill it and eat it, but you can't torture it or otherwise be inhumane. I mean, I guess if you didn't rape the animal it wouldn't be any different than just having a pet, but the fact remains that the animal would have no way of consenting to marriage, and that is required... Otherwise I would've gotten married to Jessica Alba years ago.\n\n \n Marriage is torturing or being inhumane? Or do you mean the sex, because that wouldn't be torturing or being inhumane either. While certainly animals cannot articulate, they are just as able to enjoy sex as a human can. Inhumane? Cutting off their balls, or simply depriving them of sexual contact is probably more so... at least imo. While there certainly can be concerns about torture, whether sexual or not, there certainly doesn't need to be the expectation that any contact must necessarily be unwanted and painful.\n \n \nNot if those laws are discriminating against a group of people. And I've changed my mind from earlier, as I do now think this issue is unconstitutional (if not for gays, then for men and women not having the same choices in marriage). If it is found to be unconstitutional by a judge, then it gets changed immediately regardless of how the people might feel. The Bill of Rights is there to protect the minority and isn't up for a vote.\n\n \n It isn't actually enough that there be inequality, tbh, in the abstract. There has to be demonstrabable harm (not abstract harm), otherwise the suit is dismissed without the question of constitutionality being heard. To have standing for a gender question rather than a sexual orientation question, the person named could very well need to be heterosexual. Heterosexual people are not suffering under it, and I don't think it can be used as an end-run around the question of homosexual relationships. Besides, differences between men and woman have generally been accepted to exist and in some Court cases such as Michael M. v. Superior ct it has been held that inequalities between men and women are not necessarily suspect: \n \n Because the Equal Protection Clause does not \"demand that a statute necessarily apply equally to all persons\" or require \"things which are different in fact . . . to be treated in law as though they were the same,\" Rinaldi v. Yeager, a statute will be upheld where the gender classification is not invidious, but rather realistically reflects the fact that the sexes are not similarly situated in certain circumstances\n \n You may not get the answer you'd like, even if inequality were accepted to exist.\n \n \nAlso, all that matters is that we want the restrictions? You don't care about the reasoning? You could've said the same thing about literally any bad law ever... You seem to concede that there aren't really any good reasons that gays can't get married, but yet you keep making excuses for it despite it obviously causing a lot of couples across the country unnecessary grief?\n\n \n Yes, you can say the same thing about any bad law ever. If enough people want a bad law, then a bad law will be put into place. If enough people want to get rid of a bad law, then the bad law goes away. A bad law isn't automatically unconstitutional.\n \n The only thing I'm arguing is that there are no inequalities between homosexuals and heterosexuals. I'm not arguing whether the restrictions are \"good\" or \"bad\" because those are value judgements.", 
   {}, 
   424398, 
   null, 
   1298228340.0
  ], 
  [
   424405, 
   null, 
   "Sigma", 
   "So then are gay people citizens of the Unides States first then the state they live in second? It seems like you believe thatonly heterosexuals get to be US citizens first state second, while ggay people are citizens of a state first then citizens of the United States second.\n\n \n I don't understand the thrust of the question. What does it matter which they are a citizen of first?", 
   {}, 
   424400, 
   null, 
   1298228460.0
  ], 
  [
   424412, 
   null, 
   "Matthew S", 
   "But it was always between men and women.. gay 'marriage' changes the concept of marriage itself.\n Incidently when and where in history have homosexuals been allowed to 'marry' with the union accepted as equal to heterosexual marriage?\n\n \n Same-Sex Unions in Premodern Europe by John Boswell - Book review by Marian Horvat\n \n Same-sex marriage in the Middle Ages | SCAtoday.net", 
   {}, 
   424402, 
   null, 
   1298236680.0
  ], 
  [
   424413, 
   null, 
   "Matthew S", 
   "I don't understand the thrust of the question. What does it matter which they are a citizen of first?\n\n \n It has to do with full faith and credit. The reason it exists is to try and even the laws out though out a federal system. \n \n The thrust of my question is that in the past if one gets married in florida, or adopts a child in oregon, as far as the federal government is concerned your were married, or that child was your child. The federal government respected what the states said. Even the Lovings where married as far as the federal government was concerned. What we have now is a reversal. A gay person from Iowa is not considered a citizen of The US first but a citizen of Iowa then a citizen of the US second. My status as a US citizen should not be contingent upon what state I live in.\n \n So my question to you are Gay people US citizens first or citizens of the state they live in first then US citizens? Otherwise we might as well be living in the American Union, much like France is apart of the European union.", 
   {}, 
   424405, 
   null, 
   1298237280.0
  ], 
  [
   424414, 
   null, 
   "Sigma", 
   "Same-Sex Unions in Premodern Europe by John Boswell - Book review by Marian Horvat\n \n Same-sex marriage in the Middle Ages | SCAtoday.net\n\n \n Yikes, if you read the book review that you linked it is scathingly critical of the methods and assumptions the book had. An exerpt:\n \n By publishing translations of several heterosexual marriage ceremonies alongside the \"same-sex blessings,\" Boswell sought to highlight similarities. Even a casual reading of the texts reveals integral differences: the normal marriage ceremonies bless a physical union of a man and a woman, celebrating \"the cause for the which Matrimony was ordained .... the procreation of children\"(3). However, each and every one of the texts Boswell called \"same-sex unions\" stress a union where the participants are \"not bound together by nature, but in the unity of the Holy Spirit,\" or \"joined together not by the bond of nature but by faith and in the mode of the spirit (4)\". These blessings of \"spiritual brotherhood\" were far from being the \"same-sex unions\" that Boswell termed them.\n \n Further, he is critical of the author himself: \n \n In all his revised interpretations, Boswell unfairly keeps silent about the fact that according to the early and medieval Church, homosexual activity was scandalous and considered an abomination", 
   {
    "unicode_changes_made": true
   }, 
   424412, 
   null, 
   1298237400.0
  ], 
  [
   424415, 
   null, 
   "Sigma", 
   "The thrust of my question is that in the past if one gets married in florida, or adopts a child in oregon, as far as the federal government is concerned your were married, or that child was your child. The federal government respected what the states said. Even the Lovings where married as far as the federal government was concerned. What we have now is a reversal. A gay person from Iowa is not considered a citizen of The US first but a citizen of Iowa then a citizen of the US second. My status as a US citizen should not be contingent upon what state I live in.\n \n So my question to you are Gay people US citizens first or citizens of the state they live in first then US citizens? Otherwise we might as well be living in the American Union, much like France is apart of the European union.\n\n \n The purposes of the Federal government and the State governments are separate. We do in fact live in something like a union which is pretty evident in the name of the country itself: United States.\n \n Your question of 'what am I a citizen of first' might betray a fundamental misunderstanding. You are a citizen of both, and the Federal government is concerned with Federal matters as they relate to you as a citizen, and the State governments are concerned with State matters as it relates to you as a citizen. The State matters would naturally vary according to the State in which you reside.", 
   {}, 
   424413, 
   null, 
   1298238840.0
  ], 
  [
   424417, 
   null, 
   "gansao", 
   "Same-Sex Unions in Premodern Europe by John Boswell - Book review by Marian Horvat\n \n Same-sex marriage in the Middle Ages | SCAtoday.net\n\n \n Oh dear. Did you actually read the links before posting?\n Historians believe..blah blah\n Like some scientists believe in gay penguins.\n Where in history were gay 'marriages' accepted as equal to hetero marriages in society?\n \n Answer..nowhere", 
   {}, 
   424412, 
   null, 
   1298241480.0
  ], 
  [
   424421, 
   null, 
   "Xcaliber", 
   "Oh dear. Did you actually read the links before posting?\n Historians believe..blah blah\n Like some scientists believe in gay penguins.\n Where in history were gay 'marriages' accepted as equal to hetero marriages in society?\n \n Answer..nowhere\n\n \n Although state-recognized same-sex unions are becoming more accepted, there is a long history of same-sex unions around the world. Various types of same-sex unions have existed, ranging from informal, unsanctioned, and temporary relationships to highly ritualized unions that have included marriage\n \n \n At least two of the Roman Emperors were in gay unions. The first Roman emperor to have married a man was Nero, who is reported to have married two other men on different occasions. Nero \"married a man named Sporus in a very public ceremony... with all the solemnities of matrimony, and lived with him as his spouse\" A friend gave the \"bride\" away \"as required by law. The marriage was celebrated separately in both Greece and Rome in extravagant public ceremonies.\n \n Same-sex marriage was outlawed on December 16, 342 AD by the Christian emperors Constantius II and Constans. This law specifically outlaws marriages between men and reads as follows:\n \n In the 20th and 21st centuries various types of same-sex unions have come to be legalized. Same-sex marriage is currently legal in Spain, Belgium, the Netherlands, Norway, Sweden and Portugal. Countries such as Greece, Romania and Poland restrict marriage to opposite-sex union, while countries such as Ireland and Italy are in the process of legislating on the issue.\n \n History of same-sex unions - Wikipedia, the free encyclopedia\n \n Gay Unions/Marriages were widely accepted in Ancient Roman and Greek cultures, as well as other parts of the world. These laws were not changed until the invention of GOD and religion when the Churches decided Gay marriage was a bad thing because GOD said it was ... There is not Rational reason to deny gay people of the same rights and benefits awarded to straight people.", 
   {}, 
   424417, 
   null, 
   1298245500.0
  ], 
  [
   424422, 
   null, 
   "gansao", 
   "Although state-recognized same-sex unions are becoming more accepted, there is a long history of same-sex unions around the world. Various types of same-sex unions have existed, ranging from informal, unsanctioned, and temporary relationships to highly ritualized unions that have included marriage\n \n \n At least two of the Roman Emperors were in gay unions. The first Roman emperor to have married a man was Nero, who is reported to have married two other men on different occasions. Nero \"married a man named Sporus in a very public ceremony... with all the solemnities of matrimony, and lived with him as his spouse\" A friend gave the \"bride\" away \"as required by law. The marriage was celebrated separately in both Greece and Rome in extravagant public ceremonies.\n \n Same-sex marriage was outlawed on December 16, 342 AD by the Christian emperors Constantius II and Constans. This law specifically outlaws marriages between men and reads as follows:\n \n In the 20th and 21st centuries various types of same-sex unions have come to be legalized. Same-sex marriage is currently legal in Spain, Belgium, the Netherlands, Norway, Sweden and Portugal. Countries such as Greece, Romania and Poland restrict marriage to opposite-sex union, while countries such as Ireland and Italy are in the process of legislating on the issue.\n \n History of same-sex unions - Wikipedia, the free encyclopedia\n \n Gay Unions/Marriages were widely accepted in Ancient Roman and Greek cultures, as well as other parts of the world. These laws were not changed until the invention of GOD and religion when the Churches decided Gay marriage was a bad thing because GOD said it was ... There is not Rational reason to deny gay people of the same rights and benefits awarded to straight people.\n\n \n I think that it was obvious that I knew that same sex marriages were accepted today and in recent times but I did post to Matthew and expected more from him than you(until I used the links he provided).\n Nero could as emperor do effectively do whatever he wanted and to state that Roman acceptance of his conduct sexual or otherwise was evidence of the society accepting that as the norm or acceptable conduct for the rest of Roman society is nonsense.\n Was Homosexual marriage accepted as EQUAL to hetero marriage in Roman times..no.\n \n Homosexual relationships were encouraged in Greek times between warriors but MARRIAGE was between men and women...\n \n You will be posting that Chinese sodomite eunuchs or the raping of Arab boys were the equivalent of gay marriage next...pitifulemoticon_xclown", 
   {}, 
   424421, 
   null, 
   1298246640.0
  ], 
  [
   424423, 
   null, 
   "Matthew S", 
   "The purposes of the Federal government and the State governments are separate. We do in fact live in something like a union which is pretty evident in the name of the country itself: United States.\n \n Your question of 'what am I a citizen of first' might betray a fundamental misunderstanding. You are a citizen of both, and the Federal government is concerned with Federal matters as they relate to you as a citizen, and the State governments are concerned with State matters as it relates to you as a citizen. The State matters would naturally vary according to the State in which you reside.\n\n \n Not an answer Are gay people US citizens or not? Do they have US citizenship? So then I understand you correctly a hetero married in Florida is not marry according to the federal government if they move to Delaware.", 
   {}, 
   424415, 
   null, 
   1298249040.0
  ], 
  [
   424424, 
   null, 
   "Sigma", 
   "Not an answer Are gay people US citizens or not? Do they have US citizenship? So then I understand you correctly a hetero married in Florida is not marry according to the federal government if they move to Delaware.\n\n \n Homosexual people are citizens if they were born in the United States or were naturalized, of course.\n \n According to the Federal government, the States regulate marriage. If Delaware declares your marriage void with a valid reason, then according to the Federal government you are not married. That's how I understand it, at least, since States can prescribe who is allowed to marry and how the marriage can be dissolved.\n \n For example, there are different ages that someone may be married according to what State in which they reside. In general, States will honor a marriage license if it was legally obtained in the State it was performed, but States can refuse to recognize a marriage that goes against their own laws if they so choose. This can be the case with marriage to underage children.", 
   {}, 
   424423, 
   null, 
   1298249760.0
  ], 
  [
   424426, 
   null, 
   "Xcaliber", 
   "I think that it was obvious that I knew that same sex marriages were accepted today and in recent times but I did post to Matthew and expected more from him than you(until I used the links he provided).\n Nero could as emperor do effectively do whatever he wanted and to state that Roman acceptance of his conduct sexual or otherwise was evidence of the society accepting that as the norm or acceptable conduct for the rest of Roman society is nonsense.\n Was Homosexual marriage accepted as EQUAL to hetero marriage in Roman times..no.\n \n Homosexual relationships were encouraged in Greek times between warriors but MARRIAGE was between men and women...\n \n You will be posting that Chinese sodomite eunuchs or the raping of Arab boys were the equivalent of gay marriage next...pitifulemoticon_xclown\n\n \n No you claimed that never in history had gay marriage been accepted in society. It was an accepted practice in ancient Rome and Greek societies. I wasn't there so I can't claim to know for certain but I would suspect Gay marriage in ancient Rome would have been much like it is today with the exception that then the churches and religion was not involved so it was LEGAL to marry whomever you wanted. Accepted by \"ALL\" of society or not the point is it was LEGAL until religion reared it's ugly head into Society.", 
   {}, 
   424422, 
   null, 
   1298253720.0
  ], 
  [
   424427, 
   null, 
   "Sigma", 
   "No you claimed that never in history had gay marriage been accepted in society. It was an accepted practice in ancient Rome and Greek societies. I wasn't there so I can't claim to know for certain but I would suspect Gay marriage in ancient Rome would have been much like it is today [...]\n\n \n It wasn't. The act of penetrating another was considered masculine and dominant, and if you were the one penetrated it made you feminine. Men killed one another to protect their masculinity since being dominant was part of their social standing. There were also several other concerns including whether the partner was a slave, freed-slave or free-born. \n \n It was in no way an equal relationship. Being feminized was a stigma.", 
   {}, 
   424426, 
   null, 
   1298254620.0
  ], 
  [
   424428, 
   null, 
   "Xcaliber", 
   "According to the Federal government, the States regulate marriage. If Delaware declares your marriage void with a valid reason, then according to the Federal government you are not married. That's how I understand it, at least, since States can prescribe who is allowed to marry and how the marriage can be dissolved.\n\n \n Until DOMA was passed State were required by the Constitution to recognize Marriages from other states, it wasn't until DOMA that states gained the right to deny an out of state marriage based on Homosexuality.\n \n On May 15, 2008, the California Supreme Court ruled that same-sex couples should have the right to marry.\n \n In October 2008, the Connecticut Supreme Court ruled that a ban against same-sex marriage was in violation of the equal protection clause in the state constitution.\n \n In April 2009, the Iowa Supreme Court ruled that the state's ban against same-sex marriage was unconstitutional.\n \n In Nov. 2003, the Massachusetts Supreme Judicial Court ruled that barring same-sex couples from civil marriage was unconstitutional.\n \n In August 2010, a federal district judge in California ruled that the Proposition 8 ban on same-sex marriages (passed in 2008) violated the equal protection provisions of the U.S. Constitution.\n \n These are just a few examples of State Supreme courts decisions concerning Gay Marriage. Note.. all these Judges have ruled that barring same sex Marriage is Unconstitutional.. Most states with Equal protection clauses in their state Constitution are also breaking the Law by denying Gay People the Rights awarded to others. So not only is barring Gay Marriage unconstitutional on a federal level it's also at the state levels. Either way it's unconstitutional and the Courts who have heard cases around the country agree. Eventually this will make it's way to the Supreme Court where they too will find DOMA unconstitutional and strike it down. Gay people right now are going through the same struggle African Americans and Women went through in fighting for their Rights. African Americans are now awarded the same rights, Women can now vote and are treated as equals, and eventually Gay people will get Marriage.", 
   {}, 
   424424, 
   null, 
   1298255100.0
  ], 
  [
   424429, 
   null, 
   "gansao", 
   "No you claimed that never in history had gay marriage been accepted in society. It was an accepted practice in ancient Rome and Greek societies. I wasn't there so I can't claim to know for certain but I would suspect Gay marriage in ancient Rome would have been much like it is today with the exception that then the churches and religion was not involved so it was LEGAL to marry whomever you wanted. Accepted by \"ALL\" of society or not the point is it was LEGAL until religion reared it's ugly head into Society.\n\n \n There was NO homosexual equivalent to hetero marriage in Rome or Greece.\n In fact there was no gay marriage at all.\n Dont confuse catamites with wives.\n Men took wives to procreate and have children to look after them in their dotage...\n No matter how much they try homosexuals cannot procreateemoticon_rolleyes", 
   {}, 
   424426, 
   null, 
   1298256120.0
  ], 
  [
   424430, 
   null, 
   "jitobear", 
   "Exactly.Homosexuals want to have marriage redefined to include homosexuals..then pull up the ladderemoticon_xdonno\n\n \n Kind of like how (some) heterosexuals want to keep it to defined to one man and woman and then pull up the ladder?\n \n \nNo matter how much they try homosexuals cannot procreateemoticon_rolleyes\n\n \n Of course they can. I know a gay man who is a BIOLOGICAL grandfather. Homosexuality does not break one's reproductive organs, and the sex act does not equate sexual attraction.", 
   {}, 
   424429, 
   null, 
   1298256720.0
  ], 
  [
   424432, 
   null, 
   "Xcaliber", 
   "There was NO homosexual equivalent to hetero marriage in Rome or Greece.\n In fact there was no gay marriage at all.\n\n \n Evidence exists that same-sex marriages were tolerated in parts of Mesopotamia and ancient Egypt. Artifacts from Egypt, for example, show that same-sex relationships not only existed, but the discovery of a pharaonic tomb for such a couple shows their union was recognized by the kingdom. Meanwhile, accounts of the Israelites' departure for Canaan include their condemnation of Egyptian acceptance of same-sex practice. In actuality, same-sex marital practices and rituals are less known in Egypt compared to Mesopotamia, where documents exist for a variety of marital practices, including male lovers of kings and polyandry. None of the recorded laws of Mesopotamia, including the Code of Hammurabi, contain restrictions against same-sex unions despite the fact that marriages are otherwise well regulated\n \n http://www.randomhistory.com/history-of-gay-marriage.html\n \n And also according to you there was NO gay Marriage in ancient Rome and Greece.. \n \n Same-sex marriage was outlawed on December 16, 342 AD by the Christian emperors Constantius II and Constans. This law specifically outlaws marriages between men and reads as follows:When a man marries and is about to offer himself to men in womanly fashion [quum vir nubit in feminam viris porrecturam], what does he wish, when sex has lost all its significance; when the crime is one which it is not profitable to know; when Venus is changed to another form; when love is sought and not found? We order the statutes to arise, the laws to be armed with an avenging sword, that those infamous persons who are now, or who hereafter may be, guilty may be subjected to exquisite punishment. (Theodosian Code 9.7.3)\n \n If Gay Marriage was as \"Uncommon\" as you say it was there would have been NO NEED to pass a Law Barring it in the first place. There are historically recorded Gay Marriages in many parts of the world. Ancient Rome and Greece among them. It doesn't matter if they were \" Socially Accepted\" or not, they were not against the Law until religion made it so.", 
   {}, 
   424429, 
   null, 
   1298257320.0
  ], 
  [
   424434, 
   null, 
   "Sigma", 
   "Kind of like how (some) heterosexuals want to keep it to defined to one man and woman and then pull up the ladder?\n\n \n Aye, this is so. However, imo it is much more possible to justify just heterosexual relationships than it is to justify just heterosexual and homosexual relationships.\n \n The slippery slope has some truth to it.", 
   {}, 
   424430, 
   null, 
   1298261400.0
  ], 
  [
   424435, 
   null, 
   "Sigma", 
   "Until DOMA was passed State were required by the Constitution to recognize Marriages from other states, it wasn't until DOMA that states gained the right to deny an out of state marriage based on Homosexuality.\n\n \n This absolutely, completely and totally false. DOMA was a solution in search of a problem. All it really did was prevent homosexual couples from filing joint Federal tax returns (even if they filed jointly with the State). One of the criticisms of DOMA is, specifically, that Congress may not have the power to regulate marriage enough to even have Federal standards. \n \n \nThese are just a few examples of State Supreme courts decisions concerning Gay Marriage. Note.. all these Judges have ruled that barring same sex Marriage is Unconstitutional.\n\n \n Except SCOTUS has flatly said that it is not a Federal matter. Baker v. Nelson was a case in which the Minnesota Supreme Court ruled that Minnesota law limited marriage to opposite-sex couples and that this limitation did not violate the United States Constitution. The couple had contended that by not allowing marriage their various rights were violated including the First, Eighth, Ninth and Fourteenth (for gender discrimination, amusingly enough). It was appealed to SCOTUS and they dismissed the appeal \"for want of a substantial federal question\". This means that it is ruled on at a State level.", 
   {}, 
   424428, 
   null, 
   1298262300.0
  ], 
  [
   424438, 
   null, 
   "Xcaliber", 
   "This absolutely, completely and totally false. DOMA was a solution in search of a problem. All it really did was prevent homosexual couples from filing joint Federal tax returns (even if they filed jointly with the State). One of the criticisms of DOMA is, specifically, that Congress may not have the power to regulate marriage enough to even have Federal standards.\n\n \n No you are Absolutely, Completely, and totally wrong. DOMA defined Marriage as a union between one man and one woman. By Defining Marriage The Government goes against the Constitution . It did not only prevent gay couples from filing tax returns it prevents them from getting Married. \n \n \n\n Except SCOTUS has flatly said that it is not a Federal matter. Baker v. Nelson was a case in which the Minnesota Supreme Court ruled that Minnesota law limited marriage to opposite-sex couples and that this limitation did not violate the United States Constitution. The couple had contended that by not allowing marriage their various rights were violated including the First, Eighth, Ninth and Fourteenth (for gender discrimination, amusingly enough). It was appealed to SCOTUS and they dismissed the appeal \"for want of a substantial federal question\". This means that it is ruled on at a State level.\n\n \n By Defining Marriage The Government by default made it a Federal Issue. The Fact that Marriage is a Civil Issue normally regulated by States is beside the point. DOMA is UNCONSTITUTIONAL, that makes it a Federal Issue so the Supreme Court can and eventually will have to hear whatever case is brought up concerning DOMA.", 
   {}, 
   424435, 
   null, 
   1298264640.0
  ], 
  [
   424439, 
   null, 
   "Sigma", 
   "\n By Defining Marriage The Government by default made it a Federal Issue. The Fact that Marriage is a Civil Issue normally regulated by States is beside the point. DOMA is UNCONSTITUTIONAL, that makes it a Federal Issue so the Supreme Court can and eventually will have to hear whatever case is brought up concerning DOMA.\n\n \n It appears that no-one, not even SCOTUS itself, can convince you differently :P\n \n How about this: Currently, you are wrong. Currently, States decide the standards of marriage for themselves. If and when SCOTUS overturns itself then you can say there are national standards for marriage.", 
   {}, 
   424438, 
   null, 
   1298266020.0
  ], 
  [
   424440, 
   null, 
   "Xcaliber", 
   "It appears that no-one, not even SCOTUS itself, can convince you differently :P\n\n \n Because I'm not wrong, You are. \n \n \n\n How about this: Currently, you are wrong. Currently, States decide the standards of marriage for themselves. If and when SCOTUS overturns itself then you can say there are national standards for marriage.\n\n \n Note the Bold .. The States were REQUIRED under our CONSTITUTION to honor other states records, including Gay Marriage.. DOMA put a stop to that.\n \n\n Defense of Marriage Act is the short title of a federal law of the United States passed on September 21, 1996 as Public Law No. 104-199, 110 Stat. 2419. Its provisions are codified at 1 U.S.C. § 7 and 28 U.S.C. § 1738C. Under the law, also known as DOMA, no state (or other political subdivision within the United States) needs to treat as a marriage a same-sex relationship considered a marriage in another state (DOMA, Section 2); the federal government defines marriage as a legal union between one man and one woman (DOMA, Section 3).\n \n The following excerpts are the main provisions of the Act:\n \n Section 2. Powers reserved to the states:\n \n No State, territory, or possession of the United States, or Indian tribe, shall be required to give effect to any public act, record, or judicial proceeding of any other State, territory, possession, or tribe respecting a relationship between persons of the same sex that is treated as a marriage under the laws of such other State, territory, possession, or tribe, or a right or claim arising from such relationship.\n \n Section 3. Definition of 'marriage' and 'spouse':\n \n In determining the meaning of any Act of Congress, or of any ruling, regulation, or interpretation of the various administrative bureaus and agencies of the United States, the word 'marriage' means only a legal union between one man and one woman as husband and wife, and the word 'spouse' refers only to a person of the opposite sex who is a husband or a wife.[6]\n \n one effect of DOMA is that states do not have to enforce judicial custody, alimony or other orders made in other states that involve recognition of same-sex marriages. In his opinion states already had the right to refuse recognition of marriages to local residents who traveled to and married in other states for the purpose of evading local laws. Less clear, however, are cases in which marriage was contracted by residents of a state and they moved to a new state or in which physically present non-residents asserted rights in a local court. It is unclear whether DOMA was intended to address these two cases, whether states already had the power to refuse recognition in these cases even without DOMA, and whether the U.S. Constitution permits any modification of such state powers by Congress.[7]\n \n \n DOMA's two effective sections raise separate constitutional issues.\n \n Section 2 of DOMA explicitly addresses the constitutional requirement expressed in the Full Faith and Credit Clause in Article IV Section 1 of the United States Constitution, quoting its language directly. That clause establishes that the states have certain reciprocal obligations to one another, specifically to recognize each other's \"public Acts, Records, and judicial Proceedings.\" That same section of the Constitution gives Congress the authority to legislate on the question of those obligations. Section 2 of DOMA excludes same-sex marriages from the state \"acts\" that any other state needs to recognize. Whether DOMA is an appropriate exercise of Congress's power is disputed.[citation needed]\n \n Section 3 of DOMA defining \"marriage\" and \"spouse\" for federal purposes raises a more extensive variety of constitutional issues. First, the Tenth Amendment to the United States Constitution reserves to the states any power not delegated to the federal government. Debate turns on whether or not the states retain the sole authority to define marriage, as a power not granted by the Constitution to the federal government. Some opponents of same-sex marriage who argue that the definition of marriage is a power reserved to the states do so in anticipation of a time when the federal government might substitute language that would recognize same-sex unions for DOMA's definitions.[citation needed] Similarly, proponents of same-sex marriage, particularly those in states that recognize same-sex unions, argue that the federal government has no authority to define marriage, but must defer to each state's definition.[citation needed] Libertarians also take this view, consistent with their general philosophy of limiting the role of the federal government and favoring local decision-making.[citation needed]\n \n Second, the two sides debate whether or not the right to marriage can be restricted to a traditional definition-the right to participate in the historically accepted institution of marriage as the union of a man and a woman-and whether the right to marriage can be denied to those who choose same-sex partners. All agree that the Supreme Court has recognized a fundamental right to marriage in Loving v. Virginia, Zablocki v. Redhail, and Turner v. Safley. Critics of DOMA Section 3 contend that denial of the right to participate in marriage with the partner of one's choice, irrespective of gender, violates both the Due Process Clause and Equal Protection Clause of the Fourteenth Amendment. With respect to the Equal Protection Clause, critics contend that DOMA unfairly discriminates against one class of citizens, homosexuals, who have suffered from a history of discrimination.[citation needed]\n \n Proponents of DOMA argue that Congress is under no obligation to recognize marriages solemnized by the states that do not fulfill a federal rational basis. Though, historically, Congress has recognized states' marriages despite their differences (i.e. different marriageable age laws), proponents argue that the fundamental understanding of marriage remained intact - a heterosexual, monogamous union.[citation needed] Proponents reject Equal Protection and Due Process claims against DOMA given the lack of criminal sanctions (i.e. anti-miscegenation laws which were struck under Loving) on same-sex marriages performed by states that opt to recognize them.\n\n \n \n Defense of Marriage Act - Wikipedia, the free encyclopedia", 
   {
    "unicode_changes_made": true
   }, 
   424439, 
   null, 
   1298267400.0
  ], 
  [
   424441, 
   null, 
   "Sigma", 
   "Because I'm not wrong, You are. \n\n \n If you want a wiki-war... :P\n \n Link\n In the United States, civil marriage is governed by state law. Each state is free to set the conditions for a valid marriage, subject to limits set by the state's own constitution and the U.S. Constitution. Traditionally, a marriage was considered valid if the requirements of the marriage law of the state where the marriage took place were fulfilled. (First Restatement of Conflicts on Marriage and Legitimacy s.121 (1934)). However, a state can refuse to recognize a marriage if the marriage violates a strong public policy of the state, even if the marriage was legal in the state where it was performed. (Restatement (Second) Of Conflict of Laws § 283(2) (1971).)\n \n \n\n Defense of Marriage Act - Wikipedia, the free encyclopedia\n\n \n Heck, your interpretation flies in the face even of judges who agree with you.\n \n Link\n That DOMA plainly intrudes on a core area of state sovereignty&#8212;the ability to define the marital status of its citizens&#8212;also convinces this court that the statute violates the Tenth Amendment.\n and\n Section 2, which purports to give states the authority to refuse to recognize same-sex marriages legally entered into in other states, is not at issue in either of the cases\n \n Every source I read on the subject flat out says that States have authority in this matter. Your source gives an ambigious \"certain reciprocal obligations\". But no worries. I'm sure you'll still not be convinced ;)", 
   {}, 
   424440, 
   null, 
   1298268060.0
  ], 
  [
   424448, 
   null, 
   "Xcaliber", 
   "If you want a wiki-war... :P\n \n Link\n In the United States, civil marriage is governed by state law. Each state is free to set the conditions for a valid marriage, subject to limits set by the state's own constitution and the U.S. Constitution. Traditionally, a marriage was considered valid if the requirements of the marriage law of the state where the marriage took place were fulfilled. (First Restatement of Conflicts on Marriage and Legitimacy s.121 (1934)). However, a state can refuse to recognize a marriage if the marriage violates a strong public policy of the state, even if the marriage was legal in the state where it was performed. (Restatement (Second) Of Conflict of Laws § 283(2) (1971).)\n \n \n \n Heck, your interpretation flies in the face even of judges who agree with you.\n \n Link\n That DOMA plainly intrudes on a core area of state sovereignty-the ability to define the marital status of its citizens-also convinces this court that the statute violates the Tenth Amendment.\n and\n Section 2, which purports to give states the authority to refuse to recognize same-sex marriages legally entered into in other states, is not at issue in either of the cases\n \n Every source I read on the subject flat out says that States have authority in this matter. Your source gives an ambigious \"certain reciprocal obligations\". But no worries. I'm sure you'll still not be convinced ;)\n\n \n I never said States didn't have the authority on this matter.. The Constitution has always given the States the Authority to regulate Marriage. The Constitution Also Says States have to recognize Civil Laws from other states..Until DOMA was passed when that was changed. You just posted the exact thing I have been telling you ...lol..\n \n Your Argument is that Banning Gay marriage is not unconstitutional, I have shown you where it is, State Issue or not The States Laws do not Supersede the Contitution, no matter how much you want it to be so...", 
   {
    "unicode_changes_made": true
   }, 
   424441, 
   null, 
   1298274780.0
  ], 
  [
   424451, 
   null, 
   "Sigma", 
   "I never said States didn't have the authority on this matter.. The Constitution has always given the States the Authority to regulate Marriage. The Constitution Also Says States have to recognize Civil Laws from other states..Until DOMA was passed when that was changed. You just posted the exact thing I have been telling you ...lol..\n\n \n Ok, do you see what you're saying here? You say that States have the authority to regulate marriage, which means that a State doesn't have to recognize a marriage from a different State. Because if it did have to, then States would not have the authority to regulate marriage. You're contradicting yourself, or your using 'regulate' in a manner I'm not familiar with.\n \n The judge who struck down part of doma said, and I quote, DOMA plainly intrudes on a core area of state sovereignty&#8212;the ability to define the marital status of its citizens. Do you understand what that means? It means that States had the ability to define the marital status of its citizens before doma came around. The Full Faith and Credit clause has never ever ever meant that States must recognize marriages from other States. Ever.\n \n \nYour Argument is that Banning Gay marriage is not unconstitutional, I have shown you where it is, State Issue or not The States Laws do not Supersede the Contitution, no matter how much you want it to be so...\n\n \n If the States have the authority to define marriage, under what reasoning do you use to say that not recognizing homosexual marriage is unconstitutional, since you agree the States have the Constitutional authority to define marriage?", 
   {}, 
   424448, 
   null, 
   1298275980.0
  ], 
  [
   424454, 
   null, 
   "Xcaliber", 
   "Ok, do you see what you're saying here? You say that States have the authority to regulate marriage, which means that a State doesn't have to recognize a marriage from a different State. Because if it did have to, then States would not have the authority to regulate marriage. You're contradicting yourself.\n States could determine the validity of marriage long before doma came around. The Full Faith and Credit clause has never ever ever meant that States must recognize marriages from other States. Ever.\n Did you miss the part where marriage recognition is not required? The judge who struck down part of doma said, and I quote, DOMA plainly intrudes on a core area of state sovereignty&#8212;the ability to define the marital status of its citizens. Do you understand what that means? It means that states had the ability to define the marital status of its citizens before doma came around.\n If the States have the authority to define marriage, under what reasoning do you use to say that not recognizing homosexual marriage is unconstitutional, since you agree the States have the Constitutional authority to define marriage?\n\n \n Let's take a step back.. To a time before DOMA was passed...\n \n Before DOMA, the Government of the United States Did not have the Authority to define or Regulate Marriage. The Constitution Gave the states that Authority. However, It was also in the constitution in the In Article four Claus 1 it states.. Clause 1: The Citizens of each State shall be entitled to all Privileges and Immunities of Citizens in the several States.\"\n \n Meaning that if you get Married in One state, any other state must recognize that Marriage according to the Constitution of the U.S. the states can decide their Own marriage Laws, but they cannot ignore the marriage Laws of other states. In doing so they are trampling on the constitutional rights of a certain group of Citizens, which would be Gay people.\n \n Now, Move forward to DOMA. DOMA is unconstitutional on several issues. First would be that the Federal Government Does not have the Authority under the Constitution to Define Marriage. They did so with the passage of DOMA. Secondly the passage Of DOMA explicitly allowed States to ignore Article 4 clause 1 of the Constitution and gave them the authority to NOT recognize Gay Marriages from other states. \n \n The Supreme Court has not ruled on DOMA, they have so far refused to hear the Case. Obama made Repeal of DOMA part of his campaign, but I think we all know he has forgotten that. Either way it goes, Barring Gay people the same rights and Privileges awarded to others is Unconstitutional on both a Federal and a State by State Level, assuming that State has a Constitution.", 
   {}, 
   424451, 
   null, 
   1298277060.0
  ], 
  [
   424458, 
   null, 
   "gansao", 
   "Kind of like how (some) heterosexuals want to keep it to defined to one man and woman and then pull up the ladder?.\n\n \n Marriage IS the exclusive union between one man and woman.\n That way we know that our children are our real biological ones, it makes for a stable family life..unless one or both of the partners commit adultery\n \n \n \n \nOf course they can. I know a gay man who is a BIOLOGICAL grandfather. Homosexuality does not break one's reproductive organs, and the sex act does not equate sexual attraction.\n\n \n If homosexuals marry they have to commit adultery or fornicate before marriage to produce children.\n You obviously have no concept of fidelity in marriage.\n Are you a swinger?", 
   {}, 
   424430, 
   null, 
   1298295540.0
  ], 
  [
   424459, 
   null, 
   "gansao", 
   "Evidence exists that same-sex marriages were tolerated in parts of Mesopotamia and ancient Egypt. Artifacts from Egypt, for example, show that same-sex relationships not only existed, but the discovery of a pharaonic tomb for such a couple shows their union was recognized by the kingdom. Meanwhile, accounts of the Israelites' departure for Canaan include their condemnation of Egyptian acceptance of same-sex practice. In actuality, same-sex marital practices and rituals are less known in Egypt compared to Mesopotamia, where documents exist for a variety of marital practices, including male lovers of kings and polyandry. None of the recorded laws of Mesopotamia, including the Code of Hammurabi, contain restrictions against same-sex unions despite the fact that marriages are otherwise well regulated\n \n Same-Sex Unions throughout Time: A History of Gay Marriage\n \n And also according to you there was NO gay Marriage in ancient Rome and Greece.. \n \n Same-sex marriage was outlawed on December 16, 342 AD by the Christian emperors Constantius II and Constans. This law specifically outlaws marriages between men and reads as follows:When a man marries and is about to offer himself to men in womanly fashion [quum vir nubit in feminam viris porrecturam], what does he wish, when sex has lost all its significance; when the crime is one which it is not profitable to know; when Venus is changed to another form; when love is sought and not found? We order the statutes to arise, the laws to be armed with an avenging sword, that those infamous persons who are now, or who hereafter may be, guilty may be subjected to exquisite punishment. (Theodosian Code 9.7.3)\n \n If Gay Marriage was as \"Uncommon\" as you say it was there would have been NO NEED to pass a Law Barring it in the first place. There are historically recorded Gay Marriages in many parts of the world. Ancient Rome and Greece among them. It doesn't matter if they were \" Socially Accepted\" or not, they were not against the Law until religion made it so.\n\n \n If these ancient gay 'marriages' were the lifelong exclusive union of two homosexuals without either of them having sex outside of the marriage then I would agree that there were true gay marriages in ancient time..but they were not were they?\n You still seem to confuse gay unions or relationships with marriage.", 
   {}, 
   424432, 
   null, 
   1298295960.0
  ], 
  [
   424461, 
   null, 
   "Sigma", 
   "Before DOMA, the Government of the United States Did not have the Authority to define or Regulate Marriage. The Constitution Gave the states that Authority. \n [...]\n Meaning that if you get Married in One state, any other state must recognize that Marriage \n\n \n There, right there. That's contradictory. If there is only one standard of marriage that every State must follow, then States do not have the authority to regulate marriage for their own citizens. Xcaliber, the Full Faith and Credit clause has never been interpreted as you suggested. Even before doma they dismissed homosexual marriage challenges as having no Federal question they would need to address. That means marriage definitions are up to the States. You must one day realize that SCOTUS does not and has never agreed with your point of view. Just look at polygamous marriages that were legal in States like Utah. Other States certainly were not forced to recognize them.\n \n Unless you can find any actual evidence besides your interpretation of that clause, you have no support for your argument. You've simply ignored direct statements from multiple sources saying that States have nearly full and complete authority over marriage definitions for their own citizens.\n \n \nThe Supreme Court has not ruled on DOMA, they have so far refused to hear the Case.\n\n \n Why in the world would they? Even the federal judge that I quoted to you wasn't ruling directly on homosexual marriage, otherwise he could not have made any decision regarding doma (because of SCOTUS precedent, no federal judge has ruled on homosexual marriage). SCOTUS has already dismissed claims that differences in marriage definitions regarding homosexual marriage was an issue they can rule on, even before doma existed.\n \n Can you do something for me? Tell me what \"sovereignty\" means in this sentence: DOMA plainly intrudes on a core area of state sovereignty&#8212;the ability to define the marital status of its citizens.", 
   {}, 
   424454, 
   null, 
   1298297400.0
  ], 
  [
   424466, 
   null, 
   "Easyrider", 
   "Although state-recognized same-sex unions are becoming more accepted, there is a long history of same-sex unions around the world. Various types of same-sex unions have existed, ranging from informal, unsanctioned, and temporary relationships to highly ritualized unions that have included marriage\n \n\n \n Adultery's been around a long time too, as has pedophilia. Like illicit gay sex, they're all sins and a scourge to mankind. \n \n Come out of Sodom. Come out of Gomorrah. Repent of your doctrines of the devil.", 
   {}, 
   424421, 
   null, 
   1298298540.0
  ], 
  [
   424486, 
   null, 
   "Xcaliber", 
   "Unless you can find any actual evidence besides your interpretation of that clause, you have no support for your argument. You've simply ignored direct statements from multiple sources saying that States have nearly full and complete authority over marriage definitions for their own citizens.\n\n \n It is not MY interpretation of the Law, it is what the LAW SAYS...\n \n Once again...\n \n \nThe Full Faith and Credit Clause-Article IV, Section 1, of the U.S. Constitution-provides that the various states must recognize legislative acts, public records, and judicial decisions of the other states within the United States. It states that \"Full Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State.\" The statute that implements the clause, 28 U.S.C.A. § 1738, further specifies that \"a state's preclusion rules should control matters originally litigated in that state.\" The Full Faith and Credit Clause ensures that judicial decisions rendered by the courts in one state are recognized and honored in every other state. It also prevents parties from moving to another state to escape enforcement of a judgment or to re-litigate a controversy already decided elsewhere, a practice known as forum shopping.\n\n \n Notice the Clause reads :provides that the various states must recognize legislative acts, public records, and judicial decisions of the other states within the United States.\n \n Marriage is a matter of PUBLIC RECORD.. and under the Constitution Public records from one state MUST BE RECOGNIZED in other states . Virginia can Pass a Law Banning Gay Marriage in THEIR state. That Law would only apply to Citizens of the State of Virginia. In Massachusetts Gay Marriage is not banned so a Couple who is Married in Massachusetts Can go to Virginia and Virginia MUST RECOGNIZE that Marriage as Legally Binding...\n \n Now that was BEFORE DOMA.. \n \n The Full Faith and Credit Clause has also been invoked to recognize the validity of a marriage. Traditionally, every state honored a marriage legally contracted in any other state. \n \n However, in 1993, the Hawaii Supreme Court held that Hawaii's statute restricting legal marriage to parties of the opposite sex establishes a sex-based classification, which is subject to Strict Scrutiny if challenged on Equal Protection grounds (Baehr v. Lewin, 852 P.2d 44, 74 Haw. 530). Although the court did not recognize a constitutional right to same-sex marriage, it raised the possibility that a successful equal protection challenge to the state's marriage laws could eventually lead to state-sanctioned same-sex marriages.\n \n Basically in 1993 the Hawaii Supreme Court held that barring a same sex Marriage Established a Sex Based Classification.. And thus denying this group the right to marry would go against the Equal Protection Laws of the State Constitution.\n \n  In response to the Baehr case, Congress in 1996 passed the Defense of Marriage Act (110 Stat. § 2419), which defines marriage as a union of a man and a woman for federal purposes and expressly grants states the right to refuse to recognize a same-sex marriage performed in another state.\n \n In response.. This means in layman terms that the religious zealots got scared that the Hawaii Court Decision might eventually lead to gay marriage in every state so Congress took it upon themselves without proper constitutional power and passed DOMA.. which in effect removed the States from the Obligation to Follow The Full Faith and Credit Clause.\n \n \nFurther reading...\n Hamilton, Heather. 1998. \"The Defense of Marriage Act: A Critical Analysis of Its Constitutionality Under the Full Faith and Credit Clause.\" DePaul Law Review \n Hasegawa, Kaleen S. 1999. \"Re-Evaluating the Limits of the Full Faith and Credit Clause.\" University of Hawaii Law Review\n Shuki-Kunze, Jennie R. 1998. \"The 'Defenseless' Marriage Act: The Constitutionality of the Defense of Marriage Act as an Extension of Congressional Power Under the Full Faith and Credit Clause.\n\n \n And just to clear things up here's another source for the Definition of the Full Faith and Credit Clause..\n \n Full faith and Credit Clause Law & Legal Definition\n \n \nArticle IV, Section 1 of the US Constitution contains what is known as the Full Faith and Credit Clause. This clause requires all States in the US to recognize and give effect to the legislation, public records and judicial decisions of other Sates in the US. It states that each State should grant full faith and credit to the laws, public records and judicial decisions of every other state in the US. The clause ensures that the judicial decisions of other States are recognized by a State. This also ensures that individuals do not migrate to other states in order to escape a court judgment in another State. \n\n \n Conclusion.. Banning Gay Marriage is UNCONSTITUTIONAL.\n \n \n\n no federal judge has ruled on homosexual marriage\n\n \n On October 10, 2008, the Connecticut Supreme Court overturned the state's civil-unions statute (2005), as unconstitutionally discriminating against same-sex couples, and required the state to recognize same-sex marriages.\n \n In July 2010, a federal court held key provisions of DOMA unconstitutional\n \n On May 15, 2008, the California Supreme Court ruled that same-sex couples should have the right to marry.\n \n In October 2008, the Connecticut Supreme Court ruled that a ban against same-sex marriage was in violation of the equal protection clause in the state constitution.\n \n In April 2009, the Iowa Supreme Court ruled that the state's ban against same-sex marriage was unconstitutional.\n \n In Nov. 2003, the Massachusetts Supreme Judicial Court ruled that barring same-sex couples from civil marriage was unconstitutional.\n \n In August 2010, a federal district judge in California ruled that the Proposition 8 ban on same-sex marriages (passed in 2008) violated the equal protection provisions of the U.S. Constitution.\n \n Yes, Several Federal Judges have ruled on the subject of Gay Marriage. In most every case they find banning Gay Marriage is UNCONSTITUTIONAL.\n \n And for Your Information The Supreme Court HAS NO RULING, they have so far simply refused to hear the Case.", 
   {
    "unicode_changes_made": true
   }, 
   424461, 
   null, 
   1298318700.0
  ], 
  [
   424489, 
   null, 
   "Sigma", 
   "It is not MY interpretation of the Law, it is what the LAW SAYS...\n\n \n If you can show me that it has been applied as you say it is applied, it certainly would show some support for your interpretation.\n \n If you have no evidence, then it is merely your speculation. None of what you posted is that evidence, it is just your reasoning for your position... but that isn't sufficient proof when there is actual evidence that the opposite is true. I have shown you several sources, even a pro-homosexual publication, that reports decisions that directly say that States have the power you do not accept they have. Even before doma.\n \n \nOn October 10, 2008, the Connecticut Supreme Court[...]\n\n \n Yes, State courts can rule directly on the issue, but Federal courts cannot. Federal courts can only rule on technical applications of the law like part of doma that restricted joint filing. However, you are ignoring that same ruling stated that States have sovereignty over marriage definition. The Prop 8 ruling was another technical ruling on whether it conflicts with the State contitution. Neither can directly address the homosexual marriage issue because the case already went to SCOTUS and was dismissed for lack of a Federal issue to rule on.\n \n \nAnd for Your Information The Supreme Court HAS NO RULING, they have so far simply refused to hear the Case.\n\n \n No, they dismissed the case for lack of a Federal issue to rule on, which is different. The fact that the case came to them through mandatory appeal means the decision creates a precedent that has controlled decisions in Federal courts and some State courts.", 
   {}, 
   424486, 
   null, 
   1298321760.0
  ], 
  [
   424495, 
   null, 
   "Xcaliber", 
   "If you can show me that it has been applied as you say it is applied, it certainly would show some support for your interpretation.\n \n\n \n I have shown you evidence, the evidence is in the Constitution and the interpretation of the Law as Pointed out in the two definitions I showed you. \n \n \n\n If you have no evidence, then it is merely your speculation. None of what you posted is that evidence, it is just your reasoning for your position... but that isn't sufficient proof when there is actual evidence that the opposite is true. I have shown you several sources, even a pro-homosexual publication, that reports decisions that directly say that States have the power you do not accept they have. Even before doma.\n\n \n And no, before DOMA states did not have the Authority to Ignore Marriage Laws from other States. If they did then they were in violation of the Constitution .\n \n \n\n Yes, State courts can rule directly on the issue, but Federal courts cannot. Federal courts can only rule on technical applications of the law like part of doma that restricted joint filing. However, you are ignoring that same ruling stated that States have sovereignty over marriage definition. The Prop 8 ruling was another technical ruling on whether it conflicts with the State contitution. Neither can directly address the homosexual marriage issue because the case already went to SCOTUS and was dismissed for lack of a Federal issue to rule on.\n\n \n Wrong again.. A FEDERAL judge ruled Prop 8 unconstitutional. By Passing DOMA the Government made Gay Marriage a Federal Issue so any Federal Court who wants can hear a case and make a ruling.\n \n \n\n No, they dismissed the case for lack of a Federal issue to rule on, which is different. The fact that the case came to them through mandatory appeal means the decision creates a precedent that has controlled decisions in Federal courts and some State courts.\n\n \n No The United States Supreme Court has not ruled on how (if at all) these laws are affected by the Full Faith and Credit Clause. However, in August 2007, a federal appeals court held that the clause did require Oklahoma to recognize adoptions by same-sex couples which were finalized in other states.\n \n The Supreme court did not dismiss the case, they have made no such ruling. As of today they have simply refused to hear the case.", 
   {}, 
   424489, 
   null, 
   1298325900.0
  ], 
  [
   424507, 
   null, 
   "Sigma", 
   "I have shown you evidence, the evidence is in the Constitution and the interpretation of the Law as Pointed out in the two definitions I showed you. \n [...]\n And no, before DOMA states did not have the Authority to Ignore Marriage Laws from other States. If they did then they were in violation of the Constitution .\n\n \n Read the Massachusetts decision in the links I provided to you.\n \n State control over marital status determinations is a convention rooted in the early history of the United States, predating even the American Revolution. Indeed, the field of domestic relations was regarded as such an essential element of state power that the subject of marriage was not even broached at the time of the framing of the Constitution. And, as a consequence of continuous local control over marital status determinations, what developed was a checkerboard of rules and restrictions on the subject that varied widely from state to state, evolving throughout American history. Despite the complexity of this approach, prior to DOMA, every effort to establish a national definition of marriage met failure, largely because politicians fought to guard their states' areas of sovereign concern. The history of the regulation of marital status determinations therefore suggests that this area of concern is an attribute of state sovereignty, which is \"truly local\" in character.\n \n Emphasis added.\n \n You can certainly claim that the States have been exercising illegal authority from the formation of the union, but you have not provided any factual evidence to refute my claim that the application of the law has been that States have the authority to define marriage.\n \n I've already cited Baker v Nelson, which was decided before doma, that created the precedent that homosexual marriage, directly, is a State issue.\n \n \n\n No The United States Supreme Court has not ruled on how (if at all) these laws are affected by the Full Faith and Credit Clause. However, in August 2007, a federal appeals court held that the clause did require Oklahoma to recognize adoptions by same-sex couples which were finalized in other states.\n \n The Supreme court did not dismiss the case, they have made no such ruling. As of today they have simply refused to hear the case.\n\n \n Read Baker v. Nelson. It was a SCOTUS decision that dismissed a mandatory appeal on homosexual marriage. It was a summary dismissal based on the merits of the case, and it established a precedent.\n \n In Morrison v. Sandler and Wilson v. Ake in 2005 and Citizens for Equal Protection v. Bruning in 2006, Federal judges had rejected claims that precluding homosexual marriage violated the US Constitution based upon the Baker precedent.", 
   {
    "unicode_changes_made": true
   }, 
   424495, 
   null, 
   1298330880.0
  ], 
  [
   424511, 
   null, 
   "Xcaliber", 
   "\n Emphasis added.\n You can certainly claim that the States have been exercising illegal authority from the formation of the union, but you have not provided any factual evidence to refute my claim that the application of the law has been that States have the authority to define marriage.\n\n \n I have not disputed this fact. Yes State Have the Sole Authority to Regulate Marriage, they always Have . The Federal Government Did Not and Does not have the Authority to Define Marriage, this is why DOMA is Unconstitutional. \n \n A State Can Regulate and Define Marriage IN THEIR OWN STATE. They do, and always have had this authority. However, According to the Constitution Prior To DOMA they were Obligated by LAW to recognize Marriage and other Civil Laws of Other States. DOMA release them from this Obligation.", 
   {}, 
   424507, 
   null, 
   1298333220.0
  ], 
  [
   424517, 
   null, 
   "Sigma", 
   "A State Can Regulate and Define Marriage IN THEIR OWN STATE. They do, and always have had this authority. However, According to the Constitution Prior To DOMA they were Obligated by LAW to recognize Marriage and other Civil Laws of Other States. DOMA release them from this Obligation.\n\n \n When you move from State to State you are subject to the law of the State in which you currently reside. Since the State you are in has full authority to define marriage, your marriage is subject to the definitions of the State you currently are in. If you have evidence that shows differently, please provide it.\n \n It has always been part of State authority to define marriage in this way. At least in application.\n \n See Ankenbrandt v. Richards: \"No one denies that the States, at the time of the adoption of the Constitution,possessed full power over the subject of marriage and divorce [and that] the Constitution delegated no authority to the Government of the United States on [that subject].\"\n \n See Elk Grove Unified Sch. Dist. v. Newdow: \"that '[t]he whole subject of the domestic relations of husband and wife, parent and child, belongs to the laws of the States and not to the laws of the United States\"\n \n See Massachusetts, which I already quoted: \"Despite the complexity of this approach, prior to DOMA, every effort to establish a national definition of marriage met failure, largely because politicians fought to guard their states' areas of sovereign concern. The history of the regulation of marital status determinations therefore suggests that this area of concern is an attribute of state sovereignty, which is \"truly local\" in character.\"\n \n They all agree that State control has existed since the Constitution was adopted and has continued mostly unbroken to present day. That last quotation specifically says that prior to doma the various States had different marriage definitions and the Constitution does not give the Federal gov't the power to regulate marriage... and that necessarily includes the Full Faith and Credit clause. At least, that's how it has always been applied.", 
   {
    "unicode_changes_made": true
   }, 
   424511, 
   null, 
   1298335080.0
  ], 
  [
   424518, 
   null, 
   "Xcaliber", 
   "When you move from State to State you are subject to the law of the State in which you currently reside. Since the State you are in has full authority to define marriage, your marriage is subject to the definitions of the State you currently are in. If you have evidence that shows differently, please provide it.\n \n It has always been part of State authority to define marriage in this way. At least in application.\n \n See Ankenbrandt v. Richards: \"No one denies that the States, at the time of the adoption of the Constitution,possessed full power over the subject of marriage and divorce [and that] the Constitution delegated no authority to the Government of the United States on [that subject].\"\n \n See Elk Grove Unified Sch. Dist. v. Newdow: \"that '[t]he whole subject of the domestic relations of husband and wife, parent and child, belongs to the laws of the States and not to the laws of the United States\"\n \n See Massachusetts, which I already quoted: \"Despite the complexity of this approach, prior to DOMA, every effort to establish a national definition of marriage met failure, largely because politicians fought to guard their states' areas of sovereign concern. The history of the regulation of marital status determinations therefore suggests that this area of concern is an attribute of state sovereignty, which is \"truly local\" in character.\"\n \n They all agree that State control has existed since the Constitution was adopted and has continued mostly unbroken to present day. That last quotation specifically says that prior to doma the various States had different marriage definitions and the Constitution does not give the Federal gov't the power to regulate marriage... and that necessarily includes the Full Faith and Credit clause. At least, that's how it has always been applied.\n\n \n No, sorry but you are simply misguided in your interpretation of the Law. Marriage is a CIVIL union. Prior to DOMA states had to recognize these Civil Unions from other states, it's in the Constitution. I'm not going to post the Evidence again because you continuously ignore the facts in front of you. \n \n I know the states have the power concerning Marriage, I NEVER SAID THEY DIDN'T. that's why DOMA is unconstitutional. The Federal Government Overstepped it's Boundaries. DOMA also released the States from recognizing same sex marriages performed in other states. That is Also unconstitutional. \n \n Article 4 section 2 of the Constitution States..\n The Citizens of each State shall be entitled to all Privileges and Immunities of Citizens in the several States. \n \n This means that States MUST recognize the Privileges awarded to a Citizen in their HOME state. This is the Clause that DOMA tramples on therefore making it unconstitutional.", 
   {
    "unicode_changes_made": true
   }, 
   424517, 
   null, 
   1298335920.0
  ], 
  [
   424519, 
   null, 
   "Sigma", 
   "No, sorry but you are simply misguided in your interpretation of the Law. Marriage is a CIVIL union. Prior to DOMA states had to recognize these Civil Unions from other states, it's in the Constitution. I'm not going to post the Evidence again because you continuously ignore the facts in front of you. \n\n \n I'm not interpretting the law or even quoting the law. I'm showing court cases that tell us how the law is being practically applied. I'm showing how SCOTUS is interpretting the Constitution. I have shown specific evidence that clearly states that States can define marriage for their own citizens even prior to doma.\n \n \nI know the states have the power concerning Marriage, I NEVER SAID THEY DIDN'T. \n [...] DOMA also released the States from recognizing same sex marriages performed in other states. That is Also unconstitutional. \n\n \n When you say States have to recognize other State's marriage definition, you are saying that States lack the power to define marriage within their own borders. You are contradicting yourself.\n \n Please provide evidence for your claim that States were forced by the Federal gov't, any of the branches, by legislation or court case, to recognize each other's definitions. If there is no evidence then what you have is speculation.", 
   {}, 
   424518, 
   null, 
   1298336400.0
  ], 
  [
   424534, 
   null, 
   "Xcaliber", 
   "When you say States have to recognize other State's marriage definition, you are saying that States lack the power to define marriage within their own borders. You are contradicting yourself.\n\n Ok, Let me try this again. I NEVER said the states do not have the Authority To Define Marriage in their own state. They have ALWAYS had that Authority, The Federal Government did not. \n Now, Before DOMA there is a clause in the 4th Amendment of the Constitution Called the Full Faith and Credit Clause. \n \n Here it is AGAIN...\n \n The Full Faith and Credit Clause-Article IV, Section 1, of the U.S. Constitution-provides that the various states must recognize legislative acts, public records, and judicial decisions of the other states within the United States. It states that \"Full Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State.\" The statute that implements the clause, 28 U.S.C.A. § 1738, further specifies that \"a state's preclusion rules should control matters originally litigated in that state.\" The Full Faith and Credit Clause ensures that judicial decisions rendered by the courts in one state are recognized and honored in every other state. It also prevents parties from moving to another state to escape enforcement of a judgment or to re-litigate a controversy already decided elsewhere, a practice known as forum shopping.\n \n Check the Bold text. Now this simply means that a State has to recognize Judicial Acts from other states. So if a state Like Vermont Passes a LAW allowing Gay Marriage.. Then Every other State In the Union is bound by the Constitution to recognize the Vermont Decision. It also means if a Gay couple is Married in Vermont, then All the other States have to Recognize that marriage as being Legal and Binding. This in no way over rides the States ability to Define Marriage IN THEIR OWN STATE. \n \n Now..\n \n The Full Faith and Credit Clause has also been invoked to recognize the validity of a marriage. Traditionally, every state honored a marriage legally contracted in any other state. However, in 1993, the Hawaii Supreme Court held that Hawaii's statute restricting legal marriage to parties of the opposite sex establishes a sex-based classification, which is subject to STRICT SCRUTINY if challenged on EQUAL PROTECTION grounds (Baehr v. Lewin, 852 P.2d 44, 74 Haw. 530). Although the court did not recognize a constitutional right to same-sex marriage, it raised the possibility that a successful equal protection challenge to the state's marriage laws could eventually lead to state-sanctioned same-sex marriages. In response to the Baehr case, Congress in 1996 passed the Defense of Marriage Act (110 Stat. § 2419), which defines marriage as a union of a man and a woman for federal purposes and expressly grants states the right to refuse to recognize a same-sex marriage performed in another state.\n \n States ( in the Past ) have traditionally honored Marriages performed in other states. When The Federal Government passed DOMA in 96 it put an end to that. DOMA protects States from honoring Gay Marriages performed in other states. \n \n DOMA was passed by the Federal Government, who did not have the Authority to define Marriage. DOMA is unconstitutional. When/If Doma is repealed then the States will once again fall under the Full Faith and Credit Clause and they will be forced to honor out of State marriage.", 
   {
    "unicode_changes_made": true
   }, 
   424519, 
   null, 
   1298344920.0
  ], 
  [
   424535, 
   null, 
   "Easyrider", 
   "Ok, Let me try this again. I NEVER said the states do not have the Authority To Define Marriage in their own state. They have ALWAYS had that Authority, The Federal Government did not. \n Now, Before DOMA there is a clause in the 4th Amendment of the Constitution Called the Full Faith and Credit Clause. \n \n Here it is AGAIN...\n \n The Full Faith and Credit Clause-Article IV, Section 1, of the U.S. Constitution-provides that the various states must recognize legislative acts, public records, and judicial decisions of the other states within the United States. \n\n \n Great. Then the pro gay sex marriage states have to recognize the legislative acts, public records, and judicial decisions of the states that forbid gay marriages. \n \n gay sex is an abomination according to the Lord God Almighty.", 
   {
    "unicode_changes_made": true
   }, 
   424534, 
   null, 
   1298345640.0
  ], 
  [
   424537, 
   null, 
   "Xcaliber", 
   "Great. Then the pro gay sex marriage states have to recognize the legislative acts, public records, and judicial decisions of the states that forbid gay marriages. \n\n \n Yeah it goes both ways, however the states already recognize Out of State Marriages as long as it's a man and a Woman.. that's why it's unconstitutional. The States as well as the Feds are denying rights to a specific group of people, which is against the constitution...\n \n Eating Shellfish is a Sin too but I don't hear you complaining about that one.", 
   {}, 
   424535, 
   null, 
   1298353380.0
  ], 
  [
   424540, 
   null, 
   "Sigma", 
   "\n States ( in the Past ) have traditionally honored Marriages performed in other states. When The Federal Government passed DOMA in 96 it put an end to that. DOMA protects States from honoring Gay Marriages performed in other states. \n\n \n States traditionally did, but that also implies that they were under no obligation to (which was also true in fact, as the laws were applied. See: polygamy). If States were free to define marriage within their own borders then doma did not change anything in that regard. And amazingly enough that reasoning is exactly what judges have said in the links I've given you.\n \n However, if you provide proof beyond your supposition about the interpretation of that clause, then we can certainly entertain the notion.\n \n \n\n DOMA was passed by the Federal Government, who did not have the Authority to define Marriage. DOMA is unconstitutional. When/If Doma is repealed then the States will once again fall under the Full Faith and Credit Clause and they will be forced to honor out of State marriage.\n\n \n Show me any court case or legislation that forced States to honor out of State marriages. That certainly was not the case when polygamy was legal in certain States and not others. I've posted many credible sources that have said the exact opposite to what you suppose.", 
   {}, 
   424534, 
   null, 
   1298355420.0
  ], 
  [
   424541, 
   null, 
   "Sigma", 
   "Yeah it goes both ways, however the states already recognize Out of State Marriages as long as it's a man and a Woman\n\n \n Not if it conflicts with their age-of-consent laws. Or at least, it's within their authority to.\n \n It's exactly as constitutional as the State not allowing homosexual marriage within their borders. Out of State has nothing to do with it because the State has authority over defining marriage within its borders.", 
   {}, 
   424537, 
   null, 
   1298356860.0
  ], 
  [
   424542, 
   null, 
   "Xcaliber", 
   "\n It's exactly as constitutional as the State not allowing homosexual marriage within their borders. Out of State has nothing to do with it because the State has authority over defining marriage within its borders.\n\n \n Yeah it does, for the Citizens of that particular state. They can't define or regulate Marriages that took place OUTSIDE their state though, well not until DOMA was passed.... It's still Unconstitutional.", 
   {}, 
   424541, 
   null, 
   1298357100.0
  ], 
  [
   424543, 
   null, 
   "Sigma", 
   "Yeah it does, for the Citizens of that particular state. They can't define or regulate Marriages that took place OUTSIDE their state though, well not until DOMA was passed.... It's still Unconstitutional.\n\n \n Before doma and after is the same as far as State power is concerned, doma just codified what was already there by precedent ... and you're right, one State cannot regulate another State's marriage definition. However, when the couple relocates to another State, they are subject to the laws of that new State, not their old State. That includes the definition of marriage for that State.\n \n It's not unconstitutional according the the US Constitution until and unless SCOTUS reverses their Baker decision. Practically speaking, at least.", 
   {}, 
   424542, 
   null, 
   1298357340.0
  ], 
  [
   424545, 
   null, 
   "Xcaliber", 
   "Before doma and after is the same as far as State power is concerned... and you're right, one State cannot regulate another State's marriage definition. However, when the couple relocates to another State, they are subject to the laws of that new State, not their old State. That includes the definition of marriage for that State.\n\n \n Currently yes you are right, however that is the part that will eventually be changed. If a straight Couple from Texas Moves to Arkansas then Arkansas currently accepts their Marriage as being Valid and they are awarded the Privileges of Marriage according to the State... If a Gay Couple Moves to Arkansas that was Married In Vermont they are suddenly not married anymore because Arkansas has banned Gay Marriage. That's Discrimination. If you can't see the Unconstitutionality of that then You don't want to see it.", 
   {}, 
   424543, 
   null, 
   1298357700.0
  ], 
  [
   424546, 
   null, 
   "Sigma", 
   "Currently yes you are right, however that is the part that will eventually be changed. If a straight Couple from Texas Moves to Arkansas then Arkansas currently accepts their Marriage as being Valid and they are awarded the Privileges of Marriage according to the State... If a Gay Couple Moves to Arkansas that was Married In Vermont they are suddenly not married anymore because Arkansas has banned Gay Marriage. That's Discrimination. If you can't see the Unconstitutionality of that then You don't want to see it.\n\n \n That would depend on the State constitution of Arkansas. I'm no authority on that.", 
   {}, 
   424545, 
   null, 
   1298358000.0
  ], 
  [
   424697, 
   null, 
   "Matthew S", 
   "That would depend on the State constitution of Arkansas. I'm no authority on that.\n\n \n Remember that it works both ways. Iowa, Mass, Vermont, New Hampshire, Connecticut, and the DC could get XXXXXX off and say they will no longer recognize any marriage from any state that does not recognize all their marriages.\n \n So that Anti gay Texas couple traveling to Boston could find they are no longer married when the plane lands. He has a stroke then she finds she can't make medical decisions for her friend. Would love for the anti gay to be put in that situation.\n \n \n OH and BTW no one can get married in the state of Texas. In their hurry to ban gay marriage the voters banned all marriage. http://www.cbsnews.com/8301-503544_162-5700676-503544.html\n \n \n\"This state or a political subdivision of this state may not create or recognize any legal status identical or similar to marriage.\"\n Of course marriage is similar to marriage.", 
   {}, 
   424546, 
   null, 
   1298525460.0
  ], 
  [
   424698, 
   null, 
   "Sigma", 
   "Remember that it works both ways. Iowa, Mass, Vermont, New Hampshire, Connecticut, and the DC could get XXXXXX off and say they will no longer recognize any marriage from any state that does not recognize all their marriages.\n \n So that Anti gay Texas couple traveling to Boston could find they are no longer married when the plane lands. He has a stroke then she finds she can't make medical decisions for her friend. Would love for the anti gay to be put in that situation.\n\n \n Yes, that's true.\n \n I don't think we're in any danger of that, though. Trying to, essentially, blackmail other States to change their laws in this way would be a terrible day for State's rights.", 
   {}, 
   424697, 
   null, 
   1298526120.0
  ], 
  [
   424712, 
   null, 
   "Matthew S", 
   "Yes, that's true.\n \n I don't think we're in any danger of that, though. Trying to, essentially, blackmail other States to change their laws in this way would be a terrible day for State's rights.\n\n \n Why? You have taken the position time and time again that state law supersedes federal law so why not take it to its conclusion. I would love for for these anti gay congress people to have to live as second class citizens, even for one day in DC, as they are forcing gay people across the country.", 
   {}, 
   424698, 
   null, 
   1298553360.0
  ], 
  [
   424719, 
   null, 
   "Xcaliber", 
   "Yes, that's true.\n \n I don't think we're in any danger of that, though. Trying to, essentially, blackmail other States to change their laws in this way would be a terrible day for State's rights.\n\n \n Yeah Kind of like Anti-Gay states refusing to acknowledge Out of State Gay Marriages, Isn't that a \"Terrible\" day for States Rights?.. Isn't that Like a form of Blackmail? I can't wait until the Supreme Court finally decides to hear a case concerning this . Once they render their decision and FORCE every state to recognize the Constitutional Rights of Gay people that will be a GREAT day for America.", 
   {}, 
   424698, 
   null, 
   1298563740.0
  ], 
  [
   424740, 
   null, 
   "Sigma", 
   "Why? You have taken the position time and time again that state law supersedes federal law so why not take it to its conclusion. I would love for for these anti gay congress people to have to live as second class citizens, even for one day in DC, as they are forcing gay people across the country.\n\n \n I'm sure you would love that, but on a practical level I don't think it would happen.\n \n I don't think my position is that State law supercedes Federal law. I think my position is that Federal law doesn't prohibit States from having their own marriage definitions. There is no conflict.", 
   {}, 
   424712, 
   null, 
   1298590560.0
  ], 
  [
   424741, 
   null, 
   "Sigma", 
   "Yeah Kind of like Anti-Gay states refusing to acknowledge Out of State Gay Marriages, Isn't that a \"Terrible\" day for States Rights?.. Isn't that Like a form of Blackmail?\n\n \n No, since the States in question aren't trying to force other States to change their law. It is actually very proper for a State to assert it's own power within it's borders. If a State were using their power in a punative way against another State, though, that's another story.\n \n \nI can't wait until the Supreme Court finally decides to hear a case concerning this . Once they render their decision and FORCE every state to recognize the Constitutional Rights of Gay people that will be a GREAT day for America.\n\n \n They're already decided on a case, however. Or do you mean if they decide to reverse themselves?", 
   {}, 
   424719, 
   null, 
   1298590680.0
  ], 
  [
   424830, 
   null, 
   "Matthew S", 
   "No, since the States in question aren't trying to force other States to change their law. It is actually very proper for a State to assert it's own power within it's borders. If a State were using their power in a punitive way against another State, though, that's another story.\n\n \n So the states would be out of line if they decided to use the power within their own borders to say that they will not recognise any marriages from other states if those states do not recognize all their marriages? How is that different from Texas refusing to recognize marriages from Iowa?\n \n BTW no one can get a marriage license in the state of Texas. Texas voters have outlawed all marriages.", 
   {}, 
   424741, 
   null, 
   1298723880.0
  ], 
  [
   424834, 
   null, 
   "Easyrider", 
   " I can't wait until the Supreme Court finally decides to hear a case concerning this . Once they render their decision and FORCE every state to recognize the Constitutional Rights of Gay people that will be a GREAT day for America.\n\n \n Dream on, Snicklefritz. \n \n I'll tell you something else, too. I read an article that said our military troops are going to undergo gay sensitivity training. You can rest assured there will be great resentment over that in the ranks, and many who are openly gay will suffer the consequences. There will be divisions in the units. There's a lot of skinheads in the military and they're not going to like what's going on. We'll see the stories on that in due time.\n \n There will never be a time in America when the populace fully embraces illicit gay sex marriages. As long as the Word of God lives on in the hearts of decent, American patriots, your little circus side show will always be just that.", 
   {}, 
   424719, 
   null, 
   1298735940.0
  ], 
  [
   424837, 
   null, 
   "Xcaliber", 
   " \n As long as the Word of God lives on in the hearts of decent, American patriots, your little circus side show will always be just that.\n\n \n There's nothing Decent about denying people of their freedoms and/or discriminating against them because of who they are. You call yourself a \" Patriot\" yet you are the first one to trample on the constitution and the very freedom that REAL patriots fought and died for. There will NEVER be a time in America where everyone Embraces your invisible GOD.", 
   {}, 
   424834, 
   null, 
   1298737200.0
  ], 
  [
   424840, 
   null, 
   "Sigma", 
   "So the states would be out of line if they decided to use the power within their own borders to say that they will not recognise any marriages from other states if those states do not recognize all their marriages? How is that different from Texas refusing to recognize marriages from Iowa?\n \n\n \n If a State uses their authority to try to force another State to change their laws it would generally be out of line. It doesn't matter which direction it goes. Texas should not try to force any other State to change it's laws using this method.", 
   {}, 
   424830, 
   null, 
   1298753700.0
  ], 
  [
   424843, 
   null, 
   "Easyrider", 
   "There's nothing Decent about denying people of their freedoms and/or discriminating against them because of who they are. \n\n \n Well heck, then. Let's celebrate pedophiliacs!!\n \n \n\n You call yourself a \" Patriot\" yet you are the first one to trample on the constitution and the very freedom that REAL patriots fought and died for. There will NEVER be a time in America where everyone Embraces your invisible GOD. \n\n \n Dry up, woman. You never served in harm's way for the freedom of others. so what would you know?", 
   {}, 
   424837, 
   null, 
   1298762220.0
  ], 
  [
   424844, 
   null, 
   "Matthew S", 
   "If a State uses their authority to try to force another State to change their laws it would generally be out of line. It doesn't matter which direction it goes. Texas should not try to force any other State to change it's laws using this method.\n\n \n I don't see how one state would be forcing another state to do anything. If Iowa decides that Texas doesn't respect its laws then why should the Iowa respect any of Texas laws?", 
   {}, 
   424840, 
   null, 
   1298763420.0
  ], 
  [
   424845, 
   null, 
   "Xcaliber", 
   "Well heck, then. Let's celebrate pedophiliacs!!\n Dry up, woman. You never served in harm's way for the freedom of others. so what would you know?\n\n \n \n No one said anything about Pedos you sick puppy...\n \n And how would you know when and where I served, what did GOD tell you to say that?....", 
   {}, 
   424843, 
   null, 
   1298765040.0
  ], 
  [
   424873, 
   null, 
   "Sigma", 
   "I don't see how one state would be forcing another state to do anything. If Iowa decides that Texas doesn't respect its laws then why should the Iowa respect any of Texas laws?\n\n \n I thought, in our hypothetical here, that Iowa wasn't recognizing marriages from Texas in retaliation for Texas not recognizing homosexual marriages. The point of punitive measures is as a coersive influence to effect change. Otherwise why do it?\n \n However, targetting the citizens of one particular State would likely be in violation of the US Constitution. In this case the Full Faith and Credit clause would actually have application, since its purpose is to prevent the very thing you propose. Namely, excluding out of State citizens from fundamentally important services provided to the State's own citizens.\n \n To do what you propose, Iowa would have to not recognize heterosexual marriage from any other State.", 
   {}, 
   424844, 
   null, 
   1298795400.0
  ], 
  [
   424877, 
   null, 
   "Xcaliber", 
   "I thought, in our hypothetical here, that Iowa wasn't recognizing marriages from Texas in retaliation for Texas not recognizing homosexual marriages. The point of punitive measures is as a coersive influence to effect change. Otherwise why do it?\n \n However, targetting the citizens of one particular State would likely be in violation of the US Constitution. In this case the Full Faith and Credit clause would actually have application, since its purpose is to prevent the very thing you propose. Namely, excluding out of State citizens from fundamentally important services provided to the State's own citizens.\n \n To do what you propose, Iowa would have to not recognize heterosexual marriage from any other State.\n\n \n No they can choose to recognize one state and not another, they are doing it now. Under your Hypothetical Texas doesn't recognize a marriage from Iowa, so in turn Iowa could choose to not recognize marriages of any kind from Texas. You just got through not to long ago telling me the full faith and credit clause doesn't apply and now here you are using it to defend Texas.. The Fact is any state who does not recognize a gay Marriage from another state is in violation of the Full Faith and Credit Clause, plain and simple.", 
   {}, 
   424873, 
   null, 
   1298797260.0
  ], 
  [
   424879, 
   null, 
   "Sigma", 
   "No they can choose to recognize one state and not another, they are doing it now.\n\n \n How are they doing it now? Texas isn't singling Iowa out... Texas is not recognizing homosexual marriage from any State, as I understand it. If Texas said \"We recognize homosexual marriage from any State except Iowa\", then it would be singling out a certain State. \n \n If Iowa, in turn, tries to recognize marriages from any State except Texas, then it would likely be in violation of the Constitution.\n \n \n You just got through not to long ago telling me the full faith and credit clause doesn't apply and now here you are using it to defend Texas.. The Fact is any state who does not recognize a gay Marriage from another state is in violation of the Full Faith and Credit Clause, plain and simple.\n\n \n The purpose of the Full Faith and Credit clause isn't to say \"Any marriage recognized in this State must be honored in every State\". It's purpose is to say \"Any marriage we recognize for our own citizens must be recognized for any out-of-State citizens visiting our State\".\n \n It's to prevent discrimination in favor of a State's own citizen.", 
   {}, 
   424877, 
   null, 
   1298798640.0
  ], 
  [
   424884, 
   null, 
   "Matthew S", 
   "How are they doing it now? Texas isn't singling Iowa out... Texas is not recognizing homosexual marriage from any State, as I understand it. If Texas said \"We recognize homosexual marriage from any State except Iowa\", then it would be singling out a certain State. \n\n \n It is the same license at the top of my license it does not say Iowa Gay marriage it says STATE OF IOWA COUNTY RECORD CERTIFICATE OF MARRIAGE, just as every other license from Iowa. To deny my license which is identical to every other license from Iowa is unconstitutional.\n \n \n\n If Iowa, in turn, tries to recognize marriages from any State except Texas, then it would likely be in violation of the Constitution.\n\n \n Not with DOMA in place Iowa is well with in its power to decide what legal documents they will recognize from Texas and the ones they won't. That is what you have been preaching through out this thread.\n \n\n The purpose of the Full Faith and Credit clause isn't to say \"Any marriage recognized in this State must be honored in every State\". It's purpose is to say \"Any marriage we recognize for our own citizens must be recognized for any out-of-State citizens visiting our State\".\n \n It's to prevent discrimination in favor of a State's own citizen.\n\n \n The purpose of the full faith and credit clause is to even out the laws throughout the federation. It was designed to make sure that each state respected the laws of other states, otherwise there are 50 little sovereign nations and not one country. It has been traditional in this country, up until the Republinazis declared war on gay people, that if you were married in one state you were married in all states. Even the Lovings were considered married under federal law, even if Virgina arrested them and told them that they were an abomination before God.(sound familiar?)\n \n Smak Dem Christians Down Lyrics by Jay Spears\n \nSmak Dem Christians Down © 2006 Jay Spears Music ASCAP\n \n \"Almighty God created the races white, black, yellow, malay and red, and he placed them on separate continents. The fact that he separated the races shows that he did not intend for the races to mix.\" Virginia trial judge, 1959, ruling against interracial marriage.\n \n My mammy baptized me you bet I'm washed in the Blood of the Lamb\n But here's one thing I just don't get-who baptized Uncle Sam?\n Some folks say the USA was Christian from the start.\n But was George Washington a Christian?\n Was Thomas Jefferson a Christian?\n John Adams? Ben Franklin? \n Was Abe Lincoln a Christian?\n They separated Church and State which makes dem Christians frown,\n And on that day I'm glad to say they smaked dem Christians down!\n \n We gotta smak dem Christians down,\n Smack dem Christians down,\n On that day I'm glad to say they\n Smaked dem Christians smaked dem Christians\n Smaked dem Christians down.\n \n My daddy hails from Alabam' so the South is in my soul\n I know firsthand about Dixieland and one Christian judge's role. He said\n \"God made different races and gave them homes in separate places....\" \n So Black folk can't marry white folk, no! Black folk can't marry white folk!\n Colored can't marry white folk, no! Colored can't marry white folk!\n Nigras can't marry white folk, no! Nigras can't marry white folk! No! The Supreme Court heard it all and to their great renown,\n On that day I'm glad to say they smaked dem krackers down!\n \n We gotta smack dem Christians down,\n Smack dem Christians down,\n On that day I'm glad to say they\n Smaked dem Christians smaked dem Christians\n Smaked dem Christians down.\n \n Roll up the Bill of Rights and wap! wap! wap! 'em on the head.\n Keep your radical Christian agenda away from my gonadicals and my pudenda!\n \n I wish dem whacked-out Christian fools would learn from history\n Instead of tryin' to foist their bonehead rules on 'mos like me.\n If you wanna live in a theocracy maybe ya oughta move to Saudi Arabia.\n Is the U.S. Government Islamic? \n Is it Buddhist? Hindu? \n Jewish? Catholic? \n Is the U.S. Government Christian?\n So if dem Christians don't back off we'll run 'em outta town\n And on that day I'm glad to say we'll smak dem Christians down!\n \n We gotta Smak dem Christians down,\n Smak dem Christians down,\n On that day I'm glad to say we'll\n Smak dem Christians Smak dem Christians\n Smak dem Christians down.\n \n Amen.\n \n \n\n \n Or if you prefer\n YouTube - Jay Spears: SMAK DEM CHRISTIANS DOWN", 
   {
    "unicode_changes_made": true
   }, 
   424879, 
   null, 
   1298815800.0
  ], 
  [
   424885, 
   null, 
   "Sigma", 
   "It is the same license at the top of my license it does not say Iowa Gay marriage it says STATE OF IOWA COUNTY RECORD CERTIFICATE OF MARRIAGE, just as every other license from Iowa. To deny my license which is identical to every other license from Iowa is unconstitutional.\n\n \n My point was that Texas isn't picking on Iowa. They don't recognize homosexual marriages from any State. If Iowa, in turn, decides not to recognize marriages from Texas specifically, then it would run afoul of the Constitution I would think.\n \n \nNot with DOMA in place Iowa is well with in its power to decide what legal documents they will recognize from Texas and the ones they won't. That is what you have been preaching through out this thread.\n\n \n No, doma made explicit powers that States already had. The only real effect doma has is to prevent homosexual couples from filing joint Federal tax returns.\n \n \nThe purpose of the full faith and credit clause is to even out the laws throughout the federation. It was designed to make sure that each state respected the laws of other states, otherwise there are 50 little sovereign nations and not one country. It has been traditional in this country, up until the Republinazis declared war on gay people, that if you were married in one state you were married in all states. Even the Lovings were considered married under federal law, even if Virgina arrested them and told them that they were an abomination before God.(sound familiar?)\n\n \n Traditional but certainly not required. The Full Faith and Credit clause was definitely not intended to even out the laws across the Union... each State was absolutely meant to have it's own laws. If you read the Federalist and Anti-Federalist papers you'd see that what you propose here was feared at the time of the ratification of the Constitution. \n \n In no way were individual State laws meant to be abolished in favor of national laws. Think about it. The Fourteenth Amendment was needed to end individual State law in regards to slavery because the Federal Gov't didn't have much power over State law. \n \n The Full Faith and Credit clause was made to prevent people from fleeing a State to escape punishment. I don't know what your purpose was with the dig at Christianity.", 
   {}, 
   424884, 
   null, 
   1298823180.0
  ], 
  [
   424898, 
   null, 
   "Matthew S", 
   "My point was that Texas isn't picking on Iowa. They don't recognize homosexual marriages from any State. If Iowa, in turn, decides not to recognize marriages from Texas specifically, then it would run afoul of the Constitution I would think.\n\n \n And they would not be. They just are saying that if you want us to recognize your laws then you have to recognize ours. \n \n \n\n No, doma made explicit powers that States already had. The only real effect doma has is to prevent homosexual couples from filing joint Federal tax returns.\n \n \n \n Traditional but certainly not required. The Full Faith and Credit clause was definitely not intended to even out the laws across the Union... each State was absolutely meant to have it's own laws. If you read the Federalist and Anti-Federalist papers you'd see that what you propose here was feared at the time of the ratification of the Constitution. \n \n In no way were individual State laws meant to be abolished in favor of national laws. Think about it. The Fourteenth Amendment was needed to end individual State law in regards to slavery because the Federal Gov't didn't have much power over State law. \n \n The Full Faith and Credit clause was made to prevent people from fleeing a State to escape punishment. I don't know what your purpose was with the dig at Christianity.\n\n \n My dig is, the whole marriage debate is driven by religious hatred of gay people. It is religion that is driving this keep gays out of marriage movement. It is religions vile hatred of gay people that continues to fuel the fire of bigotry and hatred of gay people. Religion has been and continues to be at the very heart of every constitutional amendment and argument against same sex marriage, and my peoples civil rights. Every group or individual that has proposed any anti gay marriage legislation, constitutional amendment, or ballot initiative has been religiously based or has been heavily influenced that the narcotic of religion. Religion is my peoples greatest enemy and it is time to wipe the earth free of the delusion and evil that is religion. They want to put my civil rights on the ballot I say lets put theirs. How do you think the Mormons would fare in a ballot referendum to out law Mormonism. BTW no where in the constitution does it say that the people are not allowed to vote to outlaw religion.", 
   {}, 
   424885, 
   null, 
   1298835360.0
  ], 
  [
   424902, 
   null, 
   "Xcaliber", 
   "My point was that Texas isn't picking on Iowa. They don't recognize homosexual marriages from any State. If Iowa, in turn, decides not to recognize marriages from Texas specifically, then it would run afoul of the Constitution I would think.\n\n \n Ok you're right, they are not picking on Iowa, they are Picking on the 7 States that currently allow Gay Marriage. If they recognize a Marriage from Arkansas and then not recognize a marriage from Iowa or Vermont they are singling out a certain state and that is unconstitutional. \n \n \n\n No, doma made explicit powers that States already had. The only real effect doma has is to prevent homosexual couples from filing joint Federal tax returns.\n\n \n Wrong again, States did not have the Power to Define Marriage until DOMA was passed. DOMA was about way more than filing tax returns, it was about specifically denying rights to Gay people and is Unconstitutional to begin with because the Federal Government does not have the Authority to interfere with Marriage Laws. \n \n \n\n Traditional but certainly not required. The Full Faith and Credit clause was definitely not intended to even out the laws across the Union... each State was absolutely meant to have it's own laws. If you read the Federalist and Anti-Federalist papers you'd see that what you propose here was feared at the time of the ratification of the Constitution. \n \n \n The Full Faith and Credit Clause was intended to unite the States yet leave them sovereign to create their own Laws. If a Court Rules on a case in Texas then other states are required to recognize that ruling. Recognizing public records from other states was also a part of that . If Texas did not recognize the Marriage Laws of Arkansas then someone moving from Arkansas would have to Re-marry under Texas Law etc. Not recognizing Marriage Laws from States that have Gay Marriage goes against the Clause, but as long as DOMA is in effect the states are protected from that. Once DOMA is repealed the States will be forced to recognize Gay marriages from other states because the Constitution says they have to... \n \n \n\n In no way were individual State laws meant to be abolished in favor of national laws. Think about it. The Fourteenth Amendment was needed to end individual State law in regards to slavery because the Federal Gov't didn't have much power over State law. \n \n \n The States have the Power to make their own Laws but they have ALWAYS used the Constitution as a guideline. If a State creates a Law that goes against the Constitution the Federal Government has, and always has had, the power to overturn any state Law that they deemed unconstitutional. \n \n \n\n The Full Faith and Credit clause was made to prevent people from fleeing a State to escape punishment. I don't know what your purpose was with the dig at Christianity.\n\n \n It was also inclusive to the recognition of Public Records from other states. That's why you don't have to get a new drivers license every time you enter a new state. that's why a married couple can move from one state to the next without having to remarry under new Laws. Not recognizing gay marriages performed legally in a state that allows gay marriage is unconstitutional and you have no argument to disprove that fact.", 
   {}, 
   424885, 
   null, 
   1298837220.0
  ], 
  [
   424904, 
   null, 
   "Sigma", 
   "And they would not be. They just are saying that if you want us to recognize your laws then you have to recognize ours.\n\n \n That type of tit-for-tat arrangement is not legally supported, though. States are unable to give preferential treatment to their own citizens by denying out-of-State visitors the same protections they afford their own citizens. Within a certain amount of reason, at least. \n \n \nMy dig is, the whole marriage debate is driven by religious hatred of gay people. It is religion that is driving this keep gays out of marriage movement. \n\n \n No, homosexual marriage is denied for a variety of reasons. In CA, for example, black people overwhelmingly voted for Prop 8 and seemingly did so because they resented the implication that the homosexual issue was a civil rights issue. Others object to homosexual marriage on the basis of the cultural relevance of marriage that they want to preserve. \n \n Religion is a convenient scapegoat but your problems are much deeper than that.\n \n \nHow do you think the Mormons would fare in a ballot referendum to out law Mormonism. BTW no where in the constitution does it say that the people are not allowed to vote to outlaw religion.\n\n \n I'd say there isn't enough impetus in the country to outlaw any religion.", 
   {}, 
   424898, 
   null, 
   1298842620.0
  ], 
  [
   424908, 
   null, 
   "Sigma", 
   "Ok you're right, they are not picking on Iowa, they are Picking on the 7 States that currently allow Gay Marriage. If they recognize a Marriage from Arkansas and then not recognize a marriage from Iowa or Vermont they are singling out a certain state and that is unconstitutional.\n\n \n There is a substantial difference between saying \"No shirts no service\" and \"Jim isn't allowed in the store\". One is justifiable, the other is not. What Texas is essentially saying is the former, while a retaliatory action would be the latter. \n \n \nWrong again, States did not have the Power to Define Marriage until DOMA was passed. DOMA was about way more than filing tax returns, it was about specifically denying rights to Gay people and is Unconstitutional to begin with because the Federal Government does not have the Authority to interfere with Marriage Laws.\n\n \n Xcaliber, can you point to any case, any case at all, that used that clause to enforce anything besides the results of a judgement across State borders? Do you have any proof besides unsupported speculation? So far you haven't offered any. I cannot accept your claim without some sort of proof. Look at what SCOTUS says that clause means.\n \n \nThe Full Faith and Credit Clause was intended to unite the States yet leave them sovereign to create their own Laws. If a Court Rules on a case in Texas then other states are required to recognize that ruling. Recognizing public records from other states was also a part of that.\n\n \n Ok. So, if States are sovereign to create their own laws then they can create their own definition of marriage for use in their laws. If you say that a State must use the definitions of other States, then that State does not have sovereign power. It is contradictory to say that a State is sovereign while saying that the State cannot make up it's own marriage law. You're talking out of both sides of your mouth.\n \n The Full Faith and Credit clause only applies to judgements. It was created so if a person flees from one State to another the judgement still applies to them.\n \n \nIf Texas did not recognize the Marriage Laws of Arkansas then someone moving from Arkansas would have to Re-marry under Texas Law etc. Not recognizing Marriage Laws from States that have Gay Marriage goes against the Clause, but as long as DOMA is in effect the states are protected from that. Once DOMA is repealed the States will be forced to recognize Gay marriages from other states because the Constitution says they have to.\n\n \n Whether doma is there or not, States have always have sovereign power over marriage definitions. You have not shown one iota of proof otherwise. Only unsupported speculation that goes against SCOTUS case law.\n \n \nThe States have the Power to make their own Laws but they have ALWAYS used the Constitution as a guideline. If a State creates a Law that goes against the Constitution the Federal Government has, and always has had, the power to overturn any state Law that they deemed unconstitutional. \n\n \n Other way around. The State constitutions existed beforehand, and they influenced the wording of the US Constitution.\n \n The Federal government can only act with powers the Constitution grants it. Every other power belongs to the State and the people. The Constitution does not grant the Federal government the power to define marriage, nor to regulate marriage law the States create.", 
   {}, 
   424902, 
   null, 
   1298844300.0
  ], 
  [
   424909, 
   null, 
   "Matthew S", 
   "That type of tit-for-tat arrangement is not legally supported, though. States are unable to give preferential treatment to their own citizens by denying out-of-State visitors the same protections they afford their own citizens. Within a certain amount of reason, at least. \n \n \n \n No, homosexual marriage is denied for a variety of reasons. In CA, for example, black people overwhelmingly voted for Prop 8 and seemingly did so because they resented the implication that the homosexual issue was a civil rights issue. Others object to homosexual marriage on the basis of the cultural relevance of marriage that they want to preserve. \n\n \n That is a false assumption. Black bigots voted against gay civil rights in the same numbers per population as did their Hispanic, White, and Asian bigots. Bigots are bigots no matter the colour. Black people are influenced by their racist anti gay churches. I could point you to every person and group that proposed anti gay marriage measures and religion and disgusting vile religion and religious beliefs are behind them 100% of the time. Prove me wrong show me one group that proposed anti gay marriage meause that does not have a religious bases or thathas been influenced by religion.\n \n Here are the anti gay religious swine in the recent Maryland marriage hearings and right next to the religious bigot making the speech(he can shove his religion up his arse) sits the head swine sow Maggie Gallagher from NOM.\n \n YouTube - dwyer maryland hod\n \n \n\n Religion is a convenient scapegoat but your problems are much deeper than that.\n\n \n Religion is the great enemy of gay people and one of needs to back down and I can assure you that it will not be gay people.\n \n\n I'd say there isn't enough impetus in the country to outlaw any religion.\n\n \n \n \n As the atheist population grows society may just find the need to get rid of the narcotic called religion, sort of like looking at all religion as we do now look at the Greek Gods.", 
   {}, 
   424904, 
   null, 
   1298844960.0
  ], 
  [
   424910, 
   null, 
   "Xcaliber", 
   "Xcaliber, can you point to any case, any case at all, that used that clause to enforce anything besides the results of a judgement across State borders? Do you have any proof besides unsupported speculation? So far you haven't offered any. I cannot accept your claim without some sort of proof. Look at what SCOTUS says that clause means.\n\n \n I won't look them all up, but any married couple who has moved from one state to another, any person who has crossed state lines with their drivers license.. are all cases where one state recognizes public records from other states.. Scotus made their determination on a different matter and only to explain that situation. If a case about Gay Marriage were to be involved they would have explained how the Clause applies to Marriage Laws as well.\n \n \n \n\n Ok. So, if States are sovereign to create their own laws then they can create their own definition of marriage for use in their laws. If you say that a State must use the definitions of other States, then that State does not have sovereign power. It is contradictory to say that a State is sovereign while saying that the State cannot make up it's own marriage law. You're talking out of both sides of your mouth.\n\n \n No because the Constitution did not give the states Power to DEFINE marriage. States have to follow the Constitution, and because of the Constitution they can make their own Laws yes, but only if that Law doesn't go against the U.S. Constitution. Defining Marriage wasn't within their power, and wasn't until DOMA was passed to give them that power.\n \n \n\n The Full Faith and Credit clause only applies to judgements. It was created so if a person flees from one State to another the judgement still applies to them.\n\n \n Read the Constitution, it also applies to PUBLIC RECORDS, which means Marriage Licenses.\n \n \n\n Whether doma is there or not, States have always have sovereign power over marriage definitions. You have not shown one iota of proof otherwise. Only unsupported speculation that goes against SCOTUS case law.\n\n \n No they have not.. Show the evidence that they have?.. oh wait, you can't because before DOMA they didn't have that Power.\n \n \n\n Other way around. The State constitutions existed beforehand, and they influenced the wording of the US Constitution.\n\n \n lmao. that is so laughable. The States didn't even exists as states before, where did you learn history?.. The State Constitutions were Modeled AFTER , and in fact there are some states today that still don't have Constitutions.. You're graspi9ng at straws now..\n \n \n \n\n The Federal government can only act with powers the Constitution grants it. Every other power belongs to the State and the people. The Constitution does not grant the Federal government the power to define marriage, nor to regulate marriage law the States create.\n\n \n Wow, you finally are listening. I've told you this all along, that is why DOMA is unconstitutional, The Feds don't have the POWER to DEFINE Marriage. they did so with the passage of DOMA, and you yourself just agreed ...", 
   {}, 
   424908, 
   null, 
   1298845260.0
  ], 
  [
   424916, 
   null, 
   "Sigma", 
   "That is a false assumption. Black bigots voted against gay civil rights in the same numbers per population as did their Hispanic, White, and Asian bigots.\n\n \n Not from the data I saw. Black people voted disproportionately in favor of Prop 8. \n \n From here:\n \n Although many of the state's black political leaders spoke out against Proposition 8, an exit poll of California voters showed that black voters favored the measure by a ratio of more than 2 to 1. Not only was the black vote weighted heavily in favor of Proposition 8, but black turnout -- spurred by Barack Obama's historic campaign for president -- was unusually large, with African Americans making up roughly 10% of the state electorate.\n \n \nReligion is the great enemy of gay people and one of needs to back down and I can assure you that it will not be gay people.\n\n \n Religion certainly isn't friendly to what is considered \"unnatural\". I'm simply pointing out that resistance to proposals such as homosexual marriage has opposition other than just religious. I haven't once brought up religion, yet I'm arguing against your position, for example.", 
   {}, 
   424909, 
   null, 
   1298846820.0
  ], 
  [
   424918, 
   null, 
   "Matthew S", 
   "Not from the data I saw. Black people voted disproportionately in favor of Prop 8. \n \n From here:\n \n Although many of the state's black political leaders spoke out against Proposition 8, an exit poll of California voters showed that black voters favored the measure by a ratio of more than 2 to 1. Not only was the black vote weighted heavily in favor of Proposition 8, but black turnout -- spurred by Barack Obama's historic campaign for president -- was unusually large, with African Americans making up roughly 10% of the state electorate.\n \n\n Black people can be bigger bigots and racists then white people. Just because black people have historically been a oppressed people does not mean they can not be racist, homophobic bigots. Look at Uganda a majority black nation and they are going to, in the name of Jesus, execute gay people.\n It is the black churches that foster this hatred towards gay people.\n \n\n Religion certainly isn't friendly to what is considered \"unnatural\". I'm simply pointing out that resistance to proposals such as homosexual marriage has opposition other than just religious. I haven't once brought up religion, yet I'm arguing against your position, for example.\n\n \n Yet religion is at the heart of why you oppose same sex marriage. If not then why do you argue with me? You are socialized in a religiously bigoted society to believe that there is something wrong with gay people. If you don't believe that there is something wrong with gay people you would support our civil rights fight 100%. Yet you do not and religion is at the heart of it.", 
   {}, 
   424916, 
   null, 
   1298847420.0
  ], 
  [
   424920, 
   null, 
   "Sigma", 
   "I won't look them all up, but any married couple who has moved from one state to another, any person who has crossed state lines with their drivers license.. are all cases where one state recognizes public records from other states. Scotus made their determination on a different matter and only to explain that situation. If a case about Gay Marriage were to be involved they would have explained how the Clause applies to Marriage Laws as well.\n\n \n They did explain it when they said there was no Federal question regarding homosexual marriage. They were saying the Federal government is not involved. This was before doma, too, iirc.\n \n Yes, marriages are recognized from State to State, but you have not and, I daresay, cannot show anywhere a State being forced to. You have not shown that it is done for any reason other than convention and tradition.\n \n \nNo because the Constitution did not give the states Power to DEFINE marriage. States have to follow the Constitution, and because of the Constitution they can make their own Laws yes, but only if that Law doesn't go against the U.S. Constitution. Defining Marriage wasn't within their power, and wasn't until DOMA was passed to give them that power.\n\n \n The Constitution doesn't give States power. States (and the people) have every power and authority that isn't specifically given to the Federal government. The Tenth Amendment explicitly states that powers not granted to the Federal government nor prohibited to the states by the Constitution are reserved to the States or the people.\n \n Defining marriage is not a power the Federal government was granted, therefore that power belongs to the States.\n \n \nRead the Constitution, it also applies to PUBLIC RECORDS, which means Marriage Licenses.\n\n \n Public records for the purposes of judgements. The entire clause is meant to allow judgements across State lines. This was to distinguish State to State relationships from nation to nation relationships (no extradition treaties needed, etc). I can show you the reasoning of one of the early jurists, Joseph Story, who talked about that clause. He said much the same as I'm saying now.\n \n \nNo they have not.. Show the evidence that they have?.. oh wait, you can't because before DOMA they didn't have that Power.\n\n \n Yes, I can! Look at polygamy! It used to exist in some States, but other States were not forced to recognize them! Proof right there.\n \n \nlmao. that is so laughable. The States didn't even exists as states before, where did you learn history?.. The State Constitutions were Modeled AFTER , and in fact there are some states today that still don't have Constitutions.. You're graspi9ng at straws now..\n\n \n Uh... only if you ignore the Continental Congress and the Articles of Confederation. Individual States had their own governments before the Constitution. The States needed to ratify the new document, after all ... the entire Federalist/Antifederalist debate was whether to continue having a confederation of States or to form a national government.\n \n From here:\n \n Virginia was the first state to ratify on December 16, 1777, while other states ratified in 1778. When congress reconvened in June of 1778, the delegates learned that Maryland, Delaware and New Jersey refused to ratify the Articles. The Articles required unanimous approval from the states. These smaller states wanted other states to relinquish their western land claims before they would ratify the Articles, New Jersey and Delaware eventually agreed to the conditions of the Articles, with New Jersey ratifying them on Nov 20, 1778 and Delaware on Feb 1, 1779. This left Maryland as the last remaining holdout\n \n The Articles were a precursor to the Constitution.\n \n \nWow, you finally are listening. I've told you this all along, that is why DOMA is unconstitutional, The Feds don't have the POWER to DEFINE Marriage. they did so with the passage of DOMA, and you yourself just agreed ...\n\n \n Doma doesn't let the Federal government define marriage. Doma says, essentially, \"each State can decide for itself\". Since the Federal government didn't have the power to define marriage in the first place this automatically means that power was left to the States. So, logically, doma didn't change a damn thing.", 
   {}, 
   424910, 
   null, 
   1298848860.0
  ], 
  [
   424921, 
   null, 
   "Sigma", 
   "Black people can be bigger bigots and racists then white people. Just because black people have historically been a oppressed people does not mean they can not be racist, homophobic bigots. Look at Uganda a majority black nation and they are going to, in the name of Jesus, execute gay people.\n It is the black churches that foster this hatred towards gay people.\n\n \n Well, unless you think black people are just naturally religious bigots, it seems rational to say that opposition came from sources other than purely religious.\n \n \nYet religion is at the heart of why you oppose same sex marriage.\n\n \n Truly? What could possibly give you that impression? Just pointing out that I oppose you is begging the question.", 
   {}, 
   424918, 
   null, 
   1298849220.0
  ], 
  [
   424922, 
   null, 
   "Matthew S", 
   "Well, unless you think black people are just naturally religious bigots, it seems rational to say that opposition came from sources other than purely religious.\n \n \n \n Truly? What could possibly give you that impression? Just pointing out that I oppose you is begging the question.\n\n \n Why then why all the arguements against gay marriage?", 
   {}, 
   424921, 
   null, 
   1298849520.0
  ], 
  [
   424926, 
   null, 
   "Sigma", 
   "Why then why all the arguements against gay marriage?\n\n \n Because your legal reasoning is horribly flawed. \n \n On a more sentimental level, I think people like having meaningful relationships and find comfort in ancient ways and customs. Homosexuals gain no benefit from stripping that away from others.", 
   {}, 
   424922, 
   null, 
   1298850060.0
  ], 
  [
   424927, 
   null, 
   "Matthew S", 
   "Because your legal reasoning is horribly flawed. \n \n On a more sentimental level, I think people like having meaningful relationships and find comfort in ancient ways and customs. Homosexuals gain no benefit from stripping that away from others.\n\n \n What does that have to do with gay people gatting a piece of paper from the state?", 
   {}, 
   424926, 
   null, 
   1298850180.0
  ], 
  [
   424928, 
   null, 
   "Sigma", 
   "What does that have to do with gay people gatting a piece of paper from the state?\n\n \n It means that homosexual advocates garner no sympathy from me for what they're trying to do.\n \n Add to that your lack of legal justification and I'd say I'm justified in opposing your viewpoint.", 
   {}, 
   424927, 
   null, 
   1298850420.0
  ], 
  [
   424929, 
   null, 
   "Matthew S", 
   "It means that homosexual advocates garner no sympathy from me for what they're trying to do. It brings to mind an older bully purposely telling youngsters that there is no Santa Clause. The bully gains no benefit other than to hurt others. Not an exact analogy, but close enough for the purpose.\n \n Add to that your lack of legal justification and I'd say I'm justified in opposing your viewpoint.\n\n \n Again what does this have to do with gay people getting a piece of paper from the state?", 
   {}, 
   424928, 
   null, 
   1298850660.0
  ], 
  [
   424930, 
   null, 
   "Sigma", 
   "Again what does this have to do with gay people getting a piece of paper from the state?\n\n \n About as much as loving another person has to do with getting a piece of paper from the State, I guess :P", 
   {}, 
   424929, 
   null, 
   1298850720.0
  ], 
  [
   424935, 
   null, 
   "Xcaliber", 
   "They did explain it when they said there was no Federal question regarding homosexual marriage. They were saying the Federal government is not involved. This was before doma, too, iirc.\n Yes, marriages are recognized from State to State, but you have not and, I daresay, cannot show anywhere a State being forced to. You have not shown that it is done for any reason other than convention and tradition.\n\n \n Well I have, you just refuse to believe the evidence. You're so against Gay Marriage that you will never be convinced you are WRONG, but Just for kicks I will explain it again....\n \n DOMA Section 2, relieves states of a constitutional obligation to enforce judicial custody, alimony or other orders made in other states that involve recognition of same-sex marriages.\n \n Before DOMA the STATES did not have the Authority to disallow Marriages from other states, Period. Many States did pass Laws Defining Marriage in their State beginning in 1973 when Gay marriage first became an Issue. Prior to that No State had any Statue Defining Marriage as between a man and a Woman. They only did so because two men filed for a license and scared the bejebus out of all the religious zealots. \n \n \n \n\n The Constitution doesn't give States power. States (and the people) have every power and authority that isn't specifically given to the Federal government. The Tenth Amendment explicitly states that powers not granted to the Federal government nor prohibited to the states by the Constitution are reserved to the States or the people.\n\n \n Wrong again, the Constitution does Give the States certain Powers. Powers not granted to The Feds are defaulted to the States, including marriage Laws. But The States , Until DOMA , were required by LAW to recognize marriages from other states. It didn't become an issue until the 70's and that's when the States began drafting various bills to Define Marriage.\n \n \n\n Defining marriage is not a power the Federal government was granted, therefore that power belongs to the States.\n\n \n Yes I know, The Federal Government under the Constitution Does NOT have the Power to Define Marriage, yet they DID when they passed DOMA, which has already been Ruled Unconstitutional.\n \n \n\n Public records for the purposes of judgements. The entire clause is meant to allow judgements across State lines. This was to distinguish State to State relationships from nation to nation relationships (no extradition treaties needed, etc). I can show you the reasoning of one of the early jurists, Joseph Story, who talked about that clause. He said much the same as I'm saying now.\n\n \n Wrong yet again.. The Full Faith and Credit Clause applied to Public records as well.. Until the passage of DOMA.. Section 2 of DOMA specifically states...\n Section 2. Powers reserved to the states\n No State, territory, or possession of the United States, or Indian tribe, shall be required to give effect to any public act, record, or judicial proceeding of any other State, territory, possession, or tribe respecting a relationship between persons of the same sex that is treated as a marriage under the laws of such other State, territory, possession, or tribe, or a right or claim arising from such relationship.\n \n DOMA removed the States from the Full Faith and Credit Clause for the specific purpose to deny Gay Marriage. UNCONSTITUTIONAL.\n \n \n\n Yes, I can! Look at polygamy! It used to exist in some States, but other States were not forced to recognize them! Proof right there.\n\n \n We're not talking about Polygamy we're talking about Gay marriage, stop trying to change the subject . Polygamy was banned by the FEDERAL government, but I'm sure if we have a Polygamy Movement then they too can claim their rights are being violated.\n \n \n\n Uh... only if you ignore the Continental Congress and the Articles of Confederation. Individual States had their own governments before the Constitution. The States needed to ratify the new document, after all ... the entire Federalist/Antifederalist debate was whether to continue having a confederation of States or to form a national government.\n\n \n Until 1973, there was no definition of marriage in any statute in any US state. That means NO STATE . Marriage was Defined by State Governments starting in 1973 specifically to deny Gay marriage, before that no one cared.\n \n \n\n Virginia was the first state to ratify on December 16, 1777, while other states ratified in 1778. When congress reconvened in June of 1778, the delegates learned that Maryland, Delaware and New Jersey refused to ratify the Articles. The Articles required unanimous approval from the states. These smaller states wanted other states to relinquish their western land claims before they would ratify the Articles, New Jersey and Delaware eventually agreed to the conditions of the Articles, with New Jersey ratifying them on Nov 20, 1778 and Delaware on Feb 1, 1779. This left Maryland as the last remaining holdout\n\n \n You're talking about before the Union even existed. Each state had specific Laws, but they DID not have Constitutions. Once the U.S. constitution was ratified by all the states and became the Law of the Land the States had to Model their Own Laws to Fit into the Constitution, it wasn't the other way around like you think...\n \n \n\n Doma doesn't let the Federal government define marriage. Doma says, essentially, \"each State can decide for itself\". Since the Federal government didn't have the power to define marriage in the first place this automatically means that power was left to the States. So, logically, doma didn't change a damn thing.\n\n \n Wrong yet again.. I point you to DOMA section 3\n Section 3. Definition of marriage\n In determining the meaning of any Act of Congress, or of any ruling, regulation, or interpretation of the various administrative bureaus and agencies of the United States, the word 'marriage' means only a legal union between one man and one woman as husband and wife, and the word 'spouse' refers only to a person of the opposite sex who is a husband or a wife. \n \n DOMA is Unconstitutional, therefore section 2 which relieves the states from the Full Faith and Credit Clause is Unconstitutional as well. If the Federal Government repeals DOMA the States will once again be forced to recognize Marriages from Other states, Whether they want to or not. They may have a Constitution in Texas that bans Gay Marriage, but a gay couple Married in Vermont doesn't have to get married under Texas Law.", 
   {}, 
   424920, 
   null, 
   1298854980.0
  ], 
  [
   424942, 
   null, 
   "Sigma", 
   "Well I have, you just refuse to believe the evidence.\n\n \n Provide some and we'll talk ;) Simply quoting doma doesn't constitute evidence, sorry.\n \n \nWe're not talking about Polygamy we're talking about Gay marriage, stop trying to change the subject . Polygamy was banned by the FEDERAL government, but I'm sure if we have a Polygamy Movement then they too can claim their rights are being violated.\n\n \n You mean like this?\n \n They are not alone. The American Civil Liberties Union of Utah told the paper that it plans to back the group's challenge to Utah's bigamy law.\n \n \"Living arrangements are really the most intimate kinds of decisions people make,\" said ACLU of Utah Legal Director Stephen Clark. \"Talking to Utah's polygamists is like talking to gays and lesbians who really want the right to live their lives, and not live in fear because of whom they love. So certainly that kind of privacy expectation is something the ACLU is committed to protecting.\"\n \n But say, if the Federal government banned plural marriage then why can they not ban homosexual marriage?\n \n \nUntil 1973, there was no definition of marriage in any statute in any US state. That means NO STATE . Marriage was Defined by State Governments starting in 1973 specifically to deny Gay marriage, before that no one cared.\n\n \n Well, yes, statutes existed to establish the metes and bounds of a marriage. Afterall, you can't exactly apply for a marriage license if there were no regulations that provided for it. And people cared very much, otherwise there wouldn't have been an issue with inter-racial marriage or polygamous marriages.\n \n Just perusing the wikipedia page would show you how marriage statutes were being revised in the 1800s.\n \n \nYou're talking about before the Union even existed. Each state had specific Laws, but they DID not have Constitutions. Once the U.S. constitution was ratified by all the states and became the Law of the Land the States had to Model their Own Laws to Fit into the Constitution, it wasn't the other way around like you think\n\n \n Ok, ignoring the fact that the Articles of Confederation officially changed the disignation of the colonies to States, and ignoring that the new States renamed and reorganized their charters into constitutions during this time (prior to the signing and ratification of the Constitution), what in the world leads you to believe that States must model their constitutions after the US Constitution? \n \n The Bill of Rights didn't even apply to the States at the time of ratification. The Fourteenth Amendment is the only method to apply the BoR against State infringement.\n \n \nDOMA is Unconstitutional, therefore section 2 which relieves the states from the Full Faith and Credit Clause is Unconstitutional as well. If the Federal Government repeals DOMA the States will once again be forced to recognize Marriages from Other states, Whether they want to or not. They may have a Constitution in Texas that bans Gay Marriage, but a gay couple Married in Vermont doesn't have to get married under Texas Law.\n\n \n Look at it purely from a logical standpoint.\n A. The Federal government has no power the Constitution doesn't specifically give to it\n B. The Constitution doesn't give the Federal gov't the power to regulate marriage\n Therefore the Federal gov't does not have the power to regulate marriage.\n \n C. The Federal gov't does not have the power to regulate marriage\n D. Any power the Federal gov't does not have, the State has\n Therefore the State has the power to regulate marriage.\n \n E. The State has the power to regulate marriage.\n F. An Act of Congress cannot give States power they already have\n Therefore doma did not give States any power", 
   {}, 
   424935, 
   null, 
   1298859540.0
  ], 
  [
   424955, 
   null, 
   "Xcaliber", 
   "\n Well, yes, statutes existed to establish the metes and bounds of a marriage. Afterall, you can't exactly apply for a marriage license if there were no regulations that provided for it. And people cared very much, otherwise there wouldn't have been an issue with inter-racial marriage or polygamous marriages.\n Just perusing the wikipedia page would show you how marriage statutes were being revised in the 1800s.\n\n \n That is not what I said.. Read it, I said before 1973 there WAS NO DEFINITION in any State defining Marriage as that between a man and a woman.. NONE, NADA< ZILCH.. they had regulations for MARRIAGE but they did NOT have a Definition keeping Gay people from marrying.\n \n \n \n\n Look at it purely from a logical standpoint.\n A. The Federal government has no power the Constitution doesn't specifically give to it\n B. The Constitution doesn't give the Federal gov't the power to regulate marriage\n Therefore the Federal gov't does not have the power to regulate marriage.\n \n C. The Federal gov't does not have the power to regulate marriage\n D. Any power the Federal gov't does not have, the State has\n Therefore the State has the power to regulate marriage.\n \n E. The State has the power to regulate marriage.\n F. An Act of Congress cannot give States power they already have\n Therefore doma did not give States any power\n\n \n You keep repeating what I have said from the beginning and then arguing with yourself by contradicting your own statements. \n \n A:The Federal Government DOES NOT HAVE AUTHORITY OVER MARRIAGE.. that was established long ago after I showed it to you. \n B: States Had the Power to Regulate Marriage IN THEIR OWN STATE..that has also been established.\n C: States < Until the Passage of DOMA were REQUIRED BY THE CONSTITUTION to follow the Full Faith and Credit Clause, which was Constitutional Law until DOMA was passed . This didn't take away the Power for States to regulate Marriage IN THEIR OWN STATES, but it did make them have to Honor Marriages in other States. \n D: DOMA is Unconstitutional, and will eventually be repealed. Once that Happens You will see Just How Much POWER these Bigoted States have when they are once again Forced to honor those marriages.. I know you don't like it but that's plain and simply truth, whether you believe it or Not. \n \n If the Constitution Is not enough Evidence to prove to you how Absurd it is to deny Gay people of their rights then Nothing I say or do will convince you either.", 
   {}, 
   424942, 
   null, 
   1298869440.0
  ], 
  [
   424963, 
   null, 
   "Sigma", 
   "That is not what I said.. Read it, I said before 1973 there WAS NO DEFINITION in any State defining Marriage as that between a man and a woman.. NONE, NADA< ZILCH.. they had regulations for MARRIAGE but they did NOT have a Definition keeping Gay people from marrying.\n\n \n Yes, that's true. However, when the statutes were written it was simply assumed the couple was heterosexual. Original intent is taken into account when judging the application of laws.\n \n \n\n You keep repeating what I have said from the beginning and then arguing with yourself by contradicting your own statements. \n\n \n Then by all means point to which step in which I contradicted myself.\n \n A. The Federal government has no power the Constitution doesn't specifically give to it\n B. The Constitution doesn't give the Federal gov't the power to regulate marriage\n Therefore the Federal gov't does not have the power to regulate marriage.\n \n C. The Federal gov't does not have the power to regulate marriage\n D. Any power the Federal gov't does not have, the State has\n Therefore the State has the power to regulate marriage.\n \n E. The State has the power to regulate marriage.\n F. An Act of Congress cannot give States power they already have\n Therefore doma did not give States any power\n \n I see nothing contradictory.", 
   {}, 
   424955, 
   null, 
   1298872020.0
  ], 
  [
   424965, 
   null, 
   "Xcaliber", 
   "Yes, that's true. However, when the statutes were written it was simply assumed the couple was heterosexual. Original intent is taken into account when judging the application of laws.\n\n \n Again you assume without supporting evidence. It may be YOUR belief that it was their original intent but that does not make it true and you can't prove otherwise. You don't know what the original intent was nor could you. \n \n Point of this whole thing is that The Laws concerning Gay Marriage are Unconstitutional. I have repeatedly Shown that with the Constitution itself and yet you still continue to twist the meaning of the Constitution to fit your own View of what it should be. The Full faith and Credit Clause explains itself by it's own wording. The Facts don't change, not even when you try to skew them into your own words. You have posted not a shred of anything to prove or support your claims so I will assume you are just playing word games in hopes that if you keep repeating yourself over and over that someone might actually believe you...", 
   {}, 
   424963, 
   null, 
   1298874240.0
  ], 
  [
   424966, 
   null, 
   "Sigma", 
   "Again you assume without supporting evidence. It may be YOUR belief that it was their original intent but that does not make it true and you can't prove otherwise. You don't know what the original intent was nor could you. \n\n \n I don't believe it is rational to dispute this point. It's common knowledge that any widespread knowledge of homosexuality is very recent. Common knowledge is generally exempt from proof requirements.\n \n Without that knowledge, it would be irrational to assume they intended anything but a heterosexual couple.\n \n \n I have repeatedly Shown that with the Constitution itself and yet you still continue to twist the meaning of the Constitution to fit your own View of what it should be.\n\n \n This is false. I have shown you what SCOTUS and legal experts think. It is case law you are trying to deny, not my view of anything.\n \n Quoting doma or the clause itself is not evidence of anything besides the existence of the same. On top of that you added speculation. That is not evidence either.", 
   {}, 
   424965, 
   null, 
   1298874540.0
  ], 
  [
   424972, 
   null, 
   "Xcaliber", 
   "I don't believe it is rational to dispute this point. It's common knowledge that any widespread knowledge of homosexuality is very recent. Common knowledge is generally exempt from proof requirements.\n Without that knowledge, it would be irrational to assume they intended anything but a heterosexual couple.\n\n \n No it's irrational to Assume you know without knowledge of the subject. Homosexuality has been known about since Ancient times it is the FEAR of Homosexuality that is more recent, so to assume you know the intend of Marriage is irrational and arrogant.\n \n \n\n This is false. I have shown you what SCOTUS and legal experts think. It is case law you are trying to deny, not my view of anything.\n \n Quoting doma or the clause itself is not evidence of anything besides the existence of the same. On top of that you added speculation. That is not evidence either.\n\n \n You posted One example of One case that had nothing to do with Gay Rights. SCOTUS have not heard a case concerning Gay Marriage and they have made no such rulings as you keep claiming. The Constitution is all the evidence I need to support my position. It doesn't change simply because you disagree with it.", 
   {}, 
   424966, 
   null, 
   1298909220.0
  ], 
  [
   424973, 
   null, 
   "Sigma", 
   "No it's irrational to Assume you know without knowledge of the subject. Homosexuality has been known about since Ancient times it is the FEAR of Homosexuality that is more recent, so to assume you know the intend of Marriage is irrational and arrogant.\n\n \n So your position is that the writers of the marriage statutes when laws were first formed fully intended for homosexuals to be included?\n \n If that's the position you're cornered to, I have no problem leaving you with your delusion ;)\n \n \nYou posted One example of One case that had nothing to do with Gay Rights. SCOTUS have not heard a case concerning Gay Marriage and they have made no such rulings as you keep claiming. The Constitution is all the evidence I need to support my position. It doesn't change simply because you disagree with it.\n\n \n I'm telling you facts. SCOTUS dismissed the case on its merits and I quoted what they said about the case. I posted links to wikipedia, I posted links to a homosexual friendly news site. I didn't even offer my own speculation, I just showed you what people with much more authority than I have were saying on the subject. I even gave you a chain of logical reasoning that, thus far, you have been unable to show as inconsistant.\n \n Simply quoting the Constitution isn't evidence of anything except the existence of the Constitution. Since I know it exists, you haven't fulfilled your burden of proof.", 
   {}, 
   424972, 
   null, 
   1298911500.0
  ], 
  [
   424999, 
   null, 
   "Xcaliber", 
   "So your position is that the writers of the marriage statutes when laws were first formed fully intended for homosexuals to be included?\n If that's the position you're cornered to, I have no problem leaving you with your delusion ;)\n\n \n Again you try to twist words to fit your position, I never said nor implied that. The Writers of the First statutes Did not define marriage as between a man and a woman, they had no NEED to define marriage until gay people started realizing their rights and wanting to marry. The Law was changed specifically to deny those rights... You can stick to YOUR delusion\n \n \n \n\n I'm telling you facts. SCOTUS dismissed the case on its merits and I quoted what they said about the case. I posted links to wikipedia, I posted links to a homosexual friendly news site. I didn't even offer my own speculation, I just showed you what people with much more authority than I have were saying on the subject. I even gave you a chain of logical reasoning that, thus far, you have been unable to show as inconsistant\n\n \n No, once again you are dead wrong.. SCOTUS NEVER HEARD THE CASE. they refused to hear the case . They did not Dismiss the case, they made no rulling on it, they simply refused to bring the case to the bench. That is not a court Decision. \n \n \n \n\n Simply quoting the Constitution isn't evidence of anything except the existence of the Constitution. Since I know it exists, you haven't fulfilled your burden of proof.\n\n \n Yes, the constitution can and has been used as evidence in a number of arguments. You can't get around what the constitution says with twisting words and making things up on your own so you claim that it's not evidence to try and weasel out of backing up your statements with proof.", 
   {}, 
   424973, 
   null, 
   1298958240.0
  ], 
  [
   425001, 
   null, 
   "Sigma", 
   "Again you try to twist words to fit your position, I never said nor implied that. The Writers of the First statutes Did not define marriage as between a man and a woman, they had no NEED to define marriage until gay people started realizing their rights and wanting to marry. The Law was changed specifically to deny those rights... You can stick to YOUR delusion\n\n \n It's true it wasn't defined... because there was no need to define it. As you said, homosexuality just wasn't an issue. The reason it wasn't an issue was that it was relatively unknown... it was just assumed any couple would be heterosexual.\n \n \nNo, once again you are dead wrong.. SCOTUS NEVER HEARD THE CASE. they refused to hear the case . They did not Dismiss the case, they made no rulling on it, they simply refused to bring the case to the bench. That is not a court Decision.\n\n \n It was a mandatory appeal, they didn't refuse to hear it. Wikipedia disagrees with you:\n \n The plaintiffs appealed, and on October 10, 1972 the United States Supreme Court dismissed the appeal \"for want of a substantial federal question.\" Because the case came to the federal Supreme Court through mandatory appellate review (not certiorari), the summary dismissal constituted a decision on the merits and established Baker v. Nelson as a precedent\n \n Can you show any proof to support your supposition?\n \n \nYes, the constitution can and has been used as evidence in a number of arguments. You can't get around what the constitution says with twisting words and making things up on your own so you claim that it's not evidence to try and weasel out of backing up your statements with proof.\n\n \n You're making a claim about how the law works. Quoting the law does not prove how it works; you have to show an example of it working that way to prove that's how it works. Until you show that evidence, you have no support for your supposition.", 
   {}, 
   424999, 
   null, 
   1298959080.0
  ], 
  [
   425009, 
   null, 
   "Xcaliber", 
   "It's true it wasn't defined... because there was no need to define it. As you said, homosexuality just wasn't an issue. The reason it wasn't an issue was that it was relatively unknown... it was just assumed any couple would be heterosexual.\n\n \n SO what you are saying is that they passed laws SPECIFICALLY to deny Gay people the same rights.. Just because something wasn't \" known\" according to your standard doesn't mean that Gay people didn't have rights before they were stripped away.\n \n \n\n It was a mandatory appeal, they didn't refuse to hear it. Wikipedia disagrees with you:\n\n \n You don't read do you.. \n \n THEY DID NOT HEAR THE CASE. I've said this over, and over, yet you continue to read it how you see it and once again get it wrong. The case was a Appeal, they dismissed it WITHOUT hearing evidence. The fact that it set a precedence is and has been debated since they made their ruling, refusing to hear the case until the plaintiffs could show FEDERAL issue. Not everything SCOTUS does is right you know. \n \n The plaintiffs appealed, and on October 10, 1972 the United States Supreme Court dismissed the appeal \"for want of a substantial federal question.\" Because the case came to the federal Supreme Court through mandatory appellate review (not certiorari), the summary dismissal constituted a decision on the merits and established Baker v. Nelson as a precedent\n \n \n\n Can you show any proof to support your supposition?\n\n \n I have, you just don't get it.\n \n \n\n You're making a claim about how the law works. Quoting the law does not prove how it works; you have to show an example of it working that way to prove that's how it works. Until you show that evidence, you have no support for your supposition.\n\n \n No the Constitution is not up to individual interpretation. It says what it says and that is the LAW by which we have Governed this country since the Constitution was Ratified. I'll say it once more, Before DOMA States were required BY LAW to honor Public records from other States. The States did so because they had to, Until DOMA specifically released them from the Full faith and Credit Clause.. That's not Me making a claim about how the law works, that's FACT that you wish to deny because you are scared gay people will be getting married and effect you in some way. In Reality there is No RATIONAL reason to deny Gay people the right to marry. Religious Zealots need to stay out of other peoples Lives and worry about their own.", 
   {}, 
   425001, 
   null, 
   1299003780.0
  ], 
  [
   425012, 
   null, 
   "Sigma", 
   "SO what you are saying is that they passed laws SPECIFICALLY to deny Gay people the same rights.. Just because something wasn't \" known\" according to your standard doesn't mean that Gay people didn't have rights before they were stripped away.\n\n \n I'm not arguing either way. I'm saying when the statutes were written it was assumed the couples would be heterosexual. It wasn't specified because it was assumed.\n \n \nTHEY DID NOT HEAR THE CASE. I've said this over, and over, yet you continue to read it how you see it and once again get it wrong. The case was a Appeal, they dismissed it WITHOUT hearing evidence. The fact that it set a precedence is and has been debated since they made their ruling, refusing to hear the case until the plaintiffs could show FEDERAL issue. Not everything SCOTUS does is right you know.\n\n \n \"Refusing to hear the case\" and \"dismissing the case\" are two different things, Xcaliber. SCOTUS dismissed the case on the merits of the case, saying there was no Federal question to consider. Since it was a mandatory appeal, they didn't refuse to hear the case.\n \n You can certainly argue that SCOTUS made a mistake and are horribly wrong, but SCOTUS did set the precedent that there was no Federal question. That is a fact.\n \n \nThe States did so because they had to, Until DOMA specifically released them from the Full faith and Credit Clause.. That's not Me making a claim about how the law works, that's FACT that you wish to deny because you are scared gay people will be getting married and effect you in some way.\n\n \n If it is a fact then you should be able to show proof that the law has ever acted this way. Since you have provided no evidence of this, and I have showed you evidence that it does not work that way with specific court cases, my argument has more support than yours.\n \n The only 'evidence' I've seen you post is quoting the clause itself.", 
   {}, 
   425009, 
   null, 
   1299006480.0
  ], 
  [
   425043, 
   null, 
   "Xcaliber", 
   "I'm not arguing either way. I'm saying when the statutes were written it was assumed the couples would be heterosexual. It wasn't specified because it was assumed.\n\n \n Assumption or not, it was NOT written into the Law. They didn't define Marriage until they had a NEED to define marriage. And the truth is you are assuming that they were assuming that in the first place. You weren't there so you can't possibly make that claim .\n \n \n\n \"Refusing to hear the case\" and \"dismissing the case\" are two different things, Xcaliber. SCOTUS dismissed the case on the merits of the case, saying there was no Federal question to consider. Since it was a mandatory appeal, they didn't refuse to hear the case.\n\n \n It was a court case from a Lower court which had been appealed to the Supreme Court.. They DID NOT HEAR THE CASE. They found no Federal Justification to HEAR the case so they summarily Dismissed it. By Dismissing the case in such a way they set a precedence which in turn kept Lower courts from hearing such cases. But they NEVER HEARD THE CASE and they never made a ruling. they simply refused to hear it and dismissed with Prejudice. \n \n \n\n You can certainly argue that SCOTUS made a mistake and are horribly wrong, but SCOTUS did set the precedent that there was no Federal question. That is a fact.\n\n \n They did, they were wrong, and I never disputed the fact that it set a precedence. Even if it was wrong it's still the Supreme Court and that is why it's such a hard case to get heard.\n \n \n\n If it is a fact then you should be able to show proof that the law has ever acted this way. Since you have provided no evidence of this, and I have showed you evidence that it does not work that way with specific court cases, my argument has more support than yours.\n The only 'evidence' I've seen you post is quoting the clause itself.\n\n \n No, the evidence is right in front of you. States have ALWAYS recognized Marriages, Licenses , and other Public Records from Other states. They have ALWAYS done so because the Constitution before DOMA made it a Requirement. In fact they still do today, when a Married couple moves from Arkansas to Texas they don't have to re-marry under Texas law, their Arkansas Marriage is Accepted as legal and binding. That all changed when DOMA was passed. Section 2 in DOMA, which I have Shown you, Specifically states it releases States from this Clause. If that isn't enough evidence then you simply don't want to believe it. I understand you don't agree with Gay Marriage, but you can't deny facts .", 
   {}, 
   425012, 
   null, 
   1299061320.0
  ], 
  [
   425053, 
   null, 
   "Sigma", 
   "Assumption or not, it was NOT written into the Law. They didn't define Marriage until they had a NEED to define marriage. And the truth is you are assuming that they were assuming that in the first place. You weren't there so you can't possibly make that claim .\n\n \n You're right it wasn't written in, we're just discussing the reason for that :P\n \n I don't think it's rational to dispute that they assumed that heterosexual couples would be the only couples those statutes would apply to ;)\n \n \nIt was a court case from a Lower court which had been appealed to the Supreme Court.. They DID NOT HEAR THE CASE. They found no Federal Justification to HEAR the case so they summarily Dismissed it. By Dismissing the case in such a way they set a precedence which in turn kept Lower courts from hearing such cases. But they NEVER HEARD THE CASE and they never made a ruling. they simply refused to hear it and dismissed with Prejudice.\n\n \n Rofl, I won't argue with you since at least you agree with the reasoning and effect. \n \n Yes, when they said there was no Federal question (before doma, mind you), it meant that the Federal gov't (and the Constitution) had no authority in the matter. Meaning the States had the authority to define marriage.\n \n \nNo, the evidence is right in front of you. States have ALWAYS recognized Marriages, Licenses , and other Public Records from Other states. They have ALWAYS done so because the Constitution before DOMA made it a Requirement.\n\n \n Then why did the SCOTUS say there was no Federal question? The only evidence that is right in front of me disagrees with your speculation. Give me evidence besides your speculation on the meaning and we'll talk.", 
   {}, 
   425043, 
   null, 
   1299092040.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Indiana Republicans violate the state constitution", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15017, 
  "discussion_files": [
   [
    "27532.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-print.html"
   ], 
   [
    "27533.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-11-print.html"
   ], 
   [
    "27534.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-9-print.html"
   ], 
   [
    "27535.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-7-print.html"
   ], 
   [
    "27536.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-5-print.html"
   ], 
   [
    "27537.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-4-print.html"
   ], 
   [
    "27538.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-6-print.html"
   ], 
   [
    "27539.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-8-print.html"
   ], 
   [
    "27540.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-10-print.html"
   ], 
   [
    "27541.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-3-print.html"
   ], 
   [
    "27542.html", 
    "http://www.4forums.com/political/gay-rights-debates/15017-indiana-republicans-violate-state-constitution-2-print.html"
   ]
  ], 
  "identifier": 15017
 }
]