[
 [
  [
   423900, 
   null, 
   "Superlite27", 
   "Seems as if some firearms registered to the ATF have turned up in some shady crimes along the Mexican border.\n \n I think we've found out where those evil guns the anti's are always complaining about being traced back to the U.S. are coming from:\n \n Project gunwalker - Google Search\n \n Well? I guess the anti's were right. Those pesky guns were coming from the U.S.! (They conveniently failed to mention they were being deliberately smuggled there by the ATF itself.)\n \n Whoops! \n \n I'm sure the anti's will continue to misleadingly try to blame it on lax firearm laws. \n \n What? The ATF is hand delivering them?\n \n Nope. Nothing to see here. Just keep driving. \n \n Move along.\n \n Move along.", 
   {
    "post_info": {
     "post_title": "Project Gunwalker"
    }
   }, 
   null, 
   null, 
   1297448340.0
  ], 
  [
   423902, 
   null, 
   "Doc Jones", 
   "Seems as if some firearms registered to the ATF have turned up in some shady crimes along the Mexican border.\n \n I think we've found out where those evil guns the anti's are always complaining about being traced back to the U.S. are coming from:\n \n Project gunwalker - Google Search\n \n Well? I guess the anti's were right. Those pesky guns were coming from the U.S.! (They conveniently failed to mention they were being deliberately smuggled there by the ATF itself.)\n \n Whoops! \n \n I'm sure the anti's will continue to misleadingly try to blame it on lax firearm laws. \n \n What? The ATF is hand delivering them?\n \n Nope. Nothing to see here. Just keep driving. \n \n Move along.\n \n Move along.\n\n \n ...and just as I said, that truckload of guns that was crowed about in the Southern Border has vanished from sight. \n \n That is one dirty, rogue former tax agency gone Fritz even if it kills real Law Enforcement Officers. Sliiiiiick said Enemies Foreign and Domestic by Matthew Bracken was fiction/except it came true. Now gun grabbers don't want to lose their criminal orgs so don't look for them to admit they are the criminals' best friends.\n \n Gunwalker Scandal Blows Up. Senator Grassley Releases Smoking Gun ATF Trace Data | The Truth About Guns\n \n \"Gunwalker Scandal Blows Up. Senator Grassley Releases Smoking Gun ATF Trace Data\"\n \n Sipsey Street Irregulars: ATF Whistleblowers to Senator Grassley: \"Welcome to the party, pal!\" But remember, the fight against this evil is an open invitation to YOU as well.\n ... \"That was then. What a difference a couple of days and a letter makes. When the anonymous source provided David Codrea with Senator Grassley's reply to Eric Holder containing the 'Rosetta Stone' documents, the agents whose careers and liberty have been hanging out there, twisting in wind, suddenly found an ally whose determination seems to equal theirs.\"\n \n \"I don't know what Eric Holder intended by having his minion write that insulting letter to Grassley, but I rather suspect that he wasn't expecting what he got ...\" ...\n 666: Sen. Grassley exposes BATFE&#039;s Mark of the Beast - St. Louis gun rights | Examiner.com\n ... \"Sen. Grassley goes on to describe the DoJ's flat denial of any such scandal, and then counters with the fact that the allegations are backed up by extensive documentation. Some of that documentation (redacted to protect sensitive information) is made available in the appendices.\"\n \n \"The '666' and 'Mark of the Beast' in the title of today's column are not really intended as a theological reference--it's just a handy coincidence that 'six hundred threescore and six' happens to be the number of firearms going to Mexico that BATFE's operation seems to have 'lost' (just as part of \"Operation Fast and Furious\") ...\" ...\n \n American Thinker Blog: Sen. Grassley: Time For ATF To Come Clean\n \n \"The death of [CBP] Agent Brian Terry should have been an accident quietly disposed of in the silence of the Arizona desert. Everything was easily explained away, a CBP patrol came across a nefarious band of characters in the desert, a firefight erupted that left Agent Terry fatally injured. It could have been easy. The only trouble with the cover story was that the weapons held by the suspects were supposedly being tracked by the [ATF].\"\n \n \"How assault weapons sold with full knowledge of the ATF wound up in the hands of Mexican drug cartels has become the pertinent question in the scandal dubbed Gunwalker by David Codrea of Examiner.com ...\" ...\n \n Schedule Your Visit - Guardians of Liberty\n \n \"Hey all,\"\n \n \"Today was day 3 in DC for me, and I had two scheduled appointments. The two major issues I wanted to discuss at both meetings were healthcare and 'Project Gunwalker'.\" ...\n \n \"The second meeting was with Congressman Tom Marino (see attached pic, look at my right hip, you can see my empty ... holster).\"\n \n \"Anyway, Marino is a former US District Attorney who spent 18 years working with the ATF and prosecuting straw purchasers and so on. He said that he considers himself law enforcement and as such, he takes the death of BPA Terry personally, and if the allegations are true that ATF facilitated the transfer of the weapon that killed him and they are trying to cover it up, he won't let them get away with it. ...\" ...\n \n Wouldn't it be Terrible?\n \n \"I'm very worried about the state of affairs over at America's finest law enforcement agency, the Bureau of Alcohol, Tobacco, Firearms, and Explosives. The BATFE.\"\n \n \"I was thinking how terrible this whole 'Project Gunwalker' is going to become for the BATFE. It appears that this sterling group of freedom loving American bureaucrats may have smuggled as many as 3,000 firearms into Mexico in an effort to catch the people who supposedly smuggle firearms into Mexico.\" ...\n \n White House says no to emergency AK-47 regulation - Kingsport Times-News Online\n \n \"The White House says tracking the bulk sale of high-powered rifles from border states gunshops which legally sell thousands of assault weapons that end up in Mexico each year is not an emergency, and has rejected a request from the U.S. agency that monitors weapons sales to do so without public review.\" ...", 
   {
    "unicode_changes_made": true
   }, 
   423900, 
   null, 
   1297451820.0
  ], 
  [
   423916, 
   null, 
   "Doc Jones", 
   "Shameless bump to get current facts out instead of disproven 10 to 17 year old disproven claims backed by twisted data.", 
   {}, 
   423902, 
   null, 
   1297464660.0
  ], 
  [
   423928, 
   null, 
   "Superlite27", 
   "Oh, it's gonna come out in the wash, Doc.\n \n Seems as though Senator Grassley wrote a several letters inquiring about this little ATF slip-up, and was, in a manner of speaking, told to STFU.\n \n The Dept. Of Justice then wrote him back informing him his inquiries were unwelcome.\n \n He then wrote a beat down to Eric Holder.\n \n I'm pretty sure Senators dislike being blown off and told to go away. As hard as the mainstream media is doing their best to turn a blind eye to the whole fiasco, I'm guessing trying to sweep a U.S. Senator under the rug will eventually have to be noticed by someone more important than the blogosphere.\n \n Sooner or later, someone is going to get an answer from the ATF on how one of their firearms was found at the murder scene of Border Patrol Agent Brian Terry.\n \n Evidently, the ATF feels a U.S. Senator isn't a big enough personality to get the answer.\n \n (Also, evidently, the mainstream media doesn't feel the complete sweeping of this Senator under the rug is a noteworthy story.)", 
   {}, 
   423916, 
   null, 
   1297471440.0
  ], 
  [
   424720, 
   null, 
   "Superlite27", 
   "What? Huh?\n \n What is this?\n \n Gunrunning scandal uncovered at the ATF - CBS Evening News - CBS News\n \n An actual story from the media?\n \n Things must be heating up.", 
   {}, 
   423928, 
   null, 
   1298568900.0
  ], 
  [
   424722, 
   null, 
   "Tither", 
   "  Gunrunning scandal uncovered at the ATF \nATF managers allegedly made a controversial decision: allow most of the weapons on the streets. The idea, they said, was to gather intelligence and see where the guns ended up. (Tither's comment. BS I think this was an attempt to make the problem larger than it really is so they could curtail our Rights! How did I get this impression? Keep reading) Insiders say it's a dangerous tactic called letting the guns, \"walk.\"\n \n One agent called the strategy \"insane.\" Another said: \"We were fully aware the guns would probably be moved across the border to drug cartels where they could be used to kill.\" \n \n On the phone, one Project Gunrunner source (who didn't want to be identified) told us just how many guns flooded the black market under ATF's watchful eye. \"The numbers are over 2,500 on that case by the way. That's how many guns were sold - including some 50-calibers they let walk.\"\n\n People killed in Mexico and the U.S. Courtesy of our very own government! emoticon_cry\n \n  Over at Clean Up the ATF dot org \n \n \nWord is that curios George Gillett the Phoenix ASAC stepped on it again. Allegedly he has approved more than 500 AR-15 type rifles from Tucson and Phoenix cases to be \"walked\" to Mexico. Appears that ATF may be one of the largest suppliers of assault rifles to the Mexican cartels! One of these rifles is rumored to have been linked to the recent killing of a Border Patrol Officer in Nogales, AZ. Can anyone confirm this information?\n\n \n I wish them luck in cleaning up some Vere Slimy Acts!\n \n  More on BP agent Brian Terry \n On  Fox News. \n Confirmation that the gun used to kill Border Patrol Agent Brian Terry came from sales by a dealer cooperating with an ATF investigation. Senate Judiciary Committee is said to be investigating.\n \n It confirms another detail that was being reported on the internet. Understand, Terry was on something like a SWAT team, on an extremely dangerous mission. They were out at night seeking border robbery teams that range into the US to rob entering drug runners. I suppose the only thing more dangerous than encountering a drug cartel team is encountering a gang who robs those teams. Anybody who figures on taking on the Zetas is dangerous indeed.\n\n \n Want to clean up the guns coming into Mexico from the U.S.? Apparently one needs to stop the ATF from making the problem worse.", 
   {}, 
   424720, 
   null, 
   1298574840.0
  ], 
  [
   424723, 
   null, 
   "Doc Jones", 
   "This site is so busy you will have to wait to access it. Seems ATF got co-operation or competition from El Presidente.\n \n http://thetruthaboutguns.com/2011/02/robert-farago/mexican-presidents-ex-guard-sold-military-weapons-to-drug-cartels/", 
   {}, 
   424722, 
   null, 
   1298575980.0
  ], 
  [
   424727, 
   null, 
   "sinjin", 
   "Seems as if some firearms registered to the ATF have turned up in some shady crimes along the Mexican border.\nNo, not \"registered\" to the ATF.\n \n \nWell? I guess the anti's were right. Those pesky guns were coming from the U.S.! (They conveniently failed to mention they were being deliberately smuggled there by the ATF itself.)\nNo, not smuggled \"by the ATF itself\".\n \n \nI'm sure the anti's will continue to misleadingly try to blame it on lax firearm laws.\nAre you suggesting those weapons would not have been smuggled if the ATF knew nothing of them? Silly.\n \n \nWhat? The ATF is hand delivering them?\nNot even. \n \n Let's remember that not long ago it was claimed no north to south trafficking was taking place. \n Now the peanut gallery is Monday morning quarterbacking.\n \n A bad decision made by someone in the BATFE in the hopes of uncovering the details of the smuggling network.", 
   {}, 
   423900, 
   null, 
   1298580060.0
  ], 
  [
   424728, 
   null, 
   "sinjin", 
   "&#8220;The massive size of this operation sadly exemplifies the magnitude of the problem &#8212; Mexican Drug Lords go shopping for war weapons in Arizona.&#8221;\n \n http://www.atf.gov/press/releases/2011/01/012511-pho-grand-juries-indict-34-suspects-in-drug-and-firearms-trafficking-organization.html", 
   {}, 
   424727, 
   null, 
   1298581200.0
  ], 
  [
   424730, 
   null, 
   "daewoo", 
   "\n Are you suggesting those weapons would not have been smuggled if the ATF knew nothing of them? Silly.\n\n \n Yes. And not only is it not silly, by all indications it is the verifiable truth. The dealer that sold those guys wanted to DECLINE the sale because the guy he was selling them to was obviously a straw purchaser and was smuggling them over the border. The ATF ordered the dealer to make the sales. Had they not, the merchant would have declined the sale and those guns would either still be sitting on the shelf, or would have been sold to a law abiding citizen. \n \n \n\n A bad decision made by someone in the BATFE in the hopes of uncovering the details of the smuggling network.\n\n \n A bad decision??? The BATFE ordered dealers to make gun sales that they knew to be illegal and then helped ensure they made it across the border by keeping US law enforcement at bay. That is not \"a bad decision\", that is gun running. Then a border patrol agent was shot with a weapon that was only in mexico because the ATF ordered a gun dealer to make an illegal sale and then kept their agents back so it could be transported across the border. \n \n Frankly the claim by the ATF that they were trying to uncover the details of the smuggling networks is completely and totally nonsensical. Both the ATF and Mexican law enforcement have confirmed that the mexicans had no idea what was going on...the ATF did not advise them of their activities at all. If they were trying to break the smuggling ring, wouldnt it be important to know what happens to the guns AFTER they enter mexico?? The BATFE has NO FIELD OPERATIONS in Mexico. Both the ATF and mexican authorities have confirmed this. \n \n That begs the question....exactly what the hell were they trying to do again??? They put thousands of guns across the border with absolutely no ability or effort to find out what happened to them on the other side. Sorry, the \"trying to crack smuggling ring\" excuse just went right out the window. The \"trying to justify their budget\" claim from sources inside the ATF suddenly looks a LOT more likely.", 
   {}, 
   424727, 
   null, 
   1298583060.0
  ], 
  [
   424734, 
   null, 
   "Doc Jones", 
   "\"The massive size of this operation sadly exemplifies the magnitude of the problem - Mexican Drug Lords go shopping for war weapons in Arizona.\"\n \n USAO Press Release -\n\n \n Even Obama on CNN denied that :)\n \n Worm your way through this one sliiiick.\n Mexican Prez&#8217;s Ex-Guard Sold Military Weapons to Drug Cartels | The Truth About Guns\n Mexican Prez's Ex-Guard Sold Military Weapons to Drug Cartels\n Posted on February 23, 2011 by Robert Farago \n \"A Mexican officer assigned to guard President Felipe Calderón was accused of leaking information to drug cartels in exchange for bribes, training hit men through a private security firm, and supplying military weapons to groups like the Zetas, according to a U.S. diplomatic cable.\" The information comes to us via elpasotimes.com. As I've said before, Los Zetas and their main competitors are NOT buying their weapons in dribs and drabs from Bob's Gun Stores in Los Estados Unidos. To even suggest such a thing is the height of absurdity. No wait: it's official U.S. government policy, courtesy of the Gunwalking federal agency known as the ATF. Perpetuated by the President of Mexico and President of the United States. What's that all about?", 
   {
    "unicode_changes_made": true
   }, 
   424728, 
   null, 
   1298587440.0
  ], 
  [
   424736, 
   null, 
   "sinjin", 
   "The dealer that sold those guys wanted to DECLINE the sale because the guy he was selling them to was obviously a straw purchaser and was smuggling them over the border.\nActually the story says seven gun shops were involved and \"several\" dealers wanted to deny the sales. Not all seven.", 
   {}, 
   424730, 
   null, 
   1298587980.0
  ], 
  [
   424737, 
   null, 
   "Doc Jones", 
   "Even Lybian dictator, Gadhaffi who has murdered by most estimates 3,000 civilians is quoting the actions of Ruby Ridge and Waco ATF as being similar to what he is doing...quelling potential armed dissent. What is wrong with both actions and excuses other than being the act of tyrants and dictators?", 
   {}, 
   424734, 
   null, 
   1298588040.0
  ], 
  [
   424738, 
   null, 
   "Doc Jones", 
   "Actually the story says seven gun shops were involved and \"several\" dealers wanted to deny the sales. Not all seven.\n\n \n \n BS. It is more like the book you poo pood Enemies Foreign and Domestic and they would rather declare war on law abiding American citizens that don't vote right and expect their rights to be honored in the Constitution and on the street. You were so quick to claim \"it is fiction\". Sometimes fiction is more apt than the truth, this case reeks to high heaven. Wait until the next round of Wiki Leaks. :)", 
   {}, 
   424736, 
   null, 
   1298588340.0
  ], 
  [
   424744, 
   null, 
   "Pietro", 
   "A bad decision made by someone in the BATFE in the hopes of uncovering the details of the smuggling network.\n\n \n A bad decision you say? That's what you consider the ATF failing to halt suspicious sales and instead let them go ahead and thus contribute to the number of weapons smuggled into Mexico for the purpose of furthering hostility and killing innocent people? You call that a bad decision?\n \n Let's have a closer look at the CBS story and discuss what's covered here: Gunrunning scandal uncovered at the ATF - CBS Evening News - CBS News\n \n \nIn late 2009, ATF was alerted to suspicious buys at seven gun shops in the Phoenix area. Suspicious because the buyers paid cash, sometimes brought in paper bags. And they purchased classic \"weapons of choice\" used by Mexican drug traffickers - semi-automatic versions of military type rifles and pistols.\n \n Sources tell CBS News several gun shops wanted to stop the questionable sales, but ATF encouraged them to continue.\n \n Jaime Avila was one of the suspicious buyers. ATF put him in its suspect database in January of 2010. For the next year, ATF watched as Avila and other suspects bought huge quantities of weapons supposedly for \"personal use.\" They included 575 AK-47 type semi-automatic rifles.\n\n \n In this article by CBS we learn the name of the suspected smuggle Jaime Avila. Jaime Avila was on an ATF watchlist for a year and yet he was among those who were allowed to make a bare minimum of 575 purchases during that time frame. Not only was Jaime Avila and others able to purchase guns in America, the ATF told the dealers that they were basically required to complete the transactions regardless of what they wanted.\n \n That hardly sounds like a bad decision on part of the ATF. That's more like 575 consecutive bad decisions in a row in a one year period. And that's just with AK-47 type rifles. What's the total number Jaime Avila and his posse are responsible for? We could be looking at a rate of 50 \"bad decisions\" per day going on.\n \n Although there is an interesting point brought to light by this article. A point other than the sheer amount of corruption within the ATF.\n \n For a considerable amount of time we've been hearing about the ATF requesting authority to mandate that FFL dealers along the border forward multiple sales records on buyers who purchase two or more rifles within a five-day period. Applying the same sales reporting standards currently in place for handguns to rifles. We've been hearing all the usual suspects about how this would be an effective crime fighting tool and help law enforcement discover all kinds of important information.\n \n And yet even without such power in place the ATF was able to place Jaime Avila in the suspect folder and monitor him making multiple purchases throughout the year. They just stood by and watched him buy rifle after rifle after rifle, even telling the FFL dealers to take no action that would interfere in his purchases.\n \n Obviously the ATF doesn't need any further authority to keep tabs on suspicious buyers. Although I do believe they need to be investigated on charges of corruption and possibly aiding criminal activity. Standing by while allowing suspicious sales to take place? In terms of comparison that would be like a patrol officer coming up on a store being robbed, but instead of taking any action he allows the robbery and possible murder of the store owner to take place, do nothing in the mean time, and waiting to see if the same suspect robs another store at a later date.", 
   {}, 
   424727, 
   null, 
   1298591280.0
  ], 
  [
   424747, 
   null, 
   "sinjin", 
   "A bad decision you say? That's what you consider the ATF failing to halt suspicious sales and instead let them go ahead and thus contribute to the number of weapons smuggled into Mexico for the purpose of furthering hostility and killing innocent people? You call that a bad decision?\nYes, a very bad call. Forgive me, I'm not given to hyperbole. A controversial decision within the BATFE let's remember. \n \n You weren't here yet when all your brethren were denying the smuggling in the first place. Some still are minimizing it.\n \n \nIn this article by CBS we learn the name of the suspected smuggle Jaime Avila. Jaime Avila was on an ATF watchlist for a year and yet he was among those who were allowed to make a bare minimum of 575 purchases during that time frame. Not only was Jaime Avila and others able to purchase guns in America, the ATF told the dealers that they were basically required to complete the transactions regardless of what they wanted.\nMr. Avila is now under indictment. \n \n \nThat hardly sounds like a bad decision on part of the ATF. That's more like 575 consecutive bad decisions in a row in a one year period. And that's just with AK-47 type rifles. What's the total number Jaime Avila and his posse are responsible for? We could be looking at a rate of 50 \"bad decisions\" per day going on.\nHow about all the \"Avilas\" we don't know about yet? \n \n \nAlthough there is an interesting point brought to light by this article. A point other than the sheer amount of corruption within the ATF.\nI don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise. \n \n \nFor a considerable amount of time we've been hearing about the ATF requesting authority to mandate that FFL dealers along the border forward multiple sales records on buyers who purchase two or more rifles within a five-day period. Applying the same sales reporting standards currently in place for handguns to rifles. We've been hearing all the usual suspects about how this would be an effective crime fighting tool and help law enforcement discover all kinds of important information.\nMaybe something is required to get some FFL's to do the right thing?\n \n \nAnd yet even without such power in place the ATF was able to place Jaime Avila in the suspect folder and monitor him making multiple purchases throughout the year. They just stood by and watched him buy rifle after rifle after rifle, even telling the FFL dealers to take no action that would interfere in his purchases.\nMr. Avila is now under indictment. Gathering evidence isn't \"standing by and watching\" with no intention of \n doing anything about it.\n \n \nObviously the ATF doesn't need any further authority to keep tabs on suspicious buyers.\nNot obvious to me. Maybe ATF would like to uncover more suspicious buyers they haven't flagged as yet.\n \n \nAlthough I do believe they need to be investigated on charges of corruption and possibly aiding criminal activity.\nBecause you're sympathetic to conspiracy nuts while claiming not to be one. Swell.\n \n \nStanding by while allowing suspicious sales to take place? In terms of comparison that would be like a patrol officer coming up on a store being robbed, but instead of taking any action he allows the robbery and possible murder of the store owner to take place, do nothing in the mean time, and waiting to see if the same suspect robs another store at a later date. \nYour analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.", 
   {}, 
   424744, 
   null, 
   1298592900.0
  ], 
  [
   424754, 
   null, 
   "Pietro", 
   "Yes, a very bad call. Forgive me, I'm not given to hyperbole. A controversial decision within the BATFE let's remember.\n\n \n A controversial decision? That's putting it quite mildly. The ATF allowed hundreds of sales to suspicious buyers take place. I wouldn't be the least bit surprised if these stores get their licenses revoked in the future for allowing those sales to go through just as the ATF ordered them to do.\n \n \nMr. Avila is now under indictment.\n\n \n Indictment for what exactly? What crime is Jaime Avila being charged with committing and how many counts is he currently facing?\n \n \nHow about all the \"Avilas\" we don't know about yet?\n\n \n Yes I'm very familiar with your position that all private sales must not only be eliminated they also have to be outlawed. You're very well known for your position that it should be a crime for a private individual to sell a gun to another private individual without first establishing a paper trail that can be searched by the government at a later date. You've argued this basic position countless times before but I've yet to see significant justification presented by you as to why this position should be put forth and exactly how it would do any good. You've been unable to defend your own ideals when presented with criticism by others. Perhaps you could take another stab at explaining it.\n \n \nI don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise.\n\n \n Surely there must be corruption involved if the ATF agents who spoke requested that their names be withheld.\n \n \nMaybe something is required to get some FFL's to do the right thing?\n\n \n You mean selling to suspicious individuals because they were ordered to do so by the ATF?\n \n Exactly how would multiple sales reports filed in rifle purchases qualify as \"the right thing?\" That implies that withholding such reports is somehow wrong in nature. There's no congressional authority governing multiple sales records of long guns. In fact an amendment to a funding bill is being put through that would prevent the ATF from trying to bypass the authority of congress to mandate multiple sales records on long guns. Bill H.R. 1.\n \n So explain, where does your claim of \"do the right thing\" come from in this case?\n \n \nMr. Avila is now under indictment. Gathering evidence isn't \"standing by and watching\" with no intention of doing anything about it.\n\n \n And they really needed to wait over a year and allow hundreds of purchases to take place? Exactly what were they hoping to bust Jaime Avila for? What prompted them to strike now instead of 10 months ago?\n \n \nNot obvious to me. Maybe ATF would like to uncover more suspicious buyers they haven't flagged as yet.\n\n \n This anti-privacy crusade of yours is really getting old. You claim my analogies suck, but the fact that you've withheld explanation for why California's policies should be expanded to the nation level is truly pitiful. You can't even defend what you want, you just want it passed regardless.\n \n \nYour analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.\n\n \n Then perhaps it's time the ATF be made subject to investigations on suspicion of criminal activity. Find out who in a position of authority made the decision that was integral in letting a border agent be murdered by foreign enemies.", 
   {}, 
   424747, 
   null, 
   1298597340.0
  ], 
  [
   424755, 
   null, 
   "Doc Jones", 
   "Yes, a very bad call. Forgive me, I'm not given to hyperbole. A controversial decision within the BATFE let's remember. \n \n You weren't here yet when all your brethren were denying the smuggling in the first place. Some still are minimizing it.\n \n Mr. Avila is now under indictment. \n \n How about all the \"Avilas\" we don't know about yet? \n \n I don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise. \n \n Maybe something is required to get some FFL's to do the right thing?\n \n Mr. Avila is now under indictment. Gathering evidence isn't \"standing by and watching\" with no intention of \n doing anything about it.\n \n Not obvious to me. Maybe ATF would like to uncover more suspicious buyers they haven't flagged as yet.\n \n Because you're sympathetic to conspiracy nuts while claiming not to be one. Swell.\n \n Your analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.\n\n \n So how many times have you been right in any of your socialist/control stances such as the boy duck hunter in kalifornia sliiiiiick? I don't recall any, not a single time.\n \n The 3 branches of government and their employees are sworn to first uphold the Constitution. Any statute or rule in the Federal Register comes in a distant second. Personal choices by SAIC's or others don't even make the radar scope. They have a sworn duty and not a right to make a decision outside of the scope of the law. Bryan may have something to say along these lines? Recall what happened in VA with Bloomberg?", 
   {}, 
   424747, 
   null, 
   1298597520.0
  ], 
  [
   424790, 
   null, 
   "Doc Jones", 
   "Yes, a very bad call. Forgive me, I'm not given to hyperbole. A controversial decision within the BATFE let's remember. \n \n You weren't here yet when all your brethren were denying the smuggling in the first place. Some still are minimizing it.\n \n Mr. Avila is now under indictment. \n \n How about all the \"Avilas\" we don't know about yet? \n \n I don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise. \n \n Maybe something is required to get some FFL's to do the right thing?\n \n Mr. Avila is now under indictment. Gathering evidence isn't \"standing by and watching\" with no intention of \n doing anything about it.\n \n Not obvious to me. Maybe ATF would like to uncover more suspicious buyers they haven't flagged as yet.\n \n Because you're sympathetic to conspiracy nuts while claiming not to be one. Swell.\n \n Your analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.\n\n \n I looked along the Southern Border:\n Guardsman Arrested As Part of Cartel Roundup - KRGV CHANNEL 5 NEWS - The Rio Grande Valley's News Channel - Breaking News, Breaking Stories - RGV News\n \n When are they going to roust the ATF? Napalitano rushed down to cover up that BP death. The ICE Agent in Mexico was given the hero wake and burial.\n \n U.S. agents are not allowed to carry guns in Mexico.", 
   {}, 
   424747, 
   null, 
   1298643720.0
  ], 
  [
   424791, 
   null, 
   "Doc Jones", 
   "Yes, a very bad call. Forgive me, I'm not given to hyperbole. A controversial decision within the BATFE let's remember. \n \n You weren't here yet when all your brethren were denying the smuggling in the first place. Some still are minimizing it.\n \n Mr. Avila is now under indictment. \n \n How about all the \"Avilas\" we don't know about yet? \n \n I don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise. \n \n Maybe something is required to get some FFL's to do the right thing?\n \n Mr. Avila is now under indictment. Gathering evidence isn't \"standing by and watching\" with no intention of \n doing anything about it.\n \n Not obvious to me. Maybe ATF would like to uncover more suspicious buyers they haven't flagged as yet.\n \n Because you're sympathetic to conspiracy nuts while claiming not to be one. Swell.\n \n Your analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.\n\n \n Wiki Leaks are out simian:\n WikiLeaks exposes true origins of Mexican cartels&#039; weaponry (Hint: It&#039;s not due to the \"mythical\" gun show loophole)\n \n \nThe idea that we'd ever find WikiLeaks information relevant to the protection of United States citizens' gun rights wasn't anywhere on our radar when the NSSF's Larry Keane tipped us off to some disturbing information gleaned from leaked State Department documents.\n \n According to State Department cables, the Mexican drug cartels are getting their weaponry from an international operation, with the cartels getting military weapons through various government channels. Some of those weapons did, in fact, come from the United States, but they weren't the result of the \"gun show loophole\" straw-man purchases or any of the other individual criminal acts anti-gun groups would have you believe.\n \n Large quantities of those US weapons -everything from rifles to machine guns, grenade launchers, explosives and ammunition, came from purchases by the government of Mexico from the United States. As the underpaid, undermanned and undermined soldiers of the Mexican army skipped out on the military to put their training to work for the cartels, they took their issued-arms with them. \n \n Others come from weapon buys from guerilla groups in South and Central America that are then smuggled into the country.\n \n No specific numbers on how many of those guns \"recovered in Mexico and traced back to the United States\" were, in fact, military purchases, but the State Department cables indicate a portion of the fewer than 12 percent of the traceable weapons actually came from the United States in gun shop/individual type purchases. Remember, that's not 12 percent of the tens of thousands of weapons recovered - it's only 12 percent of the weapons recovered that were traceable. It's nowhere near the 12 percent figure that has been misquoted and used as evidence of the United State's \"horrific\" problem of illegal gun sales.\n \n Republished from The Outdoor Wire.\n \n \n\n \n We know they got over 3,000 courtesy of ATF too.", 
   {}, 
   424747, 
   null, 
   1298645940.0
  ], 
  [
   424796, 
   null, 
   "Superlite27", 
   "[QUOTE=sinjin;424747]I don't see corruption in the ATF as a significant component here. Conspiracy theorists might imagine otherwise. [QUOTE]\n \n \n \nCBS News wanted to ask ATF officials about the case, but they wouldn't agree to an interview. We were able to speak to six veteran ATF agents and executives involved. They don't want to be quoted by name for fear of retaliation. These are their allegations. \n\n \n \nThey don't want to be quoted by name for fear of retaliation. These are their allegations.\n\n \n Retaliation? Say it ain't so! From whom? Why?\n \n \nSources tell CBS News several gun shops wanted to stop the questionable sales, but ATF encouraged them to continue.\n\n \n \nSources\n\n \n Which sources? Why no names?\n \n \nInsiders say it's a dangerous tactic called letting the guns, \"walk.\"\n\n \n \nInsiders\n\n \n Names?\n \n \nOne agent called the strategy \"insane.\" Another said: \"We were fully aware the guns would probably be moved across the border to drug cartels where they could be used to kill.\" \n\n \n \nOne agent\n\n \n Name?\n \n \nAnother \n\n \n Name?\n \n \nOn the phone, one Project Gunrunner source (who didn't want to be identified) told us just how many guns flooded the black market under ATF's watchful eye.\n \n \n \nwho didn't want to be identified\n\n \n Why not?\n \n \nCBS News has been told at least 11 ATF agents and senior managers voiced fierce opposition to the strategy. \"It got ugly...\" said one. There was \"screaming and yelling\" says another. A third warned: \"this is crazy, somebody is gonna to get killed.\" \n\n \n \n11 ATF agents and senior managers voiced fierce opposition\n\n \n Yet none are willing to offer their name?\n \n \nOne agent argued with a superior asking, \"are you prepared to go to the funeral of a federal officer killed with one of these guns?\" Another said every time there was a shooting near the border, \"we would all hold our breath hoping it wasn't one of 'our' guns.\"\n\n \n \nOne agent\n\n \n Name?\n \n \nAnother\n\n \n Name?\n \n \n\"You feel like s***. You feel for the parents,\" one ATF veteran told us.\n\n \n \none ATF veteran \n\n \n Which one?\n \n \nIn a letter, the Justice Department which oversees ATF says the agency has never knowingly allowed the sale of assault weapons to suspected gunrunners.\n \n \n Nah. All you folks wondering why nobody wants to give their name are simply conspiracy thoerists off on a lark. There's absolutely no eidence whatsoever that there's anything to hide at the ATF. You're just imagining things. Typical right-wing wackos.\n \n After all, can't you see the clear transparency in this article? Accusations of conspiracies are obviously untrue since ATF agents are so forthcoming. \n \n Why, I've scrutinized this article and can find no instances of secrecy or desire to remain anonymous at all.", 
   {}, 
   424747, 
   null, 
   1298656500.0
  ], 
  [
   424807, 
   null, 
   "sinjin", 
   "Fear of reprisal and career suicide doesn't equal corruption.", 
   {}, 
   424796, 
   null, 
   1298671380.0
  ], 
  [
   424812, 
   null, 
   "Superlite27", 
   "Fear of reprisal and career suicide doesn't equal corruption.\n\n \n Reprisal for what? What action would be considered \"career suicide\"? How does being transparent justify \"reprisal\"? These are government officials. Aren't they beholden to the taxpayer (general public)? \n \n You say they are remaining anonymus for fear of reprisal.\n \n Reprisal? For being honest? For government transparency? For keping us informed of our public servant's actions?\n \n Are you honestly saying that this agency (or any other for that matter) shouldn't have any oversight?\n \n I'm not sure I agree that having a government entity operate without discretion and beholden to nobody in a civilian authority would be a good idea.\n \n I mean, they already enact federal law without one single iota of congressional oversight. They are currently in the process of considering whether or not to make (now lawful) pistol-grip equipped shotguns a federally controlled \"destructive device\". How about that! TA-DA! No house bill, or vote by congress to enact legislation, just a memo from the director because he thinks it's a good idea, and KAPOW! We now have hundreds of thousands of felons who are in violation of federal law! \n \n DUE PROCESS? WE DON'T NEED NO STEENKING DUE PROCESS! WE'RE THE ATF!\n \n But don't worry. Anyone getting caught trying to be honest and shed light on anything questionable will be...\n \n How did you put it, sinjin?\n \n \"In fear of...\nreprisal and career suicide\n\n \n You agree with this being acceptable? You can't deny the numerous examples of this \"fear of reprisal\". \n \n Reprisal for what? Honesty? This is a good thing? You want your government to keep its misconduct a secret? You don't think there should be any oversight of a government agency that (unconstitutionally) can dictate Federal Law by simply issuing a press release or office memo?", 
   {}, 
   424807, 
   null, 
   1298676240.0
  ], 
  [
   424813, 
   null, 
   "Pietro", 
   "Fear of reprisal and career suicide doesn't equal corruption.\n\n \n Question time again.\n \n For some reason Sinjin you seem to be highly resistant to the claims of others regarding what qualifies as blackmail or extortion or corruption. \n \n Exactly what action would the ATF have to carry out before you would consider it a genuine example of internal corruption and disregard for the law and the order they're supposed to uphold, enforce, and abide by?", 
   {}, 
   424807, 
   null, 
   1298676360.0
  ], 
  [
   424826, 
   null, 
   "Superlite27", 
   "Exactly what action would the ATF have to carry out before you would consider it a genuine example of internal corruption and disregard for the law and the order they're supposed to uphold, enforce, and abide by?\n\n \n Evidently, refusal to prevent the transfer of a weapon to a prohibited individual (that they hypocritically would crucify anyone else for doing) leading to the murder of a fellow law enforcement officer doesn't quite meet the criteria.\n \n Since this is a pretty serious situation, it obviously means quantity is the determinant instead of quality.\n \n I guess ATF negligence must lead to mass casualties in order to raise questions of oversight. Obviously, the brutal murder of one innocent victim just isn't serious enough to override the perception that fear of reprisal is a \"neccessary evil\" and that agents who wish to speak about things in the ATF beurocracy they disagree with deserve the retaliation they will obviously be faced with from superiors for their transparency.", 
   {}, 
   424813, 
   null, 
   1298700660.0
  ], 
  [
   424831, 
   null, 
   "Doc Jones", 
   "Fear of reprisal and career suicide doesn't equal corruption.\n\n \n Like **** it doesn't. It is a direct violation of the whistleblower act and congressional oversight.\n \n You keep right on defending a criminal rogue agency already criticized by two government watchdog agencies.\n \n Want to tell me again how kalifornia's ban on ammo delivery via common carrier and in BULK to individuals got shot down as unConstitutional? ROTFLMAO and you keep defending the indefensible, you have no morals nor sense of justice and a certainly out of touch with the Constitution. Your repetitive wrong headiness is even more evident than it used to be which is saying a lot. That is not the action of an activist, that is the mark of insanity.", 
   {}, 
   424807, 
   null, 
   1298731080.0
  ], 
  [
   424832, 
   null, 
   "Doc Jones", 
   "I never look for much posting by antis on weekends. They can't use their work computers and screw the boss and taxpayers out of honest services. Their zeal only runs high when they can hide behind their unions and SEIU commie carrying liberals. emoticon_smile", 
   {}, 
   424831, 
   null, 
   1298731500.0
  ], 
  [
   424838, 
   null, 
   "Superlite27", 
   "You keep right on defending a criminal rogue agency already criticized by two government watchdog agencies.\n \n Your repetitive wrong headiness is even more evident than it used to be which is saying a lot. That is not the action of an activist, that is the mark of insanity.\n\n \n Come on Doc!\n \n Haven't you figured it out?\n \n Any firearms related activity or policy is BAD! If a person wants a firearm for self defense: GUN = BAD. If a person enjoys shooting sports: GUN = BAD. If a person has any compunction or feelings of the RIGHT to keep or bear arms for any legitimate reason: = BAD.\n \n They will rant and rave, use completely illogical arguments, and scream out loud in tantrums about how \"it's for the safety of society\" or \"we need regulation to save lives\". Anything regarding firearms + civilians will be fought tooth and nail in the name of compassion, safety, or goodness. IT'S ABOUT SAVING LIVES!......\n \n ....unless you have a shiny \"badge\" and work for the government.\n \n Then, F*%K SAFETY! It no longer matters how many innocents die in the forwarding of the agenda. It's the government! They tell us they're keeping us safe! Guns are good! They need guns to protect themselves and do their jobs! They have badges! What's a few dead bodies? They have laws to enforce. \n \n All that \"it's for the children\" XXXX goes right out the window. \n \n It's kind of telling when they start defending the actions of people who do the very things they proclaim to be fighting against: Loss of life due to misuse of firearms.\n \n Once again the double standard screams \"hypocrite\" in everyone's face. I still marvel at the mental disconnect that argues against the availability of firearms....unless you have a shiny metal disk that, evidently, sanctions any manner of ineptness and negligence regarding the very inanimate object they propose to be trying to regulate.\n \n What an obvious neon sign pointing a big flashing arrow at the contradiction. It is impossible to believe they cannot see it, therefore, it can only be concluded that it is willful ignorance and purposeful malevolence.\n \n If a civilian had caused the straw purchase, illegal sale, unlawful transportation, and brutal murder of Agent Brian Terry, THEY WOULD BE SLAPPING US IN THE FACE WITH IT!\n \n Doesn't the fact that, since it was a government agency that messed up, they are doing their damndest to defend against the repurcussions tell everyone all they need to know about where their priorities really lie?", 
   {}, 
   424831, 
   null, 
   1298745900.0
  ], 
  [
   424839, 
   null, 
   "daewoo", 
   "\n \n Your analogies suck routinely. LE often allows criminal activity to proceed as part of a larger investigation and you well know it. Sadly, a man may have lost his life as a consequence of this decision made by someone in authority at BATFE.\n\n \n This is demonstrably FALSE in this case. No effort was made to track the weapons once they crossed the border. Mexican law enforcement was not even informed of the operation, so they did not even know in the vaguest of terms to be on the look out for these weapons. There was no effort whatsoever to conduct a \"larger investigation\". The ATF simply ordered gun dealers to knowingly make illegal weapon sales. \n \n Frankly at this point the whistleblowers claim that the entire point of the operation was to put more guns across the border so ATF could justify their budget seems the most likely explanation. \n \n This is especially true when you consider the fact that last year the justice departments inspector general gave project gunrunner a scathing review. They questioned the usefulness of the entire program, citing the fact that MOST of the guns that the ATF had traced during the operation had been sitting in police storage rooms for years. The report says in no uncertain terms that mexican law enforcement does not see the ATFs tracing efforts as being at all helpful. They dont really care where a gun used to commit a murder 5 years ago came from. \n \n So, we have a bunch of republicans in congress promising budget cuts and saying that everything is on the table. WE have a federal agency, the BATFE, whose primary activity over the last 2 years (because the FBI has taken over the \"explosives\" portion of their duties) has just been called useless by the justice department...and a large part of the reason it is considered \"worthless\" is the fact that they are not managing to trace very many new guns that are being found in mexico, and nobody cares about the old ones.\n \n Now we have caught said agency frankly arranging for the transportation of thousands of new guns into mexico, with no efforts to track what happens to them, thus precluding the possibility that this was part of a wider investigation. \n \n I am having trouble imagining a scenario where this is anything but the ATF committing crimes in order to justify their budget.", 
   {}, 
   424747, 
   null, 
   1298750940.0
  ], 
  [
   424841, 
   null, 
   "Doc Jones", 
   "This is demonstrably FALSE in this case. No effort was made to track the weapons once they crossed the border. Mexican law enforcement was not even informed of the operation, so they did not even know in the vaguest of terms to be on the look out for these weapons. There was no effort whatsoever to conduct a \"larger investigation\". The ATF simply ordered gun dealers to knowingly make illegal weapon sales. \n \n Frankly at this point the whistleblowers claim that the entire point of the operation was to put more guns across the border so ATF could justify their budget seems the most likely explanation. \n \n This is especially true when you consider the fact that last year the justice departments inspector general gave project gunrunner a scathing review. They questioned the usefulness of the entire program, citing the fact that MOST of the guns that the ATF had traced during the operation had been sitting in police storage rooms for years. The report says in no uncertain terms that mexican law enforcement does not see the ATFs tracing efforts as being at all helpful. They dont really care where a gun used to commit a murder 5 years ago came from. \n \n So, we have a bunch of republicans in congress promising budget cuts and saying that everything is on the table. WE have a federal agency, the BATFE, whose primary activity over the last 2 years (because the FBI has taken over the \"explosives\" portion of their duties) has just been called useless by the justice department...and a large part of the reason it is considered \"worthless\" is the fact that they are not managing to trace very many new guns that are being found in mexico, and nobody cares about the old ones.\n \n Now we have caught said agency frankly arranging for the transportation of thousands of new guns into mexico, with no efforts to track what happens to them, thus precluding the possibility that this was part of a wider investigation. \n \n I am having trouble imagining a scenario where this is anything but the ATF committing crimes in order to justify their budget.\n\n \n Wow, you sure got that one down pat and complete. Good Shot! Dead Center of the X in the X ring.", 
   {}, 
   424839, 
   null, 
   1298754900.0
  ], 
  [
   424886, 
   null, 
   "Superlite27", 
   "I am having trouble imagining a scenario where this is anything but the ATF committing crimes in order to justify their budget.\n\n \n .....and daewoo wins the thread!", 
   {}, 
   424839, 
   null, 
   1298824260.0
  ], 
  [
   425045, 
   null, 
   "Doc Jones", 
   "Gunwalker Gun Implicated in Second Federal Agent&#8217;s Murder | The Truth About Guns\n \n \n\n According to an affidavit in the arrest of alleged straw purchasers, Otilio and Ranferi Osorio, and Kelvin Morrison, they had previously sold 40 guns to a federal agent, but had not been arrested.\n \n Dallas ATF spokesman Tom Crowley would not release details about when the gun was purchased, or whether the suspected straw buyers were under active ATF surveillance at the time the murder gun was purchased. He referred questions on details to the U.S. Justice Department in Washington.\n \n So far, DOJ has not been forthcoming. We received word from Sen. Chuck Grassley's office today that AG Holder failed to respond to the Senator's questions about the AZ scandal by the Feb. 23 deadline Grassley had set.\n \n Today, The Firearms Coalition asked Sen. Grassley to call for hearings into both the AZ and Texas investigations, requiring ATF Executives to testify under oath. We received assurance today that the Senator remains resolute, and that staffers are burning the midnight oil on this investigation.\n \n \n\n \n \n \n FoxNews.com - Gun Used to Kill ICE Agent in Mexico Traced to Dallas, U.S. Investigators Say", 
   {
    "post_info": {
     "post_title": "Another Agent pays for Project Gunwalker:"
    }, 
    "unicode_changes_made": true
   }, 
   424886, 
   null, 
   1299075540.0
  ], 
  [
   425194, 
   null, 
   "Galileo", 
   "\"It was an attempt to apply the tactics of a narcotics investigation, in which small-scale drug buyers are allowed to operate under surveillance in the hope of catching their more powerful cartel counterparts.\n \n \"But several veteran agents were outraged at the shift, saying that there is a big difference between tracking drugs and tracking guns. They saw the change as a violation of a sacred ATF policy: Make the big case or don't make the big case, but don't let the guns go....\n \n \"The department said that Project Gunrunner, the umbrella operation across the Southwest border of which Operation Fast and Furious was a part, has resulted in the seizure of more than 10,000 firearms and 1.1 million rounds of ammunition destined for Mexico since 2006.\n \n \"But Grassley produced documents provided by ATF agents in Phoenix and elsewhere that showed that weapons bought by straw purchasers who were under surveillance were finding their way to Mexico, in addition to the two guns found at the scene of Terry's shooting.\"\n Mexico, drug cartels: U.S. gun-tracing operation let firearms into criminal hands - latimes.com\n \n So it appears to me this new strategy was controversial but not wholly unsuccessful.", 
   {}, 
   425045, 
   null, 
   1299223500.0
  ], 
  [
   425202, 
   null, 
   "daewoo", 
   "\"It was an attempt to apply the tactics of a narcotics investigation, in which small-scale drug buyers are allowed to operate under surveillance in the hope of catching their more powerful cartel counterparts.\n \n \"But several veteran agents were outraged at the shift, saying that there is a big difference between tracking drugs and tracking guns. They saw the change as a violation of a sacred ATF policy: Make the big case or don't make the big case, but don't let the guns go....\n \n \"The department said that Project Gunrunner, the umbrella operation across the Southwest border of which Operation Fast and Furious was a part, has resulted in the seizure of more than 10,000 firearms and 1.1 million rounds of ammunition destined for Mexico since 2006.\n \n \"But Grassley produced documents provided by ATF agents in Phoenix and elsewhere that showed that weapons bought by straw purchasers who were under surveillance were finding their way to Mexico, in addition to the two guns found at the scene of Terry's shooting.\"\n Mexico, drug cartels: U.S. gun-tracing operation let firearms into criminal hands - latimes.com\n \n So it appears to me this new strategy was controversial but not wholly unsuccessful.\n\n \n Uh...no. Go back and read it again. \n \n I will be the first to agree that it is phrased deceptively, but the 10,000 weapons seized and 1.1 million rounds of ammo seized are the \"fruits\" of project gunrunner as a whole, NOT the result of the \"new strategy\".\n \n As far as the \"new strategy\" goes, it does not exist. No efforts were made to track the weapons once they crossed the border and mexican law enforcement was not even given a heads up that the ATF was helping straw purchasers get thousands of guns to send across the border. \n \n That being the case, there is NO POSSIBILITY that the \"new strategy\" could even possibly be successful since the plan lacked a vital component typically included in law enforcement strategies...namely arresting the bad guys. Granted, now that they have been caught they are going around and arresting the people who they have been helping smuggle guns for over a year now. \n \n I just cant seem to find it in my heart to cut the ATF any slack over this. They are blowing tax dollars on a pointless operation, and have been complicit in smuggling weapons in order to justify their budget. There is not another side to this story. \n \n There is no question that US weapons are being used in Mexico:\n \n http://news.infoshop.org/article.php?story=20110213034624314\n \n \nPentagon Fingered as a Source of Narco-Firepower in Mexico\n \n The Big Clubs in Mexico's Drug War Aren't Slipping Through the Gun-Show Loophole\n \n Another series of leaked State Department cables made public this week by WikiLeaks lend credence to investigative reports on gun trafficking and the drug war published by Narco News as far back as 2009.\n \n Rather, we reported at the time, \"the drug trafficking organizations are now in possession of high-powered munitions in vast quantities that can't be explained by the gun-show loophole.\"\n \n Those weapons, found in stashes seized by Mexican law enforcers and military over the past several years, include U.S.-military issued rifles, machine guns, grenade launchers and explosives.\n \n The State Department cables released recently by WikiLeaks support Narco News' reporting and also confirm that our government is very aware that much of the heavy firepower now in the hands of Mexican criminal organizations isn't linked to mom-and-pop gun stores, but rather the result of blowback from U.S. arms-trading policies (both current and dating back to the Iran/Contra era) that put billions of dollars of deadly munitions into global trade stream annually.\n \n\n \n \n To put this into perspective, the drug traffickers are estimated to have roughly 470,000 people in their organizations that they can call upon to fight. Suddenly 10,000 guns seized by the billion dollar operation gunrunner looks pretty pathetic. And they have known this since 2007. \n \n So the cartels are literally cleaning out mexican army weapons depots, and arming themselves with everything from M4's to grenade launchers to .50 heavy machine guns. How worried to we really need to be about semi automatic weapons from the US ending up in mexico?", 
   {
    "unicode_changes_made": true
   }, 
   425194, 
   null, 
   1299233640.0
  ], 
  [
   425207, 
   null, 
   "Pietro", 
   "So it appears to me this new strategy was controversial but not wholly unsuccessful.\n\n \n Not wholly unsuccessful? The ATF withheld information from the authorities in Mexico that would alert them of this operational procedure of allowing guns to be trafficked into Mexico by people they knew or hard reason to suspect were going to do just that. They failed to alert anybody, even ICE, about this new program.\n \n And for what exactly? 10,000 guns? That number is exceedingly small to warrant a budget request of $81.3 million.", 
   {}, 
   425194, 
   null, 
   1299252720.0
  ], 
  [
   425211, 
   null, 
   "Superlite27", 
   "...and I was under the assumption that anti's were pushing control as a means to save lives.\n \n This is obviously complete malarky because they are now reasoning that the murder of Brian Terry is just part of the cost of doing business.\n \n \n \nSo it appears to me this new strategy was controversial but not wholly unsuccessful.\n\n \n \n Hooray! It's a success! \n \n And its only cost was the teeny tiny little deaths of just a couple of Law Enforcement Officers that nobody really care about.\n \n What a bargain, huh Galileo?\n \n Don't ever open your F^%$ING mouth about saving lives again.", 
   {}, 
   425194, 
   null, 
   1299257040.0
  ], 
  [
   425220, 
   null, 
   "Brady", 
   "Concealed carry results in way more people getting murdered than whatever the ATF does. 288 deaths so far.", 
   {}, 
   425211, 
   null, 
   1299270300.0
  ], 
  [
   425221, 
   null, 
   "Pietro", 
   "Concealed carry results in way more people getting murdered than whatever the ATF does. 288 deaths so far.\n\n \n I've addressed your claims already Brady. See here http://www.4forums.com/political/gun-control-debates/15089-hypocrisy-one-called-brady.html", 
   {}, 
   425220, 
   null, 
   1299270420.0
  ], 
  [
   425225, 
   null, 
   "NATO 556", 
   "We've got more news on the ATF deliberately trafficking guns to Mexico. Not only did they know about it they actually videotaped it taking place. And we now have an agent willing to give his name in response.\n \n Agent: I was ordered to let U.S. guns into Mexico - CBS Evening News - CBS News\n \n \nWASHINGTON - Federal agent John Dodson says what he was asked to do was beyond belief.\n \n He was intentionally letting guns go to Mexico?\n \n \"Yes ma'am,\" Dodson told CBS News. \"The agency was.\"\n \n An Alcohol, Tobacco and Firearms senior agent assigned to the Phoenix office in 2010, Dodson's job is to stop gun trafficking across the border. Instead, he says he was ordered to sit by and watch it happen.\n \n Investigators call the tactic letting guns \"walk.\" In this case, walking into the hands of criminals who would use them in Mexico and the United States. \n \n Dodson's bosses say that never happened. Now, he's risking his job to go public.\n \n \"I'm boots on the ground in Phoenix, telling you we've been doing it every day since I've been here,\" he said. \"Here I am. Tell me I didn't do the things that I did. Tell me you didn't order me to do the things I did. Tell me it didn't happen. Now you have a name on it. You have a face to put with it. Here I am. Someone now, tell me it didn't happen.\"\n \n Agent Dodson and other sources say the gun walking strategy was approved all the way up to the Justice Department. The idea was to see where the guns ended up, build a big case and take down a cartel. And it was all kept secret from Mexico.\n \n ATF named the case \"Fast and Furious.\"\n \n Surveillance video obtained by CBS News shows suspected drug cartel suppliers carrying boxes of weapons to their cars at a Phoenix gun shop. The long boxes shown in the video being loaded in were AK-47-type assault rifles.\n \n So it turns out ATF not only allowed it - they videotaped it.\n \n Documents show the inevitable result: The guns that ATF let go began showing up at crime scenes in Mexico. And as ATF stood by watching thousands of weapons hit the streets... the Fast and Furious group supervisor noted the escalating Mexican violence.\n \n One e-mail noted, \"958 killed in March 2010 ... most violent month since 2005.\" The same e-mail notes: \"Our subjects purchased 359 firearms during March alone,\" including \"numerous Barrett .50 caliber rifles.\"\n \n Dodson feels that ATF was partly to blame for the escalating violence in Mexico and on the border. \"I even asked them if they could see the correlation between the two,\" he said. \"The more our guys buy, the more violence we're having down there.\"\n \n Senior agents including Dodson told CBS News they confronted their supervisors over and over.\n \n Their answer, according to Dodson, was, \"If you're going to make an omelette, you've got to break some eggs.\"\n \n There was so much opposition to the gun walking, that an ATF supervisor issued an e-mail noting a \"schism\" among the agents. \"Whether you care or not people of rank and authority at HQ are paying close attention to this case...we are doing what they envisioned.... If you don't think this is fun you're in the wrong line of work... Maybe the Maricopa County jail is hiring detention officers and you can get $30,000 ... to serve lunch to inmates...\"\n \n \"We just knew it wasn't going to end well. There's just no way it could,\" Dodson said. \n \n On Dec. 14, 2010, Border Patrol Agent Brian Terry was gunned down. Dodson got the bad news from a colleague.\n \n According to Dodson, \"They said, 'Did you hear about the border patrol agent?' And I said, 'Yeah.' And they said 'Well it was one of the Fast and Furious guns.' There's not really much you can say after that.\"\n \n Two assault rifles ATF had let go nearly a year before were found at Terry's murder.\n \n Dodson said, \"I felt guilty. I mean it's crushing. I don't know how to explain it.\"\n \n Sen. Grassley began investigating after his office spoke to Dodson and a dozen other ATF sources -- all telling the same story. \n \n The response was \"practically zilch,\" Grassley said. \"From the standpoint that documents we want - we have not gotten them. I think it's a case of stonewalling.\"\n \n Dodson said he hopes that speaking out helps Terry's family. They haven't been told much of anything about his murder - or where the bullet came from.\n \n \"First of all, I'd tell them that I'm sorry. Second of all, I'd tell them I've done everything that I can for them to get the truth,\" Dodson said. \"After this, I don't know what else I can do. But I hope they get it.\"\n \n Dodson said they never did take down a drug cartels. However, he said thousands of Fast and Furious weapons are still out there and will be claiming victims on both sides of the border for years to come.\n \n Late tonight, the ATF said it will convene a panel to look into its national firearms trafficking strategy. But it refused to comment specifically on Sharyl's report.\n \n Statement from Kenneth E. Melson, Acting Director, Bureau of Alcohol, Tobacco, Firearms and Explosives:\n \n \"The Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) will ask a multi-disciplinary panel of law enforcement professionals to review the bureau's current firearms trafficking strategies employed by field division managers and special agents. This review will enable ATF to maximize its effectiveness when undertaking complex firearms trafficking investigations and prosecutions. It will support the goals of ATF to stem the illegal flow of firearms to Mexico and combat firearms trafficking in the United States.\"\n", 
   {}, 
   424796, 
   null, 
   1299271260.0
  ], 
  [
   425226, 
   null, 
   "Brady", 
   "I've addressed your claims already Brady. See here http://www.4forums.com/political/gun-control-debates/15089-hypocrisy-one-called-brady.html\n\n False outrage about 1 or 2 deaths but supporting concealed carry which has caused hundreds of deaths VPC - The Violence Policy Center - Concealed Carry Killers shows who the true hypocrites are!", 
   {}, 
   425221, 
   null, 
   1299271560.0
  ], 
  [
   425231, 
   null, 
   "Doc Jones", 
   "False outrage about 1 or 2 deaths but supporting concealed carry which has caused hundreds of deaths VPC - The Violence Policy Center - Concealed Carry Killers shows who the true hypocrites are!\n\n \n \n False delimma, substitution of deaths for murder. CCW is a right and so is the right to self defense by deadly force.\n \n A rogue agency intentionally causing MURDER of LE is not self defense and you make a poor attempt to link the two. Of course, those two murders permitted, aided and abetted by the ATF are only the LE they know about and doesn't include citizens here nor in MEXICO.\n \n I submit brady and VPC has caused the loss of more innocent lives than citizenry carring ever will.", 
   {}, 
   425226, 
   null, 
   1299272580.0
  ], 
  [
   425240, 
   null, 
   "Superlite27", 
   "Concealed carry results in way more people getting murdered than whatever the ATF does. 288 deaths so far.\n\n \n 288 deaths? That's it?\n \n Oh yeah. Since 1995, right?\n \n Do you care to tell us how many of these were justified cases of self defense?\n \n O.K., Brady, since you're counting killings, how about you compare the number of killings by CCW holders and compare it with the general population over the same timeframe?\n \n Out of 84,000 or so killings since 1995, CCW holders are accountable for only 288 when compared to the 83,722 by non CCW holders?\n \n Who do you think I'd rather be in mixed company with? A person who has successfully passed a FBI background check, an interpol search, and is only responsible for .0034285% (Less than 4 tenths of a percentage!) of all killings (not murders...KILLINGS).....\n \n ...or the general population who have never had a background check and are responsible for 99.99685% of all killings?\n \n Brady's logical conclusion is to get rid of the group who's responsible for only \n .0034285% of killings in order to esure they are assimilated into the group that commits over 99.9% of the killings?\n \n What a genius. Can't have those statistically safer folks around. Why can't they kill a lot of people like the rest of the population? (Nevermind. We'll just post the specific number without any frame of reference so it will seem like a lot! We won't bother to post any info on timeframe or the amount of killings by non CCW holders in order to allow a comparison!)\n \n Intellectual dishonesty much?", 
   {}, 
   425220, 
   null, 
   1299281220.0
  ], 
  [
   425254, 
   null, 
   "Doc Jones", 
   "BATFE ought to be a convenience store:\n \n \nAbuse Continues at BATFE\n \n The Bureau of Alcohol, Tobacco, Firearms and Explosives (BATFE) is entangled in yet another scandal.\n \n The latest controversy involves Project Gunrunner. The BATFE knowingly allowed firearms to get into the hands of Mexican drug gangs, instructing American gun dealers to go ahead with questionable-and even illegal-gun sales. When two of these guns wound up at the crime scene of a murdered Border Patrol agent, at least one U.S. Senator is calling the agency to task.\n \n In addition, Gun Owners of America has written a petition to the Congress, urging that the BATFE be stripped of its jurisdiction over firearms.\n \n The history of this agency is one marred in abuse of its power and the trampling of the rights of Americans. In fact, as far back as 1982, a Senate subcommittee noted that ATF \"has trampled upon the Second Amendment by chilling exercise of the right to keep and bear arms by law-abiding citizens.\"\n \n Action: Please click here and follow the link to learn more about the recent outrage along the border, and sign a petition that will be delivered straight to your Representative and Senators asking them to rein in this unconstitutional agency.\n \n", 
   {
    "unicode_changes_made": true
   }, 
   425240, 
   null, 
   1299285180.0
  ], 
  [
   425264, 
   null, 
   "Brady", 
   "288 deaths? That's it?\n \n Oh yeah. Since 1995, right?\n \n Do you care to tell us how many of these were justified cases of self defense?\n \n O.K., Brady, since you're counting killings, how about you compare the number of killings by CCW holders and compare it with the general population over the same timeframe?\n \n Out of 84,000 or so killings since 1995, CCW holders are accountable for only 288 when compared to the 83,722 by non CCW holders?\n \n Who do you think I'd rather be in mixed company with? A person who has successfully passed a FBI background check, an interpol search, and is only responsible for .0034285% (Less than 4 tenths of a percentage!) of all killings (not murders...KILLINGS).....\n \n ...or the general population who have never had a background check and are responsible for 99.99685% of all killings?\n \n Brady's logical conclusion is to get rid of the group who's responsible for only \n .0034285% of killings in order to esure they are assimilated into the group that commits over 99.9% of the killings?\n \n What a genius. Can't have those statistically safer folks around. Why can't they kill a lot of people like the rest of the population? (Nevermind. We'll just post the specific number without any frame of reference so it will seem like a lot! We won't bother to post any info on timeframe or the amount of killings by non CCW holders in order to allow a comparison!)\n \n Intellectual dishonesty much?\n\n You dont fool me. You get all 'outraged' about 1 or 2 deaths because of ATF mistakes but suddenly 288 deaths isnt very many. I wonder why emoticon_wow What a tangled web you weave when you at first you practice to decieve....", 
   {}, 
   425240, 
   null, 
   1299289260.0
  ], 
  [
   425266, 
   null, 
   "Pietro", 
   "You dont fool me. You get all 'outraged' about 1 or 2 deaths because of ATF mistakes but suddenly 288 deaths isnt very many. I wonder why emoticon_wow What a tangled web you weave when you at first you practice to decieve....\n\n \n Mistakes by the ATF? You call deliberately allowing hundreds of crimes to take place a mistake? Is that how low you're willing to stoop Brady? Two gun related deaths mean nothing to you, and straw purchases are a simple mistake that supposedly don't warrant criminal investigation and penalties?", 
   {}, 
   425264, 
   null, 
   1299289320.0
  ], 
  [
   425326, 
   null, 
   "Doc Jones", 
   "Mistakes by the ATF? You call deliberately allowing hundreds of crimes to take place a mistake? Is that how low you're willing to stoop Brady? Two gun related deaths mean nothing to you, and straw purchases are a simple mistake that supposedly don't warrant criminal investigation and penalties?\n\n \n Well yeah, that is exactly how Scott brady looks at it. Else he wouldn't have had Sarah straw purchase a gun for him because he couldn't pass the brady NICS check, a 'sniper rifle' by their own definition.", 
   {}, 
   425266, 
   null, 
   1299343680.0
  ], 
  [
   425338, 
   null, 
   "Brady", 
   "Well yeah, that is exactly how Scott brady looks at it. Else he wouldn't have had Sarah straw purchase a gun for him because he couldn't pass the brady NICS check, a 'sniper rifle' by their own definition.\n\n You werent there so you wouldnt know and look whose talking. You already admitted to being part of a straw purchase. You knew the lady was buying the guns for the criminal she was talking to on the phone but you sold them to her anyway. Isnt that a felony?", 
   {}, 
   425326, 
   null, 
   1299376500.0
  ], 
  [
   425342, 
   null, 
   "Pietro", 
   "You werent there so you wouldnt know and look whose talking. You already admitted to being part of a straw purchase. You knew the lady was buying the guns for the criminal she was talking to on the phone but you sold them to her anyway. Isnt that a felony?\n\n \n If such is truly illegal and punishable by felony conviction then why exactly did the ATF all but order licensed dealers to engage in behavior that broke the law? How does a law enforcement division order private individuals to commit felony offenses?\n \n Agent: I was ordered to let U.S. guns into Mexico - CBS Evening News - CBS News\n \n \nAn Alcohol, Tobacco and Firearms senior agent assigned to the Phoenix office in 2010, Dodson's job is to stop gun trafficking across the border. Instead, he says he was ordered to sit by and watch it happen.\n\n \n \nSurveillance video obtained by CBS News shows suspected drug cartel suppliers carrying boxes of weapons to their cars at a Phoenix gun shop. The long boxes shown in the video being loaded in were AK-47-type assault rifles.\n \n So it turns out ATF not only allowed it - they videotaped it.\n\n \n http://www.cbsnews.com/stories/2011/02/23/eveningnews/main20035609.shtml?tag=cbsnewsSectionContent.1\n \n \nSources tell CBS News several gun shops wanted to stop the questionable sales, but ATF encouraged them to continue.\n\n \n And just so you're aware Brady, Doc Jones didn't commit any sort of felony. And I know this because I remember the message you're referring to. He specifically says that he worked at a gun store, not that he was the manager who's actually licensed to make the sales. See for yourself. http://www.4forums.com/political/419756-post35.html\n \n \nFYI, the multiple sales in one week are reported to the county sheriffs, at least in Texas who also report unusual activity. I once worked at a gun store, one day we had a gal buying some Beretta pistols. She called her contact on a mobile phone and unknown to anyone, I speak and understand good Spanish. I alerted the boss when she was approved and she was picked up with accomplices at the meeting place.\n", 
   {}, 
   425338, 
   null, 
   1299377820.0
  ], 
  [
   425358, 
   null, 
   "Doc Jones", 
   "You werent there so you wouldnt know and look whose talking.\n\n \n Your mother's actions made national news Scott. You were made an honorary member of CCKBA :) You wouldn't know a straw purchase if it jumped up and bit you on the .... face emoticon_xgood In fact, you don't know what the heck you are talking about 99% of the time. You should just leave it for the more intelligent to discuss? emoticon_smile\n \n \nYou already admitted to being part of a straw purchase. You knew the lady was buying the guns for the criminal she was talking to on the phone but you sold them to her anyway. Isnt that a felony?\n\n \n Thanks Pietro for trying to explain it to Scott, he is a little slow on the draw and not the sharpest knife in it either. I think singlehandedly he has almost completely made a laughing stock out of his namesake :) Let's hope he keeps posting and showing his meager education for the world to see.\n \n Hey Scott, what do you think about the batfe thugs ordering their men to follow unconstitutional orders and to break the law? ... and here you were hoping for another Ruby Ridge or Waco or anything to punish Constitutional Rights and hoping to line your pockets. I personally hope you freeze and starve to death in the dark for your parents' sins and your own. :xcensored\n \n You understand that government employees take an oath to \"uphold and defend THIS CONSTITUTION from all enemies both domestic and foreign\" and have a DUTY TO DISOBEY AN UNCONSTITUTIONAL ORDER. You applaud the lawbreakers because it makes it appear that their prophecy is coming true which wouldn't make a difference in a right; obama knows he is bound by the Constitution so any transgressions will be willfull and subject to the punishments of LAW.", 
   {}, 
   425338, 
   null, 
   1299414240.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Project Gunwalker", 
  "url": "http://www.4forums.com/political/gun-control-debates/15011-project-gunwalker.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15011, 
  "discussion_files": [
   [
    "14160.html", 
    "http://www.4forums.com/political/gun-control-debates/15011-project-gunwalker-print.html"
   ], 
   [
    "14161.html", 
    "http://www.4forums.com/political/gun-control-debates/15011-project-gunwalker-4-print.html"
   ], 
   [
    "14162.html", 
    "http://www.4forums.com/political/gun-control-debates/15011-project-gunwalker-3-print.html"
   ], 
   [
    "14163.html", 
    "http://www.4forums.com/political/gun-control-debates/15011-project-gunwalker-2-print.html"
   ]
  ], 
  "identifier": 15011
 }
]