[
 [
  [
   424795, 
   null, 
   "daewoo", 
   "Board votes to dismiss all Providence teachers / Video | Rhode Island news | projo.com | The Providence Journal\n \n \nPROVIDENCE - After two hours of contentious discussion, the School Board voted 4 to 3 Thursday night to send out termination notices to each of the city's 1,926 public school teachers.\n \n More than 700 teachers jammed a high school gymnasium to tell school officials that their hearts were broken, their trust violated and their futures as teachers jeopardized. \n\n \n \nTeachers begged the School Board to issue layoffs rather than fire them outright because, under the layoff provisions, teachers are recalled based on seniority. There is no guarantee that seniority would be used to bring back any of the fired teachers. School leaders have been vague about exactly how seniority will play out in the case of terminations. \n\n \n GUTSY move and one I support 100%. \n \n First, I think it is probably a little on the dishonest side for the teachers to claim that they \"dont understand\" why they are being terminated instead of furloughed. If they REALLY dont understand, then they are stoopid and should not be teaching kids anyway. They are being terminated instead of furloughed so the school board can get around seniority based union restrictions. By terminating all the teachers they can hire back the GOOD ones and let the bad ones go on to be bad teachers elsewhere. \n \n I know that it is a SHOCKING idea to teachers unions, federal workers unions, and state government employee unions, but basically the hiring will be MERIT based. ++GASP++\n \n We have to get these public sector unions under control and if that means busting them, then so be it. \n \n Public sector unions are not like private sector unions where there is \"management\" sitting on the other side of the table in an adversarial position. Public sector unions support their own candidates and essentially end up \"negotiating\" with other public sector employees. The only group that does NOT get a seat at the table is the one paying for their incredibly generous compensation packages...the american people.", 
   {
    "post_info": {
     "post_title": "Providence fires ALL their teachers"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1298656080.0
  ], 
  [
   424799, 
   null, 
   "Steeeeve", 
   "It's like pulling teeth to bring our house back in order and yet when push comes to shove the tough decisions ARE being made...I guess at this point there is no other option. Frankly, I'm a little shocked it's somewhat working.", 
   {}, 
   424795, 
   null, 
   1298657400.0
  ], 
  [
   426861, 
   null, 
   "PottersvilleUSA", 
   "\n GUTSY move and one I support 100%. \n \n First, I think it is probably a little on the dishonest side for the teachers to claim that they \"dont understand\" why they are being terminated instead of furloughed. If they REALLY dont understand, then they are stoopid and should not be teaching kids anyway. They are being terminated instead of furloughed so the school board can get around seniority based union restrictions. By terminating all the teachers they can hire back the GOOD ones and let the bad ones go on to be bad teachers elsewhere. \n \n I know that it is a SHOCKING idea to teachers unions, federal workers unions, and state government employee unions, but basically the hiring will be MERIT based. ++GASP++\n \n We have to get these public sector unions under control and if that means busting them, then so be it. \n \n Public sector unions are not like private sector unions where there is \"management\" sitting on the other side of the table in an adversarial position. Public sector unions support their own candidates and essentially end up \"negotiating\" with other public sector employees. The only group that does NOT get a seat at the table is the one paying for their incredibly generous compensation packages...the american people.\n\n \n Union busting is disgusting.", 
   {}, 
   424795, 
   null, 
   1301889960.0
  ], 
  [
   426878, 
   null, 
   "daewoo", 
   "Union busting is disgusting.\n\n \n Depends on the union being busted and why. When you have unions that refuse to allow you to replace people who are not performing their job as was the case in Rhode Island, they need to take on the union and beat it down. \n \n I am generally not opposed to unions. The implementation of many unions in the US, though, puts them in the crosshairs. When you have unions protecting employees who do not do their jobs, who steal from you, who wander in and out of work whenever they feel like it, you have to do something about that. Either the union can change or you have to do a little union busting. If you let your union drive you under, nobody has a job.", 
   {}, 
   426861, 
   null, 
   1301928900.0
  ], 
  [
   427084, 
   null, 
   "bremmer", 
   "I completely agree with you everyone must do his own work honestly like his job, and if the teacher like his pupils they return stheir affection", 
   {}, 
   426878, 
   null, 
   1302270120.0
  ], 
  [
   432213, 
   null, 
   "St.Blues", 
   "They just dumped 60 cops to boot...... Mayer Cicilini is a gay corrupt SOB.\n Now a Congessman..... What a joke. \n This is what you get from a Liberal State at election time..\n \n XXXXXX!", 
   {}, 
   427084, 
   null, 
   1308005820.0
  ], 
  [
   432214, 
   null, 
   "St.Blues", 
   "Union busting is disgusting.\n\n \n Not if you truly understood why it must end as it is.\n There is a better way.", 
   {}, 
   426861, 
   null, 
   1308005880.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Providence fires ALL their teachers", 
  "url": "http://www.4forums.com/political/current-events-debates/15068-providence-fires-all-their-teachers.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 15068, 
  "discussion_files": [
   [
    "15397.html", 
    "http://www.4forums.com/political/current-events-debates/15068-providence-fires-all-their-teachers-print.html"
   ]
  ], 
  "identifier": 15068
 }
]