[
 [
  [
   425075, 
   null, 
   "Brady", 
   "The Last Word with Lawrence O'Donnell airs Mondays through Fridays at 8pm ET on MSNBC. \n \n Lawrence O&#8217;Donnell Takes Apart NRA Gun Lobbyist Wayne LaPierre\n \n O&#8217;DONNELL: Time for tonight&#8217;s Rewrite. In Washington during the Conservative Political Action Committee better known as CPAC, I actually made an appearance of sorts. It happened while Washington&#8217;s lobbyist in favor of murderers&#8217; rights to always use the gun of their choice, Wayne LaPierre, the Executive Vice President of the NRA, was speaking about the calls for gun and ammunition control in the aftermath of the Tucson massacre.\n \n You just heard the NRA&#8217;s lie, now some facts. A Justice Department study on the federal assault weapons ban, which was law for 10 years found &#8220;Gun murders declined 10.3 percent in states without preexisting assault weapons bans.&#8221; 10.3 percent. Another study by the Justice Department in 2004 concluded &#8220;If the ban is lifted, gun and magazine manufacturers may reintroduce assault weapons models and large capacity magazines, perhaps in substantial numbers.&#8221;\n \n And that is exactly what the merchants of death did; reintroduced assault weapons and the high capacity magazines that allowed Jared Loughner to take 31 shots, 31, before he had to stop and reload.\n \n On the NRA&#8217;s web site, gun violence cheerleader Wayne LaPierre says &#8220;It&#8217;s time to acknowledge what we know in our hearts to be true.&#8221; That &#8220;The best way to stop a bad guy with a gun, is a good guy with a gun.&#8221;\n \n Wayne, there was a good guy on the scene that day, in Tucson with a gun, but there wasn&#8217;t anything he could do. It was too dangerous to fire. He could have hit an innocent bystander. A good guy with a gun did not stop Jared Loughner.\n \n It was the moment that Loughner had to reload that he became stoppable and he was stopped by a 61 year old woman who wrestled another high capacity magazine out of his hand as he tried to reload, and an unarmed 74 year old man, who had already been grazed by one of Loughner&#8217;s bullets. The second, the second Jared Loughner had to stop and reload, he became an unarmed man.\n \n Wayne LaPierre wants that reloading moment to come after crazed gunmen fire as many shots as the desires of high capacity magazines will allow them to. If Jared Loughner had tried to do this in 2003 when those magazines were illegal, he would have had to reload after firing 10 bullets.\n \n That means he would have been stopped, stopped, after firing ten bullets and Tucson would have seen fewer funerals. People in Tucson were shot and killed thanks to the relentless lobbying work of Wayne LaPierre and his blood-drenched organization.\n \n Wayne LaPierre has devoted his adult life, every day of his adult life since 1977, every working day, to making sure madmen in America can fire as many bullets as they want without having to reload.\n \n Wayne LaPierre runs an organization that is devoted to expanding the profits of the merchants of death. Gun manufacturers pay his salary so he can pretend to be representing the rights of hunters who in fact have absolutely no use for the kind of high capacity magazine Jared Loughner used.\n \n Wayne LaPierre is not your run of the mill lobbyist. Oh no. Most lobbyists are good and decent people in fact. Some are every bit as sleazy as you might imagine. And some are criminals, like Jack Abramoff, but none, none, have done more harm to America, than Wayne LaPierre.\n \n He more than any individual law maker is responsible for this country&#8217;s insane gun laws that allow insane people to mow down Congresswomen and nine year old girls in Safeway parking lots.\n \n Wayne LaPierre is morally guilty of being an accessory before the fact of Jared Loughner&#8217;s shooting spree in Tucson. And every member of Congress who welcomes him into the office for a little lobbying session, is taking one step closer to the devil.\n msnbc.com Video Player", 
   {
    "post_info": {
     "post_title": "Wayne LaPierre, lobbyist for murderers rights"
    }
   }, 
   null, 
   null, 
   1299119640.0
  ], 
  [
   425081, 
   null, 
   "Pietro", 
   "I'm capable of responding to a great deal of misinformation and idiocy. But the level of brain dead dribble that you put forth as your own position is so severe that I don't even know where to begin in tearing you and yours apart and bringing about public shame upon your head.\n \n Lawrence O'Donnell deserves the true blame for the stupidity being purported here today. But because you cited his words I'm laying the fury straight at you instead for being his proxy.\n \n You claim that Way LaPierre is a cheerleader for gun violence but do nothing to prove it. You claim lobbyists in Washington are supporting the rights of murderers but you do nothing to show this as the truth. Your entire statement is designed to do nothing more than infuriate those around you in a blatantly childish and trollish manner devoid of any substance or regard for the truth.\n \n Despite your claims you've presented no evidence that the National Rifle Association has contributed even one penny to the defense of Jared Loughner or any other mass murderer. I've seen nothing so suggest that they go out of their way to try and fund the defense of gang bangers, drug lords, cartel hit men or sociopathic killers and mass murderers. Even you can't prove that done so much as lift a finger to support the claim that Loughner is not guilty by reason of mental defect, or that he's not competent to stand trial due to severe schizophrenia.\n \n You continued talk of \"assault weapons\" and \"high capacity ammunition magazines\" shows that you fail to learn from the lessons administered to you. I've post many, many times and shown that the sale of so-called \"high capacity ammunition magazines\" was NEVER prohibited. I've shown countless times that the law you so fanatically cite allowed for the continued sale and trade in magazines made before the enactment of the law. That was countless hundreds of thousands of magazines, freely bought and sold and traded on the second hand market. Even if the law was renewed in 2004 and made permanent and still in effect today Jared Loughner would still have been able to legally purchase the magazines he used for his attack back in January and there's not a thing in the world that would have prevented him from doing such.\n \n (a) PROHIBITION- Section 922 of title 18, United States Code, as amended by section 110102(a), is amended by adding at the end the following new subsection:\n \n `(w)(1) Except as provided in paragraph (2), it shall be unlawful for a person to transfer or possess a large capacity ammunition feeding device.\n \n `(2) Paragraph (1) shall not apply to the possession or transfer of any large capacity ammunition feeding device otherwise lawfully possessed on or before the date of the enactment of this subsection.\n \n The magazines you so religiously hate with such passion were never illegal under the 1994 bill. That's a simple fact of truth. If you don't like it I don't care it's time for you to get over it and face facts. You tax my patience to no end by being stupid and not caring.", 
   {
    "unicode_changes_made": true
   }, 
   425075, 
   null, 
   1299124560.0
  ], 
  [
   425091, 
   null, 
   "Symbiote", 
   "I love the fixation on \"gun murders\" because they are way worse than any kind of other murders.\n \n If a gun ban results in a 10% decline in gun murders and a 600% increase in knife murders, that's apparently a great thing in the deranged minds of the anti-gun brigade.", 
   {}, 
   425081, 
   null, 
   1299144900.0
  ], 
  [
   425125, 
   null, 
   "Brady", 
   "I love the fixation on \"gun murders\" because they are way worse than any kind of other murders.\n \n If a gun ban results in a 10% decline in gun murders and a 600% increase in knife murders, that's apparently a great thing in the deranged minds of the anti-gun brigade.\n\n Are you just making stuff up and trying to put arguments in other peoples mouths? Who said anything about knife crime. Gun control does not effect knife crime. This is the gun control forum not the knife control forum.", 
   {}, 
   425091, 
   null, 
   1299199200.0
  ], 
  [
   425127, 
   null, 
   "Doc Jones", 
   "Are you just making stuff up and trying to put arguments in other peoples mouths? Who said anything about knife crime. Gun control does not effect knife crime. This is the gun control forum not the knife control forum.\n\n \n \n You just confused yourself....again. Your thread is \"Wayne Pierre, lobbiest for murderers\". You didn't say a cotton pickin thing about guns in your thread topic emoticon_xclown", 
   {}, 
   425125, 
   null, 
   1299199620.0
  ], 
  [
   425129, 
   null, 
   "Brady", 
   "You just confused yourself....again. Your thread is \"Wayne Pierre, lobbiest for murderers\". You didn't say a cotton pickin thing about guns in your thread topic emoticon_xclown\n\n If the topic gets posted in the gun control forum then you should know its about guns. Got your head stuck somewhere?", 
   {}, 
   425127, 
   null, 
   1299199980.0
  ], 
  [
   425131, 
   null, 
   "Doc Jones", 
   "If the topic gets posted in the gun control forum then you should know its about guns. Got your head stuck somewhere?\n\n \n \n The fact remains, more people are killed by other means than guns which are not even in the top 10 .... CDC\n \n This is a gun RIGHTS forum now. Where is your head again?", 
   {}, 
   425129, 
   null, 
   1299200280.0
  ], 
  [
   425135, 
   null, 
   "Brady", 
   "The fact remains, more people are killed by other means than guns which are not even in the top 10 .... CDC\n \n This is a gun RIGHTS forum now. Where is your head again?\n\n Sixty-six percent of all murders are committed with guns. The location of homicides (all methods) varies by gender: 73 percent of female murder victims are killed in the home, while 45 percent of men are killed in the home. Twenty-six percent of men are killed on the street.\n Brady Campaign to Prevent Gun Violence : Studies", 
   {}, 
   425131, 
   null, 
   1299200880.0
  ], 
  [
   425138, 
   null, 
   "Doc Jones", 
   "Sixty-six percent of all murders are committed with guns. The location of homicides (all methods) varies by gender: 73 percent of female murder victims are killed in the home, while 45 percent of men are killed in the home. Twenty-six percent of men are killed on the street.\n Brady Campaign to Prevent Gun Violence : Studies\n\n \n \n Sounds like you better move? The thing is brindy, the real stats by DOJ, FBI, CDC etc. do not support your claims. Homocides are not all unlawful nor illegal. Most of these rates are unsupported by anything but claims by the brady campaign which lost the war in Heller and McDonald and when the 2A was incorporated into the XIVth Amendment.\n \n How are you at pushing a broom?", 
   {}, 
   425135, 
   null, 
   1299201300.0
  ], 
  [
   425165, 
   null, 
   "Superlite27", 
   "I just made a purchase from MidwayUSA and elected to \"round up\" my purchase in order to donate 68 cents to the NRA.\n \n Shop Shooting Supplies | Reloading | Gunsmithing | Hunting gear &#8212; MidwayUSA\n \n This is the place to go for all your firearms purchases. You don't have to purchase \"high capacity\" magazines in order to round up. ANY purchase made will allow you to round your purchase to the next higher dollar amount resulting in a contribution to the leading organization standing up for your constitutional right to self defense.\n \n BTW: Did I mention the NRA is the standard in firearms training? In the 48 states that recognize a citizens right to self defense, the majority of them require NRA CERTIFIED INSTRUCTORS to provide documentation of training. (In those states that require thier citizens to receive training for a RIGHT)\n \n I am unaware of any that require the Brady Campaign, or the Violence Policy Center to provide training.\n \n So purchase something from MidwayUSA today (Shop Shooting Supplies | Reloading | Gunsmithing | Hunting gear &#8212; MidwayUSA), and choose to \"round up\" in order to support the NRA. Because the NRA supports, not only you, but law enforcement, local safety instructors, and the millions of gun owners that are threatened by the hateful and right grabbing anti-gunners who could care less about your family's safety.", 
   {}, 
   425138, 
   null, 
   1299209820.0
  ], 
  [
   425195, 
   null, 
   "zsu2357", 
   "Are you just making stuff up and trying to put arguments in other peoples mouths? Who said anything about knife crime. Gun control does not effect knife crime. This is the gun control forum not the knife control forum.\n\n But but but if guns were banned,then there couldn't be gun crimes.But I guess the new rant would be ban knives because of all the knife crimes huh.emoticon_confused\n So I think gun control on the magnitude you want would effect it, how could it not?:p", 
   {}, 
   425125, 
   null, 
   1299223920.0
  ], 
  [
   425200, 
   null, 
   "Symbiote", 
   ". Gun control does not effect knife crime. .\n\n \n Actually it does. The more gun control you have, the more knife crime occurs. Your complete inability to understand this this basic fact is what distinguishes you from intelligent human beings.\n \n Some would say it is the result of a generalised mental deficit, others would say your mental disorder is simply the result of your fixation on guns at the expense of logic. Who can really know?", 
   {}, 
   425125, 
   null, 
   1299232680.0
  ], 
  [
   425218, 
   null, 
   "Brady", 
   "Actually it does. The more gun control you have, the more knife crime occurs. Your complete inability to understand this this basic fact is what distinguishes you from intelligent human beings.\n \n Some would say it is the result of a generalised mental deficit, others would say your mental disorder is simply the result of your fixation on guns at the expense of logic. Who can really know?\n\n I am calling total bull on this post. The study says\n \n The association between firearm prevalence and homicide was driven by gun-related homicide rates; non-gun-related homicide rates were not significantly associated with rates of firearm ownership.\n \n So there is no effect on non gun crimes!", 
   {}, 
   425200, 
   null, 
   1299269940.0
  ], 
  [
   425223, 
   null, 
   "Pietro", 
   "I am calling total bull on this post. The study says\n \n The association between firearm prevalence and homicide was driven by gun-related homicide rates; non-gun-related homicide rates were not significantly associated with rates of firearm ownership.\n \n So there is no effect on non gun crimes!\n\n \n The study was paid for by the Joyce Foundation. The same Joyce Foundation that has given money to the Brady Campaign and the Violence Policy Center.\n \n Do I really need to again point out the reasons for which any study funding by the Joyce Foundation can't be considered fair and unbiased?", 
   {}, 
   425218, 
   null, 
   1299270660.0
  ], 
  [
   425253, 
   null, 
   "Doc Jones", 
   "I am calling total bull on this post. The study says\n \n The association between firearm prevalence and homicide was driven by gun-related homicide rates; non-gun-related homicide rates were not significantly associated with rates of firearm ownership.\n \n So there is no effect on non gun crimes!\n\n \n \n All you posted was bull without any meaning what-so-ever. It is gobbledegook. If you haven't got anything to say don't waste band width. This is a big fat ZERO.", 
   {}, 
   425218, 
   null, 
   1299284940.0
  ], 
  [
   425259, 
   null, 
   "Symbiote", 
   "I am calling total bull on this post. The study says\n \n The association between firearm prevalence and homicide was driven by gun-related homicide rates; non-gun-related homicide rates were not significantly associated with rates of firearm ownership.\n \n So there is no effect on non gun crimes!\n\n \n I am not claiming there is a relationship between gun prevalence and knife crime. I am claiming there is a relationship between gun CONTROL and knife crime. Your mistake is in equating the two.", 
   {}, 
   425218, 
   null, 
   1299288120.0
  ], 
  [
   425261, 
   null, 
   "Brady", 
   "I am not claiming there is a relationship between gun prevalence and knife crime. I am claiming there is a relationship between gun CONTROL and knife crime. Your mistake is in equating the two.\n\n But why would there be a relationship? Gun control is meant to control knives not guns. Thats why its called gun control.", 
   {}, 
   425259, 
   null, 
   1299288720.0
  ], 
  [
   425263, 
   null, 
   "Pietro", 
   "But why would there be a relationship? Gun control is meant to control knives not guns. Thats why its called gun control.\n\n \n Gun control is meant to control knives not guns? Interesting angle there Brady.\n \n It's question time again. Why are you so fixated on those that are victimized by someone who's using a gun? Why do you show absolutely no concern for those who are annually stabbed, bludgeoned, poisoned or choked to death each year? Why are their deaths of no importance to you?\n \n And why do you only care when the number of people who are shot and killed is above a certain amount? We pointed to the incidents of border patrol and ICE agents being killed and their two deaths didn't even phase you. You treated their loss as if it were too insignificant to even bother with.", 
   {}, 
   425261, 
   null, 
   1299289140.0
  ], 
  [
   425270, 
   null, 
   "Brady", 
   "Gun control is meant to control knives not guns? Interesting angle there Brady.\n \n It's question time again. Why are you so fixated on those that are victimized by someone who's using a gun? Why do you show absolutely no concern for those who are annually stabbed, bludgeoned, poisoned or choked to death each year? Why are their deaths of no importance to you?\n\n How many people have you murdered this year with your gun? If your going to ask me loaded questions then I can ask you loaded questions too.\n \n \nAnd why do you only care when the number of people who are shot and killed is above a certain amount? We pointed to the incidents of border patrol and ICE agents being killed and their two deaths didn't even phase you. You treated their loss as if it were too insignificant to even bother with.\n\n Look whose talking. You must only care about the number of people shot below a certain amount. 288 people gunned down by concealed carriers doesnt even phase you. You treated their loss as if it were too insignificant to even bother with. You can run but you cant hide.", 
   {}, 
   425263, 
   null, 
   1299290760.0
  ], 
  [
   425272, 
   null, 
   "Pietro", 
   "And how many people have you murdered this year with your gun? If your going to ask me loaded questions then I can ask you loaded questions too.\n\n \n The difference is you're asking me if I've committed a felony with my legal property, while I'm asking you why you only care about those who died in a very specific manner. Why is it that all murders don't bother you, only murders with one particular tool?\n \n There's really no comparison here.\n \n \nAnd why do you only care about the number of people shot below a certain amount. 288 people gunned down by concealed carriers doesnt even phase you. You treated their loss as if it were too insignificant to even bother with.\n\n \n Shall issued concealed carry has been on the books since 1987 in Florida. That's a period of 24 years. Concealed carry is in place in 48 out of 50 states in the nation and soon may be extended to all 50. the number you continually claim is 288 from 2007 to 2010. That's about 72 supposed murders each year for a territory of 50 individual states. In all four years you cite, for all 48 states you talk about that amounts to a rate of 6 murders per state.\n \n So all your hype is over a matter of 6 murders per state in a four year period. So all you've really done is show that every now and again a bad apple slips through the cracks of an imperfect system in an imperfect world.\n \n It's not that we don't care. We just recognize that there were far more murders in other areas that you've chosen to ignore. So we press you on the issue.\n \n Look at the facts. Since 1987 Florida has issued 1,871,589 concealed carry permits. Nearly two million permits in a span of 24 years. That's nearly 78,000 permits every single year. That's not even counting the numerous other permits issued by the other 47 states.\n \n Let's assume for one minute that this 288 figure you cite is accurate. Let's assume that 288 people have been feloniously murdered by people with concealed carry permits. For the sake of discussion let's assume that each \"murder\" was carried out by one individual, which would give us a pool of 288 felony murderers that supposedly got issued a concealed carry permit.\n \n Let's compare that pool of 288 hypothetical murderers from 2007 to 2010, for the rough amount of permits issued in Florida during that same four year period, that would amount to nearly 312,000 permit holders. Comparing those two figures, for each 1 incident of a person with a concealed carry holder committing a felony murder, there were approximately 270 permits issued to people in the state of Florida alone that committed no such offense. Nationally the number of holders who committed no murder is much higher. \n \n Unfortunately you've done nothing to show that concealed carry poses any sort of unique hazard to anyone, and that the hazard would somehow not exist if concealed carry was somehow not possible. You've just helped prove how rare and unlikely such an offense is likely to be.\n \n For your services in helping us prove our case Brady we offer you our thanks.", 
   {}, 
   425263, 
   null, 
   1299292200.0
  ], 
  [
   425273, 
   null, 
   "Brady", 
   "A Shrinking Minority\n The Continuing Decline of Gun Ownership in America\n Gun ownership in America is declining.\n \n During the period 1972 to 2006, the percentage of American households that reported having any guns in the home has dropped nearly 20 percentage points: from a high of 54 percent in 1977 to 34.5 percent in 2006 (see Graphic 1, Graphic 2).\n \n So why are the gun industry and gun lobby whistling as they walk together through the graveyard? Because they recognize that the gun culture in America is fading away, and with it, the customers and activists that America's gunmakers and gun lobby rely on. When talking to the news media, gunmakers work to present themselves as a vibrant, growing industry that is an inextricable part of American society. Yet, for the past decade, when talking amongst themselves in industry publications, the issue, as voiced\n in one gunmaker's ad in 1998 is, \"It's not `who your customers will be in five years.' It's `will there be any customers left?'\"14 This fact is openly acknowledged in gun industry publications and among the associations that act on the industry's behalf. Discussions of the continuing decline in gun ownership, and the inability to find replacement buyers to take the place of the aging primary market of white males, are often characterized by tones of panic and, at the same time, resignation. \n http://www.vpc.org/studies/gunownership.pdf\n \n And America keeps getting safer as less and less people own guns. Crime keeps going down. Good to see that fans of guns and violence are losing the war. :)", 
   {
    "unicode_changes_made": true
   }, 
   425270, 
   null, 
   1299292380.0
  ], 
  [
   425278, 
   null, 
   "Pietro", 
   "So rather than try to refute that the number of concealed carry holders who committed murder is microscopic in nature, you choose to change tactics and talk about how gun ownership in America is declining? Shameful Brady very shameful.\n \n \nA Shrinking Minority\n The Continuing Decline of Gun Ownership in America\n Gun ownership in America is declining.\n \n During the period 1972 to 2006, the percentage of American households that reported having any guns in the home has dropped nearly 20 percentage points: from a high of 54 percent in 1977 to 34.5 percent in 2006 (see Graphic 1, Graphic 2).\n \n So why are the gun industry and gun lobby whistling as they walk together through the graveyard? Because they recognize that the gun culture in America is fading away, and with it, the customers and activists that America's gunmakers and gun lobby rely on. When talking to the news media, gunmakers work to present themselves as a vibrant, growing industry that is an inextricable part of American society. Yet, for the past decade, when talking amongst themselves in industry publications, the issue, as voiced\n in one gunmaker's ad in 1998 is, \"It's not `who your customers will be in five years.' It's `will there be any customers left?'\"14 This fact is openly acknowledged in gun industry publications and among the associations that act on the industry's behalf. Discussions of the continuing decline in gun ownership, and the inability to find replacement buyers to take the place of the aging primary market of white males, are often characterized by tones of panic and, at the same time, resignation. \n http://www.vpc.org/studies/gunownership.pdf\n \n And America keeps getting safer as less and less people own guns. Crime keeps going down. Good to see that fans of guns and violence are losing the war. :)\n\n \n This is quite easy to refute. http://www.fbi.gov/about-us/cjis/nics/reports/total-nics-background-checks\n \n The total amount of NICS background checks carried out between 1998 and 2011 is 125,750,784. That's about 9,673,137 background checks being carried out each year for the last 13 years. That's about 26,501 checks carried out every single day. And it's only safe to assume that for each one of these background checks at least one purchase was made. That means in the last 13 years over 26,500 guns were bought each day.\n \n Now how could sales be so high if the number of people owning guns is supposedly going down?\n \n And it's actually been addressed countless times in the past that not everyone who's randomly called up and asked if they have a gun in the house is going to answer yes or no. So obviously statistics aren't going to be accurately reflected.\n \n You must be getting exceedingly desperate if you're trying to rehash this exhausted point yet again. It's been tried previously and failed.", 
   {
    "unicode_changes_made": true
   }, 
   425273, 
   null, 
   1299294060.0
  ], 
  [
   425289, 
   null, 
   "Brady", 
   "So rather than try to refute that the number of concealed carry holders who committed murder is microscopic in nature, you choose to change tactics and talk about how gun ownership in America is declining? Shameful Brady very shameful.\n \n \n \n This is quite easy to refute. http://www.fbi.gov/about-us/cjis/nics/reports/total-nics-background-checks\n \n The total amount of NICS background checks carried out between 1998 and 2011 is 125,750,784. That's about 9,673,137 background checks being carried out each year for the last 13 years. That's about 26,501 checks carried out every single day. And it's only safe to assume that for each one of these background checks at least one purchase was made. That means in the last 13 years over 26,500 guns were bought each day.\n \n Now how could sales be so high if the number of people owning guns is supposedly going down?\n \n And it's actually been addressed countless times in the past that not everyone who's randomly called up and asked if they have a gun in the house is going to answer yes or no. So obviously statistics aren't going to be accurately reflected.\n \n You must be getting exceedingly desperate if you're trying to rehash this exhausted point yet again. It's been tried previously and failed.\n\n You do not fool me. That doesnt prove your point. It could just mostly be people that already have guns just buying more guns. You can run but you cant hide.", 
   {}, 
   425278, 
   null, 
   1299300120.0
  ], 
  [
   425294, 
   null, 
   "Pietro", 
   "You do not fool me. That doesnt prove your point. It could just mostly be people that already have guns just buying more guns. You can run but you cant hide.\n\n \n The fact that 26,501 NICS background checks are carried out every single day doesn't prove my position that more people are becoming gun owners? What exactly would you consider evidence that the rate of gun ownership is higher than it ever has been?\n \n If you choose to disregard the explanation that more people are becoming gun owners the only other explanation for the increased number of NICS checks is that those who are currently in possession are stocking up in large quantities and amassing what you'd label as arsenals.\n \n You also haven't provided a valid explanation for why people would answer truthfully on whether or not they owned a gun when asked over the telephone by a complete stranger. Why would anyone offer up such information that could be used against them?", 
   {}, 
   425289, 
   null, 
   1299301200.0
  ], 
  [
   425396, 
   null, 
   "Symbiote", 
   "But why would there be a relationship? Gun control is meant to control knives not guns. Thats why its called gun control.\n\n \n But why would there be relationship between Prohibition and Al Capone? Alcohol control is meant to control alcohol, not organised crime, that's why its called prohibition.\n \n Unfortunately Brady, what a law is \"meant\" to do, and what it actually does are two completely different things. Until you recognise that all the good intentions in the world can't prevent the unintended consequences of laws, you won't get anywhere.", 
   {}, 
   425261, 
   null, 
   1299495540.0
  ], 
  [
   425636, 
   null, 
   "Mrlch", 
   "But why would there be a relationship? Gun control is meant to control knives not guns. Thats why its called gun control.\n\n \n There is a realtionship between the two. Here in the UK all legal firearms are very strictly licenced, handguns and semi automatic rifles are outlawed (excepting .22 rifles) shotguns are restricted to a magazine capacity of 2+1.\n \n The handgun ban came into force in 1997 the other restrictive laws started in the late 60's. Since then there has been a steady rise in knife crime, visit the Office for National Statistics if you want the full list of figures.", 
   {}, 
   425261, 
   null, 
   1299838320.0
  ], 
  [
   425657, 
   null, 
   "Brady", 
   "There is a realtionship between the two. Here in the UK all legal firearms are very strictly licenced, handguns and semi automatic rifles are outlawed (excepting .22 rifles) shotguns are restricted to a magazine capacity of 2+1.\n \n The handgun ban came into force in 1997 the other restrictive laws started in the late 60's. Since then there has been a steady rise in knife crime, visit the Office for National Statistics if you want the full list of figures.\n\n Yet another person that posts claims without evidence.", 
   {}, 
   425636, 
   null, 
   1299890760.0
  ], 
  [
   425659, 
   null, 
   "Doc Jones", 
   "Yet another person that posts claims without evidence.\n\n \n So there ya are Scott, get in early and avoid the rush. Brady campaign to stop knife crime. You don't need any facts since you don't have any valid claims on guns just start the BS and let her fly. If you repeat stuff enough you will start to believe your own lies emoticon_cry", 
   {}, 
   425657, 
   null, 
   1299891420.0
  ], 
  [
   425699, 
   null, 
   "Mrlch", 
   "Yet another person that posts claims without evidence.\n\n mpa.gov.uk/downloads/committees/mpa/mpa-040930-10-appendix01.pdf\n \n would this do at all? Bear in mind of course that the population of the UK is around 1/5th that of the US\n \n insight-security.com/facts-knife-crime-stats.htm\n \n From this website \"The new figures indicate that in the year 2007-8 there were some 277 deaths from stabbings in England & Wales alone (the highest recorded figure for 30 years). This represents an average death toll as a direct result of stabbings of over 5 for every week of the year\"\n (not allowed to post links so you'll have to copy\\paste)", 
   {}, 
   425657, 
   null, 
   1299947160.0
  ], 
  [
   425700, 
   null, 
   "Doc Jones", 
   "mpa.gov.uk/downloads/committees/mpa/mpa-040930-10-appendix01.pdf\n \n would this do at all? Bear in mind of course that the population of the UK is around 1/5th that of the US\n \n insight-security.com/facts-knife-crime-stats.htm\n \n From this website \"The new figures indicate that in the year 2007-8 there were some 277 deaths from stabbings in England & Wales alone (the highest recorded figure for 30 years). This represents an average death toll as a direct result of stabbings of over 5 for every week of the year\"\n (not allowed to post links so you'll have to copy\\paste)\n\n \n Try http://www. before the link to make a live link.\n \n Knife Crime Facts / Knife Culture in the UK\n \n http://www.mpa.gov.uk/downloads/committees/mpa/mpa-040930-10-appendix01.pdf\n \n Mostly they are too lazy to read them any way but it helps the lurkers :)", 
   {}, 
   425699, 
   null, 
   1299947640.0
  ], 
  [
   425702, 
   null, 
   "Doc Jones", 
   "A Shrinking Minority\n The Continuing Decline of Gun Ownership in America\n Gun ownership in America is declining.\n \n During the period 1972 to 2006, the percentage of American households that reported having any guns in the home has dropped nearly 20 percentage points: from a high of 54 percent in 1977 to 34.5 percent in 2006 (see Graphic 1, Graphic 2).\n \n So why are the gun industry and gun lobby whistling as they walk together through the graveyard? Because they recognize that the gun culture in America is fading away, and with it, the customers and activists that America's gunmakers and gun lobby rely on. When talking to the news media, gunmakers work to present themselves as a vibrant, growing industry that is an inextricable part of American society. Yet, for the past decade, when talking amongst themselves in industry publications, the issue, as voiced\n in one gunmaker's ad in 1998 is, \"It's not `who your customers will be in five years.' It's `will there be any customers left?'\"14 This fact is openly acknowledged in gun industry publications and among the associations that act on the industry's behalf. Discussions of the continuing decline in gun ownership, and the inability to find replacement buyers to take the place of the aging primary market of white males, are often characterized by tones of panic and, at the same time, resignation. \n http://www.vpc.org/studies/gunownership.pdf\n \n And America keeps getting safer as less and less people own guns. Crime keeps going down. Good to see that fans of guns and violence are losing the war. :)\n\n \n Remember this Scotie, the only enemies guns have are rust and politicians who oppose the Constitution. POLLS show just the opposite of what you claim and there is enough good guns to arm the entire population if necessary :) As far as your war claim goes, been any SCOTUS cases that ever ruled against the right to keep and bear arms as an individual right. The last two made it abundantly clear....you lost.\n How many members has the brady campaign got now that pay dues :)\n How many members has VPC got that pay dues? :)\n How broke are you that you work for VPC now GUFFAW!!\n \n Nice propaganda sound bite but just like the others it is all hot air and wishful thinking, just the deer hunters in two States outnumber the World's larges armies and that is a fact as I have posted before.\n \n You and your .orgs are a criminals' best friend but your popularity and lies have been exposed and the number of victim disarmament zones are shrinking like a rubber band in the microwave.\n \n Do be a gracious loser Scot and turn in the 30-06 your mommie bought for you; you should know by the Kellerman study you are a risk to your own household by a ratio of 43:1 and more likely to kill a family member than a perp. Now why would you of all people not trust the police to protect you? Dial 911 brady and follow your own advice you so freely give to others IF you actually believe that tripe. Why don't you have a single shot, black powder gun instead of a rapid fire, high powered sniper rifle that is good just to mow down gobs of people? I understand you have added to your collection since then: wanna tell all these nice folks what you now own? emoticon_xbouncer What possessed you to start an arsenal brady? We know most of your members and former members have guns, lots of guns...and some of them made front page news. Did you know Carl Rowan whose son was an FBI agent gave his anti gun father a pistol he used to shoot children swimming in his pool at night? That son is now running for the board of NRA.\n You are finished brady, have the grace to fade away graciously and quit kicking when you are hung and know it.", 
   {
    "unicode_changes_made": true
   }, 
   425273, 
   null, 
   1299959640.0
  ], 
  [
   436451, 
   null, 
   "Brady", 
   "There is plenty of circumstantial evidence that the NRA's mission has nothing to do with its members, but everything to do with protecting the profits of the gun manufacturers who support the organisation with big bucks - not to mention pay the million-dollar-plus salary of the NRA's executive vice president, Wayne LaPierre.\n \n After all, those lunches at The Palm aren't going to just pay for themselves.\n \n In the December issue of the American Institute of Philanthropy, its \"Charity Rating Guide & Watchdog Report\" showed that when including all categories of \"compensation\" LaPierre came in fourth on the \"charity\" list with a healthy $1.281 million per year. Apparently, some non-profits can be profitable for some.\n \n In February of 2006, a blog called Gun Guys run by the Freedom States Alliance, a 501(c)(3) organisation working \"to reduce gun violence in America\" found that LaPierre's then-million dollar package was the equivalent of 35,000 NRA membership renewals.\n \n One wonders whether these members know that not only are the views of LaPierre and the rest of his leadership team way out of touch with its membership - who overwhelmingly support universal background checks for gun buyers and stopping those on terrorist watch lists from enjoying easy access to firearms (see Part I of this series for poll numbers) - but that they are also subsidising LaPierre's lavish lifestyle.\n \n This might explain the NRA's need for constant crisis marketing (Obama's coming with the Legion of Doom to take your guns!) to misinform the public at large and shake their members' wallets loose - the NRA's very own \"We've got trouble! Right here in River City!\" routine.\n \n Of, course, the direct influence that gun manufacturers exert over the NRA and their huge windfalls when there are runs on guns and ammunition, also readily explains the NRA's play to paranoia and fringe politics, and their view that no gun sale is a bad gun sale.\n \n In fact, if you're looking for more than circumstantial evidence, the Center For Public Integrity will make your job easy. This past week they sent out a press release that started in the following manner:\n \n It's no accident the National Rifle Association staunchly supports high-capacity magazines - it gets money from their manufacturers every day. Missouri-based gun company MidwayUSA pioneered a fund-raising tactic called \"Round-Up.\" The program involves asking customers to round up their purchases to the nearest dollar. The company then donates the difference to the NRA's Institute for Legislative Action, a lobbying arm of the gun rights group. Since 1992, MidwayUSA, along with other firearm companies, have funnelled a total of $7.5 million to the NRA's Institute for Legislative Action using the \"Round-Up\" tactic. MidwayUSA's wares include high-capacity magazines similar to those used in the Arizona shooting spree...\n \n If that doesn't make the symbiotic relationship between the NRA and the gun manufacturers undeniable, maybe an additional investigation by the Center For Public Integrity, with additional research by the Violence Policy Center (VPC), will do the trick.\n \n Among its other delivered nuggets of wisdom, the fact that co-owner of MidwayUSA Brenda Potterfield is also the National Rifle Association Foundation board vice president. Meanwhile, another NRA board member, Ronnie Barrett, manufactures the REC7, according to the investigation, \"an AR-15 type assault rifle which comes with two 30-round ammunition magazines.\"\n \n Then there is Pete Brownell who owns Brownells Inc, \"which sells a wide-range of high-capacity ammunition magazines for pistols and assault weapons, including the same capacity Glock magazine as the 33-round magazine used in the Arizona attack.\"\n \n As you can imagine, it is not NRA members who sponsor its National Youth Shooting Sports Ambassadors. Its Brownells. In fact, when seeking support from his campaign for the NRA Board, he all but admitted that his industry's interests were 100% in tune with the \"overall mission of the organisation\".\n \n Arguably the best evidence is provided by Tom Diaz, author of Making A Killing and former NRA member and \"gun nut\" by his own admission. That is until he discovered in the course of working as an attorney on the House Crime Subcommittee that:\n \n the gun industry and manufacturers had changed the profile of who their target market was. It was not about self-defence or the right to bear arms. They were hyper-marketing very lethal guns and they flooded the US with them. The NRA doesn't represent sport shooters and hunters. They were selling these killing machines.\n \n In other words, what the NRA does has nothing to do with its members. They have created ever more lethal gun designs, laughably argue that one needs high-capacity clips for \"defencive situations\", (you never know when Genghis Khan and a platoon of Mongol soldiers might be right around the corner) and have supported concealed carry laws, according to Diaz, all in an attempt to keep selling ever more guns and gun paraphernalia.\n \n \n It's not about the rights of hunters and sportsmen. It's simply about the right of Wayne LaPierre and his plutocratic pals on the NRA board to get ever richer as the body count mounts.\n \n Even Robert A. Levy of the libertarian Cato Institute, who served as co-counsel in the Supreme Court case that established a second amendment right to bear arms, stated that \"I don't see any constitutional bar to regulating high-capacity magazines...The Second Amendment is not absolute.\"\n \n But then again he is not in the business of manufacturing guns. He is actually trying to protect what he sees as constitutionally granted rights.\n \n Perhaps his final quote was most apropos. Levy said a high-capacity clip ban \"...may stop a few of these loony tunes.\" One wonders if he was talking about the Jared Loughers of the world or the \"charity\" organisation who would put these weapons of mass destruction in their hands.\n NRA: It's good to live like a king - Opinion - Al Jazeera English\n \n Wayne gets rich off of the death and destruction that happens in streets every single day but calls his organization a charity. What a scam!", 
   {
    "unicode_changes_made": true
   }, 
   425702, 
   null, 
   1312791540.0
  ], 
  [
   436455, 
   null, 
   "Doc Jones", 
   "There is plenty of circumstantial evidence that the NRA's mission has nothing to do with its members, but everything to do with protecting the profits of the gun manufacturers who support the organisation with big bucks - not to mention pay the million-dollar-plus salary of the NRA's executive vice president, Wayne LaPierre.\n \n After all, those lunches at The Palm aren't going to just pay for themselves.\n \n In the December issue of the American Institute of Philanthropy, its \"Charity Rating Guide & Watchdog Report\" showed that when including all categories of \"compensation\" LaPierre came in fourth on the \"charity\" list with a healthy $1.281 million per year. Apparently, some non-profits can be profitable for some.\n \n In February of 2006, a blog called Gun Guys run by the Freedom States Alliance, a 501(c)(3) organisation working \"to reduce gun violence in America\" found that LaPierre's then-million dollar package was the equivalent of 35,000 NRA membership renewals.\n \n One wonders whether these members know that not only are the views of LaPierre and the rest of his leadership team way out of touch with its membership - who overwhelmingly support universal background checks for gun buyers and stopping those on terrorist watch lists from enjoying easy access to firearms (see Part I of this series for poll numbers) - but that they are also subsidising LaPierre's lavish lifestyle.\n \n This might explain the NRA's need for constant crisis marketing (Obama's coming with the Legion of Doom to take your guns!) to misinform the public at large and shake their members' wallets loose - the NRA's very own \"We've got trouble! Right here in River City!\" routine.\n \n Of, course, the direct influence that gun manufacturers exert over the NRA and their huge windfalls when there are runs on guns and ammunition, also readily explains the NRA's play to paranoia and fringe politics, and their view that no gun sale is a bad gun sale.\n \n In fact, if you're looking for more than circumstantial evidence, the Center For Public Integrity will make your job easy. This past week they sent out a press release that started in the following manner:\n \n It's no accident the National Rifle Association staunchly supports high-capacity magazines - it gets money from their manufacturers every day. Missouri-based gun company MidwayUSA pioneered a fund-raising tactic called \"Round-Up.\" The program involves asking customers to round up their purchases to the nearest dollar. The company then donates the difference to the NRA's Institute for Legislative Action, a lobbying arm of the gun rights group. Since 1992, MidwayUSA, along with other firearm companies, have funnelled a total of $7.5 million to the NRA's Institute for Legislative Action using the \"Round-Up\" tactic. MidwayUSA's wares include high-capacity magazines similar to those used in the Arizona shooting spree...\n \n If that doesn't make the symbiotic relationship between the NRA and the gun manufacturers undeniable, maybe an additional investigation by the Center For Public Integrity, with additional research by the Violence Policy Center (VPC), will do the trick.\n \n Among its other delivered nuggets of wisdom, the fact that co-owner of MidwayUSA Brenda Potterfield is also the National Rifle Association Foundation board vice president. Meanwhile, another NRA board member, Ronnie Barrett, manufactures the REC7, according to the investigation, \"an AR-15 type assault rifle which comes with two 30-round ammunition magazines.\"\n \n Then there is Pete Brownell who owns Brownells Inc, \"which sells a wide-range of high-capacity ammunition magazines for pistols and assault weapons, including the same capacity Glock magazine as the 33-round magazine used in the Arizona attack.\"\n \n As you can imagine, it is not NRA members who sponsor its National Youth Shooting Sports Ambassadors. Its Brownells. In fact, when seeking support from his campaign for the NRA Board, he all but admitted that his industry's interests were 100% in tune with the \"overall mission of the organisation\".\n \n Arguably the best evidence is provided by Tom Diaz, author of Making A Killing and former NRA member and \"gun nut\" by his own admission. That is until he discovered in the course of working as an attorney on the House Crime Subcommittee that:\n \n the gun industry and manufacturers had changed the profile of who their target market was. It was not about self-defence or the right to bear arms. They were hyper-marketing very lethal guns and they flooded the US with them. The NRA doesn't represent sport shooters and hunters. They were selling these killing machines.\n \n In other words, what the NRA does has nothing to do with its members. They have created ever more lethal gun designs, laughably argue that one needs high-capacity clips for \"defencive situations\", (you never know when Genghis Khan and a platoon of Mongol soldiers might be right around the corner) and have supported concealed carry laws, according to Diaz, all in an attempt to keep selling ever more guns and gun paraphernalia.\n \n \n It's not about the rights of hunters and sportsmen. It's simply about the right of Wayne LaPierre and his plutocratic pals on the NRA board to get ever richer as the body count mounts.\n \n Even Robert A. Levy of the libertarian Cato Institute, who served as co-counsel in the Supreme Court case that established a second amendment right to bear arms, stated that \"I don't see any constitutional bar to regulating high-capacity magazines...The Second Amendment is not absolute.\"\n \n But then again he is not in the business of manufacturing guns. He is actually trying to protect what he sees as constitutionally granted rights.\n \n Perhaps his final quote was most apropos. Levy said a high-capacity clip ban \"...may stop a few of these loony tunes.\" One wonders if he was talking about the Jared Loughers of the world or the \"charity\" organisation who would put these weapons of mass destruction in their hands.\n NRA: It's good to live like a king - Opinion - Al Jazeera English\n \n Wayne gets rich off of the death and destruction that happens in streets every single day but calls his organization a charity. What a scam!\n\n \n \nThe gun industry is the last unregulated manufacturer of a consumer product in America, with a level of secrecy that makes the tobacco industry look like a model of transparency. Making a Killing blows away the smoke and offers a provocative new take on gun violence in our society. Former NRA member and \"gun nut\" Tom Diaz argues that despite endless rhetoric about the right to bear arms, the real story behind the steady rise in gun violence in America is the systematic increase in lethality by manufacturers. Diaz shows how over the last two decades the gun industry has sought to reverse declining profits by dramatically increasing killing power, rolling out new and more dangerous products as breezily as car companies introduced tailfins in the fifties - and thereby contributing to a public health and safety disaster of epidemic proportions. \n BARNES & NOBLE | Making a Killing: The Business of Guns in America by Tom Diaz | Paperback, Hardcover\n \n So protect an industry that gets rich off of murder and violate innocent victims due process rights. Your true colors are showing.\n\n \n So you conceed the original topic, make an accusation that the working people at NRA, which is NOT A 501 (C,3) are getting paid while the brady bunch and VPC are a 501,c,3 and have violated their charter?\n Meanwhile, you are plugging a book by a VPC sales person in an attempt to advertise and mislead people. What is Diaz going to do with any money for his work of fiction? Pocket it or donate it to charity?\n \n You are about as desperate as a cornered weasel in the chicken coop about now ain't ya emoticon_xgood\n \n Your .org is dried up, VPC is kerput and Fiendsteen is quitting this term so she is kerput also. Get an honest day job brindy.", 
   {
    "unicode_changes_made": true
   }, 
   436451, 
   null, 
   1312806600.0
  ], 
  [
   436465, 
   null, 
   "Xcaliber", 
   "There is plenty of circumstantial evidence that the NRA's mission has nothing to do with its members.\n\n \n Considering your mission to subvert the Constitutional rights of Patriots it's no wonder you don't realize that \"circumstantial\" evidence doesn't amount to a hill of beans...", 
   {}, 
   436451, 
   null, 
   1312812600.0
  ], 
  [
   436467, 
   null, 
   "Xenamnes", 
   "Your message Brady is heavily laced with hyperbole and rhetoric that makes no sense whatsoever. You speak of \"circumstantial evidence\" but you fail to elaborate on just what this evidence is and what it amounts to.\n \n You assault the what you term \"high capacity magazines\" but fail to address that the round up program applies to all firearms accessories sold on the sites participating in the program.\n \n You complain about the NRA and its charity status, while failing to note that they do actually engage in charity work with donations to various organizations that support and assist others. The Brady Campaign claims 501 c(3) status, but what organizations have they donated to?\n \n Your claims are made further irrelevant by the topic head of this discussion, \"Wayne LaPierre, lobbyist for murderers rights.\" Exactly what murderers have Wayne LaPierre favored for? Which mass murderers currently in court are having their legal defense funding by the National Rifle Association? Is Jared Loughner benefiting from a lawyer paid for by the National Rifle Association? Has an NRA lawyer been put on a plane and flown to Norway for Breivik's defense?\n \n There is also no evidence to support the notion of the NRA making even one cent off of illegal sales between criminals. Your claims are unsubstantiated and doomed to failure.", 
   {}, 
   436451, 
   null, 
   1312814220.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Wayne LaPierre, lobbyist for murderers rights", 
  "url": "http://www.4forums.com/political/gun-control-debates/15075-wayne-lapierre-lobbyist-murderers-rights.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15075, 
  "discussion_files": [
   [
    "1635.html", 
    "http://www.4forums.com/political/gun-control-debates/15075-wayne-lapierre-lobbyist-murderers-rights-print.html"
   ], 
   [
    "1636.html", 
    "http://www.4forums.com/political/gun-control-debates/15075-wayne-lapierre-lobbyist-murderers-rights-3-print.html"
   ], 
   [
    "1637.html", 
    "http://www.4forums.com/political/gun-control-debates/15075-wayne-lapierre-lobbyist-murderers-rights-2-print.html"
   ]
  ], 
  "identifier": 15075
 }
]