[
 [
  [
   424856, 
   null, 
   "George Vreeland", 
   "When two people get married, it is because they love each other. \n They want to be together in a bond that makes them one with each other forever. \n It is a wonderful thing to have such a bond. \n It is special. \n It is love. \n When a man and a woman get married, no one blinks an eye. \n If two men or two women do the same, then many people do not approve. \n They claim that it is not right or that it soils the real meaning of marriage. \n What is the real meaning of marriage? \n The answer to that question is in line one of this article. \n It is because they love each other. \n Does it matter if the couple is gay or straight? \n Should it matter? \n No! \n After all, why should it. \n Gays want their equal rights and among those equal rights is the right to be married. \n I agree with wanting equal rights. \n We are all people which means we are all the same. \n It does not matter if someone is gay, white, black, a man, a woman, tall, short, young, old or whatever. \n We all want our equal rights. \n That is our right. \n However, we need to go beyond equal rights when it comes to gay marriage. \n Society needs to understand that any marriage is not about the right to be married. \n It is about wanting to be married as a loving couple. \n Love is not something that should be decided on by voters. \n It is not a court issue either. \n It should not be an issue at all. \n Marriage is between two people in love. \n It is not between two people, the voters, the courts and anyone else who has an opinion. \n Gay marriage does not bring down the meaning of marriage. \n It makes the true meaning of marriage even better. \n That is what love does. \n It makes things better. \n Society has come a long way in the last fifty years in terms of equality, but we still have a long way to go. \n It is a shame that love is something that needs to be fought for. \n I am not gay, but I am the same as you as you are to me. \n May love conquer all. \n \n George Vreeland Hill", 
   {
    "post_info": {
     "post_title": "Gay Marriage Is Not About Equal Rights. It Is About Love."
    }
   }, 
   null, 
   null, 
   1298774100.0
  ], 
  [
   424870, 
   null, 
   "Easyrider", 
   "Quote: Gay Marriage Is Not About Equal Rights. It Is About Love.\n\n \n People profess love in all kinds of sinful relationships: Adultery, pedophilia, incest, etc. So love in and of itself is no argument that something is ok.\n \n As the Bible says: \"Love does not rejoice in iniquity\" (such as gay sex relationships).\n \n The Bible also says that \"love does a neighbor no harm,\" as in enticing another person into an illicit gay sex relationship, which is an affront to God and God-fearing people everywhere. There is a cost for sin, and without repentance and Jesus Christ it will result in eternal damnation.\n \n Gay sex is a sin. Gay marriage is just institutionalized sin.", 
   {}, 
   424856, 
   null, 
   1298784900.0
  ], 
  [
   424871, 
   null, 
   "Xcaliber", 
   "\n \n Gay sex is a sin. Gay marriage is just institutionalized sin.\n\n \n Still spewing your bigotry I see.. You're sins are just as bad as the ones you keep harping about,", 
   {}, 
   424870, 
   null, 
   1298785440.0
  ], 
  [
   424872, 
   null, 
   "snakespit", 
   "People profess love in all kinds of sinful relationships: Adultery, pedophilia, incest, etc. So love in and of itself is no argument that something is ok.\n\n Again with this tripe? What will it take you to realize that the difference between a consentual homosexual relationship where there is no victim, and adultery, incest, and pedophilia where there is a victim. \n \n \nGay sex is a sin. Gay marriage is just institutionalized sin.\n\n So don't ever get married to another man, and you don't have to worry about it. Aside from that...it doesn't affect you in any way, shape, or form. Grow up and stop trying to dictate what two consenting adults may do. Your bible is not a license or a mandate to run other people's lives.", 
   {}, 
   424870, 
   null, 
   1298788620.0
  ], 
  [
   424874, 
   null, 
   "Sigma", 
   "When a man and a woman get married, no one blinks an eye. \n If two men or two women do the same, then many people do not approve. \n They claim that it is not right or that it soils the real meaning of marriage. \n What is the real meaning of marriage? \n\n \n The cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n \n The legal meaning of marriage is, in most States, a contract between two people who are not under the age of consent, of different genders, of the same species, not closely related and who are not already married.\n \n Homosexuals are not a part of the traditional or cultural meaning of marriage. In order to be included, the meaning of marriage would have to change. The catch-22 is that homosexual couples want to be included in the current meaning of marriage, but what gives marriage meaning specifically excludes homosexual couples.", 
   {}, 
   424856, 
   null, 
   1298795700.0
  ], 
  [
   424876, 
   null, 
   "Xcaliber", 
   "The cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n \n The legal meaning of marriage is, in most States, a contract between two people who are not under the age of consent, of different genders, of the same species, not closely related and who are not already married.\n \n Homosexuals are not a part of the traditional or cultural meaning of marriage. In order to be included, the meaning of marriage would have to change. The catch-22 is that homosexual couples want to be included in the current meaning of marriage, but what gives marriage meaning specifically excludes homosexual couples.\n\n \n Again you tell half truths. Marriage was never defined as between a Man and Woman until religious Zealots pushed the Government to define it in such a way to deny Gay people their right to marry. When the Government Defined Marriage under DOMA is when \" traditional Marriage\" was defined, not before that. If you're going to tell the story why not include the truth ..", 
   {}, 
   424874, 
   null, 
   1298796960.0
  ], 
  [
   424878, 
   null, 
   "Sigma", 
   "Again you tell half truths. Marriage was never defined as between a Man and Woman until religious Zealots pushed the Government to define it in such a way to deny Gay people their right to marry. When the Government Defined Marriage under DOMA is when \" traditional Marriage\" was defined, not before that. If you're going to tell the story why not include the truth ..\n\n \n Well, even before doma homosexual couples weren't getting married. It was taken for granted that marriage, legally, was only open to heterosexual couples. Even when the statues that outlines marriage were written, the writers had only heterosexual couples in mind. \n \n I don't think you can reasonably dispute that fact.", 
   {}, 
   424876, 
   null, 
   1298798220.0
  ], 
  [
   424882, 
   null, 
   "pappillion001", 
   "When two people get married, it is because they love each other. \n They want to be together in a bond that makes them one with each other forever. \n It is a wonderful thing to have such a bond. \n It is special. \n It is love. \n When a man and a woman get married, no one blinks an eye. \n If two men or two women do the same, then many people do not approve. \n They claim that it is not right or that it soils the real meaning of marriage. \n What is the real meaning of marriage? \n The answer to that question is in line one of this article. \n It is because they love each other. \n Does it matter if the couple is gay or straight? \n Should it matter? \n No! \n After all, why should it. \n Gays want their equal rights and among those equal rights is the right to be married. \n I agree with wanting equal rights. \n We are all people which means we are all the same. \n It does not matter if someone is gay, white, black, a man, a woman, tall, short, young, old or whatever. \n We all want our equal rights. \n That is our right. \n However, we need to go beyond equal rights when it comes to gay marriage. \n Society needs to understand that any marriage is not about the right to be married. \n It is about wanting to be married as a loving couple. \n Love is not something that should be decided on by voters. \n It is not a court issue either. \n It should not be an issue at all. \n Marriage is between two people in love. \n It is not between two people, the voters, the courts and anyone else who has an opinion. \n Gay marriage does not bring down the meaning of marriage. \n It makes the true meaning of marriage even better. \n That is what love does. \n It makes things better. \n Society has come a long way in the last fifty years in terms of equality, but we still have a long way to go. \n It is a shame that love is something that needs to be fought for. \n I am not gay, but I am the same as you as you are to me. \n May love conquer all. \n \n George Vreeland Hill\n\n \n People fall in and out of love picking up milk at the store. Based on results Love is not the best foundation for marriage or maybe people should either get a better understanding of what love is or look for other reasons in addition to love. \n \n Let me just say I do not oppose same sex marriage. Gay couples could not do anything to hurt the idea of marriage that straight couples have not already been doing for centuries. \n \n You say that it is about love, but you actually hold onto it's about a piece of paper and recognition of others. That is what marriage gives you over two people who have the same relationship without being married. If your looking for the perks or rights that go along with being married then it isn't just about love. If not then what difference does it make whether your married legally?", 
   {}, 
   424856, 
   null, 
   1298813880.0
  ], 
  [
   424888, 
   null, 
   "snakespit", 
   "The cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n\n That's your definition. It is certainly not my definition. You don't speak for all of society.\n \n I personally define marriage as a union of two people who love one another and wish to make a commitment to one another. \n \n If marriage is about reproduction, why does nobody bat an eye when a 65 year old woman marries a 68 year old man? If you believe marriage is \"formalization of a mating pair\", and \"reproduction is implied\", doesn't this cheapen the institution of marriage in your eyes? Obviously, they are not getting married to start a family...perhaps love is what is important?", 
   {}, 
   424874, 
   null, 
   1298830740.0
  ], 
  [
   424889, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider: \n People profess love in all kinds of sinful relationships: Adultery, pedophilia, incest, etc. So love in and of itself is no argument that something is ok.\n\n \n \nAgain with this tripe? What will it take you to realize that the difference between a consentual homosexual relationship where there is no victim, and adultery, incest, and pedophilia where there is a victim. \n\n \n You and Ecaliber & Company are still living in la la land. Unrepentant gays wind up in Hell. They're their own victims. And that's after AIDS and all the other scourges of the practice. And the Word of God says you're going right with them unless you all repent and turn from your ungodly ways and receive Christ as your Lord and Savior for the remission of your sins.\n \n \nGrow up and stop trying to dictate what two consenting adults may do. Your bible is not a license or a mandate to run other people's lives.\n\n \n Go climb a tree, blind guide. You are the blind leading the blind down the path to perdition and you're too clueless to recognize the futility of your own folly.\n \n John 8:24 emoticon_xbouncer", 
   {}, 
   424872, 
   null, 
   1298831340.0
  ], 
  [
   424895, 
   null, 
   "gansao", 
   "Even before these 'religious zealots' banned all the poor homosexuals from marrying, anyone who wanted to have children for an heir or their dotage would not ' marry' someone of their own sex.\n \n Sibling marriage was widespread in the time of the Egyptian Ptolemies. That makes it ok to marry your sister and if you object, you must be an incestphobe.\n Which means that you must have secret incestuous feelings.......\n Think thats a crop of XXXX?\n Then read the BS posted by gays for gay ' marriage'.", 
   {}, 
   424889, 
   null, 
   1298834040.0
  ], 
  [
   424899, 
   null, 
   "pappillion001", 
   "The cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n\n \n That is only one cultural meaning. Older couples who had no intention of creating a family unit as well as those who simply didn't want children are accepted without a second thought.\n \n \nThe legal meaning of marriage is, in most States, a contract between two people who are not under the age of consent, of different genders, of the same species, not closely related and who are not already married.\n \n Homosexuals are not a part of the traditional or cultural meaning of marriage. In order to be included, the meaning of marriage would have to change. The catch-22 is that homosexual couples want to be included in the current meaning of marriage, but what gives marriage meaning specifically excludes homosexual couples.\n\n \n And why is that? In a world that has been ruled by male dominance where homosexuality was and is still considered a weakness or failing there has only recently been any serious attempt to change the perception. The fact that women were property that fathers used to the benefit of the family has evolved into an equal partnership (mostly). \n \n Marriage has many definitions and purposes especially if looked at over the last several thousand years, making the view of tradition or culture subject to the desires of the society. Traditionalist can hold onto the way they know and feel comfortable with, but same sex couples wouldn't take that away. Nothing would prevent straight couples from the exact same marriage whether gay people can marry or not.", 
   {}, 
   424874, 
   null, 
   1298835480.0
  ], 
  [
   424900, 
   null, 
   "Xcaliber", 
   "Well, even before doma homosexual couples weren't getting married. It was taken for granted that marriage, legally, was only open to heterosexual couples. Even when the statues that outlines marriage were written, the writers had only heterosexual couples in mind. \n \n I don't think you can reasonably dispute that fact.\n\n \n and I don't think you can reasonably support that fact. Before DOMA there was no definition in our constitution for marriage. And you have no way of knowing what the \" writers\" had in mind when they did eventually lay out guidelines to marriage. The Fact is that Marriage was defined by DOMA to intentionally deny Gay people the right, the fact that it was untested until then is beside the point.", 
   {}, 
   424878, 
   null, 
   1298835600.0
  ], 
  [
   424903, 
   null, 
   "Matthew S", 
   "The cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n \n The legal meaning of marriage is, in most States, a contract between two people who are not under the age of consent, of different genders, of the same species, not closely related and who are not already married.\n \n Homosexuals are not a part of the traditional or cultural meaning of marriage. In order to be included, the meaning of marriage would have to change. The catch-22 is that homosexual couples want to be included in the current meaning of marriage, but what gives marriage meaning specifically excludes homosexual couples.\n\n \n Nonsense Two 70 year old heteros on their 3 or 4th marriages are hardly going to have children. So as long as people beyond breeding age are allowed to contract marriage there is nothing wrong with gay people enetring marriage.", 
   {}, 
   424874, 
   null, 
   1298840700.0
  ], 
  [
   424905, 
   null, 
   "gansao", 
   "Nonsense Two 70 year old heteros on their 3 or 4th marriages are hardly going to have children. So as long as people beyond breeding age are allowed to contract marriage there is nothing wrong with gay people enetring marriage.\n\n \n So it follows that gay couples who are not a mating pair( because they cannot) must be equated to a childless couple...this is dishonest.\n Gay couples are adopting children as well as using surrogate mothers.\n This puts the child at a distinct disadvantage...there is no mother( or father)\n A gay' marriage' is a shadow of a heterosexual one..", 
   {}, 
   424903, 
   null, 
   1298843040.0
  ], 
  [
   424906, 
   null, 
   "jyoshu", 
   "So it follows that gay couples who are not a mating pair( because they cannot) must be equated to a childless couple...this is dishonest.\n\n \n In this case, I have to agree with you.\n An infertile couple that's a man and woman is hindered by a certain type of procreative handicap, so infertility really isn't part of the issue. Marriage still mainly exists because of procreation which a same-gender couple cannot do.", 
   {}, 
   424905, 
   null, 
   1298843520.0
  ], 
  [
   424911, 
   null, 
   "Sigma", 
   "That's your definition. It is certainly not my definition. You don't speak for all of society.\n\n \n Mating pairs exist with or without marriage, and have no legal connection with marriage (since, legally, it doesn't matter if the two people even like one another, or ever intend on consumating said marriage). The only connection between a mating couple and marriage is the connection made on a cultural level.\n \n So, logically, the cultural meaning of marriage would be the purpose of a mating couple. While 'purpose' can mean different things, in this context I daresay most would refer to the evolutionary purpose of a mating couple: reproduction. Love is implied because love brings the couple together for that purpose.\n \n \nIf marriage is about reproduction, why does nobody bat an eye when a 65 year old woman marries a 68 year old man? If you believe marriage is \"formalization of a mating pair\", and \"reproduction is implied\", doesn't this cheapen the institution of marriage in your eyes? Obviously, they are not getting married to start a family...perhaps love is what is important?\n\n \n While legally a 27yr old marrying a 70yr old sugar daddy is not a problem, culturally speaking this marriage is not as meaningful as one that is in-line with the evolutionary purpose I outlined above.\n \n You can point to exceptions all you want, but all it does is outline the difference between the legal meaning and the cultural meaning of marriage.", 
   {}, 
   424888, 
   null, 
   1298845560.0
  ], 
  [
   424913, 
   null, 
   "Sigma", 
   "That is only one cultural meaning. Older couples who had no intention of creating a family unit as well as those who simply didn't want children are accepted without a second thought.\n\n \n Yes, but they are anamolies. It's culturally assumed that people will eventually want children (especially women) even if in actuality it does not always happen. The stereotype is true often enough that the anomalies are just that, anomalies. The driving force behind marriage is not changed by the existence of individual idiosyncrasies any more than the definition of a species changes simply because some members are unable to reproduce (a species is defined by a population able to reproduce amongst themselves). \n \n \nAnd why is that? In a world that has been ruled by male dominance where homosexuality was and is still considered a weakness or failing there has only recently been any serious attempt to change the perception. The fact that women were property that fathers used to the benefit of the family has evolved into an equal partnership (mostly).\n \n Marriage has many definitions and purposes especially if looked at over the last several thousand years, making the view of tradition or culture subject to the desires of the society. Traditionalist can hold onto the way they know and feel comfortable with, but same sex couples wouldn't take that away. Nothing would prevent straight couples from the exact same marriage whether gay people can marry or not.\n\n \n Well, yes, homosexuals have to take away the traditional view of marriage. Homosexuals have to change the definition of marriage in order to be included. Both the cultural and legal meaning of marriage specifically excludes homosexuals. \n \n Yes, the meaning of marriage can change. Homosexuals are trying to do that right now. I'm not saying it's necessarily good or bad to change the meaning of marriage, but it absolutely must happen in order for homosexuals to be included. As a consequence of this, homosexuals will not enjoy the cultural and traditional meaning of marriage, because marriage will no longer have the cultural and traditional meaning that it once did.", 
   {}, 
   424899, 
   null, 
   1298846040.0
  ], 
  [
   424914, 
   null, 
   "Sigma", 
   "Nonsense Two 70 year old heteros on their 3 or 4th marriages are hardly going to have children. So as long as people beyond breeding age are allowed to contract marriage there is nothing wrong with gay people enetring marriage.\n\n \n Only if you reduce the meaning of marriage to a contract between two people. In that case you've stripped any and all cultural meaning from the practice and homosexual marriage would be no more meaningful than two friends becoming married for the benefits.\n \n I would not view that as a happy occurance.", 
   {}, 
   424903, 
   null, 
   1298846340.0
  ], 
  [
   424915, 
   null, 
   "smiley", 
   "Yes, but they are anamolies. It's culturally assumed that people will eventually want children (especially women) even if in actuality it does not always happen. The stereotype is true often enough that the anomalies are just that, anomalies. The driving force behind marriage is not changed by the existence of individual idiosyncrasies any more than the definition of a species changes simply because some members are unable to reproduce (a species is defined by a population able to reproduce amongst themselves). \n \n \n \n Well, yes, homosexuals have to take away the traditional view of marriage. Homosexuals have to change the definition of marriage in order to be included. Both the cultural and legal meaning of marriage specifically excludes homosexuals. \n \n Yes, the meaning of marriage can change. Homosexuals are trying to do that right now. I'm not saying it's necessarily good or bad to change the meaning of marriage, but it absolutely must happen in order for homosexuals to be included. As a consequence of this, homosexuals will not enjoy the cultural and traditional meaning of marriage, because marriage will no longer have the cultural and traditional meaning that it once did.\n\n \n If it is 'culturally assumed' that the purpose of marriage is to produce children (at least to a large part), why 1 man-1 woman. Other forms of marriage produce children. Indeed, it would be much more productive if your financial status were also considered - rich men get to marry several women as they can afford to support them and their children (this model is prevalant in the Bible - how's that for tradition?). Rich women could afford to support many men - nope, that's no good because you still only have one baby machine (never mind).\n \n Besides which, with resources becoming more scarce, what's with the 'we gotta keep producing loadsa sprogs' ideology? We only need to produce enough to continue the line, and we are certainly managing that. In fact we produce to many of the damn things. Why not let the gays look after the surplus, and let them have the rights in payment for this service?", 
   {}, 
   424913, 
   null, 
   1298846820.0
  ], 
  [
   424917, 
   null, 
   "Matthew S", 
   "Only if you reduce the meaning of marriage to a contract between two people. In that case you've stripped any and all cultural meaning from the practice and homosexual marriage would be no more meaningful than two friends becoming married for the benefits.\n \n I would not view that as a happy occurance.\n\n \n It means nothing now if people get divorced and remarried over and over and over again.", 
   {}, 
   424914, 
   null, 
   1298846880.0
  ], 
  [
   424919, 
   null, 
   "gansao", 
   "It means nothing now if people get divorced and remarried over and over and over again.\n\n \n Once again you use failed or failures within marriages to justify your inclusion.\n \n The fact that so many marriages fail or that so many modern marriages fail to live up to its traditional meaning suggests that society needs to redefine marriage not to include homosexuals.\n That would just legitimise the failures.", 
   {}, 
   424917, 
   null, 
   1298847900.0
  ], 
  [
   424924, 
   null, 
   "Sigma", 
   "If it is 'culturally assumed' that the purpose of marriage is to produce children (at least to a large part), why 1 man-1 woman. Other forms of marriage produce children.\n\n \n It is 'culturally assumed' that the purpose of a mating pair is to produce children, not that marriage itself is for that purpose. Marriage is considered a formalization of that bond, but it does not create that bond. While a man can have sex with many women, it is always an iteration of the male-female couple.\n \n \nBesides which, with resources becoming more scarce, what's with the 'we gotta keep producing loadsa sprogs' ideology? We only need to produce enough to continue the line, and we are certainly managing that. In fact we produce to many of the damn things. Why not let the gays look after the surplus, and let them have the rights in payment for this service?\n\n \n Evolution doesn't look that far ahead. Or look ahead at all. Simplistically, it is concerned with surviving long enough to reproduce.", 
   {}, 
   424915, 
   null, 
   1298849700.0
  ], 
  [
   424925, 
   null, 
   "Sigma", 
   "It means nothing now if people get divorced and remarried over and over and over again.\n\n \n Perhaps it doesn't. Perhaps marriage has already lost all meaning. But no matter what happens, Matthew S, homosexual marriage cannot and will not have the same meaning. Either marriage has already lost meaning, or you have to destroy that meaning to be included.", 
   {}, 
   424917, 
   null, 
   1298849820.0
  ], 
  [
   424932, 
   null, 
   "smiley", 
   "It is 'culturally assumed' that the purpose of a mating pair is to produce children, not that marriage itself is for that purpose. Marriage is considered a formalization of that bond, but it does not create that bond. While a man can have sex with many women, it is always an iteration of the male-female couple.\n \n \n \n Evolution doesn't look that far ahead. Or look ahead at all. Simplistically, it is concerned with surviving long enough to reproduce.\n\n \n Again, if marriage is the formalization of the 'mating pair', why mating pair? Why not mating group? The working group (say, one man many women) produces children, and has precedence in the bible. Why the insistence that 1 man, 1 woman be the only form of marriage available?\n \n And who mentioned evolution?", 
   {}, 
   424924, 
   null, 
   1298853180.0
  ], 
  [
   424934, 
   null, 
   "Matthew S", 
   "Perhaps it doesn't. Perhaps marriage has already lost all meaning. But no matter what happens, Matthew S, homosexual marriage cannot and will not have the same meaning. Either marriage has already lost meaning, or you have to destroy that meaning to be included.\n\n \n I have news for you!!! With a 50%+ divorce rate among heteros and 30 min annulment mills in Las Vegas, I think that ship has sailed. In a few years it seems like us gay people will be the only ones who actually want to get and stay married.", 
   {}, 
   424925, 
   null, 
   1298854380.0
  ], 
  [
   424936, 
   null, 
   "Sigma", 
   "Again, if marriage is the formalization of the 'mating pair', why mating pair? Why not mating group?\n\n \n Because groups don't mate. Only pairs do. Even in the situation you describe, it is just many instances of the same iteration: the male-female mating pair. Why would I care what is in the Bible?\n \n \n\n And who mentioned evolution?\n\n \n I did.", 
   {}, 
   424932, 
   null, 
   1298856060.0
  ], 
  [
   424937, 
   null, 
   "Sigma", 
   "I have news for you!!! With a 50%+ divorce rate among heteros and 30 min annulment mills in Las Vegas, I think that ship has sailed. In a few years it seems like us gay people will be the only ones who actually want to get and stay married.\n\n \n Apparently not, since trying to get homosexual marriage passed in State legislatures is and has been an uphill battle. People still place value in the meaning of ancient customs, even if their realization is imperfect.", 
   {}, 
   424934, 
   null, 
   1298856180.0
  ], 
  [
   424939, 
   null, 
   "Xcaliber", 
   "It is 'culturally assumed' that the purpose of a mating pair is to produce children, not that marriage itself is for that purpose. Marriage is considered a formalization of that bond, but it does not create that bond. While a man can have sex with many women, it is always an iteration of the male-female couple.\n\n \n Can you show Evidence that it is Culturally assumed?.. Maybe in a Religious Culture, but Religion doesn't define all of us. With Adoption available there is no longer a Need to re-produce. There are married couples who are not Able to reproduce, so why are they any different that a Gay Couple?. Should be not recognize an older couple who got married but are not able to produce children? Suppose a woman has Ovarian Cancer when young and is unable to have children should we then tell her she can't marry the one she loves because they won't produce a child?. We all know that Gay Couples can't reproduce in the old fashioned way but they can and have adopt children and raise them as well as a straight couple.", 
   {}, 
   424924, 
   null, 
   1298857980.0
  ], 
  [
   424941, 
   null, 
   "smiley", 
   "Because groups don't mate. Only pairs do. Even in the situation you describe, it is just many instances of the same iteration: the male-female mating pair. Why would I care what is in the Bible?\n \n\n \n Aaaah, so that's why you used the phrase 'mating pair'. It was so that only your prefered version of marriage could apply. You started out by saying that it was to do with producing children. When examples of 'mating pairs' who couldn't actually produce children, and other alternatives that produce children more efficiently, were brought to your attention you had to come up with some trick that would exclude the alternatives. The 'mating pair'! Very clever.\n \n Complete bollocks, but very clever.", 
   {}, 
   424936, 
   null, 
   1298859060.0
  ], 
  [
   424943, 
   null, 
   "Sigma", 
   "Aaaah, so that's why you used the phrase 'mating pair'. It was so that only your prefered version of marriage could apply. You started out by saying that it was to do with producing children. When examples of 'mating pairs' who couldn't actually produce children, and other alternatives that produce children more efficiently, were brought to your attention you had to come up with some trick that would exclude the alternatives. The 'mating pair'! Very clever.\n\n \n I'm not sure why 'efficiency' or even the number of children suddenly became an issue. A 'mating pair' is more than a phrase, that's how you sexually produce children. With only two genders, how could it be otherwise? My 'preferred version' is the only method to naturally produce children and I daresay that is a significant fact to most rational people.\n \n If you want to increase the sheer size of a family, then yes take multiple wives.", 
   {}, 
   424941, 
   null, 
   1298859900.0
  ], 
  [
   424944, 
   null, 
   "Sigma", 
   "Can you show Evidence that it is Culturally assumed?\n\n \n The history of the country has been dominated by this view. That seems to be evidence that our culture has viewed marriage in this light.\n \n \nThere are married couples who are not Able to reproduce, so why are they any different that a Gay Couple?\n\n \n As I told smiley, the definition of a species is, simplistically, a population that can reproduce among themselves. If an individual member is unable to reproduce, it is still a member of that species. Individual idiosyncrasies are hypothetical exceptions.", 
   {}, 
   424939, 
   null, 
   1298860140.0
  ], 
  [
   424947, 
   null, 
   "smiley", 
   "I'm not sure why 'efficiency' or even the number of children suddenly became an issue. A 'mating pair' is more than a phrase, that's how you sexually produce children. With only two genders, how could it be otherwise? My 'preferred version' is the only method to naturally produce children. That is a significant fact.\n \n If you want to increase the sheer size of a family, then yes take multiple wives.\n\n You stated that the cultural meaning of marriage is a formalization of a mating pair, who, in turn, create and support a family unit. Love and reproduction are implied.\n \n So, does love not matter? Do children not matter? Then, why the chosen phrase 'mating pair', when mating is only implied? Why not just 'concenting pair'? Concenting is a must, unless we include arranged marriage (then it's just implied, I guess).\n \n If they must be a mating pair, why allow those who are infertile, or old people? Oh yes, they are just an anomaly. They don't matter.\n \n Why a 'mating pair'? Why the choice of the word mating when it clearly doesn't apply in all cases? Why not a 'fertile pair'? Or a 'compatible pair'? Or for that matter, a fertile or compatible group. Maybe we should screen all potential couples to make sure they can reproduce, and then ensure that they mate successfully (preferable with video evidence and a paternal test upon delivery).\n \n If not, why not?\n \n Why insist that marriage should be between people who can reproduce, especially when this is clearly not enforced. And if we are obviously not bothered about the mating part, why insist that marriage be set aside purely for 'mating pairs'?", 
   {}, 
   424943, 
   null, 
   1298862300.0
  ], 
  [
   424948, 
   null, 
   "smiley", 
   "As I told smiley, the definition of a species is, simplistically, a population that can reproduce among themselves. If an individual member is unable to reproduce, it is still a member of that species. Individual idiosyncrasies are hypothetical exceptions.\n\n We are not talking about a species, we are talking about marriage.\n \n Unless, of course, you want to allow marriage between many men and many women, as they, like a species, can reproduce among themselves. And just because those gays can't reproduce, they can still be part of the marriage. After all, they are only anomalies with idiosyncrasies and stuff.", 
   {}, 
   424944, 
   null, 
   1298862720.0
  ], 
  [
   424950, 
   null, 
   "Sigma", 
   "\n So, does love not matter? Do children not matter?\n\n \n Not to the legal definition, no.\n \n \n\n Why a 'mating pair'? Why the choice of the word mating when it clearly doesn't apply in all cases?\n\n \n Why is a mating pair needed for reproduction? That's a child's question, smiley. Even if a virgin at married, it's assumed (but not legally required) that you are not so after you're married. At least, not for long.\n \n I don't think I really need to justify how marriage is viewed, even if I endeavor to explain it.\n \n \n\n Why not a 'fertile pair'? Or a 'compatible pair'? Or for that matter, a fertile or compatible group. Maybe we should screen all potential couples to make sure they can reproduce, and then ensure that they mate successfully (preferable with video evidence and a paternal test upon delivery).\n \n If not, why not?[/\n\n \n As I've explained: groups do not mate. It simply does not occur, outside certain exceptions. There are only two genders, therefore only two contribute to the offspring (in the normal way of things, at least).\n \n As to the rest, there really is no reason why not. It would be governmental overreach and contrary to the ideals of freedom, but other than that ... \n \n \n\n Why insist that marriage should be between people who can reproduce, especially when this is clearly not enforced. And if we are obviously not bothered about the mating part, why insist that marriage be set aside purely for 'mating pairs'?\n\n \n Marriage is a meaningful custom. Part of that meaning is derived from the significant fact that only a heterosexual pairing can naturally produce children. People, in general, enjoy being a part of ancient and meaningful customs. I don't believe that it is unjustified to resist efforts to change this custom.", 
   {}, 
   424947, 
   null, 
   1298867220.0
  ], 
  [
   424951, 
   null, 
   "Sigma", 
   "We are not talking about a species, we are talking about marriage.\n\n \n We were talking about exceptions. Exceptions to the rule of reproduction does not disqualify an individual from the species, even if being part of a species is defined by the ability to reproduce among the population.\n \n \nUnless, of course, you want to allow marriage between many men and many women, as they, like a species, can reproduce among themselves. And just because those gays can't reproduce, they can still be part of the marriage. After all, they are only anomalies with idiosyncrasies and stuff.\n\n \n Except, to continue our analogy, different species aren't an exception to the reproduction of the species as a non-reproducing member is. They're not part of the population we're examining at all.", 
   {}, 
   424948, 
   null, 
   1298867760.0
  ], 
  [
   424953, 
   null, 
   "smiley", 
   "Not to the legal definition, no.\n \n Why is a mating pair needed for reproduction? That's a child's question, smiley. Even if a virgin at married, it's assumed (but not legally required) that you are not so after you're married. At least, not for long.\n \n I don't think I really need to justify how marriage is viewed, even if I endeavor to explain it.\n \n As I've explained: groups do not mate. It simply does not occur. There are only two genders, therefore only two contribute to the offspring (in the normal way of things, at least).\n \n As to the rest, there really is no reason why not. It would be governmental overreach and contrary to the ideals of freedom, but other than that ... \n \n Marriage is a meaningful custom. Part of that meaning is derived from the significant fact that only a heterosexual pairing can naturally produce children. People, in general, enjoy being a part of ancient and meaningful customs. I don't believe that it is unjustified to resist efforts to change this custom.\n\n There you go again with the mating this and mating that.\n \n If you were trying to make me look stupid by implying that I was not aware that a mating couple is necessary for reproduction, you failed. Perhaps it made you look stupid by not understanding that the question was why is a mating pair necessary for marriage. Marriage is the topic of conversation here. Try to keep up.\n \n You seem to be trying to interweave the words mate and reproduce. You say that part of the meaning of marriage is that the couple can reproduce, and then claim that groups don't mate. Well yippadeedee. But groups do reproduce. So, there you go.\n \n And then you go on to claim that people enjoy being part of ancient and meaningful customs. If you are trying to claim that a 1 man, 1 woman marriage being the only viable marriage is an ancient custom then you're sorely misled (or possibly trying to pull a fast one). This notion is quite a modern phenominon. And as reproduction seems to give a marriage meaning, then we've already covered that one.\n \n Infertile people and old people cannot provide that meaning, whereas groups of people can.\n \n Either repoduction is key or it is not. And there are plenty of meaningful ancient marriage customs that you don't seem to want to discuss.", 
   {}, 
   424950, 
   null, 
   1298868840.0
  ], 
  [
   424956, 
   null, 
   "Xcaliber", 
   "The history of the country has been dominated by this view. That seems to be evidence that our culture has viewed marriage in this light.\n\n \n Just as I thought, You can't show any thing to support that claim so I will assume you are wrong and move on.\n \n \n\n As I told smiley, the definition of a species is, simplistically, a population that can reproduce among themselves. If an individual member is unable to reproduce, it is still a member of that species. Individual idiosyncrasies are hypothetical exceptions.\n\n \n What on earth does a Species have to do with Gay people being allowed to marry?.. are you seriously using this as an argument against Gay Marriage?.. I'm curious to know what this has to do with the price of eggs in China.", 
   {}, 
   424944, 
   null, 
   1298869920.0
  ], 
  [
   424957, 
   null, 
   "snakespit", 
   "Go climb a tree, blind guide. You are the blind leading the blind down the path to perdition and you're too clueless to recognize the futility of your own folly.\n\n \n I'm not leading anyone down any path. I find my own way, and prefer to let others do the same. \n \n Reminds me of my favorite song:\n \n \n There is a road, no simple highway, \n Between the dawn and the dark of night, \n And if you go no one may follow, \n That path is for your steps alone. \n \n Ripple in still water, \n When there is no pebble tossed, \n Nor wind to blow. \n \n You who choose to lead must follow \n But if you fall you fall alone, \n If you should stand then who's to guide you? \n If I knew the way I would take you home.", 
   {}, 
   424889, 
   null, 
   1298870460.0
  ], 
  [
   424958, 
   null, 
   "snakespit", 
   "While legally a 27yr old marrying a 70yr old sugar daddy is not a problem, culturally speaking this marriage is not as meaningful as one that is in-line with the evolutionary purpose I outlined above.\n\n \n Who gave you the power to decide what is culturally meaningful? And more importantly, should we legally define marriage based on your perception of \"cultural meaning\"?", 
   {}, 
   424911, 
   null, 
   1298871000.0
  ], 
  [
   424959, 
   null, 
   "Sigma", 
   "If you were trying to make me look stupid by implying that I was not aware that a mating couple is necessary for reproduction, you failed. Perhaps it made you look stupid by not understanding that the question was why is a mating pair necessary for marriage. Marriage is the topic of conversation here. Try to keep up.\n\n \n If I was trying to make you look stupid, pointing out an answer that I know we both know wouldn't be the method. The question was ill-formed to get the answer you were trying for.\n \n Necessity has little to do with it. Why are people necessary for marriage? Because that's what it was created to accomodate.\n \n \nYou seem to be trying to interweave the words mate and reproduce. You say that part of the meaning of marriage is that the couple can reproduce, and then claim that groups don't mate. Well yippadeedee. But groups do reproduce. So, there you go.\n\n \n No, they don't. With two genders, there are only two members that contribute to offspring. A group does not reproduce: only a heterosexual coupling can naturally do that.\n \n \nAnd then you go on to claim that people enjoy being part of ancient and meaningful customs. If you are trying to claim that a 1 man, 1 woman marriage being the only viable marriage is an ancient custom then you're sorely misled (or possibly trying to pull a fast one). This notion is quite a modern phenominon. And as reproduction seems to give a marriage meaning, then we've already covered that one.\n\n \n In one form or another it certainly is ancient. It's current form predates the union, which brings us full circle with the cultural meaning. And one common thread is the heterosexual component, almost without exception. That supports the notion that the core idea behind marriage is a mating couple.\n \n \nInfertile people and old people cannot provide that meaning, whereas groups of people can.\n\n \n Groups provide no meaning that a heterosexual couple would not do on it's own.\n \n And, yes, if marriage were composed solely of non-reproductive couples then it would not have the meaning it does have. But as it is, they do not detract from the meaning either, in the same way non-reproductive members don't detract from a species.\n \n \nEither repoduction is key or it is not. And there are plenty of meaningful ancient marriage customs that you don't seem to want to discuss.\n\n \n Given that we're in a gay marriage forum, I'm not sure what other custom would really be relevant.", 
   {}, 
   424953, 
   null, 
   1298871300.0
  ], 
  [
   424960, 
   null, 
   "Sigma", 
   "Just as I thought, You can't show any thing to support that claim so I will assume you are wrong and move on.\n\n \n Fair enough.", 
   {}, 
   424956, 
   null, 
   1298871540.0
  ], 
  [
   424961, 
   null, 
   "Sigma", 
   "Who gave you the power to decide what is culturally meaningful? And more importantly, should we legally define marriage based on your perception of \"cultural meaning\"?\n\n \n No, you should legally define it any damn way you can get away with.\n \n The cultural definition comes from observation.", 
   {}, 
   424958, 
   null, 
   1298871600.0
  ], 
  [
   424967, 
   null, 
   "pappillion001", 
   "So it follows that gay couples who are not a mating pair( because they cannot) must be equated to a childless couple...this is dishonest.\n\n \n Ah yes of course so many children grow up with mom and dad who spend quality time teaching them all they will need to one day enter the world on their own. \n \n Other than the gender of one what then is the difference between a gay couple who are not a mating pair because they can't and a childless couple who aren't a mating pair because they can't.\n \n \nGay couples are adopting children as well as using surrogate mothers.\n This puts the child at a distinct disadvantage...there is no mother( or father)\n A gay' marriage' is a shadow of a heterosexual one..\n\n \n So the raising children part is not the problem it's the mating part or where they get the kid from?\n \n OK so how is this applicable to gay couples who are not a mating pair and remain childless? So if kids aren't involved then everything is OK right?\n \n Of course not you will come around with some different asinine excuse why it's your business to to tell someone else who they can play house with.\n \n Let's be honest straight people have pixxed all over the ideal concepts of marriage. That is all the different versions, not just our western Judeo-Christian incarnation. Marriage is like a pet that is mistreated by it's owner until someone else wants to take it away and then it has value, but only because it belongs to them not for any change in attitude.", 
   {}, 
   424905, 
   null, 
   1298877780.0
  ], 
  [
   424970, 
   null, 
   "smiley", 
   "\n Necessity has little to do with it. Why are people necessary for marriage? Because that's what it was created to accomodate.\n\n Are gay people not people?\n \n \n\n No, they don't. With two genders, there are only two members that contribute to offspring. A group does not reproduce: only a heterosexual coupling can naturally do that.\n\n A group does not reproduce? What complete and utter rubbish.\n \n \n\n In one form or another it certainly is ancient. It's current form predates the union, which brings us full circle with the cultural meaning. And one common thread is the heterosexual component, almost without exception. That supports the notion that the core idea behind marriage is a mating couple.\n\n Note the phrase 'In one form or another'. This tends to suggests that there are other forms of marriage. Why prohibit all but one?\n \n \n\n Groups provide no meaning that a heterosexual couple would not do on it's own.\n\n This suggests that groups also provide meaning. Why prohibit them?\n \n \n\n And, yes, if marriage were composed solely of non-reproductive couples then it would not have the meaning it does have. But as it is, they do not detract from the meaning either, in the same way non-reproductive members don't detract from a species.\n\n If non-productive couples do not detract from the meaning of marriage, why balk against gay non-productive couples being allowed to share in that meaning?\n \n \n\n Given that we're in a gay marriage forum, I'm not sure what other custom would really be relevant.\n\n Then let me enlighten you, oh unsure one.\n \n Customs such as the marriage of 1 man to many women (examples of which occur throughout history both within and without the bible), the marriage of 1 woman to many men (this tends to occur in cultures with a short supply of females), the marriage of two men (from roman and greek history), the marriage of 1 man, 1 woman and an additional homosexual shaman (a sign of good fortune in some native american cultures). These customs and more are ancient and have provided meaning to marriage for many throughout the years, yet you ignore them all in favour of your narrow and discriminatory view of marriage.", 
   {}, 
   424959, 
   null, 
   1298905680.0
  ], 
  [
   424974, 
   null, 
   "Sigma", 
   "Are gay people not people?\n\n \n The question was a rhetorical device. Your question had no informational value.\n \n \nA group does not reproduce? What complete and utter rubbish.\n\n \n Since, biologically speaking, only a heterosexual couple can reproduce, I think I stand on pretty solid ground here.\n \n \nNote the phrase 'In one form or another'. This tends to suggests that there are other forms of marriage. Why prohibit all but one?\n\n \n I'm not suggesting we prohibit anything.\n \n \nThis suggests that groups also provide meaning. Why prohibit them?\n\n \n A group provides meaning only insofar as it is composed of heterosexual couples. I'm not suggesting we prohibit group marriage, though.\n \n \nIf non-productive couples do not detract from the meaning of marriage, why balk against gay non-productive couples being allowed to share in that meaning?\n\n \n As I explained before: non-reproductive members are still members of the species... but other species are not part of the population we are talking about.\n \n In this analogy, homosexuals are not part of the population.\n \n \nCustoms such as the marriage of 1 man to many women (examples of which occur throughout history both within and without the bible), the marriage of 1 woman to many men (this tends to occur in cultures with a short supply of females), the marriage of two men (from roman and greek history), the marriage of 1 man, 1 woman and an additional homosexual shaman (a sign of good fortune in some native american cultures). These customs and more are ancient and have provided meaning to marriage for many throughout the years, yet you ignore them all in favour of your narrow and discriminatory view of marriage.\n\n \n In roman and greek history, it was not homosexual marriage. At least as we understand it. Being penetrated feminized the recipient which carried a social stigma. Men would kill each other for being propositioned because it threatened their masculinity.\n \n As to the rest, it didn't occur to me that you'd want to talk about them. If you like, we can talk about Arab nations who prefer to have sex with little boys, and just use women for reproduction. But, yes, even for those ancient customs, those who were a part of that culture certainly found meaning in participating in those relationships. Plural marriage especially, the culture feels it's an obligation to have more than 1 wife. Efforts to change the custom would naturally find resistance in those who find meaning in those customs. That is certainly evidenced by LDS members who defy the prohibition on plural marriage.", 
   {}, 
   424970, 
   null, 
   1298912100.0
  ], 
  [
   424975, 
   null, 
   "smiley", 
   "The question was a rhetorical device. Your question had no informational value.\n\n Your previous post stated that marriage was created for people. I was merely asking if gay people fall into that category.\n \n \nSince, biologically speaking, only a heterosexual couple can reproduce, I think I stand on pretty solid ground here.\n\n And I think you don't know what the hell you're talking about. Of course groups reproduce. Whole species would die out if this were not the case. Okay, not those that reproduce asexually.\n \n \nI'm not suggesting we prohibit anything.\n\n Really? You appear to be saying that 1 man 1 woman is the only way to go. Am I wrong in this conclusion?\n \n \nA group provides meaning only insofar as it is composed of heterosexual couples. I'm not suggesting we prohibit group marriage, though.\n\n It appears I am mistaken. Sorry. But you still seem to be saying that heterosexual couples are the only means of providing meaning to marriage. Isn't that a little presumptuous? Can no-one else experience meaning in a relationship?\n \n \nAs I explained before: non-reproductive members are still members of the species... but other species are not part of the population we are talking about.\n \n In this analogy, homosexuals are not part of the population.\n\n Wow! Why are homosexuals not part of the population? You must come from a very isolated region not to have seen them.\n \n \nIn roman and greek history, it was not homosexual marriage. At least as we understand it. Being penetrated feminized the recipient which carried a social stigma. Men would kill each other for being propositioned because it threatened their masculinity.\n\n But it was marriage between 2 men nonetheless. In fact they were quite common until Christianity bacame the official religion of the Roman Empire.\n \n \nAs to the rest, it didn't occur to me that you'd want to talk about them. If you like, we can talk about Arab nations who prefer to have sex with little boys, and just use women for reproduction. But, yes, even for those ancient customs, those who were a part of that culture certainly found meaning in participating in those relationships. Plural marriage especially, the culture feels it's an obligation to have more than 1 wife. Efforts to change the custom would naturally find resistance in those who find meaning in those customs. That is certainly evidenced by LDS members who defy the prohibition on plural marriage.\n\n At least you now admit that meaning can be found in marriage arrangements other than your chosen form. And I notice that you are trying to sneak in examples where harm is done to one party, which is not the case in modern homosexual relationships (at least no more than in modern heterosexual relationships).", 
   {}, 
   424974, 
   null, 
   1298915340.0
  ], 
  [
   424976, 
   null, 
   "Sigma", 
   "Your previous post stated that marriage was created for people. I was merely asking if gay people fall into that category.\n\n \n Yes, that question was a rhetorical device to highlight the uselessness of your question. \n \n \nAnd I think you don't know what the hell you're talking about. Of course groups reproduce. Whole species would die out if this were not the case. Okay, not those that reproduce asexually.\n\n \n I know exactly what I'm talking about. Groups do not reproduce. Couples within groups certainly can reproduce, but groups themselves do not. If you cannot see the distinction then I don't know that any further discussion on the topic will make it clearer to you.\n \n \nReally? You appear to be saying that 1 man 1 woman is the only way to go. Am I wrong in this conclusion?\n\n \n Yes. I am saying that the cultural meaning of marriage is related to the biology and evolutionary purpose of a mating pair. I am not suggesting we legally enforce anything.\n \n \nIt appears I am mistaken. Sorry. But you still seem to be saying that heterosexual couples are the only means of providing meaning to marriage. Isn't that a little presumptuous? Can no-one else experience meaning in a relationship?\n\n \n I am saying heterosexual couples do provide the cultural meaning of marriage. I am not suggesting this cannot or should not change. But if it does change than the meaning that marriage has thus far had is pretty much dead; without biology to base meaning on then marriage will solely gain cultural meaning with nothing underlying it (as much meaning as pederasty did to the Romans, for example). This isn't necessarily a bad thing, but it certainly is a trade-off that is worth worrying about.\n \n \nWow! Why are homosexuals not part of the population? You must come from a very isolated region not to have seen them.\n\n \n It's an analogy. Inattention connotes indifference. Or disrespect.\n \n \nBut it was marriage between 2 men nonetheless. In fact they were quite common until Christianity bacame the official religion of the Roman Empire.\n\n \n Not a marriage as we understand it. Since the cultural meaning would obviously be based on our understanding of the custom, I think the complex interaction between slave-born (who were used freely for sex regardless of gender), freed (who were beholden to those who freed them, but no one else) and free-born (where homosexual relationships carried a social stigma, if not outright disallowed) have little bearing on what we're talking about here.\n \n \nAt least you now admit that meaning can be found in marriage arrangements other than your chosen form. And I notice that you are trying to sneak in examples where harm is done to one party, which is not the case in modern homosexual relationships (at least no more than in modern heterosexual relationships).\n\n \n I don't think harm really matters, since we're talking about meaning. And I notice you bring up pederastic societies such as the Greeks and Romans, but as soon as I bring up a modern example I'm the bad guy?", 
   {}, 
   424975, 
   null, 
   1298916120.0
  ], 
  [
   424984, 
   null, 
   "pappillion001", 
   "Yes, but they are anamolies. It's culturally assumed that people will eventually want children (especially women) even if in actuality it does not always happen. The stereotype is true often enough that the anomalies are just that, anomalies. The driving force behind marriage is not changed by the existence of individual idiosyncrasies any more than the definition of a species changes simply because some members are unable to reproduce (a species is defined by a population able to reproduce amongst themselves).\n\n \n Yes those cases are a minority. My point was that there is no penalty for those that don't or can't and is the assumption based on learned behavior or natural compulsion? \n Cultural assumptions are not limited to procreation and is not the driving force behind marriage. Arguably children play less of a role in the decision to marry now than 100 years ago. The increase in intentionally single parents is helping that trend to continue to increase. People marry for the relationship first the family second. \n \n \nWell, yes, homosexuals have to take away the traditional view of marriage. Homosexuals have to change the definition of marriage in order to be included. Both the cultural and legal meaning of marriage specifically excludes homosexuals\n. \n \n The current popular definition of marriage has and is not been what it is currently. The definition has evolved over time and will continue to do so. \n \n Words change in meaning all the time. Fornicate used to refer to an archway. Change can be good, bad, both or nuetral.\n \n \nYes, the meaning of marriage can change. Homosexuals are trying to do that right now. I'm not saying it's necessarily good or bad to change the meaning of marriage, but it absolutely must happen in order for homosexuals to be included. As a consequence of this, homosexuals will not enjoy the cultural and traditional meaning of marriage, because marriage will no longer have the cultural and traditional meaning that it once did.\n\n \n Women got over being property and being bartered off as a baby factory to whoever was willing to take her off her families hands and that seems to have turned out ok. Given the current state of marriage I still don't see how gays could do anything to cheapen the nexperience more than straight people already have.", 
   {}, 
   424913, 
   null, 
   1298942880.0
  ], 
  [
   424987, 
   null, 
   "snakespit", 
   "No, you should legally define it any damn way you can get away with.\n\n But who get's to decide that legal definition...that's the point. In this specific case in point, the anti crowd wishes to limit the rights of others simply based on personally held beliefs...when no harm is presented to any party involved. In a case such as this, I feel strongly that without a specific vector of harm, we must as a civilized society rule in favor of providing equal rights rather than limit rights of a minority. \n \n \nThe cultural definition comes from observation.\n\n I think these 4 pages thus far make clear that cultural definition is based on subjective obeservation and personal opinion formed via that observation. Clearly, I and many others here do not share your cultural definition.", 
   {}, 
   424961, 
   null, 
   1298945400.0
  ], 
  [
   424988, 
   null, 
   "Sigma", 
   "Yes those cases are a minority. My point was that there is no penalty for those that don't or can't and is the assumption based on learned behavior or natural compulsion? \n\n \n The desire for children is instinctual. It is present in greater or lesser quantities, certainly, but is no less 'natural' for that. Given that the desire for children is the reason our species exists, that fact is understandable. I certainly am not proposing a penalty for homosexuals either.\n \n \nCultural assumptions are not limited to procreation and is not the driving force behind marriage. Arguably children play less of a role in the decision to marry now than 100 years ago. The increase in intentionally single parents is helping that trend to continue to increase. People marry for the relationship first the family second.\n\n \n Well, yes, and this is through the technological and economic progress that made it possible for couples to have sex and raise children without a pitiless division of labor in which a mother had to devote every waking moment to keeping the children alive. Clean water, sanitation, and modern medicine has lowered infant mortality and reduced the need for large numbers of children. Contraception, amniocentesis, ultrasound, and other reproductive technologies have made it possible for women to defer childbearing to the optimal point in their lives.\n \n But our instincts do not change with technology much if at all. The difference in the sexes is not arbitrary, and our instincts evolved along those lines. The desire for a mate and for children still exists, and marriage formalizes that bond.\n \n \nThe current popular definition of marriage has and is not been what it is currently. The definition has evolved over time and will continue to do so. \n \n Words change in meaning all the time. Fornicate used to refer to an archway. Change can be good, bad, both or nuetral.\n\n \n No question. I'm not talking in terms of 'good' or 'bad' because those are value judgements. However, whether or not a definition can change does not mean that the desire to keep the meaning is unjustified or invalid.\n \n \nWomen got over being property and being bartered off as a baby factory to whoever was willing to take her off her families hands and that seems to have turned out ok. Given the current state of marriage I still don't see how gays could do anything to cheapen the nexperience more than straight people already have.\n\n \n That has not been the cultural norm, however, and certainly not the biological norm.", 
   {}, 
   424984, 
   null, 
   1298945760.0
  ], 
  [
   424989, 
   null, 
   "Sigma", 
   "But who get's to decide that legal definition...that's the point.\n\n \n In America the people generally vote on issues, or elect representatives to enact laws. That's how you change the legal definitions.\n \n \nIn this specific case in point, the anti crowd wishes to limit the rights of others simply based on personally held beliefs...when no harm is presented to any party involved. In a case such as this, I feel strongly that without a specific vector of harm, we must as a civilized society rule in favor of providing equal rights rather than limit rights of a minority.\n\n \n This isn't about equality, snakespit. The title of this thread shows that :P In all seriousness, though, it really isn't about equality. \n \n \nI think these 4 pages thus far make clear that cultural definition is based on subjective obeservation and personal opinion formed via that observation. Clearly, I and many others here do not share your cultural definition.\n\n \n I don't think you have a rational basis upon which to dispute that observation. It is an indisputible fact that the cultural view that has dominated this country (as evidenced by the definition of marriage) generally follows evolutionarily sound logic: monogamous pair bonding outside of close familial ties. Inclusion of homosexuals would obviously change that.", 
   {}, 
   424987, 
   null, 
   1298946180.0
  ], 
  [
   424995, 
   null, 
   "Matthew S", 
   "In America the people generally vote on issues, or elect representatives to enact laws. That's how you change the legal definitions.\n\n \n Excellent then you agree that an elected body, and general population of atheists could vote to outlaw religion. I am glad you believe in the tyranny of the majority. \n \n\n This isn't about equality, snakespit. The title of this thread shows that :P In all seriousness, though, it really isn't about equality. \n \n \n \n I don't think you have a rational basis upon which to dispute that observation. It is an indisputable fact that the cultural view that has dominated this country (as evidenced by the definition of marriage) generally follows evolutionarily sound logic: monogamous pair bonding outside of close familial ties. Inclusion of homosexuals would obviously change that.\n\n \n And at one time the cultural view was that women were no more then property, and blacks were slaves. Just because the the majority feels something is culturally justified does not make it morally acceptable.", 
   {}, 
   424989, 
   null, 
   1298949120.0
  ], 
  [
   424996, 
   null, 
   "Sigma", 
   "Excellent then you agree that an elected body, and general population of atheists could vote to outlaw religion. I am glad you believe in the tyranny of the majority.\n\n \n That's what democracy is. While we don't precisely have a democracy, there are enough democratic tools to label parts of it such.\n \n \nAnd at one time the cultural view was that women were no more then property, and blacks were slaves. Just because the the majority feels something is culturally justified does not make it morally acceptable.\n\n \n Agreed. I'm not trying to pass judgement by labelling it good or bad. However, just because something benefits homosexuals does not mean it's morally acceptable, and just because the majority wants something doesn't mean it's unjustified.", 
   {}, 
   424995, 
   null, 
   1298949300.0
  ], 
  [
   425006, 
   null, 
   "Matthew S", 
   "That's what democracy is. While we don't precisely have a democracy, there are enough democratic tools to label parts of it such.\n \n \n \n Agreed. I'm not trying to pass judgement by labelling it good or bad. However, just because something benefits homosexuals does not mean it's morally acceptable, and just because the majority wants something doesn't mean it's unjustified.\n\n \n I have a feeling you would change your tune if the tables were turned and you and your family was singled out by the majority.", 
   {}, 
   424996, 
   null, 
   1298985540.0
  ], 
  [
   425008, 
   null, 
   "Sigma", 
   "I have a feeling you would change your tune if the tables were turned and you and your family was singled out by the majority.\n\n \n I would hope I wouldn't become irrational, but it's true that when people want something badly enough they don't suffer counter-arguments well.\n \n But you're right, I would want to change the laws too.", 
   {}, 
   425006, 
   null, 
   1298997600.0
  ], 
  [
   425044, 
   null, 
   "Matthew S", 
   "I would hope I wouldn't become irrational, but it's true that when people want something badly enough they don't suffer counter-arguments well.\n \n But you're right, I would want to change the laws too.\n\n \n If politicians, that are supposed to represent you, religious leaders, and conservative XXXXXX, and people you don't know, called you and your family evil, that you shouldn't exist, call for your deportation, and execution, you hope you would not become irrational?\n \n The point is that you support my civil rights being put up for a vote of the people. You are willing to make laws that effect my life and my family but will have 0 impact upon yours. Here we are in a forum debating something that should not even be debated.\n \n I am angry to the point of wanting blood. I want those who would see me and my family suffer face the same fate that as they want for us. It is always easier to to make others suffer if you do not have to face the repercussions of your beliefs and actions.", 
   {}, 
   425008, 
   null, 
   1299074400.0
  ], 
  [
   425050, 
   null, 
   "jyoshu", 
   "I have a feeling you would change your tune if the tables were turned and you and your family was singled out by the majority.\n\n \n I don't think you and other gays are being 'singled out'. I think people are just trying to protect marriage from being broadened into what is effectively a meaningless institution. They see this as an affront to marriage, and that's the reason there is resistance to changing marriage. Just because a given group happens to be a minority doesn't mean they are being victimized when they don't get what they want.\n \n \nIf politicians, that are supposed to represent you, religious leaders, and conservative XXXXXX, and people you don't know, called you and your family evil, that you shouldn't exist, call for your deportation, and execution, you hope you would not become irrational?\n \n The point is that you support my civil rights being put up for a vote of the people. You are willing to make laws that effect my life and my family but will have 0 impact upon yours. Here we are in a forum debating something that should not even be debated.\n\n \n I think we need to be very careful here and keep in mind that one can discuss and debate gay marriage without conflating it to all the other things you mentioned. The very debate itself is WHETHER gay marriage is a 'civil right', to begin with. That is not determined yet.\n \n If you don't think we should be debating this in a forum like this, you should take it up with the owners of the forum rather than complaining about it when people DO debate it.", 
   {}, 
   425006, 
   null, 
   1299081420.0
  ], 
  [
   425051, 
   null, 
   "Sigma", 
   "If politicians, that are supposed to represent you, religious leaders, and conservative XXXXXX, and people you don't know, called you and your family evil, that you shouldn't exist, call for your deportation, and execution, you hope you would not become irrational?\n\n \n Your self-worth shouldn't be dependant on what others think about you. I know this is a lofty goal and most people are keenly aware of how others judge them, but regardless it isn't justifiable to abandon reason.\n \n In fact, getting angry is counterproductive. You're easier to dismiss when you're angry. You're nearly as irrational as Easyrider (it's hard to top him in idiocy, though). If you show yourself to be reasonable, then people will try to reason with you. \n \n \nThe point is that you support my civil rights being put up for a vote of the people. You are willing to make laws that effect my life and my family but will have 0 impact upon yours. Here we are in a forum debating something that should not even be debated.\n\n \n I support laws the same laws for you as there are for me. If you want more than that, then you must convince the majority of people to agree with you.\n \n \nI am angry to the point of wanting blood. I want those who would see me and my family suffer face the same fate that as they want for us. It is always easier to to make others suffer if you do not have to face the repercussions of your beliefs and actions.\n\n \n Having you suffer is certainly not my desire.", 
   {}, 
   425044, 
   null, 
   1299088920.0
  ], 
  [
   425054, 
   null, 
   "snakespit", 
   "I don't think you and other gays are being 'singled out'. I think people are just trying to protect marriage from being broadened into what is effectively a meaningless institution. They see this as an affront to marriage, and that's the reason there is resistance to changing marriage. Just because a given group happens to be a minority doesn't mean they are being victimized when they don't get what they want.\n\n I just don't get it. How exactly is the inclusion of gay marriage a threat to the institution of marriage? In a country where ~50% of all first time marriages end in divorce, celebrities change spouses faster than the seasons, television \"reality shows\" make a mockery of the process, and you can get married in a drunken stupor at a drivethru chapel in Las Vegas...what is the threat? You don't hear much from the anti crowd about these things cheapening the institution of marriage. It's a noble thought that people actually care about the \"institution of marriage\"...but I'm not buying it. I think it is simply people's opposition to and hatred of homosexuality that feeds this need to \"protect marriage\". I think as the more conservative baby boomer generation dies off, we will eventually see the end of this state sponsored bigotry. \n \n I was gonna try to respond to Sigma with something like this...but he does indeed seem to be \"impervious to logic\". \n \n \n \n \nI think we need to be very careful here and keep in mind that one can discuss and debate gay marriage without conflating it to all the other things you mentioned. The very debate itself is WHETHER gay marriage is a 'civil right', to begin with. That is not determined yet.\n\n Sure it has. Those who support gay marriage have determined that it is a civil right. Those who are against it have determined that it is not. What you should have said is that SCOTUS has not yet legally decided if it is a civil right or not. If it was determined by SCOTUS to be a civil right tomorrow, I doubt that many of the people who are against gay marriage today would change their opinions. \n \n \nIf you don't think we should be debating this in a forum like this, you should take it up with the owners of the forum rather than complaining about it when people DO debate it.\n\n I won't speak for Matthew, but I took his comment as to mean that we should not have to debate about gay rights. I did not take it as meaning that he did not want to or that we should not debate gay rights. I have to agree with him, I find it sad that in the year 2011 we are still having this debate, but I am fully willing to carry on with it as long as gays do not have equal rights.", 
   {}, 
   425050, 
   null, 
   1299095040.0
  ], 
  [
   425055, 
   null, 
   "jyoshu", 
   "I just don't get it. How exactly is the inclusion of gay marriage a threat to the institution of marriage? In a country where ~50% of all first time marriages end in divorce, celebrities change spouses faster than the seasons, television \"reality shows\" make a mockery of the process, and you can get married in a drunken stupor at a drivethru chapel in Las Vegas...what is the threat?\n\n \n But religious people DO oppose those things. And more importantly no one is trying to enshrine divorced couples to get benefits. That's the difference. \n \n \nWhat you should have said is that SCOTUS has not yet legally decided if it is a civil right or not. If it was determined by SCOTUS to be a civil right tomorrow, I doubt that many of the people who are against gay marriage today would change their opinions. \n\n \n So you agree with me it has not been determined yet.\n I don't see how guaranteed govt. benefits for any limited part of the population can possibly EVER be a constitutionally given civil right. If it is, then any group for ANY reason they claim--however outlandish--would have to be given the benefits as well. That's one of the points I think Sigma is trying to get you to realize with the whole 'groups' thing.\n \n \nI won't speak for Matthew, but I took his comment as to mean that we should not have to debate about gay rights. \n\n \n Well, if that's the case, then no one is making him respond. He indeed doesn't HAVE to debate it. That's up to him whether or not he wants to chime in. \n \n The reason it's still a debate in 2011 isn't because of anything 'sad', but rather because the jury is still out on issues related to marriage and morality when it comes to gay sexual relationships; that you and Matthew may be WRONG in the cavalier way you view gay sex and making marriage an 'anything-goes' institution. It's the height of arrogance to pretend that's not a possibility.", 
   {}, 
   425054, 
   null, 
   1299097620.0
  ], 
  [
   425056, 
   null, 
   "Sigma", 
   " It's a noble thought that people actually care about the \"institution of marriage\"...but I'm not buying it.\n\n \n Then why are homosexuals so wild about it? I doubt it's purely philosophical. I think people care about marriage quite a lot.\n \n I also think it would take some mental gymnastics to say marriage benefits are civil rights.\n \n \n I just don't get it. How exactly is the inclusion of gay marriage a threat to the institution of marriage?\n\n \n Heterosexual attraction is the basis of sexual reproduction. There really is no way to rationally deny this. I believe this fact has a certain amount of meaning to most people. It's important. Ancient forms and customs, even arbitrary ones, acquire meaning to different cultures. They might be unique to that culture, but they are meaningful within that culture. \n \n Now take the custom of marriage. The only thing that saves it from being an arbitrary cultural custom is the fact that it is based upon heterosexual attraction. Therefore it has meaning even beyond a cultural phenomenon because it acquires meaning from both the biological function and the cultural function. In a sense, it is an acknowledgement of the importance of heterosexual attraction to humans as a species (since sexual reproduction is one of the basis of evolution itself). De-coupling marriage from the biological base turns marriage into an arbitrary cultural custom. The history of our biology is time-less, but our cultural ideas are not. That can be regarded as a threat, I think.\n \n \n I was gonna try to respond to Sigma with something like this...but he does indeed seem to be \"impervious to logic\". \n\n \n \"He\"?", 
   {}, 
   425054, 
   null, 
   1299097860.0
  ], 
  [
   425073, 
   null, 
   "snakespit", 
   "Then why are homosexuals so wild about it? I doubt it's purely philosophical. I think people care about marriage quite a lot.\n\n I'm speaking about the motivations of those who are against gay marriage. Like I said...you don't hear a whole lot about the other things I listed, which in my opinion are far more damaging to the \"institution\" of marriage than allowing 2 men or 2 women to marry. You know what marriage I care about?...my own, and that's it. If Bob and Steve down the road get married...I am not impacted in any way. My marriage is not cheapened in any way by who someone else decides to marry. \n \n \nI also think it would take some mental gymnastics to say marriage benefits are civil rights.\n\n So what gives heterosexual couples the \"right\" to marry? \n \n \nHeterosexual attraction is the basis of sexual reproduction. There really is no way to rationally deny this. I believe this fact has a certain amount of meaning to most people. It's important.\n\n Yeah, I get it. Bob + Steve = No Baby --- Bob + Wendy = Baby\n If you wouldn't mind coming around to a salient point on this issue...?\n \n \nAncient forms and customs, even arbitrary ones, acquire meaning to different cultures. They might be unique to that culture, but they are meaningful within that culture. \n \n Even ancient forms and customs were once new. \n \n \nNow take the custom of marriage. The only thing that saves it from being an arbitrary cultural custom is the fact that it is based upon heterosexual attraction. Therefore it has meaning even beyond a cultural phenomenon because it acquires meaning from both the biological function and the cultural function. In a sense, it is an acknowledgement of the importance of heterosexual attraction to humans as a species (since sexual reproduction is one of the basis of evolution itself). De-coupling marriage from the biological base turns marriage into an arbitrary cultural custom. The history of our biology is time-less, but our cultural ideas are not. That can be regarded as a threat, I think.\n\n So your saying that if gay people are allowed to marry...then marriage becomes pointless and heterosexual couples will stop having sex and our species will parish? I know this probably boils your point down to the absurd, but I really don't get what you are driving at. Could you explain it in simple terms? \n \n \n\"He\"?\n\n Excuse me. Is \"he\" a \"she\"? If so...my mistake, and I appologize.", 
   {}, 
   425056, 
   null, 
   1299118620.0
  ], 
  [
   425076, 
   null, 
   "Sigma", 
   "So what gives heterosexual couples the \"right\" to marry?\n\n \n Marriage is open to anyone who follows the guidelines, snakespit.\n \n \n\n Yeah, I get it. Bob + Steve = No Baby --- Bob + Wendy = Baby\n If you wouldn't mind coming around to a salient point on this issue...?\n\n \n I think it is a salient point. Studying evolution has made me somewhat awestruck about the complexity of the human body and the psychological reactions that have evolved within us. The fact that heterosexual attraction facilitates this is hugely important I think.\n \n \nEven ancient forms and customs were once new. \n \n So your saying that if gay people are allowed to marry...then marriage becomes pointless and heterosexual couples will stop having sex and our species will parish? I know this probably boils your point down to the absurd, but I really don't get what you are driving at. Could you explain it in simple terms? \n\n \n I'm saying that marriage will stop meaning what it does now, and will mean something new. Marriage will be an arbitrary cultural custom. It's certainly not earthshattering, but it is a tradeoff. Marriage cannot retain it's cultural meaning and include homosexuals at the same time. I think it's justifiable to resist the change for this reason. I think it can reasonably be said that including homosexuals is a threat to what marriage currently means to us.\n \n Add to that the slippery slope that has some truth to it, and marriage will certainly be somewhat pointless. Besides the legal benefits, of course.\n \n \nExcuse me. Is \"he\" a \"she\"? If so...my mistake, and I appologize.\n\n \n I was just confused because I hadn't thought I had discussed my gender before.", 
   {}, 
   425073, 
   null, 
   1299119880.0
  ], 
  [
   425078, 
   null, 
   "Matthew S", 
   "Your self-worth shouldn't be dependant on what others think about you. I know this is a lofty goal and most people are keenly aware of how others judge them, but regardless it isn't justifiable to abandon reason. Look at the riots and the cities that went up in flames in the 1960's\n \n\n Oh please the television, movies, newspapers, books, and magazines are full of heteros making wedding plans, wedding announcements, or weddings. ever see the program Bridezilla? Their self worth isn't defined by marriage, and neither is mine. I just want equal status and rights to what the heteros have. In fact I would be happy and my sense of justice satisfied if no one could get married, then we would all be equal.\n \n \n \n\n In fact, getting angry is counterproductive. You're easier to dismiss when you're angry. You're nearly as irrational as Easyrider (it's hard to top him in idiocy, though). If you show yourself to be reasonable, then people will try to reason with you. \n\n \n Anger is and can be productive, let a few anti gay churches go up in flames maybe some respect will be had.\n \n\n I support laws the same laws for you as there are for me. If you want more than that, then you must convince the majority of people to agree with you.\n \n\n It is hardly the same when you get to marry the person you love and have that marriage recognized by the state you live in. I am currently married as any hetero couple is using the same process, forms, and waiting period in Iowa that every one in Iowa goes through. The difference is that my license, the same piece of paper, is not recognized by the state of Michigan or the federal government. How on earth is that not equal or discrimination.\n \n \n\n Having you suffer is certainly not my desire.\n\n That may not be your intention but that is not only the way it comes off but also the effect of your support for discriminatory anti gay evil laws.", 
   {}, 
   425051, 
   null, 
   1299121620.0
  ], 
  [
   425080, 
   null, 
   "Sigma", 
   "Oh please the television, movies, newspapers, books, and magazines are full of heteros making wedding plans, wedding announcements, or weddings. ever see the program Bridezilla? Their self worth isn't defined by marriage, and neither is mine. I just want equal status and rights to what the heteros have. In fact I would be happy and my sense of justice satisfied if no one could get married, then we would all be equal.\n\n \n Yeah, and people (whether heterosexual or homosexual) without significant others also get sad when they watch those shows, or even when valentine's day rolls around. \n \n Not everyone can marry whom they love. Not everyone finds someone who they love or who loves them. We are all equal regardless, Matthew S.\n \n \nAnger is and can be productive, let a few anti gay churches go up in flames maybe some respect will be had.\n\n \n You won't garner respect by burning churches. Passion can get you respect, but not irrational anger. You're tending toward the latter, and from watching Easyrider you can see what happens when you go off the deep end. Nobody on either side of the issue respects him.\n \n \nIt is hardly the same when you get to marry the person you love and have that marriage recognized by the state you live in. I am currently married as any hetero couple is using the same process, forms, and waiting period in Iowa that every one in Iowa goes through. The difference is that my license, the same piece of paper, is not recognized by the state of Michigan or the federal government. How on earth is that not equal or discrimination.\n\n \n You don't know if I can marry whom I love. Even heterosexuals cannot marry whomever they love. It's a lie.\n \n I know you're angry enough to spit nails because you want to be able to get married anywhere, but to a great many people marriage is for a purpose. Not every heterosexual fits into it, even, and certainly deviants like pedophiles don't fit into it. You have got to realize that maybe you need to accept you don't get everything that everyone else gets. I know for a fact I don't get everything that everyone else gets and I have to live with that. Not everyone finds love, not everyone gets married. It happens, man.\n \n \nThat may not be your intention but that is not only the way it comes off but also the effect of your support for discriminatory anti gay evil laws.\n\n \n To be honest I can't even see how not getting married is 'suffering'. There are plenty of single people out there who are not suffering. At least, no more than anyone else without a partner.", 
   {}, 
   425078, 
   null, 
   1299124140.0
  ], 
  [
   425083, 
   null, 
   "snakespit", 
   "Marriage is open to anyone who follows the guidelines, snakespit.\n\n What guidelines, who agreed upon them, what law spells them out, and who enforces them?\n \n \nI think it is a salient point. Studying evolution has made me somewhat awestruck about the complexity of the human body and the psychological reactions that have evolved within us. The fact that heterosexual attraction facilitates this is hugely important I think.\n\n But how is this pertinent to the discussion of gay marriage?\n \n \nI'm saying that marriage will stop meaning what it does now, and will mean something new. Marriage will be an arbitrary cultural custom. It's certainly not earthshattering, but it is a tradeoff. Marriage cannot retain it's cultural meaning and include homosexuals at the same time. I think it's justifiable to resist the change for this reason. I think it can reasonably be said that including homosexuals is a threat to what marriage currently means to us.\n\n So your base objection is that marriage will be damaged because it will no longer be defined as 1 man and one woman, but rather as 2 people? \n \n \nAdd to that the slippery slope that has some truth to it, and marriage will certainly be somewhat pointless. Besides the legal benefits, of course.\n\n If gays were allowed to marry tomorrow, would you still wish to be married? \n \n \nI was just confused because I hadn't thought I had discussed my gender before.\n\n Not that I remembered, but I certainly meant no offense. Again, I do appologize. I am often far more concerned with debating the subject at hand than debating the person (unless it is Easy, then I take pleasure in debating the \"person\".)", 
   {}, 
   425076, 
   null, 
   1299129780.0
  ], 
  [
   425085, 
   null, 
   "Sigma", 
   "What guidelines, who agreed upon them, what law spells them out, and who enforces them?\n\n \n A valid partner is someone who is not 'underage', not of the same gender, not of a different species, not of close relations and who is not already married. We all agree upon them as we agree upon any legal mandate.\n \n \nBut how is this pertinent to the discussion of gay marriage?\n\n \n It's sort of central to my point about the meaning we give to marriage. Since heterosexual attraction has importance to most people, I daresay, marriage then gains meaning even beyond an arbitrary cultural custom.\n \n \nSo your base objection is that marriage will be damaged because it will no longer be defined as 1 man and one woman, but rather as 2 people?\n \n If gay were allowed to marry tomorrow, would you still wish to be married?\n\n \n Damaged? It will lose the meaning it gains from being associated with heterosexuality, certainly. There's no getting around that from what I can see. I think it's justifiable to want to keep what gives custom meaning.\n \n Look at it this way: if marriage has never been about family, would marriage be viewed as what you do when you want to start a family? I don't think it would have that association without the history it has. People will still view it as what you do when you want to start a family, but it will be out of remembered meaning which will probably fade over time. After that, it will be about the legal benefits you can garner from it, if these have any point after the change. Any meaning it has will be a cultural artifact without anything underlying it. Some people already look at it that way. I'm not sure how long restrictions against incest or plural marriage would last, since those restrictions are based on biology as well.\n \n And that raises a question: Why are there legal benefits? The Federal government has a legitimate interest in discouraging reproduction outside of marriage, but when marriage is no longer about family is there really a justifiable purpose?", 
   {}, 
   425083, 
   null, 
   1299130860.0
  ], 
  [
   425086, 
   null, 
   "Xcaliber", 
   "A valid partner is someone who is not 'underage', not of the same gender, not of a different species, not of close relations and who is not already married.  We all agree upon them as we agree upon any legal mandate.\n\n \n When you say WE all agree exactly who are you speaking of?. I certainly don't agree with all of it. It's not religions place to define what marriage is and is not in the first place. You have said one does not have to be religious to disagree with gay marriage, you're wrong. There is no secular reasoning for denying gay people a right to marry. Anyone opposed to such a marriage whether they are currently religious or not have been influenced in their belief by religion.", 
   {}, 
   425085, 
   null, 
   1299136800.0
  ], 
  [
   425087, 
   null, 
   "Sigma", 
   "When you say WE all agree exactly who are you speaking of?\n\n \n I'm speaking of everyone who lives in the society... it's implicit that we agree to live by the laws of that society :P A social contract, if you will. That's why we're punished for breaking those laws. Change them, sure... break them, no.\n \n \nThere is no secular reasoning for denying gay people a right to marry. Anyone opposed to such a marriage whether they are currently religious or not have been influenced in their belief by religion.\n\n \n Well, I certainly disagree with your point of view... what have I said that points to religion? If the meaning were solely based upon religion then it would be an arbitrary custom. But it's based upon biology, which isn't an arbitrary difference.", 
   {}, 
   425086, 
   null, 
   1299137940.0
  ], 
  [
   425089, 
   null, 
   "pappillion001", 
   "The desire for children is instinctual. It is present in greater or lesser quantities, certainly, but is no less 'natural' for that. Given that the desire for children is the reason our species exists, that fact is understandable. I certainly am not proposing a penalty for homosexuals either.\n\n \n I am a undecided on this statement. Considering more of our lives are spent without the desire to reproduce than the window in which we can is open. The is the biological desire to go thruough the motions, but more often then not it isn't with procreation in mind. Obviously one is necessary for the other and the biological desire is for the survival of the species, but in associating marrigae with only procreation fails to explain circumstances were that is not the intent or the regard it is given by society. Children can be an important factor but not a deal killer.\n \n \nWell, yes, and this is through the technological and economic progress that made it possible for couples to have sex and raise children without a pitiless division of labor in which a mother had to devote every waking moment to keeping the children alive. Clean water, sanitation, and modern medicine has lowered infant mortality and reduced the need for large numbers of children. Contraception, amniocentesis, ultrasound, and other reproductive technologies have made it possible for women to defer childbearing to the optimal point in their lives.\n\n \n Suggesting that children are not the primary purpose of marriage. That the relationship has equal if not greater value.\n \n \nBut our instincts do not change with technology much if at all. The difference in the sexes is not arbitrary, and our instincts evolved along those lines. The desire for a mate and for children still exists, and marriage formalizes that bond.\n\n \n Our instincts may remain somewhat consistant, but instinct lags behind experience. The desire for children will never go away, but how we react to those instincts will shape future generations.\n \n \nNo question. I'm not talking in terms of 'good' or 'bad' because those are value judgements. However, whether or not a definition can change does not mean that the desire to keep the meaning is unjustified or invalid.\n\n \n When that desire inteferes with the principals on which the society maintains itself then it does become invalid or there must be a revision to the ideals that are used by the populous. Those opposed to gay marriage can express their view they can choose not to participate in such a marriage, but when we talk about equal rights and equal opportunities that doesn'r mean for just the majority. \n \n \n That has not been the cultural norm, however, and certainly not the biological norm.[/QUOTE]\n \n That has been the culrual norm longer than not and in a number of places remains so. How often have women been the dominant gender in a society? I could count the number on one hand even if I didn't have any hands because there doesn't exist one known civilization in which that was the case.", 
   {}, 
   424988, 
   null, 
   1299141780.0
  ], 
  [
   425095, 
   null, 
   "Matthew S", 
   "I'm speaking of everyone who lives in the society... it's implicit that we agree to live by the laws of that society :P A social contract, if you will. That's why we're punished for breaking those laws. Change them, sure... break them, no.\n \n \n \n Well, I certainly disagree with your point of view... what have I said that points to religion? If the meaning were solely based upon religion then it would be an arbitrary custom. But it's based upon biology, which isn't an arbitrary difference.\n\n \n As long as 70 year olds are allowed to marry then you have lost that arguement. \n \n What is the difference between a couple of 70 year olds and a gay couple?", 
   {}, 
   425087, 
   null, 
   1299153180.0
  ], 
  [
   425096, 
   null, 
   "Matthew S", 
   "I'm speaking of everyone who lives in the society... it's implicit that we agree to live by the laws of that society :P A social contract, if you will. That's why we're punished for breaking those laws. Change them, sure... break them, no.\n \n \n \n Well, I certainly disagree with your point of view... what have I said that points to religion? If the meaning were solely based upon religion then it would be an arbitrary custom. But it's based upon biology, which isn't an arbitrary difference.\n\n \n BTW I have no problem if a law said only fertile men and women were allowed to marry and that they must produce children as a requirement of getting the license, and that if children are not produced the license must be surrendered. There would also be no divorce. I have no problem with this because it would men that many many heteros would also be barred from marriage. As long as there is no child requirement and 70 year old heteros can marry then gays must be allowed to marry.", 
   {}, 
   425087, 
   null, 
   1299153540.0
  ], 
  [
   425102, 
   null, 
   "Sigma", 
   "I am a undecided on this statement. Considering more of our lives are spent without the desire to reproduce than the window in which we can is open. The is the biological desire to go thruough the motions, but more often then not it isn't with procreation in mind.\n\n \n You might be confusing proximate and ultimate causation. Absolutely people go through the motions to satisfy the proximate need (the desire for sex). However, the amoral process of natural selection created the desire for sex as a method to ensure reproduction. That is the ultimate causation.\n \n \nObviously one is necessary for the other and the biological desire is for the survival of the species, but in associating marrigae with only procreation fails to explain circumstances were that is not the intent or the regard it is given by society. Children can be an important factor but not a deal killer.\n\n \n Marriage and reproduction are not one and the same, and I don't mean to suggest it is. Marriage is the cultural way to formalize the heterosexual bond which, itself, facilitates reproduction. Marriage gains meaning from that association (a great deal of meaning, imo), but can also gain meaning beyond it.\n \n \nSuggesting that children are not the primary purpose of marriage. That the relationship has equal if not greater value.\n\n \n Since heterosexual attraction is used (by natural selection) to facilitate reproduction, the relationship itself is associated with reproduction even if reproduction does not occur.\n \n \nOur instincts may remain somewhat consistant, but instinct lags behind experience. The desire for children will never go away, but how we react to those instincts will shape future generations.\n\n \n Of course, but our history is not changable. The importance of reproduction will not diminish even if modern technology changes how and when we reproduce.\n \n \nWhen that desire inteferes with the principals on which the society maintains itself then it does become invalid or there must be a revision to the ideals that are used by the populous. Those opposed to gay marriage can express their view they can choose not to participate in such a marriage, but when we talk about equal rights and equal opportunities that doesn'r mean for just the majority.\n\n \n That can be true, but human nature should not be irrelevent to our choices even if they do not dictate our choices. The facts must be combined with a statement of values and method of resolving conflicts among them. Rape, for example, is a facet of human nature and avoiding rape is also a facet of human nature. Since it is inherent in our value system that the interests of women are not subordinate to the interests of men, rape is not tolerated. With that being said, biological differences can justify differences in society. Men and women are not identical to one another and differences in how they're treated in similar situations is justifiable. \n \n With that being said: marriage, in our culture, has been a formalization of a bond that is related to reproduction. Homosexuals simply do not fit into that meaning. The meaning would have to change to accomodate them. My argument is not whether the meaning should change. My argument that including homosexuals will change what marriage means. It is a trade-off, and without acknowledgement of human nature we would choose one trade-off over another without even realizing it.\n \n \nThat has been the culrual norm longer than not and in a number of places remains so. How often have women been the dominant gender in a society? I could count the number on one hand even if I didn't have any hands because there doesn't exist one known civilization in which that was the case.\n\n \n Yes, all cultures divide their labor by sex, with more responsibility for childrearing by women and more control of the public and political realms by men. These differences are exactly what an evolutionary biologist would predict, in fact.\n \n However, our culture has not bought and sold women. So, no, it has not been the cultural norm. It would be an arbitrary custom to buy and sell women, anyway.", 
   {}, 
   425089, 
   null, 
   1299176580.0
  ], 
  [
   425103, 
   null, 
   "Sigma", 
   "As long as 70 year olds are allowed to marry then you have lost that arguement. What is the difference between a couple of 70 year olds and a gay couple?\n\n \n A heterosexual bond's ultimate causation is to facilitate reproduction. Pointing out a particular couple who does not reproduce would not change that fact :P\n \n Marriage is a formalization of that bond.\n \n \nBTW I have no problem if a law said only fertile men and women were allowed to marry and that they must produce children as a requirement of getting the license, and that if children are not produced the license must be surrendered. There would also be no divorce. I have no problem with this because it would men that many many heteros would also be barred from marriage. As long as there is no child requirement and 70 year old heteros can marry then gays must be allowed to marry. \n\n \n Rofl, you would still have a problem with that, don't lie.\n \n After all, OMG THEY HAVE BENEFITS YOU DON'T GET OMG. And that's unconstitutional isn't it, Matthew S. At least according to your flawed reasoning.", 
   {}, 
   425095, 
   null, 
   1299177000.0
  ], 
  [
   425106, 
   null, 
   "snakespit", 
   "A heterosexual bond's ultimate causation is to facilitate reproduction. Pointing out a particular couple who does not reproduce would not change that fact :P\n\n But you continuously point to homosexuals for that very reason...their marriages will not lead to reproduction. Why are they different then?\n \n \nMarriage is a formalization of that bond.\n\n And yet again, I must ask the obvious question. How would the inclusion of homosexuals in marriage harm or weaken the heterosexual bond? Do you think that heterosexuals will stop getting married and stop reproducing? (as an aside: that might not be a bad idea...since our population is rapidly going to become unsustainable)", 
   {}, 
   425103, 
   null, 
   1299180960.0
  ], 
  [
   425107, 
   null, 
   "Sigma", 
   "But you continuously point to homosexuals for that very reason...their marriages will not lead to reproduction. Why are they different then?\n\n \n Generalizing that natural selection uses heterosexual attraction to facilitate reproduction is valid, just a saying that a species is a population that can reproduce among themselves. If a member (or couple) does not reproduce, it does not endanger it's membership in the species or in the generalization of heterosexuality.\n \n Homosexuality would not fit in that generalization, and would be outside the population in the analogy.\n \n \nAnd yet again, I must ask the obvious question. How would the inclusion of homosexuals in marriage harm or weaken the heterosexual bond? Do you think that heterosexuals will stop getting married and stop reproducing? (as an aside: that might not be a bad idea...since our population is rapidly going to become unsustainable)\n\n \n I answered that question already, however. Was there an aspect of it you did not understand? Including homosexual couples would change the meaning of marriage, since marriage is a formalization of the heterosexual bond which, itself, evolved to facilitate reproduction.", 
   {}, 
   425106, 
   null, 
   1299181740.0
  ], 
  [
   425112, 
   null, 
   "snakespit", 
   "I answered that question already, however. Was there an aspect of it you did not understand? Including homosexual couples would change the meaning of marriage, since marriage is a formalization of the heterosexual bond which, itself, evolved to facilitate reproduction.\n\n No, I understand that you believe it will \"change the meaning\"...I asked you a different question. What harm will it bring about? Simply changing the meaning of something does not in and of itself imply harm.", 
   {}, 
   425107, 
   null, 
   1299183840.0
  ], 
  [
   425114, 
   null, 
   "Sigma", 
   "No, I understand that you believe it will \"change the meaning\"...I asked you a different question. What harm will it bring about? Simply changing the meaning of something does not in and of itself imply harm.\n\n \n I don't think I've argued any harm, snakespit, except where it relates to changing the meaning of marriage. That, in a sense, could be construed as a 'threat' or 'harming' the meaning but the negative connotations might constitute value judgements that I am trying not to make.", 
   {}, 
   425112, 
   null, 
   1299185100.0
  ], 
  [
   425115, 
   null, 
   "snakespit", 
   "I don't think I've argued any harm, snakespit, except where it relates to changing the meaning of marriage. That, in a sense, could be construed as a 'threat' or 'harming' the meaning but the negative connotations might constitute value judgements that I am trying not to make.\n\n Are you in favor of \"civil unions\" that would convey all the same rights as marriage to a gay couple?", 
   {}, 
   425114, 
   null, 
   1299187200.0
  ], 
  [
   425116, 
   null, 
   "Sigma", 
   "Are you in favor of \"civil unions\" that would convey all the same rights as marriage to a gay couple?\n\n \n I'm not sure I care one way or the other. Laws come and go, with one change wiping out the previous layer of change like footprints in the sand. I'm pretty fatalistic about the whole thing, tbh.\n \n Edited to add: Like the title says I don't think it's about the rights, though. Homosexual couples, understandably, want to be included in marriage for the very same reason that others want to exclude homosexual couples. Marriage is meaningful. It is simply unfortunate for homosexual people that the meaning is incompatible with homosexuality.", 
   {}, 
   425115, 
   null, 
   1299187320.0
  ], 
  [
   425171, 
   null, 
   "Matthew S", 
   "A heterosexual bond's ultimate causation is to facilitate reproduction. Pointing out a particular couple who does not reproduce would not change that fact :P\n \n Marriage is a formalization of that bond.\n \n \n \n Rofl, you would still have a problem with that, don't lie.\n \n After all, OMG THEY HAVE BENEFITS YOU DON'T GET OMG. And that's unconstitutional isn't it, Matthew S. At least according to your flawed reasoning.\n\n \n I want equality. The lack of is what I find unconstitutional and unjust.", 
   {}, 
   425103, 
   null, 
   1299211440.0
  ], 
  [
   425175, 
   null, 
   "Sigma", 
   "I want equality. The lack of is what I find unconstitutional and unjust.\n\n \n Surely, and in your little scenario married people still have benefits that you don't get. So it's a lie that you'd 'be ok with that' since you've been pretty loudly outspoken about that very point. That if anyone has benefits you don't get then it must be unconstitutional.", 
   {}, 
   425171, 
   null, 
   1299212040.0
  ], 
  [
   425177, 
   null, 
   "Matthew S", 
   "Surely, and in your little scenario married people still have benefits that you don't get. So it's a lie that you'd 'be ok with that' since you've been pretty loudly outspoken about that very point. That if anyone has benefits you don't get then it must be unconstitutional.\n\n \n I have had this idea for years.\n \n http://www.4forums.com/political/gay-rights-debates/8573-marriage-between-man-woman.html\n \n \nI have decided that a compromise is in order about marriage. If marriage is, as the christian right has stated, about children then I have some new licensing rules that need to be implemented.\n \n \n 1 If marriage is limited to a man and a women they need to submit proof of fertility to get a license.\n \n 2 they must have a child within a year for the license being grated or the license must be surrendered\n \n 3 there can not be any divorce the couple must remain together for the child's welfare.\n \n 4 once the children are grown or if the child dies then the license must be surrendered.\n \n 5 only breeding age men and women will be permitted licenses.\n \n 6 proof of consumption, by video or Affidavit of 3 Witnesses must be kept on file at the court house.\n \n 7 the license must be renewed, much as a driver license is, with tests of parental fitness every 2 years. If found unfit the license is surrendered along with the children.\n \n \n I could live with this my sense of equality would be sated since there would also be heterosexual excluded from marriage.\n", 
   {}, 
   425175, 
   null, 
   1299212220.0
  ], 
  [
   425178, 
   null, 
   "Sigma", 
   "I have had this idea for years.\n\n \n lol, so what? You've also been braying about how if some people have benefits that you don't have access to (and in your scenario it would be much less possible for you to get those benefits) then it must be unconstitutional.\n \n So either you're a hypocrite or you don't actually pay attention to what you say.", 
   {}, 
   425177, 
   null, 
   1299212400.0
  ], 
  [
   425204, 
   null, 
   "Matthew S", 
   "lol, so what? You've also been braying about how if some people have benefits that you don't have access to (and in your scenario it would be much less possible for you to get those benefits) then it must be unconstitutional.\n \n So either you're a hypocrite or you don't actually pay attention to what you say.\n\n \n I actually have a marriage license. The same license that everyone gets from the state of Iowa, yet my license is not recognized by either the federal government or the state of Michigan, how is that not unconstitutional?\n \n Why are those the only two options? I want equality and I don't care how it comes about. If my rules where applied to marriage, yes it would suck, but I would then be treated equally to those heteros, who currently do not breed, can not breed, or choose not to breed, yet can get a marriage license at the drop of a hat and have it recognized.", 
   {}, 
   425178, 
   null, 
   1299243360.0
  ], 
  [
   425213, 
   null, 
   "Sigma", 
   "I actually have a marriage license. The same license that everyone gets from the state of Iowa, yet my license is not recognized by either the federal government or the state of Michigan, how is that not unconstitutional?\n\n \n Because the Constitution does not require them to :P It has been long established that States have authority over marriage definitions.\n \n \nWhy are those the only two options? I want equality and I don't care how it comes about. If my rules where applied to marriage, yes it would suck, but I would then be treated equally to those heteros, who currently do not breed, can not breed, or choose not to breed, yet can get a marriage license at the drop of a hat and have it recognized.\n\n \n Because, gasp, they get marriage benefits while you do not! Are you saying it's equal for some people to get marriage benefits but single people do not?", 
   {}, 
   425204, 
   null, 
   1299263460.0
  ], 
  [
   425293, 
   null, 
   "Matthew S", 
   "Because the Constitution does not require them to :P It has been long established that States have authority over marriage definitions.\n \n\n What is it about the same piece of paper you do not understand?", 
   {}, 
   425213, 
   null, 
   1299300900.0
  ], 
  [
   425297, 
   null, 
   "Sigma", 
   "What is it about the same piece of paper you do not understand?\n\n \n The reason you have that paper is the same reason other States don't have to honor it. That reason is: States decide for themselves what constitutes a marriage.\n \n I'm still interested in the fact that you're ok with some people getting marriage benefits and others not getting them.", 
   {}, 
   425293, 
   null, 
   1299302580.0
  ], 
  [
   425316, 
   null, 
   "Matthew S", 
   "The reason you have that paper is the same reason other States don't have to honor it. That reason is: States decide for themselves what constitutes a marriage.\n\n \n \n Once again the state of Iowa issues one piece of paper to everyone. What part of that do you not understand? The other states and the federal government must recognize all or none.\n \n \n \n\n I'm still interested in the fact that you're ok with some people getting marriage benefits and others not getting them.\n\n \n If marriage is to be about breeders and breeding children, and my rules are adopted by the state then yes I am alright. If my rules were adopted then almost no one would get married, and those who get married have to breed if they don't they are no longer married. They have to have 3 witnesses to their act of breeding, along with a video of the event stored in the public records of the county were they live.", 
   {}, 
   425297, 
   null, 
   1299332340.0
  ], 
  [
   425317, 
   null, 
   "gansao", 
   "\n \n \n \n \n If marriage is to be about breeders and breeding children, and my rules are adopted by the state then yes I am alright. If my rules were adopted then almost no one would get married, and those who get married have to breed if they don't they are no longer married. They have to have 3 witnesses to their act of breeding, along with a video of the event stored in the public records of the county were they live.\n\n \n I would add that the only breeding pairs allowed would be one of each sex( thats is no turkey baster sex with sub contracted female )\n Therefore the child would have both a male and female parent.\n All one sex parenting would be prohibited.\n Marriage would be elevated to a privilege only to be allowed for the most physically fit and intelligent individuals and would have to be a life commitment( or at least until the children grew up)\n The fact that gays would not be allowed( or at least severly discouraged) to actually breed may result in far fewer homosexuals..that is if it is indeed a genetic condition\n \n Why you feel the need for three witnesses attending the ' breeders' sexual act I cannot imagineemoticon_xclown", 
   {}, 
   425316, 
   null, 
   1299334680.0
  ], 
  [
   425318, 
   null, 
   "Matthew S", 
   "I would add that the only breeding pairs allowed would be one of each sex( thats is no turkey baster sex with sub contracted female )\n Therefore the child would have both a male and female parent.\n All one sex parenting would be prohibited.\n Marriage would be elevated to a privilege only to be allowed for the most physically fit and intelligent individuals and would have to be a life commitment( or at least until the children grew up)\n The fact that gays would not be allowed( or at least severely discouraged) to actually breed may result in far fewer homosexuals..that is if it is indeed a genetic condition\n \n Why you feel the need for three witnesses attending the ' breeders' sexual act I cannot imagineemoticon_xclown\n\n \n In most legal contracts you need to have witnesses this would be no different. One wants to make sure they understand the seriousness of the legal contract they are entering to breed children for the state.", 
   {}, 
   425317, 
   null, 
   1299338040.0
  ], 
  [
   425322, 
   null, 
   "gansao", 
   "In most legal contracts you need to have witnesses this would be no different. One wants to make sure they understand the seriousness of the legal contract they are entering to breed children for the state.\n\n \n Why are they breeding children for the State?\n Why not for themselves?\n The contract would be the marriage not the sexual intercourse..a dna test of the baby would confirm that it was a result of sex between the couple.\n \n A 'breeding' couple would most likely have a bond that no homosexual couple could imagine... the same as all heterosexual couples that produce children between themselves.\n The very best that a homosexual couple can offer a child is an equivalent of a dysfunctional heterosexual family.\n \n I agree that couples should be forced to make a binding commitment and be vetted before they are allowed to produce children.\n In the past marriage was considered a lifelong commitment and the ability to provide for the children relied on the parents health and wealth.\n Children from poor unhealthy parents were more likely to die than rich healthy ones and a couple that did not stay together became social pariahs.\n Homosexuals had no place in their understanding of marriage, no more than the ' breeder' style of marriage that you have dreamed up.\n \n Also in the past marriages were arranged by wealthy families with the couple carefully picked and the females were relied upon to produce heirs for the husbands..they also had a custom of looking at the the sheets after the couple consumated the marriage to see if they had intercourse and that the newlywed wife was a virgin.\n In fact you could say that you the idea you dreamed up is a relic of the past that excludes homosexuals from marrying...well doneemoticon_xgood", 
   {}, 
   425318, 
   null, 
   1299340740.0
  ], 
  [
   425327, 
   null, 
   "Sigma", 
   "Once again the state of Iowa issues one piece of paper to everyone. What part of that do you not understand? The other states and the federal government must recognize all or none.\n\n \n I understand every part of that. Nothing makes States recognize all or none, Matthew S. In fact, it's been true since the ratification that States establish their own marriage laws... and anyone in the State is subject to those marriage laws. It doesn't matter what other States say about your marriage because you're not in those States.\n \n \nIf marriage is to be about breeders and breeding children, and my rules are adopted by the state then yes I am alright.\n\n \n No you aren't because some people would have marriage benefits but you will not. You've been very vocal that if anyone gets marriage benefits when you do not then it must be unconstitutional. Are you now saying that it's perfectly Constitutional for only some people to get marriage benefits?\n \n And you're wrong, of course. People would get married. Besides 'having witnesses' (which is for the signing of the contract not the execution, duh), a lifelong relationship with children is the ideal marriage. It's what people hope to have.", 
   {}, 
   425316, 
   null, 
   1299344160.0
  ], 
  [
   425330, 
   null, 
   "Matthew S", 
   "I understand every part of that. Nothing makes States recognize all or none, Matthew S. In fact, it's been true since the ratification that States establish their own marriage laws... and anyone in the State is subject to those marriage laws. It doesn't matter what other States say about your marriage because you're not in those States.\n \n \n \n No you aren't because some people would have marriage benefits but you will not. You've been very vocal that if anyone gets marriage benefits when you do not then it must be unconstitutional. Are you now saying that it's perfectly Constitutional for only some people to get marriage benefits?\n \n And you're wrong, of course. People would get married. Besides 'having witnesses' (which is for the signing of the contract not the execution, duh), a lifelong relationship with children is the ideal marriage. It's what people hope to have.\n\n \n And why would gay people be any different? What we have is you saying to me that I can't get married because you have some belief against it. \n \n I wish I could say to you, you can't go to that place or do that thing because I have a belief against you doing so.", 
   {}, 
   425327, 
   null, 
   1299356040.0
  ], 
  [
   425331, 
   null, 
   "Matthew S", 
   "Why are they breeding children for the State?\n Why not for themselves?\n The contract would be the marriage not the sexual intercourse..a dna test of the baby would confirm that it was a result of sex between the couple.\n \n A 'breeding' couple would most likely have a bond that no homosexual couple could imagine... the same as all heterosexual couples that produce children between themselves.\n The very best that a homosexual couple can offer a child is an equivalent of a dysfunctional heterosexual family.\n \n I agree that couples should be forced to make a binding commitment and be vetted before they are allowed to produce children.\n In the past marriage was considered a lifelong commitment and the ability to provide for the children relied on the parents health and wealth.\n Children from poor unhealthy parents were more likely to die than rich healthy ones and a couple that did not stay together became social pariahs.\n Homosexuals had no place in their understanding of marriage, no more than the ' breeder' style of marriage that you have dreamed up.\n \n Also in the past marriages were arranged by wealthy families with the couple carefully picked and the females were relied upon to produce heirs for the husbands..they also had a custom of looking at the the sheets after the couple consummated the marriage to see if they had intercourse and that the newlywed wife was a virgin.\n In fact you could say that you the idea you dreamed up is a relic of the past that excludes homosexuals from marrying...well doneemoticon_xgood\n\n \n I want it witnessed and video taped with the video tapes becoming a public record anyone could look up and maybe even post publicly.", 
   {}, 
   425322, 
   null, 
   1299356160.0
  ], 
  [
   425332, 
   null, 
   "gansao", 
   "\n \n I wish I could say to you, you can't go to that place or do that thing because I have a belief against you doing so.\n\n \n Yes, that just about sums it up", 
   {}, 
   425330, 
   null, 
   1299356280.0
  ], 
  [
   425333, 
   null, 
   "gansao", 
   "I want it witnessed and video taped with the video tapes becoming a public record anyone could look up and maybe even post publicly.\n\n \n If it helps stop homosexuals from being granted sham marriages and discouraged from adopting children, I'll send you a video of me and the missus on the jobemoticon_xgood", 
   {}, 
   425331, 
   null, 
   1299356460.0
  ], 
  [
   425334, 
   null, 
   "Sigma", 
   "And why would gay people be any different? What we have is you saying to me that I can't get married because you have some belief against it. \n\n \n Saying heterosexuals are the same as homosexuals is political fiction. At some point you'll have to realize that biological differences exist and sometimes that has ramifications for how you're treated. It's a bit like being left-handed; the world is sort of built around people being rightys. Sorry. You're sitting there demanding the world be changed to suit leftys as if it is your due, while at the same time casually denying that anything was made for rightys in the first place. It's insulting, ignorant and arrogant. I'd oppose you for those reasons alone :P\n \n \nI wish I could say to you, you can't go to that place or do that thing because I have a belief against you doing so.\n\n \n You can. You really can. All you need is for a lot of people to agree with you.", 
   {}, 
   425330, 
   null, 
   1299356760.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Gay Marriage Is Not About Equal Rights. It Is About Love.", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15071, 
  "discussion_files": [
   [
    "4213.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-print.html"
   ], 
   [
    "4214.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-7-print.html"
   ], 
   [
    "4215.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-5-print.html"
   ], 
   [
    "4216.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-4-print.html"
   ], 
   [
    "4217.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-6-print.html"
   ], 
   [
    "4218.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-3-print.html"
   ], 
   [
    "4219.html", 
    "http://www.4forums.com/political/gay-rights-debates/15071-gay-marriage-not-about-equal-rights-about-love-2-print.html"
   ]
  ], 
  "identifier": 15071
 }
]