[
 [
  [
   425160, 
   null, 
   "MrWriteLA", 
   "Been away from the Internet for ten days (visiting my fiance--that's not a typo: one \"e\") , and on returning am amazed no one has commented on this major development, which is over a week old:\n \n Justice Department to Stop Prosecuting DOMA Cases\nThe Obama administration has told the Justice Department to stop prosecuting cases related to the Defense of Marriage Act, which says that states don't have to recognize the gay marriages performed by other states and that the federal definition of marriage is between a man and a woman, National Journal's Marc Ambinder reports. President Obama thinks the law is unconstitutional.\n", 
   {
    "post_info": {
     "post_title": "Obama orders Justice Dept. to Stop Defending DOMA, Says It's Unconstitutional"
    }
   }, 
   null, 
   null, 
   1299208620.0
  ], 
  [
   425164, 
   null, 
   "Sigma", 
   "Been away from the Internet for ten days (visiting my fiance--that's not a typo: one \"e\") , and on returning am amazed no one has commented on this major development, which is over a week old:\n \n Justice Department to Stop Prosecuting DOMA Cases\n\n \n What's sort of amusing is that the reason doma is unconstitutional is that it attempts to give States power that they've always had: defining marriage.\n \n From here\n \n That DOMA plainly intrudes on a core area of state sovereignty-the ability to define the marital status of its citizens-also convinces this court that the statute violates the Tenth Amendment.", 
   {
    "unicode_changes_made": true
   }, 
   425160, 
   null, 
   1299209760.0
  ], 
  [
   425241, 
   null, 
   "Easyrider", 
   "Been away from the Internet for ten days (visiting my fiance--that's not a typo: one \"e\") , and on returning am amazed no one has commented on this major development, which is over a week old:\n \n Justice Department to Stop Prosecuting DOMA Cases\n\n \n DOMA isn't unconstitutional. SCOTUS has not ruled on it.\n \n I think that little cretin Obama or even Holder should be impeached for making up their own laws and ignoring what has already been passed by a wide majority.\n \n And the pro-gay-sex heathens ought to be educated or deported.", 
   {}, 
   425160, 
   null, 
   1299281640.0
  ], 
  [
   425275, 
   null, 
   "jazyjason", 
   "\n And the pro-gay-sex heathens ought to be educated or deported.\n\n \n You know we gay people are the life blood of this Country. We are some of the most dedicated, hard working, talented people that sets us apart in our own unique ways.\n \n And in case you've been wondering where I have been. I just officially aced my Conductor's Promotion exam with a 98% for the Burlington Northern And Santa Fe Railway.\n \n So I suppose if you want to deport me you better find someone else to haul that boxcar full of Bible's you ordered to pollute the minds of ignorant people in Uganda....emoticon_xagree", 
   {}, 
   425241, 
   null, 
   1299293940.0
  ], 
  [
   425337, 
   null, 
   "Easyrider", 
   "You know we gay people are the life blood of this Country. We are some of the most dedicated, hard working, talented people that sets us apart in our own unique ways.\n \n And in case you've been wondering where I have been. I just officially aced my Conductor's Promotion exam with a 98% for the Burlington Northern And Santa Fe Railway.\n \n So I suppose if you want to deport me you better find someone else to haul that boxcar full of Bible's you ordered to pollute the minds of ignorant people in Uganda....emoticon_xagree\n\n \n 26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error.\n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. - Romans chapter 1\n \n Wise up.", 
   {}, 
   425275, 
   null, 
   1299370380.0
  ], 
  [
   425362, 
   null, 
   "Matthew S", 
   "DOMA isn't unconstitutional. SCOTUS has not ruled on it.\n \n I think that little cretin Obama or even Holder should be impeached for making up their own laws and ignoring what has already been passed by a wide majority.\n \n And the pro-gay-sex heathens ought to be educated or deported.\n\n \n They are doing nothing more then every other administrations have done since the founding of the republic. Section 3 of DOMA has already been found unconditional in both the 1st and the 2nd circuit courts. Obama has always believed that DOMA was unconstitutional since before running in the primaries. In the LOGO debates in 2007 he preached this over and over again. It is you Conservatives that are not paying attention and are now surprised.", 
   {}, 
   425241, 
   null, 
   1299418440.0
  ], 
  [
   425363, 
   null, 
   "Matthew S", 
   "26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error.\n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. - Romans chapter 1\n \n Wise up.\n\n \n Absolutely and If given a chance I would have sex with the entire Hunky mouth watering Swiss guard on top of the altar in St Peters. Unfortunatly I'm sure I would not be the first to do so.", 
   {}, 
   425337, 
   null, 
   1299418620.0
  ], 
  [
   425365, 
   null, 
   "gansao", 
   "Absolutely and If given a chance I would have sex with the entire Hunky mouth watering Swiss guard on top of the altar in St Peters. Unfortunatly I'm sure I would not be the first to do so.\n\n \n I bet your manbag is full of condoms:)", 
   {}, 
   425363, 
   null, 
   1299419340.0
  ], 
  [
   425469, 
   null, 
   "pappillion001", 
   "26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error.\n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. - Romans chapter 1\n \n Wise up.\n\n \n The original version or excuse me the 400+ year old copy of what is thought to be the original is worded slightly different, but I read this as confirmation that being gay is not a choice. It's God's choice for gay people to be gay. \n \n See just as you choose to read what you want the way you want others can as well and something to chew on other than your bottom lip, my interpretation is actually just as valid as yours.", 
   {}, 
   425337, 
   null, 
   1299599760.0
  ], 
  [
   425470, 
   null, 
   "pappillion001", 
   "DOMA isn't unconstitutional. SCOTUS has not ruled on it.\n \n I think that little cretin Obama or even Holder should be impeached for making up their own laws and ignoring what has already been passed by a wide majority.\n \n And the pro-gay-sex heathens ought to be educated or deported.\n\n \n You know there is a reason people are allowed to vote which laws will govern them. Times and views change. Because something wasn't popular in the past doesn't prevent it from becoming accepted in the future.", 
   {}, 
   425241, 
   null, 
   1299599940.0
  ], 
  [
   425472, 
   null, 
   "pappillion001", 
   "Been away from the Internet for ten days (visiting my fiance--that's not a typo: one \"e\") , and on returning am amazed no one has commented on this major development, which is over a week old:\n \n Justice Department to Stop Prosecuting DOMA Cases\n\n \n I think it is mostly a political move. Regardless of what he has done the perception is that he hasn't done anything. If it is something that can be measured by degrees Republicans undermine it or take credit for it the only things he has a shot at are those that the right are opposed to on principal and can't mount any type of meaningful objection. \n \n It's unfortunate as many times these things end up being a tease. There is a big to do but never a real commitment leaving it worse off when its pushed aside for the next hot topic", 
   {}, 
   425160, 
   null, 
   1299605700.0
  ], 
  [
   425506, 
   null, 
   "jazyjason", 
   "26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error.\n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. - Romans chapter 1\n\n \n So all you can do is copy and paste some lame bible quote to justify your prejudice and hatred toward gays? Figures. Your pathetic when it comes to giving credibility for your slanted views of others..\n \n \n \nWise up.\n\n \n I find it Ironic you'd even say that...", 
   {}, 
   425337, 
   null, 
   1299639780.0
  ], 
  [
   425545, 
   null, 
   "Easyrider", 
   "Originally Posted by Easyrider  \n 26 Because of this, God gave them over to shameful lusts. Even their women exchanged natural sexual relations for unnatural ones. 27 In the same way the men also abandoned natural relations with women and were inflamed with lust for one another. Men committed shameful acts with other men, and received in themselves the due penalty for their error.\n \n 28 Furthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over to a depraved mind, so that they do what ought not to be done. - Romans chapter 1\n\n \n \nSo all you can do is copy and paste some lame bible quote to justify your prejudice and hatred toward gays? Figures. Your pathetic when it comes to giving credibility for your slanted views of others..\n \n\n \n My views are slanted and yours aren't? Go tell that tripe to your pet carp.\n \n You're one day closer to the Pit and you haven't wised up yet. No wonder you're lost.", 
   {}, 
   425506, 
   null, 
   1299716040.0
  ], 
  [
   425562, 
   null, 
   "jazyjason", 
   "My views are slanted and yours aren't? Go tell that tripe to your pet carp.\n \n You're one day closer to the Pit and you haven't wised up yet. No wonder you're lost.\n\n \n Sorry, last time I checked my rights as an American Citizen weren't dictated by the Bible or ANY \"holy\" book for that matter. You want to impose a christian state where the good old boys have their glory days back, McCarthyism runs rampant, and the paddy-wagons line the streets just waiting to pick up your version of \"degenerates.\" \n \n Your views do NOTHING positive for this Country. They do nothing to empower American Citizens, their crude, damning, repetitive, and non productive in any way shape or form...\n \n In other words, you may as well grow a beard and stand at a military funeral with Freddy because that's all it looks like your good for. Someone for people to shake their head and their fist at...", 
   {}, 
   425545, 
   null, 
   1299737040.0
  ], 
  [
   425727, 
   null, 
   "Xcaliber", 
   "What's sort of amusing is that the reason doma is unconstitutional is that it attempts to give States power that they've always had: defining marriage.\n \n From here\n \n That DOMA plainly intrudes on a core area of state sovereignty-the ability to define the marital status of its citizens-also convinces this court that the statute violates the Tenth Amendment.\n\n \n No it is unconstitutional because the Federal Government doesn't have the Authority to Define Marriage. The only power DOMA gave the states was the Authority to ignore the Faith and Credit clause in the 14th amendment and released the states from having to recognize out of state marriages. The States have always had the right to define Marriage in their own state, but under the constitution they had to recognize marriage laws from other states.. until DOMA was passed of course.", 
   {
    "unicode_changes_made": true
   }, 
   425164, 
   null, 
   1299998880.0
  ], 
  [
   425753, 
   null, 
   "Sigma", 
   "No it is unconstitutional because the Federal Government doesn't have the Authority to Define Marriage. The only power DOMA gave the states was the Authority to ignore the Faith and Credit clause in the 14th amendment and released the states from having to recognize out of state marriages. The States have always had the right to define Marriage in their own state, but under the constitution they had to recognize marriage laws from other states.. until DOMA was passed of course.\n\n \n You're directly contradicting yourself :P \n \n If a State has authority to define marriage within it's borders, then it can define marriage within it's borders regardless of whether the couple is visiting from out-of-State or not. DOMA had no effect on that. Did you even bother to read the link I gave? It's pretty explicit: \n \n State control over marital status determinations is a convention rooted in the early history of the United States, predating even the American Revolution. Indeed, the field of domestic relations was regarded as such an essential element of state power that the subject of marriage was not even broached at the time of the framing of the Constitution. And, as a consequence of continuous local control over marital status determinations, what developed was a checkerboard of rules and restrictions on the subject that varied widely from state to state, evolving throughout American history\n \n Emphasis added. Show me proof that States must obey declarations of status from other States, or don't bother making that claim.", 
   {}, 
   425727, 
   null, 
   1300052100.0
  ], 
  [
   425792, 
   null, 
   "Matthew S", 
   "Emphasis added. Show me proof that States must obey declarations of status from other States, or don't bother making that claim.\n\n \n The federal government has always taken the word of the states. If a state said a couple was married they were married in the eyes of the federal government. Even the Lovings were married in the eyes of the federal government because Maryland said they were and even though Virginia arrested them and imprisoned them.", 
   {}, 
   425753, 
   null, 
   1300110660.0
  ], 
  [
   425797, 
   null, 
   "Sigma", 
   "The federal government has always taken the word of the states. If a state said a couple was married they were married in the eyes of the federal government. Even the Lovings were married in the eyes of the federal government because Maryland said they were and even though Virginia arrested them and imprisoned them.\n\n \n The Federal gov't 'takes the word of the State' because marital status determinations are under State authority.\n \n Your statement also implies its opposite. If the State says a couple is not married, what then?", 
   {}, 
   425792, 
   null, 
   1300120440.0
  ], 
  [
   425813, 
   null, 
   "daewoo", 
   "You're directly contradicting yourself :P \n \n If a State has authority to define marriage within it's borders, then it can define marriage within it's borders regardless of whether the couple is visiting from out-of-State or not. DOMA had no effect on that. Did you even bother to read the link I gave? It's pretty explicit: \n \n State control over marital status determinations is a convention rooted in the early history of the United States, predating even the American Revolution. Indeed, the field of domestic relations was regarded as such an essential element of state power that the subject of marriage was not even broached at the time of the framing of the Constitution. And, as a consequence of continuous local control over marital status determinations, what developed was a checkerboard of rules and restrictions on the subject that varied widely from state to state, evolving throughout American history\n \n Emphasis added. Show me proof that States must obey declarations of status from other States, or don't bother making that claim.\n\n \n Wrong.\n \n Article iV, section 1 of the US constitution:\n \n \nFull Faith and Credit shall be given in each State to the public Acts, Records, and judicial Proceedings of every other State. And the Congress may by general Laws prescribe the Manner in which such Acts, Records and Proceedings shall be proved, and the Effect thereof.\n\n \n In 2007 a federal appeals court used the full faith and credit clause to rule that the state of Oklahoma must recognize adoptions by same sex couples that were done in other states. \n \n While what you posted was correct, that different states had different requirements regarding marriage (and that is still true today), the conclusion you draw from it is laughably ludicrous. If I get drunk one weekend in Vegas and marry somebody, I am still considered married to them when I return to my home state, even though my home state has much stricter rules regarding getting married than Nevada does. \n \n If I go to colorado with my wife and get divorced, we are still divorced when I get back to my home state. \n \n Your take on this is just plain silly.", 
   {}, 
   425753, 
   null, 
   1300132860.0
  ], 
  [
   425817, 
   null, 
   "Sigma", 
   " While what you posted was correct, that different states had different requirements regarding marriage (and that is still true today), the conclusion you draw from it is laughably ludicrous. If I get drunk one weekend in Vegas and marry somebody, I am still considered married to them when I return to my home state, even though my home state has much stricter rules regarding getting married than Nevada does.\n\n \n Regarding this particular point: This is not always true. If you live in Massachusetts, for example, you must have a marriage certificate from that State. From the link: Out-of-State marriage licenses cannot be used in Massachusetts\n \n See Wilkins v. Zelichowski, where the marriage of a 16-year-old female was held invalid in New Jersey, regardless of its validity in Indiana where it was performed.\n \n In in re Mortenson&#8217;s Estate, marriage of first cousins was held invalid in Arizona, though it was lawfully performed in New Mexico, given Arizona's policy reflected in statute declaring such marriages &#8220;prohibited and void&#8221;.\n \n Even Senator Dianne Feinstein says, speaking about homosexual marriage specifically: Proponents argue that Congress&#8217; authority to legislate in this area comes from the Constitution&#8217;s full faith and credit clause. However, this is a pretty exotic interpretation of Congress&#8217; authority under that clause. Congress, in it&#8217;s 200-year history has never once used the full faith and credit clause to nullify rather than implement the effect of a public act or judgment by a State\n and\n According to conflict-of-laws doctrine, States may already refuse to recognize out-of-State marriages when the marriage violates that State&#8217;s public policy. For example, expressions of public policy may be found in State statutes, State case law, or pronouncements by State attorneys general.\n \n Given the strong language that SCOTUS uses to describe marriage as a local matter I think it is far from ludicrous to presume it will continue to be so. Combine this with the dismissal of cases such as Baker v Nelson, which challenged the constitutionality of restrictions on homosexual marriage on equal protection grounds, \"for want of a substantial Federal question\" and the situation seems clear. Silly or not, this isn't exactly \"my take\" on the matter, but instead seems to be how it works.", 
   {}, 
   425813, 
   null, 
   1300138920.0
  ], 
  [
   425848, 
   null, 
   "Matthew S", 
   "The Federal gov't 'takes the word of the State' because marital status determinations are under State authority.\n \n Your statement also implies its opposite. If the State says a couple is not married, what then?\n\n \n Doesn't matter if Iowa says I am married then the federal government needs to recognize it if the federal recognizes the marriage then it doesn't matter what Michigan has to say about it.", 
   {}, 
   425797, 
   null, 
   1300152660.0
  ], 
  [
   425849, 
   null, 
   "Sigma", 
   "Doesn't matter if Iowa says I am married then the federal government needs to recognize it if the federal recognizes the marriage then it doesn't matter what Michigan has to say about it.\n\n \n That's true... Michigan has nothing to do with your marriage in Iowa. \n \n Unless you live in Michigan. Then what Michigan says about it has some importance. What the Federal gov't thinks on the matter is actually not very important at all :P\n \n while the law of the place where the ceremony is performed has an interest in the validity of the ceremony, it has none 'in the intrinsic validity of the status, unless the status is to be enjoyed there.' Taintor, What Law Governs Status of Marriage, 19 B.U. Law Rev. 353, 368.", 
   {}, 
   425848, 
   null, 
   1300152900.0
  ], 
  [
   425851, 
   null, 
   "Matthew S", 
   "That's true... Michigan has nothing to do with Iowa. \n \n Unless you live in Michigan. Then what Michigan says about it has some importance :P\n \n while the law of the place where the ceremony is performed has an interest in the validity of the ceremony, it has none 'in the intrinsic validity of the status, unless the status is to be enjoyed there.' Taintor, What Law Governs Status of Marriage, 19 B.U. Law Rev. 353, 368.\n\n \n However I am still married as far as the federal government is concerned because Iowa says so no matter what Michigan has to say about it. Iowa says I am married the federal government recognises it and Michigan can go to hell.", 
   {}, 
   425849, 
   null, 
   1300153260.0
  ], 
  [
   425853, 
   null, 
   "Sigma", 
   "However I am still married as far as the federal government is concerned because Iowa says so no matter what Michigan has to say about it. Iowa says I am married the federal government recognises it and Michigan can go to hell.\n\n \n If the Federal gov't takes it's cue from the State, then you'd have to have a valid marriage in the State you live in to be recognized by the Federal gov't.\n \n But even if what you said was true, how have you benefited? The Federal gov't recognizes your marriage, but the State you live in does not. This helps you how?", 
   {}, 
   425851, 
   null, 
   1300153860.0
  ], 
  [
   425856, 
   null, 
   "daewoo", 
   "Regarding this particular point: This is not always true. If you live in Massachusetts, for example, you must have a marriage certificate from that State. From the link: Out-of-State marriage licenses cannot be used in Massachusetts\n\n \n A marriage license is an administrative form that is processed by the local court. That has nothing at all to do with this.\n \n \nSee Wilkins v. Zelichowski, where the marriage of 16-year-old female was held invalid in New Jersey, regardless of validity in Indiana where it was performed.\n\n \n No, it was not held invalid. She was allowed to have it annulled:\n \n - Google Scholar\n \n \nThe plaintiff's evidence adequately established that she was 16 years of age when she was married and that she did not confirm her marriage after she had reached 18 years of age and the Chancery Division expressly found that an 373*373 annulment would be \"for the best interests of the child\"; nevertheless it declined to grant the relief sought by the plaintiff on the ground that the marriage was valid in Indiana and should therefore, under principles of the conflict of laws, not be nullified by a New Jersey court because of the plaintiff's nonage. In reaching the same result the Appellate Division recognized that the Chancery Division had ample power to nullify the Indiana marriage of the New Jersey domiciliaries (N.J.S. 2A:34-1(e); Scularekes v. Gullett, 106 N.J. Eq. 369, 371 (Ch. 1930); In re Olcott, 141 N.J. Eq. 8, 11 (Ch. 1947)) but expressed the view that comity dictated that it should not take such action unless there was an imperative New Jersey policy (which it did not find) against marriages of 16-year-old females. See 43 N.J. Super. at page 603. Cf. 2 Beale, Conflict of Laws § 129.1 (1935); Goodrich, Conflict of Laws 417 (3d ed. 1949); Fleming, \"Choice of Law in Nullity Proceedings,\" 23 Austr. L.J. 458 (1949); Jackson, \"Annulment and the Choice of Laws,\" 27 Can. B. Rev. 173 (1949); Kingsley, \"The Law of Infants' Marriages,\" 9 Vand. L. Rev. 593, 604 (1956); Taintor, \"Marriage in the Conflict of Laws,\" 9 Vand. L. Rev. 607, 624 (1956); Mann, \"The Royal Commission on Marriage and Divorce,\" 21 Modern L. Rev. 1, 12 (1958).\n\n \n They found that she could get an annulment under new jersey law even though she was married in Indiana. \n \n Again, that has nothing to do with this case....in fact, if the facts were as you present them, there would be no need for an annulment in New Jersey because she would not have been legally married there. \n \n \nIn re Mortenson's Estate, marriage of first cousins held invalid in Arizona, though lawfully performed in New Mexico, given Arizona policy reflected in statute declaring such marriages \"prohibited and void\".\n\n \n Closer, but not quite. The court found that the marriage was void unless it was \"recognized in the place where solemnized\". Still not really the same (though the court was pretty much just fudging here). \n \n \nfaith and credit clause. However, this is a pretty exotic interpretation of Congress' authority under that clause. Congress, in it's 200-year history has never once used the full faith and credit clause to nullify rather than implement the effect of a public act or judgment by a State[/i]\n and\n \n According to conflict-of-laws doctrine, States may already refuse to recognize out-of-State marriages when the marriage violates that State's public policy. For example, expressions of public policy may be found in State statutes, State case law, or pronouncements by State attorneys general.\n \n Given the strong language that SCOTUS uses to describe marriage as a local matter I think it is far from ludicrous to presume it will continue to be so.Even Senator Dianne Feinstein says, speaking about homosexual marriage specifically: [i]Proponents argue that Congress' authority to legislate in this area comes from the Constitution's full Combine this with the dismissal of cases such as Baker v Nelson, which challenged the constitutionality of restrictions on homosexual marriage on equal protection grounds, \"for want of a substantial Federal question\" and the situation seems clear. Silly or not, this isn't exactly \"my take\" on the matter, but instead seems to be how it works.\n\n \n I certainly agree that congress should not be dabbling in gay marriage. It is far outside their jurisdiction. HOWEVER, it is impossible to read the full fiath and credit clause and come to the conclusion that a gay marriage in Hawaii would not be required to be recognized in any of the other 50 states.\n \n Frankly Feinstein is an idiot or she would realize the the faith and credit clause is not something congress CAN \"use\". \n \n Baker Vs Nelson has nothing at all to do with the issue of whether the faith and credit clause would require one state to recognize a marriage performed in another. \n \n There is absolutely no possibility that it does not. Otherwise to be legally married in all 50 states you would have to visit each one and get married there. That would be silly...which is why we have the full faith and credit article in the constitution. Otherwise you would not be married to your wife when you left the state that you were originally married in. Child custody would be impossible across state lines. \n \n The only reason they passed the DOMA was that Hawaii was allowing gay marriages and nobody could come up with a legal argument for why other states did not have to recognize those marriages. It was essentially a stopgap measure because there is no possible way that you can actually come up with a legal argument for the DOMA being constitutional. It simply is not. BUT, it gave states time to take their own steps. Currently roughly half the states have their own DOMA versions that proactively ban gay marriage. This actually gives them a defensible position because a public policy exception has always been recognized to the full faith and credit clause...a state that proactively bans something is not bound by the laws in a state where it is legal (unless it is actually a judgment by a court). \n \n Things get tricky when you start trying to explain away rights in the constitution because you dont like how they are exercises, dont they?\n \n Here is any idea.....since it takes an incredible amount of imagination, and an even more incredible amount of BS, to come to the conclusion that bans on gay marriage do not violate both the due process and equal protection, lets stop trying to explain away somebodies rights and just let them exercise them. I will admit...I am a little creeped out at the idea of a couple of gay men getting married, too. I am far beyond creeped out at the idea that we should come up with elaborate, BS, nonsensical arguments and use them to strip others of their rights.", 
   {
    "unicode_changes_made": true
   }, 
   425817, 
   null, 
   1300155240.0
  ], 
  [
   425865, 
   null, 
   "Sigma", 
   "A marriage license is an administrative form that is processed by the local court. That has nothing at all to do with this.\n\n \n And marriage is a contract between a couple and the State. If the State refuses to honor the administrative form attesting to your status then that seems important.\n \n \nNo, it was not held invalid. She was allowed to have it annulled\n \n They found that she could get an annulment under new jersey law even though she was married in Indiana.\n\n \n Come on, look at the reasoning. It was clearly a decision on the applicability of out-of-State laws in regards to marriage. The \"Chancery Division\": declined to grant the relief sought by the plaintiff on the ground that the marriage was valid in Indiana and should therefore, under principles of the conflict of laws, not be nullified by a New Jersey court because of the plaintiff's nonage.\n \n Wilkins reversed this, saying: It is undisputed that if the marriage between the plaintiff and the defendant had taken place here, the public policy of New Jersey would be applicable and the plaintiff would be entitled to the annulment; and it seems clear to us that if New Jersey's public policy is to remain at all meaningful it must be considered equally applicable though their marriage took place in Indiana. While that State was interested in the formal ceremonial requirements of the marriage it had no interest whatever in the marital status of the parties. Indeed, New Jersey was the only State having any interest in that status, for both parties were domiciled in New Jersey before and after the marriage and their matrimonial domicile was established here. The purpose in having the ceremony take place in Indiana was to evade New Jersey's marriage policy and we see no just or compelling reason for permitting it to succeed.\n \n The annulment was granted because Indiana's laws did not obtain in regards to the validity of their marriage where it conflicted with New Jersey's own public policy. If Indiana's laws regarding the validity of the marriage were in effect the annulment wouldn't be granted. This is directly applicable to what we're talking about.\n \n \nCloser, but not quite. The court found that the marriage was void unless it was \"recognized in the place where solemnized\". Still not really the same (though the court was pretty much just fudging here).\n\n \n The statute was interpreted to mean all marriage laws and not just those related to solemnization in Medlin v Medlin and declares that they must look at Arizona law to determine the validy of the marriage instead of the State in which the marriage took place.\n \n \nI certainly agree that congress should not be dabbling in gay marriage. It is far outside their jurisdiction. HOWEVER, it is impossible to read the full fiath and credit clause and come to the conclusion that a gay marriage in Hawaii would not be required to be recognized in any of the other 50 states.\n\n \n As you yourself have stated, out-of-State statutes or acts that are contrary to the forum State's policy need not be followed under Full Faith and Credit. To do otherwise, as stated in Alaska Packers XXX'n v Industrial Accident Comm'n: \"would lead to the absurd result that, wherever the conflict arises, the statute of each State must be enforced in the courts of the other, but cannot be in its own\"\n \n So it is perfectly reasonable to read that Clause and continue to conclude it does not require every State to recognize marriages from out-of-State. It never has meant that as far as I can find anywhere, so why would it suddenly require it?\n \n \nThings get tricky when you start trying to explain away rights in the constitution because you dont like how they are exercises, dont they?\n\n \n What rights are we talking about? State's rights?\n \n \nBaker Vs Nelson has nothing at all to do with the issue of whether the faith and credit clause would require one state to recognize a marriage performed in another. \n [...]\n Here is any idea.....since it takes an incredible amount of imagination, and an even more incredible amount of BS, to come to the conclusion that bans on gay marriage do not violate both the due process and equal protection, lets stop trying to explain away somebodies rights and just let them exercise them. I will admit...I am a little creeped out at the idea of a couple of gay men getting married, too. I am far beyond creeped out at the idea that we should come up with elaborate, BS, nonsensical arguments and use them to strip others of their rights.\n\n \n That's why I brought up Baker v Nelson. It was argued on those grounds that restrictions on homosexual marriage were unconstitutional and the case was dismissed \"for want of a substantial Federal question\". What that seems to mean is that the issue is meant to be decided on the State level.", 
   {}, 
   425856, 
   null, 
   1300160700.0
  ], 
  [
   425869, 
   null, 
   "daewoo", 
   "And marriage is a contract between a couple and the State. If the State refuses to honor the administrative form attesting to your status then that seems important.\n\n \n No, it is not. It is a contract between 2 people that the state recognizes. \n \n This was not even that. A marriage license is a permit to get married, it conveys no status whatsoever. In this case it was found that a marriage licenses issued in another state only gave you the right to have a marriage carried out in that state, much like purchasing a hunting license in Alaska does not give you the right to hunt in Deleware. \n \n \n\n \n Come on, look at the reasoning. It was clearly a decision on the applicability of out-of-State laws in regards to marriage. The \"Chancery Division\": declined to grant the relief sought by the plaintiff on the ground that the marriage was valid in Indiana and should therefore, under principles of the conflict of laws, not be nullified by a New Jersey court because of the plaintiff's nonage.\n \n The annulment was granted because Indiana's laws did not obtain in regards to the validity of their marriage where it conflicted with New Jersey's own public policy. If Indiana's laws regarding the validity of the marriage were in effect the annulment wouldn't be granted. This is directly applicable to what we're talking about.\n\n \n WRONG. The marriage was annulled because in new jersey a woman who is married before the age of 18 can get an annulment if she has not \"confirmed\" the marriage after turning 18. From your link:\n \n \nOn January 4, 1956 the plaintiff filed her annulment complaint under N.J.S. 2 A:34-1(w)hich provides that a judgment of nullity may be rendered on the wife's application upon a showing that she was under the age of 18 years at the time of her marriage and that the marriage has not been \"confirmed by her after arriving at such age\"; the statute also provides that where a child has been born there shall be no judgment of nullity unless the court is of the opinion that the judgment \"will not be against the best interests of the child.\" Although the defendant was duly served he did not file any answer and he chose not to contest the plaintiff's proceeding. \n\n \n There was never any question raised about whether or not the marriage was valid, or whether or not the state of New Jersey recognized the marriage. If either of those 2 things had been true, there would be no need for an annulment since you cannot have an annulment unless you have a valid marriage to begin with. The ONLY question was whether or not New Jerseys law allowing an individual who was married before they were 18 to get an annulment applied to a marriage in another state.\n \n It has absolutely nothing at all to do with this thread. \n \n \n\n The statute was interpreted to mean all marriage laws and not just those related to solemnization in Medlin v Medlin and declares that they must look at Arizona law to determine the validy of the marriage instead of the State in which the marriage took place.\n\n \n Close, but not exactly. Mr Medlin argued that he was not actually married because his stepfather, not his custodial guardian, gave him permission for the marriage. \n \n MARICOPA COUNTY SUPERIOR COURT\n \n \n 4. Medlin v. Medlin, 194 Ariz. 306, 981 P.2d 1087 (CA 1, 6/17/1999) - Husband acting pro se filed for divorce. After trial, Wife was awarded spousal maintenance and attorney's fees. Husband then retained counsel and filed a motion to amend the petition to request annulment on the ground that the marriage was void since Husband married at age 16 with the consent of his stepfather only, contrary to A.R.S. §§ 25-102 and 122, which required parental consent. Wife countered that the parties were married in Nevada where stepparent consent was sufficient, and that A.R.S. § 25-112(B) provides that marriages valid in the state where they occur will be recognized as valid in Arizona unless void under A.R.S. § 25-101. The trial court agreed with Wife. The Court of Appeals affirmed on other grounds, finding that the marriage was not valid under A.R.S. § 25-112(B) since the parties had married in Nevada to evade the laws of Arizona, relying on A.R.S. § 25-112(C). Instead, the Court of Appeals decided that the marriage was merely voidable, not void under A.R.S. § 25-101, and that Husband had ratified the marriage by remaining with Wife for about seven years after he turned 18.\n \n\n \n \n \n \nAs you yourself have stated, out-of-State statutes or acts that are contrary to the forum State's policy need not be followed under Full Faith and Credit. To do otherwise, as stated in Alaska Packers XXX'n v Industrial Accident Comm'n: \"would lead to the absurd result that, wherever the conflict arises, the statute of each State must be enforced in the courts of the other, but cannot be in its own\"\n \n So it is perfectly reasonable to read that Clause and continue to conclude it does not require every State to recognize marriages from out-of-State. It never has meant that as far as I can find anywhere, so why would it suddenly require it?\n\n \n You are misrepresenting my position here. As I said in my last post, I stated that the public policy exception would allow a state to fail to recognize a marriage if there is an affirmative prohibition in place. \n \n \n \nThat's why I brought up Baker v Nelson. It was argued on those grounds that restrictions on homosexual marriage were unconstitutional and the case was dismissed \"for want of a substantial Federal question\". What that seems to mean is that the issue is meant to be decided on the State level.\n\n \n We are not talking about homosexual marriage as a whole here....we are talking about the DOMA, which related only to the full faith and credit clause, which is a constitutional matter so a federal matter. \n \n As far as Baker V Nelson goes, pin your hopes on one line opinions at your own peril. 2 federal courts have already found ways around it, apparently without putting forth much effort. Frankly re Kandu, U.S. Bankruptcy Court shows how laughably pathetic the courts \"position\" was in Baker. Even if you discount the idea that Lawrence v. Texas marks a shift in how the court views same sex conduct, the fact that the question of the validity of Kandus marriage had to be resolved in order to proceed with their federal bankruptcy makes whoever on the supreme court issued the baker refusal look like a complete and utter jackass. \n \n There is a solution to that, of course, which would be to get the federal government completely and totally out of the marriage game but as long as federal bankruptcy and tax laws include provisions related to marriage the idea that the definition of that institution holds no substantial federal question is absolutely ludicrous.", 
   {
    "unicode_changes_made": true
   }, 
   425865, 
   null, 
   1300166640.0
  ], 
  [
   425870, 
   null, 
   "Matthew S", 
   "If the Federal gov't takes it's cue from the State, then you'd have to have a valid marriage in the State you live in to be recognized by the Federal gov't.\n \n But even if what you said was true, how have you benefited? The Federal gov't recognizes your marriage, but the State you live in does not. This helps you how?\n\n \n 1138 federal benefits, rights and responsibilities.", 
   {}, 
   425853, 
   null, 
   1300168260.0
  ], 
  [
   425899, 
   null, 
   "Sigma", 
   "This was not even that. A marriage license is a permit to get married, it conveys no status whatsoever. In this case it was found that a marriage licenses issued in another state only gave you the right to have a marriage carried out in that state, much like purchasing a hunting license in Alaska does not give you the right to hunt in Deleware.\n\n \n Ah, I see where I misunderstood it.\n \n \nWRONG. The marriage was annulled because in new jersey a woman who is married before the age of 18 can get an annulment if she has not \"confirmed\" the marriage after turning 18.\n\n \n And that request for annulment was denied because: the marriage was valid in Indiana and should therefore, under principles of the conflict of laws, not be nullified by a New Jersey court because of the plaintiff's nonage.\n \n That is exactly the reasoning given, so of course the validity of the marriage was part of the question. This isn't some crazy interpretation of mine, the case as much as says that if full faith and credit is given to the Indiana laws then the marriage won't be annulled. Wilkins, overturning this, specifically says that the couple would be circumventing the laws of New Jersey if the marriage isn't annulled (that is, if the marriage was considered valid as it is in Indiana).\n \n \nIf either of those 2 things had been true, there would be no need for an annulment since you cannot have an annulment unless you have a valid marriage to begin with. The ONLY question was whether or not New Jerseys law allowing an individual who was married before they were 18 to get an annulment applied to a marriage in another state.\n\n \n Hm. From here:\n \n A marriage annulment is a legal procedure that dissolves a couple's marital status by establishing that a valid marriage never existed.\n \n From here\n \n Unlike divorce, it is usually retroactive, meaning that an annulled marriage is considered to be invalid from the beginning almost as if it had never taken place\n \n From here\n \n Annulment is the process by which a Court states that a marriage never legally existed.\n \n Annulment seems required even in cases where you were forced under threat to get married, which would obviously render the marriage invalid from the beginning. Unless they're using the word in an unfamiliar way, you can only get an annulment if your marriage is not a valid marriage. If this is true, then the question is whether the laws of a State in which a marriage took place have applicability in a State where the same marriage is not valid.\n \n \nClose, but not exactly. Mr Medlin argued that he was not actually married because his stepfather, not his custodial guardian, gave him permission for the marriage.\n\n \n And the request for annulment was denied, yes. The gist of the case itself isn't directly applicable, but the clarification to In re Mortenson&#8217;s Estate is.\n \n From Medlin v Medlin:\n \n The statute specifically states that the parties cannot evade the laws of the state relating to marriage. We interpet that to mean all marriage laws and not just those relating to the act of solemnization. See In re Mortenson's Estate, (first cousins could not evade the laws of Arizona by marrying in another state). By marrying in Nevada without proper consent, the parties evaded the laws of Arizona. Therefore, we must look to the law of Arizona to determine the validity of the marriage.\n \n The laws relating to minors doesn't declare the marriage nullified, but the laws relating to relatives does. The marriage to the first cousins was thus invalid in In re Mortenson's Estate.\n \n \nYou are misrepresenting my position here. As I said in my last post, I stated that the public policy exception would allow a state to fail to recognize a marriage if there is an affirmative prohibition in place.\n\n \n It is not my intention to misrepresent your position. However, a literal interpretation of the Full Faith and Credit clause allows no exception, and would lead to an absurd result. My entire point has been that States do not need to recognize marriages that violate their own public policy. The argument I've seen is that the Full Faith and Credit clause requires all States to recognize marriages from out-of-State, period, and that is obviously incorrect (since there is the public policy exception), even if that Clause is the controlling feature in out-of-State marriage. \n \n \nAs far as Baker V Nelson goes, pin your hopes on one line opinions at your own peril. 2 federal courts have already found ways around it, apparently without putting forth much effort. Frankly re Kandu, U.S. Bankruptcy Court shows how laughably pathetic the courts \"position\" was in Baker. Even if you discount the idea that Lawrence v. Texas marks a shift in how the court views same sex conduct, the fact that the question of the validity of Kandus marriage had to be resolved in order to proceed with their federal bankruptcy makes whoever on the supreme court issued the baker refusal look like a complete and utter jackass.\n \n There is a solution to that, of course, which would be to get the federal government completely and totally out of the marriage game but as long as federal bankruptcy and tax laws include provisions related to marriage the idea that the definition of that institution holds no substantial federal question is absolutely ludicrous.\n\n \n What hopes do you think I have? Baker exists and has an effect. Talking about those effects doesn't represent any hope on my part, besides the hope that States retain some power in this. I don't see what is ludicrous, since the Federal gov't can have provisions relating to marriage without defining marriage. DOMA shouldn't be treading in an area that is the province of the States. Getting government out of marriage entirely isn't a solution since it seems people like and support recognition of the cultural custom of marriage.", 
   {}, 
   425869, 
   null, 
   1300206180.0
  ], 
  [
   425900, 
   null, 
   "Sigma", 
   "1138 federal benefits, rights and responsibilities.\n\n \n Ah you just want the benefits. Then it doesn't matter what it's called?", 
   {}, 
   425870, 
   null, 
   1300206240.0
  ], 
  [
   425903, 
   null, 
   "Accipiter", 
   "DOMA isn't unconstitutional. SCOTUS has not ruled on it.\n \n I think that little cretin Obama or even Holder should be impeached for making up their own laws and ignoring what has already been passed by a wide majority.\n \n And the pro-gay-sex heathens ought to be educated or deported.\n\n This is sofa king dumb it's unbelievable.", 
   {}, 
   425241, 
   null, 
   1300209300.0
  ], 
  [
   425971, 
   null, 
   "jitobear", 
   "This is sofa king dumb it's unbelievable.\n\n \n Oh come on. We are talking about Easy here. Its TOTALLY believable. \n Plus its no secret that his definition of freedom is allowing folks the freedom to live the way he wants them to.", 
   {}, 
   425903, 
   null, 
   1300299540.0
  ], 
  [
   426265, 
   null, 
   "Easyrider", 
   "Oh come on. We are talking about Easy here. Its TOTALLY believable. \n Plus its no secret that his definition of freedom is allowing folks the freedom to live the way he wants them to.\n\n \n Not me, snicklefritz - the way God wants people to live. Or did you and the bird man forget what happened to Sodom and Gomorrah?? Don't be dumb and egg it on again.", 
   {}, 
   425971, 
   null, 
   1300752120.0
  ], 
  [
   426269, 
   null, 
   "Matthew S", 
   "Not me, snicklefritz - the way God wants people to live. Or did you and the bird man forget what happened to Sodom and Gomorrah?? Don't be dumb and egg it on again.\n\n \n Once again BRING IT ON ", 
   {}, 
   426265, 
   null, 
   1300765200.0
  ], 
  [
   426332, 
   null, 
   "jazyjason", 
   "Not me, snicklefritz - the way God wants people to live. \n\n \n WRONG. The way men of that time period who wrote the texts wanted people to live. NOT an omnipotent being. And don't even start on that divine inspiration XXXX. It's a load of bull and a very lame excuse.\n \n \n Or did you and the bird man forget what happened to Sodom and Gomorrah?? \n\n \n Another mythical ancient text that once again is misinterpreted and twisted to fit the mold of someones prejudiced views. Care to try another parlor trick or are you fresh out?\n \n \n Don't be dumb and egg it on again.\n\n \n Please... Your clearly the one here who is ignorant and devoid of anything logical and cognitive to even \"basic\" human comprehension.", 
   {}, 
   426265, 
   null, 
   1300865340.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama orders Justice Dept. to Stop Defending DOMA, Says It's Unconstitutional", 
  "url": "http://www.4forums.com/political/gay-rights-debates/15083-obama-orders-justice-dept-stop-defending-doma-says-its-unconstitutional.html", 
  "breadcrumbs": [
   "Gay Rights"
  ], 
  "id_number": 15083, 
  "discussion_files": [
   [
    "22524.html", 
    "http://www.4forums.com/political/gay-rights-debates/15083-obama-orders-justice-dept-stop-defending-doma-says-its-unconstitutional-print.html"
   ], 
   [
    "22525.html", 
    "http://www.4forums.com/political/gay-rights-debates/15083-obama-orders-justice-dept-stop-defending-doma-says-its-unconstitutional-3-print.html"
   ], 
   [
    "22526.html", 
    "http://www.4forums.com/political/gay-rights-debates/15083-obama-orders-justice-dept-stop-defending-doma-says-its-unconstitutional-2-print.html"
   ]
  ], 
  "identifier": 15083
 }
]