[
 [
  [
   425167, 
   null, 
   "daewoo", 
   "Bernanke&#8217;s QE3 Question - Steve Schaefer - Exile On Wall Street - Forbes\n \n \nThe Federal Reserve is set to cease its buying of U.S. Treasury bonds June 30, but even with more than three months of QE2 remaining many market watchers are turning their focus to what comes next. And if another round of stimulus isn't on the way, it could mean the lights will dim on the party for U.S. stocks.\n\n \n \n As a counter, one would argue (and I would partially agree) that the U.S. and indeed developed global economies must keep yields artificially low for some time if post Lehman healing is to take place. But that of course is the point. By eliminating QE II, the Fed would be ripping a Band-Aid off a partially healed scab. Ouch! 25 basis point policy rates for an \"extended period of time\" may not be enough to entice arbitrage Treasury buyers, nor bond fund asset allocators to reenter a Treasury market at today's artificially low yields. Yields may have to go higher, maybe even much higher to attract buying interest.\n \n Both Gross and Rosenberg indicate that the end of QE2, without QE3 following in its wake, will be a rocky time for investors. Gross goes so far as to compare it to D-Day, \"fraught with hope for victory, but fueled with immediate uncertainty and fear.\"\n\n \n PIMCO&#039;s Bill Gross Says to Sell U.S. Treasuries Now\n \n \nPIMCO's Bill Gross Says to Sell U.S. Treasuries Now\n \n Second, he recently released his market commentary for March where he makes another market call that is probably also worth following. To wit, he predicts that when the Fed's QE2 bond-buying binge ends at the end of June, there will be nobody to take the Fed's place as last-resort buyer of U.S. Treasuries at artificially low rates. Treasury yields will need to ramp up sharply by 1.5 percentage points to attract private buyers. Given that the ten-year U.S. Treasury is currently yielding only 3.5%, a 1.5 percentage point jump would equal a 43% increase in interest rates (1.5/3.5). That's a big move in interest-rate land and would have a significantly negative effect on bond prices.\n \n Stock investors, take note: your holdings would also be affected. Remember that stocks are valued based on discounted future cash flow. The interest rate used is typically the ten-year U.S. treasury plus a business risk premium. A higher ten-year U.S. Treasury would cause a company's future cash flows to be discounted more heavily, resulting in a lower stock valuation. So, higher interest rates would be a negative for all forms of financial assets, not just bonds.\n\n \n First, a disclaimer. I dont like Gross. The man is a jacka$$. \n \n He is right, though, and frankly I think that is what has Bernanke scared to death. There are people running around out there saying \"Bernankes plan worked\" when the truth of the matter is that we will not know if it worked or not until they withdraw. In the last year the fed has bought 70% of bonds sold. If, when they stop, the economy continues to grow, inflation remains contained, and interest rates remain low, it will be a success. \n \n WHO ARE WE KIDDING!?!?!? \n \n If/when the fed stops buying, bond yields are going to increase dramatically, prices are going to drop. Mortgages, most of which are indexed to bond prices, are going to get REALLY expensive, setting off another round of defaults. \n \n To put the impact of the feds money printing into perspective, the US economy would have to have grown at a rate of 34% last year to justify the monetary creation we saw. \n \n Granted there is still one revision left for last years GDP numbers, but I doubt we are going to see the treasury dept come out and revise last years GDP growth to 34%.", 
   {
    "post_info": {
     "post_title": "QE3 already in the pipeline?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1299210600.0
  ], 
  [
   425321, 
   null, 
   "Steeeeve", 
   "I've been too sick to respond to this (and still am). Honestly, who cares? We knew this day would come. Seems everyone is just delaying in hopes that a miracle will happen. I suppose anything is possible.\n \n I'm a fan of running numbers and honestly, I don't think it would be too bad if we cleaned house right now. Yeah, we run the risk of another depression and likely war but our country has been surprisingly resistant to total failure. Anyway, we could fix our federal debt problems in 5 years, invest in infrastructure and research that benefits us (aka, alternative fuels or things of that nature that our COUNTRY actually needs) over the next decade, and we could quickly turn things around. Yeah, you initially take a cost of living hit, high unemployment, blah blah blah, but having our country be productive again is not as hard as it seems. Hell, it took LESS THAN a decade to turn things around in the US. WWII ended as we were hopping within 5 years (but you have to add in the 4 years before that of ramping things up).", 
   {}, 
   425167, 
   null, 
   1299340500.0
  ], 
  [
   425355, 
   null, 
   "daewoo", 
   "I've been too sick to respond to this (and still am). Honestly, who cares? We knew this day would come. Seems everyone is just delaying in hopes that a miracle will happen. I suppose anything is possible.\n \n I'm a fan of running numbers and honestly, I don't think it would be too bad if we cleaned house right now. Yeah, we run the risk of another depression and likely war but our country has been surprisingly resistant to total failure. Anyway, we could fix our federal debt problems in 5 years, invest in infrastructure and research that benefits us (aka, alternative fuels or things of that nature that our COUNTRY actually needs) over the next decade, and we could quickly turn things around. Yeah, you initially take a cost of living hit, high unemployment, blah blah blah, but having our country be productive again is not as hard as it seems. Hell, it took LESS THAN a decade to turn things around in the US. WWII ended as we were hopping within 5 years (but you have to add in the 4 years before that of ramping things up).\n\n \n All BS aside, the impact of the government cuts will be roughly the same as it would have been if we had not bailed out the financial system in terms of actual job losses and even sectors where the jobs are lost.\n \n If you look at economic collapses in other countries, production workers and factory administrators usually do better than you might think. Their currency becomes cheap enough that they are a lot more competitive in world markets. It is typically the non productive workers that take it the hardest. \n \n We are talking about choosing to create a situation worse than the depression...far worse. \n \n I am all for it because the consequences of NOT doing it are even worse than the consequences of doing it. \n \n The dollar has fallen 15% in the last 9 months. While an interest rate increase for the ECB is pretty much a foregone conclusion, the federal reserve is trying to figure out a way to pump another trillion dollars into the economy without looking like he is printing another trillion dollars. \n \n We are screwed. Completely and totally. The only real hope we have is to tell the fed to shut down the presses, cut our government spending down to reasonable levels, and take our medicine like a man. If we do it voluntarily we have some degree of control. Fail to take the steps on our own and we lose even that. The first rule of business is that it is always better to be proactive than reactive.", 
   {}, 
   425321, 
   null, 
   1299401700.0
  ], 
  [
   425419, 
   null, 
   "daewoo", 
   "Now Lockhart, who is a voting member of the fed, is saying that they may have to do QE3 because of high oil prices.\n \n Remember a while back when we were talking about how the feds QE policies would lead to dollar devaluation and thus higher oil prices?\n \n Granted there is certainly upward pressure caused by concerns about supply shortages, but there is absolutely no possibility that further weakening the dollar will help with that.", 
   {
    "post_info": {
     "post_title": "holy mother of god"
    }
   }, 
   425355, 
   null, 
   1299554460.0
  ], 
  [
   425862, 
   null, 
   "elbatrop", 
   "how can the FED not do QE ad infinity at this point, it is trapped now with no escape\n \n the govt can't afford failed auctions\n \n the FED can't unwind what is on its balance sheet already especially if rates went up even a mere 2% and even housing falling back to \"normal range\" makes its toxic waste it is hiding basically worthless\n \n the govt can't afford interest rates reflecting what should be going on either\n \n Gross and PIMPCO have been front running the FED for more than a year, this tells me something nasty is coming.\n \n lending volume is in the toilet cept for student loans, the banks have no desire nor any reason to loan anybody anything and the bond flipping scheme has been increasingly shortened the holding time and the entire bond market is all crammed into the short end\n \n this will not end well, at best they do a tightrope walk and hope a black swan doesn't XXXX on the whole game", 
   {}, 
   425419, 
   null, 
   1300159320.0
  ], 
  [
   425868, 
   null, 
   "daewoo", 
   "how can the FED not do QE ad infinity at this point, it is trapped now with no escape\n \n the govt can't afford failed auctions\n \n the FED can't unwind what is on its balance sheet already especially if rates went up even a mere 2% and even housing falling back to \"normal range\" makes its toxic waste it is hiding basically worthless\n \n the govt can't afford interest rates reflecting what should be going on either\n \n Gross and PIMPCO have been front running the FED for more than a year, this tells me something nasty is coming.\n \n lending volume is in the toilet cept for student loans, the banks have no desire nor any reason to loan anybody anything and the bond flipping scheme has been increasingly shortened the holding time and the entire bond market is all crammed into the short end\n \n this will not end well, at best they do a tightrope walk and hope a black swan doesn't XXXX on the whole game\n\n \n It seems like we are rapidly approaching the point where the fed will have to continue QE forever....or at least until the wheels come off, which is a much, much shorter time frame. The idea that there is an exit strategy from this that does not lead to economic Armageddon is laughable.\n \n Looking at the last week we have seen continued volatility in the middle east, with Saudi Arabia sending troops across the border into Bahrain to put down uprisings there. Then there was the quake in Japan that caused massive amounts of damage. We should be seeing intense safe haben demand right now, which should bode well for the dollar. Instead of the big swell in value that was expected, the dollar index didn't manage to break 76.5. We saw drops in other currencies consistent with safe haven movements, investors just did not choose the US dollar as their safe haven.", 
   {}, 
   425862, 
   null, 
   1300163040.0
  ], 
  [
   426064, 
   null, 
   "Brutus", 
   "Daewoo: To put the impact of the feds money printing into perspective, the US economy would have to have grown at a rate of 34% last year to justify the monetary creation we saw. \n \n Brutus: actually Bernanke's money growth is best understood as related to the velocity of money, not the quanity printed.", 
   {}, 
   425167, 
   null, 
   1300411620.0
  ], 
  [
   426069, 
   null, 
   "daewoo", 
   "\n Brutus: actually Bernanke's money growth is best understood as related to the velocity of money, not the quanity printed.\n\n \n Which is what moves it from \"bad\" to \"terrible\". With the huge amount of money they have printed and our terrible GDP growth, the velocity of that money is effectively zero. \n \n It is the perfect Samuelson conundrum. Samuelson said that you can force money into the system, but you cannot make it circulate against new goods and new jobs. Thus you have printed up a massive amount of money without the economic growth to justify it. This has always, in every singe case in history, ended in hyperinflation. That money does not remain on the sidelines for ever, and as soon as it starts to move, your central bank loses control. Every time.", 
   {}, 
   426064, 
   null, 
   1300421340.0
  ], 
  [
   426112, 
   null, 
   "Steeeeve", 
   "Which is what moves it from \"bad\" to \"terrible\". With the huge amount of money they have printed and our terrible GDP growth, the velocity of that money is effectively zero. \n \n It is the perfect Samuelson conundrum. Samuelson said that you can force money into the system, but you cannot make it circulate against new goods and new jobs. Thus you have printed up a massive amount of money without the economic growth to justify it. This has always, in every singe case in history, ended in hyperinflation. That money does not remain on the sidelines for ever, and as soon as it starts to move, your central bank loses control. Every time.\n\n \n Well, right now it's on the sidelines.", 
   {}, 
   426069, 
   null, 
   1300509060.0
  ], 
  [
   426220, 
   null, 
   "daewoo", 
   "Well, right now it's on the sidelines.\n\n \n I would argue that it is just starting to move. If that money is not circulating against new goods and new jobs, it has to be somewhere. Nobody can afford to sit on that much cash without a return. \n \n Part of it is obviously being put back into treasuries and while increased government debt is not something we need, at least that parks that cash.\n \n Part of it has ended up in the stock market, which is part of the reason for its completely unfounded rise. \n \n Another part of it, likely the larger part of it, is ending up in commodities. That is what is going to really hurt your average joe.", 
   {}, 
   426112, 
   null, 
   1300680000.0
  ], 
  [
   426792, 
   null, 
   "Steeeeve", 
   "A little update from PIMCO\n \n Why Pimco dumped bonds - Mar. 31, 2011\n \n \nIn just two months time, Pimco cut its exposure to U.S. government debt to zero. \"When we looked at what was available, there were Treasury-like instruments that had better value,\" said El-Erian.\n \n Another reason behind Pimco's decision to remain on the sidelines of the U.S. Treasury market is the uncertainty about where prices will head once the Federal Reserve winds down QE2 in June. \n\n \n Doesn't PIMCO invest heavy in mortgages? And they dropped the treasury notes because THOSE were too risky?..oh, sorry, \"over priced\"?", 
   {}, 
   426220, 
   null, 
   1301766240.0
  ], 
  [
   426818, 
   null, 
   "daewoo", 
   "A little update from PIMCO\n \n Why Pimco dumped bonds - Mar. 31, 2011\n \n \n \n Doesn't PIMCO invest heavy in mortgages? And they dropped the treasury notes because THOSE were too risky?..oh, sorry, \"over priced\"?\n\n \n PIMCO deals in pretty much everything. \n \n Gross has expanded on why they dumped treasuries:\n \n Bill Gross: The US will default - Professional Adviser HK\n \n \nBill Gross has said the US will default on its bonds because it is the only way the country can cope with its massive debt pile.\n \n The PIMCO chief investment officer says the US has a total debt burden of $75 trillion if entitlements such as those for medical care and social security are included. In his latest Investment Outlook, Gross writes that unless large cuts are made to entitlements, the only way the government can afford this amount of debt is to default.\n \n \"The only way out of the dilemma... is to default in one (or a combination) of four ways: 1) outright via contractual abrogation - surely unthinkable, 2) surreptitiously via accelerating and unexpectedly higher inflation - likely but not significant in its impact, 3) deceptively via a declining dollar - currently taking place right in front of our noses, and 4) stealthily via policy rates and Treasury yields far below historical levels - paying savers less on their money and hoping they won't complain,\" he said.\n\n \n He is right....at this point I dont think it is a question of IF it will happen, but rather HOW it will happen.", 
   {}, 
   426792, 
   null, 
   1301818860.0
  ], 
  [
   426830, 
   null, 
   "Steeeeve", 
   "PIMCO deals in pretty much everything. \n \n Gross has expanded on why they dumped treasuries:\n \n Bill Gross: The US will default - Professional Adviser HK\n \n \n \n He is right....at this point I dont think it is a question of IF it will happen, but rather HOW it will happen.\n\n \n I'm pretty sure that if we can just get the democrats to agree to cut funding to NPR we'd solve this thing! emoticon_xclown", 
   {}, 
   426818, 
   null, 
   1301841960.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  QE3 already in the pipeline?", 
  "url": "http://www.4forums.com/political/economics-debates/15084-qe3-already-pipeline.html", 
  "breadcrumbs": [
   "Economics"
  ], 
  "id_number": 15084, 
  "discussion_files": [
   [
    "32043.html", 
    "http://www.4forums.com/political/economics-debates/15084-qe3-already-pipeline-print.html"
   ]
  ], 
  "identifier": 15084
 }
]