[
 [
  [
   425287, 
   null, 
   "daewoo", 
   "Saudi Arabia drafts in up to 10,000 troops ahead of protests - Telegraph\n \n \nSaudi Arabia drafts in up to 10,000 troops ahead of protests\n \n Saudi Arabia is drafting in up to 10,000 security forces to the north eastern Muslim Shia provinces ahead of mass protests planned next week.\n \n Desperate to avoid mass uprisings against the House of Saud, security forces have deployed in huge numbers across the region.\n \n King Abdullah is also reported to have told neighbouring Bahrain that if they do not put down their own ongoing Shia revolt, his own forces will.\n \n In response to the massive mobilisation, protesters are planning to place women on the front ranks to discourage Saudi forces from firing on them. \n\n \n Saudis mobilise thousands of troops to quell growing revolt - Middle East, World - The Independent\n \n \nSaudi Arabia was yesterday drafting up to 10,000 security personnel into its north-eastern Shia Muslim provinces, clogging the highways into Dammam and other cities with busloads of troops in fear of next week's \"day of rage\" by what is now called the \"Hunayn Revolution\".\n \n Saudi Arabia's worst nightmare - the arrival of the new Arab awakening of rebellion and insurrection in the kingdom - is now casting its long shadow over the House of Saud. Provoked by the Shia majority uprising in the neighbouring Sunni-dominated island of Bahrain, where protesters are calling for the overthrow of the ruling al-Khalifa family, King Abdullah of Saudi Arabia is widely reported to have told the Bahraini authorities that if they do not crush their Shia revolt, his own forces will.\n\n \n A couple things shoot to mind here. First, I am having trouble seeing this as a shia uprising. Looking around the web and following facebook and twitter posts from the region, this looks an awful lot like another youth revolt to me. Not exactly shocking since unemployment for ages 15-24 is running 39.5% and unemployment for the 25-31 age groups is at 30% in Saudi Arabia. Life expectancy in Saudi Arabia pretty much sucks, so 70% of the population is under 30, while the ruling class is all in their 70s and 80s.\n \n As late as Wednesday King Abdullah was saying that things are \"business as usual\" in saudi arabia and that there were no protests that he was aware of planned in his country. Less than 24 hours later he had to issue the order to draft troops to be ready to put down street protests. \n \n I think that washington and the house of saud have things dead wrong. Both have said that the Sauds dont really need to worry because they have hundreds of billions of dollars in reserves to buy civil peace. The king just announced a $35 billion cash giveaway to buy peace in the streets.\n \n A good friend of mine who is a Saudi summed it up for me pretty well in an Email. Now, this guy is not some liberal revolutionary fruitcake. He is a conservative, middle class guy in upper management at Saudi Aramco. He said \"They are trying to bribe us with our own money. There are 20 million people in this country, but only about 100,000 in the ruling family, and that 100,000 takes 3/4 of the money for the oil produced here and we are sick of it\"\n \n He makes a good point. The house of Saud is in power because of the British and the US...not because they actually have any real legitimate claim to power. As countries around them \"fall\" to democracy, I think it is going to be increasingly difficult for the Saudis to justify living under a monarchy...especially one as autocratic and brutal as the house of saud. \n \n That is the other thing that I think the house of Saud, and even the US government which has kept them in power has underestimated in their plan to buy peace. People are willing to pay a STEEP price for freedom. $35 billion does not even begin to cover it. For hundreds of years men have gladly sacrifices themselves and their sons on the altar of freedom. The idea that a little cash thrown around is going to make that go away is foolish. Maybe not this year, maybe not next, but I think the house of Saud had better do their best to live life to its fullest, because their days are numbered.", 
   {
    "post_info": {
     "post_title": "Is Saudi Arabia the next to fall?"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1299299760.0
  ], 
  [
   425304, 
   null, 
   "Steeeeve", 
   "Not only that but apparently Saudi Arabia has been lying about their oil reserves for some time now. Their largest field is tapping out and they can't ramp up protection like they say they can. \n \n Time to start the \"$200 oil\" thread\n \n http://www.4forums.com/political/economics-debates/7966-70-oil.html", 
   {}, 
   425287, 
   null, 
   1299304620.0
  ], 
  [
   425307, 
   null, 
   "daewoo", 
   "Not only that but apparently Saudi Arabia has been lying about their oil reserves for some time now. Their largest field is tapping out and they can't ramp up protection like they say they can. \n \n Time to start the \"$200 oil\" thread\n \n http://www.4forums.com/political/economics-debates/7966-70-oil.html\n\n \n Frankly that is why oil is over $100 right now. The market is concerned about the loss of production from Libya. 10 years ago Saudi arabia would have stepped up and said \"we will replace that output\" and the market would have settled right down.\n \n Now they say \"we will replace that output\" and nobody believes them. \n \n Demand based increases in oil prices scare the hell out of me. \n \n I think it has become increasingly clear that peak oil is either here or passed. That changes EVERYTHING. IF we have passed peak oil, the world as we know it is over. It is a whole new game from here on out, and the rules have not been established yet. \n \n I am also incredibly excited by the opportunities this presents. I have already made some investments that have worked out extremely well that are essentially based on lasting high oil prices. There will be many, many more opportunities that become apparent as we move forward.\n \n The problem is that if this is not handled well, there could also be a LOT of turmoil...the \"rifles in the street\" and \"I wish I had not sold the minigun\" turmoil. \n \n The last time we saw a bug runup in oil prices, it HURT people, and our leaders pretty much stood around like a herd of deer hypnotized by a set of headlights...headlights on a locomotive.\n \n With a demand based runup over $100, and likely to go higher, can you even imagine what kind of value move we are going to see as the dollar continues its fall? I dont think there is any question that the dollar will be falling like a rock over the next year. The federal reserve has indicated that they are basically looking at 0% interest rates for at LEAST the next year...maybe 2...and maybe another round of QE. In the mean time, most of the world has pretty much recovered from the economic crash. The ECB should have raised rates at the last meeting. They did not, but I dont think there is any question that they will at their next meeting...and likely several more times this year.\n \n At the same time, the dollars status as the safe haven currency is pretty much gone if the last couple months are any indicator. Events that typically would send investors moving to the liquidity that the dollar offers, and thus increasing its value, have instead seen the dollar fall and the yen and swiss franc have benefited instead.", 
   {}, 
   425304, 
   null, 
   1299307920.0
  ], 
  [
   426629, 
   null, 
   "signelect", 
   "All these problems are showing the fact that the U.S. might be in a huge trouble. Our economy is going down the drain and the government is not doing anything helpful to stop it.:xbanghead", 
   {}, 
   425307, 
   null, 
   1301425980.0
  ], 
  [
   427078, 
   null, 
   "bremmer", 
   "in order to help the US economy it's needed not to intervene in the home policy of other counries but to pay more attention our issues", 
   {}, 
   426629, 
   null, 
   1302261840.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Is Saudi Arabia the next to fall?", 
  "url": "http://www.4forums.com/political/current-events-debates/15094-saudi-arabia-next-fall.html", 
  "breadcrumbs": [
   "Current Events"
  ], 
  "id_number": 15094, 
  "discussion_files": [
   [
    "11198.html", 
    "http://www.4forums.com/political/current-events-debates/15094-saudi-arabia-next-fall-print.html"
   ]
  ], 
  "identifier": 15094
 }
]