[
 [
  [
   425812, 
   null, 
   "NATO 556", 
   "Amish hoping Ill. changes gun rule - Illinois | State & regional - bnd.com\n \n \nMATTOON, Ill. -- A collision over the religious beliefs of the Amish and their gun ownership rights is brewing over an apparent reversal of Illinois state policy on Firearm Owner's Identification (FOID) requirements.\n \n Illinois Amish have been allowed to forego placing their photographs on FOID cards and other mandatory IDs. On Feb. 14, Illinois State Police Director Jonathon Monken, now the head of the Illinois Emergency Management Agency, decided that policy should be changed, meaning Amish gun owners face photographic identification requirements like other FOID holders in the state.\n \n Last week, Amish residents of Central Illinois met with four state lawmakers and law enforcement officers in an effort to rescind the proposal that they believe infringes on their religious beliefs against intrusions on their privacy. This change in state policy could end their right to legally hunt in Illinois, they say.\n \n \"A lot of the Amish hunt and they usually use squirrel or rabbit rifles to bring some food back home. Their big concern is this means they won't be able to purchase guns or ammo. They have a religious edict against photographs,\" said Douglas County Sheriff Charlie McGrew, who attended last week's meeting with state Sens. Dale Righter, R-Mattoon, and Kyle McCarter, R-Decatur, and state Reps. Chapin Rose, R-Mahomet, and Adam Brown, R-Decatur, in an Arthur restaurant. Illinois State Police officials also attended to hear the concerns and consider possible solutions.\n \n Rose said he learned of this issue as he and other state lawmakers were immersed in the controversy over the potential release of FOID information through the Freedom of Information Act (FOIA). Last week, the Illinois Attorney General's office stated FOID data, except for phone numbers and addresses, is open to FOIA access despite long-standing opposition by state police, which administers firearm owner registration and criminal background checks before issuing FOID cards.\n \n ISP has asked for a judicial ruling on Attorney General Lisa Madigan's decision on an Associated Press FOIA request that was rejected last year by state police.\n \n \"These are two completely unrelated things that happened. But both issues deal with basic constitutional rights,\" Rose said. \"With one, you're telling gun owners to give up their right to privacy. And with the Amish this would tell them to violate their religious rights.\"\n \n McGrew, and many Illinois sheriffs, opposes the idea of releasing FOID holder information, but added that issue adds to the concerns for Amish gun owners in his county.\n \n \"The Amish have said they don't want the outside community involved in their personal business. With this they will be required have their photographs released, and that information could be released to the general public,\" McGrew said.\n \n Rose said the timing of Monken's decision was wrong because it came on his last day as ISP director. He resigned in February and has taken another state position.\n \n \"It was unfair for him to do this on the same day he was leaving,\" Rose said.\n \n A spokesman for ISP in Springfield could not be reached for comment Thursday. A copy of Monken's policy on the Amish and FOID rules was not available for review.\n \n All parties involved in last week's meeting agreed to share information for helping correct the issue of identification card standards for the Amish, Rose said.\n\n \n Quite interesting. And quite disturbing at the same time. Illinois seems to be going for the record of committing the most constitutional violations in one move as possible.", 
   {
    "post_info": {
     "post_title": "Illinois violating the First, Second and Fourth Amendment all at once"
    }
   }, 
   null, 
   null, 
   1300132080.0
  ], 
  [
   425821, 
   null, 
   "zsu2357", 
   "They do seem to be trying, but the interesting thing is that as far as their religious beliefs go that's all good,but do you know if they were Muslim we would bend over backwards to accommodate them.emoticon_hb", 
   {}, 
   425812, 
   null, 
   1300141560.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Illinois violating the First, Second and Fourth Amendment all at once", 
  "url": "http://www.4forums.com/political/gun-control-debates/15166-illinois-violating-first-second-fourth-amendment-all-once.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15166, 
  "discussion_files": [
   [
    "21554.html", 
    "http://www.4forums.com/political/gun-control-debates/15166-illinois-violating-first-second-fourth-amendment-all-once-print.html"
   ]
  ], 
  "identifier": 15166
 }
]