[
 [
  [
   425907, 
   null, 
   "NATO 556", 
   "Obama Aims in the Wrong Direction on Gun Control - Katie Pavlich - Townhall Conservative\n \n \nPresident Obama published an op-ed in my college town newspaper, Tucson's Arizona Daily Star, over the weekend calling for more enforcement of current gun laws.\n \n \"It's been more than two months since the tragedy in Tucson stunned the nation. It was a moment when we came together as one people to mourn and to pray for those we lost. And in the attack's turbulent wake, Americans by and large rightly refrained from finger-pointing, assigning blame or playing politics with other people's pain.\"\n \n The president failed to remember the heated political climate just moments after America found out about the situation in Tucson on January 8, 2011, which left six dead and 11 wounded including Rep. Gabrielle Giffords, who is still recovering in a Texas rehab center.\n \n Immediately following the shooting, left wing websites and the mainstream media placed blame and responsibility on Sarah Palin, Sean Hannity, Rush Limbaugh and any other conservative commentator that came to mind, not the mention the entire tea party movement, which was held responsible for the shooting before police had even released the name of a suspect. We now know (allegedly) the person truly responsible for the tragic events that day as Jared Lee Loughner, a crazed and disturbed man who listed the Communist Manifesto as one of his favorite books on his conspiracy-filled Youtube channel.\n \n But anyway, let's move on to the topic of Obama's opining: gun control.\n \n President Obama used Jared Loughner as an example of a mad man who got his hands on a gun, citing lax gun law enforcement.\n \n \"But one clear and terrible fact remains. A man our Army rejected as unfit for service; a man one of our colleges deemed too unstable for studies; a man apparently bent on violence, was able to walk into a store and buy a gun.\"\n \n What Obama fails to mention is that Pima County Sheriff Clarence Dupnik, who by the way also blamed the entire shooting on \"vitriolic rhetoric\" and called Arizona the Mecca of hatred and bigotry at the time, had multiple encounters with Loughner for issuing death threats to a radio host among other things before the shooting on January 8, meaning Dupnik allowed him to slip through the cracks of law enforcement more than once.\n \n Obama in the op-ed calls for more enforcement of gun laws on the books, saying he wouldn't be surprised if law-abiding gun owners were in agreement with him.\n \n \"I'm willing to bet that responsible, law-abiding gun owners agree that we should be able to keep an irresponsible, law-breaking few - dangerous criminals and fugitives, for example - from getting their hands on a gun in the first place.\"\n \n But here comes the ironic part. The Bureau of Alcohol Tobacco and Firearms was recently busted for allowing Mexican drug cartels to supply themselves with thousands of weapons used to kill tens of thousands of innocents in Mexico and Border Patrol Agent Brian Terry in Southern Arizona. ATF approved the sales of these weapons after gun shop owners, who were following the current laws, reported the mass sales of weapons such as the AK-47, and ATF gave them the green light. That's right, ATF was literally watching murderers purchase the weapons they needed to kill people. It is pretty difficult to keep guns out of the hands of criminals when the government gives them the go-ahead.\n \n President Obama also throws out statistics about people killed by criminals who happen to use guns every year in his comments but fails to mention that number has been reduced and why it has been reduced, mostly likely because the answer is inconvenient to his anti-gun agenda and ideology.\n \n The president has a habit of opining on topics before having the facts, so let's present him, and other anti-gun advocates, with a few:\n \n -Murder rates decline when more men and women carry concealed handguns, reducing the rate of murder of a woman by 3 to 4 times\n \n -States that do not allow citizens to obtain concealed weapons permits have higher crime rates than states that do allow concealed weapons permits\n \n -The District of Columbia's murder rate dropped by 25 percent after the 2008 Supreme Court struck down the DC hand gun ban\n \n -Since the 1982 implementation of the hand gun ban in Chicago, the murder rate has gone up 32 percent by 1992 and was up 68 percent by 2002\n \n The National Rifle Association and law-abiding gun owners have never advocated for mentally ill individuals and criminals to get guns, and infringing on law abiding citizens' right to bear arms is not the way to prevent crime. The NRA has been behind the instant criminal background check from the beginning and advocates for law enforcement to take bad guys off the streets to prevent crime.\n \n What President Obama needs to realize is that bad guys don't get guns because of the incompetence of law-abiding gun shop owners or even the NRA -- they get them through the incompetence of government officials like Sheriff Dupnik and ATF.\n \n To his credit, Obama did acknowledge \"almost all gun owners in America are highly responsible;\" however, he's preaching to the choir with that statement.\n \n President Obama sounds like he is willing to come to the center on the gun-control issue, but as a man who has not backed off on his belief \"the assault weapons ban makes sense\" and with an attorney general who agrees, it's hard to believe his call for \"better enforcement of our current guns law\" is really what he is aiming for here.\n", 
   {
    "post_info": {
     "post_title": "Obama Aims in the Wrong Direction on Gun Control"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1300214040.0
  ], 
  [
   425909, 
   null, 
   "Tither", 
   "While remembering that this is a Constitutional issue, not a Quote \"gun safety issue,\" the titles of the articles says more than the articles themselves. emoticon_smile\n \n  Obama's latest 'gun control' proposal will not close 'Gunwalker loophole' \n \n  'President Can't Tell Gun 'Safety' Advocates from Prohibitionists' \n \n  They really think they can get away with this in the face of the Gunwalker Scandal \n \n  Bellevue v. Obama: Gun safety, not gun hysteria \n \n  Obama demands that we 'seek agreement' on guns; will he agree to rein in BATFE? \n \n emoticon_rolleyes", 
   {
    "unicode_changes_made": true
   }, 
   425907, 
   null, 
   1300216200.0
  ], 
  [
   425918, 
   null, 
   "sinjin", 
   "It's been more than two months since the tragedy in Tucson stunned the nation. It was a moment when we came together as one people to mourn and to pray for those we lost. And in the attack's turbulent wake, Americans by and large rightly refrained from finger-pointing, assigning blame or playing politics with other people's pain.\n \n But one clear and terrible fact remains. A man our Army rejected as unfit for service; a man one of our colleges deemed too unstable for studies; a man apparently bent on violence, was able to walk into a store and buy a gun.\n \n He used it to murder six people and wound 13 others. And if not for the heroism of bystanders and a brilliant surgical team, it would have been far worse.\n \n But since that day, we have lost perhaps another 2,000 members of our American family to gun violence. Thousands more have been wounded. We lose the same number of young people to guns every day and a half as we did at Columbine, and every four days as we did at Virginia Tech.\n \n Every single day, America is robbed of more futures. It has awful consequences for our society. And as a society, we have a responsibility to do everything we can to put a stop to it.\n \n Now, like the majority of Americans, I believe that the Second Amendment guarantees an individual right to bear arms. And the courts have settled that as the law of the land. In this country, we have a strong tradition of gun ownership that's handed from generation to generation. Hunting and shooting are part of our national heritage. And, in fact, my administration has not curtailed the rights of gun owners - it has expanded them, including allowing people to carry their guns in national parks and wildlife refuges.\n \n The fact is, almost all gun owners in America are highly responsible. They're our friends and neighbors. They buy their guns legally and use them safely, whether for hunting or target shooting, collection or protection. And that's something that gun-safety advocates need to accept. Likewise, advocates for gun owners should accept the awful reality that gun violence affects Americans everywhere, whether on the streets of Chicago or at a supermarket in Tucson.\n \n I know that every time we try to talk about guns, it can reinforce stark divides. People shout at one another, which makes it impossible to listen. We mire ourselves in stalemate, which makes it impossible to get to where we need to go as a country.\n \n However, I believe that if common sense prevails, we can get beyond wedge issues and stale political debates to find a sensible, intelligent way to make the United States of America a safer, stronger place.\n \n I'm willing to bet that responsible, law-abiding gun owners agree that we should be able to keep an irresponsible, law-breaking few - dangerous criminals and fugitives, for example - from getting their hands on a gun in the first place.\n \n I'm willing to bet they don't think that using a gun and using common sense are incompatible ideas - that we should check someone's criminal record before he can check out at a gun seller; that an unbalanced man shouldn't be able to buy a gun so easily; that there's room for us to have reasonable laws that uphold liberty, ensure citizen safety and are fully compatible with a robust Second Amendment.\n \n That's why our focus right now should be on sound and effective steps that will actually keep those irresponsible, law-breaking few from getting their hands on a gun in the first place.\n \n &#8226; First, we should begin by enforcing laws that are already on the books. The National Instant Criminal Background Check System is the filter that's supposed to stop the wrong people from getting their hands on a gun. Bipartisan legislation four years ago was supposed to strengthen this system, but it hasn't been properly implemented. It relies on data supplied by states - but that data is often incomplete and inadequate. We must do better.\n \n &#8226; Second, we should in fact reward the states that provide the best data - and therefore do the most to protect our citizens.\n \n &#8226; Third, we should make the system faster and nimbler. We should provide an instant, accurate, comprehensive and consistent system for background checks to sellers who want to do the right thing, and make sure that criminals can't escape it.\n \n Porous background checks are bad for police officers, for law-abiding citizens and for the sellers themselves. If we're serious about keeping guns away from someone who's made up his mind to kill, then we can't allow a situation where a responsible seller denies him a weapon at one store, but he effortlessly buys the same gun someplace else.\n \n Clearly, there's more we can do to prevent gun violence. But I want this to at least be the beginning of a new discussion on how we can keep America safe for all our people.\n \n I know some aren't interested in participating. Some will say that anything short of the most sweeping anti-gun legislation is a capitulation to the gun lobby. Others will predictably cast any discussion as the opening salvo in a wild-eyed scheme to take away everybody's guns. And such hyperbole will become the fodder for overheated fundraising letters.\n \n But I have more faith in the American people than that. Most gun-control advocates know that most gun owners are responsible citizens. Most gun owners know that the word \"commonsense\" isn't a code word for \"confiscation.\" And none of us should be willing to remain passive in the face of violence or resigned to watching helplessly as another rampage unfolds on television.\n \n As long as those whose lives are shattered by gun violence don't get to look away and move on, neither can we.\n \n We owe the victims of the tragedy in Tucson and the countless unheralded tragedies each year nothing less than our best efforts - to seek consensus, to prevent future bloodshed, to forge a nation worthy of our children's futures.\n \n President Obama: We must seek agreement on gun reforms", 
   {}, 
   425909, 
   null, 
   1300220640.0
  ], 
  [
   425921, 
   null, 
   "Doc Jones", 
   "It's been more than two months since the tragedy in Tucson stunned the nation. It was a moment when we came together as one people to mourn and to pray for those we lost. And in the attack's turbulent wake, Americans by and large rightly refrained from finger-pointing, assigning blame or playing politics with other people's pain.\n \n But one clear and terrible fact remains. A man our Army rejected as unfit for service; a man one of our colleges deemed too unstable for studies; a man apparently bent on violence, was able to walk into a store and buy a gun.\n \n He used it to murder six people and wound 13 others. And if not for the heroism of bystanders and a brilliant surgical team, it would have been far worse.\n \n But since that day, we have lost perhaps another 2,000 members of our American family to gun violence. Thousands more have been wounded. We lose the same number of young people to guns every day and a half as we did at Columbine, and every four days as we did at Virginia Tech.\n \n Every single day, America is robbed of more futures. It has awful consequences for our society. And as a society, we have a responsibility to do everything we can to put a stop to it.\n \n Now, like the majority of Americans, I believe that the Second Amendment guarantees an individual right to bear arms. And the courts have settled that as the law of the land. In this country, we have a strong tradition of gun ownership that's handed from generation to generation. Hunting and shooting are part of our national heritage. And, in fact, my administration has not curtailed the rights of gun owners - it has expanded them, including allowing people to carry their guns in national parks and wildlife refuges.\n \n The fact is, almost all gun owners in America are highly responsible. They're our friends and neighbors. They buy their guns legally and use them safely, whether for hunting or target shooting, collection or protection. And that's something that gun-safety advocates need to accept. Likewise, advocates for gun owners should accept the awful reality that gun violence affects Americans everywhere, whether on the streets of Chicago or at a supermarket in Tucson.\n \n I know that every time we try to talk about guns, it can reinforce stark divides. People shout at one another, which makes it impossible to listen. We mire ourselves in stalemate, which makes it impossible to get to where we need to go as a country.\n \n However, I believe that if common sense prevails, we can get beyond wedge issues and stale political debates to find a sensible, intelligent way to make the United States of America a safer, stronger place.\n \n I'm willing to bet that responsible, law-abiding gun owners agree that we should be able to keep an irresponsible, law-breaking few - dangerous criminals and fugitives, for example - from getting their hands on a gun in the first place.\n \n I'm willing to bet they don't think that using a gun and using common sense are incompatible ideas - that we should check someone's criminal record before he can check out at a gun seller; that an unbalanced man shouldn't be able to buy a gun so easily; that there's room for us to have reasonable laws that uphold liberty, ensure citizen safety and are fully compatible with a robust Second Amendment.\n \n That's why our focus right now should be on sound and effective steps that will actually keep those irresponsible, law-breaking few from getting their hands on a gun in the first place.\n \n \u0095 First, we should begin by enforcing laws that are already on the books. The National Instant Criminal Background Check System is the filter that's supposed to stop the wrong people from getting their hands on a gun. Bipartisan legislation four years ago was supposed to strengthen this system, but it hasn't been properly implemented. It relies on data supplied by states - but that data is often incomplete and inadequate. We must do better.\n \n \u0095 Second, we should in fact reward the states that provide the best data - and therefore do the most to protect our citizens.\n \n \u0095 Third, we should make the system faster and nimbler. We should provide an instant, accurate, comprehensive and consistent system for background checks to sellers who want to do the right thing, and make sure that criminals can't escape it.\n \n Porous background checks are bad for police officers, for law-abiding citizens and for the sellers themselves. If we're serious about keeping guns away from someone who's made up his mind to kill, then we can't allow a situation where a responsible seller denies him a weapon at one store, but he effortlessly buys the same gun someplace else.\n \n Clearly, there's more we can do to prevent gun violence. But I want this to at least be the beginning of a new discussion on how we can keep America safe for all our people.\n \n I know some aren't interested in participating. Some will say that anything short of the most sweeping anti-gun legislation is a capitulation to the gun lobby. Others will predictably cast any discussion as the opening salvo in a wild-eyed scheme to take away everybody's guns. And such hyperbole will become the fodder for overheated fundraising letters.\n \n But I have more faith in the American people than that. Most gun-control advocates know that most gun owners are responsible citizens. Most gun owners know that the word \"commonsense\" isn't a code word for \"confiscation.\" And none of us should be willing to remain passive in the face of violence or resigned to watching helplessly as another rampage unfolds on television.\n \n As long as those whose lives are shattered by gun violence don't get to look away and move on, neither can we.\n \n We owe the victims of the tragedy in Tucson and the countless unheralded tragedies each year nothing less than our best efforts - to seek consensus, to prevent future bloodshed, to forge a nation worthy of our children's futures.\n \n President Obama: We must seek agreement on gun reforms\n\n \n As soon as he can stop government goons from breaking the law, Project Gunwalker, Fast and furious, and outright sale of gov. to gov. arms and munitions then he can try to develop an idea under strict scrutiny. Until then he is racketerring and political propaganda. He didn't mention the Judge who was shot, a political opposite who he deprived of his U.S. Marshall body guards nor did he mention the Major, a Muslim at Ft. Hood and his violent attack. He is not center, he is far left and ignoring the rule of law and he knows it.\n Yeah, we need reforms, NO MORE GUN LAWS AND REPEAL THOSE FOUND INEFFECTIVE BY CDC AND NAS.", 
   {}, 
   425918, 
   null, 
   1300221480.0
  ], 
  [
   426109, 
   null, 
   "NATO 556", 
   "NRA to President Obama: The Problem Isn?t Guns, it?s Law Enforcement, Media and the Mental Health System - Political Punch\n \n \nThe heads of the National Rifle Association wrote to President Obama Monday, taking issue with his op-ed in the Sunday Arizona Daily Star, in which he said that since the tragic shooting in Tucson perhaps another 2,000 Americans have been lost to gun violence. \n \n The president pushed for states to provide better data to the National Instant Criminal Background Check System and suggested \"an instant, accurate, comprehensive and consistent system for background checks to sellers.\"\n \n The heads of the NRA responded to the president's op-ed on gun issues, saying, \"to focus a national dialogue on guns - and not criminals or mental health issues - misses the point entirely.\"\n \n The problem is not gun laws, they say, bur rather lax law enforcement, a sensationalist media and deficiencies in the mental health system.\n \n After suggesting that the president's claim to support the Second Amendment is \"lip service,\" NRA executive vice president Wayne LaPierre and chief lobbyist Chris Cox urged the president to:\n \n \u0095 \"contact every U.S. Attorney and ask them to bring at least 10 cases per month against drug dealers, gang members and other violent felons caught illegally possessing firearms. By prosecuting these criminals in federal court - rather than state court - strong sentencing guidelines would apply and charges would not be plea-bargained or dismissed, nor would criminals be released after serving only a fraction of their sentences. This simple directive would result in roughly 12,000 violent criminals being taken off the streets every year\";\n \n \u0095 immediately end the Bureau of Alcohol Tobacco Firearms and Explosives' \"Fast and Furious\" operation, \"in which an unknown number of illegal firearm transactions were detected - and then encouraged to fruition by your BATFE, which allegedly decided to let thousands of firearms 'walk' across the border and into the hands of murderous drug cartels.\" (Read more on the Fast and Furious program HERE.);\n \n \u0095 call on the media \"to refrain from giving deranged criminals minute-by-minute coverage of their heinous acts, which only serves to encourage copycat behavior. If media outlets won't show a fan running onto the field during a baseball game because they don't want to encourage that behavior by others - surely they can listen to law enforcement experts and refuse to air the photographs, video messages or Facebook postings of madmen and murderers\"; and\n \n \u0095 \"to encourage people to report red flags when they see them. In the case of Tucson, a man clearly bent on violence was not reported to the proper authorities by those who had good reason to believe he had serious mental problems. That's not a deficiency in our gun laws, it's a deficiency in our mental health system - and should be treated as such.\"\n\n \n That sounds like sound advice to me.", 
   {
    "unicode_changes_made": true
   }, 
   425907, 
   null, 
   1300507380.0
  ], 
  [
   426271, 
   null, 
   "Brady", 
   "Political self-interest must never trump public safety - and yet President Obama is dancing delicately around the fringes of life-and-death gun-control issues rather than facing them down. This is not leadership.\n \n Obama's call in the Arizona Daily Star last week for better firearms enforcement fell far short of the kind of common-sense, middle-of-the-road reforms that are needed in this country - and that also, ironically, generally prevail in public opinion polls.\n \n The president's exclusive offering to the Star clearly was prompted by the Jan. 8 shootings here that killed six people and injured 13 others, including Rep. Gabrielle Giffords. Yet Obama's article ignored glaring failures in our laws that abetted the Jan. 8 shooter in wreaking tragic havoc.\n \n Obama argued that better enforcement of existing laws, especially the background check system; rewarding states for providing better data to back up the system; and quicker background checks must be priorities.\n \n We agree. But the president failed to step up and insist on meat-and-potato reforms that also are imperative, including several he supported in his campaign. Among them:\n \n \u0095 Reinstating the expired federal ban on military-style assault weapons.\n \n He's not talking about it now, but during the campaign Obama supported reimposition of the 1994 ban, which expired in 2004. We do, too; but the old ban was flawed and a new ban should be modeled on California's law, which uses a \"one-feature\" definition, banning private ownership of weapons with just one military-style feature, such as bayonet mounts, threads for silencers or flash suppressors.\n \n No legitimate gun owner needs to use a weapon such as the .50-caliber sniper rifle, which is easier to buy legally in most states than a handgun and which is highly accurate from a mile away, firing ammunition that can pierce reinforced armor such as that on airplanes and fuel tanks.\n \n \u0095 Reinstating a federal ban on extended-capacity magazines.\n \n No one, not a woman carrying a weapon for self-defense or a hobbyist shooting at targets, needs to fire 30 shots in less than 30 seconds. There's no way to prevent all shooting rampages, but we can reduce the amount of carnage shooters are equipped to do.\n \n Ten rounds is the limit that would be imposed by a bill in Congress introduced by U.S. Rep. Carolyn McCarthy, a New York Democrat, and by a bill in the Arizona Legislature, introduced by Tucson Democratic Rep. Steven Farley. We support both measures. Obama should, too.\n \n \u0095 Closing the gun-show \"loophole,\" an intentional exception to the background check law which allows criminals and other undesirable gun buyers to acquire firearms in private sales.\n \n Again, Obama is silent on this now, but he supported it during the campaign. Federal law requires that background checks be made by federally licensed gun sellers, but not by private sellers doing deals at gun shows, flea markets, garage sales or among private acquaintances.\n \n Our view is that in order to keep firearms out of the hands of the most dangerous people, anyone who sells a gun should be required to check out the buyer through the National Instant Criminal Background Check System (NICS) system or, as in California, do the deal only through a licensed retailer.\n \n \u0095 Improve the NICS system itself. It relies largely on data provided by the states, and many states - among them Arizona - don't provide much, especially information about people found too dangerously mentally ill to legally purchase weapons.\n \n Obama wrote that he would reward states that do a good job in sharing this information; fine, but let's also consider ways to punish states that do not.\n \n \u0095 As we noted last month, the federal Bureau of Alcohol, Tobacco, Firearms and Explosives is badly underfunded. Obama should be leading the charge to get ATF into fighting shape.\n \n The National Rifle Association says that Obama's focus as outlined in his Star article is misplaced; that he should be talking about \"criminals or mental health issues,\" not gun laws. We disagree that the two issues can be mutually exclusive.\n \n The Obama administration last week held meetings on the issues at the U.S. Department of Justice.\n \n But media reports suggest Obama's team didn't offer a priority list of gun-control reforms. Instead, it apparently wanted only to encourage discussion from the NRA (which didn't show up), the ATF, FBI, and the Brady Campaign to Prevent Gun Violence, among others.\n \n We understand that gun control initiatives can endanger political careers; the NRA can put millions into the pockets of candidates who agree with it.\n \n We also understand that the president would like to be re-elected in 2012 and isn't eager to endanger the careers of Democrats serving in Congress.\n \n But there's a time for leadership that sets aside calculations of political self-interest.\n \n On reforming America's gun laws, that time is now.\n VPC - The Violence Policy Center", 
   {}, 
   426109, 
   null, 
   1300770240.0
  ], 
  [
   426277, 
   null, 
   "Nozza123", 
   "Political self-interest must never trump public safety - and yet President Obama is dancing delicately around the fringes of life-and-death gun-control issues rather than facing them down. This is not leadership.\n \n Obama's call in the Arizona Daily Star last week for better firearms enforcement fell far short of the kind of common-sense, middle-of-the-road reforms that are needed in this country - and that also, ironically, generally prevail in public opinion polls.\n \n The president's exclusive offering to the Star clearly was prompted by the Jan. 8 shootings here that killed six people and injured 13 others, including Rep. Gabrielle Giffords. Yet Obama's article ignored glaring failures in our laws that abetted the Jan. 8 shooter in wreaking tragic havoc.\n \n Obama argued that better enforcement of existing laws, especially the background check system; rewarding states for providing better data to back up the system; and quicker background checks must be priorities.\n \n We agree. But the president failed to step up and insist on meat-and-potato reforms that also are imperative, including several he supported in his campaign. Among them:\n \n \u0095 Reinstating the expired federal ban on military-style assault weapons.\n \n He's not talking about it now, but during the campaign Obama supported reimposition of the 1994 ban, which expired in 2004. We do, too; but the old ban was flawed and a new ban should be modeled on California's law, which uses a \"one-feature\" definition, banning private ownership of weapons with just one military-style feature, such as bayonet mounts, threads for silencers or flash suppressors.\n \n No legitimate gun owner needs to use a weapon such as the .50-caliber sniper rifle, which is easier to buy legally in most states than a handgun and which is highly accurate from a mile away, firing ammunition that can pierce reinforced armor such as that on airplanes and fuel tanks.\n \n \u0095 Reinstating a federal ban on extended-capacity magazines.\n \n No one, not a woman carrying a weapon for self-defense or a hobbyist shooting at targets, needs to fire 30 shots in less than 30 seconds. There's no way to prevent all shooting rampages, but we can reduce the amount of carnage shooters are equipped to do.\n \n Ten rounds is the limit that would be imposed by a bill in Congress introduced by U.S. Rep. Carolyn McCarthy, a New York Democrat, and by a bill in the Arizona Legislature, introduced by Tucson Democratic Rep. Steven Farley. We support both measures. Obama should, too.\n \n \u0095 Closing the gun-show \"loophole,\" an intentional exception to the background check law which allows criminals and other undesirable gun buyers to acquire firearms in private sales.\n \n Again, Obama is silent on this now, but he supported it during the campaign. Federal law requires that background checks be made by federally licensed gun sellers, but not by private sellers doing deals at gun shows, flea markets, garage sales or among private acquaintances.\n \n Our view is that in order to keep firearms out of the hands of the most dangerous people, anyone who sells a gun should be required to check out the buyer through the National Instant Criminal Background Check System (NICS) system or, as in California, do the deal only through a licensed retailer.\n \n \u0095 Improve the NICS system itself. It relies largely on data provided by the states, and many states - among them Arizona - don't provide much, especially information about people found too dangerously mentally ill to legally purchase weapons.\n \n Obama wrote that he would reward states that do a good job in sharing this information; fine, but let's also consider ways to punish states that do not.\n \n \u0095 As we noted last month, the federal Bureau of Alcohol, Tobacco, Firearms and Explosives is badly underfunded. Obama should be leading the charge to get ATF into fighting shape.\n The National Rifle Association says that Obama's focus as outlined in his Star article is misplaced; that he should be talking about \"criminals or mental health issues,\" not gun laws. We disagree that the two issues can be mutually exclusive.\n \n The Obama administration last week held meetings on the issues at the U.S. Department of Justice.\n \n But media reports suggest Obama's team didn't offer a priority list of gun-control reforms. Instead, it apparently wanted only to encourage discussion from the NRA (which didn't show up), the ATF, FBI, and the Brady Campaign to Prevent Gun Violence, among others.\n \n We understand that gun control initiatives can endanger political careers; the NRA can put millions into the pockets of candidates who agree with it.\n \n We also understand that the president would like to be re-elected in 2012 and isn't eager to endanger the careers of Democrats serving in Congress.\n \n But there's a time for leadership that sets aside calculations of political self-interest.\n \n On reforming America's gun laws, that time is now.\n VPC - The Violence Policy Center\n\n \n BAHAHBAAHHABABABAHAHAHHAHHAHAHAHHAHAHHAHAHHAHAHAHHAHAHHAHAHAHHAAAAAAAHAHAHAHHAHHAHAHHAHAHAHHAHHAHAHAHAHHAHAHHAHAHAHA\n Pause for Breath........... HHAHHAHAHAHHAHAHHAHHAHAHHAHHHAAHHAHHAHAHAHHAHAHAHHAHHAHAHHAHHAHAHAHHAHAHAHAHAHAHHAHAHAHAHHAHAHAHAHAHHAHAHHAHHAAHHAHA\n \n One of the most classic things i have ever read. Good idea Brady lets give the ATF more money so they can give more guns to drug cartels.\n \n I will once again let Pietro rip you apart but i thought it is beyond classic how you want to give criminals more money to undertake their shady dealings!\n \n Man brady you never cease to give me a laugh and for that a thank you emoticon_xgood", 
   {}, 
   426271, 
   null, 
   1300787280.0
  ], 
  [
   426279, 
   null, 
   "Doc Jones", 
   "The brady campaign and vpc, enemies of the Constitution and the criminals best friends. Liberal left wing whachoes... :xcensored\n \n Bill right now in congress to reign in batf and cut funding; I'd say chances are excellent it will pass emoticon_smile", 
   {}, 
   426277, 
   null, 
   1300795140.0
  ], 
  [
   426280, 
   null, 
   "Doc Jones", 
   "Political self-interest must never trump public safety - and yet President Obama is dancing delicately around the fringes of life-and-death gun-control issues rather than facing them down. This is not leadership.\n \n \n\n \n Public safety is the best it has been since BEFORE the first '68 GCA was passed and crime has never been lower.\n \n Obama knows he is prohibited by the Constitution unlike the gun grabber who criticize and call it \"gun control issues\" which have been settled in the Supreme Court at least 37 times now with the latest being Heller and McDonald.\n \n Political issue my foot, it is a rule of law, a Constitutional RIGHT enshrined in the XIVth Amendment also and is bound by such and enforceable individually and by LAW.\n \n What you creeps are asking is to ignore the law. Is your budget hurting Scot? emoticon_smile emoticon_xgood", 
   {}, 
   426279, 
   null, 
   1300795560.0
  ], 
  [
   426292, 
   null, 
   "Pietro", 
   "Oh boy oh boy. Brady every time you show up I feel the need to up my dosage of migraine medication simply because of the nonsense you choose to share despite the facts that your sources are highly flawed and notoriously deceptive. I don't even know where to begin addressing the sheer absurdity of your foolishness but I'll most certainly try.\n \n \nPolitical self-interest must never trump public safety - and yet President Obama is dancing delicately around the fringes of life-and-death gun-control issues rather than facing them down. This is not leadership.\n\n \n \"Public safety\" is a relative term, subject to interpretation based on information available at the time. What qualifies as \"public safety\" wouldn't necessarily qualify at a different time down the line. As such the yard stick of \"public safety\" shouldn't be used for implementing laws which have the potential to become permanent in nature when the definition of measure could have a shelf life of only six months. The current crisis facing Japan is a fine example of just that. Despite its severity the crisis isn't going to be permanent and the current procedures in place won't continue indefinitely once the crisis is eventually resolved. So what may qualify as \"public safety\" right now won't necessarily be relevant in say six month's time.\n \n It's shameful that you and others would take the position that current and temporary issues should be grounds for implementing new and potentially permanent laws that are out of touch with what the country truly needs.\n \n \nWe agree. But the president failed to step up and insist on meat-and-potato reforms that also are imperative, including several he supported in his campaign. Among them:\n\n \n So you fully admit that Obama supported restrictive gun control laws and that we were right all along when we warned about his potential danger should he ever become president? You're willing to admit that we weren't fear mongering as many have claimed for so long?\n \n \n\u0095 Reinstating the expired federal ban on military-style assault weapons.\n \n He's not talking about it now, but during the campaign Obama supported reimposition of the 1994 ban, which expired in 2004. We do, too; but the old ban was flawed and a new ban should be modeled on California's law, which uses a \"one-feature\" definition, banning private ownership of weapons with just one military-style feature, such as bayonet mounts, threads for silencers or flash suppressors.\n\n \n To begin with I'm afraid your proposal would never be allowed to pass constitutional muster. In Heller the Supreme Court stated that a ban on an entire class of guns isn't legally allowed. Any attempt to define something under the term of \"assault weapons\" would classify them and result in them being considered an entire class of weaponry and any such ban wouldn't be allowed to take place. And unless you're willing to support the government violating the Constitution where it's been told it has no authority to your \"assault weapons ban\" will never get off the ground.\n \n That's regarding the legalities of such a ban now we're moving onto the physical impossibilities.\n \n The number of \"assault weapons\" currently in circulation is potentially in the millions. This is complicated by the fact that the term has become very flexible and can be applied to basically anything and everything, including single shot firearms. Depending on the extent you wish to take this semantics game you could be facing an uphill battle regarding hundreds of millions of legally owned guns. This matter is further complicated by the simple fact that nearly any popular series of pistol has removable barrels and can be replaced with a brand new barrel with a threaded muzzle, making it capable of accepting a sound or flash suppressor. In other words changing out the barrel on an unrestricted firearm could stick you with a prohibited weapon, and viceversa where a simple barrel change that allow anyone to avoid the law.\n \n Bayonet lugs further complicate the issue even more. Over the years a number of companies have made bayonets capable of being mounted on the underbarrel accessory rails found on modern handguns which are more commonly used for mounting lights and lasers. Under your proposal the definition of \"assault weapons\" would have to be expanded to any handgun made in the last 10-15 years. Either that or you'll need to introduce loopholes and exceptions that you'll later claim need to be closed.\n \n And exactly how far are you willing to take the \"banning private ownership\" approach? Are you going to limit it strictly to preventing any new purchases from taking place or are you going to tell long time gun owners that they have to surrender their privately owned property or face prison sentences? I'm not sure where exactly in the Constitution congress has that authority, are you? Trying to actually enforce such a law would be impossible. There would be no way to punish violators or even catch someone violating the law. There are simply not enough police in the nation to try and actively enforce this particular law at the expense of all other duties required of them. They can't just let rapists and arsonists go in the name of hunting down gun owners who have newly prohibited weapons in their possession.\n \n And good luck trying to deprive gun owners of their property. How are you going to actually going to find those who own these weapons you don't like? You have no centralized database to go by. And any attempt to use FFL dealer records would be both a monumental undertaking, and a massive service for our cause because it would show that we were right all along when we warned about the evils of the NICS background check system and those 4473 forms. Plus you'd be repeating history and show once and for all that any record of gun ownership is evil and can be used as a weapon against the people it was supposed to protect. Instead of being used to keep guns out of the hands of the wrong people it would be used to deprive the good people.\n \n The response to such actions would likely be massive riot and rebellion and what you term \"second amendment solutions\" on a national scale simply because the government pushed the people too far one too many times. And nobody would be able to blame them for their actions considering the abuse you insist the government dispatch on us.\n \n You also mention that the old law was flawed. Are you now admitting that from 1994 to 2004 no guns or magazines were banned and thus the law did no good in the first place?\n \n \nNo legitimate gun owner needs to use a weapon such as the .50-caliber sniper rifle, which is easier to buy legally in most states than a handgun and which is highly accurate from a mile away, firing ammunition that can pierce reinforced armor such as that on airplanes and fuel tanks.\n\n \n I'd like to see you try and prove this case. First and foremost I'd like to see some evidence that commercial airplanes are equipped with reinforced armor. Because I've seen a Boeing 747 and it doesn't exactly look like it was built with ballistic assault in mind.\n \n I'd also like to see you prove that absolutely anyone, even the most untrained of street punks, could accurately hit anything at a mile's distance. What you're talking about is special forces grade achievements, not run of the mill XXXXX with a rifle possibilities. And if you've professional snipers taking shots at our airplanes in this country then you've got much bigger things to worry about than what kind of guns are available in the private sector markets. You've got a military rebellion or a terrorist invasion going on and that carries much greater weight of severity.\n \n \n\u0095 Reinstating a federal ban on extended-capacity magazines.\n \n No one, not a woman carrying a weapon for self-defense or a hobbyist shooting at targets, needs to fire 30 shots in less than 30 seconds.\n\n \n Before anything else is said Brady I'd like to bring your attention to this video.\n \n YouTube - CAS shotgun - Grim Reaper\n \n With a pump action shotgun, loading one round at a time no less, the individual was able to get off six shots in four seconds. Not even one second per shot. At that rate of fire he could easily get off 35 shots or more in a 30 second window; even more if he didn't have to reload one round at a time. That could easily blow away your argument right there. But no I'm not done yet, check out this one.\n \n YouTube - Fast Revolver Shooting\n \n Here we have a man capable of firing 8 shots from a revolver in a matter of one second. And then he went on to fire 6 shots, performed a reload and fired 6 more shots in a window of less than three seconds. That rate of fire greatly exceeds your figure of \"30 shots in less than 30 seconds\" and is done with a revolver of all things. How do you address that fact? And then there's this video.\n \n YouTube - Speed Shootin&#39; Lever gunner\n \n 10 shots from a rifle in a matter of less than 2 seconds. At a rate of fire like that you're facing 150 shots within 30 seconds. That's nothing to sneeze at.\n \n And then we come to your elitist position where you claim that nobody, absolutely nobody, ever has any need for more than 10 rounds of ammunition at any given time. Exactly how do you have the authority to make such a claim? Who gave you exclusive authority to determine what the rest of the country needs? Do you actually expect us to believe that in a country of more than 300 million people there's not a sole individual in the entire nation that might face the need to have 11 or more rounds of ammunition with them?\n \n What about the police? Why exactly are there no laws restricting police officers to magazines of no more than 10 rounds? You claim that it's different for police, that police need those magazines. But you never explain how they somehow have a legitimate need for those magazines, and yet their need applies only to them and not a single individual outside of the police force shares that same need. Better yet why do retired police officers need so-called \"high capacity ammunition magazines\"? What could a retired police officer have need for with these magazines that no other person in the country would?\n \n Are you going to start explaining these shortcomings in gun control logic or are you simply going to run away again?\n \n \nThere's no way to prevent all shooting rampages, but we can reduce the amount of carnage shooters are equipped to do.\n\n \n No you really can't? Should I cite the Columbine massacre again to show the weaponry that was used in the carnage? Should I present the VPC article showing the number of mass shootings that took place between 1994 and 2004 to show that supposedly prohibited weaponry and accessories were not prohibited?\n \n \nTen rounds is the limit that would be imposed by a bill in Congress introduced by U.S. Rep. Carolyn McCarthy, a New York Democrat, and by a bill in the Arizona Legislature, introduced by Tucson Democratic Rep. Steven Farley. We support both measures. Obama should, too.\n\n \n See above regarding the article of the Violence Policy Center. Besides that you previously admitted the old law had flaws that still allowed to ownership of supposedly prohibited goods. Are you contradicting yourself now? Are you saying that you're correct now but you were mistaken previously?\n \n \n\u0095 Closing the gun-show \"loophole,\" an intentional exception to the background check law which allows criminals and other undesirable gun buyers to acquire firearms in private sales.\n \n Again, Obama is silent on this now, but he supported it during the campaign. Federal law requires that background checks be made by federally licensed gun sellers, but not by private sellers doing deals at gun shows, flea markets, garage sales or among private acquaintances.\n\n \n Back in 1968 when the Gun Control Act was being crafted the democrats had a considerable majority in the House and Senate, and the NRA wasn't in the political game yet. You had the perfect opportunity to mandate background checks for private sellers, but you chose not to strike when the iron was hot. Since then you've had 43 years to try and implement backgrounds checks for all secondary sales. You had the perfect opportunity to pass such a law back in 1994 when the democrats were in control of the House and Senate and passed the first \"assault weapons ban\". You had the perfect opportunity two years ago when the democrats once again controlled the House and Senate with a super majority. But again you didn't strike when the iron was hot.\n \n You've had 43 years to try and implement your policies and you haven't done squat. You didn't strike when you had the perfect opportunities. I'd say it's well past time to simply shut up, suck it up, and move onto something else already. You've had nearly a half century and you've done nothing. Kindly move to the back of the line and let us handle matters from here on out.\n \n \nOur view is that in order to keep firearms out of the hands of the most dangerous people, anyone who sells a gun should be required to check out the buyer through the National Instant Criminal Background Check System (NICS) system or, as in California, do the deal only through a licensed retailer.\n\n \n Yeah a lot of good that system did with regard to Jared Lougher who passed a background check no problem. Cho Sueng Hui managed to pass four consecutive background checks before carrying out the Virginia Tech massacre. What do you have to say to that?\n \n And people like Loughner and Cho are always brought up when it comes to talking about mandating background checks at gun shows. What you never seem to understand is that these individuals managed to pass federally mandated background checks. Mandating them at gun shows wouldn't have made any difference.\n \n And what about straw purchasers? How come you never talk about them when it comes to background checks? How come the only time straw purchasers are mentioned is when it comes to gun rationing laws? Don't straw purchasers render background checks useless?\n \n \n\u0095 Improve the NICS system itself. It relies largely on data provided by the states, and many states - among them Arizona - don't provide much, especially information about people found too dangerously mentally ill to legally purchase weapons.\n\n \n There was plenty of opportunity for Loughner to be reported. How come nobody raised the red flag on him? He was thrown out of college, he never got into the army, he had run ins with the police. How come none of these people did anything about it? Were they prohibited by law from ever talking about it?\n \n \nObama wrote that he would reward states that do a good job in sharing this information; fine, but let's also consider ways to punish states that do not.\n\n \n Punish them how? What exactly would you be willing to suggest on this matter?\n \n \n\u0095 As we noted last month, the federal Bureau of Alcohol, Tobacco, Firearms and Explosives is badly underfunded. Obama should be leading the charge to get ATF into fighting shape.\n\n \n I have four words for you Brady. Program Fast and Furious.\n \n Are you willing to stand up like a man and address the issues regarding the ATF playing an integral part in the smuggling of weapons to Mexico? Do you have any words of wisdom regarding the fact that they allowed flagged individuals to buy up tens of hundreds of guns and sneak them back across the border in a blatantly criminal act?\n \n \nThe National Rifle Association says that Obama's focus as outlined in his Star article is misplaced; that he should be talking about \"criminals or mental health issues,\" not gun laws. We disagree that the two issues can be mutually exclusive.\n\n \n Actually they are very mutually exclusive. The two standards can't overlap. There are very adequate laws on the books for dealing with criminals who possess weapons in an illegal manner but they aren't enforced. The laws are already in place to address mental health issues but the program isn't being sufficiently funded to allow states to forward the necessary records. You can't expect them to comply if they don't have the money to do it.\n \n Try and tell us that with all the laws on the books there's not a single thing the government can do to address armed criminals.\n \n \nThe Obama administration last week held meetings on the issues at the U.S. Department of Justice.\n \n But media reports suggest Obama's team didn't offer a priority list of gun-control reforms. Instead, it apparently wanted only to encourage discussion from the NRA (which didn't show up), the ATF, FBI, and the Brady Campaign to Prevent Gun Violence, among others.\n\n \n Obama isn't willing to address the scandals facing the ATF. You yourself admitted that Obama supported various gun control laws. Why should the NRA bother showing up for any such meeting? Why should we the American people have to compromise our rights any further so you can pretend to address the abuse of the system by those that have no rights?\n \n \nWe understand that gun control initiatives can endanger political careers; the NRA can put millions into the pockets of candidates who agree with it.\n \n We also understand that the president would like to be re-elected in 2012 and isn't eager to endanger the careers of Democrats serving in Congress.\n \n But there's a time for leadership that sets aside calculations of political self-interest.\n \n On reforming America's gun laws, that time is now.\n VPC - The Violence Policy Center\n\n \n Well that sounds like you've got more of a problem with Obama than the National Rifle Association or anyone else.", 
   {}, 
   426280, 
   null, 
   1300803480.0
  ], 
  [
   426297, 
   null, 
   "Doc Jones", 
   "Brady \n Registered User Join Date: Feb 2005\n Posts: 338 \n \n \n Political self-interest must never trump public safety - and yet President Obama is dancing delicately around the fringes of life-and-death gun-control issues rather than facing them down. This is not leadership. \n\n \n False delimma! This requires the reader accept the lie promoted that \"public safety\" is \"trumped\" when the fact is that crime is at the lowest levels in your lifetime. Gun control was found impotent by the CDC and NAS and has nothing to do with leadership. This is a plea to accept unConstitutional control of rights which is a Marxist ploy of government control of peoples' rights.\n \n \n \n Obama's call in the Arizona Daily Star last week for better firearms enforcement fell far short of the kind of common-sense, middle-of-the-road reforms that are needed in this country - and that also, ironically, generally prevail in public opinion polls. \n\n \n False presentation! Rights are not legitimate subjects of opinion polls which vpc formerly framed in the OP. Individual, FUNDAMENTAL RIGHTS are NOT subject of any majority and asking the reader to believe that 80 million gun owners were polled is nothing short of an outright lie. Rights do not depend on polls nor opinion for their continued existence. Advocating repeal of full and free exercise of those rights reserved for the people is not subject to congressional approval either. There is no power in Article 1, section 8 that even hints at the power of Congress to control or repeal a right. This is what VPC and brady want people to believe but first you have to eat their poisoned fruit.\n \n They conveniently do not mention the fact that the ATF, the ones who supposedly \"enforce firearm laws\" were caught in a massive gun smuggling operation to Mexico drug cartels across the border committing an act of war. These are the folks VPC would have you believe are capable and trustworthy when they violate existing law under the color of law. That operation also armed drug criminals on this side of the border resulting in deaths of American Citizens and government officers both here and in Mexico.\n \n \n \n The president's exclusive offering to the Star clearly was prompted by the Jan. 8 shootings here that killed six people and injured 13 others, including Rep. Gabrielle Giffords. Yet Obama's article ignored glaring failures in our laws that abetted the Jan. 8 shooter in wreaking tragic havoc. \n\n \n Ad Hoc! ATF, the enforcers, have guaranteed that both here and Mexico more people will die every day in a short period of time of an hour or so while putting American Citizens at risk daily. As gun rights expand, just last year for example, crime here fell another 7%. Honest citizens were never the problem and never will be unless our government needs to be restored.\n \n \n \nObama argued that better enforcement of existing laws, especially the background check system; rewarding states for providing better data to back up the system; and quicker background checks must be priorities. \n\n \n Existing laws are ineffective. The DOJ in 1996 found the true meaning of the right to keep and bear arms. CDC and NAS studied all the most popular gun control laws and FOUND NO BENEFIT in any of them.\n \n \nWe agree. But the president failed to step up and insist on meat-and-potato reforms that also are imperative, including several he supported in his campaign. Among them: \n\n \n Got your vote didn't it? How much did you grabbers donate to that ? :)\n \n \n\u0095 Reinstating the expired federal ban on military-style assault weapons. \n\n \n False delimma! Crime went down when the ban expired. The Court's latest ruling says those arms in common use at the time are the ones also protected the most.\n \n \nHe's not talking about it now, but during the campaign Obama supported reimposition of the 1994 ban, which expired in 2004. We do, too; but the old ban was flawed and a new ban should be modeled on California's law, which uses a \"one-feature\" definition, banning private ownership of weapons with just one military-style feature, such as bayonet mounts, threads for silencers or flash suppressors. \n\n \n No can do! Constitutionally impermissable. What it did show was that registration lists were used by kalifornia in an attempt to scare legitimate gun owners with EX POST FACTO LAWS. Kalifornia government has proved that it is illegitimate and cannot be trusted; a very good reason to be well armed. During the LA riots, gun grabbers were begging for arms...ooooooops, forgot their feel good 7 day waiting period and were begging gun owners to 'loan or sell them one' which was against the law in kalifornia. Nah, kalifornia law sucks and is an infringement on a civil right as well as an inalienable right. So was the monicer lie \"assault rifle\" which saved lives and businesses who did have them. Trying to sell a pre emptor hoc reasoning of \"one feature\" will eventually get down to a trigger sticking down to operate the firearm. We aren't buying that commie ploy...we seen it before. Occum's Razor!\n \n \nNo legitimate gun owner needs to use a weapon such as the .50-caliber sniper rifle, which is easier to buy legally in most states than a handgun and which is highly accurate from a mile away, firing ammunition that can pierce reinforced armor such as that on airplanes and fuel tanks. \n\n \n Ad prompter hoc, False Premise. Requires the reader to accept their definition which isn't supplied, what a \"legitimate gun owner\" is. Rhetorical exaggeration and hype about a .50 caliber \"sniper weapon\" which weighs about 30 pounds(or more) and is over six feet long and \"accurate, no, HIGHLY accurate from a mile away\" depends on emotionalizing fear of power while one of Jay Leno's super fast cars which can mow down crowds of people is insignificant. How many planes have been shot with a .50 caliber with \"reinforced armor\" and why does armor need 'reinforcing' if it is armor? What airplanes boast this feature and what amount of skill would be needed to even hit one? Can you or VPC even name one incident here in the States? or is that just plain old FEAR MONGERING?\n \n \n \u0095 Reinstating a federal ban on extended-capacity magazines. \n\n \n No need to! It did not change a thing as Pietro keeps pointing out. Any full capacity magazine by due process should be available to anyone who cares for one. Right now, YOU AND VPC are trying to get the public to focus on a 30 round Glock magazine for a pistol without mentioning the true intent that todays semi auto rifle uses these full capacity magazines and you are being dishonest about your goals. These are not \"extended magazines\", these are normal capacity magazines for many guns...you have played this lie before and it didn't fly but you keep trying to get the camel's nose under the tent. A poor lie at best and a conspiracy to defraud the American People of their RIGHTS at worst. You lie!\n \n \n No one, not a woman carrying a weapon for self-defense or a hobbyist shooting at targets, needs to fire 30 shots in less than 30 seconds. There's no way to prevent all shooting rampages, but we can reduce the amount of carnage shooters are equipped to do. \n\n \n False association! There is NO LIMITATION in the Constitution. Emotionalizing a single event doesn't diminish the fact that a full capacity magazine is NOT A BENEFIT in/for self-defense. Pretending that limitation would prevent shooting rampages is a false premise and will keep you coming back for more unlawful restrictions which we will not allow. Shot anyone with your 30-06 \"sniper rifle\" yet Scot? You know you are 43 times more likely to shoot a family member or aquaintance you have told us quoting Kellerman.\n \n \n Ten rounds is the limit that would be imposed by a bill in Congress introduced by U.S. Rep. Carolyn McCarthy, a New York Democrat, and by a bill in the Arizona Legislature, introduced by Tucson Democratic Rep. Steven Farley. We support both measures. Obama should, too. \n\n \n We don't and he won't. Those pathetic creatures above are trying to get revenge on an inantimate object. How does McCarthy stand on illegal aliens now that her hubby and son got shot by one? Obama doesn't have a single thing to say about a State congress action and it isn't going anywhere. In fact, Arizona is going to start a State Guard outside the influence of anyone but the Governor and State of Arizona. How about them apples :)\n \n \n \u0095 Closing the gun-show \"loophole,\" an intentional exception to the background check law which allows criminals and other undesirable gun buyers to acquire firearms in private sales. \n\n \n Yeah, we saw how that worked with the ATF! Got any more fairy tales?\n \n \n Again, Obama is silent on this now, but he supported it during the campaign. Federal law requires that background checks be made by federally licensed gun sellers, but not by private sellers doing deals at gun shows, flea markets, garage sales or among private acquaintances. \n\n \n We didn't have that BS until President Reagan threw your mommie a bone. I guess he was suffering from AH then by that time? Strange we made it just fine with low crime until that passed and it ought to be sunsetted...and will be.\n \n \n Our view is that in order to keep firearms out of the hands of the most dangerous people, anyone who sells a gun should be required to check out the buyer through the National Instant Criminal Background Check System (NICS) system or, as in California, do the deal only through a licensed retailer. \n\n \n Unfunded mandate, Printz vs. U.S. That would be breaking the law, only federally licensed gun dealers can perform background check calls. Private property is not subject to interstate commerce laws when it is intra State and cannot be required by federal law. All I see you doing is advocating unconstitutional laws and you would have people believe you are law abiding? LOL\n \n \n \u0095 Improve the NICS system itself. It relies largely on data provided by the states, and many states - among them Arizona - don't provide much, especially information about people found too dangerously mentally ill to legally purchase weapons. \n\n \n They are following the LAW. Dangerous mentally ill should be in a hospital and not on the street. What are your and VPC doing to protect these people and society? They need help not ignoring and you want an excuse to blame 80 million, not counting women and children in the same family, to give up their rights? I do not think it skipped your realization that firearms sales have been continually rising each month and ammo sales are out the roof. Think folks are buying that to put in a dumpster?\n \n \n Obama wrote that he would reward states that do a good job in sharing this information; fine, but let's also consider ways to punish states that do not. \n\n \n YEAH, that is your MO, PUNISH STATES THAT ARE FOLLOWING CURRENT LAW. I want to see this before the next succession :)\n \n \n \u0095 As we noted last month, the federal Bureau of Alcohol, Tobacco, Firearms and Explosives is badly underfunded. Obama should be leading the charge to get ATF into fighting shape. \n\n \n They ought to be flush with Project Gunwalker and 'fast and furious'. They led the charge all right and should be disbanded....if Mexico doesn't get them first.\n \n \n The National Rifle Association says that Obama's focus as outlined in his Star article is misplaced; that he should be talking about \"criminals or mental health issues,\" not gun laws. We disagree that the two issues can be mutually exclusive. \n\n \n We do too. They are not mutually exclusive no matter how hard you try to correlate the two. One is a disease, the other is a Constitutional right. Strike 17, you are out!\n \n \n The Obama administration last week held meetings on the issues at the U.S. Department of Justice. \n\n \n I thought they were up to their necks in the ATF scandal? Don't they have more pressing duties?\n \n \n But media reports suggest Obama's team didn't offer a priority list of gun-control reforms. Instead, it apparently wanted only to encourage discussion from the NRA (which didn't show up), the ATF, FBI, and the Brady Campaign to Prevent Gun Violence, among others. \n\n \n IOW, the lopsided freak show didn't happen. LOL\n \n \n We understand that gun control initiatives can endanger political careers; the NRA can put millions into the pockets of candidates who agree with it. \n\n \n Excellent! Soros and the Joyce Foundation can't find enough oath breakers to buy off?\n \n \n We also understand that the president would like to be re-elected in 2012 and isn't eager to endanger the careers of Democrats serving in Congress. \n\n \n Shame, us \"bitter clingers\" mess up your aspirations doesn't it? What about those fake polls you mentioned about a \"majority\" agrees with you? LOL\n \n \n But there's a time for leadership that sets aside calculations of political self-interest. \n\n \n Yeah, those little dictator wars in Libya are a pain aren't they? You are admitting you do not have concensus like you stated in the OPs. Changing your tune now and want to talk about your operation :) Squeeky voices after all those bold claims but something got cut. LOL\n \n \n On reforming America's gun laws, that time is now.\n VPC - The Violence Policy Center for subversion of the Constitution \n\n \n Poorly written and dishonest propaganda. I suppose some folks will read it and pick out bits they like, you for instance, and repeat those parts over and over again disregarding the true facts. You keep going as if nothing has changed, your world has changed forever and drastically and will never again be the same. That makes me very happy :)", 
   {
    "post_info": {
     "post_title": "Pietro: I was working on a reply to scot at the same time :)"
    }
   }, 
   426292, 
   null, 
   1300810080.0
  ], 
  [
   426304, 
   null, 
   "Tither", 
   "  Second agent speaks out \n ATF allegedly encouraged U.S. gun sales to Mexican drug traffickers -- Now there's evidence other agencies knew about program\n \n But ATF wasn't working alone on the case known as \"Fast and Furious.\" Documents show ATF had conference calls with \"DHS\" (Homeland Security). \"USMS\" (U.S. Marshals) and DEA. An \"ICE,\" or Customs agent, was on ATF's Fast and Furious team. They were advised by an \"AUSA,\" or Assistant U.S. Attorney under the Justice Department.\n \n Jaquez says one of the most difficult things for him is believing that his own agency inadvertently put innocent lives at risk. Jaquez has family - uncles, aunts, father and sister - living in Mexico. \"Any one of us could have been shot with one of those guns.\" \n\n This policy is INSANE said the first agent. I have to agree.\n \n I want to speak out to say: Not in my name government! NOT IN MY NAME!", 
   {}, 
   426297, 
   null, 
   1300814220.0
  ], 
  [
   426306, 
   null, 
   "Tither", 
   "  \"Gunwalking\" scandal final straw leading to resignation of U.S. ambassador to Mexico \n Several sources close to diplomatic circles inside Mexico tell CBS News that from Mexico's viewpoint, the ATF \"gunwalking\" scandal was the final straw in a series of controversies. \n \n More recently, Mexico has demanded information from the U.S. on the ATF controversy revealed by CBS News, in which ATF agents allegedly allowed thousands of weapons to cross the border, supposedly in a failed attempt to gain intelligence to take down a major drug cartel. Some Mexican legislators have publicly said ATF agents who crafted and carried out the strategy could be extradited to Mexico and arrested. The legislators quote ATF agent John Dodson, as interviewed in our report. \n\n I couldn't agree more. What would WE demand if the reverse were true?", 
   {}, 
   426304, 
   null, 
   1300814580.0
  ], 
  [
   426308, 
   null, 
   "Doc Jones", 
   "It's been more than two months since the tragedy in Tucson stunned the nation. It was a moment when we came together as one people to mourn and to pray for those we lost. And in the attack's turbulent wake, Americans by and large rightly refrained from finger-pointing, assigning blame or playing politics with other people's pain.\n \n But one clear and terrible fact remains. A man our Army rejected as unfit for service; a man one of our colleges deemed too unstable for studies; a man apparently bent on violence, was able to walk into a store and buy a gun.\n \n He used it to murder six people and wound 13 others. And if not for the heroism of bystanders and a brilliant surgical team, it would have been far worse.\n \n But since that day, we have lost perhaps another 2,000 members of our American family to gun violence. Thousands more have been wounded. We lose the same number of young people to guns every day and a half as we did at Columbine, and every four days as we did at Virginia Tech.\n \n Every single day, America is robbed of more futures. It has awful consequences for our society. And as a society, we have a responsibility to do everything we can to put a stop to it.\n \n Now, like the majority of Americans, I believe that the Second Amendment guarantees an individual right to bear arms. And the courts have settled that as the law of the land. In this country, we have a strong tradition of gun ownership that's handed from generation to generation. Hunting and shooting are part of our national heritage. And, in fact, my administration has not curtailed the rights of gun owners - it has expanded them, including allowing people to carry their guns in national parks and wildlife refuges.\n \n The fact is, almost all gun owners in America are highly responsible. They're our friends and neighbors. They buy their guns legally and use them safely, whether for hunting or target shooting, collection or protection. And that's something that gun-safety advocates need to accept. Likewise, advocates for gun owners should accept the awful reality that gun violence affects Americans everywhere, whether on the streets of Chicago or at a supermarket in Tucson.\n \n I know that every time we try to talk about guns, it can reinforce stark divides. People shout at one another, which makes it impossible to listen. We mire ourselves in stalemate, which makes it impossible to get to where we need to go as a country.\n \n However, I believe that if common sense prevails, we can get beyond wedge issues and stale political debates to find a sensible, intelligent way to make the United States of America a safer, stronger place.\n \n I'm willing to bet that responsible, law-abiding gun owners agree that we should be able to keep an irresponsible, law-breaking few - dangerous criminals and fugitives, for example - from getting their hands on a gun in the first place.\n \n I'm willing to bet they don't think that using a gun and using common sense are incompatible ideas - that we should check someone's criminal record before he can check out at a gun seller; that an unbalanced man shouldn't be able to buy a gun so easily; that there's room for us to have reasonable laws that uphold liberty, ensure citizen safety and are fully compatible with a robust Second Amendment.\n \n That's why our focus right now should be on sound and effective steps that will actually keep those irresponsible, law-breaking few from getting their hands on a gun in the first place.\n \n \u0095 First, we should begin by enforcing laws that are already on the books. The National Instant Criminal Background Check System is the filter that's supposed to stop the wrong people from getting their hands on a gun. Bipartisan legislation four years ago was supposed to strengthen this system, but it hasn't been properly implemented. It relies on data supplied by states - but that data is often incomplete and inadequate. We must do better.\n \n \u0095 Second, we should in fact reward the states that provide the best data - and therefore do the most to protect our citizens.\n \n \u0095 Third, we should make the system faster and nimbler. We should provide an instant, accurate, comprehensive and consistent system for background checks to sellers who want to do the right thing, and make sure that criminals can't escape it.\n \n Porous background checks are bad for police officers, for law-abiding citizens and for the sellers themselves. If we're serious about keeping guns away from someone who's made up his mind to kill, then we can't allow a situation where a responsible seller denies him a weapon at one store, but he effortlessly buys the same gun someplace else.\n \n Clearly, there's more we can do to prevent gun violence. But I want this to at least be the beginning of a new discussion on how we can keep America safe for all our people.\n \n I know some aren't interested in participating. Some will say that anything short of the most sweeping anti-gun legislation is a capitulation to the gun lobby. Others will predictably cast any discussion as the opening salvo in a wild-eyed scheme to take away everybody's guns. And such hyperbole will become the fodder for overheated fundraising letters.\n \n But I have more faith in the American people than that. Most gun-control advocates know that most gun owners are responsible citizens. Most gun owners know that the word \"commonsense\" isn't a code word for \"confiscation.\" And none of us should be willing to remain passive in the face of violence or resigned to watching helplessly as another rampage unfolds on television.\n \n As long as those whose lives are shattered by gun violence don't get to look away and move on, neither can we.\n \n We owe the victims of the tragedy in Tucson and the countless unheralded tragedies each year nothing less than our best efforts - to seek consensus, to prevent future bloodshed, to forge a nation worthy of our children's futures.\n \n President Obama: We must seek agreement on gun reforms\n\n \n You ought to be more concerned about earthquakes and tsunamis! ...or maybe falling stars...or your mental health. emoticon_xagree", 
   {}, 
   425918, 
   null, 
   1300819020.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Obama Aims in the Wrong Direction on Gun Control", 
  "url": "http://www.4forums.com/political/gun-control-debates/15172-obama-aims-wrong-direction-gun-control.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15172, 
  "discussion_files": [
   [
    "2233.html", 
    "http://www.4forums.com/political/gun-control-debates/15172-obama-aims-wrong-direction-gun-control-print.html"
   ]
  ], 
  "identifier": 15172
 }
]