[
 [
  [
   426449, 
   null, 
   "Enlightened One", 
   "More and more employers are conducting criminal background checks of job applicants. Those with convictions are often automatically excluded from being hired. This practice has a more negative effect on blacks and hispanics than whites because people in those groups are more likely to have done time in prison. So the practice is discriminatory and is a violation of the Civil Rights Act. This also creates a vicious cycle. Because they can't get jobs they are forced back into a life a crime which makes it even less likely that they'll get jobs in the future. With their husbands, brothers, sons in prison it becomes tougher for families to make ends meet in these minority groups and thus children are often forced into a life of crime also. The cycle of poverty, despair, and crime continues. America should try to rehabilitate their criminals. Locking people up doesn't accomplish anything.", 
   {
    "post_info": {
     "post_title": "Employers Conducting Criminal Background Checks"
    }
   }, 
   null, 
   null, 
   1301086980.0
  ], 
  [
   426463, 
   null, 
   "daewoo", 
   "More and more employers are conducting criminal background checks of job applicants. Those with convictions are often automatically excluded from being hired. This practice has a more negative effect on blacks and hispanics than whites because people in those groups are more likely to have done time in prison. So the practice is discriminatory and is a violation of the Civil Rights Act. This also creates a vicious cycle. Because they can't get jobs they are forced back into a life a crime which makes it even less likely that they'll get jobs in the future. With their husbands, brothers, sons in prison it becomes tougher for families to make ends meet in these minority groups and thus children are often forced into a life of crime also. The cycle of poverty, despair, and crime continues. America should try to rehabilitate their criminals. Locking people up doesn't accomplish anything.\n\n \n First, not a violation of the civil rights act because it is based on personal attributes of the individual. If things were done the way you indicate here, requiring a college degree for a job would likewise be a violation of the civil rights act since fewer blacks and Hispanics have college degrees. \n \n I also dont think that your argument supports the conclusion that \"locking people up does not accomplish anything\". \n \n I personally believe that once a persons sentence has been carried out the record of their conviction should be sealed. For most of the nations history you could get out of jail, move to a new area, and start your life over. Today technology makes that extremely difficult. In our system you are supposed to be tried for crimes, serve your sentence, then it is over. The ability for any employer to turn around get a persons complete criminal record pretty much insures that the individual will not just do their punishment and move on with their life, it spreads the punishment over the rest of their lives.", 
   {}, 
   426449, 
   null, 
   1301108760.0
  ], 
  [
   426497, 
   null, 
   "PottersvilleUSA", 
   "The combination of credit checks and criminal background checks make it harder and harder to get a job in an already (intentionally) difficult economy. What's especially bogus about this is that people can have \"criminal backgrounds for merely exercising their constitutional rights. For example people are often arrested on trumped up charges for participating in legal permitted protests and demonstrations. This is very much intentional as well. Make people terrified of exercising their rights because it'll so damage their lives, and in essence they don't actually have those rights at all.", 
   {
    "post_info": {
     "post_title": "Harder 'n' harder to get a job"
    }
   }, 
   426449, 
   null, 
   1301186820.0
  ], 
  [
   426499, 
   null, 
   "Galileo", 
   "Looks like there have already been civil rights lawsuits because of this:\n \n \"Because discriminating against those with criminal records disproportionately hurts African Americans, the practice may violate the Civil Rights Act, which prohibits race-based hiring discrimination. Indeed, the Equal Employment Opportunity Commission (EEOC) has said that although considering an applicant's criminal record may be acceptable on a case-by-case basis, an 'absolute bar to employment' for such people is illegal.\n \n \"Last year, plaintiffs brought at least five major civil rights lawsuits against large employers on the issue, but the National Employment Law Project wants the EEOC to enforce the law more vigorously. A spokeswoman for the agency did not immediately respond to a request for comment from The Lookout.\"\n Help wanted &#8212; sixty-five million need not apply - Yahoo! News", 
   {}, 
   426497, 
   null, 
   1301189220.0
  ], 
  [
   426507, 
   null, 
   "daewoo", 
   "Looks like there have already been civil rights lawsuits because of this:\n \n \"Because discriminating against those with criminal records disproportionately hurts African Americans, the practice may violate the Civil Rights Act, which prohibits race-based hiring discrimination. Indeed, the Equal Employment Opportunity Commission (EEOC) has said that although considering an applicant's criminal record may be acceptable on a case-by-case basis, an 'absolute bar to employment' for such people is illegal.\n \n \"Last year, plaintiffs brought at least five major civil rights lawsuits against large employers on the issue, but the National Employment Law Project wants the EEOC to enforce the law more vigorously. A spokeswoman for the agency did not immediately respond to a request for comment from The Lookout.\"\n Help wanted - sixty-five million need not apply - Yahoo! News\n\n \n The EEOC has brought 2 lawsuits against companies for this. Both were dismissed. They have made the same argument when is comes to using credit checks for pre employment screening (another idiotic practice) and despite the fact that courts have consistently ruled against them, they continue to \"warn\" employers about the illegality of the practice...when in fact there is nothing illegal about it. \n \n Frankly the EEOCs take on the civil rights act is ludicrous and they have been repeatedly beat down by the courts. As long as an employer uses uniform hiring practices that are not specifically designed to discriminate against a protected group, they are in the clear. \n \n IMO this is more or less as it should be. If I want to fire somebody because they smell funny, that should be my right as an employer. The civil rights laws were drafted to level the playing field, not to make employers work to give certain groups advantages. A policy that says \"we only hire high school graduates\" may have a greater impact on minority applicants, but it is not an unfair impact and it is certainly not a policy designed to discriminate against them.\n \n Frankly I think the EEOC should be a little more honest in their assessments. It is often a real eye opened to people who have been fired to discover that no...their job was not protected by the government and that in most states the fish in the aquarium in the lobby have more protections than the employees. If your boss wants to fire you because you are stupid, lazy, unproductive, ugly, or because he just plain does not like you, that is entirely acceptable and unless there are state laws in place preventing it, you have no recourse. As long as you are not fired for being too old, too black, to jewish, too gay, or too female, there is no recourse against the company at a federal level.", 
   {
    "unicode_changes_made": true
   }, 
   426499, 
   null, 
   1301203860.0
  ], 
  [
   426994, 
   null, 
   "Freedom", 
   "More and more employers are conducting criminal background checks of job applicants. Those with convictions are often automatically excluded from being hired. This practice has a more negative effect on blacks and hispanics than whites because people in those groups are more likely to have done time in prison. So the practice is discriminatory and is a violation of the Civil Rights Act. This also creates a vicious cycle. Because they can't get jobs they are forced back into a life a crime which makes it even less likely that they'll get jobs in the future. With their husbands, brothers, sons in prison it becomes tougher for families to make ends meet in these minority groups and thus children are often forced into a life of crime also. The cycle of poverty, despair, and crime continues. America should try to rehabilitate their criminals. Locking people up doesn't accomplish anything.\n\n I see you have not made any effort to correct your racism since the last time I admonished you for it.\n \n This kind of statistical equivocation is really quite pathetic even without the racist overtones of your post.\n \n What about this one \"Most rich people are white, so taxing the rich is racism and against the civil rights act\"?", 
   {}, 
   426449, 
   null, 
   1302108120.0
  ], 
  [
   428583, 
   null, 
   "Charlie_XT", 
   "More and more employers are conducting criminal background checks of job applicants. Those with convictions are often automatically excluded from being hired. This practice has a more negative effect on blacks and hispanics than whites because people in those groups are more likely to have done time in prison. So the practice is discriminatory and is a violation of the Civil Rights Act. This also creates a vicious cycle. Because they can't get jobs they are forced back into a life a crime which makes it even less likely that they'll get jobs in the future. With their husbands, brothers, sons in prison it becomes tougher for families to make ends meet in these minority groups and thus children are often forced into a life of crime also. The cycle of poverty, despair, and crime continues. America should try to rehabilitate their criminals. Locking people up doesn't accomplish anything.\n\n \n I disagree with the suggestion that criminal background checks are discriminatory because blacks and hispanics are more likely than whites to have criminal histories. Deciding to commit a crime is a malicious and deliberate act, not something that just happens for no reason. If you rob a convenience store clerk by pointing a gun in their face and threatening to kill them then you decided that such actions were what you wanted to do. The same goes with possession of drugs like cocaine and marijuana. You made the decision knowing their could be consequences, and if you didn't know what could happen then you very well should have.", 
   {}, 
   426449, 
   null, 
   1304055720.0
  ], 
  [
   433039, 
   null, 
   "hwyangel", 
   "I'm a truck driver. Sometimes I haul your mail. Sometimes I pull an 80,000 lb, 83ft, truck full of hazardous material at 70 mph on the public interstate. Today it's a load of hewitt packard computers and printers. The next time you think of your teenager cutting me off or riding in my no zone, or your counting on your paycheck to be there on time. You feel safe knowing that I have my background checked and monitored and I'm random drug tested regularly. Your Welcome.", 
   {}, 
   428583, 
   null, 
   1308943380.0
  ], 
  [
   433051, 
   null, 
   "snakespit", 
   "More and more employers are conducting criminal background checks of job applicants. Those with convictions are often automatically excluded from being hired. This practice has a more negative effect on blacks and hispanics than whites because people in those groups are more likely to have done time in prison. So the practice is discriminatory and is a violation of the Civil Rights Act. This also creates a vicious cycle. Because they can't get jobs they are forced back into a life a crime which makes it even less likely that they'll get jobs in the future. With their husbands, brothers, sons in prison it becomes tougher for families to make ends meet in these minority groups and thus children are often forced into a life of crime also. The cycle of poverty, despair, and crime continues. America should try to rehabilitate their criminals. Locking people up doesn't accomplish anything.\n\n \n Blaming society for the actions of an individual is one more symptom of the growing lack of personal responsibility in this country. Don't want a criminal record...don't commit a crime. All of your \"can't get a job vicious cycle\" BS stems from the fact that the individual has first commited a crime. The solution: take personal responsibility for yourself, keep yourself out of jail, and rise above any barriers that are in your way. It used to be called the American dream...too bad nobody remembers it.", 
   {}, 
   426449, 
   null, 
   1308951480.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Employers Conducting Criminal Background Checks", 
  "url": "http://www.4forums.com/political/civil-rights-debates/15218-employers-conducting-criminal-background-checks.html", 
  "breadcrumbs": [
   "Civil Rights"
  ], 
  "id_number": 15218, 
  "discussion_files": [
   [
    "7216.html", 
    "http://www.4forums.com/political/civil-rights-debates/15218-employers-conducting-criminal-background-checks-print.html"
   ]
  ], 
  "identifier": 15218
 }
]