[
 [
  [
   426563, 
   null, 
   "NATO 556", 
   "http://blog.nj.com/njv_editorial_page/2011/03/in_this_case_a_well-earned_gun.html\n \n \nEven the staunchest proponents of gun control must admit Jeffrey Muller has a good reason for wanting to pack a handgun.\n \n This is the astoundingly unlucky pet store owner from Sussex County, who authorities said happened to have the exact same name as the intended target of five thugs from Missouri. They had believed him to be a different Jeffrey Muller, a New York power broker who had swindled them out of $500,000, so they grabbed the wrong man in an abduction last year.\n \n Muller, owner of J&G Pet Foods in Newton, was assaulted, zapped with a stun gun and kidnapped. Blindfolded in a sock hat, he was driven all the way from New Jersey to Lake Ozark, Mo. under death threats, until he finally managed to escape.\n \n Now, lo and behold, the man feels unsafe. He wants a gun permit, because he fears avenging family members of the arrested kidnappers may attack him again. But a Superior Court judge in Morristown this week denied his second request for the permit, saying he provided \"no proof of justifiable need\" to carry a weapon.\n \n Come again? This guy has more reason than anyone to take advantage of his Second Amendment rights. For God's sake, give this poor Muller his gun. \n\n \n So apparently in New Jersey if you're kidnapped and your life is threatened, that's still not seen as sufficient need to get a concealed carry permit. Doesn't sound the least bit reasonable to me.", 
   {
    "post_info": {
     "post_title": "In this case, a well-earned gun permit"
    }, 
    "unicode_changes_made": true
   }, 
   null, 
   null, 
   1301340360.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  In this case, a well-earned gun permit", 
  "url": "http://www.4forums.com/political/gun-control-debates/15225-case-well-earned-gun-permit.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15225, 
  "discussion_files": [
   [
    "28847.html", 
    "http://www.4forums.com/political/gun-control-debates/15225-case-well-earned-gun-permit-print.html"
   ]
  ], 
  "identifier": 15225
 }
]