[
 [
  [
   426543, 
   null, 
   "Galileo", 
   "\"Lott now accuses me of misquoting what he wrote in a March 18 Big Government post. In fact, I quoted Lott accurately, but someone subsequently altered his Big Government post, making it appear that I was wrong...\n \n \"Sure enough, Lott's March 18 Big Government piece now reads, 'They have also tried imposing much more extensive reporting requirements on sales of long guns.' That's what it says today, anyway. But that's not what it said when the article was published. Here's a screen shot showing how the article appeared on March 22 when I wrote the criticism:\"\n John Lott&#39;s Mysteriously Changing Blog Post | Media Matters for America\n \n So it appears that Lott deliberately altered a blog post to make it appear that someone was misquoting him....", 
   {
    "post_info": {
     "post_title": "John Lott Busted Again?"
    }
   }, 
   null, 
   null, 
   1301303100.0
  ], 
  [
   426546, 
   null, 
   "Doc Jones", 
   "\"Lott now accuses me of misquoting what he wrote in a March 18 Big Government post. In fact, I quoted Lott accurately, but someone subsequently altered his Big Government post, making it appear that I was wrong...\n \n \"Sure enough, Lott's March 18 Big Government piece now reads, 'They have also tried imposing much more extensive reporting requirements on sales of long guns.' That's what it says today, anyway. But that's not what it said when the article was published. Here's a screen shot showing how the article appeared on March 22 when I wrote the criticism:\"\n John Lott's Mysteriously Changing Blog Post | Media Matters for America\n \n So it appears that Lott deliberately altered a blog post to make it appear that someone was misquoting him....\n\n \n You sound suspiciously like Tim Lambert.\n \n Exactly what did Professor Lott say that is NOT FACTUAL?\n \n Obama banned re-imports of M1Garands and .30 carbines from Korea, S. Korea to be exact that have been on loan to them since the Korean War in the 1950s.\n \n ATF tried to create a situation by smuggling guns to Mexico and violating a foreign nation's sovereignty to up their claim of \"guns flowing to Mexico like an iron river\"; that got 2 American agents killed and they got caught meanwhile trying to publish a fiat demand in the Congressional Record that would record the sale of 5 or more rifles a week to a single person. The opposition did not come from the administration, it came from the defenders of the 2A and XIVth Amendment of civil rights. Presently he is in the process of attempting to ban import of the Saiga shotgun in particular and any other imports 'if he can'.\n \n He may get sidetracked on commercials questioning his eligibility :) I find it strange the author is not interested in other affairs of State such as the drive to the socialist U.N. SAAMI and Libya and the Japanese nuclear incident. \n \n I see no conflict in either article posted although the author seems to think there is an issue in his linked statements; I notice the complainer does not link to the truth which is a lot like you and never posts under his real name. Is that a typical antipodean trait which cannot see the mote in his own eye but can spot a speck of dust in another? \n \n Meanwhile, a question awaits you gun grabbers on the high capacity magazine claim which you have not proven. Was that just yet another bald faced LIE? emoticon_xbouncer", 
   {}, 
   426543, 
   null, 
   1301318580.0
  ], 
  [
   426548, 
   null, 
   "Doc Jones", 
   "large gun magazines, which would almost certainly have saved lives on that January day in Tucson\n That extended capacity magazine that he used caused a jam after the 31st round, which enable him to be jumped as he was clearing the jam. If he had used standard capacity magazines he could have reloaded in less than two seconds. The VT killer and the Luby's killer both reloaded several times. E.J. stupidly thinks that once the magazine is empty that the shooter is done.\n \n \"I know that the NRA believes people should be unimpeded and unregulated on gun ownership. I disagree.\"\n It is sad that Obama said that, because it isn't so. The NRA help craft the current NICS system and supports it being made more effective. The NRA supports keeping guns out of the hands of criminals, mentally unfit, and other undesirable categories.\n \n Assault weapons are not for hunting,\" Obama said in 2004. \"They are the weapons of choice for gang-bangers, drug dealers and terrorists.\"\n Again sad that Obama said that. AR-15 pattern guns in more powerful hunting calibers are popular with hunters. Gang-bangers, and such don't really care for so-called assault weapons because they are too big to easily conceal. In fact more people are killed by hands & feet than by so-called assault weapons.\n \n They are not seeking \"sweeping anti-gun legislation.\" \n Total bs. That is exactly what they are seeking. We have seen the legislation that that were going to try for after the '94 AWB. We have seen H.R. 1022.\n \n restoring the highly effective ban on assault weapons\n It was completely ineffective. The only thing that got banned was some cosmetic features on some guns. The gun makers simply changed the cosmetics to comply with the new law and continued to sell the same guns. The gun-banners went nuts screaming that the gun makers, by complying with the letter of the law exactly, were in fact evading the law.\n \n Neither is the NRA a bunch of bullies. They are an organization of voluntary members who have united for the purpose of protecting their 2nd Amendment rights. Being effective in that exercise of democracy is not being a bully. In election after election voters have spoken and they have spoken against greater gun control and for expanded rights for gun owners.\n \n BTW - Obama's expansion of gun rights was only as a rider to a must-pass credit card reform bill. To get the reform he had to accept the guns in parks. Now he is trying to crow about it.\n - Johnson\n \n Besides what I already mentioned emoticon_xagree", 
   {
    "post_info": {
     "post_title": "Want to defend the liberal, progressive/socialist commie statements  star gazer?"
    }
   }, 
   426546, 
   null, 
   1301321940.0
  ], 
  [
   426551, 
   null, 
   "Tither", 
   "Anti-gun George Soro's bought and paid for org. Media Matters.\n \n I'm just saying! emoticon_smile", 
   {}, 
   426548, 
   null, 
   1301333940.0
  ], 
  [
   426592, 
   null, 
   "Galileo", 
   "\"John Lott first attracted notoriety with a pro-gun-ownership study nobody else could duplicate; his original data, he said, was destroyed by a hard disk crash. In the furious discussion that followed, one frequent contributor to discussion boards, ardently defending Lott, was someone named Mary Rosh, who claimed to have been Lott's student and glowed with praise for his teaching.\n \n \"It eventually transpired that Mary Rosh was a pseudonym; her actual name was ... John Lott.\n \n \"So now Lott has gone on the warpath against Chris Brown of Media Matters, accusing Brown of misquoting and misrepresenting a blog entry. And sure enough, the quote in Media Matters doesn't match what the post says ... now. However, Brown saved a screenshot of what it originally said, which matches his quote.\n \n \"So, it appears that Lott retroactively tried to put his original statement down the memory hole, then accused a critic of wronging him by quoting what he originally said. Now, that's scholarship! If Cronon exhibited that kind of diligence, he wouldn't be under attack.\"\n Researchers Republicans Like - NYTimes.com", 
   {
    "unicode_changes_made": true
   }, 
   426551, 
   null, 
   1301364480.0
  ], 
  [
   426599, 
   null, 
   "Brady", 
   "Beth Martin it's pretty funny how john lott fudged what a \"semiautomatic gun\" is considering the fact that gun activists love playing \"gotcha\" whenever an average citizen confuses a semi automatic with an automatic. it's one of the gun folks' favorite ways to try and intimidate the public into silence.\n Violence Policy Center | Facebook", 
   {}, 
   426592, 
   null, 
   1301379480.0
  ], 
  [
   426605, 
   null, 
   "Tither", 
   "I personally think it is funny how you guys think this is a news worthy item! emoticon_smile As I have always said, if you want to tick off an Anti-gunner, just say the words John Lott! \n \n As to beth martin, I didn't understand what she was trying to say. Semi Autos are not machineguns.", 
   {}, 
   426599, 
   null, 
   1301394780.0
  ], 
  [
   426609, 
   null, 
   "Doc Jones", 
   "\"John Lott first attracted notoriety with a pro-gun-ownership study nobody else could duplicate; his original data, he said, was destroyed by a hard disk crash. In the furious discussion that followed, one frequent contributor to discussion boards, ardently defending Lott, was someone named Mary Rosh, who claimed to have been Lott's student and glowed with praise for his teaching.\n \n \"It eventually transpired that Mary Rosh was a pseudonym; her actual name was ... John Lott.\n \n \"So now Lott has gone on the warpath against Chris Brown of Media Matters, accusing Brown of misquoting and misrepresenting a blog entry. And sure enough, the quote in Media Matters doesn't match what the post says ... now. However, Brown saved a screenshot of what it originally said, which matches his quote.\n \n \"So, it appears that Lott retroactively tried to put his original statement down the memory hole, then accused a critic of wronging him by quoting what he originally said. Now, that's scholarship! If Cronon exhibited that kind of diligence, he wouldn't be under attack.\"\n Researchers Republicans Like - NYTimes.com\n\n \n I see no indiscrepancy in either article and indeed NONE IS POINTED OUT. There is an unproven claim made that somehow this 60 year old \"progressive\" somehow \"busted\" something...must have been his britches emoticon_xgood emoticon_xhoho\n \n I demand an explanation for your adherance to criminals and criminal organizations for you pseudo info on any topic.\n \n http://www.wnd.com/index.php?fa=PAGE.view&pageId=280401\n \n Media Matters breaking law in war on Fox News.\n \n Aren't they the same as Common Purpose trying to start a revolution in foreign countries as well as here?\n Common Purpose - Stop Common Purpose - Communitarian - NWO Agenda 21\n \n Funded by a convicted felon and you are stuck like glue.", 
   {
    "unicode_changes_made": true
   }, 
   426592, 
   null, 
   1301409060.0
  ], 
  [
   426617, 
   null, 
   "Tither", 
   "Instead of complaining about something worthless, complain about this new article that John Lott wrote. emoticon_smile\n \n   What's Really Behind Obama's New Push for Gun Control? \n Obama claimed in his op-ed: &#8220;My administration has not curtailed the rights of gun owners, it has expanded them, including allowing people to carry their guns in national parks and wildlife refuges.&#8221; But he conveniently forgot to mention that he never initiated or supported this legislation. Instead, it was forced upon Obama by a large majority of Congress passing an amendment to a bill that he wanted passed, the &#8220;Cardholders&#8217; Bill of Rights Act of 2009.&#8221; Just because Obama wasn&#8217;t willing to veto a bill he wanted hardly shows support for the right to self-defense. \n \n Indeed, Obama has been a consistent opponent of gun ownership. He enacted a ban on the importation of semiautomatic guns because, &#8220;The U.S. insisted that imports of the aging rifles could cause problems such as firearm accidents.&#8221; He has proposed much more extensive reporting requirements on sales of long guns. Obama&#8217;s nomination of anti-gun Andrew Traver to head the Bureau of Alcohol, Tobacco, Firearms, and Explosives threatens imposing many new regulations. Still further, the Obama administration has actively pushed for the U.N.&#8217;s Arms Trade Treaty and continues to make inaccurate statements about the source of Mexico&#8217;s crime guns. \n \n And look at the judges President Obama nominated to the Supreme Court. Both Sonia Sotomayor and Elena Kagan have proven themselves to be adamantly against any protection for individual ownership of guns. The stark reality is if Justices Alito, Scalia, Roberts, Thomas, or Kennedy were to die or retire, the two precedents set in both the Washington, D.C. and Chicago gun bans would be threatened as these were narrow 5 to 4 decisions.\n", 
   {}, 
   426609, 
   null, 
   1301416560.0
  ], 
  [
   426619, 
   null, 
   "Tither", 
   "New Video with John Lott. Judge for yourselves if what the ants are saying about him it true. 28 min, but you can get a good imporession quickly. \n \n This is why the Antis HATE John Lott! Video here==<  John Lott on America's Gun Laws \n \n \n \n \n Police are the single most important factor in reducing crime. \n Now Paraphrasing: But in addition to that.emoticon_smile", 
   {
    "unicode_changes_made": true
   }, 
   426617, 
   null, 
   1301418360.0
  ], 
  [
   426622, 
   null, 
   "Pietro", 
   "There's a great deal of controversy surrounding John Lott and his findings. In fact there's so much controversy I don't even know where to begin addressing it to get straight to the facts. I'm not even sure I'm qualified to try.\n \n But I do know one thing for certain. That the basic premise of John Lott's work -legal gun ownership saves more lives than illicit use takes- has never been successfully debunked and proven incorrect. Various groups have been unable to show that the criminal use of firearms leads to more deaths than the number of lives that are saved by private and legal gun ownership. The case has never been successfully made. It can be attempted but the data used is incredibly biased and looked exclusively at body counts and doesn't factor in the number of incidents where a gun is never discharged.\n \n Various gun control groups have been incapable of proving that gun ownership kills more innocent victims than it saves. Even if they could by some miracle prove such a position was correct it would be irrelevant, because gun ownership is protected by the constitution just as free speech, and free speech has been the root cause of a great number of deaths and destruction of private property.\n \n Constitutional protections don't have to meet some undetermined quota of good deeds in order to be protected from government infringement. The numbers game applies to government granted privileges.", 
   {}, 
   426619, 
   null, 
   1301421720.0
  ], 
  [
   426623, 
   null, 
   "Doc Jones", 
   "=Brady;426599]Beth Martin it's pretty funny how john lott fudged what a \"semiautomatic gun\" is considering the fact that gun activists love playing \"gotcha\" whenever an average citizen confuses a semi automatic with an automatic. it's one of the gun folks' favorite ways to try and intimidate the public into silence.\n\n \n Since 1986 the anti gun, anti Constitution .orgs have went to great lengths and lies to confuse the public that \"anything they may resemble a machine gun is a machine gun\". I posted Sen. Rangel's ramming the anti gun bill through speaker of the House, Rostenkowski who ended up in prison and Rangel is now following. You are next :)\n \n An automatic is NOT A MACHINE GUN, it is a semi- auto and the term machine gun is used to describe a machine gun and trying to use other terminology as the anti patriots do is not only deceptive and dishonest, it is intentional. When the public learns the truth and realized they have been mislead and lied to they shut up because they don't want to be uneducated liars like the brady bunch and VPC. \n \n That is one reason your membership keeps dropping and the brady bunch is having to band with the VPC now just to keep a small dwindling membership. emoticon_xclown\n \n Hey brady, what happened to your \"5 year plan\"? na, ha, ha ha ha", 
   {}, 
   426599, 
   null, 
   1301422020.0
  ], 
  [
   426637, 
   null, 
   "Galileo", 
   "There's a great deal of controversy surrounding John Lott and his findings. In fact there's so much controversy I don't even know where to begin addressing it to get straight to the facts. I'm not even sure I'm qualified to try.\n \n But I do know one thing for certain. That the basic premise of John Lott's work -legal gun ownership saves more lives than illicit use takes- has never been successfully debunked and proven incorrect. Various groups have been unable to show that the criminal use of firearms leads to more deaths than the number of lives that are saved by private and legal gun ownership. The case has never been successfully made. It can be attempted but the data used is incredibly biased and looked exclusively at body counts and doesn't factor in the number of incidents where a gun is never discharged.\n\n You don't seem very well acquainted with Lott's work. His basis premise was that concealed carry reduces crime. Then you go on and make an error in logic when speaking of other studies. Just because a study examines body counts doesn't mean that \"incidents where a gun is never discharged' are not factored in. If there is a net protective benefit due to guns being used often in successful self defense (even if the gun isn't discharged) you would expect the body count to be lower. \n \n \nVarious gun control groups have been incapable of proving that gun ownership kills more innocent victims than it saves. Even if they could by some miracle prove such a position was correct it would be irrelevant, because gun ownership is protected by the constitution just as free speech, and free speech has been the root cause of a great number of deaths and destruction of private property.\n \n Constitutional protections don't have to meet some undetermined quota of good deeds in order to be protected from government infringement. The numbers game applies to government granted privileges.\n\n People that say that gun ownership is protected by the Constitution seem quite willing to make exceptions for the gun control laws they happen to favor.", 
   {}, 
   426622, 
   null, 
   1301442180.0
  ], 
  [
   426666, 
   null, 
   "Doc Jones", 
   "=Galileo;426637]You don't seem very well acquainted with Lott's work. His basis premise was that concealed carry reduces crime. Then you go on and make an error in logic when speaking of other studies. Just because a study examines body counts doesn't mean that \"incidents where a gun is never discharged' are not factored in.\n \n \n The only one you quote and depend on for your ad hoc arguement is Athur Kellerman and the only thing he counted was dead bodies and says so. You have dismissed out of hand any other study. You just trying to give us another belly laugh? emoticon_xchicken\n \n \nIf there is a net protective benefit due to guns being used often in successful self defense (even if the gun isn't discharged) you would expect the body count to be lower.\n \n \n Lower than what? The homocide and violent crime is the lowest it has been since before the '68 gun control act; if there wasn't a \"net protective benefit from guns used in self-defense you would expect the body count would be higher. You got your wires crossed again in an ad absurdum reasoning.\n \n \nPeople that say that gun ownership is protected by the Constitution seem quite willing to make exceptions for the gun control laws they happen to favor.\n\n \n Which ones would that be? The ATF smuggling guns to Mexico? You gun snatchers seemed to like that because it might make your 90% lie come true.\n You don't accept the fact that gun ownership is protected by the Constitution? Want to tell us about the demonstrations and calls to have Aussie guns and rights restored? You keep you Nations confused quite a bit.\n \n MORE GUNS = LESS CRIME - Dr. John Lott", 
   {}, 
   426637, 
   null, 
   1301489340.0
  ], 
  [
   426825, 
   null, 
   "Doc Jones", 
   "Beth Martin it's pretty funny how john lott fudged what a \"semiautomatic gun\" is considering the fact that gun activists love playing \"gotcha\" whenever an average citizen confuses a semi automatic with an automatic. it's one of the gun folks' favorite ways to try and intimidate the public into silence.\n Violence Policy Center | Facebook\n\n \n Even honest pundits picked up on the hypocrisy that Obama's wanna be head of the ATF, Traver, has tried to sell as Chicago's anti gun/anti Constitutional policies drove crime and murder through the roof. Your accusation on the nomenclature of guns are archived and documented and I am not buying what you are trying to sell, another lie, when you and your anti Patriot buddies are deliberately trying to deceive folks who know no difference.\n \n Stop ATF's Anti-Gun Zealots - Page 1 - Michelle Malkin - Townhall Conservative\n \n \nFor 30 years, Chicago banned handguns. The crime rate skyrocketed. Murders soared. Gangs blossomed. Desperate city officials even considered calling the National Guard to combat the out-of-control violence that all the \"community organizing\" in the world couldn't curb. The Supreme Court struck down Chicago's individual firearms ownership prohibition last year, but the same anti-gun zealots who put Windy City citizens' lives at risk remain in power.\n \n And now one of them may soon be in charge of the scandal-plagued Bureau of Alcohol, Tobacco, Firearms and Explosives.\n \n Meet Andrew Traver. He's President Obama's nominee to head ATF. The Senate Judiciary Committee refused to act on the original nomination last fall. His name was sent up again earlier this year, and a hearing has yet to be scheduled. Obama's czar-happy habits should be a red flag on a possible recess appointment. (snip)\n \n Grassroots Second Amendment groups across the country (not to mention rank-and-file ATF agents) have raised their voices in opposition.\n \n Traver allied with the progressive Joyce Foundation to lobby for tighter federal restrictions of Second Amendment freedoms. He supports curtailing access to ATF databases and opposes privacy protections for gun-owners. He has also compared automatic black-market weapons to legal semi-automatic assault weapons.\n As the National Rifle Association points out, Traver misled the public in a fear-mongering appearance on a Chicago NBC affiliate TV news show. In the interview, he hyped \"the growing frequency of gang members and drug dealers using heavy caliber military-type weapons\" and described them as if they were machine guns: \"Pull the trigger and you can mow people down.\" Traver and his agents \"provided the reporter with a fully automatic AK-47, with which she was unable to hit the target,\" the NRA reported. \"He then said that stray bullets are 'one of the main problems with having stuff like this available to the gangs.'\"\n Except for the fact, contradicting the implication of the NBC scare story and Traver's rhetoric, that fully automatic firearms are not available for sale through normal retail outlets. But the truth wouldn't have made for a story as sensationalized and swaggering as the one Traver helped concoct.\n \n \n", 
   {}, 
   426599, 
   null, 
   1301829300.0
  ], 
  [
   426848, 
   null, 
   "zsu2357", 
   "\" Traver and his agents \"provided the reporter with a fully automatic AK-47, with which she was unable to hit the target,\" the NRA reported. \"He then said that stray bullets are 'one of the main problems with having stuff like this available to the gangs.'\"\n\n Watched the video no wonder she couldn't hit anything,think she practiced that?She must of.Granted it's an all powerful weapon,probably stop a battle tank at 50 yds.to.emoticon_rolleyes", 
   {}, 
   426825, 
   null, 
   1301866740.0
  ], 
  [
   427010, 
   null, 
   "Galileo", 
   "John Lott's response:\n \n \" 'Given that Media Matters has no problem using a doctored picture of me (editing the color of my hair, skin, and clothes and distorting my hair) presumably because they presumably believe that it makes me look bad, it is surprising that even people such as Paul Krugman and Brad DeLong never question whether Media Matters will use doctored screen shots of webpages.' \"\n John Lott Keeps on Digging | Media Matters for America\n \n So Lott's trying to suggest that Media Matters doctored the screen shots of his blog. Too bad for Lott that you can look at the google cache of a web page to see what it previously looked like. And what about all those other websites where John Lott was quoted as saying the same thing as what was posted on Media Matters? Did they just happen to misquote him too?", 
   {}, 
   426848, 
   null, 
   1302158280.0
  ], 
  [
   427011, 
   null, 
   "Galileo", 
   "Others besides John Lott have been trying to stir up paranoia about Obama and gun control. It looks like their scare tactics are no longer working:\n \n \"More evidence that people are no longer buying the scare tactics arrived on April 1, when America's largest gun conglomerate, Freedom Group, announced it was cancelling its initial public offering (IPO) amid plummeting sales. Freedom Group includes well established brands such as Remington, Bushmaster, and Marlin...\n \n \"With gun sales declining and President Obama announcing his intention to seek another term, it should come as no surprise that gun lobbyists and their allies have launched another round of factually challenged assaults against the president....\n \n \"Sen. Rand Paul (R-KY) recently sent an email with an updated version of the conspiracy theory that a U.N. Small Arms Treaty will lead to sweeping confiscations of guns. Paul's email reads in part:\n \n \" 'Ultimately, the UN's Small Arms Treaty is designed to register, ban and CONFISCATE firearms owned by private citizens like YOU.'\n \n \"Not to be outdone, the Citizens Committee for the Right to Keep and Bear Arms (CCRKBA) has been pushing an email claiming that Obama is secretly scheming to use executive orders 'To Grab Your Guns!'.... \n \n \"Nowhere in the email is there is any sourcing, and it references no past proposals made by the Obama administration. Nor is there any explanation of how executive orders could be used to bypass the legislative process to achieve far-reaching measures, which according to CCRKBA could go as far as to 'make it illegal to own a gun if you smoke or use tobacco products.' Both scare emails directly solicit donations to support gun lobby efforts.\"\n As Gun Sales Decline, Gun Lobbyists Increase Attacks On Obama | Political Correction", 
   {}, 
   427010, 
   null, 
   1302159540.0
  ], 
  [
   427015, 
   null, 
   "Doc Jones", 
   "Others besides John Lott have been trying to stir up paranoia about Obama and gun control. It looks like their scare tactics are no longer working:\n \n \"More evidence that people are no longer buying the scare tactics arrived on April 1, when America's largest gun conglomerate, Freedom Group, announced it was cancelling its initial public offering (IPO) amid plummeting sales. Freedom Group includes well established brands such as Remington, Bushmaster, and Marlin...\n \n \"With gun sales declining and President Obama announcing his intention to seek another term, it should come as no surprise that gun lobbyists and their allies have launched another round of factually challenged assaults against the president....\n \n \"Sen. Rand Paul (R-KY) recently sent an email with an updated version of the conspiracy theory that a U.N. Small Arms Treaty will lead to sweeping confiscations of guns. Paul's email reads in part:\n \n \" 'Ultimately, the UN's Small Arms Treaty is designed to register, ban and CONFISCATE firearms owned by private citizens like YOU.'\n \n \"Not to be outdone, the Citizens Committee for the Right to Keep and Bear Arms (CCRKBA) has been pushing an email claiming that Obama is secretly scheming to use executive orders 'To Grab Your Guns!'.... \n \n \"Nowhere in the email is there is any sourcing, and it references no past proposals made by the Obama administration. Nor is there any explanation of how executive orders could be used to bypass the legislative process to achieve far-reaching measures, which according to CCRKBA could go as far as to 'make it illegal to own a gun if you smoke or use tobacco products.' Both scare emails directly solicit donations to support gun lobby efforts.\"As Gun Sales Decline, Gun Lobbyists Increase Attacks On Obama | Political Correction\n\n \n The administrations avoidance of a rogue agency, ATF and the promised recess appointment of anti gun, Traver, to avoid Congress and an agency that has already violated our laws and those of a Sovereign Nation, Mexico, doesn't mean anything to you either does it? Or, are you pleading the 5th?\n \n What does the Patriot Act say? Convenient for MM to leave out all the details and enhance their own lies isn't it and have convenient useless ______ to repeat the lies. emoticon_xagree\n \n \n Still using a progressive/commie source to try to convince someone they are not lying...what a HOOT! Firearm and ammo sales are through the roof with more background checks and licenses issued each succeeding month. They don't provide that little proof do they.\n \n Your attempt to slander Prof. John Lott was first claimed by the findings of a paid schill named Arthur Kellerman who did not submit any proof that Kleck was wrong in his findings of 2.5 million lives saved by DGUs. The CDC asked for submission of his findings and found they were unsubstantiated yet you keep pushing lies, unsubstantiated lies. Well, I ain't buying them and you insist on being what you ate...\n \n Your source is funded by a U.N. supporter, convicted felon and rabid anti rights advocate, George Soros, a communist and totalitarian.\n \n Pajamas Media UN Ignores Its Own Data to Promote Gun Ban\n \n PROOF OF YOUR INCOMPETENCE AND FACTS MM CHOOSES TO IGNORE:\n \n Pajamas Media UN Ignores Its Own Data to Promote Gun Ban\n \n Another look at gun research | TheUnion.com\n \n \n\"Alas, it appeared that Professor Gary Kleck's survey findings (that citizen defensive gun use outnumbers criminal gun use) were discredited. Dr. Arthur Kellerman, in a study funded by the Centers for Disease Control and Prevention, concluded that 'guns are three times more likely to kill you than help you.'\"\n \n \"However, he then refused to make his research data available until required by CDC, at which time his conclusions were found to be unsubstantiated.\" ...\n\n \n March sees 15% increase in firearms sales checks over same month last year\n \n\"The March 2011 NSSF-adjusted National Instant Criminal Background Check System (NICS) figure of 990,840 is an increase of 15 percent over the NSSF-adjusted NICS figure of 861,408 in March 2010.\" ...\n \n \"While not a direct correlation to firearms sales, the NSSF-adjusted NICS data provide a more accurate picture of current market conditions. ...\"\n\n \n Senator Grassley: Sipsey Street Irregulars: Sen. Grassley: \"Letting Guns Walk Across the Border Breeds Violence.\" \"A government . . . which acts above the law, undermines the rule of law.\"\n \n Chairman Issa: Issa?s ?Gunrunner? probe will not be deterred by ?ongoing investigation? stall - Seattle gun rights | Examiner.com\n \n Now star gazer the antipodean, you want further proof of your complicity and lies or are you going to keep Tim Lambert's fairy tales alive? A grown man should be accountable for even attempting to demean a civil right of American Citizens. Every lie you tell is going to get stomped unless you can refute the truth without fabrication and mere claims expecting folks to accept \"claims\" as truth with no proof what-so-ever.", 
   {}, 
   427011, 
   null, 
   1302182520.0
  ], 
  [
   427016, 
   null, 
   "Doc Jones", 
   "John Lott's response:\n \n \" 'Given that Media Matters has no problem using a doctored picture of me (editing the color of my hair, skin, and clothes and distorting my hair) presumably because they presumably believe that it makes me look bad, it is surprising that even people such as Paul Krugman and Brad DeLong never question whether Media Matters will use doctored screen shots of webpages.' \"\n John Lott Keeps on Digging | Media Matters for America\n \n So Lott's trying to suggest that Media Matters doctored the screen shots of his blog. Too bad for Lott that you can look at the google cache of a web page to see what it previously looked like. And what about all those other websites where John Lott was quoted as saying the same thing as what was posted on Media Matters? Did they just happen to misquote him too?\n\n \n When was Dr. Lott ever busted, what do you mean by \"busted\" and where is your proof? The lame excuse of using Mary Rosh as a sign in pseudonym is harmless and you copy it well so if that be shady so are you and probably most of the people on the boards.\n \n We can document your supposed \"truth\" in opposition as a complete fabrication and lie on anything you bring up. Give me a LIST of the times Dr. Lott has been \"busted\" and why and how and by whom. You promise to stand behind your claims 100% and profusely apologize for each exposure of the \"bust\" you claim when disproven for the millionth time?\n \n You find trash sites like deltoid and media matters and rabid progressive sites that say what you want, not the truth and quote them as gospel when you will know they are bloviated lies.", 
   {}, 
   427010, 
   null, 
   1302185040.0
  ], 
  [
   427017, 
   null, 
   "Galileo", 
   "When was Dr. Lott ever busted, what do you mean by \"busted\" and where is your proof? The lame excuse of using Mary Rosh as a sign in pseudonym is harmless and you copy it well so if that be shady so are you and probably most of the people on the boards.\n \n We can document your supposed \"truth\" in opposition as a complete fabrication and lie on anything you bring up. Give me a LIST of the times Dr. Lott has been \"busted\" and why and how and by whom. You promise to stand behind your claims 100% and profusely apologize for each exposure of the \"bust\" you claim when disproven for the millionth time?\n \n You find trash sites like deltoid and media matters and rabid progressive sites that say what you want, not the truth and quote them as gospel when you will know they are bloviated lies.\n\n Interestingly, in National Review, a right wing magazine, John Lott is quoted as saying the same thing as what was reported in Media Matters:\n \n \"They have also imposed much more extensive reporting requirements on sales of long guns.\"\n Rounding Up the Guns - Interview - National Review Online\n \n Lott now denies making this claim. He suggests Media Matters doctored the screen shot of his web page in order to put words in his mouth. However, those same words also appear in National Review and are attributed to Lott. Lott deliberately altered a blog post to make it appear that someone was misquoting him.\n \n Even your precious World Nut Daily is above stooping to Lott's level:\n \n \"The most disturbing charge, first raised by retired University of California, Santa Barbara professor Otis Dudley Duncan and pursued by Australian computer programmer Tim Lambert, is that Lott fabricated a study claiming that 98 percent of defensive gun uses involved mere brandishing, as opposed to shooting....\n \n \"By itself, there is nothing wrong with using a pseudonym. But Lott's invention of Mary Rosh to praise his own research and blast other scholars is beyond creepy. And it shows his extensive willingness to deceive to protect and promote his work....\n \n \"But it wasn't an anti-gun zealot who unmasked Rosh/Lott. It was Internet blogger Julian Sanchez, a staffer at the libertarian Cato Institute, which staunchly defends the Second Amendment. And it was the conservative Washington Times that first reported last week on the survey dispute in the mainstream press.\"\n http://www.wnd.com/news/article.asp?ARTICLE_ID=30873", 
   {}, 
   427016, 
   null, 
   1302188040.0
  ], 
  [
   427018, 
   null, 
   "Doc Jones", 
   "Interestingly, in National Review, a right wing magazine, John Lott is quoted as saying the same thing as what was reported in Media Matters:\n \n \"They have also imposed much more extensive reporting requirements on sales of long guns.\"\n Rounding Up the Guns - Interview - National Review Online\n \n Lott now denies making this claim. He suggests Media Matters doctored the screen shot of his web page in order to put words in his mouth. However, those same words also appear in National Review and are attributed to Lott. Lott deliberately altered a blog post to make it appear that someone was misquoting him.\n\n \n Nice attempt at avoidance. The FACT that ATF was proposing more extensive and extringent gun laws is a fact...until they got caught smuggling guns to drug cartels, a federal offense; an act of war by a federal Agency.\n \n Here is a brief rundown and smackdown of your incoherent ramblings Lambert:\n \n This is just the beginning of an ongoing full blown criminal case and investigation with realeases under the FOIA:\n \n Why No One Should Ever Trust the ATF: There Is No Iron River | The Truth About Guns\n \"... \n\"The ATF promoted and exploited the idea, lining up in front of Congress, begging bowl in hand, singing Take Me to the River. And they scored. Four new field offices! Dozens of new agents! After spending decades in stasis, watching the FBI double in size and whole new federal law enforcement agencies arise from the ashes of 911, Uncle Sam wrote a check to the ATF. The deeply unloved agency finally had its day in the sun.\"\n \n \"Only Project Gunrunner was built on a lie.\" \n...\"\n \n Sipsey Street Irregulars: An ATF agent's indictment. \"ATF DIDN'T make every effort to 'interdict' these guns or they WOULD HAVE been interdicted.\"\n \"... \n\"We (the field) have formally, officially and sometimes unofficially attempted to encourage Director Melson, DD Hoover and their predecessors to restore the integrity of the agency. We have asked them to demand leadership from our executives, and to control and reign in Chief Counsels Office and corrupt and unethical practices. So here we are. Mr. Melson can no longer pretend to be in charge or have ANY say so in our Agency's future. Mr. Traver sits silent as if he has NO IDEA any of this is going on. So what happens? EXACTLY what is supposed to happen, Congressional oversight.\" \n...\"\n \n &#039;Suspect Person&#039;: Another reason to fight mulitple rifle reporting requirement - St. Louis gun rights | Examiner.com\n \n\"\"ATF plans for rifle buyers if you buy more than one. You end up on a criminal investigation database, the impact of which is not publicly known. Once you land on the 'Suspect Person Database' how do you get off of it? This list can be shared with foreign governments among other 'special people'.\" ...\"\n\n \n You have seen this numerous times and are intentionally obtuse or born that way so which is it?\n \n BULLETIN: Bellevue group calls for Senate investigation of ATF controversy - Seattle gun rights | Examiner.com\n \n CCRKBA Calls for Senate Investigations of ATF - National gun rights | Examiner.com\n \n Phoenix television reporter conducts exclusive interview with Terry stepmother - National gun rights | Examiner.com\n ... \"Referencing the letter from Sen. Charles Grassley to Attorney General Eric Holder obtained and posted in Wednesday's Gun Rights Examiner column, the story presents a report by New 3 Tonight's Stacey Delikat (see sidebar video player), who obtained an exclusive telephone interview with Carolyn Terry, the slain agent's stepmother.\" ...", 
   {
    "unicode_changes_made": true
   }, 
   427017, 
   null, 
   1302189180.0
  ], 
  [
   427020, 
   null, 
   "Doc Jones", 
   "Interestingly, in National Review, a right wing magazine, John Lott is quoted as saying the same thing as what was reported in Media Matters:\n \n \"They have also imposed much more extensive reporting requirements on sales of long guns.\"\n Rounding Up the Guns - Interview - National Review Online\n \n Lott now denies making this claim. He suggests Media Matters doctored the screen shot of his web page in order to put words in his mouth. However, those same words also appear in National Review and are attributed to Lott. Lott deliberately altered a blog post to make it appear that someone was misquoting him.\n \n Even your precious World Nut Daily is above stooping to Lott's level:\n \n \"The most disturbing charge, first raised by retired University of California, Santa Barbara professor Otis Dudley Duncan and pursued by Australian computer programmer Tim Lambert, is that Lott fabricated a study claiming that 98 percent of defensive gun uses involved mere brandishing, as opposed to shooting....\n \n \"By itself, there is nothing wrong with using a pseudonym. But Lott's invention of Mary Rosh to praise his own research and blast other scholars is beyond creepy. And it shows his extensive willingness to deceive to protect and promote his work....\n \n \"But it wasn't an anti-gun zealot who unmasked Rosh/Lott. It was Internet blogger Julian Sanchez, a staffer at the libertarian Cato Institute, which staunchly defends the Second Amendment. And it was the conservative Washington Times that first reported last week on the survey dispute in the mainstream press.\"\n The other Lott controversy\n\n \n Sour grapes over the exposure of Bellesiles in an outright fabricated lie and purloined Bancroft Prize that was returned.\n \n Lott reproduced the studies in \"every county in the United States\" and followed up and wrote the book MORE GUNS = LESS CRIME which has not been disproven and has been borne out by history through the restoration of our civil rights.\n Every totalitarian you hob knob with is opposed to our Constitution and Civil Rights. Lott has been justified and I put links to Michelle Malkin where she allowed that her first impression was a bit premature.\n \n Now, how about that list? Where is it and what are the allegations? If you don't have it say so and admit to your ambiguity and mistatements.", 
   {}, 
   427017, 
   null, 
   1302191400.0
  ], 
  [
   427021, 
   null, 
   "Doc Jones", 
   "In The Issue\n \n \n For example, in February 1989, a former BATF employee who had become a paid consultant for Handgun Control testified to Congress that \"assault weapons\" were rarely used in crimes. (He wanted to ban them anyway, as a precautionary measure.) Nevertheless, within weeks, Handgun Control was running an advertising campaign insisting that assault weapons were the criminal weapons of choice. \n The most dangerous dishonesty concerns the ultimate intentions of the antigun forces. Handgun Control claims that it merely wants to \"keep guns out of the wrong hands\"; yet in 1999, it lobbied hard to preserve Washington, D.C.'s outright ban on handguns. Back in 1976, the group's then leader, Pete Shields, explained the long-term strategy to The New Yorker: \"The first problem is to slow down the number of handguns being produced and sold in this country. The second problem is to get handguns registered. The final problem is to make possession of all handguns and all handgun ammunition-except for the military, police, licensed security guards, licensed sporting clubs, and licensed gun collectors-totally illegal.\" \n Sarah Brady, the current chairwoman of Handgun Control, has said that people should not be allowed to own guns for self-defense. Yet in debates, employees of the group steadfastly deny that the organization believes in the policies articulated by its leaders. In short, they are lying about what they want to accomplish. This is understandable, to be sure; but not honorable, or right for the country. \n \n \n", 
   {
    "post_info": {
     "post_title": "An ocean of gun grabber lies:"
    }, 
    "unicode_changes_made": true
   }, 
   427020, 
   null, 
   1302191880.0
  ], 
  [
   427023, 
   null, 
   "sinjin", 
   "UPDATE: Remington's Parent, Freedom Group, Pulls IPO Plans - WSJ.com\n \n Eric Wold of Merriman Capital, who covers firearms firms Smith & Wesson (SWB) and Sturm, Ruger (RGR) noted that \"the fastest growing part of the industry is handguns\" and that Freedom \"has none of it.\" ", 
   {}, 
   427021, 
   null, 
   1302196260.0
  ], 
  [
   427039, 
   null, 
   "Doc Jones", 
   "Actually it was Ceberus with a 2 million dollar joke offer which they couldn't even get a smell of the ammo plant with that kind of cash.\n \n As I recall, the gun industry didn't seek nor need \"bailouts\" which puts another poor lie to rest.\n \n We have some imaginative people here and we call 'em anti Constitutionalists and gun grabbers. emoticon_xagree", 
   {}, 
   427023, 
   null, 
   1302209040.0
  ], 
  [
   427385, 
   null, 
   "Doc Jones", 
   "star gazer, you know full well that VPC doesn't have any members and the brady bunch doesn't have any either. They are fighting by any means to maintain a speck of relevance and like the ATF the only weapon they have is lies to back up lies. Once you tell the first one you are done. They are all DONE and you lost your fork. ha ha ha ha ha emoticon_xgood\n \n \n \n Time running out to comment on BATFE &#039;shotgun importability study&#039; - St. Louis gun rights | Examiner.com\n \n ... \"Remember that what the BATFE is seeking here is not a change in the law--they're claiming the power to dramatically limit which shotguns are importable, simply through administrative fiat. Still, they are generously (that's sarcasm, for anyone who missed it) seeking comments from the public, before any policy changes are made. GunLeaders.com points out that the comment period is almost over:\" ... then, there is still that big matter about returning almost a million garands and carbines on loan to S. Korea following the hostilities of the Korean War.\n *No POWER OF CONGRESS!! Since when did a rogue .org get the power to make law or rules other than for their own hired help? This goes for the president/administration also.\n \n No Lawyers - Only Guns and Money: I Am Shocked!!!!\n *VPC DOESN'T HAVE ANY MEMBERS :)I bet the brady bunch doesn't either except for a few whacho anti gun hoplophobes and MAIG members which I doubt belong to the brady bunch anyway.\n \n \"The Violence Policy Center just released a new report today condemning the National Rifle Association for accepting donations from those in the gun industry. ...\" ...\n \n \"I guess when you don't have dues paying members and subsist on handouts from the Joyce Foundation ($4.635 million since 2003), you tend to ignore the financial impact of dues paying members. According to VPC's 2009 IRS Form 990, they had no members and a reported $924,927 in revenue. $585,000 of their 2009 revenue came from the Joyce Foundation. If I were the Joyce Foundation, I'd start to question if I was getting my money's worth.\" ...", 
   {}, 
   427039, 
   null, 
   1302796800.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  John Lott Busted Again?", 
  "url": "http://www.4forums.com/political/gun-control-debates/15223-john-lott-busted-again.html", 
  "breadcrumbs": [
   "Gun Control"
  ], 
  "id_number": 15223, 
  "discussion_files": [
   [
    "14270.html", 
    "http://www.4forums.com/political/gun-control-debates/15223-john-lott-busted-again-print.html"
   ], 
   [
    "14271.html", 
    "http://www.4forums.com/political/gun-control-debates/15223-john-lott-busted-again-2-print.html"
   ]
  ], 
  "identifier": 15223
 }
]