[
 [
  [
   427052, 
   null, 
   "Accipiter", 
   "Glenn Beck Leaving Fox: What Went Wrong\n \n \n emoticon_xbye", 
   {
    "post_info": {
     "post_title": "Glenn Beck Leaving Fox: What Went Wrong"
    }
   }, 
   null, 
   null, 
   1302217140.0
  ], 
  [
   427057, 
   null, 
   "sinjin", 
   "Turns out we're a coffee drinking nation. We tire of tea.:p", 
   {}, 
   427052, 
   null, 
   1302222360.0
  ], 
  [
   427067, 
   null, 
   "Accipiter", 
   "Turns out we're a coffee drinking nation. We tire of tea.:p\n\n \n God I hope so!", 
   {}, 
   427057, 
   null, 
   1302237960.0
  ], 
  [
   427075, 
   null, 
   "pappillion001", 
   "Glenn Beck Leaving Fox: What Went Wrong\n \n \n emoticon_xbye\n\n \n Na Na Na Na Na Na Na Na Hey Hey Goood Bye", 
   {}, 
   427052, 
   null, 
   1302252120.0
  ], 
  [
   427097, 
   null, 
   "trebor", 
   "Na Na Na Na Na Na Na Na Hey Hey Goood Bye\n\n \n There will be someone else to take his place. Just as Palin is fading, and Bachmann is trying to take her place.", 
   {}, 
   427075, 
   null, 
   1302281700.0
  ], 
  [
   427101, 
   null, 
   "Steeeeve", 
   "First off, why is this in the religion forum? \n \n Secondly, it is probably for the same reason Rush Limbaugh doesn't have a TV show. The format just doesn't convert over well. Oddly enough the ratings were still ridiculously high for that time slot.", 
   {}, 
   427097, 
   null, 
   1302287280.0
  ], 
  [
   427102, 
   null, 
   "Steeeeve", 
   "God I hope so!\n\n \n Keep hoping...\n \n 48% Say Their Views Closer to Tea Party Than Congress - Rasmussen Reports", 
   {}, 
   427067, 
   null, 
   1302287340.0
  ], 
  [
   427111, 
   null, 
   "Accipiter", 
   "First off, why is this in the religion forum?\n\n \n Because nobody ever looks at anything anywhere outside of the religion forum.", 
   {}, 
   427101, 
   null, 
   1302303540.0
  ], 
  [
   427118, 
   null, 
   "MrWriteLA", 
   "Because nobody ever looks at anything anywhere outside of the religion forum.\nExcept for the Gay Rights forum, which has become the Religion Forum 102, because there are no arguments against Gay Rights other than Bronze Age Mistranslated Mythological Literature... which in this day and age of scientific knowledge is beyond ridiculous, but because of the very technology resulting from said scientific knowledge is able to spread its centuries old, oft-refuted BS indiscrimitely around the world and be believed by any XXXXX who can fork out a few hundred bucks for access to \"the cloud.\"", 
   {}, 
   427111, 
   null, 
   1302312960.0
  ], 
  [
   427119, 
   null, 
   "pappillion001", 
   "First off, why is this in the religion forum? \n \n Secondly, it is probably for the same reason Rush Limbaugh doesn't have a TV show. The format just doesn't convert over well. Oddly enough the ratings were still ridiculously high for that time slot.\n\n \n He converts just fine. His ratings show that people watchThe problem is the people who watch him. His viewers don't fit the demographics of many advertisers and the ones that are willing to spend money on his show don't have deep pockets. He caters to those who will believe the just plain dumb ideas he pushes.", 
   {}, 
   427101, 
   null, 
   1302314220.0
  ], 
  [
   427128, 
   null, 
   "Easyrider", 
   "Except for the Gay Rights forum, which has become the Religion Forum 102, because there are no arguments against Gay Rights other than Bronze Age Mistranslated Mythological Literature... \n\n \n <Flush<\n \n Considering your morality is from the bath houses of Sodom and Gomorrah, you have no room to speak.\n \n And Glenn Beck will be around for a long time. You can count on it.", 
   {}, 
   427118, 
   null, 
   1302359520.0
  ], 
  [
   427129, 
   null, 
   "Accipiter", 
   "And Glenn Beck will be around for a long time. You can count on it.\n\n \n You don't get it sleazy, Glenn Beck was cut because he was making conservatives look even stupider than they already are.\n \n By the way, did you know Glenn Beck is a Mormon, how do you feel about that?", 
   {}, 
   427128, 
   null, 
   1302362220.0
  ], 
  [
   427130, 
   null, 
   "Steeeeve", 
   "Because nobody ever looks at anything anywhere outside of the religion forum.\n\n \n Ha, and the gay rights forum. Sadly, this is true.", 
   {}, 
   427111, 
   null, 
   1302363240.0
  ], 
  [
   427131, 
   null, 
   "Steeeeve", 
   "He converts just fine. His ratings show that people watchThe problem is the people who watch him. His viewers don't fit the demographics of many advertisers and the ones that are willing to spend money on his show don't have deep pockets. He caters to those who will believe the just plain dumb ideas he pushes.\n\n \n You realize he pushes some of the same ideas I've seen you push, right? I'm going to go out on a limb here and say you've probably never actually taken the time to know the views of the man you are insulting. Instead you've seen about a thousand Media Matters clips and presumably you know the man. \n \n Nevertheless, I doubt advertising had anything to do with it. You aren't going to get more dollars in that time slot by lowering your ratings 75%. Take this for example: http://tvbythenumbers.zap2it.com/2011/04/07/cable-news-ratings-for-wednesday-april-6-2011/88659\n In the key demo Beck still did better than everybody else combined. Fox News wont' do much better. \n \n Therefore, I'm fairly confident it had more to do with either Beck not getting along with Fox News or the format just not fitting Fox News. \n \n Either way, not a big loss to me, the show was awful. Some people just aren't made for TV.", 
   {}, 
   427119, 
   null, 
   1302364140.0
  ], 
  [
   427132, 
   null, 
   "Steeeeve", 
   "Except for the Gay Rights forum, which has become the Religion Forum 102, because there are no arguments against Gay Rights other than Bronze Age Mistranslated Mythological Literature... which in this day and age of scientific knowledge is beyond ridiculous, but because of the very technology resulting from said scientific knowledge is able to spread its centuries old, oft-refuted BS indiscrimitely around the world and be believed by any XXXXX who can fork out a few hundred bucks for access to \"the cloud.\"\n\n \n I bet you're popular at work emoticon_rolleyes", 
   {}, 
   427118, 
   null, 
   1302364200.0
  ], 
  [
   427133, 
   null, 
   "pappillion001", 
   "You realize he pushes some of the same ideas I've seen you push, right? \n \n \n I have never claimed to be the source of every brilliant idea known to man, although I would not be surprised to learn this is so :p \n \n I think my extremes tend to balance out. Meaning I will most likely find common ground with either side of an argument, but in the end the only thing on the middle of the road is the divider so a side must be taken.\n \n \nI'm going to go out on a limb here and say you've probably never actually taken the time to know the views of the man you are insulting. Instead you've seen about a thousand Media Matters clips and presumably you know the man. \n \n \n High risk low yield. I can honestly say I have never intentionaly read or seen anything from Media Matters that I can recall. I will admit to getting some of my opinion from a South Park episode \"Dances with Smurfs\" which I found to be very amusing. \n \n I don't like Glenn Beck because like a number of right wing talk show hosts (the left has them also and I don't like them either) are instigators out to drum up ratings and ad dollars. I am living through the decline of the western empire and just shake my head in disbelief at some of the ridiculous positions and cherry picking of issues that some of these people take.\n \n Also as a source \n \n Glenn Beck Cost Fox Millions and Lost Half His Audience, but News Corp. Stands Behind Him | BNET\n \n Glenn Beck's Fox Run Suffered More for Ads than Ratings | MediaWorks - Advertising Age\n \n \n \nNevertheless, I doubt advertising had anything to do with it. You aren't going to get more dollars in that time slot by lowering your ratings 75%. Take this for example: http://tvbythenumbers.zap2it.com/2011/04/07/cable-news-ratings-for-wednesday-april-6-2011/88659\n In the key demo Beck still did better than everybody else combined. Fox News wont' do much better.\n \n \n Ad people say differently. His ratings are good no question even though they appear to be sliding. The problem is the quality of advertisers. His ratings are not generating the interest in advertisers that is expected. Part of that has to do with a boycott but most is going to be his audience is not the demographic fortune 500 advertisers are willing to spend that kind of money on. Even Howard Stern is succesful despite his shock jock antics because of his audience. Advertisers will endur almost anything to be exposed to their target market, but not with Beck.\n \n \n \nTherefore, I'm fairly confident it had more to do with either Beck not getting along with Fox News or the format just not fitting Fox News. \n \n Either way, not a big loss to me, the show was awful. Some people just aren't made for TV.\n\n \n I am sure if the show was making 100 million a year Fox would have found a way to make it fit.", 
   {}, 
   427131, 
   null, 
   1302368460.0
  ], 
  [
   427139, 
   null, 
   "Steeeeve", 
   "I don't like Glenn Beck because like a number of right wing talk show hosts (the left has them also and I don't like them either) are instigators out to drum up ratings and ad dollars.\nSo your problem with Glenn Beck is that he has opinions and shares them with other people AND found a way to do that for a living? \n \n \nAd people say differently.\nNo they don't. Your only source is two groups that already hates Beck (Color of Change and Media Matters). Even then they just say advertisers have boycotted him in the past. I watch CNN and Fox News during that time slot if I'm home from work and the advertisers aren't much different in terms of big name people. \n \n Believe it or not, Advertisers are not going around being moral arbiters. They go where the people are. If a show is going to help or hurt is all that matters to companies when placing an ad. If they felt Beck was bad they would have surely pulled from Hannity and Oreilly. Seeing as no one did that it's probably a safe bet that ad revenue for a show with 4 times the ratings as all other shows was the reason. \n \n \nAdvertisers will endur almost anything to be exposed to their target market, but not with Beck.\nNo, they endur everything. \n \n \nI am sure if the show was making 100 million a year Fox would have found a way to make it fit.\nOr, maybe they did and no one got along..kinda like Olbermann and MSNBC.", 
   {}, 
   427133, 
   null, 
   1302379080.0
  ], 
  [
   427144, 
   null, 
   "Easyrider", 
   "You don't get it sleazy...\n\n \n Listen, carp breath, you haven't risen to a level yet that you can look down on others.\n \n \nGlenn Beck was cut because he was making conservatives look even stupider than they already are.\n\n \n Is stupider even a legitimate word? Sounds like something a 3rd grade drop out would use.\n \n \nBy the way, did you know Glenn Beck is a Mormon, how do you feel about that?\n\n \n I don't give a rat's behind. That said, even Mormons are brighter than liberals. You turkeys whine about cutting $30 billion when the deficit this year is $1.5 trillion. Yeah, at that rate you'll really do wonders.", 
   {}, 
   427129, 
   null, 
   1302388320.0
  ], 
  [
   427148, 
   null, 
   "Accipiter", 
   "Listen, carp breath, you haven't risen to a level yet that you can look down on others.\n \n \n \n Is stupider even a legitimate word? Sounds like something a 3rd grade drop out would use.\n \n \n \n I don't give a rat's behind. That said, even Mormons are brighter than liberals. You turkeys whine about cutting $30 billion when the deficit this year is $1.5 trillion. Yeah, at that rate you'll really do wonders.\n\n \n Don't you ever get tired of being on the defense?", 
   {}, 
   427144, 
   null, 
   1302406140.0
  ], 
  [
   427149, 
   null, 
   "jitobear", 
   "Don't you ever get tired of being on the defense?\n\n \n No kidding! I could say that I drink chai in the morning and love the color blue and he would come tell me I am going to hell for it.", 
   {}, 
   427148, 
   null, 
   1302410460.0
  ], 
  [
   427150, 
   null, 
   "jitobear", 
   "There will be someone else to take his place. Just as Palin is fading, and Bachmann is trying to take her place.\n\n \n Which is frightening since Bachmann makes Palin look bloody brilliant. Seriously, I am a Minnesotan and have been watching that woman put her foot in it for the better part of a decade.", 
   {}, 
   427097, 
   null, 
   1302410580.0
  ], 
  [
   427153, 
   null, 
   "pappillion001", 
   "So your problem with Glenn Beck is that he has opinions and shares them with other people AND found a way to do that for a living? \n \n \n No my problem with Glenn Beck is that he misrepresents facts purposely for personal gain and has managed to get himself into a position of influence that amplifies the damage he causes. I don't expect him to promote solutions, but don't think I will be wishing him well when he does nothing but keep problems alive.\n \n How you came to the conclusion you did about what I said makes me wonder are you reading what you want to or what I wrote?\n \n \n \nNo they don't. Your only source is two groups that already hates Beck (Color of Change and Media Matters). \n \n \n No two sources I provided used statistical information from those two along with other groups and their own research. There are related stories that give similiar versions without relying on either of those two groups. Would that make any difference for you?\n \n Let'[s be clear niether one of the links I provided were the two organizations you stated nor are the affiliated with them in any way (at least as far as I know) One belongs to CBS and the other a magazine for the Ad industry. \n \n \n Whats to love about the guy? \n \n You on the other hand keep on about ratings, I agreed he has them. He also has lost a number of them and who have not returned\n \n These are just the headlines from the related stories from bNet a b2b magazine who as far as I know still don't hate Glenn Beck\n \n \n 57 Advertisers Now Boycotting Fox&#8217;s Beck; Egg Genie Stands By Its Man | BNET\n \n Geico, Others Join Ad Boycott of Fox&#8217;s Beck Over &#8220;Obama Is Racist&#8221; Remarks | BNET\n \n UPDATED: Glenn Beck&#8217;s Current Advertisers: Extenze and the &#8220;Egg Genie&#8221; | BNET\n \n UPDATED: Fox Runs House Ads to Fill Empty Slots in Glenn Beck Boycott | BNET\n \n \n Conagra, Roche, Sanofi and RadioShack Pull Ads From Fox&#8217;s Beck | BNET\n \n P&#038;G, Progressive Pull Ads From Glenn Beck&#8217;s Fox Show After &#8220;Obama Is Racist&#8221; Remarks | BNET\n \n There were a couple more but I think the point is made. \n \n \nEven then they just say advertisers have boycotted him in the past. I watch CNN and Fox News during that time slot if I'm home from work and the advertisers aren't much different in terms of big name people. \n \n \n Where you watching to see who ran ads on Becks show or are you relying on being able to remember what commercials ran on what shows over a period of time? \n \n \n \nBelieve it or not, Advertisers are not going around being moral arbiters. \n \n \n Never said they were, but when somebody is not viewed well they pull away. That is the whole purpose of their ads. To be associated with a liked person and when that person is not liked they run away until that person is liked again. \n \n \nThey go where the people are. If a show is going to help or hurt is all that matters to companies when placing an ad. If they felt Beck was bad they would have surely pulled from Hannity and Oreilly. Seeing as no one did that it's probably a safe bet that ad revenue for a show with 4 times the ratings as all other shows was the reason.\n \n \n Hannity and O'Reilly don't do the stupid things Beck did. Which is why advertisers don't pull from them\n \n \nNo, they endur everything.\n \n \n Tell that to Tiger Woods. If he gets his act together I am sure he could pull them back, but ad people only like controversy when it can be beneficial to the product. Making a fool of himself while trying to be serious doesn't leave the impression on maleable minds like they would like.\n \n \nOr, maybe they did and no one got along..kinda like Olbermann and MSNBC.\n\n \n He was the left's version just with lower ratings. From what I have read Fox isn't trashing Beck but isn't sugar coating and making it sound like he will be missed.", 
   {}, 
   427139, 
   null, 
   1302420540.0
  ], 
  [
   427172, 
   null, 
   "Steeeeve", 
   "No my problem with Glenn Beck is that he misrepresents facts purposely for personal gain and has managed to get himself into a position of influence that amplifies the damage he causes. I don't expect him to promote solutions, but don't think I will be wishing him well when he does nothing but keep problems alive.\n \n How you came to the conclusion you did about what I said makes me wonder are you reading what you want to or what I wrote?\nYou ever stop and think maybe those are his opinions? Maybe he sees those things as the truth? Some people do purposely lie. To date, I haven't seen a quote from Glenn Beck where he says \"yeah, I know this is false but I'm going to tell it anyway\". I'm sure if we heard you speak 4 hours a day for a decade we'd have people thinking you were \"purposely misrepresenting facts\". \n \n \nNo two sources I provided used statistical information from those two along with other groups and their own research. There are related stories that give similiar versions without relying on either of those two groups. Would that make any difference for you?\nIf there is a story from someone related to the show that said \"yeah, the money thing just wasn't working out\" than I'd believe it. Otherwise, I'm not dumb enough to believe the third most watched cable news program wasn't making money.\n \n \nLet'[s be clear niether one of the links I provided were the two organizations you stated nor are the affiliated with them in any way (at least as far as I know) One belongs to CBS and the other a magazine for the Ad industry. \nMakes you question them doesn't it. BOTH used a source that is known to be biased. Media Matters literally has a team devoted to destroying Glenn Beck. \n \n I'm not going to sit here and say your theory is impossible but given the two theories we have, both of which have no evidence, I'll take the more logical one. \n \n \nThese are just the headlines from the related stories from bNet a b2b magazine who as far as I know still don't hate Glenn Beck\nFrom 2009...\n \n We can post articles all day long. Here is one:\n \n SO WHAT'S THE <I<REAL</I< REASON GLENN BECK & FOX ARE<br< GETTING A DIVORCE? | FEATURE NEWS | Sky Valley Chronicle Washington State News\n \n \nThere were a couple more but I think the point is made. \nThat you have nothing.", 
   {
    "unicode_changes_made": true
   }, 
   427153, 
   null, 
   1302456780.0
  ], 
  [
   427218, 
   null, 
   "pappillion001", 
   "You ever stop and think maybe those are his opinions?\n\n \n I am pretty sure most of them are. That makes them no more true than if they were someone else's. \n \n \nMaybe he sees those things as the truth?\n \n \n Or maybe he doesn't. \n \n \nSome people do purposely lie.\n \n \n We all do at some point. Some people try not to, some make a living by doing it.\n \n \nTo date, I haven't seen a quote from Glenn Beck where he says \"yeah, I know this is false but I'm going to tell it anyway\"\n. \n \n \n Here is a link to a few misrepresentations\n \n RAINY DAY THINGS: Glenn Beck Lies\n \n Barbara Walters gets him here where he says he isn't any type of reporter and first says he doesn't check facts and then wouldn'tr answer.\n \n \n On The View Glenn Beck Admits that He Doesn?t Check Facts\n \n This all because he was lying about a meeting which he admits and then the next day is screaming to listeners that no he didn't.\n \n I think it ironic that he lied about something kind of meaningless, but happened to involve Washington of the I can not tell a lie story (which I know isn't true) Just look up washington ralley lie. His respnse was what made it so bad. He just thought it would be easier.\n \n \n \nI'm sure if we heard you speak 4 hours a day for a decade we'd have people thinking you were \"purposely misrepresenting facts\". \n\n \n Hey thanks, nice assumption. Problem is other than being wrong my impact isn't what his is and even if it were true since I do it he can to?\n \n \nIf there is a story from someone related to the show that said \"yeah, the money thing just wasn't working out\" than I'd believe it. Otherwise, I'm not dumb enough to believe the third most watched cable news program wasn't making money.\n\n \n Your smart enough to only accept proof from the place least likely to acknowledge it. Could the possibility exist that maybe some of this stuff is not just a liberal conspiracy to take down a conservative hero. \n \n \nMakes you question them doesn't it. BOTH used a source that is known to be biased. Media Matters literally has a team devoted to destroying Glenn Beck. \n\n \n Which would put them in a great position to have information about him that many would not. If he wasn't doing stupid things what could they do? Sure I might take a harder look, but I wouldn't dismiss it simply because it comes from a credible source who has an ax to grind with Beck.\n \n \n \nI'm not going to sit here and say your theory is impossible but given the two theories we have, both of which have no evidence, I'll take the more logical one. \n\n \n First no one is saying his show has no sold ad time, no one is saying it doesn't have high ratings (although they are declining) What is being said is top tier advertisers are not buying time on his show and that Fox is putting non revenue generating ads as well as not being able to sell space at the level they think he should get based on ratings.\n \n Your theory is nothing but what is causing his problems. They just took the details of mine and then that is why. He says dumb irrational things which turns off advertisers. He hasn't learned to keep his mouth shut so they are not willing to come back. Fox is unable to get him to behave so after waiting to see if ads will come back they have not, but Beck scores well in his ratings so they try and keep him around just in case.\n \n \n \nFrom 2009...\n Yep. No how many that left have come back? \n \n \nWe can post articles all day long. Here is one:\n \n SO WHAT'S THE <I<REAL</I< REASON GLENN BECK & FOX ARE<br< GETTING A DIVORCE? | FEATURE NEWS | Sky Valley Chronicle Washington State News\n\n \n How about AOL and Tivo or are they out to get Beck to?\n \n Will a Lack of A-List Advertisers Kill the 'Glenn Beck' Show? - DailyFinance\n \n \nThat you have nothing.\n Funny my nothing seems to have a lot more than your nothing.", 
   {
    "unicode_changes_made": true
   }, 
   427172, 
   null, 
   1302534000.0
  ]
 ], 
 {}, 
 {
  "title": "4Forums.com Political Debates and Polls -  Glenn Beck Leaving Fox: What Went Wrong", 
  "url": "http://www.4forums.com/political/religion-debates/15253-glenn-beck-leaving-fox-what-went-wrong.html", 
  "breadcrumbs": [
   "Religion"
  ], 
  "id_number": 15253, 
  "discussion_files": [
   [
    "3176.html", 
    "http://www.4forums.com/political/religion-debates/15253-glenn-beck-leaving-fox-what-went-wrong-print.html"
   ], 
   [
    "3177.html", 
    "http://www.4forums.com/political/religion-debates/15253-glenn-beck-leaving-fox-what-went-wrong-2-print.html"
   ]
  ], 
  "identifier": 15253
 }
]